{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Mark Cole", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "RePBKvomh2kGhIHGM1bIva2XEMU=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  What in the World Do They Want, Anyway? The Myth of the Friendly Alien  It was one of those typical open line nights on Art Bell’s late night radio show, the talk drifting easily between the serious, the bizarre and the ludicrous. Somehow—perhaps the recent release of both Independence Day and Mars Attacks! started it—it settled into a discussion of how the movies have portrayed aliens. Why did so many films feature alien invasions one caller wondered, and so few peaceful aliens? Why weren’t there more SF films like The Day the Earth Stood Still? He argued that it took a lot more imagination to come up with a convincing reason for a friendly visit.  Perhaps. But wasn’t that far too simple an answer?  And was Klaatu’s mission really all that peaceful?  This is a very familiar problem, one that many SF authors have tried to wrestle into submission. When we think of contact with other intelligent beings, we most often envision alien invasions of one sort or another—unless they are outnumbered by all those stories of UFO abductions. However, they hardly count as they are more mythic than SF (and who knows what the Grays’ real motives are, anyway?).  Even when aliens aren’t invading, they usually are up to no good, whether they’re harvesting us (Nigel Kneale’s ITV serial Quatermass, the Twilight Zone episode “To Serve Man”); or using our bodies for transplants (Gerry Anderson’s series UFO); or collecting our blood (Not of This Earth); or stealing our endorphins for recreational drugs (I Come in Peace, Liquid Sky, Children of Earth); or using us in their experiments (Dark City, The Forgotten); or stealing our women (Mars Needs Women); or hunting us for sport; or using us as pawns in their galactic politics (as Kirk and the Klingons do to an undeveloped alien planet in “A Private Little War”); or expecting us to worship them (Stargate); or just dropping by to annoy the hell out of us (as in Fredric Brown’s classic novel, Martians Go Home).  Even something as innocuous as trying to understand love can get perverted into something terrible in the hands of an alien who thinks it will give her a military advantage (Ole Bornedal’s “scary movie for children,” The Substitute).  Nor is it always obvious whether the aliens have come in peace or not. The Village of the Damned (1960) and its sequel The Children of the Damned (1963) demonstrate how little difference there can be. The situation is nearly identical: an unseen alien presence has impregnated women around the world, and these children have extraordinary mental powers. However, in the first film, they are terrifying, very alien, and destroy anyone who they think is trying to harm them. We learn nothing of their intentions, or why they’ve come. While they have murdered quite a few people, they have done so to defend themselves, although with a total, unrestrained ruthlessness. Clearly, whether they are hostile or not, they are a terrible threat—and not just to those around them but to the whole world.  In the sequel, however, the children seem more like ordinary children (and, it’s interesting to note, they no longer look alike). While they are still feared and the government still tries to destroy them, they decide in the end not to kill those who intend to harm them, even though it costs them their lives. Ultimately, those who plot to use them as weapons seem far more dangerous.  It would be easy to blame H.G. Wells. After all, while it wasn’t quite the first alien invasion story (earlier ones include J.-H. Rosny’s 1887 short story Les Xipéhuz and Robert Potter’s The Germ Growers (1892)), The War of the Worlds painted a stunning vision of an England devastated by a rampaging alien army. However, Wells had borrowed his basic concept from the wave of invasion novels that followed in the wake of the stunning German victory in the Franco-Prussian war. The Germans had shocked the world by smashing the largest army in Europe in a mere two months, thanks to an array of new technologies, including breech loading cannon and steam trains. Within the year The Battle of Dorking burst into publication, shocking England with a vision of a successful invasion. Some four hundred similar novels followed before the beginning of World War I.  Ironically, it was not the fear of the alien, of things different from us, the fear that is so often blamed for such portrayals of alien beings, that inspired Wells, but a very real fear of real enemies, and of the danger posed by advanced technology in the hands of such an enemy.  It was a similar fear—although of an even more devastating weapon, in the hands of an even more dangerous enemy—that haunted the golden age of SF cinema. While the Fifties began hopefully, with tales of journeys to other planets, darker, more paranoid efforts soon followed. Ultimately, in Quatermass 2 and The Invasion of the Bodysnatchers (and even such schlock as The Invisible Invaders), we are taken over and become the invaders ourselves.  But, as strange as it may seem, the bomb seems to have brought almost as many peaceful aliens, bent on saving us from our own folly in such films as Stranger from Venus, The Cosmic Man, The Twenty-Seventh Day, and The Cosmic Monsters. Or perhaps it wasn’t that strange as most of them were retreads of The Day the Earth Stood Still.  The problem is that, on closer examination, the alien visitors in The Day the Earth Stood Still aren’t all that peaceful. Klaatu does not offer us peace, but a warning (one might even be tempted to call it a threat). His race created robot peacekeepers which are completely independent of their control, and which vaporize anyone who poses even the slightest threat to their “peace.” We have a temporary respite, but if we continue using nuclear weapons, they will destroy us all—despite the fact that we never agreed to be policed by Gort and his friends in the first place.  One has the horrible suspicion that, rather than make peace, a lot of panicky leaders, driven by fear and desperation, would lash out at this threat, whether they had any hope of winning or not. On the whole, the most likely result would leave the Earth a charred cinder.  The Twenty-Seventh Day gives us an even more frightening “peaceful” option: the aliens give us the means to destroy each other and twenty-seven days to use it or not. But they actually have another, hidden plan: we can reprogram the capsules and use them to selectively kill every enemy of human freedom in the world. Exactly what qualifies them as threats to freedom is never explained, but in theory we can make peace by eliminating a few thousand people.  Despite the film’s anti-Communist reputation, this sounds far more like the Leninist belief that they could usher in the Workers’ Paradise if they simply eliminated all the “wreckers.” It shocked the revolutionaries that they had to keep killing and killing, but it was one of those projects that, once started, they had to follow to the end. Somehow one suspects that using such a weapon would kill most of mankind—particularly if it eliminated those who objected to the solution.  Arthur C. Clarke (with a little help from Olaf Stapledon) created an entirely different breed of friendly alien visitor in his 1946 story, “Guardian Angel.” Their mission is to help us evolve into bodiless superbeings. The story became the basis for his novel, Childhood’s End, and it underlies his collaboration with Stanley Kubrick, 2001: A Space Odyssey.  Even within Childhood’s End, this is at best a mixed blessing, as the transformation results in the death of all the remaining normal humans and the destruction of the Earth itself. But virtually the same goal drives the colossal evil of the demonic Martians of Quatermass and the Pit. Like the monoliths in 2001, their spaceship sparked the evolution of man from ape and it is now giving us extrasensory powers. They did this to recreate their dying race and transfer their race memories into the new beings they made. They then plan to “cleanse the hive” of those who do not measure up.  Even a well-intentioned evolutionary intervention is not necessarily that welcome. In Babylon Five, we eventually learn that the horrific Shadows have had exactly the same goal as the seemingly angelic Vorlons: both want to encourage the young races to evolve. The difference is that the Shadows have more of an Ayn Rand philosophy, and think the best way to do this is through conflict. Or, in other words, they’ve been fomenting galactic wars just to help us.  Gee, thanks.  However, while both races do want to help us (well, they think it’s help), their underlying motives aren’t quite so noble: they have a running feud with each other (it seems far too personal to be called a “Cold War”), and are using us as their pawns in a massive struggle over a philosophical point (or perhaps theological might be closer).  Evolutionary interventions rarely come with clearly stated motivations, however, beyond some idea that they act out of a more evolved morality. Obviously, we can have no experience of such a moral code, but the problem is that real moral philosophies aren’t the products of “pure” reason. Instead, they are deduced from first principles, and the end result depends on where you started (something that can be seen all too clearly in most of the moral debates of our age). Even those which claim to be “scientific,” ultimately rest on metaphysical assumptions, for example that what is most useful for the most people is also the most moral. As someone once pointed out, the statement that there are no metaphysics is, in fact, a metaphysical statement.  A less extravagant type of superior alien race appears in Carl Sagan’s novel Contact (and in Robert Zemekis’ fine film version). They haven’t overseen our evolution (or if they did, they aren’t letting on) nor do they seem much interested in our future evolution. Instead, they want us to join their galactic civilization to trade with them and share our culture.  This is one of the more plausible reasons yet offered for a visit from benevolent aliens. Even what the aliens tell us about their reasons for making contact sound right: in the novel, they emphasize that even relatively primitive cultures like ours have interesting things to offer to their intergalactic community—unique gifts like “lovingkindness.” In the movie, connecting to other intelligent beings throughout the universe is the only thing that makes their emptiness bearable—in effect, both a substitute for religion and a cure for boredom.  But one has to wonder what the status of a new member entering this vast community would be. Would we be “equals” with societies whose accomplishments we could barely grasp, or would we end up becoming more of a colony, or perhaps a vassal state?  An even more plausible reason for alien contact appears in the Spierig Brothers’ splatter comedy Undead. What appears to be an invasion is instead a medical mission, sent to quarantine and cure a spaceborne zombie plague. We regularly send medical teams to fight diseases in some of the poorest and most remote regions of the world. While we do so out of a genuine desire to help others, it is also very practical to set up teams like this, ready to be sent anywhere in the world and stop a disease before it has a chance to spread.  There is, in fact, a common thread in the alien visits we find most plausible, whether they be cops in pursuit of alien criminals (Hal Clement’s Needle, The Hidden); or refugees (Alien Nation, District 9); or tourists (the human time travelers in Henry Kuttner and C.L. Moore’s “Vintage Season” probably got here first); or even Douglas Adams “teasers,” rich kids who visit planets that haven’t made alien contact and strut around in front of some poor boob no one will ever believe “wearing silly antennae and going beep-beep”: all of them speak to situations we recognize and drives we know we have.  Crossing the appalling wastes of deep space to stop by for a visit isn’t something anyone would attempt lightly. Even if they have the fastest FTL drives, luxury accommodations, fully automated ships with regenerative buffets and ramscoop engines, such a trip still represents a huge investment of time and effort. It leaves us with the question, why here and not somewhere else? What can be attractive enough to convince someone to sacrifice perhaps years of his life for the trip?  This, ultimately, is why invasion and conquest seem so likely to us. We know who we are and our own history. We know that we are never satisfied with what we have; we know that, even when we go out of our own way to help other people, we never entirely forget our own interests. We know that, throughout history, people have fought for wealth, lands and power—or sometimes just for fame and glory. Even when good men have tried their best to respect the people and customs of the new lands they visited—like the Jesuit missionaries who went to China and then spent years studying its culture and philosophies, and gave them new artistic techniques like Cloisonné enamel in return—worse men followed them and took advantage of the good will they worked so hard to build. We remember that it was always the honest, decent men who negotiated the treaties with the Native American tribes, but it was left to the politicians to enforce them.  Why do we fear the aliens have come to vaporize our cities, steal our women and stomp on our flowerbeds? It isn’t a lack of imagination. Rather, it is because we know ourselves far too well. While we like to think they can’t possibly be as bad as we are, we can’t ever complete lose that fear—and yet that very fear can make even the best-intentioned first contact deadly. Ray Bradbury can try to convince us that a bodiless alien would have no reason to sin (“The Fire Balloons”) but we know very well that people can be envious or proud of almost anything—even of how humble they are. The Outer Limits can show mankind evolving out of hatred and violence not long after we gain that “Sixth Finger” but we sure haven’t see any sign of it happening yet.  Let’s face it: we are the only intelligent species we happen to know intimately. And we wouldn’t want to invite ourselves around to visit if we could help it.  So, please, keep trying to think of reasons the good aliens might come to visit. It won’t be easy. There are quite a few out there, but they aren’t easy to find. After all, only the demented Spanish filmmaker Nacho Vigalondo can get away with the explanation Julio gives at the end of Extraterrestrial—  “There’s no reason.”  “You came for the hell of it?”  “We extraterrestrials are like that.”  Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction.", "text": "Non-Fiction\nWhat in the World Do They Want, Anyway? The Myth of the Friendly Alien\nIt was one of those typical open line nights on Art Bell’s late night radio show, the talk drifting easily between the serious, the bizarre and the ludicrous. Somehow—perhaps the recent release of both Independence Day and Mars Attacks! started it—it settled into a discussion of how the movies have portrayed aliens. Why did so many films feature alien invasions one caller wondered, and so few peaceful aliens? Why weren’t there more SF films like The Day the Earth Stood Still? He argued that it took a lot more imagination to come up with a convincing reason for a friendly visit.\nPerhaps. But wasn’t that far too simple an answer?\nAnd was Klaatu’s mission really all that peaceful?\nThis is a very familiar problem, one that many SF authors have tried to wrestle into submission. When we think of contact with other intelligent beings, we most often envision alien invasions of one sort or another—unless they are outnumbered by all those stories of UFO abductions. However, they hardly count as they are more mythic than SF (and who knows what the Grays’ real motives are, anyway?).\nEven when aliens aren’t invading, they usually are up to no good, whether they’re harvesting us (Nigel Kneale’s ITV serial Quatermass, the Twilight Zone episode “To Serve Man”); or using our bodies for transplants (Gerry Anderson’s series UFO); or collecting our blood (Not of This Earth); or stealing our endorphins for recreational drugs (I Come in Peace, Liquid Sky, Children of Earth); or using us in their experiments (Dark City, The Forgotten); or stealing our women (Mars Needs Women); or hunting us for sport; or using us as pawns in their galactic politics (as Kirk and the Klingons do to an undeveloped alien planet in “A Private Little War”); or expecting us to worship them (Stargate); or just dropping by to annoy the hell out of us (as in Fredric Brown’s classic novel, Martians Go Home).\nEven something as innocuous as trying to understand love can get perverted into something terrible in the hands of an alien who thinks it will give her a military advantage (Ole Bornedal’s “scary movie for children,” The Substitute).\nNor is it always obvious whether the aliens have come in peace or not. The Village of the Damned (1960) and its sequel The Children of the Damned (1963) demonstrate how little difference there can be. The situation is nearly identical: an unseen alien presence has impregnated women around the world, and these children have extraordinary mental powers. However, in the first film, they are terrifying, very alien, and destroy anyone who they think is trying to harm them. We learn nothing of their intentions, or why they’ve come. While they have murdered quite a few people, they have done so to defend themselves, although with a total, unrestrained ruthlessness. Clearly, whether they are hostile or not, they are a terrible threat—and not just to those around them but to the whole world.\nIn the sequel, however, the children seem more like ordinary children (and, it’s interesting to note, they no longer look alike). While they are still feared and the government still tries to destroy them, they decide in the end not to kill those who intend to harm them, even though it costs them their lives. Ultimately, those who plot to use them as weapons seem far more dangerous.\nIt would be easy to blame H.G. Wells. After all, while it wasn’t quite the first alien invasion story (earlier ones include J.-H. Rosny’s 1887 short story Les Xipéhuz and Robert Potter’s The Germ Growers (1892)), The War of the Worlds painted a stunning vision of an England devastated by a rampaging alien army. However, Wells had borrowed his basic concept from the wave of invasion novels that followed in the wake of the stunning German victory in the Franco-Prussian war. The Germans had shocked the world by smashing the largest army in Europe in a mere two months, thanks to an array of new technologies, including breech loading cannon and steam trains. Within the year The Battle of Dorking burst into publication, shocking England with a vision of a successful invasion. Some four hundred similar novels followed before the beginning of World War I.\nIronically, it was not the fear of the alien, of things different from us, the fear that is so often blamed for such portrayals of alien beings, that inspired Wells, but a very real fear of real enemies, and of the danger posed by advanced technology in the hands of such an enemy.\nIt was a similar fear—although of an even more devastating weapon, in the hands of an even more dangerous enemy—that haunted the golden age of SF cinema. While the Fifties began hopefully, with tales of journeys to other planets, darker, more paranoid efforts soon followed. Ultimately, in Quatermass 2 and The Invasion of the Bodysnatchers (and even such schlock as The Invisible Invaders), we are taken over and become the invaders ourselves.\nBut, as strange as it may seem, the bomb seems to have brought almost as many peaceful aliens, bent on saving us from our own folly in such films as Stranger from Venus, The Cosmic Man, The Twenty-Seventh Day, and The Cosmic Monsters. Or perhaps it wasn’t that strange as most of them were retreads of The Day the Earth Stood Still.\nThe problem is that, on closer examination, the alien visitors in The Day the Earth Stood Still aren’t all that peaceful. Klaatu does not offer us peace, but a warning (one might even be tempted to call it a threat). His race created robot peacekeepers which are completely independent of their control, and which vaporize anyone who poses even the slightest threat to their “peace.” We have a temporary respite, but if we continue using nuclear weapons, they will destroy us all—despite the fact that we never agreed to be policed by Gort and his friends in the first place.\nOne has the horrible suspicion that, rather than make peace, a lot of panicky leaders, driven by fear and desperation, would lash out at this threat, whether they had any hope of winning or not. On the whole, the most likely result would leave the Earth a charred cinder.\nThe Twenty-Seventh Day gives us an even more frightening “peaceful” option: the aliens give us the means to destroy each other and twenty-seven days to use it or not. But they actually have another, hidden plan: we can reprogram the capsules and use them to selectively kill every enemy of human freedom in the world. Exactly what qualifies them as threats to freedom is never explained, but in theory we can make peace by eliminating a few thousand people.\nDespite the film’s anti-Communist reputation, this sounds far more like the Leninist belief that they could usher in the Workers’ Paradise if they simply eliminated all the “wreckers.” It shocked the revolutionaries that they had to keep killing and killing, but it was one of those projects that, once started, they had to follow to the end. Somehow one suspects that using such a weapon would kill most of mankind—particularly if it eliminated those who objected to the solution.\nArthur C. Clarke (with a little help from Olaf Stapledon) created an entirely different breed of friendly alien visitor in his 1946 story, “Guardian Angel.” Their mission is to help us evolve into bodiless superbeings. The story became the basis for his novel, Childhood’s End, and it underlies his collaboration with Stanley Kubrick, 2001: A Space Odyssey.\nEven within Childhood’s End, this is at best a mixed blessing, as the transformation results in the death of all the remaining normal humans and the destruction of the Earth itself. But virtually the same goal drives the colossal evil of the demonic Martians of Quatermass and the Pit. Like the monoliths in 2001, their spaceship sparked the evolution of man from ape and it is now giving us extrasensory powers. They did this to recreate their dying race and transfer their race memories into the new beings they made. They then plan to “cleanse the hive” of those who do not measure up.\nEven a well-intentioned evolutionary intervention is not necessarily that welcome. In Babylon Five, we eventually learn that the horrific Shadows have had exactly the same goal as the seemingly angelic Vorlons: both want to encourage the young races to evolve. The difference is that the Shadows have more of an Ayn Rand philosophy, and think the best way to do this is through conflict. Or, in other words, they’ve been fomenting galactic wars just to help us.\nGee, thanks.\nHowever, while both races do want to help us (well, they think it’s help), their underlying motives aren’t quite so noble: they have a running feud with each other (it seems far too personal to be called a “Cold War”), and are using us as their pawns in a massive struggle over a philosophical point (or perhaps theological might be closer).\nEvolutionary interventions rarely come with clearly stated motivations, however, beyond some idea that they act out of a more evolved morality. Obviously, we can have no experience of such a moral code, but the problem is that real moral philosophies aren’t the products of “pure” reason. Instead, they are deduced from first principles, and the end result depends on where you started (something that can be seen all too clearly in most of the moral debates of our age). Even those which claim to be “scientific,” ultimately rest on metaphysical assumptions, for example that what is most useful for the most people is also the most moral. As someone once pointed out, the statement that there are no metaphysics is, in fact, a metaphysical statement.\nA less extravagant type of superior alien race appears in Carl Sagan’s novel Contact (and in Robert Zemekis’ fine film version). They haven’t overseen our evolution (or if they did, they aren’t letting on) nor do they seem much interested in our future evolution. Instead, they want us to join their galactic civilization to trade with them and share our culture.\nThis is one of the more plausible reasons yet offered for a visit from benevolent aliens. Even what the aliens tell us about their reasons for making contact sound right: in the novel, they emphasize that even relatively primitive cultures like ours have interesting things to offer to their intergalactic community—unique gifts like “lovingkindness.” In the movie, connecting to other intelligent beings throughout the universe is the only thing that makes their emptiness bearable—in effect, both a substitute for religion and a cure for boredom.\nBut one has to wonder what the status of a new member entering this vast community would be. Would we be “equals” with societies whose accomplishments we could barely grasp, or would we end up becoming more of a colony, or perhaps a vassal state?\nAn even more plausible reason for alien contact appears in the Spierig Brothers’ splatter comedy Undead. What appears to be an invasion is instead a medical mission, sent to quarantine and cure a spaceborne zombie plague. We regularly send medical teams to fight diseases in some of the poorest and most remote regions of the world. While we do so out of a genuine desire to help others, it is also very practical to set up teams like this, ready to be sent anywhere in the world and stop a disease before it has a chance to spread.\nThere is, in fact, a common thread in the alien visits we find most plausible, whether they be cops in pursuit of alien criminals (Hal Clement’s Needle, The Hidden); or refugees (Alien Nation, District 9); or tourists (the human time travelers in Henry Kuttner and C.L. Moore’s “Vintage Season” probably got here first); or even Douglas Adams “teasers,” rich kids who visit planets that haven’t made alien contact and strut around in front of some poor boob no one will ever believe “wearing silly antennae and going beep-beep”: all of them speak to situations we recognize and drives we know we have.\nCrossing the appalling wastes of deep space to stop by for a visit isn’t something anyone would attempt lightly. Even if they have the fastest FTL drives, luxury accommodations, fully automated ships with regenerative buffets and ramscoop engines, such a trip still represents a huge investment of time and effort. It leaves us with the question, why here and not somewhere else? What can be attractive enough to convince someone to sacrifice perhaps years of his life for the trip?\nThis, ultimately, is why invasion and conquest seem so likely to us. We know who we are and our own history. We know that we are never satisfied with what we have; we know that, even when we go out of our own way to help other people, we never entirely forget our own interests. We know that, throughout history, people have fought for wealth, lands and power—or sometimes just for fame and glory. Even when good men have tried their best to respect the people and customs of the new lands they visited—like the Jesuit missionaries who went to China and then spent years studying its culture and philosophies, and gave them new artistic techniques like Cloisonné enamel in return—worse men followed them and took advantage of the good will they worked so hard to build. We remember that it was always the honest, decent men who negotiated the treaties with the Native American tribes, but it was left to the politicians to enforce them.\nWhy do we fear the aliens have come to vaporize our cities, steal our women and stomp on our flowerbeds? It isn’t a lack of imagination. Rather, it is because we know ourselves far too well. While we like to think they can’t possibly be as bad as we are, we can’t ever complete lose that fear—and yet that very fear can make even the best-intentioned first contact deadly. Ray Bradbury can try to convince us that a bodiless alien would have no reason to sin (“The Fire Balloons”) but we know very well that people can be envious or proud of almost anything—even of how humble they are. The Outer Limits can show mankind evolving out of hatred and violence not long after we gain that “Sixth Finger” but we sure haven’t see any sign of it happening yet.\nLet’s face it: we are the only intelligent species we happen to know intimately. And we wouldn’t want to invite ourselves around to visit if we could help it.\nSo, please, keep trying to think of reasons the good aliens might come to visit. It won’t be easy. There are quite a few out there, but they aren’t easy to find. After all, only the demented Spanish filmmaker Nacho Vigalondo can get away with the explanation Julio gives at the end of Extraterrestrial—\n“There’s no reason.”\n“You came for the hell of it?”\n“We extraterrestrials are like that.”\nMark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction.", "source": "https://clarkesworldmagazine.com/cole_02_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: What in the World Do They Want, Anyway? The Myth of the Friendly Alien by Mark Cole"}