{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "kQw+DD45+3ESd5XEv1yNe2O+1+I=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Volcanoes, Obelisks, and Spam Sushi: A Conversation with N.K. Jemisin  Worlds in upheaval are a staple of fantasy literature. Warring factions collide as they grasp for power. But what happens when it is the actual Earth beneath your feet that is roiling and about to explode? What about when the skies have gone dark, the weather has turned against the people, and the planet itself has destroyed countless civilizations? N.K. Jemisin explores a world just like that in The Broken Earth Trilogy.  The Fifth Season introduces a world where seasons, natural or otherwise, can be deadly. Skies darken and rifts open in the earth’s crust. The world is broken. And in that landscape, a civilization survives and even thrives. Essun comes home to find that her husband has brutally murdered their son and kidnapped their daughter. She pursues her broken family through this broken world, through scarcity and war.  N.K. Jemisin is the author of The Dreamblood Duology, The Inheritance Trilogy, and has been nominated for numerous awards including the Hugo, Nebula, and World Fantasy Award. The Obelisk Gate, the second volume in The Broken Earth Trilogy, will be released on August 16th from Orbit Books.   You’ve mentioned in the past that some of your influences include impressionist painters. What aspect of that style of painting speaks to you?  I would say that, in a lot of cases, they’re not directly painting what you end up seeing using styles and techniques like pointillism. If you stand too close, all you see is little pointy dots of thick paint but moving back forms a full picture.  I was really thinking of more in terms of impressionist music. I’m an artist’s daughter, but, to my father’s great sorrow, I’m not a very visual person. So I’ll do things like listen to John Coltrane. He’s got this one song called “Central Park West.” It doesn’t make me think of Central Park West, but it always makes me think of traveling. It’s train music for me. I remember taking my laptop on a train trip and not getting very much work done because I was looking out of the window and things were going by so fast that all I could get was an impression of what I was seeing.  People often ask me, “How do you insert messages into your fiction?” and I usually say I have no idea. I’m not trying to create messages with the fiction I write. What I try to do is tell a story and that story consists of things that feel real. If it ends up having a message to it, it’s because we see the reflection of our own world, or it’s because the reader brings something to it, or when we step back far enough from our own world, they’re able to see it more clearly.  A few of your short stories have featured New York City. What is it about the city that keeps you curious and writing about it?  I love New York! New York for me was the place where I came to be an artist. I grew up in a lot of different places but mostly between Mobile, Alabama and Brooklyn.  I remember being told that I should go outside and play. I remember the passive-aggressive things that people who don’t get artists tend to say to them because they don’t understand that sitting in one place and just writing or reading a book is a good thing. When I came here, I was free to write as much as I wanted, free to talk with other people about my plots and the ideas that were driving me nuts at night. During the school year, I had to lie awake and sort of chew on them and try to sleep. I was sort of a childhood insomniac. Here, I could talk it out and I slept like a baby.  New York was also where I could be a nerd. My father is a nerd too and we would watch Star Trek and the Twilight Zone ‘till the wee hours of the morning and talk about them and post-process every episode. That was the thing that made me love New York.  New York is the place where souls can be free. So, naturally, when I’ve come back here as an adult I want to understand what it is about this city that makes it so unique. What it is that brings that feeling out. It was a kind of magic and I want to try and capture that magic.  Food and taste in your fiction certainly play a part in the worldbuilding. Do you find including cultural cues from the culinary world help to inform your characters?  I don’t know about the culinary world! I like to eat. I do watch Food Network shows, but I don’t know enough about the culinary world to delve too deeply into it. Food is one of the best ways to convey culture and create a realistic sense of place. You can talk about what spices are used and imply that there’s spice somewhere else like that in most parts of the world. What do people in this world or in this area of the world treasure? What is rare, what is hard to get?  There’s a scene in The Fifth Season where a character has a moment where she really should be eating and enjoying the fat in the nuts because fat is precious and hard to get during a time of scarcity. She instead decides to splurge and put some of it on her skin because her hands are dry. The things that people value in food, the things that are both necessary and luxurious, tell you a lot about what that world is like. That’s how we learn about our world.  I’ve read that it was a dream that inspired The Broken Earth Trilogy. Have dreams inspired other pieces you’ve written?  Thus far, all of them. All of my novels have resulted from weird dreams. For The Dreamblood Duology, it was a dream of a guy climbing into a tower in the dark of the night. I didn’t know why, but he was intent on killing the person inside and that was a good thing somehow.  With The Inheritance Trilogy, I dreamt that I just happened to be in a place where people were doing odd things and were really just sitting there being odd while I observed them. There was a child floating little balls around in his hand like in Labyrinth. But those balls happened to be planets. They looked like toys, but they were planets. I just needed to explain these weird images.  The worldbuilding in The Fifth Season is magnificently multilayered from the planetary all the way down to the personal. With so many interconnected pieces, where do you normally start when creating a world this complex?  Well, I start with the dream. The dream that I had for The Broken Earth was a woman with a mountain floating behind her and I knew that she had the ability to throw that mountain. I needed to understand why on Earth someone would have the ability to fling around mountains. How would anybody develop that ability and what kind of world would require magic like that?  I’ve talked about the process I use to do worldbuilding in a couple of places. There’s a PowerPoint slide deck that I have on my website. It’s called “Growing your Iceberg” and covers the process from macro to micro scale. I start with the planet, then the continents, then the people. How would the species inhabit the continent and how would they develop? Where do they migrate and what does that do to them? How has their culture been informed by the part of the world they live? It comes down to what feels real for me.  Much of Essun’s journey is told in the second person. What made you choose this perspective?  There’s a couple of reasons. One of which will not become clear until probably the third book of the trilogy, so that piece I can’t talk about. But the other piece is simply that I wanted something that felt simultaneously distant and intimate. I wanted readers to identify with Essun and second person actually interferes with identification.  When you play a video game, you’re effectively acting out second person, but you’re reminded at every turn that this is not you because you see a sprite on the screen. It’s similar for a book. You’re reminded at every turn that this character’s name is Essun, that this character’s interests and thoughts and beliefs and feelings are not yours. Naturally, the tendency is to resist identifying with her. But if you’re watching someone going through hell and she’s asking you to identify with her via that voice, you have a choice. You can reject it or empathize.  The various plot threads and perspective characters throughout The Fifth Season reveal societies that harbor fear and prejudice, especially for the orogenes, people who can manipulate the earth. How does fear play a part in oppression?  Oppression is all about fear. It’s about greed for what other people have and finding reasons and creating a framework to make it okay to take what they have. Whether what they have is their land or their lives, that’s what it comes down to. The systems that help to maintain oppression are all about avoiding payback for that. There’s this ongoing fear on the part of those who have incurred some kind of great karmic debt to get what other people have, they’re going to have a comeuppance. In Western culture, that’s the case. Western culture is all binary and about good and evil and retribution and things like that. I haven’t studied other cultures as much as my own, but I do see a lot of fear even in other culture’s experiences of oppression. Possibly that’s because we deal with Western oppression globally even though it takes different forms and moves through different lenses.  Even when looking at historical examples of oppression, I see a bent around making sure the people who have had something taken from them continue to feel like it’s right to have these things stolen.  It’s evident that you’ve heavily researched seismology and geology for The Broken Earth Trilogy. What is one interesting fact that you learned?  Just the beauty of seismic landscapes. It’s not really facts that interest me.  I was out in Seattle recently teaching Clarion West and Seattle is absolutely beautiful, one of the most beautiful cities I’ve ever seen in one of the most beautiful regions of the country I’ve ever seen. The catch is, as I was flying out, I got a great look at Mount Rainier and remembered that it’s what’s called a Decade Volcano which is one of the most dangerous types of volcanoes on the planet. Then I remembered the entire Pacific Northwest is entirely overdue for an upheaval of Fifth Season proportions!  I’m always fascinated by the beauty of a world that exists in a precarious state. I was fascinated by Hawaii when I went to visit. I had a conversation with Kate Elliott, a great fantasy author and friend of mine, about why she chose to live there, in this place that could blow to smithereens at any given second. It’s literally a giant thermonuclear bomb and Hawaii sits on top of it. And she said, “Yeah,” gesturing around at the magnificence of the Hawaiian Islands, “but what a way to go!”  It’s the ephemerality of that beauty. A lot have cultures have been built around the ephemerality of beauty. The Japanese islands are also volcanic. There is a similar reverence for beauty and ephemerality in some parts of Japanese culture, especially in the Yamato people. There is that similar reverence that beauty isn’t going to last and you should enjoy it while you can. Take cherry blossom festivals, for instance. The blossoms fall for just a few days. You have to enjoy it and then they’ll be gone. That is what interests me, not just facts. Facts are cool, but watching mountains explode is cooler. Seeing the landscape around them being as lovely as it is deadly is even more interesting.  You earned a travel grant from the Speculative Literature Foundation to research a story that became “L’Alchimista.” How does travel inform your fiction, in particular The Broken Earth Trilogy?  It’s how I learn about the universal, the absolutes of humanity. I know that sounds kind of frou-frou and woo-woo, but going to see other people you start to understand culture, you start to understand the things you have never questioned your whole life, things that seem like absolutes. You start to realize how constructed culture is, and then you also start to see how similar we all are despite these constructed differences.  I traveled to Italy a few years ago and there we introduced ourselves with our professions. I would say, “Hi, I’m Nora Jemisin, I’m a writer . . . ”. My father introduced himself as an artist. The Italian host family that we were staying with introduced themselves by their connection to the region. “Hi, I’m such and such, and my family has lived here for three hundred years.” “That farm has been in my family for two or three generations.” It was a frame of reference or paradigm shift that I was not expecting. Little things like that tell you so much about people. Experiencing things like this is how I become a better writer.  In some cases, I’m researching factual stuff like volcanoes. I grew up in a place with no mountains, let alone volcanoes. Not even hills. Tromping across a caldera was a fascinating and, in hindsight, a dangerous experience. In the moment, I just thought it was cool. If you’re hiking a caldera, you should have hand protection in case you fall and catch yourself, otherwise the volcanic glass will cut you to the bone. I did not go in with hand protection. Also, I was jet lagged. Don’t do that. You live and you learn and hopefully you survive.  What can readers expect from The Obelisk Gate and the final volume of The Broken Earth Trilogy?  Well, in The Obelisk Gate we’re going to follow several characters point of view-wise. We're branching out from the viewpoint that was central in The Fifth Season. We will find out what happened to Nassun, who went away with her father after her brother was murdered. There’s a couple of surprises in there as far as people who you think are dead but aren’t. There are also some existing characters who are going to transform. We will see a city in a giant geode. We’ll see some other wondrous and strange things along with some horrible things.  In the third volume, we will see yet another perspective that will see into the past and how the world came to be what it is in the present. That’s all I can say for now.  You mentioned video games earlier. Have you played any good ones lately?  I’ve been busy at Clarion West and with other work, but I’ve been playing comfort food games over and over again just to vent stress. I did try The Witcher 3 recently. I was a little bored with it, but I didn’t give it very long. I think I have to go back and give it another try. Geralt is hot, but I don’t know if there’s anything else there to keep me playing just yet.  That said, I haven’t gotten hooked on anything new. I’ve been playing Dragon Age, Mass Effect, and Skyrim. I use Skyrim to soothe myself to sleep at night. I play it as a real estate game? I play it in order to acquire houses in every city with the Hearthfire DLC. I’m going forth to try and kill a dragon so I can build a deck. Every time I get attacked by a dragon, I’m like “Yes! Now I get to build my spice tower!”  Finally, does Spam Sushi taste different when it’s toasted over a Kīlauea Iki heat vent?  It tastes a little sulfury, so it’s worse. The vent is mostly just steam with a hint of metallic and sulfur taste to it. If you think that Spam tastes better with metallic sulfur whiffs and hints, then I don’t know what to tell you. I was more geeking out over eating geothermal energy, but geothermal energy doesn’t taste good!  Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nVolcanoes, Obelisks, and Spam Sushi: A Conversation with N.K. Jemisin\nWorlds in upheaval are a staple of fantasy literature. Warring factions collide as they grasp for power. But what happens when it is the actual Earth beneath your feet that is roiling and about to explode? What about when the skies have gone dark, the weather has turned against the people, and the planet itself has destroyed countless civilizations? N.K. Jemisin explores a world just like that in The Broken Earth Trilogy.\nThe Fifth Season introduces a world where seasons, natural or otherwise, can be deadly. Skies darken and rifts open in the earth’s crust. The world is broken. And in that landscape, a civilization survives and even thrives. Essun comes home to find that her husband has brutally murdered their son and kidnapped their daughter. She pursues her broken family through this broken world, through scarcity and war.\nN.K. Jemisin is the author of The Dreamblood Duology, The Inheritance Trilogy, and has been nominated for numerous awards including the Hugo, Nebula, and World Fantasy Award. The Obelisk Gate, the second volume in The Broken Earth Trilogy, will be released on August 16th from Orbit Books.\nYou’ve mentioned in the past that some of your influences include impressionist painters. What aspect of that style of painting speaks to you?\nI would say that, in a lot of cases, they’re not directly painting what you end up seeing using styles and techniques like pointillism. If you stand too close, all you see is little pointy dots of thick paint but moving back forms a full picture.\nI was really thinking of more in terms of impressionist music. I’m an artist’s daughter, but, to my father’s great sorrow, I’m not a very visual person. So I’ll do things like listen to John Coltrane. He’s got this one song called “Central Park West.” It doesn’t make me think of Central Park West, but it always makes me think of traveling. It’s train music for me. I remember taking my laptop on a train trip and not getting very much work done because I was looking out of the window and things were going by so fast that all I could get was an impression of what I was seeing.\nPeople often ask me, “How do you insert messages into your fiction?” and I usually say I have no idea. I’m not trying to create messages with the fiction I write. What I try to do is tell a story and that story consists of things that feel real. If it ends up having a message to it, it’s because we see the reflection of our own world, or it’s because the reader brings something to it, or when we step back far enough from our own world, they’re able to see it more clearly.\nA few of your short stories have featured New York City. What is it about the city that keeps you curious and writing about it?\nI love New York! New York for me was the place where I came to be an artist. I grew up in a lot of different places but mostly between Mobile, Alabama and Brooklyn.\nI remember being told that I should go outside and play. I remember the passive-aggressive things that people who don’t get artists tend to say to them because they don’t understand that sitting in one place and just writing or reading a book is a good thing. When I came here, I was free to write as much as I wanted, free to talk with other people about my plots and the ideas that were driving me nuts at night. During the school year, I had to lie awake and sort of chew on them and try to sleep. I was sort of a childhood insomniac. Here, I could talk it out and I slept like a baby.\nNew York was also where I could be a nerd. My father is a nerd too and we would watch Star Trek and the Twilight Zone ‘till the wee hours of the morning and talk about them and post-process every episode. That was the thing that made me love New York.\nNew York is the place where souls can be free. So, naturally, when I’ve come back here as an adult I want to understand what it is about this city that makes it so unique. What it is that brings that feeling out. It was a kind of magic and I want to try and capture that magic.\nFood and taste in your fiction certainly play a part in the worldbuilding. Do you find including cultural cues from the culinary world help to inform your characters?\nI don’t know about the culinary world! I like to eat. I do watch Food Network shows, but I don’t know enough about the culinary world to delve too deeply into it. Food is one of the best ways to convey culture and create a realistic sense of place. You can talk about what spices are used and imply that there’s spice somewhere else like that in most parts of the world. What do people in this world or in this area of the world treasure? What is rare, what is hard to get?\nThere’s a scene in The Fifth Season where a character has a moment where she really should be eating and enjoying the fat in the nuts because fat is precious and hard to get during a time of scarcity. She instead decides to splurge and put some of it on her skin because her hands are dry. The things that people value in food, the things that are both necessary and luxurious, tell you a lot about what that world is like. That’s how we learn about our world.\nI’ve read that it was a dream that inspired The Broken Earth Trilogy. Have dreams inspired other pieces you’ve written?\nThus far, all of them. All of my novels have resulted from weird dreams. For The Dreamblood Duology, it was a dream of a guy climbing into a tower in the dark of the night. I didn’t know why, but he was intent on killing the person inside and that was a good thing somehow.\nWith The Inheritance Trilogy, I dreamt that I just happened to be in a place where people were doing odd things and were really just sitting there being odd while I observed them. There was a child floating little balls around in his hand like in Labyrinth. But those balls happened to be planets. They looked like toys, but they were planets. I just needed to explain these weird images.\nThe worldbuilding in The Fifth Season is magnificently multilayered from the planetary all the way down to the personal. With so many interconnected pieces, where do you normally start when creating a world this complex?\nWell, I start with the dream. The dream that I had for The Broken Earth was a woman with a mountain floating behind her and I knew that she had the ability to throw that mountain. I needed to understand why on Earth someone would have the ability to fling around mountains. How would anybody develop that ability and what kind of world would require magic like that?\nI’ve talked about the process I use to do worldbuilding in a couple of places. There’s a PowerPoint slide deck that I have on my website. It’s called “Growing your Iceberg” and covers the process from macro to micro scale. I start with the planet, then the continents, then the people. How would the species inhabit the continent and how would they develop? Where do they migrate and what does that do to them? How has their culture been informed by the part of the world they live? It comes down to what feels real for me.\nMuch of Essun’s journey is told in the second person. What made you choose this perspective?\nThere’s a couple of reasons. One of which will not become clear until probably the third book of the trilogy, so that piece I can’t talk about. But the other piece is simply that I wanted something that felt simultaneously distant and intimate. I wanted readers to identify with Essun and second person actually interferes with identification.\nWhen you play a video game, you’re effectively acting out second person, but you’re reminded at every turn that this is not you because you see a sprite on the screen. It’s similar for a book. You’re reminded at every turn that this character’s name is Essun, that this character’s interests and thoughts and beliefs and feelings are not yours. Naturally, the tendency is to resist identifying with her. But if you’re watching someone going through hell and she’s asking you to identify with her via that voice, you have a choice. You can reject it or empathize.\nThe various plot threads and perspective characters throughout The Fifth Season reveal societies that harbor fear and prejudice, especially for the orogenes, people who can manipulate the earth. How does fear play a part in oppression?\nOppression is all about fear. It’s about greed for what other people have and finding reasons and creating a framework to make it okay to take what they have. Whether what they have is their land or their lives, that’s what it comes down to. The systems that help to maintain oppression are all about avoiding payback for that. There’s this ongoing fear on the part of those who have incurred some kind of great karmic debt to get what other people have, they’re going to have a comeuppance. In Western culture, that’s the case. Western culture is all binary and about good and evil and retribution and things like that. I haven’t studied other cultures as much as my own, but I do see a lot of fear even in other culture’s experiences of oppression. Possibly that’s because we deal with Western oppression globally even though it takes different forms and moves through different lenses.\nEven when looking at historical examples of oppression, I see a bent around making sure the people who have had something taken from them continue to feel like it’s right to have these things stolen.\nIt’s evident that you’ve heavily researched seismology and geology for The Broken Earth Trilogy. What is one interesting fact that you learned?\nJust the beauty of seismic landscapes. It’s not really facts that interest me.\nI was out in Seattle recently teaching Clarion West and Seattle is absolutely beautiful, one of the most beautiful cities I’ve ever seen in one of the most beautiful regions of the country I’ve ever seen. The catch is, as I was flying out, I got a great look at Mount Rainier and remembered that it’s what’s called a Decade Volcano which is one of the most dangerous types of volcanoes on the planet. Then I remembered the entire Pacific Northwest is entirely overdue for an upheaval of Fifth Season proportions!\nI’m always fascinated by the beauty of a world that exists in a precarious state. I was fascinated by Hawaii when I went to visit. I had a conversation with Kate Elliott, a great fantasy author and friend of mine, about why she chose to live there, in this place that could blow to smithereens at any given second. It’s literally a giant thermonuclear bomb and Hawaii sits on top of it. And she said, “Yeah,” gesturing around at the magnificence of the Hawaiian Islands, “but what a way to go!”\nIt’s the ephemerality of that beauty. A lot have cultures have been built around the ephemerality of beauty. The Japanese islands are also volcanic. There is a similar reverence for beauty and ephemerality in some parts of Japanese culture, especially in the Yamato people. There is that similar reverence that beauty isn’t going to last and you should enjoy it while you can. Take cherry blossom festivals, for instance. The blossoms fall for just a few days. You have to enjoy it and then they’ll be gone. That is what interests me, not just facts. Facts are cool, but watching mountains explode is cooler. Seeing the landscape around them being as lovely as it is deadly is even more interesting.\nYou earned a travel grant from the Speculative Literature Foundation to research a story that became “L’Alchimista.” How does travel inform your fiction, in particular The Broken Earth Trilogy?\nIt’s how I learn about the universal, the absolutes of humanity. I know that sounds kind of frou-frou and woo-woo, but going to see other people you start to understand culture, you start to understand the things you have never questioned your whole life, things that seem like absolutes. You start to realize how constructed culture is, and then you also start to see how similar we all are despite these constructed differences.\nI traveled to Italy a few years ago and there we introduced ourselves with our professions. I would say, “Hi, I’m Nora Jemisin, I’m a writer . . . ”. My father introduced himself as an artist. The Italian host family that we were staying with introduced themselves by their connection to the region. “Hi, I’m such and such, and my family has lived here for three hundred years.” “That farm has been in my family for two or three generations.” It was a frame of reference or paradigm shift that I was not expecting. Little things like that tell you so much about people. Experiencing things like this is how I become a better writer.\nIn some cases, I’m researching factual stuff like volcanoes. I grew up in a place with no mountains, let alone volcanoes. Not even hills. Tromping across a caldera was a fascinating and, in hindsight, a dangerous experience. In the moment, I just thought it was cool. If you’re hiking a caldera, you should have hand protection in case you fall and catch yourself, otherwise the volcanic glass will cut you to the bone. I did not go in with hand protection. Also, I was jet lagged. Don’t do that. You live and you learn and hopefully you survive.\nWhat can readers expect from The Obelisk Gate and the final volume of The Broken Earth Trilogy?\nWell, in The Obelisk Gate we’re going to follow several characters point of view-wise. We're branching out from the viewpoint that was central in The Fifth Season. We will find out what happened to Nassun, who went away with her father after her brother was murdered. There’s a couple of surprises in there as far as people who you think are dead but aren’t. There are also some existing characters who are going to transform. We will see a city in a giant geode. We’ll see some other wondrous and strange things along with some horrible things.\nIn the third volume, we will see yet another perspective that will see into the past and how the world came to be what it is in the present. That’s all I can say for now.\nYou mentioned video games earlier. Have you played any good ones lately?\nI’ve been busy at Clarion West and with other work, but I’ve been playing comfort food games over and over again just to vent stress. I did try The Witcher 3 recently. I was a little bored with it, but I didn’t give it very long. I think I have to go back and give it another try. Geralt is hot, but I don’t know if there’s anything else there to keep me playing just yet.\nThat said, I haven’t gotten hooked on anything new. I’ve been playing Dragon Age, Mass Effect, and Skyrim. I use Skyrim to soothe myself to sleep at night. I play it as a real estate game? I play it in order to acquire houses in every city with the Hearthfire DLC. I’m going forth to try and kill a dragon so I can build a deck. Every time I get attacked by a dragon, I’m like “Yes! Now I get to build my spice tower!”\nFinally, does Spam Sushi taste different when it’s toasted over a Kīlauea Iki heat vent?\nIt tastes a little sulfury, so it’s worse. The vent is mostly just steam with a hint of metallic and sulfur taste to it. If you think that Spam tastes better with metallic sulfur whiffs and hints, then I don’t know what to tell you. I was more geeking out over eating geothermal energy, but geothermal energy doesn’t taste good!\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/jemisin_interview_2016/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Volcanoes, Obelisks, and Spam Sushi: A Conversation with N.K. Jemisin by Chris Urie"}