{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Erin M Hartshorn", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "/9MWHjtGHviOsFiffdeDEDhXXuM=", "id": null, "license": null, "comments": "", "raw_text": "6580 words, short story  Matchmaker  “You’re not exactly what I expected when my mother said she’d found a shadchen.”  Miss Berazazz could’ve been Jewish, sure. The first kurz had converted only a few years after the kurz and humans had encountered each other out in space. Everyone learned of the Acceptance in Hebrew school, even if no kurz attended synagogue locally.  I stared around the pink ruffled room. Her yellow-green complexion seemed out of place. Bouquets of old-fashioned musk roses—one of the few Earth imports to do well here—were clustered everywhere, their aroma masking the natural body odors that made kurz and humans nauseated when near each other.  There had been few kurz in my classes at school; most were home-schooled. I’d wanted to be friendly toward them, but they scurried away every time they saw me coming. I’d like to have found out if the green frills circling their otherwise bare heads were as soft as they looked, if that patch of orange scales on their throats hummed to the touch when they spoke. They didn’t seem to share the same level of curiosity about my dark curls and olive skin. Pity.  Miss Berazazz winked her third eye at me. “You never met a shiksa who was a matchmaker before?”  “If there were one within five star systems, I’m sure I’d have met her.”  My mother wasn’t subtle about getting me married off. I still burned with the shame of my sixteenth-year party, when she had invited every unmarried male in the Spaceport. I don’t think I’d met even half a dozen of them before the talk turned to politics—specifically, the legality of sensor implants.  Space pilots needed the extra input for safe flying. Other spacers might, too, but our world has a strong conservative bent. We didn’t want people who could afford the best technology to have an unfair advantage in the job market. Well, any more of one than they already had.  I didn’t even get to express an opinion before tempers flared. The party became a brawl, troops were called in, and in the fracas, I was knocked into the fountain.  Mother was upset because my dress was ruined.  Five years had passed since then, and my mother was throwing everything she had into the effort of getting me married. “I don’t want you to be alone when I’m gone.” As though being alone were something to be afraid of. She had entirely too many hang-ups from that frontier planet she grew up on. Like the need to marry young. I wondered sometimes what she would have done if my father hadn’t come along, but he had and they’d married when she was just seventeen. Now she thought of me, her only child, as an old maid.  “How old are you?” Miss Berazazz’s question fit so seamlessly into my thoughts that I didn’t realize at first she’d asked it.  “Twenty-one.” I felt my ears heat up at the lie. They always blushed first, before my face. I amended my reply. “Twenty-one next week.”  Her frill rippled in agreement as though she’d expected my answer. Mother probably gave her all the dirt on me. I shifted uneasily in my seat. What had they planned together?  Miss Berazazz surprised me by standing up and leaving the room, moving backwards. “A teacher with a big heart and large ambitions. Even discounting your mother’s exaggeration, you are promising. Intelligent, caring. Come back when you are full of age. Your mother will not be party to this.”  I sat there, befuddled. Mother had sent me here; surely she was already a party to it. And if I came back this early with nothing to tell her, she would assume I’d skipped the appointment completely.  I hesitated at the door and watched the clouds scudding across the pale green sky. The school was on holiday, so I had no work there to catch up on. Maybe I could kill some time at the council chambers. Nothing like a good political debate to fill the afternoon.  Just as well none of the boys at that long-ago party had asked my opinion on the question at hand. I would have told them. Not that any juvenile’s opinions mattered. In the long run, the council bowed to pressure from the spacers and allowed implants to be used on the job. Penalties were high, though, for personal use; use outside the space support complex was cause for deportation.  Delaying my return home didn’t matter in the end. I paused to touch the mezuzah before I entered the house. Mother sat, waiting for me, back straight and stiff, on the chair in the foyer. I was to be questioned, and with the length of time I had been gone, she wouldn’t believe the truth. I told her a half-truth.  “She says I’m . . . a difficult case. She needs time to find someone suitable.”  Her eyes narrowed—enough for me to notice, but not enough to crease her perfect skin. “How much time?”  “I’m to come back at the end of next week,” I said. Next week, after my birthday. Would she see the importance of that? I didn’t see how, as I didn’t understand it myself.  “Very well. I’ll drive you there myself.”  If her only worry was that I wouldn’t go—well, that made sense. I wasn’t even sure myself why I planned to go. Certainly not legal compulsion, nor the full weight of guilt that Mother had been bearing upon me for years. Curiosity, I suppose. You don’t have to be full-legal to enter a marriage contract, not even limited dalliance or child-bearing ones. What could the shadchen have in mind?  I brought my attention back to Mother. “That’s not necessary. Really.”  “We can discuss it later.” A crease in her upper lip was the only visible sign of her displeasure. She changed the subject. “You didn’t go see her looking like that, did you?”  I glanced in the mirror over the hall table. My hair had been tossed a bit by the omnipresent wind, but otherwise I seemed presentable enough. “Why not? You chose this outfit for Ben’s swearing-in ceremony.”  My cousin Ben was on the Spaceport council. He’d barely won the election for his district, even with Mother and Aunt Nomi calling on all their friends to exert pressure on his behalf. He’d been in office a scant month now, so I was fairly confident the clothes hadn’t gone out of style just yet.  Her hands flew up. “Why do I even bother?” She addressed the ceiling, as she had so often while I was growing up. Or maybe she was talking to my father’s ghost. I’d never had the nerve to ask. She looked back at me. “That was a political occasion, in support of family. This dress is completely out of place in a business meeting where you are trying to impress someone with your future prospects. You’ll have to have something more suitable next week. Yes, perhaps a visit to ReeAnn’s shop.” She frowned. “No, ReeAnn is working on the outfits for your party.” Another pointed birthday party. Wait—outfits? Plural? “We’ll have to use Kendra this time, I suppose. It’s really too bad you don’t have a cousin your age to borrow from.”  As if that were my fault. She should take it up with Aunt Nomi who had, after all, been given a choice with Ben. Mother’s system rejected the sex selection drugs, but Aunt Nomi had an iron stomach. Personally, I was always amazed that the drugs had dared disagree with Mother. Not many things did.  Certainly Kendra didn’t. Mother was already on the line to her. I couldn’t hear Kendra’s end of the conversation, but Mother’s tone spoke volumes. A few sentences, and anyone would agree with her out of self-preservation.  My own levels of self-preservation were high enough that I never overtly disagreed with her. I simply didn’t voice opinions.  Kendra made time for Mother. We would be at her shop tomorrow morning. My measurements could be sent to her—were, in fact, on file. Kendra would use them to ensure that everything we examined would be in my size. Mother didn’t really need me there—a hologram would do as well for color, style, and bearing—but she wanted me there. As I said, no overt disagreement. There went another day of my life.  As it turned out, the day wasn’t a complete loss. Mother had a Hadassah meeting in the afternoon and had to rush off right after the fitting. If Mother wasn’t there on time, Elizabeth Holin would push through all of her own pet projects. I’d gone to a meeting once; it was amusing yet frightening to realize Mother wasn’t the only fiercely stubborn woman around. Their clashes were entertaining, but Mother expected me to back her up. I found it easier to not attend.  Mother was very understanding when I said I had other commitments. I had already agreed to become an active member when I got married, a time that evidently neared. My anticipation knew no bounds.  Mother left me at the door of Kendra’s shop. “I know you’re much too busy to accompany your poor old mother to her meetings. Don’t think anything of it.” For her, this was understanding.  I resisted the urge to roll my eyes. My poor old mother played racquetball twice a week and frightened bullies in the street, and I pitied anyone who had the lapse of judgment necessary to call her “old” to her face.  “I’ll be home a little late for dinner,” she continued. “You go ahead without me and I’ll find something when I get home.”  “Don’t be ridiculous.” My lines slid out with the ease of long practice. “I wouldn’t think of starting without you. You go ahead, and we’ll eat when you get home.”  After several more exchanges along the same lines, reinforced with her mention of rugelach should I need to nosh, she finally left, catching the A line toward Aunt Nomi’s house. I watched until she was out of sight before setting off in the opposite direction. I’d heard that the library had new copies of twentieth-century political speeches from Earth. I wish they had more kurzan material for comparison, but there wasn’t much demand for it.  I had always wanted to go to Earth, to study politics at one of the real universities, in Cambridge or Melbourne or Shanghai. Even I knew that it was a hopeless dream, but I still studied everything I could get my hands on. A more realistic idea would be to have the chutzpah to run for office. All I had to do first was grow a backbone, move out, and survive the guilt. Realistic—right.  When I got to the library, somebody else had already reserved the speeches, and the visuals room was occupied. I hadn’t expected that. After I joined Hadassah and began to organize charity functions of my choice, I intended to begin at the library, updating their site licenses and their tech so that more than one person could look at archived material at the same time. Very definitely tikkun olam.  The librarian tried to be helpful. “Is there something else I can get you instead?”  I tried to think of alternatives. I’d already read all their Hebrew-language archives, but not all the cultural information. Most of the material they had on the Shoah, though, I’d need the visuals room for, so that was out.  The talk at council the previous day had been on farming and pollutants and which space company thought the Spaceport’s fees were too high now. One motion, quickly tabled, concerned some cross-breeding experiments. That might be interesting to follow; I asked for a simple genetics text. I’d look up the details of the bill later, after I got home.  The mathematics and probabilities were as dull as I expected, but the history was fascinating. The text even had a chapter devoted to the eugenics attempts under the Third Reich. I thought of my many-times-great-grandmother and her release from Dachau. I already knew this history, but I read with interest about the experiments in Earth’s twenty-first century to decrease activity of monoamine oxidases as well as to increase levels of the dopamine receptor associated with risk-taking behavior. Earth wanted space pilots and people willing to brave the far reaches of space. But risk takers don’t settle down, and so entire new families of drugs were born. The drug trade ramped up. The politicians should have seen that coming.  “Seen what coming?”  I hadn’t realized I’d spoken out loud. “Excuse me—” I looked up.  He smiled. The smile was so perfect, right down to the dimple in his left cheek, that it took me a moment to process the rest of his good looks—black hair, tan skin, grey eyes.  “Wow.” I bit my lower lip. I knew I’d said that.  “I didn’t mean to interrupt.” He put his left foot up on the table next to my chair and leaned on his knee. “I was waiting for a good moment. The librarian told me you wanted to use the visuals room.”  I nodded. Behind him, the clock on the wall showed a quarter after six. Four hours! I’d lost track of time. Mother wouldn’t have been that long at Hadassah—not since she’d given up finding leads for marrying me off, anyway. I stood up. “I have to go.”  “The room’s free now. I even asked the librarian to leave the vids keyed for you.” He pulled back but didn’t put his foot down.  “I’m sorry.” He was looking at the speeches? Gorgeous and interested in the same things I was. If only I could stay. “I didn’t realize it had gotten so late. I have to meet . . . someone.”  “Maybe I’ll see you another time, then.”  “Maybe.” He hadn’t moved, and I had to push past him to drop the genetics book at the counter. “I’m in here a lot.”  He probably hadn’t heard me and wouldn’t have cared if he had. Mother said I had my dad’s nose. I guess that could have been it, although I figured no one in his right mind would want her for a mother-in-law.  As I’d expected, Mother acted worried when I got home. “I was afraid something had happened to you.”  I walked past her to the kitchen. “Not this time,” I said. “I am hungry, though. I’ll just whip us up something, shall I?”  Mother didn’t rise to the bait. If Mother didn’t want to feed a hungry child, perhaps she really was worried.  “I expected you to be home when I arrived.”  I stopped and turned. “I’m sorry. I should have signaled you.”  Was she going to forgive me? Well, no, but she might let it go for now, to be dragged out later in one of her litanies of my failings as a daughter.  “Yes, you should have.” She walked away. Over her shoulder, she said, “Don’t eat too much. There isn’t enough time for either Kendra or ReeAnn to alter your dresses.”  No family meal, then. Fine. I grabbed a cheese sandwich and a glass of milk and curled up to think about the stranger in the library. I should have read the cross-breeding bill instead, but he was more compelling. Something about him shrieked outsider. Maybe a space captain, passing through. But then where were his implants? Ah, well, a gal could dream.  And dream I did until the morning of my twenty-first birthday. Mostly. I did eventually read the bill.  I’d assumed it would be a bill for funding at the college—some new strain of wheat with more fiber and vitamins, or livestock that would grow in a tank so we could put yet larger buildings on what was now grazing land. Scientists were always promising things like that and instead creating chickens that could lay striped eggs with yolks that glowed in the dark.  This bill was different. It claimed to be “to protect the purity of the human and kurz races.” In an attachment—not part of the bill itself but clearly meant to influence its passage—one of the sponsors told a story of his father, whose genetic material had been stolen and used to impregnate a kurz female.  The bill had lots of language in it about the protection of the two species and about how cross-breeds could serve as vectors for illnesses to spread from one to the other.  It was a marvel of statesmanship. It had to be, to allow every artificial method of procreation, every drug, every choice we’d given ourselves about our children, yet disallow any hybrids. It stopped short of barring kurz procreation on a planet where there were humans, but not by much. The hints were there for anyone who’d studied politics and history. This was just the beginning.  It stank worse than a roomful of kurz after a softball game.  I still hadn’t decided what I could do about it. Ben was too busy to talk to me, although I left several messages at his office.  Today, though, I wouldn’t worry about it. Today was the day I went back to see the shadchen, the day I accepted Mother’s wish to find me a husband. I really didn’t care. I had a job; I had ambitions. I even had a cause. I didn’t need a husband. It was my mother who wouldn’t give up.  Before getting dressed, I paused to look at the yellow star hanging on my wall. The faded ancient fabric was framed behind glass in a controlled atmosphere that prevented further deterioration. I stroked the wooden frame. Had that distant ancestor married for love, or had she, too, been to a matchmaker? I knew she hadn’t met her husband until after the war. I wondered what her dreams had been. They hadn’t been passed down from mother to daughter as the star had been.  “I remember,” I whispered.  I pulled out the dress and overskirt that ReeAnn had insisted would be perfect for meeting my future husband. I felt like an idiot with the skirts swishing and swirling as I walked. It was the price I’d had to pay to go alone.  That wasn’t the way these things were done. The shadchen should have met me to size me up for herself. Then Mother would take over, whether I was difficult or not. Mother should meet with Miss Berazazz and my future husband and mother-in-law to work out the details. Only when the contract was sealed would I set eyes on him. There were several arguments I could have made; I used the simplest.  “The shadchen said we should do it this way.”  That was that. Not even Mother would offend a matchmaker willing to take my unruly self in tow. And so she sat once more in the uncomfortable chair by the front door and waited for me to come down the stairs in my new finery, waited to say good-bye to her grown-up daughter who would finally get married, waited to take one last stab at my self-esteem.  She stood as I approached the landing. “You’ll do, I suppose, but would it have killed you to do something with your hair?”  And there it was. I touched my hair self-consciously. “Short of cutting it all off, this was the best I could do.” I paused in front of the mirror and pulled my hair off my face. “I could try that. Might start a new trend.”  “Your father must be spinning in his grave to hear you talk like that.” She pushed me at the door. “Go on, then. Try to remember to be a lady.”  As if I could forget in this get-up. I thought about turning back, but ladies do not renege on their word, even if they didn’t like their options. I didn’t even know my options. Miss Berazazz might have already chosen someone, someone I couldn’t stand. I quailed. The only thing that pushed me forward was the thought of telling Mother I didn’t go.  I pushed the door open.  A kurz looked up from an armchair. His eyes were the same deep green as the edge of his frill. “Yes?” he asked.  “I’m sorry.” I tried to back out of the room while still talking, but my overskirt snagged on the door. I tugged at it without looking. “I didn’t realize someone else was . . . I was looking for . . . I’ll come back later.”  His frill rose in mild surprise. “Do you think you should do that?”  “Come back? Yes, I’m expected.”  “No, not that. I meant—”  My overskirt tore. I stopped pulling, but it was too late. A large piece of fabric remained caught on the bottom of the door, and the skirt itself was beyond repair. I felt my ears growing hot with embarrassment and knelt to pry the fabric loose, letting my hair fall forward to mask my face.  “Here, let me help you with that.”  I inhaled to argue and stopped in surprise. “You don’t smell.”  His frill rippled. “I beg your pardon?”  My face should have been in flames based on the heat I was feeling. “You—I—kurz always—I’ll shut up now.”  “Not on my account, I trust.”  I was spared from answering because Miss Berazazz entered from the back room at that moment. Her frill rippled when she saw the two of us together at the door.  “I see you’ve met my son.”  I learned a lot in the next few minutes.  Kurz mating habits are reasonably close to human, although they’re compulsively monogamous. Miss Berazazz had chosen the courtesy title “Miss” based solely on how it sounded to her. She was married, he was off-planet, and Chur-kil was their only child.  “Which brings us to you.” Miss Berazazz finished spieling off history. “You need a husband. My son needs a wife.”  I gaped at her. Our species weren’t even from the same solar system. I had more in common biologically with chimpanzees than I did with any kurz. Then there was that bill before the council. “But—we’re incompatible.”  “I don’t know. I thought we were getting along pretty well.” He had the nerve to wink his right eye at me, and I blushed again.  “Perhaps not so incompatible as all that. Chur-kil is the first generation of . . . an experiment.” I stared in horrified fascination as she triggered a holo on her desk. It could have been the older brother of the man I’d met in the library, identical except for blue eyes, streaks of gray above his ears, and a ridge of sensor implants under each eyebrow. “His father.”  “That’s not possible,” I said. But I remembered the stolen genetic material mentioned in the bill. I bit my lower lip. “Do you have documents?”  I blanched. Mother would’ve found the rudeness unforgivable, but Miss Berazazz didn’t even wave her frill.  “Certainly.” She used her monitor to call up copies of her marriage certificate and Chur-kil’s birth certificate. They could have been faked, but since I could access the information from the central database, there wasn’t much point.  I leaned back in my chair. “And he’s the actual father?”  “We’ll give you the medical records later, but right now, hear me out. As I said, my son is the first generation. We want a second generation, one that will be able to breed freely with either parent race. That’s where you come in.”  This was why I had to be twenty-one. Mother would never have listened to this. It wasn’t illegal; no one thought it possible. But Mother, a blessing on her head, had always wanted me to marry—  “I don’t suppose you’re Jewish? Or a doctor?”  Was I really considering this? So I’d never see Earth. That had never been realistic.  Chur’s frill was ruffling again. I watched, confused.  “Neither, I’m afraid. I’d be willing to convert, but I’m afraid a bris is out of the question.”  My mouth opened. Pause. Think about what you’re going to say. “I’m afraid the rabbi would insist.”  Miss Berazazz—his mother—cut across our interchange. “Did you pay no attention to comparative anatomy in school?”  I shrugged. “I learned science from test to test.”  “Kurshall keep us all safe!” She leaned across the table. “Physically, you may be compatible enough to join, but there is no foreskin.”  “So your entire race is circumcised. Even better.”  This couldn’t be real. I didn’t joke about such things. Mother would be appalled to hear me even discussing them.  “More or less.” His brow creased, and the corners of his mouth turned up. It didn’t come naturally to him, but he was trying to smile. I found it charming, even if he had been practicing long before he’d heard my name.  “What exactly do you want me to do?”  The marriage license was already made out. The ceremony could take place immediately. Accompany Miss Berazazz to a clinic the following day, and by the time my party rolled around, I should be well on my way to being knocked up. We could try for future children the old-fashioned way. Only one thing hadn’t been taken care of.  “I didn’t know where you’d want to live.” He touched the back of my hand with a single finger.  I pulled my hand away, leaned back in my chair, and rubbed my temples. What would Mother say about a kurz for a son-in-law?  I went back to something tangible. “I met someone the other day who looks like your father.”  They exchanged looks. Miss Berazazz said, “My husband had a child from his first marriage. Chur-kil’s brother . . . never accepted his father’s remarriage. He may be here to cause trouble.”  That perfect smile, those grey eyes. I looked at Chur-kil. His frill was flat against his head. I didn’t want to be superficial. I didn’t. And yet . . .  I opened my mouth to refuse.  “Life won’t be easy for our children,” he said. “But with time, more time than we’ll see, our peoples will truly be one.”  The wistfulness in his voice struck a chord in me. They had a glorious vision. I came from a people proud to be set apart, a people he was willing to join. But he’d been planning this for a long time; I hadn’t. I wouldn’t rush into anything. I told myself it had nothing to do with his brother’s dimple, and I almost believed it.  I pushed my chair back from the table. “I need time.”  “Of course.” Chur looked disappointed but nodded.  His mother was less understanding. I’m used to dealing with mothers, though, and she was a pushover compared to even Aunt Nomi. I promised to return in a week with a decision.  Chur walked me to the door. “I’m sorry about your skirt.”  Tell him it had been bought for the occasion? No. “It wasn’t my favorite.”  Time to go home and re-read the bill. Marriage would be making a stand, but it had to mean more than that, more than green eyes and a forced smile. I had to think. First, though, I had to decide what to tell Mother.  I couldn’t—didn’t—tell her all the truth. Fortunately, when I walked in with a torn skirt, Mother’s attention was all for that. “How could you? It wouldn’t have been suitable for your party, certainly, but it could have been part of your trousseau.”  Just like that we were on the subject of my marriage.  “Perhaps.” I twitched my skirt and moved past her to the stairs.  Her voice stopped me. “Young lady.”  I’d had the entire trip home to think about what to say. Except I was thinking about the marriage proposal, legal threats, in-laws who smelled, and talking to my rabbi. Chur had been . . . nice. A vague word, but it fit. He was pleasant and witty, completely agreeable.  And he’d winked at me. No man had ever winked at me, except for Uncle David when I was a little girl. Chur didn’t care about my dad’s nose, about what I looked like—so far as I knew, all he did care about was that I was unmarried and twenty-one.  Not exactly a ringing endorsement.  I sighed. “He was friendly, but I’m afraid his mother will try to run our lives. I asked for some time to think about it.”  “I see.” The infinitesimal eyebrow lift. “Is he at least Jewish?”  “He says he’ll convert.” I kissed her cheek. “But I do need time. You wouldn’t want us to name our first-born child for someone on his side of the family, would you?”  With that, I breezed past her and up the stairs. Everything I’d said was true. I’d only left out the fact that he was kurz. Not fully by biological standards, but to all appearances. I wasn’t looking forward to that conversation.  I worried at the decision that day and the next and the day of my party—even as I prepared to greet my guests, I wondered what they would say if Chur stood next to me.  A surprise guest showed up at my party—the handsome stranger from the library—Chur-kil’s half-brother. I first spotted him with Ben and a couple of Ben’s cronies from the Spaceport council. I wanted to talk to them—Ben still hadn’t returned my calls—but hostess duty compelled me to chat with women who wouldn’t have been near my party if they had dared offend Mother.  “I hear you went to a shadchen.” I couldn’t remember her name. Some vacuous person a couple years older than me, probably with two boys and two girls by now.  “Mother’s idea.” Why elaborate?  Uncle David joined the conversation. “Historically, matchmakers create more lasting unions than personal choice does.”  “Historically,” I replied, “there wasn’t usually a way to dissolve a marriage short of murder.”  “Interesting. Are you looking to hire somebody for the job?” It was the stranger. Ben stood next to him.  “I’m not married yet, so I’m afraid it would be premature. I can take your references to keep on file.”  “Alas, I have none.” His smile was as charming as I remembered.  “Do you at least have a name?”  “My apologies,” he said at the same time Ben said, “I brought him over to introduce.”  “The least you could do if you helped him crash my party,” I said.  Ben gave me his standard exasperated cousin look. “May I introduce Joe Yee? Joe’s recently arrived at the port and is crazy enough to want to make it permanent.”  “The lure of the unknown,” Joe said. “As well as the fascinating beauties on your planet.”  Ben coughed. I ignored him, even though I didn’t blame him. I tried to keep the frown off my face. I was certain Joe was here to cause trouble for Miss Berazazz and Chur, but what in the world was he doing at my party?  “What would you do here?” I asked.  “Oh, no. You’re going to set each other off,” Ben said.  “I was thinking of going into politics,” Joe said.  “I suppose you lapped up all that arguing about the different spacer companies the other day.”  He shrugged. “I’ve heard it all from the other side. What do you think of the recently tabled motion on cross-breeding?”  Was he actually going to announce his views? I said, “I’m no biologist. What about you?”  He spread his hands. “I’m afraid I haven’t studied enough of the particulars to have an opinion yet.”  Uncle David snorted. “He’s a politician, all right.”  “A pity,” I said. “Perhaps you can explain it to me after you’ve had time to study it.”  “I’d be delighted.”  Later, I managed to get Ben off by himself, but only after promising I wouldn’t talk to him about any of the bills facing the council. I asked him about Joe. “I could swear I’ve seen a picture of his father.”  A shrug. “It’s possible. His father’s a captain on an interplanetary run. The news often has pictures of one or another of them—usually when something bad happens.”  Morbid curiosity and gossip. That just about sums up news. I’m not above it myself, but Ben didn’t know about any other family Joe might have. “I thought you had an engagement just about ready to announce.”  “Nothing’s final.”  Mother found us talking then and chased us back to the party. I wasn’t being a responsible hostess, and it might not be too late to catch the eye of the Governor’s younger son. As said son had a wandering eye and hands to match, I wasn’t as enthusiastic about the prospect as Mother was. I followed her across the patio toward him anyway.  Help arrived from an unexpected source. Joe caught my arm. “You promised me a dance.”  Mother, never one to complain about a gift to the giver’s face (unless you were family, and then it wasn’t so much a complaint as a megillah of what the money could have been better spent on), pushed me into his arms and glided off to speak to Aunt Nomi.  The song was half over, but I went through the motions. Dancing doesn’t thrill me, although the feel of his hand on mine did strange things to my heartbeat. When the music changed, Joe would have kept dancing.  I drew him to a nearby bench. “I thought only elected officials refused to give an opinion.”  “I don’t want to say anything I might regret later,” he said. “People would expect me to live up to it.”  “You haven’t been involved in politics before, have you?”  “So young to be such a cynic.” He brushed his lips across my hand while looking into my eyes. It was a romantic gesture, even if I did see the flash of a sensor implant on his upper lip. He wouldn’t be using it away from the transport sector, not with the penalties. The texture implied simulskin on the surface, and most girls probably never noticed it was there. I wondered what he was wired for.  I left my hand in his. I looked at the hands, not ready to meet his gaze.  “Perhaps you’ll make a true believer of me yet,” I murmured.  He leaned in close. “But a believer in what?”  My eyes widened at his tone, and I looked up. His eyes were narrowed, and the charming smile was gone. His grip on my hand tightened.  His voice low, he said, “Do you know what you’ve gotten yourself into?”  The music changed again. People moved past us to the dance area. I pulled at my hand, but he didn’t let go.  “What are you talking about?”  “The kurz. Don’t deny it. Their pheromones cling to you like sewer water.”  The sensor must be good to pick it up after two days.  I shrugged. “Mother sent me to a shadchen. I was surprised to find she’s not human, but if she finds me a husband, it clearly doesn’t matter to Mother.”  “If you’re not telling me the truth, I will find out.” His sneer marred his good looks. “I know of their plans to pollute the human race with their filth. I’ll stop this—”  I couldn’t prove he’d used the implant. And if I accused him, it would just give him one more opportunity to air his bigotry when he got his day in court. Distasteful as he was, I had to get him out of here without that satisfaction.  It was time to be outraged. I’d spent years watching Mother do it; time to see if the passive lessons paid off. My voice rose just enough to cut across the nearby din. “Is that why you came here uninvited? There are standards of behavior in this community.” I snatched my hand back with great force.  A few heads turned, but Joe couldn’t see them from where he was. He said, “Don’t flatter yourself. I’m checking all the unmarried local women.”  “My, a libertine or desperate. Perhaps both.” I knew that wasn’t what he meant, but the onlookers didn’t. I stood. “I’ll thank you to leave now.”  He looked as though he wanted to say something else. Then he saw Mother standing next to him. To his credit, he didn’t blanch.  “I believe my daughter asked you to leave.” Nothing colored her voice. “My nephew will be happy to show you the way out.”  Ben didn’t look happy. Joe had come with him, and he was going to get an earful from both Mother and Aunt Nomi later. He put his hand on Joe’s shoulder as if he’d ejected men from parties before. Maybe he had; Ben went to parties where that sort of thing might happen.  The incident effectively killed the party. Clusters of people stood about, talking quietly and casting furtive glances at me when they thought I wasn’t looking. Look at the freak who chased off the only eligible man to show any interest in her ever. If it hadn’t been my party, I’d have pled a headache and left, but a hostess has responsibilities—as though Mother would let me forget.  I was duly grateful as my guests began leaving in twos and threes. Many of them still wouldn’t meet my eyes. Mother stood beside me, smiling and chatting. I was doomed as soon as the last guest left. I knew it.  The door closed.  I pursed my lips and looked at the nearby chair. “Does that leg look chipped to you?”  The ruse was pointless. She looked over swiftly, then returned her gaze to me. “It’s fine. You, however, have some explaining to do.”  “I didn’t mean to make a scene, but he was being rude—” inspiration struck “—and crude about my visits to Miss Berazazz.”  Rudeness one should rise above. Crudeness, on the other hand, was just not done.  Her left shoulder seam pleated a trifle; she had relaxed. I wasn’t clear of port yet, though. “You know what I think of you bringing up such matters to strangers.”  That one I was prepared for. “Talk circulates at a party, Mother. You know that. I’ll talk to Ben about his choice of companions.”  “You needn’t bother, child. I will—”  “I was hostess. It’s my responsibility.” I hadn’t interrupted Mother since I was two years old. My neck prickled, and I could taste acid in my throat. I bit the inside of my lip. I wouldn’t get sick now.  Finally, she nodded. “I might still have a word with Nomi about how she’s raised her son, but as you say, it is your responsibility.”  I don’t remember going upstairs to my room. Shock will do that. I had to get Ben on the line. Not yet, though. I wasn’t sure he’d be home. Maybe Ben would be willing to arrange Joe’s quiet deportation for illegal use of implants if I protected Ben from our mothers. It was worth a try. No need to tell him I’d already saved him from mine.  Joe had spoken of polluting the human race. I’d heard that line of rhetoric before.  I crossed my room to face the faded cloth star and ran my finger over the glass as though I could touch the fabric. “Never again.”  Chur was more human to me than Joe would ever be. He’d make a good husband. I made a call. “I think you should talk to my rabbi. I’ll let him know you’re coming.” Erin M. Hartshorn is a desert rat transplanted to a humid climate. Her ideal home has bookcases in every room. She is a moderator at Forward Motion for Writers, an on-line writers community. Her fiction has appeared both on-line and in print in various places, placed in the PARSEC short story contest, earned honorable mentions in the Writers of the Future contest, and been short-listed for the UPC Award. When she's not writing, she enjoys various handicrafts, though she prefers spending time with her family.", "text": "6580 words, short story\nMatchmaker\n“You’re not exactly what I expected when my mother said she’d found a shadchen.”\nMiss Berazazz could’ve been Jewish, sure. The first kurz had converted only a few years after the kurz and humans had encountered each other out in space. Everyone learned of the Acceptance in Hebrew school, even if no kurz attended synagogue locally.\nI stared around the pink ruffled room. Her yellow-green complexion seemed out of place. Bouquets of old-fashioned musk roses—one of the few Earth imports to do well here—were clustered everywhere, their aroma masking the natural body odors that made kurz and humans nauseated when near each other.\nThere had been few kurz in my classes at school; most were home-schooled. I’d wanted to be friendly toward them, but they scurried away every time they saw me coming. I’d like to have found out if the green frills circling their otherwise bare heads were as soft as they looked, if that patch of orange scales on their throats hummed to the touch when they spoke. They didn’t seem to share the same level of curiosity about my dark curls and olive skin. Pity.\nMiss Berazazz winked her third eye at me. “You never met a shiksa who was a matchmaker before?”\n“If there were one within five star systems, I’m sure I’d have met her.”\nMy mother wasn’t subtle about getting me married off. I still burned with the shame of my sixteenth-year party, when she had invited every unmarried male in the Spaceport. I don’t think I’d met even half a dozen of them before the talk turned to politics—specifically, the legality of sensor implants.\nSpace pilots needed the extra input for safe flying. Other spacers might, too, but our world has a strong conservative bent. We didn’t want people who could afford the best technology to have an unfair advantage in the job market. Well, any more of one than they already had.\nI didn’t even get to express an opinion before tempers flared. The party became a brawl, troops were called in, and in the fracas, I was knocked into the fountain.\nMother was upset because my dress was ruined.\nFive years had passed since then, and my mother was throwing everything she had into the effort of getting me married. “I don’t want you to be alone when I’m gone.” As though being alone were something to be afraid of. She had entirely too many hang-ups from that frontier planet she grew up on. Like the need to marry young. I wondered sometimes what she would have done if my father hadn’t come along, but he had and they’d married when she was just seventeen. Now she thought of me, her only child, as an old maid.\n“How old are you?” Miss Berazazz’s question fit so seamlessly into my thoughts that I didn’t realize at first she’d asked it.\n“Twenty-one.” I felt my ears heat up at the lie. They always blushed first, before my face. I amended my reply. “Twenty-one next week.”\nHer frill rippled in agreement as though she’d expected my answer. Mother probably gave her all the dirt on me. I shifted uneasily in my seat. What had they planned together?\nMiss Berazazz surprised me by standing up and leaving the room, moving backwards. “A teacher with a big heart and large ambitions. Even discounting your mother’s exaggeration, you are promising. Intelligent, caring. Come back when you are full of age. Your mother will not be party to this.”\nI sat there, befuddled. Mother had sent me here; surely she was already a party to it. And if I came back this early with nothing to tell her, she would assume I’d skipped the appointment completely.\nI hesitated at the door and watched the clouds scudding across the pale green sky. The school was on holiday, so I had no work there to catch up on. Maybe I could kill some time at the council chambers. Nothing like a good political debate to fill the afternoon.\nJust as well none of the boys at that long-ago party had asked my opinion on the question at hand. I would have told them. Not that any juvenile’s opinions mattered. In the long run, the council bowed to pressure from the spacers and allowed implants to be used on the job. Penalties were high, though, for personal use; use outside the space support complex was cause for deportation.\nDelaying my return home didn’t matter in the end. I paused to touch the mezuzah before I entered the house. Mother sat, waiting for me, back straight and stiff, on the chair in the foyer. I was to be questioned, and with the length of time I had been gone, she wouldn’t believe the truth. I told her a half-truth.\n“She says I’m . . . a difficult case. She needs time to find someone suitable.”\nHer eyes narrowed—enough for me to notice, but not enough to crease her perfect skin. “How much time?”\n“I’m to come back at the end of next week,” I said. Next week, after my birthday. Would she see the importance of that? I didn’t see how, as I didn’t understand it myself.\n“Very well. I’ll drive you there myself.”\nIf her only worry was that I wouldn’t go—well, that made sense. I wasn’t even sure myself why I planned to go. Certainly not legal compulsion, nor the full weight of guilt that Mother had been bearing upon me for years. Curiosity, I suppose. You don’t have to be full-legal to enter a marriage contract, not even limited dalliance or child-bearing ones. What could the shadchen have in mind?\nI brought my attention back to Mother. “That’s not necessary. Really.”\n“We can discuss it later.” A crease in her upper lip was the only visible sign of her displeasure. She changed the subject. “You didn’t go see her looking like that, did you?”\nI glanced in the mirror over the hall table. My hair had been tossed a bit by the omnipresent wind, but otherwise I seemed presentable enough. “Why not? You chose this outfit for Ben’s swearing-in ceremony.”\nMy cousin Ben was on the Spaceport council. He’d barely won the election for his district, even with Mother and Aunt Nomi calling on all their friends to exert pressure on his behalf. He’d been in office a scant month now, so I was fairly confident the clothes hadn’t gone out of style just yet.\nHer hands flew up. “Why do I even bother?” She addressed the ceiling, as she had so often while I was growing up. Or maybe she was talking to my father’s ghost. I’d never had the nerve to ask. She looked back at me. “That was a political occasion, in support of family. This dress is completely out of place in a business meeting where you are trying to impress someone with your future prospects. You’ll have to have something more suitable next week. Yes, perhaps a visit to ReeAnn’s shop.” She frowned. “No, ReeAnn is working on the outfits for your party.” Another pointed birthday party. Wait—outfits? Plural? “We’ll have to use Kendra this time, I suppose. It’s really too bad you don’t have a cousin your age to borrow from.”\nAs if that were my fault. She should take it up with Aunt Nomi who had, after all, been given a choice with Ben. Mother’s system rejected the sex selection drugs, but Aunt Nomi had an iron stomach. Personally, I was always amazed that the drugs had dared disagree with Mother. Not many things did.\nCertainly Kendra didn’t. Mother was already on the line to her. I couldn’t hear Kendra’s end of the conversation, but Mother’s tone spoke volumes. A few sentences, and anyone would agree with her out of self-preservation.\nMy own levels of self-preservation were high enough that I never overtly disagreed with her. I simply didn’t voice opinions.\nKendra made time for Mother. We would be at her shop tomorrow morning. My measurements could be sent to her—were, in fact, on file. Kendra would use them to ensure that everything we examined would be in my size. Mother didn’t really need me there—a hologram would do as well for color, style, and bearing—but she wanted me there. As I said, no overt disagreement. There went another day of my life.\nAs it turned out, the day wasn’t a complete loss. Mother had a Hadassah meeting in the afternoon and had to rush off right after the fitting. If Mother wasn’t there on time, Elizabeth Holin would push through all of her own pet projects. I’d gone to a meeting once; it was amusing yet frightening to realize Mother wasn’t the only fiercely stubborn woman around. Their clashes were entertaining, but Mother expected me to back her up. I found it easier to not attend.\nMother was very understanding when I said I had other commitments. I had already agreed to become an active member when I got married, a time that evidently neared. My anticipation knew no bounds.\nMother left me at the door of Kendra’s shop. “I know you’re much too busy to accompany your poor old mother to her meetings. Don’t think anything of it.” For her, this was understanding.\nI resisted the urge to roll my eyes. My poor old mother played racquetball twice a week and frightened bullies in the street, and I pitied anyone who had the lapse of judgment necessary to call her “old” to her face.\n“I’ll be home a little late for dinner,” she continued. “You go ahead without me and I’ll find something when I get home.”\n“Don’t be ridiculous.” My lines slid out with the ease of long practice. “I wouldn’t think of starting without you. You go ahead, and we’ll eat when you get home.”\nAfter several more exchanges along the same lines, reinforced with her mention of rugelach should I need to nosh, she finally left, catching the A line toward Aunt Nomi’s house. I watched until she was out of sight before setting off in the opposite direction. I’d heard that the library had new copies of twentieth-century political speeches from Earth. I wish they had more kurzan material for comparison, but there wasn’t much demand for it.\nI had always wanted to go to Earth, to study politics at one of the real universities, in Cambridge or Melbourne or Shanghai. Even I knew that it was a hopeless dream, but I still studied everything I could get my hands on. A more realistic idea would be to have the chutzpah to run for office. All I had to do first was grow a backbone, move out, and survive the guilt. Realistic—right.\nWhen I got to the library, somebody else had already reserved the speeches, and the visuals room was occupied. I hadn’t expected that. After I joined Hadassah and began to organize charity functions of my choice, I intended to begin at the library, updating their site licenses and their tech so that more than one person could look at archived material at the same time. Very definitely tikkun olam.\nThe librarian tried to be helpful. “Is there something else I can get you instead?”\nI tried to think of alternatives. I’d already read all their Hebrew-language archives, but not all the cultural information. Most of the material they had on the Shoah, though, I’d need the visuals room for, so that was out.\nThe talk at council the previous day had been on farming and pollutants and which space company thought the Spaceport’s fees were too high now. One motion, quickly tabled, concerned some cross-breeding experiments. That might be interesting to follow; I asked for a simple genetics text. I’d look up the details of the bill later, after I got home.\nThe mathematics and probabilities were as dull as I expected, but the history was fascinating. The text even had a chapter devoted to the eugenics attempts under the Third Reich. I thought of my many-times-great-grandmother and her release from Dachau. I already knew this history, but I read with interest about the experiments in Earth’s twenty-first century to decrease activity of monoamine oxidases as well as to increase levels of the dopamine receptor associated with risk-taking behavior. Earth wanted space pilots and people willing to brave the far reaches of space. But risk takers don’t settle down, and so entire new families of drugs were born. The drug trade ramped up. The politicians should have seen that coming.\n“Seen what coming?”\nI hadn’t realized I’d spoken out loud. “Excuse me—” I looked up.\nHe smiled. The smile was so perfect, right down to the dimple in his left cheek, that it took me a moment to process the rest of his good looks—black hair, tan skin, grey eyes.\n“Wow.” I bit my lower lip. I knew I’d said that.\n“I didn’t mean to interrupt.” He put his left foot up on the table next to my chair and leaned on his knee. “I was waiting for a good moment. The librarian told me you wanted to use the visuals room.”\nI nodded. Behind him, the clock on the wall showed a quarter after six. Four hours! I’d lost track of time. Mother wouldn’t have been that long at Hadassah—not since she’d given up finding leads for marrying me off, anyway. I stood up. “I have to go.”\n“The room’s free now. I even asked the librarian to leave the vids keyed for you.” He pulled back but didn’t put his foot down.\n“I’m sorry.” He was looking at the speeches? Gorgeous and interested in the same things I was. If only I could stay. “I didn’t realize it had gotten so late. I have to meet . . . someone.”\n“Maybe I’ll see you another time, then.”\n“Maybe.” He hadn’t moved, and I had to push past him to drop the genetics book at the counter. “I’m in here a lot.”\nHe probably hadn’t heard me and wouldn’t have cared if he had. Mother said I had my dad’s nose. I guess that could have been it, although I figured no one in his right mind would want her for a mother-in-law.\nAs I’d expected, Mother acted worried when I got home. “I was afraid something had happened to you.”\nI walked past her to the kitchen. “Not this time,” I said. “I am hungry, though. I’ll just whip us up something, shall I?”\nMother didn’t rise to the bait. If Mother didn’t want to feed a hungry child, perhaps she really was worried.\n“I expected you to be home when I arrived.”\nI stopped and turned. “I’m sorry. I should have signaled you.”\nWas she going to forgive me? Well, no, but she might let it go for now, to be dragged out later in one of her litanies of my failings as a daughter.\n“Yes, you should have.” She walked away. Over her shoulder, she said, “Don’t eat too much. There isn’t enough time for either Kendra or ReeAnn to alter your dresses.”\nNo family meal, then. Fine. I grabbed a cheese sandwich and a glass of milk and curled up to think about the stranger in the library. I should have read the cross-breeding bill instead, but he was more compelling. Something about him shrieked outsider. Maybe a space captain, passing through. But then where were his implants? Ah, well, a gal could dream.\nAnd dream I did until the morning of my twenty-first birthday. Mostly. I did eventually read the bill.\nI’d assumed it would be a bill for funding at the college—some new strain of wheat with more fiber and vitamins, or livestock that would grow in a tank so we could put yet larger buildings on what was now grazing land. Scientists were always promising things like that and instead creating chickens that could lay striped eggs with yolks that glowed in the dark.\nThis bill was different. It claimed to be “to protect the purity of the human and kurz races.” In an attachment—not part of the bill itself but clearly meant to influence its passage—one of the sponsors told a story of his father, whose genetic material had been stolen and used to impregnate a kurz female.\nThe bill had lots of language in it about the protection of the two species and about how cross-breeds could serve as vectors for illnesses to spread from one to the other.\nIt was a marvel of statesmanship. It had to be, to allow every artificial method of procreation, every drug, every choice we’d given ourselves about our children, yet disallow any hybrids. It stopped short of barring kurz procreation on a planet where there were humans, but not by much. The hints were there for anyone who’d studied politics and history. This was just the beginning.\nIt stank worse than a roomful of kurz after a softball game.\nI still hadn’t decided what I could do about it. Ben was too busy to talk to me, although I left several messages at his office.\nToday, though, I wouldn’t worry about it. Today was the day I went back to see the shadchen, the day I accepted Mother’s wish to find me a husband. I really didn’t care. I had a job; I had ambitions. I even had a cause. I didn’t need a husband. It was my mother who wouldn’t give up.\nBefore getting dressed, I paused to look at the yellow star hanging on my wall. The faded ancient fabric was framed behind glass in a controlled atmosphere that prevented further deterioration. I stroked the wooden frame. Had that distant ancestor married for love, or had she, too, been to a matchmaker? I knew she hadn’t met her husband until after the war. I wondered what her dreams had been. They hadn’t been passed down from mother to daughter as the star had been.\n“I remember,” I whispered.\nI pulled out the dress and overskirt that ReeAnn had insisted would be perfect for meeting my future husband. I felt like an idiot with the skirts swishing and swirling as I walked. It was the price I’d had to pay to go alone.\nThat wasn’t the way these things were done. The shadchen should have met me to size me up for herself. Then Mother would take over, whether I was difficult or not. Mother should meet with Miss Berazazz and my future husband and mother-in-law to work out the details. Only when the contract was sealed would I set eyes on him. There were several arguments I could have made; I used the simplest.\n“The shadchen said we should do it this way.”\nThat was that. Not even Mother would offend a matchmaker willing to take my unruly self in tow. And so she sat once more in the uncomfortable chair by the front door and waited for me to come down the stairs in my new finery, waited to say good-bye to her grown-up daughter who would finally get married, waited to take one last stab at my self-esteem.\nShe stood as I approached the landing. “You’ll do, I suppose, but would it have killed you to do something with your hair?”\nAnd there it was. I touched my hair self-consciously. “Short of cutting it all off, this was the best I could do.” I paused in front of the mirror and pulled my hair off my face. “I could try that. Might start a new trend.”\n“Your father must be spinning in his grave to hear you talk like that.” She pushed me at the door. “Go on, then. Try to remember to be a lady.”\nAs if I could forget in this get-up. I thought about turning back, but ladies do not renege on their word, even if they didn’t like their options. I didn’t even know my options. Miss Berazazz might have already chosen someone, someone I couldn’t stand. I quailed. The only thing that pushed me forward was the thought of telling Mother I didn’t go.\nI pushed the door open.\nA kurz looked up from an armchair. His eyes were the same deep green as the edge of his frill. “Yes?” he asked.\n“I’m sorry.” I tried to back out of the room while still talking, but my overskirt snagged on the door. I tugged at it without looking. “I didn’t realize someone else was . . . I was looking for . . . I’ll come back later.”\nHis frill rose in mild surprise. “Do you think you should do that?”\n“Come back? Yes, I’m expected.”\n“No, not that. I meant—”\nMy overskirt tore. I stopped pulling, but it was too late. A large piece of fabric remained caught on the bottom of the door, and the skirt itself was beyond repair. I felt my ears growing hot with embarrassment and knelt to pry the fabric loose, letting my hair fall forward to mask my face.\n“Here, let me help you with that.”\nI inhaled to argue and stopped in surprise. “You don’t smell.”\nHis frill rippled. “I beg your pardon?”\nMy face should have been in flames based on the heat I was feeling. “You—I—kurz always—I’ll shut up now.”\n“Not on my account, I trust.”\nI was spared from answering because Miss Berazazz entered from the back room at that moment. Her frill rippled when she saw the two of us together at the door.\n“I see you’ve met my son.”\nI learned a lot in the next few minutes.\nKurz mating habits are reasonably close to human, although they’re compulsively monogamous. Miss Berazazz had chosen the courtesy title “Miss” based solely on how it sounded to her. She was married, he was off-planet, and Chur-kil was their only child.\n“Which brings us to you.” Miss Berazazz finished spieling off history. “You need a husband. My son needs a wife.”\nI gaped at her. Our species weren’t even from the same solar system. I had more in common biologically with chimpanzees than I did with any kurz. Then there was that bill before the council. “But—we’re incompatible.”\n“I don’t know. I thought we were getting along pretty well.” He had the nerve to wink his right eye at me, and I blushed again.\n“Perhaps not so incompatible as all that. Chur-kil is the first generation of . . . an experiment.” I stared in horrified fascination as she triggered a holo on her desk. It could have been the older brother of the man I’d met in the library, identical except for blue eyes, streaks of gray above his ears, and a ridge of sensor implants under each eyebrow. “His father.”\n“That’s not possible,” I said. But I remembered the stolen genetic material mentioned in the bill. I bit my lower lip. “Do you have documents?”\nI blanched. Mother would’ve found the rudeness unforgivable, but Miss Berazazz didn’t even wave her frill.\n“Certainly.” She used her monitor to call up copies of her marriage certificate and Chur-kil’s birth certificate. They could have been faked, but since I could access the information from the central database, there wasn’t much point.\nI leaned back in my chair. “And he’s the actual father?”\n“We’ll give you the medical records later, but right now, hear me out. As I said, my son is the first generation. We want a second generation, one that will be able to breed freely with either parent race. That’s where you come in.”\nThis was why I had to be twenty-one. Mother would never have listened to this. It wasn’t illegal; no one thought it possible. But Mother, a blessing on her head, had always wanted me to marry—\n“I don’t suppose you’re Jewish? Or a doctor?”\nWas I really considering this? So I’d never see Earth. That had never been realistic.\nChur’s frill was ruffling again. I watched, confused.\n“Neither, I’m afraid. I’d be willing to convert, but I’m afraid a bris is out of the question.”\nMy mouth opened. Pause. Think about what you’re going to say. “I’m afraid the rabbi would insist.”\nMiss Berazazz—his mother—cut across our interchange. “Did you pay no attention to comparative anatomy in school?”\nI shrugged. “I learned science from test to test.”\n“Kurshall keep us all safe!” She leaned across the table. “Physically, you may be compatible enough to join, but there is no foreskin.”\n“So your entire race is circumcised. Even better.”\nThis couldn’t be real. I didn’t joke about such things. Mother would be appalled to hear me even discussing them.\n“More or less.” His brow creased, and the corners of his mouth turned up. It didn’t come naturally to him, but he was trying to smile. I found it charming, even if he had been practicing long before he’d heard my name.\n“What exactly do you want me to do?”\nThe marriage license was already made out. The ceremony could take place immediately. Accompany Miss Berazazz to a clinic the following day, and by the time my party rolled around, I should be well on my way to being knocked up. We could try for future children the old-fashioned way. Only one thing hadn’t been taken care of.\n“I didn’t know where you’d want to live.” He touched the back of my hand with a single finger.\nI pulled my hand away, leaned back in my chair, and rubbed my temples. What would Mother say about a kurz for a son-in-law?\nI went back to something tangible. “I met someone the other day who looks like your father.”\nThey exchanged looks. Miss Berazazz said, “My husband had a child from his first marriage. Chur-kil’s brother . . . never accepted his father’s remarriage. He may be here to cause trouble.”\nThat perfect smile, those grey eyes. I looked at Chur-kil. His frill was flat against his head. I didn’t want to be superficial. I didn’t. And yet . . .\nI opened my mouth to refuse.\n“Life won’t be easy for our children,” he said. “But with time, more time than we’ll see, our peoples will truly be one.”\nThe wistfulness in his voice struck a chord in me. They had a glorious vision. I came from a people proud to be set apart, a people he was willing to join. But he’d been planning this for a long time; I hadn’t. I wouldn’t rush into anything. I told myself it had nothing to do with his brother’s dimple, and I almost believed it.\nI pushed my chair back from the table. “I need time.”\n“Of course.” Chur looked disappointed but nodded.\nHis mother was less understanding. I’m used to dealing with mothers, though, and she was a pushover compared to even Aunt Nomi. I promised to return in a week with a decision.\nChur walked me to the door. “I’m sorry about your skirt.”\nTell him it had been bought for the occasion? No. “It wasn’t my favorite.”\nTime to go home and re-read the bill. Marriage would be making a stand, but it had to mean more than that, more than green eyes and a forced smile. I had to think. First, though, I had to decide what to tell Mother.\nI couldn’t—didn’t—tell her all the truth. Fortunately, when I walked in with a torn skirt, Mother’s attention was all for that. “How could you? It wouldn’t have been suitable for your party, certainly, but it could have been part of your trousseau.”\nJust like that we were on the subject of my marriage.\n“Perhaps.” I twitched my skirt and moved past her to the stairs.\nHer voice stopped me. “Young lady.”\nI’d had the entire trip home to think about what to say. Except I was thinking about the marriage proposal, legal threats, in-laws who smelled, and talking to my rabbi. Chur had been . . . nice. A vague word, but it fit. He was pleasant and witty, completely agreeable.\nAnd he’d winked at me. No man had ever winked at me, except for Uncle David when I was a little girl. Chur didn’t care about my dad’s nose, about what I looked like—so far as I knew, all he did care about was that I was unmarried and twenty-one.\nNot exactly a ringing endorsement.\nI sighed. “He was friendly, but I’m afraid his mother will try to run our lives. I asked for some time to think about it.”\n“I see.” The infinitesimal eyebrow lift. “Is he at least Jewish?”\n“He says he’ll convert.” I kissed her cheek. “But I do need time. You wouldn’t want us to name our first-born child for someone on his side of the family, would you?”\nWith that, I breezed past her and up the stairs. Everything I’d said was true. I’d only left out the fact that he was kurz. Not fully by biological standards, but to all appearances. I wasn’t looking forward to that conversation.\nI worried at the decision that day and the next and the day of my party—even as I prepared to greet my guests, I wondered what they would say if Chur stood next to me.\nA surprise guest showed up at my party—the handsome stranger from the library—Chur-kil’s half-brother. I first spotted him with Ben and a couple of Ben’s cronies from the Spaceport council. I wanted to talk to them—Ben still hadn’t returned my calls—but hostess duty compelled me to chat with women who wouldn’t have been near my party if they had dared offend Mother.\n“I hear you went to a shadchen.” I couldn’t remember her name. Some vacuous person a couple years older than me, probably with two boys and two girls by now.\n“Mother’s idea.” Why elaborate?\nUncle David joined the conversation. “Historically, matchmakers create more lasting unions than personal choice does.”\n“Historically,” I replied, “there wasn’t usually a way to dissolve a marriage short of murder.”\n“Interesting. Are you looking to hire somebody for the job?” It was the stranger. Ben stood next to him.\n“I’m not married yet, so I’m afraid it would be premature. I can take your references to keep on file.”\n“Alas, I have none.” His smile was as charming as I remembered.\n“Do you at least have a name?”\n“My apologies,” he said at the same time Ben said, “I brought him over to introduce.”\n“The least you could do if you helped him crash my party,” I said.\nBen gave me his standard exasperated cousin look. “May I introduce Joe Yee? Joe’s recently arrived at the port and is crazy enough to want to make it permanent.”\n“The lure of the unknown,” Joe said. “As well as the fascinating beauties on your planet.”\nBen coughed. I ignored him, even though I didn’t blame him. I tried to keep the frown off my face. I was certain Joe was here to cause trouble for Miss Berazazz and Chur, but what in the world was he doing at my party?\n“What would you do here?” I asked.\n“Oh, no. You’re going to set each other off,” Ben said.\n“I was thinking of going into politics,” Joe said.\n“I suppose you lapped up all that arguing about the different spacer companies the other day.”\nHe shrugged. “I’ve heard it all from the other side. What do you think of the recently tabled motion on cross-breeding?”\nWas he actually going to announce his views? I said, “I’m no biologist. What about you?”\nHe spread his hands. “I’m afraid I haven’t studied enough of the particulars to have an opinion yet.”\nUncle David snorted. “He’s a politician, all right.”\n“A pity,” I said. “Perhaps you can explain it to me after you’ve had time to study it.”\n“I’d be delighted.”\nLater, I managed to get Ben off by himself, but only after promising I wouldn’t talk to him about any of the bills facing the council. I asked him about Joe. “I could swear I’ve seen a picture of his father.”\nA shrug. “It’s possible. His father’s a captain on an interplanetary run. The news often has pictures of one or another of them—usually when something bad happens.”\nMorbid curiosity and gossip. That just about sums up news. I’m not above it myself, but Ben didn’t know about any other family Joe might have. “I thought you had an engagement just about ready to announce.”\n“Nothing’s final.”\nMother found us talking then and chased us back to the party. I wasn’t being a responsible hostess, and it might not be too late to catch the eye of the Governor’s younger son. As said son had a wandering eye and hands to match, I wasn’t as enthusiastic about the prospect as Mother was. I followed her across the patio toward him anyway.\nHelp arrived from an unexpected source. Joe caught my arm. “You promised me a dance.”\nMother, never one to complain about a gift to the giver’s face (unless you were family, and then it wasn’t so much a complaint as a megillah of what the money could have been better spent on), pushed me into his arms and glided off to speak to Aunt Nomi.\nThe song was half over, but I went through the motions. Dancing doesn’t thrill me, although the feel of his hand on mine did strange things to my heartbeat. When the music changed, Joe would have kept dancing.\nI drew him to a nearby bench. “I thought only elected officials refused to give an opinion.”\n“I don’t want to say anything I might regret later,” he said. “People would expect me to live up to it.”\n“You haven’t been involved in politics before, have you?”\n“So young to be such a cynic.” He brushed his lips across my hand while looking into my eyes. It was a romantic gesture, even if I did see the flash of a sensor implant on his upper lip. He wouldn’t be using it away from the transport sector, not with the penalties. The texture implied simulskin on the surface, and most girls probably never noticed it was there. I wondered what he was wired for.\nI left my hand in his. I looked at the hands, not ready to meet his gaze.\n“Perhaps you’ll make a true believer of me yet,” I murmured.\nHe leaned in close. “But a believer in what?”\nMy eyes widened at his tone, and I looked up. His eyes were narrowed, and the charming smile was gone. His grip on my hand tightened.\nHis voice low, he said, “Do you know what you’ve gotten yourself into?”\nThe music changed again. People moved past us to the dance area. I pulled at my hand, but he didn’t let go.\n“What are you talking about?”\n“The kurz. Don’t deny it. Their pheromones cling to you like sewer water.”\nThe sensor must be good to pick it up after two days.\nI shrugged. “Mother sent me to a shadchen. I was surprised to find she’s not human, but if she finds me a husband, it clearly doesn’t matter to Mother.”\n“If you’re not telling me the truth, I will find out.” His sneer marred his good looks. “I know of their plans to pollute the human race with their filth. I’ll stop this—”\nI couldn’t prove he’d used the implant. And if I accused him, it would just give him one more opportunity to air his bigotry when he got his day in court. Distasteful as he was, I had to get him out of here without that satisfaction.\nIt was time to be outraged. I’d spent years watching Mother do it; time to see if the passive lessons paid off. My voice rose just enough to cut across the nearby din. “Is that why you came here uninvited? There are standards of behavior in this community.” I snatched my hand back with great force.\nA few heads turned, but Joe couldn’t see them from where he was. He said, “Don’t flatter yourself. I’m checking all the unmarried local women.”\n“My, a libertine or desperate. Perhaps both.” I knew that wasn’t what he meant, but the onlookers didn’t. I stood. “I’ll thank you to leave now.”\nHe looked as though he wanted to say something else. Then he saw Mother standing next to him. To his credit, he didn’t blanch.\n“I believe my daughter asked you to leave.” Nothing colored her voice. “My nephew will be happy to show you the way out.”\nBen didn’t look happy. Joe had come with him, and he was going to get an earful from both Mother and Aunt Nomi later. He put his hand on Joe’s shoulder as if he’d ejected men from parties before. Maybe he had; Ben went to parties where that sort of thing might happen.\nThe incident effectively killed the party. Clusters of people stood about, talking quietly and casting furtive glances at me when they thought I wasn’t looking. Look at the freak who chased off the only eligible man to show any interest in her ever. If it hadn’t been my party, I’d have pled a headache and left, but a hostess has responsibilities—as though Mother would let me forget.\nI was duly grateful as my guests began leaving in twos and threes. Many of them still wouldn’t meet my eyes. Mother stood beside me, smiling and chatting. I was doomed as soon as the last guest left. I knew it.\nThe door closed.\nI pursed my lips and looked at the nearby chair. “Does that leg look chipped to you?”\nThe ruse was pointless. She looked over swiftly, then returned her gaze to me. “It’s fine. You, however, have some explaining to do.”\n“I didn’t mean to make a scene, but he was being rude—” inspiration struck “—and crude about my visits to Miss Berazazz.”\nRudeness one should rise above. Crudeness, on the other hand, was just not done.\nHer left shoulder seam pleated a trifle; she had relaxed. I wasn’t clear of port yet, though. “You know what I think of you bringing up such matters to strangers.”\nThat one I was prepared for. “Talk circulates at a party, Mother. You know that. I’ll talk to Ben about his choice of companions.”\n“You needn’t bother, child. I will—”\n“I was hostess. It’s my responsibility.” I hadn’t interrupted Mother since I was two years old. My neck prickled, and I could taste acid in my throat. I bit the inside of my lip. I wouldn’t get sick now.\nFinally, she nodded. “I might still have a word with Nomi about how she’s raised her son, but as you say, it is your responsibility.”\nI don’t remember going upstairs to my room. Shock will do that. I had to get Ben on the line. Not yet, though. I wasn’t sure he’d be home. Maybe Ben would be willing to arrange Joe’s quiet deportation for illegal use of implants if I protected Ben from our mothers. It was worth a try. No need to tell him I’d already saved him from mine.\nJoe had spoken of polluting the human race. I’d heard that line of rhetoric before.\nI crossed my room to face the faded cloth star and ran my finger over the glass as though I could touch the fabric. “Never again.”\nChur was more human to me than Joe would ever be. He’d make a good husband. I made a call. “I think you should talk to my rabbi. I’ll let him know you’re coming.”\nErin M. Hartshorn is a desert rat transplanted to a humid climate. Her ideal home has bookcases in every room. She is a moderator at Forward Motion for Writers, an on-line writers community. Her fiction has appeared both on-line and in print in various places, placed in the PARSEC short story contest, earned honorable mentions in the Writers of the Future contest, and been short-listed for the UPC Award. When she's not writing, she enjoys various handicrafts, though she prefers spending time with her family.", "source": "https://clarkesworldmagazine.com/hartshorn_04_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Matchmaker by Erin M. Hartshorn"}