{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "D A Xiaolin Spires", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "6jeTD1PjorVk2+e4z7QD8MBzsoQ=", "id": null, "license": null, "comments": "", "raw_text": "9760 words, novelette  Vault  Chenguang hikes up her sleeves before vaulting over the pile of fuzzy moss and greets Lukas with a nod. The chloropolyurethane fabric flaps in the slight breeze and the double suns beat down onto her arms.  Lukas fishes in his bag next to his tent for a bottle of sunsoak and releases the spray, running it generously over his solflex-covered arms, torso, and legs.  “Your head,” Chenguang says and he smiles, as if he hadn’t been doing this for years.  “Can’t reach,” he says, lying and Chenguang knows he just likes the attention. She grabs the spray and discharges that exhale of mist, covering his football-shaped clear helmet. She even sprays some on the clear hard arc under his bearded chin. She turns the mist onto herself, bringing down the spray over her exposed transpandex inner layer, the foam frothing up at her arms before becoming clear, encasing the invisible solflex pores of her fabric.  Lukas watches her as she sprays down. “That’s probably enough,” Lukas says. “You don’t want to drown yourself and run dry tomorrow’s supply.”  “Cheapskate.” But, Chenguang knows he’s right and slides it back in his sack. A coin catches the light. His comm. She grabs it. “You almost forgot this.”  “Like I would. And risk not being able to talk to you when we’re apart?”  “Very funny. Put it on.” He does, affixing it to his chest.  “I don’t know how you have it like that just dangling from your neck.” His voice comes through his piece and projects into her pendant.  “It feels nice. Plus I hear you loud and clear.” She stretches now, getting ready for the run. Her pendant chain slides about near her armpit. She holds it to her chest, reaffirming a silent promise to her sister.  “Won’t feel so nice getting snagged on a branch.”  Chenguang gestures out as she pulls up her leg. Near his tent, Lukas brings his head to his knees, arching his back and groaning. They wrap up the tent sheet around their legs, its fibers assimilating into their pants, attaching itself to their uniforms.  Chenguang kicks up her legs, feeling the lightness of the tent. She hitches the bag with the rest of her limited supplies onto her back. “Come on, old man. You see this wide expanse? Not a tree in sight.”  “Doesn’t mean there won’t be one.”  “I’m not too worried,” Chenguang utters before she starts off on a sprint. Lukas follows at her heels, his shoes sinking into the foamy terrain in rapid strides.  They jump, leap, roll, wind up, and do it again. Their legs traverse the terrain of Sugue, picking up speed like a vacuum picks up dust. Chenguang feels the wind in her hair and sprints past a tangle of mossy vines. Out of her peripheral vision, Chenguang sees Lukas next to her jumping over a mound and kicking off a verdant growth to spin into a roll as he keeps going. He’s showing off, telling her he can keep up even doing spins. She picks up the pace.  When the wall arises before them, she leaps up and attaches herself like a cat, her transpandex fingers reaching over the top. Her body sinks into the wall, as like everything else, its façade is full of moss. Her right leg kicks off and she reaches with her arm, throwing herself over the edge. Her hand slips.  Lukas is right behind her and his geneblazed thigh muscles have no trouble leaping up and perching on top. He offers her a hand. She grimaces, lets Lukas’ hand dangle, and picks herself up.  She feels the solflex suit, covered in spray, picking up the heat of the sun. She takes a second to catch her breath, as Lukas adjusts his helmet. The sun warms her and at the corner of her helmet, the hololight shows the power’s at half capacity, filling up notch by notch. She needs to be faster.  “Mine’s saying two-thirds full,” says Lukas, as if reading her mind.  “Yeah, mine too.” Chenguang’s not lying, she tells herself. If she squints, it kind of looks like the bar’s higher.  “You think we’ll meet quota before the suns set?”  Chenguang’s mouth beats her brain. “Yes, definitely. Or else you can have my thermal blanket.” She shuts her eyes, wishing she hadn’t promised that.  Over the wall, the hills fill their eyes. Beyond that is the industrial wasteland.  They only stop running and leaping after their feet, backs, and arms map out their jaunt through the hilly stretch.  Chenguang’s muscles ache, but she doesn’t want to admit it. She shakes out her legs, pulls back her neck. There’s a change going through her. She used to be able to run for days without pain, but then again, she used to be able to jump twice the height Lukas jumped earlier today at the wall. Today, she barely got past it.  “Hey, you okay?” Lukas looks genuinely concerned. Probably for himself. He knows he can’t do this alone.  “Yeah.” She stares at the industrial wasteland. The two suns are waning now, Solah closer to the horizon than Soloh. Lukas’ hazy shadow lengthens against the concrete at the hill land’s edge. His green eyes glint in the pink of the dual-sun evening light.  “You have the Eazslap?” she says.  Lukas undoes a pocket at his triceps and pulls out a few blue-glowing stickers, disengages them from each other. He selects two, hands them over to Chenguang.  “It can’t be that bad, can it?”  “It’s not. It’s just preventative. Besides, the sticker will provide some light, now the suns are retiring on us.”  “Barely,” says Lukas, under his breath.  Chenguang keeps her eyes bright and open as she slaps them on, even as the telltale searing pain reaches her knees. She’s not going to give in with any wince or reaction. The stickers release inflammation inhibitors; the burst of prickling tells her that much at least.  “What’s your charge say?” Chenguang asks. She feigns nonchalance, ignoring quivering knees.  Lukas’ pupils veer right and his hands twitch, moving phantom controls. Chenguang watches as he waits for the bar graph in his view to convert to a figure.  “93%. I figure we’ll be in the sun for another ten minutes. Not running and leaping, so it’s not going to climb exponentially.”  “It’ll probably get up to 95%.”  “Yeah, that’s pretty safe. I’ll be in the clear all night. How about yours?”  “89%,” Chenguang says. She grits her teeth. More like 72.  “That’s pretty good,” says Lukas. “Well, 95’s not 100 but it’s pretty close. I guess I won’t be needing your thermal blanket. I’ll do okay with my own.”  “You can have it. I promised you 100%.”  “Nah, it’ll just get too hot.” But Chenguang knows that’s not true. The blankets optimize for perfect temperature, no shivering and no sweating, no excess heat or cold. With two blankets, once the batts run out for the night for the first, the second one would take over. Without it, they’ll just have to do with the dire chill. Negative fifties or so degrees Celsius chill.  They bask out in the sun, drinking up its energy. Lukas just lays back, but Chenguang’s arms and legs scissor open and closed. Jumping jacks to accelerate absorption. Any movement prompts magnified absorption rates, but running, leaping, and gaining ground does it most. Something to do with your heart rate, acceleration, and even psychological thrill all interacting with the inner solflex machinery—amplified, too, by a generous coating of spray.  She huffs, scissoring her arms and legs, as she watches their shadows get longer and longer until they merged with the dusk that surrounds them.  Dinner goes by without a word. There’s really not much to say chewing on vaprabars. Can’t really comment on the taste because it’s just coagulated nutripowder. Chenguang grabs a second but Lukas’ hand comes down on her wrist. “There’s too much iron in it,” he says. “It might interact with Eazslaps.”  “Really?”  She gives him a look like she might bite his hand and he pulls back.  “Suit yourself,” he says, but she’s already tossed it towards her pack. It clatters against her helmet and tumbles to the ground. The bright sleek wrapping stands out against the dull, dark concrete, reflecting the artificial light emanating from the ray fabric, slung up against a ledge.  There is no natural light tonight. Clouds have completely enveloped this planet’s one moon. They rely on the ray fabric and its harsh white light.  Lukas whistles as he sets up his tent. Chenguang remembers the song as she starts to emancipate her tent fabric from her legs and spread it out before her.  “Clear, the White Waters,” she says.  “Where I was from, it was ‘Cool, the White Waters.’” Lukas says. He pulls off his coin comm and drops it into his upturned helmet.  “What it would be like to get in,” she says. She sits down under her half-pitched tent, waiting for it to inflate. She stretches out her legs. “To envelop in water.”  “You are enveloped in water. Made of it,” says Lukas. He’s un-creasing every bit of his tent with his transpandex-covered hands.  “You know what I mean,” she says. “I remember when we had water. Trickles to splash on your eyelids. Mist to clean off your skin, your elbows.”  “That was years ago and worlds away. Better to focus on the project at hand.” Lukas was systematic in his manual un-crinkling. Even if it would be done by the inflator anyway. His thoroughness reminds Chenguang of how he runs and leaps, methodical, making sure to cover the ground and air, checking for sharp edges with the heightened instinct of his body as they’re trained to, even in his lightning speed. She sees that concentration all day running through his aerodynamic mask, in that focused look in his eyes.  “You think the capballs will really generate enough power?”  “It’ll make a lot more than we can.”  “Enough to rent all the tech? The hydrogen harvesters, transporters, and hydro-generators for Claris?”  “It’ll do some. But, you might not want to hold your breath on that liquid immersion.”  “A bath. They called it a bath.”  “Yeah, well, the best you can do is dream about it. We’re about to enter wasteland tomorrow. And the specs say that’s as dry as bone.”  “Bone? But, that’s us. I thought we’re made of mostly water, you said.”  “Bone, desiccated, nothing but bone, bone. Pinch dry. Like everything else in this sector.”  Chenguang massages her knees, looks out into the wasteland, the geometric shapes of a past civilization, now all dried to stone.  Before she can duck into her tent, Lukas walks over, fishes in his bag, passes her a package with an attached flexstraw. A sippee. About a cup’s worth of water in a bag. “Won this years ago as a medal. Parkour championship. Been holding onto it, weighing me down.”  She looks at it, feels the weight. It’s liquid, all right.  And Lukas has been running with this strapped to him this whole time? She looks up at him, but he looks down, veiling his expression.  “I can’t take this—”  “Take it. It’s dragging me, slowing me down. And you need it for your knees.”  “No, I’m fine—”  “Then do me the favor of helping me get rid of this. I don’t have what it takes to appreciate it. To me it’s all the same. Whether liquid’s shot-fed through skin microhydro-generators from tiny spurts of hydrogen and oxygen or if I gulp it down in one go through my esophagus. Makes no difference.” He looks up and gives her a nod. Chenguang sees a hardness in Lukas’ eyes, a stubbornness that won’t back down.  “But you’ve never tried gulping it.”  “I have. I’ve won more than one medal. A pretty good sprinter and leaper before you. Please, as if they’d send anyone less than a champ to work with you.”  Chenguang stares at Lukas who’s doing squats, with a huge grin on his face, as if to prove his point. His eyes, though, belie something. Regret, possibly.  “Alright, thanks, Lukas. But, no more favors.”  “It’s not a—”  Chenguang ducks into her tent, swipes on her thermal blanket as the chill settles in. She pulls the squishy package of water onto her chest, and watches it rise and fall underneath the blanket.  Water, she thinks, as her eyes fall to a close. She’s never had so much at once, not since twenty years ago, when she was eight and her grandma splurged on a pack. She remembers sharing it with her little sister, Xinyao gobbling most of it up and leaving her with only a mouthful.  In her sleep, she dreams of broken legs. Broken legs mean no levers for that fulcrum hip of hers to move, little heat generated for the night, and no work for creds to pay for her relocation debt. She calls out in her sleep.  She dreams of her mother and father, selected to fight the fires so rampant in her homeworld, never to be seen again. She dreams of their voyage, sent off for a better home. And Xinyao, orbiting with the Civ, still caged in a temp cell, waiting for enough water on Claris to emerge from the hive.  She thrashes about, in her half-lucid state. Her mind fixates on the sheer ingenuity of that tech borrowed from the High Institute, funded through expending collected resources of their homeworld. Their last big hurrah for their best and brightest. The journey, the rocket, glorious things the High Institute owns. She’ll probably never see interstellar tech like that again. Only capballs. Efficient, good for short distances. Sensitive old scrap low tech for low-end space riffraff like her. Low tech she has high hopes for. She dreams of it zipping by her, beating her in speed and grace, though she would be off planet by then. Once the capballs make enough energy for hydrogen tech rental, as they all hope, the zapping for water will be a cinch.  With a start, she remembers there is water balanced in a package on her chest.  Her leg aches.  Water.  She dreams of tasting it. It tickles her tongue, dapples in specks of moist cohesion on her lips, washes down in a surge.  When she awakes, she starts, thinking the package has broken and all its treasures have leaked out and seeped into the parched concrete, but she feels no wetness. It is still there. Intact. It’s warm.  She’s cold.  She realizes she awakes not from the nightmare of disappearing H2O, slipping away from her, but the reality of chill. She didn’t collect enough sun.  She breathes out. Sees her breath, precious heat and humidity escaping. She puts on her helmet and she feels immediate warmth, the last dregs of power still caged in there. But she can’t rest her head back onto her pack, not without the helmet’s aerodynamic wedge getting in the way.  That leaves her chilly body. The pack, at least, is warm against her skin. She remembers that water is a good conductor and the packaging’s got heat tech. She rubs the pack around her body, shivering. She pushes it under the blanket, willing it to stay warm under the covers as she swipes the pack around her.  The rubbing generates more heat and her hands are methodical, making the pack move in strategic ways, as strategic as the two of them, Lukas and Chenguang, like a pair of lone coyotes, traversing the landscape. They are mapping out the best course, the one that gains the most sunshine and surface contact with least amount of risk, so when the capballs are dropped, the tech will interact with the atmosphere and topographical elements of the landscape and accelerate with so much collected sun energy, multiplied by the mechanics of their whizzing speed and ground synergies, they’ll be priceless, chock full of power, when harvested.  Lucky so far that they’ve patched the sharp edges. The capballs fly fast and accurate, but one touch at a point and their vulnerable surface gives, puncturing the irreplaceable tech borrowed by the Civ at great cost to them. Even if it was belittled low tech, a drop in the bucket compared to the wealth and potential of the High Institute. When it comes to the High Institute, they’d find a way to collect for any broken rented tech, no matter how minor. Should the capballs touch an edge, they’d snap. Like apocryphal soap bubbles popping, childhood dreams of water gone.  Unable to sleep, Chenguang stretches as her parkour and acceleration trainer has taught her. She hears her trainer’s voice now, as she reaches over to her ankles: “Prepare the muscles, sharpen the mind. As a human you have an edge—instinct and corporeal sense. You’ve got a gift that no bot could ever replicate—somatics—an organic impulse that lies deep behind the geneblazed muscles and uniform-enhanced speed. There are phenomena on planets we can’t anticipate to program into bots. You’ve got the skills, the training. Don’t waste it, whet it like a knife. Focus. Breathe. Keep your eye on the goal.”  Chenguang rests the package of water in her lap. Pulls in her right arm, braces it in the elbow of the other. Her triceps draw taut, making her suck in a breath. She never thought she’d be a cartographer, using her somatic experience to create the map for sensitive tech, but sometimes she can’t think of any other job that would make her feel so alive.  She wonders how the other recruits are doing. Ayesha and Jayesh, her two best friends. Are they doing okay in Tilna? They volunteered together, unlike her, who volunteered alone and got placed with a stranger: Lukas.  Lukas. She held onto her warm water bag. He’s fast. Maybe she should’ve been paired with someone slower. She was once as fast as him, maybe even faster, but something on this planet’s pressing on her. Changing her.  Her eyes fall on the swirling inflator at the top of the tent, a tiny disk generator that pitched air along the inner surface tent. Rotating, it looks like a planet. She imagines it swarming with tiny beads, all charging along on its surface. There are dozens of planets in this solar system, all to be filled with accelerating capballs. All to be gathering energy for rental tech for hydrogen capture and water production.  For Claris. Their only hope.  She pulls in her toes, flexes her calves, then peels off the Eazslaps on their knees. They no longer glow, their medicinal blaze exhausted. She sticks it against the side of the tent, too tired to deal with it now.  She removes her helmet and tries to think of the hearth, snap noodles, and other hot things from home. Her fingers run along her pendant, with her comm on one side and a picture of her little sister, Xinyao, on the other. She falls asleep again, as the heat of the water pack penetrates her transpandex and warms her abs.  Chenguang shivers as she wakes to the break of dawn and the breaking of Lukas’ voice as he attempts to sing her awake.  “Stop.” She can hear him both through the tent and through the comm. The scraggly high-pitched pentatonic tune falters and grinds to a halt.  The water pack has chilled and she looks at it through the light of the morning. She can’t drink this now. There needs to be the right time, an occasion. Basking on concrete in the middle of Sugue, at the brink of wasteland, is no way to celebrate with a cocktail this precious. H2O, she slips it in her pack, glides out of her tent in a swift slide, and wraps it all up.  Once they wrap, strap, fold, and tie, they’re ready to set off.  This time Lukas jumps out first, his bound energy as taut as coiled springs, and he rockets forth as if pumped on juice, an old homeworld expression when juice once existed.  She follows behind, the twin suns already opening up the world with light.  They bound across the abandoned industrial landscape like two fleas on a bear, except instead of fur, stained concrete meets their lattice neoprene soles.  For all the time this place has been abandoned, no plant life breaks through the hardened cement. There’s a dispossessed feeling in the air.  “What happened to these people?” Chenguang breathes out as she runs.  “You didn’t take a look while you were stopping by base before the new assignment?”  “Didn’t get a chance. Was checking up on my sister in the hive at Civ.” Chenguang slips over a railing and Lukas vaults over it and lands on two feet.  “Oh, the hive. Sobering place. So, this here was Tneshtown. When I checked back on base, this industrial park long ago was the production center of kenophrane, the textile coating that housed the smart fabrics made to filter toxic chemicals.”  “Kenophrane? Hasn’t that been outlawed?”  “Yes.” Lukas jumps ahead and puts his hand on what looks like a smokestack before swinging his legs over it  “Let me guess, making kenophrane also involves releasing toxins.” Chenguang merely skirts around the smokestack-like protrusion before jumping over a gap.  “Yup, one of those pollute to get rid of pollution deals.”  “Guess they lost out.”  “Kind of. Depends who you look at. Many did lose out. There were mass deaths of workers, at least according to the base briefing. Violent stuff. First you get a rash and a cough, pretty innocuous. But then your hands turn red and bloated and you can’t work. You slowly go blind and your lungs lose function. Those were the common ailments.” Chenguang rolls from a jump as she listens.  “Pretty awful.” She sees Lukas hopping from one cement circular vat to another. The vats look like places for drying some liquid.  “That’s not even the worst stuff.”  “Do I even want to know?”  “Limb detachment and there’s more.” He pretend cuts his arm before using it to pivot over a gate. Then he runs and leaps across to the next building over.  “This is why I don’t like to read the briefings. It’s never ‘They all had perfect health and beautiful descendants and happiness.’” Chenguang follows suit but has to attach herself to the wall like a cat, barely clearing the ten-foot gap.  “If they did, we wouldn’t be here, staking out their derelict remains, mapping out their territory.”  “True.” Chenguang’s back met roof in an impeccable roll and she gets up without stopping. Her helmet cuts through the air as she leaps again.  “The unfortunate ones are the ones that didn’t survive long enough before the big move. But, they took all the able workers out of here once they created enough fabrics. They thought the fabrics they created would fix this place up. But, the fabrics couldn’t filter these toxins. They only did Grade C and the ones released here were some of the chemicals under Grade E.”  “Too bad. They did a pretty good job building these structures.” She swung her legs through a gap between a vat and what looked like a drying lattice.  “Yeah, they’re pretty sturdy.” Lukas tapped on the cement before doing a spin off a wall and onto another neighboring one.  “Good call. I think we need more spins.”  “Yeah, quadruple the solar intake.”  Chenguang pulls a 360 as she kicks off the ledge of a roof. She feels the rays coursing through the chloropolyurethane hitting the solflex absorbers and a ping goes off in her helmet alerting her of high intake rate achieved.  “I don’t know, Lukas. Some of this is pretty sharp. I think we’ll have to go through this again and note where the patches need to go.”  “Too bad we can’t just tear it down.”  “Historical planetary code. You know we’d be indicted by the High Institute in a hot second.”  “Yeah. But, I have to say. There’s something charming about this place.”  “You just like how the concrete feels against your legs when executing your spins.” Chenguang pulls another spin off, her spiral unwinding from her legs, when she missteps. She stumbles and catches herself right before a roof edge. She slips then.  Her heart jumps as Lukas grabs her arm.  It starts to slip, the transpandex of his fingers and her inner arm garment sliding past each other.  “Whoa.” Lukas pulls her up. His fingers slip again. Chenguang reaches with her other arm, pulling on the chloropolyurethane sleeve of his jacket, finally latching on to something with slight traction.  “Whoa is right.” Chenguang kicks up against the side of the building and pushes herself up. She looks down at the side as they catch their breath. That would’ve been a twenty-foot fall. Though a protrusion from the wall might have saved her a broken spine by breaking something else.  “You, uh, okay there?” Lukas does some jumping jacks, trying to maximize the solar intake.  “That was weird. I felt like something pushed me off my spin. You know spins aren’t so hard to control. Once you’re moving, you’ve got momentum.”  “I’d say. Some momentum. You nearly spun yourself out to a multiple-story drop.”  Chenguang sat on the side of a vat, her eyes shifting left to right and her fingers moving, calibrating the fabric to her nerves.  “It’s fine. They’re attached. But, just in case, I reconnected and connected them again.”  “You want me to check it? I mean, not to be forward, but I can usually feel the incongruities.” Lukas pauses in his jumping jacks, raises a brow.  “No, no. I think it’s fine. You know what it felt like?”  “Scary?”  Chenguang shakes her head. “Like someone pushed me.”  “There’s no one here but me, Chenguang. And you know I know enough not to pull any pranks.”  She gets up, looks over at the rising twin suns, and starts doing jumping jacks herself. After the chill of last night, she knows enough to try to osmose as much sunlight as possible.  They run again.  She’s feeling pretty good. She got in five vaults and three good rolls. She’s starting to forget about the strange feeling in the air, like being jerked off a trajectory when her foot slips at a jump. It doesn’t slip per se, it feels like it’s being pulled.  Helmet hits concrete as she bangs into a raised structure in the shape of a cone. Her head reverberates in the football-shaped piece of clear armor. She sidesteps and avoids falling over as she experiences a wave of nausea.  “Okay, that’s it. We’re stopping,” says Lukas. “Second time today.”  “No, no, I can go on. It was just a tug on my leg.”  “I think it’s time for a bar break.” Lukas sits down right where he is, onto the rooftop ground. No vat or raise-up to park his rear on in sight. The smokestack to his left comes up over his head and is simply too high, though he could probably scale it.  He looks like he’s contemplating doing so as he focuses his eyes in that way. Then, he tugs off his helmet, pulls out a bar, and chomps on it.  “Air’s not too bad now,” he says, in between bites. He wipes his mouth with his sleeve. “Dry. The briefing said all those abandoned years finally cleaned it out. But, it took a long while and still the toxins might be stored in the moss.”  Chenguang ignores her own stomach growling and approaches the site where she felt the tug. She’s looking at a structure that has a concrete panel up top and one below and just a window to slide through. This is where she tripped, trying to vault between the two panels through the three-foot aperture.  She kicks it. “What do you suppose this is?”  “I don’t know. A place to hang something? Or maybe a shrine or something. They had a crude religion back then.”  She peers at the shadow of the structure the dual suns make, a dark slat on top and bottom, like an enlarged sandwich of the homeworld, and notes the fuzziness of the penumbra. There’s something off.  She accelerates to try to vault through the aperture again, but the space between the two concrete panels seems impenetrable and again she hits concrete.  “That’s weird.”  “You hurt yourself again?” Lukas approaches her.  “No, I’m okay. I was kind of expecting it. Come and check this out.”  Chenguang tries to pass her hand through the hole in the two slats but meets a resistance. Lukas tries and his hand slides right off.  “An encasement?” Chenguang asks Lukas, wide-eyed.  “No, their tech wasn’t advanced enough for that.” Chenguang places a note into her mapalog of the anomaly. “This’ll need more than a patch. If the capballs hit this—”  “You’re right. They’ll have to get rid of this. It’s altering the flow. But, they, not us. We’re not being paid for reconstructions, just mapping and patch-noting. Plus, we’ll let the higher-ups handle all the historical planetary code red tape.”  Chenguang removes her helmet and pushes against the space.  “What are you doing, Chenguang? Just set it aside, let them handle it later. You need to take your bar break and we should get going.” She sees Lukas standing up, holding his helmet akimbo in his right arm.  She feels a sucking feeling at her hands and legs and she’s pulled in. A pop at her back ends the vacuuming whoosh and all is dark.  “Lukas?”  Chenguang’s voice echoes in this expanse of dark.  A vortex of light opens to her right and she sees a warped head and legs emerge from a point in the dark. It’s Lukas. As he enters the space, the light bends, his figure elongated as he pulls himself through and it closes behind him. It’s dark again.  “Hey, Lukas.”  “Chenguang?” His voice is low and resounds against unseen walls. “Where is this place?”  “Did we just—enter the structure somehow?”  “I—I—don’t know.” Lukas’ voice uncharacteristically wavers before it quiets down in the darkness.  Chenguang remembers listening to her grandma talk about physical experiments of the past. Pools of salty water that deaden sound. Eternal blackness to sharpen the mind. A chamber, her grandma called it. One that dispossesses you of your senses. That was before the planet went up in flames, before she bid her grandma goodbye as she left her behind.  Deprived. She feels like that now. There’s an ache throbbing within her.  A light comes up in the corner and they walk towards it. It feels like an infinite space, paths that lead in every direction, but they move toward the light. They don’t run. Somehow it doesn’t feel right here. Chenguang moves her legs, almost robotically towards the rays.  The light becomes bigger, brighter and they see it now and when it becomes the length of a vaprabar, palm-size, she stops and Lukas halts behind her. They’re standing five feet away. Chenguang feels Lukas’ breath before her, steady, in and out, in and out.  What first appeared like the vaprabar is rectangular and long, a series of small cubes arranged next to each other in a line formation. Pulsing light.  Lukas’ loud breathing seems to skip a beat, and Chenguang feels, too, something caught in her throat as an array of sensations overtake her body.  Her head feels hot, her limbs cold, her spine feels a chill pass through it, and her legs feels a searing heat travel through them. Her pendant with her comm lifts up and yanks at her neck. It’s pulling towards the light. She grabs it, trying to push it down to her chest, which is thumping, cold, cold.  Lukas has stepped up towards it and he’s reaching—  “No,” cries Chenguang, but Lukas is faster than her words. He swings his helmet and captures that lit-up bar, no bigger than a packet of gum, like he’s playing catcher at meteoroid-pitch.  The sensations in her body fade, her temperature returning to normal and she’s tugging at her chloropolyurethane sleeves again. Doing anything to make her feel like she’s got control of her body.  She moves up to Lukas, but he reaches his hand into his helmet, towards the light.  “That’s not a good—” she starts to say, but a deafening high-pitched buzz fills her ears and then there’s a blast, and she expects to hear an explosion, but only hears that shrieking buzz as mushrooming light blinds.  The feeling comes a moment later, lifting up and being thrown up against something. Her body hurts, aches that fill not only her body, but also the inside of her mind. The air in her chest collapses at her intake of breath and she sees through her closed eyelids, the brightness that could only be two suns.  She forces herself to open her eyes.  Lukas is rolling back and forth on his back on the roof ground, holding up his knee to his chest. He’s wincing and moaning to himself.  Crap.  Chenguang wills herself up and tries to knock some sense into Lukas. He looks up at her and shuts his eyes, opens them again. She hefts him up, despite his muttering objections. Her knees shake, but she’s got him. He’s heavy, at least heavier than she imagined, his arms and legs dangle out of her hug. Luckily, cartologist runners are more streamlined than bulky, so at least he’s not too beefy. She pulls him away from his cracked helmet, moves him to the far ledge on the roof.  She makes sure he’s all right. He’s moaning but otherwise okay, she guesses, and goes back and peers at the helmet. There’s nothing in there now. Just cracked shards lining what was once the perimeter of the head hole.  She doesn’t dare move it.  Crap.  How fast can he run without its aerodynamic edge? How much sunlight can he collect without its specialized absorption tech? He’ll freeze at night. Without it, he definitely won’t generate enough power to activate the heating cells in his blanket.  She plucks the water patch out of her backpack, wondering if she should wait to give it to him as a warmer at night, like the way she used it last night, but makes up her mind and rips it open. Tepid water, heated from the ambient air of this land of dual suns, trickles down her hand. She rushes to lick it and it feels startling and moist on her tongue.  Water.  She’s careful as she brings it over to Lukas, lifts up his head, and forces him to drink it. His eyes fly open when he realizes what it is that he is gulping. She realizes she’s licking her lips and her throat’s moving up and down, a phantom desire to taste what he’s having, as she feeds the elixir of H2O to him. He looks bewildered and his eyelids shut again. After he has gulped down the bulk of it, his eyes open again.  Just a few drops left that Chenguang loathes to waste, so she rolls up the package, so light in her hands now, as a contrast to the luxurious heftiness of the water weight before, and stuffs the mostly-packaging into her pack. Maybe I’ll lick it clean when we pack up for the night.  Lukas’ eyes clear up from the haze and look at her as she eats her vaprabar. She’s trying to think. To put together the many strands of thought entangling within one another. What was that? Where did we go off to? What happened to that panel block of light bits? What to do with Lukas and his busted helmet? Water. I wish I could have tasted more of it.  The vaprabar shatters into dry bits in her mouth as she chomps.  “Chenguang, thanks,” she hears Lukas behind her saying. She stops staring into the sky with its twin suns and turns around.  “You okay?”  “I don’t know. My knee’s not right. But, I think it’ll be better.”  Chenguang fishes out Eazslaps and helps him put it on. “Your turn for these.”  “My helmet.” It’s a statement, not a question.  “Yeah. Broken.”  “What was that?”  “I thought I’d ask you. You’re the one who touched it.”  “I’m not sure. But I’ll admit, that was pretty dumb.”  “Easier to say now, in retrospect. We had no idea what it could do.”  “Thanks, nice of you to say. Though, I’m sorry.” He casts his eyes down and he does look penitent. He rubs the Eazslaps over his knee. Shiny blue peeks through his fingers to show they’re working. “Hey, you okay?”  “Better off than you,” she says, swallowing the last of her bar.  “So, I guess you’ll go off. Finish the cartography. I can poke around here. Look for some shelter for the night. Cuddle up next to some concrete.”  Chenguang shakes her head.  “I think we should go down.”  “Down?”  “Into the wasteland. Into the buildings. Not just graze the rooftop. There might be something we can use to get you warm. Maybe some energy source. An old battery or something.”  “There? There’s nothing left. People left long ago.”  “I don’t know. I just get this feeling. You know, I felt something pull at me. Twice. And that panel of connected cubes of light. Maybe that has energy.”  “Too dangerous. We’re not playing around with that.”  “I’m not suggesting that. I just mean. We won’t know until we look. There’s no way I can map out this planet alone in time, so if you’re out of commission, neither of us will get our cred, you’ll be frozen dead from the night chill, and they’ll send new cartographers here. We’ll be in debt, paying for the commute and lift back. Well, I’ll be and you, too, if you manage to stay alive. This is the best way. Plus, I dunno. I just get this feeling.”  Lukas shakes his head.  “Lukas, I saw an opening before.”  “What?”  “An opening into the buildings. They’re not all sealed off like the High Institute’s Historical Society claims. A space was overlooked. It’s way over the side of one of the buildings, about five buildings back. If we could just make our way over there—”  “You’re crazy. You sure the blast didn’t mess you up? Going back and entering this condemned space—”  Chenguang hooks her arm into his elbow and helps him up. He limps, then shakes out his knee as he leans on her. He moves again and he looks more stable.  “The swelling’s going down. You’re going to make it. Lucky, no blood, no concussion, right? Let’s go.”  He tries walking a few more steps. He squats and gets up.  “Alright, hope you can leap, I’m heading over to the other side. Leave all the stuff. It’ll just weigh you down. Latch onto my arm if you can’t make it and I’ll give you a catch.”  Chenguang vaults back, retracing their way back to the building before. She makes it, though she’s not as swift as she once was.  She leans over the ledge and holds out her arms. She hopes she won’t have to catch him. She’s not sure if she can handle the weight after all.  He runs, looks good, tight form, and jumps and vaults. It’s clean and he lands with a roll onto the roof. He’s still limping, a bit. He’s trying to hide it.  They manage to leap, roll, and dash over to five buildings back.  Chenguang looks down the alleyway between two buildings. The black hole is there. A window that hasn’t been sealed up. She feels drawn towards it, like a whisper in the back of her mind guiding her that way. When she sees it, something like congruity settles in her bones.  “We gotta go. You can make it. I know you can. At least the Eazslaps will dampen the pain enough, yeah?”  She leaps back and forth between the building she’s on and the other one that’s slightly taller, as she descends. Like a moth, fluttering from one surface to another, she hops, light and assured until she reaches the opening at the wall. She perches on the windowsill for a moment, feeling the cool air of inside on one side of her and the heat of the sun on the other.  “Come on,” she says into her comm and she hears Lukas respond.  She alights onto concrete a few feet below the window and follows the panel of light from the window onto the floor. Nothing. Again, she sees nothing. Before she can walk up and explore, Lukas falls into place behind her.  “Good, you made it. Now, let’s do a search.”  They spend about half an hour walking through the place, lighting up the room with activated ray fabric. It’s the most energy-efficient light they have, but it’s a harsh white glow. Mostly it’s just the rough white concrete that looks up at them.  Chenguang spends some of her pent-up stamina on staircases, jumping up flights at a time, passing through the rails.  She’s beginning to suspect this to be a great waste of time, and Lukas was right after all, when her cartographer’s scrutinizing gaze finds a deviation on the tiles of the bottommost level. A carved depression, hooked back like a handle.  She slides her hand and lifts.  A basement?  She talks into her comm. “Lukas, slide down the banister to the bottom floor and get over here. There’s a route down here.”  She slips through, lands with a cat crouch, and walks in this dark tunnel. She’s feeling out the hollowness and the perfect curves of the walls when Lukas joins her.  “Leg okay?”  “Yeah.”  They walk what seems like ages. The path keeps going and going and a prod at the back of her mind’s telling her that she messed up. Lukas is losing strength, she can hear it in his breaths, even if he tries to hide it. She’s wasting time. Precious time that she could be charting out the world or at least soaking up the outside heat for the night.  She prompts her helmet and she’s at 78%. Yesterday she would have groaned. Today she’s thinking, not bad, given the circumstances.  The route opens up to a clearing.  Rather than empty space, the ray fabric shows tangles of webbing. She manipulates the fabric, shining the light at some of the strands. They’re cords. Tangles and tangles of cords. She hasn’t seen old tech like this in ages.  She follows them to their mass clump at the center.  “An AI?” whispers Lukas.  A voice booms throughout the chamber. Chenguang shines the ray fabric around, but the harsh light only illuminates cords. No speakers, but perhaps they’re implanted in the walls and ceiling. The voice sounds like it’s coming from everywhere.  “Eybzzkey—”  Chenguang elbows Lukas and points at his comm. “Turn on the translator.”  She triggers her own on.  The voice changes, dark and silky. “You’ve come.”  “You were expecting me?” Chenguang gestures to herself, as she walks forward, as if compelled by some force. Lukas puts a hand on her shoulder and Chenguang startles in her path forward.  “The upgrades. They’re overdue.”  “Upgrades,” says Chenguang. “No, we’re explorers. Well, cartographers, to be exact. Mapping out this land.”  “No upgrade?”  “Sorry, but, no.”  “Drats.” This sounds vaguely funny to Chenguang and she hears Lukas smothering up a laugh with a cough.  “Who—who are you?” Chenguang asks.  “I’m the Tattle, the Tneshtown Center. I handle all the deliveries and packages. Last week, we produced, inspected, and delivered 72,000 glons of kenophrane alone, even in the midst of the disruptions from the war. I manage all the trade with the outer worlds and accommodate the schedule of the workers.”  “Workers,” says Chenguang. She looks around. The room is bare except for the tangles of cords and them.  Tattle’s voice lowers. “It seems awfully quiet. Too quiet for a war.”  “Tattle, there’s no one here except us. There was a war long ago.”  “Long ago?” The voice lilts, waiting for something.  “Not anymore. The city’s been abandoned.”  It’s silent. Only a light tapping sound at the center of the wire clump gives any indication of processing.  Tattle’s voice arises again. “Ah, well, that explains it.”  Is it Chenguang’s imagination, or does it sound like its voice fell?  “I only awake when there’s activity and a need. It’s to save on energy. I must have been idle for a long, long time.”  Lukas whispers in Chenguang’s ear. “I’m going to scan the wires.”  Chenguang speaks up, keeping one eye on Lukas who’s running his fingers about half a foot above a wire to her left. “Listen, Tattle, we’ll report your existence to our contractors, and they might be able to get you out of here. Or otherwise reprogram you for another use.” More like resell you to a less developed planet. “There’s nothing left for you here.”  “No. I must stay here. I know this place will repopulate again. It has so much to offer. The jungle, the soil, and the resources. All the kenophrane.”  “Kenophrane was added to the RSL—”  “Restricted Substances List,” pipes up Lukas.  “—for years now.”  Tattle’s voice rises. “I’ll have to reorganize some of my programs, prioritize probing new resources—”  “Tattle, hey, Tattle. Listen. Before you do all that. There’s something we need to ask you. There’s a strange pull that I’ve been feeling. Messing with my movements. Part of it has led me here.”  “A pull?”  “Well, there’s a kind of double panel structure up on the roof a few buildings down and when I try to pass through it, it’s blocked. But, somehow, it led us to a dark space with a palm-sized slat of light made up of individual cubes.”  “Did you touch it?”  “Yes and—”  “It exploded.” Tattle’s voice speaks definitively.  Lukas locks eyes with Chenguang and nods.  “Yes, Tattle, we reached out to it and it exploded.”  “Landmines.”  Chenguang was thumbing her pendant absently, but stops.  “What?”  “Planted by workers bought off by the Kthal. I got rid of most of them. Scoured the buildings inch to inch, but some of them are deep in the sub-layer, luring people in.”  “I don’t understand. They’re mines?”  “Yes, weaponized organics. I know there are still quite a few around. I tried my best. I really tried my best. I—”  “Hey, Tattle, I’m sure you did. We’ll need to get rid of them. They can’t be here.”  “I wish I could help you. But, when the organics were dead, they were easy to discard. You just needed to wrap them in some mellalophane. Now, they’re awake and their properties must be all different.”  Lukas stops what he’s doing, his hand midair and speaks up. “Awake? Organics. You mean, they’re alive? These landmines are alive?”  “If enough time has elapsed as you say, then, yes, they’re alive.”  Lukas and I exchange a glance. Even in the diminishing light of ray fabric, I can read his expression. Anxiety at the crinkles of his eyes, his mouth upturned.  Triple crap.  “Are they conscious?”  “Conscious?”  “Are they intelligent creatures?”  “I don’t know. I only knew them when they were dead. They are easy to find and harvest. An easy tool for the Kthal. But, I know the species has a long dormancy. Not dormancy, death really, as they have no vital signs. Vital signs of their own kind, that is. They experience a growth process thereafter. They start out simply a physical entity with no life to them, but the life sprouts later. The detonation still works while they are without life. It’s called their morterm period. The explosives are the best then, clean and with wide range. My directory tells me that when they are awake, their explosives are less predictable and less effective. Perhaps a small burst.”  “Seems counterproductive to life. To be able to explode like that.”  “It’s a protective strategy, you know. To protect the nest. In case someone comes, they’ll detonate, but each detonation is unique and doesn’t affect other individual cubes. Their death period allows conservation. Only when resources are good and predators few do they come alive. Altogether they form one big colony. They are harvested in layers and planted as mines.”  “Do they communicate?”  “Not when they’re dead.”  “When they’re alive. What do they look like?”  “Light. They light up, an indication of life. Isn’t that like many other organisms?”  “Not all,” Chenguang says, looking at Lukas’ Eazslaps on his knees. Their light is fading.  “We gotta go,” says Lukas. He motions at the ray fabric. Chenguang was so focused she didn’t notice how quickly the light had dimmed there, too.  “Just, tell me if these landmines, if they’re intelligent. If they communicate. If they do, then this isn’t an abandoned area. It’ll be rezoned and re-designated.”  “I wish I could tell you. I haven’t come across one. Maybe I will soon, though, since I’m awake now. Come back and visit me, okay? It’s too quiet in here. And if you don’t, I’ll sleep again, and who knows when I’ll awake—”  Tattle is still talking as they rush through the tunnel, the light fading quick. They need to rush back and retrieve their tents and packs before it’s pitch black.  Chenguang’s mind races as fast as her legs. They cannot, in good faith, finish their job as cartographers if there are living beings on this planet.  As she sprints down the tunnel, she runs through her sensations from before. The pulling, the urge to get closer. Perhaps pheromones or some other release of the organics.  She’s thinking of the sensations when she trips.  No, not again.  Lukas is there with her. Snagged in the sub-layer. They approach the light that pulses at them. The fragment of the slab that is the landmine.  “As long as we don’t touch it, we’re okay, I think. Just don’t go near it,” says Lukas. But, he’s disobeying his own advice, drawing closer and closer. So does Chenguang. Her pendant around her neck flies up a bit, wavers, and falls and flies up. In tune to the pulsing.  She can’t help herself, she approaches. Closer. She feels a swarm of feelings in her body. She is warm-blooded, yes, she is warm-blooded, but her toes feel like ice, her chest like fire, her eyes like a subtle warmth, her hands the gentle coolness of a spring day in her homeworld. She wiggles her fingers, her toes—they feel like different worlds, disconnected.  A thought dawns on her.  She breaks through the visceral impact of the feeling and turns to Lukas, who is spellbound, probably feeling all the same sensations.  “You think, they’re communicating with us?”  “The light pulses? They’re not changing—just rhythmic on and off.”  “No, the temperatures. You feel that?”  He draws up next to her. His misty breath of icy coolness tells her his response.  “I’m hot, cold, warm, everything, in all different places.”  Chenguang closes her eyes, focuses on the different feelings permeating in her body.  She imagines stalls, different stalls all over. They expand all over the planet. Stalls of different temperatures and the miniscule light cubes that bob along from one stall to the next. She sees mini-ecosystems in each stall. Some filled with other organic life, cohabiting, symbiotic forms of activity.  She opens her eyes. She’s still in this sub-layer space. She doesn’t touch but pulls her hand close to the cubes in front of her, emanating light. Each cube shoots out a different temperature, acutely different. Palpable.  “Lukas, close your eyes and focus on your body, on all the different temperatures.”  Chenguang shivers, the chill in her spine deep, as she closes her warm eyes again.  She sees the image again, different stalls, life, organisms that look like trees, foliage and moving beads that slither on the ground. Tiny wispy helicopters floating in the air. In each stall are these cubes, like the ones before her in this sub-layer, some clumped together like clusters, emanating light and a particular heat signature.  She opens her eyes only to see Lukas open his, his pupils contract in the growing light of the landmine. He strokes his beard with a hand, as he drops his jaw. “I can’t believe it. They’re communicating with us. By heat—and cold.”  “Do you think they’re sending us some image of the past? Of this planet?”  “No, no. The files never showed the planet looking anything like what I just saw. Stalls. Cubicles you might call them.”  “Yes, with different flora and maybe fauna, if you could call them that. Some organisms, anyway.”  Chenguang feels an excruciating heat in her nose. Is it one of assent? In her cold gut she feels something like a ‘yes,’ like something agreeing with her. The feeling grows.  “Not the past,” she whispers. “The future.”  Lukas stares at her, with his strangely contracted pupils. “Yes, yes, you’re right. It’s their vision of their future.”  “They’re trying to tell us they have plans for this place. I think. Maybe.”  “You might be right.”  The impression of her body being isolated into various cells and splashed with varying amounts of heat and lack thereof starts to dissipate. The light of that bar of connected small cubes grows dimmer and once out of that trance of multi-thermal arrest, Chenguang realizes that their fabric ray light has died out completely. Without moving, they’re pulled away from that sub-layer space and return to their dark world in that abandoned building.  No, not abandoned, simply derelict.  They run, leap out of the underground tunnel, up into the basement, feeling their way through. Their leaps, vaults, and tumbles are more cautioned in the dead of the dark and they make gradual progress towards the roof.  They are lucky the moon is out, not trapped behind clouds like the other night. The return of light graces them with their characteristic fearlessness to pick up speed as they spring and leap back to their tents.  Usually bound by a fierce love for personal space, tonight Chenguang invites Lukas into her own tent. He refuses, staying in his tent until she’s sick of hearing his teeth chatter through the comms and utters, “If you die of cold, I will string you up with the wires of the AI. And you will spend eternity with chatty Tattle.”  “Who cares? I’ll be dead,” he says. But, his footsteps say otherwise and she hears the sound of the breach of the seal, as he fusses with the tent opening.  At night, they lay side by side, neither of them cold, not until, at least, the collected energy powering the thermal blanket drains and the chill seeps in. By then, it is near enough to dawn anyway. They’ll survive yet another night. She grabs his hand, not out of romance, but a sense of camaraderie, or a feeling of being alive, or of feeling warm. She doesn’t really know.  He squeezes the hand back. Props up on an elbow and looks her in the eye, heat emanating from his skin. “Last partner died of thirst. Accident, microhydro-gens short-circuited after a bad tumble. That sippee pack was to remind me of the dangers of these worlds.”  She nods. Not sure what to say. Sorry doesn’t really cut it. This is their life, stark and cold.  “Light on our feet, but we all carry our burdens,” she says, holding up the picture of her sister. “I do it for her.”  That seems to satisfy him. He lays back down, closing his eyes.  She can feel the coolness of the pendant on her chest through her transpandex and imagines her sister’s smiling face. There would be no energy harvest here. This place would be rezoned.  That means no cred deposit for the mapping. No moving out of the hive for her sister and the rest of her holed-up hermits. But, her sister is a softie. She would like the story, one of a species discovered.  With her free hand, Chenguang paws at her pendant, feeling its coolness in her fingertips.  One thing strikes her. She reviews those sensations from the sub-layer. In her mind, when she felt the discrete areas of different levels of hot and cold take over her body, when she could imagine the entity, that strip of connected cubes pulsing at her, making her envision the temporally-distant space, she noticed something.  That imagined future, that vision. It wasn’t simply stalls of different levels of heat. There was something else there. She couldn’t pinpoint it at the time because it had been too long, it became too foreign. But, she knows it now, lying in the tent in the escaping heat, the chill breaking all logical resolve and allowing her mind to wander.  It wasn’t just temperature, there was a distinct feeling of heaviness. Of a heaviness in the air that could only be moisture. Humidity.  The mines, those beings—they didn’t simply envision a future with various temperatures. They envisioned one with various climates. With dew, fog, steam.  It was a feeling that had pervaded her nose, tickled her esophagus as it went down with the air, as her body went through the shock of manifold degrees.  Water.  And she felt, deep in her heart, that it would be real. In her cold-induced haze of half-sleep, clutching onto a warm, rough hand, she knew this would be a place that exists. And not far off, but in the near future. The feeling she only now could disentangle, she realizes, is a process that had catalyzed and was coming to life. A part of the communication, a pit feeling, that she could not fully decipher until now.  And not only would this vision become real, but it would become a place that her holed-up people could trade with for the ever-scarce water. How the mine beings will make this water-filled ecosystem, she does not know, but there is much she does not know about the terraforming abilities of these creatures. Only that they can explode and creep into atmospheric sub-layers.  But, she feels that if she closes her eyes and focuses on the heat in her body, and drifts off mentally so reason no longer prevails, she can imagine herself and her sister, in a time she cannot place, sharing a warm thirst-quenching drink of liquid—tea, she realizes, a warm, dewy mug of tea with steam that rises and rises into the atmosphere—as she licks her lips and falls asleep. D.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation.", "text": "9760 words, novelette\nVault\nChenguang hikes up her sleeves before vaulting over the pile of fuzzy moss and greets Lukas with a nod. The chloropolyurethane fabric flaps in the slight breeze and the double suns beat down onto her arms.\nLukas fishes in his bag next to his tent for a bottle of sunsoak and releases the spray, running it generously over his solflex-covered arms, torso, and legs.\n“Your head,” Chenguang says and he smiles, as if he hadn’t been doing this for years.\n“Can’t reach,” he says, lying and Chenguang knows he just likes the attention. She grabs the spray and discharges that exhale of mist, covering his football-shaped clear helmet. She even sprays some on the clear hard arc under his bearded chin. She turns the mist onto herself, bringing down the spray over her exposed transpandex inner layer, the foam frothing up at her arms before becoming clear, encasing the invisible solflex pores of her fabric.\nLukas watches her as she sprays down. “That’s probably enough,” Lukas says. “You don’t want to drown yourself and run dry tomorrow’s supply.”\n“Cheapskate.” But, Chenguang knows he’s right and slides it back in his sack. A coin catches the light. His comm. She grabs it. “You almost forgot this.”\n“Like I would. And risk not being able to talk to you when we’re apart?”\n“Very funny. Put it on.” He does, affixing it to his chest.\n“I don’t know how you have it like that just dangling from your neck.” His voice comes through his piece and projects into her pendant.\n“It feels nice. Plus I hear you loud and clear.” She stretches now, getting ready for the run. Her pendant chain slides about near her armpit. She holds it to her chest, reaffirming a silent promise to her sister.\n“Won’t feel so nice getting snagged on a branch.”\nChenguang gestures out as she pulls up her leg. Near his tent, Lukas brings his head to his knees, arching his back and groaning. They wrap up the tent sheet around their legs, its fibers assimilating into their pants, attaching itself to their uniforms.\nChenguang kicks up her legs, feeling the lightness of the tent. She hitches the bag with the rest of her limited supplies onto her back. “Come on, old man. You see this wide expanse? Not a tree in sight.”\n“Doesn’t mean there won’t be one.”\n“I’m not too worried,” Chenguang utters before she starts off on a sprint. Lukas follows at her heels, his shoes sinking into the foamy terrain in rapid strides.\nThey jump, leap, roll, wind up, and do it again. Their legs traverse the terrain of Sugue, picking up speed like a vacuum picks up dust. Chenguang feels the wind in her hair and sprints past a tangle of mossy vines. Out of her peripheral vision, Chenguang sees Lukas next to her jumping over a mound and kicking off a verdant growth to spin into a roll as he keeps going. He’s showing off, telling her he can keep up even doing spins. She picks up the pace.\nWhen the wall arises before them, she leaps up and attaches herself like a cat, her transpandex fingers reaching over the top. Her body sinks into the wall, as like everything else, its façade is full of moss. Her right leg kicks off and she reaches with her arm, throwing herself over the edge. Her hand slips.\nLukas is right behind her and his geneblazed thigh muscles have no trouble leaping up and perching on top. He offers her a hand. She grimaces, lets Lukas’ hand dangle, and picks herself up.\nShe feels the solflex suit, covered in spray, picking up the heat of the sun. She takes a second to catch her breath, as Lukas adjusts his helmet. The sun warms her and at the corner of her helmet, the hololight shows the power’s at half capacity, filling up notch by notch. She needs to be faster.\n“Mine’s saying two-thirds full,” says Lukas, as if reading her mind.\n“Yeah, mine too.” Chenguang’s not lying, she tells herself. If she squints, it kind of looks like the bar’s higher.\n“You think we’ll meet quota before the suns set?”\nChenguang’s mouth beats her brain. “Yes, definitely. Or else you can have my thermal blanket.” She shuts her eyes, wishing she hadn’t promised that.\nOver the wall, the hills fill their eyes. Beyond that is the industrial wasteland.\nThey only stop running and leaping after their feet, backs, and arms map out their jaunt through the hilly stretch.\nChenguang’s muscles ache, but she doesn’t want to admit it. She shakes out her legs, pulls back her neck. There’s a change going through her. She used to be able to run for days without pain, but then again, she used to be able to jump twice the height Lukas jumped earlier today at the wall. Today, she barely got past it.\n“Hey, you okay?” Lukas looks genuinely concerned. Probably for himself. He knows he can’t do this alone.\n“Yeah.” She stares at the industrial wasteland. The two suns are waning now, Solah closer to the horizon than Soloh. Lukas’ hazy shadow lengthens against the concrete at the hill land’s edge. His green eyes glint in the pink of the dual-sun evening light.\n“You have the Eazslap?” she says.\nLukas undoes a pocket at his triceps and pulls out a few blue-glowing stickers, disengages them from each other. He selects two, hands them over to Chenguang.\n“It can’t be that bad, can it?”\n“It’s not. It’s just preventative. Besides, the sticker will provide some light, now the suns are retiring on us.”\n“Barely,” says Lukas, under his breath.\nChenguang keeps her eyes bright and open as she slaps them on, even as the telltale searing pain reaches her knees. She’s not going to give in with any wince or reaction. The stickers release inflammation inhibitors; the burst of prickling tells her that much at least.\n“What’s your charge say?” Chenguang asks. She feigns nonchalance, ignoring quivering knees.\nLukas’ pupils veer right and his hands twitch, moving phantom controls. Chenguang watches as he waits for the bar graph in his view to convert to a figure.\n“93%. I figure we’ll be in the sun for another ten minutes. Not running and leaping, so it’s not going to climb exponentially.”\n“It’ll probably get up to 95%.”\n“Yeah, that’s pretty safe. I’ll be in the clear all night. How about yours?”\n“89%,” Chenguang says. She grits her teeth. More like 72.\n“That’s pretty good,” says Lukas. “Well, 95’s not 100 but it’s pretty close. I guess I won’t be needing your thermal blanket. I’ll do okay with my own.”\n“You can have it. I promised you 100%.”\n“Nah, it’ll just get too hot.” But Chenguang knows that’s not true. The blankets optimize for perfect temperature, no shivering and no sweating, no excess heat or cold. With two blankets, once the batts run out for the night for the first, the second one would take over. Without it, they’ll just have to do with the dire chill. Negative fifties or so degrees Celsius chill.\nThey bask out in the sun, drinking up its energy. Lukas just lays back, but Chenguang’s arms and legs scissor open and closed. Jumping jacks to accelerate absorption. Any movement prompts magnified absorption rates, but running, leaping, and gaining ground does it most. Something to do with your heart rate, acceleration, and even psychological thrill all interacting with the inner solflex machinery—amplified, too, by a generous coating of spray.\nShe huffs, scissoring her arms and legs, as she watches their shadows get longer and longer until they merged with the dusk that surrounds them.\nDinner goes by without a word. There’s really not much to say chewing on vaprabars. Can’t really comment on the taste because it’s just coagulated nutripowder. Chenguang grabs a second but Lukas’ hand comes down on her wrist. “There’s too much iron in it,” he says. “It might interact with Eazslaps.”\n“Really?”\nShe gives him a look like she might bite his hand and he pulls back.\n“Suit yourself,” he says, but she’s already tossed it towards her pack. It clatters against her helmet and tumbles to the ground. The bright sleek wrapping stands out against the dull, dark concrete, reflecting the artificial light emanating from the ray fabric, slung up against a ledge.\nThere is no natural light tonight. Clouds have completely enveloped this planet’s one moon. They rely on the ray fabric and its harsh white light.\nLukas whistles as he sets up his tent. Chenguang remembers the song as she starts to emancipate her tent fabric from her legs and spread it out before her.\n“Clear, the White Waters,” she says.\n“Where I was from, it was ‘Cool, the White Waters.’” Lukas says. He pulls off his coin comm and drops it into his upturned helmet.\n“What it would be like to get in,” she says. She sits down under her half-pitched tent, waiting for it to inflate. She stretches out her legs. “To envelop in water.”\n“You are enveloped in water. Made of it,” says Lukas. He’s un-creasing every bit of his tent with his transpandex-covered hands.\n“You know what I mean,” she says. “I remember when we had water. Trickles to splash on your eyelids. Mist to clean off your skin, your elbows.”\n“That was years ago and worlds away. Better to focus on the project at hand.” Lukas was systematic in his manual un-crinkling. Even if it would be done by the inflator anyway. His thoroughness reminds Chenguang of how he runs and leaps, methodical, making sure to cover the ground and air, checking for sharp edges with the heightened instinct of his body as they’re trained to, even in his lightning speed. She sees that concentration all day running through his aerodynamic mask, in that focused look in his eyes.\n“You think the capballs will really generate enough power?”\n“It’ll make a lot more than we can.”\n“Enough to rent all the tech? The hydrogen harvesters, transporters, and hydro-generators for Claris?”\n“It’ll do some. But, you might not want to hold your breath on that liquid immersion.”\n“A bath. They called it a bath.”\n“Yeah, well, the best you can do is dream about it. We’re about to enter wasteland tomorrow. And the specs say that’s as dry as bone.”\n“Bone? But, that’s us. I thought we’re made of mostly water, you said.”\n“Bone, desiccated, nothing but bone, bone. Pinch dry. Like everything else in this sector.”\nChenguang massages her knees, looks out into the wasteland, the geometric shapes of a past civilization, now all dried to stone.\nBefore she can duck into her tent, Lukas walks over, fishes in his bag, passes her a package with an attached flexstraw. A sippee. About a cup’s worth of water in a bag. “Won this years ago as a medal. Parkour championship. Been holding onto it, weighing me down.”\nShe looks at it, feels the weight. It’s liquid, all right.\nAnd Lukas has been running with this strapped to him this whole time? She looks up at him, but he looks down, veiling his expression.\n“I can’t take this—”\n“Take it. It’s dragging me, slowing me down. And you need it for your knees.”\n“No, I’m fine—”\n“Then do me the favor of helping me get rid of this. I don’t have what it takes to appreciate it. To me it’s all the same. Whether liquid’s shot-fed through skin microhydro-generators from tiny spurts of hydrogen and oxygen or if I gulp it down in one go through my esophagus. Makes no difference.” He looks up and gives her a nod. Chenguang sees a hardness in Lukas’ eyes, a stubbornness that won’t back down.\n“But you’ve never tried gulping it.”\n“I have. I’ve won more than one medal. A pretty good sprinter and leaper before you. Please, as if they’d send anyone less than a champ to work with you.”\nChenguang stares at Lukas who’s doing squats, with a huge grin on his face, as if to prove his point. His eyes, though, belie something. Regret, possibly.\n“Alright, thanks, Lukas. But, no more favors.”\n“It’s not a—”\nChenguang ducks into her tent, swipes on her thermal blanket as the chill settles in. She pulls the squishy package of water onto her chest, and watches it rise and fall underneath the blanket.\nWater, she thinks, as her eyes fall to a close. She’s never had so much at once, not since twenty years ago, when she was eight and her grandma splurged on a pack. She remembers sharing it with her little sister, Xinyao gobbling most of it up and leaving her with only a mouthful.\nIn her sleep, she dreams of broken legs. Broken legs mean no levers for that fulcrum hip of hers to move, little heat generated for the night, and no work for creds to pay for her relocation debt. She calls out in her sleep.\nShe dreams of her mother and father, selected to fight the fires so rampant in her homeworld, never to be seen again. She dreams of their voyage, sent off for a better home. And Xinyao, orbiting with the Civ, still caged in a temp cell, waiting for enough water on Claris to emerge from the hive.\nShe thrashes about, in her half-lucid state. Her mind fixates on the sheer ingenuity of that tech borrowed from the High Institute, funded through expending collected resources of their homeworld. Their last big hurrah for their best and brightest. The journey, the rocket, glorious things the High Institute owns. She’ll probably never see interstellar tech like that again. Only capballs. Efficient, good for short distances. Sensitive old scrap low tech for low-end space riffraff like her. Low tech she has high hopes for. She dreams of it zipping by her, beating her in speed and grace, though she would be off planet by then. Once the capballs make enough energy for hydrogen tech rental, as they all hope, the zapping for water will be a cinch.\nWith a start, she remembers there is water balanced in a package on her chest.\nHer leg aches.\nWater.\nShe dreams of tasting it. It tickles her tongue, dapples in specks of moist cohesion on her lips, washes down in a surge.\nWhen she awakes, she starts, thinking the package has broken and all its treasures have leaked out and seeped into the parched concrete, but she feels no wetness. It is still there. Intact. It’s warm.\nShe’s cold.\nShe realizes she awakes not from the nightmare of disappearing H2O, slipping away from her, but the reality of chill. She didn’t collect enough sun.\nShe breathes out. Sees her breath, precious heat and humidity escaping. She puts on her helmet and she feels immediate warmth, the last dregs of power still caged in there. But she can’t rest her head back onto her pack, not without the helmet’s aerodynamic wedge getting in the way.\nThat leaves her chilly body. The pack, at least, is warm against her skin. She remembers that water is a good conductor and the packaging’s got heat tech. She rubs the pack around her body, shivering. She pushes it under the blanket, willing it to stay warm under the covers as she swipes the pack around her.\nThe rubbing generates more heat and her hands are methodical, making the pack move in strategic ways, as strategic as the two of them, Lukas and Chenguang, like a pair of lone coyotes, traversing the landscape. They are mapping out the best course, the one that gains the most sunshine and surface contact with least amount of risk, so when the capballs are dropped, the tech will interact with the atmosphere and topographical elements of the landscape and accelerate with so much collected sun energy, multiplied by the mechanics of their whizzing speed and ground synergies, they’ll be priceless, chock full of power, when harvested.\nLucky so far that they’ve patched the sharp edges. The capballs fly fast and accurate, but one touch at a point and their vulnerable surface gives, puncturing the irreplaceable tech borrowed by the Civ at great cost to them. Even if it was belittled low tech, a drop in the bucket compared to the wealth and potential of the High Institute. When it comes to the High Institute, they’d find a way to collect for any broken rented tech, no matter how minor. Should the capballs touch an edge, they’d snap. Like apocryphal soap bubbles popping, childhood dreams of water gone.\nUnable to sleep, Chenguang stretches as her parkour and acceleration trainer has taught her. She hears her trainer’s voice now, as she reaches over to her ankles: “Prepare the muscles, sharpen the mind. As a human you have an edge—instinct and corporeal sense. You’ve got a gift that no bot could ever replicate—somatics—an organic impulse that lies deep behind the geneblazed muscles and uniform-enhanced speed. There are phenomena on planets we can’t anticipate to program into bots. You’ve got the skills, the training. Don’t waste it, whet it like a knife. Focus. Breathe. Keep your eye on the goal.”\nChenguang rests the package of water in her lap. Pulls in her right arm, braces it in the elbow of the other. Her triceps draw taut, making her suck in a breath. She never thought she’d be a cartographer, using her somatic experience to create the map for sensitive tech, but sometimes she can’t think of any other job that would make her feel so alive.\nShe wonders how the other recruits are doing. Ayesha and Jayesh, her two best friends. Are they doing okay in Tilna? They volunteered together, unlike her, who volunteered alone and got placed with a stranger: Lukas.\nLukas. She held onto her warm water bag. He’s fast. Maybe she should’ve been paired with someone slower. She was once as fast as him, maybe even faster, but something on this planet’s pressing on her. Changing her.\nHer eyes fall on the swirling inflator at the top of the tent, a tiny disk generator that pitched air along the inner surface tent. Rotating, it looks like a planet. She imagines it swarming with tiny beads, all charging along on its surface. There are dozens of planets in this solar system, all to be filled with accelerating capballs. All to be gathering energy for rental tech for hydrogen capture and water production.\nFor Claris. Their only hope.\nShe pulls in her toes, flexes her calves, then peels off the Eazslaps on their knees. They no longer glow, their medicinal blaze exhausted. She sticks it against the side of the tent, too tired to deal with it now.\nShe removes her helmet and tries to think of the hearth, snap noodles, and other hot things from home. Her fingers run along her pendant, with her comm on one side and a picture of her little sister, Xinyao, on the other. She falls asleep again, as the heat of the water pack penetrates her transpandex and warms her abs.\nChenguang shivers as she wakes to the break of dawn and the breaking of Lukas’ voice as he attempts to sing her awake.\n“Stop.” She can hear him both through the tent and through the comm. The scraggly high-pitched pentatonic tune falters and grinds to a halt.\nThe water pack has chilled and she looks at it through the light of the morning. She can’t drink this now. There needs to be the right time, an occasion. Basking on concrete in the middle of Sugue, at the brink of wasteland, is no way to celebrate with a cocktail this precious. H2O, she slips it in her pack, glides out of her tent in a swift slide, and wraps it all up.\nOnce they wrap, strap, fold, and tie, they’re ready to set off.\nThis time Lukas jumps out first, his bound energy as taut as coiled springs, and he rockets forth as if pumped on juice, an old homeworld expression when juice once existed.\nShe follows behind, the twin suns already opening up the world with light.\nThey bound across the abandoned industrial landscape like two fleas on a bear, except instead of fur, stained concrete meets their lattice neoprene soles.\nFor all the time this place has been abandoned, no plant life breaks through the hardened cement. There’s a dispossessed feeling in the air.\n“What happened to these people?” Chenguang breathes out as she runs.\n“You didn’t take a look while you were stopping by base before the new assignment?”\n“Didn’t get a chance. Was checking up on my sister in the hive at Civ.” Chenguang slips over a railing and Lukas vaults over it and lands on two feet.\n“Oh, the hive. Sobering place. So, this here was Tneshtown. When I checked back on base, this industrial park long ago was the production center of kenophrane, the textile coating that housed the smart fabrics made to filter toxic chemicals.”\n“Kenophrane? Hasn’t that been outlawed?”\n“Yes.” Lukas jumps ahead and puts his hand on what looks like a smokestack before swinging his legs over it\n“Let me guess, making kenophrane also involves releasing toxins.” Chenguang merely skirts around the smokestack-like protrusion before jumping over a gap.\n“Yup, one of those pollute to get rid of pollution deals.”\n“Guess they lost out.”\n“Kind of. Depends who you look at. Many did lose out. There were mass deaths of workers, at least according to the base briefing. Violent stuff. First you get a rash and a cough, pretty innocuous. But then your hands turn red and bloated and you can’t work. You slowly go blind and your lungs lose function. Those were the common ailments.” Chenguang rolls from a jump as she listens.\n“Pretty awful.” She sees Lukas hopping from one cement circular vat to another. The vats look like places for drying some liquid.\n“That’s not even the worst stuff.”\n“Do I even want to know?”\n“Limb detachment and there’s more.” He pretend cuts his arm before using it to pivot over a gate. Then he runs and leaps across to the next building over.\n“This is why I don’t like to read the briefings. It’s never ‘They all had perfect health and beautiful descendants and happiness.’” Chenguang follows suit but has to attach herself to the wall like a cat, barely clearing the ten-foot gap.\n“If they did, we wouldn’t be here, staking out their derelict remains, mapping out their territory.”\n“True.” Chenguang’s back met roof in an impeccable roll and she gets up without stopping. Her helmet cuts through the air as she leaps again.\n“The unfortunate ones are the ones that didn’t survive long enough before the big move. But, they took all the able workers out of here once they created enough fabrics. They thought the fabrics they created would fix this place up. But, the fabrics couldn’t filter these toxins. They only did Grade C and the ones released here were some of the chemicals under Grade E.”\n“Too bad. They did a pretty good job building these structures.” She swung her legs through a gap between a vat and what looked like a drying lattice.\n“Yeah, they’re pretty sturdy.” Lukas tapped on the cement before doing a spin off a wall and onto another neighboring one.\n“Good call. I think we need more spins.”\n“Yeah, quadruple the solar intake.”\nChenguang pulls a 360 as she kicks off the ledge of a roof. She feels the rays coursing through the chloropolyurethane hitting the solflex absorbers and a ping goes off in her helmet alerting her of high intake rate achieved.\n“I don’t know, Lukas. Some of this is pretty sharp. I think we’ll have to go through this again and note where the patches need to go.”\n“Too bad we can’t just tear it down.”\n“Historical planetary code. You know we’d be indicted by the High Institute in a hot second.”\n“Yeah. But, I have to say. There’s something charming about this place.”\n“You just like how the concrete feels against your legs when executing your spins.” Chenguang pulls another spin off, her spiral unwinding from her legs, when she missteps. She stumbles and catches herself right before a roof edge. She slips then.\nHer heart jumps as Lukas grabs her arm.\nIt starts to slip, the transpandex of his fingers and her inner arm garment sliding past each other.\n“Whoa.” Lukas pulls her up. His fingers slip again. Chenguang reaches with her other arm, pulling on the chloropolyurethane sleeve of his jacket, finally latching on to something with slight traction.\n“Whoa is right.” Chenguang kicks up against the side of the building and pushes herself up. She looks down at the side as they catch their breath. That would’ve been a twenty-foot fall. Though a protrusion from the wall might have saved her a broken spine by breaking something else.\n“You, uh, okay there?” Lukas does some jumping jacks, trying to maximize the solar intake.\n“That was weird. I felt like something pushed me off my spin. You know spins aren’t so hard to control. Once you’re moving, you’ve got momentum.”\n“I’d say. Some momentum. You nearly spun yourself out to a multiple-story drop.”\nChenguang sat on the side of a vat, her eyes shifting left to right and her fingers moving, calibrating the fabric to her nerves.\n“It’s fine. They’re attached. But, just in case, I reconnected and connected them again.”\n“You want me to check it? I mean, not to be forward, but I can usually feel the incongruities.” Lukas pauses in his jumping jacks, raises a brow.\n“No, no. I think it’s fine. You know what it felt like?”\n“Scary?”\nChenguang shakes her head. “Like someone pushed me.”\n“There’s no one here but me, Chenguang. And you know I know enough not to pull any pranks.”\nShe gets up, looks over at the rising twin suns, and starts doing jumping jacks herself. After the chill of last night, she knows enough to try to osmose as much sunlight as possible.\nThey run again.\nShe’s feeling pretty good. She got in five vaults and three good rolls. She’s starting to forget about the strange feeling in the air, like being jerked off a trajectory when her foot slips at a jump. It doesn’t slip per se, it feels like it’s being pulled.\nHelmet hits concrete as she bangs into a raised structure in the shape of a cone. Her head reverberates in the football-shaped piece of clear armor. She sidesteps and avoids falling over as she experiences a wave of nausea.\n“Okay, that’s it. We’re stopping,” says Lukas. “Second time today.”\n“No, no, I can go on. It was just a tug on my leg.”\n“I think it’s time for a bar break.” Lukas sits down right where he is, onto the rooftop ground. No vat or raise-up to park his rear on in sight. The smokestack to his left comes up over his head and is simply too high, though he could probably scale it.\nHe looks like he’s contemplating doing so as he focuses his eyes in that way. Then, he tugs off his helmet, pulls out a bar, and chomps on it.\n“Air’s not too bad now,” he says, in between bites. He wipes his mouth with his sleeve. “Dry. The briefing said all those abandoned years finally cleaned it out. But, it took a long while and still the toxins might be stored in the moss.”\nChenguang ignores her own stomach growling and approaches the site where she felt the tug. She’s looking at a structure that has a concrete panel up top and one below and just a window to slide through. This is where she tripped, trying to vault between the two panels through the three-foot aperture.\nShe kicks it. “What do you suppose this is?”\n“I don’t know. A place to hang something? Or maybe a shrine or something. They had a crude religion back then.”\nShe peers at the shadow of the structure the dual suns make, a dark slat on top and bottom, like an enlarged sandwich of the homeworld, and notes the fuzziness of the penumbra. There’s something off.\nShe accelerates to try to vault through the aperture again, but the space between the two concrete panels seems impenetrable and again she hits concrete.\n“That’s weird.”\n“You hurt yourself again?” Lukas approaches her.\n“No, I’m okay. I was kind of expecting it. Come and check this out.”\nChenguang tries to pass her hand through the hole in the two slats but meets a resistance. Lukas tries and his hand slides right off.\n“An encasement?” Chenguang asks Lukas, wide-eyed.\n“No, their tech wasn’t advanced enough for that.” Chenguang places a note into her mapalog of the anomaly. “This’ll need more than a patch. If the capballs hit this—”\n“You’re right. They’ll have to get rid of this. It’s altering the flow. But, they, not us. We’re not being paid for reconstructions, just mapping and patch-noting. Plus, we’ll let the higher-ups handle all the historical planetary code red tape.”\nChenguang removes her helmet and pushes against the space.\n“What are you doing, Chenguang? Just set it aside, let them handle it later. You need to take your bar break and we should get going.” She sees Lukas standing up, holding his helmet akimbo in his right arm.\nShe feels a sucking feeling at her hands and legs and she’s pulled in. A pop at her back ends the vacuuming whoosh and all is dark.\n“Lukas?”\nChenguang’s voice echoes in this expanse of dark.\nA vortex of light opens to her right and she sees a warped head and legs emerge from a point in the dark. It’s Lukas. As he enters the space, the light bends, his figure elongated as he pulls himself through and it closes behind him. It’s dark again.\n“Hey, Lukas.”\n“Chenguang?” His voice is low and resounds against unseen walls. “Where is this place?”\n“Did we just—enter the structure somehow?”\n“I—I—don’t know.” Lukas’ voice uncharacteristically wavers before it quiets down in the darkness.\nChenguang remembers listening to her grandma talk about physical experiments of the past. Pools of salty water that deaden sound. Eternal blackness to sharpen the mind. A chamber, her grandma called it. One that dispossesses you of your senses. That was before the planet went up in flames, before she bid her grandma goodbye as she left her behind.\nDeprived. She feels like that now. There’s an ache throbbing within her.\nA light comes up in the corner and they walk towards it. It feels like an infinite space, paths that lead in every direction, but they move toward the light. They don’t run. Somehow it doesn’t feel right here. Chenguang moves her legs, almost robotically towards the rays.\nThe light becomes bigger, brighter and they see it now and when it becomes the length of a vaprabar, palm-size, she stops and Lukas halts behind her. They’re standing five feet away. Chenguang feels Lukas’ breath before her, steady, in and out, in and out.\nWhat first appeared like the vaprabar is rectangular and long, a series of small cubes arranged next to each other in a line formation. Pulsing light.\nLukas’ loud breathing seems to skip a beat, and Chenguang feels, too, something caught in her throat as an array of sensations overtake her body.\nHer head feels hot, her limbs cold, her spine feels a chill pass through it, and her legs feels a searing heat travel through them. Her pendant with her comm lifts up and yanks at her neck. It’s pulling towards the light. She grabs it, trying to push it down to her chest, which is thumping, cold, cold.\nLukas has stepped up towards it and he’s reaching—\n“No,” cries Chenguang, but Lukas is faster than her words. He swings his helmet and captures that lit-up bar, no bigger than a packet of gum, like he’s playing catcher at meteoroid-pitch.\nThe sensations in her body fade, her temperature returning to normal and she’s tugging at her chloropolyurethane sleeves again. Doing anything to make her feel like she’s got control of her body.\nShe moves up to Lukas, but he reaches his hand into his helmet, towards the light.\n“That’s not a good—” she starts to say, but a deafening high-pitched buzz fills her ears and then there’s a blast, and she expects to hear an explosion, but only hears that shrieking buzz as mushrooming light blinds.\nThe feeling comes a moment later, lifting up and being thrown up against something. Her body hurts, aches that fill not only her body, but also the inside of her mind. The air in her chest collapses at her intake of breath and she sees through her closed eyelids, the brightness that could only be two suns.\nShe forces herself to open her eyes.\nLukas is rolling back and forth on his back on the roof ground, holding up his knee to his chest. He’s wincing and moaning to himself.\nCrap.\nChenguang wills herself up and tries to knock some sense into Lukas. He looks up at her and shuts his eyes, opens them again. She hefts him up, despite his muttering objections. Her knees shake, but she’s got him. He’s heavy, at least heavier than she imagined, his arms and legs dangle out of her hug. Luckily, cartologist runners are more streamlined than bulky, so at least he’s not too beefy. She pulls him away from his cracked helmet, moves him to the far ledge on the roof.\nShe makes sure he’s all right. He’s moaning but otherwise okay, she guesses, and goes back and peers at the helmet. There’s nothing in there now. Just cracked shards lining what was once the perimeter of the head hole.\nShe doesn’t dare move it.\nCrap.\nHow fast can he run without its aerodynamic edge? How much sunlight can he collect without its specialized absorption tech? He’ll freeze at night. Without it, he definitely won’t generate enough power to activate the heating cells in his blanket.\nShe plucks the water patch out of her backpack, wondering if she should wait to give it to him as a warmer at night, like the way she used it last night, but makes up her mind and rips it open. Tepid water, heated from the ambient air of this land of dual suns, trickles down her hand. She rushes to lick it and it feels startling and moist on her tongue.\nWater.\nShe’s careful as she brings it over to Lukas, lifts up his head, and forces him to drink it. His eyes fly open when he realizes what it is that he is gulping. She realizes she’s licking her lips and her throat’s moving up and down, a phantom desire to taste what he’s having, as she feeds the elixir of H2O to him. He looks bewildered and his eyelids shut again. After he has gulped down the bulk of it, his eyes open again.\nJust a few drops left that Chenguang loathes to waste, so she rolls up the package, so light in her hands now, as a contrast to the luxurious heftiness of the water weight before, and stuffs the mostly-packaging into her pack. Maybe I’ll lick it clean when we pack up for the night.\nLukas’ eyes clear up from the haze and look at her as she eats her vaprabar. She’s trying to think. To put together the many strands of thought entangling within one another. What was that? Where did we go off to? What happened to that panel block of light bits? What to do with Lukas and his busted helmet? Water. I wish I could have tasted more of it.\nThe vaprabar shatters into dry bits in her mouth as she chomps.\n“Chenguang, thanks,” she hears Lukas behind her saying. She stops staring into the sky with its twin suns and turns around.\n“You okay?”\n“I don’t know. My knee’s not right. But, I think it’ll be better.”\nChenguang fishes out Eazslaps and helps him put it on. “Your turn for these.”\n“My helmet.” It’s a statement, not a question.\n“Yeah. Broken.”\n“What was that?”\n“I thought I’d ask you. You’re the one who touched it.”\n“I’m not sure. But I’ll admit, that was pretty dumb.”\n“Easier to say now, in retrospect. We had no idea what it could do.”\n“Thanks, nice of you to say. Though, I’m sorry.” He casts his eyes down and he does look penitent. He rubs the Eazslaps over his knee. Shiny blue peeks through his fingers to show they’re working. “Hey, you okay?”\n“Better off than you,” she says, swallowing the last of her bar.\n“So, I guess you’ll go off. Finish the cartography. I can poke around here. Look for some shelter for the night. Cuddle up next to some concrete.”\nChenguang shakes her head.\n“I think we should go down.”\n“Down?”\n“Into the wasteland. Into the buildings. Not just graze the rooftop. There might be something we can use to get you warm. Maybe some energy source. An old battery or something.”\n“There? There’s nothing left. People left long ago.”\n“I don’t know. I just get this feeling. You know, I felt something pull at me. Twice. And that panel of connected cubes of light. Maybe that has energy.”\n“Too dangerous. We’re not playing around with that.”\n“I’m not suggesting that. I just mean. We won’t know until we look. There’s no way I can map out this planet alone in time, so if you’re out of commission, neither of us will get our cred, you’ll be frozen dead from the night chill, and they’ll send new cartographers here. We’ll be in debt, paying for the commute and lift back. Well, I’ll be and you, too, if you manage to stay alive. This is the best way. Plus, I dunno. I just get this feeling.”\nLukas shakes his head.\n“Lukas, I saw an opening before.”\n“What?”\n“An opening into the buildings. They’re not all sealed off like the High Institute’s Historical Society claims. A space was overlooked. It’s way over the side of one of the buildings, about five buildings back. If we could just make our way over there—”\n“You’re crazy. You sure the blast didn’t mess you up? Going back and entering this condemned space—”\nChenguang hooks her arm into his elbow and helps him up. He limps, then shakes out his knee as he leans on her. He moves again and he looks more stable.\n“The swelling’s going down. You’re going to make it. Lucky, no blood, no concussion, right? Let’s go.”\nHe tries walking a few more steps. He squats and gets up.\n“Alright, hope you can leap, I’m heading over to the other side. Leave all the stuff. It’ll just weigh you down. Latch onto my arm if you can’t make it and I’ll give you a catch.”\nChenguang vaults back, retracing their way back to the building before. She makes it, though she’s not as swift as she once was.\nShe leans over the ledge and holds out her arms. She hopes she won’t have to catch him. She’s not sure if she can handle the weight after all.\nHe runs, looks good, tight form, and jumps and vaults. It’s clean and he lands with a roll onto the roof. He’s still limping, a bit. He’s trying to hide it.\nThey manage to leap, roll, and dash over to five buildings back.\nChenguang looks down the alleyway between two buildings. The black hole is there. A window that hasn’t been sealed up. She feels drawn towards it, like a whisper in the back of her mind guiding her that way. When she sees it, something like congruity settles in her bones.\n“We gotta go. You can make it. I know you can. At least the Eazslaps will dampen the pain enough, yeah?”\nShe leaps back and forth between the building she’s on and the other one that’s slightly taller, as she descends. Like a moth, fluttering from one surface to another, she hops, light and assured until she reaches the opening at the wall. She perches on the windowsill for a moment, feeling the cool air of inside on one side of her and the heat of the sun on the other.\n“Come on,” she says into her comm and she hears Lukas respond.\nShe alights onto concrete a few feet below the window and follows the panel of light from the window onto the floor. Nothing. Again, she sees nothing. Before she can walk up and explore, Lukas falls into place behind her.\n“Good, you made it. Now, let’s do a search.”\nThey spend about half an hour walking through the place, lighting up the room with activated ray fabric. It’s the most energy-efficient light they have, but it’s a harsh white glow. Mostly it’s just the rough white concrete that looks up at them.\nChenguang spends some of her pent-up stamina on staircases, jumping up flights at a time, passing through the rails.\nShe’s beginning to suspect this to be a great waste of time, and Lukas was right after all, when her cartographer’s scrutinizing gaze finds a deviation on the tiles of the bottommost level. A carved depression, hooked back like a handle.\nShe slides her hand and lifts.\nA basement?\nShe talks into her comm. “Lukas, slide down the banister to the bottom floor and get over here. There’s a route down here.”\nShe slips through, lands with a cat crouch, and walks in this dark tunnel. She’s feeling out the hollowness and the perfect curves of the walls when Lukas joins her.\n“Leg okay?”\n“Yeah.”\nThey walk what seems like ages. The path keeps going and going and a prod at the back of her mind’s telling her that she messed up. Lukas is losing strength, she can hear it in his breaths, even if he tries to hide it. She’s wasting time. Precious time that she could be charting out the world or at least soaking up the outside heat for the night.\nShe prompts her helmet and she’s at 78%. Yesterday she would have groaned. Today she’s thinking, not bad, given the circumstances.\nThe route opens up to a clearing.\nRather than empty space, the ray fabric shows tangles of webbing. She manipulates the fabric, shining the light at some of the strands. They’re cords. Tangles and tangles of cords. She hasn’t seen old tech like this in ages.\nShe follows them to their mass clump at the center.\n“An AI?” whispers Lukas.\nA voice booms throughout the chamber. Chenguang shines the ray fabric around, but the harsh light only illuminates cords. No speakers, but perhaps they’re implanted in the walls and ceiling. The voice sounds like it’s coming from everywhere.\n“Eybzzkey—”\nChenguang elbows Lukas and points at his comm. “Turn on the translator.”\nShe triggers her own on.\nThe voice changes, dark and silky. “You’ve come.”\n“You were expecting me?” Chenguang gestures to herself, as she walks forward, as if compelled by some force. Lukas puts a hand on her shoulder and Chenguang startles in her path forward.\n“The upgrades. They’re overdue.”\n“Upgrades,” says Chenguang. “No, we’re explorers. Well, cartographers, to be exact. Mapping out this land.”\n“No upgrade?”\n“Sorry, but, no.”\n“Drats.” This sounds vaguely funny to Chenguang and she hears Lukas smothering up a laugh with a cough.\n“Who—who are you?” Chenguang asks.\n“I’m the Tattle, the Tneshtown Center. I handle all the deliveries and packages. Last week, we produced, inspected, and delivered 72,000 glons of kenophrane alone, even in the midst of the disruptions from the war. I manage all the trade with the outer worlds and accommodate the schedule of the workers.”\n“Workers,” says Chenguang. She looks around. The room is bare except for the tangles of cords and them.\nTattle’s voice lowers. “It seems awfully quiet. Too quiet for a war.”\n“Tattle, there’s no one here except us. There was a war long ago.”\n“Long ago?” The voice lilts, waiting for something.\n“Not anymore. The city’s been abandoned.”\nIt’s silent. Only a light tapping sound at the center of the wire clump gives any indication of processing.\nTattle’s voice arises again. “Ah, well, that explains it.”\nIs it Chenguang’s imagination, or does it sound like its voice fell?\n“I only awake when there’s activity and a need. It’s to save on energy. I must have been idle for a long, long time.”\nLukas whispers in Chenguang’s ear. “I’m going to scan the wires.”\nChenguang speaks up, keeping one eye on Lukas who’s running his fingers about half a foot above a wire to her left. “Listen, Tattle, we’ll report your existence to our contractors, and they might be able to get you out of here. Or otherwise reprogram you for another use.” More like resell you to a less developed planet. “There’s nothing left for you here.”\n“No. I must stay here. I know this place will repopulate again. It has so much to offer. The jungle, the soil, and the resources. All the kenophrane.”\n“Kenophrane was added to the RSL—”\n“Restricted Substances List,” pipes up Lukas.\n“—for years now.”\nTattle’s voice rises. “I’ll have to reorganize some of my programs, prioritize probing new resources—”\n“Tattle, hey, Tattle. Listen. Before you do all that. There’s something we need to ask you. There’s a strange pull that I’ve been feeling. Messing with my movements. Part of it has led me here.”\n“A pull?”\n“Well, there’s a kind of double panel structure up on the roof a few buildings down and when I try to pass through it, it’s blocked. But, somehow, it led us to a dark space with a palm-sized slat of light made up of individual cubes.”\n“Did you touch it?”\n“Yes and—”\n“It exploded.” Tattle’s voice speaks definitively.\nLukas locks eyes with Chenguang and nods.\n“Yes, Tattle, we reached out to it and it exploded.”\n“Landmines.”\nChenguang was thumbing her pendant absently, but stops.\n“What?”\n“Planted by workers bought off by the Kthal. I got rid of most of them. Scoured the buildings inch to inch, but some of them are deep in the sub-layer, luring people in.”\n“I don’t understand. They’re mines?”\n“Yes, weaponized organics. I know there are still quite a few around. I tried my best. I really tried my best. I—”\n“Hey, Tattle, I’m sure you did. We’ll need to get rid of them. They can’t be here.”\n“I wish I could help you. But, when the organics were dead, they were easy to discard. You just needed to wrap them in some mellalophane. Now, they’re awake and their properties must be all different.”\nLukas stops what he’s doing, his hand midair and speaks up. “Awake? Organics. You mean, they’re alive? These landmines are alive?”\n“If enough time has elapsed as you say, then, yes, they’re alive.”\nLukas and I exchange a glance. Even in the diminishing light of ray fabric, I can read his expression. Anxiety at the crinkles of his eyes, his mouth upturned.\nTriple crap.\n“Are they conscious?”\n“Conscious?”\n“Are they intelligent creatures?”\n“I don’t know. I only knew them when they were dead. They are easy to find and harvest. An easy tool for the Kthal. But, I know the species has a long dormancy. Not dormancy, death really, as they have no vital signs. Vital signs of their own kind, that is. They experience a growth process thereafter. They start out simply a physical entity with no life to them, but the life sprouts later. The detonation still works while they are without life. It’s called their morterm period. The explosives are the best then, clean and with wide range. My directory tells me that when they are awake, their explosives are less predictable and less effective. Perhaps a small burst.”\n“Seems counterproductive to life. To be able to explode like that.”\n“It’s a protective strategy, you know. To protect the nest. In case someone comes, they’ll detonate, but each detonation is unique and doesn’t affect other individual cubes. Their death period allows conservation. Only when resources are good and predators few do they come alive. Altogether they form one big colony. They are harvested in layers and planted as mines.”\n“Do they communicate?”\n“Not when they’re dead.”\n“When they’re alive. What do they look like?”\n“Light. They light up, an indication of life. Isn’t that like many other organisms?”\n“Not all,” Chenguang says, looking at Lukas’ Eazslaps on his knees. Their light is fading.\n“We gotta go,” says Lukas. He motions at the ray fabric. Chenguang was so focused she didn’t notice how quickly the light had dimmed there, too.\n“Just, tell me if these landmines, if they’re intelligent. If they communicate. If they do, then this isn’t an abandoned area. It’ll be rezoned and re-designated.”\n“I wish I could tell you. I haven’t come across one. Maybe I will soon, though, since I’m awake now. Come back and visit me, okay? It’s too quiet in here. And if you don’t, I’ll sleep again, and who knows when I’ll awake—”\nTattle is still talking as they rush through the tunnel, the light fading quick. They need to rush back and retrieve their tents and packs before it’s pitch black.\nChenguang’s mind races as fast as her legs. They cannot, in good faith, finish their job as cartographers if there are living beings on this planet.\nAs she sprints down the tunnel, she runs through her sensations from before. The pulling, the urge to get closer. Perhaps pheromones or some other release of the organics.\nShe’s thinking of the sensations when she trips.\nNo, not again.\nLukas is there with her. Snagged in the sub-layer. They approach the light that pulses at them. The fragment of the slab that is the landmine.\n“As long as we don’t touch it, we’re okay, I think. Just don’t go near it,” says Lukas. But, he’s disobeying his own advice, drawing closer and closer. So does Chenguang. Her pendant around her neck flies up a bit, wavers, and falls and flies up. In tune to the pulsing.\nShe can’t help herself, she approaches. Closer. She feels a swarm of feelings in her body. She is warm-blooded, yes, she is warm-blooded, but her toes feel like ice, her chest like fire, her eyes like a subtle warmth, her hands the gentle coolness of a spring day in her homeworld. She wiggles her fingers, her toes—they feel like different worlds, disconnected.\nA thought dawns on her.\nShe breaks through the visceral impact of the feeling and turns to Lukas, who is spellbound, probably feeling all the same sensations.\n“You think, they’re communicating with us?”\n“The light pulses? They’re not changing—just rhythmic on and off.”\n“No, the temperatures. You feel that?”\nHe draws up next to her. His misty breath of icy coolness tells her his response.\n“I’m hot, cold, warm, everything, in all different places.”\nChenguang closes her eyes, focuses on the different feelings permeating in her body.\nShe imagines stalls, different stalls all over. They expand all over the planet. Stalls of different temperatures and the miniscule light cubes that bob along from one stall to the next. She sees mini-ecosystems in each stall. Some filled with other organic life, cohabiting, symbiotic forms of activity.\nShe opens her eyes. She’s still in this sub-layer space. She doesn’t touch but pulls her hand close to the cubes in front of her, emanating light. Each cube shoots out a different temperature, acutely different. Palpable.\n“Lukas, close your eyes and focus on your body, on all the different temperatures.”\nChenguang shivers, the chill in her spine deep, as she closes her warm eyes again.\nShe sees the image again, different stalls, life, organisms that look like trees, foliage and moving beads that slither on the ground. Tiny wispy helicopters floating in the air. In each stall are these cubes, like the ones before her in this sub-layer, some clumped together like clusters, emanating light and a particular heat signature.\nShe opens her eyes only to see Lukas open his, his pupils contract in the growing light of the landmine. He strokes his beard with a hand, as he drops his jaw. “I can’t believe it. They’re communicating with us. By heat—and cold.”\n“Do you think they’re sending us some image of the past? Of this planet?”\n“No, no. The files never showed the planet looking anything like what I just saw. Stalls. Cubicles you might call them.”\n“Yes, with different flora and maybe fauna, if you could call them that. Some organisms, anyway.”\nChenguang feels an excruciating heat in her nose. Is it one of assent? In her cold gut she feels something like a ‘yes,’ like something agreeing with her. The feeling grows.\n“Not the past,” she whispers. “The future.”\nLukas stares at her, with his strangely contracted pupils. “Yes, yes, you’re right. It’s their vision of their future.”\n“They’re trying to tell us they have plans for this place. I think. Maybe.”\n“You might be right.”\nThe impression of her body being isolated into various cells and splashed with varying amounts of heat and lack thereof starts to dissipate. The light of that bar of connected small cubes grows dimmer and once out of that trance of multi-thermal arrest, Chenguang realizes that their fabric ray light has died out completely. Without moving, they’re pulled away from that sub-layer space and return to their dark world in that abandoned building.\nNo, not abandoned, simply derelict.\nThey run, leap out of the underground tunnel, up into the basement, feeling their way through. Their leaps, vaults, and tumbles are more cautioned in the dead of the dark and they make gradual progress towards the roof.\nThey are lucky the moon is out, not trapped behind clouds like the other night. The return of light graces them with their characteristic fearlessness to pick up speed as they spring and leap back to their tents.\nUsually bound by a fierce love for personal space, tonight Chenguang invites Lukas into her own tent. He refuses, staying in his tent until she’s sick of hearing his teeth chatter through the comms and utters, “If you die of cold, I will string you up with the wires of the AI. And you will spend eternity with chatty Tattle.”\n“Who cares? I’ll be dead,” he says. But, his footsteps say otherwise and she hears the sound of the breach of the seal, as he fusses with the tent opening.\nAt night, they lay side by side, neither of them cold, not until, at least, the collected energy powering the thermal blanket drains and the chill seeps in. By then, it is near enough to dawn anyway. They’ll survive yet another night. She grabs his hand, not out of romance, but a sense of camaraderie, or a feeling of being alive, or of feeling warm. She doesn’t really know.\nHe squeezes the hand back. Props up on an elbow and looks her in the eye, heat emanating from his skin. “Last partner died of thirst. Accident, microhydro-gens short-circuited after a bad tumble. That sippee pack was to remind me of the dangers of these worlds.”\nShe nods. Not sure what to say. Sorry doesn’t really cut it. This is their life, stark and cold.\n“Light on our feet, but we all carry our burdens,” she says, holding up the picture of her sister. “I do it for her.”\nThat seems to satisfy him. He lays back down, closing his eyes.\nShe can feel the coolness of the pendant on her chest through her transpandex and imagines her sister’s smiling face. There would be no energy harvest here. This place would be rezoned.\nThat means no cred deposit for the mapping. No moving out of the hive for her sister and the rest of her holed-up hermits. But, her sister is a softie. She would like the story, one of a species discovered.\nWith her free hand, Chenguang paws at her pendant, feeling its coolness in her fingertips.\nOne thing strikes her. She reviews those sensations from the sub-layer. In her mind, when she felt the discrete areas of different levels of hot and cold take over her body, when she could imagine the entity, that strip of connected cubes pulsing at her, making her envision the temporally-distant space, she noticed something.\nThat imagined future, that vision. It wasn’t simply stalls of different levels of heat. There was something else there. She couldn’t pinpoint it at the time because it had been too long, it became too foreign. But, she knows it now, lying in the tent in the escaping heat, the chill breaking all logical resolve and allowing her mind to wander.\nIt wasn’t just temperature, there was a distinct feeling of heaviness. Of a heaviness in the air that could only be moisture. Humidity.\nThe mines, those beings—they didn’t simply envision a future with various temperatures. They envisioned one with various climates. With dew, fog, steam.\nIt was a feeling that had pervaded her nose, tickled her esophagus as it went down with the air, as her body went through the shock of manifold degrees.\nWater.\nAnd she felt, deep in her heart, that it would be real. In her cold-induced haze of half-sleep, clutching onto a warm, rough hand, she knew this would be a place that exists. And not far off, but in the near future. The feeling she only now could disentangle, she realizes, is a process that had catalyzed and was coming to life. A part of the communication, a pit feeling, that she could not fully decipher until now.\nAnd not only would this vision become real, but it would become a place that her holed-up people could trade with for the ever-scarce water. How the mine beings will make this water-filled ecosystem, she does not know, but there is much she does not know about the terraforming abilities of these creatures. Only that they can explode and creep into atmospheric sub-layers.\nBut, she feels that if she closes her eyes and focuses on the heat in her body, and drifts off mentally so reason no longer prevails, she can imagine herself and her sister, in a time she cannot place, sharing a warm thirst-quenching drink of liquid—tea, she realizes, a warm, dewy mug of tea with steam that rises and rises into the atmosphere—as she licks her lips and falls asleep.\nD.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation.", "source": "https://clarkesworldmagazine.com/spires_06_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Vault by D.A. Xiaolin Spires"}