{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ray Nayler", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "69ORLmhCPHAXEPQYRgzrFbxiWaw=", "id": null, "license": null, "comments": "", "raw_text": "5060 words, short story  Rain of Days  Deadwife picked this place, not me. She loved the beach. People who didn’t grow up near the ocean think the beach is paradise. They think of it as a destination. They aspire to living on the beach. To being near the water. They think they’ll walk along the sand every morning, barefoot, in some lazy lemon-yellow haze of satisfaction, with seagulls hovering at a respectful distance. Maybe a lean surfer jogging into the breakers with her board under her arm.  That’s the beach someone’s trying to sell you. People who grew up here know better. This no-man’s land where the land and sea meet is a graveyard. The breakers haul corpses out of the sea—those bones you call shells and turn into crappy wind chimes, the ragged carapaces of crabs emptied of their life-meat, the corpse of a seal with a screaming whorl of seagulls diving down to stab at it with their knife-faces.  Look into a seagull’s eyes and tell me how charming the beach is. There’s nothing in those eyes but hunger. Seagulls are web-footed little vultures. And don’t forget what sand is: stone and animals ground to powder by time and violence.  Deadwife picked this place, and I agreed to it because I always agreed with her. “This is it, Sandra,” she said, looking out at the combers hissing in over the stony bottom past the point, leaning a bit out over the rail of the lighthouse gallery. She was so happy, with the salt-breeze in her hair. “I don’t want to die—but if I have to, this is a good place to do it.”  So we signed the contract. We locked ourselves in at a good rate. That’s what the man at the bank said. And I wondered how he could say those words—you locked yourselves in—and think it sounded like a good thing. Like it sounded like anything but turning the key on your own cell door and handing it over to the guard.  When we locked ourselves in this place was different—the lighthouse, once a State Park, had been privatized and converted to a home for the aged. The tower and its expanded outbuildings were immaculately whitewashed and attended by smiling people dressed all in white, with the arc of beach in the shallow bay and a mosaic of kelp forests out beyond the breakers. It seemed about as good as you could get. Even I had to admit it looked like paradise—not my paradise, but someone’s.  But the world changed. And Deadwife, who had made all our decisions for us, slipped away. And it wasn’t the two of us who ended up here—it was only me.  I’m a little girl again, walking through a field of wild wheat. It’s not the dry season yet—the field is still green. Clouds scud through the sky. There is the hiss of a breeze across the grass. In the distance, the low mountain range is still green as well, the mottle of chaparral rising to a few higher peaks dusted lightly with snow.  I have a stick in my hand: a long stick with a forked end, stripped of bark. I’m looking for snakes. Specifically, I’m looking for nightsnakes, using the fork at the end of the stick to turn over boards and rocks. I’ll get $5 a snake from the pet store.  Hypsiglena ochrorhyncha nuchalata.  “See,” I say, “that’s the problem.”  The field shudders and loses its integration. The sky unzips from the sawtooth of grass. The scudding clouds leave contrails of unrendered sky. Then it is all gone, and I am sitting in the treatment room on that fantastically comfortable leather armchair, looking into the concerned face of my care technician, his eyes circled in blue acetate. The face on the screen pulls away as the mobile care unit backs up and wheels around to the front of the chair, extending a glass of water to me on a loop-ended appendage.  “What?” Dr. Kyzlak, my care technician says. “What’s it? Why did you drop out of sim?”  “Hypsiglena ochrorhyncha nuchalata.”  “I don’t know what that is.” The face blinks. Behind it is an island sunset, although I know really he’s sitting in his home office up in Portland, with a filter keeping his kid’s cartoon feedstream in the next room from bleeding in through his voice.  “That’s just it. Neither did I, when I was a little girl. It’s the scientific name for the California nightsnake. And the name for the wild wheat—Parish’s wheat grass, to be specific, is Elymus stebbinsii. This isn’t my memory, and I can tell, because it’s been . . . ” I couldn’t come up with any other word . . . “infected with these scientific names. Things I wouldn’t have known until much later. It’s not realistic.”  The appendage raises the glass of water a little, urging me to take it in a way that is uncannily human. I hate this about these corporeal avatars—how they have programmed in these little nudges in an attempt to make them seem more human. I snatch the water from its extended limb.  “It’s very realistic,” Dr. Kyzlak says. “That’s the way all memories work, in fact. What do you think a memory is? It’s not some static thing, just sitting there in the mind. Memories are changed every time they are accessed. Memories are in dialogue with lived experience. If you were remembering a real moment from your childhood, you would experience the same thing—memories are viewed from a present point in time, and they are invested with new knowledge.”  His avatar rotates slightly, the screen-mount neck tilting upward and angling the screen in front of my face, a little closer than I would like. “The real problem,” he says, trying to make eye contact with me, “is resistance. For whatever reason, you are not leaning into this therapy. You continue to attend the sessions, which are perfectly voluntary, but you resist the therapy itself.”  “The light isn’t right.”  “What?”  “The light. In the field. I don’t know where they are getting the data from for the reconstructs, but the light isn’t right. It’s a stereotype of California light. They’ve imported light from somewhere down around Los Angeles. Up here the light is whiter. San Francisco is at the same latitude as Beijing.”  “This is what I mean. You understand perfectly well that no simulation is going to be perfect. Perfection isn’t the aim. These aren’t your memories, just constructs. The aim is to stimulate your neural connectome—to find the crossover points into your real memories.”  “Maybe I don’t want to access those,” I say. And before I can stop myself: “Maybe I don’t want to . . . what’s that phrase you used? Infect them with new knowledge. Maybe I just want to leave them alone.”  “Invest them with new knowledge,” Dr. Kyzlak corrects.  “I know what I said.”  The old names for things cling to them, long after those names become meaningless to the people using or occupying them. I walk into the TV room, which probably never had a TV in it, and lower myself into another fantastically comfortable piece of furniture, the pseudoleather couch oriented to the enormous window overlooking the Pacific.  There is no Pacific. All that can be seen is the rain lashing against the insulated crystal of the viewing window. Behind that violent pattern, altered every second as a new gust of wind whips droplets against the building, is a gray, undifferentiated mist. If I stood up and walked to the window, looked directly down, I might be able to see as far as the wet gray rock of the point several meters below before the view was consumed by haze.  Off to my right is Annabel, sitting at a table with the upper half of her head obscured by the VR set, an articulated arm hovering over her. I think she didn’t hear me come in until she says, without turning her head in my direction, “Hi Sandra.”  “How did you know it was me?”  “Dark energy.”  “Oh for Christ’s sake,” I say. “What are you watching?”  “Giant Galapagos turtles fucking. Did you know the male Galapagos turtle’s shell is concave on the bottom so he can get a better grip on the female when he mounts her?”  “Sexy.”  “Nature thinks of everything.”  “How long has it been raining for, now?”  She makes the pause sign with her left hand, and the VR set lifts up, angles away, and slides into its slot on the table.  “Ten days.” She has a new hairstyle: her head shaved all the way up to a cobalt mohawk. It looks daring, and pretty terrible, but I like it on her. “Ten days without stopping.”  “Well, that’s the end of the drought, anyway.”  “And of the fires, for a while.”  “And the beginning of the mudslides, flash floods, all that good stuff.”  “So positive.”  “Cram twenty million people into a disaster ecology, that’s what you get.”  “Used to be fifty million.”  “Used to be lots of things, including a mosaic of linguistically distinct cultures attending to its fragility with sophisticated seasonal environmental management techniques, until the Europeans came along, and—”  “What is with you today? Did you just come from memory therapy?”  “How did you guess?”  “The foul mood. You know, the memory therapy is a good thing. If they think you need it, you do. Why not just make the best of it?”  “I guess I am making the best of it. The best I’m capable of making . . . ”  “No, you’re not. You’re doing everything you can to be miserable about it.”  At that moment we hear the tread of the Lifter in the hall. We both turn to watch it go by, illuminated in the yellow-orange diode motion-sensing lights that silently switch on with its passing. It pauses in the doorway and waves at us with one of its four padded arms. Annabel waves back to it. I give it the finger. It turns and continues down the hall.  “Probably collecting Tai for lunch.”  Tai, Annabel, me, and Imani. The only residents left in a facility that was built for a hundred. We’re the ones who locked themselves in at a good rate, I guess. The others thought better of it—or died sooner, or paid penalties and transferred out. When I arrived, there were ten of us. But since then—five years ago, now—two had died and four had transferred to facilities farther inland. More expensive facilities, places staffed by at least a few real people, not just a bunch of robots and a few teleworking doctors projected on avatar screens.  “What is it about the Lifter that gives you the creeps?”  “It doesn’t give me the creeps.”  “You freeze up every time it’s around.”  “I do not. And you really shouldn’t let a robot cut your hair.”  “Seriously, Sandra.”  “I mean it. I’m telling you this as a friend.”  “Ok, don’t talk about it. Don’t talk about anything.” She stands up. “I’ll see you in the cafeteria. I’ve got to stop by my room.”  It takes me thirty seconds of struggling to stand up. These damn couches, too low to the ground, with their slippery pseudoleather—it’s like a bad joke.  “I know what I said.”  Dr. Kyzlak blinked from the screen.  “So—I don’t understand. You want to have memories, just locked away, but not access them? I’m not following.”  “No. Maybe. I guess what I want is . . . ”  “Not to get old. Not to forget the people you care about.”  “Can I go now?”  Walking down the hallway to the cafeteria, I keep coming back to that conversation with irritation. At some point in your life, people decide you don’t know what’s best for yourself anymore. There’s lots of talk about old age as a “second childhood,” which is nonsense. But one thing is true: at some point, people decide you need their help to determine what is best for you. That you can’t make you own decisions.  Even Annabel, who is no younger than me, thinks she can tell me what to do.  Tai, who is like twenty years older than both of us, eats a fruit cup and watches us spar with glee.  “I just don’t see the point of it,” I say. “I’m taking the drugs. It should be enough.”  “I found the memory therapy really helpful.”  “I bet what they are really doing is jotting down everyone’s memories so they can sell them to some telenovela corporation. House husbands are probably weeping to your memories in Patagonia right now.”  “Oh, please,” Annabel said. “I managed to live an entire life without anything happening to me.”  I turn to Tai. “Did you ever do memory therapy?”  He shakes his head. “No. I want to do forgetting therapy.” He taps the screen on his monitor. “Too much stuff in my head. I thought maybe some of it would move aside to make room for new stuff over the years, but none of it does.”  “Hey,” I say, watching the Lifter lumber toward us through a dining room far too big for the single table left in it and trying to think of something else. “Where is Imani?”  “She had some tests that needed to be done off-site,” Tai said.  “Tests for what?”  “One of the Big Fears,” Tai says, as the Lifter bends down and takes him into two of its padded arms. Tai pats the Lifter on its vestigial head. “Be gentle with me, big boy. I’m not as tough as I used to be.”  The Lifter can’t speak, but the strip of diodes that are the only feature on its gray carboplast face pulse green.  The Lifter turns and carries Tai away, and all I can think of is Frankenstein’s Monster carrying Ilona Massey in Frankenstein Meets the Wolf Man. Tai throws his head back dramatically, eyes closed, and completes the look.  The Big Fears. Cancer, a stroke, heart failure . . . “Did you know about Imani?”  Annabel shakes her head. One of the service bots is clearing the table. She reaches over and thumbs the sticker from her banana peel onto its head, where it joins the hundreds of other stickers Annabel has been plastering it with since she got here.  “Is that my tip?” the bot asks.  “No, this is your tip: Electricity and water don’t mix. Whatever you do, stay dry on the inside.”  “Useful information. I’ll keep it in mind for the robot uprising. Gotta work on our weak points.” It totters off with our trays.  “I like that one,” Annabel says. “Of all the things in here that talk, I think it has the best sense of humor.”  “I’m taking that personally.”  “You should.”  “How long has it been raining there?”  “Twelve days.”  Dr. Kyzlak shakes his head, and the screen at the end of the avatar’s stalk neck also moves from side to side.  Nice touch, I think.  “It’s like being on a ship at sea. Hey—can you do me a favor? Is it raining where you are?”  “No.”  “Can you turn the camera and just show me some sun?”  “Sure.” The screen judders. As the camera sweeps across a room, I see Central Asian carpets, a decorative bowl on a recycled wood coffee table. Nice. He’s making good money on this remote memory therapy gig. Then sun, blazing in through the window on a clear day.  I never cared much about the sun. That was Deadwife’s thing. She said it charged her batteries, and I believe it. I can’t remember how many times I caught her standing, the sun on her face, just absorbing its rays.  I can’t remember.  That’s the truth of it. I’m losing her.  “You did really well today,” Dr. Kyzlak says. “There was something different about today. It was as if you were really trying.”  “You fixed the light.”  “Yes—I tweaked it myself. A little home brew filter I popped in there for you. Did you feel anything? Did the memory open anything up for you—connect with any of your natural neural loops?”  “No.”  “It will happen,” he says. “Eventually, it always does.” The avatar hands me my glass of water on its little looped appendage. “I look forward to tomorrow’s session. And I hope it stops raining there.” The avatar’s screen shuts off, and it enters its RETURN autoroutine, rolling across the floor to its charging station and going limp.  It takes me twenty minutes to get up out of the armchair. By the time I do, I am panting with the effort. I’ve dropped the glass on the floor. But I get upright—and at least the glass didn’t break—and call in a cleanerbot to add to my embarrassment.  Fatigue. Emotional distress. All this rain. I’ll feel better in a few days. But maybe I’ll skip lunch with the others—take it in bed, instead.  If Deadwife were here, she’d be furious with me.  I see the Lifter, standing in the doorway.  “What are you looking at, fucker?”  It just raises a hand in a wave, then clomps off.  Lunch is brought to me, slightly cold, by the bot Annabel has been decorating with banana stickers. It adjusts my bed’s articulated tray at a proper angle, fusses with the silverware. As it is leaving, I notice a piece of paper on the tray. Not a napkin—a note. I tap it. “Who is this from?”  The robot turns. “I . . . I have something to confess. I have developed . . . feelings for you. Feelings I have long been repressing. It’s . . . your menu choices. So enticing.”  It waits a beat, while my mouth hangs open. “Just kidding. Annabel told me to say that. The note is from her.”  I eat the food, not really tasting it. I keep going back over the simple memory Dr. Kyzlak constructed for me. Walking through that field, turning over planks and stones with a stick, looking for the California nightsnake. Why that one? Why did they choose that one? I close my eyes and settle into it. I’m hoping for that connection, that point at which this memory will cross over into something else. Do I remember a field? But when I try to remember a real field, where I really hunted for snakes, all I get is this one. He’s failed—this therapy doesn’t work. Instead of waking old memories, it’s covering them over. Replacing them.  I hear the clumping of the Lifter in the hallway. And a voice, Tai’s voice, as they pass. He’s talking to it, to that thing that doesn’t even have a face. I can barely make out what he is saying over the angry lash of rain against the window.  “ . . . being carried. It reminds me of the war. I didn’t carry her this way, of course. I carried her over my shoulder. Slung her over my shoulder and went up the hill. And when I got there, I lay her down and then collapsed. The medic’s face—I’ll never forget his face. I had been hit by a bullet while I was carrying her, and I didn’t even know it. Later the medic visited me in the hospital. He told me—he told me he could see my heart beating in the wound . . . ”  They cross in front of my door and pause. The Lifter raises one of its two free arms and waves. Tai waggles a foot at me. “I hear Imani’s back,” he says.  “What about the Big Fear?”  “What about it? Go ask her yourself.”  As they continue down the hallway his voice goes on.  Remembering. Telling his story.  I hadn’t even known Tai fought in a war.  I open the note.  You’re not fooling anyone, asshole is written in Annabel’s shaky hand.  I wake to a sound I have never heard before. A moaning siren, like something in a movie. It goes on and on, a howl over the sound of the rain. The room is dark, lit only by the cobalt glow of the emergency diode strips.  What is it? What is happening? In the dream I woke from, I was holding my stick out, about to push aside a ragged chunk of plywood with its forked end. I knew, I knew there would be one under there.  Now I am fully awake, the adrenaline coursing through me. And in the blue glow I see it—the bulk of it, looming above my bed. The red stripe of light in its vestigial face as it bends over me.  “Get off me!” I scream as it leans in and slides its arms under my knees and back. Arms, I realize, that are wet. And as it raises a third arm to keep me from struggling, that arm drips water across my face, and I scream at the cold and the shock of it.  “What are you doing? Get off of me!” I hammer at its head with my fists as it pulls me from the bed, pinning me slightly with its third and now fourth arms, clamping me close to itself. It is soaking wet.  The sound from outside, the moan of some kind of siren in the dark. As we lurch down the hall I see the service bot from the kitchen, propping open the emergency exit door. The rain is pouring into the building from outside. We pass the bot, sentried at the door with its helmet of banana stickers, and I find myself thinking, absurdly:  “No, this is your tip: Electricity and water don’t mix. Whatever you do, stay dry on the inside.”  “Useful information. I’ll keep it in mind for the robot uprising. Gotta work on our weak points.”  Then I am outside. The full force of the freezing rain hits me.  And I remember.  I am running across the parking lot. The autocab had some kind of malfunction. I summoned the drone driver, somewhere in a pod in the Midwest, probably, responsible for a hundred of these cabs.  “I’m on the other side of the parking lot and it’s raining,” I say. “Raining really hard. Can you drive me in closer?”  Static and a mess of bleeping, and then a voice came through: “This cab is red-dotted. I’m going to need to call in a maintenance bot. Battery’s dead. I’m sorry.”  No umbrella, because I never carry an umbrella when it actually rains. And god, it’s raining hard—so hard the rain is bouncing up off the pavement, soaking everything up to my knees. By the time I reach the hospital overhang I’m as wet as it’s possible to be. Wet to the skin, wet through my underwear, puddles of water in shoes that are probably ruined. Shit! But what am I so worried about, as I stab the elevator button? You’re going to be fine. This is all routine.  You’re dead, but I don’t know it yet, and standing in the elevator I remember another time I was this wet—with you. Caught in a cloudburst in New Orleans and neither one of us had ever seen it rain like that. We thought we could walk a block, at least, then duck into a café, but the moment we stepped out into it we were soaked. Like this—soaked to the skin, right through the underwear, as wet as if we’d climbed into a warm bath—because that rain isn’t cold: it’s a tropical rain, warm like neither of us have really experienced, a sheet of water falling from a hot sky that a moment ago was sunny but now is dark. You’re dead and I don’t know it yet, and I’m in the elevator smiling, remembering the two of us deciding to just walk back to the little studio we rented because it just didn’t matter anymore.  “It’s not like we could get any wetter,” you say. And you step out from under the eaves with a shrug.  Or—that’s the way I used to remember it. But now, as I remember this, it’s backwards. I am the one who steps out. I am the one standing there in the rain, holding a hand out to you, wavering behind the waterfall pouring from the awning. You are the one who hesitates before stepping out. But that’s not right: in this memory I was always the hesitant one. I gave the role of courage to you. You held the hand out to me. So which is true? Was I the brave one? Were you? Did we take turns?  Whichever it was, once you were gone, I stopped feeling that courage. I started pretending that I didn’t make my own decisions anymore.  I started pretending everything was locked in.Locked in at a good rate—locked in by decisions you had made. But that’s not right: we made our decisions together. The problem is, I’m the only one still around to accept the consequences.  The elevator dings. I won’t go any further. I told you—I would forget you. If you died before me, I would never return to this memory. I would never walk up to your bed and see you there, unmoving. Gone. I told you, Deadwife: I would never even call you by your real name again. You weren’t allowed to go. Because I wouldn’t be able to live without you.  But I did. I did live without you.  The elevator door opens, and the lifter carries me out onto the gallery of the lighthouse. The gallery is crammed with people and bots. Annabel is there, and Tai. And Imani is there, clutching the disk of the mopbot from her room against her chest. Imani, back from the land of the dead. The Lifter sets me down gently next to Imani, our backs against the wall. The door closes with the Lifter still inside.  “That’s all of us. Where’s he going?” I have to scream to be heard over the siren. I realize what it sounds like: it sounds like an air raid siren, in one of those old movies about the Twentieth Century Wars.  “There are still bots left!” Imani yells. “Some of them can’t make it out of the building by themselves!”  Annabel leans over: “Like you, asshole! Except they’re probably smart enough to know when they need help!”  “There.” Tai points. He slides forward, pressing his face against the rails of the gallery. I follow his gaze. At first I don’t see anything at all. Then I do see it: a coil of darkness heaving in the sea. A bulge in the water. A whip arcing in toward the shore. At a distance it barely seems to move at all. But as it closes in on land, it speeds up.  We all watch the curve of darkness rushing to the shore. I think of the Lifter down there, the maintenance bot with its head full of banana peel stickers. I try to think, for a moment, if there is anything down there in those buildings that I cannot bear to lose—but no. Everything I cannot lose is in my head. In my head or here, on the gallery, watching this serpent of power slide through the ocean toward us.  Then it is here. The point is gone. The wave hits the first of the whitewashed buildings. For a moment nothing at all happens. Then the building moves in the water, comes free and pushes itself against another building. That one hesitates a moment before it, too, starts to move.  When the water hits the lighthouse the whole structure vibrates. But the way it vibrates, you can tell it is going to hold.  The elevator dings. The door opens and the Lifter is there, with an armload of bots: sweepers and moppers, little handybot units, and even Dr. Kyzlak’s limp avatar, which the four-armed Lifter holds aloft in one hand like Anubis with his shepherd’s crook. And next to the Lifter is Annabel’s service bot.  In that moment, the elevator lights flicker and die. The nearest siren dies too. I can still hear the sound, like an echo, from up the coast. From a siren that is still standing.  I pull myself over to the rail and look down. The sea has lost all shape: it is boiling underneath us, churning, choked with debris as the last home I ever thought I would have breaks apart. I hear the shattering of glass and feel things thud into the stone tower of the lighthouse, whole buildings being torn into nothing. The water rises and rises against the lighthouse’s side. I see a mattress like a raft. It could have come from my own bed.  Imani puts an arm around Annabel and another around me. Annabel holds on to Tai. When I turn to look at Imani she has a huge grin on her face. She sees me looking at her.  “Nothing can get me today!” she yells over the sound of the ocean ripping our world apart. “Not cancer and not a fucking tsunami. I feel immortal!”  I feel it too. Immortality. It’s not a feeling of living forever, but a feeling of suddenly being alive. And that feeling reaches out to a hundred memories of you, Josephine—because it was with you that I felt it most. The feeling is like the smell of honeysuckle, which links suddenly to all the times in your life when you smelled honeysuckle into an endless chain of summers. Everything seems, in that moment, like a pattern you will always hold inside you.  I remember.  I turn to the Lifter. “Thank you. You saved my life.” And my memories, I want to say. More precious, even, than my life.  “Don’t say ‘thank you,’” the service bot says.  “What should I say?”  “Say, ‘I welcome you, robot overlords.’”  Annabel laughs. “I told you—of all the things that talk in this place, bananahead here is the funniest.”  “Thank you,” the service bot says. “I’m here all week. Or at least until they come to rescue us.” Ray Nayler has lived and worked in Russia, Central Asia, the Caucasus, and the Balkans for nearly two decades. He is a Foreign Service Officer, and previously worked in international educational development, as well as serving in the Peace Corps in Ashgabat, Turkmenistan. Ray began publishing speculative fiction in 2015 in the pages of Asimov’s with the short story “Mutability.” Since then, his critically acclaimed stories have seen print in Clarkesworld, Analog, The Magazine of Fantasy and Science Fiction, Lightspeed, and Nightmare, as well as in several “Best of the Year” anthologies. His SF translations from Russian have appeared in Clarkesworld and Samovar. His story “Winter Timeshare” from the January/February 2017 issue of Asimov’s was collected in The Very Best of the Best: 35 Years of the Year’s Best Science Fiction. Ray’s debut novel, The Mountain in the Sea, will be released this fall by MCD x FSG.", "text": "5060 words, short story\nRain of Days\nDeadwife picked this place, not me. She loved the beach. People who didn’t grow up near the ocean think the beach is paradise. They think of it as a destination. They aspire to living on the beach. To being near the water. They think they’ll walk along the sand every morning, barefoot, in some lazy lemon-yellow haze of satisfaction, with seagulls hovering at a respectful distance. Maybe a lean surfer jogging into the breakers with her board under her arm.\nThat’s the beach someone’s trying to sell you. People who grew up here know better. This no-man’s land where the land and sea meet is a graveyard. The breakers haul corpses out of the sea—those bones you call shells and turn into crappy wind chimes, the ragged carapaces of crabs emptied of their life-meat, the corpse of a seal with a screaming whorl of seagulls diving down to stab at it with their knife-faces.\nLook into a seagull’s eyes and tell me how charming the beach is. There’s nothing in those eyes but hunger. Seagulls are web-footed little vultures. And don’t forget what sand is: stone and animals ground to powder by time and violence.\nDeadwife picked this place, and I agreed to it because I always agreed with her. “This is it, Sandra,” she said, looking out at the combers hissing in over the stony bottom past the point, leaning a bit out over the rail of the lighthouse gallery. She was so happy, with the salt-breeze in her hair. “I don’t want to die—but if I have to, this is a good place to do it.”\nSo we signed the contract. We locked ourselves in at a good rate. That’s what the man at the bank said. And I wondered how he could say those words—you locked yourselves in—and think it sounded like a good thing. Like it sounded like anything but turning the key on your own cell door and handing it over to the guard.\nWhen we locked ourselves in this place was different—the lighthouse, once a State Park, had been privatized and converted to a home for the aged. The tower and its expanded outbuildings were immaculately whitewashed and attended by smiling people dressed all in white, with the arc of beach in the shallow bay and a mosaic of kelp forests out beyond the breakers. It seemed about as good as you could get. Even I had to admit it looked like paradise—not my paradise, but someone’s.\nBut the world changed. And Deadwife, who had made all our decisions for us, slipped away. And it wasn’t the two of us who ended up here—it was only me.\nI’m a little girl again, walking through a field of wild wheat. It’s not the dry season yet—the field is still green. Clouds scud through the sky. There is the hiss of a breeze across the grass. In the distance, the low mountain range is still green as well, the mottle of chaparral rising to a few higher peaks dusted lightly with snow.\nI have a stick in my hand: a long stick with a forked end, stripped of bark. I’m looking for snakes. Specifically, I’m looking for nightsnakes, using the fork at the end of the stick to turn over boards and rocks. I’ll get $5 a snake from the pet store.\nHypsiglena ochrorhyncha nuchalata.\n“See,” I say, “that’s the problem.”\nThe field shudders and loses its integration. The sky unzips from the sawtooth of grass. The scudding clouds leave contrails of unrendered sky. Then it is all gone, and I am sitting in the treatment room on that fantastically comfortable leather armchair, looking into the concerned face of my care technician, his eyes circled in blue acetate. The face on the screen pulls away as the mobile care unit backs up and wheels around to the front of the chair, extending a glass of water to me on a loop-ended appendage.\n“What?” Dr. Kyzlak, my care technician says. “What’s it? Why did you drop out of sim?”\n“Hypsiglena ochrorhyncha nuchalata.”\n“I don’t know what that is.” The face blinks. Behind it is an island sunset, although I know really he’s sitting in his home office up in Portland, with a filter keeping his kid’s cartoon feedstream in the next room from bleeding in through his voice.\n“That’s just it. Neither did I, when I was a little girl. It’s the scientific name for the California nightsnake. And the name for the wild wheat—Parish’s wheat grass, to be specific, is Elymus stebbinsii. This isn’t my memory, and I can tell, because it’s been . . . ” I couldn’t come up with any other word . . . “infected with these scientific names. Things I wouldn’t have known until much later. It’s not realistic.”\nThe appendage raises the glass of water a little, urging me to take it in a way that is uncannily human. I hate this about these corporeal avatars—how they have programmed in these little nudges in an attempt to make them seem more human. I snatch the water from its extended limb.\n“It’s very realistic,” Dr. Kyzlak says. “That’s the way all memories work, in fact. What do you think a memory is? It’s not some static thing, just sitting there in the mind. Memories are changed every time they are accessed. Memories are in dialogue with lived experience. If you were remembering a real moment from your childhood, you would experience the same thing—memories are viewed from a present point in time, and they are invested with new knowledge.”\nHis avatar rotates slightly, the screen-mount neck tilting upward and angling the screen in front of my face, a little closer than I would like. “The real problem,” he says, trying to make eye contact with me, “is resistance. For whatever reason, you are not leaning into this therapy. You continue to attend the sessions, which are perfectly voluntary, but you resist the therapy itself.”\n“The light isn’t right.”\n“What?”\n“The light. In the field. I don’t know where they are getting the data from for the reconstructs, but the light isn’t right. It’s a stereotype of California light. They’ve imported light from somewhere down around Los Angeles. Up here the light is whiter. San Francisco is at the same latitude as Beijing.”\n“This is what I mean. You understand perfectly well that no simulation is going to be perfect. Perfection isn’t the aim. These aren’t your memories, just constructs. The aim is to stimulate your neural connectome—to find the crossover points into your real memories.”\n“Maybe I don’t want to access those,” I say. And before I can stop myself: “Maybe I don’t want to . . . what’s that phrase you used? Infect them with new knowledge. Maybe I just want to leave them alone.”\n“Invest them with new knowledge,” Dr. Kyzlak corrects.\n“I know what I said.”\nThe old names for things cling to them, long after those names become meaningless to the people using or occupying them. I walk into the TV room, which probably never had a TV in it, and lower myself into another fantastically comfortable piece of furniture, the pseudoleather couch oriented to the enormous window overlooking the Pacific.\nThere is no Pacific. All that can be seen is the rain lashing against the insulated crystal of the viewing window. Behind that violent pattern, altered every second as a new gust of wind whips droplets against the building, is a gray, undifferentiated mist. If I stood up and walked to the window, looked directly down, I might be able to see as far as the wet gray rock of the point several meters below before the view was consumed by haze.\nOff to my right is Annabel, sitting at a table with the upper half of her head obscured by the VR set, an articulated arm hovering over her. I think she didn’t hear me come in until she says, without turning her head in my direction, “Hi Sandra.”\n“How did you know it was me?”\n“Dark energy.”\n“Oh for Christ’s sake,” I say. “What are you watching?”\n“Giant Galapagos turtles fucking. Did you know the male Galapagos turtle’s shell is concave on the bottom so he can get a better grip on the female when he mounts her?”\n“Sexy.”\n“Nature thinks of everything.”\n“How long has it been raining for, now?”\nShe makes the pause sign with her left hand, and the VR set lifts up, angles away, and slides into its slot on the table.\n“Ten days.” She has a new hairstyle: her head shaved all the way up to a cobalt mohawk. It looks daring, and pretty terrible, but I like it on her. “Ten days without stopping.”\n“Well, that’s the end of the drought, anyway.”\n“And of the fires, for a while.”\n“And the beginning of the mudslides, flash floods, all that good stuff.”\n“So positive.”\n“Cram twenty million people into a disaster ecology, that’s what you get.”\n“Used to be fifty million.”\n“Used to be lots of things, including a mosaic of linguistically distinct cultures attending to its fragility with sophisticated seasonal environmental management techniques, until the Europeans came along, and—”\n“What is with you today? Did you just come from memory therapy?”\n“How did you guess?”\n“The foul mood. You know, the memory therapy is a good thing. If they think you need it, you do. Why not just make the best of it?”\n“I guess I am making the best of it. The best I’m capable of making . . . ”\n“No, you’re not. You’re doing everything you can to be miserable about it.”\nAt that moment we hear the tread of the Lifter in the hall. We both turn to watch it go by, illuminated in the yellow-orange diode motion-sensing lights that silently switch on with its passing. It pauses in the doorway and waves at us with one of its four padded arms. Annabel waves back to it. I give it the finger. It turns and continues down the hall.\n“Probably collecting Tai for lunch.”\nTai, Annabel, me, and Imani. The only residents left in a facility that was built for a hundred. We’re the ones who locked themselves in at a good rate, I guess. The others thought better of it—or died sooner, or paid penalties and transferred out. When I arrived, there were ten of us. But since then—five years ago, now—two had died and four had transferred to facilities farther inland. More expensive facilities, places staffed by at least a few real people, not just a bunch of robots and a few teleworking doctors projected on avatar screens.\n“What is it about the Lifter that gives you the creeps?”\n“It doesn’t give me the creeps.”\n“You freeze up every time it’s around.”\n“I do not. And you really shouldn’t let a robot cut your hair.”\n“Seriously, Sandra.”\n“I mean it. I’m telling you this as a friend.”\n“Ok, don’t talk about it. Don’t talk about anything.” She stands up. “I’ll see you in the cafeteria. I’ve got to stop by my room.”\nIt takes me thirty seconds of struggling to stand up. These damn couches, too low to the ground, with their slippery pseudoleather—it’s like a bad joke.\n“I know what I said.”\nDr. Kyzlak blinked from the screen.\n“So—I don’t understand. You want to have memories, just locked away, but not access them? I’m not following.”\n“No. Maybe. I guess what I want is . . . ”\n“Not to get old. Not to forget the people you care about.”\n“Can I go now?”\nWalking down the hallway to the cafeteria, I keep coming back to that conversation with irritation. At some point in your life, people decide you don’t know what’s best for yourself anymore. There’s lots of talk about old age as a “second childhood,” which is nonsense. But one thing is true: at some point, people decide you need their help to determine what is best for you. That you can’t make you own decisions.\nEven Annabel, who is no younger than me, thinks she can tell me what to do.\nTai, who is like twenty years older than both of us, eats a fruit cup and watches us spar with glee.\n“I just don’t see the point of it,” I say. “I’m taking the drugs. It should be enough.”\n“I found the memory therapy really helpful.”\n“I bet what they are really doing is jotting down everyone’s memories so they can sell them to some telenovela corporation. House husbands are probably weeping to your memories in Patagonia right now.”\n“Oh, please,” Annabel said. “I managed to live an entire life without anything happening to me.”\nI turn to Tai. “Did you ever do memory therapy?”\nHe shakes his head. “No. I want to do forgetting therapy.” He taps the screen on his monitor. “Too much stuff in my head. I thought maybe some of it would move aside to make room for new stuff over the years, but none of it does.”\n“Hey,” I say, watching the Lifter lumber toward us through a dining room far too big for the single table left in it and trying to think of something else. “Where is Imani?”\n“She had some tests that needed to be done off-site,” Tai said.\n“Tests for what?”\n“One of the Big Fears,” Tai says, as the Lifter bends down and takes him into two of its padded arms. Tai pats the Lifter on its vestigial head. “Be gentle with me, big boy. I’m not as tough as I used to be.”\nThe Lifter can’t speak, but the strip of diodes that are the only feature on its gray carboplast face pulse green.\nThe Lifter turns and carries Tai away, and all I can think of is Frankenstein’s Monster carrying Ilona Massey in Frankenstein Meets the Wolf Man. Tai throws his head back dramatically, eyes closed, and completes the look.\nThe Big Fears. Cancer, a stroke, heart failure . . . “Did you know about Imani?”\nAnnabel shakes her head. One of the service bots is clearing the table. She reaches over and thumbs the sticker from her banana peel onto its head, where it joins the hundreds of other stickers Annabel has been plastering it with since she got here.\n“Is that my tip?” the bot asks.\n“No, this is your tip: Electricity and water don’t mix. Whatever you do, stay dry on the inside.”\n“Useful information. I’ll keep it in mind for the robot uprising. Gotta work on our weak points.” It totters off with our trays.\n“I like that one,” Annabel says. “Of all the things in here that talk, I think it has the best sense of humor.”\n“I’m taking that personally.”\n“You should.”\n“How long has it been raining there?”\n“Twelve days.”\nDr. Kyzlak shakes his head, and the screen at the end of the avatar’s stalk neck also moves from side to side.\nNice touch, I think.\n“It’s like being on a ship at sea. Hey—can you do me a favor? Is it raining where you are?”\n“No.”\n“Can you turn the camera and just show me some sun?”\n“Sure.” The screen judders. As the camera sweeps across a room, I see Central Asian carpets, a decorative bowl on a recycled wood coffee table. Nice. He’s making good money on this remote memory therapy gig. Then sun, blazing in through the window on a clear day.\nI never cared much about the sun. That was Deadwife’s thing. She said it charged her batteries, and I believe it. I can’t remember how many times I caught her standing, the sun on her face, just absorbing its rays.\nI can’t remember.\nThat’s the truth of it. I’m losing her.\n“You did really well today,” Dr. Kyzlak says. “There was something different about today. It was as if you were really trying.”\n“You fixed the light.”\n“Yes—I tweaked it myself. A little home brew filter I popped in there for you. Did you feel anything? Did the memory open anything up for you—connect with any of your natural neural loops?”\n“No.”\n“It will happen,” he says. “Eventually, it always does.” The avatar hands me my glass of water on its little looped appendage. “I look forward to tomorrow’s session. And I hope it stops raining there.” The avatar’s screen shuts off, and it enters its RETURN autoroutine, rolling across the floor to its charging station and going limp.\nIt takes me twenty minutes to get up out of the armchair. By the time I do, I am panting with the effort. I’ve dropped the glass on the floor. But I get upright—and at least the glass didn’t break—and call in a cleanerbot to add to my embarrassment.\nFatigue. Emotional distress. All this rain. I’ll feel better in a few days. But maybe I’ll skip lunch with the others—take it in bed, instead.\nIf Deadwife were here, she’d be furious with me.\nI see the Lifter, standing in the doorway.\n“What are you looking at, fucker?”\nIt just raises a hand in a wave, then clomps off.\nLunch is brought to me, slightly cold, by the bot Annabel has been decorating with banana stickers. It adjusts my bed’s articulated tray at a proper angle, fusses with the silverware. As it is leaving, I notice a piece of paper on the tray. Not a napkin—a note. I tap it. “Who is this from?”\nThe robot turns. “I . . . I have something to confess. I have developed . . . feelings for you. Feelings I have long been repressing. It’s . . . your menu choices. So enticing.”\nIt waits a beat, while my mouth hangs open. “Just kidding. Annabel told me to say that. The note is from her.”\nI eat the food, not really tasting it. I keep going back over the simple memory Dr. Kyzlak constructed for me. Walking through that field, turning over planks and stones with a stick, looking for the California nightsnake. Why that one? Why did they choose that one? I close my eyes and settle into it. I’m hoping for that connection, that point at which this memory will cross over into something else. Do I remember a field? But when I try to remember a real field, where I really hunted for snakes, all I get is this one. He’s failed—this therapy doesn’t work. Instead of waking old memories, it’s covering them over. Replacing them.\nI hear the clumping of the Lifter in the hallway. And a voice, Tai’s voice, as they pass. He’s talking to it, to that thing that doesn’t even have a face. I can barely make out what he is saying over the angry lash of rain against the window.\n“ . . . being carried. It reminds me of the war. I didn’t carry her this way, of course. I carried her over my shoulder. Slung her over my shoulder and went up the hill. And when I got there, I lay her down and then collapsed. The medic’s face—I’ll never forget his face. I had been hit by a bullet while I was carrying her, and I didn’t even know it. Later the medic visited me in the hospital. He told me—he told me he could see my heart beating in the wound . . . ”\nThey cross in front of my door and pause. The Lifter raises one of its two free arms and waves. Tai waggles a foot at me. “I hear Imani’s back,” he says.\n“What about the Big Fear?”\n“What about it? Go ask her yourself.”\nAs they continue down the hallway his voice goes on.\nRemembering. Telling his story.\nI hadn’t even known Tai fought in a war.\nI open the note.\nYou’re not fooling anyone, asshole is written in Annabel’s shaky hand.\nI wake to a sound I have never heard before. A moaning siren, like something in a movie. It goes on and on, a howl over the sound of the rain. The room is dark, lit only by the cobalt glow of the emergency diode strips.\nWhat is it? What is happening? In the dream I woke from, I was holding my stick out, about to push aside a ragged chunk of plywood with its forked end. I knew, I knew there would be one under there.\nNow I am fully awake, the adrenaline coursing through me. And in the blue glow I see it—the bulk of it, looming above my bed. The red stripe of light in its vestigial face as it bends over me.\n“Get off me!” I scream as it leans in and slides its arms under my knees and back. Arms, I realize, that are wet. And as it raises a third arm to keep me from struggling, that arm drips water across my face, and I scream at the cold and the shock of it.\n“What are you doing? Get off of me!” I hammer at its head with my fists as it pulls me from the bed, pinning me slightly with its third and now fourth arms, clamping me close to itself. It is soaking wet.\nThe sound from outside, the moan of some kind of siren in the dark. As we lurch down the hall I see the service bot from the kitchen, propping open the emergency exit door. The rain is pouring into the building from outside. We pass the bot, sentried at the door with its helmet of banana stickers, and I find myself thinking, absurdly:\n“No, this is your tip: Electricity and water don’t mix. Whatever you do, stay dry on the inside.”\n“Useful information. I’ll keep it in mind for the robot uprising. Gotta work on our weak points.”\nThen I am outside. The full force of the freezing rain hits me.\nAnd I remember.\nI am running across the parking lot. The autocab had some kind of malfunction. I summoned the drone driver, somewhere in a pod in the Midwest, probably, responsible for a hundred of these cabs.\n“I’m on the other side of the parking lot and it’s raining,” I say. “Raining really hard. Can you drive me in closer?”\nStatic and a mess of bleeping, and then a voice came through: “This cab is red-dotted. I’m going to need to call in a maintenance bot. Battery’s dead. I’m sorry.”\nNo umbrella, because I never carry an umbrella when it actually rains. And god, it’s raining hard—so hard the rain is bouncing up off the pavement, soaking everything up to my knees. By the time I reach the hospital overhang I’m as wet as it’s possible to be. Wet to the skin, wet through my underwear, puddles of water in shoes that are probably ruined. Shit! But what am I so worried about, as I stab the elevator button? You’re going to be fine. This is all routine.\nYou’re dead, but I don’t know it yet, and standing in the elevator I remember another time I was this wet—with you. Caught in a cloudburst in New Orleans and neither one of us had ever seen it rain like that. We thought we could walk a block, at least, then duck into a café, but the moment we stepped out into it we were soaked. Like this—soaked to the skin, right through the underwear, as wet as if we’d climbed into a warm bath—because that rain isn’t cold: it’s a tropical rain, warm like neither of us have really experienced, a sheet of water falling from a hot sky that a moment ago was sunny but now is dark. You’re dead and I don’t know it yet, and I’m in the elevator smiling, remembering the two of us deciding to just walk back to the little studio we rented because it just didn’t matter anymore.\n“It’s not like we could get any wetter,” you say. And you step out from under the eaves with a shrug.\nOr—that’s the way I used to remember it. But now, as I remember this, it’s backwards. I am the one who steps out. I am the one standing there in the rain, holding a hand out to you, wavering behind the waterfall pouring from the awning. You are the one who hesitates before stepping out. But that’s not right: in this memory I was always the hesitant one. I gave the role of courage to you. You held the hand out to me. So which is true? Was I the brave one? Were you? Did we take turns?\nWhichever it was, once you were gone, I stopped feeling that courage. I started pretending that I didn’t make my own decisions anymore.\nI started pretending everything was locked in.Locked in at a good rate—locked in by decisions you had made. But that’s not right: we made our decisions together. The problem is, I’m the only one still around to accept the consequences.\nThe elevator dings. I won’t go any further. I told you—I would forget you. If you died before me, I would never return to this memory. I would never walk up to your bed and see you there, unmoving. Gone. I told you, Deadwife: I would never even call you by your real name again. You weren’t allowed to go. Because I wouldn’t be able to live without you.\nBut I did. I did live without you.\nThe elevator door opens, and the lifter carries me out onto the gallery of the lighthouse. The gallery is crammed with people and bots. Annabel is there, and Tai. And Imani is there, clutching the disk of the mopbot from her room against her chest. Imani, back from the land of the dead. The Lifter sets me down gently next to Imani, our backs against the wall. The door closes with the Lifter still inside.\n“That’s all of us. Where’s he going?” I have to scream to be heard over the siren. I realize what it sounds like: it sounds like an air raid siren, in one of those old movies about the Twentieth Century Wars.\n“There are still bots left!” Imani yells. “Some of them can’t make it out of the building by themselves!”\nAnnabel leans over: “Like you, asshole! Except they’re probably smart enough to know when they need help!”\n“There.” Tai points. He slides forward, pressing his face against the rails of the gallery. I follow his gaze. At first I don’t see anything at all. Then I do see it: a coil of darkness heaving in the sea. A bulge in the water. A whip arcing in toward the shore. At a distance it barely seems to move at all. But as it closes in on land, it speeds up.\nWe all watch the curve of darkness rushing to the shore. I think of the Lifter down there, the maintenance bot with its head full of banana peel stickers. I try to think, for a moment, if there is anything down there in those buildings that I cannot bear to lose—but no. Everything I cannot lose is in my head. In my head or here, on the gallery, watching this serpent of power slide through the ocean toward us.\nThen it is here. The point is gone. The wave hits the first of the whitewashed buildings. For a moment nothing at all happens. Then the building moves in the water, comes free and pushes itself against another building. That one hesitates a moment before it, too, starts to move.\nWhen the water hits the lighthouse the whole structure vibrates. But the way it vibrates, you can tell it is going to hold.\nThe elevator dings. The door opens and the Lifter is there, with an armload of bots: sweepers and moppers, little handybot units, and even Dr. Kyzlak’s limp avatar, which the four-armed Lifter holds aloft in one hand like Anubis with his shepherd’s crook. And next to the Lifter is Annabel’s service bot.\nIn that moment, the elevator lights flicker and die. The nearest siren dies too. I can still hear the sound, like an echo, from up the coast. From a siren that is still standing.\nI pull myself over to the rail and look down. The sea has lost all shape: it is boiling underneath us, churning, choked with debris as the last home I ever thought I would have breaks apart. I hear the shattering of glass and feel things thud into the stone tower of the lighthouse, whole buildings being torn into nothing. The water rises and rises against the lighthouse’s side. I see a mattress like a raft. It could have come from my own bed.\nImani puts an arm around Annabel and another around me. Annabel holds on to Tai. When I turn to look at Imani she has a huge grin on her face. She sees me looking at her.\n“Nothing can get me today!” she yells over the sound of the ocean ripping our world apart. “Not cancer and not a fucking tsunami. I feel immortal!”\nI feel it too. Immortality. It’s not a feeling of living forever, but a feeling of suddenly being alive. And that feeling reaches out to a hundred memories of you, Josephine—because it was with you that I felt it most. The feeling is like the smell of honeysuckle, which links suddenly to all the times in your life when you smelled honeysuckle into an endless chain of summers. Everything seems, in that moment, like a pattern you will always hold inside you.\nI remember.\nI turn to the Lifter. “Thank you. You saved my life.” And my memories, I want to say. More precious, even, than my life.\n“Don’t say ‘thank you,’” the service bot says.\n“What should I say?”\n“Say, ‘I welcome you, robot overlords.’”\nAnnabel laughs. “I told you—of all the things that talk in this place, bananahead here is the funniest.”\n“Thank you,” the service bot says. “I’m here all week. Or at least until they come to rescue us.”\nRay Nayler has lived and worked in Russia, Central Asia, the Caucasus, and the Balkans for nearly two decades. He is a Foreign Service Officer, and previously worked in international educational development, as well as serving in the Peace Corps in Ashgabat, Turkmenistan. Ray began publishing speculative fiction in 2015 in the pages of Asimov’s with the short story “Mutability.” Since then, his critically acclaimed stories have seen print in Clarkesworld, Analog, The Magazine of Fantasy and Science Fiction, Lightspeed, and Nightmare, as well as in several “Best of the Year” anthologies. His SF translations from Russian have appeared in Clarkesworld and Samovar. His story “Winter Timeshare” from the January/February 2017 issue of Asimov’s was collected in The Very Best of the Best: 35 Years of the Year’s Best Science Fiction. Ray’s debut novel, The Mountain in the Sea, will be released this fall by MCD x FSG.", "source": "https://clarkesworldmagazine.com/nayler_03_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Rain of Days by Ray Nayler"}