{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "K78TRPzyId5kDAeO//6PdcRQNcc=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: 2021 in Review  With the start of a new year comes the inevitable looking back at the previous one. Strictly by the numbers, here’s a quick snapshot of Clarkesworld’s 2021 output.  \r\n  12 issues  73 authors  \r\n  40 authors had never been published in Clarkesworld before  40 authors had never been published in Clarkesworld before  83 stories (classified by Hugo Award categories below)  \r\n  61 short stories  17 novelettes  5 novellas  61 short stories  17 novelettes  5 novellas  13 translations  550,000 words total  0 solicited works (all works were published from open submissions, not by invitation)  24 interviews  12 articles  83 podcasts  12 works of art for our cover  In preparation for our annual reader’s poll and awards season, here’s a detailed list of the stories we published:  Short Stories  \r\n   “Intentionalities” by Aimee Ogden  “Deep Music” by Elly Bangs  “Aster’s Partialities: Vitri’s Best Store for Sundry Antiques” by Tovah Strong  “Leaving Room for the Moon” by P H Lee  “The Failed Dianas” by Monique Laban  “Terra Rasa” by Anastasia Bookreyeva, translated by Ray Nayler  “Remember The Washington, They Said as They Fed the Ugoxli” by Jeff Reynolds  “We'll Always Have Two Versions of Pteros” by Dominica Phetteplace  “History in Pieces” by Beth Goder  “Mamaborg's Milk and the Brilliance of Gems” by D.A. Xiaolin Spires  “Homecoming is Just Another Word for the Sublimation of the Self” by Isabel J. Kim  “The Orbiting Guan Erye” by Wang Zhenzhen, translated by Carmen Yiling Yan  “Comments on Your Provisional Patent Application For An Eternal Spirit Core” by Wole Talabi  “To Study the Old Masters in the Prado at the End of the World” by Sarah Pauling  “The Field Tiger” by Endria Isa Richardson  “The Sheen of Her Carapace” by Richard Webb  “Catching the K Beast” by Chen Qian, translated by Carmen Yiling Yan  “Communist Computer Rap God” by Andrea Kriz  “A House Is Not a Home” by L Chan  “Best-Laid Plans” by David D. Levine  “A Home for Mrs. Biswas” by Amal Singh  “The Force Exerted on the Mass of a Body” by Bo Balder  “Dancing With Ereshkigal” by Sameem Siddiqui  “Spore” by Tang Fei, translated by Andy Dudak  “A Star for Every Word Unspoken” by Kai Hudson  “Poubelle” by Robert Reed  “Face Changing” by Jiang Bo, translated by Andy Dudak  “The Shroud for the Mourners” by Yukimi Ogawa  “Our Fate, Told in Photons” by K.W. Colyard  “Embracing the Movement” by Cristina Jurado  “Promises We Made Under A Brick-Dark Sky” by Karen Osborne  “He Leaps for the Stars, He Leaps for the Stars” by Grace Chan  “I'm Feeling Lucky” by Leonid Kaganov, translated by Alex Shvartsman  “The Falling” by M V Melcer  “Last Nice Day” by Rich Larson  “Candide; Life-” by Beth Goder  “A Thousand Tiny Gods” by Nadia Afifi  “A Heist in Fifteen Products from the Orion Spur's Longest-Running Catalog” by Andrea M. Pawley  “An Instance” by Mlok 5, translated by Julie Nováková  “Resistance in a Drop of DNA” by Andrea Kriz  “Yesterday’s Wolf” by Ray Nayler  “It is a Pleasure to Receive You” by Ziggy Schutz  “Xiaolongbao: Soup Dumplings” by D.A. Xiaolin Spires  “In a Net I Seek to Hold the Wind” by Gregory Feeley  “Excerpts from the Text of an Explanatory Stele Erected for Our Edification by the Scholars of the Outer Orion Tendril” by Timons Esaias  “Paper of Elephants” by Brenda Cooper  “The Answer Was Snails” by Bo Balder  “Legend of the Giant” by Fei Dao, translated by Ken Liu  “Rain Falling in the Pines” by Lavie Tidhar  “Through” by Eric Fomley and Rich Larson  “A Well-Worn Path” by AnaMaria Curtis  “Mom Heart” by Will McIntosh  “Dark Waters Still Flow” by Alice Towey  “This Stitch, This Time” by Anna Martino  “City of Eternity” by Pan Haitian, translated by Carmen Yiling Yan  “The Death Haiku Of The Azure Five” by L Chan  “The Cold Calculations” by Aimee Ogden  “Beneath the Earth Where the Nymphs Sleep” by Meghan Feldman  “Vegvísir” by David Goodman  “Just One Step, and Then the Next” by E. N. Dí az  “A Series of Endings” by Amal Singh  Novelettes  \r\n   “The Last Civilian” by R. P. Sand  “Obelisker Adrift in the Desert” by K.H. Meridian  “55 Plaque” by Isabel Lee  “Sarcophagus” by Ray Nayler  “Vanishing Point” by Robert V.S. Redick  “Little Animals” by Nancy Kress  “Bots of the Lost Ark” by Suzanne Palmer  “When the Sheaves Are Gathered” by Nick Wolven  “Preserved in Amber” by Samantha Murray  “The Clock, Having Seen Its Face in the Mirror, Still Knows Not the Hour” by Adam Stemple  “Dog and Pony Show” by Robert Jeschonek  “The Winter Garden” by Regina Kanyu Wang, translated by Emily Jin  “Love Unflinching, at Low- to Zero-G” by M. L. Clark  “The Language Birds Speak” by Rebecca Campbell  “Between Zero and One There is Infinity” by Shari Paul  “You Are Born Exploding” by Rich Larson  “Other Stories” by Wang Yuan, translated by Andy Dudak  Novellas  \r\n   “Philia, Eros, Storge, Agape, Pragma” by R.S.A. Garcia  “Mercy and the Mollusc” by M. L. Clark  “Submergence” by Arula Ratnakar  “Ouroboros” by Dean-Paul Stephens  “The Serpentine Band” by Congyun ‘Mu Ming’ Gu, translated by Tian Huang  Cover Art  \r\n    “Suspire” by Yuumei  “Forward” by Wenjuinn Png  “Sunrise” by Alex Ries  “GUYS! Don’t Lose Hope” by J.C Jongwon Park  “Isolation” by Matt Dixon  “Companion” by Derek Stenning  “Garden” by Alejandro Miguel Burdisio  “Little Town” by Alejandro Miguel Burdisio  “Vimana” by Daniele Gay  “Mermay 2021” by Alexander “Minze” Thümler  “Space Cadet” by Pascal Blanché  “The Variable Man” by Douglas P. Lobo  For the purpose of the Hugo Awards, Clarkesworld is classified as a professional magazine. This has been the case for several years now, but there are still a few people who continue to nominate us for Best Semiprozine. While we appreciate the sentiment, we are NOT eligible for that award. Instead, if you want to recognize our work, please nominate our stories in the appropriate categories and/or nominate me (Neil Clarke) for Editor Short Form.  Our annual reader’s poll—where readers pick their favorite Clarkesworld story and cover art from 2021—is once again employing a two-phase process:  Phase One: Nominations (mid-January)  Later this month, we’ll open for a forty-eight hour flash nomination period to identify the top five candidates in each category: story and art. The announcement for this phase will be sent out via:  \r\n  Twitter (twitter.com/clarkesworld)  Facebook (www.facebook.com/clarkesworld)  Patreon (www.patreon.com/clarkesworld)  My blog (neil-clarke.com)  The purpose of the brevity of this phase is to create a sense of urgency and reduce the opportunities for a coordinated ballot-stuffing campaign. Previous efforts have proved this to be effective at meeting these goals.  Phase Two: Final Voting (February)  The five finalists in each category will be announced in my February editorial. Final voting will open on the 1st and continue through the 15th. The winners will be announced in our March issue.  Happy New Year! May things only get better from here! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: 2021 in Review\nWith the start of a new year comes the inevitable looking back at the previous one. Strictly by the numbers, here’s a quick snapshot of Clarkesworld’s 2021 output.\n- 12 issues\n- 73 authors\n- 40 authors had never been published in Clarkesworld before\n- 83 stories (classified by Hugo Award categories below)\n- 61 short stories\n- 17 novelettes\n- 5 novellas\n- 13 translations\n- 550,000 words total\n- 0 solicited works (all works were published from open submissions, not by invitation)\n- 24 interviews\n- 12 articles\n- 83 podcasts\n- 12 works of art for our cover\nIn preparation for our annual reader’s poll and awards season, here’s a detailed list of the stories we published:\nShort Stories\n- “Intentionalities” by Aimee Ogden\n- “Deep Music” by Elly Bangs\n- “Aster’s Partialities: Vitri’s Best Store for Sundry Antiques” by Tovah Strong\n- “Leaving Room for the Moon” by P H Lee\n- “The Failed Dianas” by Monique Laban\n- “Terra Rasa” by Anastasia Bookreyeva, translated by Ray Nayler\n- “Remember The Washington, They Said as They Fed the Ugoxli” by Jeff Reynolds\n- “We'll Always Have Two Versions of Pteros” by Dominica Phetteplace\n- “History in Pieces” by Beth Goder\n- “Mamaborg's Milk and the Brilliance of Gems” by D.A. Xiaolin Spires\n- “Homecoming is Just Another Word for the Sublimation of the Self” by Isabel J. Kim\n- “The Orbiting Guan Erye” by Wang Zhenzhen, translated by Carmen Yiling Yan\n- “Comments on Your Provisional Patent Application For An Eternal Spirit Core” by Wole Talabi\n- “To Study the Old Masters in the Prado at the End of the World” by Sarah Pauling\n- “The Field Tiger” by Endria Isa Richardson\n- “The Sheen of Her Carapace” by Richard Webb\n- “Catching the K Beast” by Chen Qian, translated by Carmen Yiling Yan\n- “Communist Computer Rap God” by Andrea Kriz\n- “A House Is Not a Home” by L Chan\n- “Best-Laid Plans” by David D. Levine\n- “A Home for Mrs. Biswas” by Amal Singh\n- “The Force Exerted on the Mass of a Body” by Bo Balder\n- “Dancing With Ereshkigal” by Sameem Siddiqui\n- “Spore” by Tang Fei, translated by Andy Dudak\n- “A Star for Every Word Unspoken” by Kai Hudson\n- “Poubelle” by Robert Reed\n- “Face Changing” by Jiang Bo, translated by Andy Dudak\n- “The Shroud for the Mourners” by Yukimi Ogawa\n- “Our Fate, Told in Photons” by K.W. Colyard\n- “Embracing the Movement” by Cristina Jurado\n- “Promises We Made Under A Brick-Dark Sky” by Karen Osborne\n- “He Leaps for the Stars, He Leaps for the Stars” by Grace Chan\n- “I'm Feeling Lucky” by Leonid Kaganov, translated by Alex Shvartsman\n- “The Falling” by M V Melcer\n- “Last Nice Day” by Rich Larson\n- “Candide; Life-” by Beth Goder\n- “A Thousand Tiny Gods” by Nadia Afifi\n- “A Heist in Fifteen Products from the Orion Spur's Longest-Running Catalog” by Andrea M. Pawley\n- “An Instance” by Mlok 5, translated by Julie Nováková\n- “Resistance in a Drop of DNA” by Andrea Kriz\n- “Yesterday’s Wolf” by Ray Nayler\n- “It is a Pleasure to Receive You” by Ziggy Schutz\n- “Xiaolongbao: Soup Dumplings” by D.A. Xiaolin Spires\n- “In a Net I Seek to Hold the Wind” by Gregory Feeley\n- “Excerpts from the Text of an Explanatory Stele Erected for Our Edification by the Scholars of the Outer Orion Tendril” by Timons Esaias\n- “Paper of Elephants” by Brenda Cooper\n- “The Answer Was Snails” by Bo Balder\n- “Legend of the Giant” by Fei Dao, translated by Ken Liu\n- “Rain Falling in the Pines” by Lavie Tidhar\n- “Through” by Eric Fomley and Rich Larson\n- “A Well-Worn Path” by AnaMaria Curtis\n- “Mom Heart” by Will McIntosh\n- “Dark Waters Still Flow” by Alice Towey\n- “This Stitch, This Time” by Anna Martino\n- “City of Eternity” by Pan Haitian, translated by Carmen Yiling Yan\n- “The Death Haiku Of The Azure Five” by L Chan\n- “The Cold Calculations” by Aimee Ogden\n- “Beneath the Earth Where the Nymphs Sleep” by Meghan Feldman\n- “Vegvísir” by David Goodman\n- “Just One Step, and Then the Next” by E. N. Dí az\n- “A Series of Endings” by Amal Singh\nNovelettes\n- “The Last Civilian” by R. P. Sand\n- “Obelisker Adrift in the Desert” by K.H. Meridian\n- “55 Plaque” by Isabel Lee\n- “Sarcophagus” by Ray Nayler\n- “Vanishing Point” by Robert V.S. Redick\n- “Little Animals” by Nancy Kress\n- “Bots of the Lost Ark” by Suzanne Palmer\n- “When the Sheaves Are Gathered” by Nick Wolven\n- “Preserved in Amber” by Samantha Murray\n- “The Clock, Having Seen Its Face in the Mirror, Still Knows Not the Hour” by Adam Stemple\n- “Dog and Pony Show” by Robert Jeschonek\n- “The Winter Garden” by Regina Kanyu Wang, translated by Emily Jin\n- “Love Unflinching, at Low- to Zero-G” by M. L. Clark\n- “The Language Birds Speak” by Rebecca Campbell\n- “Between Zero and One There is Infinity” by Shari Paul\n- “You Are Born Exploding” by Rich Larson\n- “Other Stories” by Wang Yuan, translated by Andy Dudak\nNovellas\n- “Philia, Eros, Storge, Agape, Pragma” by R.S.A. Garcia\n- “Mercy and the Mollusc” by M. L. Clark\n- “Submergence” by Arula Ratnakar\n- “Ouroboros” by Dean-Paul Stephens\n- “The Serpentine Band” by Congyun ‘Mu Ming’ Gu, translated by Tian Huang\nCover Art\n- “Suspire” by Yuumei\n- “Forward” by Wenjuinn Png\n- “Sunrise” by Alex Ries\n- “GUYS! Don’t Lose Hope” by J.C Jongwon Park\n- “Isolation” by Matt Dixon\n- “Companion” by Derek Stenning\n- “Garden” by Alejandro Miguel Burdisio\n- “Little Town” by Alejandro Miguel Burdisio\n- “Vimana” by Daniele Gay\n- “Mermay 2021” by Alexander “Minze” Thümler\n- “Space Cadet” by Pascal Blanché\n- “The Variable Man” by Douglas P. Lobo\nFor the purpose of the Hugo Awards, Clarkesworld is classified as a professional magazine. This has been the case for several years now, but there are still a few people who continue to nominate us for Best Semiprozine. While we appreciate the sentiment, we are NOT eligible for that award. Instead, if you want to recognize our work, please nominate our stories in the appropriate categories and/or nominate me (Neil Clarke) for Editor Short Form.\nOur annual reader’s poll—where readers pick their favorite Clarkesworld story and cover art from 2021—is once again employing a two-phase process:\nPhase One: Nominations (mid-January)\nLater this month, we’ll open for a forty-eight hour flash nomination period to identify the top five candidates in each category: story and art. The announcement for this phase will be sent out via:\n- Twitter (twitter.com/clarkesworld)\n- Facebook (www.facebook.com/clarkesworld)\n- Patreon (www.patreon.com/clarkesworld)\n- My blog (neil-clarke.com)\nThe purpose of the brevity of this phase is to create a sense of urgency and reduce the opportunities for a coordinated ballot-stuffing campaign. Previous efforts have proved this to be effective at meeting these goals.\nPhase Two: Final Voting (February)\nThe five finalists in each category will be announced in my February editorial. Final voting will open on the 1st and continue through the 15th. The winners will be announced in our March issue.\nHappy New Year! May things only get better from here!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_01_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: 2021 in Review by Neil Clarke"}