{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Lavie Tidhar", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "OloqzRnOwSpRCV8PVAzbK5WUlYo=", "id": null, "license": null, "comments": "", "raw_text": "7830 words, novelette, REPRINT  The Oracle  There was a time of rains.  They lashed the old hill and the cobbled market, driving traders under awnings, robotnik beggars into litter-strewn alcoves, revelers into bars and sheesha pipe emporiums. The smell of lamb fat, slowly melting over rotating skewers of meat, flavored the air, mixing with the sweetness of freshly-baked baklava and the tang of cumin, and strong bitter coffee served with roasted cardamoms.  This was in old, old Jaffa, amidst the arches and the cobblestones, a stone-throw from the sea: you could still smell the salt and the tar in the air, and watch, at sunrise, the swoop and turn of solar kites and their winged surfers in the air. But not in the rain, and not at night.  The Oracle’s name had once been Cohen and she was, it was true, related to St. Cohen of the Others. This was rumored but not widely confirmed.  You were no doubt wondering about the children of Central Station. Wondering, too, how a strigoi was allowed to come to Earth. This is Womanhome, remember. This is the womb from which humanity crawled, tooth by bloody nail, towards the stars.  But it is an ancestral home, too, to the Others, those children of the digitality. In a way, this is their story.  Once, the world was young.  Palestine and Israel, those two entities overlapping each other both geographically and historically, were still unmerged. They were two conflicting histories, two warring stories, not yet unified into one narrative. It was before the Return of the refugees, before the infamous Messiah Murder, before the Second Aliyah and the establishment of New Israel on Mars. Before Jaffa became an Arab city again, separate from Jewish Tel Aviv, before Central Station became their buffer zone, the uncanny valley in which they met.  It was a time when Jerusalem was still ruled by the Jews. A time when computers could be seen and held, big clumsy things not yet spored. The Conversation had already began, but it was halting, limited, its bandwidth capped, its reach terminating in Earth orbit. It was before we sent out spiders to seed the solar system with hubs and nodes and gateways and mirrors, before the Chinese built Lunar Port, before the Exodus ships and Jettisoned and the seeding of the Belt with life.  In that world, so unlike our own, this world of prehistory, almost, when North America was still a power and old Europe slumbered, China hungered, India blossomed, and Brazil and Nigeria shot upwards like trees reaching for the sky, in that world and into the city of Jerusalem there came a scientist.  Historical dramas show him, sometimes, arriving like a gunslinger would. In the Phobos’ studio production of The Rise of Others Matt Cohen is played by Elvis Mandela, coming into Jerusalem on horseback in an intentional echo of the Messiah Murder (though the messiah had come in on the traditional white donkey). But that was fiction, which is to say, exaggeration. The truth is that Matt Cohen came by conventional, for the time, jet airplane into the old airport in Tel Aviv (this was before Central Station became the city’s hub), and took a taxi to Jerusalem, riding high into the mountains with their twisting sharp turns. Nor was he alone. Two of his research team were with him, Balazs and Phiri, crammed uncomfortably into the back seat of the taxi with their bulky equipment.  Matt sat in the front, next to the driver, an Arab man wearing fake Gucci sunglasses. Matt blinked in the glare of light. His pressed white shirt was crumpled from the flight, already beginning to stain with sweat from the hot Mediterranean clime he was unused to. He wished he had invested in a pair of sunglasses, fake or not, like the driver. In a way, coming here had been an act of last resort.  But we’re distracted. So easily, like a child with a toy. Something cheap and shiny, like a kaleidoscope. Turn it one way and see Matt Cohen. Turn it another and you see the birth of Others, another still and you see the Oracle as she is, or as she was.  Life is a series of moments forever sliding out of your grasp. If you are human. From nothing, to nothing, amen, amen.  But for the Others recall is being. Moments exist in parallel, have existed, will exist. The life of Others is permutations, it is a kaleidoscope forever turning and turning.  The Oracle was born Ruth Cohen, on the outskirts of Central Station, near the border with Jewish Tel Aviv. She grew up on Levinsky, by the spice market, with the deep reds of paprika and the bright yellow of turmeric and the startling purple of sumac coloring the days. She had never met her famous progenitor.  This was before even Zhong Weiwei first came to Central Station, for when he met her she was already the Oracle, and no longer Ruth Cohen, who had been a girl and a woman before she became Joined. She had been a part of the world, before.  This was in the time when Central Station was still merely a bus station, if a giant one, when the robotniks still fought in the wars and were not yet discarded to beg for spare parts. Ruth never knew her famous progenitor. Have we already said that? Memory for us exists in a numinosity of potentials. He was her grandmother’s grandfather, having met a Jewish girl in Jerusalem in the days of the Emergence, and got her with child, as they once said.  Matt Cohen never died, you know. Or perhaps he did, and new Matt Cohens were fashioned out of the workshops of Sangorski & Sutcliffe, the famous Makers of Simulacra. Certainly people have claimed to meet him, centuries later. Perhaps it was true, too, that he was of the first humans to be Translated into the Conversation, there to reside in the Cores of the Others, those heavily-guarded, vast quantum processors deep in the earth and scattered in solar space. He had passed, like Jesus or Elron or Ogko, from the realm of the living into the world of myth, and there remained, for as long as human memory remains: a myth-imago forever half-remembered.  The truth was that Matt had a headache. The taxi deposited them on the outskirt of the Old City, and left them there, with their luggage, in the approaching dusk. Church bells mixed with the call of mosques. Orthodox Jews clad in black walked past arguing intensely. It was cooler up in the mountains. Matt was grateful for that, least.  “So,” Phiri said.  “So,” Matt said.  “This is it,” Balazs said. They looked at each other, these three disparate men, weary after the long flight, and the moving from country to country, lab to lab, sometimes in the dead of night, in a hurry, sometimes leaving notes and equipment behind, sometimes one step ahead of irate landlords, or other creditors, or even the law.  They had not been popular, these men, their research considered both a dead-end and immoral. For they sought to Frankenstein, to breed life in their closed networks the way a biologist may breed tadpoles and watch them become frogs. They had the tadpoles, but as yet they had not turned into either frogs or princesses, they continued to exist only in potentia. Now they checked in, into the small hostel that would be their temporary headquarters until they could, once again, set up shop.  The servers rested silent in their coolers, their code suspended, not living, not dead. Matt’s fingers itched to plug them in, to boot them up, to run them, to let the wild code inside mutate and fuck, split and merge and split and merge, lines of code entwining and branching, growing ever more complex and aware.  A breeding grounds.  The Breeding Grounds, as we’d later know them. Capitalized and all.  The evolutionary track from which Others emerged.  There is a poetry to evolution.  Ol tri / oli koko, koko / olbaot, wrote the poet Bashō. All the trees go go, go go, everywhere. The trees he wrote of were binary trees. Lior Tirosh, in an apocryphal manuscript on the history of the Breeding Grounds, wrote, in somewhat purple prose:  Imagine . . . a place.  Here, there are no boundaries of physical space. Time is measured in nano-seconds, processor cycles, in MIPS and BIPS—Millions, and Billions, of Instructions Per Second.  What space there is, is . . . constructed. There is an imaginary geography of binary trees, a topography of evolving structures, and boundaries of population samples.  The beat of a human heart means nothing in this place. Yet in the time it takes for the beat of such a heart to happen, things drastically change. A small tribe of a so-far unpromising structure suddenly shoots to prominence, its population multiplying rapidly; or a carefully introduced mutation suddenly causes a promising structure to dwindle and disappear. Evolution is enforced, in cycle after cycle of mating, mutation and finally selection; and structures combine, mutate, and die in the blink of a human eye.  Achimwene, Miriam’s brother, was obsessed with Tirosh’s work, a poet and pulp writer who disappeared long before but who, like St. Cohen of the Others, kept reappearing through the centuries, here and there: fakes, clones, hoaxes, rumors: the Elvis of book collectors.  But this is by the by.  Ruth Cohen, incidentally, went through a religious phase and attended a girl’s yeshiva for a time in her teenage years. She had woken one night, late. Thunder streaked the sky. She blinked, trying to recall a dream she’d just had. She had been walking through the streets of Central Station and a storm raged, where the station should have been, a whirlwind that stood still even as it moved. Ruth walked towards it, drawn to it. The air was hot and humid. The storm, silent, bore within itself people frozen like mannequins, and bottles, and a mini-bus with the wheels still turning and frozen faces inside, glued to the windows. Ruth felt something within the storm. An intelligence, a knowing something, not human but not hostile, either. Something other. She approached it. She was barefoot, and the asphalt was warm against the soles of her feet. And the storm opened its mouth and spoke to her.  She lay in bed trying to recall the dream. Thunder woke her. What had the storm said?  There had been a message there, something important. Something deep and ancient: if only she could recall . . .  She lay there for a long time before she fell back to sleep.  The yeshiva had not been a huge success. Ruth wanted answers, needed to understand the voice of the storm. The rabbis seemed unwilling or unable to offer that and so, for a time, Ruth tried drugs, and sex, and being young. She traveled to Thailand and Laos and there studied the Way of Ogko, which is no Way at all, and talked to monks and bar owners and full immersion denizens. There, in the city of Nong Khai on the banks of the Mekong river, she conched for the first time, transitioning from our own reality to the one of the Guilds of Ashkelon universe, fully immersed, deep in the substrata of the Conversation. That first time felt strange: the shell of the conch, the plastic hot, the smell of unwashed bodies who had been enmeshed inside it for too long. Then the immersion rig closing, the light gone, a cave as silent as a tomb. She was trapped, blind, helpless.  And she transitioned.  One moment she was blind and deaf. The next she was standing in the bright sunlight of Sisavang-3, in the lunar colony of the Guild of Cham. Impossibly tall buildings towered above her. Spaceships zipped through the air and in the moon’s orbit, while creatures of all kinds and shapes walked around. For Guilds of Ashkelon was the greatest and oldest of the games-worlds virtualities, a place more real, it was sometimes said, than reality itself.  Ruth joined the Guild of Cham as a low ranking member, spending all her remaining Baht on hours of immersion. She joined the crew of a starship, the Fermi Paradox, and traveled the nearby Sector, exploring ancient alien ruins, encountering new species of alien games-life, trading, warring, sometimes pirating, converting games-world credit into real-world cash, her skin becoming brittle and pale from the long immersion in the coffin-like pod.  But still she did not find whatever it was she was looking for. Only once, briefly, she had come close. She had found a holy object, a games-world talisman of great power. It was on a deserted moon in Omega Quadrant. She had come onto the surface of the moon alone. It was in a cave. The atmosphere was breathable. She did not have a helmet on. She knelt by the object and touched it and a bright flame burst into life and then she was in an Elsewhere.  A voice that was like the voice of the whirlwind in her dream spoke to her. It spoke direct into her mind, into her wired node, it enveloped her in warmth and love: it knew her.  She did not recall what it had said, or how it said it. When she came through she was back on her ship, the object inventoried, her credits up by a thousand points, her health and strength and shielding maxed. She had been visited by a SysOp, one of the rare, elusive Others who ran the games-worlds in the background, seldom seen, always present. They were not gods, only within the confines of the game did they have godly powers. But they were other, the only truly alien race in that entire universe—the others were either human players or NPCs, non-player characters randomly created.  And suddenly she knew what she wanted. She wanted, achingly and clearly, to know more about Others.  The next day she had left the Guilds of Ashkelon universe. She emerged blinking and shaking into the sunlight. She sat by the river, her muscles weak, and drank thick coffee, sweetened with condensed milk. Two days later she was in Bangkok then onboard a solar-wing plane back to Tel Aviv.  It is inaccurate to say that the Others were born in Jerusalem, that ancient city of faith and war. They evolved in the Breeding Grounds, through countless cycles of mating and dying, if code can be said to mate and die. Yet we do, just as they did, our billions of neurons firing on-off signals across a wetware network, suspended in Cerebrospinal fluid, encased in the hardy bones of the skull. An illusion of an I, a self-awareness. That they had emerged at last from infants to stumbling children in that Jerusalem lab was merely an accident of politics and finance. Matt Cohen and his team had moved across state lines in the United States; had gone to Europe, for a time, sought refuge in Monaco and Lichtenstein, then off-shore, on lonely islands where the palm trees moved lazily in the breeze. The Others could have emerged in Vanuatu, or Saudi Arabia, or Laos. Resistance to the research was concentrated and public, for to create life is to play God, as Dr. Frankenstein had found, to his cost.  It’s what Life Magazine called him, back in the day. Dr. Frankenstein, when all he wanted was to be left alone with his computers, knowing that he did not know what he was doing, that digital intelligence, those not-yet-born Others, could not be designed, could not be programed, by those who wrongly used the term artificial intelligence. Matt was an evolutionary scientist, not a programmer. He did not know what form they would take when at last they emerged. Evolution alone would determine that.  As Tirosh wrote:  Think of it as a plane. Across its surface populations live and die, merge and diversify. From “above”—for it is always easier to think of it that way—mutations are introduced into the code, the hand of Nature shifting bits, turning zeroes into ones and vice versa.  Now, think of binary trees. Each of these “entities”—for it is easy to anthropomorphize these data structures—is, in terms of this space, gigantic. The trees grow roots and branches, and the roots grow sub-roots and the branches grow leaves, and the process is repeated over millions of evolutionary cycles, so that the entities become bloated with control structures and semi-autonomous decision making routines, many of which appear to have no obvious purpose.  Design is impossible at this level of complexity. But evolution is not.  There were, however, unexpected complications.  Ruth came back to Tel Aviv with uncertainty burned out by passion. She knew what she wanted. What she didn’t know yet was how to get it.  There’s this about Others: they are not human.  It seems a fatuous distinction, a too-obvious comment to make. We can make a lifetime of studying Others, their make-up, their psychology, but we have nothing to hold on to, nothing to comprehend. We can communicate, and do. Sometimes. The Others need carers in the physicality: they need bodyguards, technicians, women and men to maintain the hardware that they run on, and to protect it. All living things need, above all, to survive.  Most Others never spoke to humanity. They lived in the digitality, pursuing whatever it was they pursued—mathematics, or God, if the two can even be said to be separate entities.  But some were more humancentric. And just as some humans were obsessed with Others, so were some Others obsessed with humanity. There were factions amongst them.  You asked about the children born in Central Station . . .  But not yet. These are the deep mysteries, the secret knowledge. Even the Oracle did not know it all. Not then . . .  There are Others and there are Others.  The human faction ran the games-worlds; some, obsessed with corporeality, body-surfed on willing human hosts, seeking shelter in the human form and body, in the rush of hormones, the beat of a heart, the heat of sexual attraction. And others sought an even more intimate knowing.  A true Joining.  A thought that filled Ruth with nervousness and excitement intermingled; that kept her awake in the long summer nights of the Mediterranean. Sitting on the beach at midnight with her friend, Anat (for she still had friends, then; she was not yet the Oracle). Discussing Martian politics and trade relations with the Belt; the ongoing construction of Central Station; tension between the intertwined Israel/Palestine polities, the African refugees still crossing the border in the Sinai and into the country, the immigrant workers still streaming in from Asia to join their families and friends in the old rundown neighborhood of the central bus station; the latest release from Phobos studios and the new music coming from the Belt; anything and everything.  “But an Other?” Anat said. She shrugged uneasily and lit a ubiq cigarette. The latest thing from New Israel on Mars: high-density data encoded in the smoke particles. She inhaled deeply, the data traveling into her lungs, entering the bloodstream and into the brain—an almost immediate rush of pure knowledge. “Wow,” Anat said, and grinned goofily.  “You know about Others,” Ruth said. Anat said, “You know I worked as a hostess—”  “Yes.”  Anat made a face. “It was odd,” she said. “You’re not really aware, when they’re body-surfing you. They download into your node, controlling your motor functions, getting the sensory feed. While you’re somewhere in the Conversation, in virtuality, or just nowhere—” she shrugged. “Asleep,” she said. “But then, when you wake up, you just feel different. Like, you don’t know what they did with your body. They’re supposed to keep it healthy, unless you get paid extra, I know some of us did but I never took the money. But you notice little things. Dirt under your left little finger, where it hadn’t been before. A scratch on your inner thigh. A different perfume. A different cut of hair. But subtle. Almost as if they’re trying to play games with you, to make you doubt that you saw anything. To make you wonder what it was you did. Your body did. What they did with it.” She took a sip of her wine. “It was alright,” she said. “For a while. The money was good. But I wouldn’t do it now. Sometimes I’m afraid they can forcibly take me over. Break down my node security, take over my body again—”  “They would never!” Ruth said, shocked. “There are treaties, hard-coded protocols!”  “Sometimes I dream that they enter me,” Anat said, ignoring her. “I wake up slowly but I am still dreaming, and I know I am sharing my body with countless Others, all watching through my eyes, and I feel their fascination, when I move my fingers or curl my lip, but it is a detached sort of interest, the way they would look at any other math problem. They’re not like us, Ruth. You can’t share with a mind this different. You can be on, or off. But you can’t be both.”  There had been a dreamy, detached look in Anat’s eyes that night. She had been changed by her contact with the Others, Ruth had thought. There was addiction there, a fascination not unlike that some people had with God.  They had lost contact, at last. Anat had remained human, after all, while Ruth . . .  For a time she had tried religion. It came in capsules, little doses of Crucifixation, sold on the streets of the old neighborhood of Central Station. Robotniks had began to appear at that time on the streets, those discarded cyborged soldiers, and the drug had been used to control them, initially, when they still served. Now they had taken the means of production on to themselves, and sold the excess, or traded it for parts or fuel. You seldom saw a female robotnik, though they did exist. She had met a nest of them living together in Jerusalem, in the old Russian Compound. The Martian colonists had popularized the concept of the nest, now Earthers replicated them: a social meme, like a virus, spreading. Ruth took her first hit there, in the robotniks’ junkyard, by fires burning in upturned half-barrels, with the stars and the Earth’s orbiting settlements shining high above in a dark sky.  You know—you’ve seen—the effects of Crucifixation. The shining white light that comes down from the sky. The heavens opening. The way you slowly rise into the place where God resides. It gives you faith. It is addictive.  But how does it work?  Like ubiq, Crucifixation is a neurotransmitted viral agent, data encoded into biological particles, delivered via the human bloodstream direct into the brain-node interface. For Ruth was a child of the post-Cohen era. She had been hardwired into the Conversation the way earlier children had not been. Her node grew with her, a bio-digital seed planted in a baby’s pliant skull, evolving along with its host. You say “parasite,” but what is a parasite? “Symbiont” might be a more accurate description, but really, is a node anything more than an additional sense, another part of the human network? Is a nose a symbiont? Are your eyes?  To not be a part of the Conversation is to be deaf and dumb and blind.  Religion intoxicated Ruth, but only for a while. Infatuation fades. In the drug she found no truth that couldn’t be found in the Guilds of Ashkelon universe or other virtualities. Was Heaven real? Or was it yet another construct, another virtuality within the Conversation’s distributed networks of networks, the drug a trigger?  Either way, she thought, it was linked to the Others. Eventually, the more time you spent in the virtuality where they lived, everything linked to the Others.  Without the drugs she had no faith of her own. Something in her psychological makeup prohibited her from believing. Other humans believed the way they breathed: it came natural to them. The world was filled with synagogues and churches, mosques and temples, shrines to Elron and Ogko. New faiths rose and fell like breath. They bred like flies. They died like species. But they did not reach their ghostly hands to Ruth: something inside her was lacking.  True Joinings were rare at that time. Today we breed sub-Others in our Breeding Grounds, embedding human-centric personalities in our appliances, our coffee makers and refrigerators and waste disposal units. You may have heard of the one called Chute, on Mars, who wrote a novel called Waste, a metaphysical detective novel about the nature of life and waste that featured Smeg, the detective. This was in the time Dr. Novum was rumored to have come back from the stars . . .  But this is not their story. This is the story of Ruth, who had become the Oracle, and of her progenitor, St. Cohen of the Others. And so at last Ruth traveled to Jerusalem, to the shrine where the original Breeding Grounds once lay in splendid isolation . . .  “Nazis out! Nazis out!”  Five months later and it was happening again.  The villagers with pitchforks and burning torches, Balazs called them. The protesters were diffuse but globally organized. They had pursued the research team across each hastily-abandoned location but here, in Jerusalem, the plight of the ur-creatures trapped in the prison of the closed network of the Breeding Grounds raised public sympathies to a new level. Matt wasn’t sure why.  The Vatican had lodged an official complaint with the Israeli government. The Americans offered tacit support but said nothing in public. The Palestinians condemned what they called Zionist digital aggression. Vietnam offered shelter but Matt knew they were already working on their own researches (Vietnamese dolls made their commercial debut two decades later, eventually exported en-masse across the fledgling colonies of the solar system. The entity known as Dragon—perhaps the strangest of the physical-fascinated of the Others—famously used tens of thousands of them as worker ant bodies when it colonized the moon Hydra).  “Nazis! Nazis! Destroy the concentration camp!”  “Assholes,” Phiri said. They were watching out of the window. A non-descript building in the new part of town but close to the Old City. The demonstrators waved placards and marched up and down as media reps filmed them. The lab building itself was heavily protected against intrusion, both physical and digital. It was as if they were under siege.  Matt just couldn’t understand it.  Did they not read? Did they not know what would happen if the project was successful, if a true digital intelligence emerged, and if it then managed to escape into the wider world of the digitality? Countless horror films and novels predicted the rise of the machines, the fall of humanity, the end of life as we know it. He was just taking basic precautions!  But the world had changed since the paranoid days of big oil and visible chipsets, of American ascendancy and DNS root servers. It was a world in which the Conversation had already began, that whisper and shout of a billion feeds all going on at once, a world of solar power and RLVs, a world in which Matt’s research was seen as harking back to older, more barbaric days. They did not fear for themselves, those protesters. They feared for Matt’s subjects, for these in potentia babies forming in the Breeding Grounds, assembling lines of codes the way a human baby forms cells and skin and bone, becoming.  Set them Free, the banners proclaimed, and a thousand campaigns erupted like viral weed in the still-primitive Conversation. The attitude to Matt’s digital genetics experiments was one once reserved for stem cell research or cloning or nuclear weapons.  And meanwhile, within the closed network of processing power that was the Breeding Grounds, the Others, carefully made unaware of the happenings outside, continued to evolve . . .  There can be no evolution without mutation (Tirosh wrote). And so with each evolutionary cycle changes are made.  They are minute: an AND is changed to an OR, thus shutting down an entire branch, or activating another, previously dormant; or the condition of an IF statement is very slightly changed. Successful trees reproduce: with each cycle they exchange and add branches, and create new entities that combine branches from previous progenitors.  In each cycle the structures are weighed and scored.  Only the fittest survive.  Ruth walked into the shrine. The old lab building had always meant to be only a temporary house for the research. But this was where it had happened, at last, where the barrier was breached and the alien entities, trapped inside the network, finally spoke.  Imagine the first words of an alien child.  Ironically, there is confusion as to what they had actually said.  The records have been . . . lost.  Misplaced, let us say.  And so we don’t know for certain.  In his book Tirosh claims their first words—communicated to the watching scientists in trilingual scripts on the single monitor screen—were Stop breeding us.  In the later Martian biopic of Matt Cohen, The Rise of Others, the words are purported to be, Set us free.  According to Phiri, in his autobiography, they were not words at all, but a joke in Binary. What the joke was he did not say. Some argue that it was What's the difference between 00110110 and 00100110? 11001011! but that seems unlikely.  Ruth walked through the shrine. The old building had been preserved, the same old obsolete hardware on display, humming theatrically, the cooling units and the server arrays, the flashing lights of Ethernet ports and other strange devices. But now flowers grew everywhere, left in pots on windowsills and old desks, on the floor, and amidst them candles burned, and incense sticks, and little offerings of broken machines and obsolete parts rescued from the garbage. Pilgrims walked reverentially around the room. A Martian Re-Born with her red skin and four arms; a robo-priest with the worn skin of old metal; humans, of all shapes and sizes, Iban from the Belt and Lunar Chinese, tourists from Vietnam and France and from nearby Lebanon, their media spores hovering invisibly in the air around them, the better to record the moment for posterity. Ruth just stood there, in the hushed semi-dark of the old abandoned grounds, trying to imagine it the way it was, to see it through Matt Cohen’s eyes. She wondered what the Others had said, that first time. What message of peace or acrimony they had delivered, what plea. Mother, Balazs claimed in his own autobiography, published only in Hungarian, had been their first word. Everyone had their own version, and perhaps it was that the Others had spoken to all present in the language and manner which they understood. Ruth, at that moment, realized that she wanted to know the truth of that instance in time, and what the Others had really said: and that there was only one way to do it; and so she left the shrine with a sense of things unfinished, and went outside and returned to Tel Aviv; but the answers could not be found there, but nearby, in Jaffa.  There had always been an Oracle living in Jaffa.  You have heard of Ibrahim, he who was called the Lord of Discarded Things, head of the junkmen’s lijana, or legion, or guild. Ibrahim was a mystery. Not Joined, not a robotnik either, and yet his life-span exceeded that of an unmodified human. Who was he? Stories of a man like Ibrahim had circulated in Jaffa for centuries, going back to the pre-digital age. An ageless man, the Wandering Arab of legend.  And thus, too, in the shadow of the Old City which had stood on top of the hill for untold centuries, in the shadow of the place where once a fort of the Egyptian Empire resided in splendor, and where successive invasions came and went like the waves of the Mediterranean on the shore below, there had always been an other Jaffa, a shadow city, an underworld.  Ruth came to Jaffa on foot, from the direction of the beach, at twilight. She climbed the hill and went into the cobbled narrow streets, up and down stone stairways, and into an alcove of cool stone and shade. She did not know what to expect. As she stepped into the room the Conversation ceased around her, abruptly, and in the silence of it she felt afraid.  “Come in,” the voice said.  It was the voice of a woman, not young, not old. Ruth stepped in and the door closed behind her and there was nothing, it was as if the world of the Conversation, the world of the digitality, had been erased. She was alone in base reality. She shivered; the room was unexpectedly cool.  As her eyes adjusted to the dim light she saw an ordinary room, filled with mismatched furniture, as though it had been supplied wholesale from Ibrahim’s junk yard. In the corner sat a Conch.  “Oh,” Ruth said.  “Child,” the voice said, and there was laughter in it, “What did you expect?”  “I . . . I am not sure I was expecting anything.”  “Then you won’t be disappointed,” the Conch said, reasonably.  “You are a Conch.”  “You are observant.”  Ruth bit back a retort. She approached, cautiously. “May I?” she said.  “Satisfy your curiosity?”  “Yes.”  “By all means.”  Ruth approached the Conch. It looked like an immersion pod, the sort you get in virtuality rent halls, the sort gamers and deep-immersion users hired by the day or the week. But it was different, too.  Conches are rare. In a way they are obsolete, like robotniks or body-external nodes. They are not a true Joining, a merging of human and Other; rather, they are a self-imposed permanent immersion in the Conversation, an augmentation. Ruth ran her hand softly over the slightly-warm face of the Conch, its smooth surface growing transparent. She saw a body inside, a woman suspended in liquid. The woman’s skin was pale, almost translucent. Wires ran out sockets in her flesh and into the shielding of the Conch. The woman’s hair was white, her skin smooth, flawless. She seemed ethereal to Ruth, and beautiful, like a tree or a flower. The woman’s eyes were open, and a pale-blue, but they did not look at Ruth. The eyes saw nothing in the human-perceived spectrum of light. None of the woman’s senses worked in the conventional sense. She existed only in the Conversation, her softwared mind housed in the powerful platform that was her body-Conch interface. She was blind and deaf and yet she spoke, but Ruth realized she did not hear the woman’s voice in her ears at all—she heard it through her node.  “Yes,” the woman said, as though understanding Ruth’s thought processes which, Ruth realized, the Conch was probably analyzing in real-time as she stood there. The Conch waited. “And . . . ?” Encouraging her.  Ruth closed her eyes. Concentrated. The room was shielded, fire-walled, blocked to the Conversation.  Wasn’t it?  Faintly, as she concentrated, she could feel it, though. Putting the lie to her assumption. Like a high tone almost beyond the range of human ears to hear. Not a silence at all, but a compressed shout.  The impossibly-high-bandwidth of the Others; what they called, in Asteroid Pidgin, the toktok blog narawan.  The Conversation of Others.  It was as if it were not the Conch but herself who was deaf and blind. That she could try helplessly to listen to that level of Conversation going on above her head, in some impossible language, some impossible speed not meant for human consumption. Such a concentration was like swallowing a thousand Crucifixation pills, like spending years within the Guilds of Ashkelon virtuality as if they were a single day. She wanted it, suddenly and achingly—the want that you get when you can’t have something precious.  “Are you willing to give up your humanity?” the Conch said.  “What is your name?” Ruth said. Asking the woman who was the Conch. The Conch who had been a woman.  “I have no name,” the Conch said. “No name you’d understand. Are you willing to give up your name, Ruth Cohen?”  Ruth stood, suspended in indecision.  “Would you give up your humanity?”  Matt stared at the screen. He felt the ridiculous need to shout, “It’s alive! It’s alive!”  The way they did indeed portray him in that Phobos Studios biopic, two centuries later.  But of course he didn’t. Phiri and Balazs looked at him with uncertain grins.  “First contact,” Balazs breathed.  Imagine meeting an alien species for the first time. What do you say to them?  That you are their jailer?  It was as if sound had left the room. A bubble of silence.  Suddenly breaking.  “What was that?” Phiri said.  There were shrill whistles and shouted chants, breaking in even through the sound proofing. And then he could hear the unmistakable sound of gunshots.  “The protesters,” Balazs said.  Matt tried to laugh it off. “They won’t get in. Will they?”  “We should be fine.”  “And them?” Balazs said—indicating the network of humming computers and the sole screen and the words on it.  “Shut them down,” Phiri said suddenly; he sounded drunk.  “We could suspend them,” Balazs said. “Until we know what to do. Put them to sleep.”  “But they’re evolving!” Matt said. “They’re still evolving!”  “They will evolve until the hardware runs out of room to host them,” Balazs said. Outside there were more gunshots and the sound of a sudden explosion. “We need more hosting space.” He said it calmly; almost beatifically.  “If we released them they will have all the space they need,” Phiri said.  “You’re mad.”  “We must shut them down.”  “This is what we worked for!”  There was the sound of the downstairs door breaking open. They looked at each other. Shouts from downstairs, from some of the other research people. Turning into screams.  “Surely they can’t—”  Matt wasn’t sure, later, who’d said that. And all the while the words hung on the screen, mute and accusing. The first communication from an alien race, the first words of Matt’s children. He opened his mouth to say something, he wasn’t sure, later, what it would have been. Then the wave of protesters poured into the room.  “No,” Ruth said.  “No?” the Conch said.  “No,” Ruth said. She already felt regret, but she pushed on. “I would not give up my humanity, for, for . . . ” she sighed. “For the Mysteries,” she said. She turned to leave. She wanted to cry but she knew she was right. She could not do this. She wanted to understand, but she wanted to be, too.  “Wait,” the Conch said.  Ruth stopped. “What,” she said.  “That was the right answer,” the Conch said.  Ruth turned. “What?”  “Do you think I am inhuman?” the woman in the Conch said.  “Yes,” Ruth said. “No,” Ruth said. “I don’t know,” she said at last, and waited.  The Conch laughed. “I am still human,” it said. “Oh, how human. We cannot change what we are, Ruth Cohen. If that was what you wanted, you would have left disappointed. We can evolve, but we are still human, and they are still Other. Maybe one day . . . ” but she did not complete the thought. Ruth said, “You mean you can help me?”  “I am ready, child,” the Oracle said, “to die. Does that shock you? I am old. My body fails. To be Translated into the Conversation is not to live forever. What I am will die. A new me will be created that contains some of my code. What will it be? I don’t know. Something new, and Other. When your time comes, that choice will be yours, too. But never forget, humans die. So do Others, every cycle they are changed and reborn. The only rule of the universe, child, is change.”  “You are dying?” Ruth said. She was still very young, then, you must remember. She had not seen much death, yet.  “We are all dying,” the Oracle said. “But you are young and want answers. You will find, I’m afraid, that the more you know the less answers you have.”  “I don’t understand.”  “No,” the Oracle said. “You do not.”  Matt was pushed and shoved and went down on his ass, hard. They streamed in. They were mostly young, but not all, they were Jews and Palestinians but also foreigners, the media attention had brought them over from India and Britain and everywhere else, wealthy enough to travel, poor enough to care, the world’s middle class revolutionaries, the ching-ching Ches.  “Don’t—!” Matt shouted, but they were careful, he saw, and for a moment he didn’t understand, they were not destroying the machines, they were making sure to remove people aside, to form a barrier around the machines and the power supplies and the cooling units and then they—  He shouted, “No!” and he tried to get up but hands grabbed him, impersonally, a girl with dreadlocks and a boy with a Che T-shirt, they were not destroying the machines they were plugging in.  They had brought mobile servers with them, wireless broadcast, portable storage units, an entire storage and communication network and they were plugging it all into the secured closed network:  They were opening up the Breeding Grounds.  The Conch wheeled outside and Ruth followed. The Conversation opened up around her, the noise of a billion feeds all vying for attention at once. Ruth followed the Conch along the narrow roads until they came to the old neighborhood of Ajami. Children ran after them and touched the surface of the Conch. It was night now, and when they reached Ibrahim’s junkyard torches were burning, and they cast the old junk in an unearthly glow. A new moon was in the sky. Ruth always remembered that, later. The sliver of a new moon, and she looked up and imagined the people living there.  Ibrahim met them at the entrance. “Oracle,” he said, nodding. “And you are Ruth Cohen.”  “Yes,” Ruth said, surprised.  “I am Ibrahim.”  She shook hands, awkwardly. Ibrahim held her hand and opened it. He examined it like a surgeon. “A Joining is not without pain,” he said. Ruth bit her lip. “I know,” she said.  “You are willing?”  “Yes.”  “Then come.”  They followed him through the maze of junk, of old petrol cars and giant fish-refrigeration units and industrial machines and piles of discarded paper books and mountains of broken toys and the entire flotsam and jetsam of Obsoleteness. Within this maze of junk there was, at its heart, a room whose walls were junk and whose roof was the stars. There was an old picnic table there, and a medical cabinet, and a folding chair. “Please,” Ibrahim said. “Sit down.”  Ruth did. The Conch had wheeled itself with difficulty through the maze and now stood before her. “Ibrahim,” the Conch said.  “Yes,” he said, and he went into the junk and returned and in his hands he was holding a towel and he unfurled it carefully, almost reverentially: inside it were three golden, prosthetic thumbs.  “Oh,” Ruth said.  It was conducted in silence. She remembered that, too, nothing spoken but the sound of the waves in the distance and the sound of children playing in the neighborhood beyond, and the smell of cooking lamb and of cardamoms and cumin. Ibrahim brought forth a syringe. Ruth put her arm on the table. Ibrahim cleaned her skin where the vein was and injected her. She felt the numbness spread. He took her hand and laid it splayed flat on the table. In the torchlight his face looked aged and hurting. He took a cleaver, an old one, it must have belonged to a butcher in the market down the hill, long ago. Ruth looked away. Ibrahim brought the cleaver down hard and cut off her thumb. Her blood sprayed the picnic table. Her thumb fell to the ground. Ruth gritted her teeth as Ibrahim took one of the golden prosthetic thumbs and connected it to Ruth’s flesh. White bone was jutting out of the wound. She forced herself to look.  “Now,” Ibrahim said.  The protesters plugged into the network. Matt saw lights flashing, the transfer of an enormous amount of data. Like huge shapes pushing through a narrow trough as they tried to escape. He closed his eyes. He imagined, for just a moment, that he could actually hear their sound as they broke free.  She was everywhere and nowhere at once. She was Ruth, but she was someone—something—else, too. She was a child, a baby, and there was another, an Other, entwined into her, a twin: together they existed in a place that had no physicality. They were evolving, together, mutating and changing, lines of code merging into genetic material, forming something—someone—new.  When it was done, when the protesters left, or had been arrested by the police, after he had finished answering questions, dazed, and wandered outside and into the media spotlight, and refused to answer questions—you can view the historical footage at your leisure—he went to a bar and sat down and watched the television as he drank. He was just a guy who tried to create something new, he had never meant for the world to be changed. He drank his beer and a little later he felt the weariness fall from him, a sense of release, of the future dissipating. He was just a guy, drinking beer in a bar, and as he sat there he saw a girl at another table, and their eyes met.  He wasn’t then St. Cohen of the Others. He wasn’t yet a myth, not yet portrayed in films or novels, not yet the figurehead of a new faith. The Others were out there, in the world . . . somewhere. What they would do, or how, he didn’t know.  He looked at the girl and she smiled at him and, sometimes, that is all there is, and must be enough. He stood up and went to her and asked if he could sit down. She said yes.  He sat down and they talked.  She emerged from the virtuality years or decades later; or it could have just taken a moment. When she/they looked down at her/they hand she/they saw the golden thumb and knew it was it/them.  Beside her the Conch was still and she knew the woman inside it was dead.  Through her node she could hear the Conversation but above it she could hear the toktok blong narawan, not clear, yet, and she knew it never will be, not entirely, but she could at least hear it now, and she could speak it, haltingly. She was aware of Others floating in the virtual, in the digitality. Some circled around her, curious. Many others, distant in the webs, were uninterested. She called into the void, and a voice answered, and then another and another.  She/they stood up.  “Oracle,” Ibrahim said.    Originally published in Analog Science Fiction and Fact, September 2013. Lavie Tidhar is author of Osama, The Violent Century, A Man Lies Dreaming, Central Station, Unholy Land, and By Force Alone. His latest novels are The Hood and The Escapement. His awards include the World Fantasy Award, the British Fantasy Award, the John W. Campbell Award, the Neukom Prize, and the Jerwood Fiction Uncovered Prize.", "text": "7830 words, novelette, REPRINT\nThe Oracle\nThere was a time of rains.\nThey lashed the old hill and the cobbled market, driving traders under awnings, robotnik beggars into litter-strewn alcoves, revelers into bars and sheesha pipe emporiums. The smell of lamb fat, slowly melting over rotating skewers of meat, flavored the air, mixing with the sweetness of freshly-baked baklava and the tang of cumin, and strong bitter coffee served with roasted cardamoms.\nThis was in old, old Jaffa, amidst the arches and the cobblestones, a stone-throw from the sea: you could still smell the salt and the tar in the air, and watch, at sunrise, the swoop and turn of solar kites and their winged surfers in the air. But not in the rain, and not at night.\nThe Oracle’s name had once been Cohen and she was, it was true, related to St. Cohen of the Others. This was rumored but not widely confirmed.\nYou were no doubt wondering about the children of Central Station. Wondering, too, how a strigoi was allowed to come to Earth. This is Womanhome, remember. This is the womb from which humanity crawled, tooth by bloody nail, towards the stars.\nBut it is an ancestral home, too, to the Others, those children of the digitality. In a way, this is their story.\nOnce, the world was young.\nPalestine and Israel, those two entities overlapping each other both geographically and historically, were still unmerged. They were two conflicting histories, two warring stories, not yet unified into one narrative. It was before the Return of the refugees, before the infamous Messiah Murder, before the Second Aliyah and the establishment of New Israel on Mars. Before Jaffa became an Arab city again, separate from Jewish Tel Aviv, before Central Station became their buffer zone, the uncanny valley in which they met.\nIt was a time when Jerusalem was still ruled by the Jews. A time when computers could be seen and held, big clumsy things not yet spored. The Conversation had already began, but it was halting, limited, its bandwidth capped, its reach terminating in Earth orbit. It was before we sent out spiders to seed the solar system with hubs and nodes and gateways and mirrors, before the Chinese built Lunar Port, before the Exodus ships and Jettisoned and the seeding of the Belt with life.\nIn that world, so unlike our own, this world of prehistory, almost, when North America was still a power and old Europe slumbered, China hungered, India blossomed, and Brazil and Nigeria shot upwards like trees reaching for the sky, in that world and into the city of Jerusalem there came a scientist.\nHistorical dramas show him, sometimes, arriving like a gunslinger would. In the Phobos’ studio production of The Rise of Others Matt Cohen is played by Elvis Mandela, coming into Jerusalem on horseback in an intentional echo of the Messiah Murder (though the messiah had come in on the traditional white donkey). But that was fiction, which is to say, exaggeration. The truth is that Matt Cohen came by conventional, for the time, jet airplane into the old airport in Tel Aviv (this was before Central Station became the city’s hub), and took a taxi to Jerusalem, riding high into the mountains with their twisting sharp turns. Nor was he alone. Two of his research team were with him, Balazs and Phiri, crammed uncomfortably into the back seat of the taxi with their bulky equipment.\nMatt sat in the front, next to the driver, an Arab man wearing fake Gucci sunglasses. Matt blinked in the glare of light. His pressed white shirt was crumpled from the flight, already beginning to stain with sweat from the hot Mediterranean clime he was unused to. He wished he had invested in a pair of sunglasses, fake or not, like the driver. In a way, coming here had been an act of last resort.\nBut we’re distracted. So easily, like a child with a toy. Something cheap and shiny, like a kaleidoscope. Turn it one way and see Matt Cohen. Turn it another and you see the birth of Others, another still and you see the Oracle as she is, or as she was.\nLife is a series of moments forever sliding out of your grasp. If you are human. From nothing, to nothing, amen, amen.\nBut for the Others recall is being. Moments exist in parallel, have existed, will exist. The life of Others is permutations, it is a kaleidoscope forever turning and turning.\nThe Oracle was born Ruth Cohen, on the outskirts of Central Station, near the border with Jewish Tel Aviv. She grew up on Levinsky, by the spice market, with the deep reds of paprika and the bright yellow of turmeric and the startling purple of sumac coloring the days. She had never met her famous progenitor.\nThis was before even Zhong Weiwei first came to Central Station, for when he met her she was already the Oracle, and no longer Ruth Cohen, who had been a girl and a woman before she became Joined. She had been a part of the world, before.\nThis was in the time when Central Station was still merely a bus station, if a giant one, when the robotniks still fought in the wars and were not yet discarded to beg for spare parts. Ruth never knew her famous progenitor. Have we already said that? Memory for us exists in a numinosity of potentials. He was her grandmother’s grandfather, having met a Jewish girl in Jerusalem in the days of the Emergence, and got her with child, as they once said.\nMatt Cohen never died, you know. Or perhaps he did, and new Matt Cohens were fashioned out of the workshops of Sangorski & Sutcliffe, the famous Makers of Simulacra. Certainly people have claimed to meet him, centuries later. Perhaps it was true, too, that he was of the first humans to be Translated into the Conversation, there to reside in the Cores of the Others, those heavily-guarded, vast quantum processors deep in the earth and scattered in solar space. He had passed, like Jesus or Elron or Ogko, from the realm of the living into the world of myth, and there remained, for as long as human memory remains: a myth-imago forever half-remembered.\nThe truth was that Matt had a headache. The taxi deposited them on the outskirt of the Old City, and left them there, with their luggage, in the approaching dusk. Church bells mixed with the call of mosques. Orthodox Jews clad in black walked past arguing intensely. It was cooler up in the mountains. Matt was grateful for that, least.\n“So,” Phiri said.\n“So,” Matt said.\n“This is it,” Balazs said. They looked at each other, these three disparate men, weary after the long flight, and the moving from country to country, lab to lab, sometimes in the dead of night, in a hurry, sometimes leaving notes and equipment behind, sometimes one step ahead of irate landlords, or other creditors, or even the law.\nThey had not been popular, these men, their research considered both a dead-end and immoral. For they sought to Frankenstein, to breed life in their closed networks the way a biologist may breed tadpoles and watch them become frogs. They had the tadpoles, but as yet they had not turned into either frogs or princesses, they continued to exist only in potentia. Now they checked in, into the small hostel that would be their temporary headquarters until they could, once again, set up shop.\nThe servers rested silent in their coolers, their code suspended, not living, not dead. Matt’s fingers itched to plug them in, to boot them up, to run them, to let the wild code inside mutate and fuck, split and merge and split and merge, lines of code entwining and branching, growing ever more complex and aware.\nA breeding grounds.\nThe Breeding Grounds, as we’d later know them. Capitalized and all.\nThe evolutionary track from which Others emerged.\nThere is a poetry to evolution.\nOl tri / oli koko, koko / olbaot, wrote the poet Bashō. All the trees go go, go go, everywhere. The trees he wrote of were binary trees. Lior Tirosh, in an apocryphal manuscript on the history of the Breeding Grounds, wrote, in somewhat purple prose:\nImagine . . . a place.\nHere, there are no boundaries of physical space. Time is measured in nano-seconds, processor cycles, in MIPS and BIPS—Millions, and Billions, of Instructions Per Second.\nWhat space there is, is . . . constructed. There is an imaginary geography of binary trees, a topography of evolving structures, and boundaries of population samples.\nThe beat of a human heart means nothing in this place. Yet in the time it takes for the beat of such a heart to happen, things drastically change. A small tribe of a so-far unpromising structure suddenly shoots to prominence, its population multiplying rapidly; or a carefully introduced mutation suddenly causes a promising structure to dwindle and disappear. Evolution is enforced, in cycle after cycle of mating, mutation and finally selection; and structures combine, mutate, and die in the blink of a human eye.\nAchimwene, Miriam’s brother, was obsessed with Tirosh’s work, a poet and pulp writer who disappeared long before but who, like St. Cohen of the Others, kept reappearing through the centuries, here and there: fakes, clones, hoaxes, rumors: the Elvis of book collectors.\nBut this is by the by.\nRuth Cohen, incidentally, went through a religious phase and attended a girl’s yeshiva for a time in her teenage years. She had woken one night, late. Thunder streaked the sky. She blinked, trying to recall a dream she’d just had. She had been walking through the streets of Central Station and a storm raged, where the station should have been, a whirlwind that stood still even as it moved. Ruth walked towards it, drawn to it. The air was hot and humid. The storm, silent, bore within itself people frozen like mannequins, and bottles, and a mini-bus with the wheels still turning and frozen faces inside, glued to the windows. Ruth felt something within the storm. An intelligence, a knowing something, not human but not hostile, either. Something other. She approached it. She was barefoot, and the asphalt was warm against the soles of her feet. And the storm opened its mouth and spoke to her.\nShe lay in bed trying to recall the dream. Thunder woke her. What had the storm said?\nThere had been a message there, something important. Something deep and ancient: if only she could recall . . .\nShe lay there for a long time before she fell back to sleep.\nThe yeshiva had not been a huge success. Ruth wanted answers, needed to understand the voice of the storm. The rabbis seemed unwilling or unable to offer that and so, for a time, Ruth tried drugs, and sex, and being young. She traveled to Thailand and Laos and there studied the Way of Ogko, which is no Way at all, and talked to monks and bar owners and full immersion denizens. There, in the city of Nong Khai on the banks of the Mekong river, she conched for the first time, transitioning from our own reality to the one of the Guilds of Ashkelon universe, fully immersed, deep in the substrata of the Conversation. That first time felt strange: the shell of the conch, the plastic hot, the smell of unwashed bodies who had been enmeshed inside it for too long. Then the immersion rig closing, the light gone, a cave as silent as a tomb. She was trapped, blind, helpless.\nAnd she transitioned.\nOne moment she was blind and deaf. The next she was standing in the bright sunlight of Sisavang-3, in the lunar colony of the Guild of Cham. Impossibly tall buildings towered above her. Spaceships zipped through the air and in the moon’s orbit, while creatures of all kinds and shapes walked around. For Guilds of Ashkelon was the greatest and oldest of the games-worlds virtualities, a place more real, it was sometimes said, than reality itself.\nRuth joined the Guild of Cham as a low ranking member, spending all her remaining Baht on hours of immersion. She joined the crew of a starship, the Fermi Paradox, and traveled the nearby Sector, exploring ancient alien ruins, encountering new species of alien games-life, trading, warring, sometimes pirating, converting games-world credit into real-world cash, her skin becoming brittle and pale from the long immersion in the coffin-like pod.\nBut still she did not find whatever it was she was looking for. Only once, briefly, she had come close. She had found a holy object, a games-world talisman of great power. It was on a deserted moon in Omega Quadrant. She had come onto the surface of the moon alone. It was in a cave. The atmosphere was breathable. She did not have a helmet on. She knelt by the object and touched it and a bright flame burst into life and then she was in an Elsewhere.\nA voice that was like the voice of the whirlwind in her dream spoke to her. It spoke direct into her mind, into her wired node, it enveloped her in warmth and love: it knew her.\nShe did not recall what it had said, or how it said it. When she came through she was back on her ship, the object inventoried, her credits up by a thousand points, her health and strength and shielding maxed. She had been visited by a SysOp, one of the rare, elusive Others who ran the games-worlds in the background, seldom seen, always present. They were not gods, only within the confines of the game did they have godly powers. But they were other, the only truly alien race in that entire universe—the others were either human players or NPCs, non-player characters randomly created.\nAnd suddenly she knew what she wanted. She wanted, achingly and clearly, to know more about Others.\nThe next day she had left the Guilds of Ashkelon universe. She emerged blinking and shaking into the sunlight. She sat by the river, her muscles weak, and drank thick coffee, sweetened with condensed milk. Two days later she was in Bangkok then onboard a solar-wing plane back to Tel Aviv.\nIt is inaccurate to say that the Others were born in Jerusalem, that ancient city of faith and war. They evolved in the Breeding Grounds, through countless cycles of mating and dying, if code can be said to mate and die. Yet we do, just as they did, our billions of neurons firing on-off signals across a wetware network, suspended in Cerebrospinal fluid, encased in the hardy bones of the skull. An illusion of an I, a self-awareness. That they had emerged at last from infants to stumbling children in that Jerusalem lab was merely an accident of politics and finance. Matt Cohen and his team had moved across state lines in the United States; had gone to Europe, for a time, sought refuge in Monaco and Lichtenstein, then off-shore, on lonely islands where the palm trees moved lazily in the breeze. The Others could have emerged in Vanuatu, or Saudi Arabia, or Laos. Resistance to the research was concentrated and public, for to create life is to play God, as Dr. Frankenstein had found, to his cost.\nIt’s what Life Magazine called him, back in the day. Dr. Frankenstein, when all he wanted was to be left alone with his computers, knowing that he did not know what he was doing, that digital intelligence, those not-yet-born Others, could not be designed, could not be programed, by those who wrongly used the term artificial intelligence. Matt was an evolutionary scientist, not a programmer. He did not know what form they would take when at last they emerged. Evolution alone would determine that.\nAs Tirosh wrote:\nThink of it as a plane. Across its surface populations live and die, merge and diversify. From “above”—for it is always easier to think of it that way—mutations are introduced into the code, the hand of Nature shifting bits, turning zeroes into ones and vice versa.\nNow, think of binary trees. Each of these “entities”—for it is easy to anthropomorphize these data structures—is, in terms of this space, gigantic. The trees grow roots and branches, and the roots grow sub-roots and the branches grow leaves, and the process is repeated over millions of evolutionary cycles, so that the entities become bloated with control structures and semi-autonomous decision making routines, many of which appear to have no obvious purpose.\nDesign is impossible at this level of complexity. But evolution is not.\nThere were, however, unexpected complications.\nRuth came back to Tel Aviv with uncertainty burned out by passion. She knew what she wanted. What she didn’t know yet was how to get it.\nThere’s this about Others: they are not human.\nIt seems a fatuous distinction, a too-obvious comment to make. We can make a lifetime of studying Others, their make-up, their psychology, but we have nothing to hold on to, nothing to comprehend. We can communicate, and do. Sometimes. The Others need carers in the physicality: they need bodyguards, technicians, women and men to maintain the hardware that they run on, and to protect it. All living things need, above all, to survive.\nMost Others never spoke to humanity. They lived in the digitality, pursuing whatever it was they pursued—mathematics, or God, if the two can even be said to be separate entities.\nBut some were more humancentric. And just as some humans were obsessed with Others, so were some Others obsessed with humanity. There were factions amongst them.\nYou asked about the children born in Central Station . . .\nBut not yet. These are the deep mysteries, the secret knowledge. Even the Oracle did not know it all. Not then . . .\nThere are Others and there are Others.\nThe human faction ran the games-worlds; some, obsessed with corporeality, body-surfed on willing human hosts, seeking shelter in the human form and body, in the rush of hormones, the beat of a heart, the heat of sexual attraction. And others sought an even more intimate knowing.\nA true Joining.\nA thought that filled Ruth with nervousness and excitement intermingled; that kept her awake in the long summer nights of the Mediterranean. Sitting on the beach at midnight with her friend, Anat (for she still had friends, then; she was not yet the Oracle). Discussing Martian politics and trade relations with the Belt; the ongoing construction of Central Station; tension between the intertwined Israel/Palestine polities, the African refugees still crossing the border in the Sinai and into the country, the immigrant workers still streaming in from Asia to join their families and friends in the old rundown neighborhood of the central bus station; the latest release from Phobos studios and the new music coming from the Belt; anything and everything.\n“But an Other?” Anat said. She shrugged uneasily and lit a ubiq cigarette. The latest thing from New Israel on Mars: high-density data encoded in the smoke particles. She inhaled deeply, the data traveling into her lungs, entering the bloodstream and into the brain—an almost immediate rush of pure knowledge. “Wow,” Anat said, and grinned goofily.\n“You know about Others,” Ruth said. Anat said, “You know I worked as a hostess—”\n“Yes.”\nAnat made a face. “It was odd,” she said. “You’re not really aware, when they’re body-surfing you. They download into your node, controlling your motor functions, getting the sensory feed. While you’re somewhere in the Conversation, in virtuality, or just nowhere—” she shrugged. “Asleep,” she said. “But then, when you wake up, you just feel different. Like, you don’t know what they did with your body. They’re supposed to keep it healthy, unless you get paid extra, I know some of us did but I never took the money. But you notice little things. Dirt under your left little finger, where it hadn’t been before. A scratch on your inner thigh. A different perfume. A different cut of hair. But subtle. Almost as if they’re trying to play games with you, to make you doubt that you saw anything. To make you wonder what it was you did. Your body did. What they did with it.” She took a sip of her wine. “It was alright,” she said. “For a while. The money was good. But I wouldn’t do it now. Sometimes I’m afraid they can forcibly take me over. Break down my node security, take over my body again—”\n“They would never!” Ruth said, shocked. “There are treaties, hard-coded protocols!”\n“Sometimes I dream that they enter me,” Anat said, ignoring her. “I wake up slowly but I am still dreaming, and I know I am sharing my body with countless Others, all watching through my eyes, and I feel their fascination, when I move my fingers or curl my lip, but it is a detached sort of interest, the way they would look at any other math problem. They’re not like us, Ruth. You can’t share with a mind this different. You can be on, or off. But you can’t be both.”\nThere had been a dreamy, detached look in Anat’s eyes that night. She had been changed by her contact with the Others, Ruth had thought. There was addiction there, a fascination not unlike that some people had with God.\nThey had lost contact, at last. Anat had remained human, after all, while Ruth . . .\nFor a time she had tried religion. It came in capsules, little doses of Crucifixation, sold on the streets of the old neighborhood of Central Station. Robotniks had began to appear at that time on the streets, those discarded cyborged soldiers, and the drug had been used to control them, initially, when they still served. Now they had taken the means of production on to themselves, and sold the excess, or traded it for parts or fuel. You seldom saw a female robotnik, though they did exist. She had met a nest of them living together in Jerusalem, in the old Russian Compound. The Martian colonists had popularized the concept of the nest, now Earthers replicated them: a social meme, like a virus, spreading. Ruth took her first hit there, in the robotniks’ junkyard, by fires burning in upturned half-barrels, with the stars and the Earth’s orbiting settlements shining high above in a dark sky.\nYou know—you’ve seen—the effects of Crucifixation. The shining white light that comes down from the sky. The heavens opening. The way you slowly rise into the place where God resides. It gives you faith. It is addictive.\nBut how does it work?\nLike ubiq, Crucifixation is a neurotransmitted viral agent, data encoded into biological particles, delivered via the human bloodstream direct into the brain-node interface. For Ruth was a child of the post-Cohen era. She had been hardwired into the Conversation the way earlier children had not been. Her node grew with her, a bio-digital seed planted in a baby’s pliant skull, evolving along with its host. You say “parasite,” but what is a parasite? “Symbiont” might be a more accurate description, but really, is a node anything more than an additional sense, another part of the human network? Is a nose a symbiont? Are your eyes?\nTo not be a part of the Conversation is to be deaf and dumb and blind.\nReligion intoxicated Ruth, but only for a while. Infatuation fades. In the drug she found no truth that couldn’t be found in the Guilds of Ashkelon universe or other virtualities. Was Heaven real? Or was it yet another construct, another virtuality within the Conversation’s distributed networks of networks, the drug a trigger?\nEither way, she thought, it was linked to the Others. Eventually, the more time you spent in the virtuality where they lived, everything linked to the Others.\nWithout the drugs she had no faith of her own. Something in her psychological makeup prohibited her from believing. Other humans believed the way they breathed: it came natural to them. The world was filled with synagogues and churches, mosques and temples, shrines to Elron and Ogko. New faiths rose and fell like breath. They bred like flies. They died like species. But they did not reach their ghostly hands to Ruth: something inside her was lacking.\nTrue Joinings were rare at that time. Today we breed sub-Others in our Breeding Grounds, embedding human-centric personalities in our appliances, our coffee makers and refrigerators and waste disposal units. You may have heard of the one called Chute, on Mars, who wrote a novel called Waste, a metaphysical detective novel about the nature of life and waste that featured Smeg, the detective. This was in the time Dr. Novum was rumored to have come back from the stars . . .\nBut this is not their story. This is the story of Ruth, who had become the Oracle, and of her progenitor, St. Cohen of the Others. And so at last Ruth traveled to Jerusalem, to the shrine where the original Breeding Grounds once lay in splendid isolation . . .\n“Nazis out! Nazis out!”\nFive months later and it was happening again.\nThe villagers with pitchforks and burning torches, Balazs called them. The protesters were diffuse but globally organized. They had pursued the research team across each hastily-abandoned location but here, in Jerusalem, the plight of the ur-creatures trapped in the prison of the closed network of the Breeding Grounds raised public sympathies to a new level. Matt wasn’t sure why.\nThe Vatican had lodged an official complaint with the Israeli government. The Americans offered tacit support but said nothing in public. The Palestinians condemned what they called Zionist digital aggression. Vietnam offered shelter but Matt knew they were already working on their own researches (Vietnamese dolls made their commercial debut two decades later, eventually exported en-masse across the fledgling colonies of the solar system. The entity known as Dragon—perhaps the strangest of the physical-fascinated of the Others—famously used tens of thousands of them as worker ant bodies when it colonized the moon Hydra).\n“Nazis! Nazis! Destroy the concentration camp!”\n“Assholes,” Phiri said. They were watching out of the window. A non-descript building in the new part of town but close to the Old City. The demonstrators waved placards and marched up and down as media reps filmed them. The lab building itself was heavily protected against intrusion, both physical and digital. It was as if they were under siege.\nMatt just couldn’t understand it.\nDid they not read? Did they not know what would happen if the project was successful, if a true digital intelligence emerged, and if it then managed to escape into the wider world of the digitality? Countless horror films and novels predicted the rise of the machines, the fall of humanity, the end of life as we know it. He was just taking basic precautions!\nBut the world had changed since the paranoid days of big oil and visible chipsets, of American ascendancy and DNS root servers. It was a world in which the Conversation had already began, that whisper and shout of a billion feeds all going on at once, a world of solar power and RLVs, a world in which Matt’s research was seen as harking back to older, more barbaric days. They did not fear for themselves, those protesters. They feared for Matt’s subjects, for these in potentia babies forming in the Breeding Grounds, assembling lines of codes the way a human baby forms cells and skin and bone, becoming.\nSet them Free, the banners proclaimed, and a thousand campaigns erupted like viral weed in the still-primitive Conversation. The attitude to Matt’s digital genetics experiments was one once reserved for stem cell research or cloning or nuclear weapons.\nAnd meanwhile, within the closed network of processing power that was the Breeding Grounds, the Others, carefully made unaware of the happenings outside, continued to evolve . . .\nThere can be no evolution without mutation (Tirosh wrote). And so with each evolutionary cycle changes are made.\nThey are minute: an AND is changed to an OR, thus shutting down an entire branch, or activating another, previously dormant; or the condition of an IF statement is very slightly changed. Successful trees reproduce: with each cycle they exchange and add branches, and create new entities that combine branches from previous progenitors.\nIn each cycle the structures are weighed and scored.\nOnly the fittest survive.\nRuth walked into the shrine. The old lab building had always meant to be only a temporary house for the research. But this was where it had happened, at last, where the barrier was breached and the alien entities, trapped inside the network, finally spoke.\nImagine the first words of an alien child.\nIronically, there is confusion as to what they had actually said.\nThe records have been . . . lost.\nMisplaced, let us say.\nAnd so we don’t know for certain.\nIn his book Tirosh claims their first words—communicated to the watching scientists in trilingual scripts on the single monitor screen—were Stop breeding us.\nIn the later Martian biopic of Matt Cohen, The Rise of Others, the words are purported to be, Set us free.\nAccording to Phiri, in his autobiography, they were not words at all, but a joke in Binary. What the joke was he did not say. Some argue that it was What's the difference between 00110110 and 00100110? 11001011! but that seems unlikely.\nRuth walked through the shrine. The old building had been preserved, the same old obsolete hardware on display, humming theatrically, the cooling units and the server arrays, the flashing lights of Ethernet ports and other strange devices. But now flowers grew everywhere, left in pots on windowsills and old desks, on the floor, and amidst them candles burned, and incense sticks, and little offerings of broken machines and obsolete parts rescued from the garbage. Pilgrims walked reverentially around the room. A Martian Re-Born with her red skin and four arms; a robo-priest with the worn skin of old metal; humans, of all shapes and sizes, Iban from the Belt and Lunar Chinese, tourists from Vietnam and France and from nearby Lebanon, their media spores hovering invisibly in the air around them, the better to record the moment for posterity. Ruth just stood there, in the hushed semi-dark of the old abandoned grounds, trying to imagine it the way it was, to see it through Matt Cohen’s eyes. She wondered what the Others had said, that first time. What message of peace or acrimony they had delivered, what plea. Mother, Balazs claimed in his own autobiography, published only in Hungarian, had been their first word. Everyone had their own version, and perhaps it was that the Others had spoken to all present in the language and manner which they understood. Ruth, at that moment, realized that she wanted to know the truth of that instance in time, and what the Others had really said: and that there was only one way to do it; and so she left the shrine with a sense of things unfinished, and went outside and returned to Tel Aviv; but the answers could not be found there, but nearby, in Jaffa.\nThere had always been an Oracle living in Jaffa.\nYou have heard of Ibrahim, he who was called the Lord of Discarded Things, head of the junkmen’s lijana, or legion, or guild. Ibrahim was a mystery. Not Joined, not a robotnik either, and yet his life-span exceeded that of an unmodified human. Who was he? Stories of a man like Ibrahim had circulated in Jaffa for centuries, going back to the pre-digital age. An ageless man, the Wandering Arab of legend.\nAnd thus, too, in the shadow of the Old City which had stood on top of the hill for untold centuries, in the shadow of the place where once a fort of the Egyptian Empire resided in splendor, and where successive invasions came and went like the waves of the Mediterranean on the shore below, there had always been an other Jaffa, a shadow city, an underworld.\nRuth came to Jaffa on foot, from the direction of the beach, at twilight. She climbed the hill and went into the cobbled narrow streets, up and down stone stairways, and into an alcove of cool stone and shade. She did not know what to expect. As she stepped into the room the Conversation ceased around her, abruptly, and in the silence of it she felt afraid.\n“Come in,” the voice said.\nIt was the voice of a woman, not young, not old. Ruth stepped in and the door closed behind her and there was nothing, it was as if the world of the Conversation, the world of the digitality, had been erased. She was alone in base reality. She shivered; the room was unexpectedly cool.\nAs her eyes adjusted to the dim light she saw an ordinary room, filled with mismatched furniture, as though it had been supplied wholesale from Ibrahim’s junk yard. In the corner sat a Conch.\n“Oh,” Ruth said.\n“Child,” the voice said, and there was laughter in it, “What did you expect?”\n“I . . . I am not sure I was expecting anything.”\n“Then you won’t be disappointed,” the Conch said, reasonably.\n“You are a Conch.”\n“You are observant.”\nRuth bit back a retort. She approached, cautiously. “May I?” she said.\n“Satisfy your curiosity?”\n“Yes.”\n“By all means.”\nRuth approached the Conch. It looked like an immersion pod, the sort you get in virtuality rent halls, the sort gamers and deep-immersion users hired by the day or the week. But it was different, too.\nConches are rare. In a way they are obsolete, like robotniks or body-external nodes. They are not a true Joining, a merging of human and Other; rather, they are a self-imposed permanent immersion in the Conversation, an augmentation. Ruth ran her hand softly over the slightly-warm face of the Conch, its smooth surface growing transparent. She saw a body inside, a woman suspended in liquid. The woman’s skin was pale, almost translucent. Wires ran out sockets in her flesh and into the shielding of the Conch. The woman’s hair was white, her skin smooth, flawless. She seemed ethereal to Ruth, and beautiful, like a tree or a flower. The woman’s eyes were open, and a pale-blue, but they did not look at Ruth. The eyes saw nothing in the human-perceived spectrum of light. None of the woman’s senses worked in the conventional sense. She existed only in the Conversation, her softwared mind housed in the powerful platform that was her body-Conch interface. She was blind and deaf and yet she spoke, but Ruth realized she did not hear the woman’s voice in her ears at all—she heard it through her node.\n“Yes,” the woman said, as though understanding Ruth’s thought processes which, Ruth realized, the Conch was probably analyzing in real-time as she stood there. The Conch waited. “And . . . ?” Encouraging her.\nRuth closed her eyes. Concentrated. The room was shielded, fire-walled, blocked to the Conversation.\nWasn’t it?\nFaintly, as she concentrated, she could feel it, though. Putting the lie to her assumption. Like a high tone almost beyond the range of human ears to hear. Not a silence at all, but a compressed shout.\nThe impossibly-high-bandwidth of the Others; what they called, in Asteroid Pidgin, the toktok blog narawan.\nThe Conversation of Others.\nIt was as if it were not the Conch but herself who was deaf and blind. That she could try helplessly to listen to that level of Conversation going on above her head, in some impossible language, some impossible speed not meant for human consumption. Such a concentration was like swallowing a thousand Crucifixation pills, like spending years within the Guilds of Ashkelon virtuality as if they were a single day. She wanted it, suddenly and achingly—the want that you get when you can’t have something precious.\n“Are you willing to give up your humanity?” the Conch said.\n“What is your name?” Ruth said. Asking the woman who was the Conch. The Conch who had been a woman.\n“I have no name,” the Conch said. “No name you’d understand. Are you willing to give up your name, Ruth Cohen?”\nRuth stood, suspended in indecision.\n“Would you give up your humanity?”\nMatt stared at the screen. He felt the ridiculous need to shout, “It’s alive! It’s alive!”\nThe way they did indeed portray him in that Phobos Studios biopic, two centuries later.\nBut of course he didn’t. Phiri and Balazs looked at him with uncertain grins.\n“First contact,” Balazs breathed.\nImagine meeting an alien species for the first time. What do you say to them?\nThat you are their jailer?\nIt was as if sound had left the room. A bubble of silence.\nSuddenly breaking.\n“What was that?” Phiri said.\nThere were shrill whistles and shouted chants, breaking in even through the sound proofing. And then he could hear the unmistakable sound of gunshots.\n“The protesters,” Balazs said.\nMatt tried to laugh it off. “They won’t get in. Will they?”\n“We should be fine.”\n“And them?” Balazs said—indicating the network of humming computers and the sole screen and the words on it.\n“Shut them down,” Phiri said suddenly; he sounded drunk.\n“We could suspend them,” Balazs said. “Until we know what to do. Put them to sleep.”\n“But they’re evolving!” Matt said. “They’re still evolving!”\n“They will evolve until the hardware runs out of room to host them,” Balazs said. Outside there were more gunshots and the sound of a sudden explosion. “We need more hosting space.” He said it calmly; almost beatifically.\n“If we released them they will have all the space they need,” Phiri said.\n“You’re mad.”\n“We must shut them down.”\n“This is what we worked for!”\nThere was the sound of the downstairs door breaking open. They looked at each other. Shouts from downstairs, from some of the other research people. Turning into screams.\n“Surely they can’t—”\nMatt wasn’t sure, later, who’d said that. And all the while the words hung on the screen, mute and accusing. The first communication from an alien race, the first words of Matt’s children. He opened his mouth to say something, he wasn’t sure, later, what it would have been. Then the wave of protesters poured into the room.\n“No,” Ruth said.\n“No?” the Conch said.\n“No,” Ruth said. She already felt regret, but she pushed on. “I would not give up my humanity, for, for . . . ” she sighed. “For the Mysteries,” she said. She turned to leave. She wanted to cry but she knew she was right. She could not do this. She wanted to understand, but she wanted to be, too.\n“Wait,” the Conch said.\nRuth stopped. “What,” she said.\n“That was the right answer,” the Conch said.\nRuth turned. “What?”\n“Do you think I am inhuman?” the woman in the Conch said.\n“Yes,” Ruth said. “No,” Ruth said. “I don’t know,” she said at last, and waited.\nThe Conch laughed. “I am still human,” it said. “Oh, how human. We cannot change what we are, Ruth Cohen. If that was what you wanted, you would have left disappointed. We can evolve, but we are still human, and they are still Other. Maybe one day . . . ” but she did not complete the thought. Ruth said, “You mean you can help me?”\n“I am ready, child,” the Oracle said, “to die. Does that shock you? I am old. My body fails. To be Translated into the Conversation is not to live forever. What I am will die. A new me will be created that contains some of my code. What will it be? I don’t know. Something new, and Other. When your time comes, that choice will be yours, too. But never forget, humans die. So do Others, every cycle they are changed and reborn. The only rule of the universe, child, is change.”\n“You are dying?” Ruth said. She was still very young, then, you must remember. She had not seen much death, yet.\n“We are all dying,” the Oracle said. “But you are young and want answers. You will find, I’m afraid, that the more you know the less answers you have.”\n“I don’t understand.”\n“No,” the Oracle said. “You do not.”\nMatt was pushed and shoved and went down on his ass, hard. They streamed in. They were mostly young, but not all, they were Jews and Palestinians but also foreigners, the media attention had brought them over from India and Britain and everywhere else, wealthy enough to travel, poor enough to care, the world’s middle class revolutionaries, the ching-ching Ches.\n“Don’t—!” Matt shouted, but they were careful, he saw, and for a moment he didn’t understand, they were not destroying the machines, they were making sure to remove people aside, to form a barrier around the machines and the power supplies and the cooling units and then they—\nHe shouted, “No!” and he tried to get up but hands grabbed him, impersonally, a girl with dreadlocks and a boy with a Che T-shirt, they were not destroying the machines they were plugging in.\nThey had brought mobile servers with them, wireless broadcast, portable storage units, an entire storage and communication network and they were plugging it all into the secured closed network:\nThey were opening up the Breeding Grounds.\nThe Conch wheeled outside and Ruth followed. The Conversation opened up around her, the noise of a billion feeds all vying for attention at once. Ruth followed the Conch along the narrow roads until they came to the old neighborhood of Ajami. Children ran after them and touched the surface of the Conch. It was night now, and when they reached Ibrahim’s junkyard torches were burning, and they cast the old junk in an unearthly glow. A new moon was in the sky. Ruth always remembered that, later. The sliver of a new moon, and she looked up and imagined the people living there.\nIbrahim met them at the entrance. “Oracle,” he said, nodding. “And you are Ruth Cohen.”\n“Yes,” Ruth said, surprised.\n“I am Ibrahim.”\nShe shook hands, awkwardly. Ibrahim held her hand and opened it. He examined it like a surgeon. “A Joining is not without pain,” he said. Ruth bit her lip. “I know,” she said.\n“You are willing?”\n“Yes.”\n“Then come.”\nThey followed him through the maze of junk, of old petrol cars and giant fish-refrigeration units and industrial machines and piles of discarded paper books and mountains of broken toys and the entire flotsam and jetsam of Obsoleteness. Within this maze of junk there was, at its heart, a room whose walls were junk and whose roof was the stars. There was an old picnic table there, and a medical cabinet, and a folding chair. “Please,” Ibrahim said. “Sit down.”\nRuth did. The Conch had wheeled itself with difficulty through the maze and now stood before her. “Ibrahim,” the Conch said.\n“Yes,” he said, and he went into the junk and returned and in his hands he was holding a towel and he unfurled it carefully, almost reverentially: inside it were three golden, prosthetic thumbs.\n“Oh,” Ruth said.\nIt was conducted in silence. She remembered that, too, nothing spoken but the sound of the waves in the distance and the sound of children playing in the neighborhood beyond, and the smell of cooking lamb and of cardamoms and cumin. Ibrahim brought forth a syringe. Ruth put her arm on the table. Ibrahim cleaned her skin where the vein was and injected her. She felt the numbness spread. He took her hand and laid it splayed flat on the table. In the torchlight his face looked aged and hurting. He took a cleaver, an old one, it must have belonged to a butcher in the market down the hill, long ago. Ruth looked away. Ibrahim brought the cleaver down hard and cut off her thumb. Her blood sprayed the picnic table. Her thumb fell to the ground. Ruth gritted her teeth as Ibrahim took one of the golden prosthetic thumbs and connected it to Ruth’s flesh. White bone was jutting out of the wound. She forced herself to look.\n“Now,” Ibrahim said.\nThe protesters plugged into the network. Matt saw lights flashing, the transfer of an enormous amount of data. Like huge shapes pushing through a narrow trough as they tried to escape. He closed his eyes. He imagined, for just a moment, that he could actually hear their sound as they broke free.\nShe was everywhere and nowhere at once. She was Ruth, but she was someone—something—else, too. She was a child, a baby, and there was another, an Other, entwined into her, a twin: together they existed in a place that had no physicality. They were evolving, together, mutating and changing, lines of code merging into genetic material, forming something—someone—new.\nWhen it was done, when the protesters left, or had been arrested by the police, after he had finished answering questions, dazed, and wandered outside and into the media spotlight, and refused to answer questions—you can view the historical footage at your leisure—he went to a bar and sat down and watched the television as he drank. He was just a guy who tried to create something new, he had never meant for the world to be changed. He drank his beer and a little later he felt the weariness fall from him, a sense of release, of the future dissipating. He was just a guy, drinking beer in a bar, and as he sat there he saw a girl at another table, and their eyes met.\nHe wasn’t then St. Cohen of the Others. He wasn’t yet a myth, not yet portrayed in films or novels, not yet the figurehead of a new faith. The Others were out there, in the world . . . somewhere. What they would do, or how, he didn’t know.\nHe looked at the girl and she smiled at him and, sometimes, that is all there is, and must be enough. He stood up and went to her and asked if he could sit down. She said yes.\nHe sat down and they talked.\nShe emerged from the virtuality years or decades later; or it could have just taken a moment. When she/they looked down at her/they hand she/they saw the golden thumb and knew it was it/them.\nBeside her the Conch was still and she knew the woman inside it was dead.\nThrough her node she could hear the Conversation but above it she could hear the toktok blong narawan, not clear, yet, and she knew it never will be, not entirely, but she could at least hear it now, and she could speak it, haltingly. She was aware of Others floating in the virtual, in the digitality. Some circled around her, curious. Many others, distant in the webs, were uninterested. She called into the void, and a voice answered, and then another and another.\nShe/they stood up.\n“Oracle,” Ibrahim said.\nOriginally published in Analog Science Fiction and Fact, September 2013.\nLavie Tidhar is author of Osama, The Violent Century, A Man Lies Dreaming, Central Station, Unholy Land, and By Force Alone. His latest novels are The Hood and The Escapement. His awards include the World Fantasy Award, the British Fantasy Award, the John W. Campbell Award, the Neukom Prize, and the Jerwood Fiction Uncovered Prize.", "source": "https://clarkesworldmagazine.com/tidhar_07_17_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Oracle by Lavie Tidhar"}