{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Stephen Gaskell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ri+Chimm3ukQyf9ecoEdLGsvEgk=", "id": null, "license": null, "comments": "", "raw_text": "2810 words, short story  Paper Cradle  Even though you would’ve despised the weapon, Papa, you would’ve appreciated the beauty of its creation.  First, beyond Mercury, a mote of starlight is ensnared. An archipelago of steel-blue optical cavities, strung out like a chain of sapphires around the wildfire neck of the sun, pumps the trapped light much like the way you used to spin me faster and faster on the merry-go-round at Shinjuku Park. When the light is hotter than the heart of the star from which it was born, it will be flung Earthwards like a white-hot hammer from an athlete’s hands. It will leap the cold gap of space fast. Faster than you grew up? you’d ask wryly. No, not that fast, I’d admit.  At the same time, far above the deep-sea blue of the Pacific, above the wispy cirrus, above even the line where night becomes eternal, a parabolic mirror will unfurl. The curve of its surface is so perfect you would’ve said it had been plucked from Plato’s world. The light will strike this mirror, and then, more focused than the Buddha himself, it will laser towards a small atoll four hundred kilometers off the Chinese mainland where it will meet a pellet of frozen hydrogen. The atoms, pressed together tighter than the victims of Auschwitz, will fuse.  The very sky will burn in the inferno.  Origami comes from the words oru meaning to fold, and kami meaning paper. You told me that the first time I demanded to know how to make the paper animals that were carefully placed around our small Tokyo apartment. You sat me on your knee at our tiny kitchen table, a perfect square of paper in front of us. “First,” you said, pulling back my over eager hands, “you should recognize that every form resides in the unmade sheet.”  I didn’t understand your words then. All I wanted was to touch the ivory paper, a treat as delicious as mochi ice cream on the tongue. Now I realize you were talking about me.  Myself, Commander Clayton Barnes, and Mission Specialist Pavel Lenki float in the Unity module of the ISS, 360km above the Pacific Ocean.  You would’ve related to the mood among us. We don’t move. We don’t speak. We don’t look each other in the eye. None of us signed up to NASA, FKA, or JAXA for this. We thought the human exploration of space meant understanding spider’s webs in microgravity, testing our species’ limits, and important things like learning how to say rude words in each other’s mother tongue. Admit it, you did too. At least to begin with you did.  “ISS, this is Darmstadt.”  “Barnes here, Darmstadt.” Clayton knows what’s coming, but his voice doesn’t betray any emotion. “Go ahead.”  “The phoenix is nearly ready to leave the nest. Commence deployment of the mirror.” The whole event—radio exchanges included—is being broadcast across the globe. There are cameras pointed at the sun, pointed at the ISS, pointed at the atoll. There’s even a camera pointed at us. You would’ve been disgusted by the razzmatazz, I’m sure.  “Copy that,” Clayton replies. He nods at Pavel, who’s stationed beside a command console. The Russian taps away at the keyboard, then lets his middle and index fingers linger over the ENTER key. He doesn’t want to be party to this, but what choice does he have? His is a purely symbolic role. The instructions could easily be relayed from ISOC without his input. He hits the button.  In unison, we turn our heads to the bank of screens that give view onto the ISS’s exterior. On the bottom row, second screen from the left, against a backdrop of stars, a complex, folded object slips out of its cylindrical sheath. The mirror has been kept sealed until the last to protect its nanometer perfect veneer from the scarring effects of paint flakes, slag from spent solid rocket motors, cosmic rays, micrometeoroids, and the rest. Pavel taps out another command.  You would’ve applauded my acting skills. I keep my gaze locked on the screen, expectant. The mirror is meant to unfurl along its carefully delineated fold lines, a crystal rose blooming in the light of the sun. It doesn’t. Instead, it remains in its own embrace, motionless. It does this because two days ago, I altered a line of code in the mirror’s IO protocols.  Pavel taps away, investigating. “I don’t understand.”  ISOC comes back, a LED on one of the consoles indicating we’re on a non-public channel, now. “We’re picking up a problem with the mirror’s receiver, ISS.”  “Yeah, I see that,” Clayton replies, skimming the error feedback on a nearby terminal. “We’ll have to abort the test, check it out.”  There’s a muffled sound—somebody’s hand over the mike—before ISOC speaks again. “That’s a negative, ISS.”  “What?”  “I repeat that’s a negative. Test must proceed. Prepare Koryo for an EVA.”  EVA. Extravehicular activity. A spacewalk. I don’t mean it to be so visible, but I can’t help but breathe a sigh of relief. My days as an astronaut, an engineer—hell, my days as a free citizen, even—ended the moment I committed that IO file to memory. The truth would’ve come out in time. I’ve known that all along. What I didn’t know was whether they’d still go ahead with the test. The powers that be didn’t disappoint.  You can guess what I’m going to do, Papa, can’t you? You would’ve approved, wouldn’t you?  “Why did Mama make animals?” I asked you when I was six. I’d been so young when she’d died that I couldn’t remember her. For me all that was left, aside from a few photos, were her paper constructions.  You stopped reading, peered down at me where I was folding patterned sheets. “They helped her become.”  “Become what?”  “Whatever she wanted. If she needed strength, she made a tiger. If she needed grace, a swan.” You bit your lip, went quiet.  I was still too young to understand your pain, too young to know how tortuous her cancer must have been, but, despite my age, I still felt guilty that I wasn’t in her life anymore. I clung on to those figures—or the idea of them—as tightly as I would’ve hugged her if she’d still been alive.  It was through the origami that I got interested in space. Do you remember? I read about the Miura fold that JAXA had used to package solar panels up in the most efficient way possible. I couldn’t believe the ancient art could have such applications. Soon I was reading about weightlessness and geosynchronous orbits and space stations. Soon I knew what I wanted to do with my life.  You were happy for me.  “This is bullshit.” Clayton pauses from helping me get into one of the Constellation spacesuits. We’re in Quest’s equipment lock, the cold vacuum of space beyond the crew lock in the adjacent section. I should be “camping-out”, spending eight hours in here in a reduced-nitrogen atmosphere to help lessen the chances of the bends, but the world is waiting. “You just make sure you’re well out the way when that laser arrives.”  “I will.” The white-hot lance of coherent light is nearing its operational temperature. I’ll have about fifteen minutes to replace the receiver once I get out there. If that was what I was doing it would be plenty of time.  I hate to deceive him. I want to tell him what I have planned, but that would put him in an uncomfortable position. Better that he doesn’t know.  He sighs, starts adjusting the SAFER unit on my back. The jet pack is for emergency use only; I’ll be tethered by an umbilical to the ISS.  “Thank you, Commander,” I say through the two thin microphones of my snoopy cap after I’m fully suited up. The comms device snuggly grips my head like an aviator’s hat. I wonder if Clayton can detect the nerves in my voice. You certainly would be able to.  “Something wrong, Koryo?”  I shake my visored head.  In 2010 when I enrolled at JAXA, space-exploration had more to do with non-stick frying pans than weapons of mass destruction. Reagan’s Star Wars project, born in the hot crucible of a cold war, had been dead and buried twenty years. The loss of space shuttle Columbia during reentry in 2003 had lessened the global public’s appetite for sending men and women to the stars.  You asked if I really wanted to commit to something that might not exist in ten years. I said I had to hope. Then came the Deepwater Horizon disaster, and the awful pictures of seabirds trapped in thick folds of crude, beady eyes bewildered. Like sunflowers, the oil companies turned their gluttonous faces to the light. Solar harvesters became the tech that would solve our ever growing energy needs. Funding poured back into the space agencies. JAXA, NASA, and the rest enjoyed a renaissance. When I graduated you took me to that restaurant in Kibo where you said you’d used to celebrate special occasions with Mama, and we ordered tora-fugu.  “She would be so proud,” you said, claiming it was the wasabi making your eyes filmy.  Looking back, it seems that time of optimism, of innocence, passed faster than the time it takes to make a single fold in a piece of origami.  On my second expedition to the ISS I remember my sheer physical response—throat tightening, chest constricting, stomach balling—upon seeing the contents of the glove boxes. A shaved cat, wrinkled skin raw with burns. A hamster or a gerbil, bloated, eyes popped. A dead chimp, red rust globules of dried blood hanging like the fronds of a sick mobile.  The experiments had changed since my last trip. I pushed away, backing into one of the handover cosmonauts. “They want to know what fighting up here will be like,” she said. The skin of her face was sallow, her eyes sunken.  I wondered what they’d have me do on my tour of duty.  “Walk away,” you told me when I came back to Earth. “It will only worsen.”  You were right, but I was stubborn. I’d already folded myself, and I didn’t think I could change. I told you to stop interfering.  As nations stopped talking, so did we.  Canadarm swings close, and I grab the end boom.  Beneath my suit I feel the tendrils of cold water lace through my cooling long johns. I still feel slightly light-headed from the pure-oxygen I’m breathing, and the blue-and-white Earth looks glorious.  “You set?” Clayton asks. He’ll be sitting in the orbiter aft flight deck, manning the control station ready to manipulate the arm, while Pavel will be next to him, controlling the camera.  “Ready,” I say. I feel the rumble of motors through Canadarm’s hard, metal skin. The Earth slides and turns in the firmament as if a marble in the hands of a God. As the trusses of the station glide past, I think of you in your hospital bed, telling me you don’t believe in a higher power or an afterlife or a final judgment. You’d kept your illness from me. I’d kept myself from you. We had a lot of talking to do.  “I want you to know something about your Mama,” you said, wheezing.  I held your wrist, felt the weak pulse inside, nodded for you to go on.  “She wasn’t born in Shikoko.”  I didn’t understand. “She wasn’t?”  “She was born in Honshū.” You lifted yourself up, sipped a little water. “Not far from Hiroshima.”  I sat down in the small plastic red chair next to the bed. Mama had been born early 1946. I’d always thought both sides of my family had escaped the worst of the war. “Her cancer—”  “We don’t know.” Your hands gripped the bed sheets, your fingers paling. “Perhaps she was lucky compared to some.”  I delved into my handbag to fetch the paper you’d asked for—  “—quicken it up, Koryo?”  I snap out of the memory at Clayton’s words. I’ve drawn alongside the enfolded mirror. Sunward, parallel to the arc of the sky, I see the glint of satellites and solar farms and other orbitals. ISOC won’t like it, but my impromptu spacewalk will be beaming live across the world. In the treacle-slow way of space, I turn so that my bulk blocks line-of-sight between the ISS external cam that tracks me and the concertina’d mirror.  Clayton’s onto the mistake immediately. “Now we can’t see what you’re doing.”  “This is the easiest way for me to work.” I lie. “Do you want to re-orient the boom?” I ask, knowing time is too short.  Clayton sighs. “Negative. Just talk me through what you’re doing.”  I reach across the umbilical that snakes out from the center of my chest, grab two sides of the mirror, and pull. “I’m uncoupling the faulty transmitter,” I lie again, buying myself a little more time. Despite the pure-oxygen I feel breathless. I’ve just wrecked a multi-million dollar instrument. The mirror is nothing more than the world’s most expensive sheet of tin foil. The weapon will not be demonstrated today.  “Koryo?” Clayton says, hesitantly. “What’s going on? Koryo—”  I click my VOX radio switch to OFF. As I do, I watch my umbilical go taut. Before I can react I’m jerked away from the sheet. I swipe a thickly-gloved hand, but I’m too late. “No!” I shout in the bubbled space of my helmet, the word echoing off the visor. They’re reeling me in. Too soon. I’m not finished yet.  I circle my hands around the neck of the umbilical, ready to wring it like a chicken, and twist. It separates with a smooth hiss, then snaps away from the force of the ejecting oxygen. The laws of momentum don’t care for human concerns. Despite being free, I drift lockwards, the panels of the solar arrays passing overhead. I spin one-eighty, uncap the SAFER joystick on my left forearm, and vent a high-pressure stream of nitrogen. I stop moving backwards, begin to move forwards. Nobody’s been on an untethered EVA for over thirty years, and the lack of connection to the ISS unnerves me. My stomach knots.  As I come back to the glittering sheet, I tap a couple of reverse thrusts, bring myself to rest. I don’t have much time. I know the pattern inside-out, but the suit gloves, even with their textured rubber fingertips, are unwieldy for such dexterous work. The laser is out there, closing fast.  “Do you know the story of Sadako?” you asked on one of my last visits.  I shook my head. In a quiet, whispering voice, so low I had to turn my ear to your mouth, you told me.  Sadako Sasaki was a little girl who was two years old when the atomic bomb was dropped on August 6, 1945. When the bomb exploded she was at home, a mile from Ground Zero. In time she was diagnosed with leukemia, “an atom bomb disease” as her mother called it, and eventually went to hospital to die.  You said if anyone had a right to be bitter and hateful about the bomb it was her. She wasn’t. She knew such a terrible thing should never have happened in the first place, and she decided to do her utmost to ensure it would never happen again. She vowed to make a thousand paper cranes as a symbol of peace for the world. Though she had plenty of time during her days in the hospital to fold the cranes, she lacked the paper. She used medicinal packaging, old newspapers, the wrapping of other patients’ get-well presents, and yet that wasn’t enough.  She died before she finished, but her story touched the hearts of many, and in time her vow was kept.  When you told me that story I knew I couldn’t stand and watch.  I fold the sheet in half, first across the middle, then across the diagonal. As I continue making the folds, fifty meters away I see the VASIMR plasma engines firing, the flame salmon-pink. The ISS is being moved into a higher orbit, out of harm’s way of the incoming laser. Good. You’d be the first to know that I never intended this to end violently.  The origami is almost complete. I invert fold one of the upper tips to form the long pointed beak. Next I pull back the other tip to make the upflung tail. Lastly, I gently pull the wings apart and the crane which has always been there comes to life. I make a last inspection of my creation, then satisfied, I swat it away in the direction of the orbitals.  Mama was right. Origami is a way of becoming. As I watch the crane glide off, its tapered wings cutting through an invisible sea, for the first time in a long time, I feel at peace. Stephen Gaskell is an author, games designer, and champion of science. In his recent novella, Strata, co-written with Bradley P. Beaulieu, he envisions Earth's voracious appetite for energy being sated by vast solar-mining platforms circling the sun's chromosphere. He runs the \"science-behind-the-story\" website Creepy Treehouse, and is currently finishing the first draft of a weird, ecological apocalypse thriller set in Lagos, Nigeria. He lives on England's south coast with his partner, Eloise.", "text": "2810 words, short story\nPaper Cradle\nEven though you would’ve despised the weapon, Papa, you would’ve appreciated the beauty of its creation.\nFirst, beyond Mercury, a mote of starlight is ensnared. An archipelago of steel-blue optical cavities, strung out like a chain of sapphires around the wildfire neck of the sun, pumps the trapped light much like the way you used to spin me faster and faster on the merry-go-round at Shinjuku Park. When the light is hotter than the heart of the star from which it was born, it will be flung Earthwards like a white-hot hammer from an athlete’s hands. It will leap the cold gap of space fast. Faster than you grew up? you’d ask wryly. No, not that fast, I’d admit.\nAt the same time, far above the deep-sea blue of the Pacific, above the wispy cirrus, above even the line where night becomes eternal, a parabolic mirror will unfurl. The curve of its surface is so perfect you would’ve said it had been plucked from Plato’s world. The light will strike this mirror, and then, more focused than the Buddha himself, it will laser towards a small atoll four hundred kilometers off the Chinese mainland where it will meet a pellet of frozen hydrogen. The atoms, pressed together tighter than the victims of Auschwitz, will fuse.\nThe very sky will burn in the inferno.\nOrigami comes from the words oru meaning to fold, and kami meaning paper. You told me that the first time I demanded to know how to make the paper animals that were carefully placed around our small Tokyo apartment. You sat me on your knee at our tiny kitchen table, a perfect square of paper in front of us. “First,” you said, pulling back my over eager hands, “you should recognize that every form resides in the unmade sheet.”\nI didn’t understand your words then. All I wanted was to touch the ivory paper, a treat as delicious as mochi ice cream on the tongue. Now I realize you were talking about me.\nMyself, Commander Clayton Barnes, and Mission Specialist Pavel Lenki float in the Unity module of the ISS, 360km above the Pacific Ocean.\nYou would’ve related to the mood among us. We don’t move. We don’t speak. We don’t look each other in the eye. None of us signed up to NASA, FKA, or JAXA for this. We thought the human exploration of space meant understanding spider’s webs in microgravity, testing our species’ limits, and important things like learning how to say rude words in each other’s mother tongue. Admit it, you did too. At least to begin with you did.\n“ISS, this is Darmstadt.”\n“Barnes here, Darmstadt.” Clayton knows what’s coming, but his voice doesn’t betray any emotion. “Go ahead.”\n“The phoenix is nearly ready to leave the nest. Commence deployment of the mirror.” The whole event—radio exchanges included—is being broadcast across the globe. There are cameras pointed at the sun, pointed at the ISS, pointed at the atoll. There’s even a camera pointed at us. You would’ve been disgusted by the razzmatazz, I’m sure.\n“Copy that,” Clayton replies. He nods at Pavel, who’s stationed beside a command console. The Russian taps away at the keyboard, then lets his middle and index fingers linger over the ENTER key. He doesn’t want to be party to this, but what choice does he have? His is a purely symbolic role. The instructions could easily be relayed from ISOC without his input. He hits the button.\nIn unison, we turn our heads to the bank of screens that give view onto the ISS’s exterior. On the bottom row, second screen from the left, against a backdrop of stars, a complex, folded object slips out of its cylindrical sheath. The mirror has been kept sealed until the last to protect its nanometer perfect veneer from the scarring effects of paint flakes, slag from spent solid rocket motors, cosmic rays, micrometeoroids, and the rest. Pavel taps out another command.\nYou would’ve applauded my acting skills. I keep my gaze locked on the screen, expectant. The mirror is meant to unfurl along its carefully delineated fold lines, a crystal rose blooming in the light of the sun. It doesn’t. Instead, it remains in its own embrace, motionless. It does this because two days ago, I altered a line of code in the mirror’s IO protocols.\nPavel taps away, investigating. “I don’t understand.”\nISOC comes back, a LED on one of the consoles indicating we’re on a non-public channel, now. “We’re picking up a problem with the mirror’s receiver, ISS.”\n“Yeah, I see that,” Clayton replies, skimming the error feedback on a nearby terminal. “We’ll have to abort the test, check it out.”\nThere’s a muffled sound—somebody’s hand over the mike—before ISOC speaks again. “That’s a negative, ISS.”\n“What?”\n“I repeat that’s a negative. Test must proceed. Prepare Koryo for an EVA.”\nEVA. Extravehicular activity. A spacewalk. I don’t mean it to be so visible, but I can’t help but breathe a sigh of relief. My days as an astronaut, an engineer—hell, my days as a free citizen, even—ended the moment I committed that IO file to memory. The truth would’ve come out in time. I’ve known that all along. What I didn’t know was whether they’d still go ahead with the test. The powers that be didn’t disappoint.\nYou can guess what I’m going to do, Papa, can’t you? You would’ve approved, wouldn’t you?\n“Why did Mama make animals?” I asked you when I was six. I’d been so young when she’d died that I couldn’t remember her. For me all that was left, aside from a few photos, were her paper constructions.\nYou stopped reading, peered down at me where I was folding patterned sheets. “They helped her become.”\n“Become what?”\n“Whatever she wanted. If she needed strength, she made a tiger. If she needed grace, a swan.” You bit your lip, went quiet.\nI was still too young to understand your pain, too young to know how tortuous her cancer must have been, but, despite my age, I still felt guilty that I wasn’t in her life anymore. I clung on to those figures—or the idea of them—as tightly as I would’ve hugged her if she’d still been alive.\nIt was through the origami that I got interested in space. Do you remember? I read about the Miura fold that JAXA had used to package solar panels up in the most efficient way possible. I couldn’t believe the ancient art could have such applications. Soon I was reading about weightlessness and geosynchronous orbits and space stations. Soon I knew what I wanted to do with my life.\nYou were happy for me.\n“This is bullshit.” Clayton pauses from helping me get into one of the Constellation spacesuits. We’re in Quest’s equipment lock, the cold vacuum of space beyond the crew lock in the adjacent section. I should be “camping-out”, spending eight hours in here in a reduced-nitrogen atmosphere to help lessen the chances of the bends, but the world is waiting. “You just make sure you’re well out the way when that laser arrives.”\n“I will.” The white-hot lance of coherent light is nearing its operational temperature. I’ll have about fifteen minutes to replace the receiver once I get out there. If that was what I was doing it would be plenty of time.\nI hate to deceive him. I want to tell him what I have planned, but that would put him in an uncomfortable position. Better that he doesn’t know.\nHe sighs, starts adjusting the SAFER unit on my back. The jet pack is for emergency use only; I’ll be tethered by an umbilical to the ISS.\n“Thank you, Commander,” I say through the two thin microphones of my snoopy cap after I’m fully suited up. The comms device snuggly grips my head like an aviator’s hat. I wonder if Clayton can detect the nerves in my voice. You certainly would be able to.\n“Something wrong, Koryo?”\nI shake my visored head.\nIn 2010 when I enrolled at JAXA, space-exploration had more to do with non-stick frying pans than weapons of mass destruction. Reagan’s Star Wars project, born in the hot crucible of a cold war, had been dead and buried twenty years. The loss of space shuttle Columbia during reentry in 2003 had lessened the global public’s appetite for sending men and women to the stars.\nYou asked if I really wanted to commit to something that might not exist in ten years. I said I had to hope. Then came the Deepwater Horizon disaster, and the awful pictures of seabirds trapped in thick folds of crude, beady eyes bewildered. Like sunflowers, the oil companies turned their gluttonous faces to the light. Solar harvesters became the tech that would solve our ever growing energy needs. Funding poured back into the space agencies. JAXA, NASA, and the rest enjoyed a renaissance. When I graduated you took me to that restaurant in Kibo where you said you’d used to celebrate special occasions with Mama, and we ordered tora-fugu.\n“She would be so proud,” you said, claiming it was the wasabi making your eyes filmy.\nLooking back, it seems that time of optimism, of innocence, passed faster than the time it takes to make a single fold in a piece of origami.\nOn my second expedition to the ISS I remember my sheer physical response—throat tightening, chest constricting, stomach balling—upon seeing the contents of the glove boxes. A shaved cat, wrinkled skin raw with burns. A hamster or a gerbil, bloated, eyes popped. A dead chimp, red rust globules of dried blood hanging like the fronds of a sick mobile.\nThe experiments had changed since my last trip. I pushed away, backing into one of the handover cosmonauts. “They want to know what fighting up here will be like,” she said. The skin of her face was sallow, her eyes sunken.\nI wondered what they’d have me do on my tour of duty.\n“Walk away,” you told me when I came back to Earth. “It will only worsen.”\nYou were right, but I was stubborn. I’d already folded myself, and I didn’t think I could change. I told you to stop interfering.\nAs nations stopped talking, so did we.\nCanadarm swings close, and I grab the end boom.\nBeneath my suit I feel the tendrils of cold water lace through my cooling long johns. I still feel slightly light-headed from the pure-oxygen I’m breathing, and the blue-and-white Earth looks glorious.\n“You set?” Clayton asks. He’ll be sitting in the orbiter aft flight deck, manning the control station ready to manipulate the arm, while Pavel will be next to him, controlling the camera.\n“Ready,” I say. I feel the rumble of motors through Canadarm’s hard, metal skin. The Earth slides and turns in the firmament as if a marble in the hands of a God. As the trusses of the station glide past, I think of you in your hospital bed, telling me you don’t believe in a higher power or an afterlife or a final judgment. You’d kept your illness from me. I’d kept myself from you. We had a lot of talking to do.\n“I want you to know something about your Mama,” you said, wheezing.\nI held your wrist, felt the weak pulse inside, nodded for you to go on.\n“She wasn’t born in Shikoko.”\nI didn’t understand. “She wasn’t?”\n“She was born in Honshū.” You lifted yourself up, sipped a little water. “Not far from Hiroshima.”\nI sat down in the small plastic red chair next to the bed. Mama had been born early 1946. I’d always thought both sides of my family had escaped the worst of the war. “Her cancer—”\n“We don’t know.” Your hands gripped the bed sheets, your fingers paling. “Perhaps she was lucky compared to some.”\nI delved into my handbag to fetch the paper you’d asked for—\n“—quicken it up, Koryo?”\nI snap out of the memory at Clayton’s words. I’ve drawn alongside the enfolded mirror. Sunward, parallel to the arc of the sky, I see the glint of satellites and solar farms and other orbitals. ISOC won’t like it, but my impromptu spacewalk will be beaming live across the world. In the treacle-slow way of space, I turn so that my bulk blocks line-of-sight between the ISS external cam that tracks me and the concertina’d mirror.\nClayton’s onto the mistake immediately. “Now we can’t see what you’re doing.”\n“This is the easiest way for me to work.” I lie. “Do you want to re-orient the boom?” I ask, knowing time is too short.\nClayton sighs. “Negative. Just talk me through what you’re doing.”\nI reach across the umbilical that snakes out from the center of my chest, grab two sides of the mirror, and pull. “I’m uncoupling the faulty transmitter,” I lie again, buying myself a little more time. Despite the pure-oxygen I feel breathless. I’ve just wrecked a multi-million dollar instrument. The mirror is nothing more than the world’s most expensive sheet of tin foil. The weapon will not be demonstrated today.\n“Koryo?” Clayton says, hesitantly. “What’s going on? Koryo—”\nI click my VOX radio switch to OFF. As I do, I watch my umbilical go taut. Before I can react I’m jerked away from the sheet. I swipe a thickly-gloved hand, but I’m too late. “No!” I shout in the bubbled space of my helmet, the word echoing off the visor. They’re reeling me in. Too soon. I’m not finished yet.\nI circle my hands around the neck of the umbilical, ready to wring it like a chicken, and twist. It separates with a smooth hiss, then snaps away from the force of the ejecting oxygen. The laws of momentum don’t care for human concerns. Despite being free, I drift lockwards, the panels of the solar arrays passing overhead. I spin one-eighty, uncap the SAFER joystick on my left forearm, and vent a high-pressure stream of nitrogen. I stop moving backwards, begin to move forwards. Nobody’s been on an untethered EVA for over thirty years, and the lack of connection to the ISS unnerves me. My stomach knots.\nAs I come back to the glittering sheet, I tap a couple of reverse thrusts, bring myself to rest. I don’t have much time. I know the pattern inside-out, but the suit gloves, even with their textured rubber fingertips, are unwieldy for such dexterous work. The laser is out there, closing fast.\n“Do you know the story of Sadako?” you asked on one of my last visits.\nI shook my head. In a quiet, whispering voice, so low I had to turn my ear to your mouth, you told me.\nSadako Sasaki was a little girl who was two years old when the atomic bomb was dropped on August 6, 1945. When the bomb exploded she was at home, a mile from Ground Zero. In time she was diagnosed with leukemia, “an atom bomb disease” as her mother called it, and eventually went to hospital to die.\nYou said if anyone had a right to be bitter and hateful about the bomb it was her. She wasn’t. She knew such a terrible thing should never have happened in the first place, and she decided to do her utmost to ensure it would never happen again. She vowed to make a thousand paper cranes as a symbol of peace for the world. Though she had plenty of time during her days in the hospital to fold the cranes, she lacked the paper. She used medicinal packaging, old newspapers, the wrapping of other patients’ get-well presents, and yet that wasn’t enough.\nShe died before she finished, but her story touched the hearts of many, and in time her vow was kept.\nWhen you told me that story I knew I couldn’t stand and watch.\nI fold the sheet in half, first across the middle, then across the diagonal. As I continue making the folds, fifty meters away I see the VASIMR plasma engines firing, the flame salmon-pink. The ISS is being moved into a higher orbit, out of harm’s way of the incoming laser. Good. You’d be the first to know that I never intended this to end violently.\nThe origami is almost complete. I invert fold one of the upper tips to form the long pointed beak. Next I pull back the other tip to make the upflung tail. Lastly, I gently pull the wings apart and the crane which has always been there comes to life. I make a last inspection of my creation, then satisfied, I swat it away in the direction of the orbitals.\nMama was right. Origami is a way of becoming. As I watch the crane glide off, its tapered wings cutting through an invisible sea, for the first time in a long time, I feel at peace.\nStephen Gaskell is an author, games designer, and champion of science. In his recent novella, Strata, co-written with Bradley P. Beaulieu, he envisions Earth's voracious appetite for energy being sated by vast solar-mining platforms circling the sun's chromosphere. He runs the \"science-behind-the-story\" website Creepy Treehouse, and is currently finishing the first draft of a weird, ecological apocalypse thriller set in Lagos, Nigeria. He lives on England's south coast with his partner, Eloise.", "source": "https://clarkesworldmagazine.com/gaskell_09_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Paper Cradle by Stephen Gaskell"}