{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Optz1GS4IhYjcDdJ6oWaStyLZ9g=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: A Note to End On  You might be wondering why there’s only one reprint this month. Earlier this year, I mentioned that I wanted to phase out the reprints and replace them with more original content. We’re still a good way from reaching the subscription milestone that will allow us to make that change, but we’re slowly moving in the right direction and I thought it might be nice to shake things up a little as an end-of-the-year thank-you for a great 2018.  (Next month, we’ll go back to the usual line-up, that is, unless we get a flood of new subscriptions. By the way, gift subscriptions are available from Weightless Books and clarkesworldcitizens.com.)  Something else that has me in a good mood is the first pass on the end-of-year demographics report I do. Over the years, I’ve shared bits and pieces of these reports as editorials or blog posts, but their main purpose is to help me evaluate trends and identify any potential areas that need work. I’m also a data junkie and find that it gives me a fascinating snapshot into both the field and my approach to editing.  A lot of editors rely heavily on solicited stories, which is the process of inviting known authors to write a story for a market, often with the implied guarantee of publication. Some will mix in a slush pile—open to all story submissions period—so they have the opportunity to discover someone new. With Clarkesworld, I only accept stories through the slush pile. No golden tickets. Everyone has the same opportunity. This means the quality of the slush pile is integral to the success of our magazine.  In many editorials, interviews, and blog posts I’ve emphasized the need for short fiction to embrace a more global attitude to its audience and authorship. Digital publishing and online story submissions might have opened the doors, but we—as a field—are still learning how to use these tools to reach authors and readers around the world and bring them into our ecosystems. Since 2011, we’ve been actively pursuing works in translation and that led to a partnership with Storycom to feature Chinese science fiction, which is now entering its fifth year. We’ve made progress and learned a lot, but I always wanted to do more. It wasn’t until I left my day job, nearly two years ago, that I was able to invest time in directly addressing this issue.  One of the metrics I’m tracking is the number of original stories published by authors from outside the US, UK, Canada, and Australia. Those countries have historically tended to fair reasonably well in most genre short fiction markets. From that, I remove the Chinese translations because they arrive through a different and separate sort of slush pile. What remains is a mix of English- and non-English-speaking countries. To keep it simple, let’s call it the Rest of the World (tRotW). In 2016, tRotW represented 16% of all the stories we published. It wasn’t the highest, but it was above average and likely influenced by the attention received by the translation work we had previously done. It was 14% before we started the Chinese translations.  The 2017 data was interesting but had a variety of statistical anomalies. Given the small sample size, I wasn’t entirely sure what to make of it. After expanding it to include the three months before and after, I decided there wasn’t much to worry about, but I did make notes to review for this cycle. Fortunately, the 2018 data not only eliminated some of the concerns I had, but also confirmed that the approach I’ve been taking with casting a wider net had paid off. At the end of 2018, tRotW was at 30%, nearly double the 2016 value and demonstrating continued growth over the 2017 numbers.  It seems highly unlikely that we’ll continue to see this kind of growth, but it will require sustained effort to maintain anything even close to these levels. I’m thrilled to be able to celebrate this year’s success, but my mind is already racing into 2019, identifying the gaps in tRotW, and thinking about how to reach those areas. It would also be nice if I could figure out how to replicate this so that other interested editors can do the same. Our work is far from done, so it’s probably a good thing that I love my job.  That seems like a nice note to end the year on. Enjoy the rest of December, happy holidays (should you celebrate any), and all the best in 2019! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: A Note to End On\nYou might be wondering why there’s only one reprint this month. Earlier this year, I mentioned that I wanted to phase out the reprints and replace them with more original content. We’re still a good way from reaching the subscription milestone that will allow us to make that change, but we’re slowly moving in the right direction and I thought it might be nice to shake things up a little as an end-of-the-year thank-you for a great 2018.\n(Next month, we’ll go back to the usual line-up, that is, unless we get a flood of new subscriptions. By the way, gift subscriptions are available from Weightless Books and clarkesworldcitizens.com.)\nSomething else that has me in a good mood is the first pass on the end-of-year demographics report I do. Over the years, I’ve shared bits and pieces of these reports as editorials or blog posts, but their main purpose is to help me evaluate trends and identify any potential areas that need work. I’m also a data junkie and find that it gives me a fascinating snapshot into both the field and my approach to editing.\nA lot of editors rely heavily on solicited stories, which is the process of inviting known authors to write a story for a market, often with the implied guarantee of publication. Some will mix in a slush pile—open to all story submissions period—so they have the opportunity to discover someone new. With Clarkesworld, I only accept stories through the slush pile. No golden tickets. Everyone has the same opportunity. This means the quality of the slush pile is integral to the success of our magazine.\nIn many editorials, interviews, and blog posts I’ve emphasized the need for short fiction to embrace a more global attitude to its audience and authorship. Digital publishing and online story submissions might have opened the doors, but we—as a field—are still learning how to use these tools to reach authors and readers around the world and bring them into our ecosystems. Since 2011, we’ve been actively pursuing works in translation and that led to a partnership with Storycom to feature Chinese science fiction, which is now entering its fifth year. We’ve made progress and learned a lot, but I always wanted to do more. It wasn’t until I left my day job, nearly two years ago, that I was able to invest time in directly addressing this issue.\nOne of the metrics I’m tracking is the number of original stories published by authors from outside the US, UK, Canada, and Australia. Those countries have historically tended to fair reasonably well in most genre short fiction markets. From that, I remove the Chinese translations because they arrive through a different and separate sort of slush pile. What remains is a mix of English- and non-English-speaking countries. To keep it simple, let’s call it the Rest of the World (tRotW). In 2016, tRotW represented 16% of all the stories we published. It wasn’t the highest, but it was above average and likely influenced by the attention received by the translation work we had previously done. It was 14% before we started the Chinese translations.\nThe 2017 data was interesting but had a variety of statistical anomalies. Given the small sample size, I wasn’t entirely sure what to make of it. After expanding it to include the three months before and after, I decided there wasn’t much to worry about, but I did make notes to review for this cycle. Fortunately, the 2018 data not only eliminated some of the concerns I had, but also confirmed that the approach I’ve been taking with casting a wider net had paid off. At the end of 2018, tRotW was at 30%, nearly double the 2016 value and demonstrating continued growth over the 2017 numbers.\nIt seems highly unlikely that we’ll continue to see this kind of growth, but it will require sustained effort to maintain anything even close to these levels. I’m thrilled to be able to celebrate this year’s success, but my mind is already racing into 2019, identifying the gaps in tRotW, and thinking about how to reach those areas. It would also be nice if I could figure out how to replicate this so that other interested editors can do the same. Our work is far from done, so it’s probably a good thing that I love my job.\nThat seems like a nice note to end the year on. Enjoy the rest of December, happy holidays (should you celebrate any), and all the best in 2019!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_12_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: A Note to End On by Neil Clarke"}