{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "IqusprpfDgskVF2rjz3rNvT1vLw=", "id": null, "license": null, "comments": "", "raw_text": "Interview  The Blue Collar Craftsman & the Salesmen on Mars: A Conversation with Ben Tanzer  Orphans by Ben Tanzer opens with Norrin Radd staring in a mirror. Tanzer isn’t soft-peddling a fiction workshop cliche, here. Pock-marked and shadow-boxing, Radd is pure Willie Loman from Death of a Salesman-meets-Rick Deckard of Bladerunner.  “Always be closing!”  Radd’s working himself up. Or he’s trying to, at least.  “Always be closing!”  He needs work. He needs this job. He’s broke. He’s got a family—a wife, a child. His life is “fraught with anger, pain and frustration” and “sporadic bursts of joy and peace and love.”  Earth is dismal. Baidu, formerly Chicago, is no garden of Eden. It’s not too hellish if you have a job. The homeless live in camps on the lakefront. Drones hover about making sure everyone stays where they belong.  There are echoes of Philip K. Dick, and flashes of Bradbury, Vonnegut, and Herman Melville’s “Bartleby, the Scrivener: A Story of Wall Street.”  Remember Bartleby and his “I would prefer not to”?  But these influences strobe, add color. Tanzer doesn’t linger too long, doesn’t lean too hard on his favorites. This is very much his book—a sometimes quietly beautiful, sometimes terrifyingly raw scream of desperation.  The first twenty pages of Orphans is gritty and depressing and hard to look away from.  Will space live up to Radd’s dreams? Will it solve all his problems or just cause more?  No simple answers here.  And there shouldn’t be. This guy’s too good a writer for that.  Tanzer is the author of My Father’s House, You Can Make Him Like You, 99 Problems, and Lost in Space. When he’s not out running the streets of Chicago, he’s the director of publicity and content strategy at Curbside Splendor Publishing and blogs at This Blog Will Change Your Life.   What do you enjoy about writing fiction in general and speculative fiction in particular?  The most immediate thing for me is that I’m not limited to my experiences or even my own fantasies. Fiction allows, even encourages, me to step outside my own head. I think one of the great challenges for any author is writing their way through, and out of, their own life, and what they know, sloughing off their own stories and fears and joys and finding out what else is out there they can write about. Fiction provides a bridge for accomplishing this. Or, attacking it anyway. Speculative fiction then furthers this opportunity for me in two ways. First, I am writing about worlds that don’t quite exist as I know them. They need to read like something both familiar, and yet not, just close enough to be known, or familiar, without being close enough, and so you need to stretch beyond the known, or the known known, as one former Defense Secretary who shall go unnamed might have said. So, yes, we all know what the space shuttle is, and that the space shuttles have been retired, but do we know anyone who takes one to work? And second, I have no natural connection to, or filter for, writing stories that are surreal or bizzarro, but that limits the possibilities of where the realistic fiction I want to write can go. Speculative fiction, which makes more sense to me, gives me that platform though. A robot in a surreal tale of husband and wife in a marriage gone wrong doesn’t translate for me as a writer, but a robot doorman and guide, I can see that, and I can write it.  Where did Orphans start for you?  I was out running and had this idea that I wanted to do something about a father and a son and that the father would be a salesman. I thought it could be a sort of homage to Death of a Salesman, because why aim low, right? But then I thought, maybe it shouldn’t be quite so contemporary, and maybe I should focus on trying not to repeat myself. So I thought, what if the father sold real estate on Mars, and then maybe it could be more of a mash-up of the Martian Chronicles and Glengarry Glen Ross? With his obligations to his family, he had little choice about whether to take the job? Maybe then, I could also go for a Silver Surfer vibe? And what if work in general is not really available at all anyway, but it feels like the only job available to him at all? If the near future could look like that, then the protagonist could also fly in retired space shuttles to work, have a clone replace him at home while traveling for work, and even be offered the occasional robot hand job for doing his job well.  Your dad was a painter, right? How much did his work influence you—the work itself or his creative process?  He was, and his work, and his presence, looms over this book, and much of what I’ve written. There is the dynamic of work and how the need for work can warp what families need from the worker. My father was a great dad, and a great artist, but he was also clearly conflicted by how much the family needed of him, and how this impacted his ability to embrace the selfishness any artist needs to be successful. On the other hand, because I watched him struggle to achieve the success he hoped for, I don’t doubt for a moment that I have fought being wholly immersed in the artist’s life, and in fact have always striven to have 9-5 jobs with steady paychecks, health insurance, and all the things one needs to feel stable and take care of their family. And all of that tension is built into the lead character Norrin’s anxieties as well. Finally, and connectedly, I hope, and think, is my approach to this book and anything I work on. My dad was a blue collar, craftsman, artist, who believed artists were born with a gift, but had to roll-up their sleeves and do the hard work required to be successful. I have tried to model that. I try to never be precious about time or the place I write, or search for the right music or mood, and I never wait for inspiration. I just try to work everyday, make the time, be in the moment, and seek perfection in all its messy grandiosity.  Was it fun pushing Chicago into the future, handing it over to the Corporation, and allowing it to decay around the edges?  It was fun. I should acknowledge that I tend to be more interested in the landscape inside people’s heads and how those landscapes may be decaying around the edges, but this was a lot of fun, and the threads I tried to think about in changing Chicago into Baidu were several-fold. First, if the focus is on a city that is slowly being turned into a police state, what might that look like? How would the police act and how would the citizens be controlled? So, there are helicopters endlessly moving people along, because there can be no chaos or group activity allowed. And if that same city had mortgaged its future and naming rights to some unknowable corporation and other countries such as China, what impact does that have on the culture? So, in this case for example, people constantly protest the city’s name change in the former Daley Plaza, in the same way they protested Marshall Fields becoming Macy’s.  Further, if there is no work, and no future, what does that look like? That looks in part like young people forming flash mobs to taunt the Corporation and the police that represent them. I was also influenced though by reading about this social norm in Japan where men who lose their jobs still dress in their suits, leave the house as if going to work, and then sit in the park, before returning home at dinner time like they’ve been at work all day. And so in Baidu, unemployed men wander the streets in their old suits searching for work.  Finally, I played with ideas I had about Chicago that have some pop culture or literary relevance, so for example, the salesmen of Glengarry Glen Ross appear as co-workers of Norrin’s, and he and his wife Shalla hung out on Belmont at the Dunkin’ Donuts when they were young punks, and that latter reference is based on reality, but also as an homage to the young punks in American Skin by Don DeGrazia, one of the great recent novels about an already different Chicago that’s fading into history.  I read somewhere that your early fiction was very autobiographical and that got you into writing non-fiction. So, how much of Norrin Radd is based on you?  I had this idea about Orphans, how it was going to be this rumination on fathers and sons, the intersection of family and work, and all things science fictional, Martian Chronicles, Silver Surfer and such. And I was going along and writing it, and loving it, and then one weekend I had to fly to California to co-keynote a conference for my day job. We were in the middle of some challenges at home and it felt like it was a terrible time to leave. But I left, and when I called my wife from Las Vegas where I had a layover, she sounded tired, still strong, but beat-up, and as I sat there, I asked myself why I thought it had been okay to go on this trip at all.  It was something my boss had asked me to do, and canceling would have been embarrassing for me at the organization, but did I really have to go? And did I have to say yes when my boss asked me to do so? When, and where, can we say “I prefer not to,” or “I can’t,” and if you can ask yourself that question, then maybe you have to ask yourself how much of this is also about your own ego, and need for escape and affirmation? This crept into the book, and that is how I’m like Norrin Radd. He is doing what he believes he has to do without ever quite asking whether he has to do it, or if there is another way.  Further, he is good at what he does, and he needs the affirmation that comes with doing well, and I am like that too. We both have issues with ego and neediness. We also though, both worry about hurting those we love, even when we know they are strong enough to handle what they need to deal with. Finally, we both know what it’s like to feel trapped, and not because of marriage itself, because we are both married to people we love, or by having children, because we both have children we want to devour, but by the expectations that comes with those roles, both real and imagined.  What were some of the surprises for you along the way while writing the novel?  I don’t map my books out in great detail anyway, but I always know where the story is going, and where it will end. Yet, there is a scene late in the book where the protagonist is thinking of confronting his clone, or Terrax, and reminisces about an accident his son had. In that scene which I hadn’t totally thought through beforehand, I had no plans to write about an accident, much less channel an accident my own son had, but there it was, it seemed perfect, and I ran with it.  The other kind of surprises though seem more self-serving to me, but there were ideas that I fixated on while writing that I didn’t necessarily have a reference point for, but have since become a more pronounced part of the news and culture. I had read an article in the Nation somewhere along the way about how the top one percent of the population possesses something like ninety percent of the nation’s wealth, which at the time was still a newer reality, and so I referred to these members of society in Orphans as “1-Percenters.” This was before the term “the 99 percent” had any traction however. Further, the idea to write about flash mobs protesting the Corporation emerged from a conversation I had with a writer friend of mine, but that conversation was long before Occupy Wall Street.  The characters in the book are also aware that someone, somewhere, is constantly listening to everything they say, and that is something that felt “near future” to me, but even then I cut some of that out so as to not seem too out there. Of course since then, all of the stories about the NSA have come out and now I realize I couldn’t have been excessive enough.  Which, if any, of the reviews of and comments about Orphans have baffled you? Have any of them been really far out there?  One comment was focused on whether we need another dystopic story set in Chicago. Which is a good question. I had never heard of Divergent when I first started Orphans, though I have since read it and really enjoyed it. I think we have room for multiple stories set here, though I also wonder if the need for Chicago authors to write those stories says something about what it means to actually live here.  Differently though, two reviews commented on the role of family in the book which did catch me off-guard. One review, which was generally positive, implied that I was suggesting that the creation and maintenance of traditional families is of the highest import. I don’t think I meant to imply that, nor do I think I remotely feel like that, but I do need to think about that now.  Somewhat similarly, another review suggested that since the protagonist is conflicted about being away from his wife so he can provide for the family, and she is unhappy that he has to, I was in essence suggesting that future looks like the 1950’s, but with space travel. Again, I don’t think I intended that, but I definitely need to think about it now. So arguably, nothing too out there, sadly, because that would be fun, though there is now an endless need for self-examination looming in my own near future for sure.  Also, I’m curious as to whether you think University of Chicago has shaped your thinking in a significant way? Seems to me that that place trains minds in a very specific way of thinking.  I went to University of Chicago for graduate school in social work. I had been out of school for several years and I hadn’t started attempting to be a writer yet. I had done very well on written assignments throughout high school, where I didn’t do well otherwise, and college, where I did. I say all that because I assumed I would be up to the task of writing good, thoughtful papers in graduate school as well. But I wasn’t. I was terrible, and I couldn’t figure out how to get untracked for most of the first quarter.  One of my professors that quarter suggested I take an extracurricular undergraduate writing workshop called the Little Red Schoolhouse and I was offended by the suggestion. Why I was offended seems ridiculous to me now, but there is that whole ego thing. Anyway, I took the course my second year because I had a thesis I had to write, and the experience was transformative for me. I still hadn’t started writing yet outside of school work, and I wouldn’t for some time, but all of the endless best practices I learned in that workshop I still use today. For example, what you write always makes sense in your head, but that doesn’t mean it will to anyone else, which is why you have to let other people read your drafts.  This is basic stuff for most writers I’m sure, but it was new to me, and nothing I had ever thought about before The best thing I learned though, was don’t edit a first draft until you are entirely done with it, and I still apply that rule to everything from essays to novels, no pause, no looking back, no getting stuck, just keep going until you’re done. Which has served me really well, despite the ten years of student loans I had to pay-off to learn these lessons in the first place.  You’ve mentioned some of the inspirations for and influences on this book. Could you go into a little more detail about some of the speculative fiction that inspired and inspires you?  I’m glad you asked, and not because these inspirations necessarily directly influenced this book, but because there’s so much speculative fiction I love, especially when I was younger and these books were so wonderfully, and necessarily, escapist for me. So, along with The Martian Chronicles, there is also Bradbury’s The Illustrated Man, which was very popular in my house because my father was also a tattoo artist for a time. The John Carter Warlord of Mars series by Edgar Rice Burroughs was huge. I read those books again and again, and I loved some of the more obscure Burroughs pulp fiction as well, for example The Mucker and Pellucidar. Later when I was in college I had the opportunity to take a science fiction class and got to read The Foundation Trilogy by Asimov for the first time, which just crushed me, and Dune, though I’m, not sure how I got so far not reading it, The Handmaiden’s Tale, which was so beautiful and horrible. I also think some of Vonnegut, who I consumed voraciously too, certainly qualifies, say Cat’s Cradle for example. Recently, someone was kind of enough to compare Orphans to How to Live Safely in a Science Fictional Universe by Charles Yu, which I hadn’t read, but since have, and it was terrific, just so knowing and smart. A friend of mine, Peter Tieryas Liu, just had his novel Bald New World, come out, and I’m just into it, but it’s terrific as well. Beyond the literary though, I should definitely give a shout-out to The Twilight Zone, which I was obsessive about, Logan’s Run, Escape from New York, Star Wars, and Blade Runner, which just blew me away, and unlike some of these other loves of mine, certainly had a tonal impact on Orphans.  What’s next for this world and these people and you as a writer?  This is grandiose of me, possibly obnoxious, you be the judge, but I always saw Orphans as a trilogy of sorts, where the first book would be from the father’s perspective, the second from the mother’s, and the third from the son’s. And so I have started working on a sequel titled Foundlings written from Shalla’s point of view and right now it’s got a road trip vibe, and is feeling like a mash-up of the Wizard of Oz and the Odyssey, but with robots and clones and time travel. We’ll see. I also have a novel titled Ballad I’m working on about teenage girl drug dealer and alien abduction. And I’m thrilled to let you know that I just had an essay collection come out which I focused on fatherhood as viewed through the lens of Star Wars, NAS, Mad Men, Patrick Ewing, and Vanilla Ice, among other things. It’s titled Lost in Space, and I think that everyone may just want to buy it right now, well Lost in Space, and Orphans, both. Is that a selfish request? Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nThe Blue Collar Craftsman & the Salesmen on Mars: A Conversation with Ben Tanzer\nOrphans by Ben Tanzer opens with Norrin Radd staring in a mirror. Tanzer isn’t soft-peddling a fiction workshop cliche, here. Pock-marked and shadow-boxing, Radd is pure Willie Loman from Death of a Salesman-meets-Rick Deckard of Bladerunner.\n“Always be closing!”\nRadd’s working himself up. Or he’s trying to, at least.\n“Always be closing!”\nHe needs work. He needs this job. He’s broke. He’s got a family—a wife, a child. His life is “fraught with anger, pain and frustration” and “sporadic bursts of joy and peace and love.”\nEarth is dismal. Baidu, formerly Chicago, is no garden of Eden. It’s not too hellish if you have a job. The homeless live in camps on the lakefront. Drones hover about making sure everyone stays where they belong.\nThere are echoes of Philip K. Dick, and flashes of Bradbury, Vonnegut, and Herman Melville’s “Bartleby, the Scrivener: A Story of Wall Street.”\nRemember Bartleby and his “I would prefer not to”?\nBut these influences strobe, add color. Tanzer doesn’t linger too long, doesn’t lean too hard on his favorites. This is very much his book—a sometimes quietly beautiful, sometimes terrifyingly raw scream of desperation.\nThe first twenty pages of Orphans is gritty and depressing and hard to look away from.\nWill space live up to Radd’s dreams? Will it solve all his problems or just cause more?\nNo simple answers here.\nAnd there shouldn’t be. This guy’s too good a writer for that.\nTanzer is the author of My Father’s House, You Can Make Him Like You, 99 Problems, and Lost in Space. When he’s not out running the streets of Chicago, he’s the director of publicity and content strategy at Curbside Splendor Publishing and blogs at This Blog Will Change Your Life.\nWhat do you enjoy about writing fiction in general and speculative fiction in particular?\nThe most immediate thing for me is that I’m not limited to my experiences or even my own fantasies. Fiction allows, even encourages, me to step outside my own head. I think one of the great challenges for any author is writing their way through, and out of, their own life, and what they know, sloughing off their own stories and fears and joys and finding out what else is out there they can write about. Fiction provides a bridge for accomplishing this. Or, attacking it anyway. Speculative fiction then furthers this opportunity for me in two ways. First, I am writing about worlds that don’t quite exist as I know them. They need to read like something both familiar, and yet not, just close enough to be known, or familiar, without being close enough, and so you need to stretch beyond the known, or the known known, as one former Defense Secretary who shall go unnamed might have said. So, yes, we all know what the space shuttle is, and that the space shuttles have been retired, but do we know anyone who takes one to work? And second, I have no natural connection to, or filter for, writing stories that are surreal or bizzarro, but that limits the possibilities of where the realistic fiction I want to write can go. Speculative fiction, which makes more sense to me, gives me that platform though. A robot in a surreal tale of husband and wife in a marriage gone wrong doesn’t translate for me as a writer, but a robot doorman and guide, I can see that, and I can write it.\nWhere did Orphans start for you?\nI was out running and had this idea that I wanted to do something about a father and a son and that the father would be a salesman. I thought it could be a sort of homage to Death of a Salesman, because why aim low, right? But then I thought, maybe it shouldn’t be quite so contemporary, and maybe I should focus on trying not to repeat myself. So I thought, what if the father sold real estate on Mars, and then maybe it could be more of a mash-up of the Martian Chronicles and Glengarry Glen Ross? With his obligations to his family, he had little choice about whether to take the job? Maybe then, I could also go for a Silver Surfer vibe? And what if work in general is not really available at all anyway, but it feels like the only job available to him at all? If the near future could look like that, then the protagonist could also fly in retired space shuttles to work, have a clone replace him at home while traveling for work, and even be offered the occasional robot hand job for doing his job well.\nYour dad was a painter, right? How much did his work influence you—the work itself or his creative process?\nHe was, and his work, and his presence, looms over this book, and much of what I’ve written. There is the dynamic of work and how the need for work can warp what families need from the worker. My father was a great dad, and a great artist, but he was also clearly conflicted by how much the family needed of him, and how this impacted his ability to embrace the selfishness any artist needs to be successful. On the other hand, because I watched him struggle to achieve the success he hoped for, I don’t doubt for a moment that I have fought being wholly immersed in the artist’s life, and in fact have always striven to have 9-5 jobs with steady paychecks, health insurance, and all the things one needs to feel stable and take care of their family. And all of that tension is built into the lead character Norrin’s anxieties as well. Finally, and connectedly, I hope, and think, is my approach to this book and anything I work on. My dad was a blue collar, craftsman, artist, who believed artists were born with a gift, but had to roll-up their sleeves and do the hard work required to be successful. I have tried to model that. I try to never be precious about time or the place I write, or search for the right music or mood, and I never wait for inspiration. I just try to work everyday, make the time, be in the moment, and seek perfection in all its messy grandiosity.\nWas it fun pushing Chicago into the future, handing it over to the Corporation, and allowing it to decay around the edges?\nIt was fun. I should acknowledge that I tend to be more interested in the landscape inside people’s heads and how those landscapes may be decaying around the edges, but this was a lot of fun, and the threads I tried to think about in changing Chicago into Baidu were several-fold. First, if the focus is on a city that is slowly being turned into a police state, what might that look like? How would the police act and how would the citizens be controlled? So, there are helicopters endlessly moving people along, because there can be no chaos or group activity allowed. And if that same city had mortgaged its future and naming rights to some unknowable corporation and other countries such as China, what impact does that have on the culture? So, in this case for example, people constantly protest the city’s name change in the former Daley Plaza, in the same way they protested Marshall Fields becoming Macy’s.\nFurther, if there is no work, and no future, what does that look like? That looks in part like young people forming flash mobs to taunt the Corporation and the police that represent them. I was also influenced though by reading about this social norm in Japan where men who lose their jobs still dress in their suits, leave the house as if going to work, and then sit in the park, before returning home at dinner time like they’ve been at work all day. And so in Baidu, unemployed men wander the streets in their old suits searching for work.\nFinally, I played with ideas I had about Chicago that have some pop culture or literary relevance, so for example, the salesmen of Glengarry Glen Ross appear as co-workers of Norrin’s, and he and his wife Shalla hung out on Belmont at the Dunkin’ Donuts when they were young punks, and that latter reference is based on reality, but also as an homage to the young punks in American Skin by Don DeGrazia, one of the great recent novels about an already different Chicago that’s fading into history.\nI read somewhere that your early fiction was very autobiographical and that got you into writing non-fiction. So, how much of Norrin Radd is based on you?\nI had this idea about Orphans, how it was going to be this rumination on fathers and sons, the intersection of family and work, and all things science fictional, Martian Chronicles, Silver Surfer and such. And I was going along and writing it, and loving it, and then one weekend I had to fly to California to co-keynote a conference for my day job. We were in the middle of some challenges at home and it felt like it was a terrible time to leave. But I left, and when I called my wife from Las Vegas where I had a layover, she sounded tired, still strong, but beat-up, and as I sat there, I asked myself why I thought it had been okay to go on this trip at all.\nIt was something my boss had asked me to do, and canceling would have been embarrassing for me at the organization, but did I really have to go? And did I have to say yes when my boss asked me to do so? When, and where, can we say “I prefer not to,” or “I can’t,” and if you can ask yourself that question, then maybe you have to ask yourself how much of this is also about your own ego, and need for escape and affirmation? This crept into the book, and that is how I’m like Norrin Radd. He is doing what he believes he has to do without ever quite asking whether he has to do it, or if there is another way.\nFurther, he is good at what he does, and he needs the affirmation that comes with doing well, and I am like that too. We both have issues with ego and neediness. We also though, both worry about hurting those we love, even when we know they are strong enough to handle what they need to deal with. Finally, we both know what it’s like to feel trapped, and not because of marriage itself, because we are both married to people we love, or by having children, because we both have children we want to devour, but by the expectations that comes with those roles, both real and imagined.\nWhat were some of the surprises for you along the way while writing the novel?\nI don’t map my books out in great detail anyway, but I always know where the story is going, and where it will end. Yet, there is a scene late in the book where the protagonist is thinking of confronting his clone, or Terrax, and reminisces about an accident his son had. In that scene which I hadn’t totally thought through beforehand, I had no plans to write about an accident, much less channel an accident my own son had, but there it was, it seemed perfect, and I ran with it.\nThe other kind of surprises though seem more self-serving to me, but there were ideas that I fixated on while writing that I didn’t necessarily have a reference point for, but have since become a more pronounced part of the news and culture. I had read an article in the Nation somewhere along the way about how the top one percent of the population possesses something like ninety percent of the nation’s wealth, which at the time was still a newer reality, and so I referred to these members of society in Orphans as “1-Percenters.” This was before the term “the 99 percent” had any traction however. Further, the idea to write about flash mobs protesting the Corporation emerged from a conversation I had with a writer friend of mine, but that conversation was long before Occupy Wall Street.\nThe characters in the book are also aware that someone, somewhere, is constantly listening to everything they say, and that is something that felt “near future” to me, but even then I cut some of that out so as to not seem too out there. Of course since then, all of the stories about the NSA have come out and now I realize I couldn’t have been excessive enough.\nWhich, if any, of the reviews of and comments about Orphans have baffled you? Have any of them been really far out there?\nOne comment was focused on whether we need another dystopic story set in Chicago. Which is a good question. I had never heard of Divergent when I first started Orphans, though I have since read it and really enjoyed it. I think we have room for multiple stories set here, though I also wonder if the need for Chicago authors to write those stories says something about what it means to actually live here.\nDifferently though, two reviews commented on the role of family in the book which did catch me off-guard. One review, which was generally positive, implied that I was suggesting that the creation and maintenance of traditional families is of the highest import. I don’t think I meant to imply that, nor do I think I remotely feel like that, but I do need to think about that now.\nSomewhat similarly, another review suggested that since the protagonist is conflicted about being away from his wife so he can provide for the family, and she is unhappy that he has to, I was in essence suggesting that future looks like the 1950’s, but with space travel. Again, I don’t think I intended that, but I definitely need to think about it now. So arguably, nothing too out there, sadly, because that would be fun, though there is now an endless need for self-examination looming in my own near future for sure.\nAlso, I’m curious as to whether you think University of Chicago has shaped your thinking in a significant way? Seems to me that that place trains minds in a very specific way of thinking.\nI went to University of Chicago for graduate school in social work. I had been out of school for several years and I hadn’t started attempting to be a writer yet. I had done very well on written assignments throughout high school, where I didn’t do well otherwise, and college, where I did. I say all that because I assumed I would be up to the task of writing good, thoughtful papers in graduate school as well. But I wasn’t. I was terrible, and I couldn’t figure out how to get untracked for most of the first quarter.\nOne of my professors that quarter suggested I take an extracurricular undergraduate writing workshop called the Little Red Schoolhouse and I was offended by the suggestion. Why I was offended seems ridiculous to me now, but there is that whole ego thing. Anyway, I took the course my second year because I had a thesis I had to write, and the experience was transformative for me. I still hadn’t started writing yet outside of school work, and I wouldn’t for some time, but all of the endless best practices I learned in that workshop I still use today. For example, what you write always makes sense in your head, but that doesn’t mean it will to anyone else, which is why you have to let other people read your drafts.\nThis is basic stuff for most writers I’m sure, but it was new to me, and nothing I had ever thought about before The best thing I learned though, was don’t edit a first draft until you are entirely done with it, and I still apply that rule to everything from essays to novels, no pause, no looking back, no getting stuck, just keep going until you’re done. Which has served me really well, despite the ten years of student loans I had to pay-off to learn these lessons in the first place.\nYou’ve mentioned some of the inspirations for and influences on this book. Could you go into a little more detail about some of the speculative fiction that inspired and inspires you?\nI’m glad you asked, and not because these inspirations necessarily directly influenced this book, but because there’s so much speculative fiction I love, especially when I was younger and these books were so wonderfully, and necessarily, escapist for me. So, along with The Martian Chronicles, there is also Bradbury’s The Illustrated Man, which was very popular in my house because my father was also a tattoo artist for a time. The John Carter Warlord of Mars series by Edgar Rice Burroughs was huge. I read those books again and again, and I loved some of the more obscure Burroughs pulp fiction as well, for example The Mucker and Pellucidar. Later when I was in college I had the opportunity to take a science fiction class and got to read The Foundation Trilogy by Asimov for the first time, which just crushed me, and Dune, though I’m, not sure how I got so far not reading it, The Handmaiden’s Tale, which was so beautiful and horrible. I also think some of Vonnegut, who I consumed voraciously too, certainly qualifies, say Cat’s Cradle for example. Recently, someone was kind of enough to compare Orphans to How to Live Safely in a Science Fictional Universe by Charles Yu, which I hadn’t read, but since have, and it was terrific, just so knowing and smart. A friend of mine, Peter Tieryas Liu, just had his novel Bald New World, come out, and I’m just into it, but it’s terrific as well. Beyond the literary though, I should definitely give a shout-out to The Twilight Zone, which I was obsessive about, Logan’s Run, Escape from New York, Star Wars, and Blade Runner, which just blew me away, and unlike some of these other loves of mine, certainly had a tonal impact on Orphans.\nWhat’s next for this world and these people and you as a writer?\nThis is grandiose of me, possibly obnoxious, you be the judge, but I always saw Orphans as a trilogy of sorts, where the first book would be from the father’s perspective, the second from the mother’s, and the third from the son’s. And so I have started working on a sequel titled Foundlings written from Shalla’s point of view and right now it’s got a road trip vibe, and is feeling like a mash-up of the Wizard of Oz and the Odyssey, but with robots and clones and time travel. We’ll see. I also have a novel titled Ballad I’m working on about teenage girl drug dealer and alien abduction. And I’m thrilled to let you know that I just had an essay collection come out which I focused on fatherhood as viewed through the lens of Star Wars, NAS, Mad Men, Patrick Ewing, and Vanilla Ice, among other things. It’s titled Lost in Space, and I think that everyone may just want to buy it right now, well Lost in Space, and Orphans, both. Is that a selfish request?\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/tanzer_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Blue Collar Craftsman & the Salesmen on Mars: A Conversation with Ben Tanzer by Jeremy L. C. Jones"}