{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Garth Nix", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "5RZ8n00Kd1J9aRt1e8iXfH+xrHY=", "id": null, "license": null, "comments": "", "raw_text": "3210 words, short story, REPRINT  Old Friends  I’d been living in the city for quite a while, lying low, recovering from an unfortunate jaunt that had turned, in the immortal words of my sometime comrade Hrasvelg, “irredeemably shit-shape.”  Though I had almost completely recovered my sight, I still wore a bandage around my eyes. It was made from a rare stuff that I could see through, but it looked like dense black linen. Similarly, I had regrown my left foot, but I kept up the limp. It gave me an additional excuse to use the stick, which was of course, much more than a length of bog oak carved with picaresque scenes of a pedlar’s journey.  I had a short lease apartment near the beach, an expensive but necessary accommodation, as I needed both the sunshine that fell into its small living room, and the cool, wet wind from the sea that blew through every open window.  Unfortunately, after the first month, that wind became laden with the smell of rotting weed and as the weeks passed, the stench grew stronger, and the masses of weed that floated just past the breakers began to shift and knit together, despite the efforts of the lifesavers to break up the unsightly, stinking rafts of green.  I knew what was happening, of course. The weed was a manifestation of an old opponent of mine, a slow, cold foe who had finally caught up with me. ‘Caught’ being the operative word, as the weed was just the visible portion of my enemy’s activities. A quick examination of almanac and lodestone revealed that all known pathways from this world were denied to me, shut tight by powerful bindings that I could not broach quickly, if at all.  I considered moving to the mountains or far inland, but that would merely delay matters. Only the true desert would be safe from my foe, but I could not go there.  So I watched the progress of the weed every morning as I drank my first coffee, usually leaning back in one white plastic chair as I elevated my supposedly injured leg on another. The two chairs were the only furniture in the apartment. I slept in the bath, which I had lined with sleeping moss, which was comfortable, sweet-smelling, and also massaged out the cares of the day with its tiny rhizoids.  The day before I adjudged the weed would reach its catalytic potential and spawn servitors, I bought not just my usual black coffee from the café downstairs, but also a triple macchiato that came in a heavy, heat-resistant glass. Because I lived upstairs they always gave me proper cups. The barista who served me, a Japanese guy who worked the espresso machine mornings and surfed all afternoon, put the coffees in a cardboard holder meant for takeaways and said, “Got a visitor today?”  “Not yet,” I said. “But I will have shortly. By the way, I wouldn’t go surfing here this afternoon . . . or tomorrow.”  “Why not?”  “That weed,” I replied. “It’s toxic. Try another beach.”  “How do you know?” he asked as he slid the tray into my waiting fingers. “I mean, you can’t . . . ”  “I can’t see it,” I said, as I backed away, turned, and started tapping towards the door. “But I can smell it. It’s toxic all right. Stay clear.”  “OK, thanks. Uh, enjoy the coffee.”  I slowly made my way upstairs, and set the coffees down on the floor. My own cup in front of one white chair, and the macchiato at the foot of the other. I wouldn’t be resting my limb on the spare chair today.  I had to wait a little while for the breeze to come up, but as it streamed through the room and teased at the hair I should have had cut several weeks before, I spoke.  “Hey, Anax. I bought you a coffee.”  The wind swirled around my head, changing direction 270 degrees, blowing out the window it had come in by and in by the window it had been going out. I felt the floor tremble under my feet and experienced a brief dizziness.  Anax, proper name Anaxarte, was one of my oldest friends. We’d grown up together and had served together in two cosmically fucked-up wars, one of which was still slowly bleeding its way to exhaustion in fits and starts, though the original two sides were long out of it.  I hadn’t seen Anax for more than thirty years, but we scribbled notes to each other occasionally, and had spoken twice in that time. We talked a lot about meeting up, maybe organizing a fishing expedition with some of the old lads, but it had never come together.  I knew that if he were able to, he would always answer my call. So as the coffee cooled, and the white plastic chair lay vacant, my heart chilled, and I began to grieve. Not for the loss of Anax’s help against the enemy, but because another friend had fallen.  I sat in the sunshine for an hour, the warmth a slight comfort against the melancholy that had crept upon me. At the hour’s end, the wind shifted again, roiling around me counter-clockwise till it ebbed to a total calm.  Even without the breeze, I could smell the weed. It had a malignant, invasive odor, the kind that creeps through sealed plastic bags and airtight lids, the smell of decay and corruption.  My options were becoming limited. I took up my stick and went downstairs once more to the café. The afternoon barista did not know me, though I had seen her often enough through my expansive windows. She did not comment on my order, though I doubt she was often asked for a soy latte with half poured out after it was made, to be topped up again with cold regular milk.  Upstairs, I repeated the summoning, this time with the chill already present, a cold presence of somber expectation lodged somewhere between my heart and ribs.  “Balan,” I called softly. “Balan, your luke-warm excuse for a drink is ready.”  The wind came up and carried my words away, but as before, there was no reply, no presence in the empty chair. I waited the full hour to be sure, then poured the congealed soy drink down the sink.  I could see the weed clearly in the breakers now. It was almost entirely one huge, long clump that spanned the length of the beach. The lifesavers had given up trying to break it apart with their jetskis and zodiac inflatables, and there were two ‘Beach Closed’ signs stuck in the sand, twenty meters apart. Not that anyone was swimming. The beach was almost empty. The reek of the weed had driven away everyone but a sole lifesaver serving out her shift, and a fisherman who was dolefully walking along in search of a weed-free patch of sea.  “Two of my old friends taken,” I whispered to the sun, my lips dry, my words heavy. We had never thought much about our futures, not when we were fighting in the war, or later when we had first escaped our service. The present was our all, our time the now. None of us knew what lay ahead.  For the third time, I trod my careful way downstairs. There were a dozen people outside the café, a small crowd which parted to allow me passage, with muffled whispers about blindness and letting the sightless man past.  The crowd was watching the weed, while trying not to smell it.  “There, that bit came right out of the water!”  “It kind of looks alive!”  “Must be creating a gas somehow, the decomposition . . . ”  “ . . . check out those huge nodules lifting up . . . ”  “. . . a gas, methane, maybe. Or hydrogen sulphide . . . nah . . . I’m just guessing. Someone will know . . . ”  As I heard the excited comments I knew that I had mistimed my calls for assistance. The weed was very close to catalysis and would soon spawn its servitors, who would come ashore in search of their target.  I had meant to ask the owner of the café, a short, bearded man who was always called “Mister Jeff” by the staff, if he could give me a glass of brandy, or at a pinch, whiskey. A fine armagnac would be best, but I doubted they’d have any of that. The café had no liquor license but I knew there was some spirituous alcohol present, purely for Jeff’s personal use, since I’d smelled it on his breath often enough.  But as I said, it was too late for that. Palameides might have answered to a double brandy, but I secretly knew that he too must have succumbed. It had been too long since his last missive, and I accounted it one of my failings that I had not been in touch to see where he was, and if all was well with him.  “Someone should do something about that weed,” complained a thickset young man who habitually double-parked his low-slung sports car outside the café around this time. “It really stinks.”  “It will be gone by morning,” I said. I hadn’t meant to use the voice of prophecy, but my words rang out, harsh and bronze, stopping all other conversation.  Everyone looked at me, from inside and outside the café. Even the dog who had been asleep next to one of the outside tables craned his neck to look askance. All was silent, the silence of an embarrassed audience who wished they were elsewhere without knowing why, and were fearful about what was going to come next.  “I am a . . . biologist,” I said in my normal tones. “The weed is a known phenomenon. It will disperse overnight.”  The silence continued for a few seconds, then normal service resumed, at a lower volume. Even the double-parking guy was more subdued.  I spoke the truth. One way or another, the weed would be gone, and likely enough, I would be gone with it.  As the afternoon progressed, the stench grew much worse. The café was shut, staff and customers retreating to better-smelling climes. Around five o’clock, nearby residents began to leave as well, at the same time the Fire Brigade, the Water Board, the police, and several television crews arrived.  An hour after that, only the firefighters remained, and they were wearing breathing apparatus as they went from door to door, checking that everyone had left. Farther afield, way down the northern end of the beach, I could see the television crews interviewing someone who was undoubtedly an expert trying to explain why the noxious odors were so localized, and dissipated so quickly when you got more than three hundred meters from the center of the beach.  The “DO NOT CROSS” tapes with the biohazard trefoils got rolled out just before dusk, across the street about eighty meters up from my apartment. The firefighters had knocked at my door and called out, gruff voices muffled by masks, but I had not answered. They could probably have seen me from the beach, but no one was heading closer to the smell, however well-protected they might be. The sea was bubbling and frothing with noxious vapors, and weedy nodules the size of restaurant refrigerators were bobbing up and down upon the waves. After a while the nodules began to detach from the main mass of weed and the waves carried them in like lost surfboards, tendrils of weed trailing behind them, reminiscent of broken leg-ropes.  I watched the nodules as the sun set behind the city, mentally mapping where they were drifting ashore. When the sun was completely gone, the streetlights and the high lamps that usually lit the beach didn’t come on, but that didn’t matter much to me. Darkness wasn’t so much my friend as a close relative.  The lack of artificial light caused a commotion among the HAZMAT teams though, particularly when they couldn’t get their portable generators and floodlights to work, and the one engine they sent down the street choked and stalled before it had even pulled away from the curb.  I had counted thirteen nodules, but more could be out in the weed mass, or so low in the water I’d missed them. My enemy was not underestimating me, or had presumed I would be able to call upon assistance.  I had presumed I would be able to call upon assistance, a foolish presumption built upon old camaraderie, of long-ago dangers shared, of the maintenance of a continuum. I had not thought that my friends, having survived our two wars, could have had a full stop put to their existence in more mundane environments, or at least not so soon. Which meant that they had met the same fate that now threatened to be mine.  “Anax, Balan, Palameides,” I whispered. By now there would be three new death-trees laid out in a nice row in the arboreal necropolis, with those nameplates at their feet. There was probably a Nethinim carving my name onto a plaque right now, and readying a sapling. They always knew beforehand, the carriers of water and hewers of wood.  I dismissed this gloomy thought. If my time had come, it had come, but I would not wait in a dark apartment, to acquiesce to my fate like a senescent king grown too tired and toothless to act against his assassins.  I took off the blindfold and tied it around my neck, returning it to its original use as a scarf. It became my only item of apparel as I shucked white cotton trousers, white T-shirt and underwear.  The stick I gently broke across my knee, sliding the two lengths of wood apart to reveal the sword within. I took the weapon up and made the traditional salute towards my enemies on the beach.  Courtesies complete, I shaded my skin, hair and eyes dark, a green almost heavy enough to match the blackness of the night, and with a moment’s concentration, grew a defensive layer of young bark, being careful not to over-do it, while overlaying the sheaths in such a way that it would not limit my movement. Novices often made the mistake of armoring up too much, and found themselves extraordinarily tough but essentially sessile. I had not made that mistake since my distant youth.  The wind lifted a little, and the stink of the weed changed, becoming more fragrant. I heard thirteen soft popping noises come from the beach, and knew that the nodules were opening.  There was little point in dragging things out, so I simply walked down the street to the beach, pausing to bid a silent farewell to the café. Their coffee had been quite good.  I paused at the promenade railing, near the block of stone surmounted by the bronze mermaid, and looked across the beach. There was a little starlight, though no moon, and I thought both sea and sand had never looked prettier. The humans should turn the lights off more often, though even then they would not see the way I saw.  The thirteen had emerged from their nodules, or perhaps I should call them pods. Now that I saw them clearly, I knew I had even less chance than I’d thought. I had expected the blocky, bad imitations of human women that looked like Bulgarian weightlifters, armed with slow, two-handed axes that though devastating when they hit, were fairly unlikely to do so provided I didn’t make a mistake.  But my enemy had sent a much superior force, testament I suppose to the number of times I had defeated or evaded previous attempts to curtail my activities. This time they were indeed what long-gone inhabitants of this world had called Valkyries: female human in form, tall, long-limbed, and very fast, and the sensing tendrils that splayed back from their heads could easily be mistaken for a wing’d helmet, as their rust-colored exoskeleton extrusions could look like armor.  They lifted their hatchets—twenty-six of them, as they held one in each hand—when they saw me, and offered the salute. I returned the greeting and waited for the eldest of them (by a matter of seconds, most like) to offer up the obligatory statement, which also served as a disclaimer, thrust all liability for collateral damage upon me and usually offered a chance to surrender.  “Skrymir, renegade, oathbreaker, and outcast!”  I inclined my head.  “Called to return eight times; sent for, six times.”  Had it been so many? I’d lost count. Too many years, across too many worlds.  “Surrender your sword!”  I shook my head, and the valkyries attacked before I could even straighten my neck, running full-tilt at the seawall that bordered the promenade. Six stopped short before the wall and six leaped upon their backs to vault the railing, while the last, the senior, stood behind in a position of command.  I lopped two heads as I fell back, the valkyries concerned momentarily confused as their major sensory apparatus went bouncing back down to the sand. As per their imprinting, they stopped still and if it had not been for the others I could have felled them then. But the others were there, attacking me from all sides as I danced and spun back to the road, my sword meeting the helves of their hatchets, nicking at their fibrous flesh, but their weapons in turn carved long splinters from my body.  If they could surround me, I would be done for, so I fought as I had not fought since the wars. I twisted and leaped and slid under parked cars and over them, around rubbish bins and flagpoles, changing my sword from left hand to right hand, kicking, butting, deploying every trick and secret that I knew.  It was not enough. A skilled and vicious blow caught my knee as I took off another head, and in the second I was down, a dozen other blows put paid to my legs. I rolled and writhed away, but it was to no avail. The valkyries pinned me down and began to chop away.  The last memory I have from that expression of myself was of the starry sky, the sound of the surf a deeper counterpoint to the thud of axework, and the blessed smell of fresh salt air, the stench of that particular rotten weed gone forever.  I cannot smell anything where I am now, nor see. I can sense light and shade, the movement of air, the welcome sensation of moisture on my extremities, whether above or below the earth.  Neither can I speak, save in a very limited fashion, the conveyance of some slight meaning without words.  But I am not alone.  Palameides is here, and Balan, and Anax too. They have grown tall, and overshadow me, but this will not last. I will grow mighty once more, and one day, They will have need of us again . . . and then, as we whisper, tapping with our roots, signaling with the rustle of our leaves, then our hearts will bud new travelers, and we shall go forth to do the bidding of our masters, and perhaps, for as long as we can, we four friends shall once again be free.    Originally published in Dreaming Again, edited by Jack Dann, 2008. New York Times bestselling Australian writer Garth Nix worked as a book publicist, editor, marketing consultant, public relations man, and literary agent before launching the best-selling \"Old Kingdom\" series, which consists of Sabriel, Lirael: Daughter of the Clayr, Abhorsen, and The Creature in the Case. His other books include the \"Seventh Tower\" series, consisting of The Fall, Castle, Aenir, Above the Veil, Into Battle, and The Violet Keystone, the \"Keys to the Kingdom\" series, consisting of Mister Monday, Grim Tuesday, Drowned Wednesday, Sir Thursday, Lady Friday, Superior Saturday, and Lord Sunday, as well as stand-alone novels such as The Ragwitch and Shade's Children. His short fiction has been collected in Across the Wall: Tales of the Old Kingdom and Beyond. His most recent book are two novels written with Sean Williams, Troubletwisters: The Mystery and Troubletwisters: The Monster, a new standalone novel, A Confusion of Princes, and a new collection, Sir Hereward and Master Fitz: Three Adventures. Born in Melbourne, he now lives in Sydney, Australia.", "text": "3210 words, short story, REPRINT\nOld Friends\nI’d been living in the city for quite a while, lying low, recovering from an unfortunate jaunt that had turned, in the immortal words of my sometime comrade Hrasvelg, “irredeemably shit-shape.”\nThough I had almost completely recovered my sight, I still wore a bandage around my eyes. It was made from a rare stuff that I could see through, but it looked like dense black linen. Similarly, I had regrown my left foot, but I kept up the limp. It gave me an additional excuse to use the stick, which was of course, much more than a length of bog oak carved with picaresque scenes of a pedlar’s journey.\nI had a short lease apartment near the beach, an expensive but necessary accommodation, as I needed both the sunshine that fell into its small living room, and the cool, wet wind from the sea that blew through every open window.\nUnfortunately, after the first month, that wind became laden with the smell of rotting weed and as the weeks passed, the stench grew stronger, and the masses of weed that floated just past the breakers began to shift and knit together, despite the efforts of the lifesavers to break up the unsightly, stinking rafts of green.\nI knew what was happening, of course. The weed was a manifestation of an old opponent of mine, a slow, cold foe who had finally caught up with me. ‘Caught’ being the operative word, as the weed was just the visible portion of my enemy’s activities. A quick examination of almanac and lodestone revealed that all known pathways from this world were denied to me, shut tight by powerful bindings that I could not broach quickly, if at all.\nI considered moving to the mountains or far inland, but that would merely delay matters. Only the true desert would be safe from my foe, but I could not go there.\nSo I watched the progress of the weed every morning as I drank my first coffee, usually leaning back in one white plastic chair as I elevated my supposedly injured leg on another. The two chairs were the only furniture in the apartment. I slept in the bath, which I had lined with sleeping moss, which was comfortable, sweet-smelling, and also massaged out the cares of the day with its tiny rhizoids.\nThe day before I adjudged the weed would reach its catalytic potential and spawn servitors, I bought not just my usual black coffee from the café downstairs, but also a triple macchiato that came in a heavy, heat-resistant glass. Because I lived upstairs they always gave me proper cups. The barista who served me, a Japanese guy who worked the espresso machine mornings and surfed all afternoon, put the coffees in a cardboard holder meant for takeaways and said, “Got a visitor today?”\n“Not yet,” I said. “But I will have shortly. By the way, I wouldn’t go surfing here this afternoon . . . or tomorrow.”\n“Why not?”\n“That weed,” I replied. “It’s toxic. Try another beach.”\n“How do you know?” he asked as he slid the tray into my waiting fingers. “I mean, you can’t . . . ”\n“I can’t see it,” I said, as I backed away, turned, and started tapping towards the door. “But I can smell it. It’s toxic all right. Stay clear.”\n“OK, thanks. Uh, enjoy the coffee.”\nI slowly made my way upstairs, and set the coffees down on the floor. My own cup in front of one white chair, and the macchiato at the foot of the other. I wouldn’t be resting my limb on the spare chair today.\nI had to wait a little while for the breeze to come up, but as it streamed through the room and teased at the hair I should have had cut several weeks before, I spoke.\n“Hey, Anax. I bought you a coffee.”\nThe wind swirled around my head, changing direction 270 degrees, blowing out the window it had come in by and in by the window it had been going out. I felt the floor tremble under my feet and experienced a brief dizziness.\nAnax, proper name Anaxarte, was one of my oldest friends. We’d grown up together and had served together in two cosmically fucked-up wars, one of which was still slowly bleeding its way to exhaustion in fits and starts, though the original two sides were long out of it.\nI hadn’t seen Anax for more than thirty years, but we scribbled notes to each other occasionally, and had spoken twice in that time. We talked a lot about meeting up, maybe organizing a fishing expedition with some of the old lads, but it had never come together.\nI knew that if he were able to, he would always answer my call. So as the coffee cooled, and the white plastic chair lay vacant, my heart chilled, and I began to grieve. Not for the loss of Anax’s help against the enemy, but because another friend had fallen.\nI sat in the sunshine for an hour, the warmth a slight comfort against the melancholy that had crept upon me. At the hour’s end, the wind shifted again, roiling around me counter-clockwise till it ebbed to a total calm.\nEven without the breeze, I could smell the weed. It had a malignant, invasive odor, the kind that creeps through sealed plastic bags and airtight lids, the smell of decay and corruption.\nMy options were becoming limited. I took up my stick and went downstairs once more to the café. The afternoon barista did not know me, though I had seen her often enough through my expansive windows. She did not comment on my order, though I doubt she was often asked for a soy latte with half poured out after it was made, to be topped up again with cold regular milk.\nUpstairs, I repeated the summoning, this time with the chill already present, a cold presence of somber expectation lodged somewhere between my heart and ribs.\n“Balan,” I called softly. “Balan, your luke-warm excuse for a drink is ready.”\nThe wind came up and carried my words away, but as before, there was no reply, no presence in the empty chair. I waited the full hour to be sure, then poured the congealed soy drink down the sink.\nI could see the weed clearly in the breakers now. It was almost entirely one huge, long clump that spanned the length of the beach. The lifesavers had given up trying to break it apart with their jetskis and zodiac inflatables, and there were two ‘Beach Closed’ signs stuck in the sand, twenty meters apart. Not that anyone was swimming. The beach was almost empty. The reek of the weed had driven away everyone but a sole lifesaver serving out her shift, and a fisherman who was dolefully walking along in search of a weed-free patch of sea.\n“Two of my old friends taken,” I whispered to the sun, my lips dry, my words heavy. We had never thought much about our futures, not when we were fighting in the war, or later when we had first escaped our service. The present was our all, our time the now. None of us knew what lay ahead.\nFor the third time, I trod my careful way downstairs. There were a dozen people outside the café, a small crowd which parted to allow me passage, with muffled whispers about blindness and letting the sightless man past.\nThe crowd was watching the weed, while trying not to smell it.\n“There, that bit came right out of the water!”\n“It kind of looks alive!”\n“Must be creating a gas somehow, the decomposition . . . ”\n“ . . . check out those huge nodules lifting up . . . ”\n“. . . a gas, methane, maybe. Or hydrogen sulphide . . . nah . . . I’m just guessing. Someone will know . . . ”\nAs I heard the excited comments I knew that I had mistimed my calls for assistance. The weed was very close to catalysis and would soon spawn its servitors, who would come ashore in search of their target.\nI had meant to ask the owner of the café, a short, bearded man who was always called “Mister Jeff” by the staff, if he could give me a glass of brandy, or at a pinch, whiskey. A fine armagnac would be best, but I doubted they’d have any of that. The café had no liquor license but I knew there was some spirituous alcohol present, purely for Jeff’s personal use, since I’d smelled it on his breath often enough.\nBut as I said, it was too late for that. Palameides might have answered to a double brandy, but I secretly knew that he too must have succumbed. It had been too long since his last missive, and I accounted it one of my failings that I had not been in touch to see where he was, and if all was well with him.\n“Someone should do something about that weed,” complained a thickset young man who habitually double-parked his low-slung sports car outside the café around this time. “It really stinks.”\n“It will be gone by morning,” I said. I hadn’t meant to use the voice of prophecy, but my words rang out, harsh and bronze, stopping all other conversation.\nEveryone looked at me, from inside and outside the café. Even the dog who had been asleep next to one of the outside tables craned his neck to look askance. All was silent, the silence of an embarrassed audience who wished they were elsewhere without knowing why, and were fearful about what was going to come next.\n“I am a . . . biologist,” I said in my normal tones. “The weed is a known phenomenon. It will disperse overnight.”\nThe silence continued for a few seconds, then normal service resumed, at a lower volume. Even the double-parking guy was more subdued.\nI spoke the truth. One way or another, the weed would be gone, and likely enough, I would be gone with it.\nAs the afternoon progressed, the stench grew much worse. The café was shut, staff and customers retreating to better-smelling climes. Around five o’clock, nearby residents began to leave as well, at the same time the Fire Brigade, the Water Board, the police, and several television crews arrived.\nAn hour after that, only the firefighters remained, and they were wearing breathing apparatus as they went from door to door, checking that everyone had left. Farther afield, way down the northern end of the beach, I could see the television crews interviewing someone who was undoubtedly an expert trying to explain why the noxious odors were so localized, and dissipated so quickly when you got more than three hundred meters from the center of the beach.\nThe “DO NOT CROSS” tapes with the biohazard trefoils got rolled out just before dusk, across the street about eighty meters up from my apartment. The firefighters had knocked at my door and called out, gruff voices muffled by masks, but I had not answered. They could probably have seen me from the beach, but no one was heading closer to the smell, however well-protected they might be. The sea was bubbling and frothing with noxious vapors, and weedy nodules the size of restaurant refrigerators were bobbing up and down upon the waves. After a while the nodules began to detach from the main mass of weed and the waves carried them in like lost surfboards, tendrils of weed trailing behind them, reminiscent of broken leg-ropes.\nI watched the nodules as the sun set behind the city, mentally mapping where they were drifting ashore. When the sun was completely gone, the streetlights and the high lamps that usually lit the beach didn’t come on, but that didn’t matter much to me. Darkness wasn’t so much my friend as a close relative.\nThe lack of artificial light caused a commotion among the HAZMAT teams though, particularly when they couldn’t get their portable generators and floodlights to work, and the one engine they sent down the street choked and stalled before it had even pulled away from the curb.\nI had counted thirteen nodules, but more could be out in the weed mass, or so low in the water I’d missed them. My enemy was not underestimating me, or had presumed I would be able to call upon assistance.\nI had presumed I would be able to call upon assistance, a foolish presumption built upon old camaraderie, of long-ago dangers shared, of the maintenance of a continuum. I had not thought that my friends, having survived our two wars, could have had a full stop put to their existence in more mundane environments, or at least not so soon. Which meant that they had met the same fate that now threatened to be mine.\n“Anax, Balan, Palameides,” I whispered. By now there would be three new death-trees laid out in a nice row in the arboreal necropolis, with those nameplates at their feet. There was probably a Nethinim carving my name onto a plaque right now, and readying a sapling. They always knew beforehand, the carriers of water and hewers of wood.\nI dismissed this gloomy thought. If my time had come, it had come, but I would not wait in a dark apartment, to acquiesce to my fate like a senescent king grown too tired and toothless to act against his assassins.\nI took off the blindfold and tied it around my neck, returning it to its original use as a scarf. It became my only item of apparel as I shucked white cotton trousers, white T-shirt and underwear.\nThe stick I gently broke across my knee, sliding the two lengths of wood apart to reveal the sword within. I took the weapon up and made the traditional salute towards my enemies on the beach.\nCourtesies complete, I shaded my skin, hair and eyes dark, a green almost heavy enough to match the blackness of the night, and with a moment’s concentration, grew a defensive layer of young bark, being careful not to over-do it, while overlaying the sheaths in such a way that it would not limit my movement. Novices often made the mistake of armoring up too much, and found themselves extraordinarily tough but essentially sessile. I had not made that mistake since my distant youth.\nThe wind lifted a little, and the stink of the weed changed, becoming more fragrant. I heard thirteen soft popping noises come from the beach, and knew that the nodules were opening.\nThere was little point in dragging things out, so I simply walked down the street to the beach, pausing to bid a silent farewell to the café. Their coffee had been quite good.\nI paused at the promenade railing, near the block of stone surmounted by the bronze mermaid, and looked across the beach. There was a little starlight, though no moon, and I thought both sea and sand had never looked prettier. The humans should turn the lights off more often, though even then they would not see the way I saw.\nThe thirteen had emerged from their nodules, or perhaps I should call them pods. Now that I saw them clearly, I knew I had even less chance than I’d thought. I had expected the blocky, bad imitations of human women that looked like Bulgarian weightlifters, armed with slow, two-handed axes that though devastating when they hit, were fairly unlikely to do so provided I didn’t make a mistake.\nBut my enemy had sent a much superior force, testament I suppose to the number of times I had defeated or evaded previous attempts to curtail my activities. This time they were indeed what long-gone inhabitants of this world had called Valkyries: female human in form, tall, long-limbed, and very fast, and the sensing tendrils that splayed back from their heads could easily be mistaken for a wing’d helmet, as their rust-colored exoskeleton extrusions could look like armor.\nThey lifted their hatchets—twenty-six of them, as they held one in each hand—when they saw me, and offered the salute. I returned the greeting and waited for the eldest of them (by a matter of seconds, most like) to offer up the obligatory statement, which also served as a disclaimer, thrust all liability for collateral damage upon me and usually offered a chance to surrender.\n“Skrymir, renegade, oathbreaker, and outcast!”\nI inclined my head.\n“Called to return eight times; sent for, six times.”\nHad it been so many? I’d lost count. Too many years, across too many worlds.\n“Surrender your sword!”\nI shook my head, and the valkyries attacked before I could even straighten my neck, running full-tilt at the seawall that bordered the promenade. Six stopped short before the wall and six leaped upon their backs to vault the railing, while the last, the senior, stood behind in a position of command.\nI lopped two heads as I fell back, the valkyries concerned momentarily confused as their major sensory apparatus went bouncing back down to the sand. As per their imprinting, they stopped still and if it had not been for the others I could have felled them then. But the others were there, attacking me from all sides as I danced and spun back to the road, my sword meeting the helves of their hatchets, nicking at their fibrous flesh, but their weapons in turn carved long splinters from my body.\nIf they could surround me, I would be done for, so I fought as I had not fought since the wars. I twisted and leaped and slid under parked cars and over them, around rubbish bins and flagpoles, changing my sword from left hand to right hand, kicking, butting, deploying every trick and secret that I knew.\nIt was not enough. A skilled and vicious blow caught my knee as I took off another head, and in the second I was down, a dozen other blows put paid to my legs. I rolled and writhed away, but it was to no avail. The valkyries pinned me down and began to chop away.\nThe last memory I have from that expression of myself was of the starry sky, the sound of the surf a deeper counterpoint to the thud of axework, and the blessed smell of fresh salt air, the stench of that particular rotten weed gone forever.\nI cannot smell anything where I am now, nor see. I can sense light and shade, the movement of air, the welcome sensation of moisture on my extremities, whether above or below the earth.\nNeither can I speak, save in a very limited fashion, the conveyance of some slight meaning without words.\nBut I am not alone.\nPalameides is here, and Balan, and Anax too. They have grown tall, and overshadow me, but this will not last. I will grow mighty once more, and one day, They will have need of us again . . . and then, as we whisper, tapping with our roots, signaling with the rustle of our leaves, then our hearts will bud new travelers, and we shall go forth to do the bidding of our masters, and perhaps, for as long as we can, we four friends shall once again be free.\nOriginally published in Dreaming Again, edited by Jack Dann, 2008.\nNew York Times bestselling Australian writer Garth Nix worked as a book publicist, editor, marketing consultant, public relations man, and literary agent before launching the best-selling \"Old Kingdom\" series, which consists of Sabriel, Lirael: Daughter of the\nClayr, Abhorsen, and The Creature in the Case. His other books include the \"Seventh Tower\" series, consisting of The Fall, Castle, Aenir, Above the Veil, Into Battle, and The Violet Keystone, the \"Keys to the Kingdom\" series, consisting of Mister Monday, Grim Tuesday, Drowned Wednesday, Sir Thursday, Lady Friday, Superior Saturday, and Lord Sunday, as well as stand-alone novels such as The Ragwitch and Shade's Children. His short fiction has been collected in Across the Wall: Tales of the Old Kingdom and Beyond. His most recent book are two novels written with Sean Williams, Troubletwisters: The Mystery and Troubletwisters: The Monster, a new standalone novel, A Confusion of Princes, and a new collection, Sir Hereward and Master Fitz: Three Adventures. Born in Melbourne, he now lives in Sydney, Australia.", "source": "https://clarkesworldmagazine.com/nix_04_16_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Old Friends by Garth Nix"}