{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Caroline M Yoachim", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Wz/24+P9G4dvf0ng8JfanEQh19k=", "id": null, "license": null, "comments": "", "raw_text": "5670 words, short story  Five Stages of Grief After the Alien Invasion  Denial  Ellie huddled in the corner of her daughter’s room. She sang a quiet lullaby and cradled her swaddled infant in her arms. Lexi was four months old, or maybe thirteen months? Ellie shook her head. There hadn’t been a birthday party, and thirteen-month-olds didn’t need swaddling. She tried to rearrange the swaddling blankets so they didn’t cover Lexi’s face, but every time she moved the blankets, all she saw underneath was another layer of blankets.  “Oskar?” she called. “Come and hold the baby for a bit, I need to go out and buy formula.”  Oskar came in and gave her the same sad look he’d worn all week. Work, she decided, must be going poorly. She wished he would confide in her about it, but he didn’t like to burden her with his problems. Lexi’s room was dark, and the light switch wasn’t working. Ellie opened the blinds, but the window was covered in white paint, making it impossible to see outside.  “Did you paint the windows?” she asked. Their apartment was on the third floor, and it had a lovely view of the treetops. “Lexi will want to see the birds.”  “Sporefall killed all the birds,” Oskar said, his voice bitter, “and we don’t need formula. It’s been months, Ellie. I know how hard this is, but I can’t do this anymore. The pain is bad enough without reliving it with you every day.”  Ellie frowned. “If you’re too busy to watch the baby you should say so.”  Oskar leaned down and kissed the top of her head. “I’m going, Ellie. There’s a caravan heading down to L.A., and I haven’t heard a thing from Jessica since sporefall. She didn’t even answer the letter I sent about Lexi. I’ve hired a caretaker to help you get by without me, her name is Marybeth. She lost her wife to the sporefall, so maybe you two can help each other get through your grief.”  “A little extra help around the house will be nice,” Ellie said. “Tell your sister hello.”  Ellie smiled. Jessica was a good influence on Oskar. She’d cheer him right up.  Oskar’s eyes were teary when he turned to leave the room. She wondered if his allergies were acting up. He’d said something about spores. When she went to get the formula, she could pick up an antihistamine for him.  Ellie put Lexi in the high chair, still swaddled in blankets, and tried to spoon-feed her pureed peas. It wasn’t working very well. Four months was too early for solids and the entire jar ended up on the blankets rather than in the baby. Ellie put the empty jar in the sink.  Someone knocked on the door, unlocked it, and came inside. It wasn’t Oskar.  “Your husband gave me a key,” the woman said, “I’m Marybeth. You must be Ellie.”  Ellie nodded, “And this is Lexi. She’s a bit of a mess right now.” Ellie dabbed at the blankets with a napkin, then added, embarrassed, “She’s a bit young for it, but I tried to feed her.”  Marybeth smiled sadly. “Lexi died, Ellie. Nine months ago the Eridani seeded the planet with spores. Once they realized the planet was inhabited, they undid the damage as best they could, but they came too late for the elderly and the very young.”  “Well, I’m glad they came nine months ago and not now,” Ellie said, wiping the tray of the highchair with the food-smeared napkin. “Oskar hired you to watch Lexi? Do you do laundry, too? Her blankets are a mess.”  Marybeth carefully unwound Lexi’s outermost blanket and put it in the laundry hamper. “It would be better if you could move on, Ellie. This isn’t healthy.”  Satisfied that Marybeth could take care of Lexi, Ellie went to the bathroom and took a shower. Cold water poured down around her skin, and she scrubbed until she was red to be sure she got rid of all the spores. Oskar was allergic to spores, and she didn’t want to make his symptoms any worse. Oh, but the babysitter—she came from outside, she must have been covered in spores.  Ellie ran out from the bathroom, dripping wet and wrapped in a towel. “You came from outside! You’ve exposed poor Lexi to spores!”  Marybeth put one hand on Ellie’s shoulder and gently guided her back to the bathroom. “Hush now, the spores are gone, all grown into plants. We don’t have to worry about spores.”  Marybeth returned the next day with an old man. Ellie hoped he wasn’t sick. He was dressed too warmly for the weather: clunky black boots, several layers of baggy clothes, and a fleece hat with flaps that covered his ears. He was short and stout with ashen skin and a grin too broad for his face. It made him look like a toad, Ellie thought, then pushed the uncharitable thought from her head.  “Come in, come in,” Ellie said, then realized that her welcome was too late and Marybeth and her—was the man her father? Maybe her grandfather—were already in the entryway of her apartment.  “I thought it’d be good for you to meet one of the Eridani,” Marybeth said. “It might help you come to grips with what happened.”  “Nice to meet you, Mr. Eridani,” Ellie said. It was time for Lexi’s nap. The apartment was warm, good for sleeping, but Ellie could use some fresh air. “Do you sing, Marybeth?”  “Sing?” Marybeth asked. “No, not really.”  “What about you, Mr. Eridani?” Ellie turned to the old man. “Will you sing my daughter lullabies? I’d like to go for a walk.”  “It might be good for her to get out of the house,” Marybeth told her grandfather. “I think Oskar made a mistake in painting the windows.” She went over to the kitchen window and pried it open, sending flecks of dried paint flying everywhere.  Ellie turned her back on the kitchen, trying to protect Lexi from the nasty paint dust. “Don’t let her breathe the dust, she just got over a terrible cough.”  The old man nodded, then held out his arms to take Lexi. He held her gently, and while his mouth was fixed in the same broad smile, his bulging black eyes seemed sad. Ellie wondered if he was longing for grandchildren of his own.  “Don’t be sad. Lexi clearly likes you. She didn’t even cry.” Ellie put on a sweater and opened her apartment door. “I won’t be gone long.”  The trees along the edge of the sidewalk had oddly purple leaves, and the people that passed looked far too weary for a sunny Saturday afternoon, but as she walked beneath the open windows of her apartment, she could hear the low hum of a lullaby, slow and sweet, sure to soothe her daughter straight to sleep.  Anger  Amelia was twelve the night the spores fell, and she remembered it vividly. Thousands of meteors burned bright as they fell through the atmosphere. Charred black pods burst open when they crashed to the ground. By dawn, the air was filled with swirling clouds of orange mist, like pollen blowing from the trees. Every person and creature on the planet breathed the spores. The birds were the first to die, but not the last.  “Come away from the window, Sis.” Brayden tried to tousle her hair like she was six years old or something. “Dad will be home soon, and you haven’t done your homework yet.”  “I didn’t do my homework because it’s stupid to pretend that nothing has changed,” Amelia said. “Everyone in my class lost people to the spore. Friends, grandparents . . . siblings. Tia’s parents got killed in the riots. Zach’s older brother died in one of the fires. Then the way they healed us—”  She shuddered. She still had nightmares about the croaker that thinned into some kind of fog and poured itself down her throat, picking the spores out of her lungs and healing the damage the sprouting plants had done. It was that or die when the spores grew, but she’d still thrashed so much that Dad had to hold her down to keep her from hurting herself.  “It was eleven months ago,” Brayden said. He stared at the sky for a moment, lost in his own thoughts. “What’s the alternative to going back to normal? If you didn’t have school, you’d sit home and sulk all day like that guy that came down from Portland.”  Their neighbor’s brother had showed up on the caravan last week, looking for Jessica, but she’d already left for the space station. She was one of the scientists chosen to help negotiate a treaty with the aliens. The only treaty Amelia wanted to see was ‘get off our planet and take your damned purple plants with you.’  “Oskar sits around and sulks all day,” Amelia said, “but I would go out and kill croakers.”  Brayden shook his head. “You can’t kill croakers. People have tried. They can’t be poisoned, stabbed, or shot. No matter what you do to them, they recohere, they heal. If you did more of your homework, you might know that.”  Unlike the rest of her classes, which she’d given up on, Amelia had paid careful attention to all the details of croaker biology. Despite their solid-seeming forms, croakers were essentially sentient fog. The squat froglike body they used on Earth was a dense gray cloud, thick enough to hold up the clothes they wore, but little else. Projectiles and blades passed right through and did little harm, and poison passed through unabsorbed.  Amelia had a different plan. She would trap a croaker bit by bit in a hundred glass jars. Then she’d throw the jars into a fire, one by one. Would the pain of that death be as bad as the last desperate gasps of her little brother? Gavin was four, and screamed all his last night in pain and fear. Spores made his lungs burn, the doctor said.  Amelia would make a croaker burn.  Croakers wandered the streets like ghosts, occasionally stopping to eat leaves from the purple plants that had grown from the spores. According to the news, the croakers were observing, collecting data so they could repair more of the damage they did at sporefall, but as near as Amelia could tell, the big gray frogs were just making themselves right at home. Amelia waited behind one of their licorice-smelling plants with a cardboard box full of glass jars.  A croaker came to nibble at the leaves, and she jumped out from behind the bush, jar in hand. She scooped out a big section of the croaker’s ugly frogface. The croaker was thicker than she expected, like gelatin or pudding, rather than air. The gray goo in the jar was repulsively flesh-like, and her stomach churned as she screwed the lid into place. The croaker let out a high pitched whine. Its face appeared unchanged, despite her jarful of gray goo.  She couldn’t do it. She had a boxful of jars, and she wanted the croaker to burn, but she couldn’t bring herself to take another scoop of its ashen flesh. It stared at her with round black eyes, still making a high pitched sound, though softer now, a sad keening sound.  “You killed Gavin!” she screamed. “You messed up my whole world and now you stay here like you own it! You should burn for it!”  She hurled the jar of gray goo at the sidewalk. It shattered against the concrete and shards of glass flew everywhere. A cloud of gray swirled up from the shimmering fragments of the jar before drifting back onto the croaker. Into the croaker.  She grabbed another jar from her box and threw it at the croaker. It bounced off the alien’s face, and the froglike grin didn’t even flinch. “Go back to where you came from!” she shouted and flung jar after jar at the croaker, until her cardboard box was empty and the sidewalk was buried beneath a pile of shattered glass.  The croaker scooped up the broken glass in big webbed hands, mounding it and sculpting it into its own image. Amelia watched, fascinated despite herself. The croaker smoothed the bits of glass as easily as a sculptor might shape clay. It made a statue of a croaker, and in the statue’s broad glass hands there was a human child with indistinct features. Not her brother, but a child like him. Perhaps all children like him. Unlike every croaker Amelia had ever seen, there was no froglike grin on the statue’s face.  Brayden ran over. “I heard all the noise, and—” He stared at the statue.  “I wanted to set a croaker on fire, but I couldn’t do it.” Amelia said. “Not even after everything they did.”  Perhaps it was a trick of the light, but the statue didn’t look empty. Delicate orange flames danced inside the statue of the croaker, complete with thin wisps of gray smoke that reminded her of the swirling cloud when she broke the jar and let the croaker go. It had left a piece of itself inside the statue, to burn inside the glass.  She thought her mind was playing tricks on her, but Brayden saw it too. “They already burn for what they did.”  The croaker bowed its head, then turned and walked away.  Bargaining  The alien standing in front of Jessica was four feet tall, slate gray, and shaped like an oversized toad. It smelled like chalk and made a quiet wheezing noise, barely audible over the hum of the orbital stabilizers. The temperature onboard the station was comfortable for humans, but the alien wore a thick sweater, knitted by one of Jessica’s former graduate students as a gesture of goodwill from all humankind. A large round button with the number 17 was pinned to the purple wool. Eridani didn’t use names.  Eridani 17 extended a webbed hand. The flesh of its fingers thinned, creating the illusion of wisps of smoke curling up from its palm. The smoke shaped itself into North America, and then a city skyline.  “Toronto?” Jessica asked. The city had a distinctive tower. Eridani 17 shook its head.  Negotiating with the Eridani was like a game of Pictionary, except that Jessica was sober and—thank god—didn’t have to actually draw anything. Her brother Oskar had always been the artist in the family, excelling at Pictionary even when he was half her age. If his most recent message was any indication, all he ever drew now was pictures of his estranged wife, who lost her mind after sporefall killed their baby.  “Seattle,” Jessica said.  The Eridani understood spoken language, but not by translating individual words. According to the best available translation, the Eridani heard ideas in the spaces between the words.  She hoped that this was true. She was not authorized to ask for what she truly wanted, and the sessions were recorded.  Eridani 17 transformed its speaking hand into an image of several Eridani standing between two skyscrapers. As Jessica watched, a giant web appeared between the two buildings, soon followed by several pods filled with what she guessed were baby Eridani.  “Seattle has a substantial human population, but I’m sure we can find an abandoned region that suits your needs,” Jessica said. Atlanta, perhaps. It was warmer there, and the sporefall had been particularly dense.  Eridani 17 made no response, and its hand solidified. This meant that an alternate site was acceptable. Jessica would get a list of abandoned and near-abandoned cities to propose in tomorrow’s negotiations.  Next on her agenda was a request for additional technology to assist in maintaining and rebuilding the human population in the regions hardest hit by sporefall. Negotiations happened in parallel, with dozens of humans in one-on-one sessions with the Eridani at any given time. She checked her tablet to make sure that nothing from the other sessions had altered her agenda.  “Like many of my people, I lost family members to the spore,” Jessica began. She concentrated on her memories of her niece, a tiny baby that she had held only once. “We struggle to rebuild what we once had.”  She was supposed to be asking for technological advances in transportation and communications, for new methods of agriculture to help human crops coexist with the invasive purple weeds that grew from the Eridani spores. She was supposed to infuse her spoken words with a plea for these things, so that the aliens would hear their needs in the spaces between her words. Instead, she thought of all the people she had lost in the sporefall and the chaos afterwards—relatives, coworkers, neighbors, friends.  Give them back, she pleaded. The Eridani were so advanced; there had to be something they could do. “Surely there is some technology you have that can help us.”  Eridani 17 thinned itself entirely into cloud, leaving the purple sweater in a puddle on the floor. It reformed itself into the shape of Gavin, her neighbor’s four-year-old son who had died from the spore. The boy sat cross-legged on the floor and in his lap was a tightly swaddled baby with a drooly grin and dimpled cheeks. Lexi.  The alien had somehow called the children from her mind, but the scene that it created was not a remembered image. Gavin had never met Lexi. And yet, if he had, this was exactly how it might have looked. The boy’s expression was a mix of curiosity and wariness, and Lexi—  She very nearly said what she was thinking, that she would give anything to have her back. Her death, and Ellie’s breakdown, was destroying Oskar. Each death from the spore cascaded into a thousand unwanted consequences, and all the world was broken now. There must be some way the Eridani could undo time or reshape space and reverse the deaths they’d caused. There had to be a way.  Gavin held Lexi with one arm and raised the other up in front of him. He thinned his fingers, which was disconcerting. Jessica knew the ghosts were really just Eridani 17, but human fingers shouldn’t thin the way that Gavin’s were thinning.  “You will give us back the ones we’ve lost in exchange for,” Jessica paused to study the map that hovered where Gavin’s hand should have been. “The entire West Coast?”  It snapped Jessica back to reality. The Eridani had always shown remorse for what they’d done. They’d claimed to be unaware that the planet was inhabited, that they would not have sent their spore and, later, their colony ships, if they had known otherwise. She hadn’t expected them to use her grief to their advantage in negotiations. She could not trade that much territory, not for mere ghosts.  “Not for shadows and memories,” Jessica said.  Gavin leaned forward and kissed baby Lexi on the forehead. It was so close to what she wanted, they were almost real. Better than Ellie’s empty bundle of blankets. Close enough, perhaps, to pull her sister-in-law back to reality. So close to what she wanted, and yet so far. And she couldn’t trade that much territory even if the Eridani offered to pull the actual children from the past. “I am not authorized to negotiate concessions of this magnitude.”  Gavin and Lexi melted right before her eyes, merged into a puddle, and reformed into the default frogform of Eridani 17. The entire session was recorded, and back on Earth it was undoubtedly already being analyzed. They would see the tears in her eyes, and she would be sent back to the planet in disgrace. Back to Earth, but not back home. Home was a place that still had those children in it.  Depression  Oskar got home from a long shift of weeding alien foodplants out of the avocado grove. His hands were stained purple and smelled of licorice. He set a 10 pound bag of avocadoes on the counter. He should trade some avocadoes to the neighbor kids for one of the trout they farmed in the courtyard fountain, but he didn’t want to eat. He shut himself into his sister’s guest bedroom and stared at the ceiling, crushed beneath the weight of his bad choices.  He shouldn’t have left Ellie.  The walls were covered in sketches of his wife. Her smile, her eyes, her slender hands. Cheeks dotted with pale brown freckles. Hair tied back with a few loose strands to frame her face. She was the one who left him. She left reality behind and spent all day pretending a bundle of blankets was their baby girl. No one could blame him for not wanting to relive that kind of pain, day after day. He’d tried for months. Marybeth was a family friend, and he’d given her everything they had to take care of his wife.  All of that so Oskar could go and find his sister, Jessica. He’d been worried that she might need help, but she wasn’t sitting helpless in her apartment. No, she’d gone off to the space station to be one of Earth’s ambassadors. This was supposed to be his big chance to not be the baby brother anymore, to swoop in and save Jessica from the post-invasion chaos, and she hadn’t needed him at all. She never did. He had no idea if she’d even gotten the message he’d tried to send.  Someone pounded on the door. Probably the neighbor kids. Brayden liked avocadoes, and trading with him was a better deal than trying to buy them somewhere.  He opened the door. “Jessica.”  “I can’t believe you changed my locks.” Jessica faked a scowl, then grinned and gave him a big hug. “You look like crap.”  Oskar retreated to Jessica’s guestroom. His sister hadn’t understood how he could come down here and leave Ellie behind, no matter how he tried to explain.  People started pouring in from the east. They moved into abandoned apartments, office buildings, malls. Los Angeles turned back into a bustling city. Jessica said that the government had traded Arizona and New Mexico to the frogs. All the extra people made it harder to get work. His heavy heart made it harder to wake up and face the day.  On his second straight day of refusing to get out of bed, Jessica marched into his room like she was twenty and he was ten, and she could boss him around. “Draw me a bird.”  “Go away,” he said. There were no birds, and he could see right through his sister’s scheme. Birds were from happier times. She thought sketching a picture would pull him out of this funk. She was wrong. Remembering the way things were would only make it worse. “There are no birds. Sporefall killed them all.”  “Think of it as rent. It’ll do you good to draw something other than Ellie, over and over again. All I’m asking for is one really good picture of a bird.” Jessica left without waiting for him to answer.  He only had a few sheets of good thick paper left, he’d used most of it to draw his pictures of Ellie. He got one out. He closed his eyes and tried to picture the stellar jays that had eaten peanuts from the feeder outside his window, back before the sporefall. He remembered blue and black feathers, and the general shape of the head, but the details were fuzzy. There were pictures of birds in books, but he shouldn’t need that. He should be able to do this. It had only been a year.  For the first time in weeks, he opened the guestroom blinds. The apartment was on the fourth floor, and the window looked across the alley at a near-identical brick building. He tried to imagine birds flying in the alley, landing on the concrete below to hunt for bugs or seeds, but thoughts of flying set his mind to thinking about soaring out through the window and falling into oblivion.  He closed the blinds.  Two days later Oskar had only one sheet of good paper left, and he had not yet managed a picture of a bird. He ate when Jessica forced him to, and he slept until Jessica made him get out of bed. There was no point to pictures of birds. There was no point to anything, not anymore.  Jessica came in with half an avocado. Did he really have to eat, again? But no, she started eating it herself, spooning the mushy green into her mouth and smiling as though it actually tasted good to eat a plain avocado, again. “This is the last one from the bag, and food rations have been short at the community center, so we can’t count on that. We need to decide what to do next. There’s a caravan going north, right through Portland.”  He didn’t want to go back. What if Marybeth had abandoned Ellie, despite all her promises? He couldn’t face the chance. “I’m staying here.”  Jessica shook her head. “You’re not. I’m trading the apartment for passage on the caravan and food for the trip. If you want to stay in L.A., you’re on your own.”  She left him to consider his options, and his gaze drifted to the window. It would be so easy, so quick. If he never went back to Ellie, he could believe that she was okay, maybe even happy. He wouldn’t have to face a world that could never possibly be right again.  He opened the blinds. An alien was walking in the alley, smiling the same damn frog-smile that the aliens always smiled. It saw him in the window, and thinned into a cloud. When it came back together, it was a flock of birds. Not the stellar jays he’d been trying to draw, but pigeons, plump and gray. They fluttered up and landed on windowsills and power lines outside the window. They weren’t real, but they were enough to evoke a clear memory in his mind.  Oskar could soar out the window, or he could draw this memory of birds for Jessica and go with her back to Portland.  He calmed his shaking hands and sketched the birds.  Acceptance  Marybeth walked with Ellie to the clinic. Ellie insisted on bringing ‘Lexi,’ a bundle of filthy blankets that she refused to believe wasn’t actually her dead baby. Marybeth hoped the new treatment would help. Ellie was an amazing woman, able to find joy in all the smallest things. Even now, as they walked along abandoned streets with Eridani foodplants, Ellie chattered to her blanket-bundle baby about how beautiful the orange blossoms were on the lovely purple trees.  Marybeth couldn’t appreciate the beauty of the ‘blossoms.’ They weren’t flowers at all, but clusters of tiny spheres, each one full of orange spores. The trees would release spores soon, and despite Eridani assurances that there would be no harm to humans this time, she could not put aside her memories of the last sporefall, and all the death it caused. Yolanda’s death.  Very few healthy adults had died in the sporefall, but her wife hadn’t been healthy. She’d had alpha-1-antitrypsin deficiency emphysema—a genetic disease that left her with the lungs of a sixty-year-old smoker when she was only thirty-two. Even without the sporefall, her condition had been deteriorating. She’d had a complex daily routine of inhalers and pills to try to keep the coughing fits and wheezing in check, and a tank of supplemental oxygen for her worst days.  Yolanda would have seen the beauty in the alien plants, just as Ellie did. Looking at Ellie was like looking into Yolanda’s past, back to the early days of their relationship, before her illness sapped away her strength.  Was falling in love with a straight woman any better than carrying around a bundle of filthy blankets?  The clinic was an Eridani clinic, one of several that were part of the treaty that had been negotiated with the aliens. They were greeted by a man in a white coat when they entered, and left to wait in a small room with black plastic chairs and battered magazines from before the sporefall.  “Will Oskar meet us here?” Ellie asked. Much as she refused to accept the death of her baby, she continued to believe that Oskar would return.  “He’s not here, El. We’re going to see one of the Eridani,” Marybeth explained. “They have a treatment that might help you.”  An alien appeared in the doorway, wearing what looked like a down comforter tied like a toga. It studied them with beady black eyes, then beckoned to Ellie, recognizing that she was the one more in need of treatment.  “I’d like to come too.” Marybeth said.  The Eridani doctor nodded its assent.  The treatment was painful to watch. The alien thinned itself into a gray fog, then reformed into images drawn from Ellie’s mind—not mindreading, exactly. If Ellie said nothing, the alien could not hear her thoughts. It was only when Ellie spoke about her daughter that the memories came through. Then it was like watching a moving slideshow all in shades of gray:  Oskar holding Lexi in the hospital, the day she was born.  Ellie’s struggles with breastfeeding when Lexi wouldn’t latch.  Bottles of formula, carefully mixed and warmed at all hours of the night.  So many things that Marybeth had never seen, memories that haunted poor Ellie and made her break from reality. Then came the worst, the sporefall.  Ellie going out to find formula for Lexi, and coming back covered in fine orange dust.  Lexi’s pitiful coughing and weak cries.  The days on end where she only slept upright, leaning on Ellie’s chest.  Finally, the end, the moment when there were no more breaths, and Oskar took Lexi away. Marybeth cried as the baby disappeared from the three dimensional scene the Eridani recreated from the particles of its own body. She glanced at her friend, hopeful that the therapy had helped. Ellie was crying, but she continued talking. Her baby was dead, but Ellie wasn’t finished.  More images appeared, of a Lexi that never was, in a world that no longer existed. Lexi toddling across the living room, Lexi putting on a ridiculously big backpack and going off to kindergarten, Lexi at the park feeding ducks. There were no ducks, and Lexi would never be six, but the Eridani doctor showed the impossible futures right along with the horrifying past.  Lexi’s senior prom, her wedding, the birth of Ellie’s first grandchild. The scenes skimmed through time and Marybeth could no longer watch, no longer listen to Ellie’s words. She simply watched Ellie stare into the images that poured out, and held Ellie’s hand as she cried. Since she had turned away from the doctor, it took her a moment to realize that the Eridani had resumed its default frogform. Ellie was no longer speaking, only sobbing softly.  She met Marybeth’s eyes, and there was a depth to her gaze that was missing before.  “My Lexi,” Ellie said. “My Lexi is gone.”  After the treatment, Ellie didn’t need a caretaker, but Marybeth had long since abandoned her apartment and they enjoyed each other’s company. Ellie often wore the same grim smile that so often graced Yolanda’s face when she was sick, and it tugged at Marybeth’s heart. She tried to remind herself that Ellie was a different woman, a straight woman, but she could not help but hope that somehow, if enough time passed, things could be different.  Ellie made good progress in embracing reality. Together they dismantled Lexi’s crib and set it out on the curb in front of the apartment. It wasn’t long before a woman who looked like she might be expecting came and carried it away.  Oskar came back from L.A. Marybeth greeted him at the door, and had no choice but to let him in, for all that he abandoned Ellie when she needed him most.  “I’m so glad you’re both okay,” he said. Marybeth shrugged. He could say what he wanted, it wouldn’t change what he had done. She only hoped that she wouldn’t lose Ellie, now that he was back.  “Hi, Oskar,” Ellie said. The sight of him brought her to tears, but Marybeth couldn’t tell whether they were tears of joy or pain or anger.  “I’m so sorry,” Oskar said. “I didn’t want to leave you, but I couldn’t stay. I was hurting too.”  “I forgive you,” Ellie said. “I know it must have been hard.”  He smiled and went to embrace her, but she stepped back. “I forgive you, but we can’t go back to how things were. I saw what might have been, if the Eridani had never come, and Lexi had lived, and it was beautiful. We could have had an amazing life. But those are impossible futures, and I have to let them go and come back to what is real.”  “Is it another man?” Oskar asked, then realized that Marybeth was standing there. “Or another woman?”  Ellie shook her head. “There’s no one else. Certainly not Marybeth, though she’s a dear friend.”  It was nothing that Marybeth did not already know. She had always known that Ellie was straight; there had never been any sign that she was interested. Ellie would never be Yolanda.  Marybeth grabbed her coat and made polite excuses. Ellie and Oskar had a lot to talk about, and Marybeth didn’t want to hear it. She went outside and started walking, not caring where she went.  The wind picked up, and an orange cloud blew down from the Eridani foodtrees. The second sporefall had begun, a new cycle of alien life. According to the translators, the initial sporefall had been a different strain, modified to be more aggressive for terraforming, so that the Eridani would be sure to have foodplants when they arrived at their new home. This second sporefall should be as harmless to humans as ordinary pollen.  Marybeth sneezed at the orange air, but she refused to go back inside.  She would not hide from this new world.", "text": "5670 words, short story\nFive Stages of Grief After the Alien Invasion\nDenial\nEllie huddled in the corner of her daughter’s room. She sang a quiet lullaby and cradled her swaddled infant in her arms. Lexi was four months old, or maybe thirteen months? Ellie shook her head. There hadn’t been a birthday party, and thirteen-month-olds didn’t need swaddling. She tried to rearrange the swaddling blankets so they didn’t cover Lexi’s face, but every time she moved the blankets, all she saw underneath was another layer of blankets.\n“Oskar?” she called. “Come and hold the baby for a bit, I need to go out and buy formula.”\nOskar came in and gave her the same sad look he’d worn all week. Work, she decided, must be going poorly. She wished he would confide in her about it, but he didn’t like to burden her with his problems. Lexi’s room was dark, and the light switch wasn’t working. Ellie opened the blinds, but the window was covered in white paint, making it impossible to see outside.\n“Did you paint the windows?” she asked. Their apartment was on the third floor, and it had a lovely view of the treetops. “Lexi will want to see the birds.”\n“Sporefall killed all the birds,” Oskar said, his voice bitter, “and we don’t need formula. It’s been months, Ellie. I know how hard this is, but I can’t do this anymore. The pain is bad enough without reliving it with you every day.”\nEllie frowned. “If you’re too busy to watch the baby you should say so.”\nOskar leaned down and kissed the top of her head. “I’m going, Ellie. There’s a caravan heading down to L.A., and I haven’t heard a thing from Jessica since sporefall. She didn’t even answer the letter I sent about Lexi. I’ve hired a caretaker to help you get by without me, her name is Marybeth. She lost her wife to the sporefall, so maybe you two can help each other get through your grief.”\n“A little extra help around the house will be nice,” Ellie said. “Tell your sister hello.”\nEllie smiled. Jessica was a good influence on Oskar. She’d cheer him right up.\nOskar’s eyes were teary when he turned to leave the room. She wondered if his allergies were acting up. He’d said something about spores. When she went to get the formula, she could pick up an antihistamine for him.\nEllie put Lexi in the high chair, still swaddled in blankets, and tried to spoon-feed her pureed peas. It wasn’t working very well. Four months was too early for solids and the entire jar ended up on the blankets rather than in the baby. Ellie put the empty jar in the sink.\nSomeone knocked on the door, unlocked it, and came inside. It wasn’t Oskar.\n“Your husband gave me a key,” the woman said, “I’m Marybeth. You must be Ellie.”\nEllie nodded, “And this is Lexi. She’s a bit of a mess right now.” Ellie dabbed at the blankets with a napkin, then added, embarrassed, “She’s a bit young for it, but I tried to feed her.”\nMarybeth smiled sadly. “Lexi died, Ellie. Nine months ago the Eridani seeded the planet with spores. Once they realized the planet was inhabited, they undid the damage as best they could, but they came too late for the elderly and the very young.”\n“Well, I’m glad they came nine months ago and not now,” Ellie said, wiping the tray of the highchair with the food-smeared napkin. “Oskar hired you to watch Lexi? Do you do laundry, too? Her blankets are a mess.”\nMarybeth carefully unwound Lexi’s outermost blanket and put it in the laundry hamper. “It would be better if you could move on, Ellie. This isn’t healthy.”\nSatisfied that Marybeth could take care of Lexi, Ellie went to the bathroom and took a shower. Cold water poured down around her skin, and she scrubbed until she was red to be sure she got rid of all the spores. Oskar was allergic to spores, and she didn’t want to make his symptoms any worse. Oh, but the babysitter—she came from outside, she must have been covered in spores.\nEllie ran out from the bathroom, dripping wet and wrapped in a towel. “You came from outside! You’ve exposed poor Lexi to spores!”\nMarybeth put one hand on Ellie’s shoulder and gently guided her back to the bathroom. “Hush now, the spores are gone, all grown into plants. We don’t have to worry about spores.”\nMarybeth returned the next day with an old man. Ellie hoped he wasn’t sick. He was dressed too warmly for the weather: clunky black boots, several layers of baggy clothes, and a fleece hat with flaps that covered his ears. He was short and stout with ashen skin and a grin too broad for his face. It made him look like a toad, Ellie thought, then pushed the uncharitable thought from her head.\n“Come in, come in,” Ellie said, then realized that her welcome was too late and Marybeth and her—was the man her father? Maybe her grandfather—were already in the entryway of her apartment.\n“I thought it’d be good for you to meet one of the Eridani,” Marybeth said. “It might help you come to grips with what happened.”\n“Nice to meet you, Mr. Eridani,” Ellie said. It was time for Lexi’s nap. The apartment was warm, good for sleeping, but Ellie could use some fresh air. “Do you sing, Marybeth?”\n“Sing?” Marybeth asked. “No, not really.”\n“What about you, Mr. Eridani?” Ellie turned to the old man. “Will you sing my daughter lullabies? I’d like to go for a walk.”\n“It might be good for her to get out of the house,” Marybeth told her grandfather. “I think Oskar made a mistake in painting the windows.” She went over to the kitchen window and pried it open, sending flecks of dried paint flying everywhere.\nEllie turned her back on the kitchen, trying to protect Lexi from the nasty paint dust. “Don’t let her breathe the dust, she just got over a terrible cough.”\nThe old man nodded, then held out his arms to take Lexi. He held her gently, and while his mouth was fixed in the same broad smile, his bulging black eyes seemed sad. Ellie wondered if he was longing for grandchildren of his own.\n“Don’t be sad. Lexi clearly likes you. She didn’t even cry.” Ellie put on a sweater and opened her apartment door. “I won’t be gone long.”\nThe trees along the edge of the sidewalk had oddly purple leaves, and the people that passed looked far too weary for a sunny Saturday afternoon, but as she walked beneath the open windows of her apartment, she could hear the low hum of a lullaby, slow and sweet, sure to soothe her daughter straight to sleep.\nAnger\nAmelia was twelve the night the spores fell, and she remembered it vividly. Thousands of meteors burned bright as they fell through the atmosphere. Charred black pods burst open when they crashed to the ground. By dawn, the air was filled with swirling clouds of orange mist, like pollen blowing from the trees. Every person and creature on the planet breathed the spores. The birds were the first to die, but not the last.\n“Come away from the window, Sis.” Brayden tried to tousle her hair like she was six years old or something. “Dad will be home soon, and you haven’t done your homework yet.”\n“I didn’t do my homework because it’s stupid to pretend that nothing has changed,” Amelia said. “Everyone in my class lost people to the spore. Friends, grandparents . . . siblings. Tia’s parents got killed in the riots. Zach’s older brother died in one of the fires. Then the way they healed us—”\nShe shuddered. She still had nightmares about the croaker that thinned into some kind of fog and poured itself down her throat, picking the spores out of her lungs and healing the damage the sprouting plants had done. It was that or die when the spores grew, but she’d still thrashed so much that Dad had to hold her down to keep her from hurting herself.\n“It was eleven months ago,” Brayden said. He stared at the sky for a moment, lost in his own thoughts. “What’s the alternative to going back to normal? If you didn’t have school, you’d sit home and sulk all day like that guy that came down from Portland.”\nTheir neighbor’s brother had showed up on the caravan last week, looking for Jessica, but she’d already left for the space station. She was one of the scientists chosen to help negotiate a treaty with the aliens. The only treaty Amelia wanted to see was ‘get off our planet and take your damned purple plants with you.’\n“Oskar sits around and sulks all day,” Amelia said, “but I would go out and kill croakers.”\nBrayden shook his head. “You can’t kill croakers. People have tried. They can’t be poisoned, stabbed, or shot. No matter what you do to them, they recohere, they heal. If you did more of your homework, you might know that.”\nUnlike the rest of her classes, which she’d given up on, Amelia had paid careful attention to all the details of croaker biology. Despite their solid-seeming forms, croakers were essentially sentient fog. The squat froglike body they used on Earth was a dense gray cloud, thick enough to hold up the clothes they wore, but little else. Projectiles and blades passed right through and did little harm, and poison passed through unabsorbed.\nAmelia had a different plan. She would trap a croaker bit by bit in a hundred glass jars. Then she’d throw the jars into a fire, one by one. Would the pain of that death be as bad as the last desperate gasps of her little brother? Gavin was four, and screamed all his last night in pain and fear. Spores made his lungs burn, the doctor said.\nAmelia would make a croaker burn.\nCroakers wandered the streets like ghosts, occasionally stopping to eat leaves from the purple plants that had grown from the spores. According to the news, the croakers were observing, collecting data so they could repair more of the damage they did at sporefall, but as near as Amelia could tell, the big gray frogs were just making themselves right at home. Amelia waited behind one of their licorice-smelling plants with a cardboard box full of glass jars.\nA croaker came to nibble at the leaves, and she jumped out from behind the bush, jar in hand. She scooped out a big section of the croaker’s ugly frogface. The croaker was thicker than she expected, like gelatin or pudding, rather than air. The gray goo in the jar was repulsively flesh-like, and her stomach churned as she screwed the lid into place. The croaker let out a high pitched whine. Its face appeared unchanged, despite her jarful of gray goo.\nShe couldn’t do it. She had a boxful of jars, and she wanted the croaker to burn, but she couldn’t bring herself to take another scoop of its ashen flesh. It stared at her with round black eyes, still making a high pitched sound, though softer now, a sad keening sound.\n“You killed Gavin!” she screamed. “You messed up my whole world and now you stay here like you own it! You should burn for it!”\nShe hurled the jar of gray goo at the sidewalk. It shattered against the concrete and shards of glass flew everywhere. A cloud of gray swirled up from the shimmering fragments of the jar before drifting back onto the croaker. Into the croaker.\nShe grabbed another jar from her box and threw it at the croaker. It bounced off the alien’s face, and the froglike grin didn’t even flinch. “Go back to where you came from!” she shouted and flung jar after jar at the croaker, until her cardboard box was empty and the sidewalk was buried beneath a pile of shattered glass.\nThe croaker scooped up the broken glass in big webbed hands, mounding it and sculpting it into its own image. Amelia watched, fascinated despite herself. The croaker smoothed the bits of glass as easily as a sculptor might shape clay. It made a statue of a croaker, and in the statue’s broad glass hands there was a human child with indistinct features. Not her brother, but a child like him. Perhaps all children like him. Unlike every croaker Amelia had ever seen, there was no froglike grin on the statue’s face.\nBrayden ran over. “I heard all the noise, and—” He stared at the statue.\n“I wanted to set a croaker on fire, but I couldn’t do it.” Amelia said. “Not even after everything they did.”\nPerhaps it was a trick of the light, but the statue didn’t look empty. Delicate orange flames danced inside the statue of the croaker, complete with thin wisps of gray smoke that reminded her of the swirling cloud when she broke the jar and let the croaker go. It had left a piece of itself inside the statue, to burn inside the glass.\nShe thought her mind was playing tricks on her, but Brayden saw it too. “They already burn for what they did.”\nThe croaker bowed its head, then turned and walked away.\nBargaining\nThe alien standing in front of Jessica was four feet tall, slate gray, and shaped like an oversized toad. It smelled like chalk and made a quiet wheezing noise, barely audible over the hum of the orbital stabilizers. The temperature onboard the station was comfortable for humans, but the alien wore a thick sweater, knitted by one of Jessica’s former graduate students as a gesture of goodwill from all humankind. A large round button with the number 17 was pinned to the purple wool. Eridani didn’t use names.\nEridani 17 extended a webbed hand. The flesh of its fingers thinned, creating the illusion of wisps of smoke curling up from its palm. The smoke shaped itself into North America, and then a city skyline.\n“Toronto?” Jessica asked. The city had a distinctive tower. Eridani 17 shook its head.\nNegotiating with the Eridani was like a game of Pictionary, except that Jessica was sober and—thank god—didn’t have to actually draw anything. Her brother Oskar had always been the artist in the family, excelling at Pictionary even when he was half her age. If his most recent message was any indication, all he ever drew now was pictures of his estranged wife, who lost her mind after sporefall killed their baby.\n“Seattle,” Jessica said.\nThe Eridani understood spoken language, but not by translating individual words. According to the best available translation, the Eridani heard ideas in the spaces between the words.\nShe hoped that this was true. She was not authorized to ask for what she truly wanted, and the sessions were recorded.\nEridani 17 transformed its speaking hand into an image of several Eridani standing between two skyscrapers. As Jessica watched, a giant web appeared between the two buildings, soon followed by several pods filled with what she guessed were baby Eridani.\n“Seattle has a substantial human population, but I’m sure we can find an abandoned region that suits your needs,” Jessica said. Atlanta, perhaps. It was warmer there, and the sporefall had been particularly dense.\nEridani 17 made no response, and its hand solidified. This meant that an alternate site was acceptable. Jessica would get a list of abandoned and near-abandoned cities to propose in tomorrow’s negotiations.\nNext on her agenda was a request for additional technology to assist in maintaining and rebuilding the human population in the regions hardest hit by sporefall. Negotiations happened in parallel, with dozens of humans in one-on-one sessions with the Eridani at any given time. She checked her tablet to make sure that nothing from the other sessions had altered her agenda.\n“Like many of my people, I lost family members to the spore,” Jessica began. She concentrated on her memories of her niece, a tiny baby that she had held only once. “We struggle to rebuild what we once had.”\nShe was supposed to be asking for technological advances in transportation and communications, for new methods of agriculture to help human crops coexist with the invasive purple weeds that grew from the Eridani spores. She was supposed to infuse her spoken words with a plea for these things, so that the aliens would hear their needs in the spaces between her words. Instead, she thought of all the people she had lost in the sporefall and the chaos afterwards—relatives, coworkers, neighbors, friends.\nGive them back, she pleaded. The Eridani were so advanced; there had to be something they could do. “Surely there is some technology you have that can help us.”\nEridani 17 thinned itself entirely into cloud, leaving the purple sweater in a puddle on the floor. It reformed itself into the shape of Gavin, her neighbor’s four-year-old son who had died from the spore. The boy sat cross-legged on the floor and in his lap was a tightly swaddled baby with a drooly grin and dimpled cheeks. Lexi.\nThe alien had somehow called the children from her mind, but the scene that it created was not a remembered image. Gavin had never met Lexi. And yet, if he had, this was exactly how it might have looked. The boy’s expression was a mix of curiosity and wariness, and Lexi—\nShe very nearly said what she was thinking, that she would give anything to have her back. Her death, and Ellie’s breakdown, was destroying Oskar. Each death from the spore cascaded into a thousand unwanted consequences, and all the world was broken now. There must be some way the Eridani could undo time or reshape space and reverse the deaths they’d caused. There had to be a way.\nGavin held Lexi with one arm and raised the other up in front of him. He thinned his fingers, which was disconcerting. Jessica knew the ghosts were really just Eridani 17, but human fingers shouldn’t thin the way that Gavin’s were thinning.\n“You will give us back the ones we’ve lost in exchange for,” Jessica paused to study the map that hovered where Gavin’s hand should have been. “The entire West Coast?”\nIt snapped Jessica back to reality. The Eridani had always shown remorse for what they’d done. They’d claimed to be unaware that the planet was inhabited, that they would not have sent their spore and, later, their colony ships, if they had known otherwise. She hadn’t expected them to use her grief to their advantage in negotiations. She could not trade that much territory, not for mere ghosts.\n“Not for shadows and memories,” Jessica said.\nGavin leaned forward and kissed baby Lexi on the forehead. It was so close to what she wanted, they were almost real. Better than Ellie’s empty bundle of blankets. Close enough, perhaps, to pull her sister-in-law back to reality. So close to what she wanted, and yet so far. And she couldn’t trade that much territory even if the Eridani offered to pull the actual children from the past. “I am not authorized to negotiate concessions of this magnitude.”\nGavin and Lexi melted right before her eyes, merged into a puddle, and reformed into the default frogform of Eridani 17. The entire session was recorded, and back on Earth it was undoubtedly already being analyzed. They would see the tears in her eyes, and she would be sent back to the planet in disgrace. Back to Earth, but not back home. Home was a place that still had those children in it.\nDepression\nOskar got home from a long shift of weeding alien foodplants out of the avocado grove. His hands were stained purple and smelled of licorice. He set a 10 pound bag of avocadoes on the counter. He should trade some avocadoes to the neighbor kids for one of the trout they farmed in the courtyard fountain, but he didn’t want to eat. He shut himself into his sister’s guest bedroom and stared at the ceiling, crushed beneath the weight of his bad choices.\nHe shouldn’t have left Ellie.\nThe walls were covered in sketches of his wife. Her smile, her eyes, her slender hands. Cheeks dotted with pale brown freckles. Hair tied back with a few loose strands to frame her face. She was the one who left him. She left reality behind and spent all day pretending a bundle of blankets was their baby girl. No one could blame him for not wanting to relive that kind of pain, day after day. He’d tried for months. Marybeth was a family friend, and he’d given her everything they had to take care of his wife.\nAll of that so Oskar could go and find his sister, Jessica. He’d been worried that she might need help, but she wasn’t sitting helpless in her apartment. No, she’d gone off to the space station to be one of Earth’s ambassadors. This was supposed to be his big chance to not be the baby brother anymore, to swoop in and save Jessica from the post-invasion chaos, and she hadn’t needed him at all. She never did. He had no idea if she’d even gotten the message he’d tried to send.\nSomeone pounded on the door. Probably the neighbor kids. Brayden liked avocadoes, and trading with him was a better deal than trying to buy them somewhere.\nHe opened the door. “Jessica.”\n“I can’t believe you changed my locks.” Jessica faked a scowl, then grinned and gave him a big hug. “You look like crap.”\nOskar retreated to Jessica’s guestroom. His sister hadn’t understood how he could come down here and leave Ellie behind, no matter how he tried to explain.\nPeople started pouring in from the east. They moved into abandoned apartments, office buildings, malls. Los Angeles turned back into a bustling city. Jessica said that the government had traded Arizona and New Mexico to the frogs. All the extra people made it harder to get work. His heavy heart made it harder to wake up and face the day.\nOn his second straight day of refusing to get out of bed, Jessica marched into his room like she was twenty and he was ten, and she could boss him around. “Draw me a bird.”\n“Go away,” he said. There were no birds, and he could see right through his sister’s scheme. Birds were from happier times. She thought sketching a picture would pull him out of this funk. She was wrong. Remembering the way things were would only make it worse. “There are no birds. Sporefall killed them all.”\n“Think of it as rent. It’ll do you good to draw something other than Ellie, over and over again. All I’m asking for is one really good picture of a bird.” Jessica left without waiting for him to answer.\nHe only had a few sheets of good thick paper left, he’d used most of it to draw his pictures of Ellie. He got one out. He closed his eyes and tried to picture the stellar jays that had eaten peanuts from the feeder outside his window, back before the sporefall. He remembered blue and black feathers, and the general shape of the head, but the details were fuzzy. There were pictures of birds in books, but he shouldn’t need that. He should be able to do this. It had only been a year.\nFor the first time in weeks, he opened the guestroom blinds. The apartment was on the fourth floor, and the window looked across the alley at a near-identical brick building. He tried to imagine birds flying in the alley, landing on the concrete below to hunt for bugs or seeds, but thoughts of flying set his mind to thinking about soaring out through the window and falling into oblivion.\nHe closed the blinds.\nTwo days later Oskar had only one sheet of good paper left, and he had not yet managed a picture of a bird. He ate when Jessica forced him to, and he slept until Jessica made him get out of bed. There was no point to pictures of birds. There was no point to anything, not anymore.\nJessica came in with half an avocado. Did he really have to eat, again? But no, she started eating it herself, spooning the mushy green into her mouth and smiling as though it actually tasted good to eat a plain avocado, again. “This is the last one from the bag, and food rations have been short at the community center, so we can’t count on that. We need to decide what to do next. There’s a caravan going north, right through Portland.”\nHe didn’t want to go back. What if Marybeth had abandoned Ellie, despite all her promises? He couldn’t face the chance. “I’m staying here.”\nJessica shook her head. “You’re not. I’m trading the apartment for passage on the caravan and food for the trip. If you want to stay in L.A., you’re on your own.”\nShe left him to consider his options, and his gaze drifted to the window. It would be so easy, so quick. If he never went back to Ellie, he could believe that she was okay, maybe even happy. He wouldn’t have to face a world that could never possibly be right again.\nHe opened the blinds. An alien was walking in the alley, smiling the same damn frog-smile that the aliens always smiled. It saw him in the window, and thinned into a cloud. When it came back together, it was a flock of birds. Not the stellar jays he’d been trying to draw, but pigeons, plump and gray. They fluttered up and landed on windowsills and power lines outside the window. They weren’t real, but they were enough to evoke a clear memory in his mind.\nOskar could soar out the window, or he could draw this memory of birds for Jessica and go with her back to Portland.\nHe calmed his shaking hands and sketched the birds.\nAcceptance\nMarybeth walked with Ellie to the clinic. Ellie insisted on bringing ‘Lexi,’ a bundle of filthy blankets that she refused to believe wasn’t actually her dead baby. Marybeth hoped the new treatment would help. Ellie was an amazing woman, able to find joy in all the smallest things. Even now, as they walked along abandoned streets with Eridani foodplants, Ellie chattered to her blanket-bundle baby about how beautiful the orange blossoms were on the lovely purple trees.\nMarybeth couldn’t appreciate the beauty of the ‘blossoms.’ They weren’t flowers at all, but clusters of tiny spheres, each one full of orange spores. The trees would release spores soon, and despite Eridani assurances that there would be no harm to humans this time, she could not put aside her memories of the last sporefall, and all the death it caused. Yolanda’s death.\nVery few healthy adults had died in the sporefall, but her wife hadn’t been healthy. She’d had alpha-1-antitrypsin deficiency emphysema—a genetic disease that left her with the lungs of a sixty-year-old smoker when she was only thirty-two. Even without the sporefall, her condition had been deteriorating. She’d had a complex daily routine of inhalers and pills to try to keep the coughing fits and wheezing in check, and a tank of supplemental oxygen for her worst days.\nYolanda would have seen the beauty in the alien plants, just as Ellie did. Looking at Ellie was like looking into Yolanda’s past, back to the early days of their relationship, before her illness sapped away her strength.\nWas falling in love with a straight woman any better than carrying around a bundle of filthy blankets?\nThe clinic was an Eridani clinic, one of several that were part of the treaty that had been negotiated with the aliens. They were greeted by a man in a white coat when they entered, and left to wait in a small room with black plastic chairs and battered magazines from before the sporefall.\n“Will Oskar meet us here?” Ellie asked. Much as she refused to accept the death of her baby, she continued to believe that Oskar would return.\n“He’s not here, El. We’re going to see one of the Eridani,” Marybeth explained. “They have a treatment that might help you.”\nAn alien appeared in the doorway, wearing what looked like a down comforter tied like a toga. It studied them with beady black eyes, then beckoned to Ellie, recognizing that she was the one more in need of treatment.\n“I’d like to come too.” Marybeth said.\nThe Eridani doctor nodded its assent.\nThe treatment was painful to watch. The alien thinned itself into a gray fog, then reformed into images drawn from Ellie’s mind—not mindreading, exactly. If Ellie said nothing, the alien could not hear her thoughts. It was only when Ellie spoke about her daughter that the memories came through. Then it was like watching a moving slideshow all in shades of gray:\nOskar holding Lexi in the hospital, the day she was born.\nEllie’s struggles with breastfeeding when Lexi wouldn’t latch.\nBottles of formula, carefully mixed and warmed at all hours of the night.\nSo many things that Marybeth had never seen, memories that haunted poor Ellie and made her break from reality. Then came the worst, the sporefall.\nEllie going out to find formula for Lexi, and coming back covered in fine orange dust.\nLexi’s pitiful coughing and weak cries.\nThe days on end where she only slept upright, leaning on Ellie’s chest.\nFinally, the end, the moment when there were no more breaths, and Oskar took Lexi away. Marybeth cried as the baby disappeared from the three dimensional scene the Eridani recreated from the particles of its own body. She glanced at her friend, hopeful that the therapy had helped. Ellie was crying, but she continued talking. Her baby was dead, but Ellie wasn’t finished.\nMore images appeared, of a Lexi that never was, in a world that no longer existed. Lexi toddling across the living room, Lexi putting on a ridiculously big backpack and going off to kindergarten, Lexi at the park feeding ducks. There were no ducks, and Lexi would never be six, but the Eridani doctor showed the impossible futures right along with the horrifying past.\nLexi’s senior prom, her wedding, the birth of Ellie’s first grandchild. The scenes skimmed through time and Marybeth could no longer watch, no longer listen to Ellie’s words. She simply watched Ellie stare into the images that poured out, and held Ellie’s hand as she cried. Since she had turned away from the doctor, it took her a moment to realize that the Eridani had resumed its default frogform. Ellie was no longer speaking, only sobbing softly.\nShe met Marybeth’s eyes, and there was a depth to her gaze that was missing before.\n“My Lexi,” Ellie said. “My Lexi is gone.”\nAfter the treatment, Ellie didn’t need a caretaker, but Marybeth had long since abandoned her apartment and they enjoyed each other’s company. Ellie often wore the same grim smile that so often graced Yolanda’s face when she was sick, and it tugged at Marybeth’s heart. She tried to remind herself that Ellie was a different woman, a straight woman, but she could not help but hope that somehow, if enough time passed, things could be different.\nEllie made good progress in embracing reality. Together they dismantled Lexi’s crib and set it out on the curb in front of the apartment. It wasn’t long before a woman who looked like she might be expecting came and carried it away.\nOskar came back from L.A. Marybeth greeted him at the door, and had no choice but to let him in, for all that he abandoned Ellie when she needed him most.\n“I’m so glad you’re both okay,” he said. Marybeth shrugged. He could say what he wanted, it wouldn’t change what he had done. She only hoped that she wouldn’t lose Ellie, now that he was back.\n“Hi, Oskar,” Ellie said. The sight of him brought her to tears, but Marybeth couldn’t tell whether they were tears of joy or pain or anger.\n“I’m so sorry,” Oskar said. “I didn’t want to leave you, but I couldn’t stay. I was hurting too.”\n“I forgive you,” Ellie said. “I know it must have been hard.”\nHe smiled and went to embrace her, but she stepped back. “I forgive you, but we can’t go back to how things were. I saw what might have been, if the Eridani had never come, and Lexi had lived, and it was beautiful. We could have had an amazing life. But those are impossible futures, and I have to let them go and come back to what is real.”\n“Is it another man?” Oskar asked, then realized that Marybeth was standing there. “Or another woman?”\nEllie shook her head. “There’s no one else. Certainly not Marybeth, though she’s a dear friend.”\nIt was nothing that Marybeth did not already know. She had always known that Ellie was straight; there had never been any sign that she was interested. Ellie would never be Yolanda.\nMarybeth grabbed her coat and made polite excuses. Ellie and Oskar had a lot to talk about, and Marybeth didn’t want to hear it. She went outside and started walking, not caring where she went.\nThe wind picked up, and an orange cloud blew down from the Eridani foodtrees. The second sporefall had begun, a new cycle of alien life. According to the translators, the initial sporefall had been a different strain, modified to be more aggressive for terraforming, so that the Eridani would be sure to have foodplants when they arrived at their new home. This second sporefall should be as harmless to humans as ordinary pollen.\nMarybeth sneezed at the orange air, but she refused to go back inside.\nShe would not hide from this new world.", "source": "https://clarkesworldmagazine.com/yoachim_08_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Five Stages of Grief After the Alien Invasion by Caroline M. Yoachim"}