{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Mary Robinette Kowal", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "RIj58f+xef7WkJzZg9Q3RSKYOS0=", "id": null, "license": null, "comments": "", "raw_text": "2520 words, short story  Clockwork Chickadee  The clockwork chickadee was not as pretty as the nightingale. But she did not mind. She pecked the floor when she was wound, looking for invisible bugs. And when she was not wound, she cocked her head and glared at the sparrow, whom she loathed with every tooth on every gear in her pressed-tin body.  The sparrow could fly.  He took no pains to conceal his contempt for those who could not. When his mechanism spun him around and around overhead, he twittered—not even a proper song—to call attention to his flight. Chickadee kept her head down when she could so as not to give him the satisfaction of her notice. It was clear to her that any bird could fly if only they were attached to a string like him. The flight, of which he was so proud, was not even an integral part of his clockwork. A wind-up engine hanging from the chandelier spun him in circles while he merely flapped his wings. Chickadee could do as much. And so she thought until she hatched an idea to show that Sparrow was not so very special.  It happened, one day, that Chickadee and Sparrow were shelved next to one another.  Sparrow, who lay tilted on his belly as his feet were only painted on, said, “How limiting the view is from here. Why, when I am flying I can see everything.”  “Not everything, I’ll warrant,” said Chickadee. “Have you seen what is written underneath the table? Do you know how the silver marble got behind the potted fern, or where the missing wind-up key is?”  Sparrow flicked his wing at her. “Why should I care about such things when I can see the ceiling above and the plaster cherubs upon it. I can see the shelves below us and the mechanical menagerie upon it, even including the clockwork scarab and his lotus. I can see the fireplace, which shares the wall with us, none of which are visible from here nor to you.”  “But I have seen all of these things as I have been carried to and from the shelf. In addition the boy has played with me at the fountain outside.”  “What fountain?”  “Ah! Can you not see the courtyard fountain when you fly?” Chickadee hopped a step closer to him. “Such a pity.”  “Bah—Why should I care about any of this?”  “For no reason today,” said Chickadee. “Perhaps tomorrow.”  “What is written underneath the table?” Sparrow called as he swung in his orbit about the room, wings clicking against his side with each downstroke.  Chickadee pecked at the floor and shifted a cog to change her direction toward the table. “The address of Messrs DeCola and Wodzinski.”  “Bah. Why should I care about them?”  “Because they are master clockworkers. They can re-set cogs to create movements you would not think possible.”  “I have all the movement I need. They can offer me nothing.”  “You might change your mind.” Chickadee passed under the edge of the table. “Perhaps tomorrow.”  Above the table, Sparrow’s gears ground audibly in frustration.  Chickadee cocked her head to look up at the yellow slip of paper glued to the underside if the table. Its type was still crisp though the paper itself threatened to peel away. She scanned the corners of the room for movement. In the shadows by the fireplace, a live mouse caught her gaze. He winked.  “How did the silver marble get behind the potted fern?” Sparrow asked as he lay on the shelf.  “It fell out of the boy’s game and rolled across the floor to where I was pecking the ground. I waited but no one seemed to notice that it was gone, nor did they notice me, so I put my beak against it and pushed it behind the potted fern.”  “You did? You stole from the boy?” Sparrow clicked his wings shut. “I find that hard to believe.”  “You may not, today,” Chickadee said. “Perhaps tomorrow.”  She cocked her head to look away from him and to the corner where the live mouse now hid. The mouse put his forepaw on the silver marble and rolled it away from the potted fern. Chickadee felt the tension in her spring and tried to calculate how many revolutions of movement it still offered her. She thought it would suffice.  “Where is the missing wind-up key?” Sparrow hung from his line, waiting for the boy to wind him again.  “The live mouse has it.” Chickadee hopped forward and pecked at another invisible crumb, but did not waste the movement needed to look at Sparrow.  “What would a live mouse need with a windup key?”  “He does not need it,” said Chickadee. “But I do have need of it and he is in my service.”  All the gears in the room stopped for a moment as the other clockwork animals paused to listen. Even the nightingale stopped her song. In the sudden cessation of ticking, sound from the greater world outside crept in, bringing the babble of the fountain in the courtyard, the laughter of the boy, the purr of automobiles and from the far distance, the faint pealing of a clock.  “I suppose you would have us believe that he winds you?” said Sparrow.  “Not yet. Perhaps today.” She continued pecking the floor.  After a moment of nothing happening, the other animals returned to their tasks save for the sparrow. He hung from his line and beat his wings against his side.  “Ha! I see him. I see the live mouse behind the potted fern. You could too if you could fly.”  “I have no need.” Chickadee felt her clockwork beginning to slow. “Live Mouse!” she called. “It is time to fulfill our bargain.”  The silence came again as the other animals stopped to listen. Into this quiet came a peculiar scraping rattle and then the live mouse emerged from behind the potted fern with the missing wind-up key tied in his tail.  “What is he doing?” Sparrow squawked.  Chickadee bent to peck the ground so slowly she thought she might never touch it. A gear clicked forward and she tapped the floor. “Do you really need me to tell you that?”  Above her, Sparrow dangled on his line. “Live Mouse! Whatever she has promised you, I can give you also, only wind my flying mechanism.”  The live mouse twirled his whiskers and kept walking toward Chickadee. “Well now. That’s a real interesting proposition. How about a silver marble?”  “There is one behind the potted fern.”  “Not nomore.”  “Then a crystal from the chandelier.”  The live mouse wrinkled his nose. “If’n I can climb the chandelier to wind ya, then I reckon I can reach a crystal for myself.”  “I must have something you want.”  With the key paused by Chickadee’s side, the live mouse said, “That might be so.”  The live mouse set the tip of the key down like a cane and folded his paws over it. Settling back on his haunches, he tipped his head up to study Sparrow. “How ’bout, you give me one of your wings?”  Sparrow squawked.  “You ain’t got no need of ’em to fly, that right?” The live mouse looked down and idly twisted the key on the floor, as if he were winding the room. “Probly make you spin round faster, like one of them zeppelin thingamabobs. Whazzat called? Air-o-dye-namic.”  “A bird cannot fly without wings.”  “Now you and I both know that ain’t so. A live bird can’t fly without wings, but you’re a clockwork bird.”  “What would a live mouse know about clockworks?”  The live mouse laughed. “Ain’t you never heard of Hickory, Dickory and Dock? We mice have a long history with clockworks. Looking at you, I figure you won’t miss a wing none and without it dragging, you ought to be able to go faster and your windings would last you longer. Whaddya say? Wouldn’t it be a mite sight nicer to fly without having to wait for the boy to come back?”  “What would you do with my wing?”  “That,” the live mouse smiled, showing his sharp incisors, “is between me and Messrs DeCola and Wodzinski. So do we have a deal?”  “I will have to consider the matter.”  “Suit yourself.” The live mouse lifted the key and put the tip in Chickadee’s winding mechanism.  “Wait!” Sparrow flicked his wings as if anxious to be rid of them. “Yes, yes you may have my left wing, only wind me now. A bird is meant to fly.”  “All righty, then.”  Chickadee turned her head with painful slowness. “Now, Live Mouse, you and I have an agreement.”  “That we did and we do, but nothing in it says I can’t have another master.”  “That may well be, but the wind-up key belongs to me.”  “I reckon that’s true. Sorry, Sparrow. Looks as if I can’t help you none.” The live mouse sighed. “And I surely did want me one of them wings.”  Once again, he lifted the key to Chickadee’s side. Above them, Sparrow let out a squeal of metal. “Wait! Chickadee, there must be something I can offer you. You are going on a journey, yes? From here, I can tell you if any dangers lie on your route.”  “Only in this room and we are leaving it.”  “Leaving? And taking the key with you?”  “Just so. Do not worry. The boy will come to wind you eventually. And now, Live Mouse, if you would be so kind.”  “My other wing! You may have my other wing, only let the live mouse use the key to wind me.”  Chickadee paused, waiting for her gears to click forward so that she could look at the Sparrow. Her spring was so loose now, that each action took an eternity. “What would I do with one of your wings? I have two of my own.”  The other clockwork bird seemed baffled and hung on the end of the line flapping his wings as if he could fling them off.  The live mouse scraped a claw across the edge of the key. “It might come in real handy on our trip. Supposing Messrs DeCola and Wodzinski want a higher payment than you’re thinking they do. Why then you’d have something more to offer them.”  “And if they didn’t then we would have carried the wing with us for no reason.”  “Now as to that,” said the live mouse, “I can promise you that I’ll take it off your hands if’n we don’t need it.”  Chickadee laughed. “Oh, Live Mouse, I see now. Very well, I will accept Sparrow’s wing so that later you may have a full set. Messrs DeCola and Wodzinski will be happy to have two customers, I am certain.”  The live mouse bowed to her and wrapped the key in his tail again. “Sparrow, I’ll be right up.” Scampering across the floor, he disappeared into the wall.  Chickadee did not watch him go, she waited with her gaze still cocked upward toward Sparrow. With the live mouse gone, Chickadee became aware of how still the other clockworks were, watching their drama. Into the silence, Nightingale began to cautiously sing. Her beautiful warbles and chirps repeated through their song thrice before the live mouse appeared out of the ceiling on the chandelier’s chain. The crystals of the chandelier tinkled in a wild accompaniment to the ordered song of the nightingale.  The live mouse shimmied down the layers of crystals until he reached Sparrow’s flying mechanism. Crawling over that, he wrapped his paws around the string beneath it and slid down to sit on Sparrow’s back.  “First one’s for me.” His sharp incisors flashed in the chandelier’s light as he pried the tin loops up from the left wing. Tumbling free, it half fell, half floated to rattle against the floor below. “And now this is for the chickadee.”  Again, his incisors pulled the tin free and let the second wing drop.  Sparrow’s clockwork whirred audibly inside his body, with nothing to power. “I feel so light!”  “Told ya so.” The live mouse reached up and took the string in his paws. Hauling himself back up the line, he reached the flying mechanism in no time at all. “Ready now?”  “Yes! Oh yes, wind me! Wind me!”  Lickety-split, the key sank into the winding mechanism and the live mouse began turning it. The sweet familiar sound of a spring ratcheting tighter floated down from above, filling the room. The other clockwork animals crept closer; even Chickadee felt the longing brought on by the sound of winding.  When the live mouse stopped, Sparrow said, “No, no, I am not wound nearly tight enough yet.”  The live mouse braced himself with his tail around an arm of the chandelier and grunted as he turn the key again. And again. And again. “Enough?”  “Tighter.”  He kept winding.  “Enough?”  “Tighter. The boy never winds me fully.”  “All right.” The mouse turned the key three more times and stopped. “That’s it. Key won’t turn no more.”  A strange vibration ran through the sparrow’s body. It took Chickadee a moment to realize that he was trying to beat his wings with anticipation. “Then watch me fly.”  The live mouse pulled the key out of the flying mechanism and hopped up onto the chandelier. As he did, Sparrow swung into action. The flying mechanism whipped him forward and he shrieked with glee. His body was a blur against the ceiling. The chandelier trembled, then shook, then rattled as he spun faster than Chickadee had ever seen him.  “Live Mouse, you were rig—” With a snap, his flying mechanism broke free of the chandelier. “I’m flying!” Sparrow cried as he hurtled across the room. His body crashed into the window, shattering a pane as he flew through it.  The nightingale stopped her song in shock. Outside, the boy shrieked and his familiar footsteps hurried under the window. “Oh pooh. The clockwork sparrow is broken.”  The mother’s voice said, “Leave it alone. There’s glass everywhere.”  Overhead, the live mouse looked down and winked.  Chickadee pecked the ground, with her mechanism wound properly. The live mouse appeared at her side. “Thanks for the wings.”  “I trust they are satisfactory payment?”  “Sure enough. They look real pretty hanging on my wall.” He squinted at her. “So that’s it? You’re just going to keep on pecking the ground?”  “As long as you keep winding me.”  “Yeah. It’s funny, no one else wants my services.”  “A pity.”  “Got a question for you though. Will you tell me how to get to Messrs DeCola and Wodzinski?”  “Why ever for?”  “Well, I thought . . . I thought maybe Messrs DeCola and Wodzinski really could, I dunno, fix ’em on me so as I can fly.”  Chickadee rapped the ground with laughter. “No, Mouse, they cannot. We are all bound to our integral mechanisms.” She cocked her head at him. “You are a live mouse. I am a clockwork chickadee, and Messrs DeCola and Wodzinski are nothing more than names on a scrap of paper glued to the bottom of a table.” Mary Robinette Kowal is a professional puppeteer who moonlights as a writer. She has performed for LazyTown (CBS), the Center for Puppetry Arts, Jim Henson Pictures and founded Other Hand Productions. Her design work has garnered two UNIMA-USA Citations of Excellence, the highest award an American puppeteer can achieve.  Mrs. Kowal’s short fiction appears in Strange Horizons, Cosmos and CICADA. She is the art director of Shimmer and a graduate of Orson Scott Card’s Literary BootCamp. She is a current finalist for the Campbell Award for Best New Writer.", "text": "2520 words, short story\nClockwork Chickadee\nThe clockwork chickadee was not as pretty as the nightingale. But she did not mind. She pecked the floor when she was wound, looking for invisible bugs. And when she was not wound, she cocked her head and glared at the sparrow, whom she loathed with every tooth on every gear in her pressed-tin body.\nThe sparrow could fly.\nHe took no pains to conceal his contempt for those who could not. When his mechanism spun him around and around overhead, he twittered—not even a proper song—to call attention to his flight. Chickadee kept her head down when she could so as not to give him the satisfaction of her notice. It was clear to her that any bird could fly if only they were attached to a string like him. The flight, of which he was so proud, was not even an integral part of his clockwork. A wind-up engine hanging from the chandelier spun him in circles while he merely flapped his wings. Chickadee could do as much. And so she thought until she hatched an idea to show that Sparrow was not so very special.\nIt happened, one day, that Chickadee and Sparrow were shelved next to one another.\nSparrow, who lay tilted on his belly as his feet were only painted on, said, “How limiting the view is from here. Why, when I am flying I can see everything.”\n“Not everything, I’ll warrant,” said Chickadee. “Have you seen what is written underneath the table? Do you know how the silver marble got behind the potted fern, or where the missing wind-up key is?”\nSparrow flicked his wing at her. “Why should I care about such things when I can see the ceiling above and the plaster cherubs upon it. I can see the shelves below us and the mechanical menagerie upon it, even including the clockwork scarab and his lotus. I can see the fireplace, which shares the wall with us, none of which are visible from here nor to you.”\n“But I have seen all of these things as I have been carried to and from the shelf. In addition the boy has played with me at the fountain outside.”\n“What fountain?”\n“Ah! Can you not see the courtyard fountain when you fly?” Chickadee hopped a step closer to him. “Such a pity.”\n“Bah—Why should I care about any of this?”\n“For no reason today,” said Chickadee. “Perhaps tomorrow.”\n“What is written underneath the table?” Sparrow called as he swung in his orbit about the room, wings clicking against his side with each downstroke.\nChickadee pecked at the floor and shifted a cog to change her direction toward the table. “The address of Messrs DeCola and Wodzinski.”\n“Bah. Why should I care about them?”\n“Because they are master clockworkers. They can re-set cogs to create movements you would not think possible.”\n“I have all the movement I need. They can offer me nothing.”\n“You might change your mind.” Chickadee passed under the edge of the table. “Perhaps tomorrow.”\nAbove the table, Sparrow’s gears ground audibly in frustration.\nChickadee cocked her head to look up at the yellow slip of paper glued to the underside if the table. Its type was still crisp though the paper itself threatened to peel away. She scanned the corners of the room for movement. In the shadows by the fireplace, a live mouse caught her gaze. He winked.\n“How did the silver marble get behind the potted fern?” Sparrow asked as he lay on the shelf.\n“It fell out of the boy’s game and rolled across the floor to where I was pecking the ground. I waited but no one seemed to notice that it was gone, nor did they notice me, so I put my beak against it and pushed it behind the potted fern.”\n“You did? You stole from the boy?” Sparrow clicked his wings shut. “I find that hard to believe.”\n“You may not, today,” Chickadee said. “Perhaps tomorrow.”\nShe cocked her head to look away from him and to the corner where the live mouse now hid. The mouse put his forepaw on the silver marble and rolled it away from the potted fern. Chickadee felt the tension in her spring and tried to calculate how many revolutions of movement it still offered her. She thought it would suffice.\n“Where is the missing wind-up key?” Sparrow hung from his line, waiting for the boy to wind him again.\n“The live mouse has it.” Chickadee hopped forward and pecked at another invisible crumb, but did not waste the movement needed to look at Sparrow.\n“What would a live mouse need with a windup key?”\n“He does not need it,” said Chickadee. “But I do have need of it and he is in my service.”\nAll the gears in the room stopped for a moment as the other clockwork animals paused to listen. Even the nightingale stopped her song. In the sudden cessation of ticking, sound from the greater world outside crept in, bringing the babble of the fountain in the courtyard, the laughter of the boy, the purr of automobiles and from the far distance, the faint pealing of a clock.\n“I suppose you would have us believe that he winds you?” said Sparrow.\n“Not yet. Perhaps today.” She continued pecking the floor.\nAfter a moment of nothing happening, the other animals returned to their tasks save for the sparrow. He hung from his line and beat his wings against his side.\n“Ha! I see him. I see the live mouse behind the potted fern. You could too if you could fly.”\n“I have no need.” Chickadee felt her clockwork beginning to slow. “Live Mouse!” she called. “It is time to fulfill our bargain.”\nThe silence came again as the other animals stopped to listen. Into this quiet came a peculiar scraping rattle and then the live mouse emerged from behind the potted fern with the missing wind-up key tied in his tail.\n“What is he doing?” Sparrow squawked.\nChickadee bent to peck the ground so slowly she thought she might never touch it. A gear clicked forward and she tapped the floor. “Do you really need me to tell you that?”\nAbove her, Sparrow dangled on his line. “Live Mouse! Whatever she has promised you, I can give you also, only wind my flying mechanism.”\nThe live mouse twirled his whiskers and kept walking toward Chickadee. “Well now. That’s a real interesting proposition. How about a silver marble?”\n“There is one behind the potted fern.”\n“Not nomore.”\n“Then a crystal from the chandelier.”\nThe live mouse wrinkled his nose. “If’n I can climb the chandelier to wind ya, then I reckon I can reach a crystal for myself.”\n“I must have something you want.”\nWith the key paused by Chickadee’s side, the live mouse said, “That might be so.”\nThe live mouse set the tip of the key down like a cane and folded his paws over it. Settling back on his haunches, he tipped his head up to study Sparrow. “How ’bout, you give me one of your wings?”\nSparrow squawked.\n“You ain’t got no need of ’em to fly, that right?” The live mouse looked down and idly twisted the key on the floor, as if he were winding the room. “Probly make you spin round faster, like one of them zeppelin thingamabobs. Whazzat called? Air-o-dye-namic.”\n“A bird cannot fly without wings.”\n“Now you and I both know that ain’t so. A live bird can’t fly without wings, but you’re a clockwork bird.”\n“What would a live mouse know about clockworks?”\nThe live mouse laughed. “Ain’t you never heard of Hickory, Dickory and Dock? We mice have a long history with clockworks. Looking at you, I figure you won’t miss a wing none and without it dragging, you ought to be able to go faster and your windings would last you longer. Whaddya say? Wouldn’t it be a mite sight nicer to fly without having to wait for the boy to come back?”\n“What would you do with my wing?”\n“That,” the live mouse smiled, showing his sharp incisors, “is between me and Messrs DeCola and Wodzinski. So do we have a deal?”\n“I will have to consider the matter.”\n“Suit yourself.” The live mouse lifted the key and put the tip in Chickadee’s winding mechanism.\n“Wait!” Sparrow flicked his wings as if anxious to be rid of them. “Yes, yes you may have my left wing, only wind me now. A bird is meant to fly.”\n“All righty, then.”\nChickadee turned her head with painful slowness. “Now, Live Mouse, you and I have an agreement.”\n“That we did and we do, but nothing in it says I can’t have another master.”\n“That may well be, but the wind-up key belongs to me.”\n“I reckon that’s true. Sorry, Sparrow. Looks as if I can’t help you none.” The live mouse sighed. “And I surely did want me one of them wings.”\nOnce again, he lifted the key to Chickadee’s side. Above them, Sparrow let out a squeal of metal. “Wait! Chickadee, there must be something I can offer you. You are going on a journey, yes? From here, I can tell you if any dangers lie on your route.”\n“Only in this room and we are leaving it.”\n“Leaving? And taking the key with you?”\n“Just so. Do not worry. The boy will come to wind you eventually. And now, Live Mouse, if you would be so kind.”\n“My other wing! You may have my other wing, only let the live mouse use the key to wind me.”\nChickadee paused, waiting for her gears to click forward so that she could look at the Sparrow. Her spring was so loose now, that each action took an eternity. “What would I do with one of your wings? I have two of my own.”\nThe other clockwork bird seemed baffled and hung on the end of the line flapping his wings as if he could fling them off.\nThe live mouse scraped a claw across the edge of the key. “It might come in real handy on our trip. Supposing Messrs DeCola and Wodzinski want a higher payment than you’re thinking they do. Why then you’d have something more to offer them.”\n“And if they didn’t then we would have carried the wing with us for no reason.”\n“Now as to that,” said the live mouse, “I can promise you that I’ll take it off your hands if’n we don’t need it.”\nChickadee laughed. “Oh, Live Mouse, I see now. Very well, I will accept Sparrow’s wing so that later you may have a full set. Messrs DeCola and Wodzinski will be happy to have two customers, I am certain.”\nThe live mouse bowed to her and wrapped the key in his tail again. “Sparrow, I’ll be right up.” Scampering across the floor, he disappeared into the wall.\nChickadee did not watch him go, she waited with her gaze still cocked upward toward Sparrow. With the live mouse gone, Chickadee became aware of how still the other clockworks were, watching their drama. Into the silence, Nightingale began to cautiously sing. Her beautiful warbles and chirps repeated through their song thrice before the live mouse appeared out of the ceiling on the chandelier’s chain. The crystals of the chandelier tinkled in a wild accompaniment to the ordered song of the nightingale.\nThe live mouse shimmied down the layers of crystals until he reached Sparrow’s flying mechanism. Crawling over that, he wrapped his paws around the string beneath it and slid down to sit on Sparrow’s back.\n“First one’s for me.” His sharp incisors flashed in the chandelier’s light as he pried the tin loops up from the left wing. Tumbling free, it half fell, half floated to rattle against the floor below. “And now this is for the chickadee.”\nAgain, his incisors pulled the tin free and let the second wing drop.\nSparrow’s clockwork whirred audibly inside his body, with nothing to power. “I feel so light!”\n“Told ya so.” The live mouse reached up and took the string in his paws. Hauling himself back up the line, he reached the flying mechanism in no time at all. “Ready now?”\n“Yes! Oh yes, wind me! Wind me!”\nLickety-split, the key sank into the winding mechanism and the live mouse began turning it. The sweet familiar sound of a spring ratcheting tighter floated down from above, filling the room. The other clockwork animals crept closer; even Chickadee felt the longing brought on by the sound of winding.\nWhen the live mouse stopped, Sparrow said, “No, no, I am not wound nearly tight enough yet.”\nThe live mouse braced himself with his tail around an arm of the chandelier and grunted as he turn the key again. And again. And again. “Enough?”\n“Tighter.”\nHe kept winding.\n“Enough?”\n“Tighter. The boy never winds me fully.”\n“All right.” The mouse turned the key three more times and stopped. “That’s it. Key won’t turn no more.”\nA strange vibration ran through the sparrow’s body. It took Chickadee a moment to realize that he was trying to beat his wings with anticipation. “Then watch me fly.”\nThe live mouse pulled the key out of the flying mechanism and hopped up onto the chandelier. As he did, Sparrow swung into action. The flying mechanism whipped him forward and he shrieked with glee. His body was a blur against the ceiling. The chandelier trembled, then shook, then rattled as he spun faster than Chickadee had ever seen him.\n“Live Mouse, you were rig—” With a snap, his flying mechanism broke free of the chandelier. “I’m flying!” Sparrow cried as he hurtled across the room. His body crashed into the window, shattering a pane as he flew through it.\nThe nightingale stopped her song in shock. Outside, the boy shrieked and his familiar footsteps hurried under the window. “Oh pooh. The clockwork sparrow is broken.”\nThe mother’s voice said, “Leave it alone. There’s glass everywhere.”\nOverhead, the live mouse looked down and winked.\nChickadee pecked the ground, with her mechanism wound properly. The live mouse appeared at her side. “Thanks for the wings.”\n“I trust they are satisfactory payment?”\n“Sure enough. They look real pretty hanging on my wall.” He squinted at her. “So that’s it? You’re just going to keep on pecking the ground?”\n“As long as you keep winding me.”\n“Yeah. It’s funny, no one else wants my services.”\n“A pity.”\n“Got a question for you though. Will you tell me how to get to Messrs DeCola and Wodzinski?”\n“Why ever for?”\n“Well, I thought . . . I thought maybe Messrs DeCola and Wodzinski really could, I dunno, fix ’em on me so as I can fly.”\nChickadee rapped the ground with laughter. “No, Mouse, they cannot. We are all bound to our integral mechanisms.” She cocked her head at him. “You are a live mouse. I am a clockwork chickadee, and Messrs DeCola and Wodzinski are nothing more than names on a scrap of paper glued to the bottom of a table.”\nMary Robinette Kowal is a professional puppeteer who moonlights as a writer. She has performed for LazyTown (CBS), the Center for Puppetry Arts, Jim Henson Pictures and founded Other Hand Productions. Her design work has garnered two UNIMA-USA Citations of Excellence, the highest award an American puppeteer can achieve.\nMrs. Kowal’s short fiction appears in Strange Horizons, Cosmos and CICADA. She is the art director of Shimmer and a graduate of Orson Scott Card’s Literary BootCamp. She is a current finalist for the Campbell Award for Best New Writer.", "source": "https://clarkesworldmagazine.com/kowal_06_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Clockwork Chickadee by Mary Robinette Kowal"}