{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kelly Barnhill", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ECeqt+5vPmOVvG8SzMjQq/GL+To=", "id": null, "license": null, "comments": "", "raw_text": "3270 words, short story  The Taxidermist's Other Wife  1.  Not one of us has ever stepped inside the Taxidermist’s house. We have no need to do so. We already know what we’ll find.  2.  The Taxidermist has a mounted Howler Monkey in his office. Its mouth is open, lips curled outward like the rim of a trumpet. Its head is cocked sweetly to one side, as though reconsidering what it was just about to say. Its knees are bent, toes pigeoned inward in the classical stance, and—though this is a violation of protocol and is generally frowned upon by most who practice the art of taxidermy—its left hand is curled, poised just above the ape’s bum, as though about to scratch.  Or, perhaps it does scratch. Really, who’s to say?  In any case, it is a useless, frivolous gesture, but so furiously ruddy with life (or the side-effects of life), that it takes the viewer aback. People have petted the Howler Monkey. Spoken to it. Loved it. They’ve checked its body for nits. They’ve found themselves unaccountably wanting to scratch themselves—and they do, when they think no one is watching.  The Taxidermist is always watching.  And later, at night, when they’ve left the office, when they’ve left the Howler behind and returned home, they toss and shiver in bed, dreaming of that lonely howl across the empty fields. And sometimes, they howl in return.  The Howler makes them forget why they came to the Taxidermist’s office in the first place. They wander away, complaints un-filed, petitions un-delivered, pieces of mind un-given.  The Taxidermist loves his Howler Monkey. His secretary, on the other hand, does not.  “Sir,” his secretary says, bringing in a file. “For the meeting.” She says the word “meeting” with a certain accusation. She lets the file hover over the desk before fanning her fingers, letting the thing hit the desk with a slap.  “Did you know,” the Taxidermist says, “that when Pliny attacked Carthage, he entered the temple of Astarte and found it filled with no less than thirty mountain gorillas? Each one was exquisitely mounted, painstakingly preserved, and, apparently, terrifying. The poor man turned on his heel and ran from the temple, claiming it had been seized by Gorgons.” He sits at his desk, ancient books opened to different pages and stacked spine to open spine for ease of access. The secretary presses her lips into a tight, long line. She is the former librarian, first working, then simply volunteering for the former library. She disapproves of the wanton opening of books. She shudders at the open splay of tight spines, the casual rustle of unloved pages like the whisper of lifting skirts.  The Taxidermist presses his fingers to his mouth to suppress a burp, though he pretends to clear his throat. He continues. “It is, they believe, the first indication that the art of specimen preservation is not a modern pastime as previously thought. I wonder if the Carthaginian priests thought to recreate the minutia of the mundane as we do now. I wonder what they thought they were preserving?”  The secretary flares her nostrils, forcing her gaze away from her employer. The Taxidermist closed the library. Everyone knows this. Everyone blames him. The secretary answers his phones and files his documents and maintains his correspondences and organizes his meetings. But she hates the Taxidermist. Hates him.  “I’m not certain your research is correct,” the secretary says. “But gorillas have nothing to do with your meeting tonight.”  “My dear Miss Sorensen,” the Taxidermist says, peering into a heavily diagrammed book, its ancient dust rising from its pages like smoke, “it has everything to do with the meeting tonight. You’ll see.”  3.  The Taxidermist is the mayor, and has been for the last fifteen years. We did not vote for him. We’ve never met anyone who has. And yet he has won, term after term. A landslide. We do not offer our congratulations nor do we bring casseroles or homemade bars to his house, nor do we come to his Christmas parties or summer barbeques (we already know what’s in that house. We know.).  This, we are sure, hurts the Taxidermist’s other wife. What wife wouldn’t be wounded by such a snub? She is a sweet, pretty thing. Young. Large eyes. Tight, smooth skin. She grew up four towns over, or so the story goes. Each day she pushes open the large, heavily carved front door and stands on the porch. She brushes a few tendrils of shellacked hair from her face with the backs of her fingers. She adjusts her crisp, white gloves.  She is perfect. Too perfect. Her symmetry jostles the eye. Her body moves without hesitancy, without the irregular rhythm of muscle and bone.  She walks from their house at the center of town, past what used to be the butcher shop and what used to be the hardware store and what used to be the Shoe Emporium and what used to be the offices of our former newspaper until she reaches her husband’s office at the Town Hall. She wears high heels, even in winter, that click coldly against the cracked sidewalk. She doesn’t trip. She doesn’t break stride. She wears a skirt that skims her young thighs and flares slightly at her bending knees. She used to smile at us when she passed, but she doesn’t anymore. We never smiled back. Instead, she keeps her lovely face porcelain-still, her mouth like a rosebud in a bowl of milk. A doll’s mouth.  We want to love her. We wish we could love her. But we can’t. We remember the Taxidermist’s first wife. We remember and remember and remember.  4.  Taxidermy is more than Art. It is more than Love. The Taxidermist has explained this to us, but we have closed our ears. We change the subject. We scan the sky for signs of rain.  Still, words have a way of leaking in. Of desiccating the will. Of freezing the mind in a single perfect moment. A state of bliss.  “If the artisan does not love the expired subject on his table, it is true, the final product will be a cold, dead thing. A monstrosity. A hideous copy of what once was unique and alive and beautiful.”  We told ourselves we weren’t listening. Still, we found ourselves nodding. We found ourselves agreeing. It is hideous when a thing isn’t loved.  “But the love is not enough,” the Taxidermist insisted. “Desire, friends. Desire. When God leaned against the riverbank, when he pressed his fingers into the warm mud and pulled out a man, what was the motivation? Desire. God saw mud and made it Man. He made Man because he wanted Man. We see death, and desire Life. Love isn’t enough. You have to want to make it live.”  5.  There was no funeral for Margaret, the first wife.  We learned she was sick by accident. It was a secret. We whispered about it in the bar and murmured on porches, but in public we pretended we didn’t know. We learned she was dead in the “Fond Memories” section of the newspaper. That was when we had a newspaper. We tried to grieve. We wanted to drape our arms around the Taxidermist, to feel his tears wetting the shoulders of our shirts, to wrap his hand with our hands and squeeze. We left frozen hot dishes and flowers in pots and sliced ham on the porch when the Taxidermist refused to open the door.  “Here,” we shouted at the jamb. “We’ve brought food. Wine. Whiskey. We brought our presence and our ears and our love. Let us in and we’ll feed you. We’ll share a drink and share a song and make you live again. And she will live in the spaces between word and word, between breath and breath, between your tears and our tears. She will live.”  But the Taxidermist would not open the door. During the night, he gathered his gifts and threw them in the trash.  6.  We listened to the old men in Ole’s Tavern suck down shots and chasers and fuss over the meeting in the school. Or the building that will soon not be a school.  “Not much use pretending we’re still a town if the school’s gone.”  “We stopped pretending we were a town after the grain elevator closed.”  “And when the butcher shop shut its doors. Can’t call yourself a town if you can’t get a fresh hock for supper. If you don’t have a locker to put your winter’s buck.”  “Taxidermist’s got a lot of damn gall closing the school mid year. If he was any sort of a man, he’d set aside his own salary rather than pull the rug out from underneath a bunch of little kids.”  “Not much of a bunch. Just fifty. On a good day. When was the last good day?”  “We stopped pretending we were a town when the hardware store closed. And the seed store. And the gas station. And the green grocer. And the shoe shop. At least we still can pickle ourselves at Ole’s. Soon, he’ll just shove each one of us into a bunch of damn mason jars and line us up on the shelf. He’ll keep us topped up with nice, clear vodka so we can see. Folk’ll come in looking for the town and find it looking right back at ’em, shelves and shelves of blinking eyes.” Arne says this. He’s always been a morbid fellow.  “The Taxidermist’ll like it though,” Zeke Hanson says. “He’ll like it very much.”  We agree.  7.  Night falls early in November. In those waning moments of light, the sky paints its face like a harlot (overripe rouge, stained lips, unbuttoned taffeta spreading outwards like wings), before opening itself wide to the void of space. Each jagged shard of light in the darkness is a tiny message sent from the recesses of time. “You are alone,” the stars say. “You are alone. You are still alone.”  We pull our coats tightly against the howl of the wind and start our cars.  The school is slightly outside the town, and it sits on a small rectangle cut out of Martin Hovde’s sod farm. The schoolyard is packed earth with a single metal swingset for the children to play on. The yard is dusty from their feet, every speck of green crushed by the insistence of play. Nothing grows. Just outside the schoolyard is the endless grass of the Hovde farm. He steamrolls it twice a year to keep it as flat as any floor and then he burns it, again and again, to give the grass a good, rich start. It is green as snakes, and softer than a lie. The children are not allowed to play on it. Indeed, if they so much as set one foot upon that green, green grass, they will be sent home with a note explaining the rules of their suspension.  Once, a year ago, the children broke free in one large mass, moving in a joy of arm and leg and muscle, feeling the gooey give of the sod under their feet. They were all suspended. They spent their day off home and in bed, vomiting bile and blood. Martin Hovde denied that the fertilizer had sickened the children. He said, most likely, it was guilt.  We park our cars next to the school but do not lock them. No one locks their doors. This is a small town. A good town. Or it was, anyway. We hold our coats closed tightly at our throats and bend our backs against the wind. The stars are cold and sharp above our heads and the wind howls across the wide, empty fields.  8.  Taxidermy must embrace imperfection. It is a weak practitioner who feels the need to extend the leg of a lamed cougar cub, or repair the jagged scar above the eye of an ancient wolf. Taxidermy, in its soul, is the celebration of life, the recreation of a single moment in a sea of moments. The taxidermist must build motivation, history, consequence, action, reaction, into one, perfect gesture.  The taxidermist’s diorama is a poem.  A song.  A short story.  “We are all just a collection of faults,” the Taxidermist told us once. “A myriad of imperfections through which shines divine Perfection. You see? It is our flaws that make us beloved by heaven. It is our scars and handicaps and lack of symmetry that proves that we are—or once were—alive. The more we attempt to force our corrupted idea of the Perfect and the Good upon what is actually and deeply perfect and good, the further we are from the divine. Reveal the subject as the subject was, and you reveal the fingerprints of God.”  We have shut our ears to the Taxidermist. We have stopped listening to his hypocrisy.  We cannot bear to tell him that this is the very reason why we can never love his other wife.  9.  The Taxidermist’s other wife greets us while we come in. Her eyes light upon each coming person and dim when they pass. Her lips spread open into a smile. We shudder at those straight, white teeth. We turn our gaze from that flawless skin. She tilts her head to one side and blinks her large eyes.  (There! We gasp. We grab one another’s shirts and pull. We whisper in one another’s ears. Did you hear that? The whir of metal. The click of motor. She doesn’t clear her throat. She doesn’t sigh. She doesn’t lick her lips, or adjust her skirt. She doesn’t pass gas, or snort when she laughs, or cough.) We have examined her skin. We have watched her pass. We’ve looked for clues but have come away with nothing.  “The efficient preservationist leaves no trace of his hand,” the Taxidermist told us once. “It is a dim fellow who has the tools of the trade, who has centuries of experience to guide his practice, and still leaves evidence of stitching. Who still leaves a seam to mar the life that he sets out to create. Do not repeat the blunder of that poor fool in Austria. Do not let the Doctor’s mistakes be your mistakes.”  We would not expect to see scars.  We would not expect to see seams.  The Taxidermist’s other wife lays her hand upon our arms as we pass. We shiver. Even through our coats we can feel the stony cold of those fingers. Even through our scarves, we can smell the formaldehyde on her breath.  10.  The Taxidermist takes the podium. His other wife sits in a folding chair just behind. She crosses, then uncrosses, then crosses her legs again. She rests her hands, one on top of the other, on her knees. She cocks her head to one side. A studied look of wifely admiration on her face.  (We know! We know what she is. Look in her eyes. Look under her skin. We know what we’ll find.)  The Taxidermist taps his microphone three times. He smiles at the audience. The audience does not smile back.  “My friends,” the Taxidermist says.  (You are no one’s friend. You closed the library. You’re closing the school. We are pickled with memory, preserved on porches and church basements and bars. We blink through worlds of liquor and mason jars. You have frozen us in time.)  “This isn’t easy for me to say,” the Taxidermist says easily. “We are down to fifty students. That’s all. What we get from the state isn’t enough to cover the heat for the building. It doesn’t cover the health insurance for the employees. Our school, once the pride of the county, is falling apart. It is dying.”  (We are dying. We are dying and we don’t know why.)  “Now, I recognize that, with the school closed, we will be forced to bus our children all the way to Harris, and I recognize that it is a long ride for little ones, but I’m afraid it cannot be helped. Those who do not want their children going so far away can consider homeschooling. We can all come together to help make that happen. This is a community.”  (It was a community. Now it is a cold, dead thing. We are alone, we are alone, we are so alone.)  “It is true that we loved the school.”  (No. We loved Margaret.)  “And it is true that we will mourn its passing.”  (We wanted to mourn her. We wanted our grief to prove that we aren’t alone. We wanted our grief to show that we are—or were—alive.)  “But we now have an opportunity. Preservation, my friends. The dead are not gone when we preserve what is left.”  The Taxidermist’s other wife lifts her hands, preparing to clap. Her lips unfurl in a mechanical smile. Our eyes dazzle and spin in the glare of those perfect teeth. She splays her fingers out and brings her hands together.  But once her palms are a half an inch apart from one another, they stutter and halt. The lights behind her eyes flicker and dim. Her lips freeze in that lovely smile—pink lips insinuating themselves into the white mounds of her cheeks. She is porcelain. She is glass. She is petal and stone and milk. She doesn’t move. The Taxidermist doesn’t notice.  “We, right now, are sitting on holy ground. How many of us first fell in love on this very schoolyard? And here in these halls, how many of us first discovered the tools that would make us the men and women that we are today? Our lives are written on memory. We preserve the memory—in its perfection, in its state of bliss, and we preserve ourselves.”  The Taxidermist’s other wife does not move. She does not blink. She is lifeless, breathless, perfect. She is memory and history and longing.  There are stitches hidden under her collarbone.  (We know! We know what’s in there! We know what we’ll find!)  There are seams sliding along the curve of her spine.  (A gesture. A moment. Proof of life, or the memory of life.)  Margaret.  (We wanted to mourn you. We wanted to grieve. We wanted his tears on our shoulders, his hands in our hands. We wanted to sing songs and tell stories and let you live in the spaces between word and word, between breath and breath.)  “My wife,” the Taxidermist says.  (Margaret.)  “Thinks I’m crazy.”  (She doesn’t think. She simply is. A memory. A state of bliss.)  “But it can work. We can preserve what we have. We can turn our loss into a single perfect moment. We can turn this school into a memory of a school. A moment in time. The fingerprints of a thousand hands, and the mingling of a thousand breaths. And it will be proof forever that we are not alone.”  (We are alone.)  “We are not alone.”  (We are alone. We are still alone.)  The Taxidermist’s other wife does not move.  (Margaret.)  She does not clap.  (Margaret.)  And we feel ourselves lifting. We feel our souls unfurling like wings. We feel the howl of the wind and the vastness of space and the tiny voices of the distant stars. We feel our stitching and our seams, the clean line of empty bones, the weight of plaster and spun glass. We taste arsenic and salt, the grease of leather, the dust of hair. We feel the beat and the longing of our broken, paper hearts. And we love the Taxidermist’s other wife.  Love her. Kelly Barnhill's work has appeared in Postscripts, Weird Tales, Fantasy, The Sun, Sybil's Garage and other publications. She also writes high-interest nonfiction books for children (the fact that she has written books about sea monsters, sewer systems, eyeless salamanders and pee, has made her very popular at children's parties). Her first novel The Mostly True Story Of Jack, a middle grade fantasy set in rural Iowa (a lonely boy, and avenging girl, a mysterious house, two possibly murderous cats, a remarkable skateboard, and a nasty bit of magic) will be released next summer by Little, Brown. She is, by all accounts, ridiculously excited about it. She is a former schoolteacher, a former bartender, a former janitor, a former receptionist, a former park ranger, a former wildland firefighter, and a former waitress. The sum of these experiences have prepared her for nothing—save freelance writing, which she has been happily doing for the past six years. She lives in Minneapolis with her brilliant husband, her three evil-genius children, and her emotionally unstable dog.", "text": "3270 words, short story\nThe Taxidermist's Other Wife\n1.\nNot one of us has ever stepped inside the Taxidermist’s house. We have no need to do so. We already know what we’ll find.\n2.\nThe Taxidermist has a mounted Howler Monkey in his office. Its mouth is open, lips curled outward like the rim of a trumpet. Its head is cocked sweetly to one side, as though reconsidering what it was just about to say. Its knees are bent, toes pigeoned inward in the classical stance, and—though this is a violation of protocol and is generally frowned upon by most who practice the art of taxidermy—its left hand is curled, poised just above the ape’s bum, as though about to scratch.\nOr, perhaps it does scratch. Really, who’s to say?\nIn any case, it is a useless, frivolous gesture, but so furiously ruddy with life (or the side-effects of life), that it takes the viewer aback. People have petted the Howler Monkey. Spoken to it. Loved it. They’ve checked its body for nits. They’ve found themselves unaccountably wanting to scratch themselves—and they do, when they think no one is watching.\nThe Taxidermist is always watching.\nAnd later, at night, when they’ve left the office, when they’ve left the Howler behind and returned home, they toss and shiver in bed, dreaming of that lonely howl across the empty fields. And sometimes, they howl in return.\nThe Howler makes them forget why they came to the Taxidermist’s office in the first place. They wander away, complaints un-filed, petitions un-delivered, pieces of mind un-given.\nThe Taxidermist loves his Howler Monkey. His secretary, on the other hand, does not.\n“Sir,” his secretary says, bringing in a file. “For the meeting.” She says the word “meeting” with a certain accusation. She lets the file hover over the desk before fanning her fingers, letting the thing hit the desk with a slap.\n“Did you know,” the Taxidermist says, “that when Pliny attacked Carthage, he entered the temple of Astarte and found it filled with no less than thirty mountain gorillas? Each one was exquisitely mounted, painstakingly preserved, and, apparently, terrifying. The poor man turned on his heel and ran from the temple, claiming it had been seized by Gorgons.” He sits at his desk, ancient books opened to different pages and stacked spine to open spine for ease of access. The secretary presses her lips into a tight, long line. She is the former librarian, first working, then simply volunteering for the former library. She disapproves of the wanton opening of books. She shudders at the open splay of tight spines, the casual rustle of unloved pages like the whisper of lifting skirts.\nThe Taxidermist presses his fingers to his mouth to suppress a burp, though he pretends to clear his throat. He continues. “It is, they believe, the first indication that the art of specimen preservation is not a modern pastime as previously thought. I wonder if the Carthaginian priests thought to recreate the minutia of the mundane as we do now. I wonder what they thought they were preserving?”\nThe secretary flares her nostrils, forcing her gaze away from her employer. The Taxidermist closed the library. Everyone knows this. Everyone blames him. The secretary answers his phones and files his documents and maintains his correspondences and organizes his meetings. But she hates the Taxidermist. Hates him.\n“I’m not certain your research is correct,” the secretary says. “But gorillas have nothing to do with your meeting tonight.”\n“My dear Miss Sorensen,” the Taxidermist says, peering into a heavily diagrammed book, its ancient dust rising from its pages like smoke, “it has everything to do with the meeting tonight. You’ll see.”\n3.\nThe Taxidermist is the mayor, and has been for the last fifteen years. We did not vote for him. We’ve never met anyone who has. And yet he has won, term after term. A landslide. We do not offer our congratulations nor do we bring casseroles or homemade bars to his house, nor do we come to his Christmas parties or summer barbeques (we already know what’s in that house. We know.).\nThis, we are sure, hurts the Taxidermist’s other wife. What wife wouldn’t be wounded by such a snub? She is a sweet, pretty thing. Young. Large eyes. Tight, smooth skin. She grew up four towns over, or so the story goes. Each day she pushes open the large, heavily carved front door and stands on the porch. She brushes a few tendrils of shellacked hair from her face with the backs of her fingers. She adjusts her crisp, white gloves.\nShe is perfect. Too perfect. Her symmetry jostles the eye. Her body moves without hesitancy, without the irregular rhythm of muscle and bone.\nShe walks from their house at the center of town, past what used to be the butcher shop and what used to be the hardware store and what used to be the Shoe Emporium and what used to be the offices of our former newspaper until she reaches her husband’s office at the Town Hall. She wears high heels, even in winter, that click coldly against the cracked sidewalk. She doesn’t trip. She doesn’t break stride. She wears a skirt that skims her young thighs and flares slightly at her bending knees. She used to smile at us when she passed, but she doesn’t anymore. We never smiled back. Instead, she keeps her lovely face porcelain-still, her mouth like a rosebud in a bowl of milk. A doll’s mouth.\nWe want to love her. We wish we could love her. But we can’t. We remember the Taxidermist’s first wife. We remember and remember and remember.\n4.\nTaxidermy is more than Art. It is more than Love. The Taxidermist has explained this to us, but we have closed our ears. We change the subject. We scan the sky for signs of rain.\nStill, words have a way of leaking in. Of desiccating the will. Of freezing the mind in a single perfect moment. A state of bliss.\n“If the artisan does not love the expired subject on his table, it is true, the final product will be a cold, dead thing. A monstrosity. A hideous copy of what once was unique and alive and beautiful.”\nWe told ourselves we weren’t listening. Still, we found ourselves nodding. We found ourselves agreeing. It is hideous when a thing isn’t loved.\n“But the love is not enough,” the Taxidermist insisted. “Desire, friends. Desire. When God leaned against the riverbank, when he pressed his fingers into the warm mud and pulled out a man, what was the motivation? Desire. God saw mud and made it Man. He made Man because he wanted Man. We see death, and desire Life. Love isn’t enough. You have to want to make it live.”\n5.\nThere was no funeral for Margaret, the first wife.\nWe learned she was sick by accident. It was a secret. We whispered about it in the bar and murmured on porches, but in public we pretended we didn’t know. We learned she was dead in the “Fond Memories” section of the newspaper. That was when we had a newspaper. We tried to grieve. We wanted to drape our arms around the Taxidermist, to feel his tears wetting the shoulders of our shirts, to wrap his hand with our hands and squeeze. We left frozen hot dishes and flowers in pots and sliced ham on the porch when the Taxidermist refused to open the door.\n“Here,” we shouted at the jamb. “We’ve brought food. Wine. Whiskey. We brought our presence and our ears and our love. Let us in and we’ll feed you. We’ll share a drink and share a song and make you live again. And she will live in the spaces between word and word, between breath and breath, between your tears and our tears. She will live.”\nBut the Taxidermist would not open the door. During the night, he gathered his gifts and threw them in the trash.\n6.\nWe listened to the old men in Ole’s Tavern suck down shots and chasers and fuss over the meeting in the school. Or the building that will soon not be a school.\n“Not much use pretending we’re still a town if the school’s gone.”\n“We stopped pretending we were a town after the grain elevator closed.”\n“And when the butcher shop shut its doors. Can’t call yourself a town if you can’t get a fresh hock for supper. If you don’t have a locker to put your winter’s buck.”\n“Taxidermist’s got a lot of damn gall closing the school mid year. If he was any sort of a man, he’d set aside his own salary rather than pull the rug out from underneath a bunch of little kids.”\n“Not much of a bunch. Just fifty. On a good day. When was the last good day?”\n“We stopped pretending we were a town when the hardware store closed. And the seed store. And the gas station. And the green grocer. And the shoe shop. At least we still can pickle ourselves at Ole’s. Soon, he’ll just shove each one of us into a bunch of damn mason jars and line us up on the shelf. He’ll keep us topped up with nice, clear vodka so we can see. Folk’ll come in looking for the town and find it looking right back at ’em, shelves and shelves of blinking eyes.” Arne says this. He’s always been a morbid fellow.\n“The Taxidermist’ll like it though,” Zeke Hanson says. “He’ll like it very much.”\nWe agree.\n7.\nNight falls early in November. In those waning moments of light, the sky paints its face like a harlot (overripe rouge, stained lips, unbuttoned taffeta spreading outwards like wings), before opening itself wide to the void of space. Each jagged shard of light in the darkness is a tiny message sent from the recesses of time. “You are alone,” the stars say. “You are alone. You are still alone.”\nWe pull our coats tightly against the howl of the wind and start our cars.\nThe school is slightly outside the town, and it sits on a small rectangle cut out of Martin Hovde’s sod farm. The schoolyard is packed earth with a single metal swingset for the children to play on. The yard is dusty from their feet, every speck of green crushed by the insistence of play. Nothing grows. Just outside the schoolyard is the endless grass of the Hovde farm. He steamrolls it twice a year to keep it as flat as any floor and then he burns it, again and again, to give the grass a good, rich start. It is green as snakes, and softer than a lie. The children are not allowed to play on it. Indeed, if they so much as set one foot upon that green, green grass, they will be sent home with a note explaining the rules of their suspension.\nOnce, a year ago, the children broke free in one large mass, moving in a joy of arm and leg and muscle, feeling the gooey give of the sod under their feet. They were all suspended. They spent their day off home and in bed, vomiting bile and blood. Martin Hovde denied that the fertilizer had sickened the children. He said, most likely, it was guilt.\nWe park our cars next to the school but do not lock them. No one locks their doors. This is a small town. A good town. Or it was, anyway. We hold our coats closed tightly at our throats and bend our backs against the wind. The stars are cold and sharp above our heads and the wind howls across the wide, empty fields.\n8.\nTaxidermy must embrace imperfection. It is a weak practitioner who feels the need to extend the leg of a lamed cougar cub, or repair the jagged scar above the eye of an ancient wolf. Taxidermy, in its soul, is the celebration of life, the recreation of a single moment in a sea of moments. The taxidermist must build motivation, history, consequence, action, reaction, into one, perfect gesture.\nThe taxidermist’s diorama is a poem.\nA song.\nA short story.\n“We are all just a collection of faults,” the Taxidermist told us once. “A myriad of imperfections through which shines divine Perfection. You see? It is our flaws that make us beloved by heaven. It is our scars and handicaps and lack of symmetry that proves that we are—or once were—alive. The more we attempt to force our corrupted idea of the Perfect and the Good upon what is actually and deeply perfect and good, the further we are from the divine. Reveal the subject as the subject was, and you reveal the fingerprints of God.”\nWe have shut our ears to the Taxidermist. We have stopped listening to his hypocrisy.\nWe cannot bear to tell him that this is the very reason why we can never love his other wife.\n9.\nThe Taxidermist’s other wife greets us while we come in. Her eyes light upon each coming person and dim when they pass. Her lips spread open into a smile. We shudder at those straight, white teeth. We turn our gaze from that flawless skin. She tilts her head to one side and blinks her large eyes.\n(There! We gasp. We grab one another’s shirts and pull. We whisper in one another’s ears. Did you hear that? The whir of metal. The click of motor. She doesn’t clear her throat. She doesn’t sigh. She doesn’t lick her lips, or adjust her skirt. She doesn’t pass gas, or snort when she laughs, or cough.) We have examined her skin. We have watched her pass. We’ve looked for clues but have come away with nothing.\n“The efficient preservationist leaves no trace of his hand,” the Taxidermist told us once. “It is a dim fellow who has the tools of the trade, who has centuries of experience to guide his practice, and still leaves evidence of stitching. Who still leaves a seam to mar the life that he sets out to create. Do not repeat the blunder of that poor fool in Austria. Do not let the Doctor’s mistakes be your mistakes.”\nWe would not expect to see scars.\nWe would not expect to see seams.\nThe Taxidermist’s other wife lays her hand upon our arms as we pass. We shiver. Even through our coats we can feel the stony cold of those fingers. Even through our scarves, we can smell the formaldehyde on her breath.\n10.\nThe Taxidermist takes the podium. His other wife sits in a folding chair just behind. She crosses, then uncrosses, then crosses her legs again. She rests her hands, one on top of the other, on her knees. She cocks her head to one side. A studied look of wifely admiration on her face.\n(We know! We know what she is. Look in her eyes. Look under her skin. We know what we’ll find.)\nThe Taxidermist taps his microphone three times. He smiles at the audience. The audience does not smile back.\n“My friends,” the Taxidermist says.\n(You are no one’s friend. You closed the library. You’re closing the school. We are pickled with memory, preserved on porches and church basements and bars. We blink through worlds of liquor and mason jars. You have frozen us in time.)\n“This isn’t easy for me to say,” the Taxidermist says easily. “We are down to fifty students. That’s all. What we get from the state isn’t enough to cover the heat for the building. It doesn’t cover the health insurance for the employees. Our school, once the pride of the county, is falling apart. It is dying.”\n(We are dying. We are dying and we don’t know why.)\n“Now, I recognize that, with the school closed, we will be forced to bus our children all the way to Harris, and I recognize that it is a long ride for little ones, but I’m afraid it cannot be helped. Those who do not want their children going so far away can consider homeschooling. We can all come together to help make that happen. This is a community.”\n(It was a community. Now it is a cold, dead thing. We are alone, we are alone, we are so alone.)\n“It is true that we loved the school.”\n(No. We loved Margaret.)\n“And it is true that we will mourn its passing.”\n(We wanted to mourn her. We wanted our grief to prove that we aren’t alone. We wanted our grief to show that we are—or were—alive.)\n“But we now have an opportunity. Preservation, my friends. The dead are not gone when we preserve what is left.”\nThe Taxidermist’s other wife lifts her hands, preparing to clap. Her lips unfurl in a mechanical smile. Our eyes dazzle and spin in the glare of those perfect teeth. She splays her fingers out and brings her hands together.\nBut once her palms are a half an inch apart from one another, they stutter and halt. The lights behind her eyes flicker and dim. Her lips freeze in that lovely smile—pink lips insinuating themselves into the white mounds of her cheeks. She is porcelain. She is glass. She is petal and stone and milk. She doesn’t move. The Taxidermist doesn’t notice.\n“We, right now, are sitting on holy ground. How many of us first fell in love on this very schoolyard? And here in these halls, how many of us first discovered the tools that would make us the men and women that we are today? Our lives are written on memory. We preserve the memory—in its perfection, in its state of bliss, and we preserve ourselves.”\nThe Taxidermist’s other wife does not move. She does not blink. She is lifeless, breathless, perfect. She is memory and history and longing.\nThere are stitches hidden under her collarbone.\n(We know! We know what’s in there! We know what we’ll find!)\nThere are seams sliding along the curve of her spine.\n(A gesture. A moment. Proof of life, or the memory of life.)\nMargaret.\n(We wanted to mourn you. We wanted to grieve. We wanted his tears on our shoulders, his hands in our hands. We wanted to sing songs and tell stories and let you live in the spaces between word and word, between breath and breath.)\n“My wife,” the Taxidermist says.\n(Margaret.)\n“Thinks I’m crazy.”\n(She doesn’t think. She simply is. A memory. A state of bliss.)\n“But it can work. We can preserve what we have. We can turn our loss into a single perfect moment. We can turn this school into a memory of a school. A moment in time. The fingerprints of a thousand hands, and the mingling of a thousand breaths. And it will be proof forever that we are not alone.”\n(We are alone.)\n“We are not alone.”\n(We are alone. We are still alone.)\nThe Taxidermist’s other wife does not move.\n(Margaret.)\nShe does not clap.\n(Margaret.)\nAnd we feel ourselves lifting. We feel our souls unfurling like wings. We feel the howl of the wind and the vastness of space and the tiny voices of the distant stars. We feel our stitching and our seams, the clean line of empty bones, the weight of plaster and spun glass. We taste arsenic and salt, the grease of leather, the dust of hair. We feel the beat and the longing of our broken, paper hearts. And we love the Taxidermist’s other wife.\nLove her.\nKelly Barnhill's work has appeared in Postscripts, Weird Tales, Fantasy, The Sun, Sybil's Garage and other publications. She also writes high-interest nonfiction books for children (the fact that she has written books about sea monsters, sewer systems, eyeless salamanders and pee, has made her very popular at children's parties). Her first novel The Mostly True Story Of Jack, a middle grade fantasy set in rural Iowa (a lonely boy, and avenging girl, a mysterious house, two possibly murderous cats, a remarkable skateboard, and a nasty bit of magic) will be released next summer by Little, Brown. She is, by all accounts, ridiculously excited about it. She is a former schoolteacher, a former bartender, a former janitor, a former receptionist, a former park ranger, a former wildland firefighter, and a former waitress. The sum of these experiences have prepared her for nothing—save freelance writing, which she has been happily doing for the past six years. She lives in Minneapolis with her brilliant husband, her three evil-genius children, and her emotionally unstable dog.", "source": "https://clarkesworldmagazine.com/barnhill_12_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Taxidermist's Other Wife by Kelly Barnhill"}