{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Julie Dillon", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "7Ur0NobLSs0piwzN/QRseuNsxHw=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  The Process of Creating \"Nautili\"  For my latest illustration, I wasn't sure what I wanted to paint. I knew I wanted to include a portrait, so I started with some random shapes using the pattern chalk tool in Painter X (using mostly some patterns of the Fibonacci spiral) and sketched a face within all that mess. Even though I still wasn't sure about the direction, this supplied me with a basic framework to start from.  When I'm lacking in inspiration, I like to use the pattern chalk brush for getting some random shapes in my early drafts to generate some fresh and unexpected ideas. Using the Pattern Chalk tool is something I learned from Andrew Jones' tutorials here. Andrew is a hero of mine. His work amazing.   Next, I started defining the face and shapes a little more and flipped the canvas horizontally. Originally I was thinking of making it all more abstract, but I've been finding it challenging to make an abstract look properly \"finished.\" It either looks too sketchy, or it starts getting too rendered and realistic. One of these days, I'll find the proper balance.   I couldn't figure out what I wanted to do with the spiraling forms on her head until I realized that they'd make awesome nautilus shells. While rendering the shells, I added in a few other underwater themed elements and colors.   At this point, the portrait began to take shape, but I was still uncertain as to whether or not it should keep it that abstracted or start solidifying the forms.   I accidentally flattened some parts  of my draft, so there were a few steps here that will not be pictured here. I decided to make all nautili face the same way in order to give the sense that they were all part of a moving swarm and not a random group clustering around the woman's head. I also began making some drastic changes to the color scheme. I liked where previous drafts were going color-wise, but I'm such a sucker for bright colors that I have a hard time staying away from them sometimes.   Next, I expanded the canvas to include more of the woman's body and add more nautilus shells in the upper part of the image.   Now it was time to tighten things up a bit, rendering the nautilus shells and trying to figure out how the hands should be positioned..   I decided the colors were too dull, so I set my brush to \"Hard Light\" and went nuts painting the sky purple and yellow.   Around this point I was tiring of rendering all those darn nautilus shells. This was one of those illustrations that felt like it'd never be finished no matter how many hours I dumped into it.   Finally, it was finished! Here's what I ended up. Robotic bioluminescent nautili flying through the air with a robotic woman. On another planet or something. I like the composition and colors, even if the narrative makes no darn sense.", "text": "Non-Fiction\nThe Process of Creating \"Nautili\"\nFor my latest illustration, I wasn't sure what I wanted to paint. I knew I wanted to include a portrait, so I started with some random shapes using the pattern chalk tool in Painter X (using mostly some patterns of the Fibonacci spiral) and sketched a face within all that mess. Even though I still wasn't sure about the direction, this supplied me with a basic framework to start from.\nWhen I'm lacking in inspiration, I like to use the pattern chalk brush for getting some random shapes in my early drafts to generate some fresh and unexpected ideas. Using the Pattern Chalk tool is something I learned from Andrew Jones' tutorials here. Andrew is a hero of mine. His work amazing.\nNext, I started defining the face and shapes a little more and flipped the canvas horizontally. Originally I was thinking of making it all more abstract, but I've been finding it challenging to make an abstract look properly \"finished.\" It either looks too sketchy, or it starts getting too rendered and realistic. One of these days, I'll find the proper balance.\nI couldn't figure out what I wanted to do with the spiraling forms on her head until I realized that they'd make awesome nautilus shells. While rendering the shells, I added in a few other underwater themed elements and colors.\nAt this point, the portrait began to take shape, but I was still uncertain as to whether or not it should keep it that abstracted or start solidifying the forms.\nI accidentally flattened some parts of my draft, so there\nwere a few steps here that will not be pictured here.\nI decided to make all nautili face the same way in order to give the sense that they were all part of a moving swarm and not a random group clustering around the woman's head. I also began making some drastic changes to the color scheme. I liked where previous drafts were going color-wise, but I'm such a sucker for bright colors that I have a hard time staying away from them sometimes.\nNext, I expanded the canvas to include more of the woman's body and add more nautilus shells in the upper part of the image.\nNow it was time to tighten things up a bit, rendering the nautilus shells and trying to figure out how the hands should be positioned..\nI decided the colors were too dull, so I set my brush to \"Hard Light\" and went nuts painting the sky purple and yellow.\nAround this point I was tiring of rendering all those darn nautilus shells. This was one of those illustrations that felt like it'd never be finished no matter how many hours I dumped into it.\nFinally, it was finished! Here's what I ended up. Robotic bioluminescent nautili flying through the air with a robotic woman. On another planet or something. I like the composition and colors, even if the narrative makes no darn sense.", "source": "https://clarkesworldmagazine.com/dillon_02_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Process of Creating “Nautili” by Julie Dillon"}