{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Sameem Siddiqui", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "QkY5c1EaRXul84JRjY6eqFNwcy0=", "id": null, "license": null, "comments": "", "raw_text": "4130 words, short story  Dancing With Ereshkigal  If only I could be as direct as you, Pyn. Like when you announced you’d carry my baby, and that I’d carry yours. I wish I had that clarity and confidence now. Back then I thought you might be clairvoyant because you were so decisive when you made arrangements to trade eggs. So decisive when you made plans for us to make love with [him]. So convinced there wouldn’t be any emotional complications since [he]’d be off beyond the Kuiper belt in a few months. You like clean breaks.  But you know I can’t be direct. So, let me just tell you about the goddess Ereshkigal, who leers at me every time I pass by.  I saw her on my first day of work, but only after Jianyu showed me the thirty-meter-high tunnel boring machine that was named after her. I stared up at the groaning white circle as it slowly dragged itself centimeters ahead. He told me it’s an old Earth tradition to name these machines after women. I looked her up and laughed because why would Earth’s underworld goddesses be concerned here? I asked Jianyu, but he just shrugged and gave me my assignment for the day. I shut the RailPod door and accelerated into the orange glow of the freshly minted tunnel to do my inspections.  I was around four kilometers in when I first saw her. I could barely make out her purple hair under the red lights. She was leaning back into an emergency alcove, like it was her royal niche. No pressure suit and no expression on her face.  She reminds me of you, and I’m not saying that because her silence is constant and icy. No, it’s that her silence is somehow inquisitive. Like it’s leaving me infinite space to answer the question, “Who are you?”  I wanted to ask her if she felt abandoned. If that’s why she was here. Was she spiteful and patiently waiting for her chance at vengeance? I honestly couldn’t make sense of her myths. Though I studied them when I probably should have been monitoring the tensile stresses of the tunnel’s inner ring. My typical lack of focus, that you said would always get me into trouble.  These myths seem focused. And straightforward. But, they lack emotional specificity for me. Maybe they make more sense in their contexts. Maybe they need to be told with theatrics and hijinks. Maybe what they need isn’t focus, but scattered multilayered expression acting in divergent unity. Because these myths were never intended to convey emotion in just words, but rather performance.  I was staring at her when I had this thought and that’s the first time she perked up and took a step toward me. I froze. Arms, legs, thoughts, and all. I couldn’t tell in the dimly lit tunnel, but I’m almost positive she rolled her eyes as she spun back into her alcove. She slouched as her excitement deflated.  I’m sure there are some myths perennially relevant, though tired, whose context never drifts. But others, with every retelling, dissipate until they’re just a series of difficult-to-bridge events because the motivation to go across each bridge is no longer apparent or just no longer compelling. Or maybe I’m just not meant to understand the motivations of a goddess.  Want to hear my secret to staying motivated at this job? (I mean aside from the residency sponsorship.) If no one’s waiting for a ride at either end, no one really cares where I am. I can take time doing my inspections. I just ride the RailPod between the machine and the office and do basically whatever I want.  I was checking for structural inconsistencies today, around the thirty-first kilometer marker, when I noticed her from the corner of my eye. I did my best to ignore her. What would I say to a goddess?  I jumped to get a closer reading of a tensile stress oddity I thought I detected. As I floated back down, I reclined and reviewed the data. It was nothing, so I closed my eyes and let my arms fall back as I waited for the ground to come back to me.  But it didn’t.  I felt her hands touch the back of my pressure suit and guide me back to standing position. Before I had a chance to panic, she slid a hand up my back, to my shoulder, down my arm, and to my hand. She pulled it forward, above me, and spun me around to face her.  Pyn, she was smiling. She was tall and I was eye level with her mouth, so her bright purple lips were the first thing I saw. Her teeth were black as charcoal, yet looked sharp as polished diamond. I could see the glare of blue light bleed from her eyes, but I was too afraid to look up. Too afraid of what it’d mean. Too afraid of being consumed.  She put a hand on the base of my helmet and tilted my head up until my eyes met her own. They radiated gentle light that pulsed and swirled in the diminishing space between us.  I assumed I was paralyzed. That I was prey. That this was my end.  But she simply held me close by the hips of my suit and then pushed off until there was a meter between us. Our eyes remained locked until she stretched her arms wide and sunk to her knees. Her wrists, palms, and knuckles on each hand followed the same inverted curve. Her head turned to the side, and she looked upward.  I studied her peculiar stance wondering why it looked familiar? Why it felt like hearing a word I’d once used but whose meaning I had now forgotten.  She flashed her eyes back at me and glared at my arms and legs. I hurriedly adjusted my legs to mimic her stance but immediately tumbled over. She looked up at me with an intensifying glare leaking from her eye sockets.  I tried again, slowly, bending my legs, moving my arms, and feeling my atrophied muscles stretch. I was shaking when I looked back at her for approval. She was smiling again. Her eyes beaming at me, locking me into a trance until I remembered something.  This is the pose. The one you said was your first memory of me.  At my performance at the Dome Theater on ChandOrb. You were there with [him]. Of course, [he] knew that’s when you noticed me, because [he]’s the one who pushed you to come say hi to me after the show.  What was it you said to me? Something about how you never appreciated low-gravity arts, but here you were. I thought your disdain was charmingly quaint. You didn’t think my air quote “Earth” art was charming or quaint. He apologized for you when you stormed out. I never told you that. I guess I knew pretty quickly how it’d hurt your ego, and I honestly never liked to hurt your ego.  Ereshkigal broke her gaze and leaned back to let her torso and arms match the curvature of the tunnel walls. I followed suit, and when my insulated palms touched down on the cold gravel, I closed my eyes and remembered seeing you in my audience a few months later. It was obvious, even from the brightly lit stage, how carefully you maneuvered your neck as you tried to look at everything but me. I’m sure if someone tracked your eye movement with dots in that moment, there’d be a hollow space in the shape of me rolling backward like a wheel.  I had to go up to you at the reception afterward. You were all “Majd, isn’t it?” It was cute, but I was impatient so I ignored it and asked you to follow me so we could grab a bite somewhere quieter. I just started walking without looking back, because I was pretty sure you were about to storm off again. I was too afraid to look back until I got to the theater’s exit. But you were right there. You didn’t look too happy, so I figured you’d been mentally rehearsing your telling me off speech for when we stopped. So I just kept walking.  I was relieved to see the shawarma stall was still open. I ordered for both of us, because I’m pretty sure if I addressed you, you’d just launch into the tirade you’d been prepping. But by the time I handed you your shawarma, you were just looking at me confused. I know it’s funny to say now that I’ve complained about your inability to emote, but I loved the quietness and calm tension between us while we awkwardly stole glances at each other and people watched.  I could tell you wanted to say something else when you asked me if I’d like to walk to Terra Vista. What was it you wanted to say? When we got to the vista and leaned over the railing, I stared out at the swirling white clouds and asked you what your favorite place on Earth was. You took a deep breath and told me your grandmother was an admiral in the Oceanic Fleet and that you didn’t stick around too long in any one place. That your mother almost let you leave without her because she couldn’t stand moving once more. That it was weird leaving in the middle of your first crush. That you met him in Sri Lanka, so that feels like the most special place. You thought it was maybe just because it was the last place you really were. That you felt like maybe you died there, and your spirit floated up to the Moon, leaving most of your memories down on Earth. But, is this what you wanted to say? Or had you changed between the shawarma stall and the vista?  You said your mother had four kids and two cats. You said the first kid grew up to be a fucking nightmare. An asshole who broke hearts and bodies. But you said she wasn’t the worst because the second grew up to be an asteroid-mining lobbyist. Yet you still let her pay your way on exotic vacations, don’t you?  The third was the sweetest, kindest soul. You missed his face. It was all you had left of your father. And his voice, all you had left of your mother. But he died of brain cancer in his thirties, so what the fuck was I even supposed to do with that information? I’m sorry, but you never let me know what this did to you.  You’re the fourth. You aren’t great, but you aren’t terrible either. Growing up you didn’t contribute much, but you didn’t take all that much either. You told me that, before you told me about the chained elephant you rode at some roadside attraction in Sri Lanka. When you showed me the video, your eyes watered, and you whispered to the elephant, asking for forgiveness. I know I’ve said this a million times, but it made my heart well up so much that I reached out to kiss you for the first time.  Maybe it’s the change in gravity, but your kisses never felt the same after we left the Moon. I know they should have felt heavier, but they got lighter. More careful. More restrained. As if you were worried that I’d be able to feel secret words pressing through your lips.  Ereshkigal flipped into a headstand eventually and just stared at me as if I was expected to know how to follow suit. But I did know how, didn’t I. Except I was a bit lighter the last time I did this, on the Moon.  Jianyu checked in on me as my hands finally gained balance. Said “someone” noticed my elevated heart rate and thought I might be panicking. I assured him that I don’t panic.  You hated when I didn’t panic about the things that you panicked about. When Nabeel was born, I remember catching you trying to latch him to your breast when you thought I wasn’t looking. It was still a few days until Hamida was born, but you were so desperate to finally experience motherhood. I wanted to try to calm you down, but I knew you’d lash out. So I just watched you plead with his crying face to just latch. I didn’t tell you, but I heard you ask him why—why he didn’t want his own mother. I was crying when you asked him if he was upset that you evicted him. That you let him grow in a foreign space. If that’s why he was in such a rush to come out. Were you jealous when I delivered first?  You and Nabeel. Everything you two have gone through, I can trace back to that moment. Please go easier on him. You’ve layered your insecurities into him so hard that I don’t think he can handle it. I know, I didn’t mean to go into this right now, but you have to understand that I’ve left so much in your hands. Please. He’s a teenager. Don’t take what he thinks of you seriously until he’s at least thirty. You once told me fifteen-year-old you suspected your mom might have been a real live demon, because she wanted you to be an orbital engineer.  Nabeel will even out. He went through a phase with me too, remember? Because you always made sure that I was the one who said no to his stupid Lunar Scout trips on ChandOrb. I know the idea of his going out to the open surface for a week with a bunch of strangers bothered you as much as it bothered me. But I’m the one who had to listen to him scream through his ugly crying that I wasn’t really his mother. You laughed when he stormed off and you told me he fucking hates me. That’s the first time I wondered if it would have been better if we had left our need for water on Earth, becauseI fucking hated the satisfied look in your eyes when you made me cry.  But, Nabeel evened out with me eventually. And I needed the comfort of a child’s neediness as I stroked his head and stared out the window on our flight back from the Martian Performing Arts Center. As I looked at the desert pockmarked by a generation of rudimentary settlements, I realized what devastated this landscape is no longer so different from Earth’s most despicable forces of nature. Earthquakes, floods, drought, capitalism, volcanoes, hurricanes, colonialism. I know, you’d say capitalism and colonialism aren’t forces of nature, but why not? Aren’t they natural processes that can be explained? I know, you’d ask me to explain their nature, but you’d be off in an adorable huff before I could even ask you to explain the nature of some more tangible complex natural phenomena.  I went to see Counselor Chen the day after we got back. I told her that I’d thought about walking out into that thin air, letting this world consume me as we’re consuming it. I was curious how long it’d take me to just dry up and die. She said Martian law is somewhat inspired by its atmosphere in that it’s as efficient as it’s indifferent. It can’t afford to be anything but decisive. Chen said if she did her job right, and if terraformers did theirs right, then maybe in a generation or two the law would change with the atmosphere. But for now, the system was unmalleable. And so with my death, Hamida would lose her residency.  This isn’t ChandOrb, Pyn. No amount of your pride would convince immigration that she’s just as much yours as she is mine. What a quirky spinning world you brought us to.  I love that they’d make sure you’d pay me well enough to live here on my own if I left you. And I love that they’d immediately offworld me if I failed to find job that’d not only sponsor me, but also pay me well enough to live. Who wrote these laws, Pyn?  Did I tell you how I let my sock-laden feet shuffle over Counselor Chen’s Persian rug while she explained to me that I’d never get an exit visa for Nabeel and Hamida without your consent? I just wanted them to see Earth’s oceans from orbit. To be honest I was afraid I was forgetting what they looked like myself. And if I was forgetting, how could I expect them to remember? Did you even want to remember? I asked you, but the look in your eyes when you sipped the last of your whiskey confused me. And when you threw your glass at me it didn’t quite clarify your perspective. And I forgot to follow up, because the anticlimax of the glass bouncing off my shoulder and landing gently on our rug made me burst out laughing while you stormed off to your room. I could hear the weight of Hamida and Nabeel’s ears leave their doors as they returned to their beds to sulk. And so I went to my bed to do the same.  I was probably mopier than I needed to be, you’re right. But it gave me something to do. It’s funny, because whenever I complained about just needing something to do, you’d snap as if it were obvious. That one should be able to find a way to occupy themselves on a strange barren planet. I never asked how it felt so obvious to you and why, if it was so obvious to you, you never offered any ideas. I figured you were being tactless, not vicious.  I hummed “Forgiveness is a Red Ocean” as I cartwheeled along the tracks, pushing off the curved ceiling before touching down for another spin. I still remember the way Hamida sang it at her first talent show. Hugging her together was one of the only joyous moments I can remember with you here. There was a rush of sweet earnestness from you to her and to me. It filled the room with a glow that drowned everything else out.  Until Hamida showed us her prize. Four tickets, one for each of us, to the Performing Arts Center. And as I watched the glow dim back into your face, I remembered the countless times you made up excuses not to take me. I figured one of your excuses must be valid. The cost? The hour flight across planet? Leaving behind your patients?  Hamida knew never to ask you directly. I wonder now, did she train extra hard because she knew this was the only way she’d ever get to go? Even that, she didn’t know for sure, but was this incredibly slight chance worth the extra hour of practice every night?  But you couldn’t say no, because some part of you knew she was all you had at this point. Nabeel had barely spoken to you for months. Do you think he could tell that you considered him less than yours? And did you ever imagine that that’d make you feel less than his? So how could you say no?  I thought I felt a breeze through my suit as I kicked off the wall. Do you remember what real breezes were like? I’d love to know one day what a planet could be whispering as it fidgets through space.  You fidgeted nonstop when we arrived at the MPAC. So nervous about leaving your patients with an attending for the first time, you said. But I knew the way you fidgeted when you were stressed about work. This was different fidgeting, but I knew it too. I had seen it long before. When you’d hide out in my audiences, scuttling your eyes, trying not to notice when I notice you. But I couldn’t imagine that there would be someone you were expecting to see. I had been looking for signs that there was someone else, but you just seemed too bland, boring, and buried in work. And thinking of it now, I can’t remember you any other way, so I’m wondering if that’s what I fell in love with? I don’t mean that as an insult. I think it truly is what I loved, until I myself became bland, boring, but buried in nothingness.  At intermission you rushed off to call your attending and check on your hospital. I wanted to sulk in the dimly lit auditorium, but the kids insisted we go get some snacks. I think that might have been your fatal mistake. Letting me out of your sight. Away from your ability to steer my attention toward your broody exterior. I guess if you had heard Hamida mention the director of the MPAC would be meeting the contest winner, you might have wandered out with us, or convinced me to wait in the dark while you went out.  I didn’t think much of the fact that S’nious knew my name at first. Figured the school gave out that information ahead of time. But when he began asking about my work, I was unsettled because he seemed to remember more about my work than I could myself. I scanned my brain wondering what I even did, but in that moment, I felt so distracted. And by moment I don’t mean standing there in the ornate gallery lobby. I mean that phase of our life together. That whole ordeal just feels like a tangible moment that I can define. And it is, by definition, the moment I was distracted from who I was. Where my entire being was devoted to defining the lives of those around me. Nabeel’s and Hamida’s and yours, Pyn.  But that moment ended there. The next moment started. A rush of my achievements, my loves, the everythings that defined who I am and where I wanted to go. But this moment was short. Just a glimpse.  The following moment was watching Nabeel and Hamida peel off to get some snacks. Wanting to run after them but feeling inexplicably rooted to my spot next to S’nious. Listening to him say that he’d still love to have me be part of the MPAC somehow.  Still? I begged him to explain. He shuffled uncomfortably, uncertain of what he was stumbling into, but I’m certain he knew it was not where he wanted to be. He stared at my ear as if he were focused on pushing into it the shape of the words “spousal hire” as quietly as he could. Was it dawning on him that I had no idea what he was talking about as he expressed how disappointed he was when I turned down the position? I think it must have, but he played along and told me he begged my spouse, what was their name? Pyn! That he begged them to let him speak to me directly, but that they insisted that I was too busy with other projects and couldn’t even entertain the idea. He asked if I’d like to meet the low-gravity arts director they ended up hiring. The one from Earth. A low-gravity arts director. From Earth. It apparently took him a year to find them. He was sure they’d love to have me volunteer in some capacity. I couldn’t tell if the buzzing in my temples was my blood boiling or the high blood pressure warnings in my contacts.  When I got back to my seat, you could have felt the blue heat radiating from my burning skin. But, you were stewing in your own anxious oblivion. We both stared ahead, as if we could see through the blue pulsing acrobats and into the future. I thought I’d tell you when we got home, but I think by then the fact had cooked so deeply into my muscles that I came to accept where I was. Where we were.  I launched into a bimodal cartwheel, and I jumped off the upward curve of the tunnel. When I looked down at the floor, I saw Ereshkigal standing there, arms open, waiting to catch me. I closed my eyes and waited for her embrace. I waited longer than I thought I would.  I opened my eyes, and she was gone, and I was slowly floating to the concrete. I swung my arms down and rolled myself into a landing. The lights of the RailPod leered at me. I lifted myself up and didn’t bother looking for her. I knew she was gone, already back on Earth, convinced I wasn’t ready for death when she saw me finally dancing of my own direction. Sameem Siddiqui is a speculative fiction writer currently living in the United States. He enjoys writing to explore the near future realities people of South Asian ancestry and Muslim heritage will face in the coming centuries. His stories explore issues of migration, gender, family structure, economics and space habitation. He’s attended the Tin House and FutureScapes workshops and his stories have appeared in Clarkesworld and ApparitionLit. Some of Sameem’s favorite authors include Kurt Vonnegut, Octavia Butler, and Haruki Murakami. When he’s not writing, Sameem enjoys reveling in fatherhood, watching 90’s Star Trek, and tinkering with data and music.", "text": "4130 words, short story\nDancing With Ereshkigal\nIf only I could be as direct as you, Pyn. Like when you announced you’d carry my baby, and that I’d carry yours. I wish I had that clarity and confidence now. Back then I thought you might be clairvoyant because you were so decisive when you made arrangements to trade eggs. So decisive when you made plans for us to make love with [him]. So convinced there wouldn’t be any emotional complications since [he]’d be off beyond the Kuiper belt in a few months. You like clean breaks.\nBut you know I can’t be direct. So, let me just tell you about the goddess Ereshkigal, who leers at me every time I pass by.\nI saw her on my first day of work, but only after Jianyu showed me the thirty-meter-high tunnel boring machine that was named after her. I stared up at the groaning white circle as it slowly dragged itself centimeters ahead. He told me it’s an old Earth tradition to name these machines after women. I looked her up and laughed because why would Earth’s underworld goddesses be concerned here? I asked Jianyu, but he just shrugged and gave me my assignment for the day. I shut the RailPod door and accelerated into the orange glow of the freshly minted tunnel to do my inspections.\nI was around four kilometers in when I first saw her. I could barely make out her purple hair under the red lights. She was leaning back into an emergency alcove, like it was her royal niche. No pressure suit and no expression on her face.\nShe reminds me of you, and I’m not saying that because her silence is constant and icy. No, it’s that her silence is somehow inquisitive. Like it’s leaving me infinite space to answer the question, “Who are you?”\nI wanted to ask her if she felt abandoned. If that’s why she was here. Was she spiteful and patiently waiting for her chance at vengeance? I honestly couldn’t make sense of her myths. Though I studied them when I probably should have been monitoring the tensile stresses of the tunnel’s inner ring. My typical lack of focus, that you said would always get me into trouble.\nThese myths seem focused. And straightforward. But, they lack emotional specificity for me. Maybe they make more sense in their contexts. Maybe they need to be told with theatrics and hijinks. Maybe what they need isn’t focus, but scattered multilayered expression acting in divergent unity. Because these myths were never intended to convey emotion in just words, but rather performance.\nI was staring at her when I had this thought and that’s the first time she perked up and took a step toward me. I froze. Arms, legs, thoughts, and all. I couldn’t tell in the dimly lit tunnel, but I’m almost positive she rolled her eyes as she spun back into her alcove. She slouched as her excitement deflated.\nI’m sure there are some myths perennially relevant, though tired, whose context never drifts. But others, with every retelling, dissipate until they’re just a series of difficult-to-bridge events because the motivation to go across each bridge is no longer apparent or just no longer compelling. Or maybe I’m just not meant to understand the motivations of a goddess.\nWant to hear my secret to staying motivated at this job? (I mean aside from the residency sponsorship.) If no one’s waiting for a ride at either end, no one really cares where I am. I can take time doing my inspections. I just ride the RailPod between the machine and the office and do basically whatever I want.\nI was checking for structural inconsistencies today, around the thirty-first kilometer marker, when I noticed her from the corner of my eye. I did my best to ignore her. What would I say to a goddess?\nI jumped to get a closer reading of a tensile stress oddity I thought I detected. As I floated back down, I reclined and reviewed the data. It was nothing, so I closed my eyes and let my arms fall back as I waited for the ground to come back to me.\nBut it didn’t.\nI felt her hands touch the back of my pressure suit and guide me back to standing position. Before I had a chance to panic, she slid a hand up my back, to my shoulder, down my arm, and to my hand. She pulled it forward, above me, and spun me around to face her.\nPyn, she was smiling. She was tall and I was eye level with her mouth, so her bright purple lips were the first thing I saw. Her teeth were black as charcoal, yet looked sharp as polished diamond. I could see the glare of blue light bleed from her eyes, but I was too afraid to look up. Too afraid of what it’d mean. Too afraid of being consumed.\nShe put a hand on the base of my helmet and tilted my head up until my eyes met her own. They radiated gentle light that pulsed and swirled in the diminishing space between us.\nI assumed I was paralyzed. That I was prey. That this was my end.\nBut she simply held me close by the hips of my suit and then pushed off until there was a meter between us. Our eyes remained locked until she stretched her arms wide and sunk to her knees. Her wrists, palms, and knuckles on each hand followed the same inverted curve. Her head turned to the side, and she looked upward.\nI studied her peculiar stance wondering why it looked familiar? Why it felt like hearing a word I’d once used but whose meaning I had now forgotten.\nShe flashed her eyes back at me and glared at my arms and legs. I hurriedly adjusted my legs to mimic her stance but immediately tumbled over. She looked up at me with an intensifying glare leaking from her eye sockets.\nI tried again, slowly, bending my legs, moving my arms, and feeling my atrophied muscles stretch. I was shaking when I looked back at her for approval. She was smiling again. Her eyes beaming at me, locking me into a trance until I remembered something.\nThis is the pose. The one you said was your first memory of me.\nAt my performance at the Dome Theater on ChandOrb. You were there with [him]. Of course, [he] knew that’s when you noticed me, because [he]’s the one who pushed you to come say hi to me after the show.\nWhat was it you said to me? Something about how you never appreciated low-gravity arts, but here you were. I thought your disdain was charmingly quaint. You didn’t think my air quote “Earth” art was charming or quaint. He apologized for you when you stormed out. I never told you that. I guess I knew pretty quickly how it’d hurt your ego, and I honestly never liked to hurt your ego.\nEreshkigal broke her gaze and leaned back to let her torso and arms match the curvature of the tunnel walls. I followed suit, and when my insulated palms touched down on the cold gravel, I closed my eyes and remembered seeing you in my audience a few months later. It was obvious, even from the brightly lit stage, how carefully you maneuvered your neck as you tried to look at everything but me. I’m sure if someone tracked your eye movement with dots in that moment, there’d be a hollow space in the shape of me rolling backward like a wheel.\nI had to go up to you at the reception afterward. You were all “Majd, isn’t it?” It was cute, but I was impatient so I ignored it and asked you to follow me so we could grab a bite somewhere quieter. I just started walking without looking back, because I was pretty sure you were about to storm off again. I was too afraid to look back until I got to the theater’s exit. But you were right there. You didn’t look too happy, so I figured you’d been mentally rehearsing your telling me off speech for when we stopped. So I just kept walking.\nI was relieved to see the shawarma stall was still open. I ordered for both of us, because I’m pretty sure if I addressed you, you’d just launch into the tirade you’d been prepping. But by the time I handed you your shawarma, you were just looking at me confused. I know it’s funny to say now that I’ve complained about your inability to emote, but I loved the quietness and calm tension between us while we awkwardly stole glances at each other and people watched.\nI could tell you wanted to say something else when you asked me if I’d like to walk to Terra Vista. What was it you wanted to say? When we got to the vista and leaned over the railing, I stared out at the swirling white clouds and asked you what your favorite place on Earth was. You took a deep breath and told me your grandmother was an admiral in the Oceanic Fleet and that you didn’t stick around too long in any one place. That your mother almost let you leave without her because she couldn’t stand moving once more. That it was weird leaving in the middle of your first crush. That you met him in Sri Lanka, so that feels like the most special place. You thought it was maybe just because it was the last place you really were. That you felt like maybe you died there, and your spirit floated up to the Moon, leaving most of your memories down on Earth. But, is this what you wanted to say? Or had you changed between the shawarma stall and the vista?\nYou said your mother had four kids and two cats. You said the first kid grew up to be a fucking nightmare. An asshole who broke hearts and bodies. But you said she wasn’t the worst because the second grew up to be an asteroid-mining lobbyist. Yet you still let her pay your way on exotic vacations, don’t you?\nThe third was the sweetest, kindest soul. You missed his face. It was all you had left of your father. And his voice, all you had left of your mother. But he died of brain cancer in his thirties, so what the fuck was I even supposed to do with that information? I’m sorry, but you never let me know what this did to you.\nYou’re the fourth. You aren’t great, but you aren’t terrible either. Growing up you didn’t contribute much, but you didn’t take all that much either. You told me that, before you told me about the chained elephant you rode at some roadside attraction in Sri Lanka. When you showed me the video, your eyes watered, and you whispered to the elephant, asking for forgiveness. I know I’ve said this a million times, but it made my heart well up so much that I reached out to kiss you for the first time.\nMaybe it’s the change in gravity, but your kisses never felt the same after we left the Moon. I know they should have felt heavier, but they got lighter. More careful. More restrained. As if you were worried that I’d be able to feel secret words pressing through your lips.\nEreshkigal flipped into a headstand eventually and just stared at me as if I was expected to know how to follow suit. But I did know how, didn’t I. Except I was a bit lighter the last time I did this, on the Moon.\nJianyu checked in on me as my hands finally gained balance. Said “someone” noticed my elevated heart rate and thought I might be panicking. I assured him that I don’t panic.\nYou hated when I didn’t panic about the things that you panicked about. When Nabeel was born, I remember catching you trying to latch him to your breast when you thought I wasn’t looking. It was still a few days until Hamida was born, but you were so desperate to finally experience motherhood. I wanted to try to calm you down, but I knew you’d lash out. So I just watched you plead with his crying face to just latch. I didn’t tell you, but I heard you ask him why—why he didn’t want his own mother. I was crying when you asked him if he was upset that you evicted him. That you let him grow in a foreign space. If that’s why he was in such a rush to come out. Were you jealous when I delivered first?\nYou and Nabeel. Everything you two have gone through, I can trace back to that moment. Please go easier on him. You’ve layered your insecurities into him so hard that I don’t think he can handle it. I know, I didn’t mean to go into this right now, but you have to understand that I’ve left so much in your hands. Please. He’s a teenager. Don’t take what he thinks of you seriously until he’s at least thirty. You once told me fifteen-year-old you suspected your mom might have been a real live demon, because she wanted you to be an orbital engineer.\nNabeel will even out. He went through a phase with me too, remember? Because you always made sure that I was the one who said no to his stupid Lunar Scout trips on ChandOrb. I know the idea of his going out to the open surface for a week with a bunch of strangers bothered you as much as it bothered me. But I’m the one who had to listen to him scream through his ugly crying that I wasn’t really his mother. You laughed when he stormed off and you told me he fucking hates me. That’s the first time I wondered if it would have been better if we had left our need for water on Earth, becauseI fucking hated the satisfied look in your eyes when you made me cry.\nBut, Nabeel evened out with me eventually. And I needed the comfort of a child’s neediness as I stroked his head and stared out the window on our flight back from the Martian Performing Arts Center. As I looked at the desert pockmarked by a generation of rudimentary settlements, I realized what devastated this landscape is no longer so different from Earth’s most despicable forces of nature. Earthquakes, floods, drought, capitalism, volcanoes, hurricanes, colonialism. I know, you’d say capitalism and colonialism aren’t forces of nature, but why not? Aren’t they natural processes that can be explained? I know, you’d ask me to explain their nature, but you’d be off in an adorable huff before I could even ask you to explain the nature of some more tangible complex natural phenomena.\nI went to see Counselor Chen the day after we got back. I told her that I’d thought about walking out into that thin air, letting this world consume me as we’re consuming it. I was curious how long it’d take me to just dry up and die. She said Martian law is somewhat inspired by its atmosphere in that it’s as efficient as it’s indifferent. It can’t afford to be anything but decisive. Chen said if she did her job right, and if terraformers did theirs right, then maybe in a generation or two the law would change with the atmosphere. But for now, the system was unmalleable. And so with my death, Hamida would lose her residency.\nThis isn’t ChandOrb, Pyn. No amount of your pride would convince immigration that she’s just as much yours as she is mine. What a quirky spinning world you brought us to.\nI love that they’d make sure you’d pay me well enough to live here on my own if I left you. And I love that they’d immediately offworld me if I failed to find job that’d not only sponsor me, but also pay me well enough to live. Who wrote these laws, Pyn?\nDid I tell you how I let my sock-laden feet shuffle over Counselor Chen’s Persian rug while she explained to me that I’d never get an exit visa for Nabeel and Hamida without your consent? I just wanted them to see Earth’s oceans from orbit. To be honest I was afraid I was forgetting what they looked like myself. And if I was forgetting, how could I expect them to remember? Did you even want to remember? I asked you, but the look in your eyes when you sipped the last of your whiskey confused me. And when you threw your glass at me it didn’t quite clarify your perspective. And I forgot to follow up, because the anticlimax of the glass bouncing off my shoulder and landing gently on our rug made me burst out laughing while you stormed off to your room. I could hear the weight of Hamida and Nabeel’s ears leave their doors as they returned to their beds to sulk. And so I went to my bed to do the same.\nI was probably mopier than I needed to be, you’re right. But it gave me something to do. It’s funny, because whenever I complained about just needing something to do, you’d snap as if it were obvious. That one should be able to find a way to occupy themselves on a strange barren planet. I never asked how it felt so obvious to you and why, if it was so obvious to you, you never offered any ideas. I figured you were being tactless, not vicious.\nI hummed “Forgiveness is a Red Ocean” as I cartwheeled along the tracks, pushing off the curved ceiling before touching down for another spin. I still remember the way Hamida sang it at her first talent show. Hugging her together was one of the only joyous moments I can remember with you here. There was a rush of sweet earnestness from you to her and to me. It filled the room with a glow that drowned everything else out.\nUntil Hamida showed us her prize. Four tickets, one for each of us, to the Performing Arts Center. And as I watched the glow dim back into your face, I remembered the countless times you made up excuses not to take me. I figured one of your excuses must be valid. The cost? The hour flight across planet? Leaving behind your patients?\nHamida knew never to ask you directly. I wonder now, did she train extra hard because she knew this was the only way she’d ever get to go? Even that, she didn’t know for sure, but was this incredibly slight chance worth the extra hour of practice every night?\nBut you couldn’t say no, because some part of you knew she was all you had at this point. Nabeel had barely spoken to you for months. Do you think he could tell that you considered him less than yours? And did you ever imagine that that’d make you feel less than his? So how could you say no?\nI thought I felt a breeze through my suit as I kicked off the wall. Do you remember what real breezes were like? I’d love to know one day what a planet could be whispering as it fidgets through space.\nYou fidgeted nonstop when we arrived at the MPAC. So nervous about leaving your patients with an attending for the first time, you said. But I knew the way you fidgeted when you were stressed about work. This was different fidgeting, but I knew it too. I had seen it long before. When you’d hide out in my audiences, scuttling your eyes, trying not to notice when I notice you. But I couldn’t imagine that there would be someone you were expecting to see. I had been looking for signs that there was someone else, but you just seemed too bland, boring, and buried in work. And thinking of it now, I can’t remember you any other way, so I’m wondering if that’s what I fell in love with? I don’t mean that as an insult. I think it truly is what I loved, until I myself became bland, boring, but buried in nothingness.\nAt intermission you rushed off to call your attending and check on your hospital. I wanted to sulk in the dimly lit auditorium, but the kids insisted we go get some snacks. I think that might have been your fatal mistake. Letting me out of your sight. Away from your ability to steer my attention toward your broody exterior. I guess if you had heard Hamida mention the director of the MPAC would be meeting the contest winner, you might have wandered out with us, or convinced me to wait in the dark while you went out.\nI didn’t think much of the fact that S’nious knew my name at first. Figured the school gave out that information ahead of time. But when he began asking about my work, I was unsettled because he seemed to remember more about my work than I could myself. I scanned my brain wondering what I even did, but in that moment, I felt so distracted. And by moment I don’t mean standing there in the ornate gallery lobby. I mean that phase of our life together. That whole ordeal just feels like a tangible moment that I can define. And it is, by definition, the moment I was distracted from who I was. Where my entire being was devoted to defining the lives of those around me. Nabeel’s and Hamida’s and yours, Pyn.\nBut that moment ended there. The next moment started. A rush of my achievements, my loves, the everythings that defined who I am and where I wanted to go. But this moment was short. Just a glimpse.\nThe following moment was watching Nabeel and Hamida peel off to get some snacks. Wanting to run after them but feeling inexplicably rooted to my spot next to S’nious. Listening to him say that he’d still love to have me be part of the MPAC somehow.\nStill? I begged him to explain. He shuffled uncomfortably, uncertain of what he was stumbling into, but I’m certain he knew it was not where he wanted to be. He stared at my ear as if he were focused on pushing into it the shape of the words “spousal hire” as quietly as he could. Was it dawning on him that I had no idea what he was talking about as he expressed how disappointed he was when I turned down the position? I think it must have, but he played along and told me he begged my spouse, what was their name? Pyn! That he begged them to let him speak to me directly, but that they insisted that I was too busy with other projects and couldn’t even entertain the idea. He asked if I’d like to meet the low-gravity arts director they ended up hiring. The one from Earth. A low-gravity arts director. From Earth. It apparently took him a year to find them. He was sure they’d love to have me volunteer in some capacity. I couldn’t tell if the buzzing in my temples was my blood boiling or the high blood pressure warnings in my contacts.\nWhen I got back to my seat, you could have felt the blue heat radiating from my burning skin. But, you were stewing in your own anxious oblivion. We both stared ahead, as if we could see through the blue pulsing acrobats and into the future. I thought I’d tell you when we got home, but I think by then the fact had cooked so deeply into my muscles that I came to accept where I was. Where we were.\nI launched into a bimodal cartwheel, and I jumped off the upward curve of the tunnel. When I looked down at the floor, I saw Ereshkigal standing there, arms open, waiting to catch me. I closed my eyes and waited for her embrace. I waited longer than I thought I would.\nI opened my eyes, and she was gone, and I was slowly floating to the concrete. I swung my arms down and rolled myself into a landing. The lights of the RailPod leered at me. I lifted myself up and didn’t bother looking for her. I knew she was gone, already back on Earth, convinced I wasn’t ready for death when she saw me finally dancing of my own direction.\nSameem Siddiqui is a speculative fiction writer currently living in the United States. He enjoys writing to explore the near future realities people of South Asian ancestry and Muslim heritage will face in the coming centuries. His stories explore issues of migration, gender, family structure, economics and space habitation. He’s attended the Tin House and FutureScapes workshops and his stories have appeared in Clarkesworld and ApparitionLit. Some of Sameem’s favorite authors include Kurt Vonnegut, Octavia Butler, and Haruki Murakami. When he’s not writing, Sameem enjoys reveling in fatherhood, watching 90’s Star Trek, and tinkering with data and music.", "source": "https://clarkesworldmagazine.com/siddiqui_05_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Dancing With Ereshkigal by Sameem Siddiqui"}