{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jason Heller", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "LXs4PcSFfCwyhh8AYpZgZKvcYI0=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Beyond the Tracks: The Locomotive in Science Fiction Literature  The capsule of metal begins to hum. Forces accumulate. Seated inside, the passengers feel the propulsion system lurch to life. Their bones thrum in synchronous frequency. Thus harmonized, man and machine move as one. The vehicle is launched along a predestined trajectory, arcing outward, soon to bisect a barren frontier. It accelerates hesitantly at first, negotiating inertia, until at last the optimal velocity is achieved.  The passengers settle into their seats. It’s going to be a long ride. Each knock and kick is a tick of the clock as they hurtle aboard this newfangled conveyance—into the future.  Locomotives are the original spaceships. True, the same could be said of naval vessels, and in particular the steamship. The first practical application of steam technology in a boat predates the steam train by a handful of years. But only a handful. And even then, rail travel is an equally apt metaphor for spaceflight. When British inventor Richard Trevithick pioneered the steam locomotive with a historic tramway run in Wales in 1804, it was as profound an achievement for its time as Yuri Gagarin’s Vostock mission a century and a half later. With the advent of this new technology, frontiers opened. Barriers fell. And the future was altered forever.  Trevithick’s locomotive—and subsequent improvements by the likes of George Stephenson—ran like wildfire throughout the world. A lynchpin of the nascent Industrial Age, the steam train was a quantum leap in how humans could harness the forces of the physical world. And abuse those forces.  Unsurprisingly, the locomotive helped fuel a parallel development in literature: science fiction. One of the first true science fiction novels, Jane C. Loudon’s The Mummy!: Or a Tale of the Twenty-Second Century, appeared in 1836, and it posits a future where entire houses migrate about the land via railway. Emile Souvestre’s 1846 novel Le Monde Tel Qu’il Sera [The World As It Will Be], whisks its protagonists to the dystopian world of the year 3000, and his vehicle for this voyage is a steam locomotive that flies through space and time. And that giant of 19th century science fiction, Jules Verne, offered his own take on the locomotive in his 1863 book Paris au XXe Siècle—this time with the addition of speculative technology in the form of pneumatics.  As the locomotive became less of a smoke-breathing novelty and more of a staple of Industrial Age life, science fiction authors were forced to stretch their imaginations further in regard to the train. “The Tachypomp” was written by American newspaperman Edward Page Mitchell in 1874, five years after the final spike was driven into the Pacific Railroad, later to be known as the First Transcontinental Railroad. The short story doesn’t marvel at the locomotive as it existed at the time, but wonders about its potential as a means of infinite speed, a concept that foreshadows Einstein’s Special Theory of Relativity, still 21 years away. Most intriguingly, though, the titular Tachypomp comprises a series of vertically-stack trains resulting in exponential increases in velocity—a staggering symbol of imminent modernity that remains poetic in its conception.  The locomotive takes a turn for the horrific in A Mexican Mystery and The Wreck of the World, published in 1888 and ’89, respectively. Written by William Grove, the duology posits a train that is able to fuel itself—and then spins that perpetual source of sustenance into a prototypal form of artificial intelligence. One that embodies the “revolt of the machines” trope that came to typify science fiction as the dark side of industrial progress—pollution, exploitation, and dehumanization—began to become fixed in the collective consciousness. A more standard work of predictive fiction, John Jacob Astor IV’s A Journey in Other Worlds: A Romance of the Future followed in 1894. Among its many wild guesses about the world of the year 2000 is the spot-on prophecy of magnetic levitation (or maglev) trains.  The use of the locomotive in fantasy is another fertile topic unto itself, but its seeds can be seen in Rudyard Kipling’s 1897 short story “.007.” Rather than attaining self-awareness via some technological phenomena (as in Grove’s books), the trains in “.007” possess consciousness as a simple matter of course. That aura of magic realism excludes the story from the science fiction canon, but it is noteworthy in this sense: In a sense, “.007” is the first work of science-fantasy. While 19th-century fantasy pioneers such as George MacDonald and William Morris were rejecting industrialization in favor of a rarified pastoralism, Kipling imbued locomotives with mythopoeic souls—to the point where, for all intents and purposes, the trains of “.007” function as ironclad faerie-folk.  The advent of the 20th century brought with it a new view of futurism—and of locomotives. The Victorian Era’s romanticism gave way to sharper aesthetic of the Edwardian, and the conquering of one scientific mystery after another rendered the locomotive not only commonplace, but quaint. Inventors and explorers—some, like Robert Goddard, inspired by science fiction writers like H.G. Wells—began setting their sights in earnest on the stars.  In a feedback loop of fact and fiction that continued through much of the century, SF writers followed suit. The first major work of the genre to feature trains is Hugo Gernsback’s 1911 novel Ralph 124C 41+. Serialized in Modern Electrics magazine and steeped in the scintillation that would soon inform pulp SF, the book is a grab-bag of futuristic marvels. One of them is a subterranean magnetic train that runs from Europe to North America—but measured against Gernsback’s mad salvo of way-out (and at times eerily prescient) gadgetry, his vision of the locomotive’s future is far from compelling.  Then came World War I. The first major military conflagration to make extensive use of innovations such airplanes, submarines, and chemical warfare, it reduced the once-noble soldier to mere fodder for death machines. It also indelibly altered human culture—science fiction included. The notion that technology could bring about the extinction of homo sapiens resulted in a strain of dystopianism; SF writers used the genre as a battlefield for opposing ideas about science’s moral value.  World War II didn’t help matters in that regard, nor did the atomic bombings of Japan in 1945. In the midst of this turmoil, there was little room for the locomotive in SF, which might explain why trains all but vanished from the genre during this period. And when they did pop up, they were in children’s books such as Victor Appleton’s Tom Swift and his Electric Locomotive (1922), William Pène Du Bois’s The Flying Locomotive (1941), and Reverend W. Awdry’s The Three Railway Engines (1945). Awdry’s book launched the long-running Railway Series, which eventually inspired the Thomas the Tank Engine TV show. It owes more to Kipling’s “.007” fantastical view of locomotives than to the hard SF of the era, set as it is on the mythic Island of Sodor—in essence, a Middle Earth for trains. Locomotives had once flung themselves toward the future, but as the first mushroom clouds blossomed over major metropolises, the train became a comforting, even infantile symbol of a halcyon past.  The Postwar Era didn’t do much for the fortunes of locomotives in SF. Aside from a few random curiosities like A. J. Deutsch’s beguiling 1950 short story, “A Subway Named Möbius”—in which a convoluted geometry of train tracks leads to loops in spacetime—trains just couldn’t capture the imagination the way rockets and time machines could in the Golden Age of SF. Ironically, trains had once served as both rockets and time machines within the genre. By the time Ray Bradbury used the machines in his 1953 classic Fahrenheit 451, they’d been relegated to incidental details. Bradbury would use trains much more centrally in his fantasy work, most notably 1962’s supernatural tour-de-force Something Wicked This Way Comes. Keith Roberts’ genre-defying alt-history masterpiece Pavane appeared in 1968, but its depiction of free-roaming steam traction engines ignores railways altogether. As far as science fiction was concerned, the locomotive had jumped the track.  A curious thing happened to the SF locomotive in 1969: Man landed on the moon. There’s no direct correlation, of course. But a zeitgeist shift occurred within the genre. With one of SF’s fundamental tropes—a human foot on an extraterrestrial surface—having been fulfilled, writers began to turn their speculative eye elsewhere. The radical New Wave of Science Fiction movement reached its peak in the late ’60s and early ’70s, and one of its figureheads, Michael Moorcock, also spearheaded a peculiar retro-futuristic style that would eventually come to be called steampunk.  Trains figured into both. Christopher Priest, a young upstart in the New Wave movement, wrote The Inverted World, a mind-bending 1974 novel that envisioned a post-apocalyptic city that inched along a massive railway track. Its inhabitants were forced to stop periodically, take up the track that had already been traversed, and reconstruct it in the path of the city’s forward trajectory. If it failed to move, the city was doomed. A unique work of post-industrial malaise and quantum psychedelia, The Inverted World helped revive the locomotive tradition in speculative literature. Preceding it by a year, though, was Harry Harrison, A Transatlantic Tunnel, Hurrah! (first serialized in Analog as Tunnel Through the Deeps), a far less angst-ridden novel of proto-steampunk adventure that features—as the title promises—a race among para-Victorians to build a submerged train tunnel through the Atlantic. Now that human beings routinely traveled back and forth to the moon, steampunk’s invigorating mashup of prognostication and nostalgia would take greater hold of the genre’s attention, even if the locomotive—that most vivid emblem of steam power—became more of a prop than a trope.  The ’70s and ’80s were a free-for-all for SF, and the genre plundered its own canon with glee. Accordingly, few of the locomotive’s sporadic appearances during that period are particularly innovative. In John Varley’s 1977 novel The Ophiuchi Hotline, Gernsback’s underground gravity train is recycled and updated. Michael Coney’s The Celestial Steam Locomotive from 1983 flexes more imagination with its vision of a train that traverses space and dimensions, and Greg Bear’s 1985 novel Eon produces an eye-popping image of a trackless millipede-like train that sadly doesn’t capitalize on that biomimetic potential. By the time Thomas N. Scotia’s 1987 book Blowout! digs up the threadbare premise of a transcontinental railroad tunnel, it seemed as though the locomotive might once again fade entirely from the SF mainstream.  Then came Desolation Road. Ian McDonald’s stunning 1988 debut is marvel on many levels, but his virtuoso depiction of locomotives on a terraformed Mars breathed new life into the possibility of trains as conceptual vehicles—as well as potent symbols. In every way, it’s the zenith of SF’s on-again-off-again obsession with the locomotive, executed with magic-realist richness and tech-geek zeal alike.  McDonald was also interested in cyberpunk, though, as was much of the SF world in the late ’80s and early ’90s. Consequently, the locomotive—perhaps the least cyberpunk-esque appliance in the SF toolbox—came closer than ever to obsolescence in the waning years of the 20th century. Apart from the wind-trains in Sean McMullen’s 1999 novel Souls in the Great Machine, the turn of the millennium came and went with SF’s great railroad tradition predominantly silent. It was McDonald himself who brought trains back from the brink in 2001’s Ares Express, his long-awaited follow-up to Desolation Road that brings his Martian locomotives—and the dynastic clans who engineer them—into even more dazzling focus.  At the same time, a nebulous new movement in science fiction, New Weird, was beginning to rise—much of it, incidentally, influenced by McDonald’s prior mutation of SF, fantasy, and magic realism. At the heart of the movement was British wunderkind China Miéville. And as the world soon learned, Miéville loves trains. In his 2004 novel Iron Council—the third book in his loosely connected Bas-Log trilogy—a band of outlaws form a roving socialist society aboard a train that runs on a limited span of track, which must be perpetually picked up behind and then relaid ahead. It’s a loving homage to Priest’s The Inverted World, but Miéville gives his purloined premise fresh purpose and relevance; in fact, his city-on-tracks may as well be a metaphor for his own career as it explores unknown territories of genre while retaining strong ties to its past. He visits the locomotive more originally—but less successfully—in his 2012 young-adult novel Railsea. This time he leans his pastiche on Moby-Dick, only instead of ships hunting whales, a locomotive scours a track-scarred desert in search of the giant, mole-like moldywarpe. The book embodies Miéville postmillennial salvagepunk ethic, even as the text itself serves as a prime example of its literary analog.  With the 21st century well underway, the locomotive has begun to gain momentum once more. Much of the previous centuries’ grandiloquent predictions about tomorrow were to have taken place already. Few have. The past, in truth, exists alongside the future—and the locomotive paradoxically feels like an anachronism than it once did. Ekaterina Sedia’s 2011 novel Heart of Iron touches on steampunk without committing to its limitations; in doing so, the book’s alt-history take on czarist Russia and the race to build a transcontinental railroad across Asia harkens all the way back to the conjoined births of both SF and the locomotive. Similarly, Genevieve Valentine’s 2013 short story “Terrain” concerns the predatory encroachment of the Union Pacific Railroad in a steampunk-accented Wyoming, a chiseled fable of human versus piston that celebrates the romance of the rails even as it chillingly deconstructs it.  Therein lies the longevity of the locomotive in science fiction. The vehicle itself may be all but abandoned when it comes to use by passengers—but so, at this point, has the spaceship. There’s a latent puissance in these metallic capsules, though, that waits to be unlocked—with a stripping of dust, a stoking of the engine, a pulling of the levers, and the tapping of a gauge or two. The future is today, and it is tomorrow, and it is yesterday. All it takes is a train to carry us there. Jason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "text": "Non-Fiction\nBeyond the Tracks: The Locomotive in Science Fiction Literature\nThe capsule of metal begins to hum. Forces accumulate. Seated inside, the passengers feel the propulsion system lurch to life. Their bones thrum in synchronous frequency. Thus harmonized, man and machine move as one. The vehicle is launched along a predestined trajectory, arcing outward, soon to bisect a barren frontier. It accelerates hesitantly at first, negotiating inertia, until at last the optimal velocity is achieved.\nThe passengers settle into their seats. It’s going to be a long ride. Each knock and kick is a tick of the clock as they hurtle aboard this newfangled conveyance—into the future.\nLocomotives are the original spaceships. True, the same could be said of naval vessels, and in particular the steamship. The first practical application of steam technology in a boat predates the steam train by a handful of years. But only a handful. And even then, rail travel is an equally apt metaphor for spaceflight. When British inventor Richard Trevithick pioneered the steam locomotive with a historic tramway run in Wales in 1804, it was as profound an achievement for its time as Yuri Gagarin’s Vostock mission a century and a half later. With the advent of this new technology, frontiers opened. Barriers fell. And the future was altered forever.\nTrevithick’s locomotive—and subsequent improvements by the likes of George Stephenson—ran like wildfire throughout the world. A lynchpin of the nascent Industrial Age, the steam train was a quantum leap in how humans could harness the forces of the physical world. And abuse those forces.\nUnsurprisingly, the locomotive helped fuel a parallel development in literature: science fiction. One of the first true science fiction novels, Jane C. Loudon’s The Mummy!: Or a Tale of the Twenty-Second Century, appeared in 1836, and it posits a future where entire houses migrate about the land via railway. Emile Souvestre’s 1846 novel Le Monde Tel Qu’il Sera [The World As It Will Be], whisks its protagonists to the dystopian world of the year 3000, and his vehicle for this voyage is a steam locomotive that flies through space and time. And that giant of 19th century science fiction, Jules Verne, offered his own take on the locomotive in his 1863 book Paris au XXe Siècle—this time with the addition of speculative technology in the form of pneumatics.\nAs the locomotive became less of a smoke-breathing novelty and more of a staple of Industrial Age life, science fiction authors were forced to stretch their imaginations further in regard to the train. “The Tachypomp” was written by American newspaperman Edward Page Mitchell in 1874, five years after the final spike was driven into the Pacific Railroad, later to be known as the First Transcontinental Railroad. The short story doesn’t marvel at the locomotive as it existed at the time, but wonders about its potential as a means of infinite speed, a concept that foreshadows Einstein’s Special Theory of Relativity, still 21 years away. Most intriguingly, though, the titular Tachypomp comprises a series of vertically-stack trains resulting in exponential increases in velocity—a staggering symbol of imminent modernity that remains poetic in its conception.\nThe locomotive takes a turn for the horrific in A Mexican Mystery and The Wreck of the World, published in 1888 and ’89, respectively. Written by William Grove, the duology posits a train that is able to fuel itself—and then spins that perpetual source of sustenance into a prototypal form of artificial intelligence. One that embodies the “revolt of the machines” trope that came to typify science fiction as the dark side of industrial progress—pollution, exploitation, and dehumanization—began to become fixed in the collective consciousness. A more standard work of predictive fiction, John Jacob Astor IV’s A Journey in Other Worlds: A Romance of the Future followed in 1894. Among its many wild guesses about the world of the year 2000 is the spot-on prophecy of magnetic levitation (or maglev) trains.\nThe use of the locomotive in fantasy is another fertile topic unto itself, but its seeds can be seen in Rudyard Kipling’s 1897 short story “.007.” Rather than attaining self-awareness via some technological phenomena (as in Grove’s books), the trains in “.007” possess consciousness as a simple matter of course. That aura of magic realism excludes the story from the science fiction canon, but it is noteworthy in this sense: In a sense, “.007” is the first work of science-fantasy. While 19th-century fantasy pioneers such as George MacDonald and William Morris were rejecting industrialization in favor of a rarified pastoralism, Kipling imbued locomotives with mythopoeic souls—to the point where, for all intents and purposes, the trains of “.007” function as ironclad faerie-folk.\nThe advent of the 20th century brought with it a new view of futurism—and of locomotives. The Victorian Era’s romanticism gave way to sharper aesthetic of the Edwardian, and the conquering of one scientific mystery after another rendered the locomotive not only commonplace, but quaint. Inventors and explorers—some, like Robert Goddard, inspired by science fiction writers like H.G. Wells—began setting their sights in earnest on the stars.\nIn a feedback loop of fact and fiction that continued through much of the century, SF writers followed suit. The first major work of the genre to feature trains is Hugo Gernsback’s 1911 novel Ralph 124C 41+. Serialized in Modern Electrics magazine and steeped in the scintillation that would soon inform pulp SF, the book is a grab-bag of futuristic marvels. One of them is a subterranean magnetic train that runs from Europe to North America—but measured against Gernsback’s mad salvo of way-out (and at times eerily prescient) gadgetry, his vision of the locomotive’s future is far from compelling.\nThen came World War I. The first major military conflagration to make extensive use of innovations such airplanes, submarines, and chemical warfare, it reduced the once-noble soldier to mere fodder for death machines. It also indelibly altered human culture—science fiction included. The notion that technology could bring about the extinction of homo sapiens resulted in a strain of dystopianism; SF writers used the genre as a battlefield for opposing ideas about science’s moral value.\nWorld War II didn’t help matters in that regard, nor did the atomic bombings of Japan in 1945. In the midst of this turmoil, there was little room for the locomotive in SF, which might explain why trains all but vanished from the genre during this period. And when they did pop up, they were in children’s books such as Victor Appleton’s Tom Swift and his Electric Locomotive (1922), William Pène Du Bois’s The Flying Locomotive (1941), and Reverend W. Awdry’s The Three Railway Engines (1945). Awdry’s book launched the long-running Railway Series, which eventually inspired the Thomas the Tank Engine TV show. It owes more to Kipling’s “.007” fantastical view of locomotives than to the hard SF of the era, set as it is on the mythic Island of Sodor—in essence, a Middle Earth for trains. Locomotives had once flung themselves toward the future, but as the first mushroom clouds blossomed over major metropolises, the train became a comforting, even infantile symbol of a halcyon past.\nThe Postwar Era didn’t do much for the fortunes of locomotives in SF. Aside from a few random curiosities like A. J. Deutsch’s beguiling 1950 short story, “A Subway Named Möbius”—in which a convoluted geometry of train tracks leads to loops in spacetime—trains just couldn’t capture the imagination the way rockets and time machines could in the Golden Age of SF. Ironically, trains had once served as both rockets and time machines within the genre. By the time Ray Bradbury used the machines in his 1953 classic Fahrenheit 451, they’d been relegated to incidental details. Bradbury would use trains much more centrally in his fantasy work, most notably 1962’s supernatural tour-de-force Something Wicked This Way Comes. Keith Roberts’ genre-defying alt-history masterpiece Pavane appeared in 1968, but its depiction of free-roaming steam traction engines ignores railways altogether. As far as science fiction was concerned, the locomotive had jumped the track.\nA curious thing happened to the SF locomotive in 1969: Man landed on the moon. There’s no direct correlation, of course. But a zeitgeist shift occurred within the genre. With one of SF’s fundamental tropes—a human foot on an extraterrestrial surface—having been fulfilled, writers began to turn their speculative eye elsewhere. The radical New Wave of Science Fiction movement reached its peak in the late ’60s and early ’70s, and one of its figureheads, Michael Moorcock, also spearheaded a peculiar retro-futuristic style that would eventually come to be called steampunk.\nTrains figured into both. Christopher Priest, a young upstart in the New Wave movement, wrote The Inverted World, a mind-bending 1974 novel that envisioned a post-apocalyptic city that inched along a massive railway track. Its inhabitants were forced to stop periodically, take up the track that had already been traversed, and reconstruct it in the path of the city’s forward trajectory. If it failed to move, the city was doomed. A unique work of post-industrial malaise and quantum psychedelia, The Inverted World helped revive the locomotive tradition in speculative literature. Preceding it by a year, though, was Harry Harrison, A Transatlantic Tunnel, Hurrah! (first serialized in Analog as Tunnel Through the Deeps), a far less angst-ridden novel of proto-steampunk adventure that features—as the title promises—a race among para-Victorians to build a submerged train tunnel through the Atlantic. Now that human beings routinely traveled back and forth to the moon, steampunk’s invigorating mashup of prognostication and nostalgia would take greater hold of the genre’s attention, even if the locomotive—that most vivid emblem of steam power—became more of a prop than a trope.\nThe ’70s and ’80s were a free-for-all for SF, and the genre plundered its own canon with glee. Accordingly, few of the locomotive’s sporadic appearances during that period are particularly innovative. In John Varley’s 1977 novel The Ophiuchi Hotline, Gernsback’s underground gravity train is recycled and updated. Michael Coney’s The Celestial Steam Locomotive from 1983 flexes more imagination with its vision of a train that traverses space and dimensions, and Greg Bear’s 1985 novel Eon produces an eye-popping image of a trackless millipede-like train that sadly doesn’t capitalize on that biomimetic potential. By the time Thomas N. Scotia’s 1987 book Blowout! digs up the threadbare premise of a transcontinental railroad tunnel, it seemed as though the locomotive might once again fade entirely from the SF mainstream.\nThen came Desolation Road. Ian McDonald’s stunning 1988 debut is marvel on many levels, but his virtuoso depiction of locomotives on a terraformed Mars breathed new life into the possibility of trains as conceptual vehicles—as well as potent symbols. In every way, it’s the zenith of SF’s on-again-off-again obsession with the locomotive, executed with magic-realist richness and tech-geek zeal alike.\nMcDonald was also interested in cyberpunk, though, as was much of the SF world in the late ’80s and early ’90s. Consequently, the locomotive—perhaps the least cyberpunk-esque appliance in the SF toolbox—came closer than ever to obsolescence in the waning years of the 20th century. Apart from the wind-trains in Sean McMullen’s 1999 novel Souls in the Great Machine, the turn of the millennium came and went with SF’s great railroad tradition predominantly silent. It was McDonald himself who brought trains back from the brink in 2001’s Ares Express, his long-awaited follow-up to Desolation Road that brings his Martian locomotives—and the dynastic clans who engineer them—into even more dazzling focus.\nAt the same time, a nebulous new movement in science fiction, New Weird, was beginning to rise—much of it, incidentally, influenced by McDonald’s prior mutation of SF, fantasy, and magic realism. At the heart of the movement was British wunderkind China Miéville. And as the world soon learned, Miéville loves trains. In his 2004 novel Iron Council—the third book in his loosely connected Bas-Log trilogy—a band of outlaws form a roving socialist society aboard a train that runs on a limited span of track, which must be perpetually picked up behind and then relaid ahead. It’s a loving homage to Priest’s The Inverted World, but Miéville gives his purloined premise fresh purpose and relevance; in fact, his city-on-tracks may as well be a metaphor for his own career as it explores unknown territories of genre while retaining strong ties to its past. He visits the locomotive more originally—but less successfully—in his 2012 young-adult novel Railsea. This time he leans his pastiche on Moby-Dick, only instead of ships hunting whales, a locomotive scours a track-scarred desert in search of the giant, mole-like moldywarpe. The book embodies Miéville postmillennial salvagepunk ethic, even as the text itself serves as a prime example of its literary analog.\nWith the 21st century well underway, the locomotive has begun to gain momentum once more. Much of the previous centuries’ grandiloquent predictions about tomorrow were to have taken place already. Few have. The past, in truth, exists alongside the future—and the locomotive paradoxically feels like an anachronism than it once did. Ekaterina Sedia’s 2011 novel Heart of Iron touches on steampunk without committing to its limitations; in doing so, the book’s alt-history take on czarist Russia and the race to build a transcontinental railroad across Asia harkens all the way back to the conjoined births of both SF and the locomotive. Similarly, Genevieve Valentine’s 2013 short story “Terrain” concerns the predatory encroachment of the Union Pacific Railroad in a steampunk-accented Wyoming, a chiseled fable of human versus piston that celebrates the romance of the rails even as it chillingly deconstructs it.\nTherein lies the longevity of the locomotive in science fiction. The vehicle itself may be all but abandoned when it comes to use by passengers—but so, at this point, has the spaceship. There’s a latent puissance in these metallic capsules, though, that waits to be unlocked—with a stripping of dust, a stoking of the engine, a pulling of the levers, and the tapping of a gauge or two. The future is today, and it is tomorrow, and it is yesterday. All it takes is a train to carry us there.\nJason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "source": "https://clarkesworldmagazine.com/heller_06_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Beyond the Tracks: The Locomotive in Science Fiction Literature by Jason Heller"}