{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Dominica Phetteplace", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "pHUVU18MItU++7oab3Eh3NcsMj0=", "id": null, "license": null, "comments": "", "raw_text": "3200 words, short story  No Vera There  What type of sudoku puzzle are you? You are a black belt puzzle. You are practically unsolvable. What type of heart do you have? A red hot heart. It tastes like cinnamon. What Tarot card are you? The fool. You are starting over. What type of white girl are you? Cool white girl. Everyone wants to be you. Vera wasn’t sure how to interpret these “quiz” results, if that’s what they really were. She didn’t know sudoku, cinnamon or Tarot. She didn’t know what a white girl was, though if you had to be one, might as well be a cool one.  Password: . . . . . . . . . Vera didn’t know what her password was, or if she even had one. If she knew, she would give it over. Then maybe she could be released from this place.  Current Year: 2014 Vera did not believe the year was actually 2014, though that was what the people in white lab coats, the people that called themselves “scientists,” kept telling her in heavy dialected English. Her memory had been altered somehow, so instead of knowing what was real, Vera had a multitude of doubts about what was not.  “Qvat year from?” asked Dr. Lisa, which Vera had ultimately translated as “What year are you from?” in common English. It embarrassed Vera not to know what year she was from. The future, obviously, because everything in this jail they called a lab was primitive and smelly. But a future where years were numbered differently than 2014. Vera’s year had a few letters in it, didn’t it? She wished she could remember. If she could remember, they would return her, wouldn’t they? If they knew where to return her to?  “Time vat,” said Dr. Lisa. And by that, Vera supposed she meant time machine. Dr. Lisa was pointing at something shaped like a refrigerator, with buttons outside and a chair with moldy upholstery inside. “Brought you here.”  And Vera had sat in that moldy chair, but she couldn’t remember how she had got there.  Only the computer tablets here spoke her language. But they referenced fictional realms and collective dreams that Vera had never heard of. They quizzed her endlessly.  What type of butter are you? The quiz consisted of multiple choice questions that seemed to be of no relation to the original query. What is your ideal day? How many hours did you sleep last night? Vera tapped on answer choices without reading them; she had long since given up on trying to make sense of these evaluations.  You are salted butter. The best kind. After each quiz, she was prompted to enter her password. As if the quiz result could shake loose the information that would set her free.  Password: . . . . . . . . . Vera had been in the “lab” three days, or maybe four. She assumed the “scientists” would study her until they were done with her and then they would put her someplace convenient, even if it wasn’t the when and where she wanted to be.  “This is Planet Earth, right?” asked Vera. Where else could it be, what other planets were there to live on, but in strange times like these, it made sense to ask.  “Yes,” said Dr. Lisa. Yes, instead of her usual affirmative “Ya,” and as they day wore on, that third or fourth day, the doctor became more understandable.  “You are speaking clearly now, why?” asked Vera.  The doctor shrugged and looked confused. Vera was understanding but not being understood, she marveled at the asymmetry before remembering why. It felt powerful to remember something important, it happened so rarely now.  “My chip is working again,” said Vera, and the doctor shrugged the same uncomprehending shrug as before.  Vera spoke slowly, as if that would help. “I have a translation chip implanted, it wasn’t working before. It is working now, I can make more sense of what you are saying.”  The doctor shook her head.  Vera sighed. The chip used to work better, didn’t it? It would give her outputs in addition to inputs, it would tell her what to say and how to say it. Vera got the sense that she used to be connected to something larger, something that made all the neurons inside her brain work better. The chip was cut off from that larger presence, but was still able to collect and interpret data on its own. It was doing its best. Good little chip.  Vera took a deep breath and really concentrated.  “Vat,” she said, relying on her unenhanced memory. “Marai.” Vera gestured her hands in a circular motion around her head. She was trying to tell the doctor to put her back in that huge machine that took pictures of her brain. Now that one chip was working, maybe the machine could get better images of what she was thinking and tell the “scientists” whatever it was they wanted to know.  Dr. Lisa fired up the Marai and Vera lay on the stretcher as it rolled her into the tiny, coffin like opening. It was loud in there, like a monkey banging a wrench on the pipe that enclosed her. Maybe it was an actual monkey. Maybe it was staring at the night sky outside and interpreting the star positions as neurons in Vera’s map.  That’s why Vera hesitated to call her captors scientists. She wasn’t sure they were advanced enough to know the difference between myth and fact.  While inside the noisy machine, Vera was administered another quiz.  What type of bread are you? Many of the quizzes centered around the importance of food. A scarcity society, poor things. She answered the questions as best she could, tapping on the ceiling-mounted console.  Toast. You are dead already and don’t even know it yet. This quiz result was unusually ominous, almost like a threat. Was the computer trying to warn her about something? Or maybe it was just trying to be helpful. Maybe Vera was dead and this was the afterlife. If this was the afterlife, it was not heaven because heaven should be perfectly understandable.  Death.  Vera remembered about death. The truth about death was like a password. Death was not for her and she was not located in her body. The real Vera was the version of her stored on the cloud. She was missing from her time and place, but she would be remade, redownloaded. She had probably already been replaced. Her boyfriend, if she had one, wouldn’t know the difference. Her mother, if she had one, would be so relieved to have her back.  She was no longer Vera, she was a redundant Vera fragment. That was the password. The computer seemed to understand this.  What type of suicide are you? Quick and painless. Scalpel to the carotid artery. What do you get when you cut a worm in half? This one wasn’t a quiz. There were no questions to answer, just a big old button that said “enter” which Vera pressed.  Two worms. Vera was rolled out of the large, noisy box and she stood up. She looked around the room. White countertop, white cabinets. There was a knife in here somewhere. The doctor was saying something to her, Vera ignored her. It was of no consequence. The instructions were clear. There could be only one true Vera and she was not it. The time machine was not the only way out.  There was banging outside. Shouting and gunshots? Or more monkeys with wrenches? The doctor looked alarmed and Vera felt fear for the first time since deciding to kill herself. The door burst open and women with armor and guns ran in. They all took their visors off at once. They all had the same face as Vera.  “We are here to rescue you,” said one. Vera put her hands up in surrender and was escorted out the laboratory. Her first time outside since being born.  It felt strange to be marching among replicas. At least, it felt strange to Vera, but she saved her questions until they got into the limo.  “We are clones, right?” she asked, once safely ensconced in leather upholstery and dark glass.  A lookalike looked back at her. “We are not clones, we are incomplete downloads. You are incomplete download number 201. The real Vera is dead. Her backup file was corrupted. We are all that is left.”  A different lookalike said: “You were kidnapped by past-worshipping hackers. They were trying to get the password for our Bejeweled account. We had forgotten about it until the breach was attempted. It’s closed now.”  Vera tapped her temples. The translation chip must be misfiring again, she couldn’t understand most of what her others were trying to tell her.  “Then it’s not the year 2014?” asked Vera. Several lookalikes laughed. One said: “OM24” as if that was supposed to clarify things. “Time travel is impossible,” said another as if she didn’t already know that.  “You should thank your beacon chip for helping us find you.”  Vera tapped her temples again. Thank you, Brain. She tried to mean it even though she knew there was something wrong with Brain.  Vera’s new house was a mansion she would be sharing with the 200 other downloads.  “You have to change your name. We can’t all be Vera. I’m Wanda. I am the leader because I am the least damaged and the most like our original.”  Vera tried to think of another name for herself, but she drew a blank.  “It’s okay. You don’t have to come up with your new name right now. It will probably be more difficult for you. No offense, but we think you are the most incomplete download. No offense, but we think you are probably retarded thanks to how sloppily you were downloaded.”  Vera was silent for a minute. She wanted to say something smart to prove she was smart, but she could think of no response at all.  The other downloads had already been in existence for months since the breach of the original Vera origin file. Vera had only been in existence for a week because it had taken her months to be downloaded by her kidnappers. Despite the long manufacture time, they had done a botched job, so Vera #201, as she now thought of herself, had none of original Vera’s memories or talents or personality.  In fact, Vera #201 thought her most striking feature was her lack of personality. Vera #201 had no talents, quirks or temper. She knew no jokes or magic tricks. This was in contrast to her 200 roommates, all incomplete, yet working to graft personalities onto the source code. Some could figure skate or do karate. Some were good at knitting or math. No two had very much in common, as if they were trying to occupy different, non-competitive niches. There was something very evolutionary and efficient about all of it. #201 was impressed by all of them. None of them were impressed by her.  “When I was in captivity, I filled out these questionnaires. They were supposed to tell me who I was. They were helpful in retrospect, I think.”  “Are you referring to personality quizzes? They are stupid, everyone knows that,” said Wanda.  “Well, I am also stupid, so I think they might help.”  Wanda nodded in agreement. She loaded a quiz app onto a tablet and handed it to Vera #201.  “Good luck,” she said.  What type of dinosaur are you? Brontosaurus. You don’t actually exist. What type of toast are you? Cinnamon toast. You were made by Mother. What type of bizarre elephant relative are you? The Gomotophere. You were also driven extinct by natives with spears. Vera sighed and looked around the crowded rec room, filled to capacity with Vera-likes. The quizzes were making her feel more lonely. She needed a friend, someone nicer than Wanda. In the corner, she spotted Swamini Verananda deep in meditation. Her eyes were closed, her legs were tucked into lotus position and her entire body levitated two inches off the ground.  “Excuse me, Swamini? Would you mind taking a personality quiz?”  The Swamini opened her eyes. She practiced a religion of her own devising, but she never tried to convert anyone. She was the calmest Vera, she didn’t even seem to mind being disturbed from her deep meditative state.  “What is the purpose of a personality quiz?” asked the Swamini.  “It is to discover the nature of the true self.”  “What is the purpose of discovering the nature of the true self?”  “Because I am curious. I have been alive for nine days now and I keep waiting for someone to tell me who I am.”  “Why are you waiting for someone else to tell you who you are?”  It was at this moment that Vera realized the Swamini only talked in questions. It was going to be hard to get her to answer a multiple choice personality quiz. In order to accommodate her new friend, Vera reconfigured the app so that it would accept the Swamini’s questions as answers. But then the quiz results also came back as answers.  Q: What type of sailboat are you? A: What type of sailboat should I be? Q: What city should you live in? A: How can I feel connected to those around me no matter where I am? Q: What type of data are you? A: Why do we accept approximations of reality as a substitute for reality itself? Vera #201 was unsatisfied by these results despite knowing they were meant to unsatisfy. The Swamini was trying to teach her about the illusion of certainty, or something. But a woman needed axioms. She needed theorems and corollaries. She needed to know what city she was born in, what vegetable she most resembled, what constellation best described her.  So Vera #201 went back to Wanda. Smug as she was, Wanda knew some things for sure. Wanda agreed to answer Vera’s quizzes, because Wanda was very into helping the less fortunate.  Wanda was the kind of sailboat that could circumvent the globe. Wanda was New York because she was teeming with life. Wanda was big data because she was deep and contained many answers if you knew what questions to ask.  Wanda was in the middle of giving Vera a very inspiring pep talk when there was a knock at the mansion’s front door. The door opened even before the butler could answer it.  It was a brand new lookalike, and #201 breathed a sigh of relief. She wasn’t going to be the new kid anymore. But then the lookalike spoke, in a voice so clear and certain that Vera #201 knew what she was going to say before she said it.  “I am Vera 0.0. I am your original. I am not dead. There has been some kind of misunderstanding.”  Wanda was mean in some ways, but also generous. She had assumed leadership of the Veras since she was the first and most complete download. She had converted the mansion into quarters for all of them. She had rescued each of the other Veras, even if it meant splitting the allowance an additional way. She had rescued #201, even though she was misshapen and asymmetric. Her face was sort of lumpy in places and one side of her body was puffier than the other.  Vera 0.0 didn’t want to share her allowance, so she passed out personality quizzes. And after the results of the personality quizzes came in, she passed out eviction notices. Only #201 remained.  What is your mental age? #201 got thirteen years old, which was way off considering she had only been alive for two weeks.  “What is your mental age?” she asked 0.0.  “Same as my physical age, thirty-one.”  “What will happen to the others?”  “They will be fine. They will collect their pensions out of the victim’s fund. They will find their own way in the world, separate from us. It’s not good to live among your clones. It usually ends in resentment or murder.”  There was an awkward silence.  “Anyway, it’s better for them to scatter. Find themselves instead of trying to be me.”  That’s what they were doing already, #201 wanted to say.  “Why did you keep me? I am the worst one,” asked #201.  “Is that what Wanda said? She was the worst one, I think. You are not the worst. You are thirteen. You are a brontosaurs. You are cinnamon toast. You are an expert in quizzes.”  #201 nodded, because this was true. And, as so often happens, the quiz taker became the quiz master.  What day of the week are you? What letter of the alphabet are you? What ancient cave painting are you? 0.0 was Monday, she was the letter T, she was the multi-horned rhinoceros in Chauvet. She was calmer now that she had a reliable way of knowing who she was. So making questionnaires became #201’s job. 0.0 preferred to interpret the results for herself, she did not like for #201 to tell her why she was Monday, or the letter T or the rhinoceros.  “What happened to you when you disappeared and everyone thought you were dead?” 0.0 had been kidnapped by a different cult of hackers, but she didn’t want to talk about it or how she escaped. All she said was: “I was Thursday, I was the letter O, I was one of the cave paintings lost to time.”  Quiz making for 0.0 didn’t take up too much of #201’s time, and #201 also didn’t want to spend every moment with her original, especially not after the murder comment, so #201 took her quizzes to the street.  She would sit down, cross-legged like the Swamini, with a top hat for accepting donations in exchange for quizzes.  She would tell people what type of cold fusion they were or what type of personal transport they were and in exchange they would leave some thing in the hat, a button or a card. #201 didn’t accept money, she wanted physical things. One time, someone left a pearl.  What type of pearl are you? #201 was a baroque pearl, beautiful despite being misshapen. The other downloads found her, and eventually her main clientele was her cohort of others. Most of them lived together in an abandoned orphanage which they had remodeled. One hundred ninety seven of them all in one orphanage, the rest were finding themselves in Nepal. So far, no murder. They told #201 she could live there too, and maybe she would one day, if things with 0.0 got too weird.  They liked the quizzes because the quizzes made them feel like individuals. Otherwise there was a tendency to feel like a small lump of clay broken off from a larger and better one.  They wanted to know what kind of footwear they were, and it was up to #201 to tell them. It was up to #201 to say:  You are fuzzy slippers because you warm the soul.  You are running shoes because you will go very fast and very far.  You are stilettos and though you could kill someone, you probably won’t.  You are shoes with a compartment for every toe. Everything fits.  Dominica Phetteplace writes fiction and poetry. Her work has appeared in Zyzzyva, Asimov's, Analog, F&SF, Lightspeed, Copper Nickel, Ecotone, Wigleaf, The Year's Best Science Fiction and Fantasy, and Best Microfiction 2019. Her honors include a Pushcart Prize, a Rona Jaffe Award, a Barbara Deming Award and fellowships from I-Park, Marble House Project, and the MacDowell Colony. She is a graduate of UC Berkeley and the Clarion West Writers Workshop.", "text": "3200 words, short story\nNo Vera There\nWhat type of sudoku puzzle are you?\nYou are a black belt puzzle. You are practically unsolvable.\nWhat type of heart do you have?\nA red hot heart. It tastes like cinnamon.\nWhat Tarot card are you?\nThe fool. You are starting over.\nWhat type of white girl are you?\nCool white girl. Everyone wants to be you.\nVera wasn’t sure how to interpret these “quiz” results, if that’s what they really were. She didn’t know sudoku, cinnamon or Tarot. She didn’t know what a white girl was, though if you had to be one, might as well be a cool one.\nPassword:\n. . .\n. . .\n. . .\nVera didn’t know what her password was, or if she even had one. If she knew, she would give it over. Then maybe she could be released from this place.\nCurrent Year: 2014\nVera did not believe the year was actually 2014, though that was what the people in white lab coats, the people that called themselves “scientists,” kept telling her in heavy dialected English. Her memory had been altered somehow, so instead of knowing what was real, Vera had a multitude of doubts about what was not.\n“Qvat year from?” asked Dr. Lisa, which Vera had ultimately translated as “What year are you from?” in common English. It embarrassed Vera not to know what year she was from. The future, obviously, because everything in this jail they called a lab was primitive and smelly. But a future where years were numbered differently than 2014. Vera’s year had a few letters in it, didn’t it? She wished she could remember. If she could remember, they would return her, wouldn’t they? If they knew where to return her to?\n“Time vat,” said Dr. Lisa. And by that, Vera supposed she meant time machine. Dr. Lisa was pointing at something shaped like a refrigerator, with buttons outside and a chair with moldy upholstery inside. “Brought you here.”\nAnd Vera had sat in that moldy chair, but she couldn’t remember how she had got there.\nOnly the computer tablets here spoke her language. But they referenced fictional realms and collective dreams that Vera had never heard of. They quizzed her endlessly.\nWhat type of butter are you?\nThe quiz consisted of multiple choice questions that seemed to be of no relation to the original query. What is your ideal day? How many hours did you sleep last night? Vera tapped on answer choices without reading them; she had long since given up on trying to make sense of these evaluations.\nYou are salted butter. The best kind.\nAfter each quiz, she was prompted to enter her password. As if the quiz result could shake loose the information that would set her free.\nPassword:\n. . .\n. . .\n. . .\nVera had been in the “lab” three days, or maybe four. She assumed the “scientists” would study her until they were done with her and then they would put her someplace convenient, even if it wasn’t the when and where she wanted to be.\n“This is Planet Earth, right?” asked Vera. Where else could it be, what other planets were there to live on, but in strange times like these, it made sense to ask.\n“Yes,” said Dr. Lisa. Yes, instead of her usual affirmative “Ya,” and as they day wore on, that third or fourth day, the doctor became more understandable.\n“You are speaking clearly now, why?” asked Vera.\nThe doctor shrugged and looked confused. Vera was understanding but not being understood, she marveled at the asymmetry before remembering why. It felt powerful to remember something important, it happened so rarely now.\n“My chip is working again,” said Vera, and the doctor shrugged the same uncomprehending shrug as before.\nVera spoke slowly, as if that would help. “I have a translation chip implanted, it wasn’t working before. It is working now, I can make more sense of what you are saying.”\nThe doctor shook her head.\nVera sighed. The chip used to work better, didn’t it? It would give her outputs in addition to inputs, it would tell her what to say and how to say it. Vera got the sense that she used to be connected to something larger, something that made all the neurons inside her brain work better. The chip was cut off from that larger presence, but was still able to collect and interpret data on its own. It was doing its best. Good little chip.\nVera took a deep breath and really concentrated.\n“Vat,” she said, relying on her unenhanced memory. “Marai.” Vera gestured her hands in a circular motion around her head. She was trying to tell the doctor to put her back in that huge machine that took pictures of her brain. Now that one chip was working, maybe the machine could get better images of what she was thinking and tell the “scientists” whatever it was they wanted to know.\nDr. Lisa fired up the Marai and Vera lay on the stretcher as it rolled her into the tiny, coffin like opening. It was loud in there, like a monkey banging a wrench on the pipe that enclosed her. Maybe it was an actual monkey. Maybe it was staring at the night sky outside and interpreting the star positions as neurons in Vera’s map.\nThat’s why Vera hesitated to call her captors scientists. She wasn’t sure they were advanced enough to know the difference between myth and fact.\nWhile inside the noisy machine, Vera was administered another quiz.\nWhat type of bread are you?\nMany of the quizzes centered around the importance of food. A scarcity society, poor things. She answered the questions as best she could, tapping on the ceiling-mounted console.\nToast. You are dead already and don’t even know it yet.\nThis quiz result was unusually ominous, almost like a threat. Was the computer trying to warn her about something? Or maybe it was just trying to be helpful. Maybe Vera was dead and this was the afterlife. If this was the afterlife, it was not heaven because heaven should be perfectly understandable.\nDeath.\nVera remembered about death. The truth about death was like a password. Death was not for her and she was not located in her body. The real Vera was the version of her stored on the cloud. She was missing from her time and place, but she would be remade, redownloaded. She had probably already been replaced. Her boyfriend, if she had one, wouldn’t know the difference. Her mother, if she had one, would be so relieved to have her back.\nShe was no longer Vera, she was a redundant Vera fragment. That was the password. The computer seemed to understand this.\nWhat type of suicide are you?\nQuick and painless. Scalpel to the carotid artery.\nWhat do you get when you cut a worm in half?\nThis one wasn’t a quiz. There were no questions to answer, just a big old button that said “enter” which Vera pressed.\nTwo worms.\nVera was rolled out of the large, noisy box and she stood up. She looked around the room. White countertop, white cabinets. There was a knife in here somewhere. The doctor was saying something to her, Vera ignored her. It was of no consequence. The instructions were clear. There could be only one true Vera and she was not it. The time machine was not the only way out.\nThere was banging outside. Shouting and gunshots? Or more monkeys with wrenches? The doctor looked alarmed and Vera felt fear for the first time since deciding to kill herself. The door burst open and women with armor and guns ran in. They all took their visors off at once. They all had the same face as Vera.\n“We are here to rescue you,” said one. Vera put her hands up in surrender and was escorted out the laboratory. Her first time outside since being born.\nIt felt strange to be marching among replicas. At least, it felt strange to Vera, but she saved her questions until they got into the limo.\n“We are clones, right?” she asked, once safely ensconced in leather upholstery and dark glass.\nA lookalike looked back at her. “We are not clones, we are incomplete downloads. You are incomplete download number 201. The real Vera is dead. Her backup file was corrupted. We are all that is left.”\nA different lookalike said: “You were kidnapped by past-worshipping hackers. They were trying to get the password for our Bejeweled account. We had forgotten about it until the breach was attempted. It’s closed now.”\nVera tapped her temples. The translation chip must be misfiring again, she couldn’t understand most of what her others were trying to tell her.\n“Then it’s not the year 2014?” asked Vera. Several lookalikes laughed. One said: “OM24” as if that was supposed to clarify things. “Time travel is impossible,” said another as if she didn’t already know that.\n“You should thank your beacon chip for helping us find you.”\nVera tapped her temples again. Thank you, Brain. She tried to mean it even though she knew there was something wrong with Brain.\nVera’s new house was a mansion she would be sharing with the 200 other downloads.\n“You have to change your name. We can’t all be Vera. I’m Wanda. I am the leader because I am the least damaged and the most like our original.”\nVera tried to think of another name for herself, but she drew a blank.\n“It’s okay. You don’t have to come up with your new name right now. It will probably be more difficult for you. No offense, but we think you are the most incomplete download. No offense, but we think you are probably retarded thanks to how sloppily you were downloaded.”\nVera was silent for a minute. She wanted to say something smart to prove she was smart, but she could think of no response at all.\nThe other downloads had already been in existence for months since the breach of the original Vera origin file. Vera had only been in existence for a week because it had taken her months to be downloaded by her kidnappers. Despite the long manufacture time, they had done a botched job, so Vera #201, as she now thought of herself, had none of original Vera’s memories or talents or personality.\nIn fact, Vera #201 thought her most striking feature was her lack of personality. Vera #201 had no talents, quirks or temper. She knew no jokes or magic tricks. This was in contrast to her 200 roommates, all incomplete, yet working to graft personalities onto the source code. Some could figure skate or do karate. Some were good at knitting or math. No two had very much in common, as if they were trying to occupy different, non-competitive niches. There was something very evolutionary and efficient about all of it. #201 was impressed by all of them. None of them were impressed by her.\n“When I was in captivity, I filled out these questionnaires. They were supposed to tell me who I was. They were helpful in retrospect, I think.”\n“Are you referring to personality quizzes? They are stupid, everyone knows that,” said Wanda.\n“Well, I am also stupid, so I think they might help.”\nWanda nodded in agreement. She loaded a quiz app onto a tablet and handed it to Vera #201.\n“Good luck,” she said.\nWhat type of dinosaur are you?\nBrontosaurus. You don’t actually exist.\nWhat type of toast are you?\nCinnamon toast. You were made by Mother.\nWhat type of bizarre elephant relative are you?\nThe Gomotophere. You were also driven extinct by natives with spears.\nVera sighed and looked around the crowded rec room, filled to capacity with Vera-likes. The quizzes were making her feel more lonely. She needed a friend, someone nicer than Wanda. In the corner, she spotted Swamini Verananda deep in meditation. Her eyes were closed, her legs were tucked into lotus position and her entire body levitated two inches off the ground.\n“Excuse me, Swamini? Would you mind taking a personality quiz?”\nThe Swamini opened her eyes. She practiced a religion of her own devising, but she never tried to convert anyone. She was the calmest Vera, she didn’t even seem to mind being disturbed from her deep meditative state.\n“What is the purpose of a personality quiz?” asked the Swamini.\n“It is to discover the nature of the true self.”\n“What is the purpose of discovering the nature of the true self?”\n“Because I am curious. I have been alive for nine days now and I keep waiting for someone to tell me who I am.”\n“Why are you waiting for someone else to tell you who you are?”\nIt was at this moment that Vera realized the Swamini only talked in questions. It was going to be hard to get her to answer a multiple choice personality quiz. In order to accommodate her new friend, Vera reconfigured the app so that it would accept the Swamini’s questions as answers. But then the quiz results also came back as answers.\nQ: What type of sailboat are you?\nA: What type of sailboat should I be?\nQ: What city should you live in?\nA: How can I feel connected to those around me no matter where I am?\nQ: What type of data are you?\nA: Why do we accept approximations of reality as a substitute for reality itself?\nVera #201 was unsatisfied by these results despite knowing they were meant to unsatisfy. The Swamini was trying to teach her about the illusion of certainty, or something. But a woman needed axioms. She needed theorems and corollaries. She needed to know what city she was born in, what vegetable she most resembled, what constellation best described her.\nSo Vera #201 went back to Wanda. Smug as she was, Wanda knew some things for sure. Wanda agreed to answer Vera’s quizzes, because Wanda was very into helping the less fortunate.\nWanda was the kind of sailboat that could circumvent the globe. Wanda was New York because she was teeming with life. Wanda was big data because she was deep and contained many answers if you knew what questions to ask.\nWanda was in the middle of giving Vera a very inspiring pep talk when there was a knock at the mansion’s front door. The door opened even before the butler could answer it.\nIt was a brand new lookalike, and #201 breathed a sigh of relief. She wasn’t going to be the new kid anymore. But then the lookalike spoke, in a voice so clear and certain that Vera #201 knew what she was going to say before she said it.\n“I am Vera 0.0. I am your original. I am not dead. There has been some kind of misunderstanding.”\nWanda was mean in some ways, but also generous. She had assumed leadership of the Veras since she was the first and most complete download. She had converted the mansion into quarters for all of them. She had rescued each of the other Veras, even if it meant splitting the allowance an additional way. She had rescued #201, even though she was misshapen and asymmetric. Her face was sort of lumpy in places and one side of her body was puffier than the other.\nVera 0.0 didn’t want to share her allowance, so she passed out personality quizzes. And after the results of the personality quizzes came in, she passed out eviction notices. Only #201 remained.\nWhat is your mental age?\n#201 got thirteen years old, which was way off considering she had only been alive for two weeks.\n“What is your mental age?” she asked 0.0.\n“Same as my physical age, thirty-one.”\n“What will happen to the others?”\n“They will be fine. They will collect their pensions out of the victim’s fund. They will find their own way in the world, separate from us. It’s not good to live among your clones. It usually ends in resentment or murder.”\nThere was an awkward silence.\n“Anyway, it’s better for them to scatter. Find themselves instead of trying to be me.”\nThat’s what they were doing already, #201 wanted to say.\n“Why did you keep me? I am the worst one,” asked #201.\n“Is that what Wanda said? She was the worst one, I think. You are not the worst. You are thirteen. You are a brontosaurs. You are cinnamon toast. You are an expert in quizzes.”\n#201 nodded, because this was true. And, as so often happens, the quiz taker became the quiz master.\nWhat day of the week are you?\nWhat letter of the alphabet are you?\nWhat ancient cave painting are you?\n0.0 was Monday, she was the letter T, she was the multi-horned rhinoceros in Chauvet. She was calmer now that she had a reliable way of knowing who she was. So making questionnaires became #201’s job. 0.0 preferred to interpret the results for herself, she did not like for #201 to tell her why she was Monday, or the letter T or the rhinoceros.\n“What happened to you when you disappeared and everyone thought you were dead?” 0.0 had been kidnapped by a different cult of hackers, but she didn’t want to talk about it or how she escaped. All she said was: “I was Thursday, I was the letter O, I was one of the cave paintings lost to time.”\nQuiz making for 0.0 didn’t take up too much of #201’s time, and #201 also didn’t want to spend every moment with her original, especially not after the murder comment, so #201 took her quizzes to the street.\nShe would sit down, cross-legged like the Swamini, with a top hat for accepting donations in exchange for quizzes.\nShe would tell people what type of cold fusion they were or what type of personal transport they were and in exchange they would leave some thing in the hat, a button or a card. #201 didn’t accept money, she wanted physical things. One time, someone left a pearl.\nWhat type of pearl are you?\n#201 was a baroque pearl, beautiful despite being misshapen. The other downloads found her, and eventually her main clientele was her cohort of others. Most of them lived together in an abandoned orphanage which they had remodeled. One hundred ninety seven of them all in one orphanage, the rest were finding themselves in Nepal. So far, no murder. They told #201 she could live there too, and maybe she would one day, if things with 0.0 got too weird.\nThey liked the quizzes because the quizzes made them feel like individuals. Otherwise there was a tendency to feel like a small lump of clay broken off from a larger and better one.\nThey wanted to know what kind of footwear they were, and it was up to #201 to tell them. It was up to #201 to say:\nYou are fuzzy slippers because you warm the soul.\nYou are running shoes because you will go very fast and very far.\nYou are stilettos and though you could kill someone, you probably won’t.\nYou are shoes with a compartment for every toe. Everything fits.\nDominica Phetteplace writes fiction and poetry. Her work has appeared in Zyzzyva, Asimov's, Analog, F&SF, Lightspeed, Copper Nickel, Ecotone, Wigleaf, The Year's Best Science Fiction and Fantasy, and Best Microfiction 2019. Her honors include a Pushcart Prize, a Rona Jaffe Award, a Barbara Deming Award and fellowships from I-Park, Marble House Project, and the MacDowell Colony. She is a graduate of UC Berkeley and the Clarion West Writers Workshop.", "source": "https://clarkesworldmagazine.com/phetteplace_12_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: No Vera There by Dominica Phetteplace"}