{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeff VanderMeer", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "F2oNrmPgCOjq1QbzUFyLjqFbBgQ=", "id": null, "license": null, "comments": "", "raw_text": "Interview  An Interview with John Picacio  John Picacio is one of the respected artists in the field, having won the World Fantasy Award and the Chesley, among others, along with being a four-time Hugo nominee. Picacio is also one of the nicest people in the field, so perhaps it’s no surprise that one of his most recent projects has been creating the cover and interior illustrations for the first of an iconic set of books by the nicest person in the field, Michael Moorcock. Ballantine/Del Rey is launching the new Elric trade paperback series this month with ELRIC: THE STEALER OF SOULS . I talked to Picacio about his work for Moorcock, upcoming covers for Jeffrey Ford, and a variety of other subjects . . .    The Elric novels are not the first time you’ve animated Moorcock’s work with your art. Do you ever bounce ideas off of him? How well do you know him?  The first book I ever illustrated was by Mike—the 30th Anniversary edition of Behold the Man. I did the cover, interior illustrations, and full book design for that one. I’ve done a few covers for his books since then. This new Elric book really feels like things coming full-circle though because not only am I working with Mike again, but this time, it’s for one of the most iconic fantasy characters ever. Quick story from back when I did that Behold the Man gig . . . Rick Klaw and Ben Ostrander (editor & publisher of Mojo Press) drove me to Mike’s house to discuss the project. I had done all my reading and had all kinds of questions, and I was thinking Mike would set the course and tell me what he wanted the project to look like. I mean, he’s Michael Moorcock, one of the giants of the field, and I’m a guy who’s never done a book cover before, so I figured he’d just say, “Here’s what you’re gonna do.” Instead, he basically said, “Hey, it’s in your hands. You’ve got talent. I trust you to make it great.” Looking back, that may have been the most important moment of my career. Mike’s faith gave me huge confidence and really, I’ve never looked back since. That attitude of being proactive rather than waiting to be told what to draw and paint . . . to think for myself and be an active participant in the publishing process . . . that attitude was really sparked by Mike and his trust back when I did that first gig. Last year, when I did the new Elric stuff, I had a pretty firm battleplan for what I wanted to do, and when I met with Mike to break it down with him, he just kept smiling and giving me the nod. A kind word here, a kind word there, but he again gave me virtually free reign. When I had questions, he was always quick to clarify, but never told me what to do. He’s not only one of the great authors in the history of fantasy, but he’s one of the great gentlemen. I’ve said it before, and it still holds true—I’d take a bullet for the man.  When dealing with classic material like this, do you ever worry about trying to match the vision in the heads of the many, many readers who have a specific idea of, for example, what Elric must look like?  Early on, a good friend pulled me aside and said, “No matter what you do on Elric, you know a lot of people are gonna hate it, right?” Oddly enough, that statement really took the pressure off me. I felt like, “hey, I might as well do my thing because there’s no way to please everyone, so let’s just go for it.” Like I said before, Mike expects out of an illustrator what any creator should expect of themselves – he expects you to bring the absolute most potent and personal vision you can offer to the audience at that given moment. He doesn’t expect my way to look like Yoshitaka Amano or Michael Whelan or James Cawthorn or anyone else. And hell, I’d be disappointed in myself, if my stuff turned out that way. There’s a history of greats that preceded me, and if I’m not adding any fresh insight or vision to the lineage, then what’s the use, really? So I expect myself to bring something fresh and new to the icon. However, along with that, it’s possible that some fans who see the character a certain way may not embrace my way immediately. That’s totally cool; that’s part of the biz.    Did you do any research into prior Elric covers? If so, did you discover anything Clarkesworld readers might find of interest?  Yeah, I was already aware of a lot of the great Elric stuff, but I went back and studied what I thought worked and what didn’t. Like I said, Amano, Whelan, and Cawthorn are a given. Robert Gould, Walt Simonson, Brom, and others . . . I went back and looked at what they each brought. There’s no seminal research volume entitled The Art of Michael Moorcock’s Elric or something (although it would be nice if one existed, wouldn’t it?). It’s too bad that there isn’t more Cawthorn Elric imagery in print. What’s cool about him is he was there with Mike in those seminal days when the character was first finding his way. He’s the very first Elric illustrator, and I know Mike still considers his b/w ink illustrations to be amongst the very strongest Elric work ever done.  You’ve also recently done the interlocking art for the reissues of Jeffrey Ford’s Well-Built City trilogy. That art seems very different in tone and execution, in some ways, from the Elric material. How would you describe the difference? (In terms of process, etc.)  Yeah, the two really are extremely different. I’m proud of both, but I’m especially proud that I did both simultaneously. I think true artists thoughout history not only respond to time and context, but aren’t slaves to a single method or approach. So these two projects gave me a chance to measure myself a bit. The Elric interiors are all straight traditional pencil on Crescent illustration board. No more, no less. On the other hand, the Well-Built City trilogy is a big shadowbox assemblage of oil paintings on masonite surrounded by found objects and ephemera, all housed in a custom-built box. I was working on the Well-Built City for the better part of a year, but it was a long deadline for that one, so I was able to interweave it between Elric and all of my other cover work.   When did you start creating art?  Yikes . . . loaded question. Some might say I’ve barely begun to start creating “art!” As far as when I started doing professional freelance illustration work full-time . . . spring 2001. I had been freelancing professionally part-time doing book covers and editorial work since ’95 when I did the BEHOLD THE MAN book. I was holding down a day job working in residential architecture from the time I got out of college (late ’92), all the way until spring 2001. So the cover work soaked up most of my non-architectural waking hours, during those years. It hasn’t been the most conventional route toward becoming an artist, but I guess I’m a late bloomer.  You have a whole book devoted to your art—just a beautiful, wonderful exhibition, really. As a kid, as a teenager, in college—did you ever visualize that moment? Did you think, “Some day I’m going to have a book of my art?” And what else did you think about beyond the art itself as you were developing your craft?  As a kid, I always believed I would eventually write and illustrate comics for a living. All the way into my 20’s, I figured that’s where I’d eventually be, even when I was paying my dues in the architecture world. Of course, the way it worked out, the early self-published comics I did caught the attention of book publishers (namely Mojo Press) and I ended up where I am now—completely in love with book cover illustration for sf, fantasy and horror. So I guess the answer is “no” . . . I don’t think I dreamed all along of having my own art book. Cheesy as it sounds though, what I did always hope for was that my art would make a difference . . . that it would make an impact. Back when I was a kid, I dreamed of hanging out with great writers and artists I idolized, and doing work that could be worthy of an audience.  The truth is, when I’m about to start a new picture, I always get the same crazy feeling . . . that anything’s possible and the new thing I’m about to do has a chance to be the best thing I’ve ever done. It’s like falling in love. Of course, the picture inevitably falls short, and then here comes the next picture, and that crazy feeling comes back again, and so on, and so on. So yeah, I think I’ve got plenty of megalomania to spare, but it always comes down to the joy of that drawing in front of me.  What gives you the most pleasure about the whole process of creating art?  Surprising myself . . . sometimes it might be a reaction to an accident . . . sometimes it might be a solution to problems that I didn’t anticipate. Most of the time, it’s things that may be barely apparent to anyone but me. It could be a series of textures or brush strokes that come together in a way that’s better than I imagined . . . maybe it’s a compositional brainstorm that arrives in the nick of time . . . it’s definitely the surprises.   You’re exceedingly generous to other artists and I know you’re more than willing to help out new artists. Who have you seen in the last couple of years that you believe we’ll be hearing a lot more from in the next decade?  I think more and more Westerners are realizing how much phenomenal non-American talent is out there. It’s not just all about the Americans and the Brits any more, if it ever was to begin with. Shaun Tan has been a monster for years in his home country of Australia, but he’s finally broken out huge here in America with his book The Arrival. At any rate, it’s hard to call him a secret when he’s already won two World Fantasy Awards, but he’s always terrific. Aleksi Briclot is doing amazing mixed-media work over in Paris. I like a couple of Raul Cruz’s latest spacescape oils a lot; he’s based in Mexico City. Other artists that’ve really struck me lately: Nic Klein (Germany); Xiao Chen Fu (China); Joao Ruas (Brazil); Skan Srisuwan (Thailand); and Maurizio Manzieri (Italy), amongst others. We’re seeing more and more international talent getting American exposure. That’s a good thing.  What else are you currently working on?  I’m juggling a few hot ones right now—a couple of wraparound book covers—one’s for Lou Anders’ Fast Forward 2; the other is for Robert Silverberg’s Son of Man (both for Pyr); a couple of STAR TREK covers for Simon & Schuster/Pocket. Around all that, I’m diving into the aforementioned cover and interiors for the sixth and final ELRIC edition from Del Rey. So I get the honor of bookending that series, and that’s a big deal. It’ll be great to see the work of my fellow ELRIC artists in the series—Michael Kaluta (Book 2 and Book 5); Steve Ellis (Book 3); and Justin Sweet (Book 4). 2008 should be an interesting year. Whatever happens though, as long as I’m working, I’m happy.   (A small portion of this interview first appeared on Amazon’s Omnivoracious blog.)  Jeff VanderMeer is an award-winning writer with books published in over 20 countries. He has collaborated on short films with rock groups like The Church, has had his fiction adapted for promotional purposes by Playstation Europe (by filmmaker Joel Veitch), and writes for the Amazon book blog, io9, New York Times Book Review and The Washington Post, among others.  Jeff's novel Finch and writing book, Booklife, are forthcoming this fall.", "text": "Interview\nAn Interview with John Picacio\nJohn Picacio is one of the respected artists in the field, having won the World Fantasy Award and the Chesley, among others, along with being a four-time Hugo nominee. Picacio is also one of the nicest people in the field, so perhaps it’s no surprise that one of his most recent projects has been creating the cover and interior illustrations for the first of an iconic set of books by the nicest person in the field, Michael Moorcock. Ballantine/Del Rey is launching the new Elric trade paperback series this month with ELRIC: THE STEALER OF SOULS . I talked to Picacio about his work for Moorcock, upcoming covers for Jeffrey Ford, and a variety of other subjects . . .\nThe Elric novels are not the first time you’ve animated Moorcock’s work with your art. Do you ever bounce ideas off of him? How well do you know him?\nThe first book I ever illustrated was by Mike—the 30th Anniversary edition of Behold the Man. I did the cover, interior illustrations, and full book design for that one. I’ve done a few covers for his books since then. This new Elric book really feels like things coming full-circle though because not only am I working with Mike again, but this time, it’s for one of the most iconic fantasy characters ever. Quick story from back when I did that Behold the Man gig . . . Rick Klaw and Ben Ostrander (editor & publisher of Mojo Press) drove me to Mike’s house to discuss the project. I had done all my reading and had all kinds of questions, and I was thinking Mike would set the course and tell me what he wanted the project to look like. I mean, he’s Michael Moorcock, one of the giants of the field, and I’m a guy who’s never done a book cover before, so I figured he’d just say, “Here’s what you’re gonna do.” Instead, he basically said, “Hey, it’s in your hands. You’ve got talent. I trust you to make it great.” Looking back, that may have been the most important moment of my career. Mike’s faith gave me huge confidence and really, I’ve never looked back since. That attitude of being proactive rather than waiting to be told what to draw and paint . . . to think for myself and be an active participant in the publishing process . . . that attitude was really sparked by Mike and his trust back when I did that first gig. Last year, when I did the new Elric stuff, I had a pretty firm battleplan for what I wanted to do, and when I met with Mike to break it down with him, he just kept smiling and giving me the nod. A kind word here, a kind word there, but he again gave me virtually free reign. When I had questions, he was always quick to clarify, but never told me what to do. He’s not only one of the great authors in the history of fantasy, but he’s one of the great gentlemen. I’ve said it before, and it still holds true—I’d take a bullet for the man.\nWhen dealing with classic material like this, do you ever worry about trying to match the vision in the heads of the many, many readers who have a specific idea of, for example, what Elric must look like?\nEarly on, a good friend pulled me aside and said, “No matter what you do on Elric, you know a lot of people are gonna hate it, right?” Oddly enough, that statement really took the pressure off me. I felt like, “hey, I might as well do my thing because there’s no way to please everyone, so let’s just go for it.” Like I said before, Mike expects out of an illustrator what any creator should expect of themselves – he expects you to bring the absolute most potent and personal vision you can offer to the audience at that given moment. He doesn’t expect my way to look like Yoshitaka Amano or Michael Whelan or James Cawthorn or anyone else. And hell, I’d be disappointed in myself, if my stuff turned out that way. There’s a history of greats that preceded me, and if I’m not adding any fresh insight or vision to the lineage, then what’s the use, really? So I expect myself to bring something fresh and new to the icon. However, along with that, it’s possible that some fans who see the character a certain way may not embrace my way immediately. That’s totally cool; that’s part of the biz.\nDid you do any research into prior Elric covers? If so, did you discover anything Clarkesworld readers might find of interest?\nYeah, I was already aware of a lot of the great Elric stuff, but I went back and studied what I thought worked and what didn’t. Like I said, Amano, Whelan, and Cawthorn are a given. Robert Gould, Walt Simonson, Brom, and others . . . I went back and looked at what they each brought. There’s no seminal research volume entitled The Art of Michael Moorcock’s Elric or something (although it would be nice if one existed, wouldn’t it?). It’s too bad that there isn’t more Cawthorn Elric imagery in print. What’s cool about him is he was there with Mike in those seminal days when the character was first finding his way. He’s the very first Elric illustrator, and I know Mike still considers his b/w ink illustrations to be amongst the very strongest Elric work ever done.\nYou’ve also recently done the interlocking art for the reissues of Jeffrey Ford’s Well-Built City trilogy. That art seems very different in tone and execution, in some ways, from the Elric material. How would you describe the difference? (In terms of process, etc.)\nYeah, the two really are extremely different. I’m proud of both, but I’m especially proud that I did both simultaneously. I think true artists thoughout history not only respond to time and context, but aren’t slaves to a single method or approach. So these two projects gave me a chance to measure myself a bit. The Elric interiors are all straight traditional pencil on Crescent illustration board. No more, no less. On the other hand, the Well-Built City trilogy is a big shadowbox assemblage of oil paintings on masonite surrounded by found objects and ephemera, all housed in a custom-built box. I was working on the Well-Built City for the better part of a year, but it was a long deadline for that one, so I was able to interweave it between Elric and all of my other cover work.\nWhen did you start creating art?\nYikes . . . loaded question. Some might say I’ve barely begun to start creating “art!” As far as when I started doing professional freelance illustration work full-time . . . spring 2001. I had been freelancing professionally part-time doing book covers and editorial work since ’95 when I did the BEHOLD THE MAN book. I was holding down a day job working in residential architecture from the time I got out of college (late ’92), all the way until spring 2001. So the cover work soaked up most of my non-architectural waking hours, during those years. It hasn’t been the most conventional route toward becoming an artist, but I guess I’m a late bloomer.\nYou have a whole book devoted to your art—just a beautiful, wonderful exhibition, really. As a kid, as a teenager, in college—did you ever visualize that moment? Did you think, “Some day I’m going to have a book of my art?” And what else did you think about beyond the art itself as you were developing your craft?\nAs a kid, I always believed I would eventually write and illustrate comics for a living. All the way into my 20’s, I figured that’s where I’d eventually be, even when I was paying my dues in the architecture world. Of course, the way it worked out, the early self-published comics I did caught the attention of book publishers (namely Mojo Press) and I ended up where I am now—completely in love with book cover illustration for sf, fantasy and horror. So I guess the answer is “no” . . . I don’t think I dreamed all along of having my own art book. Cheesy as it sounds though, what I did always hope for was that my art would make a difference . . . that it would make an impact. Back when I was a kid, I dreamed of hanging out with great writers and artists I idolized, and doing work that could be worthy of an audience.\nThe truth is, when I’m about to start a new picture, I always get the same crazy feeling . . . that anything’s possible and the new thing I’m about to do has a chance to be the best thing I’ve ever done. It’s like falling in love. Of course, the picture inevitably falls short, and then here comes the next picture, and that crazy feeling comes back again, and so on, and so on. So yeah, I think I’ve got plenty of megalomania to spare, but it always comes down to the joy of that drawing in front of me.\nWhat gives you the most pleasure about the whole process of creating art?\nSurprising myself . . . sometimes it might be a reaction to an accident . . . sometimes it might be a solution to problems that I didn’t anticipate. Most of the time, it’s things that may be barely apparent to anyone but me. It could be a series of textures or brush strokes that come together in a way that’s better than I imagined . . . maybe it’s a compositional brainstorm that arrives in the nick of time . . . it’s definitely the surprises.\nYou’re exceedingly generous to other artists and I know you’re more than willing to help out new artists. Who have you seen in the last couple of years that you believe we’ll be hearing a lot more from in the next decade?\nI think more and more Westerners are realizing how much phenomenal non-American talent is out there. It’s not just all about the Americans and the Brits any more, if it ever was to begin with. Shaun Tan has been a monster for years in his home country of Australia, but he’s finally broken out huge here in America with his book The Arrival. At any rate, it’s hard to call him a secret when he’s already won two World Fantasy Awards, but he’s always terrific. Aleksi Briclot is doing amazing mixed-media work over in Paris. I like a couple of Raul Cruz’s latest spacescape oils a lot; he’s based in Mexico City. Other artists that’ve really struck me lately: Nic Klein (Germany); Xiao Chen Fu (China); Joao Ruas (Brazil); Skan Srisuwan (Thailand); and Maurizio Manzieri (Italy), amongst others. We’re seeing more and more international talent getting American exposure. That’s a good thing.\nWhat else are you currently working on?\nI’m juggling a few hot ones right now—a couple of wraparound book covers—one’s for Lou Anders’ Fast Forward 2; the other is for Robert Silverberg’s Son of Man (both for Pyr); a couple of STAR TREK covers for Simon & Schuster/Pocket. Around all that, I’m diving into the aforementioned cover and interiors for the sixth and final ELRIC edition from Del Rey. So I get the honor of bookending that series, and that’s a big deal. It’ll be great to see the work of my fellow ELRIC artists in the series—Michael Kaluta (Book 2 and Book 5); Steve Ellis (Book 3); and Justin Sweet (Book 4). 2008 should be an interesting year. Whatever happens though, as long as I’m working, I’m happy.\n(A small portion of this interview first appeared on Amazon’s Omnivoracious blog.)\nJeff VanderMeer is an award-winning writer with books published in over 20 countries. He has collaborated on short films with rock groups like The Church, has had his fiction adapted for promotional purposes by Playstation Europe (by filmmaker Joel Veitch), and writes for the Amazon book blog, io9, New York Times Book Review and The Washington Post, among others.\nJeff's novel Finch and writing book, Booklife, are forthcoming this fall.", "source": "https://clarkesworldmagazine.com/picacio_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Interview with John Picacio"}