{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Matthew Kressel", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "x2tFH+j2OFi7J0FMH1G54ZAPYpg=", "id": null, "license": null, "comments": "", "raw_text": "6430 words, short story  The Garden Beyond Her Infinite Skies  Aya floated over endless effervescing worlds, seeking anomalies. There were a hundred thousand Farmers of the Branch, but Aya was of the best of them all. Her fields were the healthiest, her realms the most pure. Even the Supervisors said she had an uncanny ability to spot the malignant, when others saw but purity. How she longed to find those sickly realms sprouting in her fields, where the oddest things arose, things not found anywhere else on the Branch. Finding one was enough to make her long workdays worthwhile.  She flew low over her fields. Beneath her, a trillion realms sprouted from the ground, spheres budding spheres. Like fattened wheat, the realms leaned tall in the graviton breeze, their thick fingers grasping for the Expanse, while beneath their knuckled bases, tilled to perfection, lay fertile ground. Alone, Aya expressed herself naturally: a ball of prickling white energy, she scintillated. She searched all day, but did not find one anomaly among countless identical realms.  Perhaps, she thought, I have destroyed them all.  Repentance Day was nine days away, when all the Farmer Folk would gather to play games of history. Who could remember all the First Ones? Who could reap the neatest row? They’d join to sing the ancient songs, to shout the chorus to the Tall Ones. “Oh, the endless rows! Oh, such majestic beauty!” And Aya played the games and sang the histories, but only because to refuse meant being shamed by those whom she loved.  If only, she thought, I could write my own lyrics, what stories I would tell them.  She sighed a cloud of tau neutrinos and watched them tumble into the Expanse. Pulled by the graviton wind, they were lost in the blue haze. What would it be like, she wondered, to float off with the particles, to visit those strange, far off places? But her courage fled with them, as it always did. She couldn’t survive in the Expanse, where the winds blew fierce and terrible. She belonged here, on the branchlet. And she would die here. And that made her saddest of all.  She floated above the realm tips, where the ground appeared flat as she hugged it close. But when she soared high, the branchlet’s curve became visible. Far upstalk, the horizon bent into itself and formed a tube. And this tube kinked and split into more tubes farther upstalk. And these split even farther up, until the myriad branchlets vanished in the Expanse’s blue haze.  And downstalk, her branchlet joined a greater, which joined one greater, which joined one yet greater, and so on, until endless fathoms below all branchlets merged with the Prime Stalk of Thept, blessed be her endless reaching.  Aya flew as high as she dared in the graviton winds, wishing she could see Thept in her gargantuan glory, but the haze obscured all but the nearest branchlet.  Then she dove between rows of baby realms, where myriad spheres still glowed from their inflationary epochs. Their pastel globes lit the way for her spiraling journey upstalk.  The Eighty Eight Lights had just begun their climb up the Prime Stalk, swathing ghostly green swatches across the sky, so that when Aya reached fields of more ancient realms, the landscape plunged into twilight. But even among these brooding shadows, spudded realms winked spectral diamonds from the countless galaxies whirling within them all.  Tiny treasures, she thought, are hidden inside all things.  Treasures like Old Gia, who lived in a deep hollow that had been carved into the branchlet. Gia was once a Farmer like Aya, but after long eons, she had grown tired. And as a reward for her service, the Supervisors had given her this home. Old Gia liked to watch the shadows unfold across the Expanse as the Eighty Eight Lights made their daily climb. She hated to be disturbed.  Aya shrunk herself into a respectful torus, taming her wildest energies, as she entered Gia’s hollow.  “Go away!” Gia shouted. A colorful and reactive mess of anti-quarks pooled on the ground before her. “I said, go away!” Fits of radiation spluttered from Gia’s body, a pallid and diffuse ball of energy.  “But it’s me!” Weak blue light from the opening crawled and died a short way in, so that the rear of the hollow was as black as a dead realm.  “Aya? So it is. I don’t sense well anymore, child.”  “No, you don’t. I’m no longer a child.”  “When you reach my age, Aya, everyone becomes a child.” She spat out a thin spray of down quarks that drifted to the floor, sparking as they joined the viscous pool. “What brings you here?”  “I was hoping you’d tell me another story of the First Ones.”  “Ah, the young farmer grows lonely again.”  “I’m not lonely,” Aya said. But she wasn’t sure if that was true. Out the opening, bleak shadows reached across the Expanse, vaguely menacing. The silence seemed to choke the space, but she couldn’t think of anything meaningful to say that had not already been said, as if she was searching for a language she didn’t yet speak.  Gia grumbled and retreated into her hollow, revealing a faintly glowing structure that had been hidden behind her. Packed tightly together in a polyhedral pattern was a collection of lights, each a dim pink sphere, like a cold baby realm. Each held a memory. “Your journal has grown,” Aya said.  “My memories,” Gia said, “have become like a sky full of dying suns, slowly winking out. This is my bulwark against annihilation.”  “May I view one?”  “Never. They are too personal. But I’ll describe one to you.”  Aya shivered off a muon cloud of excitement as Gia plucked a sphere from her journal and absorbed it into her energy-body. The sphere flickered inside her. “I was so young then, barely weaned off ultraviolet milk! I’d forgotten this day. How could I forget? Mama was so colorful, so free.”  “Describe her!” Aya said, unraveling her wildest energies.  “She was very different from today’s Rearing Mothers. You’d think her energy-body was untamed, her spectra feral. But that’s how we expressed ourselves then, expansive, radiant, wild. Mama took my sisters and me upstalk, all the way to a tip.”  “Tell me what it was like!”  Gia paused, shivering as if reliving the memory. “Such a sight! I was terrified, but the tendrils mesmerized me. I was surprised because the tendrils didn’t bravely reach for the Expanse as I had thought, but cowered from it, as if the Expanse was . . . cold.”  “Cold?”  “These baby tendrils were cowards, Aya.”  Perhaps Old Gia was misremembering. The tendrils held the vanguard against the blue Abyss. Or so the songs went.  Gia continued, “Their fear was unhealthy. Mama told us the branchlet had to be excised before its disease spread. We had come to sever her from Thept. Mama showed us how to focus our energy-bodies into Z-beams. And we helped her to . . . ” Gia paused, and shivered. “We cut the diseased branchlet free.”  Unexpectedly, she vomited the sphere out. It plopped to the floor in a pool of wild particles.  “Gia? Are you all right?”  Gia dimmed. “I’ve had enough for today, Aya.”  “But what did the tendrils look like? How many were there? What did the—”  The X-rays smacked Aya hard. It was just a flash, all Old Gia could muster, but the blow hurt regardless.  “Sentimental child!” Gia snarled. “Why are you here, dreaming when you should be out farming? Get back to work, you wretched tangle of radiation! Get out!” Gia retreated into her hollow, small and dim, barely recognizable as a living creature among the sea of particle noise.  Aya’s body stung where Gia had struck her, but she took the blow without reaction, as all good Farmers were taught to do. The pink sphere lay beneath her, an ancient world that might never be seen again, if Gia had her way. Such a shame to let it wink out like a dying star.  Gia was already dozing, spluttering fitful rays, when Aya snatched the globe and darted out the opening. She sped across her fields and flew until she was sure she wasn’t followed. Then she set down between a parade of realms that leaned heavily into the Expanse. Shadows tumbled over the ground as she absorbed Gia’s memory sphere into her body.  She felt Gia. She became Gia.  Her energy-body danced with excitement at being so far from home. And what love for Mama who sprayed off vivid nebulae as she spun up the branch! Its circumference was so thin that she and her sisters could loop around the branchlet in an instant. The ground sparkled a brilliant blue with the glittering particle dew that dusted the surface. No realms had yet formed here. The branchlet was only just born itself.  Gia dared not take her gaze from the ground, because the hideous blue Expanse surrounded her. She wanted to hide inside Mama’s energy-body. All the children did. They begged Mama to return home. But Mama called them cowards and smacked them with harsh rays.  “Look!” Mama said. “Look how the tendrils cower from the Expanse, just as you cower now. Your fear is weakness! You must cut it from yourself!” The children whimpered, and she beat them again until they fell silent.  I’m a coward, Gia thought. I cannot look!  Mama showed them how to form beams of Z-particles with their energy-bodies, then started the cut. She ordered the children to join her. It took effort, enormous concentration, but soon a furious beam erupted from Gia. All her bottled up rage and terror and sadness leaped out from her. She and the children cut, and the Expanse flickered with the reflected light.  The beams screeched and wailed. But Gia realized the screams came from the branchlet itself. The tendrils cried as the Z-beams moved through them. The sound sickened her, but she didn’t stop until the children had severed it through.  Loose from its mother, the baby branch tumbled into the Expanse, tugged by the graviton breeze. It gave such a wail, and giant Thept quivered beneath her as the tendrils reached back for their mother. But it was too late. The branchlet disappeared into the haze of the endless blue sky.  The memory ended. Sickened by the memory, Aya spat out the pink sphere. In a torrent of particles she tossed it far into the Expanse, wishing the feelings would vanish with it.  For a long time she remained in the field. That horrid screeching . . . Those desperate tendrils, reaching for their mother . . .  If only she’d never experienced Gia’s memory. If only she could take it back and forget. But she knew she never would.  Thept, bless her endless reaching, had millions of sisters across the Expanse. The Tall Ones grew out beyond the blue horizon, and countless baby realms were born from their myriad branchlets. And far below, their massive root systems plunged into the great ovum called Yi. Just as the realms arose from Thept’s body, so the Tall Ones grew from Yi.  Yi herself was one of sixty four ova gestating inside Delicate Womb, the reproductive organ of Mother Lily, who gloriously blossomed inside the 501-dimensional field, Sky of Skies, who accelerated madly inside the meditating Z-space, Incomprehensible Mind, who lived inside another being who had a billion names and even more descriptions, none of which sufficed to circumscribe it. Always, the smaller grew in the larger, on and on eternally, blessed be the All.  The All was eternally full of noise.  Messages trickled down from above like the particle rains. Most were gibberish to the Farmer Folk. But once in a long while, a message became clear. Some ineffable being had told Incomprehensible Mind, who had told Sky of Skies, who had told Mother Lily, who had told Delicate Womb, who had told Yi, who had told Thept, who had told the Supervisors, who had told the Farmers, to farm and tend the branchlets where countless realms bubbled up from the surface, to keep them free of disease and entanglement so that Thept’s growth might continue forever. That message came eight trillion Great Cycles ago, a great long time, even here.  And so the First Ones had razed and tilled Thept’s branches, and through generations they’d uprooted corruption, eradicated disease. They had forced the knotted realms into endless neat rows. It had taken eons and countless prunings, but they’d tamed Thept’s wildest tendencies. Now, all was arrayed harmony.  But Aya found no beauty in the monotony. In her youth, Rearing Mother had taken her and her sisters to the Tangle, a knot of branchlets downstalk. The First Ones had left it in place to show what would happen if branchlets were left wild.  Iridescent worms wriggled between massively overbudded realms. Spiky balls of baryonic matter clung to the realm tips, popping to release flashing rainbows of particle spores. Anti-matter spiders of a thousand legs pricked realms with their sharp proboscii and grew fat with sucking. The realms formed hoary palaces, gnarled labyrinths and raveled jungles so thick that even airy neutrinos could only travel but a short way in before hitting something dense and impenetrable. And over all this rolled furious particle storms, bathing the fangled corners with strange, brooding energies.  The Tangle was meant to evoke disgust. It was bizarre, Aya thought, but far from disgusting. For ages she longed to enter those twisted realms and dance its grotesque curves, to explore its vulgar corners and play with those exultant infestations of life. Instead, she was taught to revile it.  She had never told Rearing Mother her true feelings. To express them was to invite a beating, or a furlough inside a dead realm, a place frightfully silent, dark, and cold. And she had never told her sisters either, because they betrayed her to gain Rearing Mother’s favor. Instead she found it safer to keep silent. And over time that silence had built up pressure, like a realm ready to burst into existence. It was her greatest fear that she could not contain it once it was born.  But Gia’s memory gave energy to that silence, threatening to give it form. Aya dreamed often of that severed branch. While flying over her fields she thought she heard echoes of its ancient screams coming from out in the deep.  She was floating low over her twilit, ancient realms one morning when she found an anomaly. She gasped a bubble of charmed quarks. Here, growing among dark arrays, a dim realm curved back on itself, a hooked finger cowering from the Expanse. Or perhaps it turned inward to consider its own curious arising. But this was anathema. To grow inward, a sin. This disease had to be obliterated. A tight beam of Z-particles would do it, would reduce this gloriously wrong realm to a scintillating snow of ash, fertilizer for unborn worlds.  Instead, she peered inside.  Hundreds of billions of galaxies aligned themselves in fine, shining filaments like hoar frost across the hooked realm of 10-space. A tenuous galactic cluster huddled on a filament edge. And inside this cluster, a galaxy furiously twirled. And in this galaxy, a giant red sun hurtled through the dark. And around this sun raced a green planet. And on this planet a purple and white quadruped leaped through a dense forest.  More softly than a falling leaf, the animal tiptoed down to a narrow stream. Its head was long and sleek, its gray horns branching like a miniscule Thept. A breeze trickled through the trees as the quadruped sipped its fill, then gazed up at the orange sky to wonder at the coming dawn.  But this wonder died before long. The creature was not quite self-aware. Full consciousness might take eons, if it ever happened at all. Even among the infinite realms, sentience was a fickle thing. How rare that the quadruped even wondered at all. Given enough time, she thought, what might this species become? If she let it be, she might live long enough to find out.  “A farmer’s job is never done.”  The voice startled her, and she turned to see the Supervisor expressing himself brightly beside her. She collapsed her energies into a shivering torus of high-energy leptons out of respect. “Supervisor,” she said, “I didn’t know—”  “A trillion realms bubble into the Expanse by their own chaotic wills.” He spoke as if addressing an audience. “Without farmers, realms grow weedy and knotted. Disease spreads. Then we must raze and destroy to continue our long mission. Thept, bless her endless reaching, despises nothing more than a pruning. Tell me, Aya, what is it about this sickly realm that captures your attention?”  The Supervisor’s name was Bu, but he made Aya always use his title. He peered deep into the hooked realm, far deeper than she ever could, as she shivered off a hadron cloud. What he saw, she couldn’t say, but she knew it wasn’t beauty.  “Well?” he said.  “I marvel at the manifold arising animals, Supervisor. They exult in the physical.” And because she couldn’t stop herself, she added, “I love how this quadruped moves so quietly through the woods.” It was a foolish thing to say, she knew, but there was no one else here to listen.  “Aya,” he said, “you’ve always been an excellent Farmer. So I’ve tolerated your eccentricities. But what is another quadruped?” He sloughed off a sheath of indifferent neutrons. “I’ve seen quadrupeds arise on this branchlet nine quintillion times. This realm is crooked, inward-looking. A grotesquery. It must be destroyed.”  “Do they suffer,” she said, “when we destroy them?”  “The disease must be removed before it spreads.”  The graviton wind was unusually calm, and she thought she heard a scream out in the Expanse. “But do they suffer?”  The Supervisor’s energy body roiled, sparking with angry bursts of anti-matter. “All this time and still a damned child,” he spat as he raised up a storm of gamma rays, pelting her energy-body. She withered in pain. But she took the blows as Rearing Mother had taught her, and her mother before that, going all the way back to the First Ones. One’s worst tendencies had to be beaten out, she knew.  He let up his blows an instant before she would have diffused into random sparks of radiation.  “I love you,” he said, his energies still fierce. “That’s why this hurts me more than it hurts you. But this is for your own good. We must excise your worst habits, so that what remains is pure. I know you understand.”  She muttered, “Yes, Supervisor.”  Soon he was caressing her with a gentle stream of infrared photons. She let him soothe her pain, because she needed the relief, though she hated herself for it. “Now,” he said, “finish your work, so I may finish mine.”  Aya collected her energies and crept toward the realm. A tight beam of Z-particles was all it took. It leaped from her, melting the realm like a comet in a supernova. Matter decayed by the yotta-particle, flashing brightly before fading. And just like that, the realm was gone.  Bits of scintillating energy snowed to the ground. It would take eons for all the sparks to reach the surface. Which one, she wondered, had been the quadruped? Would that spark ever rise to wonder again?  “It’s amazing,” the Supervisor said, “how precise you are. A skill like yours comes once in a generation. Why is it so hard for you to use your gift?” He puffed himself into a hundred billion 50-spaces, so that he expanded enormously above her. “Now be a good Farmer, Aya,” he said, then corkscrewed up the branchlet, past a trillion realms, off to mind other Farmers in other fields until he vanished in the haze.  The sparks from the snuffed world fell. Where the first sparks touched the ground, new realms were born. They flashed, inflated, and slowed, their quark-gluon plasma too hot for solid matter. It would take an eon before galaxies formed. Two or three more before animal life arose. The Farmer folk sang ballads about the sparks of dead realms. The dust, forever alive, the lyrics went. Death, an illusion, just forms changing.  But that quadruped, that particular arrangement of mind and will, would never know wonder again. If that wasn’t death, what was?  The Eighty Eight Lights were ascending quickly. She had to get back to work, but there was someone she needed to see.  Aya flew downstalk, over row after row of middle-aged realms that leaned steeply into the graviton breeze, each realm the same as the next.  “Aya!” Ri called. Her sister farmed the fields downstalk, singing an ancient song. “It’s been ages!” Ri said, brightly expressing herself as a tiny white ball.  Aya allowed herself to expand into a large sphere, not as wild as she preferred, so her sister would not get offended.  “What brings you downstalk, Aya? Have you a problem?”  “I wanted to ask you about something.”  “Uh-oh,” said Ri, chuckling a blue-green shower of leptons that spiraled off into the Expanse. “Your curiosity always gets you into trouble.”  “I went to see Old Gia recently.”  “I don’t understand why you visit that old bag of particles.”  “I saw one of her memories, Ri.”  Ri flickered for a moment. “What do you mean, saw?”  Aya told Ri about Gia’s journal, and the memory of the severed branch.  “That’s disturbing, Aya.”  “I know,” Aya said. “Now I hear screams coming from the Expanse, and I haven’t been sleeping.”  “No,” Ri said. “It’s disturbing that you stole. Rearing Mother would give you quite a beating if she hears of this.”  “One beating from Supervisor Bu is enough for today.”  “He disciplined you, again? I thought you were his favorite.” Ri dimmed an order of magnitude. “What’s gotten into you?”  “Do you ever look into realms, before you destroy them?”  “Sometimes.”  “And what do you see?”  “Disease, mostly.”  “Never beauty?”  Ri paused. “There’s never beauty in sickness.”  “But what if a sick realm held something, however miniscule, worth saving? Would you spare it?”  Ri floated higher. “I see what’s happened here. Gia’s memory has poisoned you. That baby branchlet cried when they cut it free, yes, but didn’t we cry when Rearing Mother beat us? It hurt then, but look at what Farmers we’ve become! Those beatings were for our own good, rooting out our worst habits. In the same way, eradicating disease is healthy for Thept. Pain is necessary for growth. If I’m ever chosen to be a Rearing Mother, I’ll root out the unruliness from my children the same way. And it will hurt me more than it will hurt them. Don’t you see? It’s all for the collective good.”  “I suppose,” Aya said, feeling sick.  “Sister, you look exhausted. Your energies are wild. Why don’t you go and take a nap over there? I’ll watch for the Supervisor and wake you if he comes. I’ll even tell him how I saw you eradicate a young cancer.”  Never mind that there would be no cinders to mark the grave, Aya was exhausted. “Thank you, Ri. You’re a good sister.”  “And you a troublesome one! But I love you, Aya. Now sleep, so you may forget this foolishness.”  Aya floated back to her fields and nuzzled between a dozen middle-aged realms. They caressed her sides as she drifted off to sleep. In her dreams a million blue tendrils squeezed her until she exploded in a flash that didn’t wink out, but slowly faded, like a cinder. When she awoke, the Eighty Eight Lights had already passed Half Stalk.  Ri was nowhere to be found.  Repentance Day came and went, and Aya sang the songs and played the games, but her heart was not in it. The Eighty Eight Lights climbed the Prime Stalk of Thept two thousand times. Most days she lay in her fields and dreamed of the Tangle. But sometimes she exposed herself to the harsh particle rains when she should have waited them out in a safe hollow.  She was drifting low over her fields, and the Eighty Eight Lights had just begun their morning climb when she saw it. It grew from the side of a tall, ancient realm. An irregular carbuncle not one-hundredth the size of the parent it clung to, a cancer that needed to be excised.  The cancer had given birth to billions of galaxies. They spread across its 10-space like the vanes of a feather. In one spiral galaxy, a yellow sun drifted near the galactic edge. Orbiting this sun was a blue-white world. And on this world a copper-skinned biped sat on the ground and drew a figure in the dirt with a stick: a quadruped, with branching horns.  The biped examined her drawing. It wasn’t alive, she knew, but an echo. Yet as she stared at the figure, she saw the blood on Father’s face and felt the men’s hard, beastly gazes. She smelled the hot animal flesh as Mother and the other women opened the animal with their bone knives. Even the twirling smoke stung her eyes as it rose from the flames to appease Sky God and her Thousand Bright Children. Her heart thrummed and her stomach grumbled, as if this were happening now. But the hunt was yesterday, and somehow every vivid sense folded itself into her figure in the dirt. The drawing, the biped realized, was magic.  A larger female walked over, Mother. She saw the drawing, shrieked, and immediately stamped it out. Mother too had sensed the drawing’s power to evoke memory. She struck the child in the face. And the child held in her cries, because Mother hated tears even more than magic drawings.  A third biped walked over, Father. Mother swung again at the child, but Father grabbed her before she could strike. His look was fierce, animal-like. His words were elaborated grunts, their language not yet mature.  He said, “No more. No more!”  Father threw her hand down and walked away, back to sharpen his spear with the other males. But with his back turned, Mother hit the child again. And the magic vision of the hunt and all its vivid senses receded further from the child’s mind with each blow. In pain, the child vowed that if she were ever blessed by Sky God to birth a child, she would never hit him.  Aya removed her gaze from the cancerous realm and gazed over her fields as if seeing them for the first time. Like the bipedal child, her pain didn’t have to continue. She didn’t have to destroy worlds. She didn’t have to take the blows. How curious that it took an infinitesimal creature to show this to her.  Ever so carefully, with a fine Z-beam, she severed the cancer from its parent. It floated free, still alive. Without an energy-source, it would eventually die. But she knew a place to hide it, where it could grow and even thrive.  When she reached Gia’s hollow, the opening was brightly lit. A harsh yellow glow pooled on the ground outside it. Aya hid the cancer in the adjacent field before she entered.  Gia’s particle soup had been swept clean, and four Supervisors circled the rear, as if searching for something. Supervisor Bu was among them. Gia and her journal were nowhere to be found.  “What’s happened?” Aya said. The Supervisors stopped whatever they had been doing.  “Why, hello!” Supervisor Bu said as he came over. “Just the farmer I wanted to see.”  “Where’s Gia?”  “Gone, I’m afraid.”  “To where?”  “To dust,” he said. “She decayed just this morning.” He caressed her. “I’m sorry, Aya. Were you close?”  Aya wanted to scream or fly as high as she dared go, higher even. She felt like exploding or turning to dust. But she just said, “We were friends, I think.”  “So, I’ve heard. When did you last visit?”  “I haven’t seen her for thousands of days.”  “And what did you two speak about, typically?”  “Many things.”  “Such as?”  “Where’s her journal, Supervisor?”  “Her journal?”  “Her memories?”  “Ah, yes. Aya, when one starts to decay, like Old Gia, the mind decays too. This journal of hers was plagued with disease. It had to be destroyed.” Inside his body, a tiny pink sphere, just like the one from Gia’s journal, flashed and winked out.  The hollow seemed to spin, faster and faster, and Aya retreated toward the exit. “I have to get back to work.”  “That’s my good Farmer,” he said, petting her. “Always working hard. I’ll need to ask you more questions, later, once we sort this mess. I’ll see you in your fields.”  Outside and alone, the infinite Expanse pressed down upon her. All Gia’s memories, gone forever. Was it possible?  She returned to the hidden cancer. Like Gia’s memory, she absorbed the realm into her body, where it remained whole and alive. It could feed off her for a while, suckling radiation from her, until its growth killed both of them. But this would suffice for now. The realm shivered, tickling her as she spiraled upstalk.  The biped’s voice echoed in her mind “No more. No more.”  She soared high, until the branchlet was barely visible in the haze, then she dove to skate the realm tops, spraying their energies across the field. Supervisor Bu would discipline her for that, but not if he couldn’t find her.  She flew beyond the edge of her fields, and entered Nessa’s. Her other sister dawdled above a row of ancient realms and called out as Aya hurtled past, but Aya didn’t slow. She flew past Jia, and Thi, and Den, and Hio, and Sil, and a dozen more of her siblings’ fields. The Eighty Eight Lights were nearing Half Stalk when she reached the fork. The branchlet split, each half vanishing into the haze. This was the farthest she’d ever gone. She was forbidden from going any further.  She chose left and went up.  She flew past more farms. Some Folk called out to her. Most ignored her. In some fields, there were no Farmers at all. And yet the endless budding realms looked no different from hers.  Up she flew.  The Expanse grew dark. How had the Eighty Eight Lights descended so quickly? The sky faded to black. Somewhere out in the dark, seven yellow lights blinked, then vanished, while the realms beneath her twinkled with countless galaxies and stars. Their light was pale and ghostly, and the darkness overwhelmed her. She stopped.  She crawled between two bulbous realms and tried to sleep, while the cancer tickled her insides. Sometime later, she awoke. A Farmer hovered above her, shouting. Behind her glimmered the blue-gray of the morning sky. She sped away.  Exhausted, she flew on. On the second night, the graviton wind blew so fiercely she had to cling to the realms so she wouldn’t fly into the Expanse. The torrential particle rain dissolved her energies as she hid the cancer deep inside herself. It shivered with her. But the storm passed, and the next morning she flew on.  She reached a fork on the sixth day and went right. On the ninth day, she turned left. Directions didn’t matter, so long as she went up. With a chill she realized that if she turned back now, she wouldn’t know which way was home.  The branchlets thinned ever more, so that she could loop around them quickly, while the Expanse grew massive around her. At Full Stalk the Eighty Eight Lights weren’t so high anymore. And at night, if the winds were calm, she saw indistinct shapes shimmering out in the Expanse. Tall Ones, winking?  She reached the next fork, but it wasn’t a fork at all. A gnarled lump, weathered by wind and rain, was all that remained of its right side. Eons ago this branch had been severed from Thept. Aya wondered if this was the same one Gia and her sisters had cut.  She went left and passed more severed limbs, and the Expanse yawned ever larger around her. Her fear grew as she ascended, and the little cancer inside her grew weaker by the day so that she knew it was alive only by its tiny shivering.  The farms abruptly ended. Beyond lay pale, barren, withered ground. No realms bubbled from the surface. And just a short journey onward she finally reached the tip, the last finger of Thept. In Gia’s memory, glittering dew dusted the surface, and the tendrils were timid but exuberantly alive.  This branchlet was dead.  Its surface was ashen and black, and where the tendrils should have been holding the vanguard against the Abyss, were seven gnarled stumps. The gulf unfolded its massive blue nothingness around her, and the branchlet shuddered in the graviton wind. A strong gust and she might blow away forever.  She retreated to the last fork, a half-day’s journey, and took the opposite branch. But this led to another dead branch, ashen and black. She was exhausted, and the light was fading, but the winds were too strong to sleep here. Out in the Expanse, vague forms shimmered.  “Aya, my beloved! There you are!” His voice came as if arising from a dream.  She shivered off a muon cloud as Supervisor Bu, five Supervisors, and her sister Ri, floated up to her.  “Aya!” Supervisor Bu said, exasperated. “We’ve been following your energy trail for days.”  “Aya,” Ri said, “I was so worried for you!”  “The tips,” Aya said. “They’re all dead.”  “Pruned,” Bu said, “Eons ago. Aya, come here.” He gently caressed her, but she withdrew from him.  “How can you caress me one moment and pummel me the next? That’s not right.”  “What is this? Come here, before you decay.”  Aya paused as the truth of it all became clear. It had been the same with Old Gia, she thought. The Supervisor pretended compassion even as he beat and razed. “Gia didn’t decay naturally,” Aya said. “Did she?”  The graviton wind gusted once, hard, and everyone struggled to hang on.  “Old Gia was spreading disease,” he said. “And disease must be eradicated.”  She had once loved Supervisor Bu, but now she saw he was a monster. “She had so many untold stories.”  “She was full of madness,” Ri said. “I found a globe of hers in my field. She must have been spreading poison all over the place. I saw what her memory had done to you, Aya, so I told Supervisor Bu before she might hurt someone else.”  “She wasn’t spreading those memories,” Aya said, “I threw her memory globe away. It must have landed in your field.”  “Either way,” he said, “she had become a cancer.”  Aya felt sick. It was her fault. If she hadn’t taken that memory, Old Gia would still be alive.  “Aya,” he said, approaching her. “We love you. You’re sick. You need help.”  “Like you helped Gia?”  “Aya, you’re the best Farmer in a generation. Come home, and let’s forget all this nonsense.”  The cancerous realm inside her had been softly shivering, when it shuddered once, violently.  “What’s that inside you?” he said. He peered deep within her. “Is that a realm? A cancer?” His tone shifted abruptly. “Why is that disease inside you, Aya?”  “I saved it,” she said, “because it’s precious.”  “I didn’t want to do this,” he said. “But you leave me no choice.” His body roiled as he prepared a storm of rays.  Part of her longed to return home, to soar over her fields and feel free again. She longed to watch the Eighty Eight Lights descend with her sister by her side. She missed Rearing Mother and her other siblings. But going back meant forgetting everything that had happened.  She stepped back from him and said, “No more. No more.” Then she leaped into the Expanse.  “Aya!”  She plunged into the blue void, and the graviton wind quickly grabbed her. The branchlet vanished in the haze, and their screams were soon lost in the wind.  Terror consumed her as she hurtled into the endless blue. She tried to direct her flight, but the currents were too strong. Harsh winds attacked her, tearing at her energy-body, while the realm inside her quivered like a nervous atom. Neither of them would last long.  She tumbled helplessly. Soon she would diffuse into dust. But after a time the blue sky turned black, the winds abated, and she found she could direct her flight. She flew free from the worst gusts, gaining hope.  Shapes resolved in the darkness, as if beyond a cloud of dissipating smoke. Buried within tufts of blue cloud, swarms of shimmering lights climbed up and down massive stalks. A forest of Tall Ones spread beneath a night sky, millions of gargantuan trees glowing from their own ethereal light. And below, moving shadows rolled over the rough and ruddy surface of Yi, the great ovum. Sinuous purple arteries weaved through the Tall Ones like tubular rivers, flickering with universes of light inside them.  But every Tall One, all the countless millions, were stunted, their limbs severed, just as Thept had been. Thept, bless her endless reaching, didn’t reach at all. Like all her severed sisters, she was torn to shreds. Aya flew above the stunted forest.  The Farmers had done this, she knew. They had, with their sick philosophy, murdered them all.  She sloughed off sprays of hadrons as she floated high, while the little realm shivered inside her, eating her insides. It would suckle off her until they both were dust.  As she flew on, hints of ruddy light shone in the distance, beyond Yi’s curving horizon. She glimpsed it first in silhouette, as the sky lightened behind it. Immensely far off, an ineffable distance away, a single Tall One grew higher than the rest, its arms extended skyward, its branches uncut.  A survivor.  Perhaps there someone too had said, “No more.” But this Tall One was an immense distance away. She might die long before she reached it. She could return to Thept or another Tall One and start again.  But no, that wouldn’t do. There was a garden out there. No matter how far it was, she had to reach it. She gathered the last of her energies in preparation for the journey.  I will make it, she thought. I will survive. And the next generation will know no pain.  And deep inside her, as if sensing her thoughts, the little realm with the bipedal girl suddenly stopped shivering.  Matthew Kressel is a writer & software developer. He is a three-time Nebula Award finalist and Eugie Award Finalist, and his work has been published in Clarkesworld, Analog, Lightspeed, Nightmare, Beneath Ceaseless Skies, The Year's Best Science Fiction and Fantasy - 2018 Edition, and The Best Science Fiction of the Year - Volume 3, as well as many other magazines and anthologies. He is the creator of the Moksha submissions system, in use by many of the largest speculative-fiction publishers. And he is the co-host of the Fantastic Fiction at KGB reading series in Manhattan alongside Ellen Datlow.", "text": "6430 words, short story\nThe Garden Beyond Her Infinite Skies\nAya floated over endless effervescing worlds, seeking anomalies. There were a hundred thousand Farmers of the Branch, but Aya was of the best of them all. Her fields were the healthiest, her realms the most pure. Even the Supervisors said she had an uncanny ability to spot the malignant, when others saw but purity. How she longed to find those sickly realms sprouting in her fields, where the oddest things arose, things not found anywhere else on the Branch. Finding one was enough to make her long workdays worthwhile.\nShe flew low over her fields. Beneath her, a trillion realms sprouted from the ground, spheres budding spheres. Like fattened wheat, the realms leaned tall in the graviton breeze, their thick fingers grasping for the Expanse, while beneath their knuckled bases, tilled to perfection, lay fertile ground. Alone, Aya expressed herself naturally: a ball of prickling white energy, she scintillated. She searched all day, but did not find one anomaly among countless identical realms.\nPerhaps, she thought, I have destroyed them all.\nRepentance Day was nine days away, when all the Farmer Folk would gather to play games of history. Who could remember all the First Ones? Who could reap the neatest row? They’d join to sing the ancient songs, to shout the chorus to the Tall Ones. “Oh, the endless rows! Oh, such majestic beauty!” And Aya played the games and sang the histories, but only because to refuse meant being shamed by those whom she loved.\nIf only, she thought, I could write my own lyrics, what stories I would tell them.\nShe sighed a cloud of tau neutrinos and watched them tumble into the Expanse. Pulled by the graviton wind, they were lost in the blue haze. What would it be like, she wondered, to float off with the particles, to visit those strange, far off places? But her courage fled with them, as it always did. She couldn’t survive in the Expanse, where the winds blew fierce and terrible. She belonged here, on the branchlet. And she would die here. And that made her saddest of all.\nShe floated above the realm tips, where the ground appeared flat as she hugged it close. But when she soared high, the branchlet’s curve became visible. Far upstalk, the horizon bent into itself and formed a tube. And this tube kinked and split into more tubes farther upstalk. And these split even farther up, until the myriad branchlets vanished in the Expanse’s blue haze.\nAnd downstalk, her branchlet joined a greater, which joined one greater, which joined one yet greater, and so on, until endless fathoms below all branchlets merged with the Prime Stalk of Thept, blessed be her endless reaching.\nAya flew as high as she dared in the graviton winds, wishing she could see Thept in her gargantuan glory, but the haze obscured all but the nearest branchlet.\nThen she dove between rows of baby realms, where myriad spheres still glowed from their inflationary epochs. Their pastel globes lit the way for her spiraling journey upstalk.\nThe Eighty Eight Lights had just begun their climb up the Prime Stalk, swathing ghostly green swatches across the sky, so that when Aya reached fields of more ancient realms, the landscape plunged into twilight. But even among these brooding shadows, spudded realms winked spectral diamonds from the countless galaxies whirling within them all.\nTiny treasures, she thought, are hidden inside all things.\nTreasures like Old Gia, who lived in a deep hollow that had been carved into the branchlet. Gia was once a Farmer like Aya, but after long eons, she had grown tired. And as a reward for her service, the Supervisors had given her this home. Old Gia liked to watch the shadows unfold across the Expanse as the Eighty Eight Lights made their daily climb. She hated to be disturbed.\nAya shrunk herself into a respectful torus, taming her wildest energies, as she entered Gia’s hollow.\n“Go away!” Gia shouted. A colorful and reactive mess of anti-quarks pooled on the ground before her. “I said, go away!” Fits of radiation spluttered from Gia’s body, a pallid and diffuse ball of energy.\n“But it’s me!” Weak blue light from the opening crawled and died a short way in, so that the rear of the hollow was as black as a dead realm.\n“Aya? So it is. I don’t sense well anymore, child.”\n“No, you don’t. I’m no longer a child.”\n“When you reach my age, Aya, everyone becomes a child.” She spat out a thin spray of down quarks that drifted to the floor, sparking as they joined the viscous pool. “What brings you here?”\n“I was hoping you’d tell me another story of the First Ones.”\n“Ah, the young farmer grows lonely again.”\n“I’m not lonely,” Aya said. But she wasn’t sure if that was true. Out the opening, bleak shadows reached across the Expanse, vaguely menacing. The silence seemed to choke the space, but she couldn’t think of anything meaningful to say that had not already been said, as if she was searching for a language she didn’t yet speak.\nGia grumbled and retreated into her hollow, revealing a faintly glowing structure that had been hidden behind her. Packed tightly together in a polyhedral pattern was a collection of lights, each a dim pink sphere, like a cold baby realm. Each held a memory. “Your journal has grown,” Aya said.\n“My memories,” Gia said, “have become like a sky full of dying suns, slowly winking out. This is my bulwark against annihilation.”\n“May I view one?”\n“Never. They are too personal. But I’ll describe one to you.”\nAya shivered off a muon cloud of excitement as Gia plucked a sphere from her journal and absorbed it into her energy-body. The sphere flickered inside her. “I was so young then, barely weaned off ultraviolet milk! I’d forgotten this day. How could I forget? Mama was so colorful, so free.”\n“Describe her!” Aya said, unraveling her wildest energies.\n“She was very different from today’s Rearing Mothers. You’d think her energy-body was untamed, her spectra feral. But that’s how we expressed ourselves then, expansive, radiant, wild. Mama took my sisters and me upstalk, all the way to a tip.”\n“Tell me what it was like!”\nGia paused, shivering as if reliving the memory. “Such a sight! I was terrified, but the tendrils mesmerized me. I was surprised because the tendrils didn’t bravely reach for the Expanse as I had thought, but cowered from it, as if the Expanse was . . . cold.”\n“Cold?”\n“These baby tendrils were cowards, Aya.”\nPerhaps Old Gia was misremembering. The tendrils held the vanguard against the blue Abyss. Or so the songs went.\nGia continued, “Their fear was unhealthy. Mama told us the branchlet had to be excised before its disease spread. We had come to sever her from Thept. Mama showed us how to focus our energy-bodies into Z-beams. And we helped her to . . . ” Gia paused, and shivered. “We cut the diseased branchlet free.”\nUnexpectedly, she vomited the sphere out. It plopped to the floor in a pool of wild particles.\n“Gia? Are you all right?”\nGia dimmed. “I’ve had enough for today, Aya.”\n“But what did the tendrils look like? How many were there? What did the—”\nThe X-rays smacked Aya hard. It was just a flash, all Old Gia could muster, but the blow hurt regardless.\n“Sentimental child!” Gia snarled. “Why are you here, dreaming when you should be out farming? Get back to work, you wretched tangle of radiation! Get out!” Gia retreated into her hollow, small and dim, barely recognizable as a living creature among the sea of particle noise.\nAya’s body stung where Gia had struck her, but she took the blow without reaction, as all good Farmers were taught to do. The pink sphere lay beneath her, an ancient world that might never be seen again, if Gia had her way. Such a shame to let it wink out like a dying star.\nGia was already dozing, spluttering fitful rays, when Aya snatched the globe and darted out the opening. She sped across her fields and flew until she was sure she wasn’t followed. Then she set down between a parade of realms that leaned heavily into the Expanse. Shadows tumbled over the ground as she absorbed Gia’s memory sphere into her body.\nShe felt Gia. She became Gia.\nHer energy-body danced with excitement at being so far from home. And what love for Mama who sprayed off vivid nebulae as she spun up the branch! Its circumference was so thin that she and her sisters could loop around the branchlet in an instant. The ground sparkled a brilliant blue with the glittering particle dew that dusted the surface. No realms had yet formed here. The branchlet was only just born itself.\nGia dared not take her gaze from the ground, because the hideous blue Expanse surrounded her. She wanted to hide inside Mama’s energy-body. All the children did. They begged Mama to return home. But Mama called them cowards and smacked them with harsh rays.\n“Look!” Mama said. “Look how the tendrils cower from the Expanse, just as you cower now. Your fear is weakness! You must cut it from yourself!” The children whimpered, and she beat them again until they fell silent.\nI’m a coward, Gia thought. I cannot look!\nMama showed them how to form beams of Z-particles with their energy-bodies, then started the cut. She ordered the children to join her. It took effort, enormous concentration, but soon a furious beam erupted from Gia. All her bottled up rage and terror and sadness leaped out from her. She and the children cut, and the Expanse flickered with the reflected light.\nThe beams screeched and wailed. But Gia realized the screams came from the branchlet itself. The tendrils cried as the Z-beams moved through them. The sound sickened her, but she didn’t stop until the children had severed it through.\nLoose from its mother, the baby branch tumbled into the Expanse, tugged by the graviton breeze. It gave such a wail, and giant Thept quivered beneath her as the tendrils reached back for their mother. But it was too late. The branchlet disappeared into the haze of the endless blue sky.\nThe memory ended. Sickened by the memory, Aya spat out the pink sphere. In a torrent of particles she tossed it far into the Expanse, wishing the feelings would vanish with it.\nFor a long time she remained in the field. That horrid screeching . . . Those desperate tendrils, reaching for their mother . . .\nIf only she’d never experienced Gia’s memory. If only she could take it back and forget. But she knew she never would.\nThept, bless her endless reaching, had millions of sisters across the Expanse. The Tall Ones grew out beyond the blue horizon, and countless baby realms were born from their myriad branchlets. And far below, their massive root systems plunged into the great ovum called Yi. Just as the realms arose from Thept’s body, so the Tall Ones grew from Yi.\nYi herself was one of sixty four ova gestating inside Delicate Womb, the reproductive organ of Mother Lily, who gloriously blossomed inside the 501-dimensional field, Sky of Skies, who accelerated madly inside the meditating Z-space, Incomprehensible Mind, who lived inside another being who had a billion names and even more descriptions, none of which sufficed to circumscribe it. Always, the smaller grew in the larger, on and on eternally, blessed be the All.\nThe All was eternally full of noise.\nMessages trickled down from above like the particle rains. Most were gibberish to the Farmer Folk. But once in a long while, a message became clear. Some ineffable being had told Incomprehensible Mind, who had told Sky of Skies, who had told Mother Lily, who had told Delicate Womb, who had told Yi, who had told Thept, who had told the Supervisors, who had told the Farmers, to farm and tend the branchlets where countless realms bubbled up from the surface, to keep them free of disease and entanglement so that Thept’s growth might continue forever. That message came eight trillion Great Cycles ago, a great long time, even here.\nAnd so the First Ones had razed and tilled Thept’s branches, and through generations they’d uprooted corruption, eradicated disease. They had forced the knotted realms into endless neat rows. It had taken eons and countless prunings, but they’d tamed Thept’s wildest tendencies. Now, all was arrayed harmony.\nBut Aya found no beauty in the monotony. In her youth, Rearing Mother had taken her and her sisters to the Tangle, a knot of branchlets downstalk. The First Ones had left it in place to show what would happen if branchlets were left wild.\nIridescent worms wriggled between massively overbudded realms. Spiky balls of baryonic matter clung to the realm tips, popping to release flashing rainbows of particle spores. Anti-matter spiders of a thousand legs pricked realms with their sharp proboscii and grew fat with sucking. The realms formed hoary palaces, gnarled labyrinths and raveled jungles so thick that even airy neutrinos could only travel but a short way in before hitting something dense and impenetrable. And over all this rolled furious particle storms, bathing the fangled corners with strange, brooding energies.\nThe Tangle was meant to evoke disgust. It was bizarre, Aya thought, but far from disgusting. For ages she longed to enter those twisted realms and dance its grotesque curves, to explore its vulgar corners and play with those exultant infestations of life. Instead, she was taught to revile it.\nShe had never told Rearing Mother her true feelings. To express them was to invite a beating, or a furlough inside a dead realm, a place frightfully silent, dark, and cold. And she had never told her sisters either, because they betrayed her to gain Rearing Mother’s favor. Instead she found it safer to keep silent. And over time that silence had built up pressure, like a realm ready to burst into existence. It was her greatest fear that she could not contain it once it was born.\nBut Gia’s memory gave energy to that silence, threatening to give it form. Aya dreamed often of that severed branch. While flying over her fields she thought she heard echoes of its ancient screams coming from out in the deep.\nShe was floating low over her twilit, ancient realms one morning when she found an anomaly. She gasped a bubble of charmed quarks. Here, growing among dark arrays, a dim realm curved back on itself, a hooked finger cowering from the Expanse. Or perhaps it turned inward to consider its own curious arising. But this was anathema. To grow inward, a sin. This disease had to be obliterated. A tight beam of Z-particles would do it, would reduce this gloriously wrong realm to a scintillating snow of ash, fertilizer for unborn worlds.\nInstead, she peered inside.\nHundreds of billions of galaxies aligned themselves in fine, shining filaments like hoar frost across the hooked realm of 10-space. A tenuous galactic cluster huddled on a filament edge. And inside this cluster, a galaxy furiously twirled. And in this galaxy, a giant red sun hurtled through the dark. And around this sun raced a green planet. And on this planet a purple and white quadruped leaped through a dense forest.\nMore softly than a falling leaf, the animal tiptoed down to a narrow stream. Its head was long and sleek, its gray horns branching like a miniscule Thept. A breeze trickled through the trees as the quadruped sipped its fill, then gazed up at the orange sky to wonder at the coming dawn.\nBut this wonder died before long. The creature was not quite self-aware. Full consciousness might take eons, if it ever happened at all. Even among the infinite realms, sentience was a fickle thing. How rare that the quadruped even wondered at all. Given enough time, she thought, what might this species become? If she let it be, she might live long enough to find out.\n“A farmer’s job is never done.”\nThe voice startled her, and she turned to see the Supervisor expressing himself brightly beside her. She collapsed her energies into a shivering torus of high-energy leptons out of respect. “Supervisor,” she said, “I didn’t know—”\n“A trillion realms bubble into the Expanse by their own chaotic wills.” He spoke as if addressing an audience. “Without farmers, realms grow weedy and knotted. Disease spreads. Then we must raze and destroy to continue our long mission. Thept, bless her endless reaching, despises nothing more than a pruning. Tell me, Aya, what is it about this sickly realm that captures your attention?”\nThe Supervisor’s name was Bu, but he made Aya always use his title. He peered deep into the hooked realm, far deeper than she ever could, as she shivered off a hadron cloud. What he saw, she couldn’t say, but she knew it wasn’t beauty.\n“Well?” he said.\n“I marvel at the manifold arising animals, Supervisor. They exult in the physical.” And because she couldn’t stop herself, she added, “I love how this quadruped moves so quietly through the woods.” It was a foolish thing to say, she knew, but there was no one else here to listen.\n“Aya,” he said, “you’ve always been an excellent Farmer. So I’ve tolerated your eccentricities. But what is another quadruped?” He sloughed off a sheath of indifferent neutrons. “I’ve seen quadrupeds arise on this branchlet nine quintillion times. This realm is crooked, inward-looking. A grotesquery. It must be destroyed.”\n“Do they suffer,” she said, “when we destroy them?”\n“The disease must be removed before it spreads.”\nThe graviton wind was unusually calm, and she thought she heard a scream out in the Expanse. “But do they suffer?”\nThe Supervisor’s energy body roiled, sparking with angry bursts of anti-matter. “All this time and still a damned child,” he spat as he raised up a storm of gamma rays, pelting her energy-body. She withered in pain. But she took the blows as Rearing Mother had taught her, and her mother before that, going all the way back to the First Ones. One’s worst tendencies had to be beaten out, she knew.\nHe let up his blows an instant before she would have diffused into random sparks of radiation.\n“I love you,” he said, his energies still fierce. “That’s why this hurts me more than it hurts you. But this is for your own good. We must excise your worst habits, so that what remains is pure. I know you understand.”\nShe muttered, “Yes, Supervisor.”\nSoon he was caressing her with a gentle stream of infrared photons. She let him soothe her pain, because she needed the relief, though she hated herself for it. “Now,” he said, “finish your work, so I may finish mine.”\nAya collected her energies and crept toward the realm. A tight beam of Z-particles was all it took. It leaped from her, melting the realm like a comet in a supernova. Matter decayed by the yotta-particle, flashing brightly before fading. And just like that, the realm was gone.\nBits of scintillating energy snowed to the ground. It would take eons for all the sparks to reach the surface. Which one, she wondered, had been the quadruped? Would that spark ever rise to wonder again?\n“It’s amazing,” the Supervisor said, “how precise you are. A skill like yours comes once in a generation. Why is it so hard for you to use your gift?” He puffed himself into a hundred billion 50-spaces, so that he expanded enormously above her. “Now be a good Farmer, Aya,” he said, then corkscrewed up the branchlet, past a trillion realms, off to mind other Farmers in other fields until he vanished in the haze.\nThe sparks from the snuffed world fell. Where the first sparks touched the ground, new realms were born. They flashed, inflated, and slowed, their quark-gluon plasma too hot for solid matter. It would take an eon before galaxies formed. Two or three more before animal life arose. The Farmer folk sang ballads about the sparks of dead realms. The dust, forever alive, the lyrics went. Death, an illusion, just forms changing.\nBut that quadruped, that particular arrangement of mind and will, would never know wonder again. If that wasn’t death, what was?\nThe Eighty Eight Lights were ascending quickly. She had to get back to work, but there was someone she needed to see.\nAya flew downstalk, over row after row of middle-aged realms that leaned steeply into the graviton breeze, each realm the same as the next.\n“Aya!” Ri called. Her sister farmed the fields downstalk, singing an ancient song. “It’s been ages!” Ri said, brightly expressing herself as a tiny white ball.\nAya allowed herself to expand into a large sphere, not as wild as she preferred, so her sister would not get offended.\n“What brings you downstalk, Aya? Have you a problem?”\n“I wanted to ask you about something.”\n“Uh-oh,” said Ri, chuckling a blue-green shower of leptons that spiraled off into the Expanse. “Your curiosity always gets you into trouble.”\n“I went to see Old Gia recently.”\n“I don’t understand why you visit that old bag of particles.”\n“I saw one of her memories, Ri.”\nRi flickered for a moment. “What do you mean, saw?”\nAya told Ri about Gia’s journal, and the memory of the severed branch.\n“That’s disturbing, Aya.”\n“I know,” Aya said. “Now I hear screams coming from the Expanse, and I haven’t been sleeping.”\n“No,” Ri said. “It’s disturbing that you stole. Rearing Mother would give you quite a beating if she hears of this.”\n“One beating from Supervisor Bu is enough for today.”\n“He disciplined you, again? I thought you were his favorite.” Ri dimmed an order of magnitude. “What’s gotten into you?”\n“Do you ever look into realms, before you destroy them?”\n“Sometimes.”\n“And what do you see?”\n“Disease, mostly.”\n“Never beauty?”\nRi paused. “There’s never beauty in sickness.”\n“But what if a sick realm held something, however miniscule, worth saving? Would you spare it?”\nRi floated higher. “I see what’s happened here. Gia’s memory has poisoned you. That baby branchlet cried when they cut it free, yes, but didn’t we cry when Rearing Mother beat us? It hurt then, but look at what Farmers we’ve become! Those beatings were for our own good, rooting out our worst habits. In the same way, eradicating disease is healthy for Thept. Pain is necessary for growth. If I’m ever chosen to be a Rearing Mother, I’ll root out the unruliness from my children the same way. And it will hurt me more than it will hurt them. Don’t you see? It’s all for the collective good.”\n“I suppose,” Aya said, feeling sick.\n“Sister, you look exhausted. Your energies are wild. Why don’t you go and take a nap over there? I’ll watch for the Supervisor and wake you if he comes. I’ll even tell him how I saw you eradicate a young cancer.”\nNever mind that there would be no cinders to mark the grave, Aya was exhausted. “Thank you, Ri. You’re a good sister.”\n“And you a troublesome one! But I love you, Aya. Now sleep, so you may forget this foolishness.”\nAya floated back to her fields and nuzzled between a dozen middle-aged realms. They caressed her sides as she drifted off to sleep. In her dreams a million blue tendrils squeezed her until she exploded in a flash that didn’t wink out, but slowly faded, like a cinder. When she awoke, the Eighty Eight Lights had already passed Half Stalk.\nRi was nowhere to be found.\nRepentance Day came and went, and Aya sang the songs and played the games, but her heart was not in it. The Eighty Eight Lights climbed the Prime Stalk of Thept two thousand times. Most days she lay in her fields and dreamed of the Tangle. But sometimes she exposed herself to the harsh particle rains when she should have waited them out in a safe hollow.\nShe was drifting low over her fields, and the Eighty Eight Lights had just begun their morning climb when she saw it. It grew from the side of a tall, ancient realm. An irregular carbuncle not one-hundredth the size of the parent it clung to, a cancer that needed to be excised.\nThe cancer had given birth to billions of galaxies. They spread across its 10-space like the vanes of a feather. In one spiral galaxy, a yellow sun drifted near the galactic edge. Orbiting this sun was a blue-white world. And on this world a copper-skinned biped sat on the ground and drew a figure in the dirt with a stick: a quadruped, with branching horns.\nThe biped examined her drawing. It wasn’t alive, she knew, but an echo. Yet as she stared at the figure, she saw the blood on Father’s face and felt the men’s hard, beastly gazes. She smelled the hot animal flesh as Mother and the other women opened the animal with their bone knives. Even the twirling smoke stung her eyes as it rose from the flames to appease Sky God and her Thousand Bright Children. Her heart thrummed and her stomach grumbled, as if this were happening now. But the hunt was yesterday, and somehow every vivid sense folded itself into her figure in the dirt. The drawing, the biped realized, was magic.\nA larger female walked over, Mother. She saw the drawing, shrieked, and immediately stamped it out. Mother too had sensed the drawing’s power to evoke memory. She struck the child in the face. And the child held in her cries, because Mother hated tears even more than magic drawings.\nA third biped walked over, Father. Mother swung again at the child, but Father grabbed her before she could strike. His look was fierce, animal-like. His words were elaborated grunts, their language not yet mature.\nHe said, “No more. No more!”\nFather threw her hand down and walked away, back to sharpen his spear with the other males. But with his back turned, Mother hit the child again. And the magic vision of the hunt and all its vivid senses receded further from the child’s mind with each blow. In pain, the child vowed that if she were ever blessed by Sky God to birth a child, she would never hit him.\nAya removed her gaze from the cancerous realm and gazed over her fields as if seeing them for the first time. Like the bipedal child, her pain didn’t have to continue. She didn’t have to destroy worlds. She didn’t have to take the blows. How curious that it took an infinitesimal creature to show this to her.\nEver so carefully, with a fine Z-beam, she severed the cancer from its parent. It floated free, still alive. Without an energy-source, it would eventually die. But she knew a place to hide it, where it could grow and even thrive.\nWhen she reached Gia’s hollow, the opening was brightly lit. A harsh yellow glow pooled on the ground outside it. Aya hid the cancer in the adjacent field before she entered.\nGia’s particle soup had been swept clean, and four Supervisors circled the rear, as if searching for something. Supervisor Bu was among them. Gia and her journal were nowhere to be found.\n“What’s happened?” Aya said. The Supervisors stopped whatever they had been doing.\n“Why, hello!” Supervisor Bu said as he came over. “Just the farmer I wanted to see.”\n“Where’s Gia?”\n“Gone, I’m afraid.”\n“To where?”\n“To dust,” he said. “She decayed just this morning.” He caressed her. “I’m sorry, Aya. Were you close?”\nAya wanted to scream or fly as high as she dared go, higher even. She felt like exploding or turning to dust. But she just said, “We were friends, I think.”\n“So, I’ve heard. When did you last visit?”\n“I haven’t seen her for thousands of days.”\n“And what did you two speak about, typically?”\n“Many things.”\n“Such as?”\n“Where’s her journal, Supervisor?”\n“Her journal?”\n“Her memories?”\n“Ah, yes. Aya, when one starts to decay, like Old Gia, the mind decays too. This journal of hers was plagued with disease. It had to be destroyed.” Inside his body, a tiny pink sphere, just like the one from Gia’s journal, flashed and winked out.\nThe hollow seemed to spin, faster and faster, and Aya retreated toward the exit. “I have to get back to work.”\n“That’s my good Farmer,” he said, petting her. “Always working hard. I’ll need to ask you more questions, later, once we sort this mess. I’ll see you in your fields.”\nOutside and alone, the infinite Expanse pressed down upon her. All Gia’s memories, gone forever. Was it possible?\nShe returned to the hidden cancer. Like Gia’s memory, she absorbed the realm into her body, where it remained whole and alive. It could feed off her for a while, suckling radiation from her, until its growth killed both of them. But this would suffice for now. The realm shivered, tickling her as she spiraled upstalk.\nThe biped’s voice echoed in her mind “No more. No more.”\nShe soared high, until the branchlet was barely visible in the haze, then she dove to skate the realm tops, spraying their energies across the field. Supervisor Bu would discipline her for that, but not if he couldn’t find her.\nShe flew beyond the edge of her fields, and entered Nessa’s. Her other sister dawdled above a row of ancient realms and called out as Aya hurtled past, but Aya didn’t slow. She flew past Jia, and Thi, and Den, and Hio, and Sil, and a dozen more of her siblings’ fields. The Eighty Eight Lights were nearing Half Stalk when she reached the fork. The branchlet split, each half vanishing into the haze. This was the farthest she’d ever gone. She was forbidden from going any further.\nShe chose left and went up.\nShe flew past more farms. Some Folk called out to her. Most ignored her. In some fields, there were no Farmers at all. And yet the endless budding realms looked no different from hers.\nUp she flew.\nThe Expanse grew dark. How had the Eighty Eight Lights descended so quickly? The sky faded to black. Somewhere out in the dark, seven yellow lights blinked, then vanished, while the realms beneath her twinkled with countless galaxies and stars. Their light was pale and ghostly, and the darkness overwhelmed her. She stopped.\nShe crawled between two bulbous realms and tried to sleep, while the cancer tickled her insides. Sometime later, she awoke. A Farmer hovered above her, shouting. Behind her glimmered the blue-gray of the morning sky. She sped away.\nExhausted, she flew on. On the second night, the graviton wind blew so fiercely she had to cling to the realms so she wouldn’t fly into the Expanse. The torrential particle rain dissolved her energies as she hid the cancer deep inside herself. It shivered with her. But the storm passed, and the next morning she flew on.\nShe reached a fork on the sixth day and went right. On the ninth day, she turned left. Directions didn’t matter, so long as she went up. With a chill she realized that if she turned back now, she wouldn’t know which way was home.\nThe branchlets thinned ever more, so that she could loop around them quickly, while the Expanse grew massive around her. At Full Stalk the Eighty Eight Lights weren’t so high anymore. And at night, if the winds were calm, she saw indistinct shapes shimmering out in the Expanse. Tall Ones, winking?\nShe reached the next fork, but it wasn’t a fork at all. A gnarled lump, weathered by wind and rain, was all that remained of its right side. Eons ago this branch had been severed from Thept. Aya wondered if this was the same one Gia and her sisters had cut.\nShe went left and passed more severed limbs, and the Expanse yawned ever larger around her. Her fear grew as she ascended, and the little cancer inside her grew weaker by the day so that she knew it was alive only by its tiny shivering.\nThe farms abruptly ended. Beyond lay pale, barren, withered ground. No realms bubbled from the surface. And just a short journey onward she finally reached the tip, the last finger of Thept. In Gia’s memory, glittering dew dusted the surface, and the tendrils were timid but exuberantly alive.\nThis branchlet was dead.\nIts surface was ashen and black, and where the tendrils should have been holding the vanguard against the Abyss, were seven gnarled stumps. The gulf unfolded its massive blue nothingness around her, and the branchlet shuddered in the graviton wind. A strong gust and she might blow away forever.\nShe retreated to the last fork, a half-day’s journey, and took the opposite branch. But this led to another dead branch, ashen and black. She was exhausted, and the light was fading, but the winds were too strong to sleep here. Out in the Expanse, vague forms shimmered.\n“Aya, my beloved! There you are!” His voice came as if arising from a dream.\nShe shivered off a muon cloud as Supervisor Bu, five Supervisors, and her sister Ri, floated up to her.\n“Aya!” Supervisor Bu said, exasperated. “We’ve been following your energy trail for days.”\n“Aya,” Ri said, “I was so worried for you!”\n“The tips,” Aya said. “They’re all dead.”\n“Pruned,” Bu said, “Eons ago. Aya, come here.” He gently caressed her, but she withdrew from him.\n“How can you caress me one moment and pummel me the next? That’s not right.”\n“What is this? Come here, before you decay.”\nAya paused as the truth of it all became clear. It had been the same with Old Gia, she thought. The Supervisor pretended compassion even as he beat and razed. “Gia didn’t decay naturally,” Aya said. “Did she?”\nThe graviton wind gusted once, hard, and everyone struggled to hang on.\n“Old Gia was spreading disease,” he said. “And disease must be eradicated.”\nShe had once loved Supervisor Bu, but now she saw he was a monster. “She had so many untold stories.”\n“She was full of madness,” Ri said. “I found a globe of hers in my field. She must have been spreading poison all over the place. I saw what her memory had done to you, Aya, so I told Supervisor Bu before she might hurt someone else.”\n“She wasn’t spreading those memories,” Aya said, “I threw her memory globe away. It must have landed in your field.”\n“Either way,” he said, “she had become a cancer.”\nAya felt sick. It was her fault. If she hadn’t taken that memory, Old Gia would still be alive.\n“Aya,” he said, approaching her. “We love you. You’re sick. You need help.”\n“Like you helped Gia?”\n“Aya, you’re the best Farmer in a generation. Come home, and let’s forget all this nonsense.”\nThe cancerous realm inside her had been softly shivering, when it shuddered once, violently.\n“What’s that inside you?” he said. He peered deep within her. “Is that a realm? A cancer?” His tone shifted abruptly. “Why is that disease inside you, Aya?”\n“I saved it,” she said, “because it’s precious.”\n“I didn’t want to do this,” he said. “But you leave me no choice.” His body roiled as he prepared a storm of rays.\nPart of her longed to return home, to soar over her fields and feel free again. She longed to watch the Eighty Eight Lights descend with her sister by her side. She missed Rearing Mother and her other siblings. But going back meant forgetting everything that had happened.\nShe stepped back from him and said, “No more. No more.” Then she leaped into the Expanse.\n“Aya!”\nShe plunged into the blue void, and the graviton wind quickly grabbed her. The branchlet vanished in the haze, and their screams were soon lost in the wind.\nTerror consumed her as she hurtled into the endless blue. She tried to direct her flight, but the currents were too strong. Harsh winds attacked her, tearing at her energy-body, while the realm inside her quivered like a nervous atom. Neither of them would last long.\nShe tumbled helplessly. Soon she would diffuse into dust. But after a time the blue sky turned black, the winds abated, and she found she could direct her flight. She flew free from the worst gusts, gaining hope.\nShapes resolved in the darkness, as if beyond a cloud of dissipating smoke. Buried within tufts of blue cloud, swarms of shimmering lights climbed up and down massive stalks. A forest of Tall Ones spread beneath a night sky, millions of gargantuan trees glowing from their own ethereal light. And below, moving shadows rolled over the rough and ruddy surface of Yi, the great ovum. Sinuous purple arteries weaved through the Tall Ones like tubular rivers, flickering with universes of light inside them.\nBut every Tall One, all the countless millions, were stunted, their limbs severed, just as Thept had been. Thept, bless her endless reaching, didn’t reach at all. Like all her severed sisters, she was torn to shreds. Aya flew above the stunted forest.\nThe Farmers had done this, she knew. They had, with their sick philosophy, murdered them all.\nShe sloughed off sprays of hadrons as she floated high, while the little realm shivered inside her, eating her insides. It would suckle off her until they both were dust.\nAs she flew on, hints of ruddy light shone in the distance, beyond Yi’s curving horizon. She glimpsed it first in silhouette, as the sky lightened behind it. Immensely far off, an ineffable distance away, a single Tall One grew higher than the rest, its arms extended skyward, its branches uncut.\nA survivor.\nPerhaps there someone too had said, “No more.” But this Tall One was an immense distance away. She might die long before she reached it. She could return to Thept or another Tall One and start again.\nBut no, that wouldn’t do. There was a garden out there. No matter how far it was, she had to reach it. She gathered the last of her energies in preparation for the journey.\nI will make it, she thought. I will survive. And the next generation will know no pain.\nAnd deep inside her, as if sensing her thoughts, the little realm with the bipedal girl suddenly stopped shivering.\nMatthew Kressel is a writer & software developer. He is a three-time Nebula Award finalist and Eugie Award Finalist, and his work has been published in Clarkesworld, Analog, Lightspeed, Nightmare, Beneath Ceaseless Skies, The Year's Best Science Fiction and Fantasy - 2018 Edition, and The Best Science Fiction of the Year - Volume 3, as well as many other magazines and anthologies. He is the creator of the Moksha submissions system, in use by many of the largest speculative-fiction publishers. And he is the co-host of the Fantastic Fiction at KGB reading series in Manhattan alongside Ellen Datlow.", "source": "https://clarkesworldmagazine.com/kressel_05_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Garden Beyond Her Infinite Skies by Matthew Kressel"}