{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "1tpUcOXiIJY1tsdpRY/ggkKGibQ=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Something Greater: An Epic Discussion of Epic Fantasy, Part 2  Introduction  \"Epic fantasy is as rich, vibrant, meaningful and wonder-provoking as we choose to make it,\" said Robert V. S. Redick, the author of The Red Wolf Conspiracy, The Ruling Sea, and the recent The River of Shadows. \"But to write it well is an immense undertaking, akin to setting off on a walking tour of a continent. Those who have taken such tours report that their feet, legs and knees are changed forever by the experience.\"  In Part 1 of this round-table discussion of Epic Fantasy, 26 authors, one agent, and an editor discuss the heart of Epic Fantasy, the scope and sweep, and the relationship between setting and characters, among other topics. In part two, we move into darker ground.  As a reminder, this round-table does not attempt to define Epic Fantasy. Instead, it is an ambitious attempt to explore the many aspects of the sub-genre.  \"Epic Fantasy is concerned with the movements of nations, with the map and the attempts to redraw it,\" said Lou Anders, the editorial director of Pyr Books and the co-editor of Swords & Dark Magic. \"Whereas Sword and Sorcery is the intersection of fantasy with the Western's lone gunman, Epic Fantasy is the intersection of myth and global warfare. We hear people grouse all the time about wanting authors to refrain from getting political in their entertainments, but at its heart Epic Fantasy is inherently political. It concerns itself directly with who has the right to rule and why.\"  Filled with violence and death, humor and courage, lives of purpose and recklessness, broad sweep and sometime staggering word counts, novels of Epic Fantasy offer readers simultaneously expansive and very intimate stories-stories that require commitment of the reader and that offer extended opportunities for full immersion in fantastical worlds.  Epic Fantasies also require much of the authors. In Part I, the round-table participants discussed with generous sincerity why they write Epic Fantasy. Here is a particularly personal response from Kate Elliott, the author of such novels as Cold Fire and the forthcoming Cold Steel. As Elliott said:   I was an outdoor, athletic child: I preferred to play physically active imagination games outdoors. But, against that, the cultural norms of the day reminded me constantly that the things I loved to do were appropriate for boys, not for girls. People forget this. So in the beginning, as it were, fantasy novels were a way for me to escape the rigid constraints put on girls. More importantly, I could write my own stories and build my own worlds. If you've not grown up being told you shouldn't be who you are, I'm not sure you can quite understand why world-building and writing epic fantasy is so attractive and in its way a form of chain-breaking. But it was, and it is.  As an adult, I've become fascinated by cultural change, cultures in conflict, and the rise and collapse of complex societies, with a special place in my heart for the life cycle of empire. Epic fantasy allows the scope to really dig into these questions; the form creates an expectation that the reader will venture through layers and enjoy a certain level of complication, so I find it appealing for that reason. I also love tracking multiple characters through a changing landscape. I don't say that to suggest other genres and subgenres can't do exactly the same things, just that those are some reasons I write epic fantasy.  I am not, by the way, a monarchist nor do I yearn for the halcyon days of yore with a secret reactionary bent to my heart. The idea that epic fantasy is by nature a \"conservative\" subgenre is, I think, based not only on an incomplete reading of the texts but also on an understanding of the medieval or early modern eras that comes from outdated historiography. I don't doubt specific works can be reactionary or conservative (depending on how you define those words), but more often than not I suspect—although I can't prove—that if a work defaults to ideas about social order that map to what I call the Victorian Middle Ages or the Hollywood Middle Ages, it has more to do with sloppy world-building in the sense of using unexamined and outmoded assumptions about \"the past\" as a guide. I really think that to characterize the subgenre so generally is to not understand the variety seen within the form and to not understand that the simplistic and popular views of how people \"were\" and \"thought\" in the past are often at best provisional and incomplete and at worst outright wrong.  Historian Judith Bennett calls this the \"Wretched Abyss\" Theory, the idea that the European Middle Ages were a wretched abyss from which we modern women/people have luckily escaped. It's one of the founding myths of modern feminism as well as the modern world. Me, I want to live now, with internet, antibiotics, and that nice intensive care nursery that saved my premature twins. But that doesn't mean we aren't also responsible to depict a more nuanced and accurate representation of \"a past\" as it was lived and experienced as a dynamic and changing span.  To fully understand the ways Epic Fantasy works on us as readers and writers is a delightfully impossible task. In fact, it's a downright epic challenge, but the contributors have a grand time facing that challenge.  The participants are Lou Anders, James Barclay, Elizabeth Bear, Terry Brooks, Trudi Canavan, Rowena Cory Daniells, David Anthony Durham, Kate Elliott, Steven Erikson, Ian C. Esslemont, Lynn Flewelling, Ed Greenwood, Erin Hoffman, John Jarrold, N. K. Jemisin, K. V. Johansen, J. V. Jones, Paul Kearney, Juliet McKenna, Robin McKinley, Peter Orullian, Robert V. S. Redick, Patrick Rothfuss, Brandon Sanderson, Gaie Sebold, Michael A. Stackpole, Victoria Strauss, and Gav Thorpe. (Consult the Dramatis Personae for more information about each author and for links to their web-pages.)  Here in Part 2 of Something Greater: an Epic Discussion of Epic Fantasy, we tackle such topics as deciding when to \"kill off\" a character, keeping a series lively, handling violence, and making the most of humor.  Toward the end, some of the participants offer parting words on topics ranging from the thickness of books to the long and tangled relationship between Epic Fantasy and video games.  At what point is it necessary to kill off a recurring (and perhaps much loved) character?  N. K. Jemisin: When the story requires it.  Juliet McKenna: When the internal consistency and coherence of the story demands it. Giving favored individuals plot-immunity in favor of sacrificing some no-name in a red tunic devalues the death in terms of the story and cheats the reader of the full emotional and dramatic impact. If the death doesn't matter, then it just doesn't count. It also deprives the reader of that uncertainty, of that sense of peril, which draws them into the story and keeps them turning the pages.  J. V. Jones: [Kill a character?] Sooner than you think. If a reader expects a character to survive until the end of a multi-book series, what's the point? There's no peril. Everyone has to be at risk and the risk has to be real. It's hard for a writer to kill off a beloved, carefully-constructed character. Our deep and secret fear is that we won't be able to write another one to match them.  Trudi Canavan: While killing off a character saddens me (unless they are evil, and deserve it!) I don't allow myself to get too sentimental and attached. Ultimately, I'm trying to write a good, gripping story.  Kate Elliott: When they die.  I may be interpreting the question in a way it's not intended, but I don't find it to be \"necessary\" to kill off a character except at the confluence of events and setting where that character ends up dead. Characters have lives and things happen for any number of reasons, and sometimes what happens is that they die. I don't write series in the sense that I have recurring characters from book to book; I write a single novel in multiple volumes and when it's done, it's done. So any given character will either survive to the end, or won't.  Elizabeth Bear: If there comes a point where I don't think the characters can reasonably get off without loss of life, I start looking for victims. And actually, my trick is that when I know I need to kill somebody, I look for the person I like the most, and see if she's necessary to the rest of the narrative. If she is, then I go to my second favorite.  So I'm always killing off people I adore. It's very pathological. But apparently effective—I seem to have a reputation for ruthlessness.  James Barclay: I don't think it is ever necessary or inevitable and there is no hard and fast rule in my opinion. I know I have a reputation for a lack of sentimentality regarding my characters but it's rather unfair and simplistic to use that as a reason why my central characters die on a relatively regular basis. For the record, I find it very hard to kill off much-loved characters. What I believe is this: my characters inhabit extremely dangerous and violent worlds during extremely dangerous and violent times. It simply is not credible (I find I use that word a fair bit when discussing fantasy) for all your central characters to survive largely unscathed the whole time. Combat is so chaotic that pure skill is not always enough. You cannot track every arrow, thrust or spell so luck plays its part. Not only that, part of the nature of heroism involves placing yourself in mortal danger for the greater good. Sometime or other, your skill will not be enough or your luck will run out. Or indeed both.  I've never killed a core character for the shock effect alone. I'm aware there is such an effect but they die because there is no chance of survival, not because the book needs a kick.  NB: Ian Fleming would have found it very hard to respond to this question.  Terry Brooks: I don't have recurring characters in my series. With historical sagas, you move ahead in time on a regular basis—or back in time, as well, in my case, writing about both the future and the past of the Shannara world. Anyway, you might do as many as four books on a character, although more frequently less. So I don't spend a lot of time worrying about that. If I were a mystery writer or a writer with a dozen books all centered on the same characters, I would worry. But I do have an inflexible rule about characters. Everyone is expendable. If it serves the interests of the story or advances the plot in a meaningful way, I will consider killing them off. Also, if they live dangerous lives and are exposed repeatedly to death, it makes sense that now and then death is going to catch up to them. The exception to this approach is the Magic Kingdom series, which is a true series with one story following close on the heels of another. But after five books, I changed focus to the daughter of the main characters so I wouldn't have to kill anyone off—they could just be back home knitting.  Rowena Cory Daniells: You have the answer in your question. There has to be a point. In real life, bad things happen to good people and we struggle to make sense of it. In fiction every action, no matter how seemingly insignificant, drives the plot forward and reveals character. There shouldn't be a wasted word. They say that about short stories, but I believe it about book length fiction too.  David Anthony Durham: To each his/her own on this one. For me, it's necessary to kill off a main character when his/her plot trajectory leads them to it. I want readers to feel that the dangers the characters face are real, and that even people they love can get the ax. It's true to life. I'm all for it being true to fiction, too.  Now, I'll admit that by the third Acacia book, The Sacred Band, two characters that died in the first book are back in the action. But that's because fantasy allows things realistic fiction can't. In neither case do the characters really escape death. These aren't happy resurrections in which life is truly returned to them. I couldn't go that far with it. They just get a reprieve of sorts that allows them—and the people that love them—to work through some of the things left unresolved by their deaths. If only we had that possibility in real life...  Steven Erikson: It's all down to story, and what the death serves in that story. Well, it probably should be. Better that than the author getting tired of the poor fool and saying, \"Fuck it, you're now dead.\" Or stalling on that character's development ... if, say, their world-views (which you once dearly loved and maybe even held to yourself) starts proving to be ugly, egregious, pathetic—if the story you're telling has forced you to reconsider your own assumptions, and you decide that rather than going for your own throat, it's better to run away, and by killing that character you run away from everything he/she represents, including your self-doubt.  Every death needs to mean something—it's the one conceit authors possess: the one real fantasy in this whole mess. So it needs to be handled respectfully. When it isn't: well, we all succumb to cowardice every now and then; and if not cowardice, then laziness. If those excuses don't fit well, there's always senseless stupidity, which afflicts authors on occasion as much as it does anyone.  The risk with killing off main characters is, if you do it too often and too capriciously, you risk your audience deciding it's not worth emotionally engaging with any of your characters, and then you're screwed.  Gaie Sebold: That's a tricky one. I'm only at the beginning of writing a series! However, I have had to kill off a character I really liked, and I know this won't be the last time. It's necessary when the story says it is, if that doesn't sound too pretentious. Writers, like their heroes, have to make hard choices; and sometimes, in order to say what you need to say, in order to create the emotional responses that you want to create, you have to do kill off a character that you, and with luck the reader, are both fond of. I'm not ashamed to admit that I cried when I wrote that part, although perhaps I should be.  Michael A Stackpole: At the point where it will cause the most and appropriate amount of emotional trauma to a reader. It's got to be done well, and be appropriate for the character, or done to provoke a particular reaction.  Gav Thorpe: When it has the maximum impact, emotionally and for the plot. I used to be very callous about offing characters, but I've now stepped back a bit. Better to have them tortured and put through the wringer a few mores times, because once they are dead, you can't (usually!) go back. Killing a major character is the nuclear strike of narrative, making a huge impact but leaving devastation in its wake.  When a big character dies, it should not only profoundly affect the reader but also the other characters in the story. Cities have been razed and nations overthrown to avenge the loss of a loved one, and a well-timed character death can add new impetus to the motivation of the rest of the cast.  A good deceasing of a character also reminds the readers that \"plot armour\" does not exist. If a character once thought impervious to harm dies, it sows doubt on the invincibility of others. However, too many character deaths can simply spoil the enjoyment of a reader; they invest emotionally in the characters and to see them dropping like mayflies is a punishment for that attachment rather than a reward. Too often a character is killed off simply for the shock value, but some of the best character deaths are those that have been foreseen or presaged in some way, leaving the reader with a sense of dread of when it is going to come, adding to the tension.  Robert V. S. Redick: I can only answer by telling you how I know if anything is necessary in a novel. For me, writing is an unstable mixture of deliberate craft and wily dream. The former requires planning and sober execution; the latter just gallops, snorting and stamping and bent on discovery. It will take you to the most secret, beautiful dells, if it doesn't fall and break a leg.  Dream and conscious craft fight for control of the story. I know that a certain turn of events is necessary when these both forces tell me so. This may sound a bit mystical but it really is how I work. And while both the dreaming mind and the sensible, draftsman's mind are crucial to the making of a successful novel, I tend to err on the side of trusting the dream. You can bend or break away from an outline, but you spurn the dream at great peril to your book.  Erin Hoffman: I could tell you, but then I'd have to kill you.  Deciding this really has more to do with the character itself. One of the most important things about a character is how he or she ends. Is it a Nietzschean ending, going out at the apex of her power in a defiant blaze of glory? Is it a quiet ending after a lifetime of toil? A character's ending defines that character in a reader's mind, it evokes a singular emotion, and all great characters deserve great endings. Finally, one of the nice things about fiction is that we are not bound by linear time once that character's end has been decided and played out.  K. V. Johansen: [Kill a character?] When you can't stand them anymore! No, definitely not, or in that middle-of-the-book slump you'd massacre everyone and that would be that. It's when the story demands a character's death. It can't be casual, done merely to shock the readers and prove you can, because you don't actually need that person anymore; that's almost a sneer at your readers, saying, \"Nyah, I have power,\" and that's a disservice to the story, showing off that you're the puppeteer and they're all just dolls on strings. Doing that reduces them to nothing more than dolls on strings. It has to be because it's natural, suitable, maybe even inevitable, to the shape of the story that they die at that point. Even if it's an unexpected and unheroic death, the way real people have died all through history, an infected cut, a sudden illness, a stroke, it has to matter, within the story. I don't think you can say that, in general, there's any particular point a character should die; it's very specific to the needs of each series and the life of that character or those who are affected by them. Sometimes it's the effect on other characters that is the most important factor, the thing that makes the story demand that death at that time.  Paul Kearney: What's the length of a piece of string? The plot may demand it, or the character will be placed in a situation where his death is simply inevitable, because you've backed him into a corner, or because that's simply the way he would behave. There is another notion though; that it can be done purely for shock value, or to make a wider point about the world you're trying to create. I'm a firm believer that not all heroes should die heroically, because in life, it doesn't always work out that way—and the humdrum, unexpected death of a major character can be more shocking than the carefully staged last stand.  Peter Orullian: We've all likely read a novel where the death of a character felt like the writer was proving to us that he's got the chutzpah to do it, but the death didn't make sense in the story. I'm not talking about senseless death. It's rather like the rash of fantasy writers who admire George Martin for being able and willing to kill his characters, and so decide they're going to do the same. And that not killing a character becomes a fantasy cliché.  Truth is, trope-avoidance is the new trope. Very transparent.  The other truth is, George has a deft hand at such things.  Here's the thing, if the story is served by a character's death, if it's the natural (however surprising) consequence of the story's progression, have the guts to do it. You can create a new character that your readers will love. But disposing of a character for shock value is tantamount to those awful slasher movies. Yeah, your reader may jump and laugh and think, \"Good one. Didn't see that coming.\" Or he may admire that chutzpah you were going for, even if he's sad over the loss. But it's also ultimately an emotional zero.  On the other hand, if I get angry and sad at a writer for disposing of my beloved hero, but I also see why; then it sticks with me, and I begin to actually trust the writer more. Love that.  Ian C. Esslemont: [The death of a recurring character] can be vitally important. Required, even. All at the dictates of the narrative. If the logic of the themes and arcs within the story require it, then it must be done. An epic is not a series, or a serial. Eternal iteration can be left to others. Epics end—this is perhaps another of their defining characteristics. Odysseus returns home; the gods all die and the world is consumed; the hero dies.  Lynn Flewelling: Speaking as one who has played that card a few times, it must advance the plot. You can't just do it just for pathos, or to give the main characters some big emotional scene. There has to be some purpose to it in terms of the story that you're telling. Self-sacrifice is one of the best examples I can think of for a \"good\" character death. Or it can be karma, with some past action coming home to roost.  Patrick Rothfuss: [Kill a character?] On page 603 of your third book.  I kid, I kid....  Never, really. A lot of people think that you need to kill someone to raise the stakes in a book, or build dramatic tension, or prove to your reader that the world is truly dangerous and that seriously bad things can happen.  And sure, killing a well-loved character can do that. But it's not the only way to do it. Generally speaking, I prefer subtler tragedies. Those are the things that can break your heart. Some things are much worse than death....  Brandon Sanderson: I never \"kill off\" characters. I don't even think of it as killing them off, honestly. That phrase has never worked for me. When I'm writing books, I allow the characters to take the risks that I feel, as people, they would demand that they be allowed to take. And sometimes the narrative structure means that they take those risks and pay a price for it.  When is it appropriate? It's appropriate when it's right. That's one of those things that I have a hard time explaining to people. But I don't \"kill off\" characters—I allow characters to die because of what they've chosen to do.  Ed Greenwood: Writers should resist the temptation to kill characters on a whim or as the easiest way to write themselves out of a situation, but should always bear in mind that to some extent, writing is a service industry: your readers' needs should be paramount. Arthur Conan Doyle discovered the cost of eliminating Sherlock Holmes the hard way, and had to bring him back. I am not saying every beloved character should lead a charmed life, improbably surviving every sticky situation (because the character is thereby lessened in the reader's eyes, and the dramatic tension of peril in your storytelling lost, as the reader becomes aware that any peril isn't real).  Any character death is going to hurt a reader who cares about that character, just as real deaths cause us the sorrow of loss, grief, and anger. Michael Moorcock killed off Elric in Stormbringer years ago, and ever since has had to write \"in Elric's past\" novels if he wants to feature Elric again. As a writer, be sure to open doors as well as close them (and a death, unless undeath or resurrection is easy in the setting, is closing a door). The writer should be aware of the cost of eliminating a character, and handle it well: not overblown, but not \"thrown away\" (due to a meaningless or unexamined or plot-useless death) either.  The easiest way to kill a character is \"the shock ending\" (of a scene, chapter or book). It leaves the reader hit mentally with the loss, and gives them time to deal with it. Yet the writer should always consider if it's the best way to eliminate the particular character.  When advising other writers who haven't reached my own body count yet, I tell them to see it as if you are a home handyman with a toolbox crammed with tools you inherited, tools you bought, and inevitably some favorite tools. If you are \"throwing away\" a tool forever to accomplish some work task, is it worth it? Is it the best way to accomplish the task? Does the throwing create a magnificent, unforgettable moment that \"makes\" a story? If you come up with a \"no\" to any of these, that character elimination needs to be refined, or abandoned in favor of doing something else at that point in the narrative.  How have you kept your series fresh and lively?  Michael A Stackpole: I usually do that by killing of recurring and beloved characters, then elevating others to fill the gap.  Kate Elliott: By finishing and moving on.  Terry Brooks: Fear of failure. Desperation. Luck. Whatever's working at the time.  Patrick Rothfuss: I try to be ever-vigilant against falling into fantasy clichés. I try really hard to avoid telling a story in the same way it's been told a hundred times before....  Robert V. S. Redick: By maintaining the ability to surprise myself. This relates directly to the dream/craft balancing act I talk about above. If I'm surprised and astonished as I tell myself the story, I can hope that the reader may be as well. The moment I feel I'm just executing a plan—just taking orders from a rigid outline—I lose interest. So there's always that chance that something will explode while I'm handling it. And if it does—well, that's lively, isn't it?  Terry Brooks: It helps me not to write in only one series. If I can go back and forth on some sort of regular basis, I get a chance to recharge my batteries. I get fed up with my own writing every now and then, and if I'm fed up I know the readers will be, too. Every book has to be your best effort. Your readers expect it and they have a right to do so. The one cardinal rule of our business is that you don't ever disappoint them by trying to cut corners or put out an inferior product. I also think you have to push the envelope every so often by writing something completely different. You need to challenge yourself. Don't rest on past successes; remember you are only as good as your next book. I got into this business in the 1970s with one thought in mind—make it a lifetime career. Prove to yourself that you can write more than one book and do so on a regular basis. I think this sort of mindset helps me find ways to stay fresh. I might add that when I consider ideas for a new book, I have to find an underlying thematic structure to the surface story that I am interested in exploring. I remind myself that I have to live with this book for the better part of a year. If I don't love it, I will have problems down the road.  Rowena Cory Daniells: I have to be passionate about a story to write it. These books are big, (400—700 pages). That represented a big investment of my time and mental head space. I live with these people and their stories for hears. The trilogies are labors of love and I do love a good adventure. So the story has to pick me up and sweep me away!  Trudi Canavan: When I write, I'm doing it mainly to entertain myself. I keep \"the reader\" in mind, too, but if I wrote primarily for them I'd go mad trying to please everybody. Yet when it comes to pace I reason that, if I'm bored the reader will be too. When it comes to matters of taste—whether to use made-up words for animals, prologues and epilogues, write in first or third person, etc.—I stick to what I prefer.  I'm conscious of avoiding repeating myself. This is hardest when writing more books within the same world; writing in new worlds makes it easy to be fresh and new. The same setting can result in similar characters, so I try to avoid that. Though in one exception to that rule, I deliberately created a character in a similar situation before in order to highlight the differences in the time period of a world. Tessia in The Magician's Apprentice is a \"natural\" magician as Sonea in the Black Magician Trilogy, but she's middle class rather than poor, and becoming a magician overcomes quite different societal restraints.  James Barclay: Well, I'm glad you think I have [kept my series fresh and lively], that's the main thing. I suppose I could be glib and refer you to the above and say that changing the cast helps (and it does) but again, that's not the reason it's done. Over the course of a trilogy and longer sequences, you still have to develop your characters and their relationships; and they must continue their inter-related journeys. They must still have the capacity to surprise readers such that while readers should rightly be comfortable with them, there's still opportunity for something unusual just around the corner. Just like people in real life, right?  Then there's the plot stuff. Upping the ante with each book is a good way to maintain interest because the consequences of failure grow. What I also do is go the other way and make the consequences intensely personal, sort of lowering the ante on a global scale and maxing it out inter-personally. And I've actually tried to do both in my book, Ravensoul. It's the Holy Grail... upping and lowering the ante simultaneously. I like to think it worked rather well.  And to continue freshening, I try hard not to repeat fight sequences, to make each scenario different and to involve characters beyond the core who grow to prominence and have full tales of their own to tell. But of course each book must move on fluidly from the last, picking up threads unfinished and moving them on or to their conclusion. So you can't go all out for change because you must respect what has gone before since that is the reason readers are picking up the next in the sequence. Does that make sense? It does to me but then I'm inside my head and you aren't... are you?  Ian C. Esslemont: What I have tried to do is approach my subject matter from a slightly different angle each time. I've tried to push my craft with each project. It may happen that I will push too hard and will fall on my ass, but I hope that those commenting will keep in mind that at least I fell attempting something new.  Steven Erikson: My series is done. I've stopped feeding it. My next books are stand-alones or trilogies.  Lynn Flewelling: The Nightrunner series, book six of which, Casket of Souls, is coming out next spring, does not have a single, overarching plot arc. The first two books, Luck in the Shadows and Stalking Darkness, are a sort of duology weaving several plot threads into a single flow of story. So do Shadows Return and The White Road, books four and five. Traitor's Moon and Casket of Souls are stand-alones. I based the structure of the series loosely on the way Conan Doyle handled the Sherlock Holmes series; each story presents our heroes with a new puzzle to be solved, and Seregil and Alec are, first and foremost, problem solvers.  I am a fervent believer in character growth, too. What happens to the characters marks them, educates, them, wounds them, changes them, be it a physical or an emotion scar, or new knowledge that can be applied in future situations. They have to learn and grow and be products of their experiences as they continue on through the books. Otherwise they're just a cartoon, resetting to zero at the beginning of each new tale.  In my Tamír Triad, I do use a single arc over three books, but each book has its own sub arc, a combination of action and character growth. In them, the hero/heroine, who begins life as a girl, is changed at birth into a boy, and discovers and has to switch to her natural gender in her mid teens in order to fulfill her destiny. Among the trilogy's various themes is gender and identity, honor and loyalty, and duty to a higher purpose trumping individual need. And there's a ghost!  Paul Kearney: Again with the piece of string! I just write what I want to. I make no conscious decisions about what might go down well with readers. I merely keep to what I think the story should be, and follow it. Quite often I let the story go where it wants, even if that direction is unexpected to me, who's creating it. In fact those moments when the plot takes a turn I haven't foreseen are some of the best moments in the writing process—the world is alive, and is doing its own thing—you're merely there to record it.  David Anthony Durham: Who's to say I do [keep a series fresh]?  All I can say is that I write the stories that most compel me, and I hope those stories appeal to enough readers so that I can keep on doing it. In some ways I'm learning to give more lighthearted fun to readers. There's more humor in the Acacia series as it progresses, and some of the character's journeys are intended to scratch that itch for swashbuckling with adventures beyond just following the main plot struggle. So, on that account, I feel like writing fantasy for vocal readers—ones that I hear from!—has helped make me a more engaging writer.  On the other hand, I was aware—especially as I neared the end of the trilogy—that I was working against the genre norms in ways that not every fantasy reader is going to love. I couldn't help it. The ending events are true to the characters as I understand them, true to what they would consider to be the noblest actions they could take. Those won't always be what readers expect. Hopefully, some will find this \"fresh and lively\". Others won't.  This, alas, is the type of writer I am.  Elizabeth Bear: I try to avoid falling back on clichés where possible. (Clichés are based in archetypes, of course, and at a certain point there's so much narrative in the world that everything is a trope. I dare you to find a plot point or character category that is not explored in detail at TVtropes.com. But clear an afternoon first: It's a hole in the internet into which many have fallen and been lost.)  Exhaustive research helps. The more you can go back to primary or secondary sources rather than relying on what other fantasy writers have written about, the more interesting your work will be, I think. (That's the first-person \"you,\" there.) So when I need elves, I go back to Norse or Celtic sources and develop my own alfar, rather than copying Tolkien or J. M. Barrie.  Ed Greenwood: I have been writing about my most popular setting, the [Forgotten] Realms, for forty-five years (and counting). Many others have written \"in the Realms,\" too, bringing their own flood of new ideas and characters; that takes care of the \"fresh\" part. My job, though I don't control the setting, is to integrate this flood, to make it all feel part of the Realms, to chronicle how what is \"already there\" of the Realms reacts to the new people and events. If any deed is to have meaning, it must have consequences, not just occur and have no effect on the setting. So I follow those consequences, in the process describing trends and changes that build in the Realms just as they build in our real world.  As decade after decade of Realms fiction unfolds, the Realms itself changes, just as the real world of today is a very different place from the real world of the 1960s. As much as a particular reader may want to cling to some element of the setting and have it persist unaltered, the world cannot remain static or be a stage full of sound and fury that encompasses no real change. Embracing changes, and writing about them, keeps the world alive (almost too lively, some might say!).  Juliet McKenna: I've continually changed viewpoint characters and moved between the regions and different societies within the world I have created. Seeing places and people from different perspectives constantly offers me new challenges and sparks fresh ideas for stories. This has also offered new readers successive entry points; you can read my third or fourth trilogy without ever having read The Tales of Einarinn or The Aldabreshin Compass. That gives me an added advantage as a writer; I need only include the essential back story for any new novel rather than being weighed down by the burden of comprehensive continuity.  K. V. Johansen: Well, so far, Blackdog, Moth's world, only consists of one novel and a short story (\"The Storyteller\", which is also going to be an OEL manga eventually), so I haven't had to think about that much—yet. As it goes on, though, I think it will be the same as what I've found in my writing for children and teens, in the Torrie books and the Warlocks of Talverdin series, both of which are also secondary world fantasy.  Moving the story to a new part of the world, or to a new generation of characters as the political or historical situation changes, can keep it fresh and alive. It means you're not tramping over the same ground, as it were. You allow your characters their victories and don't snatch them away in the next book, but new troubles and challenges arise out of what's gone before and what they've achieved. Maybe they themselves will go on, or maybe it will be someone else, because it's natural that one person finally lays aside the burden of making history, either through death, or growing too old to take an active role, or retiring into some well-earned peace, and another generation takes up the torch. Through this, you and your narrative perspective characters can keep exploring new aspects of the world, of their history, and that opens up new possibilities for their development and keeps it all intriguing and exciting, lets you discover more. If that possibility isn't there, then the author risks getting bored herself, and if the author is bored... better go write a different book.  In Blackdog, Moth is more or less immortal (not giving away anything there, I think), and the stories in the Blackdog world are ones into which she wanders. The stories are all linked by the involvement of Moth or some other recurring characters—Holla-Sayan, the main hero of Blackdog, is likely to become one of these—but they're all new stories, too. Moth is a hero, but she isn't the sole or chief hero, as it were, of any one story; that's always someone else who is in the middle of things, the hero of that story, while she skulks around the edges, following her own plot. The real central heroes are the people dealing with the messes she and her kind have created, people like the Blackdog and Pakdhala. By means of her journey through the landscape and history of the world, through that linking story, we can be taken into a succession of related adventures and gradually begin to see a larger story unfolding as well.  N. K. Jemisin: Well, my stuff feels fresh and lively because it's not done yet—only the first two books of the Inheritance Trilogy are out now. So that's the easy answer. But beyond that... I get bored easily. I don't particularly want to follow the same characters through the same saga for umpteen books, not unless they get significant closure now and again.  And not if the adventure seems dragged out just to sell more books. I get that many readers like that; those of us in the modern era were all trained by RPGs to expect endless adventures in the same milieu, gradually building up the same characters. I sometimes enjoy reading sagas like that, and I certainly enjoy playing them as a game, but that's boring as hell to write. So I tend to change my protagonists for every book, even within the same series.  I try to explore the same world from different viewpoints, because that's fascinating to me—the way two different people can view the same object as either a boon or a threat. I give each protagonist a personal arc to fulfill—and once it's filled, I move on. The worlds I build are too interesting to me to view them through only one set of eyes, or only one story arc.  There are many stories, so why would I tell only one?  J. V. Jones: With each book I try to improve my craft. I'm always playing against myself. How can I write a better battle scene? What's the perfect starting sentence for a chapter? How can I better show the truth of a character's emotions? The other stuff—new locations, new characters, new plot complications—are necessary elements for keeping a series fresh, but they are secondary to challenging myself as a writer.  Peter Orullian: Well, my series has just begun. Book one is all that's out there so far. But one of the things I challenge myself to do is ask if every scene does three things: advances the plot, deepens the character, and provides backstory. A scene needn't do all three, but I try to make them hit the trifecta anyway. If, on the other hand, a scene does but one of these, I usually toss it, or find a way to make it work harder. I'm reading a book now that is marvelous line-by-line, but most of its scenes scarcely answer one of these questions.  As far as keeping it lively for me, the writer? That has to do with allowing myself to entertain ideas both strange and familiar. In other words, I keep everyone out of my head when I write. I s'pose you could say I like best the line by Stephen King, which is: I write first to please myself, with the idea that (since I'm a reader, too), if I succeed at that, there'll be others who come along with me. That's a paraphrase, of course.  I've also infused the series with other things I love, like music. Easy for me to write those scenes, and a hell of a lot of fun, too!  Gaie Sebold: I think you'd have to ask me [this question] again if the first book does well and I get to do more of it! It is something I feel quite apprehensive about, since I am a complete beginner at the whole thing. However, the way Babylon's world is set up I have the chance to take her to a lot of worlds and different cultures, and I have quite a few ideas about things I'd like to do, places I'd like to take her, landscapes and ideas and attitudes I'd like to explore. So that gives me scope to do lots of different things and keep it interesting. I hope.  Brandon Sanderson: I may not be the right one to ask on this, because the longest I've gone on a series is three books. I hope to be able to keep future series fresh and lively. It is certainly a challenge for the epic fantasy. With the Stormlight Archive, I'm planning a large, multi-volume epic, and I built in to it things I can do that I hope will keep it very fresh for me. I built in to it numerous magic systems. For me, I love great magic systems; it's part of what I love to write in fantasy. So if I have multiple types of magic to play with, and different characters who interact with it in different ways, it will remain fresh and new to me. And as long as it's fresh and new to me, I hope that it will be fresh and new to the reader.  What role does humor play in your fiction in general and epic fantasies in particular?  Elizabeth Bear: I think humor is an essential leavening. I'm not by any means a funny writer, but when I started off I was a very very serious one. Very serious. Like this. Serious face.  These days, I've got enough control of my prose and narrative to let some wit in, and I think my writing is the better for it. It's often very black humor, but that's the sort that people in life or death situations rely on.  We are, after all, writing to be read. And people are not going to want to slap down their beer money for an endless series of doleful portentous seriousness. It's one-note writing, and just as limited as writing that can't shake off a breezy tone to really emotionally engage with a reader.  Ian C. Esslemont: Things can get pretty damned heavy and it's necessary to leaven the mix now and then. But beyond this, it is actually in humor and comedy that most of the overturning of tired literary tropes occurs.  If I may put on my academic's hat for a moment: humor is subversive. This subversiveness allows accepted wisdom to be mocked, hierarchies to be inverted, constructions to be deconstructed, and unexamined certainties to be interrogated.  There, enough polysyllabic puffery.  In short, humor is where you take the piss out of it all—including yourself.  James Barclay: I think [humor] plays a key role because, and I could refer you to answers above, it reflects real life. There is humor in everything, even in the most dire of circumstances and I think the author who ignores that is making a grave mistake. Humor makes things feel real; even dreadful humor will do that. Epic fantasy is a genre that suffers from a lack of humor and this does it no favors. Authors can get led down a path that allows no humor, only worth of deeds, complexity of treachery or whatever. Lack of humor weighs a book down, leaves it turgid and can bleed the life out of an otherwise brilliant work. I will always look for ways to inject humor and not just because I think it adds credibility but because readers need a chance to breathe and smile while reading a book that is dealing with stuff like death of loved ones and the end of the world and so on.  Terry Brooks: Humor relieves tension. We see this in our own lives. When we are frightened or nervous, we say something funny. So if fantasy is supposed to approximate real life—which is what I learned from Lester del Rey—then humor has a place in fantasy storytelling. I use humor to define character now and then, as well. Magic Kingdom relies more on humor than Shannara, but that's just another example of writing more than one kind of story to keep from getting bored.  Erin Hoffman: Humor is so important and I think undervalued in epic fantasy. There is a tendency to get too caught up in the gravitas, and in so doing actually lose the verisimilitude that humor offers. Real characters are not, generally, Solemn Knights doing Things of Import for Virtuous Causes all the time. People laugh, they fail in stupid ways, life happens. Humor is also really, really hard to do well.  J. V. Jones: Being surprised makes us laugh. Humor comes when something happens that defies our expectations. Epic fantasy, with its battles between good and evil, its portentous omens and solemn knighthoods is a perfect breeding ground for the unexpected. Readers expect stateliness and gravity, so when something mundane, bawdy or just plain goofy happens it can take readers by surprise.  Trudi Canavan: Humor has several roles to play. There is irony and sarcasm, which may point out the hypocrisy within society. There is the sort of humor that eases the tension in an action scene— which can be very dark humor. There is also teasing humor between characters, that makes them likeable, or a powerful and intimidating person more accessible.  Steven Erikson: If there's going to be tears, better have a few laughs along the way. Besides, it's almost impossible to sustain the heavy stuff without ending up wanting to top yourself, or sinking into mawkish melodrama. A novel's like a drug; sometimes for everyone's sake you got to cut it with something innocuous.  In a more general sense, I use humor in my shorter fiction not just for laughs, but also for satire. It's a rut, taking things too seriously: sometimes you just have to cut loose, let the knives flash, and smile at all the bleeding (even when you're the one doing most of the bleeding).  Ed Greenwood: Humor should play a recurring role (at least in the form of \"human nature\" irony and jesting repartee, as opposed to slapstick, which should be used sparingly), or the epic fantasy runs the risk of becoming self-consciously serious (otherwise known as \"deadly dull\" or even pompous). Although humor, like sex scenes, resonate very differently with different readers, the ability to see what is amusing in life situations (and convey this sight, however poorly) makes for more well-rounded, believable, and therefore more effective writing. In short, the tale means more to the reader, and so will be more enjoyable.  Humorless characters are valid elements (usually as villains or to be derided within the narrative), but an overabundance of them brings the same result as humorless writing: most readers will feel a subtle revulsion to the story, and will lessen their engagement with it. Any judgment they make of it will be lessened. (They will also feel distanced, or even belittled by the writer, if a story contains laughter that is unexplained, or jests that seem to the reader to be nonsense; the reader feels \"shut out of the party,\" and less worthy as a result.)  K. V. Johansen: Humor in epic fantasy depends on the author. There are people who manage to write whole books that are devoid of humor, but I find that to be really satisfying to me, a book has to have some lightness in it, something that suggests when things are very bad that there is memory of better times and potential for light-heartedness again, or one starts to wonder what the heroes are fighting for—why don't they all go off and become hermits or something? Humor is part of that, having characters who have a sense of irony and a sense of humor about themselves. In my own writing, I try to let humor come in through the characters, through how they see their world and how they reflect on it and on themselves.  Patrick Rothfuss: I think humor is a valuable leavening agent in any story. It helps readers make an emotional connection with the characters in the book. It helps keep a book from sliding from drama (which is good) into melodrama (which makes us roll our eyes, if not throw up just a little bit.)  The problem is, humor is hard to write. It's the hardest kind of writing, really.... And you can't fake it. If you try to be dramatic and you only half-succeed, you're still halfway dramatic. But you can't be halfway funny. If you're halfway funny, you're unfunny.  Gaie Sebold: It's fun to do. I like the idea that I'm making people smile; and I've always loved humorous fantasy. One of my best-loved childhood books was The Land of Green Ginger, and I think that was the first time I encountered that particular style of witty fantasy; I'm fairly sure it's been a major influence on the way I want to write.  Humorous fantasy, at its best, is like a vitamin-filled cake—it makes it fun to read about big, serious issues. You have a good time and you're made to think, too. Sir Terry Pratchett is the obvious example; he's a master at it.  But not all epic fantasy is humorous fantasy, obviously. Humor has a lot of functions in storytelling generally, whether it's books, theatre, film...it acts to release tension, when things are tough. Humor in the trenches. If the audience is going along with the characters, feeling what they feel, getting worked up—a laugh allows you to blow off that tension, relax the muscles ready for things to start building up again. It can help define a culture; where one group of people might find it hilarious if someone gets their head cut off by an accidental swordswing, and someone else slips in the blood and breaks their nose, another group might find it deliciously amusing if someone turns up at court in the wrong color robe. It can show you more about characters; the kind of jokes they make and the circumstances under which they make them can tell you a lot, and there's something about characters joking under pressure which helps create a great deal of sympathy for them (depending on the jokes, obviously). Perhaps because the ability to 'laugh in the face of danger' is a trait we are generally hardwired to admire.  Rowena Cory Daniells: Humor plays an important role in everyday life. When the floods were sweeping through my home town last Christmas holidays someone was interviewed on the news and they said: \"You've got to laugh. If you didn't, you'd cry.\" Humor is a valve for releasing pent up emotion. It helps us cope with the very worst in life. As an epic fantasy writer, my readers don't expect me to produce a laugh a page. But there are moments as I'm writing when I chuckle to myself. It must sound really strange to anyone in the room.  Lynn Flewelling: Given the weighty issues we write about, some humor can really relieve tension and lighten the mood. It can also be a character element. My hero Seregil is a smartass at times, and witty at others; it helps define his view of the world. He takes his work seriously, but not too seriously. And it annoys one of the other Nightrunner characters, which delights Seregil. That helps set the dynamic between the two of them, even though they are allies.  Michael A Stackpole: I think humor is critical in all fiction. If you're not writing comedy outright, it serves as a chance to breathe and escape the drama and pressure. I particularly love gallows-humor. Some of the remarks I put in the mouths of my characters would get me killed if I ever said them in real life. But humor and defiance have a lot of power in this regard. And, face it, getting someone to laugh while reading is proof you're triggering true emotions, which is great.  Victoria Strauss: I don't do humor well in fiction (nonfiction is another story), so I don't attempt it in my novel writing. My books are all pretty much deadly serious. People who meet me after reading my fiction are surprised that I have any sense of humor at all.  Humor in epic fantasy is welcome, where it's well done—Joe Abercrombie's First Law series, for instance, is full of mordant humor that's an essential part of the series' style and atmosphere. But I don't think it's in any way essential—Scott Bakker's Prince of Nothing series is wonderful epic fantasy, and it's as serious as a heart attack. The important thing, I think, is for writers to recognize their own strengths and weaknesses. Do humor if you can do it well, and if you can't, avoid it. Unfortunately, many writers don't follow this policy. There's way too much cheesy fantasy humor about.  Gav Thorpe: It's important to have moments of lightness and some fun. Quite often epic fantasy embroils a world in dark times, and just as in real life the characters will respond in different ways, many of them trying their best to see the funnier side of things. If there is no humor, one risks becoming unceasingly depressive, dragging the characters and reader into a hole from which it is impossible to emerge. Whether it is the characters joking or the author creating an amusing situation, a certain amount of light relief allows the reader and the characters to catch their breath and smile, before being plunged into the bloodshed and mayhem once more.  Paul Kearney: I don't think that humor is ladled on too thickly in most epics. My own literary humor tends to be black, somewhat bitter, and sarcastic—spend time with real soldiers, or nurses to find out just how black and un-PC humor can be in the face of adversity. Slapstick can be left at the door, but there is also room for drawing-room wit. In any case, humor in epic fantasy is something that has to be judged carefully, and using it well is an art in itself.  Peter Orullian: Well, first I'll say that I think humor writing is the most difficult, even more so than sex scenes—though badly written sex scenes are often hysterical. I've just recently spent time talking to some stand up comics; and man, if I thought trying to get published was hard. Sheesh! Humor has everything to do with timing; playing against expectations and personalities; and, to another degree, a character's insecurities. Then, you have to forget all that and do it intuitively, since I don't think you can say, \"Hey, I'll write this funny.\"  I've written at least one character who, I think, is funny. He says what other people are thinking, and often when it should least be said, or most be said, as the case may be. It's part of his make up. And I think sometimes you laugh right out, and other times you think, \"Really?\" And that feel's authentic to me, since the funniest folks I know don't make me laugh every time.  What I didn't do was think, \"Hey, this guy's the comic relief, he's the foil, readers will let off pent up worry when this guy says his line.\" Though I understand the classic use of the harlequin to give the audience a respite from the tension of the drama, I've not made any such overt attempt.  I think in epic fantasy as a whole, humor is less often used. Could be just the brand of stories I pick up. Certainly there's plenty of gallows humor going on. And hey, that's good stuff. I won't say that a funny line in a tense moment doesn't maybe shine the brighter. I've seen that done to good effect in epic fantasy. But it's got to come from the right character at the right time, or else it feels like manipulation or just a false note.  Robert V. S. Redick: In epic fantasy overall, humor done well can be a blessing, because it tends to bring what can be an overly large narrative canvas back down to a human scale. Most humor is interpersonal, not globe-spanning. But for that same reason humor is very easy to abuse. We've all had the experience of someone we don't know that well leering at us, elbowing us in the ribs, demanding that we laugh at their joke. It's irritating because it assumes a shared set of values where they may not exist. This happens in fiction as well.  Humor is not just personal, though. It's brutal and unforgiving and famously fickle. What sends a thirteen-year-old boy through the roof may simply bore his parents (or his best friend of the same age). And heaven help you if your jokes are stale. I may just turn green and die if ever read another clever-youth-outwits-dumb-and-brutish-guard scene.  When humor works, it arises naturally from the fictional circumstances. It can't just be imposed.  Brandon Sanderson: In epic fantasy, we have the space and the time to deal with all emotions. I'm not saying other genres don't—there are a lot of good authors who are capable of covering a wide range—but we have a lot more space in epic fantasy. I think that humor is a component that's integral to a good story.  I've had discussions with science fiction writers about this, and it seems like a lot of science fiction is really trying to engage the mind—and doing a very good job of it, if you look at great classic science fiction in particular. But I think that in fiction sometimes we downplay the importance of engaging the emotions. There are certainly great books across all genres that do this. I think we sometimes elevate the idea above the emotion, but I think that great books are about emotion as much as or more than ideas. If you don't have the full range of emotion, then there's going to be a hole there. So I think humor is integral and important.  Juliet McKenna: For me, humor is one of the most useful colors on the writer's palette. It offers light and brightness to contrast with darkness and tragedy. It's also something that can convey an individual's true nature quickly and comprehensively; the jokes that someone tells and how they react to someone else's.  It's also vital for that realism that draws the reader into a story. Humanity has been cracking jokes since the dawn of time; humor can serve as a bonding experience, as a way to relieve tension, with more calculation, to undermine opponents or used more negatively, to exclude or to diminish those perceived as undesirable, for good or ill.  Kate Elliott: I would kill to be funnier. In fact, I have a task force at work pinpointing the location of Joe Abercrombie, after which a special operations team will swoop in, drain his blood, and return it to me for a much needed infusion. Nothing personal, Joe.  Do you have any advice on dealing with violence when writing Epic fantasy?  Patrick Rothfuss: I advise keeping a hatchet next to your writing desk. That way you'll always be ready to deal with violence when you're writing epic fantasy.  Michael A Stackpole: Do enough to be effective, and keep it realistic. Do not do Hollywood sword-fighting. Combat is nasty and brutal. People scream and stink and beg and die horribly. It may be tough to write, but if it's not realistic, it doesn't have the seriousness necessary to drive a story.  James Barclay: Don't sugar-coat [violence]. Fighting with weapons, magic, fists and feet is incredibly brutal and has hideous results. I mean think, just think, what would happen if someone swung a sharpened bit of metal really hard into your side? It would cut straight through to your spine and dump your entrails and all sorts of other organs all over the floor. Or what would happen if someone hit you with a spell that increased your skin temperature by a thousand degrees? Brief unimaginable pain and then ashes. Dear god the stink of fear and blood and shit in a fight to the death must be over-powering. No wonder only strong and brave people do it. Every step they take in a fight is through the blood and bits and bodies of the dead. Every block they make merely delays their own deaths. The noise of struggle is terrifying and so very close. No TV screen between them and the intimacy of people desperate to live and equally desperate to kill. Every nick of flesh is a howling agony. And every solid blow crushes bone, severs limb from torso, slices artery and vital organ.  No wonder I choose to write about it rather than actually experience it. Don't sugar-coat it because it diminishes the acts of incredibly courageous people. And just like I did with that paragraph above, write it all in one go and don't stop til you're done. Read it back later. Don't plan it and don't over-edit it.  Trudi Canavan: Be aware that readers have different tolerances for [violence]. You may reduce your audience by including extreme violence. But out of the trio of 'sex, drugs and violence', it's the one that's least likely to cause a stir, especially in conservative markets. And if that's the sort of story you want to write, don't hold yourself back. There's an audience for it out there.  Elizabeth Bear: Well, advice, no. I can tell you what I do, because random violence bores me: I treat it with the same rules as everything else I write. If it doesn't worldbuild, develop character, create or resolve tension (what some people call \"advancing the plot\")—out the door it goes. If it's boring, cut it. And violence can be as boring as anything else.  Terry Brooks: Violence is a key element in epic fantasy. Wars and battles are almost always involved. Conflict is the bedrock of sagas and of the changes brought about by life. I do have some self-imposed rules. I am not a fan of graphic violence, so I steer clear of elaborating on blood and gore and body parts and the like. I'm not saying it doesn't work; it just doesn't work for me. My emphasis is on issues. How do hard choices impact us? What is the nature of our responsibility to others? How do we balance right and wrong when it isn't always clear which is which? Violence is a part of resolving those dilemmas, but I don't want it to be the focal point. Related to this stance might be one other rule I try to follow. If there is a scene in a book that I find I cannot or don't want to write, I make myself do it. Usually, it becomes clear that the scene is crucial to the story, and you can't let yourself be backed down by the difficult or the challenging. Writing about violence frequently falls in this category.  Robert V. S. Redick: Treat violence with the utmost humility. Talk to people who've lived through it, as participants or victims or both. Or at the very least read their words. It's a soul-changing horror to experience, and I don't like books that pretend otherwise. Yes of course it's a part of the entertainment. That's fine; there are profound reasons for its fascination. But that doesn't mean we have to lie about its deeper consequences. We get desensitized enough through TV and video games without our books chipping in.  In fantasy, it's the after-the-battlefield costs that tend to get downplayed or denied. The psychic wounds, the lingering agonies: those are much harder to dramatize, and that tempts us to omit them, or give them token attention. I'm determined never to do that.  Lynn Flewelling: Again, it has to advance the plot. Otherwise it's just gratuitous. It should be well thought out, especially for things like swordplay or archery, and not go on and on in endless, excruciating detail. I certainly have violence in my books, and it's an interesting element to work with. If my good guys are doing it, is it blameless? Do the bad guys have to be shown to be bad through violence? I tend to work with the grey areas, rather than having everything black and white. Sometimes violence may be necessary, but it doesn't have to be applauded.  Ian C. Esslemont: Violence in fantasy, epic or not, gets more attention than it deserves. If it is justified by the needs of the story then it has earned its presence. If not, then it is just shallow gore or juvenile pandering. It must serve the thematics, not just splash prettily.  David Anthony Durham: Writers' approaches to violence are going to vary—and should vary—depending on the tone of their work and the audience they're writing for. The graphic viciousness of The Steel Remains makes sense because Richard K Morgan's world is going to be graphic and vicious. Most readers will know that going in and want it. Readers of George RR Martin have to know that people will die—or be maimed—in horrible ways in every book. He wouldn't be being true to his vision if the reader didn't have to cringe at certain scenes. That's a very different vibe than the stylized action of RA Salvatore, and it should be. I don't want everything I read to have only one note to it.  In my work... well, I'm not as graphic as Morgan, or as callous as Martin or as lightning fast as Salvatore. I'd like to think I'm somewhere in between. When a certain leagueman gets his head sliced half off I expect a reader to see the image vividly in that moment. I don't want to overdo it, but I try to write violence with the sensory detail I'd write a description of something beautiful.  Rowena Cory Daniells: This comes back to the earlier question about killing a much loved character. Violence, like sex has to happen for a reason. Both have to drive the plot forward and reveal something about character. In real life, I'm a softie. I can't watch the news if children have been hurt. I find it too upsetting, so I steer clear of anything that would upset me like this in my books. Having said that I feel a certain level of violence is necessary in a fantasy book for authenticity.  In today's society we are cushioned from the reality of our actions. Sex doesn't risk pregnancy, birth (generally) happens in a hospital, pain is something to be fixed not managed with fortitude and we fully expect death to happen when we're old. At the same time we experience a surfeit of vicarious violence and death through news programs, movies and games. But it is all one step removed, so it loses its impact.  Until recently, people saw violence every day and you never knew when death was going to take someone you loved. When my mother was a child, a simple cut could lead to blood poisoning and kill you. This level of danger changed the way people viewed their lives. Today, if we look into Australia's convict past we are shocked by the level of punishment for simple crimes. But that was accepted then. Violence and sudden death were a normal part of life. Actions should have consequence, the more powerful the consequences, the more powerful the story.  Paul Kearney: Make it real. You're dealing with mass violence, more often than not, and if you don't want to be explicit about it, that's fine—but you must, must show the consequences of violence, no matter how ugly, otherwise you're being dishonest with yourself and the reader.  K. V. Johansen: Part of the tension and the growth in this sort of story comes from the heroes being pushed to the limits, physically and emotionally, and usually the political or cultural setting ends up being one in which violence is always on the verge of breaking out, or is the means of rule. I think it's important to keep it from becoming violence for the sake of violence, though. There's a mystery series I like, that always has one sex scene in it, about the middle of each book, often quite arbitrarily, with no relation to the plot or anything that's really going with the characters in the story. They start to read like they were stuck in as afterthoughts to meet some quota. In writing epic fantasy, you can get sucked into thinking that you need to have some set amount of violence, to make it \"authentic\" and \"gritty\", but if that's all it's doing, it's just titillation, just pornography, something to make people look. The violence should be there because it's necessary, because battle and war, or furtive clashes in the night, waylayings by bandits, capture and torture, are what is arising from the story, because in this world at this time, that is what is happening.  For battles to be believable, it's important to study a lot of history, and military history. You need to develop a sense for tactics and to consider the strategies the leaders of the various forces will have in mind, in order to bring them together in plausible ways that give you the outcome you want for the plot. You need to understand the conditions people fought under at the equivalent time (in terms of technology) in primary world history; you need to understand how the weapons worked. At the individual level it gets harder, since I'm not someone who's into martial arts and haven't bashed even imaginary enemies with a wooden sword since I was a kid. I have a secret envy of the people writing fantasy who have that background. I do a lot of stopping and thinking and waving my arms around (dangerous in my small study—I cause bookquakes) to figure out, if A is here and B jumps them from over here, can they ...?  Ed Greenwood: Violence should shock.  It should be swiftly, simply told. Violence shouldn't be \"over the top\" or the reader will laugh (to distance themselves from the horror, almost always at a point where the writer doesn't want the reader to laugh) or be desensitized (often due to repetition; simply put, the butchering of the forty-third princess never has the same impact as the slaughter of the first one—and still less with orcs).  In terms of writing style, one pitfall that should always be avoided is the writer over-explaining every detail of a fight, as if they're an artistic director or movie director trying to set up a shot. If the prose used to describe the fight slows down (due to too much detail) so that the frantic energy of the fight is lost, the writer has failed.  Brandon Sanderson: I can't really give advice unless I know specifically what type of book you're writing. For example, George R. R. Martin's A Song of Ice and Fire and David Eddings's the Belgariad are both in the same epic fantasy subgenre by strict delineation, yet these two series treat violence in wildly different ways. What George has done is made the violence more . . . brutal.  This is going to be kind of a weird metaphor, but stick with me. If you've seen the Matrix films, there's a scene in one of them where Agent Smith leaks out of the Matrix, takes over a guy's brain, and attacks Neo in the real world. This is a shocking fight, and I found it very interesting, because it's this bloody, brutal, trying to gouge out each other's eyes, beating each other's heads against the wall, blood and stumbling, sort of fight. That's one type of violence, and it was very shocking because the rest of the violence in the Matrix series is very superhero-action, where it's action more than violence.  You can have everywhere in between. It depends on what effect you want to have on the reader and on the characters. Honestly, I generally do my fights more like the inside-the-Matrix fights than the outside-the-Matrix fights, because I want to write beautiful action sequences, not scenes of absolutely brutal violence. But that's not to say that you can't do both.  Victoria Strauss: I think violence in epic fantasy is like sex in epic fantasy. It's part of life (especially in non-technologically advanced societies), so it's got to be included; avoiding it or glossing over it is cheating. But it should never be included for its own sake—only insofar as it enhances the story and advances the plot. It shouldn't be like those gratuitous car chase scenes in action movies—i.e., there just for the special effects, dragging on so long that the reader's eyes glaze over.  Beyond that, it depends on the book and the writer. Some plotlines will inevitably include more violence than others, and some writers just want to tell brutal stories. There are few taboos these days—about either violence or sex—and writers have a lot of freedom to choose to how much violence to include and how to present it, and really don't need to censor themselves. Again, though, I think it's important to be aware of your strengths and weaknesses. If you're not good at writing battle scenes, find another way to present that part of the story. If you are good at battle scenes, don't overindulge yourself. If you're not comfortable writing graphically violent scenes, don't feel you have to—but if that's where your style and passion takes you, go for it. Just as long as it serves the story.  Peter Orullian: I've spoken with a lot of writers recently on a similar topic, which is: Do you self-edit? Are there things you don't write about? Or is it all up for grabs? No censorship in art!  Here's the thing, it seems to be fashionable to be called a writer of \"gritty\" fantasy. Some say it's more realistic. I think I understand what this tribe is saying, but it does make me wonder about the use of those terms in proximity to each other, ya know: \"realistic\" and \"fantasy.\"  One of the ways writers hit on the \"gritty\" thing is violence. Now, it's hardly possible to write a fantasy without some violence, but the question really has to come back to: What is necessary?  If in a fight a guy is disemboweled, how far do you need to go to describe that? Steaming guts that stink of undigested cornbeef and stomach bile? Not sure if all that is necessary. And after all, I'm rather fond of the notion that the reader is co-creating with me. Meaning, I need only paint in the most salient details. And the reader will supply a great deal from his or her own imagination. I get how theoretical and high-minded that might sound, but I still think it's true.  It's a place where \"less is more,\" which isn't something you'll often here me say. I think it's a tired, over-used phrase. More is really usually more. But with writing, the sparing detail can speak volumes. I'm still working at this, as are most writers I know.  All of which is to say, you don't need to shy away from violence, just make it matter, and then chose well what you don't say.  Juliet McKenna: The writer's touchstone should always be exploration rather than exploitation. The violence must serve the story, not merely be gratuitous titillation. It's best used sparingly in most cases, lest the impact on the reader is dulled by repetition or disgust. But as with humor, violence is an integral part of humanity's make-up and should always be an available color on that writerly palette. Similarly an individual's propensity and reaction to violence will offer key insights into their nature.  Kate Elliott: I think writers shouldn't flinch from writing violence. One has to be cautious, though, about using violence as the only way to build stakes, tension, conflict, and emotional reaction. It can get boring. Vary your palette.  I would wish writers to be honest about the degree of violence war inflicts on the actual combatants, and I particularly would wish writers to be honest about the degree of violence that war, empire, and political, religious, and economic conflict inflict on non-combatants and on the fabric of societies. We don't need to look to the past for examples of this; we need only look at the news today.  Yet at the same time, violence needs to be seen as part of a larger picture. To use one example, I've read/heard both writers and readers comment that epic fantasy isn't really about, doesn't really \"include,\" female lives unless they're rape victims, sex workers, mothers of heroes, or nubile young women waiting to be married off for dynastic or economic alliances—in other words, purely about sex, which frankly to me suggests a failure to understand the profound and far-reaching effects war and the various sorts of destabilizing conflicts have on the societies they touch as well as ignorance about the lives women actually led in the past in world history. The way history was approached and written in decades past rendered many lives virtually invisible, but that does not mean those lives weren't woven into the fabric of the events of their day or that people we may think of as passive, ignorant bystanders to the history of Men did not have a measure of agency and wit or even a great deal more than that in terms of economic or political clout if they were in the right social group.  There is, for instance, an entire subgenre of little stories written in the European Middle Ages in which clever women fend off the unwanted attentions of strong, armed men by wit and intelligent argument alone. The famous Aristotle, so very respected and influential and of course strikingly sexist in his view that women were literally physically, intellectually, and spiritually inferior to men, was also mocked and reviled in the Middle Ages, not least for what was recognized by some at that time as his misogyny—and this by clerical writers who were themselves part of a misogynistic culture. Cultures wrestle with their own cognitive dissonances; they are not monolithic, static, and unchanging. Indeed, they contain multitudes.  Gaie Sebold: I would say that it should matter. There's a lot of stylized violence around, especially in film; and I have to say I enjoy it myself, so I don't want to come off as a hypocrite; characters who can slash people into sushi while doing somersaults are fun, there's no denying it. But if you're going to kill people in fiction, you should be aware of the fact that that is what you're doing, and not treat it as though your characters were just knocking coconuts off a shy in a fairground.  Oh, and when people get hurt, they should hurt. If your character is a supernatural critter who shrugs off injury in seconds, that's one thing—but even supernatural critters should feel some effects when they've been beaten to a pulp. Violence is painful, and not just at the time. I'm lucky enough never to have actually been beaten to a pulp, but I've done some contact sports and some martial arts and broken an ankle and you don't just get up whistling and drink your beer. Well, you might, but you'll be groaning and cursing and swelling and so forth at the same time. For some time afterwards, too.  Gav Thorpe: I've taken different approaches in different venues, but only within a certain frame of reference. The violence I portray is realistic and bloody, because I want to show the grit and sweat that lies behind every gallant act or ignoble deed. Whether it is an elven prince fighting for his crown or a poor Askhan legionnaire, a life of war is harsh and unforgiving. To romanticize that side of an epic story is somewhat disingenuous, ignoring the reality that high ambitions and grand schemes are almost always at the expense of life and comfort. It helps a reader to understand the import of the epic tale when they see the effort—literally the blood, sweat and tears—that are required to make it a reality.  Bearing that in mind, one should always remember to keep the fantasy in epic fantasy. There are many ways to wage war when your characters might have dragons or powerful wizards, or in the case of Ullsaard in The Crown of the Blood, a giant cat. To make a brief foray into sci-fi, it's a bit like the construction worker on the Death Star in Return of the Jedi. You don't see them getting annihilated, only the bad guys, but when worlds change even the innocent get caught up in the fall-out. If one simply skips over this brutal reality it is a disservice to those unsung masses slaughtered in the name of your heroes and heroines.  Context is also important with violence. One should not get so caught up in the hack-and-slash and eviscerations that the characters simply become vehicles for the action. They are emotionally part of the violence, whether loathing or enjoying it, and through their actions and reactions the reader becomes involved. The actual level of detail that is acceptable will vary from reader-to-reader, but I err on the side of the audience being pulled into the action with the roar of defiance, the thud of axe into flesh and the stench of death. To sanitize the violence risks divorcing the reader from what is happening, making them a dispassionate observer rather and an involved participant. I feel it incongruous for a writer to labor love and attention on a victory banquet scene or the details of a coronation when the reality of how those scenes came about is glossed over.  J. V. Jones: The ability to craft tight, well-choreographed fight scenes is a gift few writers possess. The more real fights you've seen, the more you realize that Hollywood movie fights are pure fantasy. You know the type: men grunt manfully when they take a punch and no one gets hurt. I grew up in a pub in England, and every weekend there would be fights. Violence in real life is shocking. It starts out of thin air and ends quickly. If you put that reality into your writing and carefully map out the movements of your characters—checking to see those movements are authentic—you'll be ahead of the game.  Steven Erikson: Make sure every act of violence described has consequences, and don't be afraid to be brutal and brutally honest in those consequences. Violence is also traumatic and psychologically scarring, and it breeds its own, making people cold-hearted and mean-spirited.  Try not to step over too many bodies on the way to the story's end. ('Millions died, but wait! There's millions more!'). Sometimes slaughter reads like an easy way out; sometimes it reads like it's just a word. Sometimes you sense that the author really doesn't give a fuck about people, especially those meant to be disliked; sometimes it feels like the author doesn't even like people.  If you want to be seriously accurate and technical when writing fight scenes, avoid the SCA and talk to re-enactors; take up fencing or some other martial art. Take up ice hockey and find out what a high-speed body-check against the boards feels like, then remember those feelings the next time you write about some hero getting thrown into a wall and jumping back up ... physically, we just don't work that way. Everything hurts, everything is jarred inside, you feel sick as a dog and you might even be thinking it's Tuesday and you missed the BBQ. That said, I have no problem with fantasy novels that skim over technical details in fight scenes, if fighting is in no way central to the story: it's down to the author's own interest.  Finally, be not gratuitous. There's too much of that shit everywhere as it is.  Any parting words?  Elizabeth Bear: May the road rise to meet you and the wind be ever at your back.  Terry Brooks: I am grateful every day that I get to write fiction for a living. I have never wanted to do anything else. Even the most difficult times are pretty good. Just goes to show—sometimes the magic works.  Patrick Rothfuss: Inculcate. And sparge. Sparge is a great word...  Ed Greenwood: Fantasy is an individual thing; what wows me might not grab you. This is a Good Thing, this variety of tastes that gives us many writers and tales rather than just a few, or \"one perfect one.\" Read widely. Don't confuse the opinion of someone else with universal truth; sample writers of all stripes, and books derided as \"bad\" or \"ho-hum\" as well as those held up as shining triumphs. Choose your own heroes. Taste the true richness of the entire wine cellar, not just sipping endlessly from the first bottle ever handed to you. Variety is indeed the spice of life—and every tale devoured enriches in you in some way, even if it's just to repudiate what you disliked. Go forth, and read, taking time for silence amidst all the noise and bustle of everyday real life—and be enriched.  James Barclay: Good-bye.  See, that was one of those bits of humor I was talking about. Not terribly funny but I bet it gets a good number of smiles and that can't be bad.  Paul Kearney: I wish fans of epic fantasy would be less worried by the thickness of a book's spine...  Gaie Sebold: Writing fantasy is a privilege and a delight. It's also hard work and makes me swear a lot, but it's the best fun. I feel very lucky to live in a time and a country when I can read and write as much of it as I can fit in, and where the main barrier to publication is whether I'm good enough, not whether I'm female or what I choose to write about. I know there are people who wonder why one would spend time on these things that 'aren't about the real world,' but my answer would be—if you don't think it's about the real world, you aren't reading the good stuff—or you aren't reading it with your eyes all the way open.  Michael A Stackpole: Epic fantasy is probably the longest-running storytelling tradition known to humanity. We can point to Homer's work and know there are epic stories that predated his work, and likely have been lost to time. So anyone denigrating epic fantasy as escapist tripe is a) out of touch with the roots of storytelling and b) likely hasn't read any of the good stuff. And if after reading the good stuff, such a person still holds their ridiculous opinion, I'd be happy to explain why they are utterly and completely wrong.  K. V. Johansen: In some form or other, epic fantasy is always going to be around, because we need stories that tell us we can go out and strive to achieve something greater, and (if we survive) come back changed. (And, I suppose, if we don't survive, still have honor for making the attempt.)  J. V. Jones: It's a great time to be writing epic fantasy. The field has moved beyond \"lets all write in a quasi-Medieval setting\" and now welcomes elements and inspirations from many cultures and historical periods. Write on a large scale, keep your characters \"human\" and go do something new.  Gav Thorpe: There is a fine line to tread between epic fantasy and soap opera. The reader must always have a sense that the story is heading somewhere, even if it might take three or five or ten books. With large casts of characters and a whole world as a canvas there comes a risk that the narrative starts to meander as sub-plots and minor characters are explored in increasing detail. If at the end of the saga these characters and sub-plots have not contributed to the final result, as interesting as they may be to read along the way, then I feel like it has become filler rather than story. A writer needs to keep a clear view of where events are heading, and if they take the odd diversion along the way that finishing point must be closer by the end of each scene, even if the impact is not to be known for some time to come.  Trudi Canavan: I find the sub-genre labels to be a bit unsatisfactory sometimes. People have a hard enough time deciding what where the lines are between fantasy and other genres, let alone where they are between sub-genres within fantasy. But I can see the labels are useful for when you're recommending book to other people. If you like this kind of fantasy, you might like that book/series. And perhaps they're also useful to describe the type of fantasy that's trendy at the moment!  Juliet McKenna: I'm looking forward to the day when epic fantasy fans need not justify their tastes or explain the strengths of the genre. Crime fiction has made that step, not least thanks to high-profile television series showing its depth and breadth. Let's hope HBO's A Game of Thrones starts epic fantasy on the same path.  Peter Orullian: Only that this is a very exciting time in the genre of epic fantasy. Think about the number of authors working in the field right now. And for the most part—different from the glut of horror books we got in the 80's—these writers are doing exceptional work. I'm a babe in the company of these giants, and just glad to be a part of the conversation. But I'll add my voice to the chorus, for sure.  Erin Hoffman: Non-gaming folk don't often want to hear about this kind of stuff, but... There is a very palpable sentiment in both the fantasy and horror communities (and SF) that video games especially are the enemy of genre, because they are somehow \"eating\" genre book audiences. This is manifestly not true, but the perception remains.  Epic fantasy was present in video games almost at the dawn of the video game itself. The earliest prototypes were physics simulators because the math was more interesting, but the instant that games became expressive, fantasy, and in particular epic fantasy, came in. Some of the biggest game franchises are epic fantasy franchises. Final Fantasy is probably the most well known, and is straight-up epic sword and sorcery, focusing entirely on mythic monsters of ever-increasing size and the spiky-haired hero who destroys them with a giant magical sword. The very notion of \"a final fantasy\" (by which they mean the last great conflict of a given world—every Final Fantasy takes place in a different world) is intrinsically epic.  Dungeons & Dragons is the other extremely familiar epic fantasy game franchise. Its mechanics originally grew out of baseball simulators, but now represents not just a continuing franchise but a genre. In the early 80s when the first computer-based epic fantasy games showed up—series like Wizardy and Bard's Tale—there was actually a lot of resentment about the single-player evolution (or devolution depending on your camp) of RPGs (roleplaying was supposed to be social!). And yet now the single-player epic fantasy RPG is its own art form. The Phantasy Star series, which (again depending on your angle on the world) might be space fantasy but certainly seems to be epic fantasy also, is one of my all time favorites, likewise the Shining Force series. I would also go to bat for Ecco the Dolphin's status as epic fantasy.  Talking about Final Fantasy, Phantasy Star, and Shining Force brings up another dynamic of epic fantasy that we don't often have too much exposure to in the western world, which is the huge market for epic fantasy in Asia. Before massively multiplayer online games reached the mainstream here in the west, millions of players were playing games like Lineage in Korea, Japan, China, and southeast Asia. Lineage is absolutely an epic fantasy property in the tradition of Tolkien, and Asian properties beyond Final Fantasy have been heavily influenced by Tolkien's elves especially. In the east, and in particular in South Korea, more people play MMOs than have cable television, which is a uniquely interesting dimension of their cultural experience of epic fantasy. Now that the west, with World of Warcraft, has caught up to something along the lines of eastern awareness of online games, we have fusion properties like Aion by NCSoft, which is a flying islands epic fantasy game with winged elves and a big dash of steampunk Victoriana.  I think it's a natural evolutionary process for massively multiplayer online games to become the predominant medium for epic fantasy in games (though the Japanese single-player RPG is still kicking along—the Tales of Symphonia series comes to mind, and White Knight Chronicles). It plays to our desire to be a *part* of something that is epic. The fantasy of \"epic\" is a fantasy of the individual, and when we read we imagine ourselves as that individual and having that epic experience, so it's natural that we should be drawn to the agency, validation, and connectedness that MMOs give us in our fantasy. This has also been true since the very early days of the online game industry—almost all of the text-based online multiplayer worlds, the predecessors to games like World of Warcraft, were fantasy-based.  Robin McKinley: In parting, to reiterate my excuse for joining this discussion at all: that all stories are Story, and the rest is details. To that I would add—emphatically—that you need to tell the story that wants you to tell it and worry about definitions later. If it's a good story and a good read, it doesn't matter if it's Epic Fantasy or a sonnet. (All right, except in terms of the probable amount of money for your advance.) I decided it would be tactful not to add my spurious two cents on aspects of epic-writing that I've never had to deal with, but I'll mutter sotto voce here that relationships between characters and settings and the role of humor must straightforwardly be true to that particular story and that whether the story is epic fantasy or not is incidental.  Perhaps not quite incidental. The epic fantasies that I as reader personally find a slog are the ones without humor. Beautiful writing, excellent characters and a breathtaking plot will get you only so far with me.  About violence: the older I am the more I hate writing violence, and one of the aspects of Peg II that is really oppressing me is the need to write some more battle scenes—and kill off a well-loved-by-me-anyway character or two as well.  My experience however suggests that—at least if you suffer self-confidence problems similar to mine—you may be better off deliberately and consciously not thinking about what the story you're writing is, because you might decide that it's too difficult for you and lose your nerve. (Or second-guess yourself. Nobody was rewriting fairy tales when I wrote Beauty, and I almost didn't bother to send it out: no publisher was going to be interested, because everyone knows how the story of Beauty and the Beast ends.)  Any writers looking for tips out there, I repeat, as I have said in many other contexts: write what you have to write. Think about everything else later.  Brandon Sanderson: A lot of people like to refer to the epic fantasy genre as \"fat fantasies with maps.\" I've heard that before. The first time I heard that it made me pause and start thinking about it, because that's not how I look at the genre. And then I thought, well, how do I look at the genre? I realized I don't really look at it as epic fantasy or not epic fantasy. I look at it as books that I love. I incorporate the themes that I love in books that I love and try to write books like the ones I love and yet have my own new thing to them.  So I don't really sit here and think, I'm going to write a fat fantasy with maps. I think, wow, I love how Scott Westerfeld did maps and art in Leviathan, and can I apply something like that to the fantasy books I'm working on? Or, I love how Watchmen incorporated both text and visual art in a really interesting package. Can I apply that to my writing? I look at what people are doing with interesting magic systems or interesting casts of characters and say, can I use that? And the result that comes of that is something people call epic fantasy.  But I'm just trying to write awesome stories. It doesn't come down to a conscious decision of length, or that a fat fantasy has to have maps so I put maps in—that's just not how I regard it. This is the genre that turned me into a writer. This is a genre that I have always absolutely loved, and that has sucked me in more than anything else. So that's what I want to do.  Kate Elliott: To be honest, I find that too much of epic fantasy and concomitant opinions about how societies of the pre-modern era function is based on historiography that is 30 years old. For instance, depictions of European medieval-like women and indeed of many medieval-like societies in some fantasy is woefully outdated. This outmoded historiography does not just pertain to women, it pertains to gender, it pertains to the church, and—because I've been focusing my comments on the European Middle Ages—it pertains very much to non-Christian and non-European cultures which were and are societies just as complex and advanced and layered as the European template so much fantasy defaults to.  We can tell new, interesting, and exciting stories if we extricate ourselves from old and increasingly tired assumptions and expectations about life in the past, and if we expand our horizons. I would still love to see more ethnic and cultural variety. And I would hope writers are giving thought as to whether their books pass the Bechdel Test.  Having said that, I think there are a lot of compelling and fascinatingly diverse writers working in the genre today; it's an exceptionally rich and rewarding time to be reading epic fantasy.  Dramatis Personae  Lou Anders is the editorial director of Pyr Books and the editor or co-editor of such anthologies as, Swords & Dark Magic and Masked. www.louanders.com  James Barclay is the author of the recent (in the US) Demonstorm and the forthcoming (in the UK) Rise of the TaiGethan. www.jamesbarclay.com  Elizabeth Bear is the author of such novels as The Sea Thy Mistress and the forthcoming The Tempering of Men (with Sarah Monette). www.elizabethbear.com  Terry Brooks is the author of Bearers of the Black Staff and the forthcoming The Measure of the Magic. www.terrybrooks.net  Trudi Canavan is the author of The Rogue and the forthcoming The Traitor Queen. www.trudicanavan.com  David Anthony Durham is the author of The Other Lands and the forthcoming The Sacred Band. www.davidanthonydurham.com  Ian C. Esslemont is the author of Stonewielder and the forthcoming Throne and Orb. www.malazanempire.com/site/authors/2-esslemont  Lynn Flewelling is the author of The White Road and the forthcoming Casket of Souls. www.sff.net/people/lynn.flewelling  Ed Greenwood is the author of Elminster Must Die! and Bury Elminster Deep. en.wikipedia.org/wiki/Ed_Greenwood  John Jarrold is the founder of the John Jarrold Literary Agency. He has edited for such publishing houses as Random House, HarperCollins, Pan Macmillan, Simon & Schuster, Orion/Gollancz, and Time Warner. www.johnjarrold.co.uk  N. K. Jemisin is the author of The Broken Kingdoms and the forthcoming The Kingdom of Gods. nkjemisin.com  Peter Orullian is the author of The Unremembered and the forthcoming Vault of Heaven Book 2. www.orullian.com  Robert V. S. Redick is the author of The Ruling Sea and The River of Shadows. www.robertvsredick.com  Patrick Rothfuss is the author of The Name of the Wind and The Wise Man's Fear. www.patrickrothfuss.com  Brandon Sanderson is the author of The Way of Kings and the forthcoming The Alloy of Law. www.brandonsanderson.com  Gaie Sebold's first novel Babylon Steel is forthcoming from Solaris in January of 2012. gaiesebold.weebly.com  Michael A. Stackpole is the author of At the Queen's Command and the forthcoming novelization Conan the Barbarian. www.stormwolf.com  Gav Thorpe is the author of The Crown of the Conqueror and the forthcoming The Crown of the Usurper. mechanicalhamster.wordpress.com  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nSomething Greater: An Epic Discussion of Epic Fantasy, Part 2\nIntroduction\n\"Epic fantasy is as rich, vibrant, meaningful and wonder-provoking as we choose to make it,\" said Robert V. S. Redick, the author of The Red Wolf Conspiracy, The Ruling Sea, and the recent The River of Shadows. \"But to write it well is an immense undertaking, akin to setting off on a walking tour of a continent. Those who have taken such tours report that their feet, legs and knees are changed forever by the experience.\"\nIn Part 1 of this round-table discussion of Epic Fantasy, 26 authors, one agent, and an editor discuss the heart of Epic Fantasy, the scope and sweep, and the relationship between setting and characters, among other topics. In part two, we move into darker ground.\nAs a reminder, this round-table does not attempt to define Epic Fantasy. Instead, it is an ambitious attempt to explore the many aspects of the sub-genre.\n\"Epic Fantasy is concerned with the movements of nations, with the map and the attempts to redraw it,\" said Lou Anders, the editorial director of Pyr Books and the co-editor of Swords & Dark Magic. \"Whereas Sword and Sorcery is the intersection of fantasy with the Western's lone gunman, Epic Fantasy is the intersection of myth and global warfare. We hear people grouse all the time about wanting authors to refrain from getting political in their entertainments, but at its heart Epic Fantasy is inherently political. It concerns itself directly with who has the right to rule and why.\"\nFilled with violence and death, humor and courage, lives of purpose and recklessness, broad sweep and sometime staggering word counts, novels of Epic Fantasy offer readers simultaneously expansive and very intimate stories-stories that require commitment of the reader and that offer extended opportunities for full immersion in fantastical worlds.\nEpic Fantasies also require much of the authors. In Part I, the round-table participants discussed with generous sincerity why they write Epic Fantasy. Here is a particularly personal response from Kate Elliott, the author of such novels as Cold Fire and the forthcoming Cold Steel. As Elliott said:\nI was an outdoor, athletic child: I preferred to play physically active imagination games outdoors. But, against that, the cultural norms of the day reminded me constantly that the things I loved to do were appropriate for boys, not for girls. People forget this. So in the beginning, as it were, fantasy novels were a way for me to escape the rigid constraints put on girls. More importantly, I could write my own stories and build my own worlds. If you've not grown up being told you shouldn't be who you are, I'm not sure you can quite understand why world-building and writing epic fantasy is so attractive and in its way a form of chain-breaking. But it was, and it is.\nAs an adult, I've become fascinated by cultural change, cultures in conflict, and the rise and collapse of complex societies, with a special place in my heart for the life cycle of empire. Epic fantasy allows the scope to really dig into these questions; the form creates an expectation that the reader will venture through layers and enjoy a certain level of complication, so I find it appealing for that reason. I also love tracking multiple characters through a changing landscape. I don't say that to suggest other genres and subgenres can't do exactly the same things, just that those are some reasons I write epic fantasy.\nI am not, by the way, a monarchist nor do I yearn for the halcyon days of yore with a secret reactionary bent to my heart. The idea that epic fantasy is by nature a \"conservative\" subgenre is, I think, based not only on an incomplete reading of the texts but also on an understanding of the medieval or early modern eras that comes from outdated historiography. I don't doubt specific works can be reactionary or conservative (depending on how you define those words), but more often than not I suspect—although I can't prove—that if a work defaults to ideas about social order that map to what I call the Victorian Middle Ages or the Hollywood Middle Ages, it has more to do with sloppy world-building in the sense of using unexamined and outmoded assumptions about \"the past\" as a guide. I really think that to characterize the subgenre so generally is to not understand the variety seen within the form and to not understand that the simplistic and popular views of how people \"were\" and \"thought\" in the past are often at best provisional and incomplete and at worst outright wrong.\nHistorian Judith Bennett calls this the \"Wretched Abyss\" Theory, the idea that the European Middle Ages were a wretched abyss from which we modern women/people have luckily escaped. It's one of the founding myths of modern feminism as well as the modern world. Me, I want to live now, with internet, antibiotics, and that nice intensive care nursery that saved my premature twins. But that doesn't mean we aren't also responsible to depict a more nuanced and accurate representation of \"a past\" as it was lived and experienced as a dynamic and changing span.\nTo fully understand the ways Epic Fantasy works on us as readers and writers is a delightfully impossible task. In fact, it's a downright epic challenge, but the contributors have a grand time facing that challenge.\nThe participants are Lou Anders, James Barclay, Elizabeth Bear, Terry Brooks, Trudi Canavan, Rowena Cory Daniells, David Anthony Durham, Kate Elliott, Steven Erikson, Ian C. Esslemont, Lynn Flewelling, Ed Greenwood, Erin Hoffman, John Jarrold, N. K. Jemisin, K. V. Johansen, J. V. Jones, Paul Kearney, Juliet McKenna, Robin McKinley, Peter Orullian, Robert V. S. Redick, Patrick Rothfuss, Brandon Sanderson, Gaie Sebold, Michael A. Stackpole, Victoria Strauss, and Gav Thorpe. (Consult the Dramatis Personae for more information about each author and for links to their web-pages.)\nHere in Part 2 of Something Greater: an Epic Discussion of Epic Fantasy, we tackle such topics as deciding when to \"kill off\" a character, keeping a series lively, handling violence, and making the most of humor.\nToward the end, some of the participants offer parting words on topics ranging from the thickness of books to the long and tangled relationship between Epic Fantasy and video games.\nAt what point is it necessary to kill off a recurring (and perhaps much loved) character?\nN. K. Jemisin: When the story requires it.\nJuliet McKenna: When the internal consistency and coherence of the story demands it. Giving favored individuals plot-immunity in favor of sacrificing some no-name in a red tunic devalues the death in terms of the story and cheats the reader of the full emotional and dramatic impact. If the death doesn't matter, then it just doesn't count. It also deprives the reader of that uncertainty, of that sense of peril, which draws them into the story and keeps them turning the pages.\nJ. V. Jones: [Kill a character?] Sooner than you think. If a reader expects a character to survive until the end of a multi-book series, what's the point? There's no peril. Everyone has to be at risk and the risk has to be real. It's hard for a writer to kill off a beloved, carefully-constructed character. Our deep and secret fear is that we won't be able to write another one to match them.\nTrudi Canavan: While killing off a character saddens me (unless they are evil, and deserve it!) I don't allow myself to get too sentimental and attached. Ultimately, I'm trying to write a good, gripping story.\nKate Elliott: When they die.\nI may be interpreting the question in a way it's not intended, but I don't find it to be \"necessary\" to kill off a character except at the confluence of events and setting where that character ends up dead. Characters have lives and things happen for any number of reasons, and sometimes what happens is that they die. I don't write series in the sense that I have recurring characters from book to book; I write a single novel in multiple volumes and when it's done, it's done. So any given character will either survive to the end, or won't.\nElizabeth Bear: If there comes a point where I don't think the characters can reasonably get off without loss of life, I start looking for victims. And actually, my trick is that when I know I need to kill somebody, I look for the person I like the most, and see if she's necessary to the rest of the narrative. If she is, then I go to my second favorite.\nSo I'm always killing off people I adore. It's very pathological. But apparently effective—I seem to have a reputation for ruthlessness.\nJames Barclay: I don't think it is ever necessary or inevitable and there is no hard and fast rule in my opinion. I know I have a reputation for a lack of sentimentality regarding my characters but it's rather unfair and simplistic to use that as a reason why my central characters die on a relatively regular basis. For the record, I find it very hard to kill off much-loved characters. What I believe is this: my characters inhabit extremely dangerous and violent worlds during extremely dangerous and violent times. It simply is not credible (I find I use that word a fair bit when discussing fantasy) for all your central characters to survive largely unscathed the whole time. Combat is so chaotic that pure skill is not always enough. You cannot track every arrow, thrust or spell so luck plays its part. Not only that, part of the nature of heroism involves placing yourself in mortal danger for the greater good. Sometime or other, your skill will not be enough or your luck will run out. Or indeed both.\nI've never killed a core character for the shock effect alone. I'm aware there is such an effect but they die because there is no chance of survival, not because the book needs a kick.\nNB: Ian Fleming would have found it very hard to respond to this question.\nTerry Brooks: I don't have recurring characters in my series. With historical sagas, you move ahead in time on a regular basis—or back in time, as well, in my case, writing about both the future and the past of the Shannara world. Anyway, you might do as many as four books on a character, although more frequently less. So I don't spend a lot of time worrying about that. If I were a mystery writer or a writer with a dozen books all centered on the same characters, I would worry. But I do have an inflexible rule about characters. Everyone is expendable. If it serves the interests of the story or advances the plot in a meaningful way, I will consider killing them off. Also, if they live dangerous lives and are exposed repeatedly to death, it makes sense that now and then death is going to catch up to them. The exception to this approach is the Magic Kingdom series, which is a true series with one story following close on the heels of another. But after five books, I changed focus to the daughter of the main characters so I wouldn't have to kill anyone off—they could just be back home knitting.\nRowena Cory Daniells: You have the answer in your question. There has to be a point. In real life, bad things happen to good people and we struggle to make sense of it. In fiction every action, no matter how seemingly insignificant, drives the plot forward and reveals character. There shouldn't be a wasted word. They say that about short stories, but I believe it about book length fiction too.\nDavid Anthony Durham: To each his/her own on this one. For me, it's necessary to kill off a main character when his/her plot trajectory leads them to it. I want readers to feel that the dangers the characters face are real, and that even people they love can get the ax. It's true to life. I'm all for it being true to fiction, too.\nNow, I'll admit that by the third Acacia book, The Sacred Band, two characters that died in the first book are back in the action. But that's because fantasy allows things realistic fiction can't. In neither case do the characters really escape death. These aren't happy resurrections in which life is truly returned to them. I couldn't go that far with it. They just get a reprieve of sorts that allows them—and the people that love them—to work through some of the things left unresolved by their deaths. If only we had that possibility in real life...\nSteven Erikson: It's all down to story, and what the death serves in that story. Well, it probably should be. Better that than the author getting tired of the poor fool and saying, \"Fuck it, you're now dead.\" Or stalling on that character's development ... if, say, their world-views (which you once dearly loved and maybe even held to yourself) starts proving to be ugly, egregious, pathetic—if the story you're telling has forced you to reconsider your own assumptions, and you decide that rather than going for your own throat, it's better to run away, and by killing that character you run away from everything he/she represents, including your self-doubt.\nEvery death needs to mean something—it's the one conceit authors possess: the one real fantasy in this whole mess. So it needs to be handled respectfully. When it isn't: well, we all succumb to cowardice every now and then; and if not cowardice, then laziness. If those excuses don't fit well, there's always senseless stupidity, which afflicts authors on occasion as much as it does anyone.\nThe risk with killing off main characters is, if you do it too often and too capriciously, you risk your audience deciding it's not worth emotionally engaging with any of your characters, and then you're screwed.\nGaie Sebold: That's a tricky one. I'm only at the beginning of writing a series! However, I have had to kill off a character I really liked, and I know this won't be the last time. It's necessary when the story says it is, if that doesn't sound too pretentious. Writers, like their heroes, have to make hard choices; and sometimes, in order to say what you need to say, in order to create the emotional responses that you want to create, you have to do kill off a character that you, and with luck the reader, are both fond of. I'm not ashamed to admit that I cried when I wrote that part, although perhaps I should be.\nMichael A Stackpole: At the point where it will cause the most and appropriate amount of emotional trauma to a reader. It's got to be done well, and be appropriate for the character, or done to provoke a particular reaction.\nGav Thorpe: When it has the maximum impact, emotionally and for the plot. I used to be very callous about offing characters, but I've now stepped back a bit. Better to have them tortured and put through the wringer a few mores times, because once they are dead, you can't (usually!) go back. Killing a major character is the nuclear strike of narrative, making a huge impact but leaving devastation in its wake.\nWhen a big character dies, it should not only profoundly affect the reader but also the other characters in the story. Cities have been razed and nations overthrown to avenge the loss of a loved one, and a well-timed character death can add new impetus to the motivation of the rest of the cast.\nA good deceasing of a character also reminds the readers that \"plot armour\" does not exist. If a character once thought impervious to harm dies, it sows doubt on the invincibility of others. However, too many character deaths can simply spoil the enjoyment of a reader; they invest emotionally in the characters and to see them dropping like mayflies is a punishment for that attachment rather than a reward. Too often a character is killed off simply for the shock value, but some of the best character deaths are those that have been foreseen or presaged in some way, leaving the reader with a sense of dread of when it is going to come, adding to the tension.\nRobert V. S. Redick: I can only answer by telling you how I know if anything is necessary in a novel. For me, writing is an unstable mixture of deliberate craft and wily dream. The former requires planning and sober execution; the latter just gallops, snorting and stamping and bent on discovery. It will take you to the most secret, beautiful dells, if it doesn't fall and break a leg.\nDream and conscious craft fight for control of the story. I know that a certain turn of events is necessary when these both forces tell me so. This may sound a bit mystical but it really is how I work. And while both the dreaming mind and the sensible, draftsman's mind are crucial to the making of a successful novel, I tend to err on the side of trusting the dream. You can bend or break away from an outline, but you spurn the dream at great peril to your book.\nErin Hoffman: I could tell you, but then I'd have to kill you.\nDeciding this really has more to do with the character itself. One of the most important things about a character is how he or she ends. Is it a Nietzschean ending, going out at the apex of her power in a defiant blaze of glory? Is it a quiet ending after a lifetime of toil? A character's ending defines that character in a reader's mind, it evokes a singular emotion, and all great characters deserve great endings. Finally, one of the nice things about fiction is that we are not bound by linear time once that character's end has been decided and played out.\nK. V. Johansen: [Kill a character?] When you can't stand them anymore! No, definitely not, or in that middle-of-the-book slump you'd massacre everyone and that would be that. It's when the story demands a character's death. It can't be casual, done merely to shock the readers and prove you can, because you don't actually need that person anymore; that's almost a sneer at your readers, saying, \"Nyah, I have power,\" and that's a disservice to the story, showing off that you're the puppeteer and they're all just dolls on strings. Doing that reduces them to nothing more than dolls on strings. It has to be because it's natural, suitable, maybe even inevitable, to the shape of the story that they die at that point. Even if it's an unexpected and unheroic death, the way real people have died all through history, an infected cut, a sudden illness, a stroke, it has to matter, within the story. I don't think you can say that, in general, there's any particular point a character should die; it's very specific to the needs of each series and the life of that character or those who are affected by them. Sometimes it's the effect on other characters that is the most important factor, the thing that makes the story demand that death at that time.\nPaul Kearney: What's the length of a piece of string? The plot may demand it, or the character will be placed in a situation where his death is simply inevitable, because you've backed him into a corner, or because that's simply the way he would behave. There is another notion though; that it can be done purely for shock value, or to make a wider point about the world you're trying to create. I'm a firm believer that not all heroes should die heroically, because in life, it doesn't always work out that way—and the humdrum, unexpected death of a major character can be more shocking than the carefully staged last stand.\nPeter Orullian: We've all likely read a novel where the death of a character felt like the writer was proving to us that he's got the chutzpah to do it, but the death didn't make sense in the story. I'm not talking about senseless death. It's rather like the rash of fantasy writers who admire George Martin for being able and willing to kill his characters, and so decide they're going to do the same. And that not killing a character becomes a fantasy cliché.\nTruth is, trope-avoidance is the new trope. Very transparent.\nThe other truth is, George has a deft hand at such things.\nHere's the thing, if the story is served by a character's death, if it's the natural (however surprising) consequence of the story's progression, have the guts to do it. You can create a new character that your readers will love. But disposing of a character for shock value is tantamount to those awful slasher movies. Yeah, your reader may jump and laugh and think, \"Good one. Didn't see that coming.\" Or he may admire that chutzpah you were going for, even if he's sad over the loss. But it's also ultimately an emotional zero.\nOn the other hand, if I get angry and sad at a writer for disposing of my beloved hero, but I also see why; then it sticks with me, and I begin to actually trust the writer more. Love that.\nIan C. Esslemont: [The death of a recurring character] can be vitally important. Required, even. All at the dictates of the narrative. If the logic of the themes and arcs within the story require it, then it must be done. An epic is not a series, or a serial. Eternal iteration can be left to others. Epics end—this is perhaps another of their defining characteristics. Odysseus returns home; the gods all die and the world is consumed; the hero dies.\nLynn Flewelling: Speaking as one who has played that card a few times, it must advance the plot. You can't just do it just for pathos, or to give the main characters some big emotional scene. There has to be some purpose to it in terms of the story that you're telling. Self-sacrifice is one of the best examples I can think of for a \"good\" character death. Or it can be karma, with some past action coming home to roost.\nPatrick Rothfuss: [Kill a character?] On page 603 of your third book.\nI kid, I kid....\nNever, really. A lot of people think that you need to kill someone to raise the stakes in a book, or build dramatic tension, or prove to your reader that the world is truly dangerous and that seriously bad things can happen.\nAnd sure, killing a well-loved character can do that. But it's not the only way to do it. Generally speaking, I prefer subtler tragedies. Those are the things that can break your heart. Some things are much worse than death....\nBrandon Sanderson: I never \"kill off\" characters. I don't even think of it as killing them off, honestly. That phrase has never worked for me. When I'm writing books, I allow the characters to take the risks that I feel, as people, they would demand that they be allowed to take. And sometimes the narrative structure means that they take those risks and pay a price for it.\nWhen is it appropriate? It's appropriate when it's right. That's one of those things that I have a hard time explaining to people. But I don't \"kill off\" characters—I allow characters to die because of what they've chosen to do.\nEd Greenwood: Writers should resist the temptation to kill characters on a whim or as the easiest way to write themselves out of a situation, but should always bear in mind that to some extent, writing is a service industry: your readers' needs should be paramount. Arthur Conan Doyle discovered the cost of eliminating Sherlock Holmes the hard way, and had to bring him back. I am not saying every beloved character should lead a charmed life, improbably surviving every sticky situation (because the character is thereby lessened in the reader's eyes, and the dramatic tension of peril in your storytelling lost, as the reader becomes aware that any peril isn't real).\nAny character death is going to hurt a reader who cares about that character, just as real deaths cause us the sorrow of loss, grief, and anger. Michael Moorcock killed off Elric in Stormbringer years ago, and ever since has had to write \"in Elric's past\" novels if he wants to feature Elric again. As a writer, be sure to open doors as well as close them (and a death, unless undeath or resurrection is easy in the setting, is closing a door). The writer should be aware of the cost of eliminating a character, and handle it well: not overblown, but not \"thrown away\" (due to a meaningless or unexamined or plot-useless death) either.\nThe easiest way to kill a character is \"the shock ending\" (of a scene, chapter or book). It leaves the reader hit mentally with the loss, and gives them time to deal with it. Yet the writer should always consider if it's the best way to eliminate the particular character.\nWhen advising other writers who haven't reached my own body count yet, I tell them to see it as if you are a home handyman with a toolbox crammed with tools you inherited, tools you bought, and inevitably some favorite tools. If you are \"throwing away\" a tool forever to accomplish some work task, is it worth it? Is it the best way to accomplish the task? Does the throwing create a magnificent, unforgettable moment that \"makes\" a story? If you come up with a \"no\" to any of these, that character elimination needs to be refined, or abandoned in favor of doing something else at that point in the narrative.\nHow have you kept your series fresh and lively?\nMichael A Stackpole: I usually do that by killing of recurring and beloved characters, then elevating others to fill the gap.\nKate Elliott: By finishing and moving on.\nTerry Brooks: Fear of failure. Desperation. Luck. Whatever's working at the time.\nPatrick Rothfuss: I try to be ever-vigilant against falling into fantasy clichés. I try really hard to avoid telling a story in the same way it's been told a hundred times before....\nRobert V. S. Redick: By maintaining the ability to surprise myself. This relates directly to the dream/craft balancing act I talk about above. If I'm surprised and astonished as I tell myself the story, I can hope that the reader may be as well. The moment I feel I'm just executing a plan—just taking orders from a rigid outline—I lose interest. So there's always that chance that something will explode while I'm handling it. And if it does—well, that's lively, isn't it?\nTerry Brooks: It helps me not to write in only one series. If I can go back and forth on some sort of regular basis, I get a chance to recharge my batteries. I get fed up with my own writing every now and then, and if I'm fed up I know the readers will be, too. Every book has to be your best effort. Your readers expect it and they have a right to do so. The one cardinal rule of our business is that you don't ever disappoint them by trying to cut corners or put out an inferior product. I also think you have to push the envelope every so often by writing something completely different. You need to challenge yourself. Don't rest on past successes; remember you are only as good as your next book. I got into this business in the 1970s with one thought in mind—make it a lifetime career. Prove to yourself that you can write more than one book and do so on a regular basis. I think this sort of mindset helps me find ways to stay fresh. I might add that when I consider ideas for a new book, I have to find an underlying thematic structure to the surface story that I am interested in exploring. I remind myself that I have to live with this book for the better part of a year. If I don't love it, I will have problems down the road.\nRowena Cory Daniells: I have to be passionate about a story to write it. These books are big, (400—700 pages). That represented a big investment of my time and mental head space. I live with these people and their stories for hears. The trilogies are labors of love and I do love a good adventure. So the story has to pick me up and sweep me away!\nTrudi Canavan: When I write, I'm doing it mainly to entertain myself. I keep \"the reader\" in mind, too, but if I wrote primarily for them I'd go mad trying to please everybody. Yet when it comes to pace I reason that, if I'm bored the reader will be too. When it comes to matters of taste—whether to use made-up words for animals, prologues and epilogues, write in first or third person, etc.—I stick to what I prefer.\nI'm conscious of avoiding repeating myself. This is hardest when writing more books within the same world; writing in new worlds makes it easy to be fresh and new. The same setting can result in similar characters, so I try to avoid that. Though in one exception to that rule, I deliberately created a character in a similar situation before in order to highlight the differences in the time period of a world. Tessia in The Magician's Apprentice is a \"natural\" magician as Sonea in the Black Magician Trilogy, but she's middle class rather than poor, and becoming a magician overcomes quite different societal restraints.\nJames Barclay: Well, I'm glad you think I have [kept my series fresh and lively], that's the main thing. I suppose I could be glib and refer you to the above and say that changing the cast helps (and it does) but again, that's not the reason it's done. Over the course of a trilogy and longer sequences, you still have to develop your characters and their relationships; and they must continue their inter-related journeys. They must still have the capacity to surprise readers such that while readers should rightly be comfortable with them, there's still opportunity for something unusual just around the corner. Just like people in real life, right?\nThen there's the plot stuff. Upping the ante with each book is a good way to maintain interest because the consequences of failure grow. What I also do is go the other way and make the consequences intensely personal, sort of lowering the ante on a global scale and maxing it out inter-personally. And I've actually tried to do both in my book, Ravensoul. It's the Holy Grail... upping and lowering the ante simultaneously. I like to think it worked rather well.\nAnd to continue freshening, I try hard not to repeat fight sequences, to make each scenario different and to involve characters beyond the core who grow to prominence and have full tales of their own to tell. But of course each book must move on fluidly from the last, picking up threads unfinished and moving them on or to their conclusion. So you can't go all out for change because you must respect what has gone before since that is the reason readers are picking up the next in the sequence. Does that make sense? It does to me but then I'm inside my head and you aren't... are you?\nIan C. Esslemont: What I have tried to do is approach my subject matter from a slightly different angle each time. I've tried to push my craft with each project. It may happen that I will push too hard and will fall on my ass, but I hope that those commenting will keep in mind that at least I fell attempting something new.\nSteven Erikson: My series is done. I've stopped feeding it. My next books are stand-alones or trilogies.\nLynn Flewelling: The Nightrunner series, book six of which, Casket of Souls, is coming out next spring, does not have a single, overarching plot arc. The first two books, Luck in the Shadows and Stalking Darkness, are a sort of duology weaving several plot threads into a single flow of story. So do Shadows Return and The White Road, books four and five. Traitor's Moon and Casket of Souls are stand-alones. I based the structure of the series loosely on the way Conan Doyle handled the Sherlock Holmes series; each story presents our heroes with a new puzzle to be solved, and Seregil and Alec are, first and foremost, problem solvers.\nI am a fervent believer in character growth, too. What happens to the characters marks them, educates, them, wounds them, changes them, be it a physical or an emotion scar, or new knowledge that can be applied in future situations. They have to learn and grow and be products of their experiences as they continue on through the books. Otherwise they're just a cartoon, resetting to zero at the beginning of each new tale.\nIn my Tamír Triad, I do use a single arc over three books, but each book has its own sub arc, a combination of action and character growth. In them, the hero/heroine, who begins life as a girl, is changed at birth into a boy, and discovers and has to switch to her natural gender in her mid teens in order to fulfill her destiny. Among the trilogy's various themes is gender and identity, honor and loyalty, and duty to a higher purpose trumping individual need. And there's a ghost!\nPaul Kearney: Again with the piece of string! I just write what I want to. I make no conscious decisions about what might go down well with readers. I merely keep to what I think the story should be, and follow it. Quite often I let the story go where it wants, even if that direction is unexpected to me, who's creating it. In fact those moments when the plot takes a turn I haven't foreseen are some of the best moments in the writing process—the world is alive, and is doing its own thing—you're merely there to record it.\nDavid Anthony Durham: Who's to say I do [keep a series fresh]?\nAll I can say is that I write the stories that most compel me, and I hope those stories appeal to enough readers so that I can keep on doing it. In some ways I'm learning to give more lighthearted fun to readers. There's more humor in the Acacia series as it progresses, and some of the character's journeys are intended to scratch that itch for swashbuckling with adventures beyond just following the main plot struggle. So, on that account, I feel like writing fantasy for vocal readers—ones that I hear from!—has helped make me a more engaging writer.\nOn the other hand, I was aware—especially as I neared the end of the trilogy—that I was working against the genre norms in ways that not every fantasy reader is going to love. I couldn't help it. The ending events are true to the characters as I understand them, true to what they would consider to be the noblest actions they could take. Those won't always be what readers expect. Hopefully, some will find this \"fresh and lively\". Others won't.\nThis, alas, is the type of writer I am.\nElizabeth Bear: I try to avoid falling back on clichés where possible. (Clichés are based in archetypes, of course, and at a certain point there's so much narrative in the world that everything is a trope. I dare you to find a plot point or character category that is not explored in detail at TVtropes.com. But clear an afternoon first: It's a hole in the internet into which many have fallen and been lost.)\nExhaustive research helps. The more you can go back to primary or secondary sources rather than relying on what other fantasy writers have written about, the more interesting your work will be, I think. (That's the first-person \"you,\" there.) So when I need elves, I go back to Norse or Celtic sources and develop my own alfar, rather than copying Tolkien or J. M. Barrie.\nEd Greenwood: I have been writing about my most popular setting, the [Forgotten] Realms, for forty-five years (and counting). Many others have written \"in the Realms,\" too, bringing their own flood of new ideas and characters; that takes care of the \"fresh\" part. My job, though I don't control the setting, is to integrate this flood, to make it all feel part of the Realms, to chronicle how what is \"already there\" of the Realms reacts to the new people and events. If any deed is to have meaning, it must have consequences, not just occur and have no effect on the setting. So I follow those consequences, in the process describing trends and changes that build in the Realms just as they build in our real world.\nAs decade after decade of Realms fiction unfolds, the Realms itself changes, just as the real world of today is a very different place from the real world of the 1960s. As much as a particular reader may want to cling to some element of the setting and have it persist unaltered, the world cannot remain static or be a stage full of sound and fury that encompasses no real change. Embracing changes, and writing about them, keeps the world alive (almost too lively, some might say!).\nJuliet McKenna: I've continually changed viewpoint characters and moved between the regions and different societies within the world I have created. Seeing places and people from different perspectives constantly offers me new challenges and sparks fresh ideas for stories. This has also offered new readers successive entry points; you can read my third or fourth trilogy without ever having read The Tales of Einarinn or The Aldabreshin Compass. That gives me an added advantage as a writer; I need only include the essential back story for any new novel rather than being weighed down by the burden of comprehensive continuity.\nK. V. Johansen: Well, so far, Blackdog, Moth's world, only consists of one novel and a short story (\"The Storyteller\", which is also going to be an OEL manga eventually), so I haven't had to think about that much—yet. As it goes on, though, I think it will be the same as what I've found in my writing for children and teens, in the Torrie books and the Warlocks of Talverdin series, both of which are also secondary world fantasy.\nMoving the story to a new part of the world, or to a new generation of characters as the political or historical situation changes, can keep it fresh and alive. It means you're not tramping over the same ground, as it were. You allow your characters their victories and don't snatch them away in the next book, but new troubles and challenges arise out of what's gone before and what they've achieved. Maybe they themselves will go on, or maybe it will be someone else, because it's natural that one person finally lays aside the burden of making history, either through death, or growing too old to take an active role, or retiring into some well-earned peace, and another generation takes up the torch. Through this, you and your narrative perspective characters can keep exploring new aspects of the world, of their history, and that opens up new possibilities for their development and keeps it all intriguing and exciting, lets you discover more. If that possibility isn't there, then the author risks getting bored herself, and if the author is bored... better go write a different book.\nIn Blackdog, Moth is more or less immortal (not giving away anything there, I think), and the stories in the Blackdog world are ones into which she wanders. The stories are all linked by the involvement of Moth or some other recurring characters—Holla-Sayan, the main hero of Blackdog, is likely to become one of these—but they're all new stories, too. Moth is a hero, but she isn't the sole or chief hero, as it were, of any one story; that's always someone else who is in the middle of things, the hero of that story, while she skulks around the edges, following her own plot. The real central heroes are the people dealing with the messes she and her kind have created, people like the Blackdog and Pakdhala. By means of her journey through the landscape and history of the world, through that linking story, we can be taken into a succession of related adventures and gradually begin to see a larger story unfolding as well.\nN. K. Jemisin: Well, my stuff feels fresh and lively because it's not done yet—only the first two books of the Inheritance Trilogy are out now. So that's the easy answer. But beyond that... I get bored easily. I don't particularly want to follow the same characters through the same saga for umpteen books, not unless they get significant closure now and again.\nAnd not if the adventure seems dragged out just to sell more books. I get that many readers like that; those of us in the modern era were all trained by RPGs to expect endless adventures in the same milieu, gradually building up the same characters. I sometimes enjoy reading sagas like that, and I certainly enjoy playing them as a game, but that's boring as hell to write. So I tend to change my protagonists for every book, even within the same series.\nI try to explore the same world from different viewpoints, because that's fascinating to me—the way two different people can view the same object as either a boon or a threat. I give each protagonist a personal arc to fulfill—and once it's filled, I move on. The worlds I build are too interesting to me to view them through only one set of eyes, or only one story arc.\nThere are many stories, so why would I tell only one?\nJ. V. Jones: With each book I try to improve my craft. I'm always playing against myself. How can I write a better battle scene? What's the perfect starting sentence for a chapter? How can I better show the truth of a character's emotions? The other stuff—new locations, new characters, new plot complications—are necessary elements for keeping a series fresh, but they are secondary to challenging myself as a writer.\nPeter Orullian: Well, my series has just begun. Book one is all that's out there so far. But one of the things I challenge myself to do is ask if every scene does three things: advances the plot, deepens the character, and provides backstory. A scene needn't do all three, but I try to make them hit the trifecta anyway. If, on the other hand, a scene does but one of these, I usually toss it, or find a way to make it work harder. I'm reading a book now that is marvelous line-by-line, but most of its scenes scarcely answer one of these questions.\nAs far as keeping it lively for me, the writer? That has to do with allowing myself to entertain ideas both strange and familiar. In other words, I keep everyone out of my head when I write. I s'pose you could say I like best the line by Stephen King, which is: I write first to please myself, with the idea that (since I'm a reader, too), if I succeed at that, there'll be others who come along with me. That's a paraphrase, of course.\nI've also infused the series with other things I love, like music. Easy for me to write those scenes, and a hell of a lot of fun, too!\nGaie Sebold: I think you'd have to ask me [this question] again if the first book does well and I get to do more of it! It is something I feel quite apprehensive about, since I am a complete beginner at the whole thing. However, the way Babylon's world is set up I have the chance to take her to a lot of worlds and different cultures, and I have quite a few ideas about things I'd like to do, places I'd like to take her, landscapes and ideas and attitudes I'd like to explore. So that gives me scope to do lots of different things and keep it interesting. I hope.\nBrandon Sanderson: I may not be the right one to ask on this, because the longest I've gone on a series is three books. I hope to be able to keep future series fresh and lively. It is certainly a challenge for the epic fantasy. With the Stormlight Archive, I'm planning a large, multi-volume epic, and I built in to it things I can do that I hope will keep it very fresh for me. I built in to it numerous magic systems. For me, I love great magic systems; it's part of what I love to write in fantasy. So if I have multiple types of magic to play with, and different characters who interact with it in different ways, it will remain fresh and new to me. And as long as it's fresh and new to me, I hope that it will be fresh and new to the reader.\nWhat role does humor play in your fiction in general and epic fantasies in particular?\nElizabeth Bear: I think humor is an essential leavening. I'm not by any means a funny writer, but when I started off I was a very very serious one. Very serious. Like this. Serious face.\nThese days, I've got enough control of my prose and narrative to let some wit in, and I think my writing is the better for it. It's often very black humor, but that's the sort that people in life or death situations rely on.\nWe are, after all, writing to be read. And people are not going to want to slap down their beer money for an endless series of doleful portentous seriousness. It's one-note writing, and just as limited as writing that can't shake off a breezy tone to really emotionally engage with a reader.\nIan C. Esslemont: Things can get pretty damned heavy and it's necessary to leaven the mix now and then. But beyond this, it is actually in humor and comedy that most of the overturning of tired literary tropes occurs.\nIf I may put on my academic's hat for a moment: humor is subversive. This subversiveness allows accepted wisdom to be mocked, hierarchies to be inverted, constructions to be deconstructed, and unexamined certainties to be interrogated.\nThere, enough polysyllabic puffery.\nIn short, humor is where you take the piss out of it all—including yourself.\nJames Barclay: I think [humor] plays a key role because, and I could refer you to answers above, it reflects real life. There is humor in everything, even in the most dire of circumstances and I think the author who ignores that is making a grave mistake. Humor makes things feel real; even dreadful humor will do that. Epic fantasy is a genre that suffers from a lack of humor and this does it no favors. Authors can get led down a path that allows no humor, only worth of deeds, complexity of treachery or whatever. Lack of humor weighs a book down, leaves it turgid and can bleed the life out of an otherwise brilliant work. I will always look for ways to inject humor and not just because I think it adds credibility but because readers need a chance to breathe and smile while reading a book that is dealing with stuff like death of loved ones and the end of the world and so on.\nTerry Brooks: Humor relieves tension. We see this in our own lives. When we are frightened or nervous, we say something funny. So if fantasy is supposed to approximate real life—which is what I learned from Lester del Rey—then humor has a place in fantasy storytelling. I use humor to define character now and then, as well. Magic Kingdom relies more on humor than Shannara, but that's just another example of writing more than one kind of story to keep from getting bored.\nErin Hoffman: Humor is so important and I think undervalued in epic fantasy. There is a tendency to get too caught up in the gravitas, and in so doing actually lose the verisimilitude that humor offers. Real characters are not, generally, Solemn Knights doing Things of Import for Virtuous Causes all the time. People laugh, they fail in stupid ways, life happens. Humor is also really, really hard to do well.\nJ. V. Jones: Being surprised makes us laugh. Humor comes when something happens that defies our expectations. Epic fantasy, with its battles between good and evil, its portentous omens and solemn knighthoods is a perfect breeding ground for the unexpected. Readers expect stateliness and gravity, so when something mundane, bawdy or just plain goofy happens it can take readers by surprise.\nTrudi Canavan: Humor has several roles to play. There is irony and sarcasm, which may point out the hypocrisy within society. There is the sort of humor that eases the tension in an action scene— which can be very dark humor. There is also teasing humor between characters, that makes them likeable, or a powerful and intimidating person more accessible.\nSteven Erikson: If there's going to be tears, better have a few laughs along the way. Besides, it's almost impossible to sustain the heavy stuff without ending up wanting to top yourself, or sinking into mawkish melodrama. A novel's like a drug; sometimes for everyone's sake you got to cut it with something innocuous.\nIn a more general sense, I use humor in my shorter fiction not just for laughs, but also for satire. It's a rut, taking things too seriously: sometimes you just have to cut loose, let the knives flash, and smile at all the bleeding (even when you're the one doing most of the bleeding).\nEd Greenwood: Humor should play a recurring role (at least in the form of \"human nature\" irony and jesting repartee, as opposed to slapstick, which should be used sparingly), or the epic fantasy runs the risk of becoming self-consciously serious (otherwise known as \"deadly dull\" or even pompous). Although humor, like sex scenes, resonate very differently with different readers, the ability to see what is amusing in life situations (and convey this sight, however poorly) makes for more well-rounded, believable, and therefore more effective writing. In short, the tale means more to the reader, and so will be more enjoyable.\nHumorless characters are valid elements (usually as villains or to be derided within the narrative), but an overabundance of them brings the same result as humorless writing: most readers will feel a subtle revulsion to the story, and will lessen their engagement with it. Any judgment they make of it will be lessened. (They will also feel distanced, or even belittled by the writer, if a story contains laughter that is unexplained, or jests that seem to the reader to be nonsense; the reader feels \"shut out of the party,\" and less worthy as a result.)\nK. V. Johansen: Humor in epic fantasy depends on the author. There are people who manage to write whole books that are devoid of humor, but I find that to be really satisfying to me, a book has to have some lightness in it, something that suggests when things are very bad that there is memory of better times and potential for light-heartedness again, or one starts to wonder what the heroes are fighting for—why don't they all go off and become hermits or something? Humor is part of that, having characters who have a sense of irony and a sense of humor about themselves. In my own writing, I try to let humor come in through the characters, through how they see their world and how they reflect on it and on themselves.\nPatrick Rothfuss: I think humor is a valuable leavening agent in any story. It helps readers make an emotional connection with the characters in the book. It helps keep a book from sliding from drama (which is good) into melodrama (which makes us roll our eyes, if not throw up just a little bit.)\nThe problem is, humor is hard to write. It's the hardest kind of writing, really.... And you can't fake it. If you try to be dramatic and you only half-succeed, you're still halfway dramatic. But you can't be halfway funny. If you're halfway funny, you're unfunny.\nGaie Sebold: It's fun to do. I like the idea that I'm making people smile; and I've always loved humorous fantasy. One of my best-loved childhood books was The Land of Green Ginger, and I think that was the first time I encountered that particular style of witty fantasy; I'm fairly sure it's been a major influence on the way I want to write.\nHumorous fantasy, at its best, is like a vitamin-filled cake—it makes it fun to read about big, serious issues. You have a good time and you're made to think, too. Sir Terry Pratchett is the obvious example; he's a master at it.\nBut not all epic fantasy is humorous fantasy, obviously. Humor has a lot of functions in storytelling generally, whether it's books, theatre, film...it acts to release tension, when things are tough. Humor in the trenches. If the audience is going along with the characters, feeling what they feel, getting worked up—a laugh allows you to blow off that tension, relax the muscles ready for things to start building up again. It can help define a culture; where one group of people might find it hilarious if someone gets their head cut off by an accidental swordswing, and someone else slips in the blood and breaks their nose, another group might find it deliciously amusing if someone turns up at court in the wrong color robe. It can show you more about characters; the kind of jokes they make and the circumstances under which they make them can tell you a lot, and there's something about characters joking under pressure which helps create a great deal of sympathy for them (depending on the jokes, obviously). Perhaps because the ability to 'laugh in the face of danger' is a trait we are generally hardwired to admire.\nRowena Cory Daniells: Humor plays an important role in everyday life. When the floods were sweeping through my home town last Christmas holidays someone was interviewed on the news and they said: \"You've got to laugh. If you didn't, you'd cry.\" Humor is a valve for releasing pent up emotion. It helps us cope with the very worst in life. As an epic fantasy writer, my readers don't expect me to produce a laugh a page. But there are moments as I'm writing when I chuckle to myself. It must sound really strange to anyone in the room.\nLynn Flewelling: Given the weighty issues we write about, some humor can really relieve tension and lighten the mood. It can also be a character element. My hero Seregil is a smartass at times, and witty at others; it helps define his view of the world. He takes his work seriously, but not too seriously. And it annoys one of the other Nightrunner characters, which delights Seregil. That helps set the dynamic between the two of them, even though they are allies.\nMichael A Stackpole: I think humor is critical in all fiction. If you're not writing comedy outright, it serves as a chance to breathe and escape the drama and pressure. I particularly love gallows-humor. Some of the remarks I put in the mouths of my characters would get me killed if I ever said them in real life. But humor and defiance have a lot of power in this regard. And, face it, getting someone to laugh while reading is proof you're triggering true emotions, which is great.\nVictoria Strauss: I don't do humor well in fiction (nonfiction is another story), so I don't attempt it in my novel writing. My books are all pretty much deadly serious. People who meet me after reading my fiction are surprised that I have any sense of humor at all.\nHumor in epic fantasy is welcome, where it's well done—Joe Abercrombie's First Law series, for instance, is full of mordant humor that's an essential part of the series' style and atmosphere. But I don't think it's in any way essential—Scott Bakker's Prince of Nothing series is wonderful epic fantasy, and it's as serious as a heart attack. The important thing, I think, is for writers to recognize their own strengths and weaknesses. Do humor if you can do it well, and if you can't, avoid it. Unfortunately, many writers don't follow this policy. There's way too much cheesy fantasy humor about.\nGav Thorpe: It's important to have moments of lightness and some fun. Quite often epic fantasy embroils a world in dark times, and just as in real life the characters will respond in different ways, many of them trying their best to see the funnier side of things. If there is no humor, one risks becoming unceasingly depressive, dragging the characters and reader into a hole from which it is impossible to emerge. Whether it is the characters joking or the author creating an amusing situation, a certain amount of light relief allows the reader and the characters to catch their breath and smile, before being plunged into the bloodshed and mayhem once more.\nPaul Kearney: I don't think that humor is ladled on too thickly in most epics. My own literary humor tends to be black, somewhat bitter, and sarcastic—spend time with real soldiers, or nurses to find out just how black and un-PC humor can be in the face of adversity. Slapstick can be left at the door, but there is also room for drawing-room wit. In any case, humor in epic fantasy is something that has to be judged carefully, and using it well is an art in itself.\nPeter Orullian: Well, first I'll say that I think humor writing is the most difficult, even more so than sex scenes—though badly written sex scenes are often hysterical. I've just recently spent time talking to some stand up comics; and man, if I thought trying to get published was hard. Sheesh! Humor has everything to do with timing; playing against expectations and personalities; and, to another degree, a character's insecurities. Then, you have to forget all that and do it intuitively, since I don't think you can say, \"Hey, I'll write this funny.\"\nI've written at least one character who, I think, is funny. He says what other people are thinking, and often when it should least be said, or most be said, as the case may be. It's part of his make up. And I think sometimes you laugh right out, and other times you think, \"Really?\" And that feel's authentic to me, since the funniest folks I know don't make me laugh every time.\nWhat I didn't do was think, \"Hey, this guy's the comic relief, he's the foil, readers will let off pent up worry when this guy says his line.\" Though I understand the classic use of the harlequin to give the audience a respite from the tension of the drama, I've not made any such overt attempt.\nI think in epic fantasy as a whole, humor is less often used. Could be just the brand of stories I pick up. Certainly there's plenty of gallows humor going on. And hey, that's good stuff. I won't say that a funny line in a tense moment doesn't maybe shine the brighter. I've seen that done to good effect in epic fantasy. But it's got to come from the right character at the right time, or else it feels like manipulation or just a false note.\nRobert V. S. Redick: In epic fantasy overall, humor done well can be a blessing, because it tends to bring what can be an overly large narrative canvas back down to a human scale. Most humor is interpersonal, not globe-spanning. But for that same reason humor is very easy to abuse. We've all had the experience of someone we don't know that well leering at us, elbowing us in the ribs, demanding that we laugh at their joke. It's irritating because it assumes a shared set of values where they may not exist. This happens in fiction as well.\nHumor is not just personal, though. It's brutal and unforgiving and famously fickle. What sends a thirteen-year-old boy through the roof may simply bore his parents (or his best friend of the same age). And heaven help you if your jokes are stale. I may just turn green and die if ever read another clever-youth-outwits-dumb-and-brutish-guard scene.\nWhen humor works, it arises naturally from the fictional circumstances. It can't just be imposed.\nBrandon Sanderson: In epic fantasy, we have the space and the time to deal with all emotions. I'm not saying other genres don't—there are a lot of good authors who are capable of covering a wide range—but we have a lot more space in epic fantasy. I think that humor is a component that's integral to a good story.\nI've had discussions with science fiction writers about this, and it seems like a lot of science fiction is really trying to engage the mind—and doing a very good job of it, if you look at great classic science fiction in particular. But I think that in fiction sometimes we downplay the importance of engaging the emotions. There are certainly great books across all genres that do this. I think we sometimes elevate the idea above the emotion, but I think that great books are about emotion as much as or more than ideas. If you don't have the full range of emotion, then there's going to be a hole there. So I think humor is integral and important.\nJuliet McKenna: For me, humor is one of the most useful colors on the writer's palette. It offers light and brightness to contrast with darkness and tragedy. It's also something that can convey an individual's true nature quickly and comprehensively; the jokes that someone tells and how they react to someone else's.\nIt's also vital for that realism that draws the reader into a story. Humanity has been cracking jokes since the dawn of time; humor can serve as a bonding experience, as a way to relieve tension, with more calculation, to undermine opponents or used more negatively, to exclude or to diminish those perceived as undesirable, for good or ill.\nKate Elliott: I would kill to be funnier. In fact, I have a task force at work pinpointing the location of Joe Abercrombie, after which a special operations team will swoop in, drain his blood, and return it to me for a much needed infusion. Nothing personal, Joe.\nDo you have any advice on dealing with violence when writing Epic fantasy?\nPatrick Rothfuss: I advise keeping a hatchet next to your writing desk. That way you'll always be ready to deal with violence when you're writing epic fantasy.\nMichael A Stackpole: Do enough to be effective, and keep it realistic. Do not do Hollywood sword-fighting. Combat is nasty and brutal. People scream and stink and beg and die horribly. It may be tough to write, but if it's not realistic, it doesn't have the seriousness necessary to drive a story.\nJames Barclay: Don't sugar-coat [violence]. Fighting with weapons, magic, fists and feet is incredibly brutal and has hideous results. I mean think, just think, what would happen if someone swung a sharpened bit of metal really hard into your side? It would cut straight through to your spine and dump your entrails and all sorts of other organs all over the floor. Or what would happen if someone hit you with a spell that increased your skin temperature by a thousand degrees? Brief unimaginable pain and then ashes. Dear god the stink of fear and blood and shit in a fight to the death must be over-powering. No wonder only strong and brave people do it. Every step they take in a fight is through the blood and bits and bodies of the dead. Every block they make merely delays their own deaths. The noise of struggle is terrifying and so very close. No TV screen between them and the intimacy of people desperate to live and equally desperate to kill. Every nick of flesh is a howling agony. And every solid blow crushes bone, severs limb from torso, slices artery and vital organ.\nNo wonder I choose to write about it rather than actually experience it. Don't sugar-coat it because it diminishes the acts of incredibly courageous people. And just like I did with that paragraph above, write it all in one go and don't stop til you're done. Read it back later. Don't plan it and don't over-edit it.\nTrudi Canavan: Be aware that readers have different tolerances for [violence]. You may reduce your audience by including extreme violence. But out of the trio of 'sex, drugs and violence', it's the one that's least likely to cause a stir, especially in conservative markets. And if that's the sort of story you want to write, don't hold yourself back. There's an audience for it out there.\nElizabeth Bear: Well, advice, no. I can tell you what I do, because random violence bores me: I treat it with the same rules as everything else I write. If it doesn't worldbuild, develop character, create or resolve tension (what some people call \"advancing the plot\")—out the door it goes. If it's boring, cut it. And violence can be as boring as anything else.\nTerry Brooks: Violence is a key element in epic fantasy. Wars and battles are almost always involved. Conflict is the bedrock of sagas and of the changes brought about by life. I do have some self-imposed rules. I am not a fan of graphic violence, so I steer clear of elaborating on blood and gore and body parts and the like. I'm not saying it doesn't work; it just doesn't work for me. My emphasis is on issues. How do hard choices impact us? What is the nature of our responsibility to others? How do we balance right and wrong when it isn't always clear which is which? Violence is a part of resolving those dilemmas, but I don't want it to be the focal point. Related to this stance might be one other rule I try to follow. If there is a scene in a book that I find I cannot or don't want to write, I make myself do it. Usually, it becomes clear that the scene is crucial to the story, and you can't let yourself be backed down by the difficult or the challenging. Writing about violence frequently falls in this category.\nRobert V. S. Redick: Treat violence with the utmost humility. Talk to people who've lived through it, as participants or victims or both. Or at the very least read their words. It's a soul-changing horror to experience, and I don't like books that pretend otherwise. Yes of course it's a part of the entertainment. That's fine; there are profound reasons for its fascination. But that doesn't mean we have to lie about its deeper consequences. We get desensitized enough through TV and video games without our books chipping in.\nIn fantasy, it's the after-the-battlefield costs that tend to get downplayed or denied. The psychic wounds, the lingering agonies: those are much harder to dramatize, and that tempts us to omit them, or give them token attention. I'm determined never to do that.\nLynn Flewelling: Again, it has to advance the plot. Otherwise it's just gratuitous. It should be well thought out, especially for things like swordplay or archery, and not go on and on in endless, excruciating detail. I certainly have violence in my books, and it's an interesting element to work with. If my good guys are doing it, is it blameless? Do the bad guys have to be shown to be bad through violence? I tend to work with the grey areas, rather than having everything black and white. Sometimes violence may be necessary, but it doesn't have to be applauded.\nIan C. Esslemont: Violence in fantasy, epic or not, gets more attention than it deserves. If it is justified by the needs of the story then it has earned its presence. If not, then it is just shallow gore or juvenile pandering. It must serve the thematics, not just splash prettily.\nDavid Anthony Durham: Writers' approaches to violence are going to vary—and should vary—depending on the tone of their work and the audience they're writing for. The graphic viciousness of The Steel Remains makes sense because Richard K Morgan's world is going to be graphic and vicious. Most readers will know that going in and want it. Readers of George RR Martin have to know that people will die—or be maimed—in horrible ways in every book. He wouldn't be being true to his vision if the reader didn't have to cringe at certain scenes. That's a very different vibe than the stylized action of RA Salvatore, and it should be. I don't want everything I read to have only one note to it.\nIn my work... well, I'm not as graphic as Morgan, or as callous as Martin or as lightning fast as Salvatore. I'd like to think I'm somewhere in between. When a certain leagueman gets his head sliced half off I expect a reader to see the image vividly in that moment. I don't want to overdo it, but I try to write violence with the sensory detail I'd write a description of something beautiful.\nRowena Cory Daniells: This comes back to the earlier question about killing a much loved character. Violence, like sex has to happen for a reason. Both have to drive the plot forward and reveal something about character. In real life, I'm a softie. I can't watch the news if children have been hurt. I find it too upsetting, so I steer clear of anything that would upset me like this in my books. Having said that I feel a certain level of violence is necessary in a fantasy book for authenticity.\nIn today's society we are cushioned from the reality of our actions. Sex doesn't risk pregnancy, birth (generally) happens in a hospital, pain is something to be fixed not managed with fortitude and we fully expect death to happen when we're old. At the same time we experience a surfeit of vicarious violence and death through news programs, movies and games. But it is all one step removed, so it loses its impact.\nUntil recently, people saw violence every day and you never knew when death was going to take someone you loved. When my mother was a child, a simple cut could lead to blood poisoning and kill you. This level of danger changed the way people viewed their lives. Today, if we look into Australia's convict past we are shocked by the level of punishment for simple crimes. But that was accepted then. Violence and sudden death were a normal part of life. Actions should have consequence, the more powerful the consequences, the more powerful the story.\nPaul Kearney: Make it real. You're dealing with mass violence, more often than not, and if you don't want to be explicit about it, that's fine—but you must, must show the consequences of violence, no matter how ugly, otherwise you're being dishonest with yourself and the reader.\nK. V. Johansen: Part of the tension and the growth in this sort of story comes from the heroes being pushed to the limits, physically and emotionally, and usually the political or cultural setting ends up being one in which violence is always on the verge of breaking out, or is the means of rule. I think it's important to keep it from becoming violence for the sake of violence, though. There's a mystery series I like, that always has one sex scene in it, about the middle of each book, often quite arbitrarily, with no relation to the plot or anything that's really going with the characters in the story. They start to read like they were stuck in as afterthoughts to meet some quota. In writing epic fantasy, you can get sucked into thinking that you need to have some set amount of violence, to make it \"authentic\" and \"gritty\", but if that's all it's doing, it's just titillation, just pornography, something to make people look. The violence should be there because it's necessary, because battle and war, or furtive clashes in the night, waylayings by bandits, capture and torture, are what is arising from the story, because in this world at this time, that is what is happening.\nFor battles to be believable, it's important to study a lot of history, and military history. You need to develop a sense for tactics and to consider the strategies the leaders of the various forces will have in mind, in order to bring them together in plausible ways that give you the outcome you want for the plot. You need to understand the conditions people fought under at the equivalent time (in terms of technology) in primary world history; you need to understand how the weapons worked. At the individual level it gets harder, since I'm not someone who's into martial arts and haven't bashed even imaginary enemies with a wooden sword since I was a kid. I have a secret envy of the people writing fantasy who have that background. I do a lot of stopping and thinking and waving my arms around (dangerous in my small study—I cause bookquakes) to figure out, if A is here and B jumps them from over here, can they ...?\nEd Greenwood: Violence should shock.\nIt should be swiftly, simply told. Violence shouldn't be \"over the top\" or the reader will laugh (to distance themselves from the horror, almost always at a point where the writer doesn't want the reader to laugh) or be desensitized (often due to repetition; simply put, the butchering of the forty-third princess never has the same impact as the slaughter of the first one—and still less with orcs).\nIn terms of writing style, one pitfall that should always be avoided is the writer over-explaining every detail of a fight, as if they're an artistic director or movie director trying to set up a shot. If the prose used to describe the fight slows down (due to too much detail) so that the frantic energy of the fight is lost, the writer has failed.\nBrandon Sanderson: I can't really give advice unless I know specifically what type of book you're writing. For example, George R. R. Martin's A Song of Ice and Fire and David Eddings's the Belgariad are both in the same epic fantasy subgenre by strict delineation, yet these two series treat violence in wildly different ways. What George has done is made the violence more . . . brutal.\nThis is going to be kind of a weird metaphor, but stick with me. If you've seen the Matrix films, there's a scene in one of them where Agent Smith leaks out of the Matrix, takes over a guy's brain, and attacks Neo in the real world. This is a shocking fight, and I found it very interesting, because it's this bloody, brutal, trying to gouge out each other's eyes, beating each other's heads against the wall, blood and stumbling, sort of fight. That's one type of violence, and it was very shocking because the rest of the violence in the Matrix series is very superhero-action, where it's action more than violence.\nYou can have everywhere in between. It depends on what effect you want to have on the reader and on the characters. Honestly, I generally do my fights more like the inside-the-Matrix fights than the outside-the-Matrix fights, because I want to write beautiful action sequences, not scenes of absolutely brutal violence. But that's not to say that you can't do both.\nVictoria Strauss: I think violence in epic fantasy is like sex in epic fantasy. It's part of life (especially in non-technologically advanced societies), so it's got to be included; avoiding it or glossing over it is cheating. But it should never be included for its own sake—only insofar as it enhances the story and advances the plot. It shouldn't be like those gratuitous car chase scenes in action movies—i.e., there just for the special effects, dragging on so long that the reader's eyes glaze over.\nBeyond that, it depends on the book and the writer. Some plotlines will inevitably include more violence than others, and some writers just want to tell brutal stories. There are few taboos these days—about either violence or sex—and writers have a lot of freedom to choose to how much violence to include and how to present it, and really don't need to censor themselves. Again, though, I think it's important to be aware of your strengths and weaknesses. If you're not good at writing battle scenes, find another way to present that part of the story. If you are good at battle scenes, don't overindulge yourself. If you're not comfortable writing graphically violent scenes, don't feel you have to—but if that's where your style and passion takes you, go for it. Just as long as it serves the story.\nPeter Orullian: I've spoken with a lot of writers recently on a similar topic, which is: Do you self-edit? Are there things you don't write about? Or is it all up for grabs? No censorship in art!\nHere's the thing, it seems to be fashionable to be called a writer of \"gritty\" fantasy. Some say it's more realistic. I think I understand what this tribe is saying, but it does make me wonder about the use of those terms in proximity to each other, ya know: \"realistic\" and \"fantasy.\"\nOne of the ways writers hit on the \"gritty\" thing is violence. Now, it's hardly possible to write a fantasy without some violence, but the question really has to come back to: What is necessary?\nIf in a fight a guy is disemboweled, how far do you need to go to describe that? Steaming guts that stink of undigested cornbeef and stomach bile? Not sure if all that is necessary. And after all, I'm rather fond of the notion that the reader is co-creating with me. Meaning, I need only paint in the most salient details. And the reader will supply a great deal from his or her own imagination. I get how theoretical and high-minded that might sound, but I still think it's true.\nIt's a place where \"less is more,\" which isn't something you'll often here me say. I think it's a tired, over-used phrase. More is really usually more. But with writing, the sparing detail can speak volumes. I'm still working at this, as are most writers I know.\nAll of which is to say, you don't need to shy away from violence, just make it matter, and then chose well what you don't say.\nJuliet McKenna: The writer's touchstone should always be exploration rather than exploitation. The violence must serve the story, not merely be gratuitous titillation. It's best used sparingly in most cases, lest the impact on the reader is dulled by repetition or disgust. But as with humor, violence is an integral part of humanity's make-up and should always be an available color on that writerly palette. Similarly an individual's propensity and reaction to violence will offer key insights into their nature.\nKate Elliott: I think writers shouldn't flinch from writing violence. One has to be cautious, though, about using violence as the only way to build stakes, tension, conflict, and emotional reaction. It can get boring. Vary your palette.\nI would wish writers to be honest about the degree of violence war inflicts on the actual combatants, and I particularly would wish writers to be honest about the degree of violence that war, empire, and political, religious, and economic conflict inflict on non-combatants and on the fabric of societies. We don't need to look to the past for examples of this; we need only look at the news today.\nYet at the same time, violence needs to be seen as part of a larger picture. To use one example, I've read/heard both writers and readers comment that epic fantasy isn't really about, doesn't really \"include,\" female lives unless they're rape victims, sex workers, mothers of heroes, or nubile young women waiting to be married off for dynastic or economic alliances—in other words, purely about sex, which frankly to me suggests a failure to understand the profound and far-reaching effects war and the various sorts of destabilizing conflicts have on the societies they touch as well as ignorance about the lives women actually led in the past in world history. The way history was approached and written in decades past rendered many lives virtually invisible, but that does not mean those lives weren't woven into the fabric of the events of their day or that people we may think of as passive, ignorant bystanders to the history of Men did not have a measure of agency and wit or even a great deal more than that in terms of economic or political clout if they were in the right social group.\nThere is, for instance, an entire subgenre of little stories written in the European Middle Ages in which clever women fend off the unwanted attentions of strong, armed men by wit and intelligent argument alone. The famous Aristotle, so very respected and influential and of course strikingly sexist in his view that women were literally physically, intellectually, and spiritually inferior to men, was also mocked and reviled in the Middle Ages, not least for what was recognized by some at that time as his misogyny—and this by clerical writers who were themselves part of a misogynistic culture. Cultures wrestle with their own cognitive dissonances; they are not monolithic, static, and unchanging. Indeed, they contain multitudes.\nGaie Sebold: I would say that it should matter. There's a lot of stylized violence around, especially in film; and I have to say I enjoy it myself, so I don't want to come off as a hypocrite; characters who can slash people into sushi while doing somersaults are fun, there's no denying it. But if you're going to kill people in fiction, you should be aware of the fact that that is what you're doing, and not treat it as though your characters were just knocking coconuts off a shy in a fairground.\nOh, and when people get hurt, they should hurt. If your character is a supernatural critter who shrugs off injury in seconds, that's one thing—but even supernatural critters should feel some effects when they've been beaten to a pulp. Violence is painful, and not just at the time. I'm lucky enough never to have actually been beaten to a pulp, but I've done some contact sports and some martial arts and broken an ankle and you don't just get up whistling and drink your beer. Well, you might, but you'll be groaning and cursing and swelling and so forth at the same time. For some time afterwards, too.\nGav Thorpe: I've taken different approaches in different venues, but only within a certain frame of reference. The violence I portray is realistic and bloody, because I want to show the grit and sweat that lies behind every gallant act or ignoble deed. Whether it is an elven prince fighting for his crown or a poor Askhan legionnaire, a life of war is harsh and unforgiving. To romanticize that side of an epic story is somewhat disingenuous, ignoring the reality that high ambitions and grand schemes are almost always at the expense of life and comfort. It helps a reader to understand the import of the epic tale when they see the effort—literally the blood, sweat and tears—that are required to make it a reality.\nBearing that in mind, one should always remember to keep the fantasy in epic fantasy. There are many ways to wage war when your characters might have dragons or powerful wizards, or in the case of Ullsaard in The Crown of the Blood, a giant cat. To make a brief foray into sci-fi, it's a bit like the construction worker on the Death Star in Return of the Jedi. You don't see them getting annihilated, only the bad guys, but when worlds change even the innocent get caught up in the fall-out. If one simply skips over this brutal reality it is a disservice to those unsung masses slaughtered in the name of your heroes and heroines.\nContext is also important with violence. One should not get so caught up in the hack-and-slash and eviscerations that the characters simply become vehicles for the action. They are emotionally part of the violence, whether loathing or enjoying it, and through their actions and reactions the reader becomes involved. The actual level of detail that is acceptable will vary from reader-to-reader, but I err on the side of the audience being pulled into the action with the roar of defiance, the thud of axe into flesh and the stench of death. To sanitize the violence risks divorcing the reader from what is happening, making them a dispassionate observer rather and an involved participant. I feel it incongruous for a writer to labor love and attention on a victory banquet scene or the details of a coronation when the reality of how those scenes came about is glossed over.\nJ. V. Jones: The ability to craft tight, well-choreographed fight scenes is a gift few writers possess. The more real fights you've seen, the more you realize that Hollywood movie fights are pure fantasy. You know the type: men grunt manfully when they take a punch and no one gets hurt. I grew up in a pub in England, and every weekend there would be fights. Violence in real life is shocking. It starts out of thin air and ends quickly. If you put that reality into your writing and carefully map out the movements of your characters—checking to see those movements are authentic—you'll be ahead of the game.\nSteven Erikson: Make sure every act of violence described has consequences, and don't be afraid to be brutal and brutally honest in those consequences. Violence is also traumatic and psychologically scarring, and it breeds its own, making people cold-hearted and mean-spirited.\nTry not to step over too many bodies on the way to the story's end. ('Millions died, but wait! There's millions more!'). Sometimes slaughter reads like an easy way out; sometimes it reads like it's just a word. Sometimes you sense that the author really doesn't give a fuck about people, especially those meant to be disliked; sometimes it feels like the author doesn't even like people.\nIf you want to be seriously accurate and technical when writing fight scenes, avoid the SCA and talk to re-enactors; take up fencing or some other martial art. Take up ice hockey and find out what a high-speed body-check against the boards feels like, then remember those feelings the next time you write about some hero getting thrown into a wall and jumping back up ... physically, we just don't work that way. Everything hurts, everything is jarred inside, you feel sick as a dog and you might even be thinking it's Tuesday and you missed the BBQ. That said, I have no problem with fantasy novels that skim over technical details in fight scenes, if fighting is in no way central to the story: it's down to the author's own interest.\nFinally, be not gratuitous. There's too much of that shit everywhere as it is.\nAny parting words?\nElizabeth Bear: May the road rise to meet you and the wind be ever at your back.\nTerry Brooks: I am grateful every day that I get to write fiction for a living. I have never wanted to do anything else. Even the most difficult times are pretty good. Just goes to show—sometimes the magic works.\nPatrick Rothfuss: Inculcate. And sparge. Sparge is a great word...\nEd Greenwood: Fantasy is an individual thing; what wows me might not grab you. This is a Good Thing, this variety of tastes that gives us many writers and tales rather than just a few, or \"one perfect one.\" Read widely. Don't confuse the opinion of someone else with universal truth; sample writers of all stripes, and books derided as \"bad\" or \"ho-hum\" as well as those held up as shining triumphs. Choose your own heroes. Taste the true richness of the entire wine cellar, not just sipping endlessly from the first bottle ever handed to you. Variety is indeed the spice of life—and every tale devoured enriches in you in some way, even if it's just to repudiate what you disliked. Go forth, and read, taking time for silence amidst all the noise and bustle of everyday real life—and be enriched.\nJames Barclay: Good-bye.\nSee, that was one of those bits of humor I was talking about. Not terribly funny but I bet it gets a good number of smiles and that can't be bad.\nPaul Kearney: I wish fans of epic fantasy would be less worried by the thickness of a book's spine...\nGaie Sebold: Writing fantasy is a privilege and a delight. It's also hard work and makes me swear a lot, but it's the best fun. I feel very lucky to live in a time and a country when I can read and write as much of it as I can fit in, and where the main barrier to publication is whether I'm good enough, not whether I'm female or what I choose to write about. I know there are people who wonder why one would spend time on these things that 'aren't about the real world,' but my answer would be—if you don't think it's about the real world, you aren't reading the good stuff—or you aren't reading it with your eyes all the way open.\nMichael A Stackpole: Epic fantasy is probably the longest-running storytelling tradition known to humanity. We can point to Homer's work and know there are epic stories that predated his work, and likely have been lost to time. So anyone denigrating epic fantasy as escapist tripe is a) out of touch with the roots of storytelling and b) likely hasn't read any of the good stuff. And if after reading the good stuff, such a person still holds their ridiculous opinion, I'd be happy to explain why they are utterly and completely wrong.\nK. V. Johansen: In some form or other, epic fantasy is always going to be around, because we need stories that tell us we can go out and strive to achieve something greater, and (if we survive) come back changed. (And, I suppose, if we don't survive, still have honor for making the attempt.)\nJ. V. Jones: It's a great time to be writing epic fantasy. The field has moved beyond \"lets all write in a quasi-Medieval setting\" and now welcomes elements and inspirations from many cultures and historical periods. Write on a large scale, keep your characters \"human\" and go do something new.\nGav Thorpe: There is a fine line to tread between epic fantasy and soap opera. The reader must always have a sense that the story is heading somewhere, even if it might take three or five or ten books. With large casts of characters and a whole world as a canvas there comes a risk that the narrative starts to meander as sub-plots and minor characters are explored in increasing detail. If at the end of the saga these characters and sub-plots have not contributed to the final result, as interesting as they may be to read along the way, then I feel like it has become filler rather than story. A writer needs to keep a clear view of where events are heading, and if they take the odd diversion along the way that finishing point must be closer by the end of each scene, even if the impact is not to be known for some time to come.\nTrudi Canavan: I find the sub-genre labels to be a bit unsatisfactory sometimes. People have a hard enough time deciding what where the lines are between fantasy and other genres, let alone where they are between sub-genres within fantasy. But I can see the labels are useful for when you're recommending book to other people. If you like this kind of fantasy, you might like that book/series. And perhaps they're also useful to describe the type of fantasy that's trendy at the moment!\nJuliet McKenna: I'm looking forward to the day when epic fantasy fans need not justify their tastes or explain the strengths of the genre. Crime fiction has made that step, not least thanks to high-profile television series showing its depth and breadth. Let's hope HBO's A Game of Thrones starts epic fantasy on the same path.\nPeter Orullian: Only that this is a very exciting time in the genre of epic fantasy. Think about the number of authors working in the field right now. And for the most part—different from the glut of horror books we got in the 80's—these writers are doing exceptional work. I'm a babe in the company of these giants, and just glad to be a part of the conversation. But I'll add my voice to the chorus, for sure.\nErin Hoffman: Non-gaming folk don't often want to hear about this kind of stuff, but... There is a very palpable sentiment in both the fantasy and horror communities (and SF) that video games especially are the enemy of genre, because they are somehow \"eating\" genre book audiences. This is manifestly not true, but the perception remains.\nEpic fantasy was present in video games almost at the dawn of the video game itself. The earliest prototypes were physics simulators because the math was more interesting, but the instant that games became expressive, fantasy, and in particular epic fantasy, came in. Some of the biggest game franchises are epic fantasy franchises. Final Fantasy is probably the most well known, and is straight-up epic sword and sorcery, focusing entirely on mythic monsters of ever-increasing size and the spiky-haired hero who destroys them with a giant magical sword. The very notion of \"a final fantasy\" (by which they mean the last great conflict of a given world—every Final Fantasy takes place in a different world) is intrinsically epic.\nDungeons & Dragons is the other extremely familiar epic fantasy game franchise. Its mechanics originally grew out of baseball simulators, but now represents not just a continuing franchise but a genre. In the early 80s when the first computer-based epic fantasy games showed up—series like Wizardy and Bard's Tale—there was actually a lot of resentment about the single-player evolution (or devolution depending on your camp) of RPGs (roleplaying was supposed to be social!). And yet now the single-player epic fantasy RPG is its own art form. The Phantasy Star series, which (again depending on your angle on the world) might be space fantasy but certainly seems to be epic fantasy also, is one of my all time favorites, likewise the Shining Force series. I would also go to bat for Ecco the Dolphin's status as epic fantasy.\nTalking about Final Fantasy, Phantasy Star, and Shining Force brings up another dynamic of epic fantasy that we don't often have too much exposure to in the western world, which is the huge market for epic fantasy in Asia. Before massively multiplayer online games reached the mainstream here in the west, millions of players were playing games like Lineage in Korea, Japan, China, and southeast Asia. Lineage is absolutely an epic fantasy property in the tradition of Tolkien, and Asian properties beyond Final Fantasy have been heavily influenced by Tolkien's elves especially. In the east, and in particular in South Korea, more people play MMOs than have cable television, which is a uniquely interesting dimension of their cultural experience of epic fantasy. Now that the west, with World of Warcraft, has caught up to something along the lines of eastern awareness of online games, we have fusion properties like Aion by NCSoft, which is a flying islands epic fantasy game with winged elves and a big dash of steampunk Victoriana.\nI think it's a natural evolutionary process for massively multiplayer online games to become the predominant medium for epic fantasy in games (though the Japanese single-player RPG is still kicking along—the Tales of Symphonia series comes to mind, and White Knight Chronicles). It plays to our desire to be a *part* of something that is epic. The fantasy of \"epic\" is a fantasy of the individual, and when we read we imagine ourselves as that individual and having that epic experience, so it's natural that we should be drawn to the agency, validation, and connectedness that MMOs give us in our fantasy. This has also been true since the very early days of the online game industry—almost all of the text-based online multiplayer worlds, the predecessors to games like World of Warcraft, were fantasy-based.\nRobin McKinley: In parting, to reiterate my excuse for joining this discussion at all: that all stories are Story, and the rest is details. To that I would add—emphatically—that you need to tell the story that wants you to tell it and worry about definitions later. If it's a good story and a good read, it doesn't matter if it's Epic Fantasy or a sonnet. (All right, except in terms of the probable amount of money for your advance.) I decided it would be tactful not to add my spurious two cents on aspects of epic-writing that I've never had to deal with, but I'll mutter sotto voce here that relationships between characters and settings and the role of humor must straightforwardly be true to that particular story and that whether the story is epic fantasy or not is incidental.\nPerhaps not quite incidental. The epic fantasies that I as reader personally find a slog are the ones without humor. Beautiful writing, excellent characters and a breathtaking plot will get you only so far with me.\nAbout violence: the older I am the more I hate writing violence, and one of the aspects of Peg II that is really oppressing me is the need to write some more battle scenes—and kill off a well-loved-by-me-anyway character or two as well.\nMy experience however suggests that—at least if you suffer self-confidence problems similar to mine—you may be better off deliberately and consciously not thinking about what the story you're writing is, because you might decide that it's too difficult for you and lose your nerve. (Or second-guess yourself. Nobody was rewriting fairy tales when I wrote Beauty, and I almost didn't bother to send it out: no publisher was going to be interested, because everyone knows how the story of Beauty and the Beast ends.)\nAny writers looking for tips out there, I repeat, as I have said in many other contexts: write what you have to write. Think about everything else later.\nBrandon Sanderson: A lot of people like to refer to the epic fantasy genre as \"fat fantasies with maps.\" I've heard that before. The first time I heard that it made me pause and start thinking about it, because that's not how I look at the genre. And then I thought, well, how do I look at the genre? I realized I don't really look at it as epic fantasy or not epic fantasy. I look at it as books that I love. I incorporate the themes that I love in books that I love and try to write books like the ones I love and yet have my own new thing to them.\nSo I don't really sit here and think, I'm going to write a fat fantasy with maps. I think, wow, I love how Scott Westerfeld did maps and art in Leviathan, and can I apply something like that to the fantasy books I'm working on? Or, I love how Watchmen incorporated both text and visual art in a really interesting package. Can I apply that to my writing? I look at what people are doing with interesting magic systems or interesting casts of characters and say, can I use that? And the result that comes of that is something people call epic fantasy.\nBut I'm just trying to write awesome stories. It doesn't come down to a conscious decision of length, or that a fat fantasy has to have maps so I put maps in—that's just not how I regard it. This is the genre that turned me into a writer. This is a genre that I have always absolutely loved, and that has sucked me in more than anything else. So that's what I want to do.\nKate Elliott: To be honest, I find that too much of epic fantasy and concomitant opinions about how societies of the pre-modern era function is based on historiography that is 30 years old. For instance, depictions of European medieval-like women and indeed of many medieval-like societies in some fantasy is woefully outdated. This outmoded historiography does not just pertain to women, it pertains to gender, it pertains to the church, and—because I've been focusing my comments on the European Middle Ages—it pertains very much to non-Christian and non-European cultures which were and are societies just as complex and advanced and layered as the European template so much fantasy defaults to.\nWe can tell new, interesting, and exciting stories if we extricate ourselves from old and increasingly tired assumptions and expectations about life in the past, and if we expand our horizons. I would still love to see more ethnic and cultural variety. And I would hope writers are giving thought as to whether their books pass the Bechdel Test.\nHaving said that, I think there are a lot of compelling and fascinatingly diverse writers working in the genre today; it's an exceptionally rich and rewarding time to be reading epic fantasy.\nDramatis Personae\nLou Anders is the editorial director of Pyr Books and the editor or co-editor of such anthologies as, Swords & Dark Magic and Masked. www.louanders.com\nJames Barclay is the author of the recent (in the US) Demonstorm and the forthcoming (in the UK) Rise of the TaiGethan. www.jamesbarclay.com\nElizabeth Bear is the author of such novels as The Sea Thy Mistress and the forthcoming The Tempering of Men (with Sarah Monette). www.elizabethbear.com\nTerry Brooks is the author of Bearers of the Black Staff and the forthcoming The Measure of the Magic. www.terrybrooks.net\nTrudi Canavan is the author of The Rogue and the forthcoming The Traitor Queen. www.trudicanavan.com\nDavid Anthony Durham is the author of The Other Lands and the forthcoming The Sacred Band. www.davidanthonydurham.com\nIan C. Esslemont is the author of Stonewielder and the forthcoming Throne and Orb. www.malazanempire.com/site/authors/2-esslemont\nLynn Flewelling is the author of The White Road and the forthcoming Casket of Souls. www.sff.net/people/lynn.flewelling\nEd Greenwood is the author of Elminster Must Die! and Bury Elminster Deep. en.wikipedia.org/wiki/Ed_Greenwood\nJohn Jarrold is the founder of the John Jarrold Literary Agency. He has edited for such publishing houses as Random House, HarperCollins, Pan Macmillan, Simon & Schuster, Orion/Gollancz, and Time Warner. www.johnjarrold.co.uk\nN. K. Jemisin is the author of The Broken Kingdoms and the forthcoming The Kingdom of Gods. nkjemisin.com\nPeter Orullian is the author of The Unremembered and the forthcoming Vault of Heaven Book 2. www.orullian.com\nRobert V. S. Redick is the author of The Ruling Sea and The River of Shadows. www.robertvsredick.com\nPatrick Rothfuss is the author of The Name of the Wind and The Wise Man's Fear. www.patrickrothfuss.com\nBrandon Sanderson is the author of The Way of Kings and the forthcoming The Alloy of Law. www.brandonsanderson.com\nGaie Sebold's first novel Babylon Steel is forthcoming from Solaris in January of 2012. gaiesebold.weebly.com\nMichael A. Stackpole is the author of At the Queen's Command and the forthcoming novelization Conan the Barbarian. www.stormwolf.com\nGav Thorpe is the author of The Crown of the Conqueror and the forthcoming The Crown of the Usurper. mechanicalhamster.wordpress.com\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/epic_interview2/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Something Greater: An Epic Discussion of Epic Fantasy, Part 2 by Jeremy L. C. Jones"}