{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Maggie Clark", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "i82bY/jyAf2RCFKA0Hb9kUdXLI4=", "id": null, "license": null, "comments": "", "raw_text": "5300 words, short story  A Tower for the Coming World  When a liquid-oxygen tank explodes at the summit of his space elevator, Stanley Osik is in Poland burying his father. His hands prove poor workers in the coarse-loamy soil on his grandmother’s acreage outside the city of Lublin, but even as he reaches its iron-clotted depths, Stanley does not regret refusing a neighbor’s offer of a shovel. Stanley and his father, Henryk, shared this much: a belief in getting their hands dirty, even if to others the effort seemed excessive. Stanley simply draws the line at getting the rest dirty, too—and so went a thousand ancient arguments between father and son. Now Stanley cedes to his father the final word. Commits him to the same world that Henryk spent half a lifetime destroying, mine after mine after mine. Remembers, and forgives, the mocking finger pointed at any rare-earth metals he used to build from the ground to the sky. Let Henryk have the dregs of the Earth now, Stanley thinks. The Earth offers Stanley so little anymore.  Stanley’s earpiece is up at his grandmother’s cottage, so he misses news of the disaster in the brushfire heat of its first moments: The Russian shuttle exploding on his elevator’s barge-like plateau. The nanotube tether shattering, with cascade-failures all down the line. The civilian death count rising, and with it the number of countries drawn into the aftermath. The rumors of terrorist sabotage flooding the net and sending his stocks into a tailspin. All this through an earpiece with a 92%-accurate translator, the latter of which delights his ninety-seven-year-old grandmother, Rozalia, so much that Stanley doesn’t give a second thought to leaving it behind. His work at SKOK Enterprises is endless, so he reasons that his work can also wait—at least until he’s made his peace with his father’s last remains.  Stanley’s senior staff is prepared, too, to act swiftly in his absence. While the horror-struck world watches videos of the destruction on repeat, and while Stanley pauses in the two PM sun to wick sweat from his brow, one of his assistants, Maurice, is already drafting press releases suitable for all major social media. Across the open-concept office, Evanesca and Irene have the deceased employees’ files open: Evanesca to assess how the company could add to each compensation package; Irene to flag anything a formal investigation might take for signs of an inside job. Meanwhile, security teams from every SKOK property and subsidiary lot are checking in with all-clears, and factory workers have been sent home to prevent further accidents while processing the news. Analysts from the Johannesburg office are pinging private lines to guarantee recovery models before the market’s next opening bell. R&D is dusting off material-acquisition contracts to begin sourcing rebuilds and repairs.  Still, some in the public sphere will not be appeased until they hear from Stanley himself. The media networks in particular are itching to see his face, hear his voice, and debate the extent and implications of his grief when he discusses a disaster sure to set back deep-space colonization, extrasolar travel, and his business, of course, for years. And he will let them. He will play that part in his own, well-oiled machine in due time.  For now, though, Stanley holds his father’s biodegradable urn over the misshapen, handworn hole of leached loam and rust, and speaks words that feel dead to him, but which to his father always meant life—true life—itself. And when the urn is well and truly buried, with its spare-leafed sapling of pendunculate oak protruding from an eco-mixture set to counteract the high pH- and sodium-levels in his father’s remains, Stanley stands and looks to the sky. So clear in this part of the world. So full of the promise of rising, and rising, and never coming down. So bereft of graphene particulate, falling like ash from his 12-mile-high masterpiece over Marine Station Six, half an ocean away.  Rozalia has the kettle on, and music, by the time Stanley returns and washes most of the dirt from his fingernails at a faucet out back. The earpiece, having mystified Rozalia with its repeated, frantic buzzing in his absence, has been consigned to the far side of a breadbox on the counter, well out of sight. In consequence, Stanley manages whole minutes on her old, long-timbered floor before he notices the damned thing, and realizes what its hundreds of messages will mean for his empire. His own plans of escape. Whole minutes in which he can still savor the smoke-smell of syringol from wood fueling his grandmother’s potbellied stove; and sit down to little slices of yeast cake with rose-petal jam; and pause with her to listen to a recording of one of her violin concertos, from when she and the world were ever so much younger. When the thought of staying here still seemed bearable, though all the stars in the sky called out to him for more.  —Jak poszło? His grandmother asks between bites. There was never any question of her following Stanley along the hillside, to stand in the midday heat while he dug his father’s grave. She is hardy for her age, but indifferent: her son’s terrible dealings—the men and women ground down with the metals and minerals of his industry—a weight upon her, too.  Stanley chews over the simple words, still so far from his immediate comprehension.  “It went well,” he says at last. “Henryk will make a good tree.”  And his grandmother nods as if understanding, though the earpiece is still on the counter. Though, within minutes, the two of them will part and never speak again.  The neighbor who offers Stanley a shovel is Karol, son of Maciej, a squat, barrel-chested man who will inherit Rozalia’s estate when she dies in the following year. Karol understands the gulf between fathers and sons, which is why he is mystified when his neighbor’s grandson declines a tool with good heft and a sharp edge, to help finish the job. Karol is just over a third of Stanley’s age, and takes classes at Maria Curie-Skłodowska University. Earth sciences, his father thinks, to help their property survive the extremes of climate change: twelve tornadoes ranked F2 and higher in the last year, and floods and landslides like the country has never known. But Karol studies aerospace engineering, and only keeps geology texts at the fore of his e-reader in case his father ever thinks to pry.  When his friends ask him, Why aerospace?, Karol says it’s for the girls—so many in cutting-edge tech to escape the last vestiges of small-town life. Mostly, though, he means one girl: Marta, who has long brown braids and visions of working astronautical repair at the Lagrange-point waystation on the far side of the Moon. She comes from a town where the saying still goes, “I caught my husband on a baby,” but Marta thinks 10.4 billion people is enough. When friends from home visit for Bakcynalia, they say, ah, you’ll change, but she replies, no, I’ll leave—and in a voice that means it, too. Karol watches from across the beer tent and imagines leaving with her—the song festival, the city, the whole tedious world.  But Karol also has private reasons for choosing the field. Once, when Karol was a boy, he saw a twister at a distance—the way it peeled a barn roof from the building’s old-stone walls after whirling shingles up into its yellow-gray funnel—and marveled at the casual brutality of its passage over the landscape. That’s nothing, his mother told him, when Karol said that he had never seen anything so strong. On Jupiter, Ewelina said, the windstorms move almost twice as fast as anything on Earth. And on the sun? Pah! When I was a girl, the power went out for months. Koronalny wyrzut masy. End of days. Planes could not fly, satellites would not go. We lived by the generator and the wood stove with your father’s family. It’s how we found ourselves out here at all.  His mother had meant this speech as encouragement, thinking her son frightened by the tornado, but Karol only wondered then why humanity even bothered, when the planet showed no interest in its survival, and the universe on whole sounded worse. Was it spite? To fling in nature’s indifferent face every bit of caring you could, until you couldn’t anymore? If so, aerospace engineering offered the promise of going one further: defying the forces of nature on their terms, not yours. Rising to new heights not because the world deserved to be loved this much, but because it felt good to push back that much. To bend the sky itself, if only for a moment, to the overwhelming power of the human will.  But on nights after Karol and Marta began seeing each other, halfway into third year, sometimes he found himself falling out of love for her—undone by how optimistic she still seemed, after all the bureaucratic bullshit and recruitment pressures, about humanity’s possibilities among the stars. How stupid he feared this hopefulness made her, and him for standing so close by her through it all. Granted, Karol wasn’t ignorant of the effects of a recent rough landing on his outlook—how, after one bad test flight, his hands still shook, cold and clammy, when he lay awake trying to imagine himself back in the pilot’s seat, high above the clouds, while recruitment drones monitored proceedings and sent back footage to prospective space agencies. But then again—why not have a child? Did Marta really think she was saving the world by saying no? By trying to become something else? What difference would it make if she achieved her goals anyway, and reached the stars to open doors for the whole coming race? Did striving in a meaningless world not mark them all out as fools?  Karol is just finishing his final year at the university when he offers Stanley a shovel in the larch-lined lane outside Rozalia’s property. He does not yet know that the woman he has slept with a few times behind Marta’s back, to relieve himself of the burden of striving, is about to catch him on a baby and recommit him to a life’s work on his father’s weather-worn estate. For now, though, after Stanley waves him off, Karol goes home more or less of his own free will, and finds his father mending fence posts. Finds the flat-screen in the front room turned to news pulled from algorithmic projections of his and his father’s likeliest global interests. Finds his personal feed inundated by word of the space-elevator explosion, and debris falling through the sky, and human beings all the world over staring up in horror at the deaths, the destruction, the paranoia. The setbacks to so many grander dreams.  Karol is not so vulgar as to be happy in the face of such tragedy, or to smile. But he pops open a can of Goolman and leans on the edge of the kitchen table, watching.  —W porzadku, he mutters to himself now and again. That’s all right.  Who were we to dream any bigger anyhow?  Evanesca goes to Bogotá with Stanley, who is set on Tuesday, March 24 to speak on the space-elevator’s collapse in a public-private partnership panel at the UN World Conference on Disaster Risk Reduction. Evanesca sits on the plane between Stanley and an industry rep from Qatar, who offers her a body of literature about the Committee on the Peaceful Uses of Outer Space, where he insists that all the real plays for airspace dominance are being made. She politely accepts the flick-of-a-thumb file transfers from his device to a secure port on hers, and nods as he explains how aerial dust-storm deterrents have given the private sector unparalleled control over the weather and crop-yield potentials of various environmental-crisis economies. Evanesca assumes that Stanley is still asleep, his forehead pressed to the gray plastic over a shuttered window, but he is only reworking the cadence of his speech, its understated appeal for world governments to treat private-sector space colonization as part of the disaster-relief equation. When he tires of the other man’s chatter, he rubs his eyes, sits up, and upturns a glass of stale white wine on the stranger’s lap.  The industry rep is not pleased, of course. He stands with an angry cry, but reads the situation quickly—the startled, mild-mannered business and UN leaders in bespoke suits casting eyes down the aisle, sizing up the disturbance for themselves—and decides to take his chances on an empty seat in the opposite row. Evanesca covers a smile at the next words the not-entirely-unattractive man mutters in Arabic—something about Stanley being like or the son of a shoe?—and shakes her head when Stanley turns to her with a weathered grin.  —What? he says. Did I interrupt something important?  —You’re terrible, she says.  But for all their camaraderie, she immediately regrets saying as much to her boss, who is not much older than her father but acts like it often these days. Months after the explosion was ruled an accident, and the Uyghuric Gray Wolves could no longer leverage the incident to strike fear in Russian hearts still mourning their cosmonautical dead, Stanley’s eyes are still quick to dull at terrestrial news—environmental, political, and corporate. For her money, Evanesca suspects his latest physical exam as the culprit. Knows the fingers of his left hand are always ticking out the wasted seconds before he runs out of time to leave for good. Wonders—but hasn’t the courage or perhaps the cruelty to ask—why Stanley didn’t just leave when he had the chance, when the space elevator was in good operation and L2’s way-station was sending out its first manned tickets to the stars. He could still charter a traditional flight, couldn’t he, if the Earth was so unbearable to him now?  Unless there was something in the physical. Or unless something else on Earth remained to be done. She tries to imagine what it could be. In the office, speculation runs wild about how this man who works so tirelessly for the cause of deep-space travel lives on the rare occasions when he sends himself home. In conversation with the AI that runs his condo in his absence? In passing, with any number of discreet visitors to his private rooms? Does a man who wants to die among the stars set down roots on Earth at all?  At the conference, Evanesca runs interference for Stanley most of the day, but after eight he tells her to shut off the earpiece and join him for a drink. In public, he adds. Not like that. Evanesca flushes, then rolls her eyes. It’s 2076, she tells him. You wouldn’t dare.  Again with the teasing, which she regrets until she sees that his answering amusement is genuine. A spark in the dull, disinterested gaze that has carried him through most of the convention’s proceedings: the hob-knobbing, the peacocking, the predictable but necessary conversations about industry and community potential to be part of something greater—depending, that is, on each rep’s definition of the term. SKOK Enterprises leaves the whole encounter on a better footing with Thailand’s finance minister, investors from South Nigeria, and the rising Communist Party in Colombia itself. After Stanley’s speech, which manages to be both self-effacing and confident about the world to come, the Indonesian government even promises new financial and labor-related resources to hasten recovery efforts, in exchange for priority training of its environmental refugees into service and colonist roles once the Mars mission establishes its next base in four years.  But Stanley’s personal triumphs in all of this are less clear to Evanesca. His praise for her work never amounts to anything untoward. His seemingly easy banter never breaks into real openness or vulnerability. And after one drink, he retires to his hotel room, alone.  Evanesca lingers at the bar, where she reflects with surprise on her disappointment, and watches a tickertape announcement of the next international mission, which the Chinese government says will go forward as a hard launch in late spring due to concerns with their own, far larger space-elevator designs. She imagines the young man from Qatar showing up again, out of the blue. Their confrontation on the plane smoothed over with laughter. A greater depth of feeling unveiled while they survey Monserrate’s hard mountain shadows from the hotel promenade. She imagines, too, the bartender taking an interest in her as the night winds to a close, and all the bizarre convention-guest stories they could exchange on their way to the city’s best after-hour parties, somewhere at the foot of Guadelupe Hill.  But the strain of hoping for a world with fewer loose threads only leaves Evanesca more exhausted, and after draining her wine she, too, rises to go. Notices, then, the napkin beside Stanley’s empty glass. The doodle of a space-elevator with mathematical notation and the structural formula for a graphene-oxide aerogel composite down one side. But also roots. Wild, deep, flowering roots running from the elevator’s base to the napkin’s bottom edge.  Funny, she thinks, tracing the ink lines with a lacquered nail. Stanley never seemed the sort to indulge in the frivolous or absurd. It makes him seem—smaller, somehow. Less like Atlas, straining seriously, and alone, with the weight of the world.  She goes to her room relieved that nothing more between them has occurred.  Marta only throws up twice on the flight out to Tian Men 2. The Lagrange-point waystation already holds fourteen international citizens when she arrives in the company of two Chinese physicists, a Russian materials engineer, a Canadian biochemist, and an Indian nanotech specialist. The Fang Lizhi, a laser-driven colony craft, awaits repairs and retrofitting before it can shuttle its next group to Armstrong II, on the southern flank of Arsia Mons. Everyone uses earpieces, and has a healthy sense of humor when the translators inevitably fail. The only exceptions come during shiftwork routines, take-offs, and landings, all of which require the utmost precision and care. For all their up-beat attitudes, most also use hand signals in tandem with the devices—even just for the small stuff. Just in case.  Marta’s own exhilaration is difficult to contain within the station’s cramped living compartments, and the slow, deliberate pace of every near-zero-G action. Whenever she drifts past a porthole she takes a breath to remind herself: This is it. Here I am. Recruited into the work of a lifetime. She remembers how quickly her incredulous laughter, upon reading the initial invitation, turned to tears—that deep, purging sort of cry that upchucks all emotional injuries come before. How she had no one on hand to help celebrate—her troubled ex a ghost on social media, her friends back home busy with growing families, and most of her university friends already out of town after final exams. How she walked the streets of Lublin instead, exchanging friendly words and the occasional pint with strangers. How, around three in the morning, no one on Earth seemed a total stranger to her anymore. How the size of her family seemed no less than the world itself, such that saying goodbye to even one of them—any of them—was surely as good as saying goodbye to them all.  Well, almost all. There were, of course, the others leaving Earth, and the others already on Mars, and the ones ferrying processed ores to and from their birth planet as if yanked back whenever they strayed too far. Up on Tian Men 2, this last group holds her attention most of all. When Marta isn’t working on the colony craft with Ping the 3D-printer and Gui the robotic arm, she watches for the return of asteroid harvesters, fresh from the Ceres operations base, on a mess-hall vid-feed. Cheers silently, with a triumphant rap on a table or walls, when each pulls off its transfer maneuvers and ends up safely docked at home.  Anil, the nanotech specialist from Nagpur, finds her interest in these return trips especially endearing, when everyone else on board, he says, has their minds set only on the voyages out, and the possibility of never coming back. Marta laughs off what she considers to be an odd sort of compliment, but hasn’t quite put a finger on the source of this interest herself. If pressed, she haltingly attempts to describe how a tether pulls two ways, and how a bridge has two ends; and how, to go out into the stars is always to leave something in our wake. So of course it fascinates her to see what shows up, exactly, in that wake. She’s left her home, but her home is never through with her, not really. Isn’t that the way with the rest?  Anil’s smile lets her know that he does not agree, that half the crew has given up on old “Terra Infirma” in pursuit of better worlds to come—but that he still respects her beliefs. Three weeks into their mission, he even brings her the latest news himself from the Moon: its core stations finally freed from decades-long arbitration, so that mining can start again. Anil’s deep, melodic Hindi makes it harder for Marta to pay attention to the neutral Polish in her left ear, but she needs no help translating the enthusiasm of his body language when he sees how the news excites her. With a triumphant laugh she claps a hand on his arm.  —Żartujesz?  But of course he’s serious, and he says as much with an answering laugh. He tells her he isn’t even sure what it is they’re celebrating, exactly, and she replies, almost breathlessly, why, the lanthanides, silly! Anil touches his head with the palm of his hand and winks.  —Jarūra! Lanthanidais!  Marta, in her initial excitement, begins credulously to explain: How rare-earth metals from the Moon will ease the burden in vulnerable parts of the industrial world. How rural communities ravaged by the fruits of ancient and ongoing human interventions can finally begin to heal. How she has seen firsthand why the Earth’s environmental crises must be addressed by everyone, no matter how far away their lives take them. But she cuts herself off when she sees the amusement in Anil’s eyes. He knows all this already, of course. Everyone on Tian Men 2 knows that their missions stand, in part, to assist the rest of humankind.  There are, however, other considerations, which seem to temper much of the Terran fealty among the rest of the crew. Marta remembers first hearing of the civil war that Anil surmounted to find his way here at all, and the cynicism that so much brutal death has left in him, when it comes to the value of fighting to reclaim a few wretched scraps of land. The Russian engineer, too, has seen more than he cares to share from the ongoing terrorism dogging his native country, after half a century of his own government’s ruinous annexation policies in nearby nation-states. Likely the Canadian, Anishinaabe, and a representative for the World Council of Indigenous Peoples, shares Marta’s interest in looking back, and honoring the world that first gave them life. For most of the crew, though, life on Earth was an act of involuntary suffering, and most, if asked, are quick to declare that they abandoned those lives when they signed up to explore, and to settle, and to build and mine the depths of their solar system, and beyond. But did just saying this make it so?  Marta’s sister died when Marta was only fourteen, when their school collapsed during an F3 tornado. There are ends in life, Marta thinks, and there are ends. Even then, though, when she thinks of her sister’s laugh, her earpiece can recall the exact sound from family videos on a shared port, so she wonders if even this is an end, or only a transformation. An opportunity to reframe the self, and its responsibilities to the world.  The thought gives her pause on her next pass by a porthole, where Marta marvels at Sol’s light off a slice of the Moon—the Earth somewhere behind it, out of sight but not forgotten. A pinch of sadness hits her then, in thinking of another ending that never fully ends—the little tendril of feeling, of confusion, that will stay with her no matter how far into the outer darkness she treads—and Marta wonders if maybe, just maybe, she should send a little something back. A peace offering. If not for his benefit (her friends would tell her, no, never for his), then at least for hers: to help her let go, and move a little further out, in turn.  Stanley studies the lone fat-tailed sheep following him along the northern bank of the Yellow River, not far outside the city of Baotou. The ewe breathes heavily through blackened gums, with two bottom rows of teeth set so poorly that her jaw never fully closes. Her coat is thin and greasy, but her eyes track Stanley’s sandwich with hopeful interest.  —Przepraszam, he tells her. Sorry, you’ve got a cousin in this one.  A distant cousin, granted—factory-grown yak cells, processed into textured slices and sold in the city next to the real thing—but Stanley holds his ground on principle. Offers her a green leaf instead. When she approaches, her oily stench, a byproduct of the toxins consumed with every drink and stretch of grazing, catches in Stanley’s nostrils.  —There, there, he says in English. It’ll all be over soon enough.  The farmer who owns this land, Pan Khünbish, greets him with a tired wave of a callused hand. She walks with a severe stoop, gray hair trailing halfway down a simple black t-shirt with long stains at the pits. She holds in her other hand a small metal device, which Stanley recognizes with surprise as a lighter, and which she uses to burn a little paper roll of tobacco. Khünbish is maybe thirty, but the run-off from lanthanum and cerium separation processes—the ammonia, hydrochloric acid, and sulphates used to clear radioactive thorium from the ore—is as much a part of her environment as the hard summer winds and the seasonal floods. Stanley waits for her to finish a long drag before speaking.  —I’ve already done this with some of my father’s holdings in Indonesia, he says. Similar problems: the lakes with no life of any kind. But these toxin-eaters are terrific. Built off the designs my company’s been using for Mars colonization. With the farmers and local tradespeople holding majority shares, these changes to the landscape will come quickly. You can restore these fields and your cattle in maybe a generation.  The farmer looks at him with amused skepticism. She touches one hand to her earpiece, then gestures with her smoke at the Yellow River before them. When she speaks, Stanley suspects a translation error. The neutral male voice in his right ear has offered only:  —So this is what happens when gods and kings fall from heaven, eh?  He hesitates before replying. Tapping his earpiece brings up a semiotics web, and within seconds he learns that the farmer’s dialect and terms suggest a reference to Yiguandao’s second cosmic plane: a heaven where ancient kings and gods reside, but not without risk of rebirth into the material plane after transgression. Stanley grimaces at this comparison: his efforts at atonement fooling no one. Khünbish seems to take this as a smile.  She goes on to tell him about her father, a man who she says never trusted the cities, or anyone who came from them. All those people living in buildings that only go one way, that know nothing of the earth. As he always said, she cites in Mongolian:  —Ta yavakh doosh yavakh kheregtei. You have to go down to go (and here she points to the sky to finish the phrase) up.  The corners of Stanley’s mouth turn in accordance with the gesture.  —Like a tree, he says. You know, our fathers might have gotten along after all, if mine wasn’t so busy killing off lands like yours.  Now Khünbish hesitates, as if doubting her own translation, but she doesn’t tap the earpiece for more cultural context. Only, takes another drag and nods to the gray water.  —Ta xianzai zai nar?  A good question, Stanley thinks. Henryk would have been hoping for heaven, but when Stanley looks up, catching a glint of sun through the yellow haze of the air, he finds himself giving up even on the more attainable celestial temple. Not so easy on his heart now, even if it is in damned good health, to move out into the cosmos without first addressing all the waste that SKOK Enterprises accrued in a single, terrible accident, and how casually his offices went about rebuilding pathways to the stars on the back of yet more social neglect. There is more than one way to build up and out, Stanley realized soon after the explosion—after, that is, he caught himself approving the use of one of his father’s mines to gather resources for repairs. At length, Stanley replies:  —My father? Right now, he’s growing.  And at Khünbish’s slow smile, he wonders if her earpiece has maybe translated the term as something closer to being reborn.  When Kazimierz is twenty-two his mother sends him a photo from his infanthood, back when he and she and his father were still on the old farm outside Lublin. Before the floods came, and the landslides wiped their homestead clean away, and they needed to relocate to the city—he and his mother, it would soon turn out, for good. In the photo, a plump, red-faced Kazimierz lies dressed in a spacesuit onesie, its Chinese patches indicating the uniform worn by members of the international space missions that the country led two decades ago to the Moon, Mars, Ceres, and Europa.  —A gift from one of your father’s university friends, his mother tells him. See? You were destined for the stars all along.  Kazimierz shakes his head with a smile while framing his response. One of his colleagues nudges his shoulder as if to ask, everything okay?, and he nods and raises a gloved hand in acknowledgment. The rest of the crew is busy running final system checks after their successful launch from the eighteen-year-old Osik Tower over Marine Station Six. It is one year to the day since Stanley succumbed to complications from chronic radiation poisoning, despite the best efforts of a diligent team of nano-scrubbers to keep up with his global restoration work, and just over two years since all-clears started pouring in from farmlands and wildlife sanctuaries initially affected by his father’s business practices. But to Kazimierz this is simply the beginning. After securing the rest of the ship’s inventory, the crew will be placed in a deep, slow sleep while lasers guide the ship’s sails towards Proxima b, 4.25 light-years away. The crew will age, but not so quickly that the possibility of colonization on arrival is out of the question—not with stem cells in storage primed to generate fresh eggs and sperm should the need, in time, arise.  Of course, Kazimierz’s mother will grieve his absence—she already does—but proudly, from another planet where there is still so much work to be done. Meanwhile, his father’s feelings hang an irresolvable question in his mind’s eye: the man’s deepest disappointments always in the backdrop of whatever joy he found in the presence of his son. Still, when Karol passed on, overworking himself to restore what the storms had done to his own father’s lands, there was no question as to where to lay his last remains. The body burns. The body is returned to the soil that made it what it was.  And from those roots the rest of us move up, somehow, and on.  Canadian by birth, M L Clark is now based in Colombia. Clark is the published author of science- and speculative-fiction stories in Analog, Clarkesworld, and Lightspeed, with work forthcoming in F&SF. Other projects pending publication include a novel in the universe of “To Catch All Sorts of Flying Things” and “Leave-Taking,” and a humanist column and podcast to launch at the end of 2021.", "text": "5300 words, short story\nA Tower for the Coming World\nWhen a liquid-oxygen tank explodes at the summit of his space elevator, Stanley Osik is in Poland burying his father. His hands prove poor workers in the coarse-loamy soil on his grandmother’s acreage outside the city of Lublin, but even as he reaches its iron-clotted depths, Stanley does not regret refusing a neighbor’s offer of a shovel. Stanley and his father, Henryk, shared this much: a belief in getting their hands dirty, even if to others the effort seemed excessive. Stanley simply draws the line at getting the rest dirty, too—and so went a thousand ancient arguments between father and son. Now Stanley cedes to his father the final word. Commits him to the same world that Henryk spent half a lifetime destroying, mine after mine after mine. Remembers, and forgives, the mocking finger pointed at any rare-earth metals he used to build from the ground to the sky. Let Henryk have the dregs of the Earth now, Stanley thinks. The Earth offers Stanley so little anymore.\nStanley’s earpiece is up at his grandmother’s cottage, so he misses news of the disaster in the brushfire heat of its first moments: The Russian shuttle exploding on his elevator’s barge-like plateau. The nanotube tether shattering, with cascade-failures all down the line. The civilian death count rising, and with it the number of countries drawn into the aftermath. The rumors of terrorist sabotage flooding the net and sending his stocks into a tailspin. All this through an earpiece with a 92%-accurate translator, the latter of which delights his ninety-seven-year-old grandmother, Rozalia, so much that Stanley doesn’t give a second thought to leaving it behind. His work at SKOK Enterprises is endless, so he reasons that his work can also wait—at least until he’s made his peace with his father’s last remains.\nStanley’s senior staff is prepared, too, to act swiftly in his absence. While the horror-struck world watches videos of the destruction on repeat, and while Stanley pauses in the two PM sun to wick sweat from his brow, one of his assistants, Maurice, is already drafting press releases suitable for all major social media. Across the open-concept office, Evanesca and Irene have the deceased employees’ files open: Evanesca to assess how the company could add to each compensation package; Irene to flag anything a formal investigation might take for signs of an inside job. Meanwhile, security teams from every SKOK property and subsidiary lot are checking in with all-clears, and factory workers have been sent home to prevent further accidents while processing the news. Analysts from the Johannesburg office are pinging private lines to guarantee recovery models before the market’s next opening bell. R&D is dusting off material-acquisition contracts to begin sourcing rebuilds and repairs.\nStill, some in the public sphere will not be appeased until they hear from Stanley himself. The media networks in particular are itching to see his face, hear his voice, and debate the extent and implications of his grief when he discusses a disaster sure to set back deep-space colonization, extrasolar travel, and his business, of course, for years. And he will let them. He will play that part in his own, well-oiled machine in due time.\nFor now, though, Stanley holds his father’s biodegradable urn over the misshapen, handworn hole of leached loam and rust, and speaks words that feel dead to him, but which to his father always meant life—true life—itself. And when the urn is well and truly buried, with its spare-leafed sapling of pendunculate oak protruding from an eco-mixture set to counteract the high pH- and sodium-levels in his father’s remains, Stanley stands and looks to the sky. So clear in this part of the world. So full of the promise of rising, and rising, and never coming down. So bereft of graphene particulate, falling like ash from his 12-mile-high masterpiece over Marine Station Six, half an ocean away.\nRozalia has the kettle on, and music, by the time Stanley returns and washes most of the dirt from his fingernails at a faucet out back. The earpiece, having mystified Rozalia with its repeated, frantic buzzing in his absence, has been consigned to the far side of a breadbox on the counter, well out of sight. In consequence, Stanley manages whole minutes on her old, long-timbered floor before he notices the damned thing, and realizes what its hundreds of messages will mean for his empire. His own plans of escape. Whole minutes in which he can still savor the smoke-smell of syringol from wood fueling his grandmother’s potbellied stove; and sit down to little slices of yeast cake with rose-petal jam; and pause with her to listen to a recording of one of her violin concertos, from when she and the world were ever so much younger. When the thought of staying here still seemed bearable, though all the stars in the sky called out to him for more.\n—Jak poszło? His grandmother asks between bites. There was never any question of her following Stanley along the hillside, to stand in the midday heat while he dug his father’s grave. She is hardy for her age, but indifferent: her son’s terrible dealings—the men and women ground down with the metals and minerals of his industry—a weight upon her, too.\nStanley chews over the simple words, still so far from his immediate comprehension.\n“It went well,” he says at last. “Henryk will make a good tree.”\nAnd his grandmother nods as if understanding, though the earpiece is still on the counter. Though, within minutes, the two of them will part and never speak again.\nThe neighbor who offers Stanley a shovel is Karol, son of Maciej, a squat, barrel-chested man who will inherit Rozalia’s estate when she dies in the following year. Karol understands the gulf between fathers and sons, which is why he is mystified when his neighbor’s grandson declines a tool with good heft and a sharp edge, to help finish the job. Karol is just over a third of Stanley’s age, and takes classes at Maria Curie-Skłodowska University. Earth sciences, his father thinks, to help their property survive the extremes of climate change: twelve tornadoes ranked F2 and higher in the last year, and floods and landslides like the country has never known. But Karol studies aerospace engineering, and only keeps geology texts at the fore of his e-reader in case his father ever thinks to pry.\nWhen his friends ask him, Why aerospace?, Karol says it’s for the girls—so many in cutting-edge tech to escape the last vestiges of small-town life. Mostly, though, he means one girl: Marta, who has long brown braids and visions of working astronautical repair at the Lagrange-point waystation on the far side of the Moon. She comes from a town where the saying still goes, “I caught my husband on a baby,” but Marta thinks 10.4 billion people is enough. When friends from home visit for Bakcynalia, they say, ah, you’ll change, but she replies, no, I’ll leave—and in a voice that means it, too. Karol watches from across the beer tent and imagines leaving with her—the song festival, the city, the whole tedious world.\nBut Karol also has private reasons for choosing the field. Once, when Karol was a boy, he saw a twister at a distance—the way it peeled a barn roof from the building’s old-stone walls after whirling shingles up into its yellow-gray funnel—and marveled at the casual brutality of its passage over the landscape. That’s nothing, his mother told him, when Karol said that he had never seen anything so strong. On Jupiter, Ewelina said, the windstorms move almost twice as fast as anything on Earth. And on the sun? Pah! When I was a girl, the power went out for months. Koronalny wyrzut masy. End of days. Planes could not fly, satellites would not go. We lived by the generator and the wood stove with your father’s family. It’s how we found ourselves out here at all.\nHis mother had meant this speech as encouragement, thinking her son frightened by the tornado, but Karol only wondered then why humanity even bothered, when the planet showed no interest in its survival, and the universe on whole sounded worse. Was it spite? To fling in nature’s indifferent face every bit of caring you could, until you couldn’t anymore? If so, aerospace engineering offered the promise of going one further: defying the forces of nature on their terms, not yours. Rising to new heights not because the world deserved to be loved this much, but because it felt good to push back that much. To bend the sky itself, if only for a moment, to the overwhelming power of the human will.\nBut on nights after Karol and Marta began seeing each other, halfway into third year, sometimes he found himself falling out of love for her—undone by how optimistic she still seemed, after all the bureaucratic bullshit and recruitment pressures, about humanity’s possibilities among the stars. How stupid he feared this hopefulness made her, and him for standing so close by her through it all. Granted, Karol wasn’t ignorant of the effects of a recent rough landing on his outlook—how, after one bad test flight, his hands still shook, cold and clammy, when he lay awake trying to imagine himself back in the pilot’s seat, high above the clouds, while recruitment drones monitored proceedings and sent back footage to prospective space agencies. But then again—why not have a child? Did Marta really think she was saving the world by saying no? By trying to become something else? What difference would it make if she achieved her goals anyway, and reached the stars to open doors for the whole coming race? Did striving in a meaningless world not mark them all out as fools?\nKarol is just finishing his final year at the university when he offers Stanley a shovel in the larch-lined lane outside Rozalia’s property. He does not yet know that the woman he has slept with a few times behind Marta’s back, to relieve himself of the burden of striving, is about to catch him on a baby and recommit him to a life’s work on his father’s weather-worn estate. For now, though, after Stanley waves him off, Karol goes home more or less of his own free will, and finds his father mending fence posts. Finds the flat-screen in the front room turned to news pulled from algorithmic projections of his and his father’s likeliest global interests. Finds his personal feed inundated by word of the space-elevator explosion, and debris falling through the sky, and human beings all the world over staring up in horror at the deaths, the destruction, the paranoia. The setbacks to so many grander dreams.\nKarol is not so vulgar as to be happy in the face of such tragedy, or to smile. But he pops open a can of Goolman and leans on the edge of the kitchen table, watching.\n—W porzadku, he mutters to himself now and again. That’s all right.\nWho were we to dream any bigger anyhow?\nEvanesca goes to Bogotá with Stanley, who is set on Tuesday, March 24 to speak on the space-elevator’s collapse in a public-private partnership panel at the UN World Conference on Disaster Risk Reduction. Evanesca sits on the plane between Stanley and an industry rep from Qatar, who offers her a body of literature about the Committee on the Peaceful Uses of Outer Space, where he insists that all the real plays for airspace dominance are being made. She politely accepts the flick-of-a-thumb file transfers from his device to a secure port on hers, and nods as he explains how aerial dust-storm deterrents have given the private sector unparalleled control over the weather and crop-yield potentials of various environmental-crisis economies. Evanesca assumes that Stanley is still asleep, his forehead pressed to the gray plastic over a shuttered window, but he is only reworking the cadence of his speech, its understated appeal for world governments to treat private-sector space colonization as part of the disaster-relief equation. When he tires of the other man’s chatter, he rubs his eyes, sits up, and upturns a glass of stale white wine on the stranger’s lap.\nThe industry rep is not pleased, of course. He stands with an angry cry, but reads the situation quickly—the startled, mild-mannered business and UN leaders in bespoke suits casting eyes down the aisle, sizing up the disturbance for themselves—and decides to take his chances on an empty seat in the opposite row. Evanesca covers a smile at the next words the not-entirely-unattractive man mutters in Arabic—something about Stanley being like or the son of a shoe?—and shakes her head when Stanley turns to her with a weathered grin.\n—What? he says. Did I interrupt something important?\n—You’re terrible, she says.\nBut for all their camaraderie, she immediately regrets saying as much to her boss, who is not much older than her father but acts like it often these days. Months after the explosion was ruled an accident, and the Uyghuric Gray Wolves could no longer leverage the incident to strike fear in Russian hearts still mourning their cosmonautical dead, Stanley’s eyes are still quick to dull at terrestrial news—environmental, political, and corporate. For her money, Evanesca suspects his latest physical exam as the culprit. Knows the fingers of his left hand are always ticking out the wasted seconds before he runs out of time to leave for good. Wonders—but hasn’t the courage or perhaps the cruelty to ask—why Stanley didn’t just leave when he had the chance, when the space elevator was in good operation and L2’s way-station was sending out its first manned tickets to the stars. He could still charter a traditional flight, couldn’t he, if the Earth was so unbearable to him now?\nUnless there was something in the physical. Or unless something else on Earth remained to be done. She tries to imagine what it could be. In the office, speculation runs wild about how this man who works so tirelessly for the cause of deep-space travel lives on the rare occasions when he sends himself home. In conversation with the AI that runs his condo in his absence? In passing, with any number of discreet visitors to his private rooms? Does a man who wants to die among the stars set down roots on Earth at all?\nAt the conference, Evanesca runs interference for Stanley most of the day, but after eight he tells her to shut off the earpiece and join him for a drink. In public, he adds. Not like that. Evanesca flushes, then rolls her eyes. It’s 2076, she tells him. You wouldn’t dare.\nAgain with the teasing, which she regrets until she sees that his answering amusement is genuine. A spark in the dull, disinterested gaze that has carried him through most of the convention’s proceedings: the hob-knobbing, the peacocking, the predictable but necessary conversations about industry and community potential to be part of something greater—depending, that is, on each rep’s definition of the term. SKOK Enterprises leaves the whole encounter on a better footing with Thailand’s finance minister, investors from South Nigeria, and the rising Communist Party in Colombia itself. After Stanley’s speech, which manages to be both self-effacing and confident about the world to come, the Indonesian government even promises new financial and labor-related resources to hasten recovery efforts, in exchange for priority training of its environmental refugees into service and colonist roles once the Mars mission establishes its next base in four years.\nBut Stanley’s personal triumphs in all of this are less clear to Evanesca. His praise for her work never amounts to anything untoward. His seemingly easy banter never breaks into real openness or vulnerability. And after one drink, he retires to his hotel room, alone.\nEvanesca lingers at the bar, where she reflects with surprise on her disappointment, and watches a tickertape announcement of the next international mission, which the Chinese government says will go forward as a hard launch in late spring due to concerns with their own, far larger space-elevator designs. She imagines the young man from Qatar showing up again, out of the blue. Their confrontation on the plane smoothed over with laughter. A greater depth of feeling unveiled while they survey Monserrate’s hard mountain shadows from the hotel promenade. She imagines, too, the bartender taking an interest in her as the night winds to a close, and all the bizarre convention-guest stories they could exchange on their way to the city’s best after-hour parties, somewhere at the foot of Guadelupe Hill.\nBut the strain of hoping for a world with fewer loose threads only leaves Evanesca more exhausted, and after draining her wine she, too, rises to go. Notices, then, the napkin beside Stanley’s empty glass. The doodle of a space-elevator with mathematical notation and the structural formula for a graphene-oxide aerogel composite down one side. But also roots. Wild, deep, flowering roots running from the elevator’s base to the napkin’s bottom edge.\nFunny, she thinks, tracing the ink lines with a lacquered nail. Stanley never seemed the sort to indulge in the frivolous or absurd. It makes him seem—smaller, somehow. Less like Atlas, straining seriously, and alone, with the weight of the world.\nShe goes to her room relieved that nothing more between them has occurred.\nMarta only throws up twice on the flight out to Tian Men 2. The Lagrange-point waystation already holds fourteen international citizens when she arrives in the company of two Chinese physicists, a Russian materials engineer, a Canadian biochemist, and an Indian nanotech specialist. The Fang Lizhi, a laser-driven colony craft, awaits repairs and retrofitting before it can shuttle its next group to Armstrong II, on the southern flank of Arsia Mons. Everyone uses earpieces, and has a healthy sense of humor when the translators inevitably fail. The only exceptions come during shiftwork routines, take-offs, and landings, all of which require the utmost precision and care. For all their up-beat attitudes, most also use hand signals in tandem with the devices—even just for the small stuff. Just in case.\nMarta’s own exhilaration is difficult to contain within the station’s cramped living compartments, and the slow, deliberate pace of every near-zero-G action. Whenever she drifts past a porthole she takes a breath to remind herself: This is it. Here I am. Recruited into the work of a lifetime. She remembers how quickly her incredulous laughter, upon reading the initial invitation, turned to tears—that deep, purging sort of cry that upchucks all emotional injuries come before. How she had no one on hand to help celebrate—her troubled ex a ghost on social media, her friends back home busy with growing families, and most of her university friends already out of town after final exams. How she walked the streets of Lublin instead, exchanging friendly words and the occasional pint with strangers. How, around three in the morning, no one on Earth seemed a total stranger to her anymore. How the size of her family seemed no less than the world itself, such that saying goodbye to even one of them—any of them—was surely as good as saying goodbye to them all.\nWell, almost all. There were, of course, the others leaving Earth, and the others already on Mars, and the ones ferrying processed ores to and from their birth planet as if yanked back whenever they strayed too far. Up on Tian Men 2, this last group holds her attention most of all. When Marta isn’t working on the colony craft with Ping the 3D-printer and Gui the robotic arm, she watches for the return of asteroid harvesters, fresh from the Ceres operations base, on a mess-hall vid-feed. Cheers silently, with a triumphant rap on a table or walls, when each pulls off its transfer maneuvers and ends up safely docked at home.\nAnil, the nanotech specialist from Nagpur, finds her interest in these return trips especially endearing, when everyone else on board, he says, has their minds set only on the voyages out, and the possibility of never coming back. Marta laughs off what she considers to be an odd sort of compliment, but hasn’t quite put a finger on the source of this interest herself. If pressed, she haltingly attempts to describe how a tether pulls two ways, and how a bridge has two ends; and how, to go out into the stars is always to leave something in our wake. So of course it fascinates her to see what shows up, exactly, in that wake. She’s left her home, but her home is never through with her, not really. Isn’t that the way with the rest?\nAnil’s smile lets her know that he does not agree, that half the crew has given up on old “Terra Infirma” in pursuit of better worlds to come—but that he still respects her beliefs. Three weeks into their mission, he even brings her the latest news himself from the Moon: its core stations finally freed from decades-long arbitration, so that mining can start again. Anil’s deep, melodic Hindi makes it harder for Marta to pay attention to the neutral Polish in her left ear, but she needs no help translating the enthusiasm of his body language when he sees how the news excites her. With a triumphant laugh she claps a hand on his arm.\n—Żartujesz?\nBut of course he’s serious, and he says as much with an answering laugh. He tells her he isn’t even sure what it is they’re celebrating, exactly, and she replies, almost breathlessly, why, the lanthanides, silly! Anil touches his head with the palm of his hand and winks.\n—Jarūra! Lanthanidais!\nMarta, in her initial excitement, begins credulously to explain: How rare-earth metals from the Moon will ease the burden in vulnerable parts of the industrial world. How rural communities ravaged by the fruits of ancient and ongoing human interventions can finally begin to heal. How she has seen firsthand why the Earth’s environmental crises must be addressed by everyone, no matter how far away their lives take them. But she cuts herself off when she sees the amusement in Anil’s eyes. He knows all this already, of course. Everyone on Tian Men 2 knows that their missions stand, in part, to assist the rest of humankind.\nThere are, however, other considerations, which seem to temper much of the Terran fealty among the rest of the crew. Marta remembers first hearing of the civil war that Anil surmounted to find his way here at all, and the cynicism that so much brutal death has left in him, when it comes to the value of fighting to reclaim a few wretched scraps of land. The Russian engineer, too, has seen more than he cares to share from the ongoing terrorism dogging his native country, after half a century of his own government’s ruinous annexation policies in nearby nation-states. Likely the Canadian, Anishinaabe, and a representative for the World Council of Indigenous Peoples, shares Marta’s interest in looking back, and honoring the world that first gave them life. For most of the crew, though, life on Earth was an act of involuntary suffering, and most, if asked, are quick to declare that they abandoned those lives when they signed up to explore, and to settle, and to build and mine the depths of their solar system, and beyond. But did just saying this make it so?\nMarta’s sister died when Marta was only fourteen, when their school collapsed during an F3 tornado. There are ends in life, Marta thinks, and there are ends. Even then, though, when she thinks of her sister’s laugh, her earpiece can recall the exact sound from family videos on a shared port, so she wonders if even this is an end, or only a transformation. An opportunity to reframe the self, and its responsibilities to the world.\nThe thought gives her pause on her next pass by a porthole, where Marta marvels at Sol’s light off a slice of the Moon—the Earth somewhere behind it, out of sight but not forgotten. A pinch of sadness hits her then, in thinking of another ending that never fully ends—the little tendril of feeling, of confusion, that will stay with her no matter how far into the outer darkness she treads—and Marta wonders if maybe, just maybe, she should send a little something back. A peace offering. If not for his benefit (her friends would tell her, no, never for his), then at least for hers: to help her let go, and move a little further out, in turn.\nStanley studies the lone fat-tailed sheep following him along the northern bank of the Yellow River, not far outside the city of Baotou. The ewe breathes heavily through blackened gums, with two bottom rows of teeth set so poorly that her jaw never fully closes. Her coat is thin and greasy, but her eyes track Stanley’s sandwich with hopeful interest.\n—Przepraszam, he tells her. Sorry, you’ve got a cousin in this one.\nA distant cousin, granted—factory-grown yak cells, processed into textured slices and sold in the city next to the real thing—but Stanley holds his ground on principle. Offers her a green leaf instead. When she approaches, her oily stench, a byproduct of the toxins consumed with every drink and stretch of grazing, catches in Stanley’s nostrils.\n—There, there, he says in English. It’ll all be over soon enough.\nThe farmer who owns this land, Pan Khünbish, greets him with a tired wave of a callused hand. She walks with a severe stoop, gray hair trailing halfway down a simple black t-shirt with long stains at the pits. She holds in her other hand a small metal device, which Stanley recognizes with surprise as a lighter, and which she uses to burn a little paper roll of tobacco. Khünbish is maybe thirty, but the run-off from lanthanum and cerium separation processes—the ammonia, hydrochloric acid, and sulphates used to clear radioactive thorium from the ore—is as much a part of her environment as the hard summer winds and the seasonal floods. Stanley waits for her to finish a long drag before speaking.\n—I’ve already done this with some of my father’s holdings in Indonesia, he says. Similar problems: the lakes with no life of any kind. But these toxin-eaters are terrific. Built off the designs my company’s been using for Mars colonization. With the farmers and local tradespeople holding majority shares, these changes to the landscape will come quickly. You can restore these fields and your cattle in maybe a generation.\nThe farmer looks at him with amused skepticism. She touches one hand to her earpiece, then gestures with her smoke at the Yellow River before them. When she speaks, Stanley suspects a translation error. The neutral male voice in his right ear has offered only:\n—So this is what happens when gods and kings fall from heaven, eh?\nHe hesitates before replying. Tapping his earpiece brings up a semiotics web, and within seconds he learns that the farmer’s dialect and terms suggest a reference to Yiguandao’s second cosmic plane: a heaven where ancient kings and gods reside, but not without risk of rebirth into the material plane after transgression. Stanley grimaces at this comparison: his efforts at atonement fooling no one. Khünbish seems to take this as a smile.\nShe goes on to tell him about her father, a man who she says never trusted the cities, or anyone who came from them. All those people living in buildings that only go one way, that know nothing of the earth. As he always said, she cites in Mongolian:\n—Ta yavakh doosh yavakh kheregtei. You have to go down to go (and here she points to the sky to finish the phrase) up.\nThe corners of Stanley’s mouth turn in accordance with the gesture.\n—Like a tree, he says. You know, our fathers might have gotten along after all, if mine wasn’t so busy killing off lands like yours.\nNow Khünbish hesitates, as if doubting her own translation, but she doesn’t tap the earpiece for more cultural context. Only, takes another drag and nods to the gray water.\n—Ta xianzai zai nar?\nA good question, Stanley thinks. Henryk would have been hoping for heaven, but when Stanley looks up, catching a glint of sun through the yellow haze of the air, he finds himself giving up even on the more attainable celestial temple. Not so easy on his heart now, even if it is in damned good health, to move out into the cosmos without first addressing all the waste that SKOK Enterprises accrued in a single, terrible accident, and how casually his offices went about rebuilding pathways to the stars on the back of yet more social neglect. There is more than one way to build up and out, Stanley realized soon after the explosion—after, that is, he caught himself approving the use of one of his father’s mines to gather resources for repairs. At length, Stanley replies:\n—My father? Right now, he’s growing.\nAnd at Khünbish’s slow smile, he wonders if her earpiece has maybe translated the term as something closer to being reborn.\nWhen Kazimierz is twenty-two his mother sends him a photo from his infanthood, back when he and she and his father were still on the old farm outside Lublin. Before the floods came, and the landslides wiped their homestead clean away, and they needed to relocate to the city—he and his mother, it would soon turn out, for good. In the photo, a plump, red-faced Kazimierz lies dressed in a spacesuit onesie, its Chinese patches indicating the uniform worn by members of the international space missions that the country led two decades ago to the Moon, Mars, Ceres, and Europa.\n—A gift from one of your father’s university friends, his mother tells him. See? You were destined for the stars all along.\nKazimierz shakes his head with a smile while framing his response. One of his colleagues nudges his shoulder as if to ask, everything okay?, and he nods and raises a gloved hand in acknowledgment. The rest of the crew is busy running final system checks after their successful launch from the eighteen-year-old Osik Tower over Marine Station Six. It is one year to the day since Stanley succumbed to complications from chronic radiation poisoning, despite the best efforts of a diligent team of nano-scrubbers to keep up with his global restoration work, and just over two years since all-clears started pouring in from farmlands and wildlife sanctuaries initially affected by his father’s business practices. But to Kazimierz this is simply the beginning. After securing the rest of the ship’s inventory, the crew will be placed in a deep, slow sleep while lasers guide the ship’s sails towards Proxima b, 4.25 light-years away. The crew will age, but not so quickly that the possibility of colonization on arrival is out of the question—not with stem cells in storage primed to generate fresh eggs and sperm should the need, in time, arise.\nOf course, Kazimierz’s mother will grieve his absence—she already does—but proudly, from another planet where there is still so much work to be done. Meanwhile, his father’s feelings hang an irresolvable question in his mind’s eye: the man’s deepest disappointments always in the backdrop of whatever joy he found in the presence of his son. Still, when Karol passed on, overworking himself to restore what the storms had done to his own father’s lands, there was no question as to where to lay his last remains. The body burns. The body is returned to the soil that made it what it was.\nAnd from those roots the rest of us move up, somehow, and on.\nCanadian by birth, M L Clark is now based in Colombia. Clark is the published author of science- and speculative-fiction stories in Analog, Clarkesworld, and Lightspeed, with work forthcoming in F&SF. Other projects pending publication include a novel in the universe of “To Catch All Sorts of Flying Things” and “Leave-Taking,” and a humanist column and podcast to launch at the end of 2021.", "source": "https://clarkesworldmagazine.com/clark_12_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Tower for the Coming World by Maggie Clark"}