{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "M L Clark", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "WPmYzMc1OH+ZMwo8SX+ikItfEMk=", "id": null, "license": null, "comments": "", "raw_text": "17570 words, novella  Mercy and the Mollusc  1. The Eggs  The man woke on the wrong side of the shell and had to extricate himself carefully, lest he get any of the Oomu’s mucus over his nostrils and mouth. This was easier said than done, on account of all the bugs still hanging around topside. In his ride’s more amorous phases, its odor was deceptively sweet, and local fauna flew right into its sticky exposed under-mass. Or at least, the fauna was supposed to, but some of the bigger insects liked to linger by the man’s saddle, wavering on the cusp of their inevitable death plunge; and then the man, in his impatience with the sluggish press of nature’s greatest cruelties, would take out his glowing lead-stick and swat them into a bewildered tailspin down, down, down, into the long muscle of the Oomu’s neck and upper back.  The man took no pleasure in the act, for such violence only left him staring at his complicity for days, as his victims’ exoskeletons slowly sank into and disintegrated beneath the Oomu’s skin. But the Oomu never seemed to mind all the wing, leg, and stinger bits fallen into its interior, to dissolve into sustenance at whatever rate the giant mollusk deemed best. As its one long foot glided along the steppes and the badlands, the deserts and the plains, the mountaintops and valley-lows of Maia Colony’s lone and ill-populated continent, it paused only to drink in the dew from passing mists, or to nibble at another Oomu’s scent, and—if another Oomu came into visual range—to flash its corpulence from a season’s idle feasting, its under-mass suddenly on brilliant iridescent display. Then it would pause to admire the answering bioluminescent pulse, and decide whether to leave an offering, fresh from the genital spout atop its head, on the cool stone in its wake.  There were days when the man, in witnessing these proceedings, could almost trick himself into believing that the Oomu was at peace with its current place in the order of things and didn’t really want to leave all this behind. But little signs had taught him better, well before the difficult decision they had made together at First Landing. For one, the Oomu only ever leftofferings: Never collected them. Never formed a clutch of eggs all its own. Out of fear, or pickiness, the man had always assumed—and had to assume, for even if he’d had the language to ask the Oomu, in all their years wandering the continent together, he’d never thought to pry.  Speaking, though, of prying . . .  With a deep breath, the man upon so rude an awakening braced himself on the protruding lip of the shell and wrested his other arm loose from the Oomu’s flesh, then batted at some of the buzzing hangers-on before hooking both hands over the shell’s edge and reaching up to give his safety line a tug. His old rig took a moment to register the action before auto-cranking him back to his usual perch, high atop the Oomu’s slate-gray outer casing. The form of its shell was not unlike the helmets of ancient conquistadors (or at least, what the man had seen of them in pseudo-docs from Tierra-Prima), but the resemblance and its import would be lost on the giant mollusk, so the man had never raised this subject, either. There was plenty more listening to do, in any case. For instance, the giant mollusk inside and extending from this unwittingly parodic attire usually noticed when its rider slipped in his sleep, but as the man roused further into the dawn, he realized that the Oomu was moving strangely: swaying and swerving over a plot of desert covered in a crust of . . .  Ah.  Yes, that explained its distraction, and his fall. The sylvite in Minor Basin Six always ran a dusky orange, marking the badlands beyond First Landing with intermittent warning slashes for man and mollusk alike. Now, though, the ground was thickly coated in the salty stuff—the whole mess of it freshly uncovered by one of the desert’s recently intensifying windstorms. Not impossible to traverse, but . . . unpleasant for the one doing all the work. The man still had mucus to wick from an arm before he’d feel settled in his skin again, but once topside and secure in his saddle, he first leaned over to pat the broad, tense muscle of the Oomu’s upper back.  “Should’ve woken me. We’d’ve found the path together. And what’re you bolting ahead for anyway, you old lout? We’ll find another way around. There’s no rush.”  The Oomu steadied at its rider’s touch and gentle chiding, but its eyestalks extended and retracted in emphatic disagreement with this last. The man sighed in deference to the gesture, then squashed a wide-brimmed cloth hat over matted white forelocks, rubbed sleep grit from his eyes, and squinted in the general direction of the Oomu’s peepers, which were pointing (when the tentacles were at their outermost) past the explosion of red-orange sylvite, toward the rim of an ancient crater: wide, and crumbling, and . . . smoking? A pillar of erratic puffs was twisting upward from somewhere beyond that ancient ledge: from some fixed, unknown spot along the crater floor.  And it wasn’t cooking fire. Not by a long shot. The man scratched the gray-haired hollow of his chest in the unease of recognition. He knew the Oomu recognized the smoke’s provenance, too.  “Well, well. One of those days, is it?” His wide, flat nostrils flared, and he rigged his travel pack with tools from long-term storage before unhooking the safety belt and dropping heavily down the slide of the Oomu’s casing. This time, freed from his sleep harness, the lip of the conquistador’s shell carried him up and out, and he landed with feet splayed, palm hard to the salted earth. His right knee offered a jolt of pain only as he straightened. The metal of the left creaked as he walked on.  The Oomu turned its five tentacles toward him—two eyestalks, a touch-tester, a taste-gatherer, and a scent-sniffer—before its forefoot curled inward, as if readying to turn and follow. But the man held up both hands and shook his head.  “I’ll be right back. Easy now. You know how much it pains you to see this sort of thing.”  He hesitated after this last part: Too patronizing? Too dismissive? The trust of this Oomu had not been easy to attain, let alone to keep, and this last ride between them had an uneasiness to it that neither seemed willing to confront. Enough to undo a decade’s camaraderie? The man had no desire to risk that conversation, either, so as he crunched along a thicker stretch of sylvite, he was relieved to feel the Oomu’s agreement in unspoken compliance: Only its eyestalks following after. At the rise of the massive crater, the man looked back at the giant mollusk, three times his height and many more his weight, and waved reassurance that his own, minuscule body would be fine, before descending out of sight, into the cooler, moister atmosphere at the crater’s base.  Still sheltered from the early sun, the other side ran heavy with shadows, cinders, and unpleasant fumes. There, in the impression of solitude that the ridge afforded him, the man shivered despite himself, but stood affirmed in his decision to come down alone. Closer proximity to the smoke already had him revisiting the remains of last night’s supper, and the surrounding detritus wasn’t helping with the nausea. The thought of the Oomu standing by him through all of this—whether it remembered its own emergence from such violent decay, or simply held memories from its generational inheritance—was beyond what the rider could bear.  Or what the Oomu could bear, he reminded himself:  This was for the Oomu’s benefit, too.  After orienting himself in the noisome crater air, the man fixed his attention on the source of all this fuming: An ending world. A cloud of volatile gasses that crackled and sparked not far from the crater’s edge. A pocket of the planet’s first ecosystem, its interior filled with entities furiously generating the incompatible environment they needed to press on—and losing the battle, second by agonizing second, as preceding proto-pockets had done since the humans first arrived.  By the size of this one, a few meters in all directions, the man knew it wouldn’t be long now before its final loss. At its base, thrown out in erratic groupings, lay the charred or desiccated husks of pre-world elements that had already succumbed: A spiny-tailed air-worm, its six sail-wings withered nearly to dust. A slew of beetles, the sort that would have glowed magnificently in the sulfuric churn of their native skies, turned to a heap of corroded shells. The sinuous remnants of a massive sky-kelp, once growing fifty meters up through the planet’s richly stratified upper atmosphere, now lying in what looked like rotted clumps of rope upon the storm-swept rock.  How many more preforms could possibly remain within?  The man knelt beside the ending world and coughed into his sleeve, eyes stinging, while he rummaged through his pack. His face mask would not endure for long in that strikingly protean remnant of an environment that the terraforming ship had all-but-eradicated ahead of the embryonic human fleet. But the covering’s use would protect him, at least, from blowback while he used his heavier-duty protective sleeves to press from this world into its own.  The blowback always seemed a kind of moral judgment to the man, as if the ending world were defending itself from its one true nemesis. As if it were alive. Well, and maybe it was, in its way. The man had heard stories about the pre-world that went so far as to suggest an eco-cohesion to the nebulous system: A floral and faunal consciousness, wherein extensive genetic transfer between species had been the norm, and massive viral strings in this aggregate coding had made of the whole far more than the sum of individual species’ parts. Were such stories just the stuff of children’s vids? Perhaps. But even on his approach, this proto-pocket bucked and twisted as if anticipating his trespass into it, and the man caught himself speaking aloud as if to a sentient mass.  “Easy now,” he said as he switched on his visor and cut through the spewing fumes to make out the interior’s contents. “Easy . . . ”  For a heartbeat, the man entertained that the fumes would part to reveal an affirmation of the grandest of those local fables: something resplendently alive and resilient enough not to lose its battle against the current atmosphere. But it was only ever a split-second’s dreaming: In point of fact, as the man had more pragmatically suspected, little now resided in the ending world before him. A few branches and spores were sustaining its micro-atmosphere, while tiny arthropods scuttled from twig to twig to keep the floral structure tightly bound; and a clutch of eggs floated in an algal mesh, the latter serving as a kind of filtration system for the cloud on whole.  The eggs, though . . .  Those were progenitor eggs, from the Oomu’s prior species.  The man’s stomach knotted as he counted them. Eight in total. He fumbled for a vial in his pack and grimaced after holding it to the light. Not enough to save them all. Still, he retrieved his incubator console and suited up in earnest: Tugging on protective sleeves and torso shielding, then securing neck flaps around his mask before easing both arms into the ending world. With one hand holding the incubator’s open hatch under the mesh, he nudged four eggs loose, trying not to make deliberations about which ones looked “best” or “most viable” as he worked. He knew he had to be quick, either way, for the whole ecosystem was reacting violently to his presence: Its failing atmosphere pooling, parting, and surging dangerously around the foreign equipment, almost as if testing his flimsy armor. All the man’s movements had years of practice behind them, though; and so he only struggled once, in the instant that both arms and incubator had fully withdrawn from that furiously shrinking whole.  Stumbling back from the force of the proto-pocket’s answering bellow—a resounding clap and exhalation, as if somehow cognizant of its latest losses—the man coughed and wheezed awhile before setting the incubator on the crater floor and studying the wisps of alt-atmosphere clouding around the rescued eggs. Not much time for a full transfer, at their current dispersion rate. The man plugged the last of his vial’s contents into the incubator’s processing chamber, which in turn applied a dosage apiece to tiny patches that an internal arm then affixed to the side of each egg.  GRAD ACC? read its tiny console. But the man had traversed the desolation between settlements long enough to know that “gradual acclimation” would not work well on his sort of journey. Too many risk factors out in the baking sun, and along the restless rocks, and when taking shelter from the intensifying storms. ACCEL, he entered instead. As with his safety line and his knees (metal and flesh alike), the man’s incubator was an older number, prone to long processing times, but not so long that he was worried. After a minute’s blinking on the console, the interior warmed and moistened, and telltale signs of activated gene therapy could be seen on the eggs’ surface, while the air around them entered a neutral state capable of supporting life through the transition. The man studied the fragile, glistening creatures in his care, then looked back to the agitated plume of their doomed homeworld.  “Sorry,” he said to the proto-pocket—and meant it, whether or not it was truly “alive” and could hear him, let alone understand the significance of his words. Even if he’d had enough fluid for all the eggs, he never carried the right formulation for the arthropods, or the rest. Rider bias, he supposed. Besides, there was only so much space in his pack or on the Oomu’s back. And stars above, if all four eggs survived the process, they would become massive carry-ons soon enough. Still, it seemed its own form of cruelty, to rescue some from certain death with such efficiency, then walk away from all the rest. Earlier—decades past, when ending worlds roamed wild across the continent—the man had sat with six in their last hours: bits of flora and fauna dropping from each as it shrank, and fought back, and shrank again . . . until a critical limit was reached, and the center could no longer hold. That was the dangerous part for any humans in attendance: the abrupt, gasping burst of those last fumes, which then scattered every which way into the surrounding air. In the early years of the colony, teens had even made a game of it: how close you could stand by an ending world, and for how long, until the risk wore you down.  Or, on occasion, until some part of it struck you head-on, and you died.  But taking up with the Oomu had changed all that for the man—the fool gambles, the furious indignation at the mere fact of existing in such a time and place and body in the universe as his—and now he knew better than to idle at any length on the crater floor, not while the Oomu would surely be anxious until it saw him crest the rim in one piece again. Certainly, it wouldn’t bolt, not with the salt-sands being what they were; and it wouldn’t hasten after him, either, but . . . it would remember. Other abandonments. Other losses. And an Oomu’s memories of grief were not to be trifled with, or added to, as the man had learned the hard way, years ago.  With at least these four eggs secure, the man doused, removed, and returned all protective equipment to his pack, which he slung over one shoulder while holding the incubator in both hands. It wasn’t the easiest way to make his precarious return up the crater’s incline, not with the metal of him giving such obvious complaint, but the arrangement was still to his preference. There was something about seeing the little machine at work and holding it firmly in his grasp as it did that gave the man to believe he had some control over the hardness of this land’s outcomes after all. Just so long as he didn’t look back at all that he’d left behind.  When he popped up over the crumbling edge, into the rising heat and brightness of the desert day, the Oomu made a soft sucking sound: Something between curiosity and relief. The man smiled in clenched-teeth gratitude and nodded back.  “Not sick of me yet, huh?” he said, too softly to be heard. “Well, there’s still a few days left for that, I suppose.”  Peering through the condensation along the incubator’s interior, he then held up the tiny vessels of life: Four ships in silent running between two differently volatile worlds. At first, the gesture was for the Oomu’s benefit, so it could see what he had done out of its sight. Next, though, it was for his own: To view these tiny eggs in contrast with the giants they would soon become. To imagine the size of things created by his own two saving hands.  But the man’s mild contentment with his labors ebbed with every creaky step over the massive spray of sylvite along this stretch of Minor Basin Six; and even as the Oomu tipped its conquistador’s shell to allow him an easier climb back to his perch and their shared holdings, the man’s thoughts drifted to his own embryo-pod, back on the Ignacio, despite his having no direct memory of living in the thing. What humans lacked in direct memory, though, they made up for in mental visualizations built around objects revisited in their lifetimes. And so, as the pair headed off along the clearest path they could find among the livid-orange rocks, the man imagined his own egg streaking along in the incubator of that ship, alongside others in his clutch, toward a trauma beset by bots upon a world that no one had foreseen being populated when the mission first set out.  The pressing question, older than both his knees combined, reemerging as man and mollusk put the crater and its sputtering pillar of smoke out of visual range:  Was it always better to be reborn?  Again, the man could have asked the Oomu its opinion—there was language enough between them for that—but he preferred not to. He didn’t want to come off as challenging what they’d agreed upon, even though the Oomu’s choice was proving harder to accept the closer they came to Capitol City. It was bad enough his body already seemed to be radiating feelings about the impending loss of so old a companion. What good could come from talking out a done deal now?  Better to pretend, as the man then decided to, that when it came to such massive, world-transforming questions, no one answer would ever do.  Still, he held the incubator tightly in both hands, rubbing the surface of the enclosure with two restless thumbs for a great while longer, before finding the heart to set it down.  2. The Kid  Distant stars and the light off Maia’s largest rings kept man and mollusk company as they cleared the sylvite-laden badlands and sighted a small settlement on the thin line between the barrens and the steppes: a barrier town, two days by Oomu from Capitol City, that could have been mistaken for another sort of ending world, by the looks of its meager internal holdings and the state of its surrounding farmland. Here, too, lay signs of a recent windstorm—but also, from the look of the machinery tossed and shredded in the fields, of at least one prior storm as well: as if the town hadn’t properly recovered from the first before the second came bearing down.  Again, the Oomu held back, swaying and swerving as the settlement’s devastated agri-plots came into view; and when the man tried to urge it on with his lead-stick, the massive foot halted entirely, while one eyestalk whipped around to study—or interrogate—its rider’s insistence that they press on after it had so clearly expressed its doubts. The man understood the severity of its concern, then, and set down the lead-stick to show that he was taking the Oomu seriously.  “Getting protective, are you? Well, I’m not going to trade them. I promise,” he said. “Look, they’re in our care now—see?” And he reached back for the incubator, which he’d snapped securely between a balance of gear behind him, under a tented shelter along the shell’s upper ridge. The eggs were much larger and heavier in their genetically altered forms, as befitted creatures that would soon crawl upon the earth under a highly oxygenated atmosphere, instead of sailing upon breezier and more porous fauna through the dense, tempestuous fumes of pre-world atmosphere. The man had a thought then, and raised the incubator to eye level, squinting at the coloration of its contents. “Hm. Maybe time to take them out, even, but let’s wait until we’ve got this town behind us, hey? Looking pretty close now, but I’d rather we had some feed on-hand for the moment they burst.”  The Oomu extended its other eyestalk to study the shells, their healthy wet sheens a sign of the augmentation’s success, while its first tentacle continued to watch the man closely. The man tried to quiet his disappointment at the Oomu’s suspicions, but the time this was taking tired him, and he had to set his jaw against saying something that they would both regret. It wasn’t him, he tried to tell himself; and it wasn’t the decade they’d spent together. Some wounds, for the Oomu, were simply bound to resurface from time to time. Maybe a taste on the wind had set this one off. Maybe the look of this town. Or maybe this town, exactly, from actions in another colonial mood.  Whatever the reason, only when the Oomu’s second eyestalk started to withdraw—a sign of at least momentary satisfaction—did the man lower the incubator in his hands and shelter it anew.  “Can’t say I blame you,” he said with a sigh. “But can’t say I’m not a little hurt by it, too. Never gets easier, I suppose, living with more than one truth about my people in the balance. But Capitol City’s near enough, you hear? This might even be our last real pit stop along the way.”  At this reminder, at least, the Oomu seemed to brighten; and after allowing the man to give it a hearty pat on its upper back, it followed his directions without hesitation once the man had raised the lead-stick again. The man’s confidence, though, was not as quick to return. If even a small settlement could trouble the mollusk, how would it handle the impending metropolis? The bustle of traffic, the scents, the sounds, the crush of a million lives? Was it really such a good idea to let the Oomu enter? To take it right to the Institute’s front steps? The man distracted himself from his doubts by studying the upturned farmland as they advanced. The soil was barely fertile, but still a sight better than the badlands, and the pair made good time to town limits, such as they were.  “Hector’s Haven,” read the flash projection along the settlement’s security grid. “Pop’n: 1,417.” Then, as the man and the mollusk slid past the perimeter: “Pop’n: 1,418.” The man cast an awkward glance at the Oomu. It couldn’t read, but the man rubbed its shell in apology all the same.  “Backwaters everywhere, no? Well, we’ll be in and out soon enough.”  Hector’s Haven followed a traditional settlement design: A main square for all its critical establishments, around which a smattering of residences stood interspersed with plots for storage, community gardening, and (according to the signage on them) future secondary production facilities. Ambitious, thought the man, considering the precarity of existing builds just beyond the grid. Then again, the same could be said of Maia Colony on whole—and was, with increasingly negative inferences, whenever he lingered near other humans long enough to absorb the latest news.  Possibly a more foreboding sign than the state of the surrounding farmland, though, was the lack of recovery activity within the grid. Most of the movements that man and mollusk saw upon entry were mechanical: A rumble of bots clearing detritus, resetting security components, and repairing broken sections of roadway. None of them paid the new arrivals any heed. All were rudimentary numbers with limited parameters, no better than those first programmed to prepare the planet ahead of the fleet. This suited the man fine, though, and when he found an empty lot that didn’t appear to be a private holding, he invited the Oomu to wait there while he visited the square for supplies and intel. The Oomu’s tentacles tasted the air and the earth and seemed to find both tolerable, but one eyestalk set itself on the only other major item in the vicinity—a disposal unit with a blinking light—and the animosity in its stare inclined the man to think that he would need to get his business done quickly, before the Oomu spooked at some small sight or sound, then took flight and left him and all the fresh supplies behind.  (It had been happened before, and the man had no desire to spend the days it sometimes took to track down the mollusk, which could make excellent time solo when it wanted to.)  The settlement seemed marginally more animated, at least, as the man neared the main square. There, a few wizened citizens even went so far as to exchange nods with him as he passed the general depot and stepped into the makerspace, where a woman at the service counter jutted lips at his knee without needing to be asked what was wrong.  “Helluva squeak you’ve got there, ah—” She glanced at the faded name tag the man often forgot was still affixed to the threadbare front of his old military attire. “Orozco?”  She said the name with a soft c in place of its k and broke the syllables oddly—“oro” and “zco”—which gave the man pause, trying to place the nature of her question. As he wasn’t in the habit of being addressed by any name, he didn’t bother to correct her once he’d figured it out.  Rather, he braced his artificial leg on a stool by the service counter and revealed the rest of its battered assembly. “Got something to keep the dust out, you think?”  She leaned over the counter and whistled. “You could almost play it like a harmonica, couldn’t you? Are those chew marks or acid?”  “Reminders.” The man rubbed the largest hole among them, right where the knee joint glinted through.  The townswoman didn’t press. “Ever thought of a new casing?”  The man scratched under his hat and sighed. “Got a mold you could do it quick with?”  “’Course. Gimme an hour and I’ll have it printed right up around it. Skin-matched, or—?”  “Chrome, if you can. Kind of enjoy the cyborg thrill of it all.”  She smiled, then beckoned for him to hand over the limb for servicing. The man unhitched it with ease, then took a crutch in exchange. Wooden number, to his visible surprise.  “From Capitol City,” the woman explained, before he could ask. “They’re doing wonders with their terrariums and plant yields these days. Every now and then, they like to send us lesser folks on the outskirts, oh, I dunno . . . little reminders of how much better off they have it.”  “Hm.” The man held the burnished wood to the light, where it gleamed a deep whisky gold. Something about the material seemed both familiar and deeply estranging—which just went to show, he decided, how long it had been since he’d seen a tree even in a docu-vid. “I did notice the winds around here haven’t been too kind.”  “Not for many seasons, no.” The woman folded forearms over the counter, warming to the chatter. “Some say Maia’s finally starting to push back. Might be something to it, too—at least, to hear tell of what the geologists think is going on down below, and the trouble they’re having out at the climate-station these days. But who’s surprised by any of it, really? Only so much you can terraform the surface without fundamentally realigning the core, y’know? And stars above, it’s not like we have the resources for a second attempt anytime soon.”  She was preaching to the choir, and they both knew it, but she did this so pleasantly that the man held his tongue on his own share of bad news. Even with the ease of her pessimism, he figured it might shock her to learn just how many ending worlds were popping up in the badlands again—each an indication that it wasn’t just basic geology fighting back, but that also, somewhere on Maia, fuller pockets of pre-world life persisted, and were sometimes launching little colony-ships of their own into the toxic ether of the human realm. But what good would such knowledge do her, anyway? The man recalled peering into that latest ending world along the crater floor and counting what strange species still eked out a paltry living there. As he scanned the rest of the makerspace, where a handful of local craftsmen were refining printer-plans of their own, and older folks were simply whiling away the afternoon in fuller company, he had to make a concerted effort not to catalog the curious holdings within this ending world as well.  Instead, with a rap on the countertop: “Thank you,” he said.  “One hour.” She hefted his artificial limb in salute, then retreated into the back.  But the rest of his errands hardly took twenty minutes at the general depot: Medical supplies, food for one man, treats for a full-grown mollusk, calcium-booster for four imminent young ones, and a new energy cell—all from one service counter with a bot ill-programmed for decent small talk. The man debated seeking out a nearby drink and testing the other locals’ misery around it, but something about the Oomu’s reluctance at the outskirts of town had him turn for the lot instead, a hover-trolley with his purchases tagging close behind.  The man hated when his instincts were right.  Just as he left the main square, he saw large, twisting movements in the distance: The sort that seemed to signal a giant mollusk in distress. His crutch hit the gravel hard as he hastened over to the lot—the trolley whirring frantically to keep pace, while all other bots in the vicinity continued with their oblivious labors. His mind filled with fragments of other confrontations the pair had faced in their decade together: shattered shell bits in a rapid-onset desert storm; gaping under-mass wounds from a confrontation with a stinging mudfish by the coast; and a frightened withdrawal, for months, into the safety seal of its conquistador’s apparel, after a particularly vicious run-in with southern poachers, while the man sang to it from the camp he’d made in the outer world. But the scene on arrival instead had the man torn between instantaneous relief and a different sort of fright:  First—The Oomu was fine. The Oomu was fine.  Only, the same couldn’t be said for the human stuck in its translucent skin.  “MISTER, HELP!” the kid cried. “It’s gonna eat me!”  The man swore in two tongues and waved his crutch wildly while shouting at the Oomu, whose tentacles were fully extended and twisted about to observe what was going on along the side of its under-mass. Which meant . . . the Oomu wanted this. This was no love-season mistake.  “Hey!” said the man. “Hey, ho there! Whatcha think you’re doing? Let the kid go.”  But the Oomu only jabbed an accusatory eyestalk at the top of its shell. When the man followed the Oomu’s gaze, he saw it, too: their packs torn loose and clearly ransacked; all the safety line’s metal parts stripped; and the incubator . . .  Blazes, the incubator wasn’t up there at all. The man’s gaze darted about, and soon enough found it lying on its side, on the ground.  The man dove for the eggs.  “Hey—hey, mister! I’m dying here! Can’t you see that?”  The man watched his hands tremble over the fallen enclosure. Two eggs had been crushed: Their contents lolling in unresponsive pieces, impaled on bits of broken incubator. A third had cracked just enough that the Oomu inside was struggling to breathe. The man eased it from its shell, to give it a chance of transitioning properly to the aerated world, but it didn’t look well at all, and sat limp in his hands even after he’d set it free. The man laid it on the ground to recover further on semi-cool stones, then fished around for the fourth. Intact. Cushioned in the fall by its broken siblings. Still waiting to be born. The man shook out broken pieces of the enclosure, cleared the bodies, then set the egg back in the incubator’s base, along with its struggling sibling.  Then and only then did he stand to address the kid. He tried to keep his voice level.  “You make a habit of tossing what you don’t understand?”  The kid was still uselessly wriggling, as if that could ever be enough to pull free.  “Please, Mister, I’m sorry—I didn’t know they were worth something. They’re like, collector’s items, right? Well, I’ve got some of those myself, okay? I’ll show ’em to you, even, if you’ll just—please, this thing, it’s going to—it’s gonna—!”  The man’s arms coursed with a heat he never enjoyed feeling, and all the kid’s pleading only seemed to make it worse. He turned to the Oomu’s massive head and held out both hands to be tasted: the sincerity on them, and the sorrow.  “You were right, my friend. I should’ve listened. We could’ve waited ’til Capitol City.”  The Oomu’s tentacles swept heavily over the man’s hands, his arms, and his head: agreement, distress, grief, and questions.  “I know,” said the man, resisting the urge to wipe his face of the Oomu’s overly sweet muck. “I know. We’ve got two of them left, I think. One’s not doing well, but it could. It still could. In the meantime, though, please—this one’s not much more than an egg for us, too.”  “Wait, those’re its eggs?” The kid’s face fell: the gravity of the offense finally registering.  “Close enough,” said the man, his gaze locked on the Oomu’s extended tentacles. “But like all Oomu, they carry whole lifetimes of memories. You just killed two full histories of the world before our own, kid. Maybe three. And you’ve broken the heart of this Oomu, too.”  The kid startled both man and mollusk then, by beginning to cry. An arm, a leg, and part of the kid’s torso had sunk into the mollusk’s skin, but one hand remained to press hard at both eyes.  “Mister, I didn’t mean it. I’m sorry. I slipped; I didn’t toss it. Honest, I didn’t.”  “Didn’t mean to be stealing from us either, I guess?”  The man was ready for a hangdog look and more excuses, only to be surprised again.  “Oh, no, Mister, one hundred percent I meant to be stealing.” The kid was now gulping air to fight back panic. “But just that, I swear. It’s hard times out here, don’tcha know?”  The man didn’t answer, willing his own breathing calm before extending one hand for the Oomu to take entirely inside its mouth. A trust exercise. Then the man waited, watching the Oomu’s contemplative tentacles, while the grind of the Oomu’s radula registered along his wrist. He tried not to think of the thousands of teeth that radula represented. They weren’t for eating, not necessarily—not with the efficiency of its skin-system—so much as for building: For tool creation, and later use. For snapping pre-world branches into sizes better suited for egg enclosures. For building adult shelters against the worst of the fumes’ electric storms. For breaking down large prey into manageable bits for any soft-shelled young to learn how to absorb.  “Even a brute of an adult, you once showed mercy,” he said to the Oomu now holding his own bones and flesh in the balance. “This is a child.”  And yes, the man was fudging on this last point, and he knew it, for the kid could’ve been as old as nineteen standards. But what of it? Age-of-majority laws didn’t suddenly make sages out of fools, as his own days in uniform had proven well enough. He held firm to this adjusted truth, then, to keep even a flicker of dishonesty from the taste of his skin and the look on his face.  The Oomu pressed down on the man’s wrist all the same. It was only a little pressure, a warning squeeze, but enough that the man grimaced: Closing his eyes and running through how much a new extremity would cost him. Then the sensation passed, the Oomu relenting, and the man withdrew a hand coated in denser slime. The man was about to thank it for its understanding, but when he glanced back along the length of the Oomu’s foot, he saw that its mercy had only gone so far. The kid was still trapped within its skin.  Then again . . . the kid also hadn’t even been a little bit digested.  (The man would’ve known. The man would never forget the screaming.)  He looked up curiously at his old companion. “What’ve you got in mind, then?”  But the Oomu gave few answers easily, not even in its more contented moods. Now, it simply curled its forefoot, turned, and started for town limits. The man followed for a few steps, then swore to himself, feeling the weight of the crutch still in hand.  “Hey, hold up,” he said to the Oomu. “Hold up! I hear you, okay? We’re going. Just, let me load up and . . . and . . . blazes, listen! Listen! Don’t you remember? I need two.”  He pointed to one foot, then the space in lieu of another, and waited for the Oomu to notice the gesture—which the mollusk did eventually, if grudgingly, before relaxing its own foot anew.  “Wait, whaddya mean we’re going?” said the kid, after making the mistake of trying to push off the Oomu’s under-mass as it turned. That free hand, too, was now trapped within the mollusk’s skin, while the rest was sinking deeper with the Oomu’s every move to leave.  “Oh, settle down, kid,” the man snapped. “You haven’t been eaten yet, have you? No? Well, all right. That’s a start.” But then, hearing the irritation in his voice, and casting a guilty look at the vivid redness in the kid’s eyes, he added: “Parents around?”  “No.” The kid choked on more frightened tears. “I’m a podling.”  With the mollusk temporarily at rest, the man had had a chance to turn to the controls of the trolley, which he was reprogramming to follow the Oomu instead of him, just in case. But his hand hovered over the input panel at the kid’s reply. “A podling? Here?”  His question was met with a despairing laugh.  “Well, yeah. Especially here. You think they could keep this dump together any other way?”  That sounded about right, once the man had turned it over. He couldn’t imagine many citizens of a struggling settlement being in the mood to create life by any harder means—although, the downside was that the podling way tended to cultivate less fondness among the elders for the new-forms, which in turn meant a greater hardness, and intolerance, toward all their youthful errors. “Fair enough. So, no one will mind, then, if you’re gone—I mean, just for a little while?”  This last part, the man added quickly at the sight of the kid’s wide-eyed terror: to reassure the little thief, even if he couldn’t tell whether the kid had any right to be so scared.  Only the Oomu knew that part.  “Mister, please . . . please don’t leave me here. If I’da known, if I’da only—”  And the kid went on, somewhat incoherently, about intentions and unintended outcomes, while the man shook his head, returned to the input panel, then installed the broken incubator and its contents atop the hover-trolley, carefully penned in by the rest of their supplies. Lastly, he raised his hands to the Oomu’s tentacles, fingers splayed, and flexed his fingers a few times to emphasize that he was counting, before flashing a firm ten digits until the Oomu echoed the gesture with its tentacles, twice. They’d trained on this a few times, but though the man knew that the Oomu could understand human timekeeping, he also knew that the Oomu was often of a mind notto.  “Ten minutes,” he echoed aloud. “Please—just gimme ten, and don’t scare him, or they’ll all come after you with everything they’ve got.”  At this last, though, the kid’s face lit up with another fool idea, so that the man had to whip around and jab a finger in the air. “Oh no, don’t you dare. Trust me, if you value your life, you won’t call for help. You know how fast an Oomu can dissolve a body if it panics? Do you?”  The fool idea fell from the kid’s expression, along with everything but a sickly pallor.  “Okay, Mister. I promise. I won’t.”  The kid’s voice was barely above a whisper now, which inclined the man to take this promise as sincere. The defeat in it, at least, he could believe. He started off to retrieve his leg.  “Only . . . please hurry?”  The man hesitated, his back turned to what now truly did sound like the pleading of a child. A note of compassion, he knew, was called for—but out the corner of his eye, he could still see the two shattered eggs, and the pierced flesh of their contents, drying out on the gravel.  In silence he pressed on.  “Not quite finished yet,” said the townswoman. “Just past the mid-calf. Fifteen minutes?”  “Can’t, sorry.” The man started organizing chits on the service counter. “I’ll still pay in full, of course, for your time and the effort.”  “Gonna look pretty funny with a half-finished mold.”  “It’ll match the base model, at least. Always looked pretty funny myself.” The man crooked an awkward smile to illustrate his point. “If, ah . . . if you don’t mind?”  “Not at all.” The woman withdrew to the main workshop, a partition opening just long enough to reveal the near-deafening whir and grind from a series of massive printers. Most, the man knew, were producing building materials. Maybe some were also dedicated to the intricacy of farming equipment, or to barricade blocks to try to keep out the intensifying winds. Either way, only a few would be for specialty projects such as his, along with the fiddly bits needed to keep local machinery in check. Dedicated luxury models, for the use of finer materials and the printing of their potential creations, were for settlements in far better straits.  The woman returned promptly with his half-finished leg, then smiled apologetically while she counted out the chits he’d left on the counter: The half-hearted guilt of one settler’s less-than-complete trust in another. The man felt a share of guilt in turn, but only for his own soreness outside town limits with the mollusk. If even humans couldn’t manage trust amongst themselves most of the time, why’d he have to go and feel so raw that the Oomu’s was even harder to keep?  “Thanks,” he said. “Hey, you got a kid around these parts, late teens, podling, the kind with sticky hands, who gets into trouble more often than not?”  The woman snorted. “This one steal from you? Works quick, if it’s the one I’m thinking of. Some podlings have the gift in their bones, I think. Want me to call a Monitor?”  “No, no, nothing like that. Only, I figure someone here should know they’re with me for a bit, to work off a debt. If anyone asks, I mean. I’ll try to have them back as soon as possible.”  The woman held up her hands in a say-no-more gesture. “If anyone bothers to report a missing pickpocket and crop-thief, I’ll let ’em know.”  “Crop-thief? I thought the winds were doing that well enough on their own.”  “Well, crop-remnant thief, at least. Claims to be preserving the seeds, but we’ve got servos to sift through the debris and replant the next crop. What in blazes we need special stashes for?”  The man scratched the damp brow under his hat after getting his right limb hitched up again. “That why the kid’s going hungry and foraging alone?”  “More or less. Here we work together, or we don’t work in the system at all.” The woman shrugged. “You know how it goes. What drops off along the way is just nature’s way.”  Like the beings inside the proto-pockets, or the massive insects that hung about the Oomu: not quite ready to die, but also already lost to the living—although the man couldn’t decide if the townswoman’s declaration better suited the fate of the kid, or of any settlement so quick to cast off whatever human resources it still had at its disposal.  “’Fraid I do,” he replied, setting the crutch down by the counter. “That, I surely do.”  Outside, he peered down the main drag of Hector’s Haven while adjusting his pant leg over the half-finished mold. No sign of the Oomu having bolted, and no mob gathering in the lot, thank the stars. He walked back quickly but warily, more attuned to the faces nodding in passing, and also to the bots still dedicated to recovery labors. What else could he have said to that woman? If the kid had belonged to someone—been hers, even—would there have been any use to his deliberations as he approached the lot? The terrible heat had left his arms now, but its antithesis, a coolness of resignation, ran the length of him instead. There would be no forcing the Oomu to let go of its catch, and anything less than an instant death blow would see it and the kid destroyed. Unless the Oomu relaxed its hold, the kid was simply forfeit: One life for two legacies. Unless . . . ?  No. No, the man tried to put aside all foolish human scheming of alternatives as he entered the lot, where he noted that the kid was now stuck up to the shoulders of a settlement-issue jumpsuit in the Oomu’s translucent under-mass. The little thief seemed calm now, too, but the man wasn’t ready to call this an improvement yet. The Oomu’s under-mass harbored a narcotic it used to keep its prey from causing damage as it struggled, and probably that was starting to kick in here. Only, the drug alone didn’t explain the kid’s deeper immersion in the mollusk’s skin.  “What, haven’t learned to quit struggling? Had to dive in even more to figure that out?”  The kid’s reply came sleepy and slow. “Nah, it told me to get in. Easier this way, for travel.”  “It told you?”  That did indeed sound like the narcotic talking. The man had never put the Oomu’s slime to the test himself, but he believed the rumors; and if that drug was starting to affect the kid’s perceptions . . . well, it already wasn’t healthy for the kid to stay immersed for long, not when a human’s skin needed to breathe in its own way, too. He tried to remember if the paralysis caused by an Oomu’s toxins was permanent. Too little ever survived submersion in an Oomu for the man to have properly observed its long-term side effects firsthand.  His memory ultimately failing him on this accord, then, the man gave up and approached the Oomu’s tentacles—all five of which were out and flexing. Once, twice, and then just two of them.  Twelve.  Twelve minutes.  He didn’t know whether to laugh or cry as he set about loading their supplies.  “You’re counting too fast,” he told the mollusk as he worked. “It was nine, tops.”  The Oomu offered what the man took for a shrug, then used its radula to help hoist some of the larger items topside. Soon enough, the man was ready to send the hover-trolley back on its auto-return path, then check to see that the drowsing kid still had a pulse. It seemed strong enough, but how much longer would that last? Hours?  “You sure you know what you’re doing?” he said to the mollusk. “This is still a life, you know. Revenge won’t bring back the other two.”  In lieu of reply, the Oomu tipped the broad helmet of its shell to one side, to help the man climb up again. But the man hesitated now, as the Oomu had on their approach to Hector’s Haven. An uncomfortable disconnect was growing between the pair with every turn, it seemed, on this last journey together—and the Oomu surely sensed it, too, because it withdrew a touch to survey the rider, then cast an eyestalk toward the kid and, ever so slightly, allowed more of the kid’s shoulders to protrude. Proof that it could let the egg-killer and crop-thief go, if and when it wanted to.  But that gesture of peace also only affirmed, for the man, the immensity of the Oomu’s power over both him and the kid, and so he knew that he had to respond to its show of leniency with deep appreciation. Push too hard, demand too much more at such a delicate moment for all three of them, and the Oomu might grow impatient and withdraw its act of generosity altogether. Even now, the Oomu was still watching him, waiting for the expected show of gratitude, and so the man forced a smile in thanks. When the Oomu dipped its shell again, he climbed on—realizing, as he did, that the trust of a human could be every bit as difficult for an Oomu to keep.  The only difference was . . . well . . .  He had to hope that his trust was something the mollusk didn’t want to lose.  3. The Oasis  The man sang to the mollusk on the first leg of their journey out from Hector’s Haven (Pop’n: 1,416, the sign read after their exit). He knew he didn’t have much in the way of natural ability, but figured that the passion with which he offered up Tierra-Prima vallenatos had to count for something. After the second or third rendition of each, he took to interspersing their lyrics with explanations about the human loves they depicted—the old loves lost; the loves one couldn’t bear to imagine losing; the unrequited loves; the men who had never found anything to love at all.  Did the Oomu understand the general thrust of any of them? Could the Oomu, with a heart bag used as much for waste disposal as for the free-flowing circulation of blood between organs, ever make sense of the tensions that could strain a human’s own? The man had no answer, and no idea even how to pose the question in a way he could be sure of the Oomu understanding—but he knew the difference between when the Oomu was genuinely distracted, and when it was merely feigning indifference: Its tentacles turned away to study anything other than the goings-on high atop its shell. Signs of the latter, in this case, gave the man hope that it was listening after all.  Not that the man was simply resting while the Oomu carried them to Capitol City: Hooked in, he sang and commentated while moving along the shell’s central ridge, to set up a nursery for the still-struggling infant Oomu and its sibling (which, for reasons the man could sympathize with, at this juncture seemed content to remain unborn). Building their shelter was delicate labor, with supplies needing to be adjusted to create a “floor” extending out from the shell’s ridge, and ballast on the other side; but the greater challenge was doing so while large insects yet buzzed in the uncertain allure of the Oomu’s mating-season sweetness. As ever, these hangers-on exhausted the man with their heavy wing-rustle, pungent exoskeletons, and errant scratching of legs and antennae against him. Yet he had his doubts about the Oomu’s ability to control its internal biochemistry, and a general fear that the kid might accidentally get digested alongside any potential afternoon snacks—so he tried to swat them away for once, instead of down.  Everything, the man knew, depended now on the Oomu staying calm.  That, and on it longing—soon, he hoped—to sleep.  Sleep, of course, was its own gamble: Half the time, the Oomu retracted fully into its shell to recharge, and this would prove an automatic death sentence for the kid. But since the Oomu had taken such care not to dissolve the thief yet, the man felt confident that it would simply halt where it felt most at ease, slacken along the whole of its exposed foot, and withdraw its tentacles to drowse until restored. Then the man might try to hook his harness into the collar of the kid’s jumpsuit and manually ease the rest free—slowly, very slowly—over that sixteen-hour rest cycle.  The man had an inkling, too, of just the place to coax the Oomu to take this snooze. A few hours from Capitol City (the luminosity of which was already tinting the distant horizon) lay a runoff pipe feeding into a pool surrounded by sheltering rocks: Moist, cool, and covered in all manner of succulent algal nibbles. A little oasis with nothing, surely, to drive the Oomu deep into its shell.  It wouldn’t be long yet, then. And all the man had to do, for now, was act as though everything had returned to normal between them.  But the Oomu wasn’t the only creature in need of settling, as the man realized once the kid had roused to the sound of those traditional love songs, belted high atop the Oomu’s shell.  “Hey! Mister!” came that demanding voice from the gliding mollusk’s side. “You got anything for the headache your singing’s giving me?”  The man paused in the middle of dusting the floor of his nursery with calcium-booster, all the better to fortify the survivors’ fragile casings as they glided atop the elder Oomu’s shell. He tried to remember the last time he’d had another human along for the ride. Certainly, the moment he registered the kid’s voice, he remembered why it had been so long.  “Oh, so now you’re a thief and a comedian?”  The kid huffed: A good sign, for it confirmed a lack of lung constriction deep within the Oomu’s skin. “Attempted thief. It’s not like I got away with anything, y’know.”  The man shook his head while lifting the infant Oomu into the palm of his hand. Its foot now extended from wrist to fingertip, but injuries sustained in the fall, including that lack of initial oxygen, continued to leave it looking weaker than it should this long after birth. Still, it was eating, so that was something, surely. The man settled the infant in its new nursery, then set a protective covering atop it and the egg, still nestled in the incubator in one corner.  “Well,” he called down. “Some might say you got away with murder.”  Silence. Enough that the man braced himself on his half-casted prosthetic and peered over the lip of the Oomu’s shell. No, the kid wasn’t a goner yet. Just busy processing guilt, or maybe trying to figure out a better angle for the rest of their conversation. Either way, the man couldn’t decide if he was relieved that the kid had no ready retort for so heavy a charge. He retreated to his saddle and picked up where he’d left off, on the verse that had been so rudely interrupted.  He stopped again when he heard the kid holler something more.  “Eh? What was that?”  “I said,” the kid shouted, “Does this guy have a name? This giant slug trying to eat me?”  The man debated the merits of explaining the taxonomy of an Oomu to so ignorant a rural-settlement youth. The thought not only wearied him, but also put him in mind of a past life: The instructional halls where he’d once tried to give lectures, as a field expert, on the differences between Oomu and their pre-species, behaviorally as much as physiologically. He remembered how daunting this task had seemed, with so many eagerly cataloging eyes upon him; and then how impossible, once he’d realized that the students were more interested in his personal conversion from soldier to reclamations specialist. The sheer hunger of those third gens, to know what it had felt like to slaughter so many native lifeforms in service to the “cleanup” brigade issued after the terraform ship’s error . . .  Did he still have nightmares from the early hunts? they’d asked him. Did he think his work with Oomu now, or lectures such as this, would ever be enough to make amends?  Just as he had struggled for words to describe the Oomu, so too had the man discovered that he had no language for his first years off the Ignacio, which had seen him woken expressly to serve on a task force he hadn’t yet grasped the import of. Explain the Oomu? Explain himself?  No, the man had walked away from such failures a long time ago—and into life with an Oomu. This Oomu, with whom he could simply be. And so, he found himself resenting the kid’s ignorant remark for bringing the whole mess of these pent-up thoughts to the fore again.  Still, he wasn’t the one trapped within its under-mass.  He swallowed hard to put his anger to one side.  “Merriweather,” he said.  “What?”  The man faltered. This sort of kindness had gone rusty on him from disuse, and he wasn’t sure how long he could keep it up. He leaned over his saddle and shouted down: “Merriweather!”  “ . . . For serious?”  But the incredulity in the kid’s voice made the man feel a touch better. More in control of the situation after all. He smiled indulgently.  “Sometimes Carlos,” he added. Then he straightened in his saddle and winked at one of the Oomu’s tentacles, which had risen and turned back, all the better to study either the nature of this commotion or why the rider’s singing had come to an end.  The kid kept quiet for a beat.  “Okay, Mister, now I know you’re just taking the piss with me.”  The man shrugged—though more for the tentacle’s benefit than the kid’s or his own.  “Ask a foolish question,” he called out.  “But why’s that a foolish question? Is he on some sort of wanted list?”  The man’s smile advanced to a snort. “You’re really something, kid. Now why d’you think an Oomu even needs a name like the ones we’ve got?”  “Well, but why not give it one? Give it a name and it’ll answer to it, won’t it?”  “Sure, the Oomu learn our ways. ’Course they do.”  “ . . . So?”  “So, what?”  “So, why not this one? He busted or something?”  A second tentacle rose to study the man. The man held up a placating hand, then leaned over his saddle again.  “Watch it, kid. You’re not exactly in a position to be calling anything else busted.”  “Oh, really? Wow, that’s rich, Mister. Real rich. Look, what in blazes I gotta watch for? You wanna talk about busted, you wanna tell me if you’ve even got a plan to get me out of here? Because here I’m thinking to myself, hey, this is a pretty smart guy, all things considered, so he wouldn’t’ve let us leave the town like that if he didn’t have a plan. But here we are, aren’t we? Out in the middle of nowhere. And you’ve got nothing, do you? Unless, like, maybe you’re planning to knock this guy out for a bit? Then pull me out while he’s unconscious?”  Four tentacles were now turned about to study the man, who had never been much for lying or otherwise concealing truths when they hit too close to home; and who this time couldn’t figure out a way to keep flickers of guilt from his face or his sweat-scent. Feeling the heat rise in his cheeks at the kid’s words, the man swore in the best language he had for elaborate phrasing.  “Kid, listen, if you know what’s good for you, you’ll—”  But it was too late. The highly annoyed Oomu kicked into its highest speed: An aggressive zip usually reserved for rare encounters when it saw another Oomu so delightfully bioluminescent that it simply had to dart over and slime-crawl all over the other’s shell in fierce, fond greeting and mating dance. The man clung to his saddle and nearly lost his hat trying to stabilize himself without toppling back into the nursery.  “Woah!” he said, scrambling for the light-stick. “Woah there!”  But the light-stick was a fruitless effort to maintain a sense of control he never truly had—as the man knew even as he waved it about and tried to tell the Oomu that it had misinterpreted what it had seen in his face, or smell-tasted from his sweat. Meanwhile, he could hear the kid moaning and spluttering from massive sweeps of air rushing along and under the aerodynamic curve of the Oomu’s shell (along with the occasional insect, clod of dirt, and bit of dust).  There was nothing to be done about the kid’s discomfort, though, until the Oomu decided to stop—which it did, hours later, ironically at the very place where the man had intended for it to take its much-needed rest. But rather than sinking into a well-deserved flop along the rocks around the runoff pond, the first thing the Oomu did when it hit the cooler, more humid air around the pipe was . . . practically shoot the kid out from its side.  The kid’s head hit the dirt before either arm could swing around as a proper brace, while the man scrambled out of his harness and leaped to the ground before the mollusk decided to shake him off, too. The man had just cleared the shell and turned to thank the Oomu for letting the kid go when the mollusk turned all five tentacles and its forefoot from both humans and continued with purposeful—furious—intensity on its way.  Away from the runoff pond and its succulent algal nibbles.  Away from its much-needed rest.  Away from the man, and toward the bright, if hazy lights of Capitol City.  “Wait!” said the man. “The little ones!”  But of course, the infant and egg-bound Oomu would be fine with their elder. Despite the latter’s ire, the man knew it would not endanger either surviving youngling if it could help it.  Still, he waited until the Oomu had zipped far enough along that it could be mistaken for a fleck on the horizon before letting his arms fall slack and turning to the curled up and whimpering kid, who was struggling to restore mobility to all extremities. Everything appeared intact, at least.  Next, the man cast about their modest oasis: Willing himself to be calm and look for other positives in the situation. The Oomu was angry, after all, but it hadn’t been so angry as to abandon them both at random in the steppes, or to dissolve the kid on the spot. So, maybe the Oomu just needed a moment to cool down. Maybe it would tire soon enough of being angry, and of feeling betrayed, then retreat to this ideal shelter for a good, restorative slumber.  The man crouched to help the kid up.  “Blazes just happened?” The kid groaned, touching a trickle of blood over one eye before trying to clean it with the least-slimy patch on a jumpsuit sleeve.  “You weren’t listening,” said the man. “The Oomu’s got language, ours along with its own, and it hears things. It heard you making plans, and acting like they were my plans all along, too.”  “Well, but that’s good then, isn’t it? Like, that’s what got me out, wasn’t it?”  The man ignored the question. He turned to survey the pool of murky, algae-laden water, then the slime-trail streaking out toward civilization. Four hours to Capitol City by Oomu was . . . eighteen on human feet, with pit stops? Ten, maybe, if they headed instead for the climate-station that supplied the runoff for this pond, then took a vehicle the rest of the way in?  “We’ll camp here tonight,” he said. “And then, if the Oomu hasn’t returned . . . ”  He jutted lips toward the light pollution: a gray-yellow haze in the darkening turquoise sky, at the end of a long expanse of desolate landscape before them.  Even the kid’s answering silence seemed crestfallen.  The kid’s pockets, at least, proved useful. There wasn’t much around the runoff pipe to burn, but enough detritus lined the banks of the little pond to make a fire with the starter on a standard-issue multitool (chest pocket), while a filtration cap (left-leg pocket) helped with clearing some water to drink. Then there was the matter of a nutri-bar (shoulder pocket), which the man declined a bite of when the kid offered; and a dense wad of papers, which had spent the last day secure in the right-leg pocket, but also looked as if it had been through far worse long before.  The man, eyeing each item on removal, regretted that he hadn’t outfitted the upper half of his prosthetic with so much as a flask, in case of such emergencies. Then again, as a rider with the Oomu, his shows of helplessness had always been part of their unspoken agreement: No need to get rigged up every day in a jumpsuit like the kid’s, when it would only give the mollusk reason to think that he wasn’t going to stick around. The downside of unspoken agreements, though, was that the man couldn’t say for certain if even ten years of performing relative helplessness for the giant mollusk would be enough to bring it back now. He wasn’t even sure it was safe to hope.  He pointed, in the meantime, to the wad of roughed-up papers. Paper was a useful medium in the low-tech expanse between settlements and could be flash-formed easily enough from the right weeds, but the state of Hector’s Haven hadn’t given the impression of even hemp crops doing well. This was more of the kid’s thieving at work, no doubt, though its purpose wasn’t clear.  “Love notes?”  The kid snorted, pushing long dark hair to one side with a hand that seemed to have regained full functionality. The kid’s deslimed clothes were drying on a rock.  “Nah, look—like I told you, I’ve got stuff I been collecting, too.”  The other hand was still a bit stiff as the kid used both to pry apart a few layers of the pulpy block. The man leaned in, then raised an eyebrow.  “These the seeds you been stealing from your people?”  The kid made a face. “My people are stubborn. They keep getting the bots to gather, store, and replant the same useless things. And, sure, those crops worked for a couple generations—but now we need something more resilient, see? Something with tougher roots, slicker surfaces. Something to withstand all these weird new storms. So, that’s what I’ve been studying, on my own. I’ve got all kinds of splices back in my bunker. Some of them so tough, you’d swear they could knock back a whole storm itself. The aim’s to get a few species to serve as a kind of double-crop—half foodstuff, half natural barrier for the town.”  The man couldn’t resist a smile. “They still have to be edible, though, you know.”  The kid kissed teeth in impatience. “Yeah, yeah, Mister, that’s what the Council said, too. So, maybe we adapt our digestive systems, right? We’ve got gene therapy for pretty much everything else on this dump of a world. Why not that?”  The man leaned back against a bit of protruding pipeline, a thin stream burbling behind him, and knew at once that the kid didn’t know how to read the expression on his face. Instead, perched like a wild thing atop another rock, toes splayed and long hair falling all about a scrawny, starvation-bruised torso, the kid peered at him like an inquisitive bird—but with all a human’s abiding distrust of fellow human beings.  “What? You got a problem with that? Well, but why not try to change ourselves for once instead of our surroundings? How’s it any different than with your leg, y’know?”  The man shook his head and knocked on the half-finished chrome job, impeccable up to the mid-calf. “Don’t go bringing this’n into it. There’re those who think I should’ve laid in and gotten a whole new flesh number for it instead.”  “Yeah?” The kid looked at him uncertainly. “And why didn’t you?”  The man considered. “Partly, because there’s history here. History I don’t want to lose or forget. And I guess I’m not sure I won’t forget, if I replace the souvenir completely.” Then he chuckled to himself. “Plus, time’s a coming when the real knee’ll give out. I can feel it. So, it might not be the worst thing, to have this old clunker to lean on when that day comes.”  The kid was not good at masking disagreement or distaste. “You sound just like ’em, you know. Half the time, I think the real problem with my people is that they love the hardship. Love it, like, they’d rather die doing what they’ve always done than risk something new, and have it work, and have to give up being so constantly miserable.”  The man found himself agreeing with most of this, but burst out laughing at the kid’s inference that he was miserable. Age always did seem a kind of agony to the young.  In turn, though, the kid misunderstood and scowled, going hot in the face.  “Well, fine, go on then, laugh while I’m tryin’ to talk serious. Wouldn’t be the first time.”  And the kid smashed the wad of seeds together again, set it by the drying jumpsuit, then curled up with hands tucked under shoulders for warmth, to try to fall asleep.  Amid the kid’s theatrics, though, the man had indeed been considering a serious answer—which, yes, included saying how proposing that everyone genetically modify their stomachs was a bad idea in the current culture; but also, that the stuff about the seeds themselves showed a good spirit of inquiry and inventiveness, and reflected the sort of thought processes that the colony could use more of, to bring about the system-wide changes needed to weather coming storms.  He could have said all of this, and more, but the rings of Maia were starting to fill the night sky, and the pair’s meager pile of suitable kindling was almost at an end; and as much as the man liked to imagine that the Oomu worried about him when he was out of view, he was now beginning to doubt it: Beginning to wonder, too, if he’d always been projecting his own loneliness and fears upon so dear a companion. And if maybe he was, in fact, a little miserable after all.  Anger kept him silent, then: Anger and helplessness, because if only the kid had kept away from the mollusk in the first place, there would’ve been no reason for such doubting. If only the little thief had left well enough alone for the—stars, half hour, tops!—that the man had been off buying supplies, then he would’ve been able to treasure his last night with the Oomu in their usual, relative peace, in an understated communion of silence and maybe song, instead of shivering out here more or less alone . . . and wondering.  Wondering if this first taste of aloneness wasn’t just a sign of things to come.  4. The Station  Morning, a poor night’s sleep on a twinging back, and the lack of a heavy sweep of greeting-slime across his face, did not improve the man’s mood. Frustration, loss, and fear for the Oomu—for all three of the Oomu—twisted in his chest as he surveyed the runoff pond and followed its underground piping in the general direction of the climate-station, carefully dug in at a wide remove from Capitol City. Even this oasis didn’t seem so innocent anymore: Nothing did. The more he paid attention to every sign of industry meant to keep the colony going, the more the man felt like they were all close to being ejected from a massive proto-pocket. But if that was to be the end of things for Maia Colony, fine, so be it: What really bothered him was the dithering. Let nature hurry up and knock them all down and out already, if it was ever of a mind to.  He felt a bit better, though, once the kid offered him the rest of the nutri-bar.  And the kid seemed calmer, too: Dressed, long hair pulled back, pockets filled anew. A far more believable profile of a podling long since used to living on its own. In silence, then, the pair filtered more cold, metallic runoff and set out across the remainder of the steppes, surveying the low-lying brush for anything edible: Leaves, mainly, and the occasional root or berry. That silence abided for the first twenty clicks, too, but when they reached formal signs of city infrastructure, including a dirt road heading in the general vicinity of the station (to the left) and Capitol City (to the right), the kid hung back the more the man veered right.  Meanwhile, the man’s mood had declined again in the course of their hike. “What?” he said. “Y’think I have time for more of your nonsense? If it’s in the city, it needs me, even if right now it doesn’t think it does—and all thanks to you. All thanks to all the damage you’ve done.”  But these baiting remarks didn’t stick.  “Yeah, but . . . ” said the kid, in a soft, flat voice. “I didn’t go that way.”  The man’s nostrils flared. “Did I say you went that way? Did I ever—” Then he noticed the distant look on the kid’s face and registered the verb tense. “Say that again,” said the man.  “I said, I didn’t go that way. I went . . . ” And the kid pointed left, toward the climate-station, with half-lidded eyes and in the manner of a sleepwalker.  The man hesitated, then doubled back and rested his hands lightly on the kid’s shoulders.  “Hey,” he said, shaking them. “You awake? Or dreaming?”  The kid blinked furiously, noticed the man’s proximity, then staggered back and away.  “Blazes, Mister! Keep a distance, will you?”  The man squinted at the now fully alert youth, then scratched a bead of sweat down the side of his face. Was it possible? There wasn’t exactly a body of literature on the phenomenon, but there’d always been whispers of it, those wild hallucinogenic tales: Of genetic, generational memory that could be deposited, or transferred, to even a human as easily as the Oomu laid sperm and eggs for other Oomu to collect. A consciousness that could extend between organisms even on this side of the atmospheric divide. A system that worked together to keep something larger than itself alive.  “All right,” he said, though he was inclined to blame his low blood sugar for the extent of his present credulity. “We’ll go left then.”  The kid’s eyebrows shot up. “You believe me?”  The man shrugged. “Not exactly. But I see now that I should’ve trusted more in my old friend to have some sort of plan after all.”  Even as he said this last, though, the man felt weary: The morning’s irritation slipping into grief. Such a waste of their last days together. Such a mess of useless misunderstandings—on both their parts—if the Oomu could’ve just made itself this clearly known to the man the whole time. Although, if that kind of linguistic clarity was only possible after full immersion . . .  The kid fell in step beside him, shoulders hunched, as they started for the station.  “It does have a name, you know.”  The man shook his head.  “An inner one,” the kid went on. “It calls itself—”  “Don’t.”  “Huh?”  “I don’t want to hear it.”  “No? But it’s a part of—”  The man looked to the sky. He didn’t know where else to look, so as not to snap at the kid again. “It could’ve told me itself, if it wanted me to know,” he said. “It didn’t. Let’s respect that.”  The kid nodded, and this time stayed quiet as they pressed on.  When they tired, they rested—though with care, in the heat—which gave the man time to chew on some decent roots until he felt halfway human again, and then to address the rest of him by readjusting how his leg sat in the cradle of the prosthetic. It hadn’t been used for long distances in quite some time and even a good fit could become uncomfortable under such circumstances, but to his mild amusement, the part that upset him most was how much he found himself missing the original creak: The sheer distraction of the thing. Without it, the only sounds that paced the pair were those of the kid’s boots scraping along the flora, unsettling clods of dirt and gravel, and of the man clearing his throat between increasingly wheezy breaths.  Maybe in Capitol City he could get someone to put it back.  In the meantime, it was hard going. When they finally reached the climate-station, eleven hours had passed—three for stops along the way—and the sheer distance, once traversed in full, left the man puzzling over the underground piping in a less cantankerous, but also far more troubling light. He knew the extent of the system had something to do with long-term plans for planetary stability—a laying of the “bones” for a network of future climate-stations to deflect problems long before they reached Capitol City itself—but the extent of the precaution was itself ominous, when held in contrast with how little such concerns seemed to be discussed on colony channels. He hadn’t seen reports anywhere about the growing number of proto-pockets, either, so either such matters weren’t being discussed because they weren’t important after all . . . or because they were very important, and there was nothing anyone could do that would be worth the chatter in the interim.  Such ruminations dropped clean away, though, when the man saw the low, squat shape of the station in the twilight; and beyond it, just outside its perimeter fencing, a human reaching up to be addressed by a giant mollusk’s mouth and tentacles.  The Oomu’s massive conquistador shell proved a perfectly recognizable silhouette on the cusp of night, and the man’s eyes stung at first sight of it.  The kid, for his part, seemed to be humming vallenatos as they drew near.  A station scientist was standing by the Oomu as they approached, and when she waved warmly to the worn-out arrivals, the man resented her at once for her proximity to his companion. He stood some twenty paces off, legs planted in the earth while he processed the scene, as well as his own confusion in finding the giant mollusk here instead of Capitol City. Had the metropolis frightened it after all? Had it doubled back for reinforcements?  But if the latter, why here? Why not return to him?  The Oomu’s answer, at least to this last, came when it turned tentacles toward him, then away. Oh, yes. It was still hurting. Still grieving the suspected betrayal. The man wanted to rush over and talk to it, explain himself, but felt frozen in place, as if in the middle of a showdown, for how much the woman seemed to draw his attention—and the kid’s—to her instead.  “Well,” she said. “We were wondering when you’d arrive. Salutations. Stars, you should’ve seen the look on its face when it sensed this young one coming. A wild feeling, no, that bonding?”  “Sure is.” The kid glanced warily at the Oomu.  “Hm,” said the woman, with an understanding smile. “Y’know, I wasn’t sure if it would remember me, either, but the moment it got close last night, we both felt it—that inner bond. Like it was yesterday, no? Ah, dear one. How terribly long it’s been.”  The Oomu’s tentacles extended and withdrew contentedly, and it replicated a few of the woman’s hand movements before offering signs of its own. Signs the man did not know.  Then the woman held out a hand to the man and the kid. It was a long, awkward distance to cross for a handshake, and the woman made no effort to draw nearer to them. Instead, the man had to detach himself reluctantly from where he stood, and take one heavy pace after another, in order to close the gap. At the last step, he almost balked, for the presence of the unresponsive Oomu still upset him so—and then he shook. The kid shook, too.  “Sorry,” she said, once they were all together by the Oomu’s side. “I’m Leidy. I work climate stats—I mean, obviously, right?” She gestured behind her to the gray stone of a facility entrance, which had been 3D-printed more to bear up to windstorms than to attract visitors. Beneath it, the man knew, lay the real operations hub, with a massive silo, currently closed, that could shoot all manner of thermochemical treatment into different layers of the atmosphere. Doubtless the Oomu had used that very silo to descend and wait out the day’s heat: a giant mollusk is something to see, when it went fully vertical at its immense size and weight.  “But before that I was in reclamations,” she continued. “I, personally, helped this one with its first transition. Stars, but you were a lot smaller back then, weren’t you? Got yourself gloriously fattened up on plenty of desert flies and arthropods since then, I see.”  The Oomu glowed—a full-body flicker of iridescence—at this compliment.  And the woman looked the part of an early integrationist, too, with waves of platinum to rival the man’s wiry chest hair and laugh lines that also carried their sorrows. Second-through fourth-gen had better ways of weathering this land, but first-gen had been born fresh from the ships, with neural uploads from Tierra-Prima, yet little muscle memory from their base models. Maia had not gone easy on their bodies during that first vital learning curve for the colony on whole.  At the word “smaller,” though, the man’s gaze darted anxiously to the crest of the Oomu’s shell, then all around them. “The youngling and the egg. Where did—are they—?”  The woman made a set of moist popping sounds for the Oomu’s benefit, before repeating herself for the others. “You see?” she said, after its tentacles drooped in reply. “I told you. Just a big misunderstanding. He wasn’t going to hurt or betray you. He’s as worried about them as you were.”  The man felt a more concentrated heat blooming in his chest.  “Well of course I wasn’t going to hurt or betray it. Honestly, after everything we’ve been through together, how could you think for a second that I’d—?”  The woman raised a hand against the man’s outburst, but the kid answered first, with half-lidded eyes, and that soft, flat voice.  “I didn’t think you’d really let me go.”  It took the man a second to realize that the kid was neither addressing the Oomu, nor talking about being trapped inside the giant mollusk’s under-mass. He looked between the two of them: Surprised, then hurt, by the link that seemed to include everyone but him. “I . . . ”  The woman approached him with a clear effort to be gentle. “It tells me that you weren’t much of a talker, all these years. Not about anything deep, at least. And it respected that—respected that maybe there were things you weren’t ready to tell it. But it took a lot out of our friend, to be with someone like that for so long, even with all the struggles you overcame together.”  The man noticed that he was wringing his hat in both hands—and so hard, it looked more like a washcloth. He willed himself to relax his hold, letting the hand fall slack to one side. “‘What does that even mean, ‘someone like that’? Don’t you know me? Haven’t we known each other all this time?” He raised his free hand to the Oomu, but the Oomu declined to take it into his mouth, to receive the proffered trust exercise. The man let this hand fall slack, too.  “What our friend means is . . . someone who never leaves an inheritance,” said the woman. “It’s different for their kind. You know that. I know you do. You’re still well known for your early fieldwork, you know, even if you’ve gone to great lengths to try to disappear ever since. I was so busy on the lab side, myself, that it’s no wonder we’ve never met, but even the kids today learn about you. Or at least, from the idea of you. From the stories others tell of your work’s impact.”  But the man shook his head, not willing to be baited into a conversation about how little he ever stuck around for symposiums, or professional mingling of any other common human type. The barrens, the steppes, the mountains, the valleys: all the spaces in between colonists’ grandest dreams of new and far-flung human civilization had always suited him better.  “It doesn’t lay eggs,” he said. “Never has. Never will. How’s that any different?”  “No? Really?” She turned to the Oomu. “Not ever?”  The kid, mumbling as if in a dream, replied in its stead: “I donate my memory to other broods—and like this, with some of you. But what memories do you pass on? What future generations are you nurturing among your own?”  The man stared at the giant mollusk.  “Is that what this is about? You didn’t trust me to let you go because I don’t share my memories with others?”  “Put yourself in its—ah, foot,” said the woman. “So much is blended in the Oomu’s world: Past, present, future, selfhood, otherhood . . . If you hold memories so tightly, is it really a stretch to think you might hold other things tightly, too?”  The man pursed his lips, displeased with how reasonable that sounded. “Okay, fine, maybe,” he said to the mollusk. “But in what universe, exactly, could I stop you? If I got in your way, what was ever to keep you from swallowing me up, like you did with the kid? Or worse, with the—”  But the man didn’t like to mention the other incident, so he cut himself short. Moreover, he could hear the dishonesty in these questions even as he uttered them, for of course the man could stop the mollusk, once they got to Capitol City. The man would be overseeing all arrangements there, and he could easily find the excuse, and the means, to turn the Institute’s staff against its request. Granted, it wouldn’t be impossible for the Oomu to pursue its plans solo, but it would be much harder. Of course the Oomu had a vested interest in not swallowing its rider whole.  This time the Oomu’s response came through alternating tentacles: One extending and receding, then the next, and the next, until all had had their turn. “Maybe so, or not,” the signal read.  The woman rubbed the Oomu’s tensing neck in reassurance.  “With silence comes a cost,” she said to the man. “A rift, which unfortunately it seems this last journey seems to have strained between you two. Obviously, it wants to believe that you’ll be true to the decision you made at First Landing. Only . . . ”  Shame and anger bloomed in the man’s chest, and his incredulity deepened. Had they not broken up whole trafficking rings together? Rerouted a river when Oomu nesting grounds were deprived by a newer settlement? Identified Maia Colony’s first serial killer (much as the man had mixed feelings, and sometimes still-haunted dreams, after the Oomu had meted out justice before fellow humans could)? In all that time, had he really just been projecting his own need for privacy and discretion on the Oomu? Could he simply have been more open himself, and then asked his companion point-blank about all the key issues that had built up over the years between them?  Some questions, once framed in the man’s head, immediately answered themselves.  And not always in pleasant ways.  The man felt tired, very tired. And foolish.  “Where are the egg and the youngling?” he said quietly.  “Safe,” said the woman. “And the second hatched this morning—isn’t that wonderful?”  The man nodded.  “And I promise, they’ll be safe here until they’re old enough to decide their own way to go.” She patted the Oomu’s shell wistfully. “They’re just not ready yet to make the choice that this one has. For now, at least, our dear one must go on alone.”  “For now?”  The woman shrugged, avoiding eye contact. “Well, who knows what the future holds?”  But the kid’s gaze had long since wandered to the building behind her: Its deceptively innocuous metal door; its low height, and width, and volume. A bunker’s entrance. An entrance for those who feared and were preparing for the worst. The kid was seeing it now, too—the suspicions that had been quietly building in the man’s head on the way over from the runoff pond. And with that realization, for the seed-thief, came . . . vindication. A spark in those bird-bright eyes, as if it had only just occurred to the kid that a big city would be filled with people more receptive to change.  “Well now, I got a hunch,” said the kid with a smirk, “that maybe you do.”  But the scientist was unthreatened by youthful provocations. “Indeed,” she said placidly, “Still, it’s early days yet. We’re figuring out better ways of assessing the scope of the situation.”  “Uh huh.” The man noticed that the kid was now favoring the jumpsuit leg containing the wad of seeds for genetic tinkering—rubbing it restlessly against the other leg, as if to affirm that it was still there. “While towns like mine get torn up in the worsening storms.”  The woman’s smile turned bracing. “It’s neither fair nor just, I know. But our research goes at the pace it has to go. As yours will, too, if you’ve ever a mind to join us.”  Her calmness won the kid over, and to the point of overeagerness. “What, like, now?”  “Well, no, not exactly.”  She looked to the horizon, and then they all did, listening. The last of the day’s light was gone, leaving only Maia’s rings and the stars to cut through the staggering dark. The woman turned to the Oomu, her expression changed: a welling up at the eyes, a wavering in her bottom lip, a faltering in her voice. She opened her arms and lay flat against the side of its exposed under-mass: as close to an embrace as a human could manage with an Oomu.  “Safe travels, dear one.”  The Oomu slicked her in turn, and she laughed, wicking the slime from her nostrils and mouth before it crusted over. Then the Oomu turned its tentacles to the other two, and after a moment’s hesitation, tipped its conquistador’s shell to one side. The kid froze, at first.  “You want me to . . . ?”  “It needs you to.” The woman clapped a hand on the kid’s shoulder. “You hear it within you now, don’t you? That need?”  “Yeah, but—why? Why’s it gone and put this thing in me?”  And not in me, the man wondered, while watching the rest.  “Oh, no, you did that, not the Oomu,” said the scientist. “The bond started the moment you did it harm. That’s how it always goes, though in this atmosphere it’s not as easy to tell how much our actions create reactions, now is it? All it’s done is formalize that memory for you, of your mistakes and their consequences, so that you’ll never forget them.”  But this answer only deepened the kid’s confusion. “Then why’ve you got it, too?”  The woman sighed, looking past the kid to the man. At last he saw the weight of guilt, the weight of some terrible trespass, upon the first-gen scientist, too.  “Because,” she said—to him, more than to the boy—“The Oomu didn’t see any reason to respect my privacy, either, when I’d done it wrong. Or, no, let me put it differently—because ‘respect’ and ‘privacy’ are such human terms, aren’t they?—What I mean is, when I caused it harm, it treated me just as it would another Oomu—just as it’s treated you, young one. Only ever once, I suspect, has it really tried to go at this business any other way: to look outside its species standard, and to treat a human as a human would want to be treated instead. Which is an extraordinary thing, if you think about it: The thought of a human who could inspire an Oomu to try to live by his own code of conduct . . . if only for a while. He’d have to be quite the legend, don’t you think?”  The man swallowed hard and turned to the Oomu. He didn’t need to say anything to be understood; his expression held the question, Is that true? well enough. In answer, the Oomu extended three tentacles—the touch-tester, taste-gatherer, and scent-sniffer—and entwined them: the sign for “feels real, tastes real, smells real . . . is real.”  It sunk in then, for the man, just how hardthe Oomu had been working this past decade, to play the game as much by his terms as possible. And out of . . . what? Respect? Curiosity? A desire to learn humanity as best it could before moving on? Whatever the cause, the man felt a wave of quiet humility, and gratitude, in the shadow of his oldest companion’s restraint, though everything about its species longed to merge without consideration for any such bizarre human notions of choice.  And so only at the end of things between them, when the Oomu had most needed to believe that the man would extend the same courtesy to it, too, had it grown anxious and unsure. But why not? Did humans always permit others the autonomy they made such a fuss over for themselves?  “Right then . . . right,” he said, setting his hat back over his mop of white curls. He shook hands again with the scientist and thanked her for caring for the rest of the brood. Then, approaching the Oomu’s tipped shell with trembling hands—  “Come along then, kid,” he said faintly. “We’ve got one last job to do.”  5. The City  The Oomu wasn’t as jumpy in the streets of Capitol City as the man had expected—not now, at least, that the man himself was calmer, and no longer exuding all kinds of tense, private, volatile energy that the Oomu hadn’t known how to read, or if it could trust. The smells here certainly differed from those in the barrens, as did the obstacles: The cacophony of human-, car-, tram-, and mollusk-traffic throughout the sprawling grid of the largest, most dynamic settlement in all of Maia Colony. But past the towering solar farms and living quarters; beyond the energy stations and research labs; a little further out than the new-builds and the makerspaces . . . there were trees. Massive tracts of city-enclosed acreage for luxury goods and materials, at the center of which stood the immense fortress of the Advanced Biotech & Genomic Engineering Institute.  And inside it, as every colonist well knew: the Zoo.  “Well, old friend,” said the man, when they stood outside the Institute’s warehouse entrance for trucks and giant mollusks alike. “Here we are.”  But he made no move to dismount, or even to begin his very last tasks about the precarious top of the Oomu’s conquistador’s helmet: To detach the long-term storage rigs, and the sleeping gear, and the saddle. Even through the distraction of heady city fumes, the man was taking in the smell, one last time, of the early heat as it rose off the Oomu’s casing; and the feel of scuff marks and healed shell bits within reach; and the sight of what stray insect segments were still being dissolved in the translucent depths of the Oomu’s nearby skin; and how the grayest parts of his old friend’s shell just barely glinted in the morning light.  And the Oomu knew all this, and allowed it, watching the man without watching him: Pointedly turning all its tentacles in other directions, to make a grand show of giving the man his privacy for grief—at least, until the massive doors to the warehouse rolled aside, and their contact waved from the ground in excited greeting. Then the Oomu glided in, and a whole team of Institute workers thronged about to help the kid and the man unpack the Oomu’s decade-long load.  Then, the man knew, it was time for him to go.  The Oomu didn’t tip its shell for him—allowing the man one last slide, and leap, and painful protest from a knee of aging, first-gen flesh—but it did so for the kid, who eased more carefully to the ground, then awkwardly turned and patted the Oomu—tentatively—on its under-mass.  “Thanks,” said the kid, once the Oomu’s eyestalks were watching. “For not eating me.”  Then the kid slumped, eyes half-lidded, before regaining full consciousness and giving the Oomu a funny look. “Well,” said the seed-thief and the egg-killer, doubtfully. “If you say so . . . ”  Meanwhile, the man turned his attention to their contact, “the zookeeper.” There was plenty of paperwork to fill out and guarantees to be made, with a little greasing of palms to ensure that the Oomu would be given the utmost care during transition, and only the most up-to-date proven gene-therapy techniques—none of this “experimental trials” nonsense to tinker with the formula. Not at his old friend’s expense.  The zookeeper then took the man and the kid on a tour of the enclosure, while the Oomu was settled in pretreatment chambers, where the team could gradually acclimate its body to an intermediate atmosphere before it underwent the de-conversion process to its pre-species form. Ten years ago, the science of de-conversion had still been unreliable, but in First Landing, before this last journey out, the man and the mollusk had witnessed news of the Institute’s long-term success rate, and of the pre-atmospheric Zoo now being sustained 100% internally, by all manner of reclaimed lifeforms working in uncanny harmony. For the Institute, this was an achievement that would yield decades’ worth of new technologies, but for any species that carried generational memory of a time before human trespass, it was much simpler: it was a way back to the world before.  “I imagine,” said the zookeeper, once their tour had concluded, and the last payments had been addressed, “That you’d like to see your friend one last time, before we begin.”  The man had difficulty speaking, but a nod sufficed, and soon enough he was standing outside the massive medical tent where the Oomu was finally resting—flopped out, in a most ungainly way, after so tense a journey across the barrens and the steppes. The zookeeper invited everyone else to step out, to give the man and the mollusk a moment, but when they did, everything remaining in the tent seemed so light that the man thought it might all, in an instant, blow away.  There were so many things, the man also realized upon entry, that he would never get to ask now, and even more that he could never hope to understand. To think that the Oomu had gone to such incredible lengths to try to live like him, to accommodate him, to allow for his human way of being to subsume its own . . . and yet, had he even stepped out half as much himself, in all that time? Had he even tried to bridge the gap between their species’ comfort zones?  No wonder, thought the man, as he crouched before the snoozing Oomu and studied how trustingly its tentacles rested upon the tremendous see-through lump of its head: No wonder that those students, years ago, had clamored to know more about his time as a slaughterer, before he was a helper to the Oomu. Understanding the gene-therapy tools that he used in the field to rebirth other pre-species members was one thing . . . but how many of those bright young next-gens had really grasped yet that some of the most crucial transformations on Maia didn’tinvolve gene therapy at all? How many comprehended that changes in, say, a first-gen’s stricken conscience would always come from a far more complex set of forces than labs could ever quantify? And that, if recent settlements were going to stand a chance against coming challenges, they’d all need more such stark transformations of heart and mind before genetic cures could even be considered a viable recourse?  Leaning against the unconscious, sprawling body of his old companion, the man inhaled the pungent sweetness rolling off its sticky skin one last time, and whispered into it: “Thank you, you old lout. I promise, I’ll tell them everything. I won’t let the guilt go to waste a moment longer.”  And then, with a twinge of disappointment—for the Oomu had made no sign of having heard him, or of otherwise being able to rouse itself for its own share of their goodbye—the man rose with some difficulty to his feet and left the Oomu to its long-awaited journey home.  The procedure took eight days and was frightful for the man to follow from an observation booth, where he watched his old friend slowly shrink out of its shell and form a newer, more pliant one in its wake. A magnetic floor in the recovery chamber provided some of the counterforce needed to keep its fragile new body from being flattened during the process, while mild electrical stimuli allowed it to build the muscle responses necessary to adapt to the intense chemical interactions that awaited it in the pre-world atmosphere of the Zoo’s main enclosure. There, it would find itself whipped about by dense clusters of volatile fumes while clinging to various floral structures, held together by a range of other faunal allies. It was an existence the man still couldn’t comprehend the Oomu’s longing to return to, though he tried his best to imagine it in a positive light while waiting. During the transition process, too, the zookeeper would drop in every now and then, to marvel at how strange and resilient these pre-species had been—and how obvious it was why the terraforming ship had not considered the possibility of complex life here when assessing the viability of the planet’s brutal atmosphere upon arrival.  The man said little amid these attempts at friendly banter—or when the kid came to visit, chattering away about how the Institute had taken an interest in the whole seed business for frontier settlements; and how they’d offered the kid a place in an internship program where such critical skills could be formalized for the benefit of the whole colony. The man did little at all, that is, except study the Oomu in the middle of its arduous de-conversion—and start in his seat whenever it looked as though the Oomu . . . or rather, the pre-Oomu, its progenitor species . . . was in pain.  Then, late on the eighth day, a supervisor looked into the camera and flashed an “all clear,” before a team arrived to take the pre-Oomu, in its tiny enclosure, up to the Zoo. The man bolted upright and hurried to join them in time: the whole team at a minor “airlock” on one end of an enormous viewing window, through which the whirling opacity of pre-world atmosphere could be studied, even if individual forms and species clusters were often difficult to make out in the haze.  The man watched as his old friend was returned in a new form to a more familiar world.  And then he watched through the reinforced glass for hours after, trying to catch a glimpse of his old friend thriving there.  With no luck. No luck at all.  Eventually, though, the lightest touch on his arm startled him, and he turned to see the kid studying him. He couldn’t tell if he was dreaming, or if the kid was, or if they both were, when the kid said to him: “Share it all, Mister. Nothing’s ever gone completely when we do.”  But probably it was just his exhaustion talking, because after what felt like the blink of an eye, the man looked up and the kid was gone. And the Zoo was as impenetrably opaque as ever.  And the world outside Capitol City, which the man faced next, wincing at the sun with his hat held lightly in hand, was a place of more barrens than buildings, more frayed than close-knit networks . . . all of which, maybe now more than ever, seemed in sore need of a bridging of silences.  He set out for the station and its truths. Canadian by birth, M L Clark is now based in Colombia. Clark is the published author of science- and speculative-fiction stories in Analog, Clarkesworld, and Lightspeed, with work forthcoming in F&SF. Other projects pending publication include a novel in the universe of “To Catch All Sorts of Flying Things” and “Leave-Taking,” and a humanist column and podcast to launch at the end of 2021.", "text": "17570 words, novella\nMercy and the Mollusc\n1. The Eggs\nThe man woke on the wrong side of the shell and had to extricate himself carefully, lest he get any of the Oomu’s mucus over his nostrils and mouth. This was easier said than done, on account of all the bugs still hanging around topside. In his ride’s more amorous phases, its odor was deceptively sweet, and local fauna flew right into its sticky exposed under-mass. Or at least, the fauna was supposed to, but some of the bigger insects liked to linger by the man’s saddle, wavering on the cusp of their inevitable death plunge; and then the man, in his impatience with the sluggish press of nature’s greatest cruelties, would take out his glowing lead-stick and swat them into a bewildered tailspin down, down, down, into the long muscle of the Oomu’s neck and upper back.\nThe man took no pleasure in the act, for such violence only left him staring at his complicity for days, as his victims’ exoskeletons slowly sank into and disintegrated beneath the Oomu’s skin. But the Oomu never seemed to mind all the wing, leg, and stinger bits fallen into its interior, to dissolve into sustenance at whatever rate the giant mollusk deemed best. As its one long foot glided along the steppes and the badlands, the deserts and the plains, the mountaintops and valley-lows of Maia Colony’s lone and ill-populated continent, it paused only to drink in the dew from passing mists, or to nibble at another Oomu’s scent, and—if another Oomu came into visual range—to flash its corpulence from a season’s idle feasting, its under-mass suddenly on brilliant iridescent display. Then it would pause to admire the answering bioluminescent pulse, and decide whether to leave an offering, fresh from the genital spout atop its head, on the cool stone in its wake.\nThere were days when the man, in witnessing these proceedings, could almost trick himself into believing that the Oomu was at peace with its current place in the order of things and didn’t really want to leave all this behind. But little signs had taught him better, well before the difficult decision they had made together at First Landing. For one, the Oomu only ever leftofferings: Never collected them. Never formed a clutch of eggs all its own. Out of fear, or pickiness, the man had always assumed—and had to assume, for even if he’d had the language to ask the Oomu, in all their years wandering the continent together, he’d never thought to pry.\nSpeaking, though, of prying . . .\nWith a deep breath, the man upon so rude an awakening braced himself on the protruding lip of the shell and wrested his other arm loose from the Oomu’s flesh, then batted at some of the buzzing hangers-on before hooking both hands over the shell’s edge and reaching up to give his safety line a tug. His old rig took a moment to register the action before auto-cranking him back to his usual perch, high atop the Oomu’s slate-gray outer casing. The form of its shell was not unlike the helmets of ancient conquistadors (or at least, what the man had seen of them in pseudo-docs from Tierra-Prima), but the resemblance and its import would be lost on the giant mollusk, so the man had never raised this subject, either. There was plenty more listening to do, in any case. For instance, the giant mollusk inside and extending from this unwittingly parodic attire usually noticed when its rider slipped in his sleep, but as the man roused further into the dawn, he realized that the Oomu was moving strangely: swaying and swerving over a plot of desert covered in a crust of . . .\nAh.\nYes, that explained its distraction, and his fall. The sylvite in Minor Basin Six always ran a dusky orange, marking the badlands beyond First Landing with intermittent warning slashes for man and mollusk alike. Now, though, the ground was thickly coated in the salty stuff—the whole mess of it freshly uncovered by one of the desert’s recently intensifying windstorms. Not impossible to traverse, but . . . unpleasant for the one doing all the work. The man still had mucus to wick from an arm before he’d feel settled in his skin again, but once topside and secure in his saddle, he first leaned over to pat the broad, tense muscle of the Oomu’s upper back.\n“Should’ve woken me. We’d’ve found the path together. And what’re you bolting ahead for anyway, you old lout? We’ll find another way around. There’s no rush.”\nThe Oomu steadied at its rider’s touch and gentle chiding, but its eyestalks extended and retracted in emphatic disagreement with this last. The man sighed in deference to the gesture, then squashed a wide-brimmed cloth hat over matted white forelocks, rubbed sleep grit from his eyes, and squinted in the general direction of the Oomu’s peepers, which were pointing (when the tentacles were at their outermost) past the explosion of red-orange sylvite, toward the rim of an ancient crater: wide, and crumbling, and . . . smoking? A pillar of erratic puffs was twisting upward from somewhere beyond that ancient ledge: from some fixed, unknown spot along the crater floor.\nAnd it wasn’t cooking fire. Not by a long shot. The man scratched the gray-haired hollow of his chest in the unease of recognition. He knew the Oomu recognized the smoke’s provenance, too.\n“Well, well. One of those days, is it?” His wide, flat nostrils flared, and he rigged his travel pack with tools from long-term storage before unhooking the safety belt and dropping heavily down the slide of the Oomu’s casing. This time, freed from his sleep harness, the lip of the conquistador’s shell carried him up and out, and he landed with feet splayed, palm hard to the salted earth. His right knee offered a jolt of pain only as he straightened. The metal of the left creaked as he walked on.\nThe Oomu turned its five tentacles toward him—two eyestalks, a touch-tester, a taste-gatherer, and a scent-sniffer—before its forefoot curled inward, as if readying to turn and follow. But the man held up both hands and shook his head.\n“I’ll be right back. Easy now. You know how much it pains you to see this sort of thing.”\nHe hesitated after this last part: Too patronizing? Too dismissive? The trust of this Oomu had not been easy to attain, let alone to keep, and this last ride between them had an uneasiness to it that neither seemed willing to confront. Enough to undo a decade’s camaraderie? The man had no desire to risk that conversation, either, so as he crunched along a thicker stretch of sylvite, he was relieved to feel the Oomu’s agreement in unspoken compliance: Only its eyestalks following after. At the rise of the massive crater, the man looked back at the giant mollusk, three times his height and many more his weight, and waved reassurance that his own, minuscule body would be fine, before descending out of sight, into the cooler, moister atmosphere at the crater’s base.\nStill sheltered from the early sun, the other side ran heavy with shadows, cinders, and unpleasant fumes. There, in the impression of solitude that the ridge afforded him, the man shivered despite himself, but stood affirmed in his decision to come down alone. Closer proximity to the smoke already had him revisiting the remains of last night’s supper, and the surrounding detritus wasn’t helping with the nausea. The thought of the Oomu standing by him through all of this—whether it remembered its own emergence from such violent decay, or simply held memories from its generational inheritance—was beyond what the rider could bear.\nOr what the Oomu could bear, he reminded himself:\nThis was for the Oomu’s benefit, too.\nAfter orienting himself in the noisome crater air, the man fixed his attention on the source of all this fuming: An ending world. A cloud of volatile gasses that crackled and sparked not far from the crater’s edge. A pocket of the planet’s first ecosystem, its interior filled with entities furiously generating the incompatible environment they needed to press on—and losing the battle, second by agonizing second, as preceding proto-pockets had done since the humans first arrived.\nBy the size of this one, a few meters in all directions, the man knew it wouldn’t be long now before its final loss. At its base, thrown out in erratic groupings, lay the charred or desiccated husks of pre-world elements that had already succumbed: A spiny-tailed air-worm, its six sail-wings withered nearly to dust. A slew of beetles, the sort that would have glowed magnificently in the sulfuric churn of their native skies, turned to a heap of corroded shells. The sinuous remnants of a massive sky-kelp, once growing fifty meters up through the planet’s richly stratified upper atmosphere, now lying in what looked like rotted clumps of rope upon the storm-swept rock.\nHow many more preforms could possibly remain within?\nThe man knelt beside the ending world and coughed into his sleeve, eyes stinging, while he rummaged through his pack. His face mask would not endure for long in that strikingly protean remnant of an environment that the terraforming ship had all-but-eradicated ahead of the embryonic human fleet. But the covering’s use would protect him, at least, from blowback while he used his heavier-duty protective sleeves to press from this world into its own.\nThe blowback always seemed a kind of moral judgment to the man, as if the ending world were defending itself from its one true nemesis. As if it were alive. Well, and maybe it was, in its way. The man had heard stories about the pre-world that went so far as to suggest an eco-cohesion to the nebulous system: A floral and faunal consciousness, wherein extensive genetic transfer between species had been the norm, and massive viral strings in this aggregate coding had made of the whole far more than the sum of individual species’ parts. Were such stories just the stuff of children’s vids? Perhaps. But even on his approach, this proto-pocket bucked and twisted as if anticipating his trespass into it, and the man caught himself speaking aloud as if to a sentient mass.\n“Easy now,” he said as he switched on his visor and cut through the spewing fumes to make out the interior’s contents. “Easy . . . ”\nFor a heartbeat, the man entertained that the fumes would part to reveal an affirmation of the grandest of those local fables: something resplendently alive and resilient enough not to lose its battle against the current atmosphere. But it was only ever a split-second’s dreaming: In point of fact, as the man had more pragmatically suspected, little now resided in the ending world before him. A few branches and spores were sustaining its micro-atmosphere, while tiny arthropods scuttled from twig to twig to keep the floral structure tightly bound; and a clutch of eggs floated in an algal mesh, the latter serving as a kind of filtration system for the cloud on whole.\nThe eggs, though . . .\nThose were progenitor eggs, from the Oomu’s prior species.\nThe man’s stomach knotted as he counted them. Eight in total. He fumbled for a vial in his pack and grimaced after holding it to the light. Not enough to save them all. Still, he retrieved his incubator console and suited up in earnest: Tugging on protective sleeves and torso shielding, then securing neck flaps around his mask before easing both arms into the ending world. With one hand holding the incubator’s open hatch under the mesh, he nudged four eggs loose, trying not to make deliberations about which ones looked “best” or “most viable” as he worked. He knew he had to be quick, either way, for the whole ecosystem was reacting violently to his presence: Its failing atmosphere pooling, parting, and surging dangerously around the foreign equipment, almost as if testing his flimsy armor. All the man’s movements had years of practice behind them, though; and so he only struggled once, in the instant that both arms and incubator had fully withdrawn from that furiously shrinking whole.\nStumbling back from the force of the proto-pocket’s answering bellow—a resounding clap and exhalation, as if somehow cognizant of its latest losses—the man coughed and wheezed awhile before setting the incubator on the crater floor and studying the wisps of alt-atmosphere clouding around the rescued eggs. Not much time for a full transfer, at their current dispersion rate. The man plugged the last of his vial’s contents into the incubator’s processing chamber, which in turn applied a dosage apiece to tiny patches that an internal arm then affixed to the side of each egg.\nGRAD ACC? read its tiny console. But the man had traversed the desolation between settlements long enough to know that “gradual acclimation” would not work well on his sort of journey. Too many risk factors out in the baking sun, and along the restless rocks, and when taking shelter from the intensifying storms. ACCEL, he entered instead. As with his safety line and his knees (metal and flesh alike), the man’s incubator was an older number, prone to long processing times, but not so long that he was worried. After a minute’s blinking on the console, the interior warmed and moistened, and telltale signs of activated gene therapy could be seen on the eggs’ surface, while the air around them entered a neutral state capable of supporting life through the transition. The man studied the fragile, glistening creatures in his care, then looked back to the agitated plume of their doomed homeworld.\n“Sorry,” he said to the proto-pocket—and meant it, whether or not it was truly “alive” and could hear him, let alone understand the significance of his words. Even if he’d had enough fluid for all the eggs, he never carried the right formulation for the arthropods, or the rest. Rider bias, he supposed. Besides, there was only so much space in his pack or on the Oomu’s back. And stars above, if all four eggs survived the process, they would become massive carry-ons soon enough. Still, it seemed its own form of cruelty, to rescue some from certain death with such efficiency, then walk away from all the rest. Earlier—decades past, when ending worlds roamed wild across the continent—the man had sat with six in their last hours: bits of flora and fauna dropping from each as it shrank, and fought back, and shrank again . . . until a critical limit was reached, and the center could no longer hold. That was the dangerous part for any humans in attendance: the abrupt, gasping burst of those last fumes, which then scattered every which way into the surrounding air. In the early years of the colony, teens had even made a game of it: how close you could stand by an ending world, and for how long, until the risk wore you down.\nOr, on occasion, until some part of it struck you head-on, and you died.\nBut taking up with the Oomu had changed all that for the man—the fool gambles, the furious indignation at the mere fact of existing in such a time and place and body in the universe as his—and now he knew better than to idle at any length on the crater floor, not while the Oomu would surely be anxious until it saw him crest the rim in one piece again. Certainly, it wouldn’t bolt, not with the salt-sands being what they were; and it wouldn’t hasten after him, either, but . . . it would remember. Other abandonments. Other losses. And an Oomu’s memories of grief were not to be trifled with, or added to, as the man had learned the hard way, years ago.\nWith at least these four eggs secure, the man doused, removed, and returned all protective equipment to his pack, which he slung over one shoulder while holding the incubator in both hands. It wasn’t the easiest way to make his precarious return up the crater’s incline, not with the metal of him giving such obvious complaint, but the arrangement was still to his preference. There was something about seeing the little machine at work and holding it firmly in his grasp as it did that gave the man to believe he had some control over the hardness of this land’s outcomes after all. Just so long as he didn’t look back at all that he’d left behind.\nWhen he popped up over the crumbling edge, into the rising heat and brightness of the desert day, the Oomu made a soft sucking sound: Something between curiosity and relief. The man smiled in clenched-teeth gratitude and nodded back.\n“Not sick of me yet, huh?” he said, too softly to be heard. “Well, there’s still a few days left for that, I suppose.”\nPeering through the condensation along the incubator’s interior, he then held up the tiny vessels of life: Four ships in silent running between two differently volatile worlds. At first, the gesture was for the Oomu’s benefit, so it could see what he had done out of its sight. Next, though, it was for his own: To view these tiny eggs in contrast with the giants they would soon become. To imagine the size of things created by his own two saving hands.\nBut the man’s mild contentment with his labors ebbed with every creaky step over the massive spray of sylvite along this stretch of Minor Basin Six; and even as the Oomu tipped its conquistador’s shell to allow him an easier climb back to his perch and their shared holdings, the man’s thoughts drifted to his own embryo-pod, back on the Ignacio, despite his having no direct memory of living in the thing. What humans lacked in direct memory, though, they made up for in mental visualizations built around objects revisited in their lifetimes. And so, as the pair headed off along the clearest path they could find among the livid-orange rocks, the man imagined his own egg streaking along in the incubator of that ship, alongside others in his clutch, toward a trauma beset by bots upon a world that no one had foreseen being populated when the mission first set out.\nThe pressing question, older than both his knees combined, reemerging as man and mollusk put the crater and its sputtering pillar of smoke out of visual range:\nWas it always better to be reborn?\nAgain, the man could have asked the Oomu its opinion—there was language enough between them for that—but he preferred not to. He didn’t want to come off as challenging what they’d agreed upon, even though the Oomu’s choice was proving harder to accept the closer they came to Capitol City. It was bad enough his body already seemed to be radiating feelings about the impending loss of so old a companion. What good could come from talking out a done deal now?\nBetter to pretend, as the man then decided to, that when it came to such massive, world-transforming questions, no one answer would ever do.\nStill, he held the incubator tightly in both hands, rubbing the surface of the enclosure with two restless thumbs for a great while longer, before finding the heart to set it down.\n2. The Kid\nDistant stars and the light off Maia’s largest rings kept man and mollusk company as they cleared the sylvite-laden badlands and sighted a small settlement on the thin line between the barrens and the steppes: a barrier town, two days by Oomu from Capitol City, that could have been mistaken for another sort of ending world, by the looks of its meager internal holdings and the state of its surrounding farmland. Here, too, lay signs of a recent windstorm—but also, from the look of the machinery tossed and shredded in the fields, of at least one prior storm as well: as if the town hadn’t properly recovered from the first before the second came bearing down.\nAgain, the Oomu held back, swaying and swerving as the settlement’s devastated agri-plots came into view; and when the man tried to urge it on with his lead-stick, the massive foot halted entirely, while one eyestalk whipped around to study—or interrogate—its rider’s insistence that they press on after it had so clearly expressed its doubts. The man understood the severity of its concern, then, and set down the lead-stick to show that he was taking the Oomu seriously.\n“Getting protective, are you? Well, I’m not going to trade them. I promise,” he said. “Look, they’re in our care now—see?” And he reached back for the incubator, which he’d snapped securely between a balance of gear behind him, under a tented shelter along the shell’s upper ridge. The eggs were much larger and heavier in their genetically altered forms, as befitted creatures that would soon crawl upon the earth under a highly oxygenated atmosphere, instead of sailing upon breezier and more porous fauna through the dense, tempestuous fumes of pre-world atmosphere. The man had a thought then, and raised the incubator to eye level, squinting at the coloration of its contents. “Hm. Maybe time to take them out, even, but let’s wait until we’ve got this town behind us, hey? Looking pretty close now, but I’d rather we had some feed on-hand for the moment they burst.”\nThe Oomu extended its other eyestalk to study the shells, their healthy wet sheens a sign of the augmentation’s success, while its first tentacle continued to watch the man closely. The man tried to quiet his disappointment at the Oomu’s suspicions, but the time this was taking tired him, and he had to set his jaw against saying something that they would both regret. It wasn’t him, he tried to tell himself; and it wasn’t the decade they’d spent together. Some wounds, for the Oomu, were simply bound to resurface from time to time. Maybe a taste on the wind had set this one off. Maybe the look of this town. Or maybe this town, exactly, from actions in another colonial mood.\nWhatever the reason, only when the Oomu’s second eyestalk started to withdraw—a sign of at least momentary satisfaction—did the man lower the incubator in his hands and shelter it anew.\n“Can’t say I blame you,” he said with a sigh. “But can’t say I’m not a little hurt by it, too. Never gets easier, I suppose, living with more than one truth about my people in the balance. But Capitol City’s near enough, you hear? This might even be our last real pit stop along the way.”\nAt this reminder, at least, the Oomu seemed to brighten; and after allowing the man to give it a hearty pat on its upper back, it followed his directions without hesitation once the man had raised the lead-stick again. The man’s confidence, though, was not as quick to return. If even a small settlement could trouble the mollusk, how would it handle the impending metropolis? The bustle of traffic, the scents, the sounds, the crush of a million lives? Was it really such a good idea to let the Oomu enter? To take it right to the Institute’s front steps? The man distracted himself from his doubts by studying the upturned farmland as they advanced. The soil was barely fertile, but still a sight better than the badlands, and the pair made good time to town limits, such as they were.\n“Hector’s Haven,” read the flash projection along the settlement’s security grid. “Pop’n: 1,417.” Then, as the man and the mollusk slid past the perimeter: “Pop’n: 1,418.” The man cast an awkward glance at the Oomu. It couldn’t read, but the man rubbed its shell in apology all the same.\n“Backwaters everywhere, no? Well, we’ll be in and out soon enough.”\nHector’s Haven followed a traditional settlement design: A main square for all its critical establishments, around which a smattering of residences stood interspersed with plots for storage, community gardening, and (according to the signage on them) future secondary production facilities. Ambitious, thought the man, considering the precarity of existing builds just beyond the grid. Then again, the same could be said of Maia Colony on whole—and was, with increasingly negative inferences, whenever he lingered near other humans long enough to absorb the latest news.\nPossibly a more foreboding sign than the state of the surrounding farmland, though, was the lack of recovery activity within the grid. Most of the movements that man and mollusk saw upon entry were mechanical: A rumble of bots clearing detritus, resetting security components, and repairing broken sections of roadway. None of them paid the new arrivals any heed. All were rudimentary numbers with limited parameters, no better than those first programmed to prepare the planet ahead of the fleet. This suited the man fine, though, and when he found an empty lot that didn’t appear to be a private holding, he invited the Oomu to wait there while he visited the square for supplies and intel. The Oomu’s tentacles tasted the air and the earth and seemed to find both tolerable, but one eyestalk set itself on the only other major item in the vicinity—a disposal unit with a blinking light—and the animosity in its stare inclined the man to think that he would need to get his business done quickly, before the Oomu spooked at some small sight or sound, then took flight and left him and all the fresh supplies behind.\n(It had been happened before, and the man had no desire to spend the days it sometimes took to track down the mollusk, which could make excellent time solo when it wanted to.)\nThe settlement seemed marginally more animated, at least, as the man neared the main square. There, a few wizened citizens even went so far as to exchange nods with him as he passed the general depot and stepped into the makerspace, where a woman at the service counter jutted lips at his knee without needing to be asked what was wrong.\n“Helluva squeak you’ve got there, ah—” She glanced at the faded name tag the man often forgot was still affixed to the threadbare front of his old military attire. “Orozco?”\nShe said the name with a soft c in place of its k and broke the syllables oddly—“oro” and “zco”—which gave the man pause, trying to place the nature of her question. As he wasn’t in the habit of being addressed by any name, he didn’t bother to correct her once he’d figured it out.\nRather, he braced his artificial leg on a stool by the service counter and revealed the rest of its battered assembly. “Got something to keep the dust out, you think?”\nShe leaned over the counter and whistled. “You could almost play it like a harmonica, couldn’t you? Are those chew marks or acid?”\n“Reminders.” The man rubbed the largest hole among them, right where the knee joint glinted through.\nThe townswoman didn’t press. “Ever thought of a new casing?”\nThe man scratched under his hat and sighed. “Got a mold you could do it quick with?”\n“’Course. Gimme an hour and I’ll have it printed right up around it. Skin-matched, or—?”\n“Chrome, if you can. Kind of enjoy the cyborg thrill of it all.”\nShe smiled, then beckoned for him to hand over the limb for servicing. The man unhitched it with ease, then took a crutch in exchange. Wooden number, to his visible surprise.\n“From Capitol City,” the woman explained, before he could ask. “They’re doing wonders with their terrariums and plant yields these days. Every now and then, they like to send us lesser folks on the outskirts, oh, I dunno . . . little reminders of how much better off they have it.”\n“Hm.” The man held the burnished wood to the light, where it gleamed a deep whisky gold. Something about the material seemed both familiar and deeply estranging—which just went to show, he decided, how long it had been since he’d seen a tree even in a docu-vid. “I did notice the winds around here haven’t been too kind.”\n“Not for many seasons, no.” The woman folded forearms over the counter, warming to the chatter. “Some say Maia’s finally starting to push back. Might be something to it, too—at least, to hear tell of what the geologists think is going on down below, and the trouble they’re having out at the climate-station these days. But who’s surprised by any of it, really? Only so much you can terraform the surface without fundamentally realigning the core, y’know? And stars above, it’s not like we have the resources for a second attempt anytime soon.”\nShe was preaching to the choir, and they both knew it, but she did this so pleasantly that the man held his tongue on his own share of bad news. Even with the ease of her pessimism, he figured it might shock her to learn just how many ending worlds were popping up in the badlands again—each an indication that it wasn’t just basic geology fighting back, but that also, somewhere on Maia, fuller pockets of pre-world life persisted, and were sometimes launching little colony-ships of their own into the toxic ether of the human realm. But what good would such knowledge do her, anyway? The man recalled peering into that latest ending world along the crater floor and counting what strange species still eked out a paltry living there. As he scanned the rest of the makerspace, where a handful of local craftsmen were refining printer-plans of their own, and older folks were simply whiling away the afternoon in fuller company, he had to make a concerted effort not to catalog the curious holdings within this ending world as well.\nInstead, with a rap on the countertop: “Thank you,” he said.\n“One hour.” She hefted his artificial limb in salute, then retreated into the back.\nBut the rest of his errands hardly took twenty minutes at the general depot: Medical supplies, food for one man, treats for a full-grown mollusk, calcium-booster for four imminent young ones, and a new energy cell—all from one service counter with a bot ill-programmed for decent small talk. The man debated seeking out a nearby drink and testing the other locals’ misery around it, but something about the Oomu’s reluctance at the outskirts of town had him turn for the lot instead, a hover-trolley with his purchases tagging close behind.\nThe man hated when his instincts were right.\nJust as he left the main square, he saw large, twisting movements in the distance: The sort that seemed to signal a giant mollusk in distress. His crutch hit the gravel hard as he hastened over to the lot—the trolley whirring frantically to keep pace, while all other bots in the vicinity continued with their oblivious labors. His mind filled with fragments of other confrontations the pair had faced in their decade together: shattered shell bits in a rapid-onset desert storm; gaping under-mass wounds from a confrontation with a stinging mudfish by the coast; and a frightened withdrawal, for months, into the safety seal of its conquistador’s apparel, after a particularly vicious run-in with southern poachers, while the man sang to it from the camp he’d made in the outer world. But the scene on arrival instead had the man torn between instantaneous relief and a different sort of fright:\nFirst—The Oomu was fine. The Oomu was fine.\nOnly, the same couldn’t be said for the human stuck in its translucent skin.\n“MISTER, HELP!” the kid cried. “It’s gonna eat me!”\nThe man swore in two tongues and waved his crutch wildly while shouting at the Oomu, whose tentacles were fully extended and twisted about to observe what was going on along the side of its under-mass. Which meant . . . the Oomu wanted this. This was no love-season mistake.\n“Hey!” said the man. “Hey, ho there! Whatcha think you’re doing? Let the kid go.”\nBut the Oomu only jabbed an accusatory eyestalk at the top of its shell. When the man followed the Oomu’s gaze, he saw it, too: their packs torn loose and clearly ransacked; all the safety line’s metal parts stripped; and the incubator . . .\nBlazes, the incubator wasn’t up there at all. The man’s gaze darted about, and soon enough found it lying on its side, on the ground.\nThe man dove for the eggs.\n“Hey—hey, mister! I’m dying here! Can’t you see that?”\nThe man watched his hands tremble over the fallen enclosure. Two eggs had been crushed: Their contents lolling in unresponsive pieces, impaled on bits of broken incubator. A third had cracked just enough that the Oomu inside was struggling to breathe. The man eased it from its shell, to give it a chance of transitioning properly to the aerated world, but it didn’t look well at all, and sat limp in his hands even after he’d set it free. The man laid it on the ground to recover further on semi-cool stones, then fished around for the fourth. Intact. Cushioned in the fall by its broken siblings. Still waiting to be born. The man shook out broken pieces of the enclosure, cleared the bodies, then set the egg back in the incubator’s base, along with its struggling sibling.\nThen and only then did he stand to address the kid. He tried to keep his voice level.\n“You make a habit of tossing what you don’t understand?”\nThe kid was still uselessly wriggling, as if that could ever be enough to pull free.\n“Please, Mister, I’m sorry—I didn’t know they were worth something. They’re like, collector’s items, right? Well, I’ve got some of those myself, okay? I’ll show ’em to you, even, if you’ll just—please, this thing, it’s going to—it’s gonna—!”\nThe man’s arms coursed with a heat he never enjoyed feeling, and all the kid’s pleading only seemed to make it worse. He turned to the Oomu’s massive head and held out both hands to be tasted: the sincerity on them, and the sorrow.\n“You were right, my friend. I should’ve listened. We could’ve waited ’til Capitol City.”\nThe Oomu’s tentacles swept heavily over the man’s hands, his arms, and his head: agreement, distress, grief, and questions.\n“I know,” said the man, resisting the urge to wipe his face of the Oomu’s overly sweet muck. “I know. We’ve got two of them left, I think. One’s not doing well, but it could. It still could. In the meantime, though, please—this one’s not much more than an egg for us, too.”\n“Wait, those’re its eggs?” The kid’s face fell: the gravity of the offense finally registering.\n“Close enough,” said the man, his gaze locked on the Oomu’s extended tentacles. “But like all Oomu, they carry whole lifetimes of memories. You just killed two full histories of the world before our own, kid. Maybe three. And you’ve broken the heart of this Oomu, too.”\nThe kid startled both man and mollusk then, by beginning to cry. An arm, a leg, and part of the kid’s torso had sunk into the mollusk’s skin, but one hand remained to press hard at both eyes.\n“Mister, I didn’t mean it. I’m sorry. I slipped; I didn’t toss it. Honest, I didn’t.”\n“Didn’t mean to be stealing from us either, I guess?”\nThe man was ready for a hangdog look and more excuses, only to be surprised again.\n“Oh, no, Mister, one hundred percent I meant to be stealing.” The kid was now gulping air to fight back panic. “But just that, I swear. It’s hard times out here, don’tcha know?”\nThe man didn’t answer, willing his own breathing calm before extending one hand for the Oomu to take entirely inside its mouth. A trust exercise. Then the man waited, watching the Oomu’s contemplative tentacles, while the grind of the Oomu’s radula registered along his wrist. He tried not to think of the thousands of teeth that radula represented. They weren’t for eating, not necessarily—not with the efficiency of its skin-system—so much as for building: For tool creation, and later use. For snapping pre-world branches into sizes better suited for egg enclosures. For building adult shelters against the worst of the fumes’ electric storms. For breaking down large prey into manageable bits for any soft-shelled young to learn how to absorb.\n“Even a brute of an adult, you once showed mercy,” he said to the Oomu now holding his own bones and flesh in the balance. “This is a child.”\nAnd yes, the man was fudging on this last point, and he knew it, for the kid could’ve been as old as nineteen standards. But what of it? Age-of-majority laws didn’t suddenly make sages out of fools, as his own days in uniform had proven well enough. He held firm to this adjusted truth, then, to keep even a flicker of dishonesty from the taste of his skin and the look on his face.\nThe Oomu pressed down on the man’s wrist all the same. It was only a little pressure, a warning squeeze, but enough that the man grimaced: Closing his eyes and running through how much a new extremity would cost him. Then the sensation passed, the Oomu relenting, and the man withdrew a hand coated in denser slime. The man was about to thank it for its understanding, but when he glanced back along the length of the Oomu’s foot, he saw that its mercy had only gone so far. The kid was still trapped within its skin.\nThen again . . . the kid also hadn’t even been a little bit digested.\n(The man would’ve known. The man would never forget the screaming.)\nHe looked up curiously at his old companion. “What’ve you got in mind, then?”\nBut the Oomu gave few answers easily, not even in its more contented moods. Now, it simply curled its forefoot, turned, and started for town limits. The man followed for a few steps, then swore to himself, feeling the weight of the crutch still in hand.\n“Hey, hold up,” he said to the Oomu. “Hold up! I hear you, okay? We’re going. Just, let me load up and . . . and . . . blazes, listen! Listen! Don’t you remember? I need two.”\nHe pointed to one foot, then the space in lieu of another, and waited for the Oomu to notice the gesture—which the mollusk did eventually, if grudgingly, before relaxing its own foot anew.\n“Wait, whaddya mean we’re going?” said the kid, after making the mistake of trying to push off the Oomu’s under-mass as it turned. That free hand, too, was now trapped within the mollusk’s skin, while the rest was sinking deeper with the Oomu’s every move to leave.\n“Oh, settle down, kid,” the man snapped. “You haven’t been eaten yet, have you? No? Well, all right. That’s a start.” But then, hearing the irritation in his voice, and casting a guilty look at the vivid redness in the kid’s eyes, he added: “Parents around?”\n“No.” The kid choked on more frightened tears. “I’m a podling.”\nWith the mollusk temporarily at rest, the man had had a chance to turn to the controls of the trolley, which he was reprogramming to follow the Oomu instead of him, just in case. But his hand hovered over the input panel at the kid’s reply. “A podling? Here?”\nHis question was met with a despairing laugh.\n“Well, yeah. Especially here. You think they could keep this dump together any other way?”\nThat sounded about right, once the man had turned it over. He couldn’t imagine many citizens of a struggling settlement being in the mood to create life by any harder means—although, the downside was that the podling way tended to cultivate less fondness among the elders for the new-forms, which in turn meant a greater hardness, and intolerance, toward all their youthful errors. “Fair enough. So, no one will mind, then, if you’re gone—I mean, just for a little while?”\nThis last part, the man added quickly at the sight of the kid’s wide-eyed terror: to reassure the little thief, even if he couldn’t tell whether the kid had any right to be so scared.\nOnly the Oomu knew that part.\n“Mister, please . . . please don’t leave me here. If I’da known, if I’da only—”\nAnd the kid went on, somewhat incoherently, about intentions and unintended outcomes, while the man shook his head, returned to the input panel, then installed the broken incubator and its contents atop the hover-trolley, carefully penned in by the rest of their supplies. Lastly, he raised his hands to the Oomu’s tentacles, fingers splayed, and flexed his fingers a few times to emphasize that he was counting, before flashing a firm ten digits until the Oomu echoed the gesture with its tentacles, twice. They’d trained on this a few times, but though the man knew that the Oomu could understand human timekeeping, he also knew that the Oomu was often of a mind notto.\n“Ten minutes,” he echoed aloud. “Please—just gimme ten, and don’t scare him, or they’ll all come after you with everything they’ve got.”\nAt this last, though, the kid’s face lit up with another fool idea, so that the man had to whip around and jab a finger in the air. “Oh no, don’t you dare. Trust me, if you value your life, you won’t call for help. You know how fast an Oomu can dissolve a body if it panics? Do you?”\nThe fool idea fell from the kid’s expression, along with everything but a sickly pallor.\n“Okay, Mister. I promise. I won’t.”\nThe kid’s voice was barely above a whisper now, which inclined the man to take this promise as sincere. The defeat in it, at least, he could believe. He started off to retrieve his leg.\n“Only . . . please hurry?”\nThe man hesitated, his back turned to what now truly did sound like the pleading of a child. A note of compassion, he knew, was called for—but out the corner of his eye, he could still see the two shattered eggs, and the pierced flesh of their contents, drying out on the gravel.\nIn silence he pressed on.\n“Not quite finished yet,” said the townswoman. “Just past the mid-calf. Fifteen minutes?”\n“Can’t, sorry.” The man started organizing chits on the service counter. “I’ll still pay in full, of course, for your time and the effort.”\n“Gonna look pretty funny with a half-finished mold.”\n“It’ll match the base model, at least. Always looked pretty funny myself.” The man crooked an awkward smile to illustrate his point. “If, ah . . . if you don’t mind?”\n“Not at all.” The woman withdrew to the main workshop, a partition opening just long enough to reveal the near-deafening whir and grind from a series of massive printers. Most, the man knew, were producing building materials. Maybe some were also dedicated to the intricacy of farming equipment, or to barricade blocks to try to keep out the intensifying winds. Either way, only a few would be for specialty projects such as his, along with the fiddly bits needed to keep local machinery in check. Dedicated luxury models, for the use of finer materials and the printing of their potential creations, were for settlements in far better straits.\nThe woman returned promptly with his half-finished leg, then smiled apologetically while she counted out the chits he’d left on the counter: The half-hearted guilt of one settler’s less-than-complete trust in another. The man felt a share of guilt in turn, but only for his own soreness outside town limits with the mollusk. If even humans couldn’t manage trust amongst themselves most of the time, why’d he have to go and feel so raw that the Oomu’s was even harder to keep?\n“Thanks,” he said. “Hey, you got a kid around these parts, late teens, podling, the kind with sticky hands, who gets into trouble more often than not?”\nThe woman snorted. “This one steal from you? Works quick, if it’s the one I’m thinking of. Some podlings have the gift in their bones, I think. Want me to call a Monitor?”\n“No, no, nothing like that. Only, I figure someone here should know they’re with me for a bit, to work off a debt. If anyone asks, I mean. I’ll try to have them back as soon as possible.”\nThe woman held up her hands in a say-no-more gesture. “If anyone bothers to report a missing pickpocket and crop-thief, I’ll let ’em know.”\n“Crop-thief? I thought the winds were doing that well enough on their own.”\n“Well, crop-remnant thief, at least. Claims to be preserving the seeds, but we’ve got servos to sift through the debris and replant the next crop. What in blazes we need special stashes for?”\nThe man scratched the damp brow under his hat after getting his right limb hitched up again. “That why the kid’s going hungry and foraging alone?”\n“More or less. Here we work together, or we don’t work in the system at all.” The woman shrugged. “You know how it goes. What drops off along the way is just nature’s way.”\nLike the beings inside the proto-pockets, or the massive insects that hung about the Oomu: not quite ready to die, but also already lost to the living—although the man couldn’t decide if the townswoman’s declaration better suited the fate of the kid, or of any settlement so quick to cast off whatever human resources it still had at its disposal.\n“’Fraid I do,” he replied, setting the crutch down by the counter. “That, I surely do.”\nOutside, he peered down the main drag of Hector’s Haven while adjusting his pant leg over the half-finished mold. No sign of the Oomu having bolted, and no mob gathering in the lot, thank the stars. He walked back quickly but warily, more attuned to the faces nodding in passing, and also to the bots still dedicated to recovery labors. What else could he have said to that woman? If the kid had belonged to someone—been hers, even—would there have been any use to his deliberations as he approached the lot? The terrible heat had left his arms now, but its antithesis, a coolness of resignation, ran the length of him instead. There would be no forcing the Oomu to let go of its catch, and anything less than an instant death blow would see it and the kid destroyed. Unless the Oomu relaxed its hold, the kid was simply forfeit: One life for two legacies. Unless . . . ?\nNo. No, the man tried to put aside all foolish human scheming of alternatives as he entered the lot, where he noted that the kid was now stuck up to the shoulders of a settlement-issue jumpsuit in the Oomu’s translucent under-mass. The little thief seemed calm now, too, but the man wasn’t ready to call this an improvement yet. The Oomu’s under-mass harbored a narcotic it used to keep its prey from causing damage as it struggled, and probably that was starting to kick in here. Only, the drug alone didn’t explain the kid’s deeper immersion in the mollusk’s skin.\n“What, haven’t learned to quit struggling? Had to dive in even more to figure that out?”\nThe kid’s reply came sleepy and slow. “Nah, it told me to get in. Easier this way, for travel.”\n“It told you?”\nThat did indeed sound like the narcotic talking. The man had never put the Oomu’s slime to the test himself, but he believed the rumors; and if that drug was starting to affect the kid’s perceptions . . . well, it already wasn’t healthy for the kid to stay immersed for long, not when a human’s skin needed to breathe in its own way, too. He tried to remember if the paralysis caused by an Oomu’s toxins was permanent. Too little ever survived submersion in an Oomu for the man to have properly observed its long-term side effects firsthand.\nHis memory ultimately failing him on this accord, then, the man gave up and approached the Oomu’s tentacles—all five of which were out and flexing. Once, twice, and then just two of them.\nTwelve.\nTwelve minutes.\nHe didn’t know whether to laugh or cry as he set about loading their supplies.\n“You’re counting too fast,” he told the mollusk as he worked. “It was nine, tops.”\nThe Oomu offered what the man took for a shrug, then used its radula to help hoist some of the larger items topside. Soon enough, the man was ready to send the hover-trolley back on its auto-return path, then check to see that the drowsing kid still had a pulse. It seemed strong enough, but how much longer would that last? Hours?\n“You sure you know what you’re doing?” he said to the mollusk. “This is still a life, you know. Revenge won’t bring back the other two.”\nIn lieu of reply, the Oomu tipped the broad helmet of its shell to one side, to help the man climb up again. But the man hesitated now, as the Oomu had on their approach to Hector’s Haven. An uncomfortable disconnect was growing between the pair with every turn, it seemed, on this last journey together—and the Oomu surely sensed it, too, because it withdrew a touch to survey the rider, then cast an eyestalk toward the kid and, ever so slightly, allowed more of the kid’s shoulders to protrude. Proof that it could let the egg-killer and crop-thief go, if and when it wanted to.\nBut that gesture of peace also only affirmed, for the man, the immensity of the Oomu’s power over both him and the kid, and so he knew that he had to respond to its show of leniency with deep appreciation. Push too hard, demand too much more at such a delicate moment for all three of them, and the Oomu might grow impatient and withdraw its act of generosity altogether. Even now, the Oomu was still watching him, waiting for the expected show of gratitude, and so the man forced a smile in thanks. When the Oomu dipped its shell again, he climbed on—realizing, as he did, that the trust of a human could be every bit as difficult for an Oomu to keep.\nThe only difference was . . . well . . .\nHe had to hope that his trust was something the mollusk didn’t want to lose.\n3. The Oasis\nThe man sang to the mollusk on the first leg of their journey out from Hector’s Haven (Pop’n: 1,416, the sign read after their exit). He knew he didn’t have much in the way of natural ability, but figured that the passion with which he offered up Tierra-Prima vallenatos had to count for something. After the second or third rendition of each, he took to interspersing their lyrics with explanations about the human loves they depicted—the old loves lost; the loves one couldn’t bear to imagine losing; the unrequited loves; the men who had never found anything to love at all.\nDid the Oomu understand the general thrust of any of them? Could the Oomu, with a heart bag used as much for waste disposal as for the free-flowing circulation of blood between organs, ever make sense of the tensions that could strain a human’s own? The man had no answer, and no idea even how to pose the question in a way he could be sure of the Oomu understanding—but he knew the difference between when the Oomu was genuinely distracted, and when it was merely feigning indifference: Its tentacles turned away to study anything other than the goings-on high atop its shell. Signs of the latter, in this case, gave the man hope that it was listening after all.\nNot that the man was simply resting while the Oomu carried them to Capitol City: Hooked in, he sang and commentated while moving along the shell’s central ridge, to set up a nursery for the still-struggling infant Oomu and its sibling (which, for reasons the man could sympathize with, at this juncture seemed content to remain unborn). Building their shelter was delicate labor, with supplies needing to be adjusted to create a “floor” extending out from the shell’s ridge, and ballast on the other side; but the greater challenge was doing so while large insects yet buzzed in the uncertain allure of the Oomu’s mating-season sweetness. As ever, these hangers-on exhausted the man with their heavy wing-rustle, pungent exoskeletons, and errant scratching of legs and antennae against him. Yet he had his doubts about the Oomu’s ability to control its internal biochemistry, and a general fear that the kid might accidentally get digested alongside any potential afternoon snacks—so he tried to swat them away for once, instead of down.\nEverything, the man knew, depended now on the Oomu staying calm.\nThat, and on it longing—soon, he hoped—to sleep.\nSleep, of course, was its own gamble: Half the time, the Oomu retracted fully into its shell to recharge, and this would prove an automatic death sentence for the kid. But since the Oomu had taken such care not to dissolve the thief yet, the man felt confident that it would simply halt where it felt most at ease, slacken along the whole of its exposed foot, and withdraw its tentacles to drowse until restored. Then the man might try to hook his harness into the collar of the kid’s jumpsuit and manually ease the rest free—slowly, very slowly—over that sixteen-hour rest cycle.\nThe man had an inkling, too, of just the place to coax the Oomu to take this snooze. A few hours from Capitol City (the luminosity of which was already tinting the distant horizon) lay a runoff pipe feeding into a pool surrounded by sheltering rocks: Moist, cool, and covered in all manner of succulent algal nibbles. A little oasis with nothing, surely, to drive the Oomu deep into its shell.\nIt wouldn’t be long yet, then. And all the man had to do, for now, was act as though everything had returned to normal between them.\nBut the Oomu wasn’t the only creature in need of settling, as the man realized once the kid had roused to the sound of those traditional love songs, belted high atop the Oomu’s shell.\n“Hey! Mister!” came that demanding voice from the gliding mollusk’s side. “You got anything for the headache your singing’s giving me?”\nThe man paused in the middle of dusting the floor of his nursery with calcium-booster, all the better to fortify the survivors’ fragile casings as they glided atop the elder Oomu’s shell. He tried to remember the last time he’d had another human along for the ride. Certainly, the moment he registered the kid’s voice, he remembered why it had been so long.\n“Oh, so now you’re a thief and a comedian?”\nThe kid huffed: A good sign, for it confirmed a lack of lung constriction deep within the Oomu’s skin. “Attempted thief. It’s not like I got away with anything, y’know.”\nThe man shook his head while lifting the infant Oomu into the palm of his hand. Its foot now extended from wrist to fingertip, but injuries sustained in the fall, including that lack of initial oxygen, continued to leave it looking weaker than it should this long after birth. Still, it was eating, so that was something, surely. The man settled the infant in its new nursery, then set a protective covering atop it and the egg, still nestled in the incubator in one corner.\n“Well,” he called down. “Some might say you got away with murder.”\nSilence. Enough that the man braced himself on his half-casted prosthetic and peered over the lip of the Oomu’s shell. No, the kid wasn’t a goner yet. Just busy processing guilt, or maybe trying to figure out a better angle for the rest of their conversation. Either way, the man couldn’t decide if he was relieved that the kid had no ready retort for so heavy a charge. He retreated to his saddle and picked up where he’d left off, on the verse that had been so rudely interrupted.\nHe stopped again when he heard the kid holler something more.\n“Eh? What was that?”\n“I said,” the kid shouted, “Does this guy have a name? This giant slug trying to eat me?”\nThe man debated the merits of explaining the taxonomy of an Oomu to so ignorant a rural-settlement youth. The thought not only wearied him, but also put him in mind of a past life: The instructional halls where he’d once tried to give lectures, as a field expert, on the differences between Oomu and their pre-species, behaviorally as much as physiologically. He remembered how daunting this task had seemed, with so many eagerly cataloging eyes upon him; and then how impossible, once he’d realized that the students were more interested in his personal conversion from soldier to reclamations specialist. The sheer hunger of those third gens, to know what it had felt like to slaughter so many native lifeforms in service to the “cleanup” brigade issued after the terraform ship’s error . . .\nDid he still have nightmares from the early hunts? they’d asked him. Did he think his work with Oomu now, or lectures such as this, would ever be enough to make amends?\nJust as he had struggled for words to describe the Oomu, so too had the man discovered that he had no language for his first years off the Ignacio, which had seen him woken expressly to serve on a task force he hadn’t yet grasped the import of. Explain the Oomu? Explain himself?\nNo, the man had walked away from such failures a long time ago—and into life with an Oomu. This Oomu, with whom he could simply be. And so, he found himself resenting the kid’s ignorant remark for bringing the whole mess of these pent-up thoughts to the fore again.\nStill, he wasn’t the one trapped within its under-mass.\nHe swallowed hard to put his anger to one side.\n“Merriweather,” he said.\n“What?”\nThe man faltered. This sort of kindness had gone rusty on him from disuse, and he wasn’t sure how long he could keep it up. He leaned over his saddle and shouted down: “Merriweather!”\n“ . . . For serious?”\nBut the incredulity in the kid’s voice made the man feel a touch better. More in control of the situation after all. He smiled indulgently.\n“Sometimes Carlos,” he added. Then he straightened in his saddle and winked at one of the Oomu’s tentacles, which had risen and turned back, all the better to study either the nature of this commotion or why the rider’s singing had come to an end.\nThe kid kept quiet for a beat.\n“Okay, Mister, now I know you’re just taking the piss with me.”\nThe man shrugged—though more for the tentacle’s benefit than the kid’s or his own.\n“Ask a foolish question,” he called out.\n“But why’s that a foolish question? Is he on some sort of wanted list?”\nThe man’s smile advanced to a snort. “You’re really something, kid. Now why d’you think an Oomu even needs a name like the ones we’ve got?”\n“Well, but why not give it one? Give it a name and it’ll answer to it, won’t it?”\n“Sure, the Oomu learn our ways. ’Course they do.”\n“ . . . So?”\n“So, what?”\n“So, why not this one? He busted or something?”\nA second tentacle rose to study the man. The man held up a placating hand, then leaned over his saddle again.\n“Watch it, kid. You’re not exactly in a position to be calling anything else busted.”\n“Oh, really? Wow, that’s rich, Mister. Real rich. Look, what in blazes I gotta watch for? You wanna talk about busted, you wanna tell me if you’ve even got a plan to get me out of here? Because here I’m thinking to myself, hey, this is a pretty smart guy, all things considered, so he wouldn’t’ve let us leave the town like that if he didn’t have a plan. But here we are, aren’t we? Out in the middle of nowhere. And you’ve got nothing, do you? Unless, like, maybe you’re planning to knock this guy out for a bit? Then pull me out while he’s unconscious?”\nFour tentacles were now turned about to study the man, who had never been much for lying or otherwise concealing truths when they hit too close to home; and who this time couldn’t figure out a way to keep flickers of guilt from his face or his sweat-scent. Feeling the heat rise in his cheeks at the kid’s words, the man swore in the best language he had for elaborate phrasing.\n“Kid, listen, if you know what’s good for you, you’ll—”\nBut it was too late. The highly annoyed Oomu kicked into its highest speed: An aggressive zip usually reserved for rare encounters when it saw another Oomu so delightfully bioluminescent that it simply had to dart over and slime-crawl all over the other’s shell in fierce, fond greeting and mating dance. The man clung to his saddle and nearly lost his hat trying to stabilize himself without toppling back into the nursery.\n“Woah!” he said, scrambling for the light-stick. “Woah there!”\nBut the light-stick was a fruitless effort to maintain a sense of control he never truly had—as the man knew even as he waved it about and tried to tell the Oomu that it had misinterpreted what it had seen in his face, or smell-tasted from his sweat. Meanwhile, he could hear the kid moaning and spluttering from massive sweeps of air rushing along and under the aerodynamic curve of the Oomu’s shell (along with the occasional insect, clod of dirt, and bit of dust).\nThere was nothing to be done about the kid’s discomfort, though, until the Oomu decided to stop—which it did, hours later, ironically at the very place where the man had intended for it to take its much-needed rest. But rather than sinking into a well-deserved flop along the rocks around the runoff pond, the first thing the Oomu did when it hit the cooler, more humid air around the pipe was . . . practically shoot the kid out from its side.\nThe kid’s head hit the dirt before either arm could swing around as a proper brace, while the man scrambled out of his harness and leaped to the ground before the mollusk decided to shake him off, too. The man had just cleared the shell and turned to thank the Oomu for letting the kid go when the mollusk turned all five tentacles and its forefoot from both humans and continued with purposeful—furious—intensity on its way.\nAway from the runoff pond and its succulent algal nibbles.\nAway from its much-needed rest.\nAway from the man, and toward the bright, if hazy lights of Capitol City.\n“Wait!” said the man. “The little ones!”\nBut of course, the infant and egg-bound Oomu would be fine with their elder. Despite the latter’s ire, the man knew it would not endanger either surviving youngling if it could help it.\nStill, he waited until the Oomu had zipped far enough along that it could be mistaken for a fleck on the horizon before letting his arms fall slack and turning to the curled up and whimpering kid, who was struggling to restore mobility to all extremities. Everything appeared intact, at least.\nNext, the man cast about their modest oasis: Willing himself to be calm and look for other positives in the situation. The Oomu was angry, after all, but it hadn’t been so angry as to abandon them both at random in the steppes, or to dissolve the kid on the spot. So, maybe the Oomu just needed a moment to cool down. Maybe it would tire soon enough of being angry, and of feeling betrayed, then retreat to this ideal shelter for a good, restorative slumber.\nThe man crouched to help the kid up.\n“Blazes just happened?” The kid groaned, touching a trickle of blood over one eye before trying to clean it with the least-slimy patch on a jumpsuit sleeve.\n“You weren’t listening,” said the man. “The Oomu’s got language, ours along with its own, and it hears things. It heard you making plans, and acting like they were my plans all along, too.”\n“Well, but that’s good then, isn’t it? Like, that’s what got me out, wasn’t it?”\nThe man ignored the question. He turned to survey the pool of murky, algae-laden water, then the slime-trail streaking out toward civilization. Four hours to Capitol City by Oomu was . . . eighteen on human feet, with pit stops? Ten, maybe, if they headed instead for the climate-station that supplied the runoff for this pond, then took a vehicle the rest of the way in?\n“We’ll camp here tonight,” he said. “And then, if the Oomu hasn’t returned . . . ”\nHe jutted lips toward the light pollution: a gray-yellow haze in the darkening turquoise sky, at the end of a long expanse of desolate landscape before them.\nEven the kid’s answering silence seemed crestfallen.\nThe kid’s pockets, at least, proved useful. There wasn’t much around the runoff pipe to burn, but enough detritus lined the banks of the little pond to make a fire with the starter on a standard-issue multitool (chest pocket), while a filtration cap (left-leg pocket) helped with clearing some water to drink. Then there was the matter of a nutri-bar (shoulder pocket), which the man declined a bite of when the kid offered; and a dense wad of papers, which had spent the last day secure in the right-leg pocket, but also looked as if it had been through far worse long before.\nThe man, eyeing each item on removal, regretted that he hadn’t outfitted the upper half of his prosthetic with so much as a flask, in case of such emergencies. Then again, as a rider with the Oomu, his shows of helplessness had always been part of their unspoken agreement: No need to get rigged up every day in a jumpsuit like the kid’s, when it would only give the mollusk reason to think that he wasn’t going to stick around. The downside of unspoken agreements, though, was that the man couldn’t say for certain if even ten years of performing relative helplessness for the giant mollusk would be enough to bring it back now. He wasn’t even sure it was safe to hope.\nHe pointed, in the meantime, to the wad of roughed-up papers. Paper was a useful medium in the low-tech expanse between settlements and could be flash-formed easily enough from the right weeds, but the state of Hector’s Haven hadn’t given the impression of even hemp crops doing well. This was more of the kid’s thieving at work, no doubt, though its purpose wasn’t clear.\n“Love notes?”\nThe kid snorted, pushing long dark hair to one side with a hand that seemed to have regained full functionality. The kid’s deslimed clothes were drying on a rock.\n“Nah, look—like I told you, I’ve got stuff I been collecting, too.”\nThe other hand was still a bit stiff as the kid used both to pry apart a few layers of the pulpy block. The man leaned in, then raised an eyebrow.\n“These the seeds you been stealing from your people?”\nThe kid made a face. “My people are stubborn. They keep getting the bots to gather, store, and replant the same useless things. And, sure, those crops worked for a couple generations—but now we need something more resilient, see? Something with tougher roots, slicker surfaces. Something to withstand all these weird new storms. So, that’s what I’ve been studying, on my own. I’ve got all kinds of splices back in my bunker. Some of them so tough, you’d swear they could knock back a whole storm itself. The aim’s to get a few species to serve as a kind of double-crop—half foodstuff, half natural barrier for the town.”\nThe man couldn’t resist a smile. “They still have to be edible, though, you know.”\nThe kid kissed teeth in impatience. “Yeah, yeah, Mister, that’s what the Council said, too. So, maybe we adapt our digestive systems, right? We’ve got gene therapy for pretty much everything else on this dump of a world. Why not that?”\nThe man leaned back against a bit of protruding pipeline, a thin stream burbling behind him, and knew at once that the kid didn’t know how to read the expression on his face. Instead, perched like a wild thing atop another rock, toes splayed and long hair falling all about a scrawny, starvation-bruised torso, the kid peered at him like an inquisitive bird—but with all a human’s abiding distrust of fellow human beings.\n“What? You got a problem with that? Well, but why not try to change ourselves for once instead of our surroundings? How’s it any different than with your leg, y’know?”\nThe man shook his head and knocked on the half-finished chrome job, impeccable up to the mid-calf. “Don’t go bringing this’n into it. There’re those who think I should’ve laid in and gotten a whole new flesh number for it instead.”\n“Yeah?” The kid looked at him uncertainly. “And why didn’t you?”\nThe man considered. “Partly, because there’s history here. History I don’t want to lose or forget. And I guess I’m not sure I won’t forget, if I replace the souvenir completely.” Then he chuckled to himself. “Plus, time’s a coming when the real knee’ll give out. I can feel it. So, it might not be the worst thing, to have this old clunker to lean on when that day comes.”\nThe kid was not good at masking disagreement or distaste. “You sound just like ’em, you know. Half the time, I think the real problem with my people is that they love the hardship. Love it, like, they’d rather die doing what they’ve always done than risk something new, and have it work, and have to give up being so constantly miserable.”\nThe man found himself agreeing with most of this, but burst out laughing at the kid’s inference that he was miserable. Age always did seem a kind of agony to the young.\nIn turn, though, the kid misunderstood and scowled, going hot in the face.\n“Well, fine, go on then, laugh while I’m tryin’ to talk serious. Wouldn’t be the first time.”\nAnd the kid smashed the wad of seeds together again, set it by the drying jumpsuit, then curled up with hands tucked under shoulders for warmth, to try to fall asleep.\nAmid the kid’s theatrics, though, the man had indeed been considering a serious answer—which, yes, included saying how proposing that everyone genetically modify their stomachs was a bad idea in the current culture; but also, that the stuff about the seeds themselves showed a good spirit of inquiry and inventiveness, and reflected the sort of thought processes that the colony could use more of, to bring about the system-wide changes needed to weather coming storms.\nHe could have said all of this, and more, but the rings of Maia were starting to fill the night sky, and the pair’s meager pile of suitable kindling was almost at an end; and as much as the man liked to imagine that the Oomu worried about him when he was out of view, he was now beginning to doubt it: Beginning to wonder, too, if he’d always been projecting his own loneliness and fears upon so dear a companion. And if maybe he was, in fact, a little miserable after all.\nAnger kept him silent, then: Anger and helplessness, because if only the kid had kept away from the mollusk in the first place, there would’ve been no reason for such doubting. If only the little thief had left well enough alone for the—stars, half hour, tops!—that the man had been off buying supplies, then he would’ve been able to treasure his last night with the Oomu in their usual, relative peace, in an understated communion of silence and maybe song, instead of shivering out here more or less alone . . . and wondering.\nWondering if this first taste of aloneness wasn’t just a sign of things to come.\n4. The Station\nMorning, a poor night’s sleep on a twinging back, and the lack of a heavy sweep of greeting-slime across his face, did not improve the man’s mood. Frustration, loss, and fear for the Oomu—for all three of the Oomu—twisted in his chest as he surveyed the runoff pond and followed its underground piping in the general direction of the climate-station, carefully dug in at a wide remove from Capitol City. Even this oasis didn’t seem so innocent anymore: Nothing did. The more he paid attention to every sign of industry meant to keep the colony going, the more the man felt like they were all close to being ejected from a massive proto-pocket. But if that was to be the end of things for Maia Colony, fine, so be it: What really bothered him was the dithering. Let nature hurry up and knock them all down and out already, if it was ever of a mind to.\nHe felt a bit better, though, once the kid offered him the rest of the nutri-bar.\nAnd the kid seemed calmer, too: Dressed, long hair pulled back, pockets filled anew. A far more believable profile of a podling long since used to living on its own. In silence, then, the pair filtered more cold, metallic runoff and set out across the remainder of the steppes, surveying the low-lying brush for anything edible: Leaves, mainly, and the occasional root or berry. That silence abided for the first twenty clicks, too, but when they reached formal signs of city infrastructure, including a dirt road heading in the general vicinity of the station (to the left) and Capitol City (to the right), the kid hung back the more the man veered right.\nMeanwhile, the man’s mood had declined again in the course of their hike. “What?” he said. “Y’think I have time for more of your nonsense? If it’s in the city, it needs me, even if right now it doesn’t think it does—and all thanks to you. All thanks to all the damage you’ve done.”\nBut these baiting remarks didn’t stick.\n“Yeah, but . . . ” said the kid, in a soft, flat voice. “I didn’t go that way.”\nThe man’s nostrils flared. “Did I say you went that way? Did I ever—” Then he noticed the distant look on the kid’s face and registered the verb tense. “Say that again,” said the man.\n“I said, I didn’t go that way. I went . . . ” And the kid pointed left, toward the climate-station, with half-lidded eyes and in the manner of a sleepwalker.\nThe man hesitated, then doubled back and rested his hands lightly on the kid’s shoulders.\n“Hey,” he said, shaking them. “You awake? Or dreaming?”\nThe kid blinked furiously, noticed the man’s proximity, then staggered back and away.\n“Blazes, Mister! Keep a distance, will you?”\nThe man squinted at the now fully alert youth, then scratched a bead of sweat down the side of his face. Was it possible? There wasn’t exactly a body of literature on the phenomenon, but there’d always been whispers of it, those wild hallucinogenic tales: Of genetic, generational memory that could be deposited, or transferred, to even a human as easily as the Oomu laid sperm and eggs for other Oomu to collect. A consciousness that could extend between organisms even on this side of the atmospheric divide. A system that worked together to keep something larger than itself alive.\n“All right,” he said, though he was inclined to blame his low blood sugar for the extent of his present credulity. “We’ll go left then.”\nThe kid’s eyebrows shot up. “You believe me?”\nThe man shrugged. “Not exactly. But I see now that I should’ve trusted more in my old friend to have some sort of plan after all.”\nEven as he said this last, though, the man felt weary: The morning’s irritation slipping into grief. Such a waste of their last days together. Such a mess of useless misunderstandings—on both their parts—if the Oomu could’ve just made itself this clearly known to the man the whole time. Although, if that kind of linguistic clarity was only possible after full immersion . . .\nThe kid fell in step beside him, shoulders hunched, as they started for the station.\n“It does have a name, you know.”\nThe man shook his head.\n“An inner one,” the kid went on. “It calls itself—”\n“Don’t.”\n“Huh?”\n“I don’t want to hear it.”\n“No? But it’s a part of—”\nThe man looked to the sky. He didn’t know where else to look, so as not to snap at the kid again. “It could’ve told me itself, if it wanted me to know,” he said. “It didn’t. Let’s respect that.”\nThe kid nodded, and this time stayed quiet as they pressed on.\nWhen they tired, they rested—though with care, in the heat—which gave the man time to chew on some decent roots until he felt halfway human again, and then to address the rest of him by readjusting how his leg sat in the cradle of the prosthetic. It hadn’t been used for long distances in quite some time and even a good fit could become uncomfortable under such circumstances, but to his mild amusement, the part that upset him most was how much he found himself missing the original creak: The sheer distraction of the thing. Without it, the only sounds that paced the pair were those of the kid’s boots scraping along the flora, unsettling clods of dirt and gravel, and of the man clearing his throat between increasingly wheezy breaths.\nMaybe in Capitol City he could get someone to put it back.\nIn the meantime, it was hard going. When they finally reached the climate-station, eleven hours had passed—three for stops along the way—and the sheer distance, once traversed in full, left the man puzzling over the underground piping in a less cantankerous, but also far more troubling light. He knew the extent of the system had something to do with long-term plans for planetary stability—a laying of the “bones” for a network of future climate-stations to deflect problems long before they reached Capitol City itself—but the extent of the precaution was itself ominous, when held in contrast with how little such concerns seemed to be discussed on colony channels. He hadn’t seen reports anywhere about the growing number of proto-pockets, either, so either such matters weren’t being discussed because they weren’t important after all . . . or because they were very important, and there was nothing anyone could do that would be worth the chatter in the interim.\nSuch ruminations dropped clean away, though, when the man saw the low, squat shape of the station in the twilight; and beyond it, just outside its perimeter fencing, a human reaching up to be addressed by a giant mollusk’s mouth and tentacles.\nThe Oomu’s massive conquistador shell proved a perfectly recognizable silhouette on the cusp of night, and the man’s eyes stung at first sight of it.\nThe kid, for his part, seemed to be humming vallenatos as they drew near.\nA station scientist was standing by the Oomu as they approached, and when she waved warmly to the worn-out arrivals, the man resented her at once for her proximity to his companion. He stood some twenty paces off, legs planted in the earth while he processed the scene, as well as his own confusion in finding the giant mollusk here instead of Capitol City. Had the metropolis frightened it after all? Had it doubled back for reinforcements?\nBut if the latter, why here? Why not return to him?\nThe Oomu’s answer, at least to this last, came when it turned tentacles toward him, then away. Oh, yes. It was still hurting. Still grieving the suspected betrayal. The man wanted to rush over and talk to it, explain himself, but felt frozen in place, as if in the middle of a showdown, for how much the woman seemed to draw his attention—and the kid’s—to her instead.\n“Well,” she said. “We were wondering when you’d arrive. Salutations. Stars, you should’ve seen the look on its face when it sensed this young one coming. A wild feeling, no, that bonding?”\n“Sure is.” The kid glanced warily at the Oomu.\n“Hm,” said the woman, with an understanding smile. “Y’know, I wasn’t sure if it would remember me, either, but the moment it got close last night, we both felt it—that inner bond. Like it was yesterday, no? Ah, dear one. How terribly long it’s been.”\nThe Oomu’s tentacles extended and withdrew contentedly, and it replicated a few of the woman’s hand movements before offering signs of its own. Signs the man did not know.\nThen the woman held out a hand to the man and the kid. It was a long, awkward distance to cross for a handshake, and the woman made no effort to draw nearer to them. Instead, the man had to detach himself reluctantly from where he stood, and take one heavy pace after another, in order to close the gap. At the last step, he almost balked, for the presence of the unresponsive Oomu still upset him so—and then he shook. The kid shook, too.\n“Sorry,” she said, once they were all together by the Oomu’s side. “I’m Leidy. I work climate stats—I mean, obviously, right?” She gestured behind her to the gray stone of a facility entrance, which had been 3D-printed more to bear up to windstorms than to attract visitors. Beneath it, the man knew, lay the real operations hub, with a massive silo, currently closed, that could shoot all manner of thermochemical treatment into different layers of the atmosphere. Doubtless the Oomu had used that very silo to descend and wait out the day’s heat: a giant mollusk is something to see, when it went fully vertical at its immense size and weight.\n“But before that I was in reclamations,” she continued. “I, personally, helped this one with its first transition. Stars, but you were a lot smaller back then, weren’t you? Got yourself gloriously fattened up on plenty of desert flies and arthropods since then, I see.”\nThe Oomu glowed—a full-body flicker of iridescence—at this compliment.\nAnd the woman looked the part of an early integrationist, too, with waves of platinum to rival the man’s wiry chest hair and laugh lines that also carried their sorrows. Second-through fourth-gen had better ways of weathering this land, but first-gen had been born fresh from the ships, with neural uploads from Tierra-Prima, yet little muscle memory from their base models. Maia had not gone easy on their bodies during that first vital learning curve for the colony on whole.\nAt the word “smaller,” though, the man’s gaze darted anxiously to the crest of the Oomu’s shell, then all around them. “The youngling and the egg. Where did—are they—?”\nThe woman made a set of moist popping sounds for the Oomu’s benefit, before repeating herself for the others. “You see?” she said, after its tentacles drooped in reply. “I told you. Just a big misunderstanding. He wasn’t going to hurt or betray you. He’s as worried about them as you were.”\nThe man felt a more concentrated heat blooming in his chest.\n“Well of course I wasn’t going to hurt or betray it. Honestly, after everything we’ve been through together, how could you think for a second that I’d—?”\nThe woman raised a hand against the man’s outburst, but the kid answered first, with half-lidded eyes, and that soft, flat voice.\n“I didn’t think you’d really let me go.”\nIt took the man a second to realize that the kid was neither addressing the Oomu, nor talking about being trapped inside the giant mollusk’s under-mass. He looked between the two of them: Surprised, then hurt, by the link that seemed to include everyone but him. “I . . . ”\nThe woman approached him with a clear effort to be gentle. “It tells me that you weren’t much of a talker, all these years. Not about anything deep, at least. And it respected that—respected that maybe there were things you weren’t ready to tell it. But it took a lot out of our friend, to be with someone like that for so long, even with all the struggles you overcame together.”\nThe man noticed that he was wringing his hat in both hands—and so hard, it looked more like a washcloth. He willed himself to relax his hold, letting the hand fall slack to one side. “‘What does that even mean, ‘someone like that’? Don’t you know me? Haven’t we known each other all this time?” He raised his free hand to the Oomu, but the Oomu declined to take it into his mouth, to receive the proffered trust exercise. The man let this hand fall slack, too.\n“What our friend means is . . . someone who never leaves an inheritance,” said the woman. “It’s different for their kind. You know that. I know you do. You’re still well known for your early fieldwork, you know, even if you’ve gone to great lengths to try to disappear ever since. I was so busy on the lab side, myself, that it’s no wonder we’ve never met, but even the kids today learn about you. Or at least, from the idea of you. From the stories others tell of your work’s impact.”\nBut the man shook his head, not willing to be baited into a conversation about how little he ever stuck around for symposiums, or professional mingling of any other common human type. The barrens, the steppes, the mountains, the valleys: all the spaces in between colonists’ grandest dreams of new and far-flung human civilization had always suited him better.\n“It doesn’t lay eggs,” he said. “Never has. Never will. How’s that any different?”\n“No? Really?” She turned to the Oomu. “Not ever?”\nThe kid, mumbling as if in a dream, replied in its stead: “I donate my memory to other broods—and like this, with some of you. But what memories do you pass on? What future generations are you nurturing among your own?”\nThe man stared at the giant mollusk.\n“Is that what this is about? You didn’t trust me to let you go because I don’t share my memories with others?”\n“Put yourself in its—ah, foot,” said the woman. “So much is blended in the Oomu’s world: Past, present, future, selfhood, otherhood . . . If you hold memories so tightly, is it really a stretch to think you might hold other things tightly, too?”\nThe man pursed his lips, displeased with how reasonable that sounded. “Okay, fine, maybe,” he said to the mollusk. “But in what universe, exactly, could I stop you? If I got in your way, what was ever to keep you from swallowing me up, like you did with the kid? Or worse, with the—”\nBut the man didn’t like to mention the other incident, so he cut himself short. Moreover, he could hear the dishonesty in these questions even as he uttered them, for of course the man could stop the mollusk, once they got to Capitol City. The man would be overseeing all arrangements there, and he could easily find the excuse, and the means, to turn the Institute’s staff against its request. Granted, it wouldn’t be impossible for the Oomu to pursue its plans solo, but it would be much harder. Of course the Oomu had a vested interest in not swallowing its rider whole.\nThis time the Oomu’s response came through alternating tentacles: One extending and receding, then the next, and the next, until all had had their turn. “Maybe so, or not,” the signal read.\nThe woman rubbed the Oomu’s tensing neck in reassurance.\n“With silence comes a cost,” she said to the man. “A rift, which unfortunately it seems this last journey seems to have strained between you two. Obviously, it wants to believe that you’ll be true to the decision you made at First Landing. Only . . . ”\nShame and anger bloomed in the man’s chest, and his incredulity deepened. Had they not broken up whole trafficking rings together? Rerouted a river when Oomu nesting grounds were deprived by a newer settlement? Identified Maia Colony’s first serial killer (much as the man had mixed feelings, and sometimes still-haunted dreams, after the Oomu had meted out justice before fellow humans could)? In all that time, had he really just been projecting his own need for privacy and discretion on the Oomu? Could he simply have been more open himself, and then asked his companion point-blank about all the key issues that had built up over the years between them?\nSome questions, once framed in the man’s head, immediately answered themselves.\nAnd not always in pleasant ways.\nThe man felt tired, very tired. And foolish.\n“Where are the egg and the youngling?” he said quietly.\n“Safe,” said the woman. “And the second hatched this morning—isn’t that wonderful?”\nThe man nodded.\n“And I promise, they’ll be safe here until they’re old enough to decide their own way to go.” She patted the Oomu’s shell wistfully. “They’re just not ready yet to make the choice that this one has. For now, at least, our dear one must go on alone.”\n“For now?”\nThe woman shrugged, avoiding eye contact. “Well, who knows what the future holds?”\nBut the kid’s gaze had long since wandered to the building behind her: Its deceptively innocuous metal door; its low height, and width, and volume. A bunker’s entrance. An entrance for those who feared and were preparing for the worst. The kid was seeing it now, too—the suspicions that had been quietly building in the man’s head on the way over from the runoff pond. And with that realization, for the seed-thief, came . . . vindication. A spark in those bird-bright eyes, as if it had only just occurred to the kid that a big city would be filled with people more receptive to change.\n“Well now, I got a hunch,” said the kid with a smirk, “that maybe you do.”\nBut the scientist was unthreatened by youthful provocations. “Indeed,” she said placidly, “Still, it’s early days yet. We’re figuring out better ways of assessing the scope of the situation.”\n“Uh huh.” The man noticed that the kid was now favoring the jumpsuit leg containing the wad of seeds for genetic tinkering—rubbing it restlessly against the other leg, as if to affirm that it was still there. “While towns like mine get torn up in the worsening storms.”\nThe woman’s smile turned bracing. “It’s neither fair nor just, I know. But our research goes at the pace it has to go. As yours will, too, if you’ve ever a mind to join us.”\nHer calmness won the kid over, and to the point of overeagerness. “What, like, now?”\n“Well, no, not exactly.”\nShe looked to the horizon, and then they all did, listening. The last of the day’s light was gone, leaving only Maia’s rings and the stars to cut through the staggering dark. The woman turned to the Oomu, her expression changed: a welling up at the eyes, a wavering in her bottom lip, a faltering in her voice. She opened her arms and lay flat against the side of its exposed under-mass: as close to an embrace as a human could manage with an Oomu.\n“Safe travels, dear one.”\nThe Oomu slicked her in turn, and she laughed, wicking the slime from her nostrils and mouth before it crusted over. Then the Oomu turned its tentacles to the other two, and after a moment’s hesitation, tipped its conquistador’s shell to one side. The kid froze, at first.\n“You want me to . . . ?”\n“It needs you to.” The woman clapped a hand on the kid’s shoulder. “You hear it within you now, don’t you? That need?”\n“Yeah, but—why? Why’s it gone and put this thing in me?”\nAnd not in me, the man wondered, while watching the rest.\n“Oh, no, you did that, not the Oomu,” said the scientist. “The bond started the moment you did it harm. That’s how it always goes, though in this atmosphere it’s not as easy to tell how much our actions create reactions, now is it? All it’s done is formalize that memory for you, of your mistakes and their consequences, so that you’ll never forget them.”\nBut this answer only deepened the kid’s confusion. “Then why’ve you got it, too?”\nThe woman sighed, looking past the kid to the man. At last he saw the weight of guilt, the weight of some terrible trespass, upon the first-gen scientist, too.\n“Because,” she said—to him, more than to the boy—“The Oomu didn’t see any reason to respect my privacy, either, when I’d done it wrong. Or, no, let me put it differently—because ‘respect’ and ‘privacy’ are such human terms, aren’t they?—What I mean is, when I caused it harm, it treated me just as it would another Oomu—just as it’s treated you, young one. Only ever once, I suspect, has it really tried to go at this business any other way: to look outside its species standard, and to treat a human as a human would want to be treated instead. Which is an extraordinary thing, if you think about it: The thought of a human who could inspire an Oomu to try to live by his own code of conduct . . . if only for a while. He’d have to be quite the legend, don’t you think?”\nThe man swallowed hard and turned to the Oomu. He didn’t need to say anything to be understood; his expression held the question, Is that true? well enough. In answer, the Oomu extended three tentacles—the touch-tester, taste-gatherer, and scent-sniffer—and entwined them: the sign for “feels real, tastes real, smells real . . . is real.”\nIt sunk in then, for the man, just how hardthe Oomu had been working this past decade, to play the game as much by his terms as possible. And out of . . . what? Respect? Curiosity? A desire to learn humanity as best it could before moving on? Whatever the cause, the man felt a wave of quiet humility, and gratitude, in the shadow of his oldest companion’s restraint, though everything about its species longed to merge without consideration for any such bizarre human notions of choice.\nAnd so only at the end of things between them, when the Oomu had most needed to believe that the man would extend the same courtesy to it, too, had it grown anxious and unsure. But why not? Did humans always permit others the autonomy they made such a fuss over for themselves?\n“Right then . . . right,” he said, setting his hat back over his mop of white curls. He shook hands again with the scientist and thanked her for caring for the rest of the brood. Then, approaching the Oomu’s tipped shell with trembling hands—\n“Come along then, kid,” he said faintly. “We’ve got one last job to do.”\n5. The City\nThe Oomu wasn’t as jumpy in the streets of Capitol City as the man had expected—not now, at least, that the man himself was calmer, and no longer exuding all kinds of tense, private, volatile energy that the Oomu hadn’t known how to read, or if it could trust. The smells here certainly differed from those in the barrens, as did the obstacles: The cacophony of human-, car-, tram-, and mollusk-traffic throughout the sprawling grid of the largest, most dynamic settlement in all of Maia Colony. But past the towering solar farms and living quarters; beyond the energy stations and research labs; a little further out than the new-builds and the makerspaces . . . there were trees. Massive tracts of city-enclosed acreage for luxury goods and materials, at the center of which stood the immense fortress of the Advanced Biotech & Genomic Engineering Institute.\nAnd inside it, as every colonist well knew: the Zoo.\n“Well, old friend,” said the man, when they stood outside the Institute’s warehouse entrance for trucks and giant mollusks alike. “Here we are.”\nBut he made no move to dismount, or even to begin his very last tasks about the precarious top of the Oomu’s conquistador’s helmet: To detach the long-term storage rigs, and the sleeping gear, and the saddle. Even through the distraction of heady city fumes, the man was taking in the smell, one last time, of the early heat as it rose off the Oomu’s casing; and the feel of scuff marks and healed shell bits within reach; and the sight of what stray insect segments were still being dissolved in the translucent depths of the Oomu’s nearby skin; and how the grayest parts of his old friend’s shell just barely glinted in the morning light.\nAnd the Oomu knew all this, and allowed it, watching the man without watching him: Pointedly turning all its tentacles in other directions, to make a grand show of giving the man his privacy for grief—at least, until the massive doors to the warehouse rolled aside, and their contact waved from the ground in excited greeting. Then the Oomu glided in, and a whole team of Institute workers thronged about to help the kid and the man unpack the Oomu’s decade-long load.\nThen, the man knew, it was time for him to go.\nThe Oomu didn’t tip its shell for him—allowing the man one last slide, and leap, and painful protest from a knee of aging, first-gen flesh—but it did so for the kid, who eased more carefully to the ground, then awkwardly turned and patted the Oomu—tentatively—on its under-mass.\n“Thanks,” said the kid, once the Oomu’s eyestalks were watching. “For not eating me.”\nThen the kid slumped, eyes half-lidded, before regaining full consciousness and giving the Oomu a funny look. “Well,” said the seed-thief and the egg-killer, doubtfully. “If you say so . . . ”\nMeanwhile, the man turned his attention to their contact, “the zookeeper.” There was plenty of paperwork to fill out and guarantees to be made, with a little greasing of palms to ensure that the Oomu would be given the utmost care during transition, and only the most up-to-date proven gene-therapy techniques—none of this “experimental trials” nonsense to tinker with the formula. Not at his old friend’s expense.\nThe zookeeper then took the man and the kid on a tour of the enclosure, while the Oomu was settled in pretreatment chambers, where the team could gradually acclimate its body to an intermediate atmosphere before it underwent the de-conversion process to its pre-species form. Ten years ago, the science of de-conversion had still been unreliable, but in First Landing, before this last journey out, the man and the mollusk had witnessed news of the Institute’s long-term success rate, and of the pre-atmospheric Zoo now being sustained 100% internally, by all manner of reclaimed lifeforms working in uncanny harmony. For the Institute, this was an achievement that would yield decades’ worth of new technologies, but for any species that carried generational memory of a time before human trespass, it was much simpler: it was a way back to the world before.\n“I imagine,” said the zookeeper, once their tour had concluded, and the last payments had been addressed, “That you’d like to see your friend one last time, before we begin.”\nThe man had difficulty speaking, but a nod sufficed, and soon enough he was standing outside the massive medical tent where the Oomu was finally resting—flopped out, in a most ungainly way, after so tense a journey across the barrens and the steppes. The zookeeper invited everyone else to step out, to give the man and the mollusk a moment, but when they did, everything remaining in the tent seemed so light that the man thought it might all, in an instant, blow away.\nThere were so many things, the man also realized upon entry, that he would never get to ask now, and even more that he could never hope to understand. To think that the Oomu had gone to such incredible lengths to try to live like him, to accommodate him, to allow for his human way of being to subsume its own . . . and yet, had he even stepped out half as much himself, in all that time? Had he even tried to bridge the gap between their species’ comfort zones?\nNo wonder, thought the man, as he crouched before the snoozing Oomu and studied how trustingly its tentacles rested upon the tremendous see-through lump of its head: No wonder that those students, years ago, had clamored to know more about his time as a slaughterer, before he was a helper to the Oomu. Understanding the gene-therapy tools that he used in the field to rebirth other pre-species members was one thing . . . but how many of those bright young next-gens had really grasped yet that some of the most crucial transformations on Maia didn’tinvolve gene therapy at all? How many comprehended that changes in, say, a first-gen’s stricken conscience would always come from a far more complex set of forces than labs could ever quantify? And that, if recent settlements were going to stand a chance against coming challenges, they’d all need more such stark transformations of heart and mind before genetic cures could even be considered a viable recourse?\nLeaning against the unconscious, sprawling body of his old companion, the man inhaled the pungent sweetness rolling off its sticky skin one last time, and whispered into it: “Thank you, you old lout. I promise, I’ll tell them everything. I won’t let the guilt go to waste a moment longer.”\nAnd then, with a twinge of disappointment—for the Oomu had made no sign of having heard him, or of otherwise being able to rouse itself for its own share of their goodbye—the man rose with some difficulty to his feet and left the Oomu to its long-awaited journey home.\nThe procedure took eight days and was frightful for the man to follow from an observation booth, where he watched his old friend slowly shrink out of its shell and form a newer, more pliant one in its wake. A magnetic floor in the recovery chamber provided some of the counterforce needed to keep its fragile new body from being flattened during the process, while mild electrical stimuli allowed it to build the muscle responses necessary to adapt to the intense chemical interactions that awaited it in the pre-world atmosphere of the Zoo’s main enclosure. There, it would find itself whipped about by dense clusters of volatile fumes while clinging to various floral structures, held together by a range of other faunal allies. It was an existence the man still couldn’t comprehend the Oomu’s longing to return to, though he tried his best to imagine it in a positive light while waiting. During the transition process, too, the zookeeper would drop in every now and then, to marvel at how strange and resilient these pre-species had been—and how obvious it was why the terraforming ship had not considered the possibility of complex life here when assessing the viability of the planet’s brutal atmosphere upon arrival.\nThe man said little amid these attempts at friendly banter—or when the kid came to visit, chattering away about how the Institute had taken an interest in the whole seed business for frontier settlements; and how they’d offered the kid a place in an internship program where such critical skills could be formalized for the benefit of the whole colony. The man did little at all, that is, except study the Oomu in the middle of its arduous de-conversion—and start in his seat whenever it looked as though the Oomu . . . or rather, the pre-Oomu, its progenitor species . . . was in pain.\nThen, late on the eighth day, a supervisor looked into the camera and flashed an “all clear,” before a team arrived to take the pre-Oomu, in its tiny enclosure, up to the Zoo. The man bolted upright and hurried to join them in time: the whole team at a minor “airlock” on one end of an enormous viewing window, through which the whirling opacity of pre-world atmosphere could be studied, even if individual forms and species clusters were often difficult to make out in the haze.\nThe man watched as his old friend was returned in a new form to a more familiar world.\nAnd then he watched through the reinforced glass for hours after, trying to catch a glimpse of his old friend thriving there.\nWith no luck. No luck at all.\nEventually, though, the lightest touch on his arm startled him, and he turned to see the kid studying him. He couldn’t tell if he was dreaming, or if the kid was, or if they both were, when the kid said to him: “Share it all, Mister. Nothing’s ever gone completely when we do.”\nBut probably it was just his exhaustion talking, because after what felt like the blink of an eye, the man looked up and the kid was gone. And the Zoo was as impenetrably opaque as ever.\nAnd the world outside Capitol City, which the man faced next, wincing at the sun with his hat held lightly in hand, was a place of more barrens than buildings, more frayed than close-knit networks . . . all of which, maybe now more than ever, seemed in sore need of a bridging of silences.\nHe set out for the station and its truths.\nCanadian by birth, M L Clark is now based in Colombia. Clark is the published author of science- and speculative-fiction stories in Analog, Clarkesworld, and Lightspeed, with work forthcoming in F&SF. Other projects pending publication include a novel in the universe of “To Catch All Sorts of Flying Things” and “Leave-Taking,” and a humanist column and podcast to launch at the end of 2021.", "source": "https://clarkesworldmagazine.com/clark_02_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mercy and the Mollusc by M. L. Clark"}