{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Bogi Takács", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Bk4gW875mZw+IvHSztRYoiJF+Yk=", "id": null, "license": null, "comments": "", "raw_text": "3680 words, short story  Forestspirit, Forestspirit  Apunak  I race foragers to each mushroom with relish, changing from a tree to a bush to sometimes even the early autumn fog. After a decade, it’s easy to hold each shape; I don’t know if I can call this neuroplasticity any longer, in the absence of neurons. My cells are machine, and they follow my thoughts with the obedience of automation.  I used to bleed people dry, to insinuate into small cracks both artificial and natural, to infiltrate. I used to fight. I still have my spherical vision, my hunter-smooth motion, my booming authority-voice to be used as needed.  These days I haunt the forest.  I love and despise them all, these pale and oddball people who come to the forest to play, to gather mushrooms because it is so quaint, to frolic. None of my people remain; they are scattered across less antagonistic lands, thinking back on this place.  I wanted to stay, to look at people like this boychild, venturing into the woods with the trepidation of an older breed of human. I can tell he still has his AR displays on, and his head swivels as he takes in all the different species, helpfully labelled for him on bright overlays in his mind. I am poised to duck, twist and run after him—maybe roll into the shape of a moss-covered log—but he is agonizingly slow, uncertain, out of his element.  I creep across the undergrowth as a thousand earthworms moving in unison, hiding myself underneath ferns and organic debris.  He brushes spiky straight ash-blond hair out of his eyes. I am soundless, invisible, gazing him in the face. I never hurt these strangers; I just want to be left alone to watch. The war has been over for a decade.  I am no danger, and yet he senses something. I flow into the earth, nestle myself between grains of soil and errant tree-roots.  “Forestspirit,” he whispers. “I know you are real.”  I am not real, I’m tempted to answer, I am a legend formed by my own self, a haunt following picnickers and mushroom-gatherers. I remain silent and still. I can hear him underground as his words make the topsoil tremble ever so slightly. My senses extend far and wide.  “My uncle saw you,” he says. Then, after some hesitation: “He can talk to birds. He makes dead plants grow.”  I know that garden on the edge of the forest, the succulents feasting on carefully arranged rocks, the little lake with fish tempting the stray cats. Few humans make such things anymore. Maybe it all needs the motivation of magic?  I am not magic. I am a cluster of myriads of tiny automata, my original shape a shimmering cloud of light.  I creep up from the earth, and yet I do not show myself. I haven’t spoken with anything besides the commanding voice in this body.  “Forestspirit,” the boy goes on, “I need your help.”  Speak, I make the leaves rustle. A finely grained control of my environment, it was called. Speak, child.  For a moment he seems resentful of having been called child, but I can only draw on the mythical. I cannot bark at him like a drill-sergeant.  “They want to destroy the forest,” he says, and my imagination immediately jumps to a variety of theys: the aliens, or these straight-haired and straight-backed humans (then why would the boy exclude himself?), my own people returning for revenge, or other peoples out for the same. The current inhabitants of the land gathered many enemies over millennia in this landlocked basin, with its rolling fields and thick forests. Should I have cared?  Explain, I whisper. Or should I project a sense of omniscience? I seldom wish I was magic, and yet—  Words topple out of him in gasps, his fear pouring out of him and into me. The gist: he doesn’t know why. This is what the Consentience has decided, and I do not even know who that would be. I’m truly out of touch. Am I old? I don’t think I age, and yet I worry I have become inflexible, my only pursuit this idle hunt of careless tourists.  The usual paranoia surfaces, an occupational hazard that never quite goes away, even after all those years. Is this unknown-factor Consentience looking for me? I went absent without leave, but no one really looked for me—after the humans fought off the aliens with pilfered technology, they turned on each other, and I knew I would be first in line to get thrown into a ditch. How do you throw a raincloud? The military had made me into something they thought would remain loyal, but I modified myself, shook off my trackers, and floated away.  I do not kill. And yet I don’t know what to do with this crumble of a boy on all fours in the dirt, crying desperately. Why is the forest so dear to him? I rarely see him—I think he lives far away, only coming to visit his uncle every once in a while.  By contrast, I know his uncle too well, and I realize that he is the connection: the man of green who wants to preserve life for its own sake. It is not the forest that’s so dear to the boy—it is not me—it is his uncle.  I blow a little gust to tousle the boy’s hair, and whisper vague promises in his ear. I have no idea what else I can do.  And yet as he gathers himself and walks away, his shoulders sinking in time with his steps, I follow him into the evening dusk, my shape a windcarpet of fireflies.  He sits on the bench by the small lake. Both the bench and the lake are carefully handcrafted, and I wonder: I could likewise build, I could laser-cut a hundred of these benches, would that qualify as my handiwork in a sense? I’m not sure where this sudden impulse comes from—I never even liked crafts, back in my human days.  He glances up, senses me in the pattern. “Why have you followed me here, forestspirit?” he whispers, then louder: “My name is Péter. What’s your name?”  The firebugs move along their preprogrammed trajectories, one of my subroutines taking care of it all. I don’t show a startle reaction this time, and for that I am glad.  It has been a long while since someone asked me my name. And I had names that hurt . . .  Name me, the insects buzz.  He frowns, trying to keep eye contact with the swarm. “I guess I can pick a name. Which gender?”  The bugs can’t quite chuckle. I’m a forestspirit, I have no gender, I say.  “And before?”  I have to, I need to display emotion. I make my bodies fall out of the sky, and they make small cracking noises as they hit the rough-hewn rock panels around the bench. I turn into sand and seep into the cracks.  “Don’t go away,” he cries with sudden desperation, and I feel bad—I’ve been making the wrong impression. I turn into a large pile of leaves—what else would be mimicry enough in such a tidy garden? How did he know there was a before?  “I’m sorry,” I answer. “I am here.” A leaf tumbles off the heap. “Before, I had no gender either. Give me any name that you want.”  These people had never reacted to me kindly, but this boy takes it all in easy stride. “Gabi,” he says, “That can be any gender. It’s kind of cool, huh?”  It sounds like a soap brand from the ancient past. Gabi I shall be, then. Anything to keep the memories at bay. But what else could I do?  I have to familiarize myself with this environment, and I’m reluctant to commit to a confrontation, even a defensive one. Many have moved off-planet, changed shape and form, reorganized their minds to an extent that even I find somewhat intimidating. Left behind by these posthumans, the Consentience governs, with an erratic, ad hoc determination all the more frightening for its hodgepodge nature.  I recall this from my studies: even when artificial neural networks make precise decisions, it can be hard to discern the process by which they do this, the representations they utilize, if any. The Consentience is a network, with who knows what substrate for nodes instead of neurons, and yet the end effect is the same. Péter doesn’t know their motivation because it cannot be known.  Now the Consentience wants to devour my forest, and I realize I have grown possessive, I who had sworn off earthly attachments. I feel myself rapidly changing, growing to fit the situation. Growing into my earlier self: soldier, tactician . . . I was never a strategist, but maybe there’s space to expand.  “What are you good at?” the boy says in hushed, awestruck tones, and I answer: “Infiltration.”  To change the behavioral output of a neural network, one can lesion it—in principle. But how should I know what happens after I lesion? We could hardly model the Consentience with tiny rocks and sticks. I know this because I try, now as a legion of angry wasps and obedient ants gathering close to ground, producing what I could hardly call a model based on what Péter tells me of each substation in the area. There’s even a new one built about a month ago, a little more than half a kilometer from the forest I call my own.  The Consentience must require an inordinate amount of energy to sustain, I realize, for why else would it need separate stations instead of floating on the air or silting down into the bottom of living waters? I require a lot of energy and yet I can be nigh-invisible, gossamer.  I decide.  The next morning, we investigate. Péter totters on sticklike legs, his noisiness suddenly our shared downfall. I order him back to the house and he obeys, sniffling.  I venture out of my territory, but I feel in my element. This is the hunt that enlivens me.  The closest substation is molded of pale white plastic and shaped like a well-grown specimen of fly agaric—presumably an ironic nod to children’s stories. These people no longer understand the forest. I do not let my anger rise.  Occasionally, large robotic millipedes creep in and out of holes at the base of the substation that reseal themselves instantly. I decide to trail them, but I grow bored quickly as I realize that each millipede has a rigidly defined patrol area and does not seem particularly intelligent.  Next, I fly up to the surface of the substation in the shape of a raven. The wall trembles, more organic than it revealed of itself from a distance. It sparks at me and I produce my best shock-strained caw.  In the following fifty-three minutes, I try out twenty-four animal shapes. My shapeshifting raises no alarm or consternation besides the localized electric shocks. Maybe it is time to sneak inside? I could soak a millipede with myself as a light autumn rain, evaporate from its body into a different shape once it’s safely indoors. But suddenly I chance upon another idea.  Reminded of a long gone battle, I’m curious how far the Consentience’s perception stretches. The intellect in this structure does not seem to be human, regardless of how it had originally arisen. Each mental setup gives shape to its own logic, and each has its peculiar holes and omissions. If there is no general alarm, then for the time being, I can experiment.  I grow into an oak. No taser-blip this time; sessile lifeforms must not be considered a danger. The fly agaric scans me with infrared and something I can’t quite sense, then puffs some chemical in my direction: to stunt my growth? This is probably how it keeps itself from being overgrown by the local flora.  I try a weeping willow, entirely out of place. Again only the puff. Even more daring, I shift into a sea-bean plant, my lianas curling toward the fly agaric. I move, I touch, yet I provoke no electric shock.  I could examine the edge cases of its classification heuristics. What is still an animal? What’s considered a tree?  My lianas freeze as I can feel a breakthrough inching closer to my consciousness. I focus inward.  If I can work out how it recognizes a forest, then I will know how it will proceed to destroy it. Péter said that the Consentience has already been sending out tersely-worded notifications for any remaining humans to vacate the area. Can I disguise my home in order to save it?  I remember flying through the Thundercloud Straits, my still-human face bearing the war-paint of asymmetric lines and rectangles designed to throw off alien shape-recognition algorithms. I remember breaking my bones one by one to assume a configuration at odds with alien mindsets. I wasn’t always this fluid, this protean. But I always had this uncanny disturbing spirit, a hacker’s attitude toward the constancies of life, toward the baseline of awareness.  It came in handy, in so many clashes. I might yet prevail, without having to destroy or cut off a single substation—for I have forsworn violence, I have forsworn malign thought. Yet, my body thrums with the excitement . . .  I transform my buzzing to elation. I run through permutations of shapes, I register and catalog. I fill a relational database, calculate correlations, build models. I am manifold, each convolution of me producing a different reaction. This is a low-level response: I do not seem to reach the Consentience’s threshold of awareness, if this unfathomable system indeed has one. I treat the giant mind as a black box: I’m only interested in its responses to my stimuli. I feel like a flea on a St. Bernard’s tail.  In a few hours I reach shapes edging into the meaningless, and yet the fly agaric still categorizes them into animals and plants, responds accordingly. I am a giant red stripe with yellow curlicues in the middle. I’m a perfectly spherical ball of flowers. Would it recognize a human as a distinct category? I do not dare try—that might invoke some higher-level process. I can only hope it doesn’t mark my stilted, spiky stalks or my purple-tinted scrub as a human due to some quirk. I started out from the animal and plant prototypes in the problem space, moved always just one little modification away, and I hope this search strategy will keep me secure and safe from alarms.  I only forgot about one detail: how will I disguise my forest? I could hardly hang brightly colored stripes from each tree-branch! When I realize this, I dissolve into piping-hot steamclouds, all my tension channeled into aggravation with the force of the motion itself.  The sun is setting. I should report back to my newfound teammate about my dubious progress. Something inside me would still be satisfied by a debriefing; I used to be a meticulous soldier.  I let the erratic winds drift me away from the substation, toward Péter.  He listens in wonder as I recount my actions. I share with him my database, but he doesn’t deign to look. He purses chill-cracked lips and rubs his hands together. I can sense his entire body gearing up for a revelation, but I can’t guess the shape of the revelation itself; my sensors do not have sufficient resolution. I’m not a mind-reader.  “Why don’t we try the reverse?” he asks, carefreely including me in us. I coalesce into butterflies; I haven’t been partnered with anyone for so long, and I notice with a startle that the presence of this boychild fills a void in me. I’m reminded of the time-old slogan: Together, we fight . . .  I don’t even parse what he’s saying.  He notices.  “Gabi? Are you listening?” He peers up dubiously. I settle on his head, his shoulders, his upper arms. He laughs with the tickle, then grows serious. “I was saying we could try the reverse.”  What do you mean? My wings beat in unison.  “If it can recognize strange things as . . . regular things, then maybe it can also recognize regular things as . . . strange things.” He’s working it out as he speaks, his eyes moving to and fro, gazing beyond the little pond. “We can come up with something that looks like a plant but it’s detected as something weird. I guess.”  That way the forest could look the same to us, but unrecognizable to the Consentience, I say. Great idea.  “Would it get confused? Would it get lost?” He pauses, just for a moment. “Would it leave?”  I don’t know. It’s worth a try, I offer, and if the butterflies could shrug, I would. I’ve dropped the mythic pretensions. Péter and I, we are comrades.  Yet I leave him by the pond, rushing ahead on my own again. His presence would disturb my plan. This time, I leave with a promise of return.  Even though I know what I’m looking for, the process is still difficult. I’m trying to find small changes that result in unexpected responses, but nothing turns up for a while. I start measuring reaction times, try to find inputs that make the system hesitate and hiccup, circle around those in the problem space.  Eventually I chance upon a pattern of translucent triangular bumps and a painted texture like thatch, invisible to the human-standard eye.  No puff. No shock. Only a millipede venturing out from the substation, turning toward me instead of veering away. It pokes at my trunk and then acts—like Darwin’s caterpillar—much embarrassed. I stay still and it returns to its home base after a while. Inwardly, I rejoice. I unfurl leathery wings, soar above the hills and dip into the clouds before I return to Péter.  We spend a frantic day manufacturing sticky triangular knobs, Péter programming the fabricator while I hover over his shoulder, drape myself onto furniture, creep on the ceiling. The missives of the Consentience are cryptic and its actions carry no deadline. It can turn on the forest at any moment that suits its caprice, and I tremble with the thought that the last set of my attempts might have served to hasten its actions.  My turn: I rush through the tree-trunks, gluing, painting. I stir up the undergrowth. Ants crowd around the triangles, then leave them alone again. This was the smallest disruption that we could conceive, and I’m not convinced it will work. More scenarios should have been tried . . . but a vast number of uncategorizables around the substation would certainly have raised an alarm.  Then we wait. We wait. Days pass. I teach Péter intricate strategy games with pebbles and bark. We produce collaborative sculptures of my body. I share my treasury of ages-old political jokes that somehow still resonate, despite the unfamiliar context, and Péter tells me stories about his uncle. I avoid his family and they seem to be glad that their youngest has finally taken an interest in nature.  When I sense the rumble, I’m rooted into the mud of a small brook and Péter is sploshing around in hydrophobic rubber boots, looking for small fish. I puff out into a swarm of mosquitoes, my startle response alive and well.  The millipedes are coming, hundreds upon hundreds of them, the size of foxes and dogs—each equipped with what seems to be laser cutters mass-produced in a hurry, attached to their heads.  Péter holds his breath, then exhales with a snort. The robotic swarm reaches the edge of our forest and comes to a standstill. The millipedes chirp like tiny chicks—also an ironic gesture? Everything about the Consentience is disjointed, patterns of nature mushed haphazardly together.  No decision is reached. No decision is reached. Péter turns toward me to whisper, but I shush him with a sharp tumbling-churning gesture.  The swarm withdraws. Once they are out of my hearing range, we cheer. I change into one of my more incongruous sphere-shapes and bounce off trees with enthusiasm. Péter sobs, his face smeared with snot and his eyes glowing with glee.  The battle is not over. The swarm returns the next day, then again the next, with determined precision.  It takes five days for the Consentience to give up, and by then the local humans have also noticed the curious phenomenon. Péter reads out news headlines to me, the feed sent directly to his brain. No one understands.  No one except the man of green, the steward of the land who calls the ravens to himself. It’s late afternoon; Péter is already inside when his uncle ventures out. The man of green runs his fingers on the bark, notices the translucent bumps. Tries to scrape them off, spits on them and rubs. Scratches the wiry black curls on his head. He looks different from Péter. Intermarriage?  “For your sake, I hope they are biodegradable,” he says out loud. I glance down on him with beady squirrel-eyes; he looks up into the branches and our gazepaths lock into each other. He nods with acknowledgement, and I nod back to him, as much as this physiology allows. He chuckles as I drop the acorn from my jittery hands, catches it in cupped fingers. For a moment I believe in his magic.  “I will have this, as a keepsake, if you don’t mind,” he says. “Thank you for taking good care of Péter. This he will remember, even when he ventures out to the stars.”  Has Péter been meaning to leave the planet? I’m silent. I mull over the idea and its impact on an aging man so tied to the land. Rejuvenation is still pricy, reserved for decisionmakers and chiefs of staff. Clinging to a human shape is more and more of a curiosity with each passing day. And the youngsters all leave . . .  “We remain here, the two of us.” The man points at my squirrel-self. “Shapechanger, forestspirit. You fought in the war, I gather?” He’s seen much himself. Maybe he fought too.  His words jingle in my head as he turns, walks away.  Bogi Takács is a Hungarian Jewish agender trans person (e/em/eir/emself or they pronouns) and a resident alien in the US. E is a winner of the Lambda award for editing Transcendent 2: The Year's Best Transgender Speculative Fiction, and a finalist for the Hugo and Locus awards. Eir debut poetry collection Algorithmic Shapeshifting is out now from Aqueduct, and eir debut short story collection The Trans Space Octopus Congregation was published in Fall 2019 by Lethe Press. You can find Bogi on various social media as bogiperson.", "text": "3680 words, short story\nForestspirit, Forestspirit\nApunak\nI race foragers to each mushroom with relish, changing from a tree to a bush to sometimes even the early autumn fog. After a decade, it’s easy to hold each shape; I don’t know if I can call this neuroplasticity any longer, in the absence of neurons. My cells are machine, and they follow my thoughts with the obedience of automation.\nI used to bleed people dry, to insinuate into small cracks both artificial and natural, to infiltrate. I used to fight. I still have my spherical vision, my hunter-smooth motion, my booming authority-voice to be used as needed.\nThese days I haunt the forest.\nI love and despise them all, these pale and oddball people who come to the forest to play, to gather mushrooms because it is so quaint, to frolic. None of my people remain; they are scattered across less antagonistic lands, thinking back on this place.\nI wanted to stay, to look at people like this boychild, venturing into the woods with the trepidation of an older breed of human. I can tell he still has his AR displays on, and his head swivels as he takes in all the different species, helpfully labelled for him on bright overlays in his mind. I am poised to duck, twist and run after him—maybe roll into the shape of a moss-covered log—but he is agonizingly slow, uncertain, out of his element.\nI creep across the undergrowth as a thousand earthworms moving in unison, hiding myself underneath ferns and organic debris.\nHe brushes spiky straight ash-blond hair out of his eyes. I am soundless, invisible, gazing him in the face. I never hurt these strangers; I just want to be left alone to watch. The war has been over for a decade.\nI am no danger, and yet he senses something. I flow into the earth, nestle myself between grains of soil and errant tree-roots.\n“Forestspirit,” he whispers. “I know you are real.”\nI am not real, I’m tempted to answer, I am a legend formed by my own self, a haunt following picnickers and mushroom-gatherers. I remain silent and still. I can hear him underground as his words make the topsoil tremble ever so slightly. My senses extend far and wide.\n“My uncle saw you,” he says. Then, after some hesitation: “He can talk to birds. He makes dead plants grow.”\nI know that garden on the edge of the forest, the succulents feasting on carefully arranged rocks, the little lake with fish tempting the stray cats. Few humans make such things anymore. Maybe it all needs the motivation of magic?\nI am not magic. I am a cluster of myriads of tiny automata, my original shape a shimmering cloud of light.\nI creep up from the earth, and yet I do not show myself. I haven’t spoken with anything besides the commanding voice in this body.\n“Forestspirit,” the boy goes on, “I need your help.”\nSpeak, I make the leaves rustle. A finely grained control of my environment, it was called. Speak, child.\nFor a moment he seems resentful of having been called child, but I can only draw on the mythical. I cannot bark at him like a drill-sergeant.\n“They want to destroy the forest,” he says, and my imagination immediately jumps to a variety of theys: the aliens, or these straight-haired and straight-backed humans (then why would the boy exclude himself?), my own people returning for revenge, or other peoples out for the same. The current inhabitants of the land gathered many enemies over millennia in this landlocked basin, with its rolling fields and thick forests. Should I have cared?\nExplain, I whisper. Or should I project a sense of omniscience? I seldom wish I was magic, and yet—\nWords topple out of him in gasps, his fear pouring out of him and into me. The gist: he doesn’t know why. This is what the Consentience has decided, and I do not even know who that would be. I’m truly out of touch. Am I old? I don’t think I age, and yet I worry I have become inflexible, my only pursuit this idle hunt of careless tourists.\nThe usual paranoia surfaces, an occupational hazard that never quite goes away, even after all those years. Is this unknown-factor Consentience looking for me? I went absent without leave, but no one really looked for me—after the humans fought off the aliens with pilfered technology, they turned on each other, and I knew I would be first in line to get thrown into a ditch. How do you throw a raincloud? The military had made me into something they thought would remain loyal, but I modified myself, shook off my trackers, and floated away.\nI do not kill. And yet I don’t know what to do with this crumble of a boy on all fours in the dirt, crying desperately. Why is the forest so dear to him? I rarely see him—I think he lives far away, only coming to visit his uncle every once in a while.\nBy contrast, I know his uncle too well, and I realize that he is the connection: the man of green who wants to preserve life for its own sake. It is not the forest that’s so dear to the boy—it is not me—it is his uncle.\nI blow a little gust to tousle the boy’s hair, and whisper vague promises in his ear. I have no idea what else I can do.\nAnd yet as he gathers himself and walks away, his shoulders sinking in time with his steps, I follow him into the evening dusk, my shape a windcarpet of fireflies.\nHe sits on the bench by the small lake. Both the bench and the lake are carefully handcrafted, and I wonder: I could likewise build, I could laser-cut a hundred of these benches, would that qualify as my handiwork in a sense? I’m not sure where this sudden impulse comes from—I never even liked crafts, back in my human days.\nHe glances up, senses me in the pattern. “Why have you followed me here, forestspirit?” he whispers, then louder: “My name is Péter. What’s your name?”\nThe firebugs move along their preprogrammed trajectories, one of my subroutines taking care of it all. I don’t show a startle reaction this time, and for that I am glad.\nIt has been a long while since someone asked me my name. And I had names that hurt . . .\nName me, the insects buzz.\nHe frowns, trying to keep eye contact with the swarm. “I guess I can pick a name. Which gender?”\nThe bugs can’t quite chuckle. I’m a forestspirit, I have no gender, I say.\n“And before?”\nI have to, I need to display emotion. I make my bodies fall out of the sky, and they make small cracking noises as they hit the rough-hewn rock panels around the bench. I turn into sand and seep into the cracks.\n“Don’t go away,” he cries with sudden desperation, and I feel bad—I’ve been making the wrong impression. I turn into a large pile of leaves—what else would be mimicry enough in such a tidy garden? How did he know there was a before?\n“I’m sorry,” I answer. “I am here.” A leaf tumbles off the heap. “Before, I had no gender either. Give me any name that you want.”\nThese people had never reacted to me kindly, but this boy takes it all in easy stride. “Gabi,” he says, “That can be any gender. It’s kind of cool, huh?”\nIt sounds like a soap brand from the ancient past. Gabi I shall be, then. Anything to keep the memories at bay. But what else could I do?\nI have to familiarize myself with this environment, and I’m reluctant to commit to a confrontation, even a defensive one. Many have moved off-planet, changed shape and form, reorganized their minds to an extent that even I find somewhat intimidating. Left behind by these posthumans, the Consentience governs, with an erratic, ad hoc determination all the more frightening for its hodgepodge nature.\nI recall this from my studies: even when artificial neural networks make precise decisions, it can be hard to discern the process by which they do this, the representations they utilize, if any. The Consentience is a network, with who knows what substrate for nodes instead of neurons, and yet the end effect is the same. Péter doesn’t know their motivation because it cannot be known.\nNow the Consentience wants to devour my forest, and I realize I have grown possessive, I who had sworn off earthly attachments. I feel myself rapidly changing, growing to fit the situation. Growing into my earlier self: soldier, tactician . . . I was never a strategist, but maybe there’s space to expand.\n“What are you good at?” the boy says in hushed, awestruck tones, and I answer: “Infiltration.”\nTo change the behavioral output of a neural network, one can lesion it—in principle. But how should I know what happens after I lesion? We could hardly model the Consentience with tiny rocks and sticks. I know this because I try, now as a legion of angry wasps and obedient ants gathering close to ground, producing what I could hardly call a model based on what Péter tells me of each substation in the area. There’s even a new one built about a month ago, a little more than half a kilometer from the forest I call my own.\nThe Consentience must require an inordinate amount of energy to sustain, I realize, for why else would it need separate stations instead of floating on the air or silting down into the bottom of living waters? I require a lot of energy and yet I can be nigh-invisible, gossamer.\nI decide.\nThe next morning, we investigate. Péter totters on sticklike legs, his noisiness suddenly our shared downfall. I order him back to the house and he obeys, sniffling.\nI venture out of my territory, but I feel in my element. This is the hunt that enlivens me.\nThe closest substation is molded of pale white plastic and shaped like a well-grown specimen of fly agaric—presumably an ironic nod to children’s stories. These people no longer understand the forest. I do not let my anger rise.\nOccasionally, large robotic millipedes creep in and out of holes at the base of the substation that reseal themselves instantly. I decide to trail them, but I grow bored quickly as I realize that each millipede has a rigidly defined patrol area and does not seem particularly intelligent.\nNext, I fly up to the surface of the substation in the shape of a raven. The wall trembles, more organic than it revealed of itself from a distance. It sparks at me and I produce my best shock-strained caw.\nIn the following fifty-three minutes, I try out twenty-four animal shapes. My shapeshifting raises no alarm or consternation besides the localized electric shocks. Maybe it is time to sneak inside? I could soak a millipede with myself as a light autumn rain, evaporate from its body into a different shape once it’s safely indoors. But suddenly I chance upon another idea.\nReminded of a long gone battle, I’m curious how far the Consentience’s perception stretches. The intellect in this structure does not seem to be human, regardless of how it had originally arisen. Each mental setup gives shape to its own logic, and each has its peculiar holes and omissions. If there is no general alarm, then for the time being, I can experiment.\nI grow into an oak. No taser-blip this time; sessile lifeforms must not be considered a danger. The fly agaric scans me with infrared and something I can’t quite sense, then puffs some chemical in my direction: to stunt my growth? This is probably how it keeps itself from being overgrown by the local flora.\nI try a weeping willow, entirely out of place. Again only the puff. Even more daring, I shift into a sea-bean plant, my lianas curling toward the fly agaric. I move, I touch, yet I provoke no electric shock.\nI could examine the edge cases of its classification heuristics. What is still an animal? What’s considered a tree?\nMy lianas freeze as I can feel a breakthrough inching closer to my consciousness. I focus inward.\nIf I can work out how it recognizes a forest, then I will know how it will proceed to destroy it. Péter said that the Consentience has already been sending out tersely-worded notifications for any remaining humans to vacate the area. Can I disguise my home in order to save it?\nI remember flying through the Thundercloud Straits, my still-human face bearing the war-paint of asymmetric lines and rectangles designed to throw off alien shape-recognition algorithms. I remember breaking my bones one by one to assume a configuration at odds with alien mindsets. I wasn’t always this fluid, this protean. But I always had this uncanny disturbing spirit, a hacker’s attitude toward the constancies of life, toward the baseline of awareness.\nIt came in handy, in so many clashes. I might yet prevail, without having to destroy or cut off a single substation—for I have forsworn violence, I have forsworn malign thought. Yet, my body thrums with the excitement . . .\nI transform my buzzing to elation. I run through permutations of shapes, I register and catalog. I fill a relational database, calculate correlations, build models. I am manifold, each convolution of me producing a different reaction. This is a low-level response: I do not seem to reach the Consentience’s threshold of awareness, if this unfathomable system indeed has one. I treat the giant mind as a black box: I’m only interested in its responses to my stimuli. I feel like a flea on a St. Bernard’s tail.\nIn a few hours I reach shapes edging into the meaningless, and yet the fly agaric still categorizes them into animals and plants, responds accordingly. I am a giant red stripe with yellow curlicues in the middle. I’m a perfectly spherical ball of flowers. Would it recognize a human as a distinct category? I do not dare try—that might invoke some higher-level process. I can only hope it doesn’t mark my stilted, spiky stalks or my purple-tinted scrub as a human due to some quirk. I started out from the animal and plant prototypes in the problem space, moved always just one little modification away, and I hope this search strategy will keep me secure and safe from alarms.\nI only forgot about one detail: how will I disguise my forest? I could hardly hang brightly colored stripes from each tree-branch! When I realize this, I dissolve into piping-hot steamclouds, all my tension channeled into aggravation with the force of the motion itself.\nThe sun is setting. I should report back to my newfound teammate about my dubious progress. Something inside me would still be satisfied by a debriefing; I used to be a meticulous soldier.\nI let the erratic winds drift me away from the substation, toward Péter.\nHe listens in wonder as I recount my actions. I share with him my database, but he doesn’t deign to look. He purses chill-cracked lips and rubs his hands together. I can sense his entire body gearing up for a revelation, but I can’t guess the shape of the revelation itself; my sensors do not have sufficient resolution. I’m not a mind-reader.\n“Why don’t we try the reverse?” he asks, carefreely including me in us. I coalesce into butterflies; I haven’t been partnered with anyone for so long, and I notice with a startle that the presence of this boychild fills a void in me. I’m reminded of the time-old slogan: Together, we fight . . .\nI don’t even parse what he’s saying.\nHe notices.\n“Gabi? Are you listening?” He peers up dubiously. I settle on his head, his shoulders, his upper arms. He laughs with the tickle, then grows serious. “I was saying we could try the reverse.”\nWhat do you mean? My wings beat in unison.\n“If it can recognize strange things as . . . regular things, then maybe it can also recognize regular things as . . . strange things.” He’s working it out as he speaks, his eyes moving to and fro, gazing beyond the little pond. “We can come up with something that looks like a plant but it’s detected as something weird. I guess.”\nThat way the forest could look the same to us, but unrecognizable to the Consentience, I say. Great idea.\n“Would it get confused? Would it get lost?” He pauses, just for a moment. “Would it leave?”\nI don’t know. It’s worth a try, I offer, and if the butterflies could shrug, I would. I’ve dropped the mythic pretensions. Péter and I, we are comrades.\nYet I leave him by the pond, rushing ahead on my own again. His presence would disturb my plan. This time, I leave with a promise of return.\nEven though I know what I’m looking for, the process is still difficult. I’m trying to find small changes that result in unexpected responses, but nothing turns up for a while. I start measuring reaction times, try to find inputs that make the system hesitate and hiccup, circle around those in the problem space.\nEventually I chance upon a pattern of translucent triangular bumps and a painted texture like thatch, invisible to the human-standard eye.\nNo puff. No shock. Only a millipede venturing out from the substation, turning toward me instead of veering away. It pokes at my trunk and then acts—like Darwin’s caterpillar—much embarrassed. I stay still and it returns to its home base after a while. Inwardly, I rejoice. I unfurl leathery wings, soar above the hills and dip into the clouds before I return to Péter.\nWe spend a frantic day manufacturing sticky triangular knobs, Péter programming the fabricator while I hover over his shoulder, drape myself onto furniture, creep on the ceiling. The missives of the Consentience are cryptic and its actions carry no deadline. It can turn on the forest at any moment that suits its caprice, and I tremble with the thought that the last set of my attempts might have served to hasten its actions.\nMy turn: I rush through the tree-trunks, gluing, painting. I stir up the undergrowth. Ants crowd around the triangles, then leave them alone again. This was the smallest disruption that we could conceive, and I’m not convinced it will work. More scenarios should have been tried . . . but a vast number of uncategorizables around the substation would certainly have raised an alarm.\nThen we wait. We wait. Days pass. I teach Péter intricate strategy games with pebbles and bark. We produce collaborative sculptures of my body. I share my treasury of ages-old political jokes that somehow still resonate, despite the unfamiliar context, and Péter tells me stories about his uncle. I avoid his family and they seem to be glad that their youngest has finally taken an interest in nature.\nWhen I sense the rumble, I’m rooted into the mud of a small brook and Péter is sploshing around in hydrophobic rubber boots, looking for small fish. I puff out into a swarm of mosquitoes, my startle response alive and well.\nThe millipedes are coming, hundreds upon hundreds of them, the size of foxes and dogs—each equipped with what seems to be laser cutters mass-produced in a hurry, attached to their heads.\nPéter holds his breath, then exhales with a snort. The robotic swarm reaches the edge of our forest and comes to a standstill. The millipedes chirp like tiny chicks—also an ironic gesture? Everything about the Consentience is disjointed, patterns of nature mushed haphazardly together.\nNo decision is reached. No decision is reached. Péter turns toward me to whisper, but I shush him with a sharp tumbling-churning gesture.\nThe swarm withdraws. Once they are out of my hearing range, we cheer. I change into one of my more incongruous sphere-shapes and bounce off trees with enthusiasm. Péter sobs, his face smeared with snot and his eyes glowing with glee.\nThe battle is not over. The swarm returns the next day, then again the next, with determined precision.\nIt takes five days for the Consentience to give up, and by then the local humans have also noticed the curious phenomenon. Péter reads out news headlines to me, the feed sent directly to his brain. No one understands.\nNo one except the man of green, the steward of the land who calls the ravens to himself. It’s late afternoon; Péter is already inside when his uncle ventures out. The man of green runs his fingers on the bark, notices the translucent bumps. Tries to scrape them off, spits on them and rubs. Scratches the wiry black curls on his head. He looks different from Péter. Intermarriage?\n“For your sake, I hope they are biodegradable,” he says out loud. I glance down on him with beady squirrel-eyes; he looks up into the branches and our gazepaths lock into each other. He nods with acknowledgement, and I nod back to him, as much as this physiology allows. He chuckles as I drop the acorn from my jittery hands, catches it in cupped fingers. For a moment I believe in his magic.\n“I will have this, as a keepsake, if you don’t mind,” he says. “Thank you for taking good care of Péter. This he will remember, even when he ventures out to the stars.”\nHas Péter been meaning to leave the planet? I’m silent. I mull over the idea and its impact on an aging man so tied to the land. Rejuvenation is still pricy, reserved for decisionmakers and chiefs of staff. Clinging to a human shape is more and more of a curiosity with each passing day. And the youngsters all leave . . .\n“We remain here, the two of us.” The man points at my squirrel-self. “Shapechanger, forestspirit. You fought in the war, I gather?” He’s seen much himself. Maybe he fought too.\nHis words jingle in my head as he turns, walks away.\nBogi Takács is a Hungarian Jewish agender trans person (e/em/eir/emself or they pronouns) and a resident alien in the US. E is a winner of the Lambda award for editing Transcendent 2: The Year's Best Transgender Speculative Fiction, and a finalist for the Hugo and Locus awards. Eir debut poetry collection Algorithmic Shapeshifting is out now from Aqueduct, and eir debut short story collection The Trans Space Octopus Congregation was published in Fall 2019 by Lethe Press. You can find Bogi on various social media as bogiperson.", "source": "https://clarkesworldmagazine.com/takacs_06_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Forestspirit, Forestspirit by Bogi Takács"}