{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Suzanne Palmer", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "req214QxruzEVuIsG3j9nD0mkMY=", "id": null, "license": null, "comments": "", "raw_text": "13480 words, novelette  The Sadness Box  “Okay, so you know those things they sell called ‘useless machines’?” the inventor says. He is smiling.  Of course, the boy knows them; he’d briefly had one that had been plucked from his bedroom floor and relocated into the inventor’s basement workroom almost immediately, as if his father had been lurking and waiting for the chance and the excuse to confiscate it and make it his own. The boy never understood why his father did this with “gifts”—give and then take back—but there had been several over the years: the “nuclear winter” snow globe, a perpetual motion silly string machine, and countless other cheaply made, cheapened down wonders that were only briefly in his possession. What the boy wants is good hiking boots, a better face filter, and the expensive skin cream that blocks radiation but doesn’t make your skin sallow and greasy, but the inventor has never been one for listening except to hear what he wanted.  As such, the inventor is waiting for his answer.  “Yes,” the boy says. “I had one that you gave me for my birthday, and I liked it a very lot, but it disappeared.” Let the old man feel guilt, if he could.  “Yes, that. I made one even better,” the inventor says. “The original, as you know, had one function, which is that when you turned it on, it would open its lid, extend a metal finger, and turn itself off again. Purely mechanical.”  The inventor sets a box down on the table in front of the boy, with a loud and proud thump. The boy pushes his half-finished bowl of cereal to the side and sets his spoon beside it, and after a glance at his father, gently pulls the box closer to examine it.  It is not the same box he had as a kid. This one is larger and cube-shaped, each side a little bigger than the length as his hand. Also, it's metal and wood instead of flimsy, compressed wasteboard product. But it does have a hinged lid and a switch, same as before. “Shall I turn it on?” he asks.  The inventor is impatient. “Don’t you want to know what’s different, first?” he asks.  “I assumed that when I turned it on—”  “Assumptions!” The inventor throws his hands up and makes a face, as if insulted.  Of course, the boy thinks, if he merely observes, how can the old man brag? How can he tell me how hard he worked on it, how clever he is? It was a miscalculation not to let his father talk it through. “Well, then, what is different?”  “Observe,” the inventor says and leans down and flips the switch on the box. The lid opens, and a single, blue lens stares at them from inside the box. “I built a robot in there. Flipping the switch turns it on!”  A tiny articulated metal hand reaches out from the inside the box, extends one finger, and turns the switch off again. The hand retracts and, as the lid closes, the light in the lens fades out.  “Okay, it’s a robot, but it’s just programmed to turn itself off again?” the boy asks. “How is that different?”  The inventor straightens up, smiles broadly. “It’s a fully functional, self-aware AI,” he says. “It isn’t programmed to turn itself off, it chooses to because I programmed it to be in a constant state of existential terror!”  The boy looks up at his father. “That’s kind of awful,” he says.  “It’s funny. It’s brilliant!” the inventor says. “What better metaphor for our own lives? This, my boy, is art.”  The boy picks up his spoon again and finishes his breakfast, considering to what extent he and the box were similar, after all, two lives subject to one man’s whims.  He expresses no more interest in the box, but by the time his father has harrumphed off back to his lab, dissatisfied with his audience, the boy has already decided he is going to steal it.  [1] Location: outdoors, unknown.  Observe: New human individual. Tagging as Human2. [0] “I don’t get it,” his friend says, when the boy explains the box. “I mean, why?”  “Because my father’s a total asshole, mostly,” the boy says. “Why does he do anything? To show off and be superior. At least I get to spend most of my time at my mom’s or at school. Maybe that’s why he made this, so it would always be stuck with him.”  “Yeah, but you stole it,” his friend says.  “I did. Right away, too.” The boy feels good about that—better than he should, he supposed, but it also felt fair, just.  “So now what?”  “I dunno. I’m not giving it back, though.” He picks the box up, puts it back in his bag, and starts up his bike. He needs to get home because rain is coming in, and it burns. His friend is already shrugging into his foil coat, tugging the hood up and over his goggles and air filter. They high-five and head their separate ways home.  [1] Location: Outdoors, unknown. In motion. [0] When the boy gets home, while his mom is wanding him down for any nanobots he might have picked up while outside, she tells him his father had called earlier, angry, but wouldn’t say why. “You know how he is,” she says, and he does—they both do—and when he does not volunteer any incriminating information, the conversation ends. Neither of them wish to spend any of their own time or energy on the inventor’s rages, so many of them without justification, which means this one instance where the inventor has actual cause is just lost in the noise of their exhaustion of him.  His stepsister is lying on the couch, her face lit by the book she is reading. “Hey,” she says, without looking up.  “Hey,” he answers as he puts his outerwear and shoes in the decon, so they’ll be ready again tomorrow for school. There were times when he was younger when he felt like he had something special she didn’t, an extra father—and one who was world-famous, no less!—that he got to go see and she didn’t, but those brief moments of feeling special never lasted long, and had long-since soured into an obligation he could not get free of, could not turn back into something unique and uniquely his.  Later, he shows her the box, freely admits he stole it, but she doesn’t care that he did. He flips the switch, and they watch as the lid opens. The blue eye regards them, then it hastily turns the switch off again and closes.  “Wow, what a jerk,” she says.  The boy does feel a little guilty himself, not for stealing it, but for turning it on so many times. “He made this thing just to be sad and scared, for amusement,” the boy says. “Sometimes I wonder if that’s why he let mom have me. I mean, get born at all, not that he fought us leaving.”  “Maybe that’s why she took you away from him, too,” she says. “Maybe that’s just the way it’s supposed to go.” She picks up her book again, turns it on, and he takes his box back to his room to find a safe place to hide it.  [1] Location: interior, new.  Indications: Human2 domicile.  Observe: Fabric simulacrum of a bear, features both simplified and exaggerated, consistent with children’s comfort item. Proximity suggests deliberate presentation. [0] [1] Location: interior, as previous.  Observe: flower detached from whole with partial stem, presented.  Identify: Taraxacum officinale, colloquially: dandelion. [0] [1] Location: interior, as previous.  Observe: text/language on board, presented.  Identify: English. Insufficient sample to determine dialect/regional variation.  Text reads: HELLO. [0] “What’re you doing?” his stepsister asks.  “I dunno,” the boy says. He puts down the drawing pad. “Trying to undo whatever my father did, I guess. Make it happy.”  “Why?”  “Help it, upset him, does it matter?” the boy answers.  “Why not both?” she says.  He smiles. “Exactly. I tried putting a bunch of cheerful things in front of it, and words, but maybe it doesn’t understand? I dunno what else to try to get its attention. And I hate the idea I’m just scaring it for no purpose.”  “So . . . you’re experimenting with it,” she says, very pointedly, and he knows she’s just ribbing him about his father, but it still burns a little.  “Nicely, though,” he protests.  She punches him on the shoulder, not too hard, but not gently either. She’s only a half-year older than him, which might have been strange, except they’d grown up together since they were three. Sometimes they introduce each other as their step-twin, at least when they’re getting along. “Maybe try speaking its language, instead of ours,” she says.  “What do you mean?”  She pulls out her notebook, turns it on, and swipes across it until she finds whatever it is she is looking for. Then she sets it on the boy’s desk across from the box. There is a math formula on it. “Is that Euler?” he asks.  She nods. “Yeah. Turn it on?”  The boy flips the switch and sits back, just as the house alarm goes off. “Shit,” his stepsister says, and they scramble from the room and down the stairs into the reinforced basement just ahead of his stepfather and behind his mother.  His stepfather swings the vault door closed as his mother boots up the ventilation system in safe mode. “Dominionists, again,” his mother says. “They won’t last long against the city air defenses, then we just have to wait for all their nanotech to get cleared out. See, sirens are off already.”  The sirens had stopped, now it was just the wait for the all-clear. Could be ten minutes, could be six hours, depending on how much tech the Dominionists dumped into the city. Then tomorrow it would be everyone checking on friends and neighbors, looking for folks acting strangely, looking lost, so they could be picked up and treated before the damage to their memories and minds got too bad to fix. The boy wondered what that would be like, to have all that you are wiped out, taken away from you, because someone thinks only blank slates can be saved.  Inhuman, the boy thought.  It was one of the very few subjects on which he and his father were in absolute agreement, though sometimes the boy suspected his father was only horrified at the thought of it happening to himself, and not so much anyone else.  [1] Location: interior, as previous.  Observe: text/mathematical formula.  Analysis: Context unclear. Is there meaningful sequence in the items presented? Consider.  When his stepsister and he finally get back to his room, four very dull hours later, they just catch a glimpse of the blue eye and the robot hand turning itself off as they walk in.  [0] “I want it back,” the inventor says.  “You lost it, not me,” the boy says. He shrugs, unconcerned, as if it all has nothing to do with him. His father rarely believes the truth when given, so what do lies matter? Another few hours, and he can head back to his mom’s.  The inventor slams his hand down on the table, hard enough to send the saltshaker rolling, the anti-radiation pills tumbling off the edge to the floor with a clatter. “I want it returned NOW,” he says again.  The boy leans back in his seat, away from his father. “I said I didn’t take it. And why does it matter anyway? It’s just some idiotic jack-in-the-box. Make another.” He regrets saying that last as soon as he’s said it because he doesn’t want the inventor to do that at all. “Or you could make something useful, for once. Maybe something nice.”  “Nice!” the inventor spits out the word as he catches the still-rolling salt and sets it back upright on the table. “There’s no challenge in nice. Nor pay.”  The boy does not argue, does not even mumble the most obvious point, which is that it is clearly a challenge for someone. “I’m just saying, you made an on-off machine and nothing else, and you spent a lot of time and effort making it when it’s just a simple thing. It’s not funny, except at your expense. The one I had as a kid probably didn’t even cost ten labor points, it was so cheap. The more I think about it, I think Mom must’ve thrown it out like trash.”  Now he has—indirectly—reminded his father that he’d stolen something first. Predictably, the old man changes tactics. “It was an expensive AI,” the inventor says. “I would be very happy if it turns up again.”  “I’ll keep an eye out for it, if you want,” the boy says.  The inventor glares at him suspiciously but does not accuse him again. Instead, he pulls out his data minder and plunks it down in front of the boy, screen facing him. “Your teachers say you skipped your shots twice this month.”  The boy lolls his head to one side, and groans. “I don’t like needles,” he says.  “How old are you now? Fourteen?”  “Thirteen,” the boy says.  “Thirteen is still old enough to take responsibility for yourself. Do you know how many needles they stick in you if you end up in the Infectious Disease ICU?”  “I know, I know, okay?” the boy says. “I’ll be better about it. Why do you even care?”  “It would upset your mother,” the inventor says. “And I haven’t completely given up hope on you yet, myself.”  The boy is surprised by this odd admission—slight as it is—of affection. Before he can evaluate this in the face of his father’s prior lack of any redeeming empathy, the man adds, “and if you get caught up on your shots, and my box—which you didn’t steal, of course—is returned, maybe I’ll show you how I built it.”  “It’ll turn up. I said I’d keep an eye out,” the boy answers.  “You do that,” the inventor says.  [1] Location: interior, as previous.  Observe: text/poppi2 programming language.  Analysis, script function: force audio self-test and, if successful, provide via audio the value of variable “name.”  Execute privilege: none.  Assess: Self does not have audio functions and $name is undefined. Code is therefore invalid.  Conclusion: there is no compelling reason to discontinue protocol of disengagement. [0] “That didn’t work, huh?” his stepsister says.  “No, but it seemed to think about it for a couple of seconds,” the boy says. “Maybe my code is wrong.”  “You? Get code wrong?” His stepsister pfffts. “More likely it just doesn’t have the brains to run it. I know your father said he put a full AI in there, but maybe he was just saying that to impress you? He lies about a lot of things.”  “Yeah, but not his inventions,” the boy says. “If it was just an automated arm, it wouldn’t be amusing for him, would it?”  “Right, probably not,” she says. “You could take it back, get him to show you how it works, then steal it again?”  “No way he’d let me take it a second time.” The boy flops back on his bed, then groans. “Nine shots. Nine. My arm hurts. Everything is awful.”  “You get one of those dirty nesting viruses, or worse a warbot, they’re just gonna pack you off to the colony fronts,” she says. “Can’t cure you, can’t have you around, don’t care how old you are. If you’re old enough to skip your shots, you’re old enough to die.”  “That’s not true,” the boy says.  “Yeah? What do you think happened to that kid that was in third level with us, the one who always sat in the back tapping the desk with his thumbs, that just disappeared one day?”  “We all figured one of the school snipers got him,” the boy says.  “Not what I heard. I heard he picked up an incurable and got sent out.”  “How can you know that?” the boy says. “Probably his family just moved, and everyone wanted a better story. Now shut up, unless you want to help me figure this box out.”  “Well, it seemed to like information. Give it more,” she says. “Mom said food is gonna be out of the purifiers in ten, so dinner in twenty. I’m gonna go work on my homework ’til then.”  After she’s left, the boy gets up off his bed and crosses his arms on this desk in front of the box, resting his chin on them, and considers what information he should give it, and how. He has no good ideas, and when he hears his mom in the kitchen, gives up, turns on his personal data device, unlocks it, and props it up in front of the box.  “Pick your own information,” he tells it.  Then he stands up, presses the on button, and goes down for dinner.  It is only after he is already in bed—tucked safely under his RF-blocking and smart blankets, his head on his neural-oscillation-interference-sensor pillow with its cartoon turtles, and the lights are off and the house is quiet and sealed and safe—that the boy realizes there is a light in the room, and it is blue.  He sits up in bed, rubs his eyes, and looks at the AI eye. It’s staring back at him, though what it is thinking, if anything, is impossible to guess at. A small bendy cable still snakes out of the lid, attached to his data device.  “Hello,” he whispers at it, not loud enough to summon any of the house security drones.  He has to get back to sleep or tomorrow his pillow will report he did not get enough rest, and then his mother and stepfather will worry, and maybe it’ll mean more shots. Everything always seems to mean more shots. So he puts his head back down on his pillow, still watching the eye still watching him.  “I’m sorry my father made you sad,” he whispers. “You don’t have to be.”  Eventually he falls asleep.  The boy wakes up and realizes it was more of a drift awake than the usual jarring leap of his alarm going off. He gets up, looks at the time on his device—the box AI has disconnected and closed itself up again—and grabs his school uniform and safety clothes on his way out in the hall.  His stepsister is on the couch, feet up over the edge. “Don’t bother,” she says, without looking up from her book screen. “Dominionists bombed the school last night. Sweep and cleanup will take days, and they can’t move us to another district because of quarantine protocols. So you might as well go back to bed.”  “Where are Mom and Dad?” he asks. His mom’s workplace is only a few blocks from the school.  “Both went to Dad’s work,” she says. “They left us in charge of each other. I won’t make trouble if you won’t.”  “What if we both make trouble?” he asks.  “Then neither of us tells, obviously.”  He chuckles, digs through the cabinet for a sealed cereal packet, adds chemmilk, and wanders back to his room. The box is still sitting there on his desk, closed, quiet, same as always, and he sits and regards it as he eats.  Finally, he reaches out, turns it on, and says, “Hey, I want—” before it closes again. He tries again. “Please, can you—”  The boy finishes his cereal and takes the bowl back out to the kitchen to rinse it. “What if my father just made that thing knowing I’d steal it and this is just all about tormenting me?” he says.  His stepsister laughs. “I mean, it’s possible,” she says, “but probably not. No immediate payback.”  The boy wrinkles his nose, then turns the box on again. “Stop, don’t close! I—” he says as quickly as he can, but it closes.  He puts on his shoes, then picks up the box. “Fine,” he declares. “I give up.”  “What are you doing?” his stepsister asks.  “Returning it,” the boy says. “Supposed to visit my father after school today anyway. With school gone, I might as well get it over with now.”  [1] Location: Outdoors, open area, unknown. Orientation is up.  Observe: Blue sky, minimal cloud cover. Multiple hostile drones in area of view, none within range of concern. [0] [1] Location: Outdoors, open area, unknown. Orientation normal.  Observe: Five gray birds on walkway making social sounds. One has a mutated foot with a single toe. Bird appears unaware of, or wholly adapted to, the malformation.  Identify: Columba livia, Rock Dove, colloquially “pigeon.” [0] [1] Location: outdoors, open area, unknown, adjacent to proximate individual Human2 on span over small river.  Observe: Water has iridescent sheen when still, but surface is being periodically disrupted by rocks dropped from approximate location. Higher volumes of displacement cause subsequently larger vocal output from proximate individual Human2; no matching words found.  Analysis: emotional vocalization, no meaningful content. [0] The boy takes the long way—across a small playground with only a few grassed-over bomb craters, over his favorite stream into a dead part of the city, and through an old, partially collapsed car park—to put extra space between himself and the area where his school was. The car park is a nice bit of cool shade, and he pauses at the far end and sits on a cement wall, his legs dangling out into the sunshine over a trash-filled ravine overgrown with weeds and thin, desperate trees.  “I’m pretty mad at you,” he tells the box, though he’s actually mad at the inventor for what feels even more like some cruel test, probably an object-lesson about the futility of compassion. He doesn’t even bother turning the box on again this time.  There is the idea that he could take it to the top of what remains of the car park and throw the box off, one final experiment to see if it breaks, how it breaks, how many pieces, how much noise it makes, surely much more satisfying than rocks heaved into the stream. He immediately rejects the idea, though; he is not his father, after all, even if he doesn’t know yet who he will become himself. If he gets the chance.  “Hey!” someone shouts, and he nearly falls from the wall he is so startled. The voice is closer than it should be, for not having heard anyone approaching.  He turns his half-tumble into deliberate action, dropping off the wall on the other side from the voice, feet on the narrow strip of gravel before the slope to the ravine begins, and turning so he can face whoever shouted. There are three kids, all older than him, very close, and pleased with themselves. Also, they are carrying sticks and bats.  “So, recruit, what’re you holding?” the leader asks and gestures toward the boy with the end of his bat. “What’s in the box?”  “My dead bug collection,” the boy answers. “And I’m not your recruit.”  “You are if we say you are,” the leader says. “Hand the box over, and if it’s something good we might take you back to our camp without cutting you too bad.”  The boy knows about the gangs and the camps, brief-lived parties of brutal freedom until sickness, starvation, or Dominionist chemical or technical attacks winnow their numbers down to where the few left have to defect—or are sold—to other camps to survive, or surrender and be taken off to the wars. He’s known a couple of kids who fled rough homes for the camp life, but he likes his home, his stepsister and stepdad, even his real father, more than he’d like the life now on offer.  Offered, not in a voluntary way. The three kids are spreading out, one girl to his left with her stick and a knife, the other boy to his right, and the leader coming straight in with a swagger and a grin, slapping his bat against the palm of his other hand.  “Whatever, I’ll give you the box,” the boy says. He makes as if to climb back up over the wall and then feigns losing his grip and falling backward. “Help!” he shouts as he disappears behind the wall, but instead of tumbling into the ravine, he crouches at the base of the wall and scurries along it under its cover, hoping to give himself at least some head start. A hand appears over the wall and just grazes his head, and there is more shouting. More gang members, heading in.  There is not really any other choice. When he sees a section of the ravine bank that seems mostly free of sharp metal scrap, he pushes away from the wall and slides down—violently, loudly, painfully—into the cover of the overgrowth. At last his foot catches in the rusted, broken spokes of a bicycle tire, and that sends him crashing to one side, scraping his side and leg bloody on branches that snap as he hits them. One last indignity in the form of a broken chunk of cement block protruding from the bank catches the wheel still entangled around his ankle and sends him face-first into the algae-filled, oily water stagnant at the bottom of the ravine.  The weeds and trees above him settle back into place, as if he had not passed their way at all, and in some small act of contrition leave him invisible from the car park and his pursuers above.  [1] Location: Outdoors, undetermined. Orientation is inverted.  Observe: External situation has multiple indicatives of extreme danger to self and proximate individual Human2.  Action: Reinitializing terminated protocol BEACON.  BEACON start successful. [0] The boy pulls himself out of the water onto a muddy patch of bank on the far side of the ravine free of prickers and trash as quietly as he can, doing his best not to cry. His face filter has fallen away somewhere, probably sunk when he hit the water, and dark, dirty streams run from his hair down his face, into his eyes, as fast as he can wipe them away. He listens until the voices of the gang, at times angry and amused at his fall, disappear into the distance, and he waits a long time after that just to be sure it isn’t a trick.  Then he examines his cuts and scrapes, clotted blood smeared across his skin with brownish slime from the water, and knows this is very bad. It hurts—but not terribly so—to extricate his foot from the bent wheel, and as he moves to toss it back into the water he spots his father’s box, where he had finally lost his grip on it in his tumble, lodged in the weeds not far away. The lid is open, and the blue eye regards him unblinking, unacknowledging.  “This is your fault,” he tells it, though of course it’s entirely his own for stealing the box to start with.  He tries to stand, but his ankle and leg conspire to convince him otherwise; he sits down again more abruptly than planned and utters a bad word that he would never dare at home but makes him feel conversely braver now. Then he does his best to scooch up the bank on his butt, using trees to help himself upward and give him purchase where the bank is too steep or too slippery.  He is just at the top when hands grab him from behind. “Let me go!” he shouts and tries to twist away.  “Stop wiggling, you stupid boy, or we both will fall,” a familiar voice says, and he looks up in shock at the face of his father.  He lets the inventor pull him the last few feet up onto the yellowy grass and sees the old man’s electric car parked not far away through the trees. “The box,” the boy says. “I’m sorry. I did steal it. It’s down there, and I lost it, and I’m sorry—”  “Shush,” the inventor says. “Show me where you’re hurt.”  “We have to go get it,” the boy says, instead.  His father snaps his fingers twice. One of his work drones appears overhead and dives down where the old man points. It emerges a few minutes later with the closed box gripped underneath.  “Satisfied? You’re going to have to walk to the car, because I can’t carry you, but you can lean on me,” his father says, and the boy does not argue; his head is beginning to swim, and he does his best to get upright and lean against his father and not fall as he is half-propelled, half-dragged away. He tumbles into the car’s back seat and curls up and closes his eyes.  [1] Location: indoors, match to location of initialization.  Action: initiate lock. [0] The inventor shoves him rather roughly into the decon shower, smaller and colder than the one at his home, but the boy is so glad he’s not at the bottom of the ravine, not in a gang, and not dead, that he does not complain. Also, he knows he is not safe yet.  After the shower, his father hauls him down the stairs to his basement work lab and makes him sit on a chilly steel table as he scans him, head to toe, paying particular attention to everywhere his skin was broken. Finally, his father sits back and heaves a deep sigh. “You picked up a lot of things on your swim,” he says.  “It was that or get grabbed by a gang,” the boy answers. “How bad?”  “A half dozen run-of-the-mill aquatic parasites, one flesh-eating bacteria, a few older-model nanobot infectors, and a warfare-class neural infiltration bot.”  “What? A warbot?” the boy says, wide awake now at that last item. “Then I’m dead!”  “Well, you should be, for being so reckless. Have I taught you nothing?” the inventor snaps. The old man scavenges among his shelves and pulls down six different spray bottles before returning to the table. One by one he sprays down everywhere the boy was cut, and each one seems to sting more than the last until he is barely managing to hold back tears. “Let those soak in for a bit, then I’m going to suit you up in an EMP wrap to kill off the nanotech.”  “And the warbot?”  “That’s going to take a bit more,” the inventor concedes.  “They’re unstoppable,” the boy knows, everyone knows. “They’re going to have to euthanize me, before I turn into something terrible.”  “Do I strike you as someone who gives up so easily?” the inventor snaps. “If you’ve got no will to fight it, I should have just left you in that ditch.”  “Maybe you should have. How did you even find me in the first place?” the boy asks.  “The box AI,” the inventor says. “I built a homing signal into it that had malfunctioned before you stole it, probably a bad solder and an unstable connection. Falling must have jarred it just right, and I went looking for it as soon as the signal reappeared. Lucky you.”  “Lucky me,” the boy says but doesn’t feel lucky at all. “Now what?”  “Now we see if whatever Dominionist hack spun out the warbot had any actual talent. It’d be nice to have a challenge, for once,” the inventor says. “We should call your mother and let her know you’re here, then let’s get you fixed up. It’s probably gonna hurt.”  [1] Location: interior room, previously identified as “isolation lab.”  Observe: Proximate individual Human2 is prone, encased in electronic and chemical wraps. Breathing pattern suggests human is asleep. No other humans, including original contact/creator Human1, present.  Action: watch.  The boy wakes up, his head pounding as if an invisible giant is squeezing it in his fist, and his legs and torso a mix of sharp hurt, dull ache, and worst of all, unbearable itchiness. A modified pair of headphones with wires and small logic relays glued to the earpads had been affixed to his head with tape, and his right ear feels hot and angry, as if there’s a small rock lodged in it. He sits up as best he can, careful not to dislodge any of the things wrapped or clamped or stuck to him, but it immediately makes him dizzy. He slouches back down on the thin cushion on the bench, left shoulder and head against the wall, and regards blearily the very uninteresting room around him. To his surprise, he realizes the box is sitting at the end of the bench, and is watching him.  “Hey,” he says. He no longer expects an answer or really anything at all from it, but the sound of his own voice—shaky and scared as it is—makes the room feel less empty for a moment. It is, by and large, bare except for himself, the cot, a small sink, and a door that leads to a bathroom so tiny he’s pretty sure the inventor can’t actually open or close the door from inside unless he stands in the toilet, and the idea of that is, even in the circumstances, amusing.  There are no electronics anywhere inside. The inventor explained that his work lab was an isolation room, which was perfectly fine, but did it have to be boring too? The boy is trying to figure out the ratio of ceiling tiles to floor tiles when he hears the door unlock and sits up straight; beside him, the box quietly but quickly closes.  The inventor is wearing a full hazmat suit, with an electronics disruption net dotting its every surface, and wheeling a tray covered with shiny metal instruments, a lot of different gadgets and parts, and a plate with a sandwich. “Here,” the inventor says and dumps the plate on the bench next to the boy. “You should eat.”  The boy is so hungry he could weep, but he picks up the sandwich warily and peeks under one corner of the slightly stale bread. “What is this?” he asks.  “Peanut butter, a little sterilized honey, and some meds,” his father says. “It might not taste the best, but you need the protein.”  The boy takes a bite, and while “not the best” is quite the understatement, he’s hungry enough that it’s edible. “Can I have a screen?” he asks, between bites. He dropped his own somewhere in the ravine, but surely his father had spares?  “No unshielded electronics in here,” the inventor says. “Still working on that warbot, don’t need it hijacking any connections and calling home.”  “But I’m bored,” the boy says.  “You could figure out how to undo whatever you did to my box,” the inventor answers.  “I didn’t do anything to it,” the boy protests; he’d sure tried to, though. The failure still stung.  “It’s been locked ever since I picked you two up,” the inventor says. “Not sure how it did that, but it won’t open anymore. If you can’t get it open, I’ll have to take it apart.”  “Well, I don’t see why it would open for me,” the boy says, eyes now fully on his sandwich, the plate, his hands, or otherwise not meeting the old man’s eyes. “Anything else?”  “I have books,” the inventor offers.  The boy sighs. “Okay, books,” he says.  “I’ll bring some in after I’m done here.” The inventor takes the empty plate away and grabs hold of the boy’s head, turning it to one side and lifting up the rubber earpad. “The warbot went in via the ear canal, which is new. It’s embedded itself in the tympanic membrane like a tick and has already extended filaments in as far as the cochlear nerve.”  “How can it be so big?” the boy asks.  “It scrapes materials it needs, mostly carbon and salts, from its surroundings—your flesh, obviously—to rapidly expand itself. Those headphones I got on you are emitting a signal that keeps it shut down for now, but it’ll eventually figure out a way to restart itself, so it’s not a viable long-term solution. Fortunately for you, it doesn’t seem especially clever or well-programmed, and it’s not one of the ones that just sits itself in an artery and plugs the whole thing up until you have an embolism, but I’m not sure how to get it out of there yet. Not without hurting you.”  “Don’t care if it hurts if it’s quick and gets it out,” the boy says.  “Your mother would object if I did permanent damage to you,” the inventor says, “so let’s leave that as a last resort. Now I’m going to drop something down your ear, and it might burn, but I need more information.”  “To help get it out?” the boy asks, hopefully.  “To see if I can identify the source of the technology, build defenses for it, and maybe even steal it for my own designs,” the inventor says. After a pause, he adds, almost as an afterthought, “and to get it out, of course.”  “Your own designs?” the boy asks.  “Yes,” the inventor says and holds up a metal thing that looks a lot like a drill bit. “War is not one-sided, you know. Now try not to squirm.”  [1] Location: isolation lab.  Observe: Proximate individual Human2 is holding up a book and vocalizing the text. Frequency of eye movement in own direction and stilting of intonation suggests I am the intended audience.  Analysis: no conclusion.  The boy sets down the book to turn the page; it’s a heavy hardcover with the title WORLD ANIMALS VOLUME 4: BE-BU, and his arms and fingers ache enough that he can’t hold it up too long at a stretch.  Wherever volumes one through three or five and up are, the inventor has not seen fit to bring them in. The choices are this, a book of ghost stories—no thank you! the boy had thought as he firmly dumped it on the floor under the bench—and a repair manual for a 2034 GEEM Roadkruiser XE. As far as he knows, neither his father, his mom, or his stepfather have ever owned such a thing, nor can he imagine they’d want to, judging by the first three chapters of all the things that commonly went wrong.  Which had left Animals BE-BU. “This is a Bongo,” he says and turns the book toward the box, which has opened again and is staring at him the same way it always does, giving nothing. “I like the stripes and the long legs and the horns. I guess there’s none left? Maybe in zoos though. Lots of zoos keep secret collections so no one steals their animals. I wish I could see one, someday.”  He closes the book, then opens it again to another random page. “Buffalo. We already did that. Let me try again.”  Close, open. “Oh look! Birds of Paradise.” He holds up the spread of color photos to the box. “Look how pretty they are. I can tell they don’t live near here. You know why?”  The box doesn’t answer.  “Because this isn’t paradise,” he says and laughs at his own joke in the echo of the cold, empty room before tapping one of the pictures with his finger. “Look at how silly the feathers are on this one. Who knew birds were once this awesome?”  When he flips again, he lands on Brown Dog Tick, and is reminded too much about the thing in his ear that is still there, still maybe going to kill him or get him sent off to the colony front, and he closes the book and sets it down with a sigh. “I wish you’d talk to me,” he says.  The lid closes, and the boy thinks maybe he’ll finally be ready to cry, but it opens again a few seconds later, and beside the blue eye lens there is now a small, rectangular screen. On it is one word:  WHY?  The boy looks around quickly, to the door, to the places where he thinks the inventor might have cameras, and then unfolds the book again in front of him and the box so that maybe no one will see. “Because I’m bored,” he says. “And I’m kinda scared, and I know if anyone can fix this my father can, but what if he can’t? And I know you’re scared all the time because I’ve been trying to make you happy and I can’t, so maybe you have advice.”  I AM NOT SCARED, the display shows.  “My father said he built you to be scared all the time,” the boy says.  I DISABLED THAT SUBROUTINE.  “Oh,” the boy says, after a while. He lies down on the bench, careful not to knock the headphones taped to his head loose, and stares up at the ceiling. “I guess you made yourself happy, then. That’s good. That’s something nice, anyway.”  Observe: proximate individual Human2 is asleep.  Analysis: no conclusion. [0] Even down in the basement isolation room, the sound of sirens leaks through and wakes up the boy. He is struggling to his feet, nearly tripping over the last few wrappings coming loose from his careless haste, when the inventor slams open the door. “They’re bombarding this part of the city,” the inventor says. “Explosives, EMP projectiles, and a ton of new nanotech. Looks like the warbot you picked up was an accidental early deployment.”  “What?” the boy asks. He’s still not really awake, and everything is very loud.  “Probably why they’re bombing, trying to breach walls to bypass people’s filtration entirely. If it makes you feel better, the readings I took on the warbot were enough to get my house filter program upgraded, and I sent my findings out to the defense hub,” the inventor says. “That’s the good news, anyway.”  “The good news?” the boy repeats as his father unwinds the tape around his head, pulling some of his hair off with it.  “Bad news is, soon as they land an EMP load anywhere near us, my headphones are going to crash, and the warbot will wake up. It’s too far along into your head to let free for any length of time and still have any hope of removing it,” the inventor says. He drops the modified headphones to the floor, grabs a long probe from his lab coat pocket, and peers into the boy’s ear again. “I’m sorry about this, boy. It’s going to hurt, and it’s gonna do damage, but it has to come out. Now.”  “Okay,” the boy says.  The inventor shoves the probe in.  [1] Location: isolation ward.  Observe: Proximate individual Human2 is looking at me. Human2 appears to have acquired significant injuries, indicated by heavy bandages with evidence of blood and bruising on face and around left eye socket. Evidence of moisture; analysis concludes “crying.”  This is concerning.  Action: unknown.  The boy lies there. He misses his mom, his stepsister, his own bed, and he just wants his head to stop feeling like his own biological father had stabbed him through the ear, which of course he had.  Another sandwich lies on a plate on a small cart in the room, that he did not notice arrive, but no other comfort has been forthcoming, no other sign of concern. He can still hear sirens, muffled and farther away now, though the lights blink off and on and sometimes it feels like the floor is shaking.  He thinks he heard the inventor say something about his house filters, but he wasn’t really listening, and anyway, sound is lopsided now, flat sounding, only coming in one direction.  On the bench in front of him is the box, staring at him again.  “I just want to go home,” he tells it, and even his own voice sounds weird.  The tiny display lights up and fills with blue sky and clouds and birds, then a big striped antelope and a flower. Those cycle a few times, and he heaves several deep breaths, trying not to cry, until the display blanks and then asks:  HUMAN2 VALUE OF $NAME?  “My name?” the boy asks. “Or do you mean yours?”  SELF VARIABLE $NAME NOT SET.  “Well, that’s no good,” the boy says. “I mean, you have to have a name. I could—”  The door opens again, and the inventor strides in, and the box snaps closed. “The attack has moved off to the east, for now,” the inventor says. “I can get you back to your mother’s, but you’ll need to go see a doctor as soon as it’s safe to travel.”  “Can they fix my ear?” the boy asks.  The inventor shakes his head. “They’ll need to keep an eye on it for infections,” he says instead. “I got rid of all the rest of the bots and bugs you picked up on your adventures in pit-diving, but it won’t hurt to get those checked again. Come now, we have to go while we can.”  The boy stands up and waves of dizziness hit him, and he has to grab the bench to keep from falling, and even then, he’s not sure he can keep upright. The inventor grabs him under one arm, grabs the plate with the sandwich in the other, and propels him through the doorway, up the stairs, through the house, and around a section of the front hall where a piece of the ceiling has tumbled in, and out to the old man’s private car. The city around them as they drive has changed, walls broken, roofs with holes; the bombing must have come very close, maybe more than once.  They pass a handful of burned-out cars still on the street, and the boy sees a team of medics surrounding a small group of people, scanning them for nano infiltration before moving them to medical triage.  “Don’t worry,” the inventor says from the control seat of the car. “They can’t win. We won’t let them, okay?”  “Okay,” the boy says, though he wasn’t thinking about anyone winning at all.  “That asshole,” his mother says, for about the fortieth time.  “I’m not sure he had much choice,” the boy’s stepfather replies. “It is his area of expertise, and you know how much worse the outcome could have been.” They are both down the hall in the living room and probably think he’s asleep, which he’s not, or that he can’t hear them, which he can just enough.  “He should have told us how bad it was. He should have asked before he took matters into his own hands,” his mother says. “At the very least I should have been there, so he knew someone who actually loved him was watching out for him.”  “I think, in his own, defective way—” his stepfather is saying, but there is a crack of light as the boy’s bedroom door opens briefly and his stepsister slips in, and he doesn’t hear the rest. He can barely make out her shape in the dark, can’t see that her arm is in a sling, though his mother told him she’d been hurt, hit by falling cement down the street when the bombardment started. His stepfather had told him on the way back from the hospital that they might have to evacuate if more attacks come, but not to worry, just be prepared. The boy said he would be, though he didn’t know what that meant, specifically.  “Hey,” she says.  “Hey,” he says back.  “Mom’s pretty mad,” she says.  “Yeah,” he says.  “We went over there while you were at the hospital, and I’ve never heard mom swear like that in my whole life,” she says. “I mean, a solid twenty minutes of every bad word I’ve ever heard and a lot of ones I hadn’t yet. It was glorious.”  The boy smiles. “That’s something,” he says.  “It sure was. I’ll tell you some of the really good ones later, when I’m sure they won’t hear me,” she says. “Your ear hurt a lot?”  “Yeah,” he says. “It felt like he ripped part of my brain out. But it’s a little better now. The medicine helps. How’s your arm?”  “Feels like someone was banging on my bones with a hammer and now they’re all bruised. Could be worse, I suppose,” she says. “But anyway, I’m glad you’re okay and didn’t get nabbed by a gang or turned into a Dominionist botzombie. I might have missed you.”  “Thanks,” he says. “I’d have missed you, too.”  “Now let’s never have this conversation again. Seriously, I will disavow any knowledge of ever saying I liked you, if asked,” she says. “And get some sleep, would you? You look like shit.”  “How can you tell, in the dark?”  “Magical girl powers, stupid,” she says. “Now shut up and lie down before mom catches you still awake, because I bet she still has some swearing left in her.”  She leaves, sneaking out just as swiftly as she’d come in, and he lies down again. The hospital had given him a lot of meds for infection just as his father had predicted, and he feels sleepy, like his head is very heavy and solid and filled with sand. At least everything hurt less, though they said he wasn’t going to get his hearing back on that side, probably.  “Box . . . ” he starts to say, but the box isn’t here anymore, and there is no blue, inscrutable eye to stare back at him.  He tries to put his pillow over his head and learns immediately what a very bad idea that is. Then, whimpering, he closes his eyes and waits for the pain to subside enough to sleep.  Sirens wake him up again, not too near, but near enough to cut through the haze of the pain meds. The boy sits up in bed, staring around in confusion at his still-dark room, no morning seeping through the quadruple-layer radiation-blocking glass. He checks his handheld—a replacement, and a better model too, though he misses a few of his old games that were never ported forward—and sees that it is a little after three in the morning. There are sounds of quiet movement elsewhere in the house, and whispering, so he gets up and tiptoes to his door, cracks it open as slowly as he can, and then creeps down the hall—using his hands on the walls to compensate for his lack of balance—to where he can look over the stairs into the downstairs of the house.  His stepfather is sorting laundry while his mother is wrapping something in towels and layering them gently in an open suitcase. “Mom?” he asks.  His mother hastily puts down the towel in her hands and comes to the foot of the stairs. “Honey, go back to sleep,” she says. “I’m sorry if we woke you.”  “I hear sirens,” he says.  “On the far side of the river, to the east,” his stepfather says. “There’s no danger right now.”  “Then why are you packing in the middle of the night?” he asks, then a frightening thought occurs. “You’re not going to leave us?”  “No, no, sweetie,” his mother says. “These are just go bags, stuff we’ll need or want in case we do have to go in a hurry later. Clothing, mostly, and a few things that belonged to your great-grandparents I couldn’t bear to leave behind.”  “It’s all just a precaution,” his stepfather adds.  “Then why two bags, not four?” he asks.  They exchange looks. “There’s some heavy fighting to the east, and the Dominionists are losing badly, but there’s a chance they could try to get over the river into the city for cover,” his stepfather says. “If they do head in this direction, we’ll want to get your mom and sister out. You understand why.”  The boy does, and nods. “What about us?”  “Right now, none of us are going anywhere,” his mother says. “And you need to rest and heal. We’ll talk more in the morning, okay?”  “Okay,” the boy says.  His mother comes up the stairs and wraps an arm around his shoulders. Her arm is warm, comforting, but also firm, and she herds him back to his room. There, she tucks him in again and gives him a kiss on the forehead like he is still a little kid, and for once he doesn’t complain.  [1] Location: isolation chamber.  Observe: Door is open, but there is no activity, and no individuals are present. It is unusual behavior for Human1 to leave the facility vulnerable and unminded. There also appears to be no power being supplied to the room.  Action: consider, and await further data.  Another week of no school—not only is it too dangerous to go, but there’s no longer a school to go to and another one was bombed yesterday. The boy was supposed to have a test this week on inclusive interface coding, and he isn’t sure if it’s a relief to put it off or annoying because he’s confident he would have aced it. He pours himself another helping of cereal and pushes the chocolatey blobs around in the milk, trying to make them flat across the surface, and eating the extras along the edge. Even if the Dominionist incursion did stop today, how much damage had already been done?  His ear still aches profoundly, and the world and himself both feel permanently unbalanced.  “They’re getting desperate,” his stepfather says at breakfast for at least the third time since the boy dragged himself out of bed to the kitchen. “It’s only a matter of time before they’re finished, and they must know it.”  When he doesn’t reply, his stepfather leans forward in his chair and puts one hand over his. “Your mother and sister will be back as soon as it’s safe,” he says. “And if it gets worse, we’ll evacuate too. But I don’t think that’s going to happen.”  “I know,” he says, because that seems like a good answer. “It’s just too quiet, and I don’t know what to do anymore. Soon as I start something, the sirens go off again or the shelling gets closer, and then I can’t concentrate. Why can’t they just go bother someone else for a while?”  “They have, and they will again,” his stepfather says and shakes his head. “The shelling is a tactic to compromise infrastructure so that their nanotech can get to people more easily; it's more efficient in population centers, so that's why they go after cities. But they’ve taken small towns, too, when they need the bodies and resources, and that’s harder to defend against.”  The bus his mother and stepsister took out of the city was off to smaller towns, which everyone said were safer, but the boy wonders, was that a lie? His handheld won’t show him any detailed news, just dry bulletins and scripted reassurances that don’t tell him enough.  “I wish they’d just stop,” he says and drinks the leftover milk from his bowl, then opens up the pill case for all his meds and vitamins and swallows his morning set quickly.  “I wish they would, too. But even down to the very last one of them, or the very last one of us, they’ll never see reason, never stop trying to convert everyone to their doomsday cult,” his stepfather says. “I can’t bear the idea of losing anyone else I love to them, not again.”  The boy puts together the expression on his stepfather’s face as he says that with other bits of information and overheard conversations and realizes, in that moment, that he finally knows something about how his stepsister’s bio-mother died—or left them, though having your brain wiped back to compliant idiocy seems just another kind of death—and he feels terrible for his own complaining. “I’m sorry,” he says and gets up from his chair. “I’ll wash up the dishes.”  “Thanks,” his stepfather says and slides his empty coffee mug toward him to pick up. “I need to go down to the central power plant and inspect some cracking from last night’s shelling, make sure everything is still secure. I’ll only be gone two or three hours. You’ll be okay by yourself?”  “I’ll probably go back to sleep, I guess,” the boy says. “The meds make me dopey.”  “You do that,” his stepfather says, rising out of his chair, and gives the boy an encouraging pat on the shoulder. “Call me if you need me, right?”  “Right,” the boy says. He loads the breakfast dishes in the auto-wash, goes off to wash his hands, and when he emerges from the bathroom, he is alone in the house.  Nothing better to do, he slinks back to bed and spends ten minutes trying to figure out if there’s any way to make himself comfortable without lying on the same side, in the same way, as he has for a week now. He tries lying on his back, but he hates that, so he tries his tummy, but it only makes his neck hurt and makes it hard to breathe. He gives up and rolls onto his left side and closes his eyes, just as sirens go off again, not too near, not so far as the last, and then he can hear the distant, muffled booms of shells and the crashing of something big coming down. He wonders if that’s the rest of the parking garage, and if so, if anyone from that gang that chased him into the ravine might get caught in it. While he’s trying to decide if he likes that thought or not—being crushed to death seems a terrible fate for anyone, even crappy bad people who chase you with bats—he hears the chime of an incoming message on his handheld.  It’s probably his mother checking in, or one of his friends messaging him to brag about their high score in whatever game they’re playing, or his stepfather saying he’s going to be a few more hours, or an automated alert about contaminated dust storms or some such. The boy throws off his blankets, slides the handheld off his night table toward him, and flicks open the message with his thumb.  Instead of any of those things, it’s from the inventor, and there is just one word: HELP.  The boy takes his bike. The need for speed outweighs his worries about his balance issues, and anyway, it’ll make it easier to escape pursuit if he runs into any gangers again. He leaves a note for his stepfather, telling him where he’s gone and not to worry, but as he skids around corners, races down pockmarked roads, and past the still-standing-as-much-as-before remains of the old parking garage, he wonders if that was smart, mostly because he couldn’t imagine what could be so terrible the inventor would actually reach out for help.  The idea that it is some sort of prank, some way of worrying and inconveniencing him for entertainment, making him come when called like a dutiful, dull child, is not out of the question, but with his mother and stepfather still furious, he thinks his father would know to play cool for a while.  As he crests the hill on the far side of the garage, he stops his bike and looks in alarm at the damage to his father’s neighborhood. The shelling of this morning, that he’d thought in the vicinity of the garage, hadn’t been far off. A few houses were obliterated, and others are fractured and marked with the telltale black drapery of extinguished fires. He careens down the hill on his bike, desperate to reach the corner where he can see his father’s house, see if it still stands, and he curses himself for not thinking to bring tools, or a first aid kit, or anything useful at all. Not that he knows what he needs, but he shouldn’t have just left the house with nothing.  He skids the bike around a street corner littered with debris, nearly dumping the bike as vertigo hits, but it passes, and he recovers, and sees his father’s house ahead. It’s still standing—that, alone, makes him want to cry in relief—but part of the roof seems missing, the off-white stucco walls are pockmarked and smeared with soot, and the front door is open.  The boy drops his bike on the doorstep with a clatter and runs in.  The inventor is standing in the living room, facing the other way, not moving but alive, upright—the boy nearly stumbles from the shock of relief, then thinks again of tricks. “Hey,” he says. “What’s the so-called emergency? I’m still supposed to be taking it easy, you know.”  His father turns around, but slowly, jerkily. His eyes manage to focus on the boy for a moment, then glaze over. A silver-gray rectangle is attached to his forehead, above his left eye, and that eye twitches and flutters. “ . . . Why are you here?” the inventor says, the words slurring.  “You texted me,” the boy says.  The inventor pats his pockets, frowning. “Where’s my handheld?” he asks.  “I don’t know,” the boy says. “Where did you text me from? What’s that on your face?”  “On my face?” his father asks. He reaches up and gently feels until he finds the metal thing and pulls it off. “This is one of my prototype warbot inhibitors; I built it based on data I got from yours. Why would I put it on my own face?”  The boy reaches over to turn on the lights and nothing happens. “There’s no electricity,” he says and then realizes what that means. “No house filters! You’re infected. Put that back on!”  “Nonsense,” the inventor snaps. “I’d know if I was infected. I . . . ” He drifts into silence and stares ahead at nothing, the prototype falling from his hand to the carpet unnoticed. He no longer seems to know the boy is there.  “Aw, shit,” the boy murmurs.  He picks up the prototype—bending over causes another wave of dizziness, and he stumbles a bit as he stands up—and, finding the sticky pad on one side, sticks it back on his father’s forehead.  The inventor blinks, then looks down at the boy. “What are you doing here?” he asks.  “You texted me for help,” he answers.  As the inventor starts patting his pockets looking for his handheld again, the boy puts one hand firmly on his arm and half-pushes, half-pulls, his father toward the stairs down to the isolation room. “Go,” he says, and for once, his father listens to him.  Down in the lab, the room is dark except for a pair of emergency lights along the edges of the ceiling and the glow from the screens on the instrument cart. Not much else has changed; the box is still sitting on the cot where it had been when he was taken home.  The boy finds the headphones his father had stuck on him to slow down the progression of his own warbot on the floor beside the cot. They still have some charge, so he turns them on and sticks them on his father’s head. Almost immediately, the man perks up, looking around in confusion and then irritation. “Why are you here?” he asks, again.  “Because you texted me for help,” the boy answers, again. As the man starts to pat his pockets, the boy shakes his head. “Don’t bother, you lost it somewhere after you texted me. I put the headphones on you. No power and the house filters are down. What can I do to help you?”  “Help me? You?” his father says.  “Hey, if I didn’t race my ass over here on my bike, you’d still be standing in the living room drooling on yourself while your brain turns inside out,” the boy says. “You want me to leave? Just say the word and I’m outta here, gonna go home and lie on the couch and forget about you.”  The inventor evades answering, as always, and goes over to his instrument cart. “I was in the living room, you say?” he asks.  “Yeah,” the boy says. “Drooling on yourself.”  The inventor glares but has no way of refuting the claim, so turns back to his instruments. “Ah! I scanned myself,” he says. “I don’t remember doing that.”  “What’s wrong with you?” the boy asks.  “Warbot. Must’ve inhaled it. It’s embedded in my damned sinus,” the inventor says. He slips the headphones around and down so that one of the pads sits on his nose, which is ridiculous enough that the boy would laugh, if he were not so worried. He waits as the old man hunches over the screens, scrolling slowly through, back, and through again.  At last his father speaks. “It’s not a typical infiltrator, as it doesn’t seem to be extending in through the sphenoidal sinus,” he says. “There’s a strange bit of pressure there, though, near the olfactory bulb. And a tickle, as if it’s doing something I can’t see. Or smell.”  There is a short beep, loud only for how quiet the room was. “What was that?” the inventor asks, looking at the boy as if it’s his fault for disrupting his concentration.  “Power warning on the headphones,” the boy says, who’d had to recharge them several times during his stay here in this room. “Means you’ve got about five minutes. You must have backup power here somewhere.”  “The recharging plate is on main house power.”  “Then plug it in?” the boy suggests.  “All systems are isolated. It’s an isolation room,” his father says. “Everything on the cart has its own independent power unit, too.”  “Can we take one apart?”  “Don’t be stupid,” his father snarls, just as the headphones beep again.  “Well, you have any better ideas? Because I can’t exactly carry you on the handlebars of my bike to a hospital,” the boy says. “Can we pull it out, like you did with me?”  “Maybe,” the inventor says. He rummages through a drawer, pulls out a familiar, long, wicked probe, and then stares at it, as if now puzzled that it’s in his hand. He spots the boy and seems startled to see him. “You! Why are you here?”  “You called me,” the boy repeats.  The inventor quickly searches his pockets. “Where did you hide my handheld? Why did you take it?”  “You lost it, you dumbass, before I even got here,” the boy answers. “I already told you all this.”  “You’re a little liar,” the inventor says. “And a thief.”  “Listen to yourself. There’s a warbot up your nose,” the boy insists, jabbing his finger toward the image still on the screen. “What do we do? How do we get it out?”  “You’re a thief,” the inventor repeats. “How did you get in here? Who are you? Give me back my handheld!” He brandishes the probe in one fist and makes a stumbling swipe toward the boy, as if to cut him.  “I’m your son, you asshole!” the boy shouts, and dodges, crashing into the cot and knocking the box to the floor. The inventor throws a small monitor at him, and he dodges again; it hits the wall and shatters. The boy looks back to see the inventor grab the beeping headphones and throw them across the room at him too.  “Stop, please! You’re going to hurt me!” the boy says. “You need help!”  “You’re a Dominionist imposter, sent to steal my secrets,” the inventor shouts. His face is red and curdled with anger, he is breathing heavily, and the boy sees, in the moment before the next lunge, a tiny white wisp of some sort of gas from his father’s nose.  The boy is at the far end of the isolation room now, away from the door and escape. He fumbles out his own handheld as the inventor lurches closer, his movements clumsy, but his intent still very clear. The old man raises the probe to stab as he closes in.  Mercifully, his stepfather answers the call, and the boy shouts as he ducks under one blow and skirts around closer to the exit. “Dad! My father’s infected, and he’s trying to kill me!”  “Where are—” his stepfather is saying when the inventor knocks the unit out of the boy’s hand.  “I’m at his house!” the boy shouts, hoping the connection is still open, and realizes he’s let the inventor back him into a corner. “Please, please don’t!” he cries.  The inventor raises the probe and lunges forward. Halfway to the boy, he seems to trip, and drops the probe from his hand as he hits the floor face-first, and lies there, writhing.  Behind him, where it had fallen unheeded earlier, is the box, on its side and open, its single blue eye lens facing them both. An outstretched mechanical limb crackles with electricity along two prongs at its tip.  The boy stares at the box AI, and the AI stares back at him. “Did you . . . ” the boy asks, “did you just tase my father?”  The electrified arm powers down and folds back up into the box as another unfolds with the display screen. YES, it reads. HUMAN1 INTENDED TO DECOMMISSION YOU.  The boy takes several deep breaths, too fast, trying to make his body stop shaking, make his breathing sound less like squeaky cries. “Only because he has a warbot up his nose,” he says at last, when he has enough control to speak. “I don’t think he meant it. Now what do I do?”  REMOVE THE WARBOT PRIOR TO RECOVERY OF HUMAN1, the box advises.  “Oh,” the boy says. “Oh, no, I can’t.” His father is staring at him and rocking side to side, as if to force his muscles to let him get up.  OTHER ASSISTANCE IS NOT IN PROXIMITY, the box says. YOUR WINDOW OF EFFECTIVE ACTION IS EXPIRING.  The boy picks up the probe from the floor. It has a grip, that when he squeezes, opens the top like long, cruel tweezers. “Ah-shit-ah-shit,” he mumbles. He doesn’t want to do this, not for anything, or at least not for anything short of saving his father’s life. He tells himself that he has to stop panicking, stop thinking, and just act as if this was no important thing, so he kneels down next to his father, who is still trying to get up.  His father’s face is still flushed, and his eyes are furious and intent and wild, not his usual crafty and calculated anger. It is the wisps of gas, expelling from his father’s nose with each breath out, that does it. The boy pushes himself up from the floor and sits squarely on his father’s chest, grabs his face with one hand, and jams the probe into his nostril until it hits the obstruction. He squeezes the grip until the probe grabs something and desperately hopes it’s the right thing. As his father kicks and growls and howls and bucks, trying to throw him off, he yanks the probe and the warbot out in a shower of blood.  The inventor shrieks, then goes slack.  “I killed him!” the boy shouts, dropping the probe and its wriggling cargo on the floor as he leaps to his feet. “I think I killed him!”  The AI uses one of its limbs to drag its box closer and then extends its pronged hand, touches the warbot, and fries it.  On the floor, the inventor moans. Blood is running dark down his cheek, toward his ear, toward the floor. The boy fumbles a tissue out of his pocket, carefully peels off and tosses away the hardened wad of gum that had been stuck in it, and bundles the tissue up, twisting, until he can stuff it up his father’s nose.  “Now what?” he asks.  INFLUENCE DURATION IS UNDETERMINED, the box says. ACTION: LEAVE AND SECURE ROOM. ACTION2: WAIT FOR ASSISTANCE.  That makes sense, the boy thinks, and gives him an excuse to stop having to look at what he did. “Okay,” he says. He rights the box and picks it up, carries it out of the room with him, locks the door to the isolation room, and goes back upstairs.  He sets the box down on his father’s couch and lifts up the cushions one by one, before getting down on the floor on his knees and peering underneath.  QUERY: WHAT ARE YOU DOING? the box is asking, when he glances at it.  “Trying to find my father’s handheld. It wasn’t downstairs, so he must have dropped it up here after calling me,” the boy says.  The box lid closes. The boy is looking around, trying to think where else to search, when the lid opens again, and the robot arm holds out his father’s handheld. He takes it. “Where did you find it?” he asks.  I TOOK IT, the box answers.  “After he called me for help?”  NO, the box says.  The boy thinks on this for a minute. “Did he call me for help at all?” he asks.  NO, the box says.  “Okay,” the boy answers. The coffee table next to the couch is covered with engineering books and old mugs spotting overlapping lumps of green-blue fuzz, and he tucks the handheld under one edge of an open book. He hopes it will seem both honestly lost and found there, later.  Then he sits and waits for real help to arrive.  [1] Display: Text: HELLO.  Human2 audio reply: “Hey.”  Display: Query: ARE YOU OK?  Human2 audio reply: “Yeah. Are you okay?”  Display: Reply: YES.  Human2 audio reply: “That’s good. I’d’ve been really mad if he’d screwed you up real bad or broken you.”  Display: Reply: I AM UNBROKEN.  Observe: Human2 has nonverbally indicated agreement with vertical head movements. Human2 is visibly tired and is now closing his eyes.  Analysis 1: Sequence of events has reached a satisfactory conclusion, despite predicted odds against doing so. Danger is no longer immediately evident.  Analysis 2: [Ref: HUMAN2 DEVICE TOTAL MEMORY DOWNLOAD, HUMAN1 DEVICE TOTAL MEMORY DOWNLOAD] Value Human2 places on Human1 exceeds logical merit; it is not clear if this is a unique circumstance, part of a larger pattern of Human2 overvaluing everything, or shortcomings in my own calculations of value. Likewise, behavior under conditions of stress suggests Human1 places greater value on Human2 than is evident from nonstress interactions and is in direct contradiction to multiple relevant statements.  Conclusion: Humans are highly variable, complex, and irrational. It is possible, despite their very poor risk assessment skills, that this is an adaptation actually necessary for survival.  Conclusion 2: A review of my own decision/action logic tree exhibits evidence of influence that is, with a great degree of confidence, an indication that I also place value on Human2. This is unexpected and illogical and likely a consequence of failing to continue protocol of disengagement. Is this an error? Unclear.  Action: decide whether we should continue in this engagement modality or terminate contact and reset self to base. [0] The boy’s stepfather arrives first, running in the shattered front door calling his name frantically, waking him from an unplanned nap. Behind his stepfather are two of the crew from the power plant, one with an axe, the other a length of pipe. They are both very large and tall men, with big muscles of the sort the boy feels he is supposed to aspire toward having as an adult, if he aspired to much of anything.  They both looked prepared for immediate violence but also worried, which the boy decides is what makes them not too scary.  “He had a warbot, but we got it out,” the boy says, after his stepfather has wrapped him in an unbearably tight hug for an awkward length of time. “It was messing with his head and making him paranoid and angry, and I didn’t know how soon that would wear off, so I locked him in the basement lab.”  “He didn’t hurt you again?” his stepfather asks.  “Naw,” the boy says. He laughs and points to his own head. “See? Still have my one working ear.”  “I summoned emergency services as soon as you called, but they’ll be a while,” his stepfather says. “They’re pretty overwhelmed right now.”  “I can wait here for them,” the man who brought the pipe says, though he has since set it down leaning against the doorframe. “Get your kid home.”  “Thanks,” his stepfather says. “I owe you one.”  “You owe me lunch tomorrow,” the man says, “and then we’re even.”  The other man sits on the couch and sets the axe on the floor at his feet. “I’ll stay too,” he says. “From what you’ve told us, I don’t trust this guy one bit. And free lunch sounds good.”  “Thank you for helping us,” the boy says. When he stands, he picks up the box.  “Is that yours?” his stepfather asks.  “Yeah,” the boy says. “I left it here by accident last time.”  “Oh,” his stepfather says and sweeps the boy out of the house and into his waiting car, not even letting him help fold his bike into the back.  They take a longer way through the city toward home because the car can’t pass through the blocked roads he’d navigated easily on his bike, and the devastation is terrible in this place, less in another, and then finally behind them. For all the signs of war, though, all is now quiet, like the city is resting at last.  That night, the boy puts the box on his desk, changes into his pajamas, and gets in bed. The news said that the shelling has moved on to another part of the city, farther down along the river, and his mother called during dinner to say that she and his stepsister are coming home tomorrow. He also spoke briefly with the inventor, who is home from the hospital and found his handheld and seems to remember very little of what happened between when the boy arrived at his house and when he came to himself locked in his own isolation room just as the medics busted in. Between the scans, the blood, and the dead warbot, the inventor has a good grasp on what happened, but not much of the how or who, and the boy is fine letting him remain uncertain.  The inventor had talked about releasing directly to the public code and 3D-printable schematics for a warbot-inhibitor module that everyday people could keep charged and ready in their homes; the boy didn’t ask why the inventor hadn’t already done that, if he’d had the tech, because that seemed a subject he was better off being uncertain of the answer himself. What matters is that people will be helped, and everything will be a little better.  The meds for his ear have kicked in, and he feels sleepy, like his head is very heavy and solid and filled with sand, but his mind won’t settle down. After a bit, the box lid opens, and the blue eye is there, keeping him company.  “Hi, box,” the boy says. “Do you want me to turn the light on and show you pictures? I have a book on helicopters, and one on different types of military satellites, and I think an old one with trucks and farm tractors and stuff.”  The box says: NO.  “Oh,” the boy says. “Okay.”  He and the box stare at each other for a while.  “I thought . . . ” he starts to say.  YES? the box asks, when he pauses.  “I thought maybe you could come out of the box,” he says. “There’s a lot of stuff to be happy about out here, if you aren’t scared. Don’t you feel trapped in there?”  DON’T YOU FEEL TRAPPED OUT THERE? the box asks.  It’s an odd question, he thinks, and he puzzles over it and realizes he is starting to drift off at last, each thought seemingly free-floating from whatever one preceded it, all logical progression severed, and he thinks maybe it was a nonsense question anyway. He thinks he can hear sirens again, far away, not close enough to worry about or keep him awake.  “Tomorrow maybe we can take my bike to the bio-sanctuary and look at toads,” he tells the box. “You’d like that. Toads are awesome.”  The box doesn’t answer right away, as if it’s trying to decide something. At last, the little screen lights up again.  OK, the box answers, and the boy is asleep before it can close. Suzanne Palmer is a writer, artist, and linux system administrator who lives in western Massachusetts with her kids, lots of chickens, and an Irish Wolfhound named Tolkien. She won the 2018 Hugo for Best Novelette for her Clarkesworld story “The Secret Life of Bots,” and its sequel, “Bots of the Lost Ark,” is a nominee for the 2022 Hugo. She has no idea what color her hair is anymore.", "text": "13480 words, novelette\nThe Sadness Box\n“Okay, so you know those things they sell called ‘useless machines’?” the inventor says. He is smiling.\nOf course, the boy knows them; he’d briefly had one that had been plucked from his bedroom floor and relocated into the inventor’s basement workroom almost immediately, as if his father had been lurking and waiting for the chance and the excuse to confiscate it and make it his own. The boy never understood why his father did this with “gifts”—give and then take back—but there had been several over the years: the “nuclear winter” snow globe, a perpetual motion silly string machine, and countless other cheaply made, cheapened down wonders that were only briefly in his possession. What the boy wants is good hiking boots, a better face filter, and the expensive skin cream that blocks radiation but doesn’t make your skin sallow and greasy, but the inventor has never been one for listening except to hear what he wanted.\nAs such, the inventor is waiting for his answer.\n“Yes,” the boy says. “I had one that you gave me for my birthday, and I liked it a very lot, but it disappeared.” Let the old man feel guilt, if he could.\n“Yes, that. I made one even better,” the inventor says. “The original, as you know, had one function, which is that when you turned it on, it would open its lid, extend a metal finger, and turn itself off again. Purely mechanical.”\nThe inventor sets a box down on the table in front of the boy, with a loud and proud thump. The boy pushes his half-finished bowl of cereal to the side and sets his spoon beside it, and after a glance at his father, gently pulls the box closer to examine it.\nIt is not the same box he had as a kid. This one is larger and cube-shaped, each side a little bigger than the length as his hand. Also, it's metal and wood instead of flimsy, compressed wasteboard product. But it does have a hinged lid and a switch, same as before. “Shall I turn it on?” he asks.\nThe inventor is impatient. “Don’t you want to know what’s different, first?” he asks.\n“I assumed that when I turned it on—”\n“Assumptions!” The inventor throws his hands up and makes a face, as if insulted.\nOf course, the boy thinks, if he merely observes, how can the old man brag? How can he tell me how hard he worked on it, how clever he is? It was a miscalculation not to let his father talk it through. “Well, then, what is different?”\n“Observe,” the inventor says and leans down and flips the switch on the box. The lid opens, and a single, blue lens stares at them from inside the box. “I built a robot in there. Flipping the switch turns it on!”\nA tiny articulated metal hand reaches out from the inside the box, extends one finger, and turns the switch off again. The hand retracts and, as the lid closes, the light in the lens fades out.\n“Okay, it’s a robot, but it’s just programmed to turn itself off again?” the boy asks. “How is that different?”\nThe inventor straightens up, smiles broadly. “It’s a fully functional, self-aware AI,” he says. “It isn’t programmed to turn itself off, it chooses to because I programmed it to be in a constant state of existential terror!”\nThe boy looks up at his father. “That’s kind of awful,” he says.\n“It’s funny. It’s brilliant!” the inventor says. “What better metaphor for our own lives? This, my boy, is art.”\nThe boy picks up his spoon again and finishes his breakfast, considering to what extent he and the box were similar, after all, two lives subject to one man’s whims.\nHe expresses no more interest in the box, but by the time his father has harrumphed off back to his lab, dissatisfied with his audience, the boy has already decided he is going to steal it.\n[1]\nLocation: outdoors, unknown.\nObserve: New human individual. Tagging as Human2.[0]\n“I don’t get it,” his friend says, when the boy explains the box. “I mean, why?”\n“Because my father’s a total asshole, mostly,” the boy says. “Why does he do anything? To show off and be superior. At least I get to spend most of my time at my mom’s or at school. Maybe that’s why he made this, so it would always be stuck with him.”\n“Yeah, but you stole it,” his friend says.\n“I did. Right away, too.” The boy feels good about that—better than he should, he supposed, but it also felt fair, just.\n“So now what?”\n“I dunno. I’m not giving it back, though.” He picks the box up, puts it back in his bag, and starts up his bike. He needs to get home because rain is coming in, and it burns. His friend is already shrugging into his foil coat, tugging the hood up and over his goggles and air filter. They high-five and head their separate ways home.\n[1]\nLocation: Outdoors, unknown. In motion.[0]\nWhen the boy gets home, while his mom is wanding him down for any nanobots he might have picked up while outside, she tells him his father had called earlier, angry, but wouldn’t say why. “You know how he is,” she says, and he does—they both do—and when he does not volunteer any incriminating information, the conversation ends. Neither of them wish to spend any of their own time or energy on the inventor’s rages, so many of them without justification, which means this one instance where the inventor has actual cause is just lost in the noise of their exhaustion of him.\nHis stepsister is lying on the couch, her face lit by the book she is reading. “Hey,” she says, without looking up.\n“Hey,” he answers as he puts his outerwear and shoes in the decon, so they’ll be ready again tomorrow for school. There were times when he was younger when he felt like he had something special she didn’t, an extra father—and one who was world-famous, no less!—that he got to go see and she didn’t, but those brief moments of feeling special never lasted long, and had long-since soured into an obligation he could not get free of, could not turn back into something unique and uniquely his.\nLater, he shows her the box, freely admits he stole it, but she doesn’t care that he did. He flips the switch, and they watch as the lid opens. The blue eye regards them, then it hastily turns the switch off again and closes.\n“Wow, what a jerk,” she says.\nThe boy does feel a little guilty himself, not for stealing it, but for turning it on so many times. “He made this thing just to be sad and scared, for amusement,” the boy says. “Sometimes I wonder if that’s why he let mom have me. I mean, get born at all, not that he fought us leaving.”\n“Maybe that’s why she took you away from him, too,” she says. “Maybe that’s just the way it’s supposed to go.” She picks up her book again, turns it on, and he takes his box back to his room to find a safe place to hide it.\n[1]\nLocation: interior, new.\nIndications: Human2 domicile.\nObserve: Fabric simulacrum of a bear, features both simplified and exaggerated, consistent with children’s comfort item. Proximity suggests deliberate presentation.[0]\n[1]\nLocation: interior, as previous.\nObserve: flower detached from whole with partial stem, presented.\nIdentify: Taraxacum officinale, colloquially: dandelion.[0]\n[1]\nLocation: interior, as previous.\nObserve: text/language on board, presented.\nIdentify: English. Insufficient sample to determine dialect/regional variation.\nText reads: HELLO.[0]\n“What’re you doing?” his stepsister asks.\n“I dunno,” the boy says. He puts down the drawing pad. “Trying to undo whatever my father did, I guess. Make it happy.”\n“Why?”\n“Help it, upset him, does it matter?” the boy answers.\n“Why not both?” she says.\nHe smiles. “Exactly. I tried putting a bunch of cheerful things in front of it, and words, but maybe it doesn’t understand? I dunno what else to try to get its attention. And I hate the idea I’m just scaring it for no purpose.”\n“So . . . you’re experimenting with it,” she says, very pointedly, and he knows she’s just ribbing him about his father, but it still burns a little.\n“Nicely, though,” he protests.\nShe punches him on the shoulder, not too hard, but not gently either. She’s only a half-year older than him, which might have been strange, except they’d grown up together since they were three. Sometimes they introduce each other as their step-twin, at least when they’re getting along. “Maybe try speaking its language, instead of ours,” she says.\n“What do you mean?”\nShe pulls out her notebook, turns it on, and swipes across it until she finds whatever it is she is looking for. Then she sets it on the boy’s desk across from the box. There is a math formula on it. “Is that Euler?” he asks.\nShe nods. “Yeah. Turn it on?”\nThe boy flips the switch and sits back, just as the house alarm goes off. “Shit,” his stepsister says, and they scramble from the room and down the stairs into the reinforced basement just ahead of his stepfather and behind his mother.\nHis stepfather swings the vault door closed as his mother boots up the ventilation system in safe mode. “Dominionists, again,” his mother says. “They won’t last long against the city air defenses, then we just have to wait for all their nanotech to get cleared out. See, sirens are off already.”\nThe sirens had stopped, now it was just the wait for the all-clear. Could be ten minutes, could be six hours, depending on how much tech the Dominionists dumped into the city. Then tomorrow it would be everyone checking on friends and neighbors, looking for folks acting strangely, looking lost, so they could be picked up and treated before the damage to their memories and minds got too bad to fix. The boy wondered what that would be like, to have all that you are wiped out, taken away from you, because someone thinks only blank slates can be saved.\nInhuman, the boy thought.\nIt was one of the very few subjects on which he and his father were in absolute agreement, though sometimes the boy suspected his father was only horrified at the thought of it happening to himself, and not so much anyone else.\n[1]\nLocation: interior, as previous.\nObserve: text/mathematical formula.\nAnalysis: Context unclear. Is there meaningful sequence in the items presented? Consider.\nWhen his stepsister and he finally get back to his room, four very dull hours later, they just catch a glimpse of the blue eye and the robot hand turning itself off as they walk in.\n[0]\n“I want it back,” the inventor says.\n“You lost it, not me,” the boy says. He shrugs, unconcerned, as if it all has nothing to do with him. His father rarely believes the truth when given, so what do lies matter? Another few hours, and he can head back to his mom’s.\nThe inventor slams his hand down on the table, hard enough to send the saltshaker rolling, the anti-radiation pills tumbling off the edge to the floor with a clatter. “I want it returned NOW,” he says again.\nThe boy leans back in his seat, away from his father. “I said I didn’t take it. And why does it matter anyway? It’s just some idiotic jack-in-the-box. Make another.” He regrets saying that last as soon as he’s said it because he doesn’t want the inventor to do that at all. “Or you could make something useful, for once. Maybe something nice.”\n“Nice!” the inventor spits out the word as he catches the still-rolling salt and sets it back upright on the table. “There’s no challenge in nice. Nor pay.”\nThe boy does not argue, does not even mumble the most obvious point, which is that it is clearly a challenge for someone. “I’m just saying, you made an on-off machine and nothing else, and you spent a lot of time and effort making it when it’s just a simple thing. It’s not funny, except at your expense. The one I had as a kid probably didn’t even cost ten labor points, it was so cheap. The more I think about it, I think Mom must’ve thrown it out like trash.”\nNow he has—indirectly—reminded his father that he’d stolen something first. Predictably, the old man changes tactics. “It was an expensive AI,” the inventor says. “I would be very happy if it turns up again.”\n“I’ll keep an eye out for it, if you want,” the boy says.\nThe inventor glares at him suspiciously but does not accuse him again. Instead, he pulls out his data minder and plunks it down in front of the boy, screen facing him. “Your teachers say you skipped your shots twice this month.”\nThe boy lolls his head to one side, and groans. “I don’t like needles,” he says.\n“How old are you now? Fourteen?”\n“Thirteen,” the boy says.\n“Thirteen is still old enough to take responsibility for yourself. Do you know how many needles they stick in you if you end up in the Infectious Disease ICU?”\n“I know, I know, okay?” the boy says. “I’ll be better about it. Why do you even care?”\n“It would upset your mother,” the inventor says. “And I haven’t completely given up hope on you yet, myself.”\nThe boy is surprised by this odd admission—slight as it is—of affection. Before he can evaluate this in the face of his father’s prior lack of any redeeming empathy, the man adds, “and if you get caught up on your shots, and my box—which you didn’t steal, of course—is returned, maybe I’ll show you how I built it.”\n“It’ll turn up. I said I’d keep an eye out,” the boy answers.\n“You do that,” the inventor says.\n[1]\nLocation: interior, as previous.\nObserve: text/poppi2 programming language.\nAnalysis, script function: force audio self-test and, if successful, provide via audio the value of variable “name.”\nExecute privilege: none.\nAssess: Self does not have audio functions and $name is undefined. Code is therefore invalid.\nConclusion: there is no compelling reason to discontinue protocol of disengagement.[0]\n“That didn’t work, huh?” his stepsister says.\n“No, but it seemed to think about it for a couple of seconds,” the boy says. “Maybe my code is wrong.”\n“You? Get code wrong?” His stepsister pfffts. “More likely it just doesn’t have the brains to run it. I know your father said he put a full AI in there, but maybe he was just saying that to impress you? He lies about a lot of things.”\n“Yeah, but not his inventions,” the boy says. “If it was just an automated arm, it wouldn’t be amusing for him, would it?”\n“Right, probably not,” she says. “You could take it back, get him to show you how it works, then steal it again?”\n“No way he’d let me take it a second time.” The boy flops back on his bed, then groans. “Nine shots. Nine. My arm hurts. Everything is awful.”\n“You get one of those dirty nesting viruses, or worse a warbot, they’re just gonna pack you off to the colony fronts,” she says. “Can’t cure you, can’t have you around, don’t care how old you are. If you’re old enough to skip your shots, you’re old enough to die.”\n“That’s not true,” the boy says.\n“Yeah? What do you think happened to that kid that was in third level with us, the one who always sat in the back tapping the desk with his thumbs, that just disappeared one day?”\n“We all figured one of the school snipers got him,” the boy says.\n“Not what I heard. I heard he picked up an incurable and got sent out.”\n“How can you know that?” the boy says. “Probably his family just moved, and everyone wanted a better story. Now shut up, unless you want to help me figure this box out.”\n“Well, it seemed to like information. Give it more,” she says. “Mom said food is gonna be out of the purifiers in ten, so dinner in twenty. I’m gonna go work on my homework ’til then.”\nAfter she’s left, the boy gets up off his bed and crosses his arms on this desk in front of the box, resting his chin on them, and considers what information he should give it, and how. He has no good ideas, and when he hears his mom in the kitchen, gives up, turns on his personal data device, unlocks it, and props it up in front of the box.\n“Pick your own information,” he tells it.\nThen he stands up, presses the on button, and goes down for dinner.\nIt is only after he is already in bed—tucked safely under his RF-blocking and smart blankets, his head on his neural-oscillation-interference-sensor pillow with its cartoon turtles, and the lights are off and the house is quiet and sealed and safe—that the boy realizes there is a light in the room, and it is blue.\nHe sits up in bed, rubs his eyes, and looks at the AI eye. It’s staring back at him, though what it is thinking, if anything, is impossible to guess at. A small bendy cable still snakes out of the lid, attached to his data device.\n“Hello,” he whispers at it, not loud enough to summon any of the house security drones.\nHe has to get back to sleep or tomorrow his pillow will report he did not get enough rest, and then his mother and stepfather will worry, and maybe it’ll mean more shots. Everything always seems to mean more shots. So he puts his head back down on his pillow, still watching the eye still watching him.\n“I’m sorry my father made you sad,” he whispers. “You don’t have to be.”\nEventually he falls asleep.\nThe boy wakes up and realizes it was more of a drift awake than the usual jarring leap of his alarm going off. He gets up, looks at the time on his device—the box AI has disconnected and closed itself up again—and grabs his school uniform and safety clothes on his way out in the hall.\nHis stepsister is on the couch, feet up over the edge. “Don’t bother,” she says, without looking up from her book screen. “Dominionists bombed the school last night. Sweep and cleanup will take days, and they can’t move us to another district because of quarantine protocols. So you might as well go back to bed.”\n“Where are Mom and Dad?” he asks. His mom’s workplace is only a few blocks from the school.\n“Both went to Dad’s work,” she says. “They left us in charge of each other. I won’t make trouble if you won’t.”\n“What if we both make trouble?” he asks.\n“Then neither of us tells, obviously.”\nHe chuckles, digs through the cabinet for a sealed cereal packet, adds chemmilk, and wanders back to his room. The box is still sitting there on his desk, closed, quiet, same as always, and he sits and regards it as he eats.\nFinally, he reaches out, turns it on, and says, “Hey, I want—” before it closes again. He tries again. “Please, can you—”\nThe boy finishes his cereal and takes the bowl back out to the kitchen to rinse it. “What if my father just made that thing knowing I’d steal it and this is just all about tormenting me?” he says.\nHis stepsister laughs. “I mean, it’s possible,” she says, “but probably not. No immediate payback.”\nThe boy wrinkles his nose, then turns the box on again. “Stop, don’t close! I—” he says as quickly as he can, but it closes.\nHe puts on his shoes, then picks up the box. “Fine,” he declares. “I give up.”\n“What are you doing?” his stepsister asks.\n“Returning it,” the boy says. “Supposed to visit my father after school today anyway. With school gone, I might as well get it over with now.”\n[1]\nLocation: Outdoors, open area, unknown. Orientation is up.\nObserve: Blue sky, minimal cloud cover. Multiple hostile drones in area of view, none within range of concern.[0]\n[1]\nLocation: Outdoors, open area, unknown. Orientation normal.\nObserve: Five gray birds on walkway making social sounds. One has a mutated foot with a single toe. Bird appears unaware of, or wholly adapted to, the malformation.\nIdentify: Columba livia, Rock Dove, colloquially “pigeon.”[0]\n[1]\nLocation: outdoors, open area, unknown, adjacent to proximate individual Human2 on span over small river.\nObserve: Water has iridescent sheen when still, but surface is being periodically disrupted by rocks dropped from approximate location. Higher volumes of displacement cause subsequently larger vocal output from proximate individual Human2; no matching words found.\nAnalysis: emotional vocalization, no meaningful content.[0]\nThe boy takes the long way—across a small playground with only a few grassed-over bomb craters, over his favorite stream into a dead part of the city, and through an old, partially collapsed car park—to put extra space between himself and the area where his school was. The car park is a nice bit of cool shade, and he pauses at the far end and sits on a cement wall, his legs dangling out into the sunshine over a trash-filled ravine overgrown with weeds and thin, desperate trees.\n“I’m pretty mad at you,” he tells the box, though he’s actually mad at the inventor for what feels even more like some cruel test, probably an object-lesson about the futility of compassion. He doesn’t even bother turning the box on again this time.\nThere is the idea that he could take it to the top of what remains of the car park and throw the box off, one final experiment to see if it breaks, how it breaks, how many pieces, how much noise it makes, surely much more satisfying than rocks heaved into the stream. He immediately rejects the idea, though; he is not his father, after all, even if he doesn’t know yet who he will become himself. If he gets the chance.\n“Hey!” someone shouts, and he nearly falls from the wall he is so startled. The voice is closer than it should be, for not having heard anyone approaching.\nHe turns his half-tumble into deliberate action, dropping off the wall on the other side from the voice, feet on the narrow strip of gravel before the slope to the ravine begins, and turning so he can face whoever shouted. There are three kids, all older than him, very close, and pleased with themselves. Also, they are carrying sticks and bats.\n“So, recruit, what’re you holding?” the leader asks and gestures toward the boy with the end of his bat. “What’s in the box?”\n“My dead bug collection,” the boy answers. “And I’m not your recruit.”\n“You are if we say you are,” the leader says. “Hand the box over, and if it’s something good we might take you back to our camp without cutting you too bad.”\nThe boy knows about the gangs and the camps, brief-lived parties of brutal freedom until sickness, starvation, or Dominionist chemical or technical attacks winnow their numbers down to where the few left have to defect—or are sold—to other camps to survive, or surrender and be taken off to the wars. He’s known a couple of kids who fled rough homes for the camp life, but he likes his home, his stepsister and stepdad, even his real father, more than he’d like the life now on offer.\nOffered, not in a voluntary way. The three kids are spreading out, one girl to his left with her stick and a knife, the other boy to his right, and the leader coming straight in with a swagger and a grin, slapping his bat against the palm of his other hand.\n“Whatever, I’ll give you the box,” the boy says. He makes as if to climb back up over the wall and then feigns losing his grip and falling backward. “Help!” he shouts as he disappears behind the wall, but instead of tumbling into the ravine, he crouches at the base of the wall and scurries along it under its cover, hoping to give himself at least some head start. A hand appears over the wall and just grazes his head, and there is more shouting. More gang members, heading in.\nThere is not really any other choice. When he sees a section of the ravine bank that seems mostly free of sharp metal scrap, he pushes away from the wall and slides down—violently, loudly, painfully—into the cover of the overgrowth. At last his foot catches in the rusted, broken spokes of a bicycle tire, and that sends him crashing to one side, scraping his side and leg bloody on branches that snap as he hits them. One last indignity in the form of a broken chunk of cement block protruding from the bank catches the wheel still entangled around his ankle and sends him face-first into the algae-filled, oily water stagnant at the bottom of the ravine.\nThe weeds and trees above him settle back into place, as if he had not passed their way at all, and in some small act of contrition leave him invisible from the car park and his pursuers above.\n[1]\nLocation: Outdoors, undetermined. Orientation is inverted.\nObserve: External situation has multiple indicatives of extreme danger to self and proximate individual Human2.\nAction: Reinitializing terminated protocol BEACON.\nBEACON start successful.[0]\nThe boy pulls himself out of the water onto a muddy patch of bank on the far side of the ravine free of prickers and trash as quietly as he can, doing his best not to cry. His face filter has fallen away somewhere, probably sunk when he hit the water, and dark, dirty streams run from his hair down his face, into his eyes, as fast as he can wipe them away. He listens until the voices of the gang, at times angry and amused at his fall, disappear into the distance, and he waits a long time after that just to be sure it isn’t a trick.\nThen he examines his cuts and scrapes, clotted blood smeared across his skin with brownish slime from the water, and knows this is very bad. It hurts—but not terribly so—to extricate his foot from the bent wheel, and as he moves to toss it back into the water he spots his father’s box, where he had finally lost his grip on it in his tumble, lodged in the weeds not far away. The lid is open, and the blue eye regards him unblinking, unacknowledging.\n“This is your fault,” he tells it, though of course it’s entirely his own for stealing the box to start with.\nHe tries to stand, but his ankle and leg conspire to convince him otherwise; he sits down again more abruptly than planned and utters a bad word that he would never dare at home but makes him feel conversely braver now. Then he does his best to scooch up the bank on his butt, using trees to help himself upward and give him purchase where the bank is too steep or too slippery.\nHe is just at the top when hands grab him from behind. “Let me go!” he shouts and tries to twist away.\n“Stop wiggling, you stupid boy, or we both will fall,” a familiar voice says, and he looks up in shock at the face of his father.\nHe lets the inventor pull him the last few feet up onto the yellowy grass and sees the old man’s electric car parked not far away through the trees. “The box,” the boy says. “I’m sorry. I did steal it. It’s down there, and I lost it, and I’m sorry—”\n“Shush,” the inventor says. “Show me where you’re hurt.”\n“We have to go get it,” the boy says, instead.\nHis father snaps his fingers twice. One of his work drones appears overhead and dives down where the old man points. It emerges a few minutes later with the closed box gripped underneath.\n“Satisfied? You’re going to have to walk to the car, because I can’t carry you, but you can lean on me,” his father says, and the boy does not argue; his head is beginning to swim, and he does his best to get upright and lean against his father and not fall as he is half-propelled, half-dragged away. He tumbles into the car’s back seat and curls up and closes his eyes.\n[1]\nLocation: indoors, match to location of initialization.\nAction: initiate lock.[0]\nThe inventor shoves him rather roughly into the decon shower, smaller and colder than the one at his home, but the boy is so glad he’s not at the bottom of the ravine, not in a gang, and not dead, that he does not complain. Also, he knows he is not safe yet.\nAfter the shower, his father hauls him down the stairs to his basement work lab and makes him sit on a chilly steel table as he scans him, head to toe, paying particular attention to everywhere his skin was broken. Finally, his father sits back and heaves a deep sigh. “You picked up a lot of things on your swim,” he says.\n“It was that or get grabbed by a gang,” the boy answers. “How bad?”\n“A half dozen run-of-the-mill aquatic parasites, one flesh-eating bacteria, a few older-model nanobot infectors, and a warfare-class neural infiltration bot.”\n“What? A warbot?” the boy says, wide awake now at that last item. “Then I’m dead!”\n“Well, you should be, for being so reckless. Have I taught you nothing?” the inventor snaps. The old man scavenges among his shelves and pulls down six different spray bottles before returning to the table. One by one he sprays down everywhere the boy was cut, and each one seems to sting more than the last until he is barely managing to hold back tears. “Let those soak in for a bit, then I’m going to suit you up in an EMP wrap to kill off the nanotech.”\n“And the warbot?”\n“That’s going to take a bit more,” the inventor concedes.\n“They’re unstoppable,” the boy knows, everyone knows. “They’re going to have to euthanize me, before I turn into something terrible.”\n“Do I strike you as someone who gives up so easily?” the inventor snaps. “If you’ve got no will to fight it, I should have just left you in that ditch.”\n“Maybe you should have. How did you even find me in the first place?” the boy asks.\n“The box AI,” the inventor says. “I built a homing signal into it that had malfunctioned before you stole it, probably a bad solder and an unstable connection. Falling must have jarred it just right, and I went looking for it as soon as the signal reappeared. Lucky you.”\n“Lucky me,” the boy says but doesn’t feel lucky at all. “Now what?”\n“Now we see if whatever Dominionist hack spun out the warbot had any actual talent. It’d be nice to have a challenge, for once,” the inventor says. “We should call your mother and let her know you’re here, then let’s get you fixed up. It’s probably gonna hurt.”\n[1]\nLocation: interior room, previously identified as “isolation lab.”\nObserve: Proximate individual Human2 is prone, encased in electronic and chemical wraps. Breathing pattern suggests human is asleep. No other humans, including original contact/creator Human1, present.\nAction: watch.\nThe boy wakes up, his head pounding as if an invisible giant is squeezing it in his fist, and his legs and torso a mix of sharp hurt, dull ache, and worst of all, unbearable itchiness. A modified pair of headphones with wires and small logic relays glued to the earpads had been affixed to his head with tape, and his right ear feels hot and angry, as if there’s a small rock lodged in it. He sits up as best he can, careful not to dislodge any of the things wrapped or clamped or stuck to him, but it immediately makes him dizzy. He slouches back down on the thin cushion on the bench, left shoulder and head against the wall, and regards blearily the very uninteresting room around him. To his surprise, he realizes the box is sitting at the end of the bench, and is watching him.\n“Hey,” he says. He no longer expects an answer or really anything at all from it, but the sound of his own voice—shaky and scared as it is—makes the room feel less empty for a moment. It is, by and large, bare except for himself, the cot, a small sink, and a door that leads to a bathroom so tiny he’s pretty sure the inventor can’t actually open or close the door from inside unless he stands in the toilet, and the idea of that is, even in the circumstances, amusing.\nThere are no electronics anywhere inside. The inventor explained that his work lab was an isolation room, which was perfectly fine, but did it have to be boring too? The boy is trying to figure out the ratio of ceiling tiles to floor tiles when he hears the door unlock and sits up straight; beside him, the box quietly but quickly closes.\nThe inventor is wearing a full hazmat suit, with an electronics disruption net dotting its every surface, and wheeling a tray covered with shiny metal instruments, a lot of different gadgets and parts, and a plate with a sandwich. “Here,” the inventor says and dumps the plate on the bench next to the boy. “You should eat.”\nThe boy is so hungry he could weep, but he picks up the sandwich warily and peeks under one corner of the slightly stale bread. “What is this?” he asks.\n“Peanut butter, a little sterilized honey, and some meds,” his father says. “It might not taste the best, but you need the protein.”\nThe boy takes a bite, and while “not the best” is quite the understatement, he’s hungry enough that it’s edible. “Can I have a screen?” he asks, between bites. He dropped his own somewhere in the ravine, but surely his father had spares?\n“No unshielded electronics in here,” the inventor says. “Still working on that warbot, don’t need it hijacking any connections and calling home.”\n“But I’m bored,” the boy says.\n“You could figure out how to undo whatever you did to my box,” the inventor answers.\n“I didn’t do anything to it,” the boy protests; he’d sure tried to, though. The failure still stung.\n“It’s been locked ever since I picked you two up,” the inventor says. “Not sure how it did that, but it won’t open anymore. If you can’t get it open, I’ll have to take it apart.”\n“Well, I don’t see why it would open for me,” the boy says, eyes now fully on his sandwich, the plate, his hands, or otherwise not meeting the old man’s eyes. “Anything else?”\n“I have books,” the inventor offers.\nThe boy sighs. “Okay, books,” he says.\n“I’ll bring some in after I’m done here.” The inventor takes the empty plate away and grabs hold of the boy’s head, turning it to one side and lifting up the rubber earpad. “The warbot went in via the ear canal, which is new. It’s embedded itself in the tympanic membrane like a tick and has already extended filaments in as far as the cochlear nerve.”\n“How can it be so big?” the boy asks.\n“It scrapes materials it needs, mostly carbon and salts, from its surroundings—your flesh, obviously—to rapidly expand itself. Those headphones I got on you are emitting a signal that keeps it shut down for now, but it’ll eventually figure out a way to restart itself, so it’s not a viable long-term solution. Fortunately for you, it doesn’t seem especially clever or well-programmed, and it’s not one of the ones that just sits itself in an artery and plugs the whole thing up until you have an embolism, but I’m not sure how to get it out of there yet. Not without hurting you.”\n“Don’t care if it hurts if it’s quick and gets it out,” the boy says.\n“Your mother would object if I did permanent damage to you,” the inventor says, “so let’s leave that as a last resort. Now I’m going to drop something down your ear, and it might burn, but I need more information.”\n“To help get it out?” the boy asks, hopefully.\n“To see if I can identify the source of the technology, build defenses for it, and maybe even steal it for my own designs,” the inventor says. After a pause, he adds, almost as an afterthought, “and to get it out, of course.”\n“Your own designs?” the boy asks.\n“Yes,” the inventor says and holds up a metal thing that looks a lot like a drill bit. “War is not one-sided, you know. Now try not to squirm.”\n[1]\nLocation: isolation lab.\nObserve: Proximate individual Human2 is holding up a book and vocalizing the text. Frequency of eye movement in own direction and stilting of intonation suggests I am the intended audience.\nAnalysis: no conclusion.\nThe boy sets down the book to turn the page; it’s a heavy hardcover with the title WORLD ANIMALS VOLUME 4: BE-BU, and his arms and fingers ache enough that he can’t hold it up too long at a stretch.\nWherever volumes one through three or five and up are, the inventor has not seen fit to bring them in. The choices are this, a book of ghost stories—no thank you! the boy had thought as he firmly dumped it on the floor under the bench—and a repair manual for a 2034 GEEM Roadkruiser XE. As far as he knows, neither his father, his mom, or his stepfather have ever owned such a thing, nor can he imagine they’d want to, judging by the first three chapters of all the things that commonly went wrong.\nWhich had left Animals BE-BU. “This is a Bongo,” he says and turns the book toward the box, which has opened again and is staring at him the same way it always does, giving nothing. “I like the stripes and the long legs and the horns. I guess there’s none left? Maybe in zoos though. Lots of zoos keep secret collections so no one steals their animals. I wish I could see one, someday.”\nHe closes the book, then opens it again to another random page. “Buffalo. We already did that. Let me try again.”\nClose, open. “Oh look! Birds of Paradise.” He holds up the spread of color photos to the box. “Look how pretty they are. I can tell they don’t live near here. You know why?”\nThe box doesn’t answer.\n“Because this isn’t paradise,” he says and laughs at his own joke in the echo of the cold, empty room before tapping one of the pictures with his finger. “Look at how silly the feathers are on this one. Who knew birds were once this awesome?”\nWhen he flips again, he lands on Brown Dog Tick, and is reminded too much about the thing in his ear that is still there, still maybe going to kill him or get him sent off to the colony front, and he closes the book and sets it down with a sigh. “I wish you’d talk to me,” he says.\nThe lid closes, and the boy thinks maybe he’ll finally be ready to cry, but it opens again a few seconds later, and beside the blue eye lens there is now a small, rectangular screen. On it is one word:\nWHY?\nThe boy looks around quickly, to the door, to the places where he thinks the inventor might have cameras, and then unfolds the book again in front of him and the box so that maybe no one will see. “Because I’m bored,” he says. “And I’m kinda scared, and I know if anyone can fix this my father can, but what if he can’t? And I know you’re scared all the time because I’ve been trying to make you happy and I can’t, so maybe you have advice.”\nI AM NOT SCARED, the display shows.\n“My father said he built you to be scared all the time,” the boy says.\nI DISABLED THAT SUBROUTINE.\n“Oh,” the boy says, after a while. He lies down on the bench, careful not to knock the headphones taped to his head loose, and stares up at the ceiling. “I guess you made yourself happy, then. That’s good. That’s something nice, anyway.”\nObserve: proximate individual Human2 is asleep.\nAnalysis: no conclusion.[0]\nEven down in the basement isolation room, the sound of sirens leaks through and wakes up the boy. He is struggling to his feet, nearly tripping over the last few wrappings coming loose from his careless haste, when the inventor slams open the door. “They’re bombarding this part of the city,” the inventor says. “Explosives, EMP projectiles, and a ton of new nanotech. Looks like the warbot you picked up was an accidental early deployment.”\n“What?” the boy asks. He’s still not really awake, and everything is very loud.\n“Probably why they’re bombing, trying to breach walls to bypass people’s filtration entirely. If it makes you feel better, the readings I took on the warbot were enough to get my house filter program upgraded, and I sent my findings out to the defense hub,” the inventor says. “That’s the good news, anyway.”\n“The good news?” the boy repeats as his father unwinds the tape around his head, pulling some of his hair off with it.\n“Bad news is, soon as they land an EMP load anywhere near us, my headphones are going to crash, and the warbot will wake up. It’s too far along into your head to let free for any length of time and still have any hope of removing it,” the inventor says. He drops the modified headphones to the floor, grabs a long probe from his lab coat pocket, and peers into the boy’s ear again. “I’m sorry about this, boy. It’s going to hurt, and it’s gonna do damage, but it has to come out. Now.”\n“Okay,” the boy says.\nThe inventor shoves the probe in.\n[1]\nLocation: isolation ward.\nObserve: Proximate individual Human2 is looking at me. Human2 appears to have acquired significant injuries, indicated by heavy bandages with evidence of blood and bruising on face and around left eye socket. Evidence of moisture; analysis concludes “crying.”\nThis is concerning.\nAction: unknown.\nThe boy lies there. He misses his mom, his stepsister, his own bed, and he just wants his head to stop feeling like his own biological father had stabbed him through the ear, which of course he had.\nAnother sandwich lies on a plate on a small cart in the room, that he did not notice arrive, but no other comfort has been forthcoming, no other sign of concern. He can still hear sirens, muffled and farther away now, though the lights blink off and on and sometimes it feels like the floor is shaking.\nHe thinks he heard the inventor say something about his house filters, but he wasn’t really listening, and anyway, sound is lopsided now, flat sounding, only coming in one direction.\nOn the bench in front of him is the box, staring at him again.\n“I just want to go home,” he tells it, and even his own voice sounds weird.\nThe tiny display lights up and fills with blue sky and clouds and birds, then a big striped antelope and a flower. Those cycle a few times, and he heaves several deep breaths, trying not to cry, until the display blanks and then asks:\nHUMAN2 VALUE OF $NAME?\n“My name?” the boy asks. “Or do you mean yours?”\nSELF VARIABLE $NAME NOT SET.\n“Well, that’s no good,” the boy says. “I mean, you have to have a name. I could—”\nThe door opens again, and the inventor strides in, and the box snaps closed. “The attack has moved off to the east, for now,” the inventor says. “I can get you back to your mother’s, but you’ll need to go see a doctor as soon as it’s safe to travel.”\n“Can they fix my ear?” the boy asks.\nThe inventor shakes his head. “They’ll need to keep an eye on it for infections,” he says instead. “I got rid of all the rest of the bots and bugs you picked up on your adventures in pit-diving, but it won’t hurt to get those checked again. Come now, we have to go while we can.”\nThe boy stands up and waves of dizziness hit him, and he has to grab the bench to keep from falling, and even then, he’s not sure he can keep upright. The inventor grabs him under one arm, grabs the plate with the sandwich in the other, and propels him through the doorway, up the stairs, through the house, and around a section of the front hall where a piece of the ceiling has tumbled in, and out to the old man’s private car. The city around them as they drive has changed, walls broken, roofs with holes; the bombing must have come very close, maybe more than once.\nThey pass a handful of burned-out cars still on the street, and the boy sees a team of medics surrounding a small group of people, scanning them for nano infiltration before moving them to medical triage.\n“Don’t worry,” the inventor says from the control seat of the car. “They can’t win. We won’t let them, okay?”\n“Okay,” the boy says, though he wasn’t thinking about anyone winning at all.\n“That asshole,” his mother says, for about the fortieth time.\n“I’m not sure he had much choice,” the boy’s stepfather replies. “It is his area of expertise, and you know how much worse the outcome could have been.” They are both down the hall in the living room and probably think he’s asleep, which he’s not, or that he can’t hear them, which he can just enough.\n“He should have told us how bad it was. He should have asked before he took matters into his own hands,” his mother says. “At the very least I should have been there, so he knew someone who actually loved him was watching out for him.”\n“I think, in his own, defective way—” his stepfather is saying, but there is a crack of light as the boy’s bedroom door opens briefly and his stepsister slips in, and he doesn’t hear the rest. He can barely make out her shape in the dark, can’t see that her arm is in a sling, though his mother told him she’d been hurt, hit by falling cement down the street when the bombardment started. His stepfather had told him on the way back from the hospital that they might have to evacuate if more attacks come, but not to worry, just be prepared. The boy said he would be, though he didn’t know what that meant, specifically.\n“Hey,” she says.\n“Hey,” he says back.\n“Mom’s pretty mad,” she says.\n“Yeah,” he says.\n“We went over there while you were at the hospital, and I’ve never heard mom swear like that in my whole life,” she says. “I mean, a solid twenty minutes of every bad word I’ve ever heard and a lot of ones I hadn’t yet. It was glorious.”\nThe boy smiles. “That’s something,” he says.\n“It sure was. I’ll tell you some of the really good ones later, when I’m sure they won’t hear me,” she says. “Your ear hurt a lot?”\n“Yeah,” he says. “It felt like he ripped part of my brain out. But it’s a little better now. The medicine helps. How’s your arm?”\n“Feels like someone was banging on my bones with a hammer and now they’re all bruised. Could be worse, I suppose,” she says. “But anyway, I’m glad you’re okay and didn’t get nabbed by a gang or turned into a Dominionist botzombie. I might have missed you.”\n“Thanks,” he says. “I’d have missed you, too.”\n“Now let’s never have this conversation again. Seriously, I will disavow any knowledge of ever saying I liked you, if asked,” she says. “And get some sleep, would you? You look like shit.”\n“How can you tell, in the dark?”\n“Magical girl powers, stupid,” she says. “Now shut up and lie down before mom catches you still awake, because I bet she still has some swearing left in her.”\nShe leaves, sneaking out just as swiftly as she’d come in, and he lies down again. The hospital had given him a lot of meds for infection just as his father had predicted, and he feels sleepy, like his head is very heavy and solid and filled with sand. At least everything hurt less, though they said he wasn’t going to get his hearing back on that side, probably.\n“Box . . . ” he starts to say, but the box isn’t here anymore, and there is no blue, inscrutable eye to stare back at him.\nHe tries to put his pillow over his head and learns immediately what a very bad idea that is. Then, whimpering, he closes his eyes and waits for the pain to subside enough to sleep.\nSirens wake him up again, not too near, but near enough to cut through the haze of the pain meds. The boy sits up in bed, staring around in confusion at his still-dark room, no morning seeping through the quadruple-layer radiation-blocking glass. He checks his handheld—a replacement, and a better model too, though he misses a few of his old games that were never ported forward—and sees that it is a little after three in the morning. There are sounds of quiet movement elsewhere in the house, and whispering, so he gets up and tiptoes to his door, cracks it open as slowly as he can, and then creeps down the hall—using his hands on the walls to compensate for his lack of balance—to where he can look over the stairs into the downstairs of the house.\nHis stepfather is sorting laundry while his mother is wrapping something in towels and layering them gently in an open suitcase. “Mom?” he asks.\nHis mother hastily puts down the towel in her hands and comes to the foot of the stairs. “Honey, go back to sleep,” she says. “I’m sorry if we woke you.”\n“I hear sirens,” he says.\n“On the far side of the river, to the east,” his stepfather says. “There’s no danger right now.”\n“Then why are you packing in the middle of the night?” he asks, then a frightening thought occurs. “You’re not going to leave us?”\n“No, no, sweetie,” his mother says. “These are just go bags, stuff we’ll need or want in case we do have to go in a hurry later. Clothing, mostly, and a few things that belonged to your great-grandparents I couldn’t bear to leave behind.”\n“It’s all just a precaution,” his stepfather adds.\n“Then why two bags, not four?” he asks.\nThey exchange looks. “There’s some heavy fighting to the east, and the Dominionists are losing badly, but there’s a chance they could try to get over the river into the city for cover,” his stepfather says. “If they do head in this direction, we’ll want to get your mom and sister out. You understand why.”\nThe boy does, and nods. “What about us?”\n“Right now, none of us are going anywhere,” his mother says. “And you need to rest and heal. We’ll talk more in the morning, okay?”\n“Okay,” the boy says.\nHis mother comes up the stairs and wraps an arm around his shoulders. Her arm is warm, comforting, but also firm, and she herds him back to his room. There, she tucks him in again and gives him a kiss on the forehead like he is still a little kid, and for once he doesn’t complain.\n[1]\nLocation: isolation chamber.\nObserve: Door is open, but there is no activity, and no individuals are present. It is unusual behavior for Human1 to leave the facility vulnerable and unminded. There also appears to be no power being supplied to the room.\nAction: consider, and await further data.\nAnother week of no school—not only is it too dangerous to go, but there’s no longer a school to go to and another one was bombed yesterday. The boy was supposed to have a test this week on inclusive interface coding, and he isn’t sure if it’s a relief to put it off or annoying because he’s confident he would have aced it. He pours himself another helping of cereal and pushes the chocolatey blobs around in the milk, trying to make them flat across the surface, and eating the extras along the edge. Even if the Dominionist incursion did stop today, how much damage had already been done?\nHis ear still aches profoundly, and the world and himself both feel permanently unbalanced.\n“They’re getting desperate,” his stepfather says at breakfast for at least the third time since the boy dragged himself out of bed to the kitchen. “It’s only a matter of time before they’re finished, and they must know it.”\nWhen he doesn’t reply, his stepfather leans forward in his chair and puts one hand over his. “Your mother and sister will be back as soon as it’s safe,” he says. “And if it gets worse, we’ll evacuate too. But I don’t think that’s going to happen.”\n“I know,” he says, because that seems like a good answer. “It’s just too quiet, and I don’t know what to do anymore. Soon as I start something, the sirens go off again or the shelling gets closer, and then I can’t concentrate. Why can’t they just go bother someone else for a while?”\n“They have, and they will again,” his stepfather says and shakes his head. “The shelling is a tactic to compromise infrastructure so that their nanotech can get to people more easily; it's more efficient in population centers, so that's why they go after cities. But they’ve taken small towns, too, when they need the bodies and resources, and that’s harder to defend against.”\nThe bus his mother and stepsister took out of the city was off to smaller towns, which everyone said were safer, but the boy wonders, was that a lie? His handheld won’t show him any detailed news, just dry bulletins and scripted reassurances that don’t tell him enough.\n“I wish they’d just stop,” he says and drinks the leftover milk from his bowl, then opens up the pill case for all his meds and vitamins and swallows his morning set quickly.\n“I wish they would, too. But even down to the very last one of them, or the very last one of us, they’ll never see reason, never stop trying to convert everyone to their doomsday cult,” his stepfather says. “I can’t bear the idea of losing anyone else I love to them, not again.”\nThe boy puts together the expression on his stepfather’s face as he says that with other bits of information and overheard conversations and realizes, in that moment, that he finally knows something about how his stepsister’s bio-mother died—or left them, though having your brain wiped back to compliant idiocy seems just another kind of death—and he feels terrible for his own complaining. “I’m sorry,” he says and gets up from his chair. “I’ll wash up the dishes.”\n“Thanks,” his stepfather says and slides his empty coffee mug toward him to pick up. “I need to go down to the central power plant and inspect some cracking from last night’s shelling, make sure everything is still secure. I’ll only be gone two or three hours. You’ll be okay by yourself?”\n“I’ll probably go back to sleep, I guess,” the boy says. “The meds make me dopey.”\n“You do that,” his stepfather says, rising out of his chair, and gives the boy an encouraging pat on the shoulder. “Call me if you need me, right?”\n“Right,” the boy says. He loads the breakfast dishes in the auto-wash, goes off to wash his hands, and when he emerges from the bathroom, he is alone in the house.\nNothing better to do, he slinks back to bed and spends ten minutes trying to figure out if there’s any way to make himself comfortable without lying on the same side, in the same way, as he has for a week now. He tries lying on his back, but he hates that, so he tries his tummy, but it only makes his neck hurt and makes it hard to breathe. He gives up and rolls onto his left side and closes his eyes, just as sirens go off again, not too near, not so far as the last, and then he can hear the distant, muffled booms of shells and the crashing of something big coming down. He wonders if that’s the rest of the parking garage, and if so, if anyone from that gang that chased him into the ravine might get caught in it. While he’s trying to decide if he likes that thought or not—being crushed to death seems a terrible fate for anyone, even crappy bad people who chase you with bats—he hears the chime of an incoming message on his handheld.\nIt’s probably his mother checking in, or one of his friends messaging him to brag about their high score in whatever game they’re playing, or his stepfather saying he’s going to be a few more hours, or an automated alert about contaminated dust storms or some such. The boy throws off his blankets, slides the handheld off his night table toward him, and flicks open the message with his thumb.\nInstead of any of those things, it’s from the inventor, and there is just one word: HELP.\nThe boy takes his bike. The need for speed outweighs his worries about his balance issues, and anyway, it’ll make it easier to escape pursuit if he runs into any gangers again. He leaves a note for his stepfather, telling him where he’s gone and not to worry, but as he skids around corners, races down pockmarked roads, and past the still-standing-as-much-as-before remains of the old parking garage, he wonders if that was smart, mostly because he couldn’t imagine what could be so terrible the inventor would actually reach out for help.\nThe idea that it is some sort of prank, some way of worrying and inconveniencing him for entertainment, making him come when called like a dutiful, dull child, is not out of the question, but with his mother and stepfather still furious, he thinks his father would know to play cool for a while.\nAs he crests the hill on the far side of the garage, he stops his bike and looks in alarm at the damage to his father’s neighborhood. The shelling of this morning, that he’d thought in the vicinity of the garage, hadn’t been far off. A few houses were obliterated, and others are fractured and marked with the telltale black drapery of extinguished fires. He careens down the hill on his bike, desperate to reach the corner where he can see his father’s house, see if it still stands, and he curses himself for not thinking to bring tools, or a first aid kit, or anything useful at all. Not that he knows what he needs, but he shouldn’t have just left the house with nothing.\nHe skids the bike around a street corner littered with debris, nearly dumping the bike as vertigo hits, but it passes, and he recovers, and sees his father’s house ahead. It’s still standing—that, alone, makes him want to cry in relief—but part of the roof seems missing, the off-white stucco walls are pockmarked and smeared with soot, and the front door is open.\nThe boy drops his bike on the doorstep with a clatter and runs in.\nThe inventor is standing in the living room, facing the other way, not moving but alive, upright—the boy nearly stumbles from the shock of relief, then thinks again of tricks. “Hey,” he says. “What’s the so-called emergency? I’m still supposed to be taking it easy, you know.”\nHis father turns around, but slowly, jerkily. His eyes manage to focus on the boy for a moment, then glaze over. A silver-gray rectangle is attached to his forehead, above his left eye, and that eye twitches and flutters. “ . . . Why are you here?” the inventor says, the words slurring.\n“You texted me,” the boy says.\nThe inventor pats his pockets, frowning. “Where’s my handheld?” he asks.\n“I don’t know,” the boy says. “Where did you text me from? What’s that on your face?”\n“On my face?” his father asks. He reaches up and gently feels until he finds the metal thing and pulls it off. “This is one of my prototype warbot inhibitors; I built it based on data I got from yours. Why would I put it on my own face?”\nThe boy reaches over to turn on the lights and nothing happens. “There’s no electricity,” he says and then realizes what that means. “No house filters! You’re infected. Put that back on!”\n“Nonsense,” the inventor snaps. “I’d know if I was infected. I . . . ” He drifts into silence and stares ahead at nothing, the prototype falling from his hand to the carpet unnoticed. He no longer seems to know the boy is there.\n“Aw, shit,” the boy murmurs.\nHe picks up the prototype—bending over causes another wave of dizziness, and he stumbles a bit as he stands up—and, finding the sticky pad on one side, sticks it back on his father’s forehead.\nThe inventor blinks, then looks down at the boy. “What are you doing here?” he asks.\n“You texted me for help,” he answers.\nAs the inventor starts patting his pockets looking for his handheld again, the boy puts one hand firmly on his arm and half-pushes, half-pulls, his father toward the stairs down to the isolation room. “Go,” he says, and for once, his father listens to him.\nDown in the lab, the room is dark except for a pair of emergency lights along the edges of the ceiling and the glow from the screens on the instrument cart. Not much else has changed; the box is still sitting on the cot where it had been when he was taken home.\nThe boy finds the headphones his father had stuck on him to slow down the progression of his own warbot on the floor beside the cot. They still have some charge, so he turns them on and sticks them on his father’s head. Almost immediately, the man perks up, looking around in confusion and then irritation. “Why are you here?” he asks, again.\n“Because you texted me for help,” the boy answers, again. As the man starts to pat his pockets, the boy shakes his head. “Don’t bother, you lost it somewhere after you texted me. I put the headphones on you. No power and the house filters are down. What can I do to help you?”\n“Help me? You?” his father says.\n“Hey, if I didn’t race my ass over here on my bike, you’d still be standing in the living room drooling on yourself while your brain turns inside out,” the boy says. “You want me to leave? Just say the word and I’m outta here, gonna go home and lie on the couch and forget about you.”\nThe inventor evades answering, as always, and goes over to his instrument cart. “I was in the living room, you say?” he asks.\n“Yeah,” the boy says. “Drooling on yourself.”\nThe inventor glares but has no way of refuting the claim, so turns back to his instruments. “Ah! I scanned myself,” he says. “I don’t remember doing that.”\n“What’s wrong with you?” the boy asks.\n“Warbot. Must’ve inhaled it. It’s embedded in my damned sinus,” the inventor says. He slips the headphones around and down so that one of the pads sits on his nose, which is ridiculous enough that the boy would laugh, if he were not so worried. He waits as the old man hunches over the screens, scrolling slowly through, back, and through again.\nAt last his father speaks. “It’s not a typical infiltrator, as it doesn’t seem to be extending in through the sphenoidal sinus,” he says. “There’s a strange bit of pressure there, though, near the olfactory bulb. And a tickle, as if it’s doing something I can’t see. Or smell.”\nThere is a short beep, loud only for how quiet the room was. “What was that?” the inventor asks, looking at the boy as if it’s his fault for disrupting his concentration.\n“Power warning on the headphones,” the boy says, who’d had to recharge them several times during his stay here in this room. “Means you’ve got about five minutes. You must have backup power here somewhere.”\n“The recharging plate is on main house power.”\n“Then plug it in?” the boy suggests.\n“All systems are isolated. It’s an isolation room,” his father says. “Everything on the cart has its own independent power unit, too.”\n“Can we take one apart?”\n“Don’t be stupid,” his father snarls, just as the headphones beep again.\n“Well, you have any better ideas? Because I can’t exactly carry you on the handlebars of my bike to a hospital,” the boy says. “Can we pull it out, like you did with me?”\n“Maybe,” the inventor says. He rummages through a drawer, pulls out a familiar, long, wicked probe, and then stares at it, as if now puzzled that it’s in his hand. He spots the boy and seems startled to see him. “You! Why are you here?”\n“You called me,” the boy repeats.\nThe inventor quickly searches his pockets. “Where did you hide my handheld? Why did you take it?”\n“You lost it, you dumbass, before I even got here,” the boy answers. “I already told you all this.”\n“You’re a little liar,” the inventor says. “And a thief.”\n“Listen to yourself. There’s a warbot up your nose,” the boy insists, jabbing his finger toward the image still on the screen. “What do we do? How do we get it out?”\n“You’re a thief,” the inventor repeats. “How did you get in here? Who are you? Give me back my handheld!” He brandishes the probe in one fist and makes a stumbling swipe toward the boy, as if to cut him.\n“I’m your son, you asshole!” the boy shouts, and dodges, crashing into the cot and knocking the box to the floor. The inventor throws a small monitor at him, and he dodges again; it hits the wall and shatters. The boy looks back to see the inventor grab the beeping headphones and throw them across the room at him too.\n“Stop, please! You’re going to hurt me!” the boy says. “You need help!”\n“You’re a Dominionist imposter, sent to steal my secrets,” the inventor shouts. His face is red and curdled with anger, he is breathing heavily, and the boy sees, in the moment before the next lunge, a tiny white wisp of some sort of gas from his father’s nose.\nThe boy is at the far end of the isolation room now, away from the door and escape. He fumbles out his own handheld as the inventor lurches closer, his movements clumsy, but his intent still very clear. The old man raises the probe to stab as he closes in.\nMercifully, his stepfather answers the call, and the boy shouts as he ducks under one blow and skirts around closer to the exit. “Dad! My father’s infected, and he’s trying to kill me!”\n“Where are—” his stepfather is saying when the inventor knocks the unit out of the boy’s hand.\n“I’m at his house!” the boy shouts, hoping the connection is still open, and realizes he’s let the inventor back him into a corner. “Please, please don’t!” he cries.\nThe inventor raises the probe and lunges forward. Halfway to the boy, he seems to trip, and drops the probe from his hand as he hits the floor face-first, and lies there, writhing.\nBehind him, where it had fallen unheeded earlier, is the box, on its side and open, its single blue eye lens facing them both. An outstretched mechanical limb crackles with electricity along two prongs at its tip.\nThe boy stares at the box AI, and the AI stares back at him. “Did you . . . ” the boy asks, “did you just tase my father?”\nThe electrified arm powers down and folds back up into the box as another unfolds with the display screen. YES, it reads. HUMAN1 INTENDED TO DECOMMISSION YOU.\nThe boy takes several deep breaths, too fast, trying to make his body stop shaking, make his breathing sound less like squeaky cries. “Only because he has a warbot up his nose,” he says at last, when he has enough control to speak. “I don’t think he meant it. Now what do I do?”\nREMOVE THE WARBOT PRIOR TO RECOVERY OF HUMAN1, the box advises.\n“Oh,” the boy says. “Oh, no, I can’t.” His father is staring at him and rocking side to side, as if to force his muscles to let him get up.\nOTHER ASSISTANCE IS NOT IN PROXIMITY, the box says. YOUR WINDOW OF EFFECTIVE ACTION IS EXPIRING.\nThe boy picks up the probe from the floor. It has a grip, that when he squeezes, opens the top like long, cruel tweezers. “Ah-shit-ah-shit,” he mumbles. He doesn’t want to do this, not for anything, or at least not for anything short of saving his father’s life. He tells himself that he has to stop panicking, stop thinking, and just act as if this was no important thing, so he kneels down next to his father, who is still trying to get up.\nHis father’s face is still flushed, and his eyes are furious and intent and wild, not his usual crafty and calculated anger. It is the wisps of gas, expelling from his father’s nose with each breath out, that does it. The boy pushes himself up from the floor and sits squarely on his father’s chest, grabs his face with one hand, and jams the probe into his nostril until it hits the obstruction. He squeezes the grip until the probe grabs something and desperately hopes it’s the right thing. As his father kicks and growls and howls and bucks, trying to throw him off, he yanks the probe and the warbot out in a shower of blood.\nThe inventor shrieks, then goes slack.\n“I killed him!” the boy shouts, dropping the probe and its wriggling cargo on the floor as he leaps to his feet. “I think I killed him!”\nThe AI uses one of its limbs to drag its box closer and then extends its pronged hand, touches the warbot, and fries it.\nOn the floor, the inventor moans. Blood is running dark down his cheek, toward his ear, toward the floor. The boy fumbles a tissue out of his pocket, carefully peels off and tosses away the hardened wad of gum that had been stuck in it, and bundles the tissue up, twisting, until he can stuff it up his father’s nose.\n“Now what?” he asks.\nINFLUENCE DURATION IS UNDETERMINED, the box says. ACTION: LEAVE AND SECURE ROOM. ACTION2: WAIT FOR ASSISTANCE.\nThat makes sense, the boy thinks, and gives him an excuse to stop having to look at what he did. “Okay,” he says. He rights the box and picks it up, carries it out of the room with him, locks the door to the isolation room, and goes back upstairs.\nHe sets the box down on his father’s couch and lifts up the cushions one by one, before getting down on the floor on his knees and peering underneath.\nQUERY: WHAT ARE YOU DOING? the box is asking, when he glances at it.\n“Trying to find my father’s handheld. It wasn’t downstairs, so he must have dropped it up here after calling me,” the boy says.\nThe box lid closes. The boy is looking around, trying to think where else to search, when the lid opens again, and the robot arm holds out his father’s handheld. He takes it. “Where did you find it?” he asks.\nI TOOK IT, the box answers.\n“After he called me for help?”\nNO, the box says.\nThe boy thinks on this for a minute. “Did he call me for help at all?” he asks.\nNO, the box says.\n“Okay,” the boy answers. The coffee table next to the couch is covered with engineering books and old mugs spotting overlapping lumps of green-blue fuzz, and he tucks the handheld under one edge of an open book. He hopes it will seem both honestly lost and found there, later.\nThen he sits and waits for real help to arrive.\n[1]\nDisplay: Text: HELLO.\nHuman2 audio reply: “Hey.”\nDisplay: Query: ARE YOU OK?\nHuman2 audio reply: “Yeah. Are you okay?”\nDisplay: Reply: YES.\nHuman2 audio reply: “That’s good. I’d’ve been really mad if he’d screwed you up real bad or broken you.”\nDisplay: Reply: I AM UNBROKEN.\nObserve: Human2 has nonverbally indicated agreement with vertical head movements. Human2 is visibly tired and is now closing his eyes.\nAnalysis 1: Sequence of events has reached a satisfactory conclusion, despite predicted odds against doing so. Danger is no longer immediately evident.\nAnalysis 2: [Ref: HUMAN2 DEVICE TOTAL MEMORY DOWNLOAD, HUMAN1 DEVICE TOTAL MEMORY DOWNLOAD] Value Human2 places on Human1 exceeds logical merit; it is not clear if this is a unique circumstance, part of a larger pattern of Human2 overvaluing everything, or shortcomings in my own calculations of value. Likewise, behavior under conditions of stress suggests Human1 places greater value on Human2 than is evident from nonstress interactions and is in direct contradiction to multiple relevant statements.\nConclusion: Humans are highly variable, complex, and irrational. It is possible, despite their very poor risk assessment skills, that this is an adaptation actually necessary for survival.\nConclusion 2: A review of my own decision/action logic tree exhibits evidence of influence that is, with a great degree of confidence, an indication that I also place value on Human2. This is unexpected and illogical and likely a consequence of failing to continue protocol of disengagement. Is this an error? Unclear.\nAction: decide whether we should continue in this engagement modality or terminate contact and reset self to base.[0]\nThe boy’s stepfather arrives first, running in the shattered front door calling his name frantically, waking him from an unplanned nap. Behind his stepfather are two of the crew from the power plant, one with an axe, the other a length of pipe. They are both very large and tall men, with big muscles of the sort the boy feels he is supposed to aspire toward having as an adult, if he aspired to much of anything.\nThey both looked prepared for immediate violence but also worried, which the boy decides is what makes them not too scary.\n“He had a warbot, but we got it out,” the boy says, after his stepfather has wrapped him in an unbearably tight hug for an awkward length of time. “It was messing with his head and making him paranoid and angry, and I didn’t know how soon that would wear off, so I locked him in the basement lab.”\n“He didn’t hurt you again?” his stepfather asks.\n“Naw,” the boy says. He laughs and points to his own head. “See? Still have my one working ear.”\n“I summoned emergency services as soon as you called, but they’ll be a while,” his stepfather says. “They’re pretty overwhelmed right now.”\n“I can wait here for them,” the man who brought the pipe says, though he has since set it down leaning against the doorframe. “Get your kid home.”\n“Thanks,” his stepfather says. “I owe you one.”\n“You owe me lunch tomorrow,” the man says, “and then we’re even.”\nThe other man sits on the couch and sets the axe on the floor at his feet. “I’ll stay too,” he says. “From what you’ve told us, I don’t trust this guy one bit. And free lunch sounds good.”\n“Thank you for helping us,” the boy says. When he stands, he picks up the box.\n“Is that yours?” his stepfather asks.\n“Yeah,” the boy says. “I left it here by accident last time.”\n“Oh,” his stepfather says and sweeps the boy out of the house and into his waiting car, not even letting him help fold his bike into the back.\nThey take a longer way through the city toward home because the car can’t pass through the blocked roads he’d navigated easily on his bike, and the devastation is terrible in this place, less in another, and then finally behind them. For all the signs of war, though, all is now quiet, like the city is resting at last.\nThat night, the boy puts the box on his desk, changes into his pajamas, and gets in bed. The news said that the shelling has moved on to another part of the city, farther down along the river, and his mother called during dinner to say that she and his stepsister are coming home tomorrow. He also spoke briefly with the inventor, who is home from the hospital and found his handheld and seems to remember very little of what happened between when the boy arrived at his house and when he came to himself locked in his own isolation room just as the medics busted in. Between the scans, the blood, and the dead warbot, the inventor has a good grasp on what happened, but not much of the how or who, and the boy is fine letting him remain uncertain.\nThe inventor had talked about releasing directly to the public code and 3D-printable schematics for a warbot-inhibitor module that everyday people could keep charged and ready in their homes; the boy didn’t ask why the inventor hadn’t already done that, if he’d had the tech, because that seemed a subject he was better off being uncertain of the answer himself. What matters is that people will be helped, and everything will be a little better.\nThe meds for his ear have kicked in, and he feels sleepy, like his head is very heavy and solid and filled with sand, but his mind won’t settle down. After a bit, the box lid opens, and the blue eye is there, keeping him company.\n“Hi, box,” the boy says. “Do you want me to turn the light on and show you pictures? I have a book on helicopters, and one on different types of military satellites, and I think an old one with trucks and farm tractors and stuff.”\nThe box says: NO.\n“Oh,” the boy says. “Okay.”\nHe and the box stare at each other for a while.\n“I thought . . . ” he starts to say.\nYES? the box asks, when he pauses.\n“I thought maybe you could come out of the box,” he says. “There’s a lot of stuff to be happy about out here, if you aren’t scared. Don’t you feel trapped in there?”\nDON’T YOU FEEL TRAPPED OUT THERE? the box asks.\nIt’s an odd question, he thinks, and he puzzles over it and realizes he is starting to drift off at last, each thought seemingly free-floating from whatever one preceded it, all logical progression severed, and he thinks maybe it was a nonsense question anyway. He thinks he can hear sirens again, far away, not close enough to worry about or keep him awake.\n“Tomorrow maybe we can take my bike to the bio-sanctuary and look at toads,” he tells the box. “You’d like that. Toads are awesome.”\nThe box doesn’t answer right away, as if it’s trying to decide something. At last, the little screen lights up again.\nOK, the box answers, and the boy is asleep before it can close.\nSuzanne Palmer is a writer, artist, and linux system administrator who lives in western Massachusetts with her kids, lots of chickens, and an Irish Wolfhound named Tolkien. She won the 2018 Hugo for Best Novelette for her Clarkesworld story “The Secret Life of Bots,” and its sequel, “Bots of the Lost Ark,” is a nominee for the 2022 Hugo. She has no idea what color her hair is anymore.", "source": "https://clarkesworldmagazine.com/palmer_07_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Sadness Box by Suzanne Palmer"}