{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Daniel Abraham", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "xakouEeZb/bWaBilkIYLGLPvSOM=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: Endings  Endings are hard.  There are a lot of reasons for that. First off, figuring out just technically how to stick an ending is nearly the last thing that a writer has to figure out. All the other stuff—writing a good sentence, writing a good scene, the tricky bit with adverbs, avoiding infodumps, celebrating infodumps, being confused about infodumps, all of it—is complicated enough to fill a lifetime. And since even rock-solid structure won’t save you if the prose bounces people off in the first couple pages, it’s not a priority. Learn how to write a good hook, and you at least get the chance to whiff the ending. With a crap hook, no one gets to the middle, much less the end.  More than that, errors that are hard to see at the beginning often show up at the ending. Brilliant short story writer Jim van Pelt once told me that whenever someone said there was a problem with the end of his story, it meant there was a problem with the setup of his story.  If some sense of the character didn’t quite land in the third scene, the place you’ll know it is at the end. If the pacing in the middle wasn’t right, you’ll know it at the end. Not because the end itself is particularly good or bad in its own right, but because once the last paragraph is read and the dream of the story ends, that’s the time when as a reader, you can reflect on the whole experience of the story. Did it work, did it not? Are you moved, are you satisfied, are you bored? In that moment of evaluation, all the flaws and failings appear, even if you don’t know exactly what they were.  But that’s not the only reason endings are hard.  Even the most successful ending to a story carries a sense of loss. As a reader, we’ve been deep in this other place with characters and moments that enthralled us and with every new moment, every revelation, every turned page, the distance to the back cover grows thinner. Until you run out of words, and the story’s done, can you then evaluate what happened. The worst case scenario is relief. At least that damned book’s done and you can go on to something that’ll clear it out of your head. But if it worked, there’s a satisfaction and regret. We’ll miss those characters. Those places. Even if we feel satisfied and full, something we enjoyed is gone now. Maybe we start the reread right then to get it back, or download the second volume of the series onto our e-book reader right there in bed. Something to prolong the experience, to make the ending not an ending, because endings are hard.  When I was about ten, I read the Narnia books. They hit at pretty much exactly the right time for me, because I fell through them one after another right up until The Last Battle. Which I’ve never read. I wasn’t ready for the story to be over, and so I stopped. As long as I didn’t read that one last book, the story would never end.  And, over the last few decades, the kid who read those books has turned into just me, so even if I do sit down with it now, it won’t be the same thing it would have been then. That story was saved from ending because I wasn’t ready to let the sense of possibility go. But that’s only part of why endings are hard.  Endings are hard because people die. I’ve been lucky so far, but that’s just timing and we all know it. Grandma Garner, whose house I stayed every Friday night from when I was five until I was maybe fourteen, is dead. Grandpa Garner died while I was at the house with him. Jay Lake is gone, and he was a friend. Eugie Foster is gone. Graham Joyce. My parents are still alive. My wife is still alive. My daughter is. They’re all going to go, myself as well. And we don’t even know the order.  Margaret Atwood says it in her short story or maybe essay “Happy Endings.” “The only authentic ending is the one provided here: John and Mary die, John and Mary die, John and Mary die.” It’s something we all know and we all struggle with and we all dread. The melancholy of ending a brilliant story isn’t that different from the melancholy of remembering that kid who was scarfing down C. S Lewis until his nerve failed him. He’s gone now. The room he lived in isn’t the same space it was. The loves and fears he had don’t apply. The inevitability of the past, of all these things moving into the past, makes an ending—an authentic, powerful, successful ending also a presentiment of death. Every closed book is also a memento mori. But that’s not the only reason endings are hard. The biggest reason—the most important reason I think, that endings are hard is that we’re trained off them.  I am profoundly grateful to live in a secular society. I just want to get that out up front. I love living someplace where people can worship God differently, have different views of the essential nature of the universe, debate science and poetry and art, and where all of that can be part of a larger, richer secular culture that has the potential to celebrate the whole range of humanity. Way better than theocracy every time. Not saying it makes everything perfect. Not saying it’s without blemishes.  For instance, the news.  News is the privileged narrative of a secular society. It defines what information is important -- what stories matter. Turning away from the news in a modern secular culture is as weird and isolating and rebellious as not going to church would have been in more religious times. It is where we turn to know what matters: that is its role and its justification. And here’s the thing. It doesn’t do endings.  Malaysian Airlines Flight 370 went missing in March of 2014, and for months was the main story at CNN. People speculated that it had been taken by terrorists as part of some larger scheme, or that it had been downed as a suicide by one of the pilots, or failed because of a bizarre confluence of equipment failure and human error. Or abducted by aliens. Whatever the details of the particular analysis, simply by being in the headlines, the subtext we all got was the same: this is important. And then . . . no resolution came. Like reading a novel with an amazing first chapter that sagged into nothing in the middle, the story didn’t resolve. It was interrupted by other things which were by their presence clearly more important. More recently ISIS and Ebola followed the same pattern. The issues were headline news until they were interrupted by snow storms and the collapse of Bill Cosby and whatever great hook of a story comes next. Our central cultural narrative is desperately empty of resolutions. Instead, it is one of interruption. Of issues brought up, obsessed over, and then put aside for more pressing matters, forever, eternally.  Endlessly.  That is the world we practice. A world in which resolution is less important than a new hook, in which endings are so optional that when we skip over them—What happened with ISIS? What happened to the guys behind the housing crisis? Where did the missing plane go?—they aren’t even missed. We look back at the unresolved threads of that were so critical to us six months or a year ago with a kind of nostalgia, like “Oh, I remember that. Whatever became of it?” And slowly, over years and decades, we’re trained that endings are optional. That we don’t need them. That they’re hard.  If there is something that fiction offers, it’s this: stories end. In fiction, unlike anyplace else, the narrative takes its form, the characters play their parts, and the author brings it all together to the point she intended from the beginning, and by ending, they make a kind of meaning that we don’t get anywhere else. We can experience (even if it’s only in miniature) what it would be like for things— stories, lives—to have meaning.  “The good ended happily, the bad unhappily. That’s what fiction means.” —Oscar Wilde Daniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest.", "text": "Non-Fiction\nAnother Word: Endings\nEndings are hard.\nThere are a lot of reasons for that. First off, figuring out just technically how to stick an ending is nearly the last thing that a writer has to figure out. All the other stuff—writing a good sentence, writing a good scene, the tricky bit with adverbs, avoiding infodumps, celebrating infodumps, being confused about infodumps, all of it—is complicated enough to fill a lifetime. And since even rock-solid structure won’t save you if the prose bounces people off in the first couple pages, it’s not a priority. Learn how to write a good hook, and you at least get the chance to whiff the ending. With a crap hook, no one gets to the middle, much less the end.\nMore than that, errors that are hard to see at the beginning often show up at the ending. Brilliant short story writer Jim van Pelt once told me that whenever someone said there was a problem with the end of his story, it meant there was a problem with the setup of his story.\nIf some sense of the character didn’t quite land in the third scene, the place you’ll know it is at the end. If the pacing in the middle wasn’t right, you’ll know it at the end. Not because the end itself is particularly good or bad in its own right, but because once the last paragraph is read and the dream of the story ends, that’s the time when as a reader, you can reflect on the whole experience of the story. Did it work, did it not? Are you moved, are you satisfied, are you bored? In that moment of evaluation, all the flaws and failings appear, even if you don’t know exactly what they were.\nBut that’s not the only reason endings are hard.\nEven the most successful ending to a story carries a sense of loss. As a reader, we’ve been deep in this other place with characters and moments that enthralled us and with every new moment, every revelation, every turned page, the distance to the back cover grows thinner. Until you run out of words, and the story’s done, can you then evaluate what happened. The worst case scenario is relief. At least that damned book’s done and you can go on to something that’ll clear it out of your head. But if it worked, there’s a satisfaction and regret. We’ll miss those characters. Those places. Even if we feel satisfied and full, something we enjoyed is gone now. Maybe we start the reread right then to get it back, or download the second volume of the series onto our e-book reader right there in bed. Something to prolong the experience, to make the ending not an ending, because endings are hard.\nWhen I was about ten, I read the Narnia books. They hit at pretty much exactly the right time for me, because I fell through them one after another right up until The Last Battle. Which I’ve never read. I wasn’t ready for the story to be over, and so I stopped. As long as I didn’t read that one last book, the story would never end.\nAnd, over the last few decades, the kid who read those books has turned into just me, so even if I do sit down with it now, it won’t be the same thing it would have been then. That story was saved from ending because I wasn’t ready to let the sense of possibility go. But that’s only part of why endings are hard.\nEndings are hard because people die. I’ve been lucky so far, but that’s just timing and we all know it. Grandma Garner, whose house I stayed every Friday night from when I was five until I was maybe fourteen, is dead. Grandpa Garner died while I was at the house with him. Jay Lake is gone, and he was a friend. Eugie Foster is gone. Graham Joyce. My parents are still alive. My wife is still alive. My daughter is. They’re all going to go, myself as well. And we don’t even know the order.\nMargaret Atwood says it in her short story or maybe essay “Happy Endings.” “The only authentic ending is the one provided here: John and Mary die, John and Mary die, John and Mary die.” It’s something we all know and we all struggle with and we all dread. The melancholy of ending a brilliant story isn’t that different from the melancholy of remembering that kid who was scarfing down C. S Lewis until his nerve failed him. He’s gone now. The room he lived in isn’t the same space it was. The loves and fears he had don’t apply. The inevitability of the past, of all these things moving into the past, makes an ending—an authentic, powerful, successful ending also a presentiment of death. Every closed book is also a memento mori. But that’s not the only reason endings are hard. The biggest reason—the most important reason I think, that endings are hard is that we’re trained off them.\nI am profoundly grateful to live in a secular society. I just want to get that out up front. I love living someplace where people can worship God differently, have different views of the essential nature of the universe, debate science and poetry and art, and where all of that can be part of a larger, richer secular culture that has the potential to celebrate the whole range of humanity. Way better than theocracy every time. Not saying it makes everything perfect. Not saying it’s without blemishes.\nFor instance, the news.\nNews is the privileged narrative of a secular society. It defines what information is important -- what stories matter. Turning away from the news in a modern secular culture is as weird and isolating and rebellious as not going to church would have been in more religious times. It is where we turn to know what matters: that is its role and its justification. And here’s the thing. It doesn’t do endings.\nMalaysian Airlines Flight 370 went missing in March of 2014, and for months was the main story at CNN. People speculated that it had been taken by terrorists as part of some larger scheme, or that it had been downed as a suicide by one of the pilots, or failed because of a bizarre confluence of equipment failure and human error. Or abducted by aliens. Whatever the details of the particular analysis, simply by being in the headlines, the subtext we all got was the same: this is important. And then . . . no resolution came. Like reading a novel with an amazing first chapter that sagged into nothing in the middle, the story didn’t resolve. It was interrupted by other things which were by their presence clearly more important. More recently ISIS and Ebola followed the same pattern. The issues were headline news until they were interrupted by snow storms and the collapse of Bill Cosby and whatever great hook of a story comes next. Our central cultural narrative is desperately empty of resolutions. Instead, it is one of interruption. Of issues brought up, obsessed over, and then put aside for more pressing matters, forever, eternally.\nEndlessly.\nThat is the world we practice. A world in which resolution is less important than a new hook, in which endings are so optional that when we skip over them—What happened with ISIS? What happened to the guys behind the housing crisis? Where did the missing plane go?—they aren’t even missed. We look back at the unresolved threads of that were so critical to us six months or a year ago with a kind of nostalgia, like “Oh, I remember that. Whatever became of it?” And slowly, over years and decades, we’re trained that endings are optional. That we don’t need them. That they’re hard.\nIf there is something that fiction offers, it’s this: stories end. In fiction, unlike anyplace else, the narrative takes its form, the characters play their parts, and the author brings it all together to the point she intended from the beginning, and by ending, they make a kind of meaning that we don’t get anywhere else. We can experience (even if it’s only in miniature) what it would be like for things— stories, lives—to have meaning.\n“The good ended happily, the bad unhappily. That’s what fiction means.”\n—Oscar Wilde\nDaniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest.", "source": "https://clarkesworldmagazine.com/another_word_12_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Endings by Daniel Abraham"}