{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chen Qiufan; Rebecca Kuang", "hostname": "clarkesworldmagazine.com", "date": "2019-01-19", "categories": "", "tags": "", "fingerprint": "XMuRyGEVOLcOfnCACkB1Y7drQ9M=", "id": null, "license": null, "comments": "", "raw_text": "12690 words, novelette  In This Moment, We Are Happy  Black screen.   BACKGROUND AUDIO  One heartbeat overlaps onto another; the first slow and steady, the second initially faster than the first by two thirds before slowing down. With a nervous energy, the two rhythms intertwine, their timbres cooling and turning mechanical, weaving into a grander, more complex electronic soundscape.  CAPTION  In spring 2015, the new Visual Anthropology program at Peking University’s Institute of Humanities and Social Sciences required students to submit small group projects to complete their studies.  By the end of the summer term in 2016, eight projects were submitted. “New Newborn,” by Xu Xinyue, Yuan Xiao, Ibanca Singh (foreign exchange student), and Sebastian Schwarz (foreign exchange student) earned the highest marks in the class and was short-listed for Best Documentary in that year’s university film festival.  “New Newborn” explores the ways that technology transforms the process of human reproduction, as well as the issue’s complex background. The Visual Anthropology program retained it as a long-term installation. As of August 2040, the project has collected over 300 hours of interview footage involving subjects from all over the world, and covers a period of 25 years—precisely the average length of a human generation.  This film was edited and produced using some of the project’s source materials. It was authorized by the interview subjects and the filming teams. Some of the sounds and images required postproduction processing.  Fade to black.   NARRATOR (O.S.)  What made you decide to have a child?  WU YINGMIAN  Age: 37  Location: Guangdong-Hong Kong-Macau Greater Bay Area, China  Occupation: Entrepreneur  It’s quite a natural desire to have as a woman. You can feel your body urging you, like it’s trying to tell you that it’s time. What’s more, your entire environment, including the people around you, expects you to have a child. After thousands of years, our society still treats women the same . . .  KENJI OHNO, AKA K.O  Age: 33  Location: Boston, United States  Occupation: Multimedia Artist  The way I see it, it’s an experience. I know what people are going to say—oh, K.O. is trolling for publicity, just as usual.  I don’t give a ****. The media are always blathering nonsense about being PC, but they never care about being ****ing PC when they’re talking about me. I believe that what I’m taking up is perhaps the greatest feat of the century. It’ll be many years before the world properly understands its significance. I’ll wait for that day.  HANNA & FATIMA KÜHN  Ages: 32 and 28  Location: Berlin, Germany  Occupations: Film Studies Professor and Photographer Hanna: It’s very simple. I love Fatima. She loves me. We want to leave something behind on this earth—some witness to our relationship. Storage mediums like celluloid film and magnetic discs will all become obsolete. But life doesn’t become obsolete. Life goes on by itself.  Fatima: That sounds a bit selfish . . . [Smiles] but that’s just the way it is. This child will belong completely to the two of us. They won’t be tainted by any third parties, you know what I mean? [Smiles again] I don’t mean to offend anyone when I say “third party.”  NEHA SRIVASTAVA  Age: 22  Location: Gujarat, India  Occupation: Surrogate Mother  The first time I got pregnant, I was sixteen. I was terrified. I asked Rajan what we should do. He wasn’t much older than I was back then. All he did was wobble his head and say, “Well, we might as well have it.”  So we got married, and I gave birth to Vishal. A year later, we had Seema. I said that was enough, we wouldn’t have enough to eat. But Rajan said it was no problem, that he could just pick up some extra shifts. But we still couldn’t pay our bills. Our children were eating more and more every day, and they were going to start school soon.  My friend Mehak told me that Akanksha Hospital was looking for young, healthy women, so I came here. My profession is giving birth. This is the third surrogate child I’ve carried for a client.  MOW45  Age: Undisclosed  Location: Somewhere in Indochina  Occupation: SHIIVA Lab Liaison  Huh. I’ve always found this question quite curious. There’s a saying that humans are no more than slaves to their DNA. Every single one of our thoughts and actions are procedures already predetermined by genes, and the process’ ultimate goal is to disseminate the information stored by genes as far and wide as possible. The human body is like an ineffective Enigma Machine. Its rotors often make mistakes, and I suspect that the final receiver might not be able to read the initial message. But until then, we’ll just have to keep playing this clumsy game of telephone, except with a different set of rules.  Fade to black.  CAPTION  PART ONE  Wu Yingmian sits in the back of a seven-seater minivan, taking an endless series of phone calls. The car speeds past a forest of mirrored buildings, reflected in the window against her gaunt profile.  The camera follows Wu as she steps out of the car and enters an office building. As she rides up the elevator, several people bow and greet her when they see her. She responds with a slight nod.  Through the glass conference room wall, we see Wu sitting in a meeting. She speaks up every now and then. When agitated, she strides through the stereoscopic projections and pounds the table at the center of the room. The data visualizations twist and distort against her body.  Cut to Wu examining documents in her office. Behind her stretches a full-length French window, through which the entire city skyline is visible, including the distant Shenzhen Bay. At last, Wu signs the last document left on the table, gently exhales, and wraps her fingers around a cup of tea long gone cold.   WU YINGMIAN  I’m a workaholic. Must have gotten it from my father. [Smiles] I can’t help it. We learn from our parents; my whole family is like this. What would you do in my position? If thousands of people relied on you to feed their families? [Picks up a family photo from the desk] It’s not like I haven’t thought about getting pregnant myself. I’ve tried everything. But it’s just not in my cards.  Also, my father has some . . . psychological issues. [The photo displays Wu’s mother and father in their youth] My mother had a massive hemorrhage giving birth to me. But she risked her life to have me because the Wu clan had to have an heir. My father has never completely gotten over the trauma. He doesn’t want me to . . . [Stops abruptly] A web page appears on Wu’s computer screen, displaying neatly arranged rows of photographs of women of various skin tones. Clicking on a photo reveals that woman’s background information, including her age, birthplace, health status, education, DNA testing results, reproductive history, and hobbies and interests. Clicking on the disclosure arrow below that woman’s photo reveals her family history up to three previous generations.   WU YINGMIAN  A lot of mothers in the chat group said it’s better to pick a white surrogate. I think that’s pretty clearly racist. [As she speaks, the camera pans over headshots of surrogate mothers] The service we’re using employs only the best surrogates. At this level, racial differences don’t matter. Personally, I prefer Asians, or even South Asians.  NARRATOR (O.S.)  What does your husband think?  On the desk sits a photograph of Wu and her husband, whose face has been blurred out.   WU YINGMIAN  Oh, him? All he had to do was contribute a few milliliters of fluid, and now he gets to have an opinion? You have no idea how painful egg extraction is. Of course, I get the final say. Will I go to meet the surrogate mother in person? I’ll have to think about that . . . [Glances out the window] Scene change. Under a hot tropical sun, taxicabs speed along a red dirt road, kicking up large clouds of dust at weary pedestrians. The camera follows Neha down the road. She comments on her surroundings as she walks. Curious children wander into the frame every once in a while, tossing toothy grins at the camera.   NEHA SRIVASTAVA  We used to live in a hut like that. [The camera pans over makeshift shacks of canvas propped up by metal tubes] A lot of surrogate mothers have to live here and wait if they aren’t chosen, or if they don’t conceive. Our whole family has moved into a new, proper house now. I’ve been lucky, thank the gods.  NARRATOR (O.S.)  How much do you get paid?  NEHA SRIVASTAVA  . . . After the agency fee, I get about $6000 American dollars. Hey, that’s more than what Rajan makes in several years.  Several of Neha’s acquaintances come over to congratulate her, their eyes filled with envious admiration.  Scene change. Neha walks into a pale beige building. The sign on the door indicates this is one of Akanksha Hospital’s surrogate mother residences. A nurse helps Neha into a hospital bed. The room, which is about thirty square meters large, holds eight beds. Three are empty. All surrogate mothers who successfully conceive must move into this residence. The nurse begins to examine Neha.   NEHA SRIVASTAVA  I had to do heavy manual labor when I was pregnant with Vishal and Seema. I wasn’t eating well, either. Nobody cared then. It’s much better here. [Smiles] The nurse gives Neha an injection, then prepares a nutritious meal for her. Neha, who has been through this process three times before, appears relaxed and at ease.  NARRATOR (O.S.)  How long do you need to take these injections for?  NEHA SRIVASTAVA  I’ve never kept track before. In any case, I know I have to keep doing them for a long time . . .  NURSE  These are progesterone injections. We do seventy-five days of injections. The hormone thickens the endometrium and inhibits uterine movement. After implantation, the placenta develops, which . . .  NEHA SRIVASTAVA  I know, I know. It’s all to protect that precious little thing. It’s the company’s property. [Smiles] NARRATOR (O.S.)  Do you find all this difficult?  NEHA SRIVASTAVA  I don’t find the procedure itself difficult. What’s difficult is the way people see me because of it. Rajan was furious at first. He thought that I was committing sacrilege, that this was an unclean act. But I told him that some of those client parents had lost their only child, or couldn’t conceive on their own due to medical reasons. We’re doing a good deed here. The gods will forgive us. Gradually, he came around. What’s more, we’re living in a new house now, and our children are attending good schools. Everyone’s happy, no?  NARRATOR (O.S.)  Do you ever meet the parents?  NEHA SRIVASTAVA  Unless they make specific requests, we have minimal contact and conduct interviews through video. After the child is born, they take it away half an hour after verification. That’s what the contract stipulates . . .  NARRATOR (O.S.)  Do you ever want to see those children again?  NEHA SRIVASTAVA  I . . . [Smiles uncomfortably] I haven’t thought about that . . .  Scene change. Wu is in the gym, sweating on an elliptical machine while watching a video program with wireless earphones. In her tight athletic bodysuit, she hardly looks like someone about to turn forty.   CAPTION  The surrogate agency declined our request for filming.  WU YINGMIAN  Don’t they say that in the future, people might live until they’re 200 years old? [Smiles] Looking youthful and energetic is an asset in the workplace. More and more people are going to choose to freeze their eggs or to use surrogates in the future. Job competition is so fierce right now that when you come back from maternity leave, there’s nothing left for you. Before, people used to hide their pregnancies—they’d pretend to go on a holiday abroad and come back with a baby. Now the popular option is surrogacy. [Points to a row of young women running in the gym] Look, they’re even more radical. They don’t want to get married at all, they just want babies of their own. Men are like shoes or clothes; you can change them whenever you want. [Smiles] Wu is watching an animated film produced by the surrogacy agency. A cartoonish figure explains the entire process.   CARTOON  The preparation period requires 20 days of oral contraceptives, followed by 10 days of suppressor injections in order to prevent the premature loss of eggs.  Before ovulation, you must undergo blood tests to check estrogen levels every day, take a monitoring test every 2-3 days, and inject three different shots every night to stimulate egg maturation. During egg extraction, a needle-shaped pipette the length of an A4 sheet of paper will be inserted through your vagina until it reaches the ovaries. The doctor will monitor the position of the pipette using a B-mode ultrasound. Once they locate the follicles, they can extract around 10 eggs at a time. Meanwhile, the surrogate mother will need regular injections to regulate her estrogen levels. The male donor will contribute his semen at the same time. The eggs will be fertilized in vitro for 2-6 hours until they become embryos. After a certain period of time, they can be implanted into the uterus of the surrogate mother.  In order to increase the chances of success, three to four embryos will be implanted into the surrogate’s womb simultaneously. Their development will then be monitored.  WU YINGMIAN  I think they should replace that cartoon woman with a mother hen. [Smiles] Hens are egg factories, right? I’ve heard that I’ll end up with fifty or sixty needle scars all over my body, not to mention all the other possible complications. I’m really paying to suffer. Ah, age thirty-seven is the limit. No matter how high tech you get, it’s still easier to be a man. “The male donor will contribute his semen at the same time . . . ” Once simple sentence. That’s all there is to it. I’ve heard of some wealthy families who pay for several surrogates at once and buy eggs from Ivy League students. That’s simpler than the ancient custom of taking concubines. You don’t have to worry about the harem squabbling over family property.  Wu Yingmian finishes her workout and leaves the sweaty gym.  Scene change. Wu Yingmian drives home. She takes a phone call on the road. She appears to get into a heated argument with the person on the other end.   TEXT ON SCREEN  At Wu’s request, we did not record the call.  After hanging up, Wu remains silent for the rest of the drive. Her car pulls up to a town house tucked away behind a tropical garden. A poodle rushes out to greet her. The house interior is decorated in a typical Mediterranean style. Wu’s husband is away on a business trip. She quickly eats a meal prepared by her staff, then retreats to her office to review a thick stack of contracts.   WU YINGMIAN  Six contracts in total, and all in English. I had to hire specialists to translate them into Chinese. My lawyers have already added their comments. Look, this agreement is with the surrogacy center, this one is with the reproductive center, this one is with the surrogate agency, this one is with the surrogate mother herself, and this is with the capital supervisor . . . Oh, and this one is with the representing attorney. All these companies are based in different jurisdictions, and they have different laws and regulations that I have to research. I can’t get sloppy about anything here. I’ve heard of so many drawn-out surrogacy lawsuits.  NARRATOR (O.S.)  What kind of lawsuits?  WU YINGMIAN  A few years ago, for example, a Japanese couple hired a surrogate mother from India to carry their child. But they divorced before the child was born. The biological mother didn’t want her child anymore, and the father had no legal rights to it. But the baby wasn’t Indian, so the poor thing was left with undetermined status.  NARRATOR (O.S.)  What issues are you most afraid of?  WU YINGMIAN  [Thinks for a moment] What happens if the sperm donor wants to contest custody rights? What if the surrogate mother wants to keep the child? What if she wants to maintain a relationship with the child? What if the local laws protect the surrogate mother’s rights? I just want a child that belongs completely to me. I don’t want them to run into any sorts of complications because of their origin. So I need to specify these conditions very clearly in these contracts.  NARRATOR (O.S.)  In your opinion, is the surrogate mother just as much a mother as you? After all—  WU YINGMIAN  I know what you’re trying to say. I wouldn’t use such a crude term as “uterus-for-hire.” We’re all women, after all. But we stand in different positions vis-à-vis this contract. Science has turned natural reproduction into an engineering project, and we ought to comply with the rules. Everyone should perform their own role well. You want fame, you want money, and you also want a child. Where on earth would you get such a good deal?  Wu stops, lowers her head, and turns another page in the contract. Suddenly, she seems to be whispering to herself.   WU YINGMIAN  That’s why I don’t want to meet her. I think I’ll go soft, I won’t be able to stand it . . .  Scene change. We are inside the surrogate mother’s residence. A group of surrogate mothers, with bellies large and small, all dressed up with heads wrapped in saris, are seated in a circle. A sumptuous feast has been laid out in the center of the circle—naan, meat and vegetable curries, lassi, and masala chai. The women sing songs of prayer to bring blessings on the woman in the middle, whose belly is the largest and roundest.   CAPTION  Every time a surrogate mother is about to give birth, the women in the residence throw a big party like this to bless the baby about to be born—a baby that grows in the mother’s belly, but does not belong to her.  NEHA SRIVASTAVA (O.S.)  I’ve been to a lot of these baby showers. Everyone is always in such a good mood at the start, eating and drinking, singing and dancing. But everyone falls silent by the end. We all know that once the child is born, we’ll only get to hold them for less than an hour. We tell ourselves that it’s someone else’s baby. But they still grew inside us for nine months. Our blood flows through their veins; they’re a part of us.  It’s so hard to describe this feeling. It’s like your heart has been hollowed out, and all you’re left with is an empty sack.  The expecting mother begins to cry. The other surrogate mothers put their hands on her shoulders, comforting her. But their own eyes are red as well. Neha hugs the other mothers, then turns her head to the side, as though thinking about something.  Scene change. The camera follows Neha into a busy street, where the pedestrians toss her curious glances. Neha steps into a meadow of knee-high vetiver grass. Gently, she strokes the stiff, saw-toothed grass heads while humming a wordless tune under her breath.   NEHA SRIVASTAVA (O.S.)  Whenever I sing this song, I can feel the baby moving very strongly, like a fish swimming in my belly. I think it must really like this song, so I try to sing it while I still can.  Neha approaches the bank of a small stream and carefully sits down on the grass. She dips her hands into the water. Close-up, her hands, running through the clear, glistening water, appear covered in many little scars.  NEHA SRIVASTAVA (O.S.)  When the baby is born, I want to place a red bindi on its forehead according to tradition. I also want to tie threads on its wrists, ankles, and neck. This wards against evil spirits and bad luck and protects their living energy. I have to do this. I want them to grow up strong and healthy, just like my own children.  NARRATOR (O.S.)  What will you do if the biological parents object?  NEHA SRIVASTAVA  [Brief silence] They don’t know anything! They don’t understand at all!  Those rich people think that babies are like pets. They think it’s like buying a kitten or puppy at the store—that they can just hand over the cash and leave with a cage. I nearly died the first time I carried someone else’s child. They put triplets in me. In India, you can even implant quintuplets if you’re willing to pay. Sometimes, they implant two just so they can keep the boy and kill the girl!  Is this how a civilized society behaves? I really don’t know.  A lot of surrogate mothers end up aborting their babies right before they’re born, just because their clients change their minds or get divorced. Sometimes those girls die in the process. If that isn’t murder, I don’t know what is.  Neha lapses into silence. The sound of splashing water comes from nearby—a few boys have jumped from the back of a water buffalo into the stream and are dashing water at each other. The suspended droplets form a faint rainbow in the air.   NEHA SRIVASTAVA  After I gave birth to my first surrogate baby, I swore I’d never do it again. But I ended up doing it a second time, and then a third. I thought I would get used to it. I thought I’d stop feeling anything at all. But it’s not like that.  I still feel the baby’s heart beating, as if it’s talking to my own heartbeat.  Because of the baby, sometimes I still feel happy for no reason. Or I’ll get mad, or I’ll weep. You realize there’s a little life inside your body that knows about everything you do, and feels everything you feel. Though you don’t know how much it can feel, you know you can feel it, and you know it can feel you.  It’s such a strange, wonderful feeling. It doesn’t matter at all whether the life inside you truly belongs to you or not. You’ve already been bound together. Can you understand that feeling? [Looks tearfully at the camera] Scene change. Wu Yingmian sits at her desk in the study, contract documents scattered before her. She rubs at her red eyes. She walks out to the balcony and looks out over the city, which shines like an ocean of stars. Lighting a cigarette, she takes a deep drag and exhales forcefully, breathing out wisps of white smoke that dissipate into nothing before they can take shape.   WU YINGMIAN (O.S.)  I haven’t slept at all these past few days. I’m worried about the quality of the eggs and about the extraction process. And I’m hearing too many terrifying stories—my heart can’t calm down. Even when I’m half asleep, I can’t stop thinking about those poor women, and those poor dead children.  When would you say an embryo has developed enough to count as a person? When do they have the capacity for perception? Self-awareness? I can’t dwell on this too much, or I’ll lose my mind. What kind of sin have I committed . . . ?  Cut to a close-up of Neha. The rippling water reflects on her face, its bright twinkles dancing in her eyes.   NEHA SRIVASTAVA (O.S.)  I often dream about those children.  In my dreams they’ve already grown so big. I see their faces, white or Asian.  I call them by the names I chose for them, but they don’t answer me.  I call and call until my voice is hoarse, but they never respond. It’s only when I hum that song . . .  A burst of cheering causes Neha to lift her eyebrows in surprise. The boys have climbed ashore and put their clothes back on. One of the older boys conjures up a Kanjira drum, skillfully sprinkles a few droplets of water onto the snakeskin wrap, then begins beating out a rhythmic pattern far richer than what the little drum seems capable of.  Neha smiles. Suddenly she starts to sing along. She sings the song she was humming on the road, but this time she has added lyrics. The boys, delighted, clap their hands along to the beat. They can’t stand still any longer. Slowly they start to shake their legs, twist their hips, and wave their hands in the air as they dance, grinning. Neha stands up to join them. Her steps are cautious, but her limbs and expressions are exceptionally lively, like the countenance of a proud peacock.   NEHA SRIVASTAVA (O.S.)  In my dreams, the children still remember this song. They still remember me.  Every time, I wait for them to call out for me, but that’s when I always wake up. I never get to hear that word . . .  Cut to a close-up of Wu Yingmian.   WU YINGMIAN  I’ve spent all this effort just to hear my child make one sound . . .  Cut to a close-up of Neha.   NEHA SRIVASTAVA  Mama. Yes, Mama.  Black screen.  CAPTION  PART TWO  Kenji Ohno waits at a T stop. On the bottom of the screen, several data graphs are superimposed over his image. The lines rise and fall like ocean waves, representing K.O.’s real-time biometric data. The train arrives at the station. K.O. slings his bag to one side as he enters the crowded train car. Several young people, who have been staring at their phones, see K.O.’s protruding belly and stand up to yield their seats. K.O. thanks them and sits down. Only then do the passengers see his face clearly, and seem unable to stop staring. Finally, he is recognized—a young, fashionably-dressed woman approaches and asks if he is K.O.   KENJI OHNO  Yes, I am.  WOMAN  Sorry if this is a bit rude, but I’ve read all about you in the news—how is it doing?  KENJI OHNO  “It” is a “her.” She’s doing very well, thank you.  WOMAN  How many months along are you now?  KENJI OHNO  Twenty-eight weeks and three days.  WOMAN  Time flies! So how are you going to . . . um . . . give birth?  The biosignal lines begin to fluctuate wildly.   KENJI OHNO  [Smiles] I get it. Everyone’s very concerned about that. I have a few options, but I don’t think this is the best place to discuss them. Why don’t you follow me online to find out?  WOMAN  [Embarrassed] Oh, of course. Sorry, I just meant—I’ll follow you. Wishing you the best!  No one else seems interested in starting a conversation with K.O. He rides the red line to the Kendall/MIT stop. As he walks down the platform, a pedestrian swings the handle on a musical sculpture called Pythagoras, activating a set of mallets, one of which strikes a steel pipe to emit a B minor note.  Scene change. We follow K.O. into the MIT Media Lab extension building designed by Fumihiko Maki. A new material combining synthetic chloroplasts with carbon nanotubes is on display in the main lounge. It looks like a clump of dark green jelly that has congealed into various, bizarre shapes.   KENJI OHNO  [Turns to the camera and smiles] Nicholas Negroponte, Soft Architecture Machines, 1975. Not many people remember that he was originally a professor of architecture.  The camera follows K.O. to the other side of the hall, which displays various inventions representing the history of the Media Lab. These include the Logo “turtle,” the Minsky Arm, the OLPC (One Laptop Per Child) logo, the Kindle, the foldable and ultra-compact CityCar, the holographic 3-D printer, and the Scratch visual programming language designed for children.   KENJI OHNO  So ****ing cool, isn’t it? The people here are an odd bunch. But unlike those theorists who are all talk and no action, the people here believe in “Deploy or Die.” [He points to the slogan on the wall] Scene change. K.O. knocks on an office door before walking in. Dr. Joan-Francois Lemaire, a woman with unkempt, scraggly blond hair who appears to be in her thirties, gets up to greet him.   KENJI OHNO  Joan is the best. She’s the star student of the famous Hugh Herr, founder of the Biomechatronics Group at MIT. He’s that pioneering madman who built himself two prosthetic legs.  JOAN-FRANCOIS LEMAIRE  Oh come on, I never was that good of a student. Compared to what you’re trying to do, Hugh Herr was a Puritan.  KENJI OHNO  And we are what we’re about to do. Think we got a chance at the Disobedience Award next year?  CAPTION  The MIT Media Lab Disobedience Award was created with funding from LinkedIn founder Reid Hoffman in 2016. It aims to recognize outstanding individuals or teams whose work has had global influence. Its criteria include “responsible, ethical disobedience.” The first prize awarded a dollar amount of $25,000, but the prize money was later increased to $40,000.  JOAN-FRANCOIS LEMAIRE  I think we’d get full marks for disobedience, but on the ethical criterion . . . well, I’m sure there would be some controversy.  Go ahead and lie down. I need to give you a comprehensive examination.  KENJI OHNO  Those stodgy old corpses in their stiff collars should hurry up and ****ing die!  K.O. changes into a loose hospital gown and lies down on the flat white examination bed. Joan slowly scan K.O. with a round device which flashes white and blue lights and emits a quiet electronic buzz as it slides over K.O.’s body.   JOAN-FRANCOIS LEMAIRE  Watch your language. You’re about to be a father.  As the scanner moves over K.O.’s swollen abdomen, a tablet in Joan’s hand displays various data along with a live image of the moving fetus. Joan rotates the image, examining the fetus’ position from different angles.   JOAN-FRANCOIS LEMAIRE  She looks to be doing well. The artificial placenta is working normally. Your oestradiol hormone levels are a bit high. Does everything still feel alright?  KENJI OHNO  Aside from growing this giant set of tits, never sleeping, stuffing myself with food and pills then vomiting everything back out? I’m experiencing some mood swings, but they’re not too extreme. And then there’s the pain—I have to say it, never in my ****ing life have I felt as much pain as this. But everything else feels alright.  JOAN-FRANCOIS LEMAIRE  You chose this. You could have had a boy, or you could have skipped the nervous system integrations. That would all have saved you a lot of pain.  KENJI OHNO  Joan, you know that I want to imitate the natural state of pregnancy as much as possible. In natural pregnancies, you have no way of choosing the infant’s gender. It’s chosen for you. Carrying girls requires higher levels of estradiol, so my mood swings and hormones have been seriously out of whack. But getting back to the point—a chemically castrated K.O. is still K.O., right?  JOAN-FRANCOIS LEMAIRE  Sure, K.O., you’re certainly all man. Even the hormone injections can’t suppress your virility. [Pauses] So, have you really decided? KENJI OHNO  Ah, this again. How many times have I told you? Even if it’s dangerous, I want to simulate the experience of real labor to the greatest extent possible.  Isn’t that the whole point of this project? I’ll be the first man in human history to experience pregnancy from conception to deliverance who wasn’t born with a womb, unlike Thomas Beatie. This signifies so much. So much.  JOAN-FRANCOIS LEMAIRE  [Smiles] That’s not what I was asking about. I was actually wondering—have you chosen a name?  K.O., still lying on the bed, turns his head to shoot Joan a knowing, mysterious grin.  Scene change. A movie clip plays. A character named Alex, played by Arnold Schwarzenegger, lies on an operating table. His huge, swollen belly protrudes from a square hole cut in his blue surgical drape. He is surrounded by four doctors and nurses wielding surgical instruments, preparing to give him a Caesarean section. The camera slowly zooms in on Arnold Schwarzenegger’s face. His expression is strained and nervous. The people around him keep telling him to “breathe, breathe.”   NARRATOR (O.S.)  The history of film includes many examples of pregnant men from around the world. The French-Italian comedy “A Slightly Pregnant Man” came out in 1973, and “Kangaroo Man” was released in Taiwan in 1985. More recent examples include the American comedy “Junior” (1994), the Russian comedy “Pregnant” (2911), and the Chinese fantasy adventure action comedy “Monster Hunt” (2015). [A montage of movie posters and short clips accompanies this explanation] In 2008, performance artist Virgil Wong uploaded a 7-minute long mock documentary to YouTube in which his male friend Lee Mingwei attends a Phase 2 clinical at RYT Hospital-Dwayne Medical Center in New York City and becomes the first man in history to conceive a baby in his own body. This incited a storm of online debates.  HANNA KÜHN  What’s interesting is that all these movies are comedies. It’s as if the only value of this subject is its comedic potential.  My point is, when have you ever seen a film about two women having a child without a man?  FATIMA KÜHN  Hold on, don’t forget about “Wonder Woman!” [Laughs] Scene change. Fatima sits in a filming studio with bright, white walls. She wears a white athletic jumpsuit and neon yellow sneakers. As she directs the lighting man to adjust the light source, her shadow morphs into various shapes and shades on the ground. At last, satisfied, she orders the crew out of the frame.  The camera pans outwards. Standing before Fatima is not a model nor a celebrity, but simply a table full of meticulously arranged Moroccan food.   FATIMA KÜHN (O.S.)  I’m from Syria. I’m the child of refugees.  When my mother was pregnant with me, she smuggled herself across the Mediterranean, then crossed Greece, Macedonia, Serbia, Hungary, and Austria on foot until she reached Germany. I can’t possibly imagine everything she’s been through. All I know is that she refused to follow her family’s naming convention—that is, adding your father’s name or even his father’s name to yours as a suffix. She told me that my name was Fatima. Just Fatima. She told me I have to live just for myself.  Now I have a new last name. Hanna tells me that in German, “Kühn” means “brave.” I like that.  Scene change. Hanna and Fatima stand holding hands at what appears to be a public event. Suddenly we hear shouting outside the frame. Several projectiles fly through the air at them and splatter against their heads and bodies. The objects turn out to be raw eggs, which drip thick, viscous, translucent liquid down their clothes. Wearily, they wipe the yolk and eggshells away. At this point the camera swivels onto the crowd, where a burly man in a beret is being pinned down by security guards while shouting a stream of obscenities in German.  Scene change. Later that afternoon, Hanna and Fatima sit side by side on their living room sofa.   HANNA KÜHN  That man was shouting that he was going to “stuff pig semen” up all of our “lesbian holes.”  FATIMA KÜHN  This doesn’t even count as that bad. Some of my clients have backed out of our contracts under pressure. We’ve gotten death threats from terrorists. They’re threatening to stone us to death, just like they do in my motherland.  HANNA KÜHN  [Grips Fatima’s hand and looks her in the eyes] We’ll make it through this. The university has made clear that it will support us. The police have also stepped up their security measures. I mean, this is Berlin. Where else would you find such respect for diversity?  FATIMA KÜHN  [Gently caresses her belly] I know . . . At first we thought our biggest obstacle would be the technology. Now we’ve realized that our biggest obstacle is other people . . .  HANNA KÜHN  Think about it this way. The first time people saw a freight train on a movie screen, they were so frightened they ran out of the theater. Society’s opinions always lag behind technological developments. I just hope that our daughter grows up in a more tolerant world.  FATIMA KÜHN  To be honest, I’m not as optimistic.  Scene change. The narrator, off-screen, conducts interviews with strangers on the street.   INTERVIEWEE 1  [Elderly, male, wearing tortoiseshell glasses and a windbreaker, carrying a leather suitcase] Huh . . . well, here’s my opinion. God created men and women so they could love one another and produce future generations. Now you’re telling me that men aren’t necessary anymore? That women can conceive children with other women? Well, I believe that’s . . . that’s just sacrilege.  INTERVIEWEE 2  [Young, male, short-haired, eating a hamburger, eyes glued to phone screen] Ha! I knew this day would come sooner or later. Time to discuss the “men are useless” theory.  You say this is about science, so let’s discuss this from a scientific perspective. Men don’t just contribute sperm and Y chromosomes, we also contribute to genetic diversity. If a woman decides to make clones from her own cells, then her subsequent generations will progressively become weaker, like an echo growing fainter with each bounce. All of her recessive genetic flaws will surface until the whole system falls apart.  Oh? You’re saying that both women are contributing genetic material? Well, that’s something else entirely . . .  INTERVIEWEE 3  [A short-haired, middle-aged woman wearing professional attire and riding a bicycle] If bees, lizards, and sharks can do it, why can’t humans? I mean, we’re all the product of natural evolution.  I read in the news that the Y chromosome degenerates at a rate of ten genes every one million years. So eventually there will come a day when men go extinct, right? Why not start getting used to it now? Humanity needs some way to continue on.  No, I don’t hate men. There are times when I need them in my life, too.  I just don’t think there’s anything wrong with two women having a child on their own. You know, there are plenty of men who are only their children’s fathers in name. [Winks] INTERVIEWEE 4  [A little girl eating ice cream, gazing up at the camera in mild confusion] You mean like all the Disney princesses in a crossover together? Snow White and Mulan could live together and adopt Tiger Lily as their daughter, and they could have a little bunny rabbit named Judy, and they could have new dresses to wear every day . . .  Scene change. The Kühns sit on their living room sofa.   HANNA KÜHN  Let’s approach this from a historical perspective. Did you know that Aristotle actually believed semen came from the spinal cord? That’s why I believe that in ten years, society won’t view us with the prejudices they hold now.  FATIMA KÜHN  [Watching Hanna] I just hope that we live to see that day. When I was six, I enrolled in a neighborhood school under Germany’s “refugee integration” policy. Of course, most of the teachers, parents, and other children were quite friendly. But still, even such a beautiful Easter egg had its cracks. A glance, a careless joke, a word emphasized just so . . . such trivial everyday acts would be magnified a thousand times in the minds of people like me. I’m always torturing myself wondering—are they mocking me? Do they look down on me? How can I blend in better with them? I’d rather keep my daughter at home and only let her interact with AIs than let her bear that kind of burden. At least then I could control their conversation settings: 75% German humor.  HANNA KÜHN  [Stroking Fatima’s hair] Take it easy, Fati. Breathe. She’s probably listening to everything from inside your belly. [Smiles] I agree that everything you’re saying is objectively true, but I also believe that one’s family environment can make a powerful difference. Look at what you’re like now—you’re no different from any person of German heritage. You might be even happier and more accomplished . . . [The sound of a window shattering comes from the kitchen] Oh, heavens. Stay here. Don’t move, I’ll go take a look. These assholes—  The camera follows Hanna as she runs into the kitchen. Broken window shards cover the floor, among which lies a paper-wrapped parcel shaped like a pipe bomb. Outside, a car engine roars as the assailants speed away.   HANNA KÜHN  Get back! Get back! Call the police!  Fatima covers her mouth in horror.  Scene change. The police bomb disposal team has arrived and cordoned off the house with barricade tape. A surveillance monitor displays the camera view of a tracked bomb disposal robot, which rolls shakily past the sofa where Fatima and Hanna were just sitting. Once the robot reaches the suspected bomb, its two arms appear in the camera view and carefully cut the electrical cords wrapped around the package. Everyone watches nervously as the robot unwraps the paper. Hannah hugs Fatima tightly. Fatima, who seems to be whispering something to herself, strokes her belly. Now and then she wipes tears from her cheeks.  The robot opens the parcel to reveal a metal dildo inside. Large letters are scribbled across the wrapping paper: “BENUTZE DAS” [Caption note: Translation: “USE THIS”] Scene change. Nighttime. K.O. lies propped up on one arm in his studio. A pile of nutritious foods and medications are scattered across the table in front of him.   NARRATOR (O.S.)  Are you sure we can film this?  KENJI OHNO  I’ve already informed the other party that this is also a part of my project. Besides, you’ll show me before the final cut, of course? [Grins] Every industry has its own interpretation of the rules. You know that.  Fifteen minutes past the scheduled time, K.O. enters into a video conference with Scott Anderson, director of Netflix’s live broadcast content, who is calling in from Netflix’s general headquarters in Los Gatos, California. Scott’s face shows up as a projection on K.O.’s wall.   KENJI OHNO  Scott, darling! How have you been? So sorry I’m late—I didn’t expect my previous meeting to go over so long. It was impossible to get through to those sons of bitches.  SCOTT ANDERSON  [He appears about thirty years old, dressed in business casual attire. He speaks with astonishing rapidity] No worries. Wow, K.O.! You look great!  KENJI OHNO  Thank God for that—and science, of course. [Grins] Let’s get straight to the point. I know Netflix wants the exclusive rights to broadcast the delivery. But you must know already that this is like the prime advertising spot for Black Friday. Everyone wants these rights. So tell me, what are your best terms?  The audio temporarily cuts out. All we can see are the two parties in rapid conversation.   KENJI OHNO  Okay. I’ve got no problem with these financials. What about the rating? I want as many people to subscribe as possible, so is there any way we can get around that MA rating?  SCOTT ANDERSON  I understand, I really do. But first, this isn’t up to us—there’s no way to get around the FCC’s AI censorship program. Second, at this point, we still don’t know what will actually occur during your delivery. Could you describe it in detail for us? Then we can have our legal department assess the risks.  K.O. drags a data file from his tablet onto the big screen, which opens into a cartoon anatomical model of the human body.   KENJI OHNO  You asked for it. Prepare yourself, Scotty.  What kind of magic did I use to get pregnant? Ding ding ding! Joan and her team were inspired by ectopic pregnancies. To women, ectopic pregnancies are life-threatening and require complete termination. But to me, it was the only path forward.  Joan’s team used biological nanomaterials to construct an artificial womb inside my abdominal cavity, as well as an artificial placenta attached to my mesentery for reinforcement. My hip bones weren’t strong enough to support the implanted organs, so I had surgery to insert stents that could support a rapidly growing baby. Our biggest challenge was reconstructing my abdominal circulatory system to ensure adequate blood supply to the placenta. Then I received injections of artificial amniotic fluid, got the embryo implanted, went through compounded hormone therapy, took antirejection medication, and all the rest of that good stuff . . . Oh, I almost forgot, I also asked them to do a nerve graft for me. That really ****ing hurt. It hurt ten thousand times worse than being kicked in the balls.  SCOTT ANDERSON  [Eyes wide, hand covering his mouth] Good lord, that’s unbelievable. This . . . is really insane.  KENJI OHNO  Ha! That was just foreplay.  The compounded hormone therapy has messed so much with my body that I’m not properly male nor female. I’ve completely lost my ability to have sex—hopefully, that’s not permanent. And there are an infinite number of ways that I could have died during this process—I could have had a heart attack, suffered an internal hemorrhage, gotten an infection, developed a blood clot, ruptured my intestines—pretty much everything you can think of. Not to mention all the side effects of the medications I’ve been taking, or the mood swings caused by my messed-up hormones. For the first time in my life, I’ve realized that being a mother is incredibly hard.  But here’s what I’m trying to get at. We’ve been talking about so-called “gender equality” for decades now. But until you’ve physically experienced what it’s like to be another sex, you can’t really talk about identifying with the other side. You understand.  SCOTT ANDERSON  I absolutely agree. Gender equality shouldn’t just be an empty slogan. So will you go through with the C-section?  KENJI OHNO  That’s the last, and also the most dangerous, hurdle. You media bastards are going to drool all over this.  See, the artificial placenta has now fused with my body tissue. They’ll have to cut into my blood vessels to completely remove it, otherwise it could lead to serious, high-risk complications from infection. I could also bleed to death during surgery. If the artificial uterus breaks apart, then the baby’s life will also be at risk.  SCOTT ANDERSON  Are you telling me that there could be an accident during delivery?  KENJI OHNO  I don’t want to exaggerate, but considering my situation, a 50% chance of death is probably conservative.  SCOTT ANDERSON  This . . . Netflix can’t possibly live broadcast someone’s death. We’d be sued into oblivion.  KENJI OHNO  I also wish I could have just evolved a male womb like a leafy sea dragon. But the reality is that after this, I’ll still have to undergo quite a few surgeries to get rid of my nondegradable scaffolds. But let’s get back to the point. Isn’t this exactly what makes the audience want to watch? The 50/50 risk I might die? Who would watch rebroadcasts of games when they already know the winner?  SCOTT ANDERSON  This is far too dangerous. If bleeding were the only problem, we could blur out in real time or tone down the color saturation. But if lives are at risk . . . I’m sorry, but I have to consult with our legal department.  KENJI OHNO  Forgive me for being blunt, but giving birth is already inherently dangerous, regardless of sex.  SCOTT ANDERSON  Forgive me for being blunt—I know you’ve always been a risk-taker, but don’t you think you’ve gone a bit too far this time? If—God forbid—that baby suffers any complications, then that’s a serious breach of ethics. Everyone will think that you killed an innocent child, just for the sake of your own . . . art project.  KENJI OHNO  I get what where you’re coming from. But procreation is already selfish by nature. No one asks permission to have a child. The way I see it, whether it’s for real or for show, having a child will make my life more complete. I’ll give you some time to think about it. Get back to me ASAP. Goodbye!  K.O. exits the video conference. Anderson’s face disappears from the wall. K.O. rubs his belly, staring pensively at empty space. Suddenly he turns toward the camera and waves a hand.   KENJI OHNO  Turn that off. I said, turn it off.  Scene change. Hanna and Fatima, wearing gray jumpsuits, lie with their legs crossing on two elegantly designed slanting ivory chairs inside a bubble-shaped room whose inner walls are made of some kind of milky white, luminescent material. Lying side by side, their heads pointed in opposite directions, they look like an X chromosome floating in midair.   CAPTION  This is Berlin’s Innerspace Mental Health Treatment Center. We obtained permission to film inside the clinic, although some content had to be cut.  The lights dim until the room is dark. A faint, buzzing noise slowly rises in volume. Spots of light begin pulsing along the walls, soft and tender as breathing, shifting in color, and slowly adopting rhythms and shapes to match the sound effects. The lights resemble stars falling and rising across the sky, against which Hanna and Fatima appear only as two dark silhouettes. They both wear a set of white headphones, through which they can only hear the others’ voice when necessary. All of this is programmed to run automatically without any human interference.  Different images appear on the wall before each of them. Their headphones flicker. The therapy session has begun.   HANNA KÜHN  [Her wall displays a slowly revolving blue whirlpool] Hello, I’m Hanna. Yes, this is my first time receiving AI psychological therapy. This is all pretty cool. Makes me think of Professor X . . .  FATIMA KÜHN  [Her wall displays an array of orange splotches resembling a Rorschach inkblot test] Fatima. They told me this kind of treatment could help, so I’m here . . .  HANNA KÜHN  I’ve been suffering nausea, insomnia, recurring stomach pains, nosebleeds, and hormonal fluctuations for about seven weeks . . . no, I’m not pregnant, she’s the one who . . .  FATIMA KÜHN  [Breathes deeply] Nightmares. I have nightmares every night. Yes, I think it has to do with what happened. It’s been a while since . . .  HANNA KÜHN  Couvade Syndrome? I thought that only happened to husbands of pregnant women, like some kind of reverse Oedipus complex . . .  FATIMA KÜHN  I have to think for a moment . . . it was all so confusing, I think someone was chasing me, chasing and running after me . . .  HANNA KÜHN  No, I don’t believe in all that nonsense about “sympathetic pregnancies,” but Fatima wanted to come, so I came with her . . .  FATIMA KÜHN  They want the child in my belly. They want my child . . . [Sobs] they have knives, long and curved knives, shining so bright . . .  HANNA KÜHN  I’m mainly concerned about Fatima. She’s scared to death. All those terrorists, scientists, and media outlets, they just won’t shut up . . .  FATIMA KÜHN  Hanna’s gone. Maybe they’ve killed her. No, how can I tell her? That isn’t even the scariest part . . . They catch me and use their curved knives to cut my belly open . . . oh God . . . [Her breathing quickens] HANNA KÜHN  We’ve been taking our medications as scheduled. All of our fetal examination results have come back normal. I can’t help but say it, I think the root of all of this is the horrible things they’re saying about us in the media. Fatima has always been very sensitive. If you look at her photography . . .  FATIMA KÜHN  Okay, breathe deeply . . . one, two three . . . They’ve cut open my belly, they’ve pulled out what was inside . . . They’re animal bones, they look like bones from some kind of rat or bird or frog hybrid . . . I’m about to collapse . . .  HANNA KÜHN  No, she hasn’t seen it. I was the one who watched the popular science documentary. In the twentieth century, Japanese scientists successfully created female chicken sperm using stem cells collected from bone marrow. In 2004, they used gene editing technology to alter the genomic imprinting of mice cells from female to male, then transferred the altered stem cells into an unchanged immature egg to produce offspring from two female parents. These procedures do carry some risk of hidden genetic defects and hereditary illnesses . . . but I’m really not that worried.  FATIMA KÜHN  Maybe what they’re saying is right. Maybe we’re doing something we shouldn’t be . . . I don’t know. I really don’t know. Sometimes I can sense the baby’s mood. There’s a certain connection between the mother’s mind and the baby’s. You men can’t possibly understand it. Sorry, I’ve started thinking of you as a person again. Oh, could you change the gender of your voice? Um, can you make it a bit gentler?  Oh, much better. Thank you.  HANNA KÜHN  [Her walls display radiates streaks of purple and red] I admit I think I’m a little more rational than Fatima, but that doesn’t mean I can’t empathize.  We’re both this baby’s mother. She’ll be loved by two mothers. Isn’t that better than those so-called traditional families where the father is always missing?  Yes, it was my idea. I believed that technology could help us become who we wanted to be. And I believe this is what Fatima wants, too.  FATIMA KÜHN  We’ve been too selfish. I’m not sure whether this is what our daughter would have wanted.  Do you know what the media has been calling her? “The Purest Girl!” That’s like a porn star name. It makes me want to vomit. It’s like they’ve already decided that she’s going to grow up to become just like us, and choose to procreate only with other women without ever polluting her bloodline with men.  Of course this was never our intention. We did this out of love.  HANNA KÜHN  So what’s the root of our problem, O Wise Machine? In this male-dominated world, must we rely on male technology to produce daughters? Isn’t that absurd?  Will the stress from our environments be too much for us to handle? What are we supposed to do, then? Run?  I’m not going anywhere. I’m staying right here with the woman I love and our child.   FATIMA KÜHN  [Her wall display morphs into silvery-white undulating stripes] I can hear you, Hanna. I’m right here.  These lights are making me think of a story my mother used to tell me. “The Cleft.” An old fable. Of course I’ll tell it to you.  Once upon a time, there was a race of human-walrus hybrids who lived by the sea. They were all female, and they could procreate all on their own. But every once in a while, one of them would give birth to a baby with a penis—a monster. The Clefts killed these monsters by throwing them into a rock fissure blooming with red flowers. But they hadn’t expected that a giant eagle would snatch the babies and leave them on land, where they grew up and became a race called the Squirts . . .  HANNA KÜHN  Are you talking to me, Fatima?  I don’t think these devices are helping us. Can we take these off?  FATIMA KÜHN  The Squirts and the Clefts saw each other as monsters. They went to war and slaughtered and raped each other.  But then the Clefts discovered they could no longer procreate on their own, so they joined together with the Squirts for the sake of children, and later parted, also for the sake of their children. How did it end? To be honest, I don’t really remember. It wasn’t even a real fable. I found out later my mother read the story in a novel by Doris Lessing. Maybe I should pick it up sometime . . . All I remember is that my mother said that the Clefts were so neurotic and warlike because their wombs were empty. Perhaps there’s some truth to that. [Smiles] Hanna pulls off her earphones. Her wall display becomes the same as Fatima’s—a sheet of silvery-white.   HANNA KÜHN  Fati, are you okay? Should we go?  FATIMA KÜHN  A long, long time ago, the Clefts . . . the women . . . the daughters of the moon . . . they sat under a full moon, and told each other the legend of how children first came into this world because of the strong moonlight. They thought that if they sat there long enough, if they stared long enough at the moon, then maybe . . .  Scene change. It is nighttime. We are in a sports bar called The Lunarians, where the patrons have to shout over each other to be heard. The owner stands behind the counter, occasionally glancing up at a TV screen above his head. All sixteen TVs in the bar are set to the same channel.   CAPTION  We were unable to obtain permission to film K.O. on-site during labor, but we found a sports bar that had announced it would stream the entire broadcast.  Gradually, more and more customers notice what is playing on screens. A burly-looking patron who appears to have had a bit too much to drink swaggers toward the owner.   PATRON  Robby! Can we change the channel? Who the **** wants to watch this sissy giving birth?  OWNER  I want to watch. I’ve paid for access, and I’ve advertised online that my bar is streaming this tonight. You’re free to leave.  The patron throws the owner a vulgar hand gesture and heads out the door.   PATRON  Fuck you . . .  Several other customers follow him out the door. The bar turns quiet. The owner turns up the volume on the TVs, and a few customers lift their heads, displaying a variety of expressions.   ANCHOR (O.S.)  . . . The situation has now become very dangerous. The artificial womb has lost its capacity to sustain the baby’s weight, starting a dangerous chain reaction. The placenta has torn away from the mesentery, causing massive internal bleeding. The infant is at risk of oxygen deprivation, and requires immediate surgery . . .  On screen is a close-up of a monstrous abdomen the shape of a deflated balloon. The baby writhes and squirms under a layer of skin, resembling a worm with a disproportionately oversized head. The camera pans upward to K.O.’s face peeking out over sterile blue surgery cloth, looking pale and bloodless. He is clearly in extreme pain; his face drips with sweat, expression contorted in agony, muscles quivering.  Inside The Lunarians, the patrons murmur with disgust.   KENJI OHNO  I’m fine, I’m fine . . . No, I want to stay conscious, otherwise this has all been pointless . . .  The owner pours himself a glass of whisky. He doesn’t add ice. He takes a large gulp, then refills his glass.   ANCHOR (O.S.)  . . . Our survey data indicates that 75.62% of respondents do not approve of artist K.O.’s project. 51.43% of respondents say that they believe his project is a blow against gains achieved by the women’s rights movement over the past fifty years. Another 37.79% of respondents say that they believe this project constitutes a criminal offense, and that both the police and public health authorities ought to intervene. These percentages are climbing as I speak. The FCC complaint hotline has been overwhelmed with callers . . .  KENJI OHNO  . . . Who is singing? I hear someone singing, it’s lovely . . .  . . . I know a lot of people hate me, I know . . . all I wanted was to prove that sex can’t stop anyone . . . from doing anything . . .  The patrons’ hissing grows louder. Someone yells, “Go back to your island, you selfish yellow monkey!” This incites a burst of laughter.   ANCHOR (O.S.)  . . . We are now watching the doctors trying to figure out a strategy for surgery. They seem quite tense. This surgery must be extremely difficult and dangerous.  We are hearing, though this is unconfirmed, that between K.O. and the unborn child, only one can survive.  From a legal perspective, K.O. is both this child’s father and mother. This decision is entirely in his hands.  It seems like the doctors have reached an agreement. They’re walking into the surgery room.  Viewers can continue to participate using the on-screen prompts . . .  The camera pans outwards. The head surgeon appears to be talking very seriously to K.O., whose expression slumps suddenly into a lifeless daze.   ANCHOR (O.S.)  Due to legal reasons, we were unable to broadcast the doctor’s crucial question. What exactly did they discuss?  The doctor leaves K.O.’s side and begins to prepare his surgical equipment.  The owner puts his glass down. The bar has grown terribly silent.  The camera zooms back into a close-up of K.O.   ANCHOR (O.S.)  K.O., can you tell us what’s going on?  K.O. is silent for a long time. Then tears begin sliding down his face.   KENJI OHNO  I choose her. Yes, I am clearheaded and sober.  Promise me—whatever happens, make sure that she survives.  She isn’t my artwork. She’s . . . my daughter.  A clapping noise echoes throughout the bar. The patrons turn their heads, searching for the source of the noise.  The owner, expressionless, continues to clap his hands firmly in slow, steady, and solitary applause.  Fade to black.  CAPTION  PART THREE  We are in a tropical monsoon forest. The camera weaves smoothly at eye level through a crisscrossing web of ficus roots. Kapok tree rhizomes resembling giant octopus tentacles thrust into tiny chinks in the ground, prying open the large stone foundations of some long-lost palace.  The shapes of shadows on the ground indicate this is footage shot from a drone. Occasionally, images of ruined black Buddhist statues come into view, but are quickly blurred out by a mosaic of highly saturated color pixels.   MOW45 (O.S.)  I apologize that we have to conduct this interview in this manner. After the attack on the Panama base, we’ve been very cautious about revealing any information about ourselves. As such, you will be unable to pinpoint any specific geographic coordinates based on the footage we provided. We have permitted you to film this part of the journey to prove that we are not a hoax produced in some video studio. Due to the historically good reputation of your documentary team, we chose you to be the single channel by which SHIIVA Lab will release information to the outside world at this time. You may ask only three questions.  The camera arrives in an open space, where a large pixelated mosaic conceals a building of some kind. A person wearing an ocher-red monk’s cloak stands on the sandy ground. The drone descends to the person’s eye level. Their hooded face has also been blurred out by the pixels, which occasionally reveal a pair of strange, golden eyes.   MOW45  Now come with me. You are about to become the world’s first witness to our project.  The camera follows MOW45 through a dark entrance and switches to low light mode. A mine shaft elevator opens to let them in, closes, and begins to descend. There are no numbers or grates marking the floor levels; the elevator simply moves further and further down. After it stops, MOW45 steps out into a long hallway, passes through a biometric security checkpoint, and enters a room illuminated with ultraviolet light. Inside are two rows of six large, droplet-shaped installations, suspended in midair by a system of exposed cable supports.   MOW45  First question: Who are we?  We know how the rest of the world portrays SHIIVA. They think we are some evil, inhumane, plutocratic organization that abuses technology and violates ethical boundaries. That is completely correct, and completely false. From the historical position of classical humanists, the problems the world faces today are utterly incomprehensible because their solutions require exceeding the moral thresholds they can accept. But to us, those thresholds are but illusions.  You can see for yourself that the human instinct for survival has led a variety of regional responses by so-called civilizations. Many parts of the world have relapsed into tribalism, where humans who still have functional reproductive systems are kept in captivity like livestock. Viable semen there has become priceless. Other parts of the world have barely survived thanks to highly repressive authoritarian governments that have implemented reproductive resource rationing policies that have bred an entirely new privileged class. Europe, for example, has basically collapsed into chaos. Its Christianity-based values and culture are worthless in the face of the great reproductive decline.  We believe that we possess a powerful secret that can save the world. Our leader and founding father, the sage Dr. Jin Changmao, began implementing a global strategy thirty years ago to achieve this goal. SHIIVA Lab is one of the linchpins of his plan.  Now take a look at this.  MOW45 gestures toward one of the semitranslucent, droplet-shaped installations. The outer membrane is made from a polymer material and appears quite flexible. It is filled with a murky liquid whose original color is indiscernible under the violet-tinged light. Inside, bubbles occasionally float to the surface and disappear. MOW45 extends a finger and pokes at the membrane. Little glimmers of light shine through the turbid substance, solidifying into a green, fluorescent glow that gradually reveals the outline of a fetus about seven to eight months in gestation. The fetus seems attracted to the pressure of MOW45’s finger. Though its eyes remain tightly shut, it instinctively waves its hands and feet toward the camera before vanishing back into the liquid.   MOW45  We shifted the peak of chlorophyll’s absorption curve to the left so that it could make use of the higher energy density at the violet end of the spectrum, and then integrated it into the epidermal cells of the P-series embryos. This is just a modest display of our achievements. We will gradually disclose the rest to the world depending on its level of acceptance.  Second question: what do we seek to accomplish? Simply put, we want to find a method of reproduction that does not require the participation of individual human beings.  Twenty years ago, artificial womb technology replaced amniotic fluid with electrolytic solution and used extracorporeal membrane oxygenation to facilitate blood circulation in order to save premature babies. But resistance from all sides has slowed the advancement of this technology. Humanity seems to have an almost pathological fear of this sort of change. Will artificial wombs lower the status of women? Will mothers still form the emotional bonds with their children that they once did during pregnancy? Will this technology cause marital structures to collapse? Will it ossify social hierarchies? Will privileged classes reproduce without limits, or even use advanced genetic engineering to optimize their progeny? Humanity has driven slowly and tentatively to the edge of a cliff, unable to turn back.  But we never stopped moving forward.  MOW45 strides forward, crosses the room, then passes through another hallway into an exhibition room suffused with green light. Four rows of display racks are lined with glass jars containing various fetal samples ranging from fully intact bodies to scattered organs, quite a few of which have developmental deformities. Some are barely recognizable as human.   MOW45  We’ve gone down a long, dark, and winding path.  Using an artificial womb to incubate a fetus is one thing. Directly combining genetic material into a fertilized ovum is something else entirely. The distance between these two feats is like the distance between the Wright brothers’ Flyer and the Apollo 11 shuttle. These jars are the footprints of our past failures. They were, without a doubt, all living beings. But they did not die in vain. Every successful specimen we create bears the mark of these failures, in the same way that humanity bears the accumulated history of its evolution. If anything deserves condemnation, it is the Panama attack, where hundreds of embryos were destroyed in the name of “morality.” Even though those embryos were genetically 100% human, just because they were intended to be brought into the world through a different way, they were seen as alien and thus murdered. And this is what you call civilization.  Meanwhile, we’ve been inundated with requests, mostly from some of the most powerful groups on Earth: extremist sects who want to create physiological distinctions among humans; transhumanists who want to design a race of perfect super-babies; those who want to reserve our services to particular regimes or races so that they may achieve geopolitical dominance through superior reproductive capability. We’ve conducted experiments on a few ideas that seemed interesting, but we have never accepted any of these requests.  MOW45 walks past several specimens, then slows down, gazing at the not-quite-human remnants.   MOW45  To us, these ideas are so typically human they are laughable.  The camera suddenly rises into the air, displaying a birds-eye view of MOW45 as he walks between the shelves of samples. He resembles an evil magician in a dissection room.   MOW45  Perspective matters. The limits of coarse scales—whether in space or time, whether macro or micro—will always lead to crude judgments, leading to disastrous consequences.  For example, in 1978, the first “test-tube” baby conceived through in vitro fertilization was born. In 1987, the Roman Catholic Church denounced surrogate pregnancy as “violating a child’s right to be conceived, carried, and delivered by its biological mother, as well as its right to be raised by its biological parents.” In 2009, after the surrogacy business had been thriving for twenty years, India still had not implemented a single law to regulate the industry. Three years later, it issued crude measures that banned surrogacy for clients who were single mothers or same-sex couples. Next it banned surrogacy for all foreign clients.  Fear of technology has fostered confusion in both thought and action. You are unable to consider the problem from the perspective of humanity’s shared future as a community. Most of the time, you ignore the billions of people living on this earth, all wholly distinct individuals with unique inner lives and needs.  MOW45 abruptly stops walking.   MOW45  Ah, it’s about time. I’ve been asked to reduce the proclamatory style of my rhetoric by about twenty degrees.  We must undergo disinfection now.  The drone follows MOW45 out of the exhibition room and into a disinfection room. White mist spurts from the walls, dissipating through the narrow chamber, gradually condensing into tiny droplets which then evaporate. The door opens. Before the camera appears a marvelous golden pond. MOW45 walks along a path of stepping stones towards the pond’s center as the drone hovers around, recording the surrounding scenery.  This place appears to lie within the ruins of some ancient Buddhist temple. Life-size apsara statues line the walls of the square pond. They are smiling gently, their limbs nimbly arranged in dancers’ poses. The water comes just up to their belly buttons, revealing their finely embellished waists. At the bottom of the pond are forty-nine yoni icons representing female reproductive organs. Each mounted on square pedestals, they are neatly arranged in rows of seven by seven. A lingam protrudes from each yoni icon—forty-nine swollen penises rising up underwater.  The camera returns its focus to MOW45.   MOW45  Lingams are one of many forms of the god Shiva. They’ve been described as the root of all creation. It is said that when Shiva’s lingam manifested on Earth, Brahma transformed into a swan and flew upwards, while god Vishnu transformed into a boar and traveled down; even after a thousand years, neither had reached an end in their journey.  Last question: why now?  Because humanity has run out of options.  We ought to thank science fiction novels and films: “Brave New World,” “Blade Runner,” “The Island,” and so on. Though laughably absurd, they did raise many interesting thought experiments, and have helped us avoid the risk of destruction. We ran calculations on every imaginable option in search for the best solution.  We don’t want this technology to become an accessory to slavery or organ harvesting. At the same time, we refuse to contribute to existing discrimination or new racial conflicts. Many who are wise have realized that this technology can allow humanity to truly discard the heavy bonds of bloodline, family, race, and even ideology. It can lead us into a wholly new era as one unified community.  The neohumans will not have parents. The genetic composition of future generations will be completely determined by algorithms. Machines will draw upon the gene pools of a billion humans as well as all of the possibilities that might arise after thousands of future generations.  The new humans will be stripped of their inefficient capacity for sexual reproduction. Each individual will have the freedom to determine their own sex. Or they may be entirely sexless. These choices will be entirely up to them.  The new humans will no longer bear the responsibility for propagating their own genes. The genetic data of every individual will be stored for the creation of future generations. Everyone will live for themselves, and everyone will live for the whole of humanity.  Death will no longer be a cause for fear. The new humans will view life with a holistic perspective, and understand that death is in fact the only pathway to eternal life.  Of course, we understand that throwing salt into the ocean is not the most effective method for changing the salinity of the sea. Many political regimes have opened their doors to us. They have agreed to grant citizenship rights to the neohumans, and even have created special protective zones for them. But changing the world still remains an enormously difficult task.  After all, birth and ruination, creation and destruction have always been the two faces of Shiva.  We’ve altered our ways of thinking: but perhaps we ought to learn from human experience as well, so that you will be better able to accept us.  Therefore, we’ve chosen some families and individuals from around the world upon which to bestow our gifts. Meanwhile, we’ve opened up applications for more people around the world to join our ranks. We hope we will be able to both change your lives as well as the way the rest of the world sees SHIIVA.  Now, it is time.  MOW45 pulls down his hood. The mosaic of blurred pixels quickly expands to conceal his face, but the camera manages to catch a brief frame of MOW45’s visage—a head that is half-human, half-machine. Slowly he lifts his arms like a magician. The water begins churning in sync to his movements, reflected golden light roiling around the walls and ceiling.   MOW45  If there is one thing on this earth that machines cannot comprehend, then it is . . . well, what humans call love. We hope that you can love these children as much as you love yourselves.  Fade to black.  The music from the opening title begins to play again, a minimalistic electronic tune overlaid on a sample of a strengthening heartbeat.  Neha, head dripping in sweat, softly hums a tune to the baby in her arms. She presses a bindi dot between the baby’s furrowed eyebrows. The baby struggles to open her eyes.   CAPTION  Aanadi was born 19:02 local time on February 3, 2016. Her name means “always happy.”  Wu Yingmian stands by the bedside, watching her newly-delivered baby in her surrogate mother’s arms. She grips the surrogate mother’s shoulders, her eyes glistening with tears.   CAPTION  Wu Yingmian’s baby was born 16:37 local time on July 12, 2021. She requested we keep her child’s name private.  A baby girl covered in blood is lifted to K.O.’s face. He manages to murmur only the words, “You are so beautiful,” before losing consciousness.   CAPTION  Sakurado Ohno was born 01:12 local time on April 24, 2027. Doctors were unable to save Kenji Ohno, who died at 4:45 on the same day from excessive blood loss.  Fatima, gently rocking her baby in her arms, croons, “Hey, I’m your Mommy.” She hands her daughter to Hanna. “And this is also Mommy.”   CAPTION  Anna “Mondschein” Kühn was born 6:21 local time on November 29, 2031. “Mondschein” means “moonlight” in German.  MOW45 raises both hands into the air. The forty-nine lingams rise from the water, slowly splitting open like lotus flowers in blossom, each one revealing a pink, wet infant at its center. Suddenly, the infants begin crying in unison, as if by command. They sob in fits and starts as petal-shaped mechanical arms snip their umbilical cords, coughing out the excess amniotic fluid from their lungs. Their cries then rise in volume like a well-rehearsed symphony, overlaid on the sound of a beating heart and an electronic rhythm.   CAPTION  Forty-nine neohumans were born local time 8:08 on August 8, 2038. They are collectively known as the “gift generation.” Among them, only a third survived under the care of adoptive parents. These survivors altered the course of human history.  Black screen.   TITLE  In This Moment, We Are Happy: A Documentary    Originally published in Chinese in Dandu Reading 19, January 2019.  Translated and published in partnership with Storycom.  Chen Qiufan was born in 1981, in Shantou, China. (In accordance with Chinese custom, Mr. Chen's surname is written first. He sometimes uses the English name Stanley Chan.) He is a graduate of Peking University and published his first short story in 1997 in Science Fiction World, China's largest science fiction magazine. Since 2004, he has published over thirty stories in Science Fiction World, Esquire, Chutzpah, and other magazines. His first novel, The Abyss of Vision, came out in 2006. He won Taiwan's Dragon Fantasy Award in 2006 with \"A Record of the Cave of Ning Mountain,\" a work written in Classical Chinese. In English, his short stories have been published in Clarkesworld, Lightspeed, MIT Technology Review, Slate, Pathlight and other venues. His novel, Waste Tide was published by Tor in 2019.  Rebecca F. Kuang is a Marshall Scholar, Chinese-English translator, and the Astounding Award-winning and the Hugo, Nebula, Locus, and World Fantasy Award nominated author of the Poppy War trilogy and the forthcoming Babel. Her work has won the Crawford Award and the Compton Crook Award for Best First Novel. She has an MPhil in Chinese Studies from Cambridge and an MSc in Contemporary Chinese Studies from Oxford; she is now pursuing a PhD in East Asian Languages and Literatures at Yale, where she studies diaspora, contemporary Chinese literature, and Asian American literature.", "text": "12690 words, novelette\nIn This Moment, We Are Happy\nBlack screen.\nBACKGROUND AUDIO\nOne heartbeat overlaps onto another; the first slow and steady, the second initially faster than the first by two thirds before slowing down. With a nervous energy, the two rhythms intertwine, their timbres cooling and turning mechanical, weaving into a grander, more complex electronic soundscape.\nCAPTION\nIn spring 2015, the new Visual Anthropology program at Peking University’s Institute of Humanities and Social Sciences required students to submit small group projects to complete their studies.\nBy the end of the summer term in 2016, eight projects were submitted. “New Newborn,” by Xu Xinyue, Yuan Xiao, Ibanca Singh (foreign exchange student), and Sebastian Schwarz (foreign exchange student) earned the highest marks in the class and was short-listed for Best Documentary in that year’s university film festival.\n“New Newborn” explores the ways that technology transforms the process of human reproduction, as well as the issue’s complex background. The Visual Anthropology program retained it as a long-term installation. As of August 2040, the project has collected over 300 hours of interview footage involving subjects from all over the world, and covers a period of 25 years—precisely the average length of a human generation.\nThis film was edited and produced using some of the project’s source materials. It was authorized by the interview subjects and the filming teams. Some of the sounds and images required postproduction processing.\nFade to black.\nNARRATOR (O.S.)\nWhat made you decide to have a child?\nWU YINGMIAN\nAge: 37\nLocation: Guangdong-Hong Kong-Macau Greater Bay Area, China\nOccupation: Entrepreneur\nIt’s quite a natural desire to have as a woman. You can feel your body urging you, like it’s trying to tell you that it’s time. What’s more, your entire environment, including the people around you, expects you to have a child. After thousands of years, our society still treats women the same . . .\nKENJI OHNO, AKA K.O\nAge: 33\nLocation: Boston, United States\nOccupation: Multimedia Artist\nThe way I see it, it’s an experience. I know what people are going to say—oh, K.O. is trolling for publicity, just as usual.\nI don’t give a ****. The media are always blathering nonsense about being PC, but they never care about being ****ing PC when they’re talking about me. I believe that what I’m taking up is perhaps the greatest feat of the century. It’ll be many years before the world properly understands its significance. I’ll wait for that day.\nHANNA & FATIMA KÜHN\nAges: 32 and 28\nLocation: Berlin, Germany\nOccupations: Film Studies Professor and Photographer\nHanna: It’s very simple. I love Fatima. She loves me. We want to leave something behind on this earth—some witness to our relationship. Storage mediums like celluloid film and magnetic discs will all become obsolete. But life doesn’t become obsolete. Life goes on by itself.\nFatima: That sounds a bit selfish . . . [Smiles] but that’s just the way it is. This child will belong completely to the two of us. They won’t be tainted by any third parties, you know what I mean? [Smiles again] I don’t mean to offend anyone when I say “third party.”\nNEHA SRIVASTAVA\nAge: 22\nLocation: Gujarat, India\nOccupation: Surrogate Mother\nThe first time I got pregnant, I was sixteen. I was terrified. I asked Rajan what we should do. He wasn’t much older than I was back then. All he did was wobble his head and say, “Well, we might as well have it.”\nSo we got married, and I gave birth to Vishal. A year later, we had Seema. I said that was enough, we wouldn’t have enough to eat. But Rajan said it was no problem, that he could just pick up some extra shifts. But we still couldn’t pay our bills. Our children were eating more and more every day, and they were going to start school soon.\nMy friend Mehak told me that Akanksha Hospital was looking for young, healthy women, so I came here. My profession is giving birth. This is the third surrogate child I’ve carried for a client.\nMOW45\nAge: Undisclosed\nLocation: Somewhere in Indochina\nOccupation: SHIIVA Lab Liaison\nHuh. I’ve always found this question quite curious. There’s a saying that humans are no more than slaves to their DNA. Every single one of our thoughts and actions are procedures already predetermined by genes, and the process’ ultimate goal is to disseminate the information stored by genes as far and wide as possible. The human body is like an ineffective Enigma Machine. Its rotors often make mistakes, and I suspect that the final receiver might not be able to read the initial message. But until then, we’ll just have to keep playing this clumsy game of telephone, except with a different set of rules.\nFade to black.\nCAPTION\nPART ONE\nWu Yingmian sits in the back of a seven-seater minivan, taking an endless series of phone calls. The car speeds past a forest of mirrored buildings, reflected in the window against her gaunt profile.\nThe camera follows Wu as she steps out of the car and enters an office building. As she rides up the elevator, several people bow and greet her when they see her. She responds with a slight nod.\nThrough the glass conference room wall, we see Wu sitting in a meeting. She speaks up every now and then. When agitated, she strides through the stereoscopic projections and pounds the table at the center of the room. The data visualizations twist and distort against her body.\nCut to Wu examining documents in her office. Behind her stretches a full-length French window, through which the entire city skyline is visible, including the distant Shenzhen Bay. At last, Wu signs the last document left on the table, gently exhales, and wraps her fingers around a cup of tea long gone cold.\nWU YINGMIAN\nI’m a workaholic. Must have gotten it from my father. [Smiles]\nI can’t help it. We learn from our parents; my whole family is like this. What would you do in my position? If thousands of people relied on you to feed their families? [Picks up a family photo from the desk] It’s not like I haven’t thought about getting pregnant myself. I’ve tried everything. But it’s just not in my cards.\nAlso, my father has some . . . psychological issues. [The photo displays Wu’s mother and father in their youth] My mother had a massive hemorrhage giving birth to me. But she risked her life to have me because the Wu clan had to have an heir. My father has never completely gotten over the trauma. He doesn’t want me to . . . [Stops abruptly]\nA web page appears on Wu’s computer screen, displaying neatly arranged rows of photographs of women of various skin tones. Clicking on a photo reveals that woman’s background information, including her age, birthplace, health status, education, DNA testing results, reproductive history, and hobbies and interests. Clicking on the disclosure arrow below that woman’s photo reveals her family history up to three previous generations.\nWU YINGMIAN\nA lot of mothers in the chat group said it’s better to pick a white surrogate. I think that’s pretty clearly racist. [As she speaks, the camera pans over headshots of surrogate mothers]\nThe service we’re using employs only the best surrogates. At this level, racial differences don’t matter. Personally, I prefer Asians, or even South Asians.\nNARRATOR (O.S.)\nWhat does your husband think?\nOn the desk sits a photograph of Wu and her husband, whose face has been blurred out.\nWU YINGMIAN\nOh, him? All he had to do was contribute a few milliliters of fluid, and now he gets to have an opinion? You have no idea how painful egg extraction is. Of course, I get the final say. Will I go to meet the surrogate mother in person? I’ll have to think about that . . . [Glances out the window]\nScene change. Under a hot tropical sun, taxicabs speed along a red dirt road, kicking up large clouds of dust at weary pedestrians. The camera follows Neha down the road. She comments on her surroundings as she walks. Curious children wander into the frame every once in a while, tossing toothy grins at the camera.\nNEHA SRIVASTAVA\nWe used to live in a hut like that. [The camera pans over makeshift shacks of canvas propped up by metal tubes] A lot of surrogate mothers have to live here and wait if they aren’t chosen, or if they don’t conceive. Our whole family has moved into a new, proper house now. I’ve been lucky, thank the gods.\nNARRATOR (O.S.)\nHow much do you get paid?\nNEHA SRIVASTAVA\n. . . After the agency fee, I get about $6000 American dollars. Hey, that’s more than what Rajan makes in several years.\nSeveral of Neha’s acquaintances come over to congratulate her, their eyes filled with envious admiration.\nScene change. Neha walks into a pale beige building. The sign on the door indicates this is one of Akanksha Hospital’s surrogate mother residences. A nurse helps Neha into a hospital bed. The room, which is about thirty square meters large, holds eight beds. Three are empty. All surrogate mothers who successfully conceive must move into this residence. The nurse begins to examine Neha.\nNEHA SRIVASTAVA\nI had to do heavy manual labor when I was pregnant with Vishal and Seema. I wasn’t eating well, either. Nobody cared then. It’s much better here. [Smiles]\nThe nurse gives Neha an injection, then prepares a nutritious meal for her. Neha, who has been through this process three times before, appears relaxed and at ease.\nNARRATOR (O.S.)\nHow long do you need to take these injections for?\nNEHA SRIVASTAVA\nI’ve never kept track before. In any case, I know I have to keep doing them for a long time . . .\nNURSE\nThese are progesterone injections. We do seventy-five days of injections. The hormone thickens the endometrium and inhibits uterine movement. After implantation, the placenta develops, which . . .\nNEHA SRIVASTAVA\nI know, I know. It’s all to protect that precious little thing. It’s the company’s property. [Smiles]\nNARRATOR (O.S.)\nDo you find all this difficult?\nNEHA SRIVASTAVA\nI don’t find the procedure itself difficult. What’s difficult is the way people see me because of it. Rajan was furious at first. He thought that I was committing sacrilege, that this was an unclean act. But I told him that some of those client parents had lost their only child, or couldn’t conceive on their own due to medical reasons. We’re doing a good deed here. The gods will forgive us. Gradually, he came around. What’s more, we’re living in a new house now, and our children are attending good schools. Everyone’s happy, no?\nNARRATOR (O.S.)\nDo you ever meet the parents?\nNEHA SRIVASTAVA\nUnless they make specific requests, we have minimal contact and conduct interviews through video. After the child is born, they take it away half an hour after verification. That’s what the contract stipulates . . .\nNARRATOR (O.S.)\nDo you ever want to see those children again?\nNEHA SRIVASTAVA\nI . . . [Smiles uncomfortably] I haven’t thought about that . . .\nScene change. Wu is in the gym, sweating on an elliptical machine while watching a video program with wireless earphones. In her tight athletic bodysuit, she hardly looks like someone about to turn forty.\nCAPTION\nThe surrogate agency declined our request for filming.\nWU YINGMIAN\nDon’t they say that in the future, people might live until they’re 200 years old? [Smiles] Looking youthful and energetic is an asset in the workplace. More and more people are going to choose to freeze their eggs or to use surrogates in the future. Job competition is so fierce right now that when you come back from maternity leave, there’s nothing left for you. Before, people used to hide their pregnancies—they’d pretend to go on a holiday abroad and come back with a baby. Now the popular option is surrogacy. [Points to a row of young women running in the gym]\nLook, they’re even more radical. They don’t want to get married at all, they just want babies of their own. Men are like shoes or clothes; you can change them whenever you want. [Smiles]\nWu is watching an animated film produced by the surrogacy agency. A cartoonish figure explains the entire process.\nCARTOON\nThe preparation period requires 20 days of oral contraceptives, followed by 10 days of suppressor injections in order to prevent the premature loss of eggs.\nBefore ovulation, you must undergo blood tests to check estrogen levels every day, take a monitoring test every 2-3 days, and inject three different shots every night to stimulate egg maturation. During egg extraction, a needle-shaped pipette the length of an A4 sheet of paper will be inserted through your vagina until it reaches the ovaries. The doctor will monitor the position of the pipette using a B-mode ultrasound. Once they locate the follicles, they can extract around 10 eggs at a time. Meanwhile, the surrogate mother will need regular injections to regulate her estrogen levels. The male donor will contribute his semen at the same time. The eggs will be fertilized in vitro for 2-6 hours until they become embryos. After a certain period of time, they can be implanted into the uterus of the surrogate mother.\nIn order to increase the chances of success, three to four embryos will be implanted into the surrogate’s womb simultaneously. Their development will then be monitored.\nWU YINGMIAN\nI think they should replace that cartoon woman with a mother hen. [Smiles] Hens are egg factories, right? I’ve heard that I’ll end up with fifty or sixty needle scars all over my body, not to mention all the other possible complications. I’m really paying to suffer. Ah, age thirty-seven is the limit. No matter how high tech you get, it’s still easier to be a man. “The male donor will contribute his semen at the same time . . . ” Once simple sentence. That’s all there is to it. I’ve heard of some wealthy families who pay for several surrogates at once and buy eggs from Ivy League students. That’s simpler than the ancient custom of taking concubines. You don’t have to worry about the harem squabbling over family property.\nWu Yingmian finishes her workout and leaves the sweaty gym.\nScene change. Wu Yingmian drives home. She takes a phone call on the road. She appears to get into a heated argument with the person on the other end.\nTEXT ON SCREEN\nAt Wu’s request, we did not record the call.\nAfter hanging up, Wu remains silent for the rest of the drive. Her car pulls up to a town house tucked away behind a tropical garden. A poodle rushes out to greet her. The house interior is decorated in a typical Mediterranean style. Wu’s husband is away on a business trip. She quickly eats a meal prepared by her staff, then retreats to her office to review a thick stack of contracts.\nWU YINGMIAN\nSix contracts in total, and all in English. I had to hire specialists to translate them into Chinese. My lawyers have already added their comments. Look, this agreement is with the surrogacy center, this one is with the reproductive center, this one is with the surrogate agency, this one is with the surrogate mother herself, and this is with the capital supervisor . . . Oh, and this one is with the representing attorney. All these companies are based in different jurisdictions, and they have different laws and regulations that I have to research. I can’t get sloppy about anything here. I’ve heard of so many drawn-out surrogacy lawsuits.\nNARRATOR (O.S.)\nWhat kind of lawsuits?\nWU YINGMIAN\nA few years ago, for example, a Japanese couple hired a surrogate mother from India to carry their child. But they divorced before the child was born. The biological mother didn’t want her child anymore, and the father had no legal rights to it. But the baby wasn’t Indian, so the poor thing was left with undetermined status.\nNARRATOR (O.S.)\nWhat issues are you most afraid of?\nWU YINGMIAN\n[Thinks for a moment] What happens if the sperm donor wants to contest custody rights? What if the surrogate mother wants to keep the child? What if she wants to maintain a relationship with the child? What if the local laws protect the surrogate mother’s rights? I just want a child that belongs completely to me. I don’t want them to run into any sorts of complications because of their origin. So I need to specify these conditions very clearly in these contracts.\nNARRATOR (O.S.)\nIn your opinion, is the surrogate mother just as much a mother as you? After all—\nWU YINGMIAN\nI know what you’re trying to say. I wouldn’t use such a crude term as “uterus-for-hire.” We’re all women, after all. But we stand in different positions vis-à-vis this contract. Science has turned natural reproduction into an engineering project, and we ought to comply with the rules. Everyone should perform their own role well. You want fame, you want money, and you also want a child. Where on earth would you get such a good deal?\nWu stops, lowers her head, and turns another page in the contract. Suddenly, she seems to be whispering to herself.\nWU YINGMIAN\nThat’s why I don’t want to meet her. I think I’ll go soft, I won’t be able to stand it . . .\nScene change. We are inside the surrogate mother’s residence. A group of surrogate mothers, with bellies large and small, all dressed up with heads wrapped in saris, are seated in a circle. A sumptuous feast has been laid out in the center of the circle—naan, meat and vegetable curries, lassi, and masala chai. The women sing songs of prayer to bring blessings on the woman in the middle, whose belly is the largest and roundest.\nCAPTION\nEvery time a surrogate mother is about to give birth, the women in the residence throw a big party like this to bless the baby about to be born—a baby that grows in the mother’s belly, but does not belong to her.\nNEHA SRIVASTAVA (O.S.)\nI’ve been to a lot of these baby showers. Everyone is always in such a good mood at the start, eating and drinking, singing and dancing. But everyone falls silent by the end. We all know that once the child is born, we’ll only get to hold them for less than an hour. We tell ourselves that it’s someone else’s baby. But they still grew inside us for nine months. Our blood flows through their veins; they’re a part of us.\nIt’s so hard to describe this feeling. It’s like your heart has been hollowed out, and all you’re left with is an empty sack.\nThe expecting mother begins to cry. The other surrogate mothers put their hands on her shoulders, comforting her. But their own eyes are red as well. Neha hugs the other mothers, then turns her head to the side, as though thinking about something.\nScene change. The camera follows Neha into a busy street, where the pedestrians toss her curious glances. Neha steps into a meadow of knee-high vetiver grass. Gently, she strokes the stiff, saw-toothed grass heads while humming a wordless tune under her breath.\nNEHA SRIVASTAVA (O.S.)\nWhenever I sing this song, I can feel the baby moving very strongly, like a fish swimming in my belly. I think it must really like this song, so I try to sing it while I still can.\nNeha approaches the bank of a small stream and carefully sits down on the grass. She dips her hands into the water. Close-up, her hands, running through the clear, glistening water, appear covered in many little scars.\nNEHA SRIVASTAVA (O.S.)\nWhen the baby is born, I want to place a red bindi on its forehead according to tradition. I also want to tie threads on its wrists, ankles, and neck. This wards against evil spirits and bad luck and protects their living energy. I have to do this. I want them to grow up strong and healthy, just like my own children.\nNARRATOR (O.S.)\nWhat will you do if the biological parents object?\nNEHA SRIVASTAVA\n[Brief silence] They don’t know anything! They don’t understand at all!\nThose rich people think that babies are like pets. They think it’s like buying a kitten or puppy at the store—that they can just hand over the cash and leave with a cage. I nearly died the first time I carried someone else’s child. They put triplets in me. In India, you can even implant quintuplets if you’re willing to pay. Sometimes, they implant two just so they can keep the boy and kill the girl!\nIs this how a civilized society behaves? I really don’t know.\nA lot of surrogate mothers end up aborting their babies right before they’re born, just because their clients change their minds or get divorced. Sometimes those girls die in the process. If that isn’t murder, I don’t know what is.\nNeha lapses into silence. The sound of splashing water comes from nearby—a few boys have jumped from the back of a water buffalo into the stream and are dashing water at each other. The suspended droplets form a faint rainbow in the air.\nNEHA SRIVASTAVA\nAfter I gave birth to my first surrogate baby, I swore I’d never do it again. But I ended up doing it a second time, and then a third. I thought I would get used to it. I thought I’d stop feeling anything at all. But it’s not like that.\nI still feel the baby’s heart beating, as if it’s talking to my own heartbeat.\nBecause of the baby, sometimes I still feel happy for no reason. Or I’ll get mad, or I’ll weep. You realize there’s a little life inside your body that knows about everything you do, and feels everything you feel. Though you don’t know how much it can feel, you know you can feel it, and you know it can feel you.\nIt’s such a strange, wonderful feeling. It doesn’t matter at all whether the life inside you truly belongs to you or not. You’ve already been bound together. Can you understand that feeling? [Looks tearfully at the camera]\nScene change. Wu Yingmian sits at her desk in the study, contract documents scattered before her. She rubs at her red eyes. She walks out to the balcony and looks out over the city, which shines like an ocean of stars. Lighting a cigarette, she takes a deep drag and exhales forcefully, breathing out wisps of white smoke that dissipate into nothing before they can take shape.\nWU YINGMIAN (O.S.)\nI haven’t slept at all these past few days. I’m worried about the quality of the eggs and about the extraction process. And I’m hearing too many terrifying stories—my heart can’t calm down. Even when I’m half asleep, I can’t stop thinking about those poor women, and those poor dead children.\nWhen would you say an embryo has developed enough to count as a person? When do they have the capacity for perception? Self-awareness? I can’t dwell on this too much, or I’ll lose my mind. What kind of sin have I committed . . . ?\nCut to a close-up of Neha. The rippling water reflects on her face, its bright twinkles dancing in her eyes.\nNEHA SRIVASTAVA (O.S.)\nI often dream about those children.\nIn my dreams they’ve already grown so big. I see their faces, white or Asian.\nI call them by the names I chose for them, but they don’t answer me.\nI call and call until my voice is hoarse, but they never respond. It’s only when I hum that song . . .\nA burst of cheering causes Neha to lift her eyebrows in surprise. The boys have climbed ashore and put their clothes back on. One of the older boys conjures up a Kanjira drum, skillfully sprinkles a few droplets of water onto the snakeskin wrap, then begins beating out a rhythmic pattern far richer than what the little drum seems capable of.\nNeha smiles. Suddenly she starts to sing along. She sings the song she was humming on the road, but this time she has added lyrics. The boys, delighted, clap their hands along to the beat. They can’t stand still any longer. Slowly they start to shake their legs, twist their hips, and wave their hands in the air as they dance, grinning. Neha stands up to join them. Her steps are cautious, but her limbs and expressions are exceptionally lively, like the countenance of a proud peacock.\nNEHA SRIVASTAVA (O.S.)\nIn my dreams, the children still remember this song. They still remember me.\nEvery time, I wait for them to call out for me, but that’s when I always wake up. I never get to hear that word . . .\nCut to a close-up of Wu Yingmian.\nWU YINGMIAN\nI’ve spent all this effort just to hear my child make one sound . . .\nCut to a close-up of Neha.\nNEHA SRIVASTAVA\nMama. Yes, Mama.\nBlack screen.\nCAPTION\nPART TWO\nKenji Ohno waits at a T stop. On the bottom of the screen, several data graphs are superimposed over his image. The lines rise and fall like ocean waves, representing K.O.’s real-time biometric data. The train arrives at the station. K.O. slings his bag to one side as he enters the crowded train car. Several young people, who have been staring at their phones, see K.O.’s protruding belly and stand up to yield their seats. K.O. thanks them and sits down. Only then do the passengers see his face clearly, and seem unable to stop staring. Finally, he is recognized—a young, fashionably-dressed woman approaches and asks if he is K.O.\nKENJI OHNO\nYes, I am.\nWOMAN\nSorry if this is a bit rude, but I’ve read all about you in the news—how is it doing?\nKENJI OHNO\n“It” is a “her.” She’s doing very well, thank you.\nWOMAN\nHow many months along are you now?\nKENJI OHNO\nTwenty-eight weeks and three days.\nWOMAN\nTime flies! So how are you going to . . . um . . . give birth?\nThe biosignal lines begin to fluctuate wildly.\nKENJI OHNO\n[Smiles] I get it. Everyone’s very concerned about that. I have a few options, but I don’t think this is the best place to discuss them. Why don’t you follow me online to find out?\nWOMAN\n[Embarrassed] Oh, of course. Sorry, I just meant—I’ll follow you. Wishing you the best!\nNo one else seems interested in starting a conversation with K.O. He rides the red line to the Kendall/MIT stop. As he walks down the platform, a pedestrian swings the handle on a musical sculpture called Pythagoras, activating a set of mallets, one of which strikes a steel pipe to emit a B minor note.\nScene change. We follow K.O. into the MIT Media Lab extension building designed by Fumihiko Maki. A new material combining synthetic chloroplasts with carbon nanotubes is on display in the main lounge. It looks like a clump of dark green jelly that has congealed into various, bizarre shapes.\nKENJI OHNO\n[Turns to the camera and smiles] Nicholas Negroponte, Soft Architecture Machines, 1975. Not many people remember that he was originally a professor of architecture.\nThe camera follows K.O. to the other side of the hall, which displays various inventions representing the history of the Media Lab. These include the Logo “turtle,” the Minsky Arm, the OLPC (One Laptop Per Child) logo, the Kindle, the foldable and ultra-compact CityCar, the holographic 3-D printer, and the Scratch visual programming language designed for children.\nKENJI OHNO\nSo ****ing cool, isn’t it? The people here are an odd bunch. But unlike those theorists who are all talk and no action, the people here believe in “Deploy or Die.” [He points to the slogan on the wall]\nScene change. K.O. knocks on an office door before walking in. Dr. Joan-Francois Lemaire, a woman with unkempt, scraggly blond hair who appears to be in her thirties, gets up to greet him.\nKENJI OHNO\nJoan is the best. She’s the star student of the famous Hugh Herr, founder of the Biomechatronics Group at MIT. He’s that pioneering madman who built himself two prosthetic legs.\nJOAN-FRANCOIS LEMAIRE\nOh come on, I never was that good of a student. Compared to what you’re trying to do, Hugh Herr was a Puritan.\nKENJI OHNO\nAnd we are what we’re about to do. Think we got a chance at the Disobedience Award next year?\nCAPTION\nThe MIT Media Lab Disobedience Award was created with funding from LinkedIn founder Reid Hoffman in 2016. It aims to recognize outstanding individuals or teams whose work has had global influence. Its criteria include “responsible, ethical disobedience.” The first prize awarded a dollar amount of $25,000, but the prize money was later increased to $40,000.\nJOAN-FRANCOIS LEMAIRE\nI think we’d get full marks for disobedience, but on the ethical criterion . . . well, I’m sure there would be some controversy.\nGo ahead and lie down. I need to give you a comprehensive examination.\nKENJI OHNO\nThose stodgy old corpses in their stiff collars should hurry up and ****ing die!\nK.O. changes into a loose hospital gown and lies down on the flat white examination bed. Joan slowly scan K.O. with a round device which flashes white and blue lights and emits a quiet electronic buzz as it slides over K.O.’s body.\nJOAN-FRANCOIS LEMAIRE\nWatch your language. You’re about to be a father.\nAs the scanner moves over K.O.’s swollen abdomen, a tablet in Joan’s hand displays various data along with a live image of the moving fetus. Joan rotates the image, examining the fetus’ position from different angles.\nJOAN-FRANCOIS LEMAIRE\nShe looks to be doing well. The artificial placenta is working normally. Your oestradiol hormone levels are a bit high. Does everything still feel alright?\nKENJI OHNO\nAside from growing this giant set of tits, never sleeping, stuffing myself with food and pills then vomiting everything back out? I’m experiencing some mood swings, but they’re not too extreme. And then there’s the pain—I have to say it, never in my ****ing life have I felt as much pain as this. But everything else feels alright.\nJOAN-FRANCOIS LEMAIRE\nYou chose this. You could have had a boy, or you could have skipped the nervous system integrations. That would all have saved you a lot of pain.\nKENJI OHNO\nJoan, you know that I want to imitate the natural state of pregnancy as much as possible. In natural pregnancies, you have no way of choosing the infant’s gender. It’s chosen for you. Carrying girls requires higher levels of estradiol, so my mood swings and hormones have been seriously out of whack. But getting back to the point—a chemically castrated K.O. is still K.O., right?\nJOAN-FRANCOIS LEMAIRE\nSure, K.O., you’re certainly all man. Even the hormone injections can’t suppress your virility.[Pauses] So, have you really decided?\nKENJI OHNO\nAh, this again. How many times have I told you? Even if it’s dangerous, I want to simulate the experience of real labor to the greatest extent possible.\nIsn’t that the whole point of this project? I’ll be the first man in human history to experience pregnancy from conception to deliverance who wasn’t born with a womb, unlike Thomas Beatie. This signifies so much. So much.\nJOAN-FRANCOIS LEMAIRE\n[Smiles] That’s not what I was asking about. I was actually wondering—have you chosen a name?\nK.O., still lying on the bed, turns his head to shoot Joan a knowing, mysterious grin.\nScene change. A movie clip plays. A character named Alex, played by Arnold Schwarzenegger, lies on an operating table. His huge, swollen belly protrudes from a square hole cut in his blue surgical drape. He is surrounded by four doctors and nurses wielding surgical instruments, preparing to give him a Caesarean section. The camera slowly zooms in on Arnold Schwarzenegger’s face. His expression is strained and nervous. The people around him keep telling him to “breathe, breathe.”\nNARRATOR (O.S.)\nThe history of film includes many examples of pregnant men from around the world. The French-Italian comedy “A Slightly Pregnant Man” came out in 1973, and “Kangaroo Man” was released in Taiwan in 1985. More recent examples include the American comedy “Junior” (1994), the Russian comedy “Pregnant” (2911), and the Chinese fantasy adventure action comedy “Monster Hunt” (2015). [A montage of movie posters and short clips accompanies this explanation]\nIn 2008, performance artist Virgil Wong uploaded a 7-minute long mock documentary to YouTube in which his male friend Lee Mingwei attends a Phase 2 clinical at RYT Hospital-Dwayne Medical Center in New York City and becomes the first man in history to conceive a baby in his own body. This incited a storm of online debates.\nHANNA KÜHN\nWhat’s interesting is that all these movies are comedies. It’s as if the only value of this subject is its comedic potential.\nMy point is, when have you ever seen a film about two women having a child without a man?\nFATIMA KÜHN\nHold on, don’t forget about “Wonder Woman!” [Laughs]\nScene change. Fatima sits in a filming studio with bright, white walls. She wears a white athletic jumpsuit and neon yellow sneakers. As she directs the lighting man to adjust the light source, her shadow morphs into various shapes and shades on the ground. At last, satisfied, she orders the crew out of the frame.\nThe camera pans outwards. Standing before Fatima is not a model nor a celebrity, but simply a table full of meticulously arranged Moroccan food.\nFATIMA KÜHN (O.S.)\nI’m from Syria. I’m the child of refugees.\nWhen my mother was pregnant with me, she smuggled herself across the Mediterranean, then crossed Greece, Macedonia, Serbia, Hungary, and Austria on foot until she reached Germany. I can’t possibly imagine everything she’s been through. All I know is that she refused to follow her family’s naming convention—that is, adding your father’s name or even his father’s name to yours as a suffix. She told me that my name was Fatima. Just Fatima. She told me I have to live just for myself.\nNow I have a new last name. Hanna tells me that in German, “Kühn” means “brave.” I like that.\nScene change. Hanna and Fatima stand holding hands at what appears to be a public event. Suddenly we hear shouting outside the frame. Several projectiles fly through the air at them and splatter against their heads and bodies. The objects turn out to be raw eggs, which drip thick, viscous, translucent liquid down their clothes. Wearily, they wipe the yolk and eggshells away. At this point the camera swivels onto the crowd, where a burly man in a beret is being pinned down by security guards while shouting a stream of obscenities in German.\nScene change. Later that afternoon, Hanna and Fatima sit side by side on their living room sofa.\nHANNA KÜHN\nThat man was shouting that he was going to “stuff pig semen” up all of our “lesbian holes.”\nFATIMA KÜHN\nThis doesn’t even count as that bad. Some of my clients have backed out of our contracts under pressure. We’ve gotten death threats from terrorists. They’re threatening to stone us to death, just like they do in my motherland.\nHANNA KÜHN\n[Grips Fatima’s hand and looks her in the eyes] We’ll make it through this. The university has made clear that it will support us. The police have also stepped up their security measures. I mean, this is Berlin. Where else would you find such respect for diversity?\nFATIMA KÜHN\n[Gently caresses her belly] I know . . . At first we thought our biggest obstacle would be the technology. Now we’ve realized that our biggest obstacle is other people . . .\nHANNA KÜHN\nThink about it this way. The first time people saw a freight train on a movie screen, they were so frightened they ran out of the theater. Society’s opinions always lag behind technological developments. I just hope that our daughter grows up in a more tolerant world.\nFATIMA KÜHN\nTo be honest, I’m not as optimistic.\nScene change. The narrator, off-screen, conducts interviews with strangers on the street.\nINTERVIEWEE 1\n[Elderly, male, wearing tortoiseshell glasses and a windbreaker, carrying a leather suitcase]\nHuh . . . well, here’s my opinion. God created men and women so they could love one another and produce future generations. Now you’re telling me that men aren’t necessary anymore? That women can conceive children with other women? Well, I believe that’s . . . that’s just sacrilege.\nINTERVIEWEE 2\n[Young, male, short-haired, eating a hamburger, eyes glued to phone screen]\nHa! I knew this day would come sooner or later. Time to discuss the “men are useless” theory.\nYou say this is about science, so let’s discuss this from a scientific perspective. Men don’t just contribute sperm and Y chromosomes, we also contribute to genetic diversity. If a woman decides to make clones from her own cells, then her subsequent generations will progressively become weaker, like an echo growing fainter with each bounce. All of her recessive genetic flaws will surface until the whole system falls apart.\nOh? You’re saying that both women are contributing genetic material? Well, that’s something else entirely . . .\nINTERVIEWEE 3\n[A short-haired, middle-aged woman wearing professional attire and riding a bicycle]\nIf bees, lizards, and sharks can do it, why can’t humans? I mean, we’re all the product of natural evolution.\nI read in the news that the Y chromosome degenerates at a rate of ten genes every one million years. So eventually there will come a day when men go extinct, right? Why not start getting used to it now? Humanity needs some way to continue on.\nNo, I don’t hate men. There are times when I need them in my life, too.\nI just don’t think there’s anything wrong with two women having a child on their own. You know, there are plenty of men who are only their children’s fathers in name. [Winks]\nINTERVIEWEE 4\n[A little girl eating ice cream, gazing up at the camera in mild confusion]\nYou mean like all the Disney princesses in a crossover together? Snow White and Mulan could live together and adopt Tiger Lily as their daughter, and they could have a little bunny rabbit named Judy, and they could have new dresses to wear every day . . .\nScene change. The Kühns sit on their living room sofa.\nHANNA KÜHN\nLet’s approach this from a historical perspective. Did you know that Aristotle actually believed semen came from the spinal cord? That’s why I believe that in ten years, society won’t view us with the prejudices they hold now.\nFATIMA KÜHN\n[Watching Hanna] I just hope that we live to see that day. When I was six, I enrolled in a neighborhood school under Germany’s “refugee integration” policy. Of course, most of the teachers, parents, and other children were quite friendly. But still, even such a beautiful Easter egg had its cracks. A glance, a careless joke, a word emphasized just so . . . such trivial everyday acts would be magnified a thousand times in the minds of people like me. I’m always torturing myself wondering—are they mocking me? Do they look down on me? How can I blend in better with them? I’d rather keep my daughter at home and only let her interact with AIs than let her bear that kind of burden. At least then I could control their conversation settings: 75% German humor.\nHANNA KÜHN\n[Stroking Fatima’s hair] Take it easy, Fati. Breathe. She’s probably listening to everything from inside your belly. [Smiles] I agree that everything you’re saying is objectively true, but I also believe that one’s family environment can make a powerful difference. Look at what you’re like now—you’re no different from any person of German heritage. You might be even happier and more accomplished . . . [The sound of a window shattering comes from the kitchen]\nOh, heavens. Stay here. Don’t move, I’ll go take a look. These assholes—\nThe camera follows Hanna as she runs into the kitchen. Broken window shards cover the floor, among which lies a paper-wrapped parcel shaped like a pipe bomb. Outside, a car engine roars as the assailants speed away.\nHANNA KÜHN\nGet back! Get back! Call the police!\nFatima covers her mouth in horror.\nScene change. The police bomb disposal team has arrived and cordoned off the house with barricade tape. A surveillance monitor displays the camera view of a tracked bomb disposal robot, which rolls shakily past the sofa where Fatima and Hanna were just sitting. Once the robot reaches the suspected bomb, its two arms appear in the camera view and carefully cut the electrical cords wrapped around the package. Everyone watches nervously as the robot unwraps the paper. Hannah hugs Fatima tightly. Fatima, who seems to be whispering something to herself, strokes her belly. Now and then she wipes tears from her cheeks.\nThe robot opens the parcel to reveal a metal dildo inside. Large letters are scribbled across the wrapping paper: “BENUTZE DAS” [Caption note: Translation: “USE THIS”]\nScene change. Nighttime. K.O. lies propped up on one arm in his studio. A pile of nutritious foods and medications are scattered across the table in front of him.\nNARRATOR (O.S.)\nAre you sure we can film this?\nKENJI OHNO\nI’ve already informed the other party that this is also a part of my project. Besides, you’ll show me before the final cut, of course? [Grins] Every industry has its own interpretation of the rules. You know that.\nFifteen minutes past the scheduled time, K.O. enters into a video conference with Scott Anderson, director of Netflix’s live broadcast content, who is calling in from Netflix’s general headquarters in Los Gatos, California. Scott’s face shows up as a projection on K.O.’s wall.\nKENJI OHNO\nScott, darling! How have you been? So sorry I’m late—I didn’t expect my previous meeting to go over so long. It was impossible to get through to those sons of bitches.\nSCOTT ANDERSON\n[He appears about thirty years old, dressed in business casual attire. He speaks with astonishing rapidity]\nNo worries. Wow, K.O.! You look great!\nKENJI OHNO\nThank God for that—and science, of course. [Grins]\nLet’s get straight to the point. I know Netflix wants the exclusive rights to broadcast the delivery. But you must know already that this is like the prime advertising spot for Black Friday. Everyone wants these rights. So tell me, what are your best terms?\nThe audio temporarily cuts out. All we can see are the two parties in rapid conversation.\nKENJI OHNO\nOkay. I’ve got no problem with these financials. What about the rating? I want as many people to subscribe as possible, so is there any way we can get around that MA rating?\nSCOTT ANDERSON\nI understand, I really do. But first, this isn’t up to us—there’s no way to get around the FCC’s AI censorship program. Second, at this point, we still don’t know what will actually occur during your delivery. Could you describe it in detail for us? Then we can have our legal department assess the risks.\nK.O. drags a data file from his tablet onto the big screen, which opens into a cartoon anatomical model of the human body.\nKENJI OHNO\nYou asked for it. Prepare yourself, Scotty.\nWhat kind of magic did I use to get pregnant? Ding ding ding! Joan and her team were inspired by ectopic pregnancies. To women, ectopic pregnancies are life-threatening and require complete termination. But to me, it was the only path forward.\nJoan’s team used biological nanomaterials to construct an artificial womb inside my abdominal cavity, as well as an artificial placenta attached to my mesentery for reinforcement. My hip bones weren’t strong enough to support the implanted organs, so I had surgery to insert stents that could support a rapidly growing baby. Our biggest challenge was reconstructing my abdominal circulatory system to ensure adequate blood supply to the placenta. Then I received injections of artificial amniotic fluid, got the embryo implanted, went through compounded hormone therapy, took antirejection medication, and all the rest of that good stuff . . . Oh, I almost forgot, I also asked them to do a nerve graft for me. That really ****ing hurt. It hurt ten thousand times worse than being kicked in the balls.\nSCOTT ANDERSON\n[Eyes wide, hand covering his mouth] Good lord, that’s unbelievable. This . . . is really insane.\nKENJI OHNO\nHa! That was just foreplay.\nThe compounded hormone therapy has messed so much with my body that I’m not properly male nor female. I’ve completely lost my ability to have sex—hopefully, that’s not permanent. And there are an infinite number of ways that I could have died during this process—I could have had a heart attack, suffered an internal hemorrhage, gotten an infection, developed a blood clot, ruptured my intestines—pretty much everything you can think of. Not to mention all the side effects of the medications I’ve been taking, or the mood swings caused by my messed-up hormones. For the first time in my life, I’ve realized that being a mother is incredibly hard.\nBut here’s what I’m trying to get at. We’ve been talking about so-called “gender equality” for decades now. But until you’ve physically experienced what it’s like to be another sex, you can’t really talk about identifying with the other side. You understand.\nSCOTT ANDERSON\nI absolutely agree. Gender equality shouldn’t just be an empty slogan. So will you go through with the C-section?\nKENJI OHNO\nThat’s the last, and also the most dangerous, hurdle. You media bastards are going to drool all over this.\nSee, the artificial placenta has now fused with my body tissue. They’ll have to cut into my blood vessels to completely remove it, otherwise it could lead to serious, high-risk complications from infection. I could also bleed to death during surgery. If the artificial uterus breaks apart, then the baby’s life will also be at risk.\nSCOTT ANDERSON\nAre you telling me that there could be an accident during delivery?\nKENJI OHNO\nI don’t want to exaggerate, but considering my situation, a 50% chance of death is probably conservative.\nSCOTT ANDERSON\nThis . . . Netflix can’t possibly live broadcast someone’s death. We’d be sued into oblivion.\nKENJI OHNO\nI also wish I could have just evolved a male womb like a leafy sea dragon. But the reality is that after this, I’ll still have to undergo quite a few surgeries to get rid of my nondegradable scaffolds. But let’s get back to the point. Isn’t this exactly what makes the audience want to watch? The 50/50 risk I might die? Who would watch rebroadcasts of games when they already know the winner?\nSCOTT ANDERSON\nThis is far too dangerous. If bleeding were the only problem, we could blur out in real time or tone down the color saturation. But if lives are at risk . . . I’m sorry, but I have to consult with our legal department.\nKENJI OHNO\nForgive me for being blunt, but giving birth is already inherently dangerous, regardless of sex.\nSCOTT ANDERSON\nForgive me for being blunt—I know you’ve always been a risk-taker, but don’t you think you’ve gone a bit too far this time? If—God forbid—that baby suffers any complications, then that’s a serious breach of ethics. Everyone will think that you killed an innocent child, just for the sake of your own . . . art project.\nKENJI OHNO\nI get what where you’re coming from. But procreation is already selfish by nature. No one asks permission to have a child. The way I see it, whether it’s for real or for show, having a child will make my life more complete. I’ll give you some time to think about it. Get back to me ASAP. Goodbye!\nK.O. exits the video conference. Anderson’s face disappears from the wall. K.O. rubs his belly, staring pensively at empty space. Suddenly he turns toward the camera and waves a hand.\nKENJI OHNO\nTurn that off. I said, turn it off.\nScene change. Hanna and Fatima, wearing gray jumpsuits, lie with their legs crossing on two elegantly designed slanting ivory chairs inside a bubble-shaped room whose inner walls are made of some kind of milky white, luminescent material. Lying side by side, their heads pointed in opposite directions, they look like an X chromosome floating in midair.\nCAPTION\nThis is Berlin’s Innerspace Mental Health Treatment Center. We obtained permission to film inside the clinic, although some content had to be cut.\nThe lights dim until the room is dark. A faint, buzzing noise slowly rises in volume. Spots of light begin pulsing along the walls, soft and tender as breathing, shifting in color, and slowly adopting rhythms and shapes to match the sound effects. The lights resemble stars falling and rising across the sky, against which Hanna and Fatima appear only as two dark silhouettes. They both wear a set of white headphones, through which they can only hear the others’ voice when necessary. All of this is programmed to run automatically without any human interference.\nDifferent images appear on the wall before each of them. Their headphones flicker. The therapy session has begun.\nHANNA KÜHN\n[Her wall displays a slowly revolving blue whirlpool]\nHello, I’m Hanna. Yes, this is my first time receiving AI psychological therapy. This is all pretty cool. Makes me think of Professor X . . .\nFATIMA KÜHN\n[Her wall displays an array of orange splotches resembling a Rorschach inkblot test]\nFatima. They told me this kind of treatment could help, so I’m here . . .\nHANNA KÜHN\nI’ve been suffering nausea, insomnia, recurring stomach pains, nosebleeds, and hormonal fluctuations for about seven weeks . . . no, I’m not pregnant, she’s the one who . . .\nFATIMA KÜHN\n[Breathes deeply] Nightmares. I have nightmares every night. Yes, I think it has to do with what happened. It’s been a while since . . .\nHANNA KÜHN\nCouvade Syndrome? I thought that only happened to husbands of pregnant women, like some kind of reverse Oedipus complex . . .\nFATIMA KÜHN\nI have to think for a moment . . . it was all so confusing, I think someone was chasing me, chasing and running after me . . .\nHANNA KÜHN\nNo, I don’t believe in all that nonsense about “sympathetic pregnancies,” but Fatima wanted to come, so I came with her . . .\nFATIMA KÜHN\nThey want the child in my belly. They want my child . . . [Sobs] they have knives, long and curved knives, shining so bright . . .\nHANNA KÜHN\nI’m mainly concerned about Fatima. She’s scared to death. All those terrorists, scientists, and media outlets, they just won’t shut up . . .\nFATIMA KÜHN\nHanna’s gone. Maybe they’ve killed her. No, how can I tell her? That isn’t even the scariest part . . . They catch me and use their curved knives to cut my belly open . . . oh God . . . [Her breathing quickens]\nHANNA KÜHN\nWe’ve been taking our medications as scheduled. All of our fetal examination results have come back normal. I can’t help but say it, I think the root of all of this is the horrible things they’re saying about us in the media. Fatima has always been very sensitive. If you look at her photography . . .\nFATIMA KÜHN\nOkay, breathe deeply . . . one, two three . . . They’ve cut open my belly, they’ve pulled out what was inside . . . They’re animal bones, they look like bones from some kind of rat or bird or frog hybrid . . . I’m about to collapse . . .\nHANNA KÜHN\nNo, she hasn’t seen it. I was the one who watched the popular science documentary. In the twentieth century, Japanese scientists successfully created female chicken sperm using stem cells collected from bone marrow. In 2004, they used gene editing technology to alter the genomic imprinting of mice cells from female to male, then transferred the altered stem cells into an unchanged immature egg to produce offspring from two female parents. These procedures do carry some risk of hidden genetic defects and hereditary illnesses . . . but I’m really not that worried.\nFATIMA KÜHN\nMaybe what they’re saying is right. Maybe we’re doing something we shouldn’t be . . . I don’t know. I really don’t know. Sometimes I can sense the baby’s mood. There’s a certain connection between the mother’s mind and the baby’s. You men can’t possibly understand it. Sorry, I’ve started thinking of you as a person again. Oh, could you change the gender of your voice? Um, can you make it a bit gentler?\nOh, much better. Thank you.\nHANNA KÜHN\n[Her walls display radiates streaks of purple and red]\nI admit I think I’m a little more rational than Fatima, but that doesn’t mean I can’t empathize.\nWe’re both this baby’s mother. She’ll be loved by two mothers. Isn’t that better than those so-called traditional families where the father is always missing?\nYes, it was my idea. I believed that technology could help us become who we wanted to be. And I believe this is what Fatima wants, too.\nFATIMA KÜHN\nWe’ve been too selfish. I’m not sure whether this is what our daughter would have wanted.\nDo you know what the media has been calling her? “The Purest Girl!” That’s like a porn star name. It makes me want to vomit. It’s like they’ve already decided that she’s going to grow up to become just like us, and choose to procreate only with other women without ever polluting her bloodline with men.\nOf course this was never our intention. We did this out of love.\nHANNA KÜHN\nSo what’s the root of our problem, O Wise Machine? In this male-dominated world, must we rely on male technology to produce daughters? Isn’t that absurd?\nWill the stress from our environments be too much for us to handle? What are we supposed to do, then? Run?\nI’m not going anywhere. I’m staying right here with the woman I love and our child.\nFATIMA KÜHN\n[Her wall display morphs into silvery-white undulating stripes]\nI can hear you, Hanna. I’m right here.\nThese lights are making me think of a story my mother used to tell me. “The Cleft.” An old fable. Of course I’ll tell it to you.\nOnce upon a time, there was a race of human-walrus hybrids who lived by the sea. They were all female, and they could procreate all on their own. But every once in a while, one of them would give birth to a baby with a penis—a monster. The Clefts killed these monsters by throwing them into a rock fissure blooming with red flowers. But they hadn’t expected that a giant eagle would snatch the babies and leave them on land, where they grew up and became a race called the Squirts . . .\nHANNA KÜHN\nAre you talking to me, Fatima?\nI don’t think these devices are helping us. Can we take these off?\nFATIMA KÜHN\nThe Squirts and the Clefts saw each other as monsters. They went to war and slaughtered and raped each other.\nBut then the Clefts discovered they could no longer procreate on their own, so they joined together with the Squirts for the sake of children, and later parted, also for the sake of their children. How did it end? To be honest, I don’t really remember. It wasn’t even a real fable. I found out later my mother read the story in a novel by Doris Lessing. Maybe I should pick it up sometime . . . All I remember is that my mother said that the Clefts were so neurotic and warlike because their wombs were empty. Perhaps there’s some truth to that. [Smiles]\nHanna pulls off her earphones. Her wall display becomes the same as Fatima’s—a sheet of silvery-white.\nHANNA KÜHN\nFati, are you okay? Should we go?\nFATIMA KÜHN\nA long, long time ago, the Clefts . . . the women . . . the daughters of the moon . . . they sat under a full moon, and told each other the legend of how children first came into this world because of the strong moonlight. They thought that if they sat there long enough, if they stared long enough at the moon, then maybe . . .\nScene change. It is nighttime. We are in a sports bar called The Lunarians, where the patrons have to shout over each other to be heard. The owner stands behind the counter, occasionally glancing up at a TV screen above his head. All sixteen TVs in the bar are set to the same channel.\nCAPTION\nWe were unable to obtain permission to film K.O. on-site during labor, but we found a sports bar that had announced it would stream the entire broadcast.\nGradually, more and more customers notice what is playing on screens. A burly-looking patron who appears to have had a bit too much to drink swaggers toward the owner.\nPATRON\nRobby! Can we change the channel? Who the **** wants to watch this sissy giving birth?\nOWNER\nI want to watch. I’ve paid for access, and I’ve advertised online that my bar is streaming this tonight. You’re free to leave.\nThe patron throws the owner a vulgar hand gesture and heads out the door.\nPATRON\nFuck you . . .\nSeveral other customers follow him out the door. The bar turns quiet. The owner turns up the volume on the TVs, and a few customers lift their heads, displaying a variety of expressions.\nANCHOR (O.S.)\n. . . The situation has now become very dangerous. The artificial womb has lost its capacity to sustain the baby’s weight, starting a dangerous chain reaction. The placenta has torn away from the mesentery, causing massive internal bleeding. The infant is at risk of oxygen deprivation, and requires immediate surgery . . .\nOn screen is a close-up of a monstrous abdomen the shape of a deflated balloon. The baby writhes and squirms under a layer of skin, resembling a worm with a disproportionately oversized head. The camera pans upward to K.O.’s face peeking out over sterile blue surgery cloth, looking pale and bloodless. He is clearly in extreme pain; his face drips with sweat, expression contorted in agony, muscles quivering.\nInside The Lunarians, the patrons murmur with disgust.\nKENJI OHNO\nI’m fine, I’m fine . . . No, I want to stay conscious, otherwise this has all been pointless . . .\nThe owner pours himself a glass of whisky. He doesn’t add ice. He takes a large gulp, then refills his glass.\nANCHOR (O.S.)\n. . . Our survey data indicates that 75.62% of respondents do not approve of artist K.O.’s project. 51.43% of respondents say that they believe his project is a blow against gains achieved by the women’s rights movement over the past fifty years. Another 37.79% of respondents say that they believe this project constitutes a criminal offense, and that both the police and public health authorities ought to intervene. These percentages are climbing as I speak. The FCC complaint hotline has been overwhelmed with callers . . .\nKENJI OHNO\n. . . Who is singing? I hear someone singing, it’s lovely . . .\n. . . I know a lot of people hate me, I know . . . all I wanted was to prove that sex can’t stop anyone . . . from doing anything . . .\nThe patrons’ hissing grows louder. Someone yells, “Go back to your island, you selfish yellow monkey!” This incites a burst of laughter.\nANCHOR (O.S.)\n. . . We are now watching the doctors trying to figure out a strategy for surgery. They seem quite tense. This surgery must be extremely difficult and dangerous.\nWe are hearing, though this is unconfirmed, that between K.O. and the unborn child, only one can survive.\nFrom a legal perspective, K.O. is both this child’s father and mother. This decision is entirely in his hands.\nIt seems like the doctors have reached an agreement. They’re walking into the surgery room.\nViewers can continue to participate using the on-screen prompts . . .\nThe camera pans outwards. The head surgeon appears to be talking very seriously to K.O., whose expression slumps suddenly into a lifeless daze.\nANCHOR (O.S.)\nDue to legal reasons, we were unable to broadcast the doctor’s crucial question. What exactly did they discuss?\nThe doctor leaves K.O.’s side and begins to prepare his surgical equipment.\nThe owner puts his glass down. The bar has grown terribly silent.\nThe camera zooms back into a close-up of K.O.\nANCHOR (O.S.)\nK.O., can you tell us what’s going on?\nK.O. is silent for a long time. Then tears begin sliding down his face.\nKENJI OHNO\nI choose her. Yes, I am clearheaded and sober.\nPromise me—whatever happens, make sure that she survives.\nShe isn’t my artwork. She’s . . . my daughter.\nA clapping noise echoes throughout the bar. The patrons turn their heads, searching for the source of the noise.\nThe owner, expressionless, continues to clap his hands firmly in slow, steady, and solitary applause.\nFade to black.\nCAPTION\nPART THREE\nWe are in a tropical monsoon forest. The camera weaves smoothly at eye level through a crisscrossing web of ficus roots. Kapok tree rhizomes resembling giant octopus tentacles thrust into tiny chinks in the ground, prying open the large stone foundations of some long-lost palace.\nThe shapes of shadows on the ground indicate this is footage shot from a drone. Occasionally, images of ruined black Buddhist statues come into view, but are quickly blurred out by a mosaic of highly saturated color pixels.\nMOW45 (O.S.)\nI apologize that we have to conduct this interview in this manner. After the attack on the Panama base, we’ve been very cautious about revealing any information about ourselves. As such, you will be unable to pinpoint any specific geographic coordinates based on the footage we provided. We have permitted you to film this part of the journey to prove that we are not a hoax produced in some video studio. Due to the historically good reputation of your documentary team, we chose you to be the single channel by which SHIIVA Lab will release information to the outside world at this time. You may ask only three questions.\nThe camera arrives in an open space, where a large pixelated mosaic conceals a building of some kind. A person wearing an ocher-red monk’s cloak stands on the sandy ground. The drone descends to the person’s eye level. Their hooded face has also been blurred out by the pixels, which occasionally reveal a pair of strange, golden eyes.\nMOW45\nNow come with me. You are about to become the world’s first witness to our project.\nThe camera follows MOW45 through a dark entrance and switches to low light mode. A mine shaft elevator opens to let them in, closes, and begins to descend. There are no numbers or grates marking the floor levels; the elevator simply moves further and further down. After it stops, MOW45 steps out into a long hallway, passes through a biometric security checkpoint, and enters a room illuminated with ultraviolet light. Inside are two rows of six large, droplet-shaped installations, suspended in midair by a system of exposed cable supports.\nMOW45\nFirst question: Who are we?\nWe know how the rest of the world portrays SHIIVA. They think we are some evil, inhumane, plutocratic organization that abuses technology and violates ethical boundaries. That is completely correct, and completely false. From the historical position of classical humanists, the problems the world faces today are utterly incomprehensible because their solutions require exceeding the moral thresholds they can accept. But to us, those thresholds are but illusions.\nYou can see for yourself that the human instinct for survival has led a variety of regional responses by so-called civilizations. Many parts of the world have relapsed into tribalism, where humans who still have functional reproductive systems are kept in captivity like livestock. Viable semen there has become priceless. Other parts of the world have barely survived thanks to highly repressive authoritarian governments that have implemented reproductive resource rationing policies that have bred an entirely new privileged class. Europe, for example, has basically collapsed into chaos. Its Christianity-based values and culture are worthless in the face of the great reproductive decline.\nWe believe that we possess a powerful secret that can save the world. Our leader and founding father, the sage Dr. Jin Changmao, began implementing a global strategy thirty years ago to achieve this goal. SHIIVA Lab is one of the linchpins of his plan.\nNow take a look at this.\nMOW45 gestures toward one of the semitranslucent, droplet-shaped installations. The outer membrane is made from a polymer material and appears quite flexible. It is filled with a murky liquid whose original color is indiscernible under the violet-tinged light. Inside, bubbles occasionally float to the surface and disappear. MOW45 extends a finger and pokes at the membrane. Little glimmers of light shine through the turbid substance, solidifying into a green, fluorescent glow that gradually reveals the outline of a fetus about seven to eight months in gestation. The fetus seems attracted to the pressure of MOW45’s finger. Though its eyes remain tightly shut, it instinctively waves its hands and feet toward the camera before vanishing back into the liquid.\nMOW45\nWe shifted the peak of chlorophyll’s absorption curve to the left so that it could make use of the higher energy density at the violet end of the spectrum, and then integrated it into the epidermal cells of the P-series embryos. This is just a modest display of our achievements. We will gradually disclose the rest to the world depending on its level of acceptance.\nSecond question: what do we seek to accomplish? Simply put, we want to find a method of reproduction that does not require the participation of individual human beings.\nTwenty years ago, artificial womb technology replaced amniotic fluid with electrolytic solution and used extracorporeal membrane oxygenation to facilitate blood circulation in order to save premature babies. But resistance from all sides has slowed the advancement of this technology. Humanity seems to have an almost pathological fear of this sort of change. Will artificial wombs lower the status of women? Will mothers still form the emotional bonds with their children that they once did during pregnancy? Will this technology cause marital structures to collapse? Will it ossify social hierarchies? Will privileged classes reproduce without limits, or even use advanced genetic engineering to optimize their progeny? Humanity has driven slowly and tentatively to the edge of a cliff, unable to turn back.\nBut we never stopped moving forward.\nMOW45 strides forward, crosses the room, then passes through another hallway into an exhibition room suffused with green light. Four rows of display racks are lined with glass jars containing various fetal samples ranging from fully intact bodies to scattered organs, quite a few of which have developmental deformities. Some are barely recognizable as human.\nMOW45\nWe’ve gone down a long, dark, and winding path.\nUsing an artificial womb to incubate a fetus is one thing. Directly combining genetic material into a fertilized ovum is something else entirely. The distance between these two feats is like the distance between the Wright brothers’ Flyer and the Apollo 11 shuttle. These jars are the footprints of our past failures. They were, without a doubt, all living beings. But they did not die in vain. Every successful specimen we create bears the mark of these failures, in the same way that humanity bears the accumulated history of its evolution. If anything deserves condemnation, it is the Panama attack, where hundreds of embryos were destroyed in the name of “morality.” Even though those embryos were genetically 100% human, just because they were intended to be brought into the world through a different way, they were seen as alien and thus murdered. And this is what you call civilization.\nMeanwhile, we’ve been inundated with requests, mostly from some of the most powerful groups on Earth: extremist sects who want to create physiological distinctions among humans; transhumanists who want to design a race of perfect super-babies; those who want to reserve our services to particular regimes or races so that they may achieve geopolitical dominance through superior reproductive capability. We’ve conducted experiments on a few ideas that seemed interesting, but we have never accepted any of these requests.\nMOW45 walks past several specimens, then slows down, gazing at the not-quite-human remnants.\nMOW45\nTo us, these ideas are so typically human they are laughable.\nThe camera suddenly rises into the air, displaying a birds-eye view of MOW45 as he walks between the shelves of samples. He resembles an evil magician in a dissection room.\nMOW45\nPerspective matters. The limits of coarse scales—whether in space or time, whether macro or micro—will always lead to crude judgments, leading to disastrous consequences.\nFor example, in 1978, the first “test-tube” baby conceived through in vitro fertilization was born. In 1987, the Roman Catholic Church denounced surrogate pregnancy as “violating a child’s right to be conceived, carried, and delivered by its biological mother, as well as its right to be raised by its biological parents.” In 2009, after the surrogacy business had been thriving for twenty years, India still had not implemented a single law to regulate the industry. Three years later, it issued crude measures that banned surrogacy for clients who were single mothers or same-sex couples. Next it banned surrogacy for all foreign clients.\nFear of technology has fostered confusion in both thought and action. You are unable to consider the problem from the perspective of humanity’s shared future as a community. Most of the time, you ignore the billions of people living on this earth, all wholly distinct individuals with unique inner lives and needs.\nMOW45 abruptly stops walking.\nMOW45\nAh, it’s about time. I’ve been asked to reduce the proclamatory style of my rhetoric by about twenty degrees.\nWe must undergo disinfection now.\nThe drone follows MOW45 out of the exhibition room and into a disinfection room. White mist spurts from the walls, dissipating through the narrow chamber, gradually condensing into tiny droplets which then evaporate. The door opens. Before the camera appears a marvelous golden pond. MOW45 walks along a path of stepping stones towards the pond’s center as the drone hovers around, recording the surrounding scenery.\nThis place appears to lie within the ruins of some ancient Buddhist temple. Life-size apsara statues line the walls of the square pond. They are smiling gently, their limbs nimbly arranged in dancers’ poses. The water comes just up to their belly buttons, revealing their finely embellished waists. At the bottom of the pond are forty-nine yoni icons representing female reproductive organs. Each mounted on square pedestals, they are neatly arranged in rows of seven by seven. A lingam protrudes from each yoni icon—forty-nine swollen penises rising up underwater.\nThe camera returns its focus to MOW45.\nMOW45\nLingams are one of many forms of the god Shiva. They’ve been described as the root of all creation. It is said that when Shiva’s lingam manifested on Earth, Brahma transformed into a swan and flew upwards, while god Vishnu transformed into a boar and traveled down; even after a thousand years, neither had reached an end in their journey.\nLast question: why now?\nBecause humanity has run out of options.\nWe ought to thank science fiction novels and films: “Brave New World,” “Blade Runner,” “The Island,” and so on. Though laughably absurd, they did raise many interesting thought experiments, and have helped us avoid the risk of destruction. We ran calculations on every imaginable option in search for the best solution.\nWe don’t want this technology to become an accessory to slavery or organ harvesting. At the same time, we refuse to contribute to existing discrimination or new racial conflicts. Many who are wise have realized that this technology can allow humanity to truly discard the heavy bonds of bloodline, family, race, and even ideology. It can lead us into a wholly new era as one unified community.\nThe neohumans will not have parents. The genetic composition of future generations will be completely determined by algorithms. Machines will draw upon the gene pools of a billion humans as well as all of the possibilities that might arise after thousands of future generations.\nThe new humans will be stripped of their inefficient capacity for sexual reproduction. Each individual will have the freedom to determine their own sex. Or they may be entirely sexless. These choices will be entirely up to them.\nThe new humans will no longer bear the responsibility for propagating their own genes. The genetic data of every individual will be stored for the creation of future generations. Everyone will live for themselves, and everyone will live for the whole of humanity.\nDeath will no longer be a cause for fear. The new humans will view life with a holistic perspective, and understand that death is in fact the only pathway to eternal life.\nOf course, we understand that throwing salt into the ocean is not the most effective method for changing the salinity of the sea. Many political regimes have opened their doors to us. They have agreed to grant citizenship rights to the neohumans, and even have created special protective zones for them. But changing the world still remains an enormously difficult task.\nAfter all, birth and ruination, creation and destruction have always been the two faces of Shiva.\nWe’ve altered our ways of thinking: but perhaps we ought to learn from human experience as well, so that you will be better able to accept us.\nTherefore, we’ve chosen some families and individuals from around the world upon which to bestow our gifts. Meanwhile, we’ve opened up applications for more people around the world to join our ranks. We hope we will be able to both change your lives as well as the way the rest of the world sees SHIIVA.\nNow, it is time.\nMOW45 pulls down his hood. The mosaic of blurred pixels quickly expands to conceal his face, but the camera manages to catch a brief frame of MOW45’s visage—a head that is half-human, half-machine. Slowly he lifts his arms like a magician. The water begins churning in sync to his movements, reflected golden light roiling around the walls and ceiling.\nMOW45\nIf there is one thing on this earth that machines cannot comprehend, then it is . . . well, what humans call love. We hope that you can love these children as much as you love yourselves.\nFade to black.\nThe music from the opening title begins to play again, a minimalistic electronic tune overlaid on a sample of a strengthening heartbeat.\nNeha, head dripping in sweat, softly hums a tune to the baby in her arms. She presses a bindi dot between the baby’s furrowed eyebrows. The baby struggles to open her eyes.\nCAPTION\nAanadi was born 19:02 local time on February 3, 2016. Her name means “always happy.”\nWu Yingmian stands by the bedside, watching her newly-delivered baby in her surrogate mother’s arms. She grips the surrogate mother’s shoulders, her eyes glistening with tears.\nCAPTION\nWu Yingmian’s baby was born 16:37 local time on July 12, 2021. She requested we keep her child’s name private.\nA baby girl covered in blood is lifted to K.O.’s face. He manages to murmur only the words, “You are so beautiful,” before losing consciousness.\nCAPTION\nSakurado Ohno was born 01:12 local time on April 24, 2027. Doctors were unable to save Kenji Ohno, who died at 4:45 on the same day from excessive blood loss.\nFatima, gently rocking her baby in her arms, croons, “Hey, I’m your Mommy.” She hands her daughter to Hanna. “And this is also Mommy.”\nCAPTION\nAnna “Mondschein” Kühn was born 6:21 local time on November 29, 2031. “Mondschein” means “moonlight” in German.\nMOW45 raises both hands into the air. The forty-nine lingams rise from the water, slowly splitting open like lotus flowers in blossom, each one revealing a pink, wet infant at its center. Suddenly, the infants begin crying in unison, as if by command. They sob in fits and starts as petal-shaped mechanical arms snip their umbilical cords, coughing out the excess amniotic fluid from their lungs. Their cries then rise in volume like a well-rehearsed symphony, overlaid on the sound of a beating heart and an electronic rhythm.\nCAPTION\nForty-nine neohumans were born local time 8:08 on August 8, 2038. They are collectively known as the “gift generation.” Among them, only a third survived under the care of adoptive parents. These survivors altered the course of human history.\nBlack screen.\nTITLE\nIn This Moment, We Are Happy: A Documentary\nOriginally published in Chinese in Dandu Reading 19, January 2019.\nTranslated and published in partnership with Storycom.\nChen Qiufan was born in 1981, in Shantou, China. (In accordance with Chinese custom, Mr. Chen's surname is written first. He sometimes uses the English name Stanley Chan.) He is a graduate of Peking University and published his first short story in 1997 in Science Fiction World, China's largest science fiction magazine. Since 2004, he has published over thirty stories in Science Fiction World, Esquire, Chutzpah, and other magazines. His first novel, The Abyss of Vision, came out in 2006. He won Taiwan's Dragon Fantasy Award in 2006 with \"A Record of the Cave of Ning Mountain,\" a work written in Classical Chinese. In English, his short stories have been published in Clarkesworld, Lightspeed, MIT Technology Review, Slate, Pathlight and other venues. His novel, Waste Tide was published by Tor in 2019.\nRebecca F. Kuang is a Marshall Scholar, Chinese-English translator, and the Astounding Award-winning and the Hugo, Nebula, Locus, and World Fantasy Award nominated author of the Poppy War trilogy and the forthcoming Babel. Her work has won the Crawford Award and the Compton Crook Award for Best First Novel. She has an MPhil in Chinese Studies from Cambridge and an MSc in Contemporary Chinese Studies from Oxford; she is now pursuing a PhD in East Asian Languages and Literatures at Yale, where she studies diaspora, contemporary Chinese literature, and Asian American literature.", "source": "https://clarkesworldmagazine.com/chen_08_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: In This Moment, We Are Happy by Chen Qiufan, translated by Rebecca Kuang"}