{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "R S A Garcia", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "WCHIHDfce45iIe07KSVJ5VFrdMc=", "id": null, "license": null, "comments": "", "raw_text": "20630 words, novella  Bishop's Opening  2022 Finalist: Ignyte Award for Best Novella 2022 Finalist: Theodore A. Sturgeon Memorial Award Old as she was, the Kiskadee had done three full delivery runs without a single safety incident. So naturally, with the crew relaxed after a fourth successful delivery and launch, and eight cycles after Reece slingshotted the starship around Tavaco to head back to the Roost and their next job, their luck ran out.  Sebastian was in the middle of his daily workout when the shrill bark of the fire alarm brought him to a halt.  “Where’s that coming from?” he shouted as he hurried to unbuckle himself from the treadmill’s harness with sweaty hands. Officially, he was the newest crew member, two years into a three-year contract and designated as a cargo handler. The alarm meant the “other duties as assigned” part of his contract was about to kick in.  “Ventilation shafts ten and eleven,” Reece replied in his ear.  Sebastian was shoving his feet into his mag-boots when the pilot added, “Origin point—oxygen unit four.”  Shit. The schematic in his head confirmed that was one of the units for the living quarters, and the ventilation shafts fed into both cabins. Plenty of fuel for the fire.  “Get into that suit, Bas,” Olly said. She sounded calm, but Sebastian knew she was worried. If they couldn’t contain the fire by starving it of oxygen, then finding and smothering the source with CO2, they’d have to vent the entire level.  “Two minutes and I’ll have eyes on it,” he said, ducking through the airlock into the corridor. The hexagon shaped Kiskadee was mostly its aft hold, with everything else jammed around or in front of it, so he didn’t have far to go to the cabins. But that also meant a fire could spread fast, and they’d never see it coming.  “Corridors clear,” Reece verified.  The nearest suits were between Olly, his, and Reece’s cabins, so he would get a look at the fire as he dressed.  When he glanced through the porthole into his shared cabin, there was nothing to see but neatly made bunks and storage. He leaped the few feet to Olly’s airlock, peered inside, and cursed.  Several spherical balls of yellow-orange flame surrounded hearts of indigo blue, floating through the air like misshapen balloons. They lost their shape and spread out into rippling carpets as they encountered more oxygen. One drifted down to touch the protective barrier above the red-tipped lettuces growing in Olly’s small hydroponics garden. The flame died, but the transparent plastic blackened, short zigzag patterns scorching its surface as the invisible fire continued.  “I have eyes on it. Vent the Habitat, then Olly’s room.”  He slammed his hand down on the lock and the door opened.  “Sebastian, what are you doing?” Reece asked, his voice sharp.  “Thirty seconds!” He ducked under a fist-sized ball of flame and headed for Olly’s rectangular garden. The plastic over another part of the garden grayed to opaqueness as it melted inward. To his right, a globe of fire settled onto Olly’s bed and deflated into nothingness as black patterns burned into the sheets and restraints.  “You don’t have thirty seconds,” Olly said. “I’ve already sealed off and powered down the unit in Habitat Maintenance. Venting the cabin now.”  Sebastian ripped the plastic off the garden, cradled the huge tray—made light by low gravity—against his chest, and leaped for the doorway.  “Do it!” he called out as he twisted in midair, touched down in the corridor, and slammed his elbow against the lock screen.  The airlock clicked over to sealed as he carefully placed the tray on the ground, then wrenched open the double doors of the storage unit.  “Sebastian?” Reece asked, his tone clipped.  “Fine, I’m fine! Getting into the suit. One minute to deploying CO2.”  An hour later, when he emerged from Habitat Maintenance, he found Olly had already laid down the foam in her quarters. She took her helmet off as he approached and shook out her braids.  “Why?” was all she said, dark eyes narrowed with anger.  He stopped. He’d seen her this angry once before, and it was best if he kept his distance so she wouldn’t be able to physically pummel him. She’d done that last year, after he’d turned back on a near-empty oxygen tank to grab her safety-line when both her anchors were severed during a space walk.  “It didn’t take me ten seconds—”  “You had no idea how far that fire had spread.”  “I’ve seen fire like that before. Once you get the shafts closed and the power off, you’re going to be fine.”  “Opening the door could have fueled it!”  “Goodness gracious, I’m fast enough to avoid great balls of fire,” he said, with a slight smile at his own bad joke.  She advanced on him, poking his chest with her finger. “Not funny, Bas.”  “Okay, maybe it’s a bit forced—”  “Just tell me why.”  He grew serious. “Because you love that damn garden. It’s taken you three contracts to afford it, and you just got those lettuce right. I wasn’t going let you lose it.”  “Really?” She flung up her hands, her expression incredulous.  “I knew I could save it. So I did. And anyway,” he gave her a grin, hoping it would go a long way to settling her nerves. “I didn’t want to be stuck eating dehydrated protein bars and sauce packets for two weeks.”  Olly’s teeth bit into her lower lip, and she made a sound of frustration. “What am I going to do with you?”  “I’d say take me to bed because your shift’s up. But I’m guessing that’s a no.”  “Good guess.”  He made a sympathetic hum in his throat and drew closer. “What if I do the reports while you and Reece deal with Dispatch and Facilities?”  “Is this your way of trying to make me overlook your reckless behavior?” she said, eyebrows arched.  “Is it working?”  But Olly only huffed and walked away, leaving him to follow.  A knock made Bishop Kingston look up from the plans on his desk. “Come.”  The door to the office, inlaid with mother-of-pearl tracings, folded open. Kingston’s White Knight entered and fisted his right hand against his bare chest. A glittering 3D tattoo of two diamonds inside a circle—the crest of Sept Kingston—flashed at Bishop from the Knight’s forearm.  “A summons, Bishop. Kingside,” he said, his voice thin as it emerged from the pinhole speaker of the full-mask he wore. The mask was as white as the Knight’s sheer pantaloons, and edged with green and gold, the colors of Sept Kingston. Bishop wore a similar mask himself, only his had the crest etched into the left cheek. It was twin to the tattoo on the back of his right shoulder.  He rose smoothly from his desk, refusing to let the tension that gripped him show itself in his movements. “The Audience Room, I presume?”  “The King awaits you in her Chambers.”  A matter too sensitive for the Rooks or Kingside Pawns to hear then. His mouth set in a grim line. It would not be good news if it had to be discussed in Chambers, and with Grandmaster Kingston off-world, he assumed the worst. That it had something to do with the Kingston himself.  The Knight accompanied him through the hollowed out, highly polished halls of the Sept. The walls were a honeyed color, petrified wood that had aged to perfection since the time the first colony ships had landed on Valencia. One of the first Septs grown from the Greatwood, Sept Kingston was a sprawling mansion surrounded by its own village, every bit of it pruned from the sentient forest that covered much of Valencia’s main continent. Vines dripped from arches and windows, fluttering in the breeze that drifted through their sparkling flowers, carrying their sweet floral scent everywhere.  The King’s Chambers were on the third floor, deep inside the labyrinthine Sept to make it difficult for saboteurs and assassins to find. When Bishop called out and the King bade him enter, the Knight bowed and turned back down the corridor. Bishop made sure he had departed before he touched the doors open.  The King of Sept Kingston sat at the console that curved outward from the massive tree trunk growing through the center of her suite of rooms. Her mask was the same tan brown as her skin, with tinted eyeholes and a speaker in the center of the parted, painted-on red lips. Her capable hands danced along the Coretree Analysis Unit, inputting model calculations to ensure their nutritional value before she fed them to the crystalline quantum Coretrees themselves. Through the tinted windows on her right, Bishop could see the glittering expanse of the Sept’s vineyards beneath the morning sun.  Bishop bowed and waited. The King would take her time to greet him, as the models were of the utmost importance. Feeding the Coretrees was the most important job of every Sept and Grandmaster. Without the Greatwood, no ships could be grown, no Septs improved, no trade conducted for necessary resources. Without the Greatwood, the quantum power of the Coretrees could not be used in Valencia’s other business. The solving of problems, great or small, computational or otherwise, for off-worlders who would pay good money to have the impossible made possible.  And right now, after several tempi of inexplicably low Harvest, and Coretrees that bore rotten fruit and errors, they had their own urgent problem to solve. The King spent most of her time working on this with the Grandmaster, while the Queen and Bishop made sure their strategies in the Great Game of Valencian politics did not suffer and leave them vulnerable to attacks from other Septs. But Harvest was near, and the season of Petit Caréme almost upon them. Soon, this tempi’s Term of the Greatwood would close, the Septs’ rankings would be posted, and several months of reprieve from the deadly games would begin.  Not that his work would end. No, Petit Caréme was the planning season for his kind.  The King froze the hologram in front of her and looked up at him. “Bishop. You are well, I hope.”  He hated these false pleasantries, but it was not polite to begin a conversation without them. “My King. I am in excellent health. Thank you for asking. You are also well, I hope?”  She waved a dismissive hand. “I have a task for you.” Her voice was gentle and low but threaded with hardness.  Behind his mask, Bishop pursued his lips. “Of course, my King—”  “Bishop,” she interrupted him. “Let’s speak plainly.”  Old anger weighed heavy on his tongue, but he only said, “As you wish.”  She rose from the carved chair and went to the window, narrow shoulders visible beneath her sheer robes. She was tiny, barely above five feet. Her black hair had been crimped and curled into a bejeweled knot. He stared at the back of her neck and tried not to think of how easily he could break it.  “Are you still angry, Bishop? About what we did? What we took from you?”  He knew her questions were traps, so he said nothing. He clenched his fingers against the urge to scratch at shoulder scars that had completely faded many tempi before.  “You can tell me the truth. It would not leave this room.”  He knew it would not, but he had no desire to ever trust her with his secrets again. She was King now. And he was a Bishop still earning his way back into his Grandmaster’s trust.  She sighed. “You always were so careful. I never thought you would defy him. You know how he is.”  Oh, he would not discuss this. Not for her, not for anyone. “You did not send for me to discuss my . . . feelings.”  “Of course not,” she said. “As Bishop, you have none. And you are right. This is no time to indulge my curiosity.”  He was not fooled. She was prodding, always prodding, for any sign of weakness. Any sign of betrayal. He was grateful for a less subtle attack this time, at least. The other kind was harder to guard against.  She turned and came to stand in front of him.  “The Grandmaster has secured a Conclave with Sept Bartica. He will meet their Grandmaster at Greater Paradise on his return from the meeting with the Consortium regarding the search for their lost slaver ship.”  “But he will be in the company of the Valencia. Will he allow such a move to be witnessed by her?”  “He plans to be discreet, but she is an ally these past decades,” the King stated in her soft way. “For the moment, we have nothing to fear from the Royal Sept since we gave her our full support in the trial of the last Valencia.”  The King was right, but the Royal Sept Valencia was the pinnacle of the Great Game, their Grandmaster its best player. Bishop could never lose sight of how dangerous all the Grandmasters of Valencia were, allies or not. This one had almost cost him his life, after all.  No, he reminded himself. You did that with your own foolish, emotional actions. No one else is to blame.  “You will take First and Second Rooks and such Pawns as you deem necessary and leave immediately for the space station. You will protect the Kingston and bring him home safely.”  Bishop bowed his head. “Of course.”  “Take the Cook with you. The Grandmaster would appreciate satisfying meals after all these weeks of travel. The Valencia’s palette is not to his taste.”  He straightened. “Cook would welcome that. He has wanted to go off-world for some time now.”  “I’m aware. And you must deal with the matter of his service. Use the time to bring the issue to a conclusion. I do not wish the Kingston to have to take action.”  “That will not be necessary,” he said, stung at her censure and interference in his Septhold duties.  She stepped closer to him and signed instead of speaking, in case listening ears were nearby. “Don’t make me do your job again, Bishop. I don’t enjoy it.”  Bitterness filled him at her lies, but he kept his body relaxed. He signed back, “I understand your concerns, my King. I will allay them.”  Her fingers were as graceful as her words. “See that you do.”  Reece chirped Dispatch at the Roost, who then contacted Eastern Allied Corporation’s Facilities Department. After he and Olly ran a full cycle of remote checks with Engineering to ensure the fire wasn’t caused by human error, and endured several lectures from Accounting about insurance premiums, the request to charge the repairs to Corporate Billing was approved. Sebastian filled out the necessary forms and Reece reviewed and filed them.  The Kiskadee couldn’t operate unless it could pass inspection when they returned to the Roost, so it made sense to get the work done immediately, before they had to pick up their next cargo. They put in for a few cycles shore leave during the repairs. EAC granted the leave, then directed them to Greater Paradise Space Station. Olly knew the station well since she’d spent most of her childhood there. It had a corporate-approved repair shop and was just two weeks away.  Happily for Sebastian’s food-loving soul, it also had an unusually large food court level that sold more than variations on compressed seaweed and recycled water, because the planet Paradise and its resources were nearby.  Once the paperwork was done, Sebastian helped Olly move into their cabin, her little garden a splash of green in the gray room, and they settled in for a slow, boring ride to one of the great mysteries of the universe . . . the Arbor of Greater Paradise.  Sebastian could still sense the leftover tension in Olly as they worked. That was his fault, Reece told him on the Bridge while Olly was tending to her plants. He’d scared them both, and Olly wouldn’t forget that easily.  “Fix it,” Reece had said.  So, when they finally went to bed, he settled under the sheets and pulled Olly close. She threw her bare leg over his and turned her head to where Reece floated alongside their bunk. His eyes were closed, but he was only resting them; he couldn’t sleep while technically on watch.  “Tell me about the best thing to eat on Greater Paradise,” Sebastian coaxed, fingers drifting back and forth over her smooth shoulders.  “Bas, we still have weeks of rations to get through. Why would you want to hear about what you can’t have right now?” Olly replied. Straps crisscrossed atop their blanket, cocooning them against the chill of their quarters. They were almost never all in one spot at the same time, but after the fire, the unspoken agreement was they needed a little time together.  Olly walked her fingers over his bare chest. He twisted, choking on laughter that carved dimples into his brown cheeks, and slapped at her hand. “Stop!”  “It’s hilarious how ticklish you are.”  Reece grunted beside them and flung one large, muscled arm over his bearded face.  “Anyway, you know the answer already,” she added.  “Tell me again. It will help me forget how small this bunk is.”  She folded her arms across his chest and rested her head on them, a slight smile on her face. “This bunk is not small. I’m a generously proportioned beauty. Isn’t that right, Reece?”  Their pilot did not answer, his barrel chest rising and falling evenly, as if he slept.  Sebastian ran his hands over her long braids and the metallic twists of wire that decorated them. He knew his smile was irresistible, so he wore her down with it until she groaned and said, “I just want to sleep, Bas.”  “So do I. Help me?”  “What’s there to tell?” she said softly. “Doubles is the best food in Greater Paradise. Everyone knows.”  “How did you find out about it?”  She settled against him. Sebastian rubbed one hand over the soft rolls of her back and stretched the other to massage Reece’s smooth bald scalp, the way he liked.  “Whenever my mom had to work late at the ice factory, she’d take me to hang out with Gran at the docks until it was time for home. They had a mess room, so it wasn’t as dangerous as being alone on the factory floor, or in our quarters. Sometimes, she’d be so late, Gran would take me for dinner. That’s when we’d go down to the Basement, to Sticky’s Place.  “Sticky was from a long line of cooks. His however-many greats came up from the islands before the Wave, settled in the States, and moved on to the colonies when the Union fell apart. He’d left a cruise line to set up his own stall on Greater Paradise. The recipe for his best dish had been handed down for generations. Some of the ingredients were difficult to find, but since Greater Paradise was parked by an Arbor, he could trade with the Valencians for fresh herbs and everything else. Every time Gran took me to his stall, we had the same thing.”  “Four doubles, everything, plenty pepper.” Sebastian sighed, his limbs relaxing beneath her warm body and the grip of the soft restraints. “What were they like?”  She made a contented sound, and he watched her lashes feather her cheeks as she went deeper into the memory. “Two pieces of round, soft, fried dough the size of your hand, with creamy seasoned chickpeas sandwiched between them. They came with a choice of condiments. Pickled, grated cucumber slaw. Sweet, earthy, tamarind sauce. Your choice of flavored pepper sauces. Mango, banana, or pineapple. You ate them right there, with your hands, standing or sitting on a stool, and the only rule was you couldn’t order just one.”  Sebastian closed his eyes, imagining a tiny version of Olly sitting on a stool too tall for her, boots firmly curled beneath the rungs to keep her in place in low gravity, face spotted with the delicious remnants of yellow legumes.  “The first time Gran takes me there, she orders slight pepper, but this tourist standing next to us tells Sticky, everything. And then they order all the pepper sauces because they think they’re preserves. No one bats an eye because everyone likes food spicy in Greater P. Only way you can taste anything out here. But the tourist, they don’t know shit. They find out though. Never seen anyone drink that much milk in one go.  “Best part is, Sticky watches all this and the only thing he asks is, ‘You good?’ and the tourist catches their breath and says, ‘Two more, please.’”  They both laughed as if the ending were a surprise, the familiarity of it wrapping Sebastian in drifting, cozy thoughts.  “Doubles.” They started as Reece spoke in his deep voice. “Makes me think of tennis.”  “Five whole words,” Olly teased. “Chatty tonight, aren’t you?”  “I didn’t know you were listening to the story,” Sebastian smiled at him.  Reece didn’t move his arm, but he shifted his head ever so slightly into Sebastian’s touch. “I always listen.”  Olly laughed softly. “No tennis in Greater Paradise. Sticky said they called it that in the islands. No one remembers why. I suspect he kept the name because there was mystery to it, like the Arbor.”  “Maybe,” Sebastian yawned as he spoke, “it reminded them of home. You know. The immigrants who left the islands. Maybe they were just holding on to what they could. Even if it was just a name.”  Olly was silent for a while before she said, “Probably.”  “Olly?”  “Yeah?”  He lifted her chin and kissed her before pulling back to brush his thumb over the velvet of her cheek.  “Forgive me?”  She made a derisive sound in her throat. But then she leaned forward and pressed her warm lips to his again. “For now.”  “Only for now?”  “We both know this won’t be the last time,” Reece rumbled, eyes still closed.  He winked at her. “I can live with that.”  She sighed. “That’s what I’m afraid of. Then we’d have to find a way to tell your mom her baby got himself killed.”  “She’s got eight other kids to fret over. She barely notices I’m gone.”  Olly stroked a finger over his eyebrow. “Someday, Sebastian Thomas Carver, you’re going to figure out how unforgettable you are. Then God help us all because you get laid enough as it is.”  Reece didn’t join in their gentle laughter, rising instead to head up to the bridge and leaving them to rest in each other’s arms.  “So, it’s true there’s gravity on Greater Paradise?” Sebastian asked. They were five cycles out, and he was more than ready to start his short vacation.  “Only where the Arbor’s grown onto the station. No one knows for sure how or why,” Olly said over the Kiskadee’s chirp. She was down in the galley, getting something to eat. He could tell from her muffled chewing.  “But the Valencians know.”  “Of course, they know. It’s probably something to do with them. Best guess anyone has of how their trade routes work is the Arbors camouflage something their ships use to jump long distances. Anything with that amount of power can support artificial gravity.”  “Has anyone ever asked them though?”  Reece made a soft huffing sound next to Sebastian. His version of laughter. Olly outright chuckled in his ear. “Bas, no one asks the Valencians anything. If you’re smart, you stay out of their way. They’re easy to offend, and if you piss them off, there’s no one to turn to. They’ll shove you out an airlock so fast your head will spin.”  “That’s murder.” He glanced at Reece. “There are laws against that.”  “Greater Paradise isn’t a family commune,” Reece said.  “He’s right. The fleet you grew up in was focused on keeping everyone safe because you were all families. Greater Paradise is about commerce. Station Agents uphold the laws for regular folk. The Valencians are . . . not that. No one tells them what to do. And there’s no recourse for anyone who messes with them.”  “But the Pan-African stations don’t work like that. The Kairi sure as hell don’t work like that. You kill one of them anywhere, the entire Sibling Army comes for you.”  “Government versus Corporate,” Reece grunted.  “You’re not wrong though, Sebastian. In some places, murder’s only a problem if the wrong people die,” Olly said.  Sebastian considered that, a troubled frown on his face. “What do Valencians look like?”  “Assholes,” Olly said. And no matter how he pressed her, she would not say more. So, he put the Valencians out of his mind and settled into preparing for his first visit to Greater P, a name Olly told him was an inside joke because for most residents, Paradise it was not.  Mostly, he planned the food he would try from the dozens of proprietors who serviced the thousands that passed through Greater P. Olly had told him what she remembered of her childhood there—every dish she’d eaten, every corridor she’d walked.  But she couldn’t prepare him for the actual sight of the Arbor. From the moment it first appeared on the viewscreens as a winking star, a bright light that grew larger and larger, he could not look away. The filters had to adjust, just so the rainbow dance of it didn’t blind them. The Arbor spun in the starlit darkness, a massive forest of twisting trunks, thin leaves, and curling tendrils. Greater Paradise rotated slowly beside it—two hollow metal circles connected by an elevator. The outer hull of one end of the station had been captured by the crystalline oasis and glittered like the Arbor, branches twisting over the rotating habitat as it grew toward the other end of the station.  “There she is,” Olly said as they watched the station draw nearer. “Home, sweet home.”  Sebastian floated above the floor next to Reece, hand curled around a hard thigh to keep him anchored, while Olly sat strapped in on his right. “Are you glad to be back?”  She shrugged, sliding her fingers between those of his free hand. “Gran and Mom are both gone. Nothing here for me now.” But he knew that dismissive tone. Sensed something unspoken and painful under it. Olly was as private as Reece about many things. It was part of the reason they made such a good team. Talking was optional on the Kiskadee, and though he was always up for a chat, a joke, or a story, Sebastian didn’t mind silence.  As they watched, a ship glimmered into being beside the Arbor, a mirage settling into solid shape without warning. Although the forest dwarfed it, Sebastian drew in his breath at the dimensions and light-limned irregular angles of it. He’d never seen a ship like it. It looked like something carved from enchanted wood and fairy light.  Olly groaned beside him. “Great. A Valencian ship is in port.”  “That’s what they travel in?” Sebastian’s lips parted as he leaned closer to the screen. “It’s incredible.”  “Talk is they grow their ships. Probably from the same thing as the Arbor, as they seem to thrive out here in absolute zero without any sustenance.”  “I would give anything to see that up close.”  “Enjoy the view,” she said. “This is as close as they let anyone get.”  “Why?”  “I already told you,” she said. “They’re assholes.” And her usually amused, cynical tone carried a bitterness Sebastian hardly ever heard from her.  “You hate them, don’t you?” he asked, turning to look at her profile, at the long line of her neck and the small, rounded tip of her nose. Her eyes when they rested on him, were a deep, dark brown he couldn’t read. She laid a gentle hand on his cheek, but all she said was, “Better get ready to dock.”  Bishop was alone in the Grandmaster’s Penthouse suite when the call came from the Kingston. Once it was over, and his Grandmaster’s virtual form had dissipated, Bishop cursed under his breath.  The Grandmaster Valencia’s ship had failed to jump to the nearest Arbor after leaving Consortium space because of another instance of miscalculation by the Coretrees. There had been minor errors before, on Valencia. He’d heard of an incident several tempi ago, when a Sept vineyard transition deposited travelers at the wrong Sept. But this was far more serious. This time, a mistake had left the Valencia’s flagship stranded half a galaxy from their planned destination.  Whatever had caused the error, the crew no longer trusted that the ship’s quantum exchange would work accurately. As a result, the Grandmasters had chosen the long, slow flight to another Arbor. From there, they would transition to their Septhold vineyards safely, and allow the ship to be inspected and repaired.  But that meant his Grandmaster would not arrive in time for the meeting. He expected Bishop to handle it instead. Bishop did not look forward to the task of soothing the Bartica’s temper once he realized the Kingston was not in attendance.  He gathered his Pawns and joined the Rooks that waited in and around the most exclusive private conference room of the Greater Luxury Hotel. As part of the normal power play of etiquette, the Bartica had not arrived yet. But as he was about to commit a breach of the original Conclave agreement by representing Sept Kingston instead of the Grandmaster, the least he could do was allow them the victory of being the last to arrive.  However, when the doors opened, the Bartica did not enter. Instead, his King strode into the room with their Black Knight and paused on the other side of the wide, circular table inlaid with precious minerals and stones.  Bishop rose to his feet and bowed. “King Bartica, I welcome you to this Conclave with sincerity and good faith.”  The King was not required to exchange pronouns with, nor bow to, anyone of a lesser rank, so they inclined their head instead. On the forehead of their pale blue mask was the Bartican crest of a gold triangle with a smaller red one within. “You are not the Kingston.”  “And you are not the Bartica.”  The King of Bartica curled dark brown knuckles around the back of a chair but did not pull it out to sit.  “Why does he send a Bishop to a Conclave?”  “The Kingston deeply regrets the necessity for his absence, but if you are willing to accept my credentials, we can begin negotiations.”  The King was silent for almost a full minute, hands relaxed around the chair while Bishop waited, senses on high alert.  “I do not find this acceptable.”  If he was not bound by Valencian protocol, Bishop would have given vent to the kind of language that was forbidden once you were accepted into a Sept. Why could nothing be simple?  “This is a primary Conclave, your first overture to us. Surely, the time to insist on such strict procedure is not yet at hand?”  “What we wish to discuss with your Kingston is not for the ears of a mere White Bishop,” the King replied, the very slightest thread of annoyance in their voice. Bishop noted that with mild surprise; they must be deeply invested in this Conclave to let their disappointment be so obvious.  “My apologies. Perhaps I can relay a message to impress upon the Kingston the urgency of your suit?” he offered, curious now as to what the Conclave would have addressed. This was no mere exploratory move. The Bartica had meant this in earnest, if his King was anything to go by, and that meant this Conclave might have had . . . ramifications.  Interesting.  The King released the chair and flicked a hand at their Knights. They left the room and Bishop motioned to his Rooks to do the same. Once they were alone, the King came around the table and they stood chest to chest, heads bowed. Bishop cupped his palms, and the King made several signs within it before raising their head to look directly at Bishop.  “I understand,” Bishop said. “I will pass on your message.”  The King spun in a swirl of silken robes and vine perfume and walked out of the conference room.  Bishop sank to his chair, thinking, his heart pounding hard.  The King, he now knew, was terrified. He had used the old language to tap out short words into Bishop’s palm. No wonder the Bartica had not come himself if those three words were true.  Moves without Honor, the King had tapped, and Bishop thought it was a wonder his hand remained steady afterward.  There was only one way to play the Great Game without honor in Valencia. Only one way to make moves that would be condemned by every Sept, in public and private, as outside the rules of Honor.  Someone planned to challenge the ranking of the Septs. Change was on the way. Perhaps even . . . insurrection.  And with that would come opportunities and openings he might find very useful indeed.  When First Rook returned a few minutes later to report the King had left and the hotel was clear, he sprang from his seat with energy he had not had in many tempi.  “Send for a car,” he told. “I must return to the flagship.”  This was news that could only be properly shared in person.  When they stepped out from the noise and heat of the bay they’d been assigned to one cycle after their arrival, Sebastian felt like less of a visitor and more like he was returning to a familiar and beloved place.  Olly had warned him that things would not be the same as in her stories. Station turnover was common. People came and went frequently, and places were always being added, or torn down and replaced by something new. But he was so rarely in port on a station this big, Sebastian felt the relaxed thrill of a true vacation. He walked the narrow, crowded lanes, craning his neck like a tourist at the levels that rose above them in spirals and connecting tubes.  “Still smells like too many people,” Olly said, wrinkling her nose as she shoved her hands into the pockets of her utility pants.  “You’re just sensitive because it’s been the three of us for so long,” Sebastian countered, staring at the shops and flashing ads while he ignored the endless permission pings on his chirp.  He stopped to stare at a gorgeous image of a teeming ocean in front of a travel registry and Reece moved in behind him so close, he felt the heat of his body against his back.  “Didn’t get around to visiting the beach on Tavaco,” Sebastian said, berating himself for not going alone when Reece and Olly refused. He was too used to the rules of growing up as part of a large family in dangerous places. No solo outings, just in case.  Reece’s warm breath puffed into his ear. “Next time,” was all he said. Sebastian turned, surprised. “You mean it? You’ll come?”  Reece had a grimace on his face as he stared at the display, but there was no mistaking his assenting grunt.  “Well,” Sebastian said softly. “Looks like Olly gets to take watch next cycle.”  Pausing next to Reece, Olly shook her head. “Wrapped around his finger.”  Reece shot her a look, and she sniggered before striding away, mag-boots clicking. Sebastian bumped shoulders with Reece as a thank you before they strolled after her.  All in all, everything felt . . . perfect.  Until they got to the Basement and stood where Sticky’s should have been, and it was a Creole food stall instead.  The owner looked at them with mild disbelief when they asked about Sticky’s. “You gone ah long time. Sticky’s closed since before I come here, and that was right after the Blowout. Years now.”  “But the doubles? The roti?” Sebastian said, heart sinking.  “Don’t sell them thing out here now. Have to go Arborside. By the rich people them.”  Sebastian tried to convince her to go with him, but Olly would not listen. “We’re not going into Valencian territory,” she said firmly as they walked back toward the unimaginatively named Busy Junction where people, hotels, shops, restaurants, and stalls met in a chaotic, food-scented crisscross of lanes. “It’s dangerous and there’s plenty of good food right here.”  “We’ve got time to sightsee. We could just take—”  “Bas,” she said without looking at him, “It’s not always about what you want. We’re not going, and I’m done discussing this.” She lengthened her stride to leave him behind.  Sebastian halted as he realized she was angry at him. Really angry, in a way he’d never seen before. What did I do?  “Did I miss something?” He looked at Reece. The pilot put his hands on his hips, stared upward for a moment, then directed his gaze at Sebastian. “Give us a minute.”  “Sure,” Sebastian said, trying not to feel hurt. It was moments like these he was reminded of how long they’d been together, their connection rooted in secret smiles and monosyllabic references; questions they shrugged off and jokes only they understood the punch lines to. Worried he’d once again strained their relationship in some unexpected way, he slowed, watching Olly gesticulate while Reece listened with a frown crinkling his forehead.  An enclosed bullet car slowed to a stop in the street, gliding noiselessly on buried tracks. The light from the double doors of a hotel on his left slid along the car’s tinted roof and sides like water. A group gathered in the hotel’s doorway. They all wore masks but the tallest among them, at the front of the group, wore a patterned one. Sebastian sped up, trying to get out of their way.  The side of the bullet car retracted, and he glanced at it. A shifting shadow and a flicker of light in the dark interior caught his eye, and he halted suddenly. His boot didn’t engage as fast as he needed, and he stumbled to his left.  His shoulder slammed into someone, his hands tangling in satiny cloth over warm hardness. There was a sharp intake of breath as fingers gripped one of his wrists. But Sebastian was looking behind him because his mind had finally figured out what he’d seen.  A dark shape crouched just inside the car doors. Sneering lips curled beneath a black mask that hid everything from nose to forehead.  What the hell?  He wrenched his arm free and took a step toward the car and the object glinting in the passenger’s outstretched hand. Is that a gun? Weapons were forbidden on Greater P, but he knew immediately it couldn’t be anything else.  Instinctively, he lunged for it, and the passenger pulled back as he grabbed at a black-gloved hand and shoved upward. They grappled, Sebastian toppling into the plush seat alongside the door, one foot still on the sidewalk. Grunting, the attacker got their leg beneath Sebastian and kicked hard. The first strike robbed him of his breath. The second sent him staggering backward out of the car.  Several hands took hold of him as the car door closed. It slid away into the street, scattering pedestrians. Out of the corner of his eye, he saw silent figures loping after it, taking bounding leaps through human and vehicular traffic in the low gravity, but his attention was captured by what he held in his palm. The silver-gray tube had a tiny button on the side and two hollow ends. It fit neatly in his hand, innocuous and almost weightless. He had no idea what it was.  A hand covered in a white glove closed over his wrist. The tube was wrenched from him, and he was jabbed painfully in his ribs on either side. He heard a shout up the street. Olly’s voice. About time, he thought, still a little resentful they’d walked off on him. Reeling from the suddenness of the fight, pulse rioting under his skin, he looked up at the person in front of him.  A white mask, decorated with swirls of green and yellow flowers, stared back at him. The eye pockets were tinted, and a dark pinhole speaker where a mouth would be formed the center of a flower head.  “Name the Sept that hired you, and I will consider letting you die swiftly.”  Sebastian’s stomach lurched, nausea slicking the back of his tongue. “What?”  Iron fingers curved into his throat, squeezing hard around his Adam’s apple, and cutting off his air efficiently. “If you answer me now, you deal with me,” the soft monotone continued. “If you refuse, I’ll give you to my Rooks. I promise you, whatever happens to you then will happen to everyone you love as well.”  Sebastian struggled but the hands on his biceps and forearms held him tight as he fought to breathe. The hand on his throat loosened and he doubled over, gasping, as an outraged bellow sounded somewhere far away. Through blurred, teary vision he saw a dart of shiny metal sticking out of his left rib cage. Fingers gloved in white plucked it from him. A headache speared behind his eyes, and he moaned at the sudden pain.  “They shot him,” a voice said above him.  “Why would they target their own?” another asked.  “A question worthy of consideration,” the monotone replied.  Something crashed into his left side. Amid harsh cries and the thump of flesh hitting flesh, he heard Olly calling his name. Pain sat on his chest like an idling cargo bot, and he couldn’t catch his breath to answer her. He fell sideways, his boots losing contact with his ground, his body beginning to drift.  Hands pulled at him, lifting him against a firm torso. He looked up into the masked face. It was luminous with sparkling, twisting flowers growing downward to brush squared shoulders. The slowly curling stems and blossoming petals were mesmerizing. He could smell their floral perfume, and it smelled better than Olly after a real shower. He lifted a hand and stroked at the mask. It was smooth beneath his fingers; firm and cold as metal. He sighed, oddly soothed, a faint smile curving his lips.  “What did you do!” Olly’s voice sounded muffled. “What the fuck did you do?”  He wanted to defend himself, to tell her he hadn’t done anything at all, but the swelling bubble of pain in his head and the roiling in his stomach distracted him.  The monotone said above him, “Take the gun. There will be traces inside. We must know what they used. We have minutes at most.”  “The Station Agents—”  “This is not their business.” There was a pause during which he could clearly hear scuffling and Reece swearing. “Bring them.”  An arm was around his waist, another under his shoulder, and he was spun in a circle. A bullet car stood waiting in front of him. “Do I get to ride in that?” he wanted to ask, but then pain hooked viciously into his ribs, and he screamed.  “Sebastian!” Reece sounded panicked and furious, but oh God, the pain. He couldn’t answer, couldn’t think; the pain had him, and it dragged him down, down, into a black hole of nothingness.  He drifted back to full awareness with a chill burning under his skin. He lay on something velvety and yielding, but he shivered so hard he heard his own teeth clicking.  “The antidote is working. You may leave us.”  A hand slid under his head, lifting his chin. Insistent fingers pressed against his mouth. He parted his lips, and a pill was placed on his tongue. He tasted the salt of skin as the hand withdrew. The edge of a cup replaced it, washing down the pill with water. He curled into himself, trying to get warm. Callused hands grasped his palms and chafed them with strong, firm movements. He gasped with how good it felt and inhaled a delicious, floral scent.  “Reece?” he murmured, forcing his eyes open.  The blurry face above his resolved into stern lips pressed together beneath a green mask that covered nose and forehead. The memory of a black mask floated to the top of his mind, and he jerked backward, hitting his head on a wall. He groaned as sparkles exploded behind his lids and agony sliced through him.  “Careful,” the voice was low and so resonant it sent a shiver through him. “You don’t want to move much yet.”  He lay still, catching his breath and cataloging the aches rioting through his body in swift jabs and lingering strikes. When he felt warmer, after the shivers passed, he licked his lips. “Reece? Olly?”  “Your friends, I assume?” The figure straightened, towering above him. This mask did not cover the eyes, but the holes were too deep set to see them at this angle.  My family. My everything. But that was none of this stranger’s business, so he simply said, “Yes.” He tried to sit up and a firm hand descended on his shoulder. Heat seared his skin through his shirt.  “Slow. Your balance might be affected. The pain and hallucinations may return.”  “What happened?” he asked.  “I hoped you could provide those answers.”  He frowned. “Me?”  Corded arms a lighter shade of brown than his own folded across a flat chest. “Your name and pronouns?”  “Sebastian.” In the expectant silence that followed he instinctively added. “Carver. Sebastian Carver. I prefer he/him. Yours?”  “Bishop shall suffice. He/him. Are you a resident of Greater Paradise, Sebastian Carver?”  The way his name rolled off Bishop’s tongue, resonating in that low register, made his skin tingle with awareness. He shook his head, then regretted it instantly and pressed his fingers to his temples. The pain has certainly returned. “Passing through. The Kiskadee needed repairs.”  “Your ship, I presume?”  “Yes.”  “When did you arrive?”  “A cycle ago. I think.” He frowned. “How long have I been here?” For the first time, he glanced around and realized he sat on a bunk. The walls that curved around the small space looked carved from polished wood, filled with silvery ripples and dark knots. There was a desk and chair to his right. A closed door stood between the bunk and the desk, and another behind his questioner. “Where am I?”  “Aboard the Kingston’s flagship.”  He rubbed at a sore spot on his ribs absently. “Sorry, I think I missed something. What’s the Kingston?”  “My Grandmaster.”  At Sebastian’s raised eyebrows the stern lips parted with a quiet sigh. “You have no idea to what I refer, do you?”  “Should I?”  “Tell me something,” his voice was filled with curiosity, “why did you reach into that car, Sebastian Carver?”  “Just Sebastian,” he said automatically. “They had a weapon. You took it from me.”  “You put yourself between me and that weapon. Why?”  Sebastian groaned as he settled elbows on his thighs and gripped his throbbing head. “Because I’m clearly an imbecile.”  “Perhaps. But I need an answer.”  Sebastian tensed, realizing suddenly that although he was the one injured, he was being interrogated. “Well, Bishop, if you have a problem with me saving your life, you can call the Station Agents. Otherwise, I’d like to go back to my friends now.”  “Is that what you think you did? Save my life?”  “You tell me,” Sebastian said, spreading his arms wide, exasperated.  “This is your plan, perhaps?” Bishop asked in a mildly amused voice. “To place me in your debt?”  Sebastian was done. This was beyond ridiculous, and he had no more patience for it. “If it was, it clearly wouldn’t have worked, because you don’t seem the grateful type. In fact, you strike me as an . . . ”  . . . asshole. Oh. Shit. His eyes widened as he stood tall enough to see dark eyes as cold as the deep space outside the station hull.  “You’re Valencian,” he breathed. That must mean . . . He understood now why he’d been able to lie down with no restraints. He was on a Valencian ship, in gravity.  The slightest curl formed in a corner of Bishop’s lip, and confusingly, Sebastian’s skin flushed with heat. “Why am I here?”  “My question first, Sebastian Carver.”  “I’m not sure, okay,” Sebastian shot back. “It was a weapon, and I was the only one who saw it. Nobody would have had time to stop them. I thought . . . it was the right thing to do.”  “Are you in law enforcement?”  “I.” He swallowed then took a deep breath. “I’m a cargo handler.”  In the silence that fell between them, Sebastian shifted his weight from one foot to the other, looking everywhere but in front of him.  “A cargo handler. You are . . . interesting, Sebastian.”  There was that warm tingle again, stronger than before. Oh hell, no. This is not the time, Sebastian Thomas Carver. You don’t have the faintest idea what you’re dealing with yet. He made himself look directly at Bishop. “Where are my friends? What did you do to them?”  “Do to them? You should ask, Sebastian, what they have done to us. My Rooks were exceedingly solicitous, given their behavior.”  “If you’ve harmed them—”  Bishop stepped forward, bringing them so close, Sebastian’s fists were brushed by the soft layers of silver cloth that covered Bishop’s body; his scent swirled around them. “What will you do? Kill me, after so kindly saving my life? That would be such a waste of your efforts.”  Sebastian’s heart sped up even as bewilderment seized him. “What is wrong with you? Why the hell would I want to kill you? I just want to know why you’re keeping me here, and why you won’t let me see my friends?”  “Because I must know if you are part of the attempt on my life, Sebastian,” he said in a voice suddenly sharp as metal. “As for your friends.”  He strode to the stateroom door and laid a palm on it. After making a few hand gestures, he brushed past Sebastian and strode to the desk. Sebastian watched Bishop lean there, ankles crossed, hands braced against the edge of the desk, until a flurry of activity drew both their gazes back to the doorway.  “Bas!” Olly ran to him, and he caught her, arms tightening around her curves. He hissed at the discomfort as she hugged back, relief coursing over him as he breathed in the crisp apple fragrance of her hair.  His cheek against hers, he looked up as Reece came into the room. Sebastian’s eyes widened at Reece’s bruised face and split lip. “Reece, what the hell—”  Without warning, he was crushed against a massive chest, Olly caught between them, his arms trapped against Reece’s hard stomach as the man held onto the back of his head and waist and pulled him close. Shuddering breaths skimmed his ear.  Sebastian’s heart beat hard in his chest. “Hey,” he said, surprised and deeply happy at their emotional welcome. “I’m good. Except for the part where you’re crushing me. It kind of hurts.”  Olly made a sound in her throat and shoved him hard. He stepped back, rubbing at his sore chest, then froze as she wiped at her damp face. “You idiot,” she said fiercely. “What were you thinking?”  “That someone was pointing a weapon at me, and I didn’t want to get shot?”  Her laugh was harsh. “I wish I believed that, Sebastian, but I know you. You’ve never put yourself first. This is the space walk and the fire all over again.”  He rolled his eyes. “We’re back to arguing over the space walk? What did you want me to do? Leave you to die?”  “You jump into danger every time without thinking. And you have no idea, no idea, how it feels to watch you risk your life like that.”  “I wasn’t the one who walked off and left me alone on a Station I didn’t know!”  Olly’s lashes fluttered, and she looked stricken. He’d hurt her, yet again, without meaning to. He made a rough sound in his throat and ran his hand over his hair.  “Sebastian,” Reece said, his voice tense, “not here.”  “And you,” Sebastian snapped. “Look at your face. Why did you attack their people?” He waved his hand in Bishop’s direction. “There was no need for that. I was just a little stunned from the fight—”  “You were dying,” Bishop interrupted in a mild voice. “Poisoned.”  “I—what?”  Olly strode over to Bishop and poked a finger at his chest. “You piece of shit. You had no right to take him and keep him from us. Who do you think you are?”  “You would have preferred I left him on the sidewalk to die in unimaginable pain?”  “Why not?” she spat. “That doesn’t usually bother your kind.”  The stillness that emanated from Bishop made Sebastian’s hair stand on end. “Olly, don’t. Leave him alone.”  “You know nothing of me,” Bishop’s voice was steel wrapped in silk.  “I know your people. You’re heartless, violent pricks, every last one of you. You kill as easily as you lie, and all you care about is money and your sick games.”  Bishop stepped close so his taller vantage forced her to look up at him. His murmur was low, but audible. “Who did we take from you?”  Olly’s fist flew without warning. Bishop caught her hand and spun her, twisting her arm behind her. She tried to stomp on his foot, but he put an arm around her and lifted her, enduring the strikes of her boots against his shins without a single flinch.  “Let. Her. Go,” Reece said.  The warning in his voice made Sebastian step between the pilot and Bishop. “Stop. We all need to calm down.” He turned to Bishop. “Release her and talk to us. I’ve answered your questions. It’s time to answer mine.”  One minute Bishop had Olly in hand, the next Sebastian caught her as she stumbled into him. She rubbed at her arm as Bishop said, “Ask them.”  “You alright?” Sebastian asked Olly.  She nodded, narrowing her eyes at Bishop. “Don’t ever touch me again.”  “I have no desire to touch you. But I make no promises.” Bishop leaned against the desk, hands across his chest. “I will not allow anyone to lay hands on me.”  “It was an assassination attempt?” Sebastian interrupted. “On you?”  “Yes, and yes.”  “Why?”  “Any number of reasons.” Bishop shrugged. “Persons of my rank endure several a tempi, at least. Greater Paradise is neutral ground, though, and such attempts are forbidden here.”  “Pretty sure murder is a crime everywhere.”  His stern lips twitched. “If you are caught, absolutely.”  Olly tossed her hands up. “See!”  “Do you think we’re involved?” Sebastian asked, knowing this was the real issue. If Bishop thought they had any part in this, he had a feeling they would not make it back to the Station.  A few seconds of silence passed before Bishop responded. “I had to rule out the possibility. Valencians often carry antidotes for common toxins, but this one, Quasi’s Death, is extremely fast acting. It’s rarely used because of its virulency, even in Valencia, but the Kingston’s flagship has the most complete medical bay in the fleet outside of the Valencia’s flagship and carries the antidote. That’s why I brought you here.”  “Bullshit,” Reece hissed, stalking forward to stand behind Olly and Sebastian. “You wanted to interrogate him. You wanted information.”  Bishop tilted his head to one side. “That too.”  “Information?” Sebastian frowned.  “If you weren’t involved, at the very least you’d seen the assassin,” Olly said, “They needed to know what you knew.”  “But I would have told you that anyway if you’d just asked. Why separate me from my friends?”  “How was I to know they were your friends?” Bishop waved a hand at Reece. “I’d been attacked twice, and they’d injured two of my Rooks. Perhaps they were there to make sure of my death. I had no way of knowing their story was true. I had to wait until you were conscious.”  “In case they meant to harm me.” Sebastian paused, eyebrows raised. “You were . . . protecting me?”  “A favor returned, and a debt paid, perhaps.”  Olly shook her head. “Not likely. Bas was never in danger from us.”  “Surely, saving his life counts for something?”  “His life would never have needed saving if it wasn’t for you,” she spat.  “Who are you, exactly?” Sebastian asked.  “I’ve told you already.”  “Yes, but who are you, that someone wants you dead?”  Behind them, the door opened, and a masked person appeared. They bowed, crossing a forearm tattooed with a glimmering, geometric pattern against their naked chest.  Bishop straightened. “It is done?”  “We anticipate your presence in Interrogation Room 3.”  Without another word, Bishop was past them and out the door, and Sebastian saw the glimmer of a tattoo on his back as he went. Reece attempted to follow, but found his way barred by the newcomer.  “You will await the Bishop’s return here.”  “You,” Reece said, “can fuck off.”  In two swift movements, a hand plucked a cylinder from the belt around a narrow waist. The cylinder extended in both directions into a humming, tapered pole that managed to look both innocuous and dangerous.  “You will wait.”  Sebastian sucked in a breath. “Reece.”  Reece clenched and unclenched his fists, but he only watched as the guard withdrew from the room, shutting the door in their faces.  The Pawn was seated at the table with arms outstretched along its surface. Metal restraints held their forearms and wrists immobile. They had been stripped naked and their mask removed. Their neck and torso were fastened to the chair, which was bolted to the floor.  Bishop took the clear plastic robe Second Rook held out to him and wrapped it around himself. He strolled to the other end of the rectangular table, which had deep grooves around its edges. Sitting, he placed his left ankle on his right knee, gripping it lightly with his fingers.  The two Rooks stood on either side of the door as he studied the Pawn. Studied the even rise and fall of their pale brown chest and the smooth, emotionless face with its dark, angry eyes.  He gave himself time to bring his focus back to the task before him, instead of the swirl of conflicting emotions he’d left in the cabin, along with the most beautiful man he’d ever seen.  “No lies,” Bishop said. “Or there will be consequences. Unlike some, I keep my word.”  The Pawn lifted their chin but said nothing.  “Name. Rank.”  “Lula. Black Knight.”  Bishop sighed and closed his eyes for a second. A mistake. His mind went immediately to a warm smile and the press of his mask against his skin as a hand stroked his cheek. Irritation at his wayward brain prickled his skin with heat. He snapped his eyes open.  “That,” he said. “Was a test. You failed.”  He glanced at the Rook to his right. First Rook stepped forward and pulled a metal knife from his utility belt. Without hesitation, he began to saw at the fingers on the Pawn’s left hand, severing them at the knuckle, one by one. The Kingston preferred old fashioned methods to humane ones. Lasers ended the pain too quickly. Bishop did not think torture was as effective as the Kingston believed, but he had learned to work within the Grandmaster’s rules.  It was that, or death.  What his Rooks had found out about Sebastian and his friends made him believe they were not likely to be assassins. But this Pawn might be the first salvo in a war he had no intention of becoming a casualty in.  When the screams had died to heaving groans and choking gasps, and Second Rook had stopped the bleeding enough to continue, Bishop leaned forward.  “You are no Knight. A Knight would not have screamed. A Knight would not have been caught. So.” He leaned back. “No more lies.”  The Pawn was dripping with sweat, grimacing as they tossed their head from side to side. Bishop nodded at Second Rook. She produced a syringe and gave the Pawn a shot of adrenaline to keep them conscious. They jerked against their bonds with a huge intake of breath, eyes wide, muscles rigid. The stumps of their fingers had been seared with a laser. The blood that had pooled beneath the hand ran down the sides of the table, gathering in the grooves and flowing into the closed metal pipes of the floor-bolted legs to the catch-pit beneath the floor.  The salt-stink of blood and sweat and piss rose above the sweetness of vine perfume.  “Name. Rank,” Bishop repeated, his voice soft, his body weary. He wanted this over with, but the Kingston’s Queen and the Grandmaster Kingston himself would expect thoroughness.  The Pawn stared at their hand, trembling as they tried to take one breath after another.  Bishop tilted his head, curious. “Did they not warn you of the price of this Game?” he asked. “The price of an attempt on a Grandmaster’s life?”  The Pawn’s eyes flashed.  “Ah, yes,” he said. “I know I was not the target. It would be wise of you to avoid testing the limits of what I know. You are grist for the mill of whatever Sept sent you. But you do not have to let them decide your fate. Answer me honestly, and you may yet live. Fingers can be reattached. Wounds healed perfectly. But I won’t ask again. Name. Rank.”  The Pawn clenched their uninjured fist. Then they blurted out, “Pawn. She/her.”  Pawns had no name. You earned a name by attaining the rank of Bishop or higher. A good truth to start with, even if it was not his own. He had been born with a name, after all.  It was also a reminder to keep his mind on what had to be done. He could not allow one man’s inexplicable act of compassion to sway him from a lifetime of ambition and his mission to claw his way back into the Grandmaster’s favor.  He needed to be trusted again, so he could break that trust and gain his revenge.  “You have made a wise choice,” he told the Pawn. “Silence is better than lies. But I warn you. No one is ever silent in here.”  He tightened the plastic around him, snapped his fingers, and stood as First Rook stepped forward again and handed him the knife from his belt.  “What are you doing?”  Olly answered for Reece as he ran his hands along the irregular bumps of the walls on either side of the doorway. “He’s getting us out of here.”  “Is that really the best thing?” Sebastian frowned. “I don’t think we’re in danger.” He sat on the bunk, elbows on his thighs, hands dangling between his knees, as Olly stopped pacing to stare at him with raised eyebrows.  “Tell me you realize that man is not to be trusted.”  “He hasn’t really done anything—”  “He put his hands on Olly,” Reece said, straightening to run hands along the top of the metal door. “And there’s the way he looks at you.”  “To be fair, Olly tried to punch him. And he’s masked. Who knows what he’s looking at?”  Reece shot a glare at him over his shoulder. “I know.”  “And protecting you? From us? Really?” Olly said, hands on her hips.  Sebastian licked dry lips and tried to ignore the sudden heat in the tips of his ears. Olly sighed, “Oh, Bas.”  “Oh, Bas, what?”  “You actually do see the best in everyone, don’t you?”  He sighed, tilting his head back to look up at her. “He saved my life. We should try to talk it out. I don’t want any trouble.”  “Only trouble will be if they try to keep us here,” Reece said in a grim voice. He paused, his body tense as he stared at Sebastian. “Olly and I are getting out of here. Are you with us this time, or not?”  Sebastian cursed. “Don’t start. I just didn’t want the guard to hurt you. You know I’m with you. But I think there’s a better way.”  “We can’t rely on a Valencian’s good graces, Bas,” Olly said.  There was a faint click beneath Reece’s searching hand, and a small section of wood pushed inward and lowered, revealing a panel.  “Control panel?” Olly asked.  “Better.”  Seconds after Reece activated the alarm he’d found, three guards came in, weapons at the ready. Sebastian didn’t even get the chance to stand up. Olly and Reece had come up together on some of the roughest corporate stations in the system, and they’d learned to scrap with the best of them. This time, the guards didn’t have the numbers to overpower them. Sebastian stepped over the unconscious bodies into wide, low hallways where red light streaked along veins in the walls and sirens blared overhead.  They moved through the corridors swiftly, hiding in corners and empty rooms from running crew on two occasions. “You even have any idea where we’re going?” Sebastian whispered.  Reece nodded, gaze focused on the way ahead. “We’re a few levels down from the docking bay. Once we get to the lifts, we’re good.”  They were almost to the lift junction when they heard harsh voices and multiple boots. Sebastian spun in place as Olly and Reece backed up toward him. The only doors nearby were to their right; massive floor to ceiling things, carved out of the same petrified material as the walls and etched all over with designs. It had a clearly marked control panel though, and he figured anything that big would lead to a part of the ship large enough to get lost in. He was bringing his hand down to hit the transparent panel when the doors opened.  A gust of perfumed air swirled around them, but he was initially blinded by the blaze of light that escaped into the corridor. Stumbling back, he averted his eyes from the glare.  There was a loud crash, and heat splashed the back of his palm. He hissed and bent over his arm, shaking it out. A golden spreading puddle of what smelled like the most delectable soup slid along the floor toward his shoes. He stepped out of the way and looked up as the doors closed.  The figure in front of him was dressed in a drab brown jumpsuit and apron and wore a plain gray mask that covered their entire face. A huge metal pot had capsized at their feet, spilling food everywhere.  Olly and Reece were facing the junction in front of them, where several guards had come into view, spears activated. At their helm stalked Bishop. Sebastian cursed under his breath. This was the very situation he’d wanted to avoid.  Reece and Olly came alongside him. He took a breath in the tense momentary silence, intending to reason with Bishop.  “Olympia?”  Olly’s head snapped around, and she took in the frozen figure to their right for the first time. “Do I know you?”  A trembling hand reached up and removed the mask. The face that appeared looked dazed but intensely joyful, and Olly’s breathing stuttered beside him.  “It’s me, Sticky. Your father.”  Bishop strode to his quarters with rage an iron taste in his mouth and molten heat in his veins. He went to his office without a backward glance—his men knew better than to follow him in—but after he dragged a private comm bracelet from his desk and turned, he found Sticky waiting with a bowed head and nervously twisting fingers.  “Please, Bishop,” he pleaded.  Bishop’s lip curled in derision. “Please what, Cook?” he asked, just to remind him of his place. To remind him that their customary ease with each other would hold no sway here.  Sebastian and his lovers had lulled him into thinking they could be easily manipulated. He had been careless. Distracted.  A pretty face and fine words, that was all it had taken. If the King or the Queen found out, they would prevail on the Grandmaster to promote a Knight immediately. Shame ate at him. Shame . . . and a burning emotion that had responded to the desperately apologetic look on Sebastian’s face.  You are halfway to being a fool again, he thought angrily. And this isn’t the time. He is not the one.  Once, long ago, he’d thought the Valencia might be the one. Might be a true friend. He’d risked everything to help him.  And he had paid the awful price when the Valencia’s plans failed.  Sticky went to his knees and raised his hands in supplication, his head still bowed.  “They don’t know. They don’t understand.”  Bishop touched the drawer shut, then took a breath and calmed himself. “Our harvests are down. The Greatwood sickens. Ships go off course and strand my Grandmaster galaxies from his route. Septs attempt to take advantage of the chaos and send assassins. My King and Queen are stretched and have no patience for mistakes. What would you have me do, Sticky?”  Sticky’s shoulders rose and fell with his breathing for long moments. Then he said in a low voice, “She’s the daughter I told you about.”  The daughter he’d spoken of so many times, the Kingston had ordered Bishop to find her long ago, to use as leverage. He had had not helmed the search as he should, telling himself he had other pressing priorities.  The same daughter had attempted to hit him, her anger and pain lashing out at him in ways he related to but could not afford to care about. She would clearly risk anything to protect the man that had no fear of him. The man that had no fear, period.  It was disturbing how difficult it was to stop his thoughts from going to Sebastian Carver and his effortless smiles and expressive face.  “I am aware,” he told Sticky. “That means nothing to me.”  “But everything to me.” Sticky raised his head and Bishop refused to flinch at his open, pleading expression.  “They’ve attacked my men twice now.”  “They don’t trust you,” Sticky replied. “It is natural.”  “They abused my goodwill,” he snapped, thinking of Sebastian. The touch of his hand on his cheek. Only one other person had ever touched his mask like that. He’d been betrayed then too.  “They were escaping a confinement they don’t understand.”  “Do you?” He folded his arms, comm bracelet dangling from his fingers as he leaned back against the desk. “Understand, that is?”  Sticky’s words, when they came, were halting. “They made a mistake. But they were not part of the attempt on you, were they?”  Bishop took a breath. Let it out. “No.”  “Then I would ask something of you.”  Bishop’s fingers caressed the bracelet in his hand. It was not safe to speak of King Bartica’s warning if he was not face-to-face with his Queen, but he had decided to inform him of the attack. It was proper etiquette to let him know of Bishop’s investigation into whether the Bartica had betrayed the Kingston, if another Sept had led the attempt, or if Bartica was working with another Sept to attack Sept Kingston.  But once the King and Queen knew all the details, the Grandmaster would know. And once the Kingston knew, there would be no saving them. No saving Olly, Reece . . . or Sebastian. Their innocence would mean nothing to the Kingston. They had seen too much.  Despite his anger, he did not want their suffering. He suspected he would not be as numb to it as he was to everything outside of his mission to regain true power.  “Say what you must,” he said.  Sticky’s eyes went to the bracelet. “Do not hurt them. Let me see her. Talk to her.”  He narrowed his eyes on Sticky, thinking.  “If that is truly what you want, I will have a request of you in return. Are you prepared for that?”  Sticky hesitated. “Yes.”  Ah. Then Sebastian, Olly, and Reece might prove useful after all. The Kingston would be pleased enough to overlook many things, if he played this right.  “There is only one thing I would be interested to bargain with, Sticky. One thing you can offer me.”  Sticky swallowed, but determination hardened his gaze. “I know.”  “Then may I tell the Grandmaster we have an agreement?”  “If you grant my request. There are . . . conditions.”  There would have to be, given the price Sticky was willing to pay. But then again, he knew what they were. Had already considered all facets of this plan and found them worth the risk.  Though after everything that had happened, he could not be sure why. All he knew, as he fingered the cold metal of the bracelet, was that he could feel that hand against his mask. See that trusting, unafraid smile.  He must have looked like that once.  “Tell me,” Bishop said.  “So, you’re not going to speak to me?” Olly asked.  Reece’s fingers tightened on Sebastian’s bandaged hand for a second, but he didn’t look up as Olly spoke. Sebastian met her gaze as she paced instead.  “Now you want to talk?”  She stopped, biting her lower lip as she considered him where he sat on the bunk. “There wasn’t a good time before.”  “Really?” he said sarcastically. “Not any of times you told me stories about him? You let me believe he still had a stall in the Basement. You could have told me the truth instead of leading me on. You could have said, ‘Hey, Bas, by the way, the reason I know all this stuff about Sticky and his awesome cooking is because he’s my father.’”  “There was a good chance he was dead,” she said. “And I didn’t want to get into everything that happened if I didn’t have to.”  “He seemed real damn alive a few minutes ago.” He took his hand back from Reece and flexed it, too angry to feel much pain. “Is that why you didn’t want to come to this part of the station? In case you ran into him?”  “I didn’t want to come here because of the memories. This is where my mother died.” She folded her arms. “He abandoned me after she passed.”  Sebastian’s throat tightened as he took in her carefully blank face. “Olly,” he said softly. “Why didn’t you say?”  “It was too painful to explain. Not everyone has loving families who support them no matter what, Bas. Not everyone is good with every part of themselves.” She frowned and caught her lower lip between her teeth for a moment. “Some of us just want to move on from the shitty bits.”  Sebastian stood and folded her into an embrace. “No part of you is shitty.”  Her laugh was muffled against his shoulder. “I hurt you. First by not telling you the truth, and then by walking away.” She leaned back to look up at him, and he saw her fear and worry. “You could have died.”  “I’m fine. And you’re telling me the truth now.” He cupped her cheek. “If there’s more, this is the time.”  She sighed. “Nothing that matters. And honestly, when we talk, I don’t want it to be while we’re being held prisoner.”  “Prisoners don’t get med kits.” Sebastian wriggled his hand.  “We hurt his guards. How many times is that now?” Olly groaned. “Trust me, we’re in the shit.”  “He dumped us here again, no increased security,” Reece pointed out. “That was hours ago. Something’s—”  The door opened to admit an unarmed guard, hands clasped behind their back. “Your presence has been requested,” the guard said, but they looked only at Olly.  “I’m not going anywhere alone with you,” Olly retorted, hands braced on her rounded hips. “We stay together.”  Sebastian bit back a pleased smile at her statement, but the guard stood motionless for almost a minute. Then they nodded firmly. “Come.”  They followed the guard back to the doors Sticky had emerged from. Bishop stood there with a small tool in one hand. He wore the green half-mask, and his melodious voice was mild when he said, “I sent for Olly.”  “She stays with us,” Reece said as Sebastian took Olly’s hand.  “You are my guests. You have my word she will not be harmed.”  “Fuck your word.”  Bishop tilted his head. “Where we are going, you may not, Horace Reece.”  “I go wherever she goes.”  “You don’t understand.” Bishop’s voice was slow and careful. “This is not a threat. It is a warning. I know your history, Horace Reece.”  “Then you know you can’t stop me.”  “I know your background. I know why your Kiskadee has no AI interface.”  “Get to the fucking point,” Reece said.  “If you try to follow her, you’ll die. Not because of me, but because your lineage wasn’t augmented for space travel the way Olympia’s and Sebastian’s were. You would reject the seedling needed to enter the vineyards on Valencia.” He paused. “It would not be a good death.”  “Valencia is nowhere near here.”  “Valencia is all around you. Don’t you see it? Smell it?”  Reece studied him then raised an eyebrow. “You’re serious.”  “Always.”  “You have a way to go between Valencia and this ship?”  “Instantaneously.” Bishop held up the syringe gun. “The vineyards of Valencia and the Arbors are linked to each other. All you need to enter is to become part of them.”  “She’s not becoming part of some vineyard. And she’s not going to Valencia.”  Bishop’s masked face turned to Olly. “You have questions. Your father has answers. He wants you to meet with him in the vineyards.”  Despite the tension in the silence that followed, Sebastian had to force himself to swallow his excitement. This was Olly’s choice, but he wanted to see those vineyards. He wanted her to say yes.  Get a grip. You’ve never heard of this technology. He could be lying to get Olly somewhere to do God knows what to her. But even as he thought it, he knew he didn’t really believe it. And in any case, there was no way Sebastian would let anything happen to her.  “What if I don’t want to talk to him?” she finally said.  Reece threw her a look. “Olly—”  “I would escort you all off this ship, and you would never have to see me or your father again, if that is your wish. I have no interest in forcing a family reunion.”  “What is your interest?” Sebastian asked. “Why are you doing this?”  “Because Sticky asked it of me,” Bishop replied. “And he has never asked for anything.”  Sebastian pondered that, then turned to Olly. “What do you want to do?”  Olly was breathing hard as she looked at Reece.  “Whatever you want, Olly,” Reece said, his voice gruff. “I told you back at the junction. You need to deal with your past, not run from it. But Sebastian knows now. We can go back to the Kiskadee and talk. Forget the rest of this ever happened.”  Olly blinked rapidly. “Thanks, Reece.”  “Anytime.”  She took a breath and met Sebastian’s gaze. “Will you come with me?”  “Of course,” Sebastian said without hesitation. “Don’t worry, Reece. I have this.”  Reece narrowed his gaze on Bishop. “I’ll wait right here.”  “You are free to do so,” Bishop replied.  “Anything happens to them—”  “I find threats tiresome, Horace Reece. Let’s just assume you bear me eternal ill will and dispense with the rest.” He turned to Sebastian. “The transition might cause a few moments of upset, and you were recently injured. I cannot guarantee it will be painless.”  “I’m fine.” Sebastian flexed his hand. “I can do this.”  “Hold out your arms.”  There was slight sting, then lingering heat, and he rubbed at the ache as Olly received her seedling. The guard stepped up and offered them gray masks with red pinhole speakers. Once they donned them, he tapped the small squares on the side of their necks and oxygen filled the masks.  The doors opened and through the filtered visors, Sebastian could see flowering, shimmering vines swaying gently from above, hanging low to almost knee-high grass. Bishop handed the tool to the guard and strode into the sparkling vista without a backward glance.  Warm tendrils brushed Sebastian’s face as they moved. The ground beneath their feet went from flat and predictable, to uneven with the slightest give. His limbs felt heavier for a moment and that made him stumble, his world tilting before arms caught him. The vines were thinner here, and he was fumbling at his mask, hands helping him rip it free before he vomited onto the ground at his feet.  His ribs were aching when he straightened. Olly was on one side of him, her right arm around his waist and both their masks dangling from her left hand. “Okay?” she asked, concern wrinkling her brow.  He nodded. “Sorry about that.”  “Understandable,” Bishop said close to his other ear, and he realized there were two arms around his waist. Heat spread through his body as he quickly stepped out from the shared embrace. A row of opaque panels hung from a doorway in front of him. He pushed through it, blinking at the sudden reduction in light.  A large circular room curved away from him. Gilded walls and doors glowed under huge light sources; they hung from arched ceilings etched with colorful frescoes. The floor beneath his feet was burnished, golden wood, and statuary decorated the many alcoves. Between those alcoves, massive, tinted windows looked out on the brilliance of a swaying vineyard.  In the center of the room was a beautifully set table for two, and Sticky. He’d changed out of his jumpsuit into the flowing, sheer pants and thigh-length tunics Bishop wore, only his were black, with silver threading. No mask hid his cropped hair and the crinkles around his eyes.  “Shit,” Sebastian said weakly. “It’s real. We’re . . . not on the ship anymore.”  Olly came alongside Sebastian, her gaze taking in everything before settling on Sticky. She set off toward him and Sebastian followed. Bishop strode behind them, a silent commanding presence.  “What is this?” she said to Sticky, hands on her hips.  “I thought we could talk over a meal—”  “It’s a little late for that, Sticky.”  The skin under his eye twitched. “You never used to call me that.”  “Yeah? You used to be around. Things change.”  “I didn’t bring you here to fight, Olympia—”  She slammed her hands down on the table, rattling dishware and tumbling a water glass. “My name is Olly. Olympia Richardson died when Gran did.”  Sticky closed his eyes and took several deep breaths before opening them again. He snapped his fingers and a door opened at the far end of the room. Two bare-chested masked persons in identical green and white pants entered. Sticky waved a hand at the table, and both disappeared. “I wanted to talk, but if what you need is for me to listen, I can do that.”  Olly leaned back as the attendants returned. They set up a larger table and more chairs with surprising speed and grace before clicking the door shut behind them.  “I thought you’d want this to be kept private,” Sticky said, glancing at Sebastian.  Olly studied him, fists clenched at her side. “He and Reece are family.”  Sebastian stepped forward and offered a hand. “Sebastian Carver, but Olly calls me Bas.”  The hand that gripped his was dry and rough. “James Richardson. Call me Sticky. Reece is the other one who was with you?”  “Yes, but he couldn’t make the trip.”  Understanding swept across Sticky’s face. “The seedlings. He’s unaugmented then?”  “Why did you do it?” Olly said, her voice hoarse.  Out of the corner of his eye, Sebastian saw Bishop withdraw to an alcove. He was studying the sinuous line of abstract stone with his hands behind his back, one wrist clasped in the fingers of the opposite hand.  “Olym . . . Olly.” There was a sheen to Sticky’s eyes that hadn’t been there before. “I thought I was doing what was best for you.”  Olly drew in a breath as if she’d been stabbed. “Best for me? It wasn’t much, seeing you only when Gran could sneak me to the food stall, but it was all I had. Why did you take that from me?”  “I was trying to save your mother.”  Olly took two steps back, shaking her head. Astonishment carved harsh grooves in her face. “What the hell are you talking about? After her . . . after the Blowout, you disappeared. Now I find you here, decades later, living it up with some fucking Valencian.” She pointed a shaking finger at him. “Did you know they were right there when that door failed? They watched that cargo bay depressurize. And they wasted precious time waiting for the Station Agents to ask for help. Because it wasn’t their business.”  Sebastian stepped behind her and rubbed her upper arms soothingly, letting her know he was with her without interrupting. She didn’t react, her accusing gaze focused on her father. Sticky looked as upset as she, but there was a tenderness there. And so much regret.  “Please,” he said. “Sit. Both of you. I’ll explain everything.”  None of them noticed when Bishop stepped through the concealed door in the alcove into the passageways that honeycombed Sept Kingston. They were too caught up in the venting of many tempi of anguish and regret.  He could not have stood witness to that a moment longer, even if he had not had pressing business to take care of. Business that had made Sticky’s request to return very convenient indeed.  He strode through the curving golden passageways, exiting into the Septhold proper and pausing only to confirm from one of the Pawns where his White Knight could be found.  He entered the wing that housed the Senior Quarters and went straight to the largest chamber, opening the door without knocking. The White Knight rose from his bed, spear already in hand. He relaxed as he recognized Bishop. Lowering his spear, he bowed, then straightened and opened his mouth.  Bishop drew two knives from hands hidden behind his back and stabbed him with one, making sure to nick the Knight’s left femoral artery. He followed the Knight down to the floor as he dropped, the spear clattering alongside him. He held the other knife to the Knight’s throat while he kept the one in the Knight’s leg steady. Blood welled, soaking through the Knight’s pantaloons in seconds.  “Who else?” Bishop asked. “Who else helped Sept Marigot? You knew the Grandmaster was to be in Greater Paradise. But you could not have known when I decided to leave. Someone with me on Greater Paradise told you that and you tipped off the Pawn.”  The Knight breathed harshly as he stared at Bishop with cold eyes. “I am already dead. Why should I help you?”  “I have not severed your artery. The doctors can still save you. The more valuable the information, the more likely the Kingston will spare you and demote you to the Lesser Games. You can survive this if you tell me no lies.”  “Will you promise me my life, Bishop?” the Knight asked in a bitter, strained voice. “You have always kept your word. Give it to me now, and I will give you the answers you seek.”  Bishop studied him for a moment, then sighed and slit his throat. Warm blood stung his skin as he stood, yanking both knives free.  “I said no lies,” he told the corpse.  He was halfway to his rooms when a Pawn saw him and halted, eyes wide. Bishop gestured to the trail behind him.  “Clean this up. The White Knight is in his room. Arrange for a traitor’s disposal. And send the Black Knight to my quarters in fifteen minutes. Where is the Queen?”  “In the Audience Hall, Bishop,” the Pawn replied with a fist over their chest.  “Send a messenger to request a meeting with him once the Audiences are over. And Pawn, you will tell the guards no member of this Septhold is allowed to leave for any reason unless I personally escort them.”  “Yes, Bishop,” the Pawn said, and kept his head lowered as Bishop walked away, leaving bright red drops of blood on the golden floor.  The attendants set little bowls shaped like flower petals in front Sebastian and Olly. Steam drifted upward, redolent of fresh herbs and a hint of lime. Bits of white flesh speckled with green seasonings, and rolled dumplings floated in a golden broth.  “You must be hungry by now,” Sticky said. “I made this fresh earlier today. But of course, you know that. I dropped an entire pot—”  “This is mom’s fish broth, isn’t it?” Olly said in a low voice, staring at the delicate transparent bowl.  “Her favorite,” Sticky’s voice was gentle, and Sebastian’s heart pinched at the melded love and loss in his expression. “The Bishop has a fondness for it as well. I make it often for him.”  “Why do you call him the Bishop? Isn’t Bishop his name?” Sebastian asked.  “Bishop is his title,” Sticky replied. “Bishop Kingston. Only the King, Queen, and Grandmaster rank above him in one of the most powerful Septs in Valencia. It’s a great honor. And a terrible burden.” His eyes roamed Olly’s downturned face as if committing her to memory. “But I should start with what you want to know.” He invited them to eat with a wave of his hand and settled back in the gilded chair, his fingers playing with the stem of his water glass.  Sebastian closed his eyes at the first taste of the thin, complex broth, its citrus notes elevated by the spiciness beneath, making all the flavors sharper.  “I spent my life bouncing from station to station, and ship to ship, searching for ways to get better at cooking. I was obsessed with reproducing the dishes my grandparents spoke of, with finding a way to recapture the food and traditions we’d lost when the seas swallowed the Caribbean.  “When I met your mother, I was an impatient, arrogant bastard. But she saw something in me. I’d like to think my passion seduced her. But my neglect—” he lifted his intense gaze to meet Olly’s, “—she would not tolerate that. For herself, or for you. I didn’t understand what I had then, you see. I was still chasing this . . . need to be the best. Eventually, I drove her away. But I loved you, and your grandmother knew it. Your mother was not one for second chances, so it was your Gran who brought you to see me.”  Olly placed her spoon back in her bowl. Sebastian continued to eat, listening.  “Gran told me after Mummy died. That you were my father. I thought . . . ” She paused for a moment and looked skyward. “Like an idiot, I thought when she died, you’d come for me. When you didn’t, I even went to the Basement, looking for you. I went there again today, just in case you’d come back. And when you weren’t there . . . ”  She turned to Sebastian. “I’m sorry, Bas. So sorry. I should have told you.”  “It’s okay,” he said. “I understand.”  Sticky’s sigh carried the weight of the world. “When the Blowout happened, I was at a meeting with the Grandmaster Kingston. He had tried the food at my stall several times and wanted to make me an offer. It was a chance to cook every day over an open flame, in gravity, where I could explore every technique. But I would have to go where his people went. I would travel with his flagship when necessary. It meant I would be away from Greater Paradise for long periods, but I would be able to cook, truly cook. And the pay would be more than I ever imagined.”  “You left with him? You didn’t know what had happened to Mummy?” Olly’s voice held an edge of desolate hope. Sticky shook his head. Sebastian dropped his spoon as her face crumpled, rubbing her shoulder as her sadness made his own eyes sting.  “Please, don’t,” Sticky reached for her hand and held it tighter as she tried to withdraw. “That’s not it. Not at all. I was there when it happened. I knew—” he closed his eyes, “—I was ice cold from the moment the debris from the Blowout hit the ship.  “When we got to the bridge and I saw the bodies, I begged the Grandmaster not to wait for the Station Agents. He was a hard man, but we made a deal. The whole time the rescue crew worked, I prayed she and your Gran weren’t on duty. But she was the third person we brought in, one of the few still alive.”  He looked at her, his eyes red. “The Grandmaster’s physician tried but could not save her. I was with her, at the end. She wasn’t alone, Olly.”  “But I was!” Olly thumped her chest, her voice broken. “I needed my father, and you never came. Not even to the funeral.”  “It was the price of your mother’s treatment,” Sticky said, his voice brittle. “I had to leave with the Grandmaster as soon as her treatment was resolved, one way or another. He was not going to return to Greater P for another tempi and he wanted my services for a fete to honor the Grandmaster Valencia.”  “Oh my God,” Olly’s voice shook with rage. “It took us three cycles to confirm her death and locate her body. You just . . . left her with the hospital like that?”  “You have every right to hate me. I’ve failed you, time and again.” He paused and then spoke in a hardened voice, “But I would never do that. We spent three cycles trying to save her life. The Grandmaster is extremely strict about his security. He would not let you on board to see her, so I held off on telling either of you because I didn’t want to get your hopes up. When we failed, I reached out to your Gran. I told her everything, including where your mother would be.”  Olly collapsed against her chair, eyes wide. “She never said anything.”  “I begged her not to. I wanted to explain myself. It was foolish, I see that now. But I’d been such a failure as a father and a husband, and I’d lost Anita because of it. I . . . couldn’t face either of you right then. I decided I would send the money back to Gran. She’d make sure you had everything you needed, and in a year, I’d be back, rich, settled, and ready to take you with me to a better life.”  Tears streamed down Olly’s face and Sebastian offered her his napkin, his throat thick with the sight of her sorrow.  “Mom died when I was twelve. I didn’t leave Greater P for another five years. Where were you?”  Sticky sighed, his eyes seeing something over his daughter’s shoulder. “Things didn’t go as I planned. The Kingston was a . . . difficult man. He felt he’d done a great deal before we had an agreement. I needed to keep his trust.  “He did not allow me leave for several tempi. He would not give me permission to travel with another Sept. He was afraid I might make allegiances outside of Sept Kingston. I had to wait until one of his ships were headed to Greater P. I came back, only to learn your grandmother was dead and you had left.”  “She had a heart attack when I was fourteen,” Olly said. “Or she probably would have told me all this.”  Sticky drew in a pained breath. “When I found out you were alone all those tempi. That the money I was sending stopped being accessed . . . I searched for you as best I could, but no one knew where you’d gone.”  “I got flight certification and left the minute I could. Gran’s friends had taken me in, but it was a tight fit. They had three kids of their own, and it was too much of a struggle for us all. It was better than being a Station Ward though. I changed my name to Olly Richards to avoid that. Wards got sent planetside to orphanages, and I didn’t want to leave the only home I’d ever known.”  “I’m so sorry, Olly,” Sticky said, his voice shaking. “I thought I was making a better life for you. For us. I realize now, I discarded the life we already had. You were the best thing to happen to me. And I abandoned you when you needed me most.”  “Yes, you did,” she said, looking him straight in the eye. “And nothing will ever change that.”  “I know.”  Olly looked at Sebastian and there was a softness in her eyes that made his heart swell. “It wasn’t easy, those years, but I got lucky. Sometimes, you’re born into your family. Other times, you have to choose it.” She turned back to Sticky. “What did you hope for? Honestly? Was it forgiveness? For me to fall into your arms and call you daddy?”  “No,” Sticky breathed out, almost deflating. “I can’t ask that. I haven’t earned it.”  “Then what?”  “I don’t know.” He shrugged, glancing down at the cold soup. “I had this fantasy. I would come back a success and cook you a meal that was unlike anything I could have done before. I would show you how much I loved you, prove you’d always been in my heart. I would make all your favorites. And we would . . . talk. About what we’d missed. Try to find a way back to each other. I wanted you here to see my life and understand what I’d accomplished. Valencia—it is dangerous, but also wonderous. There is so much here that is beautiful and unique.  “And—I hoped we could visit. I thought if you agreed to get the seedling, once you saw how I lived—what I do—there’d be a chance you’d be willing to come to Valencia again. Maybe even . . . stay. Not now. But someday.”  Olly leaned her head against Sebastian’s shoulder, and he put his arm around her, nuzzling her temple, trying to make her feel his love and support. Her body relaxed into him a little. “You made Mummy’s favorite today. What else did you make?”  “I had a suckling pig and root vegetables I’d pit roasted for the main course. And I’d made passion fruit ice cream for dessert.”  “Passion fruit? I’ve never heard of that.”  “Your grandmother loved it. They have it on New Kairi, in the greenhouses there. They brought it with them from Terra. That’s been the best part of traveling with the flagship. I get to meet others who left Terra with my ancestors but didn’t lose touch with our culture the way some of us were forced to. There are so many amazing places like that, Olly, you have no idea.”  “We just got back from Tavaco, actually,” Sebastian said. “It was beautiful out there. We thought we’d make a run to New Kairi after the next shipment.”  Sticky nodded, his eyes bright with some good memory.  “Have you . . . Do you still make doubles?” Olly asked.  Sticky smiled for the first time, and it changed his face, Sebastian noted. Suddenly, he saw a version of Olly’s cheeky beauty reflected at him. “I can make it, if you want.”  Olly glanced at Sebastian, and he was relieved to see her slight smile. “All this one could talk about on the way here was doubles and roti.”  “Let me get you some fresh soup.” Sticky rose to his feet. “And while you have that, I can get started on a batch. I always have channa prepared and dough waiting. It won’t take long. The roti though . . . that can’t be today.”  “We’ll start slow, then,” Olly said. “Just the doubles for now. If you want.”  Sticky’s chest heaved and his eyes sparkled. “I would like that.”  “Well then,” Olly said, “four, with everything, plenty pepper.”  After they finished the best meal Sebastian had ever had, Sticky offered to give them a tour of the grounds. Bishop joined them again, wearing fresh clothes and a new mask. He fell in beside them as they donned half masks and entered the greenhouse, which had been grown from the vineyards like the rest of the Sept. Then they moved through huge doors into the evening outside.  Trees and grassland spread out in iridescent thickets that sometimes obscured the golden sky of the setting sun. There was so much openness, Sebastian was dizzy at first. Needlelike leaves spun and danced in the perfumed wind, and vines trailed the canopy, reaching out as they passed, like lovers’ fingers. Some parts of the forest were darker than others, and there, multicolored fruit lay burst on the ground, their sour rot a faint note under the floral musk. But those areas were few, and Sticky steered them away from them, strolling on a clear path, hands behind his back as he spoke to Olly. Sebastian slowed, allowing them some privacy, happy that Olly was getting this chance to begin healing an old wound.  “Your Grandmaster isn’t here, is he?” Sebastian said.  Bishop glanced at him, eyes unreadable through the tinted slots. “Why do you think that?”  “Because based on what Sticky told us, he would not have done this. Any of this.” He pointed. “This is all you.”  Bishop returned his gaze to the path. “The Kingston was called to matters of trade several days ago.”  “I knew it!” Sebastian grinned. “Would he even let us in here? Why did you?”  “I have broad discretion when it comes to the Septhold and access. Sticky has been a loyal asset to this Sept, but lately he has become . . . restless. By helping him, I’ve forestalled his attempt to resign, and secured the goodwill of a loyal servant. Now he knows his daughter is alive, he will seek to provide for her.”  “You’re manipulating him?” Sebastian stared, shocked.  “I’m guiding his decisions along a mutually beneficial path.”  “He could still decide to leave with her,” Sebastian pointed out. “I could tell him what you’re doing.”  “It would not matter. Sticky understands how things work here. And his relationship with his daughter is fragile and new. He is unsure of his reception. She is unsure of his sincerity. Time is needed. Time during which my Grandmaster and I will enjoy many meals in safety. It is worth the adjustment of our protocols and the price of two seedlings to secure this.”  He paused, glancing at Sebastian. “However, it would not be . . . advisable for another Valencian to know you have connections in this Sept. Sticky is safe here, but outside of Valencia, away from our rules, the Great Game we play for power can be even more ruthless.”  “That reminds me, did you find out who your attacker was?”  “I interrogated her during your first meeting with your friends. It is no longer a matter of consequence.”  Sebastian frowned. “What does that mean?”  “It has been dealt with.”  “How? Did you kill her?”  Bishop stopped and turned to him. “What would you have done?”  “Not kill her. Don’t you have courts here? Shouldn’t she face a judge or something?”  “She did,” Bishop said simply. “And she was sentenced according to her crime.”  Sebastian raised an eyebrow. “You’re a judge?”  “Bishops execute strategy on behalf of Kings and Queens, who take their direction from the Grandmaster. It is my remit to uphold the rules—or to find a way to bend them for my Sept.”  “So, she’s not dead?”  Bishop stepped close, so close his breath puffed against Sebastian’s cheeks, raising the hairs at the back of his neck.  “Why do you care, Sebastian? She almost killed you and would have killed me.”  “Because you’re making unilateral decisions about taking someone’s life. That shouldn’t be up to one person.”  “In my world, it is. To be Septed, to be Grandmaster, these things are the epitome of what it means to be Valencian. We make the decisions of what we need, where to go, what to trade. We earned that right. It is always up to us. My attacker knew that, and she chose to play the Great Game. She lost. She understands the consequences.”  “Maybe,” Sebastian said, his blood running hot. “But that doesn’t make any of what you do right.”  “Who decides what’s right, Sebastian? Do you? Do the people of Greater Paradise have any more say on what’s right for that Station than the people of the Lesser Games here?”  “I didn’t say we were perfect, but at least we don’t kill people without a trial.”  “We are definitely not perfect,” Bishop agreed, and it struck Sebastian then that he’d not raised his voice or lost his calm demeanor even as Sebastian struggled to hold on to his temper. “But we are efficient. And we do not waste time on trials for those who enter the Great Game knowing full well what they risk in their quest to rise to the top. You may not like our rules, Sebastian Carver, but be assured we have them.”  Sebastian studied the sharp line of Bishop’s jaw, the grim set of his finely etched lips, and certainty settled in his mind. A slow smile spread over his face.  Bishop’s lips tightened. “Why are you smiling?”  “Because you’re full of it.”  A dangerous stillness formed between them. “What did you say?”  Sebastian stood between Bishop’s spread feet and lifted his chin. “I’m not saying you don’t believe some of what you said. But if you truly believed all of it, you wouldn’t be sneaking a cook’s family into Valencia under your Grandmaster’s nose because he’s your friend.”  “You mistake me,” Bishop said. “There is no such thing as a friend in the Great Game of Valencia.”  “Maybe. But there’s such a thing as a friend for the Bishop of Sept Kingston, or you wouldn’t have risked giving two complete strangers access to your world in exchange for a servant’s goodwill.”  “It is no risk. You have shown me you would lay down your life for a stranger, and you are Olly’s . . . family. You would not betray her, or her father. You will protect each other. To do otherwise would endanger all your lives.”  “Yes, but why do any of this at all, if there’s not a good man under all that Great Game hogwash? Why even bother to go through all this trouble to bring me to your ship for treatment when I’m nobody to you? Why not kill us all when we attacked your people instead of taking us here to give two people a chance to find each other again?”  “Why did you save me?” Bishop snapped.  “You keep asking that like it’s a bad thing. Why does it bother you so much?”  “Because I have lived a long time and no one has ever done that for me,” Bishop bit out, and for the first time, Sebastian saw his jaw clench. “No one ever would. Why did you?”  “Because in my world, if you can help someone, you do it. Space is a big, lonely place. When you find other humans, you cherish them. You have no idea when your reactor might go, or your hull might blow out from an impact, or your equipment might fail and leave you floating until your oxygen runs out. You don’t know when the last time is that you’ll get to talk to someone, laugh with them. Kiss them.”  He swallowed, his mouth suddenly dry, and stepped back. “Out there, anything that can take life is the real enemy. Out there, you don’t ask questions when you see a problem. You jump in and help. Because we’re all valuable. We all matter.  “You, Bishop, you matter. And not because you’re the Bishop. Because you’re a human being. I didn’t know I was saving anyone at the time, but I knew someone was looking to kill, and I couldn’t let them do that to another human being.”  For the first time the stern lips parted a little, as though he’d surprised Bishop. Sebastian couldn’t look away from them as he added impulsively, “For what it’s worth, even though this has been the longest, most insane cycle of my life—if it’s even still the same cycle—I’m glad I stepped in front of you. You gave Olly back her father.”  Bishop’s lips curled. “If you believe me to be a hero, or a good man, you could not be more wrong. You don’t know me, Sebastian.”  “Maybe I don’t. But I’d like to try, sometime.”  Bishop was silent a moment. Then he asked, “Why?” and the hesitancy in his voice made a strange tenderness unfurl in Sebastian’s chest.  “I don’t know. I don’t even know what you look like. But you helped me. You helped Olly and Sticky. And you have an amazing voice. I like the way you say my name.”  He turned to catch up with Olly, heart pounding hard, but satisfied whatever game Bishop was used to playing, however much he was used to winning, he hadn’t won that round.  “You are sure?” the Kingston asked.  Bishop waited, silent before the virtual form of his Grandmaster and beside the very real one of his Queen.  “The Bishop has been most thorough,” the Queen replied. “In all, four Pawns and one Rook had been compromised. And the dead Knight, of course.”  The Kingston turned to Bishop. “You were able to identify all these traitors due to the information received from interrogating the captured Pawn?”  “Yes, Grandmaster Kingston,” he said.  A slow smile split the wide, full lips beneath his half-mask. “And you say torture is not effective.”  “I believe in give and take, Grandmaster. Pain and death cannot be the only reward.”  “Oh? And what was the give and take for the Pawn?”  “I took flesh in return for her life.”  The Grandmaster frowned. “You did not judge her as she deserved?”  How to explain that when the time came to dispose of the unlucky Pawn, he could not forget the heated words of a man the Grandmaster must never know existed? Could not forget how twice in his life, he had been helped. Shown mercy.  That once he learned how new to the Game the Pawn was, his ruthlessness felt like the type of cruelty Sebastian would never forgive him for.  Sebastian’s opinion of him should not matter. He knew that. And yet it did. This realization was burning through him, razing many things in his path. Stripping his detachment from him in ways he had not expected.  “The Pawn has no family, and now, no home. The moment she returns to Valencia, her implant will kill her. If she tries to remove it, her implant will kill her. She is maimed, alone, and disgraced.”  “She has her life,” the Queen remarked. He turned to look at Bishop. “The Great Game is seldom so merciful. And I have never known you to be.”  “It is good that I was. She confirmed what I suspected—that Sept Bartica was not involved in such an obvious move that would immediately bring them under much suspicion. She confessed to all she knew of Sept Marigot’s involvement during the first interrogation. But it was during her recuperation, when she truly believed I would not heal her to kill her, that she divulged the participation of the White Knight.” He glanced at the Queen. “We must never be afraid to grow, change, and adapt if it is for the good of Sept Kingston.”  “What of Sept Marigot?” the Grandmaster asked, eyes narrowed within the holes of his gold and jade mask.  “The King and I shall have a response for you in a few days,” the Queen said, his voice mild. “I recommend patience. Let them wonder if they have succeeded. Then, as news of the purge here spreads, let them dread our retaliation.”  “I approve,” the Kingston said with an indulgent smile. “You and my exceptionally competent daughter have my full trust in this matter.”  Bishop swallowed his bile at the compliment the Grandmaster had paid to the woman who had taken his position. Who had helped deliver Bishop to his enemies, along with Alexandar—the previous Valencia and his only true friend in the Great Game.  “The Valencia has decided the Consortium’s lost slaver ship will be handled by both our Septs. It is too important an opportunity for us to form a new alliance with a powerful civilization. It cannot be left to one Sept’s influence. And she will need assistance given that the ship’s last reported position yielded no sign of it. As to the other . . . delicate problem you’ve alluded to . . . ” The Kingston sounded grim for a moment at his usage of their code for a problem only a Grandmaster could address. “I shall return to Valencia in two weeks. After that, we shall have much work to do.”  The Queen murmured his assent.  “And you, Bishop.” The Kingston’s voice was sly. “What of Septhold matters? Do I still have a Cook?”  He bowed his head. “We have come to an agreement, Grandmaster. He will remain in service for three more tempi.”  The Kingston’s chuckle was dry and short. “So you finally managed it. How?”  “He believes us to be friends, Grandmaster. I convinced him I was looking out for his best interests.”  The Queen broke out in hearty laughter. “Was that all it took? These off-worlders. What an odd outlook they have.”  “Odd indeed,” the Kingston agreed. “I bought his loyal services for some money and a few days treatment for a dead woman. He prevailed upon my mercy, I granted it to him, and he is forever grateful.” He glanced at Bishop. “Much like our reformed Bishop. Isn’t that right?”  Bishop swallowed the ball of shame and rage in his throat and met his Grandmaster’s gaze. This anger, this was familiar. He could not abandon it now. He would hold to it until he regained power and took back all he had lost. And with someone making unsanctioned moves, he sensed his time approaching. “Yes, Kingston. Thank you, Grandmaster Kingston, for your mercy.”  The Kingston gave him a smile edged with scorn. “It is good you remember.”  He could almost feel the throb of long-ago pain under the smooth skin of his back as he replied with his usual honesty, “I shall never forget.”  “Best leftovers ever,” Reece sighed after lunch a few cycles later. They were getting ready to launch, everything having been repaired and tested, and their new payload and route confirmed by Dispatch.  “I’m definitely going to miss Sticky’s cooking,” Sebastian agreed as he stowed equipment. He would not let his mind go to what else he might miss, as there was no point in that. It appeared he’d won nothing but Bishop’s absence. He had not seen him since the Greatwood, and he refused to acknowledge the sharp edge of hurt that raised in him.  You made a pass, he wasn’t interested. It happens. Maybe he’d been too subtle, but taking the initiative had always been hard for him. In fact, he’d never been interested in anyone who wasn’t already a friend before. Bishop was new, terrifying territory and in the end, his lack of response made his position clear.  “Sticky and I exchanged pings,” Olly said casually, as if it wasn’t a bomb being dropped in the middle of the conversation. “We’re going to meet up next time we’re in port together. Wherever that might be.”  They both stared at her. Then Reece grunted. “Well, wonders never cease.”  “That’s good, Olly,” Sebastian said with a grin. “Real good.”  “It’s not a big deal,” she warned. “I haven’t forgiven him. I just really like buss-up-shot.”  They laughed, agreeing without words to leave her the fragile safety of her flippancy.  “Thank you,” she said to Sebastian in a halting voice. “For being there for me through that. And thank you,” she turned to Reece, “For always understanding what I need. I don’t know what I’d do without you guys.”  Reece made a humming noise and turned away. “You’ll never have to find out.”  Sebastian went outside to make the final checks with the shift supervisor and knock panels for document transfer. The supervisor was walking away, already conversing over his implant with another ship’s crew, when he noticed a tall figure coming straight toward him out of the corner of his eye. He turned at the bottom of the Kiskadee’s access-way, taking in elegant shoulders under a loose shirt, hands tucked into the front pockets of jeans, and finally, the arresting and unfamiliar face.  His body recognized Bishop’s scent before his mind caught up to the soft flop of hair over a smooth forehead, and the watchful darkness of his eyes. The lips were as stern as ever, his jaw flexing under golden brown skin.  “Wow,” Sebastian said, “you . . . clean up good.”  Bishop glanced at the ship. “You’re leaving.”  “You’re not wearing your mask.”  “Sometimes I need to go about my business without announcing who and what I am.”  Sebastian cleared his throat and asked, “What business are you about today?”  Bishop’s eyes gave away nothing as they traveled his smudged coveralls and heavy boots. “You were right,” he said. “Sticky is a sort of . . . friend. Because I know what it is to be taken into service with the expectation that you forget those you left behind. I know the cost of the loyalty the Kingston demands, and I understood how difficult it must be for those not of Valencia. I may not agree with all you said. But I have thought on it many times since we spoke.”  “Oh?” Sebastian folded his arms over his racing heart. “This should be good. What did you think about, exactly, while ghosting me for cycles?”  “I didn’t ghost you. Your seedlings always tell me where you are. But I had much to do. Sticky said you were leaving today, and I wanted to see you before you left.”  “You could have seen me when we were visiting your ship, or the last time we went to see Sticky in Valencia,” he pointed out.  Bishop inhaled deeply, then breathed out. “It is not a good time for me. There are things I am bound to do. Problems within our society, with the Greatwood itself, that I am tasked with helping my Grandmaster and our leader, the Valencia, solve.”  Surprise swept through him. “What kind of problems?”  Bishop glanced at the ship then back at him. “I wish you and your lovers well, Sebastian. Stay safe on your journeys. I do not think we will meet again.”  He moved closer, giving Sebastian time to react. Time to refuse. The problem was, Sebastian thought, as he watched him lift his hand, curl strong fingers around his neck, and pull him near, he didn’t want to refuse him. Instead, he met those firm, gentle lips with his own and his breath hitched, his pulse running riot as he tasted silky warmth and languorous exploration.  When Bishop drew back, he fitted one thumb into the slight depression of Sebastian’s dimple, while his other hand curved around to rub his thumb against Sebastian’s mouth. “Kian,” he said in a quiet voice.  “Kian?” Sebastian whispered, confused.  “My name,” Bishop said. He released him and stepped away. “And I like the way you say it too, Sebastian.”  Sebastian was still staring after him when it dawned on him none of the questions he’d asked had been answered.  “You know,” Reece said after they’d launched, “I thought you’d want to stay a little longer.”  “Stay?” Olly questioned from her copilot chair. “Why would he stay?”  Reece glanced at Sebastian where he sat in the jump seat, trying hard to look unaffected while his lips still tingled. “Should I tell her?”  “Tell me what?”  Reece turned back to the controls. “Bishop.”  Olly looked at him with wide eyes.  “Thanks a lot, Reece,” Sebastian said.  “Oh my God! He’s such an asshole though, Bas. Really?”  “Apparently, he doesn’t kiss like one,” Reece said.  “You were watching!” Sebastian accused.  “I was testing the cameras.”  “How could you not tell me?” Olly slapped at Reece’s arm. “You know how I love to watch him get hot and bothered.”  Reece grunted. “Checklist was more important.”  “You’re such a prick.”  “That’s why he likes me.” Reece leaned back after switching to autopilot. “That’s probably why he likes him too.”  “I do not like you because you’re a prick,” Sebastian said, glad no one could see how hot his face felt. “It’s precisely because you’re more than that, under,” he waved a hand, “all that. And so is he.”  “Sure about that, are you?” Olly said with raised eyebrows.  He sighed. “Hell, no. All I’m sure about is the man has too many secrets and is nothing but trouble. His kisses might be worth it though.”  Olly’s expression softened. “Yours certainly are. But no more getting caught up in assassination plots, okay? They don’t usually end with good food and kissing.”  He held his hand over his heart. “I swear, I don’t go looking for trouble. It just finds me.”  “Maybe you exchanged pings,” Reece said in a mild voice.  “A joke!” Olly squealed. “Are you okay, Horace Reece? Do you have a fever?”  Reece ignored her and turned to face Sebastian fully. “You could have stayed. Spent a little time with him. If you feel something for him, you can say so. You know that, right? You can change your mind about . . . us.”  Sebastian unclipped himself from the chair, walked over to Reece and bent to give him a lingering kiss. He held his face with both hands as he said, “Yes, I feel something, but I don’t think it’s the same for him. So, no, I haven’t changed my mind,” he said with a smile. “I’m where I want to be. With the people I love.”  “Same,” Olly said, reaching out to caress his forearm.  Reece grunted as Sebastian stroked his head, closing his eyes in contentment.  For a few precious minutes, there was nothing but the three of them breathing in harmony as Greater Paradise faded, a dying of the light in the star-studded dark.  Just perfect.  Well. Almost.  “So,” Sebastian said. “Did you leave any roti for me, or did you two assholes eat it all?” R.S.A. Garcia writes speculative fiction, and lives in Trinidad and Tobago with an extended family and too many cats and dogs. Her debut science fiction mystery novel, Lex Talionis, received a starred review from Publishers Weekly, the Silver Medal for Best Scifi/Fantasy/Horror Ebook from the Independent Publishers Awards (2015), and became an Amazon Bestseller.  She has published short fiction in magazines such as Clarkesworld Magazine, Escape Pod, and Internazionale Magazine. Her stories have appeared in several anthologies, including the critically acclaimed The Best of World SF: Volume 1, The Best Science Fiction of the Year: Volume 4, The Apex Book of World SF: Volume 5, and Sunspot Jungle: Volume 2. Her work has been translated into Italian, Spanish, and Czech.", "text": "20630 words, novella\nBishop's Opening\n2022 Finalist: Ignyte Award for Best Novella\n2022 Finalist: Theodore A. Sturgeon Memorial Award\nOld as she was, the Kiskadee had done three full delivery runs without a single safety incident. So naturally, with the crew relaxed after a fourth successful delivery and launch, and eight cycles after Reece slingshotted the starship around Tavaco to head back to the Roost and their next job, their luck ran out.\nSebastian was in the middle of his daily workout when the shrill bark of the fire alarm brought him to a halt.\n“Where’s that coming from?” he shouted as he hurried to unbuckle himself from the treadmill’s harness with sweaty hands. Officially, he was the newest crew member, two years into a three-year contract and designated as a cargo handler. The alarm meant the “other duties as assigned” part of his contract was about to kick in.\n“Ventilation shafts ten and eleven,” Reece replied in his ear.\nSebastian was shoving his feet into his mag-boots when the pilot added, “Origin point—oxygen unit four.”\nShit. The schematic in his head confirmed that was one of the units for the living quarters, and the ventilation shafts fed into both cabins. Plenty of fuel for the fire.\n“Get into that suit, Bas,” Olly said. She sounded calm, but Sebastian knew she was worried. If they couldn’t contain the fire by starving it of oxygen, then finding and smothering the source with CO2, they’d have to vent the entire level.\n“Two minutes and I’ll have eyes on it,” he said, ducking through the airlock into the corridor. The hexagon shaped Kiskadee was mostly its aft hold, with everything else jammed around or in front of it, so he didn’t have far to go to the cabins. But that also meant a fire could spread fast, and they’d never see it coming.\n“Corridors clear,” Reece verified.\nThe nearest suits were between Olly, his, and Reece’s cabins, so he would get a look at the fire as he dressed.\nWhen he glanced through the porthole into his shared cabin, there was nothing to see but neatly made bunks and storage. He leaped the few feet to Olly’s airlock, peered inside, and cursed.\nSeveral spherical balls of yellow-orange flame surrounded hearts of indigo blue, floating through the air like misshapen balloons. They lost their shape and spread out into rippling carpets as they encountered more oxygen. One drifted down to touch the protective barrier above the red-tipped lettuces growing in Olly’s small hydroponics garden. The flame died, but the transparent plastic blackened, short zigzag patterns scorching its surface as the invisible fire continued.\n“I have eyes on it. Vent the Habitat, then Olly’s room.”\nHe slammed his hand down on the lock and the door opened.\n“Sebastian, what are you doing?” Reece asked, his voice sharp.\n“Thirty seconds!” He ducked under a fist-sized ball of flame and headed for Olly’s rectangular garden. The plastic over another part of the garden grayed to opaqueness as it melted inward. To his right, a globe of fire settled onto Olly’s bed and deflated into nothingness as black patterns burned into the sheets and restraints.\n“You don’t have thirty seconds,” Olly said. “I’ve already sealed off and powered down the unit in Habitat Maintenance. Venting the cabin now.”\nSebastian ripped the plastic off the garden, cradled the huge tray—made light by low gravity—against his chest, and leaped for the doorway.\n“Do it!” he called out as he twisted in midair, touched down in the corridor, and slammed his elbow against the lock screen.\nThe airlock clicked over to sealed as he carefully placed the tray on the ground, then wrenched open the double doors of the storage unit.\n“Sebastian?” Reece asked, his tone clipped.\n“Fine, I’m fine! Getting into the suit. One minute to deploying CO2.”\nAn hour later, when he emerged from Habitat Maintenance, he found Olly had already laid down the foam in her quarters. She took her helmet off as he approached and shook out her braids.\n“Why?” was all she said, dark eyes narrowed with anger.\nHe stopped. He’d seen her this angry once before, and it was best if he kept his distance so she wouldn’t be able to physically pummel him. She’d done that last year, after he’d turned back on a near-empty oxygen tank to grab her safety-line when both her anchors were severed during a space walk.\n“It didn’t take me ten seconds—”\n“You had no idea how far that fire had spread.”\n“I’ve seen fire like that before. Once you get the shafts closed and the power off, you’re going to be fine.”\n“Opening the door could have fueled it!”\n“Goodness gracious, I’m fast enough to avoid great balls of fire,” he said, with a slight smile at his own bad joke.\nShe advanced on him, poking his chest with her finger. “Not funny, Bas.”\n“Okay, maybe it’s a bit forced—”\n“Just tell me why.”\nHe grew serious. “Because you love that damn garden. It’s taken you three contracts to afford it, and you just got those lettuce right. I wasn’t going let you lose it.”\n“Really?” She flung up her hands, her expression incredulous.\n“I knew I could save it. So I did. And anyway,” he gave her a grin, hoping it would go a long way to settling her nerves. “I didn’t want to be stuck eating dehydrated protein bars and sauce packets for two weeks.”\nOlly’s teeth bit into her lower lip, and she made a sound of frustration. “What am I going to do with you?”\n“I’d say take me to bed because your shift’s up. But I’m guessing that’s a no.”\n“Good guess.”\nHe made a sympathetic hum in his throat and drew closer. “What if I do the reports while you and Reece deal with Dispatch and Facilities?”\n“Is this your way of trying to make me overlook your reckless behavior?” she said, eyebrows arched.\n“Is it working?”\nBut Olly only huffed and walked away, leaving him to follow.\nA knock made Bishop Kingston look up from the plans on his desk. “Come.”\nThe door to the office, inlaid with mother-of-pearl tracings, folded open. Kingston’s White Knight entered and fisted his right hand against his bare chest. A glittering 3D tattoo of two diamonds inside a circle—the crest of Sept Kingston—flashed at Bishop from the Knight’s forearm.\n“A summons, Bishop. Kingside,” he said, his voice thin as it emerged from the pinhole speaker of the full-mask he wore. The mask was as white as the Knight’s sheer pantaloons, and edged with green and gold, the colors of Sept Kingston. Bishop wore a similar mask himself, only his had the crest etched into the left cheek. It was twin to the tattoo on the back of his right shoulder.\nHe rose smoothly from his desk, refusing to let the tension that gripped him show itself in his movements. “The Audience Room, I presume?”\n“The King awaits you in her Chambers.”\nA matter too sensitive for the Rooks or Kingside Pawns to hear then. His mouth set in a grim line. It would not be good news if it had to be discussed in Chambers, and with Grandmaster Kingston off-world, he assumed the worst. That it had something to do with the Kingston himself.\nThe Knight accompanied him through the hollowed out, highly polished halls of the Sept. The walls were a honeyed color, petrified wood that had aged to perfection since the time the first colony ships had landed on Valencia. One of the first Septs grown from the Greatwood, Sept Kingston was a sprawling mansion surrounded by its own village, every bit of it pruned from the sentient forest that covered much of Valencia’s main continent. Vines dripped from arches and windows, fluttering in the breeze that drifted through their sparkling flowers, carrying their sweet floral scent everywhere.\nThe King’s Chambers were on the third floor, deep inside the labyrinthine Sept to make it difficult for saboteurs and assassins to find. When Bishop called out and the King bade him enter, the Knight bowed and turned back down the corridor. Bishop made sure he had departed before he touched the doors open.\nThe King of Sept Kingston sat at the console that curved outward from the massive tree trunk growing through the center of her suite of rooms. Her mask was the same tan brown as her skin, with tinted eyeholes and a speaker in the center of the parted, painted-on red lips. Her capable hands danced along the Coretree Analysis Unit, inputting model calculations to ensure their nutritional value before she fed them to the crystalline quantum Coretrees themselves. Through the tinted windows on her right, Bishop could see the glittering expanse of the Sept’s vineyards beneath the morning sun.\nBishop bowed and waited. The King would take her time to greet him, as the models were of the utmost importance. Feeding the Coretrees was the most important job of every Sept and Grandmaster. Without the Greatwood, no ships could be grown, no Septs improved, no trade conducted for necessary resources. Without the Greatwood, the quantum power of the Coretrees could not be used in Valencia’s other business. The solving of problems, great or small, computational or otherwise, for off-worlders who would pay good money to have the impossible made possible.\nAnd right now, after several tempi of inexplicably low Harvest, and Coretrees that bore rotten fruit and errors, they had their own urgent problem to solve. The King spent most of her time working on this with the Grandmaster, while the Queen and Bishop made sure their strategies in the Great Game of Valencian politics did not suffer and leave them vulnerable to attacks from other Septs. But Harvest was near, and the season of Petit Caréme almost upon them. Soon, this tempi’s Term of the Greatwood would close, the Septs’ rankings would be posted, and several months of reprieve from the deadly games would begin.\nNot that his work would end. No, Petit Caréme was the planning season for his kind.\nThe King froze the hologram in front of her and looked up at him. “Bishop. You are well, I hope.”\nHe hated these false pleasantries, but it was not polite to begin a conversation without them. “My King. I am in excellent health. Thank you for asking. You are also well, I hope?”\nShe waved a dismissive hand. “I have a task for you.” Her voice was gentle and low but threaded with hardness.\nBehind his mask, Bishop pursued his lips. “Of course, my King—”\n“Bishop,” she interrupted him. “Let’s speak plainly.”\nOld anger weighed heavy on his tongue, but he only said, “As you wish.”\nShe rose from the carved chair and went to the window, narrow shoulders visible beneath her sheer robes. She was tiny, barely above five feet. Her black hair had been crimped and curled into a bejeweled knot. He stared at the back of her neck and tried not to think of how easily he could break it.\n“Are you still angry, Bishop? About what we did? What we took from you?”\nHe knew her questions were traps, so he said nothing. He clenched his fingers against the urge to scratch at shoulder scars that had completely faded many tempi before.\n“You can tell me the truth. It would not leave this room.”\nHe knew it would not, but he had no desire to ever trust her with his secrets again. She was King now. And he was a Bishop still earning his way back into his Grandmaster’s trust.\nShe sighed. “You always were so careful. I never thought you would defy him. You know how he is.”\nOh, he would not discuss this. Not for her, not for anyone. “You did not send for me to discuss my . . . feelings.”\n“Of course not,” she said. “As Bishop, you have none. And you are right. This is no time to indulge my curiosity.”\nHe was not fooled. She was prodding, always prodding, for any sign of weakness. Any sign of betrayal. He was grateful for a less subtle attack this time, at least. The other kind was harder to guard against.\nShe turned and came to stand in front of him.\n“The Grandmaster has secured a Conclave with Sept Bartica. He will meet their Grandmaster at Greater Paradise on his return from the meeting with the Consortium regarding the search for their lost slaver ship.”\n“But he will be in the company of the Valencia. Will he allow such a move to be witnessed by her?”\n“He plans to be discreet, but she is an ally these past decades,” the King stated in her soft way. “For the moment, we have nothing to fear from the Royal Sept since we gave her our full support in the trial of the last Valencia.”\nThe King was right, but the Royal Sept Valencia was the pinnacle of the Great Game, their Grandmaster its best player. Bishop could never lose sight of how dangerous all the Grandmasters of Valencia were, allies or not. This one had almost cost him his life, after all.\nNo, he reminded himself. You did that with your own foolish, emotional actions. No one else is to blame.\n“You will take First and Second Rooks and such Pawns as you deem necessary and leave immediately for the space station. You will protect the Kingston and bring him home safely.”\nBishop bowed his head. “Of course.”\n“Take the Cook with you. The Grandmaster would appreciate satisfying meals after all these weeks of travel. The Valencia’s palette is not to his taste.”\nHe straightened. “Cook would welcome that. He has wanted to go off-world for some time now.”\n“I’m aware. And you must deal with the matter of his service. Use the time to bring the issue to a conclusion. I do not wish the Kingston to have to take action.”\n“That will not be necessary,” he said, stung at her censure and interference in his Septhold duties.\nShe stepped closer to him and signed instead of speaking, in case listening ears were nearby. “Don’t make me do your job again, Bishop. I don’t enjoy it.”\nBitterness filled him at her lies, but he kept his body relaxed. He signed back, “I understand your concerns, my King. I will allay them.”\nHer fingers were as graceful as her words. “See that you do.”\nReece chirped Dispatch at the Roost, who then contacted Eastern Allied Corporation’s Facilities Department. After he and Olly ran a full cycle of remote checks with Engineering to ensure the fire wasn’t caused by human error, and endured several lectures from Accounting about insurance premiums, the request to charge the repairs to Corporate Billing was approved. Sebastian filled out the necessary forms and Reece reviewed and filed them.\nThe Kiskadee couldn’t operate unless it could pass inspection when they returned to the Roost, so it made sense to get the work done immediately, before they had to pick up their next cargo. They put in for a few cycles shore leave during the repairs. EAC granted the leave, then directed them to Greater Paradise Space Station. Olly knew the station well since she’d spent most of her childhood there. It had a corporate-approved repair shop and was just two weeks away.\nHappily for Sebastian’s food-loving soul, it also had an unusually large food court level that sold more than variations on compressed seaweed and recycled water, because the planet Paradise and its resources were nearby.\nOnce the paperwork was done, Sebastian helped Olly move into their cabin, her little garden a splash of green in the gray room, and they settled in for a slow, boring ride to one of the great mysteries of the universe . . . the Arbor of Greater Paradise.\nSebastian could still sense the leftover tension in Olly as they worked. That was his fault, Reece told him on the Bridge while Olly was tending to her plants. He’d scared them both, and Olly wouldn’t forget that easily.\n“Fix it,” Reece had said.\nSo, when they finally went to bed, he settled under the sheets and pulled Olly close. She threw her bare leg over his and turned her head to where Reece floated alongside their bunk. His eyes were closed, but he was only resting them; he couldn’t sleep while technically on watch.\n“Tell me about the best thing to eat on Greater Paradise,” Sebastian coaxed, fingers drifting back and forth over her smooth shoulders.\n“Bas, we still have weeks of rations to get through. Why would you want to hear about what you can’t have right now?” Olly replied. Straps crisscrossed atop their blanket, cocooning them against the chill of their quarters. They were almost never all in one spot at the same time, but after the fire, the unspoken agreement was they needed a little time together.\nOlly walked her fingers over his bare chest. He twisted, choking on laughter that carved dimples into his brown cheeks, and slapped at her hand. “Stop!”\n“It’s hilarious how ticklish you are.”\nReece grunted beside them and flung one large, muscled arm over his bearded face.\n“Anyway, you know the answer already,” she added.\n“Tell me again. It will help me forget how small this bunk is.”\nShe folded her arms across his chest and rested her head on them, a slight smile on her face. “This bunk is not small. I’m a generously proportioned beauty. Isn’t that right, Reece?”\nTheir pilot did not answer, his barrel chest rising and falling evenly, as if he slept.\nSebastian ran his hands over her long braids and the metallic twists of wire that decorated them. He knew his smile was irresistible, so he wore her down with it until she groaned and said, “I just want to sleep, Bas.”\n“So do I. Help me?”\n“What’s there to tell?” she said softly. “Doubles is the best food in Greater Paradise. Everyone knows.”\n“How did you find out about it?”\nShe settled against him. Sebastian rubbed one hand over the soft rolls of her back and stretched the other to massage Reece’s smooth bald scalp, the way he liked.\n“Whenever my mom had to work late at the ice factory, she’d take me to hang out with Gran at the docks until it was time for home. They had a mess room, so it wasn’t as dangerous as being alone on the factory floor, or in our quarters. Sometimes, she’d be so late, Gran would take me for dinner. That’s when we’d go down to the Basement, to Sticky’s Place.\n“Sticky was from a long line of cooks. His however-many greats came up from the islands before the Wave, settled in the States, and moved on to the colonies when the Union fell apart. He’d left a cruise line to set up his own stall on Greater Paradise. The recipe for his best dish had been handed down for generations. Some of the ingredients were difficult to find, but since Greater Paradise was parked by an Arbor, he could trade with the Valencians for fresh herbs and everything else. Every time Gran took me to his stall, we had the same thing.”\n“Four doubles, everything, plenty pepper.” Sebastian sighed, his limbs relaxing beneath her warm body and the grip of the soft restraints. “What were they like?”\nShe made a contented sound, and he watched her lashes feather her cheeks as she went deeper into the memory. “Two pieces of round, soft, fried dough the size of your hand, with creamy seasoned chickpeas sandwiched between them. They came with a choice of condiments. Pickled, grated cucumber slaw. Sweet, earthy, tamarind sauce. Your choice of flavored pepper sauces. Mango, banana, or pineapple. You ate them right there, with your hands, standing or sitting on a stool, and the only rule was you couldn’t order just one.”\nSebastian closed his eyes, imagining a tiny version of Olly sitting on a stool too tall for her, boots firmly curled beneath the rungs to keep her in place in low gravity, face spotted with the delicious remnants of yellow legumes.\n“The first time Gran takes me there, she orders slight pepper, but this tourist standing next to us tells Sticky, everything. And then they order all the pepper sauces because they think they’re preserves. No one bats an eye because everyone likes food spicy in Greater P. Only way you can taste anything out here. But the tourist, they don’t know shit. They find out though. Never seen anyone drink that much milk in one go.\n“Best part is, Sticky watches all this and the only thing he asks is, ‘You good?’ and the tourist catches their breath and says, ‘Two more, please.’”\nThey both laughed as if the ending were a surprise, the familiarity of it wrapping Sebastian in drifting, cozy thoughts.\n“Doubles.” They started as Reece spoke in his deep voice. “Makes me think of tennis.”\n“Five whole words,” Olly teased. “Chatty tonight, aren’t you?”\n“I didn’t know you were listening to the story,” Sebastian smiled at him.\nReece didn’t move his arm, but he shifted his head ever so slightly into Sebastian’s touch. “I always listen.”\nOlly laughed softly. “No tennis in Greater Paradise. Sticky said they called it that in the islands. No one remembers why. I suspect he kept the name because there was mystery to it, like the Arbor.”\n“Maybe,” Sebastian yawned as he spoke, “it reminded them of home. You know. The immigrants who left the islands. Maybe they were just holding on to what they could. Even if it was just a name.”\nOlly was silent for a while before she said, “Probably.”\n“Olly?”\n“Yeah?”\nHe lifted her chin and kissed her before pulling back to brush his thumb over the velvet of her cheek.\n“Forgive me?”\nShe made a derisive sound in her throat. But then she leaned forward and pressed her warm lips to his again. “For now.”\n“Only for now?”\n“We both know this won’t be the last time,” Reece rumbled, eyes still closed.\nHe winked at her. “I can live with that.”\nShe sighed. “That’s what I’m afraid of. Then we’d have to find a way to tell your mom her baby got himself killed.”\n“She’s got eight other kids to fret over. She barely notices I’m gone.”\nOlly stroked a finger over his eyebrow. “Someday, Sebastian Thomas Carver, you’re going to figure out how unforgettable you are. Then God help us all because you get laid enough as it is.”\nReece didn’t join in their gentle laughter, rising instead to head up to the bridge and leaving them to rest in each other’s arms.\n“So, it’s true there’s gravity on Greater Paradise?” Sebastian asked. They were five cycles out, and he was more than ready to start his short vacation.\n“Only where the Arbor’s grown onto the station. No one knows for sure how or why,” Olly said over the Kiskadee’s chirp. She was down in the galley, getting something to eat. He could tell from her muffled chewing.\n“But the Valencians know.”\n“Of course, they know. It’s probably something to do with them. Best guess anyone has of how their trade routes work is the Arbors camouflage something their ships use to jump long distances. Anything with that amount of power can support artificial gravity.”\n“Has anyone ever asked them though?”\nReece made a soft huffing sound next to Sebastian. His version of laughter. Olly outright chuckled in his ear. “Bas, no one asks the Valencians anything. If you’re smart, you stay out of their way. They’re easy to offend, and if you piss them off, there’s no one to turn to. They’ll shove you out an airlock so fast your head will spin.”\n“That’s murder.” He glanced at Reece. “There are laws against that.”\n“Greater Paradise isn’t a family commune,” Reece said.\n“He’s right. The fleet you grew up in was focused on keeping everyone safe because you were all families. Greater Paradise is about commerce. Station Agents uphold the laws for regular folk. The Valencians are . . . not that. No one tells them what to do. And there’s no recourse for anyone who messes with them.”\n“But the Pan-African stations don’t work like that. The Kairi sure as hell don’t work like that. You kill one of them anywhere, the entire Sibling Army comes for you.”\n“Government versus Corporate,” Reece grunted.\n“You’re not wrong though, Sebastian. In some places, murder’s only a problem if the wrong people die,” Olly said.\nSebastian considered that, a troubled frown on his face. “What do Valencians look like?”\n“Assholes,” Olly said. And no matter how he pressed her, she would not say more. So, he put the Valencians out of his mind and settled into preparing for his first visit to Greater P, a name Olly told him was an inside joke because for most residents, Paradise it was not.\nMostly, he planned the food he would try from the dozens of proprietors who serviced the thousands that passed through Greater P. Olly had told him what she remembered of her childhood there—every dish she’d eaten, every corridor she’d walked.\nBut she couldn’t prepare him for the actual sight of the Arbor. From the moment it first appeared on the viewscreens as a winking star, a bright light that grew larger and larger, he could not look away. The filters had to adjust, just so the rainbow dance of it didn’t blind them. The Arbor spun in the starlit darkness, a massive forest of twisting trunks, thin leaves, and curling tendrils. Greater Paradise rotated slowly beside it—two hollow metal circles connected by an elevator. The outer hull of one end of the station had been captured by the crystalline oasis and glittered like the Arbor, branches twisting over the rotating habitat as it grew toward the other end of the station.\n“There she is,” Olly said as they watched the station draw nearer. “Home, sweet home.”\nSebastian floated above the floor next to Reece, hand curled around a hard thigh to keep him anchored, while Olly sat strapped in on his right. “Are you glad to be back?”\nShe shrugged, sliding her fingers between those of his free hand. “Gran and Mom are both gone. Nothing here for me now.” But he knew that dismissive tone. Sensed something unspoken and painful under it. Olly was as private as Reece about many things. It was part of the reason they made such a good team. Talking was optional on the Kiskadee, and though he was always up for a chat, a joke, or a story, Sebastian didn’t mind silence.\nAs they watched, a ship glimmered into being beside the Arbor, a mirage settling into solid shape without warning. Although the forest dwarfed it, Sebastian drew in his breath at the dimensions and light-limned irregular angles of it. He’d never seen a ship like it. It looked like something carved from enchanted wood and fairy light.\nOlly groaned beside him. “Great. A Valencian ship is in port.”\n“That’s what they travel in?” Sebastian’s lips parted as he leaned closer to the screen. “It’s incredible.”\n“Talk is they grow their ships. Probably from the same thing as the Arbor, as they seem to thrive out here in absolute zero without any sustenance.”\n“I would give anything to see that up close.”\n“Enjoy the view,” she said. “This is as close as they let anyone get.”\n“Why?”\n“I already told you,” she said. “They’re assholes.” And her usually amused, cynical tone carried a bitterness Sebastian hardly ever heard from her.\n“You hate them, don’t you?” he asked, turning to look at her profile, at the long line of her neck and the small, rounded tip of her nose. Her eyes when they rested on him, were a deep, dark brown he couldn’t read. She laid a gentle hand on his cheek, but all she said was, “Better get ready to dock.”\nBishop was alone in the Grandmaster’s Penthouse suite when the call came from the Kingston. Once it was over, and his Grandmaster’s virtual form had dissipated, Bishop cursed under his breath.\nThe Grandmaster Valencia’s ship had failed to jump to the nearest Arbor after leaving Consortium space because of another instance of miscalculation by the Coretrees. There had been minor errors before, on Valencia. He’d heard of an incident several tempi ago, when a Sept vineyard transition deposited travelers at the wrong Sept. But this was far more serious. This time, a mistake had left the Valencia’s flagship stranded half a galaxy from their planned destination.\nWhatever had caused the error, the crew no longer trusted that the ship’s quantum exchange would work accurately. As a result, the Grandmasters had chosen the long, slow flight to another Arbor. From there, they would transition to their Septhold vineyards safely, and allow the ship to be inspected and repaired.\nBut that meant his Grandmaster would not arrive in time for the meeting. He expected Bishop to handle it instead. Bishop did not look forward to the task of soothing the Bartica’s temper once he realized the Kingston was not in attendance.\nHe gathered his Pawns and joined the Rooks that waited in and around the most exclusive private conference room of the Greater Luxury Hotel. As part of the normal power play of etiquette, the Bartica had not arrived yet. But as he was about to commit a breach of the original Conclave agreement by representing Sept Kingston instead of the Grandmaster, the least he could do was allow them the victory of being the last to arrive.\nHowever, when the doors opened, the Bartica did not enter. Instead, his King strode into the room with their Black Knight and paused on the other side of the wide, circular table inlaid with precious minerals and stones.\nBishop rose to his feet and bowed. “King Bartica, I welcome you to this Conclave with sincerity and good faith.”\nThe King was not required to exchange pronouns with, nor bow to, anyone of a lesser rank, so they inclined their head instead. On the forehead of their pale blue mask was the Bartican crest of a gold triangle with a smaller red one within. “You are not the Kingston.”\n“And you are not the Bartica.”\nThe King of Bartica curled dark brown knuckles around the back of a chair but did not pull it out to sit.\n“Why does he send a Bishop to a Conclave?”\n“The Kingston deeply regrets the necessity for his absence, but if you are willing to accept my credentials, we can begin negotiations.”\nThe King was silent for almost a full minute, hands relaxed around the chair while Bishop waited, senses on high alert.\n“I do not find this acceptable.”\nIf he was not bound by Valencian protocol, Bishop would have given vent to the kind of language that was forbidden once you were accepted into a Sept. Why could nothing be simple?\n“This is a primary Conclave, your first overture to us. Surely, the time to insist on such strict procedure is not yet at hand?”\n“What we wish to discuss with your Kingston is not for the ears of a mere White Bishop,” the King replied, the very slightest thread of annoyance in their voice. Bishop noted that with mild surprise; they must be deeply invested in this Conclave to let their disappointment be so obvious.\n“My apologies. Perhaps I can relay a message to impress upon the Kingston the urgency of your suit?” he offered, curious now as to what the Conclave would have addressed. This was no mere exploratory move. The Bartica had meant this in earnest, if his King was anything to go by, and that meant this Conclave might have had . . . ramifications.\nInteresting.\nThe King released the chair and flicked a hand at their Knights. They left the room and Bishop motioned to his Rooks to do the same. Once they were alone, the King came around the table and they stood chest to chest, heads bowed. Bishop cupped his palms, and the King made several signs within it before raising their head to look directly at Bishop.\n“I understand,” Bishop said. “I will pass on your message.”\nThe King spun in a swirl of silken robes and vine perfume and walked out of the conference room.\nBishop sank to his chair, thinking, his heart pounding hard.\nThe King, he now knew, was terrified. He had used the old language to tap out short words into Bishop’s palm. No wonder the Bartica had not come himself if those three words were true.\nMoves without Honor, the King had tapped, and Bishop thought it was a wonder his hand remained steady afterward.\nThere was only one way to play the Great Game without honor in Valencia. Only one way to make moves that would be condemned by every Sept, in public and private, as outside the rules of Honor.\nSomeone planned to challenge the ranking of the Septs. Change was on the way. Perhaps even . . . insurrection.\nAnd with that would come opportunities and openings he might find very useful indeed.\nWhen First Rook returned a few minutes later to report the King had left and the hotel was clear, he sprang from his seat with energy he had not had in many tempi.\n“Send for a car,” he told. “I must return to the flagship.”\nThis was news that could only be properly shared in person.\nWhen they stepped out from the noise and heat of the bay they’d been assigned to one cycle after their arrival, Sebastian felt like less of a visitor and more like he was returning to a familiar and beloved place.\nOlly had warned him that things would not be the same as in her stories. Station turnover was common. People came and went frequently, and places were always being added, or torn down and replaced by something new. But he was so rarely in port on a station this big, Sebastian felt the relaxed thrill of a true vacation. He walked the narrow, crowded lanes, craning his neck like a tourist at the levels that rose above them in spirals and connecting tubes.\n“Still smells like too many people,” Olly said, wrinkling her nose as she shoved her hands into the pockets of her utility pants.\n“You’re just sensitive because it’s been the three of us for so long,” Sebastian countered, staring at the shops and flashing ads while he ignored the endless permission pings on his chirp.\nHe stopped to stare at a gorgeous image of a teeming ocean in front of a travel registry and Reece moved in behind him so close, he felt the heat of his body against his back.\n“Didn’t get around to visiting the beach on Tavaco,” Sebastian said, berating himself for not going alone when Reece and Olly refused. He was too used to the rules of growing up as part of a large family in dangerous places. No solo outings, just in case.\nReece’s warm breath puffed into his ear. “Next time,” was all he said. Sebastian turned, surprised. “You mean it? You’ll come?”\nReece had a grimace on his face as he stared at the display, but there was no mistaking his assenting grunt.\n“Well,” Sebastian said softly. “Looks like Olly gets to take watch next cycle.”\nPausing next to Reece, Olly shook her head. “Wrapped around his finger.”\nReece shot her a look, and she sniggered before striding away, mag-boots clicking. Sebastian bumped shoulders with Reece as a thank you before they strolled after her.\nAll in all, everything felt . . . perfect.\nUntil they got to the Basement and stood where Sticky’s should have been, and it was a Creole food stall instead.\nThe owner looked at them with mild disbelief when they asked about Sticky’s. “You gone ah long time. Sticky’s closed since before I come here, and that was right after the Blowout. Years now.”\n“But the doubles? The roti?” Sebastian said, heart sinking.\n“Don’t sell them thing out here now. Have to go Arborside. By the rich people them.”\nSebastian tried to convince her to go with him, but Olly would not listen. “We’re not going into Valencian territory,” she said firmly as they walked back toward the unimaginatively named Busy Junction where people, hotels, shops, restaurants, and stalls met in a chaotic, food-scented crisscross of lanes. “It’s dangerous and there’s plenty of good food right here.”\n“We’ve got time to sightsee. We could just take—”\n“Bas,” she said without looking at him, “It’s not always about what you want. We’re not going, and I’m done discussing this.” She lengthened her stride to leave him behind.\nSebastian halted as he realized she was angry at him. Really angry, in a way he’d never seen before. What did I do?\n“Did I miss something?” He looked at Reece. The pilot put his hands on his hips, stared upward for a moment, then directed his gaze at Sebastian. “Give us a minute.”\n“Sure,” Sebastian said, trying not to feel hurt. It was moments like these he was reminded of how long they’d been together, their connection rooted in secret smiles and monosyllabic references; questions they shrugged off and jokes only they understood the punch lines to. Worried he’d once again strained their relationship in some unexpected way, he slowed, watching Olly gesticulate while Reece listened with a frown crinkling his forehead.\nAn enclosed bullet car slowed to a stop in the street, gliding noiselessly on buried tracks. The light from the double doors of a hotel on his left slid along the car’s tinted roof and sides like water. A group gathered in the hotel’s doorway. They all wore masks but the tallest among them, at the front of the group, wore a patterned one. Sebastian sped up, trying to get out of their way.\nThe side of the bullet car retracted, and he glanced at it. A shifting shadow and a flicker of light in the dark interior caught his eye, and he halted suddenly. His boot didn’t engage as fast as he needed, and he stumbled to his left.\nHis shoulder slammed into someone, his hands tangling in satiny cloth over warm hardness. There was a sharp intake of breath as fingers gripped one of his wrists. But Sebastian was looking behind him because his mind had finally figured out what he’d seen.\nA dark shape crouched just inside the car doors. Sneering lips curled beneath a black mask that hid everything from nose to forehead.\nWhat the hell?\nHe wrenched his arm free and took a step toward the car and the object glinting in the passenger’s outstretched hand. Is that a gun? Weapons were forbidden on Greater P, but he knew immediately it couldn’t be anything else.\nInstinctively, he lunged for it, and the passenger pulled back as he grabbed at a black-gloved hand and shoved upward. They grappled, Sebastian toppling into the plush seat alongside the door, one foot still on the sidewalk. Grunting, the attacker got their leg beneath Sebastian and kicked hard. The first strike robbed him of his breath. The second sent him staggering backward out of the car.\nSeveral hands took hold of him as the car door closed. It slid away into the street, scattering pedestrians. Out of the corner of his eye, he saw silent figures loping after it, taking bounding leaps through human and vehicular traffic in the low gravity, but his attention was captured by what he held in his palm. The silver-gray tube had a tiny button on the side and two hollow ends. It fit neatly in his hand, innocuous and almost weightless. He had no idea what it was.\nA hand covered in a white glove closed over his wrist. The tube was wrenched from him, and he was jabbed painfully in his ribs on either side. He heard a shout up the street. Olly’s voice. About time, he thought, still a little resentful they’d walked off on him. Reeling from the suddenness of the fight, pulse rioting under his skin, he looked up at the person in front of him.\nA white mask, decorated with swirls of green and yellow flowers, stared back at him. The eye pockets were tinted, and a dark pinhole speaker where a mouth would be formed the center of a flower head.\n“Name the Sept that hired you, and I will consider letting you die swiftly.”\nSebastian’s stomach lurched, nausea slicking the back of his tongue. “What?”\nIron fingers curved into his throat, squeezing hard around his Adam’s apple, and cutting off his air efficiently. “If you answer me now, you deal with me,” the soft monotone continued. “If you refuse, I’ll give you to my Rooks. I promise you, whatever happens to you then will happen to everyone you love as well.”\nSebastian struggled but the hands on his biceps and forearms held him tight as he fought to breathe. The hand on his throat loosened and he doubled over, gasping, as an outraged bellow sounded somewhere far away. Through blurred, teary vision he saw a dart of shiny metal sticking out of his left rib cage. Fingers gloved in white plucked it from him. A headache speared behind his eyes, and he moaned at the sudden pain.\n“They shot him,” a voice said above him.\n“Why would they target their own?” another asked.\n“A question worthy of consideration,” the monotone replied.\nSomething crashed into his left side. Amid harsh cries and the thump of flesh hitting flesh, he heard Olly calling his name. Pain sat on his chest like an idling cargo bot, and he couldn’t catch his breath to answer her. He fell sideways, his boots losing contact with his ground, his body beginning to drift.\nHands pulled at him, lifting him against a firm torso. He looked up into the masked face. It was luminous with sparkling, twisting flowers growing downward to brush squared shoulders. The slowly curling stems and blossoming petals were mesmerizing. He could smell their floral perfume, and it smelled better than Olly after a real shower. He lifted a hand and stroked at the mask. It was smooth beneath his fingers; firm and cold as metal. He sighed, oddly soothed, a faint smile curving his lips.\n“What did you do!” Olly’s voice sounded muffled. “What the fuck did you do?”\nHe wanted to defend himself, to tell her he hadn’t done anything at all, but the swelling bubble of pain in his head and the roiling in his stomach distracted him.\nThe monotone said above him, “Take the gun. There will be traces inside. We must know what they used. We have minutes at most.”\n“The Station Agents—”\n“This is not their business.” There was a pause during which he could clearly hear scuffling and Reece swearing. “Bring them.”\nAn arm was around his waist, another under his shoulder, and he was spun in a circle. A bullet car stood waiting in front of him. “Do I get to ride in that?” he wanted to ask, but then pain hooked viciously into his ribs, and he screamed.\n“Sebastian!” Reece sounded panicked and furious, but oh God, the pain. He couldn’t answer, couldn’t think; the pain had him, and it dragged him down, down, into a black hole of nothingness.\nHe drifted back to full awareness with a chill burning under his skin. He lay on something velvety and yielding, but he shivered so hard he heard his own teeth clicking.\n“The antidote is working. You may leave us.”\nA hand slid under his head, lifting his chin. Insistent fingers pressed against his mouth. He parted his lips, and a pill was placed on his tongue. He tasted the salt of skin as the hand withdrew. The edge of a cup replaced it, washing down the pill with water. He curled into himself, trying to get warm. Callused hands grasped his palms and chafed them with strong, firm movements. He gasped with how good it felt and inhaled a delicious, floral scent.\n“Reece?” he murmured, forcing his eyes open.\nThe blurry face above his resolved into stern lips pressed together beneath a green mask that covered nose and forehead. The memory of a black mask floated to the top of his mind, and he jerked backward, hitting his head on a wall. He groaned as sparkles exploded behind his lids and agony sliced through him.\n“Careful,” the voice was low and so resonant it sent a shiver through him. “You don’t want to move much yet.”\nHe lay still, catching his breath and cataloging the aches rioting through his body in swift jabs and lingering strikes. When he felt warmer, after the shivers passed, he licked his lips. “Reece? Olly?”\n“Your friends, I assume?” The figure straightened, towering above him. This mask did not cover the eyes, but the holes were too deep set to see them at this angle.\nMy family. My everything. But that was none of this stranger’s business, so he simply said, “Yes.” He tried to sit up and a firm hand descended on his shoulder. Heat seared his skin through his shirt.\n“Slow. Your balance might be affected. The pain and hallucinations may return.”\n“What happened?” he asked.\n“I hoped you could provide those answers.”\nHe frowned. “Me?”\nCorded arms a lighter shade of brown than his own folded across a flat chest. “Your name and pronouns?”\n“Sebastian.” In the expectant silence that followed he instinctively added. “Carver. Sebastian Carver. I prefer he/him. Yours?”\n“Bishop shall suffice. He/him. Are you a resident of Greater Paradise, Sebastian Carver?”\nThe way his name rolled off Bishop’s tongue, resonating in that low register, made his skin tingle with awareness. He shook his head, then regretted it instantly and pressed his fingers to his temples. The pain has certainly returned. “Passing through. The Kiskadee needed repairs.”\n“Your ship, I presume?”\n“Yes.”\n“When did you arrive?”\n“A cycle ago. I think.” He frowned. “How long have I been here?” For the first time, he glanced around and realized he sat on a bunk. The walls that curved around the small space looked carved from polished wood, filled with silvery ripples and dark knots. There was a desk and chair to his right. A closed door stood between the bunk and the desk, and another behind his questioner. “Where am I?”\n“Aboard the Kingston’s flagship.”\nHe rubbed at a sore spot on his ribs absently. “Sorry, I think I missed something. What’s the Kingston?”\n“My Grandmaster.”\nAt Sebastian’s raised eyebrows the stern lips parted with a quiet sigh. “You have no idea to what I refer, do you?”\n“Should I?”\n“Tell me something,” his voice was filled with curiosity, “why did you reach into that car, Sebastian Carver?”\n“Just Sebastian,” he said automatically. “They had a weapon. You took it from me.”\n“You put yourself between me and that weapon. Why?”\nSebastian groaned as he settled elbows on his thighs and gripped his throbbing head. “Because I’m clearly an imbecile.”\n“Perhaps. But I need an answer.”\nSebastian tensed, realizing suddenly that although he was the one injured, he was being interrogated. “Well, Bishop, if you have a problem with me saving your life, you can call the Station Agents. Otherwise, I’d like to go back to my friends now.”\n“Is that what you think you did? Save my life?”\n“You tell me,” Sebastian said, spreading his arms wide, exasperated.\n“This is your plan, perhaps?” Bishop asked in a mildly amused voice. “To place me in your debt?”\nSebastian was done. This was beyond ridiculous, and he had no more patience for it. “If it was, it clearly wouldn’t have worked, because you don’t seem the grateful type. In fact, you strike me as an . . . ”\n. . . asshole. Oh. Shit. His eyes widened as he stood tall enough to see dark eyes as cold as the deep space outside the station hull.\n“You’re Valencian,” he breathed. That must mean . . . He understood now why he’d been able to lie down with no restraints. He was on a Valencian ship, in gravity.\nThe slightest curl formed in a corner of Bishop’s lip, and confusingly, Sebastian’s skin flushed with heat. “Why am I here?”\n“My question first, Sebastian Carver.”\n“I’m not sure, okay,” Sebastian shot back. “It was a weapon, and I was the only one who saw it. Nobody would have had time to stop them. I thought . . . it was the right thing to do.”\n“Are you in law enforcement?”\n“I.” He swallowed then took a deep breath. “I’m a cargo handler.”\nIn the silence that fell between them, Sebastian shifted his weight from one foot to the other, looking everywhere but in front of him.\n“A cargo handler. You are . . . interesting, Sebastian.”\nThere was that warm tingle again, stronger than before. Oh hell, no. This is not the time, Sebastian Thomas Carver. You don’t have the faintest idea what you’re dealing with yet. He made himself look directly at Bishop. “Where are my friends? What did you do to them?”\n“Do to them? You should ask, Sebastian, what they have done to us. My Rooks were exceedingly solicitous, given their behavior.”\n“If you’ve harmed them—”\nBishop stepped forward, bringing them so close, Sebastian’s fists were brushed by the soft layers of silver cloth that covered Bishop’s body; his scent swirled around them. “What will you do? Kill me, after so kindly saving my life? That would be such a waste of your efforts.”\nSebastian’s heart sped up even as bewilderment seized him. “What is wrong with you? Why the hell would I want to kill you? I just want to know why you’re keeping me here, and why you won’t let me see my friends?”\n“Because I must know if you are part of the attempt on my life, Sebastian,” he said in a voice suddenly sharp as metal. “As for your friends.”\nHe strode to the stateroom door and laid a palm on it. After making a few hand gestures, he brushed past Sebastian and strode to the desk. Sebastian watched Bishop lean there, ankles crossed, hands braced against the edge of the desk, until a flurry of activity drew both their gazes back to the doorway.\n“Bas!” Olly ran to him, and he caught her, arms tightening around her curves. He hissed at the discomfort as she hugged back, relief coursing over him as he breathed in the crisp apple fragrance of her hair.\nHis cheek against hers, he looked up as Reece came into the room. Sebastian’s eyes widened at Reece’s bruised face and split lip. “Reece, what the hell—”\nWithout warning, he was crushed against a massive chest, Olly caught between them, his arms trapped against Reece’s hard stomach as the man held onto the back of his head and waist and pulled him close. Shuddering breaths skimmed his ear.\nSebastian’s heart beat hard in his chest. “Hey,” he said, surprised and deeply happy at their emotional welcome. “I’m good. Except for the part where you’re crushing me. It kind of hurts.”\nOlly made a sound in her throat and shoved him hard. He stepped back, rubbing at his sore chest, then froze as she wiped at her damp face. “You idiot,” she said fiercely. “What were you thinking?”\n“That someone was pointing a weapon at me, and I didn’t want to get shot?”\nHer laugh was harsh. “I wish I believed that, Sebastian, but I know you. You’ve never put yourself first. This is the space walk and the fire all over again.”\nHe rolled his eyes. “We’re back to arguing over the space walk? What did you want me to do? Leave you to die?”\n“You jump into danger every time without thinking. And you have no idea, no idea, how it feels to watch you risk your life like that.”\n“I wasn’t the one who walked off and left me alone on a Station I didn’t know!”\nOlly’s lashes fluttered, and she looked stricken. He’d hurt her, yet again, without meaning to. He made a rough sound in his throat and ran his hand over his hair.\n“Sebastian,” Reece said, his voice tense, “not here.”\n“And you,” Sebastian snapped. “Look at your face. Why did you attack their people?” He waved his hand in Bishop’s direction. “There was no need for that. I was just a little stunned from the fight—”\n“You were dying,” Bishop interrupted in a mild voice. “Poisoned.”\n“I—what?”\nOlly strode over to Bishop and poked a finger at his chest. “You piece of shit. You had no right to take him and keep him from us. Who do you think you are?”\n“You would have preferred I left him on the sidewalk to die in unimaginable pain?”\n“Why not?” she spat. “That doesn’t usually bother your kind.”\nThe stillness that emanated from Bishop made Sebastian’s hair stand on end. “Olly, don’t. Leave him alone.”\n“You know nothing of me,” Bishop’s voice was steel wrapped in silk.\n“I know your people. You’re heartless, violent pricks, every last one of you. You kill as easily as you lie, and all you care about is money and your sick games.”\nBishop stepped close so his taller vantage forced her to look up at him. His murmur was low, but audible. “Who did we take from you?”\nOlly’s fist flew without warning. Bishop caught her hand and spun her, twisting her arm behind her. She tried to stomp on his foot, but he put an arm around her and lifted her, enduring the strikes of her boots against his shins without a single flinch.\n“Let. Her. Go,” Reece said.\nThe warning in his voice made Sebastian step between the pilot and Bishop. “Stop. We all need to calm down.” He turned to Bishop. “Release her and talk to us. I’ve answered your questions. It’s time to answer mine.”\nOne minute Bishop had Olly in hand, the next Sebastian caught her as she stumbled into him. She rubbed at her arm as Bishop said, “Ask them.”\n“You alright?” Sebastian asked Olly.\nShe nodded, narrowing her eyes at Bishop. “Don’t ever touch me again.”\n“I have no desire to touch you. But I make no promises.” Bishop leaned against the desk, hands across his chest. “I will not allow anyone to lay hands on me.”\n“It was an assassination attempt?” Sebastian interrupted. “On you?”\n“Yes, and yes.”\n“Why?”\n“Any number of reasons.” Bishop shrugged. “Persons of my rank endure several a tempi, at least. Greater Paradise is neutral ground, though, and such attempts are forbidden here.”\n“Pretty sure murder is a crime everywhere.”\nHis stern lips twitched. “If you are caught, absolutely.”\nOlly tossed her hands up. “See!”\n“Do you think we’re involved?” Sebastian asked, knowing this was the real issue. If Bishop thought they had any part in this, he had a feeling they would not make it back to the Station.\nA few seconds of silence passed before Bishop responded. “I had to rule out the possibility. Valencians often carry antidotes for common toxins, but this one, Quasi’s Death, is extremely fast acting. It’s rarely used because of its virulency, even in Valencia, but the Kingston’s flagship has the most complete medical bay in the fleet outside of the Valencia’s flagship and carries the antidote. That’s why I brought you here.”\n“Bullshit,” Reece hissed, stalking forward to stand behind Olly and Sebastian. “You wanted to interrogate him. You wanted information.”\nBishop tilted his head to one side. “That too.”\n“Information?” Sebastian frowned.\n“If you weren’t involved, at the very least you’d seen the assassin,” Olly said, “They needed to know what you knew.”\n“But I would have told you that anyway if you’d just asked. Why separate me from my friends?”\n“How was I to know they were your friends?” Bishop waved a hand at Reece. “I’d been attacked twice, and they’d injured two of my Rooks. Perhaps they were there to make sure of my death. I had no way of knowing their story was true. I had to wait until you were conscious.”\n“In case they meant to harm me.” Sebastian paused, eyebrows raised. “You were . . . protecting me?”\n“A favor returned, and a debt paid, perhaps.”\nOlly shook her head. “Not likely. Bas was never in danger from us.”\n“Surely, saving his life counts for something?”\n“His life would never have needed saving if it wasn’t for you,” she spat.\n“Who are you, exactly?” Sebastian asked.\n“I’ve told you already.”\n“Yes, but who are you, that someone wants you dead?”\nBehind them, the door opened, and a masked person appeared. They bowed, crossing a forearm tattooed with a glimmering, geometric pattern against their naked chest.\nBishop straightened. “It is done?”\n“We anticipate your presence in Interrogation Room 3.”\nWithout another word, Bishop was past them and out the door, and Sebastian saw the glimmer of a tattoo on his back as he went. Reece attempted to follow, but found his way barred by the newcomer.\n“You will await the Bishop’s return here.”\n“You,” Reece said, “can fuck off.”\nIn two swift movements, a hand plucked a cylinder from the belt around a narrow waist. The cylinder extended in both directions into a humming, tapered pole that managed to look both innocuous and dangerous.\n“You will wait.”\nSebastian sucked in a breath. “Reece.”\nReece clenched and unclenched his fists, but he only watched as the guard withdrew from the room, shutting the door in their faces.\nThe Pawn was seated at the table with arms outstretched along its surface. Metal restraints held their forearms and wrists immobile. They had been stripped naked and their mask removed. Their neck and torso were fastened to the chair, which was bolted to the floor.\nBishop took the clear plastic robe Second Rook held out to him and wrapped it around himself. He strolled to the other end of the rectangular table, which had deep grooves around its edges. Sitting, he placed his left ankle on his right knee, gripping it lightly with his fingers.\nThe two Rooks stood on either side of the door as he studied the Pawn. Studied the even rise and fall of their pale brown chest and the smooth, emotionless face with its dark, angry eyes.\nHe gave himself time to bring his focus back to the task before him, instead of the swirl of conflicting emotions he’d left in the cabin, along with the most beautiful man he’d ever seen.\n“No lies,” Bishop said. “Or there will be consequences. Unlike some, I keep my word.”\nThe Pawn lifted their chin but said nothing.\n“Name. Rank.”\n“Lula. Black Knight.”\nBishop sighed and closed his eyes for a second. A mistake. His mind went immediately to a warm smile and the press of his mask against his skin as a hand stroked his cheek. Irritation at his wayward brain prickled his skin with heat. He snapped his eyes open.\n“That,” he said. “Was a test. You failed.”\nHe glanced at the Rook to his right. First Rook stepped forward and pulled a metal knife from his utility belt. Without hesitation, he began to saw at the fingers on the Pawn’s left hand, severing them at the knuckle, one by one. The Kingston preferred old fashioned methods to humane ones. Lasers ended the pain too quickly. Bishop did not think torture was as effective as the Kingston believed, but he had learned to work within the Grandmaster’s rules.\nIt was that, or death.\nWhat his Rooks had found out about Sebastian and his friends made him believe they were not likely to be assassins. But this Pawn might be the first salvo in a war he had no intention of becoming a casualty in.\nWhen the screams had died to heaving groans and choking gasps, and Second Rook had stopped the bleeding enough to continue, Bishop leaned forward.\n“You are no Knight. A Knight would not have screamed. A Knight would not have been caught. So.” He leaned back. “No more lies.”\nThe Pawn was dripping with sweat, grimacing as they tossed their head from side to side. Bishop nodded at Second Rook. She produced a syringe and gave the Pawn a shot of adrenaline to keep them conscious. They jerked against their bonds with a huge intake of breath, eyes wide, muscles rigid. The stumps of their fingers had been seared with a laser. The blood that had pooled beneath the hand ran down the sides of the table, gathering in the grooves and flowing into the closed metal pipes of the floor-bolted legs to the catch-pit beneath the floor.\nThe salt-stink of blood and sweat and piss rose above the sweetness of vine perfume.\n“Name. Rank,” Bishop repeated, his voice soft, his body weary. He wanted this over with, but the Kingston’s Queen and the Grandmaster Kingston himself would expect thoroughness.\nThe Pawn stared at their hand, trembling as they tried to take one breath after another.\nBishop tilted his head, curious. “Did they not warn you of the price of this Game?” he asked. “The price of an attempt on a Grandmaster’s life?”\nThe Pawn’s eyes flashed.\n“Ah, yes,” he said. “I know I was not the target. It would be wise of you to avoid testing the limits of what I know. You are grist for the mill of whatever Sept sent you. But you do not have to let them decide your fate. Answer me honestly, and you may yet live. Fingers can be reattached. Wounds healed perfectly. But I won’t ask again. Name. Rank.”\nThe Pawn clenched their uninjured fist. Then they blurted out, “Pawn. She/her.”\nPawns had no name. You earned a name by attaining the rank of Bishop or higher. A good truth to start with, even if it was not his own. He had been born with a name, after all.\nIt was also a reminder to keep his mind on what had to be done. He could not allow one man’s inexplicable act of compassion to sway him from a lifetime of ambition and his mission to claw his way back into the Grandmaster’s favor.\nHe needed to be trusted again, so he could break that trust and gain his revenge.\n“You have made a wise choice,” he told the Pawn. “Silence is better than lies. But I warn you. No one is ever silent in here.”\nHe tightened the plastic around him, snapped his fingers, and stood as First Rook stepped forward again and handed him the knife from his belt.\n“What are you doing?”\nOlly answered for Reece as he ran his hands along the irregular bumps of the walls on either side of the doorway. “He’s getting us out of here.”\n“Is that really the best thing?” Sebastian frowned. “I don’t think we’re in danger.” He sat on the bunk, elbows on his thighs, hands dangling between his knees, as Olly stopped pacing to stare at him with raised eyebrows.\n“Tell me you realize that man is not to be trusted.”\n“He hasn’t really done anything—”\n“He put his hands on Olly,” Reece said, straightening to run hands along the top of the metal door. “And there’s the way he looks at you.”\n“To be fair, Olly tried to punch him. And he’s masked. Who knows what he’s looking at?”\nReece shot a glare at him over his shoulder. “I know.”\n“And protecting you? From us? Really?” Olly said, hands on her hips.\nSebastian licked dry lips and tried to ignore the sudden heat in the tips of his ears. Olly sighed, “Oh, Bas.”\n“Oh, Bas, what?”\n“You actually do see the best in everyone, don’t you?”\nHe sighed, tilting his head back to look up at her. “He saved my life. We should try to talk it out. I don’t want any trouble.”\n“Only trouble will be if they try to keep us here,” Reece said in a grim voice. He paused, his body tense as he stared at Sebastian. “Olly and I are getting out of here. Are you with us this time, or not?”\nSebastian cursed. “Don’t start. I just didn’t want the guard to hurt you. You know I’m with you. But I think there’s a better way.”\n“We can’t rely on a Valencian’s good graces, Bas,” Olly said.\nThere was a faint click beneath Reece’s searching hand, and a small section of wood pushed inward and lowered, revealing a panel.\n“Control panel?” Olly asked.\n“Better.”\nSeconds after Reece activated the alarm he’d found, three guards came in, weapons at the ready. Sebastian didn’t even get the chance to stand up. Olly and Reece had come up together on some of the roughest corporate stations in the system, and they’d learned to scrap with the best of them. This time, the guards didn’t have the numbers to overpower them. Sebastian stepped over the unconscious bodies into wide, low hallways where red light streaked along veins in the walls and sirens blared overhead.\nThey moved through the corridors swiftly, hiding in corners and empty rooms from running crew on two occasions. “You even have any idea where we’re going?” Sebastian whispered.\nReece nodded, gaze focused on the way ahead. “We’re a few levels down from the docking bay. Once we get to the lifts, we’re good.”\nThey were almost to the lift junction when they heard harsh voices and multiple boots. Sebastian spun in place as Olly and Reece backed up toward him. The only doors nearby were to their right; massive floor to ceiling things, carved out of the same petrified material as the walls and etched all over with designs. It had a clearly marked control panel though, and he figured anything that big would lead to a part of the ship large enough to get lost in. He was bringing his hand down to hit the transparent panel when the doors opened.\nA gust of perfumed air swirled around them, but he was initially blinded by the blaze of light that escaped into the corridor. Stumbling back, he averted his eyes from the glare.\nThere was a loud crash, and heat splashed the back of his palm. He hissed and bent over his arm, shaking it out. A golden spreading puddle of what smelled like the most delectable soup slid along the floor toward his shoes. He stepped out of the way and looked up as the doors closed.\nThe figure in front of him was dressed in a drab brown jumpsuit and apron and wore a plain gray mask that covered their entire face. A huge metal pot had capsized at their feet, spilling food everywhere.\nOlly and Reece were facing the junction in front of them, where several guards had come into view, spears activated. At their helm stalked Bishop. Sebastian cursed under his breath. This was the very situation he’d wanted to avoid.\nReece and Olly came alongside him. He took a breath in the tense momentary silence, intending to reason with Bishop.\n“Olympia?”\nOlly’s head snapped around, and she took in the frozen figure to their right for the first time. “Do I know you?”\nA trembling hand reached up and removed the mask. The face that appeared looked dazed but intensely joyful, and Olly’s breathing stuttered beside him.\n“It’s me, Sticky. Your father.”\nBishop strode to his quarters with rage an iron taste in his mouth and molten heat in his veins. He went to his office without a backward glance—his men knew better than to follow him in—but after he dragged a private comm bracelet from his desk and turned, he found Sticky waiting with a bowed head and nervously twisting fingers.\n“Please, Bishop,” he pleaded.\nBishop’s lip curled in derision. “Please what, Cook?” he asked, just to remind him of his place. To remind him that their customary ease with each other would hold no sway here.\nSebastian and his lovers had lulled him into thinking they could be easily manipulated. He had been careless. Distracted.\nA pretty face and fine words, that was all it had taken. If the King or the Queen found out, they would prevail on the Grandmaster to promote a Knight immediately. Shame ate at him. Shame . . . and a burning emotion that had responded to the desperately apologetic look on Sebastian’s face.\nYou are halfway to being a fool again, he thought angrily. And this isn’t the time. He is not the one.\nOnce, long ago, he’d thought the Valencia might be the one. Might be a true friend. He’d risked everything to help him.\nAnd he had paid the awful price when the Valencia’s plans failed.\nSticky went to his knees and raised his hands in supplication, his head still bowed.\n“They don’t know. They don’t understand.”\nBishop touched the drawer shut, then took a breath and calmed himself. “Our harvests are down. The Greatwood sickens. Ships go off course and strand my Grandmaster galaxies from his route. Septs attempt to take advantage of the chaos and send assassins. My King and Queen are stretched and have no patience for mistakes. What would you have me do, Sticky?”\nSticky’s shoulders rose and fell with his breathing for long moments. Then he said in a low voice, “She’s the daughter I told you about.”\nThe daughter he’d spoken of so many times, the Kingston had ordered Bishop to find her long ago, to use as leverage. He had had not helmed the search as he should, telling himself he had other pressing priorities.\nThe same daughter had attempted to hit him, her anger and pain lashing out at him in ways he related to but could not afford to care about. She would clearly risk anything to protect the man that had no fear of him. The man that had no fear, period.\nIt was disturbing how difficult it was to stop his thoughts from going to Sebastian Carver and his effortless smiles and expressive face.\n“I am aware,” he told Sticky. “That means nothing to me.”\n“But everything to me.” Sticky raised his head and Bishop refused to flinch at his open, pleading expression.\n“They’ve attacked my men twice now.”\n“They don’t trust you,” Sticky replied. “It is natural.”\n“They abused my goodwill,” he snapped, thinking of Sebastian. The touch of his hand on his cheek. Only one other person had ever touched his mask like that. He’d been betrayed then too.\n“They were escaping a confinement they don’t understand.”\n“Do you?” He folded his arms, comm bracelet dangling from his fingers as he leaned back against the desk. “Understand, that is?”\nSticky’s words, when they came, were halting. “They made a mistake. But they were not part of the attempt on you, were they?”\nBishop took a breath. Let it out. “No.”\n“Then I would ask something of you.”\nBishop’s fingers caressed the bracelet in his hand. It was not safe to speak of King Bartica’s warning if he was not face-to-face with his Queen, but he had decided to inform him of the attack. It was proper etiquette to let him know of Bishop’s investigation into whether the Bartica had betrayed the Kingston, if another Sept had led the attempt, or if Bartica was working with another Sept to attack Sept Kingston.\nBut once the King and Queen knew all the details, the Grandmaster would know. And once the Kingston knew, there would be no saving them. No saving Olly, Reece . . . or Sebastian. Their innocence would mean nothing to the Kingston. They had seen too much.\nDespite his anger, he did not want their suffering. He suspected he would not be as numb to it as he was to everything outside of his mission to regain true power.\n“Say what you must,” he said.\nSticky’s eyes went to the bracelet. “Do not hurt them. Let me see her. Talk to her.”\nHe narrowed his eyes on Sticky, thinking.\n“If that is truly what you want, I will have a request of you in return. Are you prepared for that?”\nSticky hesitated. “Yes.”\nAh. Then Sebastian, Olly, and Reece might prove useful after all. The Kingston would be pleased enough to overlook many things, if he played this right.\n“There is only one thing I would be interested to bargain with, Sticky. One thing you can offer me.”\nSticky swallowed, but determination hardened his gaze. “I know.”\n“Then may I tell the Grandmaster we have an agreement?”\n“If you grant my request. There are . . . conditions.”\nThere would have to be, given the price Sticky was willing to pay. But then again, he knew what they were. Had already considered all facets of this plan and found them worth the risk.\nThough after everything that had happened, he could not be sure why. All he knew, as he fingered the cold metal of the bracelet, was that he could feel that hand against his mask. See that trusting, unafraid smile.\nHe must have looked like that once.\n“Tell me,” Bishop said.\n“So, you’re not going to speak to me?” Olly asked.\nReece’s fingers tightened on Sebastian’s bandaged hand for a second, but he didn’t look up as Olly spoke. Sebastian met her gaze as she paced instead.\n“Now you want to talk?”\nShe stopped, biting her lower lip as she considered him where he sat on the bunk. “There wasn’t a good time before.”\n“Really?” he said sarcastically. “Not any of times you told me stories about him? You let me believe he still had a stall in the Basement. You could have told me the truth instead of leading me on. You could have said, ‘Hey, Bas, by the way, the reason I know all this stuff about Sticky and his awesome cooking is because he’s my father.’”\n“There was a good chance he was dead,” she said. “And I didn’t want to get into everything that happened if I didn’t have to.”\n“He seemed real damn alive a few minutes ago.” He took his hand back from Reece and flexed it, too angry to feel much pain. “Is that why you didn’t want to come to this part of the station? In case you ran into him?”\n“I didn’t want to come here because of the memories. This is where my mother died.” She folded her arms. “He abandoned me after she passed.”\nSebastian’s throat tightened as he took in her carefully blank face. “Olly,” he said softly. “Why didn’t you say?”\n“It was too painful to explain. Not everyone has loving families who support them no matter what, Bas. Not everyone is good with every part of themselves.” She frowned and caught her lower lip between her teeth for a moment. “Some of us just want to move on from the shitty bits.”\nSebastian stood and folded her into an embrace. “No part of you is shitty.”\nHer laugh was muffled against his shoulder. “I hurt you. First by not telling you the truth, and then by walking away.” She leaned back to look up at him, and he saw her fear and worry. “You could have died.”\n“I’m fine. And you’re telling me the truth now.” He cupped her cheek. “If there’s more, this is the time.”\nShe sighed. “Nothing that matters. And honestly, when we talk, I don’t want it to be while we’re being held prisoner.”\n“Prisoners don’t get med kits.” Sebastian wriggled his hand.\n“We hurt his guards. How many times is that now?” Olly groaned. “Trust me, we’re in the shit.”\n“He dumped us here again, no increased security,” Reece pointed out. “That was hours ago. Something’s—”\nThe door opened to admit an unarmed guard, hands clasped behind their back. “Your presence has been requested,” the guard said, but they looked only at Olly.\n“I’m not going anywhere alone with you,” Olly retorted, hands braced on her rounded hips. “We stay together.”\nSebastian bit back a pleased smile at her statement, but the guard stood motionless for almost a minute. Then they nodded firmly. “Come.”\nThey followed the guard back to the doors Sticky had emerged from. Bishop stood there with a small tool in one hand. He wore the green half-mask, and his melodious voice was mild when he said, “I sent for Olly.”\n“She stays with us,” Reece said as Sebastian took Olly’s hand.\n“You are my guests. You have my word she will not be harmed.”\n“Fuck your word.”\nBishop tilted his head. “Where we are going, you may not, Horace Reece.”\n“I go wherever she goes.”\n“You don’t understand.” Bishop’s voice was slow and careful. “This is not a threat. It is a warning. I know your history, Horace Reece.”\n“Then you know you can’t stop me.”\n“I know your background. I know why your Kiskadee has no AI interface.”\n“Get to the fucking point,” Reece said.\n“If you try to follow her, you’ll die. Not because of me, but because your lineage wasn’t augmented for space travel the way Olympia’s and Sebastian’s were. You would reject the seedling needed to enter the vineyards on Valencia.” He paused. “It would not be a good death.”\n“Valencia is nowhere near here.”\n“Valencia is all around you. Don’t you see it? Smell it?”\nReece studied him then raised an eyebrow. “You’re serious.”\n“Always.”\n“You have a way to go between Valencia and this ship?”\n“Instantaneously.” Bishop held up the syringe gun. “The vineyards of Valencia and the Arbors are linked to each other. All you need to enter is to become part of them.”\n“She’s not becoming part of some vineyard. And she’s not going to Valencia.”\nBishop’s masked face turned to Olly. “You have questions. Your father has answers. He wants you to meet with him in the vineyards.”\nDespite the tension in the silence that followed, Sebastian had to force himself to swallow his excitement. This was Olly’s choice, but he wanted to see those vineyards. He wanted her to say yes.\nGet a grip. You’ve never heard of this technology. He could be lying to get Olly somewhere to do God knows what to her. But even as he thought it, he knew he didn’t really believe it. And in any case, there was no way Sebastian would let anything happen to her.\n“What if I don’t want to talk to him?” she finally said.\nReece threw her a look. “Olly—”\n“I would escort you all off this ship, and you would never have to see me or your father again, if that is your wish. I have no interest in forcing a family reunion.”\n“What is your interest?” Sebastian asked. “Why are you doing this?”\n“Because Sticky asked it of me,” Bishop replied. “And he has never asked for anything.”\nSebastian pondered that, then turned to Olly. “What do you want to do?”\nOlly was breathing hard as she looked at Reece.\n“Whatever you want, Olly,” Reece said, his voice gruff. “I told you back at the junction. You need to deal with your past, not run from it. But Sebastian knows now. We can go back to the Kiskadee and talk. Forget the rest of this ever happened.”\nOlly blinked rapidly. “Thanks, Reece.”\n“Anytime.”\nShe took a breath and met Sebastian’s gaze. “Will you come with me?”\n“Of course,” Sebastian said without hesitation. “Don’t worry, Reece. I have this.”\nReece narrowed his gaze on Bishop. “I’ll wait right here.”\n“You are free to do so,” Bishop replied.\n“Anything happens to them—”\n“I find threats tiresome, Horace Reece. Let’s just assume you bear me eternal ill will and dispense with the rest.” He turned to Sebastian. “The transition might cause a few moments of upset, and you were recently injured. I cannot guarantee it will be painless.”\n“I’m fine.” Sebastian flexed his hand. “I can do this.”\n“Hold out your arms.”\nThere was slight sting, then lingering heat, and he rubbed at the ache as Olly received her seedling. The guard stepped up and offered them gray masks with red pinhole speakers. Once they donned them, he tapped the small squares on the side of their necks and oxygen filled the masks.\nThe doors opened and through the filtered visors, Sebastian could see flowering, shimmering vines swaying gently from above, hanging low to almost knee-high grass. Bishop handed the tool to the guard and strode into the sparkling vista without a backward glance.\nWarm tendrils brushed Sebastian’s face as they moved. The ground beneath their feet went from flat and predictable, to uneven with the slightest give. His limbs felt heavier for a moment and that made him stumble, his world tilting before arms caught him. The vines were thinner here, and he was fumbling at his mask, hands helping him rip it free before he vomited onto the ground at his feet.\nHis ribs were aching when he straightened. Olly was on one side of him, her right arm around his waist and both their masks dangling from her left hand. “Okay?” she asked, concern wrinkling her brow.\nHe nodded. “Sorry about that.”\n“Understandable,” Bishop said close to his other ear, and he realized there were two arms around his waist. Heat spread through his body as he quickly stepped out from the shared embrace. A row of opaque panels hung from a doorway in front of him. He pushed through it, blinking at the sudden reduction in light.\nA large circular room curved away from him. Gilded walls and doors glowed under huge light sources; they hung from arched ceilings etched with colorful frescoes. The floor beneath his feet was burnished, golden wood, and statuary decorated the many alcoves. Between those alcoves, massive, tinted windows looked out on the brilliance of a swaying vineyard.\nIn the center of the room was a beautifully set table for two, and Sticky. He’d changed out of his jumpsuit into the flowing, sheer pants and thigh-length tunics Bishop wore, only his were black, with silver threading. No mask hid his cropped hair and the crinkles around his eyes.\n“Shit,” Sebastian said weakly. “It’s real. We’re . . . not on the ship anymore.”\nOlly came alongside Sebastian, her gaze taking in everything before settling on Sticky. She set off toward him and Sebastian followed. Bishop strode behind them, a silent commanding presence.\n“What is this?” she said to Sticky, hands on her hips.\n“I thought we could talk over a meal—”\n“It’s a little late for that, Sticky.”\nThe skin under his eye twitched. “You never used to call me that.”\n“Yeah? You used to be around. Things change.”\n“I didn’t bring you here to fight, Olympia—”\nShe slammed her hands down on the table, rattling dishware and tumbling a water glass. “My name is Olly. Olympia Richardson died when Gran did.”\nSticky closed his eyes and took several deep breaths before opening them again. He snapped his fingers and a door opened at the far end of the room. Two bare-chested masked persons in identical green and white pants entered. Sticky waved a hand at the table, and both disappeared. “I wanted to talk, but if what you need is for me to listen, I can do that.”\nOlly leaned back as the attendants returned. They set up a larger table and more chairs with surprising speed and grace before clicking the door shut behind them.\n“I thought you’d want this to be kept private,” Sticky said, glancing at Sebastian.\nOlly studied him, fists clenched at her side. “He and Reece are family.”\nSebastian stepped forward and offered a hand. “Sebastian Carver, but Olly calls me Bas.”\nThe hand that gripped his was dry and rough. “James Richardson. Call me Sticky. Reece is the other one who was with you?”\n“Yes, but he couldn’t make the trip.”\nUnderstanding swept across Sticky’s face. “The seedlings. He’s unaugmented then?”\n“Why did you do it?” Olly said, her voice hoarse.\nOut of the corner of his eye, Sebastian saw Bishop withdraw to an alcove. He was studying the sinuous line of abstract stone with his hands behind his back, one wrist clasped in the fingers of the opposite hand.\n“Olym . . . Olly.” There was a sheen to Sticky’s eyes that hadn’t been there before. “I thought I was doing what was best for you.”\nOlly drew in a breath as if she’d been stabbed. “Best for me? It wasn’t much, seeing you only when Gran could sneak me to the food stall, but it was all I had. Why did you take that from me?”\n“I was trying to save your mother.”\nOlly took two steps back, shaking her head. Astonishment carved harsh grooves in her face. “What the hell are you talking about? After her . . . after the Blowout, you disappeared. Now I find you here, decades later, living it up with some fucking Valencian.” She pointed a shaking finger at him. “Did you know they were right there when that door failed? They watched that cargo bay depressurize. And they wasted precious time waiting for the Station Agents to ask for help. Because it wasn’t their business.”\nSebastian stepped behind her and rubbed her upper arms soothingly, letting her know he was with her without interrupting. She didn’t react, her accusing gaze focused on her father. Sticky looked as upset as she, but there was a tenderness there. And so much regret.\n“Please,” he said. “Sit. Both of you. I’ll explain everything.”\nNone of them noticed when Bishop stepped through the concealed door in the alcove into the passageways that honeycombed Sept Kingston. They were too caught up in the venting of many tempi of anguish and regret.\nHe could not have stood witness to that a moment longer, even if he had not had pressing business to take care of. Business that had made Sticky’s request to return very convenient indeed.\nHe strode through the curving golden passageways, exiting into the Septhold proper and pausing only to confirm from one of the Pawns where his White Knight could be found.\nHe entered the wing that housed the Senior Quarters and went straight to the largest chamber, opening the door without knocking. The White Knight rose from his bed, spear already in hand. He relaxed as he recognized Bishop. Lowering his spear, he bowed, then straightened and opened his mouth.\nBishop drew two knives from hands hidden behind his back and stabbed him with one, making sure to nick the Knight’s left femoral artery. He followed the Knight down to the floor as he dropped, the spear clattering alongside him. He held the other knife to the Knight’s throat while he kept the one in the Knight’s leg steady. Blood welled, soaking through the Knight’s pantaloons in seconds.\n“Who else?” Bishop asked. “Who else helped Sept Marigot? You knew the Grandmaster was to be in Greater Paradise. But you could not have known when I decided to leave. Someone with me on Greater Paradise told you that and you tipped off the Pawn.”\nThe Knight breathed harshly as he stared at Bishop with cold eyes. “I am already dead. Why should I help you?”\n“I have not severed your artery. The doctors can still save you. The more valuable the information, the more likely the Kingston will spare you and demote you to the Lesser Games. You can survive this if you tell me no lies.”\n“Will you promise me my life, Bishop?” the Knight asked in a bitter, strained voice. “You have always kept your word. Give it to me now, and I will give you the answers you seek.”\nBishop studied him for a moment, then sighed and slit his throat. Warm blood stung his skin as he stood, yanking both knives free.\n“I said no lies,” he told the corpse.\nHe was halfway to his rooms when a Pawn saw him and halted, eyes wide. Bishop gestured to the trail behind him.\n“Clean this up. The White Knight is in his room. Arrange for a traitor’s disposal. And send the Black Knight to my quarters in fifteen minutes. Where is the Queen?”\n“In the Audience Hall, Bishop,” the Pawn replied with a fist over their chest.\n“Send a messenger to request a meeting with him once the Audiences are over. And Pawn, you will tell the guards no member of this Septhold is allowed to leave for any reason unless I personally escort them.”\n“Yes, Bishop,” the Pawn said, and kept his head lowered as Bishop walked away, leaving bright red drops of blood on the golden floor.\nThe attendants set little bowls shaped like flower petals in front Sebastian and Olly. Steam drifted upward, redolent of fresh herbs and a hint of lime. Bits of white flesh speckled with green seasonings, and rolled dumplings floated in a golden broth.\n“You must be hungry by now,” Sticky said. “I made this fresh earlier today. But of course, you know that. I dropped an entire pot—”\n“This is mom’s fish broth, isn’t it?” Olly said in a low voice, staring at the delicate transparent bowl.\n“Her favorite,” Sticky’s voice was gentle, and Sebastian’s heart pinched at the melded love and loss in his expression. “The Bishop has a fondness for it as well. I make it often for him.”\n“Why do you call him the Bishop? Isn’t Bishop his name?” Sebastian asked.\n“Bishop is his title,” Sticky replied. “Bishop Kingston. Only the King, Queen, and Grandmaster rank above him in one of the most powerful Septs in Valencia. It’s a great honor. And a terrible burden.” His eyes roamed Olly’s downturned face as if committing her to memory. “But I should start with what you want to know.” He invited them to eat with a wave of his hand and settled back in the gilded chair, his fingers playing with the stem of his water glass.\nSebastian closed his eyes at the first taste of the thin, complex broth, its citrus notes elevated by the spiciness beneath, making all the flavors sharper.\n“I spent my life bouncing from station to station, and ship to ship, searching for ways to get better at cooking. I was obsessed with reproducing the dishes my grandparents spoke of, with finding a way to recapture the food and traditions we’d lost when the seas swallowed the Caribbean.\n“When I met your mother, I was an impatient, arrogant bastard. But she saw something in me. I’d like to think my passion seduced her. But my neglect—” he lifted his intense gaze to meet Olly’s, “—she would not tolerate that. For herself, or for you. I didn’t understand what I had then, you see. I was still chasing this . . . need to be the best. Eventually, I drove her away. But I loved you, and your grandmother knew it. Your mother was not one for second chances, so it was your Gran who brought you to see me.”\nOlly placed her spoon back in her bowl. Sebastian continued to eat, listening.\n“Gran told me after Mummy died. That you were my father. I thought . . . ” She paused for a moment and looked skyward. “Like an idiot, I thought when she died, you’d come for me. When you didn’t, I even went to the Basement, looking for you. I went there again today, just in case you’d come back. And when you weren’t there . . . ”\nShe turned to Sebastian. “I’m sorry, Bas. So sorry. I should have told you.”\n“It’s okay,” he said. “I understand.”\nSticky’s sigh carried the weight of the world. “When the Blowout happened, I was at a meeting with the Grandmaster Kingston. He had tried the food at my stall several times and wanted to make me an offer. It was a chance to cook every day over an open flame, in gravity, where I could explore every technique. But I would have to go where his people went. I would travel with his flagship when necessary. It meant I would be away from Greater Paradise for long periods, but I would be able to cook, truly cook. And the pay would be more than I ever imagined.”\n“You left with him? You didn’t know what had happened to Mummy?” Olly’s voice held an edge of desolate hope. Sticky shook his head. Sebastian dropped his spoon as her face crumpled, rubbing her shoulder as her sadness made his own eyes sting.\n“Please, don’t,” Sticky reached for her hand and held it tighter as she tried to withdraw. “That’s not it. Not at all. I was there when it happened. I knew—” he closed his eyes, “—I was ice cold from the moment the debris from the Blowout hit the ship.\n“When we got to the bridge and I saw the bodies, I begged the Grandmaster not to wait for the Station Agents. He was a hard man, but we made a deal. The whole time the rescue crew worked, I prayed she and your Gran weren’t on duty. But she was the third person we brought in, one of the few still alive.”\nHe looked at her, his eyes red. “The Grandmaster’s physician tried but could not save her. I was with her, at the end. She wasn’t alone, Olly.”\n“But I was!” Olly thumped her chest, her voice broken. “I needed my father, and you never came. Not even to the funeral.”\n“It was the price of your mother’s treatment,” Sticky said, his voice brittle. “I had to leave with the Grandmaster as soon as her treatment was resolved, one way or another. He was not going to return to Greater P for another tempi and he wanted my services for a fete to honor the Grandmaster Valencia.”\n“Oh my God,” Olly’s voice shook with rage. “It took us three cycles to confirm her death and locate her body. You just . . . left her with the hospital like that?”\n“You have every right to hate me. I’ve failed you, time and again.” He paused and then spoke in a hardened voice, “But I would never do that. We spent three cycles trying to save her life. The Grandmaster is extremely strict about his security. He would not let you on board to see her, so I held off on telling either of you because I didn’t want to get your hopes up. When we failed, I reached out to your Gran. I told her everything, including where your mother would be.”\nOlly collapsed against her chair, eyes wide. “She never said anything.”\n“I begged her not to. I wanted to explain myself. It was foolish, I see that now. But I’d been such a failure as a father and a husband, and I’d lost Anita because of it. I . . . couldn’t face either of you right then. I decided I would send the money back to Gran. She’d make sure you had everything you needed, and in a year, I’d be back, rich, settled, and ready to take you with me to a better life.”\nTears streamed down Olly’s face and Sebastian offered her his napkin, his throat thick with the sight of her sorrow.\n“Mom died when I was twelve. I didn’t leave Greater P for another five years. Where were you?”\nSticky sighed, his eyes seeing something over his daughter’s shoulder. “Things didn’t go as I planned. The Kingston was a . . . difficult man. He felt he’d done a great deal before we had an agreement. I needed to keep his trust.\n“He did not allow me leave for several tempi. He would not give me permission to travel with another Sept. He was afraid I might make allegiances outside of Sept Kingston. I had to wait until one of his ships were headed to Greater P. I came back, only to learn your grandmother was dead and you had left.”\n“She had a heart attack when I was fourteen,” Olly said. “Or she probably would have told me all this.”\nSticky drew in a pained breath. “When I found out you were alone all those tempi. That the money I was sending stopped being accessed . . . I searched for you as best I could, but no one knew where you’d gone.”\n“I got flight certification and left the minute I could. Gran’s friends had taken me in, but it was a tight fit. They had three kids of their own, and it was too much of a struggle for us all. It was better than being a Station Ward though. I changed my name to Olly Richards to avoid that. Wards got sent planetside to orphanages, and I didn’t want to leave the only home I’d ever known.”\n“I’m so sorry, Olly,” Sticky said, his voice shaking. “I thought I was making a better life for you. For us. I realize now, I discarded the life we already had. You were the best thing to happen to me. And I abandoned you when you needed me most.”\n“Yes, you did,” she said, looking him straight in the eye. “And nothing will ever change that.”\n“I know.”\nOlly looked at Sebastian and there was a softness in her eyes that made his heart swell. “It wasn’t easy, those years, but I got lucky. Sometimes, you’re born into your family. Other times, you have to choose it.” She turned back to Sticky. “What did you hope for? Honestly? Was it forgiveness? For me to fall into your arms and call you daddy?”\n“No,” Sticky breathed out, almost deflating. “I can’t ask that. I haven’t earned it.”\n“Then what?”\n“I don’t know.” He shrugged, glancing down at the cold soup. “I had this fantasy. I would come back a success and cook you a meal that was unlike anything I could have done before. I would show you how much I loved you, prove you’d always been in my heart. I would make all your favorites. And we would . . . talk. About what we’d missed. Try to find a way back to each other. I wanted you here to see my life and understand what I’d accomplished. Valencia—it is dangerous, but also wonderous. There is so much here that is beautiful and unique.\n“And—I hoped we could visit. I thought if you agreed to get the seedling, once you saw how I lived—what I do—there’d be a chance you’d be willing to come to Valencia again. Maybe even . . . stay. Not now. But someday.”\nOlly leaned her head against Sebastian’s shoulder, and he put his arm around her, nuzzling her temple, trying to make her feel his love and support. Her body relaxed into him a little. “You made Mummy’s favorite today. What else did you make?”\n“I had a suckling pig and root vegetables I’d pit roasted for the main course. And I’d made passion fruit ice cream for dessert.”\n“Passion fruit? I’ve never heard of that.”\n“Your grandmother loved it. They have it on New Kairi, in the greenhouses there. They brought it with them from Terra. That’s been the best part of traveling with the flagship. I get to meet others who left Terra with my ancestors but didn’t lose touch with our culture the way some of us were forced to. There are so many amazing places like that, Olly, you have no idea.”\n“We just got back from Tavaco, actually,” Sebastian said. “It was beautiful out there. We thought we’d make a run to New Kairi after the next shipment.”\nSticky nodded, his eyes bright with some good memory.\n“Have you . . . Do you still make doubles?” Olly asked.\nSticky smiled for the first time, and it changed his face, Sebastian noted. Suddenly, he saw a version of Olly’s cheeky beauty reflected at him. “I can make it, if you want.”\nOlly glanced at Sebastian, and he was relieved to see her slight smile. “All this one could talk about on the way here was doubles and roti.”\n“Let me get you some fresh soup.” Sticky rose to his feet. “And while you have that, I can get started on a batch. I always have channa prepared and dough waiting. It won’t take long. The roti though . . . that can’t be today.”\n“We’ll start slow, then,” Olly said. “Just the doubles for now. If you want.”\nSticky’s chest heaved and his eyes sparkled. “I would like that.”\n“Well then,” Olly said, “four, with everything, plenty pepper.”\nAfter they finished the best meal Sebastian had ever had, Sticky offered to give them a tour of the grounds. Bishop joined them again, wearing fresh clothes and a new mask. He fell in beside them as they donned half masks and entered the greenhouse, which had been grown from the vineyards like the rest of the Sept. Then they moved through huge doors into the evening outside.\nTrees and grassland spread out in iridescent thickets that sometimes obscured the golden sky of the setting sun. There was so much openness, Sebastian was dizzy at first. Needlelike leaves spun and danced in the perfumed wind, and vines trailed the canopy, reaching out as they passed, like lovers’ fingers. Some parts of the forest were darker than others, and there, multicolored fruit lay burst on the ground, their sour rot a faint note under the floral musk. But those areas were few, and Sticky steered them away from them, strolling on a clear path, hands behind his back as he spoke to Olly. Sebastian slowed, allowing them some privacy, happy that Olly was getting this chance to begin healing an old wound.\n“Your Grandmaster isn’t here, is he?” Sebastian said.\nBishop glanced at him, eyes unreadable through the tinted slots. “Why do you think that?”\n“Because based on what Sticky told us, he would not have done this. Any of this.” He pointed. “This is all you.”\nBishop returned his gaze to the path. “The Kingston was called to matters of trade several days ago.”\n“I knew it!” Sebastian grinned. “Would he even let us in here? Why did you?”\n“I have broad discretion when it comes to the Septhold and access. Sticky has been a loyal asset to this Sept, but lately he has become . . . restless. By helping him, I’ve forestalled his attempt to resign, and secured the goodwill of a loyal servant. Now he knows his daughter is alive, he will seek to provide for her.”\n“You’re manipulating him?” Sebastian stared, shocked.\n“I’m guiding his decisions along a mutually beneficial path.”\n“He could still decide to leave with her,” Sebastian pointed out. “I could tell him what you’re doing.”\n“It would not matter. Sticky understands how things work here. And his relationship with his daughter is fragile and new. He is unsure of his reception. She is unsure of his sincerity. Time is needed. Time during which my Grandmaster and I will enjoy many meals in safety. It is worth the adjustment of our protocols and the price of two seedlings to secure this.”\nHe paused, glancing at Sebastian. “However, it would not be . . . advisable for another Valencian to know you have connections in this Sept. Sticky is safe here, but outside of Valencia, away from our rules, the Great Game we play for power can be even more ruthless.”\n“That reminds me, did you find out who your attacker was?”\n“I interrogated her during your first meeting with your friends. It is no longer a matter of consequence.”\nSebastian frowned. “What does that mean?”\n“It has been dealt with.”\n“How? Did you kill her?”\nBishop stopped and turned to him. “What would you have done?”\n“Not kill her. Don’t you have courts here? Shouldn’t she face a judge or something?”\n“She did,” Bishop said simply. “And she was sentenced according to her crime.”\nSebastian raised an eyebrow. “You’re a judge?”\n“Bishops execute strategy on behalf of Kings and Queens, who take their direction from the Grandmaster. It is my remit to uphold the rules—or to find a way to bend them for my Sept.”\n“So, she’s not dead?”\nBishop stepped close, so close his breath puffed against Sebastian’s cheeks, raising the hairs at the back of his neck.\n“Why do you care, Sebastian? She almost killed you and would have killed me.”\n“Because you’re making unilateral decisions about taking someone’s life. That shouldn’t be up to one person.”\n“In my world, it is. To be Septed, to be Grandmaster, these things are the epitome of what it means to be Valencian. We make the decisions of what we need, where to go, what to trade. We earned that right. It is always up to us. My attacker knew that, and she chose to play the Great Game. She lost. She understands the consequences.”\n“Maybe,” Sebastian said, his blood running hot. “But that doesn’t make any of what you do right.”\n“Who decides what’s right, Sebastian? Do you? Do the people of Greater Paradise have any more say on what’s right for that Station than the people of the Lesser Games here?”\n“I didn’t say we were perfect, but at least we don’t kill people without a trial.”\n“We are definitely not perfect,” Bishop agreed, and it struck Sebastian then that he’d not raised his voice or lost his calm demeanor even as Sebastian struggled to hold on to his temper. “But we are efficient. And we do not waste time on trials for those who enter the Great Game knowing full well what they risk in their quest to rise to the top. You may not like our rules, Sebastian Carver, but be assured we have them.”\nSebastian studied the sharp line of Bishop’s jaw, the grim set of his finely etched lips, and certainty settled in his mind. A slow smile spread over his face.\nBishop’s lips tightened. “Why are you smiling?”\n“Because you’re full of it.”\nA dangerous stillness formed between them. “What did you say?”\nSebastian stood between Bishop’s spread feet and lifted his chin. “I’m not saying you don’t believe some of what you said. But if you truly believed all of it, you wouldn’t be sneaking a cook’s family into Valencia under your Grandmaster’s nose because he’s your friend.”\n“You mistake me,” Bishop said. “There is no such thing as a friend in the Great Game of Valencia.”\n“Maybe. But there’s such a thing as a friend for the Bishop of Sept Kingston, or you wouldn’t have risked giving two complete strangers access to your world in exchange for a servant’s goodwill.”\n“It is no risk. You have shown me you would lay down your life for a stranger, and you are Olly’s . . . family. You would not betray her, or her father. You will protect each other. To do otherwise would endanger all your lives.”\n“Yes, but why do any of this at all, if there’s not a good man under all that Great Game hogwash? Why even bother to go through all this trouble to bring me to your ship for treatment when I’m nobody to you? Why not kill us all when we attacked your people instead of taking us here to give two people a chance to find each other again?”\n“Why did you save me?” Bishop snapped.\n“You keep asking that like it’s a bad thing. Why does it bother you so much?”\n“Because I have lived a long time and no one has ever done that for me,” Bishop bit out, and for the first time, Sebastian saw his jaw clench. “No one ever would. Why did you?”\n“Because in my world, if you can help someone, you do it. Space is a big, lonely place. When you find other humans, you cherish them. You have no idea when your reactor might go, or your hull might blow out from an impact, or your equipment might fail and leave you floating until your oxygen runs out. You don’t know when the last time is that you’ll get to talk to someone, laugh with them. Kiss them.”\nHe swallowed, his mouth suddenly dry, and stepped back. “Out there, anything that can take life is the real enemy. Out there, you don’t ask questions when you see a problem. You jump in and help. Because we’re all valuable. We all matter.\n“You, Bishop, you matter. And not because you’re the Bishop. Because you’re a human being. I didn’t know I was saving anyone at the time, but I knew someone was looking to kill, and I couldn’t let them do that to another human being.”\nFor the first time the stern lips parted a little, as though he’d surprised Bishop. Sebastian couldn’t look away from them as he added impulsively, “For what it’s worth, even though this has been the longest, most insane cycle of my life—if it’s even still the same cycle—I’m glad I stepped in front of you. You gave Olly back her father.”\nBishop’s lips curled. “If you believe me to be a hero, or a good man, you could not be more wrong. You don’t know me, Sebastian.”\n“Maybe I don’t. But I’d like to try, sometime.”\nBishop was silent a moment. Then he asked, “Why?” and the hesitancy in his voice made a strange tenderness unfurl in Sebastian’s chest.\n“I don’t know. I don’t even know what you look like. But you helped me. You helped Olly and Sticky. And you have an amazing voice. I like the way you say my name.”\nHe turned to catch up with Olly, heart pounding hard, but satisfied whatever game Bishop was used to playing, however much he was used to winning, he hadn’t won that round.\n“You are sure?” the Kingston asked.\nBishop waited, silent before the virtual form of his Grandmaster and beside the very real one of his Queen.\n“The Bishop has been most thorough,” the Queen replied. “In all, four Pawns and one Rook had been compromised. And the dead Knight, of course.”\nThe Kingston turned to Bishop. “You were able to identify all these traitors due to the information received from interrogating the captured Pawn?”\n“Yes, Grandmaster Kingston,” he said.\nA slow smile split the wide, full lips beneath his half-mask. “And you say torture is not effective.”\n“I believe in give and take, Grandmaster. Pain and death cannot be the only reward.”\n“Oh? And what was the give and take for the Pawn?”\n“I took flesh in return for her life.”\nThe Grandmaster frowned. “You did not judge her as she deserved?”\nHow to explain that when the time came to dispose of the unlucky Pawn, he could not forget the heated words of a man the Grandmaster must never know existed? Could not forget how twice in his life, he had been helped. Shown mercy.\nThat once he learned how new to the Game the Pawn was, his ruthlessness felt like the type of cruelty Sebastian would never forgive him for.\nSebastian’s opinion of him should not matter. He knew that. And yet it did. This realization was burning through him, razing many things in his path. Stripping his detachment from him in ways he had not expected.\n“The Pawn has no family, and now, no home. The moment she returns to Valencia, her implant will kill her. If she tries to remove it, her implant will kill her. She is maimed, alone, and disgraced.”\n“She has her life,” the Queen remarked. He turned to look at Bishop. “The Great Game is seldom so merciful. And I have never known you to be.”\n“It is good that I was. She confirmed what I suspected—that Sept Bartica was not involved in such an obvious move that would immediately bring them under much suspicion. She confessed to all she knew of Sept Marigot’s involvement during the first interrogation. But it was during her recuperation, when she truly believed I would not heal her to kill her, that she divulged the participation of the White Knight.” He glanced at the Queen. “We must never be afraid to grow, change, and adapt if it is for the good of Sept Kingston.”\n“What of Sept Marigot?” the Grandmaster asked, eyes narrowed within the holes of his gold and jade mask.\n“The King and I shall have a response for you in a few days,” the Queen said, his voice mild. “I recommend patience. Let them wonder if they have succeeded. Then, as news of the purge here spreads, let them dread our retaliation.”\n“I approve,” the Kingston said with an indulgent smile. “You and my exceptionally competent daughter have my full trust in this matter.”\nBishop swallowed his bile at the compliment the Grandmaster had paid to the woman who had taken his position. Who had helped deliver Bishop to his enemies, along with Alexandar—the previous Valencia and his only true friend in the Great Game.\n“The Valencia has decided the Consortium’s lost slaver ship will be handled by both our Septs. It is too important an opportunity for us to form a new alliance with a powerful civilization. It cannot be left to one Sept’s influence. And she will need assistance given that the ship’s last reported position yielded no sign of it. As to the other . . . delicate problem you’ve alluded to . . . ” The Kingston sounded grim for a moment at his usage of their code for a problem only a Grandmaster could address. “I shall return to Valencia in two weeks. After that, we shall have much work to do.”\nThe Queen murmured his assent.\n“And you, Bishop.” The Kingston’s voice was sly. “What of Septhold matters? Do I still have a Cook?”\nHe bowed his head. “We have come to an agreement, Grandmaster. He will remain in service for three more tempi.”\nThe Kingston’s chuckle was dry and short. “So you finally managed it. How?”\n“He believes us to be friends, Grandmaster. I convinced him I was looking out for his best interests.”\nThe Queen broke out in hearty laughter. “Was that all it took? These off-worlders. What an odd outlook they have.”\n“Odd indeed,” the Kingston agreed. “I bought his loyal services for some money and a few days treatment for a dead woman. He prevailed upon my mercy, I granted it to him, and he is forever grateful.” He glanced at Bishop. “Much like our reformed Bishop. Isn’t that right?”\nBishop swallowed the ball of shame and rage in his throat and met his Grandmaster’s gaze. This anger, this was familiar. He could not abandon it now. He would hold to it until he regained power and took back all he had lost. And with someone making unsanctioned moves, he sensed his time approaching. “Yes, Kingston. Thank you, Grandmaster Kingston, for your mercy.”\nThe Kingston gave him a smile edged with scorn. “It is good you remember.”\nHe could almost feel the throb of long-ago pain under the smooth skin of his back as he replied with his usual honesty, “I shall never forget.”\n“Best leftovers ever,” Reece sighed after lunch a few cycles later. They were getting ready to launch, everything having been repaired and tested, and their new payload and route confirmed by Dispatch.\n“I’m definitely going to miss Sticky’s cooking,” Sebastian agreed as he stowed equipment. He would not let his mind go to what else he might miss, as there was no point in that. It appeared he’d won nothing but Bishop’s absence. He had not seen him since the Greatwood, and he refused to acknowledge the sharp edge of hurt that raised in him.\nYou made a pass, he wasn’t interested. It happens. Maybe he’d been too subtle, but taking the initiative had always been hard for him. In fact, he’d never been interested in anyone who wasn’t already a friend before. Bishop was new, terrifying territory and in the end, his lack of response made his position clear.\n“Sticky and I exchanged pings,” Olly said casually, as if it wasn’t a bomb being dropped in the middle of the conversation. “We’re going to meet up next time we’re in port together. Wherever that might be.”\nThey both stared at her. Then Reece grunted. “Well, wonders never cease.”\n“That’s good, Olly,” Sebastian said with a grin. “Real good.”\n“It’s not a big deal,” she warned. “I haven’t forgiven him. I just really like buss-up-shot.”\nThey laughed, agreeing without words to leave her the fragile safety of her flippancy.\n“Thank you,” she said to Sebastian in a halting voice. “For being there for me through that. And thank you,” she turned to Reece, “For always understanding what I need. I don’t know what I’d do without you guys.”\nReece made a humming noise and turned away. “You’ll never have to find out.”\nSebastian went outside to make the final checks with the shift supervisor and knock panels for document transfer. The supervisor was walking away, already conversing over his implant with another ship’s crew, when he noticed a tall figure coming straight toward him out of the corner of his eye. He turned at the bottom of the Kiskadee’s access-way, taking in elegant shoulders under a loose shirt, hands tucked into the front pockets of jeans, and finally, the arresting and unfamiliar face.\nHis body recognized Bishop’s scent before his mind caught up to the soft flop of hair over a smooth forehead, and the watchful darkness of his eyes. The lips were as stern as ever, his jaw flexing under golden brown skin.\n“Wow,” Sebastian said, “you . . . clean up good.”\nBishop glanced at the ship. “You’re leaving.”\n“You’re not wearing your mask.”\n“Sometimes I need to go about my business without announcing who and what I am.”\nSebastian cleared his throat and asked, “What business are you about today?”\nBishop’s eyes gave away nothing as they traveled his smudged coveralls and heavy boots. “You were right,” he said. “Sticky is a sort of . . . friend. Because I know what it is to be taken into service with the expectation that you forget those you left behind. I know the cost of the loyalty the Kingston demands, and I understood how difficult it must be for those not of Valencia. I may not agree with all you said. But I have thought on it many times since we spoke.”\n“Oh?” Sebastian folded his arms over his racing heart. “This should be good. What did you think about, exactly, while ghosting me for cycles?”\n“I didn’t ghost you. Your seedlings always tell me where you are. But I had much to do. Sticky said you were leaving today, and I wanted to see you before you left.”\n“You could have seen me when we were visiting your ship, or the last time we went to see Sticky in Valencia,” he pointed out.\nBishop inhaled deeply, then breathed out. “It is not a good time for me. There are things I am bound to do. Problems within our society, with the Greatwood itself, that I am tasked with helping my Grandmaster and our leader, the Valencia, solve.”\nSurprise swept through him. “What kind of problems?”\nBishop glanced at the ship then back at him. “I wish you and your lovers well, Sebastian. Stay safe on your journeys. I do not think we will meet again.”\nHe moved closer, giving Sebastian time to react. Time to refuse. The problem was, Sebastian thought, as he watched him lift his hand, curl strong fingers around his neck, and pull him near, he didn’t want to refuse him. Instead, he met those firm, gentle lips with his own and his breath hitched, his pulse running riot as he tasted silky warmth and languorous exploration.\nWhen Bishop drew back, he fitted one thumb into the slight depression of Sebastian’s dimple, while his other hand curved around to rub his thumb against Sebastian’s mouth. “Kian,” he said in a quiet voice.\n“Kian?” Sebastian whispered, confused.\n“My name,” Bishop said. He released him and stepped away. “And I like the way you say it too, Sebastian.”\nSebastian was still staring after him when it dawned on him none of the questions he’d asked had been answered.\n“You know,” Reece said after they’d launched, “I thought you’d want to stay a little longer.”\n“Stay?” Olly questioned from her copilot chair. “Why would he stay?”\nReece glanced at Sebastian where he sat in the jump seat, trying hard to look unaffected while his lips still tingled. “Should I tell her?”\n“Tell me what?”\nReece turned back to the controls. “Bishop.”\nOlly looked at him with wide eyes.\n“Thanks a lot, Reece,” Sebastian said.\n“Oh my God! He’s such an asshole though, Bas. Really?”\n“Apparently, he doesn’t kiss like one,” Reece said.\n“You were watching!” Sebastian accused.\n“I was testing the cameras.”\n“How could you not tell me?” Olly slapped at Reece’s arm. “You know how I love to watch him get hot and bothered.”\nReece grunted. “Checklist was more important.”\n“You’re such a prick.”\n“That’s why he likes me.” Reece leaned back after switching to autopilot. “That’s probably why he likes him too.”\n“I do not like you because you’re a prick,” Sebastian said, glad no one could see how hot his face felt. “It’s precisely because you’re more than that, under,” he waved a hand, “all that. And so is he.”\n“Sure about that, are you?” Olly said with raised eyebrows.\nHe sighed. “Hell, no. All I’m sure about is the man has too many secrets and is nothing but trouble. His kisses might be worth it though.”\nOlly’s expression softened. “Yours certainly are. But no more getting caught up in assassination plots, okay? They don’t usually end with good food and kissing.”\nHe held his hand over his heart. “I swear, I don’t go looking for trouble. It just finds me.”\n“Maybe you exchanged pings,” Reece said in a mild voice.\n“A joke!” Olly squealed. “Are you okay, Horace Reece? Do you have a fever?”\nReece ignored her and turned to face Sebastian fully. “You could have stayed. Spent a little time with him. If you feel something for him, you can say so. You know that, right? You can change your mind about . . . us.”\nSebastian unclipped himself from the chair, walked over to Reece and bent to give him a lingering kiss. He held his face with both hands as he said, “Yes, I feel something, but I don’t think it’s the same for him. So, no, I haven’t changed my mind,” he said with a smile. “I’m where I want to be. With the people I love.”\n“Same,” Olly said, reaching out to caress his forearm.\nReece grunted as Sebastian stroked his head, closing his eyes in contentment.\nFor a few precious minutes, there was nothing but the three of them breathing in harmony as Greater Paradise faded, a dying of the light in the star-studded dark.\nJust perfect.\nWell. Almost.\n“So,” Sebastian said. “Did you leave any roti for me, or did you two assholes eat it all?”\nR.S.A. Garcia writes speculative fiction, and lives in Trinidad and Tobago with an extended family and too many cats and dogs. Her debut science fiction mystery novel, Lex Talionis, received a starred review from Publishers Weekly, the Silver Medal for Best Scifi/Fantasy/Horror Ebook from the Independent Publishers Awards (2015), and became an Amazon Bestseller.\nShe has published short fiction in magazines such as Clarkesworld Magazine, Escape Pod, and Internazionale Magazine. Her stories have appeared in several anthologies, including the critically acclaimed The Best of World SF: Volume 1, The Best Science Fiction of the Year: Volume 4, The Apex Book of World SF: Volume 5, and Sunspot Jungle: Volume 2. Her work has been translated into Italian, Spanish, and Czech.", "source": "https://clarkesworldmagazine.com/garcia_01_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Bishop's Opening by R.S.A. Garcia"}