{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ryan Britt", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ionYAkyj5PT/D6p+xkBIPK0F8f8=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Sherlock Holmes & the Science Fiction of Deduction  Despite being brilliant, the great Sherlock Holmes is an ignoramus when it comes to the astronomical workings of the planets and stars. In the first Holmes novel, A Study in Scarlet, he accosts Watson on the subject: “What the deuce is it to me? You say that we go round the sun. If we went round the moon it would not make a pennyworth of difference to me or to my work.”1 Holmes likens his mind to an attic, one he can only fill with the rights kinds of “furniture” necessary for his occupation as the world’s first consulting detective. But even if Holmes does get an “F” in astronomy, there’s no denying his influence on the genre of science fiction.  For the uninitiated, Sherlock Holmes, and his biographer Dr. John Watson, inhabited 4 novels and 56 short stories written by Sir Arthur Conan Doyle between from the years 1887 to 1927. During this time, Holmes dies and comes back, faces a variety of criminals, schemes, and ghoulish mysteries as well as making a nuisance of himself to Inspector Lestrade and the rest of Scotland Yard. But perhaps his most relevant contribution to SF is the invention of something Holmes calls “The Science of Deduction.”  Essentially, Holmes believes any mystery can be approached, and a solution deduced, scientifically, by gathering necessary data, and drawing conclusions based on logic and reason. In the Doyle stories, the science of deduction usually always works, and serves as the basic premise for every single Holmes adventure. Like a science fiction writer, Doyle seemed to start with the premise of “what if?” Instead of a detective who arrived at the answers through intuition or moxy, Doyle asserted a different premise with the Holmes stories—what if the detective discovers the answers scientifically? What kind of adventures might he have? Looked at from this semantic angle, the original canon of Sherlock Holmes almost passes for science fiction.  Naturally, the hard science of Sherlock Holmes doesn’t really stack up against the forensics labs of today, and it is also possible that the Holmesian methodology might not pass as real science to actual scientists. According to Zachary Pirtle, program analyst at NASA; “Real science still doesn’t work in the strictly deductive way that Holmes describes, for the best scientific questions, there are no straightforward answers, and a lot of the hard work comes from simply trying to imagine new possibilities.”2 And yet Holmes is constantly affirming his belief in the improbable, indicating his imagination is among his intellectual tools. In “The Adventure of the Bruce-Partington Plans” Holmes—without any evidence—conceives of the fantastic notion of a body being placed on the roof of a moving train.3 In the Granada Television adaptation of the same story, after the hypothesis is proven true Holmes (as portrayed by the late Jeremy Brett) grins broadly and shouts “Imagination Watson! Imagination!”4 So while Sherlock Holmes was a walking computer full of logic and reason, he was also a compassionate, imaginative person.  According to acclaimed filmmaker and author of three Holmes pastiches, Nicholas Meyer, “Because the Holmes stories deal with chemistry and scientific stuff, it’s a hop-skip-and-a-jump over to actual science fiction.”5 Meyer of course, put some memorable Holmes quips into the mouth of another uber-logical yet compassionate man: Star Trek’s Mr. Spock. “The link between Spock and Holmes was obvious to everyone. I just sort of made it official.”5 Spock appropriating Holmes is somewhat fitting insofar as Holmes’ famous phrase “ . . . the game’s afoot . . . ”6 was taken from Shakespeare’s King Henry V. But more importantly, the notion of Spock quoting Holmes makes it doubtful that very popular SF characters like the Vulcan scientist, or The Doctor from Doctor Who, could exist without the brainy heroics of Sherlock Holmes coming first. Doyle himself created Professor Challenger, a character who is much more of a true scientist than Holmes, for the classic science fiction novel, The Lost World. Without the success of Holmes, Doyle may not have been as confident in such a logical, thinking man as protagonist. A priori of Holmes, a generation of brainy heroes may never have been born.  And science fiction surely thrives on its brainy protagonists. Five-time Hugo Award winner Mike Resnick asserts that Sherlock Holmes appeals to fans and writers of science fiction because, “He [Holmes] is cerebral rather than physical. And he has overcome what seems a tendency to be a social maladroit, which latter defines a lot of writers, many of whom chose their profession for that very reason.”7 John Joseph Adams, editor of numerous SF publications, including last year’s The Improbable Adventures of Sherlock Holmes, agrees. “Holmes was one of the first great literary action-adventure heroes whose defining qualities were his intelligence and deductive reasoning rather than bravery or brawn . . . he’s so far ahead of almost every one of his contemporaries that he’s almost a superhero compared to them.”8  In 1995, along with Martin H. Greenberg, Mike Resnick edited an anthology of science fiction themed Holmes stories called Sherlock Holmes in Orbit. (Many of these stories are also re-printed in the recent John Joseph Adams book) With names like David Gerrold, Kristine Kathryn Rusch, Vonda M. McIntyre, Robert J. Sawyer, and Dean Wesley Smith, this collection is brimming with talent. A reoccurring premise in SF Holmes stories seems to be a Sherlock unstuck in time. If taken from their familiar Victorian setting and whisked to the present or the future, would Holmes and Watson be of any use? According to several science fiction Holmes pastiches the answer is that they would do just fine, thank you very much.  In Dean Wesley Smith’s “Two Roads, No Choices”, Holmes and Watson are visited by two time travelers coming from a future in which the Titanic did not sink. Because Holmes and Watson are living in this alternate reality, they have no reason to believe the Titanic was supposed to have sunk, and yet the time travelers are desperate for help in unraveling the puzzle. The men of Baker Street are transported to the deck of the Titanic on the night of its fateful collusion with an iceberg. Notably, Holmes takes the notion of time travel in his stride, and is even able to identify the travelers as being out of place by observing contact lenses in eyes of one of them. He is also able to deduce that the ship should have sunk, and only interference from another time traveler caused the catastrophe to be averted.  In Ralph Robert’s “The Greatest Detective of All Time”, time travel is extremely common for Holmes and Watson, as they are consulted constantly by persons from various eras, dimensions and planets. In this story, the duo is even outfitted with cybernetic implants which allow them to “scan” documents rapidly, and download the information cyberpunk style, directly into their brains.  In “Second Fiddle” by Kristine Kathryn Rusch, Holmes is brought to a contemporary Los Angeles to assist the police department in tracking down a serial killer. The story centers around a disgruntled LA cop assigned to Holmes. From the protagonist’s point of view, Holmes is an outdated, sexist idiot. Knowledge of cigar ash, bicycle tracks, and certain kinds of footprints hardly matter in this modern setting. And yet, because Holmes operates scientifically and logically, the cop, in the end, learns a thing or two about bias, and eventually admits that Holmes has still got it.  Not everyone thinks a time-traveling Sherlock Holmes would stick to solving mysteries. Nicholas Meyer believes because “the Holmes stories deal with the variety of human experience . . . people would probably be coming to him for advice if he were living now.”5 Meyer famously had Sherlock cross paths with Sigmund Freud in his novel The Seven-Per-Cent Solution, so it makes sense he would think of Holmes in a psychoanalytical way. But would a temporally displaced Holmes become a shrink? “Well,” Meyer quips, “I heard Dinosaurs turned into birds, so you never know.”  But science-fictional Holmes adventures aren’t simply limited to traveling through time. Frequently, these tales inhabit other forms of existence all together. In Susan Casper’s “Holmes Ex Machina”, the detective is reconstructed as a holographic computer program and assists in solving a minor mystery relating to missing film canisters. In “Moriarty by Modem” by Jack Nimershein, another complex computer program is created to emulate the thought patterns and theories of Sherlock Holmes. However, in this story, a parallel computer virus called “Moriarty” is also accidentally created and loosed upon cyberspace.  Perhaps the most daring of SF Holmes stories is “A Study in Emerald” by Neil Gaiman. In this chilling tale, Lovecraft meets Conan Doyle as Gaiman imagines and alternate Victorian London ruled by the infamous many-tentacled Cthulhu. Here, there are numerous Cthulhu, and one of them, a prince, has been murdered. As in the plot of A Study in Scarlet, Holmes and Watson have just become flat mates, and though perfect strangers to each other are rapidly thrust into their inaugural adventure. Gaiman toys with the notion of Holmes himself being aware of the existence of alternate realities but believing that destiny would bring him in contact with Watson regardless. “I have a feeling we were meant to be together,” he says, “That we have fought the good fight, side by side, in the past or future, I do not know . . . ”9  On the appeal of Sherlock Holmes to fans of science fiction, and the persistence of SF Holmes pastiches, John Joseph Adams asserts, “I think it’s a natural progression for an SF writer/reader to wonder: If Holmes investigates a crime scene and has all of his deduction techniques at his disposal, but one variable has changed—Holmes can’t eliminate the impossible—what then? And that, I think, is why so many genre writers are drawn to writing Holmes pastiches in which the impossible happens.”  Not all science fictional adventures of Sherlock Holmes need be found in non-Doyle pastiches. The original canon yields a story called “The Adventure of the Creeping Man” which expert Sherlockian David Stuart Davies noted, “ . . . veers towards risible science fiction.”10 In this tale Holmes and Watson are confronted with an almost Jekyll and Hyde scenario. An aging professor, known for his intellectual prowess and short temper, has begun to act strangely. A bloodhound on the premises, once friendly to the man, now attacks the professor regularly. Additionally, this old man has been seen hunched over, creeping like an animal in the house on certain nights. He also suddenly possesses great agility and is able to climb up the side of the house with ease. Eventually, Holmes discovers the professor has been attempting to reverse his aging by drinking a sort of elixir. But the ingredients of the potion are taken largely from langurs, a variety of large monkey, and as a result the old man has unwittingly acquired monkey-like traits and abilities.  At the end of the story Holmes muses on the ramifications of such attempts to unnaturally extend one’s life. “There is a danger there—a very real danger to humanity. Consider Watson, that the material, the sensual, the worldly, would all prolong their worthless lives. The spiritual would not avoid the call to something higher. It would be survival of the least fit. What sort of cesspool might or poor world become?”11 Here, Doyle gives us the same sort of themes which genetic engineering-themed or cybernetic-centric speculative fiction still tackles today.  One purported purpose of fiction seems to be an attempt to understand the human experience through stories. Science Fiction has always been highly equipped to handle this problem by viewing culture and individuals through the lens of technology or fantastical concepts. Explaining life as we know it, or might one day live it, is certainly the task of all good science fiction. Similarly, the stories and enduring character of Sherlock Holmes provide a lens through which the human experience can be explained. Commenting on why Sherlock Holmes speaks to him specifically, Nicholas Meyer notes that, “They [the Doyle stories] constitute a sort of secular bible.” For many, growing up with science fiction, the experience is similar. In an unreasonable world, the greatest science fiction can frequently comfort us, while at the same time forcing us to confront our greatest fears. And the ultimate impact of Sherlock Holmes is the same.  “The message of Sherlock Holmes is simple,” Nicholas Meyer points out, “Life can be understood.”  And as long as writers, of science fiction or otherwise, strive for that, the game will forever and always be afoot.  Footnotes:  9 - Gaiman, Neil “A Study in Emerald” from The Improbable Adventures of Sherlock Holmes pp. 425 Editor: Adams, John Joseph  10 - Conan Doyle, Sir Arthur, The Casebook of Sherlock Holmes - (Collector’s Library). CRW Publishing Limited (2004), p. 298  11 - Conan Doyle, Sir Arthur “The Adventure of the Creeping Man” from The Casebook of Sherlock Holmes, Berkley Medallion Edition (1927), p. 184 Ryan Britt's writing has been published with Nerve, Soon Quarterly, Mr. Beller's Neighborhood, and is forthcoming in Opium Magazine. He has performed stories on stage in New York City with The Moth, The Liar Show, Stripped Stories, and Heeb Magazine. Ryan's plays have enjoyed readings and productions in NYC with The Longest Lunch Theatre Company and Collective Unconscious, with a new play slated for summer 2010 at The Tank. Recently, he wrote weekly short stories for the blog Brooklyn The Borough. He lives in Brooklyn, NY.", "text": "Non-Fiction\nSherlock Holmes & the Science Fiction of Deduction\nDespite being brilliant, the great Sherlock Holmes is an ignoramus when it comes to the astronomical workings of the planets and stars. In the first Holmes novel, A Study in Scarlet, he accosts Watson on the subject: “What the deuce is it to me? You say that we go round the sun. If we went round the moon it would not make a pennyworth of difference to me or to my work.”1 Holmes likens his mind to an attic, one he can only fill with the rights kinds of “furniture” necessary for his occupation as the world’s first consulting detective. But even if Holmes does get an “F” in astronomy, there’s no denying his influence on the genre of science fiction.\nFor the uninitiated, Sherlock Holmes, and his biographer Dr. John Watson, inhabited 4 novels and 56 short stories written by Sir Arthur Conan Doyle between from the years 1887 to 1927. During this time, Holmes dies and comes back, faces a variety of criminals, schemes, and ghoulish mysteries as well as making a nuisance of himself to Inspector Lestrade and the rest of Scotland Yard. But perhaps his most relevant contribution to SF is the invention of something Holmes calls “The Science of Deduction.”\nEssentially, Holmes believes any mystery can be approached, and a solution deduced, scientifically, by gathering necessary data, and drawing conclusions based on logic and reason. In the Doyle stories, the science of deduction usually always works, and serves as the basic premise for every single Holmes adventure. Like a science fiction writer, Doyle seemed to start with the premise of “what if?” Instead of a detective who arrived at the answers through intuition or moxy, Doyle asserted a different premise with the Holmes stories—what if the detective discovers the answers scientifically? What kind of adventures might he have? Looked at from this semantic angle, the original canon of Sherlock Holmes almost passes for science fiction.\nNaturally, the hard science of Sherlock Holmes doesn’t really stack up against the forensics labs of today, and it is also possible that the Holmesian methodology might not pass as real science to actual scientists. According to Zachary Pirtle, program analyst at NASA; “Real science still doesn’t work in the strictly deductive way that Holmes describes, for the best scientific questions, there are no straightforward answers, and a lot of the hard work comes from simply trying to imagine new possibilities.”2 And yet Holmes is constantly affirming his belief in the improbable, indicating his imagination is among his intellectual tools. In “The Adventure of the Bruce-Partington Plans” Holmes—without any evidence—conceives of the fantastic notion of a body being placed on the roof of a moving train.3 In the Granada Television adaptation of the same story, after the hypothesis is proven true Holmes (as portrayed by the late Jeremy Brett) grins broadly and shouts “Imagination Watson! Imagination!”4 So while Sherlock Holmes was a walking computer full of logic and reason, he was also a compassionate, imaginative person.\nAccording to acclaimed filmmaker and author of three Holmes pastiches, Nicholas Meyer, “Because the Holmes stories deal with chemistry and scientific stuff, it’s a hop-skip-and-a-jump over to actual science fiction.”5 Meyer of course, put some memorable Holmes quips into the mouth of another uber-logical yet compassionate man: Star Trek’s Mr. Spock. “The link between Spock and Holmes was obvious to everyone. I just sort of made it official.”5 Spock appropriating Holmes is somewhat fitting insofar as Holmes’ famous phrase “ . . . the game’s afoot . . . ”6 was taken from Shakespeare’s King Henry V. But more importantly, the notion of Spock quoting Holmes makes it doubtful that very popular SF characters like the Vulcan scientist, or The Doctor from Doctor Who, could exist without the brainy heroics of Sherlock Holmes coming first. Doyle himself created Professor Challenger, a character who is much more of a true scientist than Holmes, for the classic science fiction novel, The Lost World. Without the success of Holmes, Doyle may not have been as confident in such a logical, thinking man as protagonist. A priori of Holmes, a generation of brainy heroes may never have been born.\nAnd science fiction surely thrives on its brainy protagonists. Five-time Hugo Award winner Mike Resnick asserts that Sherlock Holmes appeals to fans and writers of science fiction because, “He [Holmes] is cerebral rather than physical. And he has overcome what seems a tendency to be a social maladroit, which latter defines a lot of writers, many of whom chose their profession for that very reason.”7 John Joseph Adams, editor of numerous SF publications, including last year’s The Improbable Adventures of Sherlock Holmes, agrees. “Holmes was one of the first great literary action-adventure heroes whose defining qualities were his intelligence and deductive reasoning rather than bravery or brawn . . . he’s so far ahead of almost every one of his contemporaries that he’s almost a superhero compared to them.”8\nIn 1995, along with Martin H. Greenberg, Mike Resnick edited an anthology of science fiction themed Holmes stories called Sherlock Holmes in Orbit. (Many of these stories are also re-printed in the recent John Joseph Adams book) With names like David Gerrold, Kristine Kathryn Rusch, Vonda M. McIntyre, Robert J. Sawyer, and Dean Wesley Smith, this collection is brimming with talent. A reoccurring premise in SF Holmes stories seems to be a Sherlock unstuck in time. If taken from their familiar Victorian setting and whisked to the present or the future, would Holmes and Watson be of any use? According to several science fiction Holmes pastiches the answer is that they would do just fine, thank you very much.\nIn Dean Wesley Smith’s “Two Roads, No Choices”, Holmes and Watson are visited by two time travelers coming from a future in which the Titanic did not sink. Because Holmes and Watson are living in this alternate reality, they have no reason to believe the Titanic was supposed to have sunk, and yet the time travelers are desperate for help in unraveling the puzzle. The men of Baker Street are transported to the deck of the Titanic on the night of its fateful collusion with an iceberg. Notably, Holmes takes the notion of time travel in his stride, and is even able to identify the travelers as being out of place by observing contact lenses in eyes of one of them. He is also able to deduce that the ship should have sunk, and only interference from another time traveler caused the catastrophe to be averted.\nIn Ralph Robert’s “The Greatest Detective of All Time”, time travel is extremely common for Holmes and Watson, as they are consulted constantly by persons from various eras, dimensions and planets. In this story, the duo is even outfitted with cybernetic implants which allow them to “scan” documents rapidly, and download the information cyberpunk style, directly into their brains.\nIn “Second Fiddle” by Kristine Kathryn Rusch, Holmes is brought to a contemporary Los Angeles to assist the police department in tracking down a serial killer. The story centers around a disgruntled LA cop assigned to Holmes. From the protagonist’s point of view, Holmes is an outdated, sexist idiot. Knowledge of cigar ash, bicycle tracks, and certain kinds of footprints hardly matter in this modern setting. And yet, because Holmes operates scientifically and logically, the cop, in the end, learns a thing or two about bias, and eventually admits that Holmes has still got it.\nNot everyone thinks a time-traveling Sherlock Holmes would stick to solving mysteries. Nicholas Meyer believes because “the Holmes stories deal with the variety of human experience . . . people would probably be coming to him for advice if he were living now.”5 Meyer famously had Sherlock cross paths with Sigmund Freud in his novel The Seven-Per-Cent Solution, so it makes sense he would think of Holmes in a psychoanalytical way. But would a temporally displaced Holmes become a shrink? “Well,” Meyer quips, “I heard Dinosaurs turned into birds, so you never know.”\nBut science-fictional Holmes adventures aren’t simply limited to traveling through time. Frequently, these tales inhabit other forms of existence all together. In Susan Casper’s “Holmes Ex Machina”, the detective is reconstructed as a holographic computer program and assists in solving a minor mystery relating to missing film canisters. In “Moriarty by Modem” by Jack Nimershein, another complex computer program is created to emulate the thought patterns and theories of Sherlock Holmes. However, in this story, a parallel computer virus called “Moriarty” is also accidentally created and loosed upon cyberspace.\nPerhaps the most daring of SF Holmes stories is “A Study in Emerald” by Neil Gaiman. In this chilling tale, Lovecraft meets Conan Doyle as Gaiman imagines and alternate Victorian London ruled by the infamous many-tentacled Cthulhu. Here, there are numerous Cthulhu, and one of them, a prince, has been murdered. As in the plot of A Study in Scarlet, Holmes and Watson have just become flat mates, and though perfect strangers to each other are rapidly thrust into their inaugural adventure. Gaiman toys with the notion of Holmes himself being aware of the existence of alternate realities but believing that destiny would bring him in contact with Watson regardless. “I have a feeling we were meant to be together,” he says, “That we have fought the good fight, side by side, in the past or future, I do not know . . . ”9\nOn the appeal of Sherlock Holmes to fans of science fiction, and the persistence of SF Holmes pastiches, John Joseph Adams asserts, “I think it’s a natural progression for an SF writer/reader to wonder: If Holmes investigates a crime scene and has all of his deduction techniques at his disposal, but one variable has changed—Holmes can’t eliminate the impossible—what then? And that, I think, is why so many genre writers are drawn to writing Holmes pastiches in which the impossible happens.”\nNot all science fictional adventures of Sherlock Holmes need be found in non-Doyle pastiches. The original canon yields a story called “The Adventure of the Creeping Man” which expert Sherlockian David Stuart Davies noted, “ . . . veers towards risible science fiction.”10 In this tale Holmes and Watson are confronted with an almost Jekyll and Hyde scenario. An aging professor, known for his intellectual prowess and short temper, has begun to act strangely. A bloodhound on the premises, once friendly to the man, now attacks the professor regularly. Additionally, this old man has been seen hunched over, creeping like an animal in the house on certain nights. He also suddenly possesses great agility and is able to climb up the side of the house with ease. Eventually, Holmes discovers the professor has been attempting to reverse his aging by drinking a sort of elixir. But the ingredients of the potion are taken largely from langurs, a variety of large monkey, and as a result the old man has unwittingly acquired monkey-like traits and abilities.\nAt the end of the story Holmes muses on the ramifications of such attempts to unnaturally extend one’s life. “There is a danger there—a very real danger to humanity. Consider Watson, that the material, the sensual, the worldly, would all prolong their worthless lives. The spiritual would not avoid the call to something higher. It would be survival of the least fit. What sort of cesspool might or poor world become?”11 Here, Doyle gives us the same sort of themes which genetic engineering-themed or cybernetic-centric speculative fiction still tackles today.\nOne purported purpose of fiction seems to be an attempt to understand the human experience through stories. Science Fiction has always been highly equipped to handle this problem by viewing culture and individuals through the lens of technology or fantastical concepts. Explaining life as we know it, or might one day live it, is certainly the task of all good science fiction. Similarly, the stories and enduring character of Sherlock Holmes provide a lens through which the human experience can be explained. Commenting on why Sherlock Holmes speaks to him specifically, Nicholas Meyer notes that, “They [the Doyle stories] constitute a sort of secular bible.” For many, growing up with science fiction, the experience is similar. In an unreasonable world, the greatest science fiction can frequently comfort us, while at the same time forcing us to confront our greatest fears. And the ultimate impact of Sherlock Holmes is the same.\n“The message of Sherlock Holmes is simple,” Nicholas Meyer points out, “Life can be understood.”\nAnd as long as writers, of science fiction or otherwise, strive for that, the game will forever and always be afoot.\nFootnotes:\n9 - Gaiman, Neil “A Study in Emerald” from The Improbable Adventures of Sherlock Holmes pp. 425 Editor: Adams, John Joseph\n10 - Conan Doyle, Sir Arthur, The Casebook of Sherlock Holmes - (Collector’s Library). CRW Publishing Limited (2004), p. 298\n11 - Conan Doyle, Sir Arthur “The Adventure of the Creeping Man” from The Casebook of Sherlock Holmes, Berkley Medallion Edition (1927), p. 184\nRyan Britt's writing has been published with Nerve, Soon Quarterly, Mr. Beller's Neighborhood, and is forthcoming in Opium Magazine. He has performed stories on stage in New York City with The Moth, The Liar Show, Stripped Stories, and Heeb Magazine. Ryan's plays have enjoyed readings and productions in NYC with The Longest Lunch Theatre Company and Collective Unconscious, with a new play slated for summer 2010 at The Tank. Recently, he wrote weekly short stories for the blog Brooklyn The Borough. He lives in Brooklyn, NY.", "source": "https://clarkesworldmagazine.com/britt_11_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sherlock Holmes & the Science Fiction of Deduction by Ryan Britt"}