{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nin Harris", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "HoM+LVN3XD2BD/4ntXWp1x2EJR8=", "id": null, "license": null, "comments": "", "raw_text": "6050 words, short story  Violets on the Tongue  Grand-Daddy would start thrumming at twenty hours, even if it could be the middle of the night, or of the morning. The vibrations filled the heads of everyone within a twenty-five kilometer radius with harmonics. The world became a giant MRI chamber at twenty hours GMT. They should know. Every single one of them had to go through MRI clearance before they were allowed into the interdimensional tunnel-throughs that had brought them. Here. They did not even know what twenty hours GMT signified on Sesen. Was it really nighttime? How could they tell if the sun was the sun and the moons were moons, when night and day were not dissimilar? The stars came out in the morning. The moons filled the skies with varicolored radiance at night. Those were the most obvious indicators.  Eshe navigated the honeycombed network of caves, her hands tucked deep within her cloudy-gray parka. The swiftly dropping temperature was one way of knowing that it was nighttime. Eshe wished she had not forgotten her mittens, but the call of the mammoth crystal was far too strong, the pull far too compelling. Ignoring was not an option—her limbs seemed to move before her mind did. The other apiarists avoided the almost cylindrical hollow that was Grand-Daddy’s Cavern but the music drew her in every time.  The music filled her with a desire to engage with the throbbing mass of colors, and light. Often it felt like Grand-Daddy was more than just a crystal, as though it was the heart of the entire planet. It thrummed like a breathing organism.  She met Lashav the first time Grand-Daddy had called to her.  The Barlishya’s lightly furred arms were raised to the radiating crystal almost as though she was basking in his glow. Lashav had transformed into a cheetah in her panicked surprise, her fangs bared, her tight-muscled form crouched to attack before she changed her mind, jumping up on her favorite ledge to curl up.  Frightened, Eshe had left the cavern. The next night, Grand-Daddy had called to her again with a thrumming that Eshe could not ignore even if she wanted. Lashav was there in clothed humanoid form.  “I am sorry, I cannot always control the change,” Lashav said.  Her tone was meek but her eyes were bold, and assessing Eshe in a way that made her feel like bees were crawling beneath her skin. She exhaled, and inhaled. It was difficult to remember these days to do something so basic. As air traveled back into her body, Eshe began to feel uncomfortable with Lashav’s regard. She fidgeted in discomfort. “No, no, it is not your fault. I am still new here, and you are new to me,” Eshe said as she involuntarily took a step back, willing herself not to look away from the Barlishya woman.  “You are a hatchling,” Lashav said. It was a statement, not a question.  “No, not quite. I lived a full life on Earth, before . . . ”  “Before what your people call dark matter pulled you apart and then put you together again?”  Lashav was as sharp as a finely whetted knife. Her eyes bore into Eshe with the perception of multitudes. How much of the over-soul was in this Barlishya woman? Eshe shivered a little against the hungry, yet oddly judgmental intensity of Lashav’s gaze.  “Yes, that is what the physicists on the relocation team say. But the rest of us are not as clear on the details,” she said.  “Dark matter pulled you apart and put you together again, the same way it did us. Aided by your bunian who are entities forged from dark matter as well.”  “Huh.” This information was new to Eshe. “They come from dark matter? How is that possible?”  “You find that impossible. And yet,” Lashav said, pausing significantly before she continued, “and yet you traveled through dimensions to reach this world, did you not? A world where this . . . dark matter is stronger in concentration than in the world you have left behind.”  “Did the bunian come from this world then?” Eshe asked.  Lashav shook her head with mild distaste, her silvery mane framing a pert, nut-brown face. “Not from this world, nor from this dimension, or they would not have been able to splinter the over-soul in that way.”  Lashav made it sound like a physical pain. Eshe involuntarily took her hand and then just as impulsively dropped it. The Barlishya’s eyes went very wide.  “I am sorry,” Eshe said. “I only meant to comfort you, I shouldn’t have touched you.”  “Comfort, what is this thing?” Lashav asked. Her brow was furrowed in concentration as she absorbed the new concept with far more difficulty than the ease with which she had been talking about dark matter.  “To soothe you, make you feel better. We achieve this through the touching of skin, and of . . . fur, I suppose. The heat, pressure, and friction is meant to comfort our consciousness.”  “You mean to couple and to mate?” Lashav gave Eshe a speculative look.  “No.” To Eshe’s utter surprise, she found herself blushing. “There is more than one way to touch, and to make another person feel better. It does not always include coupling or mating.”  Lashav considered this. “I suppose this is true. I think our matings are not the same as yours, anyway. We are hatched, when we were not splintered. All is new to us, because so much of what we were is lost.”  “How is that so?” Eshe asked. Humanity had committed some sort of destruction here too, Eshe surmised. She despaired. In escaping the destruction of their own planet, had they wreaked some kind of unforgivable schism here as well?  “When the bunian emissaries entered the over-soul, they dissolved into dark matter. They splintered the soul, and seeded the soul with schematics of what was desired in this world.”  Her knees did not feel able to support her body, and so Eshe sank to the sandy ground of the cavern. “I’m sorry,” Eshe said. “I’m so sorry. We are monsters. We let them do this to you.”  “No,” Lashav sat down beside Eshe and put her hand over Eshe’s.  “You did not do this thing to us. You have no blame. Let me, what is that word you Arrivals use . . . let me comfort you.”  Lashav sat beside Eshe and held her hands.  “Tell me what to do to make it right. To make it hurt less,” Eshe whispered to Lashav, her lashes glimmering with droplets of nearly-shed tears.  “Grand-Daddy will tell you. That is why he called you here,” Lashav said, her eyes fixed on the thrumming crystal. Violet and cerulean blue lights shimmered at the penumbra of the incandescent white heart of the living crystal. They both stared, the one in a trance, the other, in a near-hypnotized wonder while they clasped each other’s hands.  Eshe visited Grand-Daddy every night after that second night, and Lashav would be waiting for her. They learned the language of comfort long before they learned the myriad ways of exploring each other. Through flesh, through skin. Through touch, through taste.  Eshe’s final decade on Earth had felt like sleepwalking.  Dislocation dogged her every waking moment, padding behind her like a faithful pet. It hummed in her veins through hours spent in the lab, through various seminars and briefings as they prepared to leave a world that was about to die. Nothing seemed to contain meaning when one was certain of the annihilation of one’s home. Eshe barely tasted the food she ate, and could barely allow herself to care for the lovers she took on and discarded like last night’s leftovers.  Eshe sometimes remembered her condominium in Serdang that was full of different tapestries and figurines representing Neith, the Egyptian goddess of war and weaving. It had been a teenage fascination that grew into a kind of personal obsession, a digital exploration of a part of Egypt that was not wholly her heritage. Her ancestors had been Egyptian Christian. Her mother Elpis however, walked her own path through faith and science. As did Eshe.  Eshe’s condominium had sprawled on the twenty-first floor, a generous gift from Elpis when her daughter had turned twenty-one. It overlooked a golf course and a lavish country club patronized by entrepreneurs, lower cabinet ministers of the Malaysian government and MLM scamlords moonlighting as venture capitalists. The apartment would have been seen as an indulgence by many—Elpis said she wanted to be sure her children all had the gift of a better life than the one she had led. She did not provide much information about her flight from Egypt.  Neither Eshe nor her siblings felt they had the right to ask.  Whenever Eshe tried to recollect the exact size and depth of her apartment, her memories juxtaposed with documentaries about Neith, and Isis, and Horus, and Sobek she had watched, along with numerous online databases she had trawled. It was as though all of the information she had imbibed had scrambled her memories.  Eshe had never known a world in which she didn’t have to relocate because it was going to be destroyed. It was therefore hard to feel extreme nostalgia for something she always knew she was going to lose. And if she did now sometimes miss the taste of kushari, she wasn’t entirely sure if she was remembering correctly the texture of rice, pasta, and lentils tossed in tomato sauce that was such a mainstay of her childhood. Taste, smell, and touch remained her constant, her anchor for all of her memories. Vision and sound could be deceiving, but there was at least some kind of verisimilitude of the act of consumption, of the way taste and sensation rolled about in one’s mouth.  She had a childhood soaked in the borrowed nostalgia of her parents, and of her grandparents. She inherited the demons and ghosts that nipped at the heels of both Elpis and her Hakka father, John. Her mother’s struggles with visa and permanent resident status in Malaysia, her father’s own inherited anger over racial inequity and May 13th, that day of mass terror that marked forever the moment in which the trajectory of Malaysia’s destiny would depart from its original course. Memory had never been an uncomplicated thing. You’d think a child born from two fragmented diasporas would be used to this. But this was different. This dissonance contained a different flavor entirely.  At night, Eshe would walk to the apiary to continue her scheduled observations of the bees of Sesen, uncompromisingly alien with their alternating stripes of indigo, black, and cobalt blue. The hum of the bees often seemed to resonate at the same frequency as Grand-Daddy’s thrumming. After she had started drinking untreated honey, there were days when she swore it was the same thing.  “Humanity nearly wiped out the bees on Earth at one point,” Shakuntala had once said to her as Eshe followed her on their rounds.  “Yes, but that was before my time,” Eshe watched white-winged cranes fly towards the forest that receded towards the Southern Mountain Range, presumably to roost before moonshine crept over the top of the trees. “My mother wrote extensive notes about it, about how she’d tried to create different protective environments for the bees she cultivated in Cameron Highlands.”  “Elpis was a great apiarist,” Shakuntala’s face wore the soft cast of remembrance, her voice subdued as she said, “I enjoyed working with her a lot. But, you’re here now, and we can utilize some of your mother’s experiments in figuring out the best homes for these bees.”  “We don’t have pesticides on Sesen so that should simplify some aspects of our research,” Eshe commented.  Shakuntala said, “That is right, and the society of astrobiologists have already ensured that most forms of pesticides will be banned. We’ve already seen their ill-effect on the planet we’ve had to abandon.”  “Has the society of agriculture agreed to this?” Eshe was skeptical, but she was still newly come from Earth, and Shakuntala had spent nearly fifteen years on Sesen.  “We’ve seen how deeply we fucked up the home we left,” Shakuntala met Eshe’s eyes.  “You did not see how bad it was towards the end,” Eshe’s eyes blinked rapidly as she remembered the looting, the indiscriminate slaughter, and the full-on religious panic during the final days, before they escaped via the tunnel-throughs. No more liquid, only blinking. Some nights it felt as though all of the liquid had drained out.  “Here, help me with this wall,” Shakuntala beckoned at her, forestalling further reminiscences of a planet that no longer existed. Eshe stepped towards to the other side of the hexagon-shaped fibrous panel that Shakuntala was using to build the walls.  The more senior astrobiologists had wasted no time in constructing artificial hives so they could study the habits of the bees of Sesen when they arrived on Sesen. These hives were lightweight. With some cheekiness they had agreed to construct them in the shape of the Calabi-Yau manifolds as a homage to the work of the string theorists who had helped with the development of the tunnel-throughs.  “Are the Calabi-Yau shapes effective, or are they just something we’ve been using because it amuses us?” Eshe asked.  Shakuntala grunted as she hammered joints together. “Both, really. The Sesen bees seem to like these interlinked hives, and the honey they produce tastes better than the more generic hives.”  “I’d like to experiment with that, if you don’t mind,” Eshe said as she reached for a hammer of her own from the toolbox set on a stool beside Shakuntala.  Shakuntala took some time fixing the joints of one of the walls before she asked, “What are you planning to do?”  “Experiment with flavor. The honeys we had on Earth were so rich, so heady . . . ”  “As are the honey produced by these bees,” Shakuntala interrupted.  “Yes, yes. But there’s not enough variety, depth, texture,” Eshe waved her hands in the air, including the one that clutched at the hammer.  Shakuntala gently touched her hands, stilling her near-dangerous movements. “I think what you mean to say is that the honey here does not taste like home.”  “Nothing tastes, feels, or looks like home,” Eshe said.  “That’s the point, Eshe. We can never go back. That home is gone. Now. We can sit here grieving. Or we can finish building this wall. And then the next one. Until we’ve got ourselves the biggest complex of hives in Calabi-Yau shapes in this apiary.”  Eshe nodded, her eyes still blinking. She rubbed them with the back of her hand, the itch was growing to be troublesome. She reminded herself to ask the medical unit for some eye drops.  “I cried for ten months after my arrival. We were the pioneer batch, it was terrifying. We had no basis for comparison. None. And we knew what we had left behind would never be waiting for our return,” Shakuntala gently squeezed Eshe’s shoulders.  It was dusk when they finished constructing the hive that would be joined to the others.  “Come on, I’ll walk you to the mess,” Shakuntala said. They padlocked the door that opened into the hive. Tomorrow they would release a batch of bees into it.  Eshe zipped up her parka as she shivered in the cold Sesen wind. Above them, birds that were both similar and yet fundamentally dissimilar from the birds she had known on Earth flew, released like the breath that fluttered in her chest when she exhaled. Grief was the periodic reminder that you were holding your breath in for too long, a breath that needed to be released so you could live, even if you did not understand why living was necessary, why any of this was necessary, Eshe mused.  “There were no birds like these when we first arrived,” Shakuntala said as she pulled on her mittens. Eshe pulled on her own as she watched.  “How did they manage to bioengineer so quickly, even with what they did to the over-soul?” Eshe asked. “I mean, there’s only so much dark matter can do on its own, right? The building blocks of creation, how far can that process go, how does it get accelerated? It doesn’t make much sense to me.”  “That’s a mystery to me as well,” Shakuntala said, “although the manner of multiplication and mutation of genes may be said to be almost . . . magical. Almost Vedic, as a matter of fact. But apart from that, what do we know? Our machines made on Earth have all but stopped functioning, and we’ve been learning which of our technologies can be used, and which need to be changed.”  They entered the long, dimly-lit mess hall where food was served buffet-style much in the same way they’d been served in university cafeterias back in Malaysia. Eshe closed her eyes as she always did to take in the aromas, feeling the pulling sensation of memories she did not know she could fully claim as her own.  Shakuntala turned to Eshe. “I’m going to let you have materials to build different kinds of hives. See what you can do with your experimentations with honey.”  “Thank you, I really appreciate it,” Eshe said.  Shakuntala dished aloo gobi onto her aluminum plate, saying, “We all need something to divert ourselves from what’s been done to us, and to this world. We’re—well, most of us at least—trying in our own way to atone.”  “How did you know?”  “That you seek atonement for what the Bunian Empire did to the planet? Perhaps I know because I feel much the same way, Eshe.”  Ah. Eshe met Shakuntala’s eyes in acknowledgement. There was nothing she could say that felt adequate. A smile would be disrespectful. “Thank you, Shakuntala.”  “This is another way in which I choose to atone,” Shakuntala said.  Eshe took a scoop of dhall, and another scoop of kushari onto her own plate, adding a small container of salad, and two pieces of eesh baladi bread. There were Egyptian cooks in the mess, some of whom had actually worked in Malaysia. It was a comfort, but there was always the sense that what they were eating was as real as they were.  Which was to say, they were a negligible reality.  Gyasi had said more than once that simulacrums experienced phenomena in a wholly different way. Eshe would reply very sensibly that they were experiencing phenomena differently because everything about Sesen was different and yet painfully similar to Earth. The over-soul had shaped itself into something livable for its new inhabitants, creating a symbiotic relationship between human and planet.  The truth was that she was haunted. She knew she was not the same person who had grown up in Serdang in Malaysia to agnostic parents. The method through which they had Arrived on Sesen had ensured that they were not the same.  “We’re a different composition altogether,” Gyasi would say, his eyes red-rimmed and wild, “different compounds of consciousness and matter.”  “Prove it,” Eshe would counter obstinately. Memory was to Eshe the bedrock of her being. If memory existed, so did Eshe. However, for Gyasi, their memories were as false as their senses.  “Perhaps you’re not Eshe and I’m not Gyasi, did you ever think of that?” Gyasi said to her one afternoon in the cavern that served as their laboratory on Sesen. “Perhaps we have been reconstituted from more than one person in the same space, and these memories we have of Earth are composite memories.”  “We’re astrobiologists and apiarists, not neuroscientists nor philosophers, Gyasi,” Eshe said.  “Biology is the science of organic things. We apprehend organic things through our senses. It remains a mystery if the senses we have now correspond to the senses we had back on Earth. You’ve mentioned the aftertaste of violets more than once in relation to the honey provided by the hives, Eshe. But how do we even know what violets taste like?”  Gyasi looked genuinely distressed by this thought, even as he uttered it. Eshe could think of nothing to say to comfort him, so she placed a hand on his wrist and gave it a comforting squeeze. The younger apiarist fell silent, and then the friction of skin upon skin evoked other memories that Gyasi would swear were not real.  At night, Gyasi would write tortured poetry that would win him the regard of the younger apiarists. He flung himself into a series of affairs, both men and women. For a very long time, he dated Anthony Lim, one of the Administrators. That had been an uneasy partnership that dissolved after Anthony grew tired of equal servings of pragmatic philosophy and untrammeled ontological angst. Eshe had comforted Gyasi when the breakup occurred, as he did her, when she broke up with three women within three weeks, in spectacularly tempestuous displays of dissatisfaction.  She started drinking the untreated honey.  The honey slowly changed the way Eshe viewed the world. It transformed her perception of the color of the multihued sky. She no longer saw lines and various material forms as solid. Everything was changing, and when she looked at things she saw gradations of color, and the shifting of lines and curves.  Her irises enlarged preternaturally. That change brought a difference in the perception of color. Her skin changed and had a deepened sensitivity to every tactile impression of the new world. Nothing felt the same, not fur, not skin, not the taste of violets on the tongue. If qualia was externalized perception, then the physiological changes that came with drinking untreated honey had changed not just her biology but her ontology. Everything that was in flux before became solid, and so immediate that it frightened her. It was as though there was no filter between her private thoughts and externalized experience. Perhaps, she had lost the intrinsic nature of the woman she had been before. Grief had fluttered away with the other birds she released when she exhaled.  “I know what you’re going to ask me, Gyasi. You ask me the same question with every flavor we put out. How do we know if rain forest honey really tastes like this?” Eshe mimicked Gyasi’s voice right down to the morose lowered tone on the last two syllables.  Gyasi smoothed his hair back before pulling the mass of ringlets upwards into a messy topknot that he secured with a pencil, his bead bracelets and silver bangles jangling against lightly furred upper arms of dark brown.  “It is a legitimate question, Eshe. We’re walking, living, and breathing Putnam’s thought experiments. You know that the way we are perceiving things is different. Everything feels and tastes and looks and sounds different. Fuck.” He cursed as he made a mistake in the ledger. Gyasi struck out the line and started again on the next line. He said, “Fuck it, Eshe. Even you look different. You keep drinking the untreated honey, and you’re starting to look as freaky as that alien lover of yours who looks like a furry cosplayer’s erotic dream come to life. Your eyes are starting to look like insect eyes. Beautiful, but also scary. You’re no longer Eshe. You’re a simulacrum on a twin world. We’re living and breathing Putnam’s hypothesis.”  “Not quite, Gyasi, or we would have twins back on Earth. Earth is no more, and Sesen was modified by the over-soul to accommodate us. As best it could. Also, stop checking out my girlfriend, you lecherous bastard.”  Gyasi ignored this, saying, “We’re ghosts then, badly composited twins of the selves we left behind. And we still don’t know why the over-soul was so accommodating. We’re Arrivals. We want to believe we’re migrants, but look at us changing things. We’re colonizers, Eshe. Why would the over-soul want to change things for us? We’re messing with the biorhythm of the bees using those crystals. It feels unethical.”  Eshe poured the honey into the last jar. She capped and then sealed the jar, placing it on the shelf with the rest of type XXVII. They would keep five specimens of the honey for future reproduction, but the rest would be distributed amongst the human colonies on the main continent, with some kept to be artificially replicated for the outlying colonies. Even here, the elite got the best of everything. But they had already known they were not leaving a planet about to be destroyed to go to a better world, not when the Administrators were handpicked from dominant oligarchies.  They had been working together for so many years before they had arrived on Sesen that they became each other’s yardsticks for how much they had changed. From the outside, it felt as though Gyasi had not changed at all, but for the perpetual hollow expression in his eyes and the downward turn of his mouth. Even towards the end of their days on Earth, Gyasi had been jocular. Here, his jokes felt as staged as his bravado.  His eyes were as haunted as the eyes of her Barlishya lover.  “Gyasi. Can’t we just enjoy the fact that we’ve produced this gorgeous honey without descending into ontological angst? Just once? The crystals thrum regardless of what we do, and the world is in flux. Everything is changing, everything is malleable. What we’re doing is just helping the planetary over-soul. This is a new world. We are new too. Can’t you just relax for one evening?”  Gyasi unbuttoned his lab coat and placed it on one of the swivel chairs.  “For you, I can try, Eshe. But as for enjoying myself, I fully intend on doing so,” He planted a kiss on her forehead and then headed for the door.  “Where are you going?”  “I have a date,” His grin was a desperate attempt at nonchalance, not at all aided by the unrelenting haunted aspect of his eyes, “after all, enjoying ourselves is important, isn’t it?”  Eshe decided to ignore the bait.  “You’re standing too close again. Do you want Grand-Daddy to consume you?”  Lashav asked. The Barlishya had been resting her head on her knees, bearing the familiar signs of post-shape-shifting fatigue.  “What harm could it do? I’ve been here so many times in the past month.”  “You’re neither Arlishya, nor Barlishya. Grand-Daddy still has problems understanding your kind. It still does not understand me and my kin even though we’re all of the over-soul. Grand-Daddy cannot comprehend a world in which everything is splintered and not connected to the over-soul.”  “While I cannot comprehend a world in which everything is merely one thing,” Eshe’s smile was flinty.  “Perhaps one day you will,” Lashav said as she gracefully slid down from her ledge, her long legs finding easy purchase on the cavern floor.  The lovers learned the configurations of their own skin by discovering the pigments and crevices of each other. Eshe knew Lashav when she was a woman, and sometimes knew her when she molded and shifted into humanoid representations of other beasts.  Sometimes, these shape-shiftings would occur when she told Lashav about the Gods and Goddesses of Upper and Lower Egypt. When she talked about Anubis, or of Sobek, Lashav would transform into a jackal or a crocodile in wonder, as though wanting to be the stories she was enjoying. When Eshe talked about Neith who was both the warrior and the weaver, Lashav would want to know more about weaving. It did not take long before Eshe had to construct the first weaving-shuttle and loom on Sesen, just so Lashav could understand how weaving worked.  The knowing could not always happen, not when quills started growing from Lashav’s back. On many nights, she would be awakened by the soft snuffling of a fully manifested cat, or a wolf or a fox or a raccoon, leaping onto her bunk to sleep at her feet. By morning, she would be spooned within the long, golden-brown limbs and torso of a Barlishya with large eyes of liquid black and beautifully spiraled ears.  Eshe had explored the contours of those ears with a curious tongue, trying to identify the flavor of an alien skin. That alien skin felt like it had the consistency of honey made liquid. When she kissed Lashav and imbibed her nectar, she experienced once again the aftertaste of violets. Violets on the tongue in everything that she tasted.  She often wondered about the over-soul, and if she was making love with the entire planet when their limbs were entangled. It came and went when she was with Lashav, a wondering that had no basis in her daily experiences but which teased the back of her mind.  Lashav came closer to her, pulling her by the hand as she voiced this thought.  “You Arrivals have such strange ideas about what our world should be. About what you should be,” Lashav said as she hooked her arm around Eshe’s waist, her palm sliding up and down the small of the apiarist’s back.  Eshe shivered as she said, “It is how we make the unfamiliar familiar. We need that. We don’t even know who we are anymore. We need to know.”  “I can understand that. I don’t know this world anymore, I don’t know if I ever did,” Lashav said.  The desperation in her voice alerted Eshe to what was about to happen. Eshe’s pulse quickened as Lashav drew her down to the sandy floor. It was too close to the thrumming. She shivered as Lashav nuzzled first into her collarbone and then moving on to the curve of her shoulder, swiftly bared by inquisitive fingers.  “Here, Lashav? Right next to Grand-Daddy? I thought you said not to go too close.”  “We’re not as close as you were before. This is reasonably safe. Besides, he won’t care, and none of your kind visit this cave. They’re too afraid. Of me. Of us. Of this world. You’re the only one. The only one. Honey.”  Honey. The word that was an endearment on the planet that she had left. The word that was her lived reality in Serdang. The word that she had taught her lover.  That moment remained in their memories, even when the promise of “the only one” was proved to have the veracity of a moment of intense corporeal communion. The truth became a lie the night Gyasi heard Grand-Daddy’s thrumming, and his feet brought him to the cavern.  They had enjoyed nearly half an Earthly century together, but Grand-Daddy’s thrumming had grown hungrier recently. Insistent as the imperative towards aging, even if aging came slow, very slowly for the human Arrivals who found their physiology altered by their journey. This thrumming felt like the music of the over-soul, the song of constellations, and of galaxies exploding. The sound tasted like the dark matter that had helped the physicists find a way to tunnel through to this world. The thrumming was like the wings of a million hummingbirds. It had the aftertaste of the purest, most distilled honey that could be produced by the hives of Sesen bees, magnified by about a thousand. It was as though the thrumming was melting her limbs from the inside. She had no idea that sound could have a taste, a taste that was so familiar, like the first time her mother had spread honey on flatbread for her.  A shifting in Lashav’s position woke Eshe. Lashav was curled into herself in a defensive gesture that made Eshe thoughtful. Gyasi had been spooning Eshe earlier, but he was now spread-eagle on the woven blankets they had brought with them, along with candles that had been lit as they meditated together in the cavern as Grand-Daddy dominated their conscious thought.  What if we had been reconstituted? Gyasi had asked her, all of those years ago, when they were both young, and terrified without being aware of how frightened they were. Even Eshe, despite what the untreated honey had done to her.  What if we had been remade, and we are not what we once were?  What if. What if moving through dark matter meant that they were no longer the people they were on Earth? What if they were all simulacrums?  Or ghosts?  Eshe turned back suddenly. She moved towards Lashav who was whimpering in her sleep. She bent down from the waist to give her lover a kiss on the shoulder. She brushed the palm of her hand tenderly over Gyasi’s smooth bald pate, watching him as he slept, his features made cherubic by age. It was an unconsciously maternal gesture.  Was she doing this?  She thought she had escaped the ontological undoing, the unmaking caused by the trauma of Arrival. But this felt altogether different. This was a yearning. A yearning that vibrated through her bones, filling her as she imbibed of the alien nectar, and entangled herself with limbs nightly that were more of that thick, sweet liquid made flesh.  She was drinking the over-soul.  Correction. They were all drinking the over-soul.  Eshe moved back towards Grand-Daddy. She braced her palms against the smooth, crystalline quartz surface. It was hot. It felt like Grand-Daddy was melting her brains, her bones, and her consciousness.  “What are you doing, Eshe?”  Gyasi’s sleep-blurred voice startled her.  “I cannot resist Grand-Daddy’s song anymore, Gyasi.”  “I know, none of us can. We’ve stopped each other from doing this over the years. But it’s going to happen now, isn’t it? That’s why we’re here, isn’t it?”  “We? I wasn’t going to involve either of you.”  “You can’t go without us, Eshe,” Lashav said, getting up, “we all needed to be ready at the same time for this.”  “I think we’ve always known what Grand-Daddy’s song was about, and why it sounded so strongly in our heads in particular. We knew why it wanted us. We agreed to come here tonight because we knew. We knew you were going to do it.” Gyasi said, his voice soft and gentle.  Eshe looked at her partners. She knew she could not deny them what she wanted for herself. She nodded, and opened her arms. Lashav came first, the raccoon ears that always protruded from her hair in times of fear quivering, her raccoon tail elongating to twine around her lovers. Eshe could barely register the hands pulling at her waist, and the arms and tail embracing her. Her eyes were fixed on the incandescence at the heart of Grand-Daddy, her tongue consumed by the taste of violets. They were overcome by a crystalline ecstasy, a fierce joy they never knew they had been striving for with each melting union of flesh and fluid.  Eshe/Lashav/Gyasi melted into the embrace of the over-soul.  They woke up into a consciousness that embraced galaxies, and cradled a planet of living crystals. They fed it fractured memories of world myths. Memories that Gyasi had deemed false. He was now resigned to the verisimilitude of what they had brought across.  Their bodies shifted, splitting. Gyasi felt his maw elongating and changing as the over-soul fed on the stories of its lovers shaped him into the Crocodile.  Eshe was transmuted into The Woman Who Weaves, master of The Grand Complect that was to guide and shape the civilizations of Sesen in the centuries to come, effectively disrupting the planned trajectory of human civilization on Sesen that the Administrators had so carefully laid out.  Grand-Daddy thrummed as it made a mythology for the still-new world out of the fragmented memories of the planet it had consumed. It was a mythology that would wipe out the oligarchies of the old world, and the cultural memories of those who had Arrived.  The over-soul felt she had every cause to feel pleased with herself.  Future statues and temple friezes depicting the over-soul as the Cat or as the Racoon-Daughter of the Seven Sentient Moons would wear the same smug smile she wore when she joined with her spouses in the embrace back into the core of her splintered being.  Perhaps Eshe and Gyasi had been transformed before they had ever entered Sesen. Perhaps they were never the humans they had been on Earth. But there was one thing Lashav, or the Cat knew, because it was the one thing she had wanted so badly she remade the planet’s core consciousness for them. She remade herself for this new reality.  Here at least, they would never die. Nin Harris is an author, poet, critical theorist and Gothic scholar who exists in a perpetual state of unheimlich. Nin writes Gothic fiction, baroque planetary romances and space operas, mythic fantasies and various other forms of hyphenated weird fiction. Nin's publishing credits include: Clarkesworld, Strange Horizons, The Dark, Beneath Ceaseless Skies, etc. Nin was a 2016 Rhysling Poetry Award nominee.", "text": "6050 words, short story\nViolets on the Tongue\nGrand-Daddy would start thrumming at twenty hours, even if it could be the middle of the night, or of the morning. The vibrations filled the heads of everyone within a twenty-five kilometer radius with harmonics. The world became a giant MRI chamber at twenty hours GMT. They should know. Every single one of them had to go through MRI clearance before they were allowed into the interdimensional tunnel-throughs that had brought them. Here. They did not even know what twenty hours GMT signified on Sesen. Was it really nighttime? How could they tell if the sun was the sun and the moons were moons, when night and day were not dissimilar? The stars came out in the morning. The moons filled the skies with varicolored radiance at night. Those were the most obvious indicators.\nEshe navigated the honeycombed network of caves, her hands tucked deep within her cloudy-gray parka. The swiftly dropping temperature was one way of knowing that it was nighttime. Eshe wished she had not forgotten her mittens, but the call of the mammoth crystal was far too strong, the pull far too compelling. Ignoring was not an option—her limbs seemed to move before her mind did. The other apiarists avoided the almost cylindrical hollow that was Grand-Daddy’s Cavern but the music drew her in every time.\nThe music filled her with a desire to engage with the throbbing mass of colors, and light. Often it felt like Grand-Daddy was more than just a crystal, as though it was the heart of the entire planet. It thrummed like a breathing organism.\nShe met Lashav the first time Grand-Daddy had called to her.\nThe Barlishya’s lightly furred arms were raised to the radiating crystal almost as though she was basking in his glow. Lashav had transformed into a cheetah in her panicked surprise, her fangs bared, her tight-muscled form crouched to attack before she changed her mind, jumping up on her favorite ledge to curl up.\nFrightened, Eshe had left the cavern. The next night, Grand-Daddy had called to her again with a thrumming that Eshe could not ignore even if she wanted. Lashav was there in clothed humanoid form.\n“I am sorry, I cannot always control the change,” Lashav said.\nHer tone was meek but her eyes were bold, and assessing Eshe in a way that made her feel like bees were crawling beneath her skin. She exhaled, and inhaled. It was difficult to remember these days to do something so basic. As air traveled back into her body, Eshe began to feel uncomfortable with Lashav’s regard. She fidgeted in discomfort. “No, no, it is not your fault. I am still new here, and you are new to me,” Eshe said as she involuntarily took a step back, willing herself not to look away from the Barlishya woman.\n“You are a hatchling,” Lashav said. It was a statement, not a question.\n“No, not quite. I lived a full life on Earth, before . . . ”\n“Before what your people call dark matter pulled you apart and then put you together again?”\nLashav was as sharp as a finely whetted knife. Her eyes bore into Eshe with the perception of multitudes. How much of the over-soul was in this Barlishya woman? Eshe shivered a little against the hungry, yet oddly judgmental intensity of Lashav’s gaze.\n“Yes, that is what the physicists on the relocation team say. But the rest of us are not as clear on the details,” she said.\n“Dark matter pulled you apart and put you together again, the same way it did us. Aided by your bunian who are entities forged from dark matter as well.”\n“Huh.” This information was new to Eshe. “They come from dark matter? How is that possible?”\n“You find that impossible. And yet,” Lashav said, pausing significantly before she continued, “and yet you traveled through dimensions to reach this world, did you not? A world where this . . . dark matter is stronger in concentration than in the world you have left behind.”\n“Did the bunian come from this world then?” Eshe asked.\nLashav shook her head with mild distaste, her silvery mane framing a pert, nut-brown face. “Not from this world, nor from this dimension, or they would not have been able to splinter the over-soul in that way.”\nLashav made it sound like a physical pain. Eshe involuntarily took her hand and then just as impulsively dropped it. The Barlishya’s eyes went very wide.\n“I am sorry,” Eshe said. “I only meant to comfort you, I shouldn’t have touched you.”\n“Comfort, what is this thing?” Lashav asked. Her brow was furrowed in concentration as she absorbed the new concept with far more difficulty than the ease with which she had been talking about dark matter.\n“To soothe you, make you feel better. We achieve this through the touching of skin, and of . . . fur, I suppose. The heat, pressure, and friction is meant to comfort our consciousness.”\n“You mean to couple and to mate?” Lashav gave Eshe a speculative look.\n“No.” To Eshe’s utter surprise, she found herself blushing. “There is more than one way to touch, and to make another person feel better. It does not always include coupling or mating.”\nLashav considered this. “I suppose this is true. I think our matings are not the same as yours, anyway. We are hatched, when we were not splintered. All is new to us, because so much of what we were is lost.”\n“How is that so?” Eshe asked. Humanity had committed some sort of destruction here too, Eshe surmised. She despaired. In escaping the destruction of their own planet, had they wreaked some kind of unforgivable schism here as well?\n“When the bunian emissaries entered the over-soul, they dissolved into dark matter. They splintered the soul, and seeded the soul with schematics of what was desired in this world.”\nHer knees did not feel able to support her body, and so Eshe sank to the sandy ground of the cavern. “I’m sorry,” Eshe said. “I’m so sorry. We are monsters. We let them do this to you.”\n“No,” Lashav sat down beside Eshe and put her hand over Eshe’s.\n“You did not do this thing to us. You have no blame. Let me, what is that word you Arrivals use . . . let me comfort you.”\nLashav sat beside Eshe and held her hands.\n“Tell me what to do to make it right. To make it hurt less,” Eshe whispered to Lashav, her lashes glimmering with droplets of nearly-shed tears.\n“Grand-Daddy will tell you. That is why he called you here,” Lashav said, her eyes fixed on the thrumming crystal. Violet and cerulean blue lights shimmered at the penumbra of the incandescent white heart of the living crystal. They both stared, the one in a trance, the other, in a near-hypnotized wonder while they clasped each other’s hands.\nEshe visited Grand-Daddy every night after that second night, and Lashav would be waiting for her. They learned the language of comfort long before they learned the myriad ways of exploring each other. Through flesh, through skin. Through touch, through taste.\nEshe’s final decade on Earth had felt like sleepwalking.\nDislocation dogged her every waking moment, padding behind her like a faithful pet. It hummed in her veins through hours spent in the lab, through various seminars and briefings as they prepared to leave a world that was about to die. Nothing seemed to contain meaning when one was certain of the annihilation of one’s home. Eshe barely tasted the food she ate, and could barely allow herself to care for the lovers she took on and discarded like last night’s leftovers.\nEshe sometimes remembered her condominium in Serdang that was full of different tapestries and figurines representing Neith, the Egyptian goddess of war and weaving. It had been a teenage fascination that grew into a kind of personal obsession, a digital exploration of a part of Egypt that was not wholly her heritage. Her ancestors had been Egyptian Christian. Her mother Elpis however, walked her own path through faith and science. As did Eshe.\nEshe’s condominium had sprawled on the twenty-first floor, a generous gift from Elpis when her daughter had turned twenty-one. It overlooked a golf course and a lavish country club patronized by entrepreneurs, lower cabinet ministers of the Malaysian government and MLM scamlords moonlighting as venture capitalists. The apartment would have been seen as an indulgence by many—Elpis said she wanted to be sure her children all had the gift of a better life than the one she had led. She did not provide much information about her flight from Egypt.\nNeither Eshe nor her siblings felt they had the right to ask.\nWhenever Eshe tried to recollect the exact size and depth of her apartment, her memories juxtaposed with documentaries about Neith, and Isis, and Horus, and Sobek she had watched, along with numerous online databases she had trawled. It was as though all of the information she had imbibed had scrambled her memories.\nEshe had never known a world in which she didn’t have to relocate because it was going to be destroyed. It was therefore hard to feel extreme nostalgia for something she always knew she was going to lose. And if she did now sometimes miss the taste of kushari, she wasn’t entirely sure if she was remembering correctly the texture of rice, pasta, and lentils tossed in tomato sauce that was such a mainstay of her childhood. Taste, smell, and touch remained her constant, her anchor for all of her memories. Vision and sound could be deceiving, but there was at least some kind of verisimilitude of the act of consumption, of the way taste and sensation rolled about in one’s mouth.\nShe had a childhood soaked in the borrowed nostalgia of her parents, and of her grandparents. She inherited the demons and ghosts that nipped at the heels of both Elpis and her Hakka father, John. Her mother’s struggles with visa and permanent resident status in Malaysia, her father’s own inherited anger over racial inequity and May 13th, that day of mass terror that marked forever the moment in which the trajectory of Malaysia’s destiny would depart from its original course. Memory had never been an uncomplicated thing. You’d think a child born from two fragmented diasporas would be used to this. But this was different. This dissonance contained a different flavor entirely.\nAt night, Eshe would walk to the apiary to continue her scheduled observations of the bees of Sesen, uncompromisingly alien with their alternating stripes of indigo, black, and cobalt blue. The hum of the bees often seemed to resonate at the same frequency as Grand-Daddy’s thrumming. After she had started drinking untreated honey, there were days when she swore it was the same thing.\n“Humanity nearly wiped out the bees on Earth at one point,” Shakuntala had once said to her as Eshe followed her on their rounds.\n“Yes, but that was before my time,” Eshe watched white-winged cranes fly towards the forest that receded towards the Southern Mountain Range, presumably to roost before moonshine crept over the top of the trees. “My mother wrote extensive notes about it, about how she’d tried to create different protective environments for the bees she cultivated in Cameron Highlands.”\n“Elpis was a great apiarist,” Shakuntala’s face wore the soft cast of remembrance, her voice subdued as she said, “I enjoyed working with her a lot. But, you’re here now, and we can utilize some of your mother’s experiments in figuring out the best homes for these bees.”\n“We don’t have pesticides on Sesen so that should simplify some aspects of our research,” Eshe commented.\nShakuntala said, “That is right, and the society of astrobiologists have already ensured that most forms of pesticides will be banned. We’ve already seen their ill-effect on the planet we’ve had to abandon.”\n“Has the society of agriculture agreed to this?” Eshe was skeptical, but she was still newly come from Earth, and Shakuntala had spent nearly fifteen years on Sesen.\n“We’ve seen how deeply we fucked up the home we left,” Shakuntala met Eshe’s eyes.\n“You did not see how bad it was towards the end,” Eshe’s eyes blinked rapidly as she remembered the looting, the indiscriminate slaughter, and the full-on religious panic during the final days, before they escaped via the tunnel-throughs. No more liquid, only blinking. Some nights it felt as though all of the liquid had drained out.\n“Here, help me with this wall,” Shakuntala beckoned at her, forestalling further reminiscences of a planet that no longer existed. Eshe stepped towards to the other side of the hexagon-shaped fibrous panel that Shakuntala was using to build the walls.\nThe more senior astrobiologists had wasted no time in constructing artificial hives so they could study the habits of the bees of Sesen when they arrived on Sesen. These hives were lightweight. With some cheekiness they had agreed to construct them in the shape of the Calabi-Yau manifolds as a homage to the work of the string theorists who had helped with the development of the tunnel-throughs.\n“Are the Calabi-Yau shapes effective, or are they just something we’ve been using because it amuses us?” Eshe asked.\nShakuntala grunted as she hammered joints together. “Both, really. The Sesen bees seem to like these interlinked hives, and the honey they produce tastes better than the more generic hives.”\n“I’d like to experiment with that, if you don’t mind,” Eshe said as she reached for a hammer of her own from the toolbox set on a stool beside Shakuntala.\nShakuntala took some time fixing the joints of one of the walls before she asked, “What are you planning to do?”\n“Experiment with flavor. The honeys we had on Earth were so rich, so heady . . . ”\n“As are the honey produced by these bees,” Shakuntala interrupted.\n“Yes, yes. But there’s not enough variety, depth, texture,” Eshe waved her hands in the air, including the one that clutched at the hammer.\nShakuntala gently touched her hands, stilling her near-dangerous movements. “I think what you mean to say is that the honey here does not taste like home.”\n“Nothing tastes, feels, or looks like home,” Eshe said.\n“That’s the point, Eshe. We can never go back. That home is gone. Now. We can sit here grieving. Or we can finish building this wall. And then the next one. Until we’ve got ourselves the biggest complex of hives in Calabi-Yau shapes in this apiary.”\nEshe nodded, her eyes still blinking. She rubbed them with the back of her hand, the itch was growing to be troublesome. She reminded herself to ask the medical unit for some eye drops.\n“I cried for ten months after my arrival. We were the pioneer batch, it was terrifying. We had no basis for comparison. None. And we knew what we had left behind would never be waiting for our return,” Shakuntala gently squeezed Eshe’s shoulders.\nIt was dusk when they finished constructing the hive that would be joined to the others.\n“Come on, I’ll walk you to the mess,” Shakuntala said. They padlocked the door that opened into the hive. Tomorrow they would release a batch of bees into it.\nEshe zipped up her parka as she shivered in the cold Sesen wind. Above them, birds that were both similar and yet fundamentally dissimilar from the birds she had known on Earth flew, released like the breath that fluttered in her chest when she exhaled. Grief was the periodic reminder that you were holding your breath in for too long, a breath that needed to be released so you could live, even if you did not understand why living was necessary, why any of this was necessary, Eshe mused.\n“There were no birds like these when we first arrived,” Shakuntala said as she pulled on her mittens. Eshe pulled on her own as she watched.\n“How did they manage to bioengineer so quickly, even with what they did to the over-soul?” Eshe asked. “I mean, there’s only so much dark matter can do on its own, right? The building blocks of creation, how far can that process go, how does it get accelerated? It doesn’t make much sense to me.”\n“That’s a mystery to me as well,” Shakuntala said, “although the manner of multiplication and mutation of genes may be said to be almost . . . magical. Almost Vedic, as a matter of fact. But apart from that, what do we know? Our machines made on Earth have all but stopped functioning, and we’ve been learning which of our technologies can be used, and which need to be changed.”\nThey entered the long, dimly-lit mess hall where food was served buffet-style much in the same way they’d been served in university cafeterias back in Malaysia. Eshe closed her eyes as she always did to take in the aromas, feeling the pulling sensation of memories she did not know she could fully claim as her own.\nShakuntala turned to Eshe. “I’m going to let you have materials to build different kinds of hives. See what you can do with your experimentations with honey.”\n“Thank you, I really appreciate it,” Eshe said.\nShakuntala dished aloo gobi onto her aluminum plate, saying, “We all need something to divert ourselves from what’s been done to us, and to this world. We’re—well, most of us at least—trying in our own way to atone.”\n“How did you know?”\n“That you seek atonement for what the Bunian Empire did to the planet? Perhaps I know because I feel much the same way, Eshe.”\nAh. Eshe met Shakuntala’s eyes in acknowledgement. There was nothing she could say that felt adequate. A smile would be disrespectful. “Thank you, Shakuntala.”\n“This is another way in which I choose to atone,” Shakuntala said.\nEshe took a scoop of dhall, and another scoop of kushari onto her own plate, adding a small container of salad, and two pieces of eesh baladi bread. There were Egyptian cooks in the mess, some of whom had actually worked in Malaysia. It was a comfort, but there was always the sense that what they were eating was as real as they were.\nWhich was to say, they were a negligible reality.\nGyasi had said more than once that simulacrums experienced phenomena in a wholly different way. Eshe would reply very sensibly that they were experiencing phenomena differently because everything about Sesen was different and yet painfully similar to Earth. The over-soul had shaped itself into something livable for its new inhabitants, creating a symbiotic relationship between human and planet.\nThe truth was that she was haunted. She knew she was not the same person who had grown up in Serdang in Malaysia to agnostic parents. The method through which they had Arrived on Sesen had ensured that they were not the same.\n“We’re a different composition altogether,” Gyasi would say, his eyes red-rimmed and wild, “different compounds of consciousness and matter.”\n“Prove it,” Eshe would counter obstinately. Memory was to Eshe the bedrock of her being. If memory existed, so did Eshe. However, for Gyasi, their memories were as false as their senses.\n“Perhaps you’re not Eshe and I’m not Gyasi, did you ever think of that?” Gyasi said to her one afternoon in the cavern that served as their laboratory on Sesen. “Perhaps we have been reconstituted from more than one person in the same space, and these memories we have of Earth are composite memories.”\n“We’re astrobiologists and apiarists, not neuroscientists nor philosophers, Gyasi,” Eshe said.\n“Biology is the science of organic things. We apprehend organic things through our senses. It remains a mystery if the senses we have now correspond to the senses we had back on Earth. You’ve mentioned the aftertaste of violets more than once in relation to the honey provided by the hives, Eshe. But how do we even know what violets taste like?”\nGyasi looked genuinely distressed by this thought, even as he uttered it. Eshe could think of nothing to say to comfort him, so she placed a hand on his wrist and gave it a comforting squeeze. The younger apiarist fell silent, and then the friction of skin upon skin evoked other memories that Gyasi would swear were not real.\nAt night, Gyasi would write tortured poetry that would win him the regard of the younger apiarists. He flung himself into a series of affairs, both men and women. For a very long time, he dated Anthony Lim, one of the Administrators. That had been an uneasy partnership that dissolved after Anthony grew tired of equal servings of pragmatic philosophy and untrammeled ontological angst. Eshe had comforted Gyasi when the breakup occurred, as he did her, when she broke up with three women within three weeks, in spectacularly tempestuous displays of dissatisfaction.\nShe started drinking the untreated honey.\nThe honey slowly changed the way Eshe viewed the world. It transformed her perception of the color of the multihued sky. She no longer saw lines and various material forms as solid. Everything was changing, and when she looked at things she saw gradations of color, and the shifting of lines and curves.\nHer irises enlarged preternaturally. That change brought a difference in the perception of color. Her skin changed and had a deepened sensitivity to every tactile impression of the new world. Nothing felt the same, not fur, not skin, not the taste of violets on the tongue. If qualia was externalized perception, then the physiological changes that came with drinking untreated honey had changed not just her biology but her ontology. Everything that was in flux before became solid, and so immediate that it frightened her. It was as though there was no filter between her private thoughts and externalized experience. Perhaps, she had lost the intrinsic nature of the woman she had been before. Grief had fluttered away with the other birds she released when she exhaled.\n“I know what you’re going to ask me, Gyasi. You ask me the same question with every flavor we put out. How do we know if rain forest honey really tastes like this?” Eshe mimicked Gyasi’s voice right down to the morose lowered tone on the last two syllables.\nGyasi smoothed his hair back before pulling the mass of ringlets upwards into a messy topknot that he secured with a pencil, his bead bracelets and silver bangles jangling against lightly furred upper arms of dark brown.\n“It is a legitimate question, Eshe. We’re walking, living, and breathing Putnam’s thought experiments. You know that the way we are perceiving things is different. Everything feels and tastes and looks and sounds different. Fuck.” He cursed as he made a mistake in the ledger. Gyasi struck out the line and started again on the next line. He said, “Fuck it, Eshe. Even you look different. You keep drinking the untreated honey, and you’re starting to look as freaky as that alien lover of yours who looks like a furry cosplayer’s erotic dream come to life. Your eyes are starting to look like insect eyes. Beautiful, but also scary. You’re no longer Eshe. You’re a simulacrum on a twin world. We’re living and breathing Putnam’s hypothesis.”\n“Not quite, Gyasi, or we would have twins back on Earth. Earth is no more, and Sesen was modified by the over-soul to accommodate us. As best it could. Also, stop checking out my girlfriend, you lecherous bastard.”\nGyasi ignored this, saying, “We’re ghosts then, badly composited twins of the selves we left behind. And we still don’t know why the over-soul was so accommodating. We’re Arrivals. We want to believe we’re migrants, but look at us changing things. We’re colonizers, Eshe. Why would the over-soul want to change things for us? We’re messing with the biorhythm of the bees using those crystals. It feels unethical.”\nEshe poured the honey into the last jar. She capped and then sealed the jar, placing it on the shelf with the rest of type XXVII. They would keep five specimens of the honey for future reproduction, but the rest would be distributed amongst the human colonies on the main continent, with some kept to be artificially replicated for the outlying colonies. Even here, the elite got the best of everything. But they had already known they were not leaving a planet about to be destroyed to go to a better world, not when the Administrators were handpicked from dominant oligarchies.\nThey had been working together for so many years before they had arrived on Sesen that they became each other’s yardsticks for how much they had changed. From the outside, it felt as though Gyasi had not changed at all, but for the perpetual hollow expression in his eyes and the downward turn of his mouth. Even towards the end of their days on Earth, Gyasi had been jocular. Here, his jokes felt as staged as his bravado.\nHis eyes were as haunted as the eyes of her Barlishya lover.\n“Gyasi. Can’t we just enjoy the fact that we’ve produced this gorgeous honey without descending into ontological angst? Just once? The crystals thrum regardless of what we do, and the world is in flux. Everything is changing, everything is malleable. What we’re doing is just helping the planetary over-soul. This is a new world. We are new too. Can’t you just relax for one evening?”\nGyasi unbuttoned his lab coat and placed it on one of the swivel chairs.\n“For you, I can try, Eshe. But as for enjoying myself, I fully intend on doing so,” He planted a kiss on her forehead and then headed for the door.\n“Where are you going?”\n“I have a date,” His grin was a desperate attempt at nonchalance, not at all aided by the unrelenting haunted aspect of his eyes, “after all, enjoying ourselves is important, isn’t it?”\nEshe decided to ignore the bait.\n“You’re standing too close again. Do you want Grand-Daddy to consume you?”\nLashav asked. The Barlishya had been resting her head on her knees, bearing the familiar signs of post-shape-shifting fatigue.\n“What harm could it do? I’ve been here so many times in the past month.”\n“You’re neither Arlishya, nor Barlishya. Grand-Daddy still has problems understanding your kind. It still does not understand me and my kin even though we’re all of the over-soul. Grand-Daddy cannot comprehend a world in which everything is splintered and not connected to the over-soul.”\n“While I cannot comprehend a world in which everything is merely one thing,” Eshe’s smile was flinty.\n“Perhaps one day you will,” Lashav said as she gracefully slid down from her ledge, her long legs finding easy purchase on the cavern floor.\nThe lovers learned the configurations of their own skin by discovering the pigments and crevices of each other. Eshe knew Lashav when she was a woman, and sometimes knew her when she molded and shifted into humanoid representations of other beasts.\nSometimes, these shape-shiftings would occur when she told Lashav about the Gods and Goddesses of Upper and Lower Egypt. When she talked about Anubis, or of Sobek, Lashav would transform into a jackal or a crocodile in wonder, as though wanting to be the stories she was enjoying. When Eshe talked about Neith who was both the warrior and the weaver, Lashav would want to know more about weaving. It did not take long before Eshe had to construct the first weaving-shuttle and loom on Sesen, just so Lashav could understand how weaving worked.\nThe knowing could not always happen, not when quills started growing from Lashav’s back. On many nights, she would be awakened by the soft snuffling of a fully manifested cat, or a wolf or a fox or a raccoon, leaping onto her bunk to sleep at her feet. By morning, she would be spooned within the long, golden-brown limbs and torso of a Barlishya with large eyes of liquid black and beautifully spiraled ears.\nEshe had explored the contours of those ears with a curious tongue, trying to identify the flavor of an alien skin. That alien skin felt like it had the consistency of honey made liquid. When she kissed Lashav and imbibed her nectar, she experienced once again the aftertaste of violets. Violets on the tongue in everything that she tasted.\nShe often wondered about the over-soul, and if she was making love with the entire planet when their limbs were entangled. It came and went when she was with Lashav, a wondering that had no basis in her daily experiences but which teased the back of her mind.\nLashav came closer to her, pulling her by the hand as she voiced this thought.\n“You Arrivals have such strange ideas about what our world should be. About what you should be,” Lashav said as she hooked her arm around Eshe’s waist, her palm sliding up and down the small of the apiarist’s back.\nEshe shivered as she said, “It is how we make the unfamiliar familiar. We need that. We don’t even know who we are anymore. We need to know.”\n“I can understand that. I don’t know this world anymore, I don’t know if I ever did,” Lashav said.\nThe desperation in her voice alerted Eshe to what was about to happen. Eshe’s pulse quickened as Lashav drew her down to the sandy floor. It was too close to the thrumming. She shivered as Lashav nuzzled first into her collarbone and then moving on to the curve of her shoulder, swiftly bared by inquisitive fingers.\n“Here, Lashav? Right next to Grand-Daddy? I thought you said not to go too close.”\n“We’re not as close as you were before. This is reasonably safe. Besides, he won’t care, and none of your kind visit this cave. They’re too afraid. Of me. Of us. Of this world. You’re the only one. The only one. Honey.”\nHoney. The word that was an endearment on the planet that she had left. The word that was her lived reality in Serdang. The word that she had taught her lover.\nThat moment remained in their memories, even when the promise of “the only one” was proved to have the veracity of a moment of intense corporeal communion. The truth became a lie the night Gyasi heard Grand-Daddy’s thrumming, and his feet brought him to the cavern.\nThey had enjoyed nearly half an Earthly century together, but Grand-Daddy’s thrumming had grown hungrier recently. Insistent as the imperative towards aging, even if aging came slow, very slowly for the human Arrivals who found their physiology altered by their journey. This thrumming felt like the music of the over-soul, the song of constellations, and of galaxies exploding. The sound tasted like the dark matter that had helped the physicists find a way to tunnel through to this world. The thrumming was like the wings of a million hummingbirds. It had the aftertaste of the purest, most distilled honey that could be produced by the hives of Sesen bees, magnified by about a thousand. It was as though the thrumming was melting her limbs from the inside. She had no idea that sound could have a taste, a taste that was so familiar, like the first time her mother had spread honey on flatbread for her.\nA shifting in Lashav’s position woke Eshe. Lashav was curled into herself in a defensive gesture that made Eshe thoughtful. Gyasi had been spooning Eshe earlier, but he was now spread-eagle on the woven blankets they had brought with them, along with candles that had been lit as they meditated together in the cavern as Grand-Daddy dominated their conscious thought.\nWhat if we had been reconstituted? Gyasi had asked her, all of those years ago, when they were both young, and terrified without being aware of how frightened they were. Even Eshe, despite what the untreated honey had done to her.\nWhat if we had been remade, and we are not what we once were?\nWhat if. What if moving through dark matter meant that they were no longer the people they were on Earth? What if they were all simulacrums?\nOr ghosts?\nEshe turned back suddenly. She moved towards Lashav who was whimpering in her sleep. She bent down from the waist to give her lover a kiss on the shoulder. She brushed the palm of her hand tenderly over Gyasi’s smooth bald pate, watching him as he slept, his features made cherubic by age. It was an unconsciously maternal gesture.\nWas she doing this?\nShe thought she had escaped the ontological undoing, the unmaking caused by the trauma of Arrival. But this felt altogether different. This was a yearning. A yearning that vibrated through her bones, filling her as she imbibed of the alien nectar, and entangled herself with limbs nightly that were more of that thick, sweet liquid made flesh.\nShe was drinking the over-soul.\nCorrection. They were all drinking the over-soul.\nEshe moved back towards Grand-Daddy. She braced her palms against the smooth, crystalline quartz surface. It was hot. It felt like Grand-Daddy was melting her brains, her bones, and her consciousness.\n“What are you doing, Eshe?”\nGyasi’s sleep-blurred voice startled her.\n“I cannot resist Grand-Daddy’s song anymore, Gyasi.”\n“I know, none of us can. We’ve stopped each other from doing this over the years. But it’s going to happen now, isn’t it? That’s why we’re here, isn’t it?”\n“We? I wasn’t going to involve either of you.”\n“You can’t go without us, Eshe,” Lashav said, getting up, “we all needed to be ready at the same time for this.”\n“I think we’ve always known what Grand-Daddy’s song was about, and why it sounded so strongly in our heads in particular. We knew why it wanted us. We agreed to come here tonight because we knew. We knew you were going to do it.” Gyasi said, his voice soft and gentle.\nEshe looked at her partners. She knew she could not deny them what she wanted for herself. She nodded, and opened her arms. Lashav came first, the raccoon ears that always protruded from her hair in times of fear quivering, her raccoon tail elongating to twine around her lovers. Eshe could barely register the hands pulling at her waist, and the arms and tail embracing her. Her eyes were fixed on the incandescence at the heart of Grand-Daddy, her tongue consumed by the taste of violets. They were overcome by a crystalline ecstasy, a fierce joy they never knew they had been striving for with each melting union of flesh and fluid.\nEshe/Lashav/Gyasi melted into the embrace of the over-soul.\nThey woke up into a consciousness that embraced galaxies, and cradled a planet of living crystals. They fed it fractured memories of world myths. Memories that Gyasi had deemed false. He was now resigned to the verisimilitude of what they had brought across.\nTheir bodies shifted, splitting. Gyasi felt his maw elongating and changing as the over-soul fed on the stories of its lovers shaped him into the Crocodile.\nEshe was transmuted into The Woman Who Weaves, master of The Grand Complect that was to guide and shape the civilizations of Sesen in the centuries to come, effectively disrupting the planned trajectory of human civilization on Sesen that the Administrators had so carefully laid out.\nGrand-Daddy thrummed as it made a mythology for the still-new world out of the fragmented memories of the planet it had consumed. It was a mythology that would wipe out the oligarchies of the old world, and the cultural memories of those who had Arrived.\nThe over-soul felt she had every cause to feel pleased with herself.\nFuture statues and temple friezes depicting the over-soul as the Cat or as the Racoon-Daughter of the Seven Sentient Moons would wear the same smug smile she wore when she joined with her spouses in the embrace back into the core of her splintered being.\nPerhaps Eshe and Gyasi had been transformed before they had ever entered Sesen. Perhaps they were never the humans they had been on Earth. But there was one thing Lashav, or the Cat knew, because it was the one thing she had wanted so badly she remade the planet’s core consciousness for them. She remade herself for this new reality.\nHere at least, they would never die.\nNin Harris is an author, poet, critical theorist and Gothic scholar who exists in a perpetual state of unheimlich. Nin writes Gothic fiction, baroque planetary romances and space operas, mythic fantasies and various other forms of hyphenated weird fiction. Nin's publishing credits include: Clarkesworld, Strange Horizons, The Dark, Beneath Ceaseless Skies, etc. Nin was a 2016 Rhysling Poetry Award nominee.", "source": "https://clarkesworldmagazine.com/harris_04_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Violets on the Tongue by Nin Harris"}