{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Mari Ness", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "J+shrTX9uo8wy5jnlWveAvsAYGs=", "id": null, "license": null, "comments": "", "raw_text": "4490 words, short story  And the Hollow Space Inside  Doug reaches for my hand as the ship approaches. He continues to hold it as the great doors open, as we watch them leave the ship. They pause; they have been in space and ultra-low gravity for five years now. Five years, one month, and three days, to be precise; I cannot believe my mind has memorized this.  We are too far away to see this, but I know their eyelids are blinking as they adjust, process, calculate, move, adjust again, the change in gravity no more than a problem to be solved.  As always, I am struck by how human and inhuman they look. Even their pauses have a precise, calculated feel. No one has ever seen them show uncertainty. No one ever will.  Gravity adjustments made, they walk with precision to the terminal, directly in front of us. It takes me a moment to recognize her, out of the eight faces. That is not surprising; it has been twelve years since I last saw her. What is surprising is how, even now, I am still desperately looking for any trace of my daughter’s smile in my daughter’s face.  The Mars missions, we were assured, would be the eventual saving grace of humanity. Oh, certainly, we hadn’t managed to use up all of the world’s resources yet, but that was only a matter of time. Population growth had slowed, but not stalled out completely, and wars over resources kept getting bloodier—while not reducing the population much. Mars was the only planet we could reach in an acceptable period of time, terraform, and begin colonizing. Other worlds would come, but by the time we reached the next nearest acceptable planet—a forty-year journey each way, under optimum conditions that few scientists thought we would meet—it would be too late for Earth. The Mars missions offered us that saving grace.  Only one problem: ordinary humans couldn’t survive the trip.  Beside me, Doug takes a deep breath. “She looks good.”  “Yes,” I agree.  The four years in low gravity, not to mention the years of dehydrated food before that, should have taken their toll, but she still looks fit and considerably younger than her actual age. Then again, she always did. They all did, a side effect of programming and lack of temptation, and (but this is only my opinion) emotions and stress.  The eight of them reach the terminal, turn in unison, and wave in precision. I have to remind myself once again that I have been assured that they all have individual implants and computers, individual programming. They were all expected to perform different tasks, after all; it would make no sense to have them.  They vanish into the facility.  “They didn’t say hello,” says Doug.  I do not tell him that I am relieved.  The facility explained: humans needed interaction. A mere eight people, stuck together in the tight confines of a ship, and then on the almost equally tight confines of the first Mars base, could not be trusted to stay sane. The astronauts on the space stations had remained sane only because they were regularly rotated in and out, and could also continue to converse via radio and satellite to people back on Earth. By the time the mission reached Mars, these transmissions would be delayed—not by much, but just enough to leave a long silence after a statement.  Just enough to drive people over the edge—only this edge was out in space, or on a hostile planet with no real edge to go to.  Unless they had no edge to fall off from.  Amy is blind, navigating with touch, sound and precision memory. Her taste and pleasure centers are nonfunctional. She eats carefully balanced meals at carefully programmed times, although she is never hungry.  “I don’t understand why they’re using the . . . children.” I shouldn’t have hesitated before that word, but I’d never been comfortable using it. They weren’t children. I didn’t know what they were, but they weren’t children, not by any definition of the word. But Doug hated the other, better word: implants. And adults just sounded wrong. The hesitation made Doug flinch. Which might have been why I’d hesitated. “If they think regular people can’t handle it, then why not just send out regular robots?”  Doug flinched again. Any reminder that his—our—daughter was any sort of robot did that to him. “As I understand it, they want to understand and see the long term effects of Mars gravity and terraforming on human bodies, since eventually they do plan to send the rest of us out there.”  “But—” I swallowed, tried to get my thoughts in order. “They’re programmed. They’ll be eating and exercising absolutely regularly in a way regular adults wouldn’t. Couldn’t. Even Olympic athletes aren’t that careful.”  “But it will give them a general idea. Plus, they need to ensure that human bodies”—it was my turn to flinch—“are capable of spending sustained time in a Martian environment.” He sounded like someone quoting a speech from a marketing consultant; it took me a second to realize that was probably exactly what he was doing.  I gave up attempting to eat. “Ok. What I don’t understand is this. Why are you telling me this?”  “Because they want us to talk to her before she goes.”  By “they” he meant the facility’s attorneys, of course.  Amy is also a skilled engineer and astronaut, programmed with the equivalent of multiple doctorate degrees in engineering, computer science, astronomy, microbiology, geology and geophysics and to speak multiple languages with the same flat intonation, who has to be reminded by a computer program to eat, who has never laughed or cried in her entire life.  “I’ll sign more papers if I have to,” I said. “I don’t want to see her.”  “Crystal.”  “I’m serious.”  “Crystal. If you don’t go, she can’t go. And—” He swallowed, and I saw that he was about to start crying. “She doesn’t belong here. You’ll see.”  The reason for their quick disappearance is soon explained. The eight of them must be thoroughly checked—their programs are not yet perfectly adjusted for self-maintenance, although they are able to observe and check each other. Then a patch, to ensure that they are properly programmed to adjust to the new gravity, and another patch to ensure that they are able to translate and understand the very latest idioms in multiple languages.  And, of course, they must eat, which none of us will want to see.  This last part is true. The implants do not respond to appetite or taste, and although they are programmed to eat, with the precise, mechanical movements they use for everything else, they have difficulty with this. Eating, it turns out, is somewhat more complicated than mere programming, and it is not something I want to watch again.  None of this is anything I want to watch again.  “Of course she’s agreeing to go,” I ranted at Ariela, my best friend, the only one other than Doug who knew the whole story. “She’s programmed to go. Why do I have to go to see this for myself?”  Ariela fiddled with her coffee cup. “I don’t think that’s it,” she said, after a moment.  “Then what is it?”  “I think they want you to be able to say good-bye.”  I have a picture of my daughter, in her crib, surrounded by wires and tubes.  It is the only one I have. Most of the time, I leave it buried at the bottom of a drawer in the guest room, face down. But sometimes I take it out, and try to imagine that in it, my daughter is smiling.  When I found out my child would be born without a brain, I didn’t cry. I couldn’t. Everything inside me was swallowed up, gone, empty, and I had nothing to cry with. I just sat quietly, hands folded over my abdomen, listening. I didn’t have much to say.  I had options, they explained, carefully. I could terminate the pregnancy—it was difficult to find anyone who would terminate late term pregnancies here, but a trip to Europe or Asia could be arranged. I could bring the child to term. (Beside me, Doug jerked, but didn’t say anything.) The child would not live, but some parents found that comforting, and I could hold her afterwards. (“Comforting”? The hollow part of me could not ask.)  Or, they said, they could offer a third possibility.  I’ve cried enough about this already. Enough.  The medical procedure was less simple than they had promised. Eight hours of initial surgery, and then two days in bed, another surgery, and then a third. Doug tried to read books to me, but I was so sick I could barely understand his words. Finally he set me up with a tablet and music and let that play while he slept and slept.  With each procedure, I dreamed, dreamed that metal was moving through my skin and bones, dreamed that wires were replacing my nerves. I saw myself as a computer. I saw myself linking to my daughter.  I threw up, over and over. The pregnancy, said the nurses sympathetically. Or the drugs. But I knew it wasn’t either.  Even now, I sometimes wonder if some of those nanobots entered my blood, my skin, if their presence is why I can now look at my daughter and have no desire to hold her.  I was allowed to hold her, briefly, after the birth. It was psychologically better for the mother, one of the doctors argued; a compassionate thing to do, agreed the attorneys, who probably had other fears in mind. I had no thoughts of a lawsuit, not then.  She was small, so very small. And so limp. For some reason I had thought that the procedures would extend metal all the way through her body, but no. Not that she was lacking in metal; she had wires and tubes seemingly everywhere, controlling her food intake and bladder and monitoring pulse rates and the electronic activity in her brain.  But no tubes in her nose or her mouth, and her tiny chest rose and fell steadily.  “There were some problems,” Doug says.  “Problems,” I repeat.  He swallows. “They could send commands to them while they were on the mission, but apparently, something about the distance and time—anyway, they weren’t able to successfully upload all of the patches and fixes. Some of the programming broke down.”  “And?”  “Some of them—well, they’re saying some of them may be nonfunctional.”  It takes me a moment to sort through the pronouns. “Amy?”  “I don’t know.” He swallows miserably.  “The implant is letting her breathe,” explained one of the doctors. “In time, it might allow her to do more.”  “What more?” asked Doug.  “We don’t entirely know,” said the doctor. “Movement, walking, certainly. Speech, hopefully. And more beyond that.”  I touched her cheek. It was warm to the touch, and I could tell that she was breathing. But that was all. She did not move, did not even flutter an eye at my touch.  She had not cried, not even that first baby cry after birth.  “This is your fault,” I shout at Doug, although it isn’t. “You were the one who insisted on fixing her.”  “You are the one who keeps thinking she’s dead,” he shouts back.  “Did you have a name in mind?” One of the lawyers, a young man who had seemed almost human. “We can use that, if you like. Otherwise a name will be randomly chosen by computer.”  I had not. “Amy,” I said. It had been the name of one of my childhood dolls.  He made a note on his tablet.  “Will you need my breast milk?”  “We would be grateful.”  And then a doctor came and took her away, and the hollow space was inside me, consuming me, and I couldn’t even cry. I couldn’t even move. Doug was crying, shaking, and I was nothing.  We will not be allowed to talk to Amy, to see Amy, until an unspecified time. Doug is furious, but the lawyers he calls are not encouraging. If Amy is a fully legal human, and that status is dubious, capable of making decisions without the facility, she is also an adult, and we have no legal claim on her. And since she has just traveled to Mars and back, we can hardly claim her as a disabled dependent. And if she is not a fully legal human—the conclusion of most of the attorneys—she is property, and not ours, and any attempt to push these boundaries is a crime.  The hollow place inside me is growing again, and I desperately need to return to work.  I never explained to anyone why I continued to pump milk for six months.  No one was unkind enough to ask.  They sent us the first pictures when she was five. An unsmiling child, looking straight at the camera, unblinking.  I begin to receive messages from Doug’s lawyers. I delete them. I need to focus, focus.  Doug received the status updates and read them regularly. I couldn’t. He told me tidbits, however: that Amy had been able to sit up, to move her legs and arms. That Amy had successfully downloaded the program that might help her control her urination. That Amy had connected with her vocal cords—  “Not Amy,” I finally shouted at him. “Not Amy. Her goddamn implant. The implant. The implant is making all of these goddamn connections!”  It is so easy, on a computer, to move a few pixels around, to change an image from sorrow to laughter. So easy to use the programming already there.  We got a divorce about two years after that.  Much later I heard that attempts had been made to get the children with implants to smile, to make laughing sounds, to move their faces. It had all been abandoned. Emotions were, it seemed, the one thing that a program could not fake, and a face was all emotions. Some of the caretakers at the facility had become physically ill just watching a computer attempt to move their faces.  On Ariela’s advice, I switched careers entirely, moving from insurance to marine biology. I focused on the microorganisms in mangrove ecosystems, forgetting, in my kayak, or on my computer, or snorkeling in the mangrove roots, that I had ever had a daughter, that I in some ways still had a daughter. Instead, I had spironemids.  Doug and I stayed in touch, meeting once a year or so. I went to his wedding, to a small fierce musician named Inari. He met some of the succession of boyfriends I had and disposed of over the years.  And he kept me updated on Amy.  Whenever he did, I allowed myself to think of my mangroves, disappearing into them, into the images I created of spironemids racing up and down the mangrove roots.  I receive an email from one of the other parents, one of the few who understands. Their son and his implant have failed; they will be heading to the facility to say goodbye, and put some of the dust of Mars on his hand. “I feel as if we already said this,” says the email. “I feel as if I have to say this every day.”  I agreed to meet her. At the very least, it might help end Doug’s endless updates, coming at odd intervals through the year. I should have insisted to an end to those in the divorce agreement.  I made him drive us to the facility, and pay for the hotel stay. In separate bedrooms.  “One meeting,” I say. “Just one.”  “No.”  “I’m her mother,” I manage. I remember Ariela’s words. “I have to say good-bye.”  “Hello,” came a voice.  Something was wrong with that voice, terribly wrong, but I could not pinpoint the problem.  “Hello,” I managed back.  “Should I enter?”  “Yes,” said Doug.  And she stepped into the light.  Doug’s features. My mother’s hair. My eyes.  Our daughter. And yet, not our daughter.  It—she?—stepped forward with small, efficient movements, as if every step was carefully measured—which, I realized in shock, was actually what was happening. The face—Doug’s nose, his chin, in her face—was extraordinarily, perfectly still. Her hands brushed the chair in front of her, and she sat. The motion—I tried to find words for it, and then realized. She was not moving the way a human would. She was moving the way a computer thought a human would move.  She has an individual implant, my daughter. It can still be accessed, still be reprogrammed at the will of the facility. Doug and I have no rights over this, cannot stop the facility from turning her into whatever it wishes. That was part of the agreement we signed, to keep her alive.  “Hello,” Doug said, his voice remarkably steady under the circumstances.  The face turned towards him. “Hello,” it repeated. Its eyelids blinked, rapidly.  It’s processing, I thought. They had warned us of that facial tic, programmed to allow others to tell when the implants needed to pause to process.  I was going to throw up. I knew it. I stood, wobbled, and pushed my way out of the door, not sure I could even make it to the nearest bathroom, feeling the floor rock beneath him. Behind me I heard Doug say something, but I could not be sure if he was talking to me or Amy.  Amy.  I am in the middle of finishing up a presentation for an important conference when the email arrives. Doug, of course, telling me that he has contacted people in the facility, who say that Amy is not completing all of her programmed tasks, that she is instead sitting at a window staring up into a sky.  That sounds most unlike Amy. I have never known her to stare at anything.  I threw up, again, and again, then leaned against the toilet for a while, body shaking.  The second meeting went better.  I refused to think of it as my daughter, as anything remotely related to me, even if its eyes were the same color as mine. Oddly, what helped was the voice, the same voice that had made me so sick. I had never heard anything like it; the “computer” voices I’d heard before were either the recorded voices of actors, or clearly mechanical synthesized sounds that had never approached human vocal cords. This—this was different; the sound of a mechanical voice pushed through human vocal vocals, precise, emotionless, flat, with no accent that I could think of. At Doug’s request, it demonstrated fifty languages for us, all with that same precise flatness. It explained how it spent its day, in regular exercise and eating and downloading. I watched the eyelids blink each time it answered our questions.  I signed the papers.  “Thank you,” it said.  I find myself wondering what she is thinking. If she is thinking. Can she think? She is programmed to process, to sift, to keep herself alive while analyzing vast amounts of data and transmitting it back to computers for further analysis.  I know she cannot see the stars. But I cannot stop wondering if she looked at them anyway, in those quiet hours between the Earth and Mars. If something in her looked at them. I clench my fists and rub them against my legs.  We made other visits before the launch. She had downloaded more languages, which she demonstrated for us. She did not listen to music, but could list off every song and album from any artist I named, knowing the exact length of each song, the record company, and where it was produced.  She could not use my daughter’s eyes to see. But a million million images had been downloaded into her brain, including mine. She navigated by touch and utter precision, and had been updated with the very latest in voice recognition software.  We arranged to meet her outside. For some reason, this seemed more natural, easier on both of us. I could not tell if this affected her or not. But when we were outside, she sometimes turned her face to the sky.  After she left for Mars, I almost forgot about her.  Almost.  I receive an urgent email from the facility. It is not an update on Amy’s medical condition. It is a request, typed by her and signed with her electronic thumbprint. In it, she asks that we authorize her return to Mars.  “She says she wants to go,” I tell Doug.  I cannot believe that I am saying this, that I am the one arguing for her, that I am the one saying that she—an implant, a computer, should be allowed to make her own decisions.  “You said it yourself. She’s a computer program. She can’t want anything.”  My voice is barely a whisper. “Maybe she wants this.”  It would be easier to have Amy away from here, on a spaceship, or on Mars.  I do not think that is why I am arguing for her to leave. But I cannot be sure.  After the launch, people found us—all of us, every parent that had given, donated, lost a child to the implant program. We got calls, emails, tweets, comments. Hellish. I had to slam my sites down, only to find myself stalked at work and home by media, by religious zealots, by advocates of one side or another. People who thought I had done the right thing, people who thought I was the living embodiment of evil. I changed my name, my address.  My colleagues would not meet my eyes at biological conferences. I understood; I had, in a way, created Frankenstein’s monster, or at least consented to it. And it was easier to handle than their curiosity would have been.  I sometimes imagine breaking into that facility, and wiping away all of its computers with a single program, or perhaps just taking an axe to its servers. (My practical mind whispers that with a program like this, the facility must have multiple backups in multiple places, but my imagination will not be silenced.) I imagine the implants twitching in response, the bodies falling into heaps on the ground, puppets suddenly cut from their strings.  I imagine putting flowers on a gravestone, and weeping.  My eyes remain dry.  Doug insists on another visit.  “You look terrible,” he tells her.  Amy does not respond. To me, she has never looked well, even when she has looked fit. But looking at her closely, I see she is less fit, less trim, than when she originally emerged from the ship and headed into the facility without talking to us. She looks slightly—loose, if that makes sense. Perhaps her programming has not adjusted to the gravity, or perhaps she is merely getting old. I realize with a shock that she is middle aged by now, and even regularly programmed exercise can only do so much, especially when combined with the radical changes in gravity she has been undergoing.  A shock because of her unlined face, her almost childlike skin. Any dermatologist claiming that wrinkles are an inevitable part of aging, and not a result of emotion and stress, should take a look at her face. She does not even have lines between her cheek and her mouth, or around her eyes.  The hollow part inside me rises up again, swallowing me, and I am at a loss for words.  Doug is right about something else as well. I cannot pinpoint it, but since she has returned, something is . . . missing.  “How can we tell them that you are physically able to make the trip?” asks Doug.  “I am programmed with a word,” my daughter says, in the flat, toneless voice that no human vocal cords should ever make. “The word is lie.”  When she left for Mars, I did not watch her leave. I stayed on my computer, modeling, modeling, writing, writing, drafting, organizing, too lost in my work and my words to catch the faintest roar of burning engines, the faintest cheers that humans—well, humans of a sort—were headed to Mars at last.  At my request, a nurse arranges one more meeting, in one of the gardens on the edge of the facility.  When I arrive, it—Amy—my daughter—is facing into the sky, eyes unblinking. It is the first time, I realize, that I have ever seen her focused on anything.  “This is not my programming,” she says.  It is so easy to sign documents, to watch those documents get swallowed up in a machine.  When I tell this story, I can see its events taking place, one after another, as inexorably as life and death.  When I remember this story, I can feel myself holding my daughter, my baby, and rocking her back and forth, a moment that has never quite stopped.  I dream of giving Amy a doll, a doll covered in wires and strings. I help her cut the strings. But with each string I cut, another wire grows on Amy’s head, until she is held in place, unable to move.  She is alive, I think. She breathes. She moves. She processes. She communicates. She knows the songs and titles of every album published since the invention of those old phonographs.  She is alive.  I think.  This time, I watch the launch, from ten miles away, on a comfortable beach chair, surrounded by loud beachgoers and picnickers. And children. Hordes of children, all seemingly determined to out-scream each other as they leap in and out of the waves.  I have my net radio on, with the broadcasters comparing this to the old moon and shuttle launches that I have seen only in documentaries and history shows. I cannot focus on their words, although I try. I can only look at the endless blue of the sky, keep my eyes trained on the spot where a golden flame will soon be lifting into a sky.  The countdown starts. I stand.  It is more beautiful, this launch, than anything I could have expected, a bright golden streak against the sky, trailing steam and mist behind it. And I am crying, crying, as the gold hits my eyes, as if the flame is burning through me. I feel it traveling through my eyes, my arms, my chest, feel it burning in the hollow place inside, the hardened still place that has been my center for thirty-three years. I feel it burning, splitting, fading. Tonight, I promise myself, tonight, I will watch the stars, and imagine what it is like to be moving towards them. Mari Ness lives in central Florida with two cats who think her fingers should spend less time on a keyboard and more time in their fur. Her fiction and poetry have previously appeared in numerous print and online publications, including Fantasy Magazine, Ideomancer, Daily Science Fiction, and Shine: An Anthology of Optimistic Science Fiction. On Thursdays, she blogs about classic works of children's fantasy literature over at Tor.com. You can also follow her on Twitter at mari_ness.", "text": "4490 words, short story\nAnd the Hollow Space Inside\nDoug reaches for my hand as the ship approaches. He continues to hold it as the great doors open, as we watch them leave the ship. They pause; they have been in space and ultra-low gravity for five years now. Five years, one month, and three days, to be precise; I cannot believe my mind has memorized this.\nWe are too far away to see this, but I know their eyelids are blinking as they adjust, process, calculate, move, adjust again, the change in gravity no more than a problem to be solved.\nAs always, I am struck by how human and inhuman they look. Even their pauses have a precise, calculated feel. No one has ever seen them show uncertainty. No one ever will.\nGravity adjustments made, they walk with precision to the terminal, directly in front of us. It takes me a moment to recognize her, out of the eight faces. That is not surprising; it has been twelve years since I last saw her. What is surprising is how, even now, I am still desperately looking for any trace of my daughter’s smile in my daughter’s face.\nThe Mars missions, we were assured, would be the eventual saving grace of humanity. Oh, certainly, we hadn’t managed to use up all of the world’s resources yet, but that was only a matter of time. Population growth had slowed, but not stalled out completely, and wars over resources kept getting bloodier—while not reducing the population much. Mars was the only planet we could reach in an acceptable period of time, terraform, and begin colonizing. Other worlds would come, but by the time we reached the next nearest acceptable planet—a forty-year journey each way, under optimum conditions that few scientists thought we would meet—it would be too late for Earth. The Mars missions offered us that saving grace.\nOnly one problem: ordinary humans couldn’t survive the trip.\nBeside me, Doug takes a deep breath. “She looks good.”\n“Yes,” I agree.\nThe four years in low gravity, not to mention the years of dehydrated food before that, should have taken their toll, but she still looks fit and considerably younger than her actual age. Then again, she always did. They all did, a side effect of programming and lack of temptation, and (but this is only my opinion) emotions and stress.\nThe eight of them reach the terminal, turn in unison, and wave in precision. I have to remind myself once again that I have been assured that they all have individual implants and computers, individual programming. They were all expected to perform different tasks, after all; it would make no sense to have them.\nThey vanish into the facility.\n“They didn’t say hello,” says Doug.\nI do not tell him that I am relieved.\nThe facility explained: humans needed interaction. A mere eight people, stuck together in the tight confines of a ship, and then on the almost equally tight confines of the first Mars base, could not be trusted to stay sane. The astronauts on the space stations had remained sane only because they were regularly rotated in and out, and could also continue to converse via radio and satellite to people back on Earth. By the time the mission reached Mars, these transmissions would be delayed—not by much, but just enough to leave a long silence after a statement.\nJust enough to drive people over the edge—only this edge was out in space, or on a hostile planet with no real edge to go to.\nUnless they had no edge to fall off from.\nAmy is blind, navigating with touch, sound and precision memory. Her taste and pleasure centers are nonfunctional. She eats carefully balanced meals at carefully programmed times, although she is never hungry.\n“I don’t understand why they’re using the . . . children.” I shouldn’t have hesitated before that word, but I’d never been comfortable using it. They weren’t children. I didn’t know what they were, but they weren’t children, not by any definition of the word. But Doug hated the other, better word: implants. And adults just sounded wrong. The hesitation made Doug flinch. Which might have been why I’d hesitated. “If they think regular people can’t handle it, then why not just send out regular robots?”\nDoug flinched again. Any reminder that his—our—daughter was any sort of robot did that to him. “As I understand it, they want to understand and see the long term effects of Mars gravity and terraforming on human bodies, since eventually they do plan to send the rest of us out there.”\n“But—” I swallowed, tried to get my thoughts in order. “They’re programmed. They’ll be eating and exercising absolutely regularly in a way regular adults wouldn’t. Couldn’t. Even Olympic athletes aren’t that careful.”\n“But it will give them a general idea. Plus, they need to ensure that human bodies”—it was my turn to flinch—“are capable of spending sustained time in a Martian environment.” He sounded like someone quoting a speech from a marketing consultant; it took me a second to realize that was probably exactly what he was doing.\nI gave up attempting to eat. “Ok. What I don’t understand is this. Why are you telling me this?”\n“Because they want us to talk to her before she goes.”\nBy “they” he meant the facility’s attorneys, of course.\nAmy is also a skilled engineer and astronaut, programmed with the equivalent of multiple doctorate degrees in engineering, computer science, astronomy, microbiology, geology and geophysics and to speak multiple languages with the same flat intonation, who has to be reminded by a computer program to eat, who has never laughed or cried in her entire life.\n“I’ll sign more papers if I have to,” I said. “I don’t want to see her.”\n“Crystal.”\n“I’m serious.”\n“Crystal. If you don’t go, she can’t go. And—” He swallowed, and I saw that he was about to start crying. “She doesn’t belong here. You’ll see.”\nThe reason for their quick disappearance is soon explained. The eight of them must be thoroughly checked—their programs are not yet perfectly adjusted for self-maintenance, although they are able to observe and check each other. Then a patch, to ensure that they are properly programmed to adjust to the new gravity, and another patch to ensure that they are able to translate and understand the very latest idioms in multiple languages.\nAnd, of course, they must eat, which none of us will want to see.\nThis last part is true. The implants do not respond to appetite or taste, and although they are programmed to eat, with the precise, mechanical movements they use for everything else, they have difficulty with this. Eating, it turns out, is somewhat more complicated than mere programming, and it is not something I want to watch again.\nNone of this is anything I want to watch again.\n“Of course she’s agreeing to go,” I ranted at Ariela, my best friend, the only one other than Doug who knew the whole story. “She’s programmed to go. Why do I have to go to see this for myself?”\nAriela fiddled with her coffee cup. “I don’t think that’s it,” she said, after a moment.\n“Then what is it?”\n“I think they want you to be able to say good-bye.”\nI have a picture of my daughter, in her crib, surrounded by wires and tubes.\nIt is the only one I have. Most of the time, I leave it buried at the bottom of a drawer in the guest room, face down. But sometimes I take it out, and try to imagine that in it, my daughter is smiling.\nWhen I found out my child would be born without a brain, I didn’t cry. I couldn’t. Everything inside me was swallowed up, gone, empty, and I had nothing to cry with. I just sat quietly, hands folded over my abdomen, listening. I didn’t have much to say.\nI had options, they explained, carefully. I could terminate the pregnancy—it was difficult to find anyone who would terminate late term pregnancies here, but a trip to Europe or Asia could be arranged. I could bring the child to term. (Beside me, Doug jerked, but didn’t say anything.) The child would not live, but some parents found that comforting, and I could hold her afterwards. (“Comforting”? The hollow part of me could not ask.)\nOr, they said, they could offer a third possibility.\nI’ve cried enough about this already. Enough.\nThe medical procedure was less simple than they had promised. Eight hours of initial surgery, and then two days in bed, another surgery, and then a third. Doug tried to read books to me, but I was so sick I could barely understand his words. Finally he set me up with a tablet and music and let that play while he slept and slept.\nWith each procedure, I dreamed, dreamed that metal was moving through my skin and bones, dreamed that wires were replacing my nerves. I saw myself as a computer. I saw myself linking to my daughter.\nI threw up, over and over. The pregnancy, said the nurses sympathetically. Or the drugs. But I knew it wasn’t either.\nEven now, I sometimes wonder if some of those nanobots entered my blood, my skin, if their presence is why I can now look at my daughter and have no desire to hold her.\nI was allowed to hold her, briefly, after the birth. It was psychologically better for the mother, one of the doctors argued; a compassionate thing to do, agreed the attorneys, who probably had other fears in mind. I had no thoughts of a lawsuit, not then.\nShe was small, so very small. And so limp. For some reason I had thought that the procedures would extend metal all the way through her body, but no. Not that she was lacking in metal; she had wires and tubes seemingly everywhere, controlling her food intake and bladder and monitoring pulse rates and the electronic activity in her brain.\nBut no tubes in her nose or her mouth, and her tiny chest rose and fell steadily.\n“There were some problems,” Doug says.\n“Problems,” I repeat.\nHe swallows. “They could send commands to them while they were on the mission, but apparently, something about the distance and time—anyway, they weren’t able to successfully upload all of the patches and fixes. Some of the programming broke down.”\n“And?”\n“Some of them—well, they’re saying some of them may be nonfunctional.”\nIt takes me a moment to sort through the pronouns. “Amy?”\n“I don’t know.” He swallows miserably.\n“The implant is letting her breathe,” explained one of the doctors. “In time, it might allow her to do more.”\n“What more?” asked Doug.\n“We don’t entirely know,” said the doctor. “Movement, walking, certainly. Speech, hopefully. And more beyond that.”\nI touched her cheek. It was warm to the touch, and I could tell that she was breathing. But that was all. She did not move, did not even flutter an eye at my touch.\nShe had not cried, not even that first baby cry after birth.\n“This is your fault,” I shout at Doug, although it isn’t. “You were the one who insisted on fixing her.”\n“You are the one who keeps thinking she’s dead,” he shouts back.\n“Did you have a name in mind?” One of the lawyers, a young man who had seemed almost human. “We can use that, if you like. Otherwise a name will be randomly chosen by computer.”\nI had not. “Amy,” I said. It had been the name of one of my childhood dolls.\nHe made a note on his tablet.\n“Will you need my breast milk?”\n“We would be grateful.”\nAnd then a doctor came and took her away, and the hollow space was inside me, consuming me, and I couldn’t even cry. I couldn’t even move. Doug was crying, shaking, and I was nothing.\nWe will not be allowed to talk to Amy, to see Amy, until an unspecified time. Doug is furious, but the lawyers he calls are not encouraging. If Amy is a fully legal human, and that status is dubious, capable of making decisions without the facility, she is also an adult, and we have no legal claim on her. And since she has just traveled to Mars and back, we can hardly claim her as a disabled dependent. And if she is not a fully legal human—the conclusion of most of the attorneys—she is property, and not ours, and any attempt to push these boundaries is a crime.\nThe hollow place inside me is growing again, and I desperately need to return to work.\nI never explained to anyone why I continued to pump milk for six months.\nNo one was unkind enough to ask.\nThey sent us the first pictures when she was five. An unsmiling child, looking straight at the camera, unblinking.\nI begin to receive messages from Doug’s lawyers. I delete them. I need to focus, focus.\nDoug received the status updates and read them regularly. I couldn’t. He told me tidbits, however: that Amy had been able to sit up, to move her legs and arms. That Amy had successfully downloaded the program that might help her control her urination. That Amy had connected with her vocal cords—\n“Not Amy,” I finally shouted at him. “Not Amy. Her goddamn implant. The implant. The implant is making all of these goddamn connections!”\nIt is so easy, on a computer, to move a few pixels around, to change an image from sorrow to laughter. So easy to use the programming already there.\nWe got a divorce about two years after that.\nMuch later I heard that attempts had been made to get the children with implants to smile, to make laughing sounds, to move their faces. It had all been abandoned. Emotions were, it seemed, the one thing that a program could not fake, and a face was all emotions. Some of the caretakers at the facility had become physically ill just watching a computer attempt to move their faces.\nOn Ariela’s advice, I switched careers entirely, moving from insurance to marine biology. I focused on the microorganisms in mangrove ecosystems, forgetting, in my kayak, or on my computer, or snorkeling in the mangrove roots, that I had ever had a daughter, that I in some ways still had a daughter. Instead, I had spironemids.\nDoug and I stayed in touch, meeting once a year or so. I went to his wedding, to a small fierce musician named Inari. He met some of the succession of boyfriends I had and disposed of over the years.\nAnd he kept me updated on Amy.\nWhenever he did, I allowed myself to think of my mangroves, disappearing into them, into the images I created of spironemids racing up and down the mangrove roots.\nI receive an email from one of the other parents, one of the few who understands. Their son and his implant have failed; they will be heading to the facility to say goodbye, and put some of the dust of Mars on his hand. “I feel as if we already said this,” says the email. “I feel as if I have to say this every day.”\nI agreed to meet her. At the very least, it might help end Doug’s endless updates, coming at odd intervals through the year. I should have insisted to an end to those in the divorce agreement.\nI made him drive us to the facility, and pay for the hotel stay. In separate bedrooms.\n“One meeting,” I say. “Just one.”\n“No.”\n“I’m her mother,” I manage. I remember Ariela’s words. “I have to say good-bye.”\n“Hello,” came a voice.\nSomething was wrong with that voice, terribly wrong, but I could not pinpoint the problem.\n“Hello,” I managed back.\n“Should I enter?”\n“Yes,” said Doug.\nAnd she stepped into the light.\nDoug’s features. My mother’s hair. My eyes.\nOur daughter. And yet, not our daughter.\nIt—she?—stepped forward with small, efficient movements, as if every step was carefully measured—which, I realized in shock, was actually what was happening. The face—Doug’s nose, his chin, in her face—was extraordinarily, perfectly still. Her hands brushed the chair in front of her, and she sat. The motion—I tried to find words for it, and then realized. She was not moving the way a human would. She was moving the way a computer thought a human would move.\nShe has an individual implant, my daughter. It can still be accessed, still be reprogrammed at the will of the facility. Doug and I have no rights over this, cannot stop the facility from turning her into whatever it wishes. That was part of the agreement we signed, to keep her alive.\n“Hello,” Doug said, his voice remarkably steady under the circumstances.\nThe face turned towards him. “Hello,” it repeated. Its eyelids blinked, rapidly.\nIt’s processing, I thought. They had warned us of that facial tic, programmed to allow others to tell when the implants needed to pause to process.\nI was going to throw up. I knew it. I stood, wobbled, and pushed my way out of the door, not sure I could even make it to the nearest bathroom, feeling the floor rock beneath him. Behind me I heard Doug say something, but I could not be sure if he was talking to me or Amy.\nAmy.\nI am in the middle of finishing up a presentation for an important conference when the email arrives. Doug, of course, telling me that he has contacted people in the facility, who say that Amy is not completing all of her programmed tasks, that she is instead sitting at a window staring up into a sky.\nThat sounds most unlike Amy. I have never known her to stare at anything.\nI threw up, again, and again, then leaned against the toilet for a while, body shaking.\nThe second meeting went better.\nI refused to think of it as my daughter, as anything remotely related to me, even if its eyes were the same color as mine. Oddly, what helped was the voice, the same voice that had made me so sick. I had never heard anything like it; the “computer” voices I’d heard before were either the recorded voices of actors, or clearly mechanical synthesized sounds that had never approached human vocal cords. This—this was different; the sound of a mechanical voice pushed through human vocal vocals, precise, emotionless, flat, with no accent that I could think of. At Doug’s request, it demonstrated fifty languages for us, all with that same precise flatness. It explained how it spent its day, in regular exercise and eating and downloading. I watched the eyelids blink each time it answered our questions.\nI signed the papers.\n“Thank you,” it said.\nI find myself wondering what she is thinking. If she is thinking. Can she think? She is programmed to process, to sift, to keep herself alive while analyzing vast amounts of data and transmitting it back to computers for further analysis.\nI know she cannot see the stars. But I cannot stop wondering if she looked at them anyway, in those quiet hours between the Earth and Mars. If something in her looked at them. I clench my fists and rub them against my legs.\nWe made other visits before the launch. She had downloaded more languages, which she demonstrated for us. She did not listen to music, but could list off every song and album from any artist I named, knowing the exact length of each song, the record company, and where it was produced.\nShe could not use my daughter’s eyes to see. But a million million images had been downloaded into her brain, including mine. She navigated by touch and utter precision, and had been updated with the very latest in voice recognition software.\nWe arranged to meet her outside. For some reason, this seemed more natural, easier on both of us. I could not tell if this affected her or not. But when we were outside, she sometimes turned her face to the sky.\nAfter she left for Mars, I almost forgot about her.\nAlmost.\nI receive an urgent email from the facility. It is not an update on Amy’s medical condition. It is a request, typed by her and signed with her electronic thumbprint. In it, she asks that we authorize her return to Mars.\n“She says she wants to go,” I tell Doug.\nI cannot believe that I am saying this, that I am the one arguing for her, that I am the one saying that she—an implant, a computer, should be allowed to make her own decisions.\n“You said it yourself. She’s a computer program. She can’t want anything.”\nMy voice is barely a whisper. “Maybe she wants this.”\nIt would be easier to have Amy away from here, on a spaceship, or on Mars.\nI do not think that is why I am arguing for her to leave. But I cannot be sure.\nAfter the launch, people found us—all of us, every parent that had given, donated, lost a child to the implant program. We got calls, emails, tweets, comments. Hellish. I had to slam my sites down, only to find myself stalked at work and home by media, by religious zealots, by advocates of one side or another. People who thought I had done the right thing, people who thought I was the living embodiment of evil. I changed my name, my address.\nMy colleagues would not meet my eyes at biological conferences. I understood; I had, in a way, created Frankenstein’s monster, or at least consented to it. And it was easier to handle than their curiosity would have been.\nI sometimes imagine breaking into that facility, and wiping away all of its computers with a single program, or perhaps just taking an axe to its servers. (My practical mind whispers that with a program like this, the facility must have multiple backups in multiple places, but my imagination will not be silenced.) I imagine the implants twitching in response, the bodies falling into heaps on the ground, puppets suddenly cut from their strings.\nI imagine putting flowers on a gravestone, and weeping.\nMy eyes remain dry.\nDoug insists on another visit.\n“You look terrible,” he tells her.\nAmy does not respond. To me, she has never looked well, even when she has looked fit. But looking at her closely, I see she is less fit, less trim, than when she originally emerged from the ship and headed into the facility without talking to us. She looks slightly—loose, if that makes sense. Perhaps her programming has not adjusted to the gravity, or perhaps she is merely getting old. I realize with a shock that she is middle aged by now, and even regularly programmed exercise can only do so much, especially when combined with the radical changes in gravity she has been undergoing.\nA shock because of her unlined face, her almost childlike skin. Any dermatologist claiming that wrinkles are an inevitable part of aging, and not a result of emotion and stress, should take a look at her face. She does not even have lines between her cheek and her mouth, or around her eyes.\nThe hollow part inside me rises up again, swallowing me, and I am at a loss for words.\nDoug is right about something else as well. I cannot pinpoint it, but since she has returned, something is . . . missing.\n“How can we tell them that you are physically able to make the trip?” asks Doug.\n“I am programmed with a word,” my daughter says, in the flat, toneless voice that no human vocal cords should ever make. “The word is lie.”\nWhen she left for Mars, I did not watch her leave. I stayed on my computer, modeling, modeling, writing, writing, drafting, organizing, too lost in my work and my words to catch the faintest roar of burning engines, the faintest cheers that humans—well, humans of a sort—were headed to Mars at last.\nAt my request, a nurse arranges one more meeting, in one of the gardens on the edge of the facility.\nWhen I arrive, it—Amy—my daughter—is facing into the sky, eyes unblinking. It is the first time, I realize, that I have ever seen her focused on anything.\n“This is not my programming,” she says.\nIt is so easy to sign documents, to watch those documents get swallowed up in a machine.\nWhen I tell this story, I can see its events taking place, one after another, as inexorably as life and death.\nWhen I remember this story, I can feel myself holding my daughter, my baby, and rocking her back and forth, a moment that has never quite stopped.\nI dream of giving Amy a doll, a doll covered in wires and strings. I help her cut the strings. But with each string I cut, another wire grows on Amy’s head, until she is held in place, unable to move.\nShe is alive, I think. She breathes. She moves. She processes. She communicates. She knows the songs and titles of every album published since the invention of those old phonographs.\nShe is alive.\nI think.\nThis time, I watch the launch, from ten miles away, on a comfortable beach chair, surrounded by loud beachgoers and picnickers. And children. Hordes of children, all seemingly determined to out-scream each other as they leap in and out of the waves.\nI have my net radio on, with the broadcasters comparing this to the old moon and shuttle launches that I have seen only in documentaries and history shows. I cannot focus on their words, although I try. I can only look at the endless blue of the sky, keep my eyes trained on the spot where a golden flame will soon be lifting into a sky.\nThe countdown starts. I stand.\nIt is more beautiful, this launch, than anything I could have expected, a bright golden streak against the sky, trailing steam and mist behind it. And I am crying, crying, as the gold hits my eyes, as if the flame is burning through me. I feel it traveling through my eyes, my arms, my chest, feel it burning in the hollow place inside, the hardened still place that has been my center for thirty-three years. I feel it burning, splitting, fading. Tonight, I promise myself, tonight, I will watch the stars, and imagine what it is like to be moving towards them.\nMari Ness lives in central Florida with two cats who think her fingers should spend less time on a keyboard and more time in their fur. Her fiction and poetry have previously appeared in numerous print and online publications, including Fantasy Magazine, Ideomancer, Daily Science Fiction, and Shine: An Anthology of Optimistic Science Fiction. On Thursdays, she blogs about classic works of children's fantasy literature over at Tor.com. You can also follow her on Twitter at mari_ness.", "source": "https://clarkesworldmagazine.com/ness_02_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: And the Hollow Space Inside by Mari Ness"}