{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Octavia Cade", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "xAtFAxd9nBR2oGSnjzRK98IV+bM=", "id": null, "license": null, "comments": "", "raw_text": "4100 words, short story  Crown of Thorns  Acanthaster planci.  Home was the poison infestation of starfish, the bleaching acres of coral. Home was vast stretches of warm ocean currents with schools beneath, and colonies.  Home was a laboratory where all the concerns were popular. The Crown of Thorns invasion, their numbers out of control and crowding out the reef systems, the unending march of predation turning an ecology to wasteland, and that ecology already vulnerable.  “We can’t do it anymore.” Apocalypse had left a dozen scientists stranded on a reef laboratory—stranded by choice more than compulsion, because there were boats available, research vessels that could have taken them to the mainland if there had been anything left to go back to. The lab was at least familiar, with the advantage of solar power and fishing equipment. No one would go hungry, but for people defined by their intelligence, by the career choice of science and of conservation, there was more than physical hunger to satisfy.  “We’re outnumbered,” said Mel. “And anyway, there’s no one left to report to.” There’d been nothing but silence from the university for months, and silence in the new world, the world defined by plague and absence, could only mean one thing. “It was only a pilot program anyway.” The desperate attempt to clear and monitor a small patch of ocean, to see if intervention could lead to recovery. Diving again and again, in clear warm water with spikes beneath, with stars, and so focused on seabeds and the possibility of resurrection that the other destruction taking place had seemed a distant thing, unnoticed at first, or at least not taken seriously until the silence began to spread, to became too monstrous to be ignored.  “They’re just going to keep coming.” He’d thought it a horror, right from the first. They couldn’t even move that fast, those bloody starfish, but there were so many of them, and they just kept coming. Inexorable. Appetite in symmetry, and better at breeding than anything they wanted to eat—which was most of what they could get their arms around. Most people who visited the reef thought of appetite in terms of sharks, of the collision of teeth and flesh from below, hunger rising from the depths to breach and tear. They never saw it spreading like a desert over the ocean floor, destruction from a hundred thousand tiny mouths and more.  “Andrew.” Mel in front of him, moving with his eyeline so that he had to look at her. He’d close his eyes but it wouldn’t make a difference. She’d still be there, and their daughter, made in her mother’s image, would still be gone. “Andrew. We can’t go on like this.”  It had been a blessing at first, the ability to carry on. There was something vocational in it, the necessity of purpose. Apocalypse had come but their remit remained: conservation. Preservation, though who there was to preserve the reef for now was debatable. “For all we know there’s no one left but us!” But the alternative was sitting round the giant scarred table in the shared kitchen, sinking into their own separate silences, a dozen of them, and rudderless. It had been shared instinct that kept them all going, the science something to put their backs against. Something to cling to, something that still made sense.  He should have known that small mercy could never have lasted.  “We’re not doing it for us,” he said.  “We’re not doing it for fucking anyone, mate,” said Trevor. He was the youngest of them all, his idealism turned sooner to salt than the rest. “There’s no one bloody left, except for the Kiwis.” And that was the crux of the matter. A little island alone, and they could pretend that what they did had value, that there was purpose in the continuation of the work, some sense of dignity that, as a community, they hadn’t fallen apart. The mythology of Australian apocalypse said that they should have done; said that there should be conflict and factions, the wide expanse of horizon illuminated by dust instead of ocean. There was pride in acting otherwise, a sense of culture and structure come from science and self-respect and the refusal to look closely at the monstrous abandonment of apocalypse.  It was a refusal that had served them well, for the most part, until the signals began to come through, the sign of societal remnants other than theirs. Isolated groups, coming together on a southern peninsula and they were scientists too—a scattered population of fieldworkers quarantined by vocation and saved thereby.  The knowledge that others existed had torn the thin pretense of their own survival apart. Stay or go was a choice that held little difficulty when “go” meant a life alone, a continent full of bodies the only escape from a reef built of coral and corpses, the remains of ocean-dwelling fragments more attractive than anything they could find ashore. But when “go” was a viable option, when it held the possibility of a community capable of more than eking out the last few decades of life, the debate had become more complex.  “Why can’t they come here? I know they’re the bigger group, but surely a base is better here.” In the warmth, where food grew easily and fish was easy to come by.  “Otago’s not Antarctica, Andy,” said Mel. It was colder than the reef but still easily arable, still well able to support a population much larger than theirs.  “I knew a girl when I was in Sydney,” she said. “Come across the ditch for an internship. She practically stripped her own bed every night before climbing into it looking for snakes, spiders, all that shit. In the middle of the bloody city! I tried to tell her she was over-reacting . . . ” but she’d come from a country much kinder in its ecology, less toxic, less lethal, and she wasn’t much interested in being persuaded. “She did a lot of tramping. Said she liked the fact that at home she could go for a walk in the bush and the only thing to kill her would be her own stupidity.”  “There’s as much stupidity in exaggerating danger as there is in ignoring it,” he said. There were sharks on the reef, he’d seen them, and some were big enough to kill him if they wanted to. He’d swum with them—not without a certain amount of wariness, and never at the dangerous times of sunrise, or sunset—but if he’d let the idea of sharks take him over then he’d never have dived at all.  “They’re not going to leave their home just so that we don’t have to leave ours.”  It was a mistake they’d made before. A mistake that had kept them all alive—if it was life, subsisting on the fringe of a collapsing ecosystem and cut off from the past by apocalypse.  That apocalypse had happened so quickly; the plague a bright and burning thing. It consumed the population, chewing through flesh and blood and bone and the rate of infection was so immense, the mortality so complete.  Andrew dreamed of his daughter, eaten up by fever, made dull and lank, crumbling under infection, the colonization of bad bacteria. In his dreams he couldn’t touch her. In his dreams she was eaten by starfish, covered with Crowns of Thorns, and silent under the spiny blanket of them until nothing was left but skeleton. In his dreams she never even screamed.  He was the one who screamed, waking in a bed heavy with sweat, beside a wife who had put sleep behind her because she could no longer stand what sleeping brought her.  “Do you think we should have gone to her?” he said, the covers thrown off them both and the sound of water lapping beneath windows.  “Civil Defense said if you’re not infected, stay quarantined,” said Mel. It was an old argument. They’d both been skeptical; and the transmissions now were automatic, mechanical repetition over channels.  “If we go to the mainland we’ll die,” she’d said. “We can’t help her if we’re dead. If she’s alive she’ll come to us. It’s safer here anyway. She’s a smart kid, she’ll realize that.”  It was a curious mix of practicality and cowardice that they’d never quite forgiven themselves for.  “It’s not cowardice.” Gail was the marine chemist of the bunch, supplementing efforts at sterilization with the analysis of seawater samples. “You can’t let yourself think that way.”  “I can’t help it,” he’d said.  “Learn. For fuck’s sake, this isn’t a movie,” she’d said, big body planted squarely in the door and Andy had remembered she had a brother. A twin brother, and a new nephew. Everyone at the lab had someone. “Don’t be so bloody selfish. There’s so few of us left as it is. You’d be throwing your life away. For nothing.”  For nothing. Because his little girl was already dead—that was the implication, and the probability of such wasn’t just high. It was astronomically high.  “Do you think she’s gone?” he’d said to Mel, when he found her at island’s edge, standing in the water and staring south.  “Yes.”  Andrew had wanted to blame her, afterwards. If only Mel had held onto hope he might have been able to dredge some up himself. He might have gone, tried to find their daughter, or what was left of her. But if grief had twisted up nearly every part of him it had left self-awareness alone—if only, he thought, because it made the grief the harder.  He’d believed Sarah dead as well; believed it in the very bones of him, and for reason.  “I’m sick, Daddy,” she’d texted him. “Don’t come.”  It was the last time he’d heard from her. The cell service went down two days later.  He hadn’t gone. It wouldn’t have made a difference. It was staying that made the difference. It had kept them all alive.  Andrew thought being alive might be enough, even when the new transmission came through. Not everyone agreed.  “So what are we supposed to do? Stay here, like this island is a waiting room? Sun, sand, and starfish till we die? No thanks, mate.” It was different for Trevor. He was young, still, he could more easily picture a future with children in it. For all the presentiments Andy had had with his own daughter, the twenty years of parenthood and practice that her presence made automatic, he found he could no longer picture the future now that he knew she would never be in it.  “You think it’s any different for me?” said Mel. Part of the reason she’d been so insistent on coming to the reef in the first place was the diving. It helped with the hot flushes, the tropic water cool enough even under daylight to mitigate the worst effects of menopause. “You at least could have more kids if you wanted,” she said, and it was the cruelest thing he’d ever heard.  It was too much to expect, he thought, that apocalypse would destroy everything except his marriage. Maybe it was the strain, maybe it was the long silence that stood in the place where their daughter once did. It was hard for any couple to survive the death of a child. The death of everyone else didn’t make it any easier, and that, perhaps, was the biggest betrayal so far. He could have coped with one disaster. Both at once was too much for any one person.  “There’s nothing here but death,” said Gail. “I know that you know that.”  “Just because it’s easy for you to leave doesn’t mean it’s easy for me,” he said. Practically, she was right. Even if they all stayed, twelve wasn’t enough to build a new society. There’d be a handful of children born, perhaps, but as a group age and genetics were against them. More likely it’d be a slow decline, the small population thinning down one by one as the starfish ate up the reef around them.  It was a home that couldn’t last, the laboratory—but it was home yet, and his presence there his daughter’s dying wish, that he could make and keep a future in it.  Home. That’s what it came down to. The ability to build a life, to retain it—or to make it in other places. To reset expectations, to come to love different colors and different horizons. He’d always thought of scientists as having a strange mix of idealism and pragmatism, a trusting reliance on method, but it still surprised him how many were willing to go.  Apocalypse had burned away nostalgia.  “It surprises me how many are willing to stay,” said Mel. There was an eight to four split in favor of migration—but it was also an argument that could be considered slowly, and more than one person had changed their mind, had decided to stay or go when they wouldn’t before.  Opinions, on the reef, flowed like the tides.  The Crowns of Thorns came and died and kept coming. Andy could kill over a hundred an hour and still more of them came: a toxic, carnivorous collection of spines, blind hunger given hideous form. It was funny—as a kid, growing up by the beach, he’d liked starfish, had thrown them back into the water when he could. Not the same species, nothing prickly that could ever hurt him, and he’d wandered through rock pools and tidal estuaries and reef fringes and that was what had decided him on his vocation: the breadth of life, the way the underwater bloomed.  If someone had told him then that one day, the only thing keeping him sane would be the ability to dissolve starfish from the inside out, he would have kicked sand in their face. It didn’t seem a biologist’s job, somehow, the wholesale slaughter of a species.  It turned out, comparatively, that his ability to slaughter was mediocre at best. If apocalypse had done nothing else, it had taught him incompetence.  He couldn’t kill enough to save anything.  He couldn’t save anything anyway.  Incompetence didn’t stop him diving. As long as he didn’t let himself think about scales of destruction he was all right with the futility associated with the minor acts of it.  “In a way I wish they were harder to kill,” he said. There was something particularly bloodless about injection—a quick stab of sodium bisulfate, deadly to Crown of Thorns but having no effect on the surrounding reef—and it was over. The store of bisulfate was running low, but he could substitute with vinegar. The acid dissolved them from the inside out, which in another life had revolted him but now didn’t seem anywhere near spiteful enough.  “You think you’ll feel better dismembering them?” said Trevor.  Dismembering was inefficient. Sometimes the limbs grew back, and when they did die it took ten times as long to kill them as it did with injections.  He knew. He’d tried. Grief punctuated itself with anger, and he’d collected starfish in sacks, once, brought them to surface and shore and hacked them to death with a machete. It was harder than he’d thought, more exhausting, and Trevor had found him up to his elbows in blood, screaming at consumption and fever.  “For fuck’s sake, it’s not their fault,” he’d said, wrestling the machete away before Andrew hurt himself with it. “They’re only bloody starfish.”  Starfish that ate and ate and ate, that bred and swarmed and consumed everything. Everything.  Andy was so damn tired of having nothing left.  “I’m nothing now, am I?” said Mel.  He didn’t know what she was. He just knew it wasn’t enough.  “You think if you can save the reef it’ll make up for Sarah,” she said.  “Mel. We didn’t even try.”  She was their daughter and they hadn’t even tried.  “Do you honestly think we could have saved her?” she said.  Truth was, he didn’t. She was halfway across a continent, and they would have died before getting to her.  “It’s not fucking fair,” he said. He should have felt foolish when he said it, but instead he just felt bitter. Fairness, under apocalypse, was the first thing to go.  “I see her here all the time,” he said.  “But she was hardly ever here. It was only the once,” said Mel. They’d both sacrificed extensive fieldwork when Sarah had been at high school, had preferred to give her parents who were stable and present. It was only after she’d gone to university herself that the two of them had come to the reef. “From raising to grazing,” he’d said at the time, his focus changing from school runs to starfish. Sarah, embedding herself in the theater department of her chosen university, had never really come out of it again. She’d visited the lab briefly, spent a couple of days on the island sunbathing and diving herself, but found the Crown of Thorns off-putting.  “Lots of people do,” he’d said then, but what he said now was different. “I remember her here,” he said, and it was true. There wasn’t a lot to remember—she’d not been there long enough, and the same few simple images repeated on him until he could almost see her embedded in the landscape, could almost feel her in the water behind him. Could almost see her face wrinkle up beneath the diving mask—the distaste for starfish, the spreading, spiny blanket eating its way across the seafloor. “Horrible little monsters,” she’d called them, and keeping those monsters in front of his face kept hers before him as well.  He dived now more often than he did before. Said it was because he felt it gave him a purpose, even if that purpose was a doomed one. The truth was he remembered her more clearly beneath the waves, and in the cool pressure of the water it sometimes felt as if apocalypse was only a dream, and if he looked behind him she’d be there, swimming along behind.  “Don’t you ever feel that way?” It was a conversation they’d never had, him and Mel. At first it was because grief was a devouring thing. It pricked him all over; it ate him up. If hope was a thing with feathers then grief came with thorns, with a fever-multitude of arms and it left a scalded, scouring wasteland behind it.  A conversation they’d never had, until the prospect of leaving their daughter’s ghost behind drew specters of another sort. “Don’t you ever see her here?” he said.  “I don’t want to see her,” said Mel. “I don’t want to see those bloody starfish either. Not anymore. I’m sick of the sight of them.” They were the representation of failure—for the two of them had failed. As conservationists, as parents. Their child was dead and the reef was overrun, and there was nothing they could do to change either of those things. “There’s nothing left for us here,” she said.  Nothing left for you, Andrew thought. It was a cruel thought, so he didn’t say it aloud, but he didn’t understand—couldn’t understand—why she’d give up the last connection, why she’d want to go to a place that hadn’t heard Sarah laugh, somewhere she hadn’t swum or sunned or chattered.  “It’s too isolated here,” said Mel. “There’s too much time to think. I don’t want to think. I need something to do.”  “Come kill Crowns with me then,” he said.  “Do you really think it’ll make a difference?” she said.  Andy knew it made no difference at all.  He went anyway. Starfish stretched before him—dozens of them, hundreds. It didn’t matter how many he killed; they just kept coming.  “I’m worried about you.” It was a bald declaration, and all it made him want to do was laugh. Out of disbelief, mostly, because that was the death-knell of their marriage right there, in the spaces between things unsaid.  “That’s not worry you’re feeling, that’s guilt,” he said.  “I’m capable of feeling both at once.”  “So you’ve decided, then?” The destruction of their life together was a simple thing, in the end. The loss of a continent, of a child, had been almost operatic in its emotionalism. There’d been tears and grief and screaming, arguments for leaving and at last the decision to stay, clinging to each other for absolution and then the drifting apart when none came. The end, when it came, was almost sedate.  “I’m not staying here,” said Melanie. “It’s not a life. Just a slow winding down. I can’t stand that. Not forever.”  “I don’t have the energy to rebuild a civilization,” he confessed. “It seems so pointless. There’s so little left. I just want to let it go . . . ” To watch the end of the world with as much grace as he could muster. It wasn’t a lot, but there was a certain peace in it, in no longer having to fight. In letting the grief overwhelm him until he was so saturated with it that the weight of it became easier, and familiar.  “I don’t know how to live without it,” he said, of that overpowering, crippling grief. “And Mel, I don’t think I want to. I don’t think I can.”  “Do you think it’s any different for me?” she said, and he could see their daughter in the shape of her cheekbones, the color of her eyes.  He knew that it wasn’t.  “I thought we’d fight about it,” he said. They were at the table, facing each other across and he reached out for her, held her hand in his own and felt the quiet amazement well up in him, the disbelief.  Mel just looked at him, the skin under her eyes showing the bruises they had had for months. “What good would it do?” she said.  After the bang, apocalypse lingered on in whimpers.  In the end he was the only one who chose to remain, the other hold-outs relenting in the face of abandonment. “I’m not happy about this,” said Trevor. “You stubborn old sod. Why do you have to stay?”  “Because I do,” said Andy.  Trevor sighed. “I’m coming back for you,” he said. “In a year. I don’t know if it’ll make a difference, but I don’t like the idea of you changing your mind once we’ve all buggered off. So if you do change your mind, hack it out for a year.”  “Don’t let it beat you,” he said.  Mel didn’t say anything. Their goodbyes had been long ones, a series of shattered splinters over time. Apocalypse had beaten them both together, he thought. They might survive it better apart.  “Kill some starfish for me,” she said. “Kill as many as you can if it makes you feel better.”  After they left Andy watched the boat until he could no longer see it. He didn’t expect to cry, so he didn’t.  He didn’t really feel any more hollow than before. The last man in Australia, the last that he knew of anyway, and all he could think was that it could have been worse. It seemed he was at his capacity for pain—had settled into a state of numbness that might have been disconcerting if he’d retained the ability to react to horror. Apocalypse had eaten that out of him, had swarmed through his flesh, over his skin, and the consumption had been monstrous but he had lived through it.  The lab held all the memories he could cope with. He didn’t see Mel in shadows, or out of the corner of his eye. Sometimes he saw Sarah. It wasn’t, for the most part, enough—but it was familiar. It was something he was used to. That’s what the reef was, after all: the remains of dead things, a skeletal architecture with the soft parts gobbled up, and the gobbling was going on regardless of what happened at shores and above surfaces.  That he was capable, still, of diving down to starfish and slaughtering them gave structure to his days, a sense of purpose if only a false one. There were too many; their hunger was too great. And he was one man alone, and he made no difference. The reef was turning to wasteland around him, the coral breaking down in the face of endless consumption and he couldn’t bear to see it and do nothing, couldn’t stand by again in helplessness while something he loved was devoured.  “Nothing should eat up what you do,” he said.  He fed his wedding ring to a Crown of Thorns, forced it into flesh and watched the spiny little bastard engulf it whole.  “Hope you choke on it, mate,” he said. Octavia Cade is a New Zealand writer. She has a PhD in science communication, and is currently occupied writing climate fiction and writing about urban ecology. She’s won four Sir Julius Vogel awards, and was the 2020 writer in residence at Massey University. Her latest book, The Impossible Resurrection of Grief, was published in 2021 by Stelliform Press.", "text": "4100 words, short story\nCrown of Thorns\nAcanthaster planci.\nHome was the poison infestation of starfish, the bleaching acres of coral. Home was vast stretches of warm ocean currents with schools beneath, and colonies.\nHome was a laboratory where all the concerns were popular. The Crown of Thorns invasion, their numbers out of control and crowding out the reef systems, the unending march of predation turning an ecology to wasteland, and that ecology already vulnerable.\n“We can’t do it anymore.” Apocalypse had left a dozen scientists stranded on a reef laboratory—stranded by choice more than compulsion, because there were boats available, research vessels that could have taken them to the mainland if there had been anything left to go back to. The lab was at least familiar, with the advantage of solar power and fishing equipment. No one would go hungry, but for people defined by their intelligence, by the career choice of science and of conservation, there was more than physical hunger to satisfy.\n“We’re outnumbered,” said Mel. “And anyway, there’s no one left to report to.” There’d been nothing but silence from the university for months, and silence in the new world, the world defined by plague and absence, could only mean one thing. “It was only a pilot program anyway.” The desperate attempt to clear and monitor a small patch of ocean, to see if intervention could lead to recovery. Diving again and again, in clear warm water with spikes beneath, with stars, and so focused on seabeds and the possibility of resurrection that the other destruction taking place had seemed a distant thing, unnoticed at first, or at least not taken seriously until the silence began to spread, to became too monstrous to be ignored.\n“They’re just going to keep coming.” He’d thought it a horror, right from the first. They couldn’t even move that fast, those bloody starfish, but there were so many of them, and they just kept coming. Inexorable. Appetite in symmetry, and better at breeding than anything they wanted to eat—which was most of what they could get their arms around. Most people who visited the reef thought of appetite in terms of sharks, of the collision of teeth and flesh from below, hunger rising from the depths to breach and tear. They never saw it spreading like a desert over the ocean floor, destruction from a hundred thousand tiny mouths and more.\n“Andrew.” Mel in front of him, moving with his eyeline so that he had to look at her. He’d close his eyes but it wouldn’t make a difference. She’d still be there, and their daughter, made in her mother’s image, would still be gone. “Andrew. We can’t go on like this.”\nIt had been a blessing at first, the ability to carry on. There was something vocational in it, the necessity of purpose. Apocalypse had come but their remit remained: conservation. Preservation, though who there was to preserve the reef for now was debatable. “For all we know there’s no one left but us!” But the alternative was sitting round the giant scarred table in the shared kitchen, sinking into their own separate silences, a dozen of them, and rudderless. It had been shared instinct that kept them all going, the science something to put their backs against. Something to cling to, something that still made sense.\nHe should have known that small mercy could never have lasted.\n“We’re not doing it for us,” he said.\n“We’re not doing it for fucking anyone, mate,” said Trevor. He was the youngest of them all, his idealism turned sooner to salt than the rest. “There’s no one bloody left, except for the Kiwis.” And that was the crux of the matter. A little island alone, and they could pretend that what they did had value, that there was purpose in the continuation of the work, some sense of dignity that, as a community, they hadn’t fallen apart. The mythology of Australian apocalypse said that they should have done; said that there should be conflict and factions, the wide expanse of horizon illuminated by dust instead of ocean. There was pride in acting otherwise, a sense of culture and structure come from science and self-respect and the refusal to look closely at the monstrous abandonment of apocalypse.\nIt was a refusal that had served them well, for the most part, until the signals began to come through, the sign of societal remnants other than theirs. Isolated groups, coming together on a southern peninsula and they were scientists too—a scattered population of fieldworkers quarantined by vocation and saved thereby.\nThe knowledge that others existed had torn the thin pretense of their own survival apart. Stay or go was a choice that held little difficulty when “go” meant a life alone, a continent full of bodies the only escape from a reef built of coral and corpses, the remains of ocean-dwelling fragments more attractive than anything they could find ashore. But when “go” was a viable option, when it held the possibility of a community capable of more than eking out the last few decades of life, the debate had become more complex.\n“Why can’t they come here? I know they’re the bigger group, but surely a base is better here.” In the warmth, where food grew easily and fish was easy to come by.\n“Otago’s not Antarctica, Andy,” said Mel. It was colder than the reef but still easily arable, still well able to support a population much larger than theirs.\n“I knew a girl when I was in Sydney,” she said. “Come across the ditch for an internship. She practically stripped her own bed every night before climbing into it looking for snakes, spiders, all that shit. In the middle of the bloody city! I tried to tell her she was over-reacting . . . ” but she’d come from a country much kinder in its ecology, less toxic, less lethal, and she wasn’t much interested in being persuaded. “She did a lot of tramping. Said she liked the fact that at home she could go for a walk in the bush and the only thing to kill her would be her own stupidity.”\n“There’s as much stupidity in exaggerating danger as there is in ignoring it,” he said. There were sharks on the reef, he’d seen them, and some were big enough to kill him if they wanted to. He’d swum with them—not without a certain amount of wariness, and never at the dangerous times of sunrise, or sunset—but if he’d let the idea of sharks take him over then he’d never have dived at all.\n“They’re not going to leave their home just so that we don’t have to leave ours.”\nIt was a mistake they’d made before. A mistake that had kept them all alive—if it was life, subsisting on the fringe of a collapsing ecosystem and cut off from the past by apocalypse.\nThat apocalypse had happened so quickly; the plague a bright and burning thing. It consumed the population, chewing through flesh and blood and bone and the rate of infection was so immense, the mortality so complete.\nAndrew dreamed of his daughter, eaten up by fever, made dull and lank, crumbling under infection, the colonization of bad bacteria. In his dreams he couldn’t touch her. In his dreams she was eaten by starfish, covered with Crowns of Thorns, and silent under the spiny blanket of them until nothing was left but skeleton. In his dreams she never even screamed.\nHe was the one who screamed, waking in a bed heavy with sweat, beside a wife who had put sleep behind her because she could no longer stand what sleeping brought her.\n“Do you think we should have gone to her?” he said, the covers thrown off them both and the sound of water lapping beneath windows.\n“Civil Defense said if you’re not infected, stay quarantined,” said Mel. It was an old argument. They’d both been skeptical; and the transmissions now were automatic, mechanical repetition over channels.\n“If we go to the mainland we’ll die,” she’d said. “We can’t help her if we’re dead. If she’s alive she’ll come to us. It’s safer here anyway. She’s a smart kid, she’ll realize that.”\nIt was a curious mix of practicality and cowardice that they’d never quite forgiven themselves for.\n“It’s not cowardice.” Gail was the marine chemist of the bunch, supplementing efforts at sterilization with the analysis of seawater samples. “You can’t let yourself think that way.”\n“I can’t help it,” he’d said.\n“Learn. For fuck’s sake, this isn’t a movie,” she’d said, big body planted squarely in the door and Andy had remembered she had a brother. A twin brother, and a new nephew. Everyone at the lab had someone. “Don’t be so bloody selfish. There’s so few of us left as it is. You’d be throwing your life away. For nothing.”\nFor nothing. Because his little girl was already dead—that was the implication, and the probability of such wasn’t just high. It was astronomically high.\n“Do you think she’s gone?” he’d said to Mel, when he found her at island’s edge, standing in the water and staring south.\n“Yes.”\nAndrew had wanted to blame her, afterwards. If only Mel had held onto hope he might have been able to dredge some up himself. He might have gone, tried to find their daughter, or what was left of her. But if grief had twisted up nearly every part of him it had left self-awareness alone—if only, he thought, because it made the grief the harder.\nHe’d believed Sarah dead as well; believed it in the very bones of him, and for reason.\n“I’m sick, Daddy,” she’d texted him. “Don’t come.”\nIt was the last time he’d heard from her. The cell service went down two days later.\nHe hadn’t gone. It wouldn’t have made a difference. It was staying that made the difference. It had kept them all alive.\nAndrew thought being alive might be enough, even when the new transmission came through. Not everyone agreed.\n“So what are we supposed to do? Stay here, like this island is a waiting room? Sun, sand, and starfish till we die? No thanks, mate.” It was different for Trevor. He was young, still, he could more easily picture a future with children in it. For all the presentiments Andy had had with his own daughter, the twenty years of parenthood and practice that her presence made automatic, he found he could no longer picture the future now that he knew she would never be in it.\n“You think it’s any different for me?” said Mel. Part of the reason she’d been so insistent on coming to the reef in the first place was the diving. It helped with the hot flushes, the tropic water cool enough even under daylight to mitigate the worst effects of menopause. “You at least could have more kids if you wanted,” she said, and it was the cruelest thing he’d ever heard.\nIt was too much to expect, he thought, that apocalypse would destroy everything except his marriage. Maybe it was the strain, maybe it was the long silence that stood in the place where their daughter once did. It was hard for any couple to survive the death of a child. The death of everyone else didn’t make it any easier, and that, perhaps, was the biggest betrayal so far. He could have coped with one disaster. Both at once was too much for any one person.\n“There’s nothing here but death,” said Gail. “I know that you know that.”\n“Just because it’s easy for you to leave doesn’t mean it’s easy for me,” he said. Practically, she was right. Even if they all stayed, twelve wasn’t enough to build a new society. There’d be a handful of children born, perhaps, but as a group age and genetics were against them. More likely it’d be a slow decline, the small population thinning down one by one as the starfish ate up the reef around them.\nIt was a home that couldn’t last, the laboratory—but it was home yet, and his presence there his daughter’s dying wish, that he could make and keep a future in it.\nHome. That’s what it came down to. The ability to build a life, to retain it—or to make it in other places. To reset expectations, to come to love different colors and different horizons. He’d always thought of scientists as having a strange mix of idealism and pragmatism, a trusting reliance on method, but it still surprised him how many were willing to go.\nApocalypse had burned away nostalgia.\n“It surprises me how many are willing to stay,” said Mel. There was an eight to four split in favor of migration—but it was also an argument that could be considered slowly, and more than one person had changed their mind, had decided to stay or go when they wouldn’t before.\nOpinions, on the reef, flowed like the tides.\nThe Crowns of Thorns came and died and kept coming. Andy could kill over a hundred an hour and still more of them came: a toxic, carnivorous collection of spines, blind hunger given hideous form. It was funny—as a kid, growing up by the beach, he’d liked starfish, had thrown them back into the water when he could. Not the same species, nothing prickly that could ever hurt him, and he’d wandered through rock pools and tidal estuaries and reef fringes and that was what had decided him on his vocation: the breadth of life, the way the underwater bloomed.\nIf someone had told him then that one day, the only thing keeping him sane would be the ability to dissolve starfish from the inside out, he would have kicked sand in their face. It didn’t seem a biologist’s job, somehow, the wholesale slaughter of a species.\nIt turned out, comparatively, that his ability to slaughter was mediocre at best. If apocalypse had done nothing else, it had taught him incompetence.\nHe couldn’t kill enough to save anything.\nHe couldn’t save anything anyway.\nIncompetence didn’t stop him diving. As long as he didn’t let himself think about scales of destruction he was all right with the futility associated with the minor acts of it.\n“In a way I wish they were harder to kill,” he said. There was something particularly bloodless about injection—a quick stab of sodium bisulfate, deadly to Crown of Thorns but having no effect on the surrounding reef—and it was over. The store of bisulfate was running low, but he could substitute with vinegar. The acid dissolved them from the inside out, which in another life had revolted him but now didn’t seem anywhere near spiteful enough.\n“You think you’ll feel better dismembering them?” said Trevor.\nDismembering was inefficient. Sometimes the limbs grew back, and when they did die it took ten times as long to kill them as it did with injections.\nHe knew. He’d tried. Grief punctuated itself with anger, and he’d collected starfish in sacks, once, brought them to surface and shore and hacked them to death with a machete. It was harder than he’d thought, more exhausting, and Trevor had found him up to his elbows in blood, screaming at consumption and fever.\n“For fuck’s sake, it’s not their fault,” he’d said, wrestling the machete away before Andrew hurt himself with it. “They’re only bloody starfish.”\nStarfish that ate and ate and ate, that bred and swarmed and consumed everything. Everything.\nAndy was so damn tired of having nothing left.\n“I’m nothing now, am I?” said Mel.\nHe didn’t know what she was. He just knew it wasn’t enough.\n“You think if you can save the reef it’ll make up for Sarah,” she said.\n“Mel. We didn’t even try.”\nShe was their daughter and they hadn’t even tried.\n“Do you honestly think we could have saved her?” she said.\nTruth was, he didn’t. She was halfway across a continent, and they would have died before getting to her.\n“It’s not fucking fair,” he said. He should have felt foolish when he said it, but instead he just felt bitter. Fairness, under apocalypse, was the first thing to go.\n“I see her here all the time,” he said.\n“But she was hardly ever here. It was only the once,” said Mel. They’d both sacrificed extensive fieldwork when Sarah had been at high school, had preferred to give her parents who were stable and present. It was only after she’d gone to university herself that the two of them had come to the reef. “From raising to grazing,” he’d said at the time, his focus changing from school runs to starfish. Sarah, embedding herself in the theater department of her chosen university, had never really come out of it again. She’d visited the lab briefly, spent a couple of days on the island sunbathing and diving herself, but found the Crown of Thorns off-putting.\n“Lots of people do,” he’d said then, but what he said now was different. “I remember her here,” he said, and it was true. There wasn’t a lot to remember—she’d not been there long enough, and the same few simple images repeated on him until he could almost see her embedded in the landscape, could almost feel her in the water behind him. Could almost see her face wrinkle up beneath the diving mask—the distaste for starfish, the spreading, spiny blanket eating its way across the seafloor. “Horrible little monsters,” she’d called them, and keeping those monsters in front of his face kept hers before him as well.\nHe dived now more often than he did before. Said it was because he felt it gave him a purpose, even if that purpose was a doomed one. The truth was he remembered her more clearly beneath the waves, and in the cool pressure of the water it sometimes felt as if apocalypse was only a dream, and if he looked behind him she’d be there, swimming along behind.\n“Don’t you ever feel that way?” It was a conversation they’d never had, him and Mel. At first it was because grief was a devouring thing. It pricked him all over; it ate him up. If hope was a thing with feathers then grief came with thorns, with a fever-multitude of arms and it left a scalded, scouring wasteland behind it.\nA conversation they’d never had, until the prospect of leaving their daughter’s ghost behind drew specters of another sort. “Don’t you ever see her here?” he said.\n“I don’t want to see her,” said Mel. “I don’t want to see those bloody starfish either. Not anymore. I’m sick of the sight of them.” They were the representation of failure—for the two of them had failed. As conservationists, as parents. Their child was dead and the reef was overrun, and there was nothing they could do to change either of those things. “There’s nothing left for us here,” she said.\nNothing left for you, Andrew thought. It was a cruel thought, so he didn’t say it aloud, but he didn’t understand—couldn’t understand—why she’d give up the last connection, why she’d want to go to a place that hadn’t heard Sarah laugh, somewhere she hadn’t swum or sunned or chattered.\n“It’s too isolated here,” said Mel. “There’s too much time to think. I don’t want to think. I need something to do.”\n“Come kill Crowns with me then,” he said.\n“Do you really think it’ll make a difference?” she said.\nAndy knew it made no difference at all.\nHe went anyway. Starfish stretched before him—dozens of them, hundreds. It didn’t matter how many he killed; they just kept coming.\n“I’m worried about you.” It was a bald declaration, and all it made him want to do was laugh. Out of disbelief, mostly, because that was the death-knell of their marriage right there, in the spaces between things unsaid.\n“That’s not worry you’re feeling, that’s guilt,” he said.\n“I’m capable of feeling both at once.”\n“So you’ve decided, then?” The destruction of their life together was a simple thing, in the end. The loss of a continent, of a child, had been almost operatic in its emotionalism. There’d been tears and grief and screaming, arguments for leaving and at last the decision to stay, clinging to each other for absolution and then the drifting apart when none came. The end, when it came, was almost sedate.\n“I’m not staying here,” said Melanie. “It’s not a life. Just a slow winding down. I can’t stand that. Not forever.”\n“I don’t have the energy to rebuild a civilization,” he confessed. “It seems so pointless. There’s so little left. I just want to let it go . . . ” To watch the end of the world with as much grace as he could muster. It wasn’t a lot, but there was a certain peace in it, in no longer having to fight. In letting the grief overwhelm him until he was so saturated with it that the weight of it became easier, and familiar.\n“I don’t know how to live without it,” he said, of that overpowering, crippling grief. “And Mel, I don’t think I want to. I don’t think I can.”\n“Do you think it’s any different for me?” she said, and he could see their daughter in the shape of her cheekbones, the color of her eyes.\nHe knew that it wasn’t.\n“I thought we’d fight about it,” he said. They were at the table, facing each other across and he reached out for her, held her hand in his own and felt the quiet amazement well up in him, the disbelief.\nMel just looked at him, the skin under her eyes showing the bruises they had had for months. “What good would it do?” she said.\nAfter the bang, apocalypse lingered on in whimpers.\nIn the end he was the only one who chose to remain, the other hold-outs relenting in the face of abandonment. “I’m not happy about this,” said Trevor. “You stubborn old sod. Why do you have to stay?”\n“Because I do,” said Andy.\nTrevor sighed. “I’m coming back for you,” he said. “In a year. I don’t know if it’ll make a difference, but I don’t like the idea of you changing your mind once we’ve all buggered off. So if you do change your mind, hack it out for a year.”\n“Don’t let it beat you,” he said.\nMel didn’t say anything. Their goodbyes had been long ones, a series of shattered splinters over time. Apocalypse had beaten them both together, he thought. They might survive it better apart.\n“Kill some starfish for me,” she said. “Kill as many as you can if it makes you feel better.”\nAfter they left Andy watched the boat until he could no longer see it. He didn’t expect to cry, so he didn’t.\nHe didn’t really feel any more hollow than before. The last man in Australia, the last that he knew of anyway, and all he could think was that it could have been worse. It seemed he was at his capacity for pain—had settled into a state of numbness that might have been disconcerting if he’d retained the ability to react to horror. Apocalypse had eaten that out of him, had swarmed through his flesh, over his skin, and the consumption had been monstrous but he had lived through it.\nThe lab held all the memories he could cope with. He didn’t see Mel in shadows, or out of the corner of his eye. Sometimes he saw Sarah. It wasn’t, for the most part, enough—but it was familiar. It was something he was used to. That’s what the reef was, after all: the remains of dead things, a skeletal architecture with the soft parts gobbled up, and the gobbling was going on regardless of what happened at shores and above surfaces.\nThat he was capable, still, of diving down to starfish and slaughtering them gave structure to his days, a sense of purpose if only a false one. There were too many; their hunger was too great. And he was one man alone, and he made no difference. The reef was turning to wasteland around him, the coral breaking down in the face of endless consumption and he couldn’t bear to see it and do nothing, couldn’t stand by again in helplessness while something he loved was devoured.\n“Nothing should eat up what you do,” he said.\nHe fed his wedding ring to a Crown of Thorns, forced it into flesh and watched the spiny little bastard engulf it whole.\n“Hope you choke on it, mate,” he said.\nOctavia Cade is a New Zealand writer. She has a PhD in science communication, and is currently occupied writing climate fiction and writing about urban ecology. She’s won four Sir Julius Vogel awards, and was the 2020 writer in residence at Massey University. Her latest book, The Impossible Resurrection of Grief, was published in 2021 by Stelliform Press.", "source": "https://clarkesworldmagazine.com/cade_03_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Crown of Thorns by Octavia Cade"}