{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Leszek Kostuj", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "41HhQsCIyjhjCRMPxVtWDC1CqZM=", "id": null, "license": null, "comments": "", "raw_text": "Cover Art  Master of Reality    Leszek Kostuj was born in Poland (Pleszew) in 1973 and graduated from Pedagogy and Art Department at Adam Mickiewicz University in Poznan.  Although he prefers oil painting, his art spans painting, drawing, and traditional and computer graphics.  \"I started from small realistic drawings, then paintings inspired by surrealism cropped up, and works at the boundary of surrealism and allusive abstraction. My art is in constant change, I am in search of the forms of artistic communication that would be optimal for me.  When I begin to paint, it is quite frequent that I do not ponder over the final effect. Only when on the surface of the painting, the emerging patches, lines, colors begin to coalesce, the imagination rouses and provides an impulse to further artistic release. At this stage of creation, what begins to appear is ideas, visions, and concepts - all in order to create a work that is a fulfillment of my artistic and aesthetic needs.", "text": "Cover Art\nMaster of Reality\nLeszek Kostuj was born in Poland (Pleszew) in 1973 and graduated from Pedagogy and Art Department at Adam Mickiewicz University in Poznan.\nAlthough he prefers oil painting, his art spans painting, drawing, and traditional and computer graphics.\n\"I started from small realistic drawings, then paintings inspired by surrealism cropped up, and works at the boundary of surrealism and allusive abstraction. My art is in constant change, I am in search of the forms of artistic communication that would be optimal for me.\nWhen I begin to paint, it is quite frequent that I do not ponder over the final effect. Only when on the surface of the painting, the emerging patches, lines, colors begin to coalesce, the imagination rouses and provides an impulse to further artistic release. At this stage of creation, what begins to appear is ideas, visions, and concepts - all in order to create a work that is a fulfillment of my artistic and aesthetic needs.", "source": "https://clarkesworldmagazine.com/artbio_03/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Master of Reality by Leszek Kostuj"}