{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "I-Hyeong Yun; Elisa Sinn; Justin Howe", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "eL4hSWrpl7tilu2AnpLvrkpKOhU=", "id": null, "license": null, "comments": "", "raw_text": "9300 words, novelette  The Perfect Sail  “You’re dying,” the stranger told Chang. “To tell you the truth, you have less than a week left to live. I advise you to hasten your decision. If you remain here, you will surely dissolve into nothingness.” Suddenly, her Lu plummeted earthward at frightening speed.  Chang sat, stupefied. The stars and clouds howled as they zoomed beyond the Lu’s faceted eyes. The sky burst open, and the earth rose from the split. They spun as they fell. Again the sky, again the earth, then trees, rocks, and the horizon, one after another, leaping forward and falling back. The Lu’s inner skin tightened across Chang’s chest, and her disheveled hair danced before her eyes. The world’s broken pieces tumbled downward, but they were not beautiful. Not beautiful at all.  Chang managed to recover herself and, stifling a scream, focused her trust in her Lu. Fly, Lu! Fly!  The world rolled violently one last time and then stopped. Chang felt nauseous. When she opened her eyes, everything was calm. Lu’s compound eyes broke the night into hundreds of interlocking hexagons and their wings flapped a slow steady rhythm. A sound so familiar she wouldn’t have noticed it in ordinary times. Chang shifted within the inner skin. Her Lu hovered a mere kruho1 above the ground.  Is this how one’s supposed to feel at the revelation of their death? It’s like my body’s become a hard heavy lump that won’t stop falling and falling. Chang covered her face in her hands, her skin slick with perspiration. She’d never lost her trust in the air like that. And without focus and belief, her Lu couldn’t even move their wings, let alone fly.  The stranger had resembled a human but was most definitely not a Roo like her. They’d stood about two ruhos tall, and had a semitransparent body that shone like thawed moonlight. They’d spoken without moving their lips, in a voice so peculiar Chang found it impossible to describe. She didn’t want to admit it, but the stranger’s words had shaken her to the core.  <Don’t you wish to be perfect?> the stranger had asked her. <Don’t you want to be stronger, better? You’re a fragment separated from your original self and fallen into insignificance. In my world, you could live a colorful and magnificent life, unparalleled. More importantly, you would still live after a week’s time.>  How do I die?  But Chang hadn’t asked the question. For a Roo, death was everywhere. She might be swept away by the wind or caught by an insect and torn to pieces. A human might step on her and she’d be destroyed without even a chance to feel the pain. The stranger with its radiating body had seemed like a divine messenger. But this death sentence from an unknown god had overwhelmed her. Losing control of her Lu in the air and crashing was not a death Chang had imagined. If I die, will Lu die as well? All they had to do was spread their wings toward the sun to sustain themselves. It was Chang’s trust that made them move.  Hovering in midair, she scanned the cream-colored bark-like lining of Lu’s interior. She centered herself and focused her trust. Lu, let’s go back. Lu’s compound eyes relaxed and showed a path stretching before them into the sky. A path created by Chang’s trust. Lu flapped their wings and launched into a smooth glide.  Chang Yeon reclined on a wine-colored armchair and looked around the room. It was more a cozy den than a CEO’s office. A red carpet covered the floor, embroidered with golden Arabic patterns, and cedar bookshelves lined three of the room’s four walls. Energetic footsteps passed in the hall beyond. Even though it was Friday night and her company had just finished one project, the place still bustled like a giant organism that refused to rest. Chang Yeon had asked her secretary to hold all her calls. She smiled with renewed satisfaction. How wonderful it was to have everything move as you commanded? But of course, there was that latest version of herself in that offshoot world far, far away. I wonder why she hesitates, Chang Yeon thought. Her eyes fixed on her hands and she sighed at their sudden unfamiliarity. Was her pale, weak skin actually wilting by the hour, or was she just imagining it?  “She has until tomorrow to decide, but it’s a fifty-fifty chance,” the sailor said in its calm machine voice. “We should have a backup plan prepared since we can’t bring her here against her will. This version may not be our only chance. Although it’s rare, there have been cases when a more suitable version turned up on the morning of the scheduled tuning. Our broadband sail is still ongoing, moving as fast as possible.”  Sailors were not human, but rather beings capable of going against time, jumping the boundaries between dimensions, and sailing through the countless myriad of offshoot worlds. This meant they could go on the perfect sail, or, more precisely, sail to serve their human clients’ yearnings for perfection. The membranes separating offshoot worlds didn’t permit organisms to pass from one to the next, but sailors faced no such obstacles. Their bodies were made of a special alloy that could slip between dimensions.  The sailor exuded a sense of determination not to disappoint a premium client. I waited too long, Chang Yeon thought. Her most recent tuning had been seven years ago. Since then she had requested sails from time to time, but without any real desire. Until now. In two days, she’d turn fifty years old and even in this world of abundance and endless possibilities, it was impossible to avoid the natural order of aging and death. A tuning would therefore be a perfect birthday gift for herself. Her fiftieth tuning for her fiftieth birthday, and to make it happen she’d started the search a year in advance.  Inevitably, the tuning would be rushed. According to the sailor, every human being had a unique “self-structure,” like a single set of fingerprints shared across all of a person’s versions. This self-structure was the backbone of one’s self, all the fundamental elements that existed apart from those created by random chance.  Chang Yeon was lucky. She’d been born with a distinctive self-structure. Not so for most others, whose self-structure signatures were too weak to be detected in the system. Still, Chang Yeon had only been able to find her own versions because each of them was dying. Scientists had discovered that brains secreted a special substance about two to three weeks prior to their deaths, regardless of whether or not the person knew their death was imminent. This substance sharpened one’s self-structure in a way that made it easily detectable. Each time the sailor had found a version on the eve of death, it had forwarded the personal data to Chang Yeon. Chang Yeon barely read the reports. She figured human lives were the same everywhere, and didn’t give much thought to her other versions as long as they happened to be human.  From an early age Chang Yeon had seen how money shaped the world. While her peers had fussed over celebrities, she’d observed her parents’ social group and appraised their economic power. Her father used to say she had the instincts of a businessperson. But the first boy she’d dated had treated her like an empty-headed doll, born with a silver spoon in her mouth. He’d avoided all meaningful conversation with her, and Chang Yeon had never gotten over the humiliation.  She’d been thirty when she first learned about tuning. Since then her life had expanded like a magic ball absorbing everything in its path. Without the large inheritance her parents had left her, she couldn’t have afforded the tremendous cost tuning required. No doubt wealth was important, yet after each tuning, her wealth had felt less important to her.  Not only did people love and admire the furniture her company produced, but she managed to run the company debt-free in forty-eight countries around the world. What few people knew was that Chang Yeon designed nearly every piece of furniture herself. By a stroke of luck, her first integrated version had possessed a genius level intelligence. Her fourth, fifteenth, and twenty-fifth versions had each brought along their creativity, brilliant logical thinking, and keen aesthetic sense. Now she was no longer just an effective administrator, but someone who understood a worksite’s rhythms, capable of providing the exact thing others required.  Once she’d stabilized her company’s expansion, Chang Yeon had turned her attention to developing those intellectual aspects she believed herself lacking, such as a knowledge of history, philosophy, and psychology. All those things she’d so reluctantly memorized in school had come together organically to form a coherent picture in her head. Her thirty-first had shown her how time with a good book was better than watching her investments double. Her forty-third, forty-fifth, and forty-eighth selves all took pleasure in writing, but it was her forty-ninth’s literary skills that had made bestsellers of her three essay collections.  Every version added some new talent. From cooking and calligraphy to more subtle aspects such as a fondness for the outdoors or a knack for parallel parking. On their own these mundane skills would’ve been overpowered by each individual version’s numerous flaws. Only together in Chang Yeon could they achieve such an unbelievable synergy.  Not everyone who tuned was so lucky. Some clients only seemed capable of integrating the worst from themselves and sued the agency despite the exemption clause in their contracts. Not so for Chang Yeon, who may well have been born for tuning. Her versions’ psychological and personality flaws simply disappeared before the many strengths of her integrated selves.  People praised Chang Yeon’s life as perfect, believing it impossible that anything could be lacking. She had more money than she could spend; her fame was just widespread enough to be pleasing without being inconvenient. Academia lavished her with praise, and young people loved her furniture more than they did their video games. Even her husband was perfect. At first, she’d feared that he might disappear, and she would find someone else lying next to her in the morning after tuning. But the sailor assured her the fundamental elements wouldn’t change, and to her relief, her husband continued to exist after every tuning. He was exactly the kind of companion Chang Yeon needed, the single unchanging element in a life where she could change anything she desired. Most importantly, he wasn’t intimidated by his successful wife and didn’t try to reinforce his ego in perverse ways. If soulmates really existed, then for Chang Yeon her soulmate was her husband.  Of course she had taken other lovers, all young and attractive, but none of them had managed to break apart her marriage. An actor anxious about not being as successful as he would’ve wanted, a purehearted but penniless college student, a drop-dead gorgeous delivery guy with no willpower to break free from his dead-end routine, and a talented funk musician who’d been unable to overcome his addiction to drugs . . . usually she’d chosen someone with a critical part of themselves missing. And after every tuning they disappeared as though they’d never existed. These partings sometimes left a hole in her heart, but they were mostly flings, and always a new irresistible lover just as attractive as the one before appeared in no time.  Even with all of this, Chang Yeon was not content. Her life was grand and rich, fun but exhausting, tiring but exhilarating. And yet, it wasn’t perfect. Endless possibilities lined up before her, each one waiting to be explored. She was already fifty years old, and she still hoped to achieve so much more. Time passed so fast it sickened Chang Yeon.  “What reasons can there be for her to say no?” she asked the sailor. “I’m honestly curious. Didn’t you say she would die sometime next week?”  “Yes, at 10:41 PM on Wednesday next week to be precise.”  The sailor’s near instant response chilled Chang Yeon. The sailor knew the past, the present, and the future, not only in this world but throughout all the offshoot worlds where Chang Yeon existed. And not once had it ever been wrong.  The sailor told her everything except one thing: the future that she, her most perfect self—“the most integrateable” in tuning terms—faced in this world. The service contract forbade the sailor to tell her that information no matter how anxious she became.  Of the forty-nine selves Chang Yeon had integrated so far, not one had rejected the offer. The sailor displayed so much sincerity that they could hardly refuse. At the same time it frightened them just the right amount. Most of all, the sailor visited the versions over and over until they agreed. The sailor was not allowed to reveal exactly when, where, and how they were going to die unless they specifically asked. But the sailor told Chang Yeon that they always, eventually, asked. When they asked, they were answered, and then they asked again. By the time they got around to asking that question, though, there usually wasn’t enough time left for extended contemplation. Emotionally-inclined versions became furious, sneered, threatened, ran away, cried, refused to speak, and became angry again, but in the end, they all got desperate. The process was shorter for less emotional versions, but even for them, the final step they reached was always desperation. Until this version. She had but this one chance not only to avoid death and eternal annihilation, but to survive and live a much better life. Why, then, wasn’t she seizing it?  “It wasn’t a definite no,” the sailor said. “She seems to be hesitating. I don’t exactly know why. But we’ll find out soon since she only has until tomorrow to make her decision.”  To die. A version closes their eyes one last time surrounded by loved ones in a familiar world. And then, nothing. Forever.  To live. A version must leave their world before their last breath. As they pass between worlds, their body dissolves and disappears. Their personality and talents are transmitted unaltered to the designated world. Their memory? It varied from person to person.  Chang Yeon had once asked the sailor, “How come I can’t remember things I did in the other worlds? How come I can’t remember anything at all?”  The sailor had replied, “That depends on what the versions expect from their next life. The amount of memory transferred is inversely proportional to the level of expectation one has for their new life. Your versions mostly admired the life you have in this world. Probably they hoped to forget their regrets and their unsatisfactory lives and wished to start fresh. In that case, their memories would’ve taken another form once transferred. In your case, they manifested in the form of “talents”. Suddenly you’d have a strong urge to learn a new language, right? Or out of the blue you needed to read books on social sciences, politics, philosophy, and so on even though you’d always considered them too difficult to read. Those interests were very likely what the selves had wanted transferred.”  It wasn’t hard for Chang Yeon to understand their admiration. Her life was definitely the opposite of shabby or insignificant. Still, she couldn’t help but imagine the funerals of those she’d integrated. First, their families would have reported them missing, and then, after many years when all hope of finding them had evaporated, their empty coffins would have been cremated. All for the sake of her perfect self. She could imagine the devastated families watching the coffins enter the furnace.  What if the situation were reversed and the sailor told her she was dying and proposed moving on to another world, a better world? If somewhere out there, there existed another version of herself that would continue on in a more perfect form? She was glad a better version had not materialized, at least not yet. But she didn’t think it would be an easy decision for her. Yes, she was being purely emotional. But it felt like she’d be betraying her husband, her friends, and all the others who cared about her. Suddenly, Chang Yeon wondered how likely it would be for her to choose to remain in this world and face her death.  “Maybe,” she said, “it’s because of someone important, like her family or lover?”  “She has no family. Although there is one who could be described as a friend and a lover, but their relationship is not like anything of this world. As I’ve said, this version is somewhat different.”  “That version—What was it called? How small did you say?”  “It’s the Roo tribe. The size varies by individual, but generally they are about three millimeters to one centimeter tall. Your version—her name is Chang by the way—is precisely 5.6 millimeters tall. To be able to communicate with her, I had to take a special form. They are hard to see with human eyes. But their smallness also gives them an advantage. They can move extremely quickly. They fly in an object called a Lu that can travel three to four kilometers per second.”  This distressed Chang Yeon. Though she knew there were many unknown offshoot worlds, she never thought she would come across a version of herself that was not human. Certainly not one smaller than her thumb and able to fly around in some strange, superfast aircraft.  On the way home, Chang circled over a small harborside city. She’d packed a day’s food a few hours ago, and it would be hours until the afternoon when the sun was best for Lu’s wings to photosynthesize. Chang considered returning home, but instead chose to keep on flying.  Then the harsh night wind slapped at Lu’s wings, and Chang descended to the small fishing boats anchored below. Through Lu’s senses the smell, chill, and roar of the sea surged over her. The ropes holding down the boats thrashed, while the boats themselves creaked and groaned as if they cursed sky and water. If she allowed Lu their full speed, they could easily fly across half the continent and return before the sun was high. But Chang slowed and spiraled downward until it was too dangerous to descend any further. The spray from the waves barely missed them before collapsing back on to the ocean’s surface. This is insane, Chang thought. She wouldn’t have done anything like this on a normal day. She felt daunted, but not solely from fear.  The world she saw through Lu’s eyes was a vast network of hexagons. They spread in all directions with no visible end. The only time Chang could discern anything was when they flew slowly. But when she accelerated, the world shattered with a boom into particles smaller than dust. Hahnoe, her closest friend, claimed the particles moved “imperfectly.” According to his logic, large things were “perfect” and small things were not. Chang always thought this an absurdly simplistic view, but had never said so to Hahnoe.  “Chang, you’re too fast,” Hahnoe would say, laughing. “Have you ever truly seen a raindrop? Have you ever looked within a snowflake and seen its incredible pattern?”  She always answered, with her temper slightly riled, how dangerous such an attempt could be, how it could even kill them. Hahnoe would only sigh and say, “Do you think what you see at your speed is real? There’s no way. What you see is the illusion speed creates. Humans don’t move that fast. They stay at one place for a long while. Until they absorb more things from their surroundings, until they become stronger and more ‘perfect.’”  Hahnoe believed the only way their people could survive was to adopt human speeds. He took the risk of flying close to them at very low speed to observe and listen, and he tried to convey what he learned to the others.  When they’d left the cave, everyone had shared the same thinking, or so she’d believed. Since then, however, their interests had shifted in various directions.  Kinn and some others had embraced more direct and confrontational tactics. They sought to bring humans down by infiltrating them through vulnerable parts of their bodies, like their eyes and ears. They’d proposed starting with one or two houses and then spreading over a town until eventually all the humans in this world were defeated and the Roo kingdom restored. They’d convinced others to join them, and Kinn had held fast to the idea that their tribe could “grow” by doing so. It’d all seemed like such an unachievable goal to Chang, but she’d found that she could empathize with Kinn. After all, who in the world hadn’t felt enraged by their own helplessness?  Hahnoe’s stance was the exact opposite. Hahnoe worshiped the enormity of these sluggish humans. While Chang held no prejudice against this belief, flying slow was not her way. Her body and her heart craved speed. When she overtook everything around her, and her Lu soared into the sky shattering the air like an explosion, she felt enraptured, and more alive than at any other time.  After coming out of the cave, Chang had traveled to many places. She didn’t have as much experience flying as others in the tribe, but her Lu was fast. She could fly to almost anywhere and return in one day. But she couldn’t exit the Lu and walk on the ground unless they were home. The risks were too great. There were human feet slamming down everywhere, gigantic water droplets that could fall without warning, and merciless insects and other animals with their flashing claws.  Chang hadn’t really understood the contours and shapes of everything that filled the lands and seas. They always broke apart into infinite fragments at great distances and dissolved into foam. But not once had she ever considered this mess ugly. Things didn’t need to have a clear meaning to be beautiful. But she couldn’t describe what she saw the way Hahnoe described the rivers, mountain ranges, and humans he’d seen. She simply noticed the chaotic dance of fragments, the tremors and fragrances they left in their wake. If only they stayed longer, maybe then she would make sense of them.  Now what the stranger had said weighed heavily on her mind. What if I really die next week and the world just ends for me? What if everything I’ve seen during my entire life has been nothing but broken pieces, fakes, mere illusions scattered in the air? I wish that I could convey what I’ve seen, that there could be someone flying with me to share these indescribable feelings and recognize that all this is real.  But others in the tribe didn’t share her sentiment. They focused on matters more important. Besides, Chang couldn’t meet another Roo in flight; they were too small and too fast.  The waves rolled on by, close enough to overtake her at any moment, enormous and unknowable. Amidst Chang’s fear, faint and slender pillars of feeling grew. She wasn’t sure whether it was hostility, obstinacy, or something else. If Hahnoe were here, he might’ve gone even closer. But when Chang believed she’d reached the limit, she trusted her Lu to ascend, and flew high into the sky. When she turned toward the moon, hundreds of dim sliver fragments filled Lu’s eyes. Faster! Chang trusted with all her heart, hearing the beat of Lu’s quickening wings. Hahnoe had said flying too fast would shatter their bodies into bits. But Chang had never been to a place as far away as the moon. No matter how hard she tried, she couldn’t get any closer to that glowing mass. Even those who had traveled the seas, the canyons, and the deserts knew nothing about the moon.  “The moon? It’s too far for us to reach,” Hahnoe had said. “And still it looks so big. The magnitude of its size must be beyond our comprehension. I doubt we’d be able to measure it with our units like kruho or even pruho. We should focus on what we can do, even if it takes a long time or puts us at risk; we have to start with the things we can reach. You’re so unwilling to compromise or try to understand.” The moon and the stars remained fixed in their places while Hahnoe’s remembered voice rang in her ears. If I could just fly faster, Chang thought, if only I could fly fast enough.  After her husband went to bed, Chang Yeon made a cup of coffee and sat in front of her computer. She couldn’t sleep and felt sick from the wine she’d had at the early birthday party her staff had arranged for her.  Why do humans need to sleep when time slips away so quickly?  The more tunings she completed, the more difficult it became to idle away her time. She couldn’t bear the idea that there were worlds unknown to her, things outside the scope of her logic. She was frustrated at this obsession. She considered what the sailor had told her and felt as though her brain was dissolving into sand. But sailors didn’t lie, and there was no reason for them to fabricate such a story. She entered some words into the search prompt and waited.  She’d been right. The Roo tribe also existed in her world, only with a different name. In this world, they were called Rods and Chang Yeon had seen a picture of them online long ago. Six or eight winglike components symmetrically attached at an angle to a long stick. Images of these objects, flying at unimaginable speeds, had been captured across the world, from crowded city cafés to open fields in the countryside. Some had claimed that they were evidence of alien beings, while most everyone else had assumed they were insects distorted by the technical limitations of the cameras. In time, people had lost interest in them. But what the sailor had described was not a bug. It was a plant as well as an animal; a living creature in the sense that it had an organic body, but a machine in the sense that it only moved by commands. And it was the only means of transportation available to the Roo people.  According to the sailor, Lus were hollow inside like bamboo stems, with a thin detachable film covering their tops and bottoms. If they rotated as they flew, and if that image was captured in several layers due to some distortion caused by light, they might resemble the Rods in the old photos. And Chang, the fiftieth version of Chang Yeon, was flying in one of them.  Civilizations in offshoot worlds developed differently from each another. Despite their keen eyes and extensive extradimensional knowledge, sailors had been unable to understand how the mutant Roo tribe could’ve existed in Chang’s world. It was only after exhaustive searching that Chang Yeon’s sailor had found a legend about ant-sized people supposedly living in a limestone cave somewhere in that world’s southern Africa. The cave was not far from the Sterkfontein Caves, where the fossilized skull of a primitive human from over two million years ago had been uncovered. Scientists overlooked this other cave since it sat so close to Sterkfontein’s shadow. Since then the sailor had made numerous voyages to the cave in an attempt to learn more. Finally, deep in the cave where dim light entered through the cracks in the cave’s ceiling, it had spotted some odd-looking plants and noticed the tiny people living in a colony around them.  These plants, which the tiny people called Lu, looked like freeze-dried centipedes sprouting from the ground. The cream-colored stems had countless segments, and where each segment met the next, two leaves sprouted from the gap in a way that formed a spiral around the stems. From time to time, the tiny people clung to the plant stems like ants and drank the sticky sap flowing from between the segments, but beyond that, the sailor hadn’t seen them eat anything.  “Their population is about one thousand,” the sailor had explained, “and they appear to have a level of intelligence comparable to humans. They communicate in their own spoken language and are capable of making simple tools.”  The sailor had gone on to outline the Roo, as the tiny people were called, in more detail. In most ways they appeared to be identical to larger humans. Their eyes seemed accustomed to darkness, but they were not distressed by light. They went about naked and had black hair and somewhat dull skin. There was little distinction between genders: the males were slightly taller than the females, but they all looked feeble to the sailor. Interestingly, they had lacked visible genitalia.  “They have managed to adapt to the environment inside the cave, despite being vulnerable to most outside stimuli. But those who have ventured outside the cave often perish within the first few steps. They preserve themselves not by reproduction but by rebirth. When one of their number dies, they put a few drops of sap from the Lu plant on the dead body. Exactly seventy-two hours later, the dead return to life.”  Chang Yeon had been biting her nails as she listened to the sailor. She knew she should respect the diversity of offshoot worlds and acknowledge all the possibilities that existed in them. But . . . this was too much. Oblivious to her confusion, the sailor continued on.  “What’s more interesting is that they all come back to life with young bodies. Some are quite old and had limited mobility at the time of their death. But after the Lu sap is applied, they all awaken looking to be in their late teens or early twenties. This sap clearly has some kind of mysterious regenerative powers for these people. Whether this also leads to a mental renewal, I cannot say. Regardless, their skin looks firm, they move with great energy, and in all aspects they appear significantly healthier. In this way, the tribe maintains their population at a constant level. All who die are reborn, and no one new is born. No children exist in this tribe. I’d have noticed any babies for sure. But there were none. They appear not to reproduce.”  The Sailor paused a moment. “However . . . Chang, your fiftieth version, was born to a Roo woman exactly three years ago.”  “What is that supposed to mean?” Chang Yeon tried to make sense of the sailor’s words, but failed. “You just said yourself that they don’t reproduce. Besides, all of my versions have been born at the same time and place as myself, in a hospital in Seoul fifty years ago. I understand that different environments create different versions of myself, but how could a version of me have been born in a cave in South Africa? And only three years ago?”  The sailor looked into Chang Yeon’s eyes for some time before continuing on in a more comforting tone.  “That’s the tricky part. The body Chang was born into once belonged to an ordinary Roo woman. Like others in the tribe, that woman had come into existence at some point in the past and gone through hundreds, possibly even thousands of rebirths. Her self-structure didn’t match yours at all. But three years ago, she died of natural causes, and when she returned to life three days later, she had a completely different self-structure. Now, post-rebirth, her self-structure matches yours. Since nothing like this has never happened before, we suspected an error in the tuning system at first. But we’ve checked multiple times and always obtained the same result.”  Chang Yeon, unable to respond, rose from her chair. She went to the window and looked out onto the quiet streets beneath the darkened buildings. It seemed like any other cold February night. The tuning system was known to have a 99.82 percent accuracy rate. An error hadn’t occurred in over ten years.  “If you don’t feel comfortable with this, you may cancel this tuning. It’s not a problem at all. Given the particularity of the situation, we don’t encourage you to go through with the procedure. We only continued because we knew this tuning mattered so much to you. I apologize for not having informed you sooner, but we needed time to be certain of our findings.”  Chang Yeon stared at the sailor.  “ . . . How come she’s dying? You said they can be endlessly reborn.”  “From the very beginning, the Roo people have worshiped the Lu plant. We were able to confirm this based on our research into their language and culture. It was this absolute power that promised them eternity, and the sap, which they called ‘God’s tears,’ had saved the fragile tribe from the danger of extinction. They’d become immortal beings with peaceful, idyllic lives. Yet some chose to leave the cave. Hundreds of them had been reborn with the same desire. They cut the divine stems into hundreds of internodes and entered through the films. These young people had remained there for several days when something extraordinary happened. The plant pieces began to function like animals. What they had thought were leaves were actually wings.”  Chang Yeon’s eyes widened as the sailor went on.  “But these separated internodes didn’t produce ‘God’s tears’ anymore. Those back in the cave believed this was a punishment for the blasphemy the young people had committed. Hundreds of Roos remained in the cave, living out their immortal lives. The ones who left, however, lost their immortality. These then scattered across the world and slowly began dying out. For many, adapting to their new environments lay beyond their abilities. Outside the cave, they’d had to hunt and gather their own food. The cave-dwelling Roos had the ability to retain their experiences across countless rebirths, but those outside could no longer remember anything from their past lives. We were unable to determine if anything else had changed since their last rebirth or if this is all the result of cutting the Lu plant and leaving the cave. At any rate, all of their former experiences are gone.”  Chang Yeon didn’t know what to say.  “Do you understand now?” the sailor had asked. “They are cut off. Isolated. Without the shared memory of their people, their chances of survival are extremely low. And since they don’t have ‘God’s tears,’ it’s impossible to bring their dead back to life. Some have changed their minds and returned to the cave. Yet others remain outside, rejecting eternity and carrying on their lives, struggling to adapt to the world’s hostile environments. Only a few dozen survive now, including Chang. I don’t know if it’s coincidence, but in that offshoot world, Chang found her way close to where you were born. Now, with some of her peers, she makes her home in Seoul.”  Shu was dead. Chang learned it from Hahnoe when she returned home.  “It was a young person,” Hahnoe said in a mournful tone, “a young human. Pio saw it happen, and I went with a few others to retrieve the remains.”  Chang couldn’t say anything. Hahnoe was covered in blood. He was resilient, an experienced combatant and a skilled pilot. But Chang saw that he was barely able to contain his fury and grief. How could he not be shaken? Many had gathered at the center of the habitation site, and Chang assumed that was where Shu’s body was. The air was thick with a tense silence. Among those gathered were Kinn and her gang. Kinn glanced over toward Hahnoe.  “This is the reward they give,” she said in a mocking tone, “the high and mighty humans that you idiots worship.”  “Shut your mouth, Kinn,” Hahnoe yelled.  Chang walked over to Pio. He cowered in a corner, trembling from shock and fear. Saliva dribbled from his half-open mouth and ran down his chin. Friends were trying to calm him down, but to little avail. It was some time before Pio gathered himself enough to explain what had happened.  They had gone into a human’s house on the outskirts of the city. Shu had been drawn there by an open book like an ant to sugar. After surveying the book from above, Shu had landed his Lu and walked out to take a closer look at the page. He was so absorbed in the elegant black lines that he hadn’t heard Pio’s urgent cry as an enormous finger had descended to the page. Roos feared the young humans more than the older ones because young humans saw things that adults couldn’t. Shu had forgotten this most basic protocol, captivated as he had been by the words on the page.   A black, E white, I red, U green, O blue: vowels,  I shall speak one day of your hidden origins: A, black furred-corset of bumbling flies Buzzing like bees round a cruel stink,2 Chang remembered the day Shu had sung these verses. It had been winter then, too, and as cold as today.  Hahnoe considered each of the seasons beautiful, but Chang found the winter unbearable. It must have been the same for the others. They’d covered the entrance of the tin pail in which they lived with a thick piece of cloth. But that hadn’t been enough to shut out the bitter winds, and everyone had shivered.  As they huddled around the brimstone bonfire they’d made, Shu sang, his eyes sparkling. The song was not their own, but one translated from a human language. Chang knew flies were dangerous animals but didn’t know what a corset was. She knew the colors black, white, red, green, and blue, but didn’t understand the words in between them nor what vowels were. Roos could count numbers, mark the passing of time, measure spaces, and make simple tools. They also drew and painted. But they didn’t have a written language. They communicated by spoken word alone and had to repeat what was conveyed several times so they could be sure to remember it. Hahnoe had once told Chang that writing was the materialization of meanings and that it remained long after people died. She couldn’t comprehend what that meant.  “If we could record what we mean with letters,” Hahnoe had said sadly, “we’d be able to make more complex tools and hunt much better. We might even be able to make machines like humans. Damn it! How come we don’t remember anything? Those who once used our bodies might have known how to do all that stuff. Maybe they could’ve done it, but just hadn’t. Why can’t we remember a single thing?”  His yearning was something that Chang didn’t understand, despite the fact that she couldn’t remember anything either.  At first, it was very hard for her to accept the fact that someone else, someone who wasn’t her, had occupied her body. But that no longer bothered her. Whoever they had been, they were long gone. Now Chang had Hahnoe and Lu. Lu was not just a machine, but a part of herself, a living being that loved speed as much as she did. Those who had decided to leave the cave had one thing in common. They had known that they were no longer who they had been before and so therefore they had to leave. But now that they had left, Hahnoe’s eyes were always turned toward something different than Chang’s. Maybe that was why she loved him.  That day, sitting by the bonfire, Chang had asked Shu where he’d learned the song. He’d answered with his usual faraway look. “I don’t know,” he’d said. “Maybe in a dream.” Everyone had laughed.  Such had been Shu’s way: he’d often said strange things that no one understood and had dreams that no one else dreamed. While Hahnoe agonized over not being able to understand human letters, Shu had admired them with pure wonder.  Now Shu lay wrapped in black leaves, his Lu standing like a barrel outside the circle of people. It had flown back home safely, but without Shu it was nothing more than an empty shell. At the very moment his body had been crushed, Shu had trusted his Lu to flee.  Hahnoe stood suddenly, lifting up Shu’s body. He pushed his way through the crowd. The Lu opened to receive Shu’s body. This act was meaningless, but no one tried to stop Hahnoe. Tears flowed, but not from the Lu: it didn’t weep tears now and there would be no rebirth in three days. The time when Lu had been a god, when it had given back life again and again, was over. Like those who had been destroyed before him, Shu could never again sing any songs or tell any stories.  Chang Yeon was still awake and thinking about Chang, the 5.6-millimeter-tall woman, when the sky turned pink the next morning.  Tuning only involved mental integration. Because each version’s body was not able to cross between worlds, a tuning client didn’t need to worry about whatever physical flaws their version might have possessed. Integrating this tiny, fragile Chang wouldn’t shrink Chang Yeon’s body or create any physical problem for her.  At each tuning, Chang Yeon had pictured the version she was integrating. They all looked similar in her imagination: women in their thirties and later forties with slight variations in clothing and hair. Though Chang Yeon was grateful for the diverse abilities her versions brought her, there was one difference she had begun to wish for: a younger version of herself living outside time and capable of bringing her body along for integration. Her desire always ultimately led her imagination there.  What feelings and sensations did someone in their late teens or early twenties perceive?  Chang Yeon couldn’t really remember what it had been like during her own youth. Thanks to her wealthy parents, she had never had to struggle with the trifling worries of life. She recalled thinking everything dull, and once or twice she might’ve wished, with typical juvenile confusion, that her life could end right then. But these were all very faint memories.  The tuning procedure only took three hours at most and resulted in no pain or negative aftereffects. To the wealthy, tuning was comparable to getting a simple cosmetic procedure or making a big investment in a new startup. All Chang Yeon had to do was take the sleeping pill that the sailor provided. Recognizing new desires, interests, tastes, and talents she’d integrated usually took several weeks. The integrated selves never staged any resistance by bringing along their own memories or caused her any discomfort. They always blended into Chang Yeon’s consciousness without hesitation and quietly surfaced only when strictly necessary.  Still, it felt strange like making the acquaintance of someone kind but reserved. They were always polite and gave her lots of useful information, but never opened themselves to her. Never had she encountered a case where the integrated version had pushed her life in an unwanted direction, or made her do something absurd and unthinkable.  But if it were a version that grew up in an environment so different from mine . . . If there were a young and bubbly version of myself, full of life and carefree, absorbing everything they felt with every part of their body.  Out of nowhere, Chang Yeon saw in her head a little child running toward her with a big smile.  She was startled and perplexed. Since they’d wanted to focus on themselves, Chang Yeon and her husband had decided not to have children. She’d never doubted this decision. Rather, people who dedicated their entire lives to their children baffled her. She found that as her perplexity deepened, she felt, this image of a child grew increasingly clearer. She thought of an old friend who had remained by her side through all the tunings. Even when she’d been having so much trouble with her teenaged child, and her face had glowed as she’d talked about the child’s small displays of affection. While Chang Yeon had gone through forty-nine tunings, this friend had thrown all her energy into this small creature that resembled her, spending decades basically letting it run her life.  “Raising a child is insane,” the friend had told her. “Doesn’t matter whether they’re two or twenty. They drive you out of your mind just the same.” Yet always the friend would add, “But you know what’s funny? When I look at those round eyes, small fingers, and chubby cheeks, I feel like I shrink down to nothing, like I matter less than a dot or something even smaller when compared to that child. And amazingly, that doesn’t bother me.”  She’d gone on to tell Chang Yeon that though children naturally went against their parents’ wishes or expectations, they also occasionally created unimaginable joy.  Chang Yeon couldn’t conceive what that must be like.  If it had been Chang, maybe she’d have been more than just a polite acquaintance. Maybe she’d have taken Chang Yeon’s life in a whole new direction, shaken up her days and made her laugh until she cried, or wept her eyes out. If Chang were integrated into her, maybe Chang Yeon wouldn’t feel that heavy weight in her heart, which was how she felt whenever she was making a list of new things she’d have to learn and master after a tuning. She might be liberated from the urgent whispers nudging her toward a cliff, her obsession with time, the fear of never being good enough no matter how hard she tried. Maybe she’d learn to stop thinking about herself until her head spun. If it were Chang, maybe she would become both Chang Yeon and Chang Yeon’s child at the same time.  But Chang Yeon couldn’t fathom how a person who wasn’t a fifty-year-old human, but a Roo just entering adulthood might think and behave. A child who had the courage to cut apart what her people considered God. Chang Yeon sighed. The fact that Chang had defied her faith and chose to become a mortal being fascinated Chang Yeon beyond description. It was so far from a decision she herself would’ve made. There was only one day until the scheduled tuning, and she needed to ready herself.  Since she was born a warrior, she must be tough. And since she’s an aviator, she’s got to be quite adventurous. But she isn’t human. She doesn’t even know how to dress herself. She might be ignorant, considering how her people don’t have a written language or any systematic compilation of their knowledge. That might have a negative effect on my intelligence. But . . . has a flaw ever manifested? She’s a free spirit. Apparently, she likes flying much more than other Roos. But she lives in constant fear for her life. And now that she’s told she’s dying . . . She must be in despair. But, I’ve never discovered feelings of fear or despair after a tuning.  Chang Yeon lost herself, trying to understand that tiny mysterious being. Her Roo version was a wild risk-taker, and Chang Yeon found that irresistibly attractive. Chang Yeon lay on her bed and buried her face in the soft pillow. As the softness touched her skin, her mind lurched toward fear. Nausea filled her.  Should I cancel the procedure? But what if she’s decided to agree? She might be full of hope.  Eventually, her body surrendered to her exhaustion, and she fell asleep without reaching any conclusion.  When Chang Yeon opened her eyes, it was already past 4 PM. Only two hours remained until the deadline. She called the sailor. It reported that Chang hadn’t made up her mind yet. Chang Yeon hesitated a few moments.  “How does she . . . die?” she asked.  “What do you mean?”  “On Wednesday next week, at 10:41 PM. How does she die?”  The sailor paused. “Do you really want to know? Might it not be better otherwise? It will only be a depressing memory.”  “Since it’s not my future but hers, you are allowed to tell me, aren’t you?”  The sailor remained silent for some time before replying. “According to the system’s prediction, she freezes to death. It starts snowing in the afternoon and gets heavier into the night. Your version crashes while flying her Lu, and they get buried under snow. She freezes almost instantly upon impact.”  Chang Yeon couldn’t find the words to respond.  “They are tiny beings. Even a few snowflakes can kill them,” the sailor said.  When Chang Yeon remained silent, the sailor sighed. “That’s why I told you it’d be better not to know.”  Chang Yeon terminated the call.  It was around 6:30 PM when the sailor called her again. “Her final answer is no,” it said. A soft gasp escaped Chang Yeon’s mouth.  “She said she wouldn’t come,” the sailor continued on. “I apologize on behalf of the agency for this outcome. This is a few hours early, but I’d like to wish you a happy birthday.”  The room suddenly felt cold, and she was again a little nauseated. She lay on her side, embracing her knees. Chang Yeon couldn’t tell whether what she was feeling was relief or disappointment.  At that moment, a memory from years earlier popped into her mind.  Her career had been full of successes, but there had been one failed project that had remained bitter in her heart. It was for an event they’d held for her company’s anniversary. One selected participant could request a customized piece of furniture. It could be anything, in any material or design. The event attracted a lot of attention, and people had gone wild over it. The winner had been a seventeen-year-old girl. She’d been dressed in a flimsy summer uniform, although fall had been in the air, and she’d requested a large luxury armchair with very good leather. Not something a girl that age ought to have wanted, Chang Yeon thought, so she’d asked whether the chair was for her dad.  “No,” she’d said. “I want dark-colored leather, something tough and durable. It’s just for myself, so a single seater is good enough. When I sit in it, I want to be able to feel relaxed . . . and secure.”  She’d had her arms folded and kept rubbing her skinny forearms as she spoke. Chang Yeon decided to use steel frames and the highest quality leather, dyed a dark brown. She’d used a very simple design and made the chair fifteen percent bigger than a regular armchair. She’d put so much care into achieving the right firmness, checking it again and again until she was completely satisfied with how it felt. The finished chair had resembled some kind of large animal, dignified and loyal to its owner.  But when they’d called the girl to arrange delivery, she’d suddenly changed her mind.  “I’m sorry,” she’d said in a low disheartened voice, “but I can’t take it. I’m really sorry. Please give it to someone else.”  Chang Yeon thought even from the start, the girl must not have had space to accommodate the chair. And even though many years had passed, the image of the tiny goose bumps on the kid’s forearms came to her mind from time to time for no reason. Chang Yeon burrowed further beneath her blanket.  Sometime after midnight, there was a knock at the door. Her husband stood outside smiling a little bashfully with a cake in one hand and a small gift box in the other.  On the top of the cake was a long sentence written in fine lines of chocolate. It read, “To my wife, Chang Yeon, the most perfect and beautiful woman in the world.”  Chang trusted her Lu to maneuver rapidly and zigzagged into the night sky. Lu’s wingbeats slowed. For the first time, Chang got a good look at winter.  The landscape was desolate, the moon hidden behind the thick clouds. Pure white lumps fell from the sky. Snow. Chang had never seen it before. Whenever it snowed, Roos stayed home and didn’t fly. Hahnoe had called them beautiful lumps of death, and she could see that he’d been right. The snowflakes were slower than Chang, but they flew in all directions as if they sought to strike her. Lu’s eyes twitched with growing fear. But Chang believed in them.  Chang thought of Hahnoe and of Shu, and then she recalled an old memory.  A group of friends, drenched in sweat, had pushed Chang’s Lu up to the lowest branch of a birch tree. Chang held on to Hahnoe’s hand and climbed up, struggling to keep her eyes fixed on the next handhold. When she got inside Lu and plunged through the air from the branch’s tip, fear overwhelmed her. What if Lu’s wings didn’t move as she wished?  She’d felt the enormity of the world around her and the dizzying despair from how everything stayed in its place. Her body still tingled when she remembered that moment. Chang had been the only thing trying to break away from its place, and she could almost see the sharp mandibles of ants pouncing on her crushed body. But finally, after she’d repeated her desire what felt to be hundreds of times, Lu finally started moving its wings. A pathway she’d trusted appeared before her in the void, and she realized it was a flow that she could control. She remembered the electrifying thrill that had gone through her body then when she’d made her first path through the air.  And now, Chang was trying to escape the snowflakes and reach the moon.  Lu’s wings were already soaking wet. But Chang strained her entire body and committed all of her trust to Lu. Up close, the snowflakes were integrations of countless hexagonal crystals, resembling Lu’s compound eyes. Even though the flakes were fighting to dampen Lu’s wings further, and send Chang plummeting back down toward the earth, they were nothing more than fragile crystals that could melt away in moments. If they were indeed fragments of the moon as Chang believed, then it stood to reason that the enormous, distant moon couldn’t be so perfect as to be unreachable.  There were many things that Chang didn’t know. She’d never observed the world in detail or really comprehended it. But she knew that she, together with her Lu, which had become part of her, could fly fast enough to evade these huge frozen water crystals veering at her from all directions.  Without her Lu, life in some other world would be meaningless. Chang trusted Lu to their full speed.  Faster!  Soon, they reached a speed she’d never imagined possible.  The tuning system that claimed to make “perfect sails” was not truly perfect yet, and its prediction was accurate only up to 99.82 percent. In a small, lesser known offshoot world of the countless many, the life of the Roo aviator Chang ended, as predetermined, at 10:41 PM on a Wednesday in February. Except she wasn’t buried beneath snow as the system had predicted: instead, she’d flown higher and faster between the falling snowflakes, until she burst into red flames the instant she and her Lu escaped the Earth’s atmosphere.  If the Roo tribe had possessed letters to record meanings, they would’ve written the following about Chang: She was the Roo who had flown the fastest and the farthest, the one who came the closest to the moon in the whole history of the tribe.    Originally published in Korean in Modern Literature, May 2008.  Published with the support of Literature Translation Institute of Korea (LTI Korea).  Footnotes:  1 - Kruho: the unit of length used by the Roo tribe. One ruho is approximately five millimeters, and one kruho is one thousand ruhos, about five meters.  I-Hyeong Yun is a Korean writer. She debuted in 2005 with a short story, \"The Black Starfish,\" which won her the Joong Ang New Writer Award. Since then, she's won multiple awards for \"The Big Wolf, Blue\" (2007), \"Koon's Journey\" (2014), and \"Luka\" (2015). Most recently, she won the 2019 Yi Sang Literary Award for \"Their First and Second Cats.\" In 2015, her story \"Danny\" was translated into English as part of the series.  Justin Howe was born and raised in Massachusetts. His work has appeared in Strange Horizons, Spacesuits & Sixguns, and The Internet Review of Science Fiction. His story \"Skillet and Saber\" will appear in the anthology Fast Ships, Black Sails available from Night Shade Books in October 2008. He is a graduate of the Odyssey Writers workshop, works for an architectural preservation company in New York City, and belongs to the Homeless Moon.", "text": "9300 words, novelette\nThe Perfect Sail\n“You’re dying,” the stranger told Chang. “To tell you the truth, you have less than a week left to live. I advise you to hasten your decision. If you remain here, you will surely dissolve into nothingness.” Suddenly, her Lu plummeted earthward at frightening speed.\nChang sat, stupefied. The stars and clouds howled as they zoomed beyond the Lu’s faceted eyes. The sky burst open, and the earth rose from the split. They spun as they fell. Again the sky, again the earth, then trees, rocks, and the horizon, one after another, leaping forward and falling back. The Lu’s inner skin tightened across Chang’s chest, and her disheveled hair danced before her eyes. The world’s broken pieces tumbled downward, but they were not beautiful. Not beautiful at all.\nChang managed to recover herself and, stifling a scream, focused her trust in her Lu. Fly, Lu! Fly!\nThe world rolled violently one last time and then stopped. Chang felt nauseous. When she opened her eyes, everything was calm. Lu’s compound eyes broke the night into hundreds of interlocking hexagons and their wings flapped a slow steady rhythm. A sound so familiar she wouldn’t have noticed it in ordinary times. Chang shifted within the inner skin. Her Lu hovered a mere kruho1 above the ground.\nIs this how one’s supposed to feel at the revelation of their death? It’s like my body’s become a hard heavy lump that won’t stop falling and falling. Chang covered her face in her hands, her skin slick with perspiration. She’d never lost her trust in the air like that. And without focus and belief, her Lu couldn’t even move their wings, let alone fly.\nThe stranger had resembled a human but was most definitely not a Roo like her. They’d stood about two ruhos tall, and had a semitransparent body that shone like thawed moonlight. They’d spoken without moving their lips, in a voice so peculiar Chang found it impossible to describe. She didn’t want to admit it, but the stranger’s words had shaken her to the core.\n<Don’t you wish to be perfect?> the stranger had asked her. <Don’t you want to be stronger, better? You’re a fragment separated from your original self and fallen into insignificance. In my world, you could live a colorful and magnificent life, unparalleled. More importantly, you would still live after a week’s time.>\nHow do I die?\nBut Chang hadn’t asked the question. For a Roo, death was everywhere. She might be swept away by the wind or caught by an insect and torn to pieces. A human might step on her and she’d be destroyed without even a chance to feel the pain. The stranger with its radiating body had seemed like a divine messenger. But this death sentence from an unknown god had overwhelmed her. Losing control of her Lu in the air and crashing was not a death Chang had imagined. If I die, will Lu die as well? All they had to do was spread their wings toward the sun to sustain themselves. It was Chang’s trust that made them move.\nHovering in midair, she scanned the cream-colored bark-like lining of Lu’s interior. She centered herself and focused her trust. Lu, let’s go back. Lu’s compound eyes relaxed and showed a path stretching before them into the sky. A path created by Chang’s trust. Lu flapped their wings and launched into a smooth glide.\nChang Yeon reclined on a wine-colored armchair and looked around the room. It was more a cozy den than a CEO’s office. A red carpet covered the floor, embroidered with golden Arabic patterns, and cedar bookshelves lined three of the room’s four walls. Energetic footsteps passed in the hall beyond. Even though it was Friday night and her company had just finished one project, the place still bustled like a giant organism that refused to rest. Chang Yeon had asked her secretary to hold all her calls. She smiled with renewed satisfaction. How wonderful it was to have everything move as you commanded? But of course, there was that latest version of herself in that offshoot world far, far away. I wonder why she hesitates, Chang Yeon thought. Her eyes fixed on her hands and she sighed at their sudden unfamiliarity. Was her pale, weak skin actually wilting by the hour, or was she just imagining it?\n“She has until tomorrow to decide, but it’s a fifty-fifty chance,” the sailor said in its calm machine voice. “We should have a backup plan prepared since we can’t bring her here against her will. This version may not be our only chance. Although it’s rare, there have been cases when a more suitable version turned up on the morning of the scheduled tuning. Our broadband sail is still ongoing, moving as fast as possible.”\nSailors were not human, but rather beings capable of going against time, jumping the boundaries between dimensions, and sailing through the countless myriad of offshoot worlds. This meant they could go on the perfect sail, or, more precisely, sail to serve their human clients’ yearnings for perfection. The membranes separating offshoot worlds didn’t permit organisms to pass from one to the next, but sailors faced no such obstacles. Their bodies were made of a special alloy that could slip between dimensions.\nThe sailor exuded a sense of determination not to disappoint a premium client. I waited too long, Chang Yeon thought. Her most recent tuning had been seven years ago. Since then she had requested sails from time to time, but without any real desire. Until now. In two days, she’d turn fifty years old and even in this world of abundance and endless possibilities, it was impossible to avoid the natural order of aging and death. A tuning would therefore be a perfect birthday gift for herself. Her fiftieth tuning for her fiftieth birthday, and to make it happen she’d started the search a year in advance.\nInevitably, the tuning would be rushed. According to the sailor, every human being had a unique “self-structure,” like a single set of fingerprints shared across all of a person’s versions. This self-structure was the backbone of one’s self, all the fundamental elements that existed apart from those created by random chance.\nChang Yeon was lucky. She’d been born with a distinctive self-structure. Not so for most others, whose self-structure signatures were too weak to be detected in the system. Still, Chang Yeon had only been able to find her own versions because each of them was dying. Scientists had discovered that brains secreted a special substance about two to three weeks prior to their deaths, regardless of whether or not the person knew their death was imminent. This substance sharpened one’s self-structure in a way that made it easily detectable. Each time the sailor had found a version on the eve of death, it had forwarded the personal data to Chang Yeon. Chang Yeon barely read the reports. She figured human lives were the same everywhere, and didn’t give much thought to her other versions as long as they happened to be human.\nFrom an early age Chang Yeon had seen how money shaped the world. While her peers had fussed over celebrities, she’d observed her parents’ social group and appraised their economic power. Her father used to say she had the instincts of a businessperson. But the first boy she’d dated had treated her like an empty-headed doll, born with a silver spoon in her mouth. He’d avoided all meaningful conversation with her, and Chang Yeon had never gotten over the humiliation.\nShe’d been thirty when she first learned about tuning. Since then her life had expanded like a magic ball absorbing everything in its path. Without the large inheritance her parents had left her, she couldn’t have afforded the tremendous cost tuning required. No doubt wealth was important, yet after each tuning, her wealth had felt less important to her.\nNot only did people love and admire the furniture her company produced, but she managed to run the company debt-free in forty-eight countries around the world. What few people knew was that Chang Yeon designed nearly every piece of furniture herself. By a stroke of luck, her first integrated version had possessed a genius level intelligence. Her fourth, fifteenth, and twenty-fifth versions had each brought along their creativity, brilliant logical thinking, and keen aesthetic sense. Now she was no longer just an effective administrator, but someone who understood a worksite’s rhythms, capable of providing the exact thing others required.\nOnce she’d stabilized her company’s expansion, Chang Yeon had turned her attention to developing those intellectual aspects she believed herself lacking, such as a knowledge of history, philosophy, and psychology. All those things she’d so reluctantly memorized in school had come together organically to form a coherent picture in her head. Her thirty-first had shown her how time with a good book was better than watching her investments double. Her forty-third, forty-fifth, and forty-eighth selves all took pleasure in writing, but it was her forty-ninth’s literary skills that had made bestsellers of her three essay collections.\nEvery version added some new talent. From cooking and calligraphy to more subtle aspects such as a fondness for the outdoors or a knack for parallel parking. On their own these mundane skills would’ve been overpowered by each individual version’s numerous flaws. Only together in Chang Yeon could they achieve such an unbelievable synergy.\nNot everyone who tuned was so lucky. Some clients only seemed capable of integrating the worst from themselves and sued the agency despite the exemption clause in their contracts. Not so for Chang Yeon, who may well have been born for tuning. Her versions’ psychological and personality flaws simply disappeared before the many strengths of her integrated selves.\nPeople praised Chang Yeon’s life as perfect, believing it impossible that anything could be lacking. She had more money than she could spend; her fame was just widespread enough to be pleasing without being inconvenient. Academia lavished her with praise, and young people loved her furniture more than they did their video games. Even her husband was perfect. At first, she’d feared that he might disappear, and she would find someone else lying next to her in the morning after tuning. But the sailor assured her the fundamental elements wouldn’t change, and to her relief, her husband continued to exist after every tuning. He was exactly the kind of companion Chang Yeon needed, the single unchanging element in a life where she could change anything she desired. Most importantly, he wasn’t intimidated by his successful wife and didn’t try to reinforce his ego in perverse ways. If soulmates really existed, then for Chang Yeon her soulmate was her husband.\nOf course she had taken other lovers, all young and attractive, but none of them had managed to break apart her marriage. An actor anxious about not being as successful as he would’ve wanted, a purehearted but penniless college student, a drop-dead gorgeous delivery guy with no willpower to break free from his dead-end routine, and a talented funk musician who’d been unable to overcome his addiction to drugs . . . usually she’d chosen someone with a critical part of themselves missing. And after every tuning they disappeared as though they’d never existed. These partings sometimes left a hole in her heart, but they were mostly flings, and always a new irresistible lover just as attractive as the one before appeared in no time.\nEven with all of this, Chang Yeon was not content. Her life was grand and rich, fun but exhausting, tiring but exhilarating. And yet, it wasn’t perfect. Endless possibilities lined up before her, each one waiting to be explored. She was already fifty years old, and she still hoped to achieve so much more. Time passed so fast it sickened Chang Yeon.\n“What reasons can there be for her to say no?” she asked the sailor. “I’m honestly curious. Didn’t you say she would die sometime next week?”\n“Yes, at 10:41 PM on Wednesday next week to be precise.”\nThe sailor’s near instant response chilled Chang Yeon. The sailor knew the past, the present, and the future, not only in this world but throughout all the offshoot worlds where Chang Yeon existed. And not once had it ever been wrong.\nThe sailor told her everything except one thing: the future that she, her most perfect self—“the most integrateable” in tuning terms—faced in this world. The service contract forbade the sailor to tell her that information no matter how anxious she became.\nOf the forty-nine selves Chang Yeon had integrated so far, not one had rejected the offer. The sailor displayed so much sincerity that they could hardly refuse. At the same time it frightened them just the right amount. Most of all, the sailor visited the versions over and over until they agreed. The sailor was not allowed to reveal exactly when, where, and how they were going to die unless they specifically asked. But the sailor told Chang Yeon that they always, eventually, asked. When they asked, they were answered, and then they asked again. By the time they got around to asking that question, though, there usually wasn’t enough time left for extended contemplation. Emotionally-inclined versions became furious, sneered, threatened, ran away, cried, refused to speak, and became angry again, but in the end, they all got desperate. The process was shorter for less emotional versions, but even for them, the final step they reached was always desperation. Until this version. She had but this one chance not only to avoid death and eternal annihilation, but to survive and live a much better life. Why, then, wasn’t she seizing it?\n“It wasn’t a definite no,” the sailor said. “She seems to be hesitating. I don’t exactly know why. But we’ll find out soon since she only has until tomorrow to make her decision.”\nTo die. A version closes their eyes one last time surrounded by loved ones in a familiar world. And then, nothing. Forever.\nTo live. A version must leave their world before their last breath. As they pass between worlds, their body dissolves and disappears. Their personality and talents are transmitted unaltered to the designated world. Their memory? It varied from person to person.\nChang Yeon had once asked the sailor, “How come I can’t remember things I did in the other worlds? How come I can’t remember anything at all?”\nThe sailor had replied, “That depends on what the versions expect from their next life. The amount of memory transferred is inversely proportional to the level of expectation one has for their new life. Your versions mostly admired the life you have in this world. Probably they hoped to forget their regrets and their unsatisfactory lives and wished to start fresh. In that case, their memories would’ve taken another form once transferred. In your case, they manifested in the form of “talents”. Suddenly you’d have a strong urge to learn a new language, right? Or out of the blue you needed to read books on social sciences, politics, philosophy, and so on even though you’d always considered them too difficult to read. Those interests were very likely what the selves had wanted transferred.”\nIt wasn’t hard for Chang Yeon to understand their admiration. Her life was definitely the opposite of shabby or insignificant. Still, she couldn’t help but imagine the funerals of those she’d integrated. First, their families would have reported them missing, and then, after many years when all hope of finding them had evaporated, their empty coffins would have been cremated. All for the sake of her perfect self. She could imagine the devastated families watching the coffins enter the furnace.\nWhat if the situation were reversed and the sailor told her she was dying and proposed moving on to another world, a better world? If somewhere out there, there existed another version of herself that would continue on in a more perfect form? She was glad a better version had not materialized, at least not yet. But she didn’t think it would be an easy decision for her. Yes, she was being purely emotional. But it felt like she’d be betraying her husband, her friends, and all the others who cared about her. Suddenly, Chang Yeon wondered how likely it would be for her to choose to remain in this world and face her death.\n“Maybe,” she said, “it’s because of someone important, like her family or lover?”\n“She has no family. Although there is one who could be described as a friend and a lover, but their relationship is not like anything of this world. As I’ve said, this version is somewhat different.”\n“That version—What was it called? How small did you say?”\n“It’s the Roo tribe. The size varies by individual, but generally they are about three millimeters to one centimeter tall. Your version—her name is Chang by the way—is precisely 5.6 millimeters tall. To be able to communicate with her, I had to take a special form. They are hard to see with human eyes. But their smallness also gives them an advantage. They can move extremely quickly. They fly in an object called a Lu that can travel three to four kilometers per second.”\nThis distressed Chang Yeon. Though she knew there were many unknown offshoot worlds, she never thought she would come across a version of herself that was not human. Certainly not one smaller than her thumb and able to fly around in some strange, superfast aircraft.\nOn the way home, Chang circled over a small harborside city. She’d packed a day’s food a few hours ago, and it would be hours until the afternoon when the sun was best for Lu’s wings to photosynthesize. Chang considered returning home, but instead chose to keep on flying.\nThen the harsh night wind slapped at Lu’s wings, and Chang descended to the small fishing boats anchored below. Through Lu’s senses the smell, chill, and roar of the sea surged over her. The ropes holding down the boats thrashed, while the boats themselves creaked and groaned as if they cursed sky and water. If she allowed Lu their full speed, they could easily fly across half the continent and return before the sun was high. But Chang slowed and spiraled downward until it was too dangerous to descend any further. The spray from the waves barely missed them before collapsing back on to the ocean’s surface. This is insane, Chang thought. She wouldn’t have done anything like this on a normal day. She felt daunted, but not solely from fear.\nThe world she saw through Lu’s eyes was a vast network of hexagons. They spread in all directions with no visible end. The only time Chang could discern anything was when they flew slowly. But when she accelerated, the world shattered with a boom into particles smaller than dust. Hahnoe, her closest friend, claimed the particles moved “imperfectly.” According to his logic, large things were “perfect” and small things were not. Chang always thought this an absurdly simplistic view, but had never said so to Hahnoe.\n“Chang, you’re too fast,” Hahnoe would say, laughing. “Have you ever truly seen a raindrop? Have you ever looked within a snowflake and seen its incredible pattern?”\nShe always answered, with her temper slightly riled, how dangerous such an attempt could be, how it could even kill them. Hahnoe would only sigh and say, “Do you think what you see at your speed is real? There’s no way. What you see is the illusion speed creates. Humans don’t move that fast. They stay at one place for a long while. Until they absorb more things from their surroundings, until they become stronger and more ‘perfect.’”\nHahnoe believed the only way their people could survive was to adopt human speeds. He took the risk of flying close to them at very low speed to observe and listen, and he tried to convey what he learned to the others.\nWhen they’d left the cave, everyone had shared the same thinking, or so she’d believed. Since then, however, their interests had shifted in various directions.\nKinn and some others had embraced more direct and confrontational tactics. They sought to bring humans down by infiltrating them through vulnerable parts of their bodies, like their eyes and ears. They’d proposed starting with one or two houses and then spreading over a town until eventually all the humans in this world were defeated and the Roo kingdom restored. They’d convinced others to join them, and Kinn had held fast to the idea that their tribe could “grow” by doing so. It’d all seemed like such an unachievable goal to Chang, but she’d found that she could empathize with Kinn. After all, who in the world hadn’t felt enraged by their own helplessness?\nHahnoe’s stance was the exact opposite. Hahnoe worshiped the enormity of these sluggish humans. While Chang held no prejudice against this belief, flying slow was not her way. Her body and her heart craved speed. When she overtook everything around her, and her Lu soared into the sky shattering the air like an explosion, she felt enraptured, and more alive than at any other time.\nAfter coming out of the cave, Chang had traveled to many places. She didn’t have as much experience flying as others in the tribe, but her Lu was fast. She could fly to almost anywhere and return in one day. But she couldn’t exit the Lu and walk on the ground unless they were home. The risks were too great. There were human feet slamming down everywhere, gigantic water droplets that could fall without warning, and merciless insects and other animals with their flashing claws.\nChang hadn’t really understood the contours and shapes of everything that filled the lands and seas. They always broke apart into infinite fragments at great distances and dissolved into foam. But not once had she ever considered this mess ugly. Things didn’t need to have a clear meaning to be beautiful. But she couldn’t describe what she saw the way Hahnoe described the rivers, mountain ranges, and humans he’d seen. She simply noticed the chaotic dance of fragments, the tremors and fragrances they left in their wake. If only they stayed longer, maybe then she would make sense of them.\nNow what the stranger had said weighed heavily on her mind. What if I really die next week and the world just ends for me? What if everything I’ve seen during my entire life has been nothing but broken pieces, fakes, mere illusions scattered in the air? I wish that I could convey what I’ve seen, that there could be someone flying with me to share these indescribable feelings and recognize that all this is real.\nBut others in the tribe didn’t share her sentiment. They focused on matters more important. Besides, Chang couldn’t meet another Roo in flight; they were too small and too fast.\nThe waves rolled on by, close enough to overtake her at any moment, enormous and unknowable. Amidst Chang’s fear, faint and slender pillars of feeling grew. She wasn’t sure whether it was hostility, obstinacy, or something else. If Hahnoe were here, he might’ve gone even closer. But when Chang believed she’d reached the limit, she trusted her Lu to ascend, and flew high into the sky. When she turned toward the moon, hundreds of dim sliver fragments filled Lu’s eyes. Faster! Chang trusted with all her heart, hearing the beat of Lu’s quickening wings. Hahnoe had said flying too fast would shatter their bodies into bits. But Chang had never been to a place as far away as the moon. No matter how hard she tried, she couldn’t get any closer to that glowing mass. Even those who had traveled the seas, the canyons, and the deserts knew nothing about the moon.\n“The moon? It’s too far for us to reach,” Hahnoe had said. “And still it looks so big. The magnitude of its size must be beyond our comprehension. I doubt we’d be able to measure it with our units like kruho or even pruho. We should focus on what we can do, even if it takes a long time or puts us at risk; we have to start with the things we can reach. You’re so unwilling to compromise or try to understand.” The moon and the stars remained fixed in their places while Hahnoe’s remembered voice rang in her ears. If I could just fly faster, Chang thought, if only I could fly fast enough.\nAfter her husband went to bed, Chang Yeon made a cup of coffee and sat in front of her computer. She couldn’t sleep and felt sick from the wine she’d had at the early birthday party her staff had arranged for her.\nWhy do humans need to sleep when time slips away so quickly?\nThe more tunings she completed, the more difficult it became to idle away her time. She couldn’t bear the idea that there were worlds unknown to her, things outside the scope of her logic. She was frustrated at this obsession. She considered what the sailor had told her and felt as though her brain was dissolving into sand. But sailors didn’t lie, and there was no reason for them to fabricate such a story. She entered some words into the search prompt and waited.\nShe’d been right. The Roo tribe also existed in her world, only with a different name. In this world, they were called Rods and Chang Yeon had seen a picture of them online long ago. Six or eight winglike components symmetrically attached at an angle to a long stick. Images of these objects, flying at unimaginable speeds, had been captured across the world, from crowded city cafés to open fields in the countryside. Some had claimed that they were evidence of alien beings, while most everyone else had assumed they were insects distorted by the technical limitations of the cameras. In time, people had lost interest in them. But what the sailor had described was not a bug. It was a plant as well as an animal; a living creature in the sense that it had an organic body, but a machine in the sense that it only moved by commands. And it was the only means of transportation available to the Roo people.\nAccording to the sailor, Lus were hollow inside like bamboo stems, with a thin detachable film covering their tops and bottoms. If they rotated as they flew, and if that image was captured in several layers due to some distortion caused by light, they might resemble the Rods in the old photos. And Chang, the fiftieth version of Chang Yeon, was flying in one of them.\nCivilizations in offshoot worlds developed differently from each another. Despite their keen eyes and extensive extradimensional knowledge, sailors had been unable to understand how the mutant Roo tribe could’ve existed in Chang’s world. It was only after exhaustive searching that Chang Yeon’s sailor had found a legend about ant-sized people supposedly living in a limestone cave somewhere in that world’s southern Africa. The cave was not far from the Sterkfontein Caves, where the fossilized skull of a primitive human from over two million years ago had been uncovered. Scientists overlooked this other cave since it sat so close to Sterkfontein’s shadow. Since then the sailor had made numerous voyages to the cave in an attempt to learn more. Finally, deep in the cave where dim light entered through the cracks in the cave’s ceiling, it had spotted some odd-looking plants and noticed the tiny people living in a colony around them.\nThese plants, which the tiny people called Lu, looked like freeze-dried centipedes sprouting from the ground. The cream-colored stems had countless segments, and where each segment met the next, two leaves sprouted from the gap in a way that formed a spiral around the stems. From time to time, the tiny people clung to the plant stems like ants and drank the sticky sap flowing from between the segments, but beyond that, the sailor hadn’t seen them eat anything.\n“Their population is about one thousand,” the sailor had explained, “and they appear to have a level of intelligence comparable to humans. They communicate in their own spoken language and are capable of making simple tools.”\nThe sailor had gone on to outline the Roo, as the tiny people were called, in more detail. In most ways they appeared to be identical to larger humans. Their eyes seemed accustomed to darkness, but they were not distressed by light. They went about naked and had black hair and somewhat dull skin. There was little distinction between genders: the males were slightly taller than the females, but they all looked feeble to the sailor. Interestingly, they had lacked visible genitalia.\n“They have managed to adapt to the environment inside the cave, despite being vulnerable to most outside stimuli. But those who have ventured outside the cave often perish within the first few steps. They preserve themselves not by reproduction but by rebirth. When one of their number dies, they put a few drops of sap from the Lu plant on the dead body. Exactly seventy-two hours later, the dead return to life.”\nChang Yeon had been biting her nails as she listened to the sailor. She knew she should respect the diversity of offshoot worlds and acknowledge all the possibilities that existed in them. But . . . this was too much. Oblivious to her confusion, the sailor continued on.\n“What’s more interesting is that they all come back to life with young bodies. Some are quite old and had limited mobility at the time of their death. But after the Lu sap is applied, they all awaken looking to be in their late teens or early twenties. This sap clearly has some kind of mysterious regenerative powers for these people. Whether this also leads to a mental renewal, I cannot say. Regardless, their skin looks firm, they move with great energy, and in all aspects they appear significantly healthier. In this way, the tribe maintains their population at a constant level. All who die are reborn, and no one new is born. No children exist in this tribe. I’d have noticed any babies for sure. But there were none. They appear not to reproduce.”\nThe Sailor paused a moment. “However . . . Chang, your fiftieth version, was born to a Roo woman exactly three years ago.”\n“What is that supposed to mean?” Chang Yeon tried to make sense of the sailor’s words, but failed. “You just said yourself that they don’t reproduce. Besides, all of my versions have been born at the same time and place as myself, in a hospital in Seoul fifty years ago. I understand that different environments create different versions of myself, but how could a version of me have been born in a cave in South Africa? And only three years ago?”\nThe sailor looked into Chang Yeon’s eyes for some time before continuing on in a more comforting tone.\n“That’s the tricky part. The body Chang was born into once belonged to an ordinary Roo woman. Like others in the tribe, that woman had come into existence at some point in the past and gone through hundreds, possibly even thousands of rebirths. Her self-structure didn’t match yours at all. But three years ago, she died of natural causes, and when she returned to life three days later, she had a completely different self-structure. Now, post-rebirth, her self-structure matches yours. Since nothing like this has never happened before, we suspected an error in the tuning system at first. But we’ve checked multiple times and always obtained the same result.”\nChang Yeon, unable to respond, rose from her chair. She went to the window and looked out onto the quiet streets beneath the darkened buildings. It seemed like any other cold February night. The tuning system was known to have a 99.82 percent accuracy rate. An error hadn’t occurred in over ten years.\n“If you don’t feel comfortable with this, you may cancel this tuning. It’s not a problem at all. Given the particularity of the situation, we don’t encourage you to go through with the procedure. We only continued because we knew this tuning mattered so much to you. I apologize for not having informed you sooner, but we needed time to be certain of our findings.”\nChang Yeon stared at the sailor.\n“ . . . How come she’s dying? You said they can be endlessly reborn.”\n“From the very beginning, the Roo people have worshiped the Lu plant. We were able to confirm this based on our research into their language and culture. It was this absolute power that promised them eternity, and the sap, which they called ‘God’s tears,’ had saved the fragile tribe from the danger of extinction. They’d become immortal beings with peaceful, idyllic lives. Yet some chose to leave the cave. Hundreds of them had been reborn with the same desire. They cut the divine stems into hundreds of internodes and entered through the films. These young people had remained there for several days when something extraordinary happened. The plant pieces began to function like animals. What they had thought were leaves were actually wings.”\nChang Yeon’s eyes widened as the sailor went on.\n“But these separated internodes didn’t produce ‘God’s tears’ anymore. Those back in the cave believed this was a punishment for the blasphemy the young people had committed. Hundreds of Roos remained in the cave, living out their immortal lives. The ones who left, however, lost their immortality. These then scattered across the world and slowly began dying out. For many, adapting to their new environments lay beyond their abilities. Outside the cave, they’d had to hunt and gather their own food. The cave-dwelling Roos had the ability to retain their experiences across countless rebirths, but those outside could no longer remember anything from their past lives. We were unable to determine if anything else had changed since their last rebirth or if this is all the result of cutting the Lu plant and leaving the cave. At any rate, all of their former experiences are gone.”\nChang Yeon didn’t know what to say.\n“Do you understand now?” the sailor had asked. “They are cut off. Isolated. Without the shared memory of their people, their chances of survival are extremely low. And since they don’t have ‘God’s tears,’ it’s impossible to bring their dead back to life. Some have changed their minds and returned to the cave. Yet others remain outside, rejecting eternity and carrying on their lives, struggling to adapt to the world’s hostile environments. Only a few dozen survive now, including Chang. I don’t know if it’s coincidence, but in that offshoot world, Chang found her way close to where you were born. Now, with some of her peers, she makes her home in Seoul.”\nShu was dead. Chang learned it from Hahnoe when she returned home.\n“It was a young person,” Hahnoe said in a mournful tone, “a young human. Pio saw it happen, and I went with a few others to retrieve the remains.”\nChang couldn’t say anything. Hahnoe was covered in blood. He was resilient, an experienced combatant and a skilled pilot. But Chang saw that he was barely able to contain his fury and grief. How could he not be shaken? Many had gathered at the center of the habitation site, and Chang assumed that was where Shu’s body was. The air was thick with a tense silence. Among those gathered were Kinn and her gang. Kinn glanced over toward Hahnoe.\n“This is the reward they give,” she said in a mocking tone, “the high and mighty humans that you idiots worship.”\n“Shut your mouth, Kinn,” Hahnoe yelled.\nChang walked over to Pio. He cowered in a corner, trembling from shock and fear. Saliva dribbled from his half-open mouth and ran down his chin. Friends were trying to calm him down, but to little avail. It was some time before Pio gathered himself enough to explain what had happened.\nThey had gone into a human’s house on the outskirts of the city. Shu had been drawn there by an open book like an ant to sugar. After surveying the book from above, Shu had landed his Lu and walked out to take a closer look at the page. He was so absorbed in the elegant black lines that he hadn’t heard Pio’s urgent cry as an enormous finger had descended to the page. Roos feared the young humans more than the older ones because young humans saw things that adults couldn’t. Shu had forgotten this most basic protocol, captivated as he had been by the words on the page.\nA black, E white, I red, U green, O blue: vowels,\nI shall speak one day of your hidden origins:\nA, black furred-corset of bumbling flies\nBuzzing like bees round a cruel stink,2\nChang remembered the day Shu had sung these verses. It had been winter then, too, and as cold as today.\nHahnoe considered each of the seasons beautiful, but Chang found the winter unbearable. It must have been the same for the others. They’d covered the entrance of the tin pail in which they lived with a thick piece of cloth. But that hadn’t been enough to shut out the bitter winds, and everyone had shivered.\nAs they huddled around the brimstone bonfire they’d made, Shu sang, his eyes sparkling. The song was not their own, but one translated from a human language. Chang knew flies were dangerous animals but didn’t know what a corset was. She knew the colors black, white, red, green, and blue, but didn’t understand the words in between them nor what vowels were. Roos could count numbers, mark the passing of time, measure spaces, and make simple tools. They also drew and painted. But they didn’t have a written language. They communicated by spoken word alone and had to repeat what was conveyed several times so they could be sure to remember it. Hahnoe had once told Chang that writing was the materialization of meanings and that it remained long after people died. She couldn’t comprehend what that meant.\n“If we could record what we mean with letters,” Hahnoe had said sadly, “we’d be able to make more complex tools and hunt much better. We might even be able to make machines like humans. Damn it! How come we don’t remember anything? Those who once used our bodies might have known how to do all that stuff. Maybe they could’ve done it, but just hadn’t. Why can’t we remember a single thing?”\nHis yearning was something that Chang didn’t understand, despite the fact that she couldn’t remember anything either.\nAt first, it was very hard for her to accept the fact that someone else, someone who wasn’t her, had occupied her body. But that no longer bothered her. Whoever they had been, they were long gone. Now Chang had Hahnoe and Lu. Lu was not just a machine, but a part of herself, a living being that loved speed as much as she did. Those who had decided to leave the cave had one thing in common. They had known that they were no longer who they had been before and so therefore they had to leave. But now that they had left, Hahnoe’s eyes were always turned toward something different than Chang’s. Maybe that was why she loved him.\nThat day, sitting by the bonfire, Chang had asked Shu where he’d learned the song. He’d answered with his usual faraway look. “I don’t know,” he’d said. “Maybe in a dream.” Everyone had laughed.\nSuch had been Shu’s way: he’d often said strange things that no one understood and had dreams that no one else dreamed. While Hahnoe agonized over not being able to understand human letters, Shu had admired them with pure wonder.\nNow Shu lay wrapped in black leaves, his Lu standing like a barrel outside the circle of people. It had flown back home safely, but without Shu it was nothing more than an empty shell. At the very moment his body had been crushed, Shu had trusted his Lu to flee.\nHahnoe stood suddenly, lifting up Shu’s body. He pushed his way through the crowd. The Lu opened to receive Shu’s body. This act was meaningless, but no one tried to stop Hahnoe. Tears flowed, but not from the Lu: it didn’t weep tears now and there would be no rebirth in three days. The time when Lu had been a god, when it had given back life again and again, was over. Like those who had been destroyed before him, Shu could never again sing any songs or tell any stories.\nChang Yeon was still awake and thinking about Chang, the 5.6-millimeter-tall woman, when the sky turned pink the next morning.\nTuning only involved mental integration. Because each version’s body was not able to cross between worlds, a tuning client didn’t need to worry about whatever physical flaws their version might have possessed. Integrating this tiny, fragile Chang wouldn’t shrink Chang Yeon’s body or create any physical problem for her.\nAt each tuning, Chang Yeon had pictured the version she was integrating. They all looked similar in her imagination: women in their thirties and later forties with slight variations in clothing and hair. Though Chang Yeon was grateful for the diverse abilities her versions brought her, there was one difference she had begun to wish for: a younger version of herself living outside time and capable of bringing her body along for integration. Her desire always ultimately led her imagination there.\nWhat feelings and sensations did someone in their late teens or early twenties perceive?\nChang Yeon couldn’t really remember what it had been like during her own youth. Thanks to her wealthy parents, she had never had to struggle with the trifling worries of life. She recalled thinking everything dull, and once or twice she might’ve wished, with typical juvenile confusion, that her life could end right then. But these were all very faint memories.\nThe tuning procedure only took three hours at most and resulted in no pain or negative aftereffects. To the wealthy, tuning was comparable to getting a simple cosmetic procedure or making a big investment in a new startup. All Chang Yeon had to do was take the sleeping pill that the sailor provided. Recognizing new desires, interests, tastes, and talents she’d integrated usually took several weeks. The integrated selves never staged any resistance by bringing along their own memories or caused her any discomfort. They always blended into Chang Yeon’s consciousness without hesitation and quietly surfaced only when strictly necessary.\nStill, it felt strange like making the acquaintance of someone kind but reserved. They were always polite and gave her lots of useful information, but never opened themselves to her. Never had she encountered a case where the integrated version had pushed her life in an unwanted direction, or made her do something absurd and unthinkable.\nBut if it were a version that grew up in an environment so different from mine . . . If there were a young and bubbly version of myself, full of life and carefree, absorbing everything they felt with every part of their body.\nOut of nowhere, Chang Yeon saw in her head a little child running toward her with a big smile.\nShe was startled and perplexed. Since they’d wanted to focus on themselves, Chang Yeon and her husband had decided not to have children. She’d never doubted this decision. Rather, people who dedicated their entire lives to their children baffled her. She found that as her perplexity deepened, she felt, this image of a child grew increasingly clearer. She thought of an old friend who had remained by her side through all the tunings. Even when she’d been having so much trouble with her teenaged child, and her face had glowed as she’d talked about the child’s small displays of affection. While Chang Yeon had gone through forty-nine tunings, this friend had thrown all her energy into this small creature that resembled her, spending decades basically letting it run her life.\n“Raising a child is insane,” the friend had told her. “Doesn’t matter whether they’re two or twenty. They drive you out of your mind just the same.” Yet always the friend would add, “But you know what’s funny? When I look at those round eyes, small fingers, and chubby cheeks, I feel like I shrink down to nothing, like I matter less than a dot or something even smaller when compared to that child. And amazingly, that doesn’t bother me.”\nShe’d gone on to tell Chang Yeon that though children naturally went against their parents’ wishes or expectations, they also occasionally created unimaginable joy.\nChang Yeon couldn’t conceive what that must be like.\nIf it had been Chang, maybe she’d have been more than just a polite acquaintance. Maybe she’d have taken Chang Yeon’s life in a whole new direction, shaken up her days and made her laugh until she cried, or wept her eyes out. If Chang were integrated into her, maybe Chang Yeon wouldn’t feel that heavy weight in her heart, which was how she felt whenever she was making a list of new things she’d have to learn and master after a tuning. She might be liberated from the urgent whispers nudging her toward a cliff, her obsession with time, the fear of never being good enough no matter how hard she tried. Maybe she’d learn to stop thinking about herself until her head spun. If it were Chang, maybe she would become both Chang Yeon and Chang Yeon’s child at the same time.\nBut Chang Yeon couldn’t fathom how a person who wasn’t a fifty-year-old human, but a Roo just entering adulthood might think and behave. A child who had the courage to cut apart what her people considered God. Chang Yeon sighed. The fact that Chang had defied her faith and chose to become a mortal being fascinated Chang Yeon beyond description. It was so far from a decision she herself would’ve made. There was only one day until the scheduled tuning, and she needed to ready herself.\nSince she was born a warrior, she must be tough. And since she’s an aviator, she’s got to be quite adventurous. But she isn’t human. She doesn’t even know how to dress herself. She might be ignorant, considering how her people don’t have a written language or any systematic compilation of their knowledge. That might have a negative effect on my intelligence. But . . . has a flaw ever manifested? She’s a free spirit. Apparently, she likes flying much more than other Roos. But she lives in constant fear for her life. And now that she’s told she’s dying . . . She must be in despair. But, I’ve never discovered feelings of fear or despair after a tuning.\nChang Yeon lost herself, trying to understand that tiny mysterious being. Her Roo version was a wild risk-taker, and Chang Yeon found that irresistibly attractive. Chang Yeon lay on her bed and buried her face in the soft pillow. As the softness touched her skin, her mind lurched toward fear. Nausea filled her.\nShould I cancel the procedure? But what if she’s decided to agree? She might be full of hope.\nEventually, her body surrendered to her exhaustion, and she fell asleep without reaching any conclusion.\nWhen Chang Yeon opened her eyes, it was already past 4 PM. Only two hours remained until the deadline. She called the sailor. It reported that Chang hadn’t made up her mind yet. Chang Yeon hesitated a few moments.\n“How does she . . . die?” she asked.\n“What do you mean?”\n“On Wednesday next week, at 10:41 PM. How does she die?”\nThe sailor paused. “Do you really want to know? Might it not be better otherwise? It will only be a depressing memory.”\n“Since it’s not my future but hers, you are allowed to tell me, aren’t you?”\nThe sailor remained silent for some time before replying. “According to the system’s prediction, she freezes to death. It starts snowing in the afternoon and gets heavier into the night. Your version crashes while flying her Lu, and they get buried under snow. She freezes almost instantly upon impact.”\nChang Yeon couldn’t find the words to respond.\n“They are tiny beings. Even a few snowflakes can kill them,” the sailor said.\nWhen Chang Yeon remained silent, the sailor sighed. “That’s why I told you it’d be better not to know.”\nChang Yeon terminated the call.\nIt was around 6:30 PM when the sailor called her again. “Her final answer is no,” it said. A soft gasp escaped Chang Yeon’s mouth.\n“She said she wouldn’t come,” the sailor continued on. “I apologize on behalf of the agency for this outcome. This is a few hours early, but I’d like to wish you a happy birthday.”\nThe room suddenly felt cold, and she was again a little nauseated. She lay on her side, embracing her knees. Chang Yeon couldn’t tell whether what she was feeling was relief or disappointment.\nAt that moment, a memory from years earlier popped into her mind.\nHer career had been full of successes, but there had been one failed project that had remained bitter in her heart. It was for an event they’d held for her company’s anniversary. One selected participant could request a customized piece of furniture. It could be anything, in any material or design. The event attracted a lot of attention, and people had gone wild over it. The winner had been a seventeen-year-old girl. She’d been dressed in a flimsy summer uniform, although fall had been in the air, and she’d requested a large luxury armchair with very good leather. Not something a girl that age ought to have wanted, Chang Yeon thought, so she’d asked whether the chair was for her dad.\n“No,” she’d said. “I want dark-colored leather, something tough and durable. It’s just for myself, so a single seater is good enough. When I sit in it, I want to be able to feel relaxed . . . and secure.”\nShe’d had her arms folded and kept rubbing her skinny forearms as she spoke. Chang Yeon decided to use steel frames and the highest quality leather, dyed a dark brown. She’d used a very simple design and made the chair fifteen percent bigger than a regular armchair. She’d put so much care into achieving the right firmness, checking it again and again until she was completely satisfied with how it felt. The finished chair had resembled some kind of large animal, dignified and loyal to its owner.\nBut when they’d called the girl to arrange delivery, she’d suddenly changed her mind.\n“I’m sorry,” she’d said in a low disheartened voice, “but I can’t take it. I’m really sorry. Please give it to someone else.”\nChang Yeon thought even from the start, the girl must not have had space to accommodate the chair. And even though many years had passed, the image of the tiny goose bumps on the kid’s forearms came to her mind from time to time for no reason. Chang Yeon burrowed further beneath her blanket.\nSometime after midnight, there was a knock at the door. Her husband stood outside smiling a little bashfully with a cake in one hand and a small gift box in the other.\nOn the top of the cake was a long sentence written in fine lines of chocolate. It read, “To my wife, Chang Yeon, the most perfect and beautiful woman in the world.”\nChang trusted her Lu to maneuver rapidly and zigzagged into the night sky. Lu’s wingbeats slowed. For the first time, Chang got a good look at winter.\nThe landscape was desolate, the moon hidden behind the thick clouds. Pure white lumps fell from the sky. Snow. Chang had never seen it before. Whenever it snowed, Roos stayed home and didn’t fly. Hahnoe had called them beautiful lumps of death, and she could see that he’d been right. The snowflakes were slower than Chang, but they flew in all directions as if they sought to strike her. Lu’s eyes twitched with growing fear. But Chang believed in them.\nChang thought of Hahnoe and of Shu, and then she recalled an old memory.\nA group of friends, drenched in sweat, had pushed Chang’s Lu up to the lowest branch of a birch tree. Chang held on to Hahnoe’s hand and climbed up, struggling to keep her eyes fixed on the next handhold. When she got inside Lu and plunged through the air from the branch’s tip, fear overwhelmed her. What if Lu’s wings didn’t move as she wished?\nShe’d felt the enormity of the world around her and the dizzying despair from how everything stayed in its place. Her body still tingled when she remembered that moment. Chang had been the only thing trying to break away from its place, and she could almost see the sharp mandibles of ants pouncing on her crushed body. But finally, after she’d repeated her desire what felt to be hundreds of times, Lu finally started moving its wings. A pathway she’d trusted appeared before her in the void, and she realized it was a flow that she could control. She remembered the electrifying thrill that had gone through her body then when she’d made her first path through the air.\nAnd now, Chang was trying to escape the snowflakes and reach the moon.\nLu’s wings were already soaking wet. But Chang strained her entire body and committed all of her trust to Lu. Up close, the snowflakes were integrations of countless hexagonal crystals, resembling Lu’s compound eyes. Even though the flakes were fighting to dampen Lu’s wings further, and send Chang plummeting back down toward the earth, they were nothing more than fragile crystals that could melt away in moments. If they were indeed fragments of the moon as Chang believed, then it stood to reason that the enormous, distant moon couldn’t be so perfect as to be unreachable.\nThere were many things that Chang didn’t know. She’d never observed the world in detail or really comprehended it. But she knew that she, together with her Lu, which had become part of her, could fly fast enough to evade these huge frozen water crystals veering at her from all directions.\nWithout her Lu, life in some other world would be meaningless. Chang trusted Lu to their full speed.\nFaster!\nSoon, they reached a speed she’d never imagined possible.\nThe tuning system that claimed to make “perfect sails” was not truly perfect yet, and its prediction was accurate only up to 99.82 percent. In a small, lesser known offshoot world of the countless many, the life of the Roo aviator Chang ended, as predetermined, at 10:41 PM on a Wednesday in February. Except she wasn’t buried beneath snow as the system had predicted: instead, she’d flown higher and faster between the falling snowflakes, until she burst into red flames the instant she and her Lu escaped the Earth’s atmosphere.\nIf the Roo tribe had possessed letters to record meanings, they would’ve written the following about Chang: She was the Roo who had flown the fastest and the farthest, the one who came the closest to the moon in the whole history of the tribe.\nOriginally published in Korean in Modern Literature, May 2008.\nPublished with the support of Literature Translation Institute of Korea (LTI Korea).\nFootnotes:\n1 - Kruho: the unit of length used by the Roo tribe. One ruho is approximately five millimeters, and one kruho is one thousand ruhos, about five meters.\nI-Hyeong Yun is a Korean writer. She debuted in 2005 with a short story, \"The Black Starfish,\" which won her the Joong Ang New Writer Award. Since then, she's won multiple awards for \"The Big Wolf, Blue\" (2007), \"Koon's Journey\" (2014), and \"Luka\" (2015). Most recently, she won the 2019 Yi Sang Literary Award for \"Their First and Second Cats.\" In 2015, her story \"Danny\" was translated into English as part of the series.\nJustin Howe was born and raised in Massachusetts. His work has appeared in Strange Horizons, Spacesuits & Sixguns, and The Internet Review of Science Fiction. His story \"Skillet and Saber\" will appear in the anthology Fast Ships, Black Sails available from Night Shade Books in October 2008. He is a graduate of the Odyssey Writers workshop, works for an architectural preservation company in New York City, and belongs to the Homeless Moon.", "source": "https://clarkesworldmagazine.com/i-hyeong_01_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Perfect Sail by I-Hyeong Yun, translated by Elisa Sinn and Justin Howe"}