{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Alethea Kontis", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "bS5+unopeq8ozTSX9x5wIWt3vZU=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: Breathing Life Into Characters  Most people hate the sound of their own voice. I was never that kid. My parents gave me my very own cassette recorder at the age five or six. When I wasn’t listening to read-along Alice in Wonderland, I would lock myself in the bathroom and record inspirational speeches about how important it was for people to love one another and to put good things out into the world. Not long after, I became an actress on stage and television.  As an audio narrator, my voice has never been my problem. But breath . . . good heavens. I have come to hate my own breath.  When my debut fantasy novel Enchanted sold to the big NY publishers in 2010, my friends at Brilliance Audio asked if I wanted to narrate my own book. I knew enough about voice acting to know how severely lacking I was in practical experience, so I declined. I wanted Katy Kellgren, I told them, my Audio Dream Girl. (And I got her, bless her beautiful, dearly-departed soul.)  But their suggestion both flattered and inspired me. I bought a Blue Snowball mic, downloaded Audacity, and started Princess Alethea’s Fairy Tale Theatre in an effort to teach myself everything I could about voice recording.  Seven years later, I contribute my voice regularly to IGMS and the various Escape Artists podcasts. I just upgraded my Blanket Fort Studio into a rather posh recording booth.  Room noise was always a constant annoyance. I met someone from NPR who told me about the cheap trick of throwing a blanket over my head. During my tenure as a judge for the Audie Awards, I learned how many successful Audio publishers got started in a walk-in closet, due to the sound-dampening effects created by masses of clothes. I spent a lot of time sweating under blankets and huddled in closets. I envied the professional studios at Brilliance Audio and the home studios of my friends (looks at Kate Baker). The walk-in closet in my house here in Florida has a little alcove cut in the back—as if fate put it there—just for me. Thus, Blanket Fort Studio was born.  Another one of the first lessons we all learn at the beginning is to SLOW DOWN. I worked hard on that. I taught myself how to breathe while recording (there are also mouth exercises/forms you can train yourself to do to keep your tongue, lips, and teeth out of the way when speaking). I learned where to place the microphone. I bought green apples to reduce mouth noise. I practiced all the sensible and silly tricks. Once I became comfortable with the details, I got to settle into the characters.  THIS is where all that acting I did as a kid comes in. For me, it’s like putting on comfy clothes. This is where I get to make the magic.  Kate Baker and I recorded my Wild & Wishful, Dark & Dreaming in her home studio. Kate did the heavy lifting and narrated the lion’s share of the collection. I popped in like a Special Guest Appearance, reading both of the poems and a few of the shorter flash pieces. I hoped my contributions wouldn’t be too much of a departure from Kate’s narration—she and I have very different styles of delivery. Kate’s voice is calm, even, and intimate. I’m still that emphatic Greek girl on stage, projecting all the way to the back row.  I loved reading in Kate’s studio. LOVED it. The poetry in particular. I remember at one point, in the middle of “Deathday”—I felt like Megan Follows delivering Anne Shirley’s passionate recitation of “The Highwayman” to a room full of Canadian sophisticates. It felt beautiful.  When I asked Kate about my pieces later, she said something like, “You have the kind of energy audiobook readers love. I wish I could do that.”  Now, let’s remember, Kate is the one whose honeyed voice has brought home multiple awards. I still consider myself quite the glorified amateur. But when she asked me to explain my process, to describe just how I conjure my magic inside that studio, I found myself at a bit of a loss for words.  “Write it for me, then,” she said.  So here I am, per Kate’s request, to attempt this near-impossible feat. Ready? Okay. Here we go.  First, I read the manuscript. Scan it through. It’s an obvious first step, but that’s where I start. I pinpoint every name and word that might trip me up and get those questions back to the author ASAP.  Then, I read the manuscript again. This time, with the eye of the actress-cum-writer. Who are the characters in the story? Not just their names . . . who are they? What are their ages? Their backgrounds? What do they want from the main character? If it’s the main character, what do they want from life?  I consider voice—not just the characters, but the voice of the piece as a whole. The tone. If I am not the author of the piece, I don’t know what the intention was as written. So how does it speak to me as a reader? How dark will we be getting? How sexy? How hopeful? What message will this story ultimately convey? I look for places where I might need to build intensity and where I might consider pulling the punch—letting the words deliver the power instead of my voice.  Then I read it out loud. This is where the magic happens. I say magic, because this step is where my subconscious takes over. This is the part that’s harder to convey.  When I read a story out loud, two things happen with the voice.  The first is accent. Sometimes I am given specific direction with the accent, like in Steve Vernon’s Nova Scotia ghost story, or Bogi Takács’s Hungarian SF “Given Sufficient Desperation.” Sometimes, the accent evolves as I read the tale. I wasn’t three sentences into H. L. Fullerton’s, “A Century of Princes” before it started coming out in a British accent. So, I went with it. I turned the assignment in early, just in case IGMS wanted me to redo it, but they didn’t.  Rati Mehrotra personally thanked me for giving an accent to the women of “In the Woods, My Voice.” Again, not a conscious choice. That’s just how her story read to me.  For the piece I just finished for Escape Pod, Samantha Henderson’s “My Generations Shall Praise,” I was partway through the first reading when I thought, “I should maybe do this in a southern accent.” They hadn’t asked for such a thing, but I was getting that sense. As soon as I hit the “Bless your heart,” line, I knew my gut had been right once again.  Since “Generations” was the first project I did in the renovated studio, I ended up having to record it quite a few times. First time around, I was too close to the mic. Second time around I shifted my position partway through the reading, which meant I had to go back and record the first section again. But during all those readings, that second magic thing happened with my voice.  Rehearsing a piece—be it for an audio recording or a live performance—still feels like prepping for an audition. You get to the point where you’ve read that same monologue so many times, you become the character. You add laughter into lines where there had been no direction to do so, because that’s what your character would have done. You insert a scoff or two. A bit of mockery. A bit of melodrama. The character becomes real to you in a way that’s different from how it becomes real to the author or the listener. The character becomes real inside you.  The reason I shifted partway into the second reading was because that was the moment I became my character. I had leaned back against the studio wall, tired and disaffected. I wasn’t Princess Alethea anymore. I was a sociopathic baby killer on death row, debating whether or not to allow my rich cousin to map herself onto my brain meat when I was gone. I worked all the angles, all the way up ’til the end.  I think, perhaps, it might be my best performance to date.  But that’s the point of this exercise: to never stop learning. To constantly be improving. To call on those ghost of my past—all that acting muscle memory—and put it to good use. To breathe life into characters brilliantly penned, adding my voice to the author’s in a magnificent collaboration.  And, ultimately, to continue putting good things out into the world. Alethea Kontis is a princess, author, fairy godmother, and geek. Her bestselling Books of Arilland fairytale series won two Gelett Burgess Children's Book Awards (Enchanted and Tales of Arilland), and was twice nominated for the Andre Norton Award. Alethea also penned the AlphaOops picture books, The Wonderland Alphabet, Diary of a Mad Scientist Garden Gnome, Beauty & Dynamite, The Dark-Hunter Companion (w/Sherrilyn Kenyon), and a myriad of poems, essays, and short stories. Princess Alethea lives and writes on the Space Coast of Florida with her teddy bear, Charlie.", "text": "Non-Fiction\nAnother Word: Breathing Life Into Characters\nMost people hate the sound of their own voice. I was never that kid. My parents gave me my very own cassette recorder at the age five or six. When I wasn’t listening to read-along Alice in Wonderland, I would lock myself in the bathroom and record inspirational speeches about how important it was for people to love one another and to put good things out into the world. Not long after, I became an actress on stage and television.\nAs an audio narrator, my voice has never been my problem. But breath . . . good heavens. I have come to hate my own breath.\nWhen my debut fantasy novel Enchanted sold to the big NY publishers in 2010, my friends at Brilliance Audio asked if I wanted to narrate my own book. I knew enough about voice acting to know how severely lacking I was in practical experience, so I declined. I wanted Katy Kellgren, I told them, my Audio Dream Girl. (And I got her, bless her beautiful, dearly-departed soul.)\nBut their suggestion both flattered and inspired me. I bought a Blue Snowball mic, downloaded Audacity, and started Princess Alethea’s Fairy Tale Theatre in an effort to teach myself everything I could about voice recording.\nSeven years later, I contribute my voice regularly to IGMS and the various Escape Artists podcasts. I just upgraded my Blanket Fort Studio into a rather posh recording booth.\nRoom noise was always a constant annoyance. I met someone from NPR who told me about the cheap trick of throwing a blanket over my head. During my tenure as a judge for the Audie Awards, I learned how many successful Audio publishers got started in a walk-in closet, due to the sound-dampening effects created by masses of clothes. I spent a lot of time sweating under blankets and huddled in closets. I envied the professional studios at Brilliance Audio and the home studios of my friends (looks at Kate Baker). The walk-in closet in my house here in Florida has a little alcove cut in the back—as if fate put it there—just for me. Thus, Blanket Fort Studio was born.\nAnother one of the first lessons we all learn at the beginning is to SLOW DOWN. I worked hard on that. I taught myself how to breathe while recording (there are also mouth exercises/forms you can train yourself to do to keep your tongue, lips, and teeth out of the way when speaking). I learned where to place the microphone. I bought green apples to reduce mouth noise. I practiced all the sensible and silly tricks. Once I became comfortable with the details, I got to settle into the characters.\nTHIS is where all that acting I did as a kid comes in. For me, it’s like putting on comfy clothes. This is where I get to make the magic.\nKate Baker and I recorded my Wild & Wishful, Dark & Dreaming in her home studio. Kate did the heavy lifting and narrated the lion’s share of the collection. I popped in like a Special Guest Appearance, reading both of the poems and a few of the shorter flash pieces. I hoped my contributions wouldn’t be too much of a departure from Kate’s narration—she and I have very different styles of delivery. Kate’s voice is calm, even, and intimate. I’m still that emphatic Greek girl on stage, projecting all the way to the back row.\nI loved reading in Kate’s studio. LOVED it. The poetry in particular. I remember at one point, in the middle of “Deathday”—I felt like Megan Follows delivering Anne Shirley’s passionate recitation of “The Highwayman” to a room full of Canadian sophisticates. It felt beautiful.\nWhen I asked Kate about my pieces later, she said something like, “You have the kind of energy audiobook readers love. I wish I could do that.”\nNow, let’s remember, Kate is the one whose honeyed voice has brought home multiple awards. I still consider myself quite the glorified amateur. But when she asked me to explain my process, to describe just how I conjure my magic inside that studio, I found myself at a bit of a loss for words.\n“Write it for me, then,” she said.\nSo here I am, per Kate’s request, to attempt this near-impossible feat. Ready? Okay. Here we go.\nFirst, I read the manuscript. Scan it through. It’s an obvious first step, but that’s where I start. I pinpoint every name and word that might trip me up and get those questions back to the author ASAP.\nThen, I read the manuscript again. This time, with the eye of the actress-cum-writer. Who are the characters in the story? Not just their names . . . who are they? What are their ages? Their backgrounds? What do they want from the main character? If it’s the main character, what do they want from life?\nI consider voice—not just the characters, but the voice of the piece as a whole. The tone. If I am not the author of the piece, I don’t know what the intention was as written. So how does it speak to me as a reader? How dark will we be getting? How sexy? How hopeful? What message will this story ultimately convey? I look for places where I might need to build intensity and where I might consider pulling the punch—letting the words deliver the power instead of my voice.\nThen I read it out loud. This is where the magic happens. I say magic, because this step is where my subconscious takes over. This is the part that’s harder to convey.\nWhen I read a story out loud, two things happen with the voice.\nThe first is accent. Sometimes I am given specific direction with the accent, like in Steve Vernon’s Nova Scotia ghost story, or Bogi Takács’s Hungarian SF “Given Sufficient Desperation.” Sometimes, the accent evolves as I read the tale. I wasn’t three sentences into H. L. Fullerton’s, “A Century of Princes” before it started coming out in a British accent. So, I went with it. I turned the assignment in early, just in case IGMS wanted me to redo it, but they didn’t.\nRati Mehrotra personally thanked me for giving an accent to the women of “In the Woods, My Voice.” Again, not a conscious choice. That’s just how her story read to me.\nFor the piece I just finished for Escape Pod, Samantha Henderson’s “My Generations Shall Praise,” I was partway through the first reading when I thought, “I should maybe do this in a southern accent.” They hadn’t asked for such a thing, but I was getting that sense. As soon as I hit the “Bless your heart,” line, I knew my gut had been right once again.\nSince “Generations” was the first project I did in the renovated studio, I ended up having to record it quite a few times. First time around, I was too close to the mic. Second time around I shifted my position partway through the reading, which meant I had to go back and record the first section again. But during all those readings, that second magic thing happened with my voice.\nRehearsing a piece—be it for an audio recording or a live performance—still feels like prepping for an audition. You get to the point where you’ve read that same monologue so many times, you become the character. You add laughter into lines where there had been no direction to do so, because that’s what your character would have done. You insert a scoff or two. A bit of mockery. A bit of melodrama. The character becomes real to you in a way that’s different from how it becomes real to the author or the listener. The character becomes real inside you.\nThe reason I shifted partway into the second reading was because that was the moment I became my character. I had leaned back against the studio wall, tired and disaffected. I wasn’t Princess Alethea anymore. I was a sociopathic baby killer on death row, debating whether or not to allow my rich cousin to map herself onto my brain meat when I was gone. I worked all the angles, all the way up ’til the end.\nI think, perhaps, it might be my best performance to date.\nBut that’s the point of this exercise: to never stop learning. To constantly be improving. To call on those ghost of my past—all that acting muscle memory—and put it to good use. To breathe life into characters brilliantly penned, adding my voice to the author’s in a magnificent collaboration.\nAnd, ultimately, to continue putting good things out into the world.\nAlethea Kontis is a princess, author, fairy godmother, and geek. Her bestselling Books of Arilland fairytale series won two Gelett Burgess Children's Book Awards (Enchanted and Tales of Arilland), and was twice nominated for the Andre Norton Award. Alethea also penned the AlphaOops picture books, The Wonderland Alphabet, Diary of a Mad Scientist Garden Gnome, Beauty & Dynamite, The Dark-Hunter Companion (w/Sherrilyn Kenyon), and a myriad of poems, essays, and short stories. Princess Alethea lives and writes on the Space Coast of Florida with her teddy bear, Charlie.", "source": "https://clarkesworldmagazine.com/another_word_04_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Breathing Life Into Characters by Alethea Kontis"}