{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Russ Colson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "V3LOI05GNYcMSmacVsv9buS36m0=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Earth Science Gets No Respect  Science fiction writers routinely get loads of cool physics right; and biology too. It’s expected of them. Maybe they stretch believability with that faster-than-light nonsense and all the strange creatures, but at least they know they need to imagine a means to circumvent the constraints of light speed, and that the creatures have to be tied loosely to some ecological environment where their strangeness is a reasonable adaptation. In earth science, however, there seem to be no constraints. Tides, earthquakes, deep stresses, giant caverns, and terrible storms are all too often magic forces invoked to provide drama and atmosphere without reference to reasonable science. What would earth science in the movies be without volcanoes in impossible places, giant caverns to the Earth’s core, and nearly-instantaneous changes in temperature masquerading as catastrophic climate change?  I know what you’re thinking: “Oh, but that’s just in the movies, they’re always bad.” Sorry, it’s not only the movies. Misconceptions of earth science so pervade our collective understanding that magic happenings are sometimes preferred in written stories; not only for their drama but for their believability!  Don’t think so? Consider this advice to new science fiction writers from Kathy Wentworth, judge of a well-known writers’ contest.  “If you’re writing hard sf, do your research and get your facts right . . . the science has to be dead on . . . You can’t have diamond ships that shatter when iron runs into them . . . without explanation.” (Dec 21, 2007 Writers and Illustrators of the Future Newsletter)  Oh? Why not? Isn’t that exactly what would happen? Here’s a quick thought puzzle for you: Let me smash your diamond engagement ring with an iron hammer and see which one breaks.  Oops.  Equating strength with hardness is a common misconception we address in introductory geology classes. Hardness relates to how a material resists scratching, not to how likely it is to survive a sudden blow. Iron is malleable, allowing it to deform without breaking when subjected to a force that would shatter the much harder diamond.  Yet this misconception is so strong that the science fiction writer must spend tons of words making what’s really true believable. Why bother? Just go with the misconception. Thus, Earth Science gets no respect, and writers know and accept this.  Moved by the Tides  “Even this high above the coast, in the crystalline silence of the mountains, he could hear the tides ripped from the ocean by the moons and hurtled against the shore far below.”  Lovely atmosphere, but tides hurtling against the shore?  Waves, driven by wind, hurtle against a shore. Tides, on the other hand, move gradually with the rotating world and the orbiting moons, a bulge in the ocean that creeps or sweeps upon a shoreline. They don’t hurtle with the sound of crashing waves.  Catherine Asaro is a physicist. She should know this. I can only surmise that since this is earth science (which gets no respect) authors presume readers don’t know any better. Tides, waves, whatever. Aren’t they interchangeable? And crashing tides are more dramatic than creeping ones.  All Done by Magic  I point out to my college students that real science writing happens in making connections between cause and effect, not in spouting factoids. I suggest that if you can substitute the word “magic” for some cause in a sentence, without changing the character of the sentence, then you haven’t made the connection between cause and effect. Here’s an example.  Ophiolites are rock bodies formed deep in the crust of ocean basins, yet we sometimes find them at the surface of continents. Students write, “ophiolites are exposed at the Earth’s surface by Plate Tectonics,” thinking this tells the reader how ophiolites are exposed. It doesn’t. Think about it. Can you tell me, based on this sentence, how ophiolites reach the surface of continents? You may as well say ophiolites are exposed by magic.  For science fiction writers, trying out the word “magic” can help identify passages that don’t make sense. “ . . . he could hear the tides ripped from the ocean by magic . . . ” Investigation reveals little connection between crashing waves and the hours-long rotation of a world or the orbit of its moons. It’s Clarke’s Law in action: without any understanding of how the science works, it might as well be magic.  What’s really distressing is that I delighted in the sound of the crashing “tides,” and loved the story! No wonder earth science gets no respect!  Scraped Flat  Most authors don’t include earth science in their stories at all, or include it only as an atmospheric backdrop. But there are a few who incorporate earth science in substantial ways. These are some of my favorite writers and stories. So naturally, with apologies, I’m going to pick on them.  “The plateaus were probably carved by methane glaciers, Angela said.”  OK, methane glaciers, that’s cool, and the story is set on a world with hydrocarbon rain, so that makes sense. But consider rephrasing this as “plateaus were carved by magic.” Is there any non-magical connection between glaciers and plateaus?  Not much. What’s more, the idea of plateaus carved by glaciers brings up another common misconception of earth science. When I ask my college students why the Red River Valley of the North at the border between North Dakota and Minnesota is so flat, they always say, “Because the glaciers scraped it off.”  Nope. Flat topography, such as a plateau, usually requires erosion or deposition to a base level. Think about rivers flowing into an ocean. As the landscape erodes down to sea level, the slope will decrease, causing the water velocity to slow and lose its capacity to erode. Thus, land will erode flat at the level of the sea, the base level, and no further.  Glaciers don’t behave in the same way as rivers. They erode here or deposit there on the basis of variations in temperature, speed of movement, and thickness of the ice. What’s more, when the ice melts, rock and sediment caught up in the ice are draped irregularly over the preexisting topography leaving a rolling, hummocky terrain, not a flat plateau.  So, glaciers, methane or otherwise, aren’t going to carve a plateau, although they might drape glacial deposits on top of a preexisting plateau formed by another process, as shown in the illustration to the right.  Volcanoes of Ice  Ice worlds are cool and fun to read about, but they provide plenty of opportunities for writers to get things wrong. Consider another ice world story by a new writer, “The Frozen Sky” by Jeff Carlson (L. Ron Hubbard Presents Writers of the Future XXIII). This little gem, in which explorers discover alien life in the catacombs of Europa, a moon of Jupiter, has all kinds of geological details, such as the formation of an oxygen atmosphere by dissociation of water molecules on the icy surface. Frozen silicate lava from past volcanism cuts across the icy catacombs, an important element of the story because the lava rock, much harder than the ice, blocks the characters’ way in places.  However, real volcanoes on Europa don’t involve the melting of silicate rock. On frigid Europa, the crustal “rock” is ice, and lava is made of hot, molten liquid ice (that is, water) rather than liquid silicate. Thus story elements that involve silicate magma in contact with water ice, and the separate uses of the words “ice” and “rock,” don’t make sense. Silicate rock melts a thousand degrees Celsius higher than water ice, so intrusion of silicate lava into water ice would vaporize it, pulverizing both water rock and silicate rock.  A Lot of Hot Air  New writers seem to be particularly bold in putting earth science in their stories (a very hopeful sign!). “The Flue” by John Schoffstall (L. Ron Hubbard Presents Writers of the Future XXI) is a story in which giant towers in the desert capture heat energy by allowing rapidly rising air to turn power turbines in towers that are kilometers high. There’s all kinds of physics details in the story (proving that physics gets respect), such as the terminal velocity of a falling body and how this relates to the velocity of upward moving air required to suspend or raise a body. Way cool.  But the earth science doesn’t quite work. What, exactly, is causing the air to rise up these giant towers?  The implication of the story is that well, duh, hot air rises. And the desert is hot. But why isn’t it already rising out there in the desert before we build the towers, thus creating a great vacuum at the surface?  Ok, so maybe a tower somehow (read “magically”) creates a pocket of convection centered on the tower, with air rising at the tower and sinking somewhere nearby in compensation. But there is a more serious problem. The temperature of the air where it comes out the top of the tower is sixty-five degrees Celsius (medium rare on a meat thermometer, according to the story). This high temperature is a key challenge which the protagonist must overcome in climbing a kilometer down the tower to find out why Flue number seven is 5% off its rated output.  Here’s the problem. How did the air get so hot? Down at the surface of the desert the air might be, say, forty-six degrees Celsius on a really hot day. As air rises, its temperature will fall due to adiabatic decompressional cooling (that is, cooling caused by the expansion of the air as pressure decreases upward). You can experience this yourself by blowing up a balloon and then holding it against your cheek as you let the air out quickly. The balloon will grow cool. Try it!  A rise of a couple of kilometers will result in a temperature drop of about twenty degrees Celsius if air is dry, reducing air temperature to twenty-five degrees. But the temperature at the top of the tower is reported as forty degrees higher than this! The only way for that to occur is if energy is added to the air. But, if energy is added to the air in the tower, then the tower won’t be an energy generator, it will be an energy consumer!    Convection towers have been proposed and tested in the non-fiction world as a means to capture solar energy. However, real towers require the air at the surface to be heated above ambient temperature for the process to work. One way to accomplish this is to build a green-house-like solar collector in an apron around the tower (see illustration below). Even so, the temperature of the air will decrease as the air rises up the tower.   Hail and Ice  Thus we have a thrilling story, with cool physics, but the earth science doesn’t quite work out. No respect again.  OK, so volcanoes can’t really just pop up anywhere, and caverns deeper than a few thousand feet in Earth’s crust would collapse under the weight of overlying rock. At least we can do anything we want with weather, right? It’s so erratic, so unpredictable, so powerful and mysterious, that anything is possible. Right?  Let me pick on my favorite author. I hope she’ll forgive me. In Riders of the Storm (DAW), Julie Czerneda writes an exciting scene where the protagonist struggles against a fierce winter storm involving “ice stones as big as a fist” and rain that “wasn’t rain, it was liquid ice.”  Exciting, but is it likely? Actually we don’t observe freezing rain and fist sized hail from a single storm cloud on Earth, though we do see both separately. Why not?  Let’s think about it. To get such large hail stones, vertical winds have to be strong enough to suspend the stones in the air until they grow to the size of a fist, whereupon the ice will overcome the updraft and fall. This process will hold true on any non-magical planet.  To get air moving upward at such a high velocity, the air needs to be highly unstable, such as when cold air aloft overlies warm air at the surface. The warm air will spontaneously rise due to its lower density, sometimes reaching hurricane force.  In contrast, to get freezing rain, the air at the ground has to be colder than air aloft. Rain starts out warmer and gets colder as it falls, eventually freezing when it hits the ground.  But, if cold, dense air is near the ground, and warm low-density air aloft, the air will be stable and you can’t get strong vertical winds. Thus, large hail and freezing rain occur from very different types of storm clouds, regardless of whether you’re on Earth or elsewhere (that is, unless you’re in a universe with different physical laws).  Of course, writers can always come up with ways to make unexpected things happen in a way that is believable within the context of the story. That’s what makes science fiction stories fun. We should also not forget that real science is all about poking holes in old ideas so as to gain better new ones. Yet many science fiction writers apparently don’t feel obliged to provide explanations for their deviations from standard earth science principles. Or maybe they don’t realize when they’re going wrong. Would they get away with treating physics or biology so carelessly?  I tell you, earth science don’t get no respect. Russ Colson lives with his wife Mary on a farmstead in northern Minnesota, far enough from city lights to see the Milky Way and the aurora borealis. He's a professor at Minnesota State University Moorhead where he teaches planetary science, meteorology, and geology. Before coming to Minnesota, he worked at the Johnson Space Center in Texas for five years, followed by six years of research at Washington University in St. Louis where, among other things, he studied how a lunar colony might mine oxygen from the local rock. In addition to writing non-fiction, he writes a variety of speculative fiction stories.", "text": "Non-Fiction\nEarth Science Gets No Respect\nScience fiction writers routinely get loads of cool physics right; and biology too. It’s expected of them. Maybe they stretch believability with that faster-than-light nonsense and all the strange creatures, but at least they know they need to imagine a means to circumvent the constraints of light speed, and that the creatures have to be tied loosely to some ecological environment where their strangeness is a reasonable adaptation. In earth science, however, there seem to be no constraints. Tides, earthquakes, deep stresses, giant caverns, and terrible storms are all too often magic forces invoked to provide drama and atmosphere without reference to reasonable science. What would earth science in the movies be without volcanoes in impossible places, giant caverns to the Earth’s core, and nearly-instantaneous changes in temperature masquerading as catastrophic climate change?\nI know what you’re thinking: “Oh, but that’s just in the movies, they’re always bad.” Sorry, it’s not only the movies. Misconceptions of earth science so pervade our collective understanding that magic happenings are sometimes preferred in written stories; not only for their drama but for their believability!\nDon’t think so? Consider this advice to new science fiction writers from Kathy Wentworth, judge of a well-known writers’ contest.\n“If you’re writing hard sf, do your research and get your facts right . . . the science has to be dead on . . . You can’t have diamond ships that shatter when iron runs into them . . . without explanation.” (Dec 21, 2007 Writers and Illustrators of the Future Newsletter)\nOh? Why not? Isn’t that exactly what would happen? Here’s a quick thought puzzle for you: Let me smash your diamond engagement ring with an iron hammer and see which one breaks.\nOops.\nEquating strength with hardness is a common misconception we address in introductory geology classes. Hardness relates to how a material resists scratching, not to how likely it is to survive a sudden blow. Iron is malleable, allowing it to deform without breaking when subjected to a force that would shatter the much harder diamond.\nYet this misconception is so strong that the science fiction writer must spend tons of words making what’s really true believable. Why bother? Just go with the misconception. Thus, Earth Science gets no respect, and writers know and accept this.\nMoved by the Tides\n“Even this high above the coast, in the crystalline silence of the mountains, he could hear the tides ripped from the ocean by the moons and hurtled against the shore far below.”\nLovely atmosphere, but tides hurtling against the shore?\nWaves, driven by wind, hurtle against a shore. Tides, on the other hand, move gradually with the rotating world and the orbiting moons, a bulge in the ocean that creeps or sweeps upon a shoreline. They don’t hurtle with the sound of crashing waves.\nCatherine Asaro is a physicist. She should know this. I can only surmise that since this is earth science (which gets no respect) authors presume readers don’t know any better. Tides, waves, whatever. Aren’t they interchangeable? And crashing tides are more dramatic than creeping ones.\nAll Done by Magic\nI point out to my college students that real science writing happens in making connections between cause and effect, not in spouting factoids. I suggest that if you can substitute the word “magic” for some cause in a sentence, without changing the character of the sentence, then you haven’t made the connection between cause and effect. Here’s an example.\nOphiolites are rock bodies formed deep in the crust of ocean basins, yet we sometimes find them at the surface of continents. Students write, “ophiolites are exposed at the Earth’s surface by Plate Tectonics,” thinking this tells the reader how ophiolites are exposed. It doesn’t. Think about it. Can you tell me, based on this sentence, how ophiolites reach the surface of continents? You may as well say ophiolites are exposed by magic.\nFor science fiction writers, trying out the word “magic” can help identify passages that don’t make sense. “ . . . he could hear the tides ripped from the ocean by magic . . . ” Investigation reveals little connection between crashing waves and the hours-long rotation of a world or the orbit of its moons. It’s Clarke’s Law in action: without any understanding of how the science works, it might as well be magic.\nWhat’s really distressing is that I delighted in the sound of the crashing “tides,” and loved the story! No wonder earth science gets no respect!\nScraped Flat\nMost authors don’t include earth science in their stories at all, or include it only as an atmospheric backdrop. But there are a few who incorporate earth science in substantial ways. These are some of my favorite writers and stories. So naturally, with apologies, I’m going to pick on them.\n“The plateaus were probably carved by methane glaciers, Angela said.”\nOK, methane glaciers, that’s cool, and the story is set on a world with hydrocarbon rain, so that makes sense. But consider rephrasing this as “plateaus were carved by magic.” Is there any non-magical connection between glaciers and plateaus?\nNot much. What’s more, the idea of plateaus carved by glaciers brings up another common misconception of earth science. When I ask my college students why the Red River Valley of the North at the border between North Dakota and Minnesota is so flat, they always say, “Because the glaciers scraped it off.”\nNope. Flat topography, such as a plateau, usually requires erosion or deposition to a base level. Think about rivers flowing into an ocean. As the landscape erodes down to sea level, the slope will decrease, causing the water velocity to slow and lose its capacity to erode. Thus, land will erode flat at the level of the sea, the base level, and no further.\nGlaciers don’t behave in the same way as rivers. They erode here or deposit there on the basis of variations in temperature, speed of movement, and thickness of the ice. What’s more, when the ice melts, rock and sediment caught up in the ice are draped irregularly over the preexisting topography leaving a rolling, hummocky terrain, not a flat plateau.\nSo, glaciers, methane or otherwise, aren’t going to carve a plateau, although they might drape glacial deposits on top of a preexisting plateau formed by another process, as shown in the illustration to the right.\nVolcanoes of Ice\nIce worlds are cool and fun to read about, but they provide plenty of opportunities for writers to get things wrong. Consider another ice world story by a new writer, “The Frozen Sky” by Jeff Carlson (L. Ron Hubbard Presents Writers of the Future XXIII). This little gem, in which explorers discover alien life in the catacombs of Europa, a moon of Jupiter, has all kinds of geological details, such as the formation of an oxygen atmosphere by dissociation of water molecules on the icy surface. Frozen silicate lava from past volcanism cuts across the icy catacombs, an important element of the story because the lava rock, much harder than the ice, blocks the characters’ way in places.\nHowever, real volcanoes on Europa don’t involve the melting of silicate rock. On frigid Europa, the crustal “rock” is ice, and lava is made of hot, molten liquid ice (that is, water) rather than liquid silicate. Thus story elements that involve silicate magma in contact with water ice, and the separate uses of the words “ice” and “rock,” don’t make sense. Silicate rock melts a thousand degrees Celsius higher than water ice, so intrusion of silicate lava into water ice would vaporize it, pulverizing both water rock and silicate rock.\nA Lot of Hot Air\nNew writers seem to be particularly bold in putting earth science in their stories (a very hopeful sign!). “The Flue” by John Schoffstall (L. Ron Hubbard Presents Writers of the Future XXI) is a story in which giant towers in the desert capture heat energy by allowing rapidly rising air to turn power turbines in towers that are kilometers high. There’s all kinds of physics details in the story (proving that physics gets respect), such as the terminal velocity of a falling body and how this relates to the velocity of upward moving air required to suspend or raise a body. Way cool.\nBut the earth science doesn’t quite work. What, exactly, is causing the air to rise up these giant towers?\nThe implication of the story is that well, duh, hot air rises. And the desert is hot. But why isn’t it already rising out there in the desert before we build the towers, thus creating a great vacuum at the surface?\nOk, so maybe a tower somehow (read “magically”) creates a pocket of convection centered on the tower, with air rising at the tower and sinking somewhere nearby in compensation. But there is a more serious problem. The temperature of the air where it comes out the top of the tower is sixty-five degrees Celsius (medium rare on a meat thermometer, according to the story). This high temperature is a key challenge which the protagonist must overcome in climbing a kilometer down the tower to find out why Flue number seven is 5% off its rated output.\nHere’s the problem. How did the air get so hot? Down at the surface of the desert the air might be, say, forty-six degrees Celsius on a really hot day. As air rises, its temperature will fall due to adiabatic decompressional cooling (that is, cooling caused by the expansion of the air as pressure decreases upward). You can experience this yourself by blowing up a balloon and then holding it against your cheek as you let the air out quickly. The balloon will grow cool. Try it!\nA rise of a couple of kilometers will result in a temperature drop of about twenty degrees Celsius if air is dry, reducing air temperature to twenty-five degrees. But the temperature at the top of the tower is reported as forty degrees higher than this! The only way for that to occur is if energy is added to the air. But, if energy is added to the air in the tower, then the tower won’t be an energy generator, it will be an energy consumer!\nConvection towers have been proposed and tested in the non-fiction world as a means to capture solar energy. However, real towers require the air at the surface to be heated above ambient temperature for the process to work. One way to accomplish this is to build a green-house-like solar collector in an apron around the tower (see illustration below). Even so, the temperature of the air will decrease as the air rises up the tower.\nHail and Ice\nThus we have a thrilling story, with cool physics, but the earth science doesn’t quite work out. No respect again.\nOK, so volcanoes can’t really just pop up anywhere, and caverns deeper than a few thousand feet in Earth’s crust would collapse under the weight of overlying rock. At least we can do anything we want with weather, right? It’s so erratic, so unpredictable, so powerful and mysterious, that anything is possible. Right?\nLet me pick on my favorite author. I hope she’ll forgive me. In Riders of the Storm (DAW), Julie Czerneda writes an exciting scene where the protagonist struggles against a fierce winter storm involving “ice stones as big as a fist” and rain that “wasn’t rain, it was liquid ice.”\nExciting, but is it likely? Actually we don’t observe freezing rain and fist sized hail from a single storm cloud on Earth, though we do see both separately. Why not?\nLet’s think about it. To get such large hail stones, vertical winds have to be strong enough to suspend the stones in the air until they grow to the size of a fist, whereupon the ice will overcome the updraft and fall. This process will hold true on any non-magical planet.\nTo get air moving upward at such a high velocity, the air needs to be highly unstable, such as when cold air aloft overlies warm air at the surface. The warm air will spontaneously rise due to its lower density, sometimes reaching hurricane force.\nIn contrast, to get freezing rain, the air at the ground has to be colder than air aloft. Rain starts out warmer and gets colder as it falls, eventually freezing when it hits the ground.\nBut, if cold, dense air is near the ground, and warm low-density air aloft, the air will be stable and you can’t get strong vertical winds. Thus, large hail and freezing rain occur from very different types of storm clouds, regardless of whether you’re on Earth or elsewhere (that is, unless you’re in a universe with different physical laws).\nOf course, writers can always come up with ways to make unexpected things happen in a way that is believable within the context of the story. That’s what makes science fiction stories fun. We should also not forget that real science is all about poking holes in old ideas so as to gain better new ones. Yet many science fiction writers apparently don’t feel obliged to provide explanations for their deviations from standard earth science principles. Or maybe they don’t realize when they’re going wrong. Would they get away with treating physics or biology so carelessly?\nI tell you, earth science don’t get no respect.\nRuss Colson lives with his wife Mary on a farmstead in northern Minnesota, far enough from city lights to see the Milky Way and the aurora borealis. He's a professor at Minnesota State University Moorhead where he teaches planetary science, meteorology, and geology.\nBefore coming to Minnesota, he worked at the Johnson Space Center in Texas for five years, followed by six years of research at Washington University in St. Louis where, among other things, he studied how a lunar colony might mine oxygen from the local rock. In addition to writing non-fiction, he writes a variety of speculative fiction stories.", "source": "https://clarkesworldmagazine.com/colson_02_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Earth Science Gets No Respect by Russ Colson"}