{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "gbVW+YMdjKcU5kDHdxiLpRYNOyI=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Another Post-Con Crash  It’s been over a week, but I’m still a bit worn out from the San Jose Worldcon. Part of that is my usual post-con introvert crash and the rest is from the breakneck schedule I kept while there. I only had a couple of panels, but my calendar was filled with meetings, meals, and other activities for the first three days of the convention and I have absolutely no regrets. My two panels were both tied to China: one on Chinese fandom where I represented the visitor’s point-of-view. The other panel was on translation. A group representing Chengdu—one of the cities I visited while in China last year—was also on-site promoting a potential Worldcon bid for 2023, so that probably added interest. I wish them the best of luck with the bid and I suspect that won’t be the last you’ll hear about this from me.  On Friday at the convention, it was my birthday, but I was so busy that it barely registered outside the occasional birthday greetings until later that evening. I attended the Chesley Awards, primarily to support our three artists who were nominated for Best Magazine Cover, but also because I was a nominee for Best Art Director. Unfortunately, our artists didn’t win but much to my surprise, I did. I thanked everyone for voting for me and for the best birthday present I had received that day. I believe I said few other words—now lost to me—and I returned to my seat in shock.  After the award ceremony, I headed off to a late dinner with several people involved in our Chinese translation work with Storycom. This was one of the earliest planned events on my calendar for the weekend. Once we realized just how many of us would be there, we felt the need to take advantage of that situation so we could properly celebrate the things we’ve accomplished in the last four years. Turns out, they also surprised me with a small cake and flowers for my birthday. Spending the evening with my Clarkesworld and Storycom family was a highlight and great way to end the day.  The weekend continued at much the same pace: meeting with fans and authors, discussing some potential projects, more international bridge building, and meeting with my agent. I should note that this last one is a very recent development. I also had the chance to chat with our nominees for the Hugo Award, Vina Jie-Min Prasad and Suzanne Palmer. Dealing with people via email all the time, it’s wonderful to actually get to meet them in person. I was also able to give them their Clarkesworld author/artist/staff pins, which are just a new blue variant on the yellow-green robot head buttons I’ve been giving out at cons for the last couple of years. (I have two other colors I’m trying to figure out what to do with.)  Before I knew it, the Hugo Awards were upon us. I brought Emily Jin, one of our story translators and my translator when I was in Beijing, as my plus-one to the reception, award ceremony, and Loser’s Party. I didn’t win, but had I, she would have accompanied me on-stage and translated my speech to Chinese. It’s an unusual thing to do, but with so many of our stories coming from China, it just seemed appropriate and fun. For me however, the big thrill of the night was seeing Suzanne Palmer win the Hugo for Best Novelette for “The Secret Life of Bots.” This is the second story from Clarkesworld to win and Suzanne’s first. A big congratulations to her and a thanks for entrusting us with that story.  The Hugos all-too-often mark the end of the convention for most people. A couple of recent conventions have experimented by moving the awards to an evening earlier in the convention, which I absolutely love. It gives everyone a chance to celebrate together without worrying about the flights or feeling guilty for being at some of the private parties that night. It’s nice to be able to thank the fans that voted for you in person. No idea what Dublin is planning next year, but I hope they follow Finland’s path on this matter rather than San Jose’s.  Not wanting to have to leave earlier or fly at a ridiculous hour, I opted to stay until Tuesday, which was a perfect way to end the trip. The pace was slower and I had a chance to catch up with friends I had found myself zipping by for much of the weekend. The perceptions people have of this profession are far from reality at times. For all the bickering and other nonsense that goes on, there’s a lot of collegiality among peers. Monday’s lunch was a perfect example as the editors of several year’s best anthologies—John Joseph Adams, Ellen Datlow, Rich Horton, and I (Jonathan Strahan had to cancel at the last minute)—made time to sit together, chat, and eat. We’ll probably try to do this again at World Fantasy. The evening was spent with friends from Clarkesworld, Storycom, and beyond. After taking the scenic route to the restaurant, our exhausted group relaxed and unwound before heading back to our hotels and then scattering in very different directions to go home.  There are times that I almost wish this was happening more than once a year . . . but being home is really nice too! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Another Post-Con Crash\nIt’s been over a week, but I’m still a bit worn out from the San Jose Worldcon. Part of that is my usual post-con introvert crash and the rest is from the breakneck schedule I kept while there. I only had a couple of panels, but my calendar was filled with meetings, meals, and other activities for the first three days of the convention and I have absolutely no regrets. My two panels were both tied to China: one on Chinese fandom where I represented the visitor’s point-of-view. The other panel was on translation. A group representing Chengdu—one of the cities I visited while in China last year—was also on-site promoting a potential Worldcon bid for 2023, so that probably added interest. I wish them the best of luck with the bid and I suspect that won’t be the last you’ll hear about this from me.\nOn Friday at the convention, it was my birthday, but I was so busy that it barely registered outside the occasional birthday greetings until later that evening. I attended the Chesley Awards, primarily to support our three artists who were nominated for Best Magazine Cover, but also because I was a nominee for Best Art Director. Unfortunately, our artists didn’t win but much to my surprise, I did. I thanked everyone for voting for me and for the best birthday present I had received that day. I believe I said few other words—now lost to me—and I returned to my seat in shock.\nAfter the award ceremony, I headed off to a late dinner with several people involved in our Chinese translation work with Storycom. This was one of the earliest planned events on my calendar for the weekend. Once we realized just how many of us would be there, we felt the need to take advantage of that situation so we could properly celebrate the things we’ve accomplished in the last four years. Turns out, they also surprised me with a small cake and flowers for my birthday. Spending the evening with my Clarkesworld and Storycom family was a highlight and great way to end the day.\nThe weekend continued at much the same pace: meeting with fans and authors, discussing some potential projects, more international bridge building, and meeting with my agent. I should note that this last one is a very recent development. I also had the chance to chat with our nominees for the Hugo Award, Vina Jie-Min Prasad and Suzanne Palmer. Dealing with people via email all the time, it’s wonderful to actually get to meet them in person. I was also able to give them their Clarkesworld author/artist/staff pins, which are just a new blue variant on the yellow-green robot head buttons I’ve been giving out at cons for the last couple of years. (I have two other colors I’m trying to figure out what to do with.)\nBefore I knew it, the Hugo Awards were upon us. I brought Emily Jin, one of our story translators and my translator when I was in Beijing, as my plus-one to the reception, award ceremony, and Loser’s Party. I didn’t win, but had I, she would have accompanied me on-stage and translated my speech to Chinese. It’s an unusual thing to do, but with so many of our stories coming from China, it just seemed appropriate and fun. For me however, the big thrill of the night was seeing Suzanne Palmer win the Hugo for Best Novelette for “The Secret Life of Bots.” This is the second story from Clarkesworld to win and Suzanne’s first. A big congratulations to her and a thanks for entrusting us with that story.\nThe Hugos all-too-often mark the end of the convention for most people. A couple of recent conventions have experimented by moving the awards to an evening earlier in the convention, which I absolutely love. It gives everyone a chance to celebrate together without worrying about the flights or feeling guilty for being at some of the private parties that night. It’s nice to be able to thank the fans that voted for you in person. No idea what Dublin is planning next year, but I hope they follow Finland’s path on this matter rather than San Jose’s.\nNot wanting to have to leave earlier or fly at a ridiculous hour, I opted to stay until Tuesday, which was a perfect way to end the trip. The pace was slower and I had a chance to catch up with friends I had found myself zipping by for much of the weekend. The perceptions people have of this profession are far from reality at times. For all the bickering and other nonsense that goes on, there’s a lot of collegiality among peers. Monday’s lunch was a perfect example as the editors of several year’s best anthologies—John Joseph Adams, Ellen Datlow, Rich Horton, and I (Jonathan Strahan had to cancel at the last minute)—made time to sit together, chat, and eat. We’ll probably try to do this again at World Fantasy. The evening was spent with friends from Clarkesworld, Storycom, and beyond. After taking the scenic route to the restaurant, our exhausted group relaxed and unwound before heading back to our hotels and then scattering in very different directions to go home.\nThere are times that I almost wish this was happening more than once a year . . . but being home is really nice too!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_09_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Another Post-Con Crash by Neil Clarke"}