{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Natalia Theodoridou", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "9Vqll7DhMrW1KUyQxmx5muv/wf8=", "id": null, "license": null, "comments": "", "raw_text": "5170 words, short story  One's Burden, Again  “It’s freezing today,” Ionna said, although she knew the temperature in the ship was always the same. It didn’t make her feel any warmer. As if the cold of space had settled into her bones.  “Won’t be long now.” Niko finished securing the cargo area and initiated a routine maintenance check of the entire ship. “That was a good haul,” he said. “One more and we’ll be going home.” He ran his fingers over the faces of his daughters looking back at him from the photo pinned next to the navigation panel. Then he turned and glanced at Ionna.  She avoided his eyes.  They left unsaid the conversation about the family he missed and the family she no longer had. Instead, they watched the darkness outside in tight-lipped silence.  “So, where to?” Ionna asked after a while.  “I get great readings for platinum from less than a million kilometers away.”  “Show me.”  Niko tightened his ponytail to keep his long black hair from falling into his face. He magnified a quadrant and pointed at a small nothing in the corner. “It’s one of the Greeks past Jupiter. The concentration of platinum is absurdly high.”  “Could it be a misread?”  He showed her his palms—a gesture that meant, how would I know?  “Any obviously better options?”  “No.”  “Then we might as well check it out.”  Niko nodded and set the course.  Ionna rubbed her palms together. Still bloody cold. “All right,” she said. “I’m turning in.”  He looked at her a moment too long, seemed to decide not to say anything, then said it anyway: “Don’t talk to it, Ionna.” They had fought about this many times. More times than she cared to remember. “It’s been long enough. This stopped being about processing your grief a long time ago. It’s not good for you.”  “Long enough? What does that even mean? Long enough for whom?” She paused. “Let’s not get into this again,” Ionna said. “It’s not worth the oxygen.”  “Okay,” Niko replied, obviously resigned, obviously not wanting to punch and make up this time. “I’ll ping you when we are close.”  Ionna turned around and made her way back to her sleeping quarters, magboots clicking on the grid underneath.  She left the overhead lights off, so her room was illuminated only by the weak glow of the holosim. It tinted the walls a ghostly blue.  “Are you sleeping, Daddy?” she asked, even though she knew holosims don’t sleep.  “Did you have a good day?” it asked back—one of his standard lines. Something in her chest tightened. This was not her father. She knew that. It didn’t matter. This was nothing but a collection of everything he’d said or written that had been preserved in record. Her father was dead in the ground and a pastiche of recordings grafted onto a chatbot does not a person make. It still didn’t matter.  “I’m cold,” she told him.  “Boreas is the god of winter,” the sim replied helpfully. “You should put on an extra blanket tonight, sweetbug.” A line from a much younger father, tucking his daughter in for the night after reading to her, back on Ceres. He had stuck fluorescent stars to the ceiling of her room because she was afraid of the dark, and stars still seemed like a comforting thing to look up to, back then.  She studied her father’s paper-thin skin, the brown splotches and liver spots on the backs of his hands, looking for the signs of illness she had missed before and still failing to find them. “When were you going to tell me you were sick?” she asked. “Were you ever going to tell me?”  “The sins of the father are visited on the son,” her father responded, and she kept herself from wincing at the mention of a son, at this lack, this deficiency that had been beaten into her since birth, and then she racked her brains for the source of that line, sure that she had never heard her father say it while he was still alive. Not in so many words, anyway. Or maybe he did, and she had forgotten it. She had tried so hard to forget so many things her father said—perhaps she had succeeded, after all. “You should try harder,” the holosim continued. This one she’d heard multiple times before.  “What more did you want from me?” She opened her arms, a motion meant to encompass it all: the room, the ship, the vast, cold space. “I’ve only ever done what you wanted me to do.”  “Be great,” her father said. “There is freedom in greatness.”  “What would you have said to me, if I had come home before it was too late?”  The sim flickered, pixels failing at her father’s edges, bits of him missing. Manos had always been a man of few words, his logs brief and impersonal. He was never going to make a great sim.  She walked closer. “What else have you not told me?”  The sim made no reply.  She woke up with a violent shake that made the straps holding her down in her bunk dig into her chest. She rolled out of bed and headed to the bridge, not bothering with magboots; she propelled herself, weightless, as fast as she could.  The hauler was coursing towards what looked like the target planetoid much, much faster than it should.  Niko was frantically instructing the ship, which seemed unresponsive. He finally switched to manual and tried to course-correct.  “Niko, talk to me.”  He threw his hands in the air and then brought them down on his controls, cursing loudly. “Don’t know what the hell is going on. I’ve lost control.” He turned to her, realization dawning on his face, followed by barely concealed panic. “Strap in. This will hurt.”  Ionna deposited herself in the seat next to him as quickly as she could and strapped herself down.  The planetoid was approaching fast. Ionna took in the landscape, thinking this might be the last thing she saw: this hard, gray rock; this face pockmarked with deep craters.  “Do you have control of the reverse thrusters?” she asked.  “Already thought of that. No.”  “Okay,” she said. “Okay.” She closed her eyes, preparing for impact, but Niko objected.  “Look,” he said. “Look.” So she did.  “That can’t be right.”  There was a large, clearly artificial structure perched at the top of one of the deeper craters.  “Gods,” Niko said in that tone he always had when speaking of the unseen world, and he touched the nape of his neck to shelter himself from divine misfortune.  “A machine of some sort?” Ionna asked, fighting to keep her eyes open. “A processing plant?”  “We’ll find out. Maybe.”  They would, because they were heading right towards it. If there was enough of it left after they crashed on it, that was.  Moments later, the hauler slowed down, as if grasped by an invisible hand. The deceleration was enough to make their crash landing painful but not lethal. A few meters to the right, and they would have missed the machine entirely; but as it was, they hit the very top of the structure, causing it to topple over. The ship dragged on the ground and came to a halt at the bottom of another crater.  Ionna’s heart was beating against her chest like a caged animal. She tried to calm her breathing enough to be able to speak, but Niko got there first.  “You okay?”  She did a quick check of her body. Everything felt relatively intact: bruised and banged up, sure, but not broken. This was not a regular landing. Not even a regular crash. They should be dead.  She nodded and unstrapped herself from the seat while Niko did the same. They hugged. She let out a long, strained breath.  Niko released her from his embrace and bounced lightly on the balls of his feet. “Gravity,” he said. “More than expected.”  “This isn’t normal,” she replied, the fine hairs on her neck standing on end.  “You got that right.”  They slipped into their suits and made their way out of the ship with some hesitation. The area was strewn with rusted pieces of metal and ancient electronics. At least that was one mystery solved: This was someone’s junkyard. The readings had merely indicated platinum that had already been mined hundreds of years ago.  Niko checked the values on his wrist monitor. “It has an atmosphere, too,” he said. Before Ionna had a chance to stop him, protesting that this was impossible, planetoids this size do not have atmospheres, Niko had unfastened and removed his helmet. “Breathable,” he confirmed with a terrified grin.  This land was clearly touched by the gods, and now so were they. She didn’t like it. But it was what it was.  Ionna released her own helmet and took in a deep breath. The air smelled metallic. The faint taste of something burnt clung to the back of her throat, lined the inside of her lungs. A thought resounded in her mind, unprompted and inexplicable, like the voice of a god: this will be me from now on. Burnt metal in the lungs.  Her heart raced again, cold sweat blooming from the roots of her hair. She wanted to run back to the hauler, back to her room, to check on her father’s holosim, make sure he was still there, still intact, idly waiting for her questions only to avoid answering them. She resisted the urge. Instead, she tapped Niko on the shoulder and nodded in the direction of the strange metal structure they had knocked over.  According to their wrist monitors’ imperfect mapping of the planetoid, the crater in which they landed was not one of the deepest in the area, but it still took them more than an hour to scale the slope. Once they reached the surface, they paused to catch their breaths. They gazed at the hard land reflecting the faint light of a distant star. Apart from the toppled structure, the planetoid seemed pristine; there was no indication that it may be inhabited, and all the craters were deep enough to conceal the precious junk that lay at their bellies.  Upon closer inspection, the structure looked like a cross between a tower and a kiln, housed in a rectangular chamber, with a tube leading out of the structure and into the ground. The tube was large enough to fit a person standing up, though the purpose it served was unclear. From then on, there was no telling where it might end, if anywhere.  “What do you suppose this is?” Niko asked.  Ionna opened her mouth to reply, but a deep, guttural sound from behind them spun both of them around.  Up the steep slope came a man, pushing an enormous boulder made of what looked like compressed metal. The man grunted. His bare torso glistened with sweat. He paused briefly, supporting the boulder with his shoulder, and with a swift maneuver turned around and pushed the boulder with his back for the last few meters, his feet finding purchase against the rocky ground with practiced ease.  Ionna and Niko rushed over to help him pull the boulder over the edge to the top. Once it rested on flat surface, the man collapsed on the ground next to the boulder, the size of the man comparable to the size of the boulder, and breathed deeply through the nose. There were tears streaking down his cheeks and wetting his dark, bushy beard. His skin was carved with hundreds of scars, some fresh, others clearly old, betraying a lifetime of naked skin laboring against raw metal.  The man grunted again and covered his eyes with his palms. “What have you done?” he cried, his voice full of cracks. “What have you cursed strangers done?”  Ionna stood over the man and extended her arm to help him up. “We crashed,” she said, rather redundantly. “I am Ionna. This is Niko. We are miners.”  The man uncovered his eyes and wiped his tears away with the back of his hand. He ignored Ionna’s outstretched arm and pushed himself up from the ground on his own.  Standing, he towered over her, almost a foot taller than either of them, and for a moment she thought he could destroy them, if he wanted, smite them down like a god.  “My name is Siphos,” he said, and, at first, Ionna thought he said Sisyphos, the cursed king of Corinth whose story her father told her when she was small. But surely not. Surely not.  The man’s voice was calm, but there was something just under the surface, seething, threatening. “I used to be king of Ephyra.” He pronounced this like it should mean something to Ionna, but it didn’t. She’d never heard of a place called Ephyra.  Siphos turned around and inspected the result of the crash, his gaze traveling between the wrecked structure and his boulder of scrap metal. “First I was king, and then I was the one feeding the Machine which you have destroyed. And now, I am lost.”  The freezing night approached, so Siphos led them back to the bottom of his crater. There, he showed them to his home: a shed made of corrugated metal panels propped up with steel rods and covered with threadbare woven kilims like the ones Ionna’s mother used to throw on the divans at home, only faded to pastel blues and pinks, their original colors lost to the bleaching of time. The rising slope of the crater doubled as the back wall of the shed.  Siphos instructed them to remove their shoes before they entered. His abruptness had given way to the mild-mannered, tender awkwardness of someone who hadn’t seen people in a long time.  They sat cross-legged on the floor, while their host lit a burn barrel for illumination and warmth.  “Siphos?” Niko whispered. “As in Sisyphos?”  “I don’t know,” Ionna answered.  “And the boulder? Could it be?”  “I don’t know,” she said again.  They carried on with soft-voiced conversation about anything but the strange situation in which they had found themselves. Once the fire was blazing high, Siphos offered them rehydrated flatbreads and tea that tasted suspiciously of real hibiscus.  “Where do you get your food?” Ionna asked.  He pointed at a hole in the rock behind them. “It comes out of there,” he said. “Same as the boulders,” he added, pointing at another, much larger hole outside the shed. Something dark passed briefly over his features, but then his expression settled to the one he wore before—patience or resignation, Ionna could not tell. “But now that you destroyed the Machine . . . ” He shrugged. “I do not know.”  “We can help you fix it,” Ionna offered.  He shook his head. “You cannot.”  “Why not?”  “You cannot,” he repeated, his voice rising slightly.  Ionna filed this under the list of things around which to tiptoe in the future, for fear of setting him off. “What does it do?” she asked. “The Machine.”  “It’s a compressor. Most of it is underground. It collects scrap metal and other material and it makes boulders out of them. I push the boulders from the bottom of the crater to the mouth of the Machine.”  “And then?”  “Then it takes the boulders away. A ship docks on the other side of the planetoid and transfers them back to the colony.” He paused. “This is how I repay my debt.”  “Your debt?”  Siphos nodded. When it was plain he would give no further details, Niko picked up the questioning while Ionna sipped her tea. “How long have you been doing this?”  “Too long,” Siphos said.  Not a real answer, but Niko let it drop and continued with a different angle: “Doesn’t the metal run out?” he asked.  Siphos looked at Niko, at her. Nodded in the direction of their hauler, nestled in the foreign rock one crater away. “New metal comes in.”  Ionna thought of the holosim waiting for her back at the ship, lighting her empty room, idle, silent. Did he know where they were, this father-who-was-not? Did he care? Was he happy that he wouldn’t be pestered with her questions tonight, unlike every other night of his simulated existence?  “Has the Machine ever broken down before?” Niko asked.  “No.” Siphos rubbed the knuckles of his left hand with his right, and then worked his way up the hand to the wrist, the elbow, the bicep. “This is the first time I stopped in many, many years.”  Ionna and Niko exchanged a glance. “She’s a hell of a mechanic,” Niko said. “We’ll do what we can to fix it for you.”  Ionna nodded. “We will.”  Siphos stopped massaging his arm and stared at his hands, as if trying to divine some fate written in the lines of his palms. “I am so tired,” he said.  “What happens if you stop?” Ionna asked.  “We cannot stop doing that which is ordained,” Siphos replied cryptically. “Cannot escape the demands of our heredity,” he added. It reminded her of the simulated replies of her father’s ghost.  Nobody spoke for a long time. The fire crackled, growing weaker and weaker.  “You said you were king, once?” Niko asked. “How did you end up with this job?”  Siphos paused before replying. “I made a mistake,” he said then.  “What mistake?”  He glanced at them, his eyes dark and shiny in the flames of the dying fire. “I was mean to my guests. Insulted the Xenios Zeus, the Philoxenon, the Hospites.” Old names only known to Ionna from the stories her father used to read her before bed. “I deserve everything that came to me.”  Could it really be?  Siphos stood up abruptly. “Get some sleep,” he said. “At first light, I’ll take you back to the top.”  First light was only a few hours away, but Ionna’s sleep was shallow and restless, filled with images that hurt like splinters under her skin. Some were memories, she knew, but there were others that she could not place or could not have lived: coming back home from a day of climbing the artificial mountains of her childhood with Niko, her father briefly proud of her scraped knees; the day she rushed to her father’s ship, ignoring the guards’ protests, shouting she was the commander’s daughter, to tell him she got her own hauler, only to be met with a terse “one day you might get a real ship—you should work harder”; and then, Siphos pushing his burdens eternally, boulder after boulder after boulder, his face toiling so close to metal it started resembling metal itself.  In the end, she gave up trying to sleep and simply lay there, counting the breaths of the sleeping men beside her: Niko’s, calm and long and rhythmic, as always; Siphos’, shallow and labored, as if he was still pushing boulders in his sleep. She thought of her father. What would she say to him if she were back at the hauler? She had spent so long talking to the holosim in the past year that she could play out entire conversations with him in her head, the lines between the real father and the simulated one blurring irretrievably.  You expected great things from your child, and I only ever wanted to make you proud, Daddy.  This is not a question, child. Do you have a question for me?  What should I do to make you proud?  You should try harder, try harder, be the best.  I never got to say goodbye. This is not a question either.  Goodbyes are for the weak. We’ll either see each other again, or we won’t.  Were you ever proud of me?  No response. No relevant record.  Did you ever love me?  A philosopher once said: “One always finds his burden again.”  At last Siphos stirred, so they rose from their makeshift beds and rolled the sleeping mats away. He offered them leftovers for breakfast. The hole in the wall had no more food to give today. No more hibiscus tea either.  “Ready?” Ionna asked the men, and they nodded. Siphos headed out first, leading the way up a path carved into the rock by his own feet, the countless times he’d pushed a boulder up the same slope. How many decades has he lived on this rock? Ionna asked herself. And then: How many others have walked this path before us, lured by the metal, trapped by that invisible hand?  When they reached the summit, Siphos grew agitated, as if he didn’t know what to do with himself now that he had no boulders to feed the Machine.  “Will you show me inside?” she asked him.  Niko stayed behind. “To watch for anything unexpected,” he said, but Ionna knew he meant to keep as far away as possible from anything in which the gods might have had a hand.  Siphos led her to the chamber that housed the kiln through a trapdoor that used to be at the top of the kiln but was now located on the side of the toppled structure.  The inside of the chamber was much larger than it looked from the outside—more like a factory floor than a machine.  Ionna found the large tube that took away the boulders and walked up to its mouth.  “You can’t go in there,” Siphos said. He sounded nervous.  “Why not?”  “It is forbidden to go through the tubes.”  “By whom?”  He ignored the question. “You will die if you go in there.”  “Why?”  “It is of the gods.”  Ionna shook her head but turned on her wrist monitor anyway to check for abnormal levels of radiation or anything that might lead to her untimely demise. She found nothing. To her, this was a machine like any other, and the fact that the tube could comfortably fit a person standing up could only mean that it had been built with the intention of allowing a person to do so.  “Let me investigate,” she said. “If I die, I die.”  She spotted the protest on his face, so she added the words she’d heard her father say many times to his religious subordinates: “I release you from any stain that might fall on you because of my death.”  That seemed to satisfy him, so she told him to send Niko after her if she hadn’t come back within a couple of hours. Then, she entered the tube guided by the light of her wrist monitor, checking for damage to the electronics along the way.  The tunnel continued in a straight line for a few meters and then took a deep dive into the ground. Ionna had to use her magboots to descend, making her thighs burn with effort.  Luckily, she hit the end of the tunnel before her knees gave out. The tunnel led to another chamber, this one equipped with what looked like four sets of large, metal fangs. A conveyor belt behind it led into another tube, this one ending in a compactor. A second conveyor belt strewn with loose metal also led into the compactor, which then ended in another tube. Ionna took a deep breath and followed that final tube, already half-certain where it would lead.  The tube took a sharp turn to the right and then descended almost vertically, until it turned again. The descent took about an hour.  When she emerged from the hole, Ionna found herself at the bottom of the crater, next to Siphos’ shed.  She looked up and saw Niko gesturing at her from the summit. “What are you doing down there?” he shouted.  “Come down,” she said. “Bring Siphos with you.”  “How did you get back down?” Niko asked once the men reached the bottom of the slope. “I didn’t see you come down.”  She pointed at the hole in the rock. “Through there.”  Niko shot her a questioning look but didn’t inquire further.  “So?” Siphos asked. “Can you fix it?”  She glanced at him and then turned her gaze back to the Machine looming over the top of the crater. It was plain to her now that this was a closed circuit: what came in was exactly what came out, only reconstituted. Whether that was so the boulders wouldn’t look identical or it was just another pointless step in a cycle of futility was beyond her. But one thing was certain: nothing got transported anywhere. The captured ships simply added to this accumulation of junk.  “Have you ever seen the ship that docks on the other side of the planetoid?” she asked Siphos.  “No,” he said. “I’m too busy here. Can’t stop for a second.” He rubbed his eyes. “This delay is going to cost my Ephyra dearly.”  “Sit down,” she told him.  He seemed puzzled by the order more than offended, but he sat down next to the extinguished barrel anyway.  “There’s no easy way to say this, so I’m just going to say it: I think someone has played a nasty trick on you, and it has gone on too long.” She paused, gathered her thoughts. “The boulders never make it out of the Machine. They simply get broken down and reconstituted and delivered to you so you can push them up and feed them to the Machine again and again and again.” She waited for him to reply, but he simply stared at her, silent. Had he really never heard the story of Sisyphos? “Do you understand what I’m saying, King Siphos?”  He nodded, looked away. He didn’t say a thing. Is it too difficult to believe, Ionna wondered, or too easy?  Niko sat down too and started braiding his hair. It was streaked with white, Ionna realized. All this time together, and she had never noticed before.  Then, after a long time, Siphos spoke again, his voice strained and old. “I have stared at so much rust up close,” he said. “It’s always there at the back of my throat, the burnt metal in my lungs.”  “Listen,” Ionna said. “You helped us, sheltered us. Technically, you now own half of our ship, if we’re going by the Old Laws.”  “The Old Laws,” Siphos echoed and laughed. A sad laugh, almost a sigh. “Nobody around here has gone by the Old Laws in a long time.”  “No matter. Come with us. You don’t have to stay here. You don’t have to do this anymore.”  Siphos hid his head in his hands and, for a moment, he seemed small. A young man, almost a child—not the strong bull-like body they first saw pushing that enormous boulder up the slope.  “No,” he said finally.  “No?” Niko asked. “What do you mean?”  “What am I to do if I leave here? I can run my fingers over the cold surface of this rock and I know it exists. I can feel my heart beating against my ribs when I strive under the metal and I know I exist. That is all I know. And that is enough.” He took in a shuddering breath. “It’s either this, or death. Either this, or nothing at all.” He turned to Ionna again. “Help me fix the Machine and I will forever owe you a debt.”  “Haven’t you been punished enough?” Niko asked.  Siphos laughed again. “I think my punishment has only just begun. For is there anything more punishing than knowing your work is futile, anything more painful than labor that will never bear fruits?”  So they helped him, they did. Ionna told him that she needed her tools from the hauler and that it would take a few days, but she could fix his Machine. Siphos was relieved, grateful even, and Ionna almost forgot what he asked for and what she offered was the extension of a torture. She told herself she finally got to make a difference, put her skills to good use, something other than mining precious metals for the big corps back on Terra—for was their hauling that much different from the king’s?  Would her father be proud now?  She spent days diving in and out of the Machine, Niko too reluctant to help her still, and Siphos staying behind on the surface, leaning against the opening, a centuries-old exhaustion weighing down on his idle limbs. Sometimes, she lingered at the mouth of the tube, watching him gaze out at the lonely space.  Or maybe he didn’t think of it this way.  Maybe someone like Siphos never thought of loneliness.  In the end, she fixed the Machine, and then she fixed the ship. The mysterious hand that captured them had by now released its grip, as if it had fulfilled its purpose, or as if it had never existed at all. Siphos offered them more of his improbable hibiscus tea, and then he gave them as much platinum as they could fit in the hauler, more than enough to buy a better ship and at least six months off work. Niko could finally enjoy time with his family. What Ionna would do with all that time on Ceres, she didn’t quite know. Visit the mountains of her childhood again, maybe, try to rediscover who she had wanted to be before she decided to be someone her father approved of.  She never found out if the man they met on that planetoid was the mythical Sisyphos of the stories of her youth, his name mutated through the mangling of time, or someone whose punishment was merely modeled on the ancient king. She probably never would. They broke bread, however, and then they shook hands and waved goodbye the way mortals do.  Before liftoff, Niko asked if she was ready.  “For what?” she asked back.  He took a long time to reply, but finally he nodded towards the back of the ship. “There’s a reason futility was meant as a punishment for Sisyphos,” he said.  Ionna nodded. She understood. There was no need to say more.  She took in a deep breath and walked to her room. The holosim waited there, staring vacantly ahead.  “I missed you,” she whispered in the dark.  The holosim either did not hear her, or it chose not to respond. But that was not what she was there for. Besides, what approval could be supplied by a hard man’s ghost?  She approached the device and felt behind it with her fingers. If she tried, she could almost convince herself that her father’s body gave off warmth—even now, after everything.  Her fingers found the switch.  “Goodbye, Daddy,” she said.  The holosim flickered and then dissipated, leaving behind no trace, as if it had never existed at all.  Ionna made her way back to the cockpit and sat next to Niko.  “All good?” he asked.  She nodded. “All good.”  The hauler took off effortlessly, as if light, wholly unburdened by its precious cargo. Ionna glanced back for the last time as they left behind the gray rock.  In the distance, Siphos rolled a boulder up to the open maw of the Machine. Natalia Theodoridou is a media & cultural studies scholar, the winner of the 2018 World Fantasy Award for Short Fiction, and a Clarion West graduate (class of 2018). Natalia's stories have appeared in Strange Horizons, Uncanny, Beneath Ceaseless Skies, F&SF, Fireside, and elsewhere. Rent-a-Vice, a cyberpunk interactive noir published by Choice of Games, was a 2018 Nebula Award Finalist. For details, follow @natalia_theodor on Twitter.", "text": "5170 words, short story\nOne's Burden, Again\n“It’s freezing today,” Ionna said, although she knew the temperature in the ship was always the same. It didn’t make her feel any warmer. As if the cold of space had settled into her bones.\n“Won’t be long now.” Niko finished securing the cargo area and initiated a routine maintenance check of the entire ship. “That was a good haul,” he said. “One more and we’ll be going home.” He ran his fingers over the faces of his daughters looking back at him from the photo pinned next to the navigation panel. Then he turned and glanced at Ionna.\nShe avoided his eyes.\nThey left unsaid the conversation about the family he missed and the family she no longer had. Instead, they watched the darkness outside in tight-lipped silence.\n“So, where to?” Ionna asked after a while.\n“I get great readings for platinum from less than a million kilometers away.”\n“Show me.”\nNiko tightened his ponytail to keep his long black hair from falling into his face. He magnified a quadrant and pointed at a small nothing in the corner. “It’s one of the Greeks past Jupiter. The concentration of platinum is absurdly high.”\n“Could it be a misread?”\nHe showed her his palms—a gesture that meant, how would I know?\n“Any obviously better options?”\n“No.”\n“Then we might as well check it out.”\nNiko nodded and set the course.\nIonna rubbed her palms together. Still bloody cold. “All right,” she said. “I’m turning in.”\nHe looked at her a moment too long, seemed to decide not to say anything, then said it anyway: “Don’t talk to it, Ionna.” They had fought about this many times. More times than she cared to remember. “It’s been long enough. This stopped being about processing your grief a long time ago. It’s not good for you.”\n“Long enough? What does that even mean? Long enough for whom?” She paused. “Let’s not get into this again,” Ionna said. “It’s not worth the oxygen.”\n“Okay,” Niko replied, obviously resigned, obviously not wanting to punch and make up this time. “I’ll ping you when we are close.”\nIonna turned around and made her way back to her sleeping quarters, magboots clicking on the grid underneath.\nShe left the overhead lights off, so her room was illuminated only by the weak glow of the holosim. It tinted the walls a ghostly blue.\n“Are you sleeping, Daddy?” she asked, even though she knew holosims don’t sleep.\n“Did you have a good day?” it asked back—one of his standard lines. Something in her chest tightened. This was not her father. She knew that. It didn’t matter. This was nothing but a collection of everything he’d said or written that had been preserved in record. Her father was dead in the ground and a pastiche of recordings grafted onto a chatbot does not a person make. It still didn’t matter.\n“I’m cold,” she told him.\n“Boreas is the god of winter,” the sim replied helpfully. “You should put on an extra blanket tonight, sweetbug.” A line from a much younger father, tucking his daughter in for the night after reading to her, back on Ceres. He had stuck fluorescent stars to the ceiling of her room because she was afraid of the dark, and stars still seemed like a comforting thing to look up to, back then.\nShe studied her father’s paper-thin skin, the brown splotches and liver spots on the backs of his hands, looking for the signs of illness she had missed before and still failing to find them. “When were you going to tell me you were sick?” she asked. “Were you ever going to tell me?”\n“The sins of the father are visited on the son,” her father responded, and she kept herself from wincing at the mention of a son, at this lack, this deficiency that had been beaten into her since birth, and then she racked her brains for the source of that line, sure that she had never heard her father say it while he was still alive. Not in so many words, anyway. Or maybe he did, and she had forgotten it. She had tried so hard to forget so many things her father said—perhaps she had succeeded, after all. “You should try harder,” the holosim continued. This one she’d heard multiple times before.\n“What more did you want from me?” She opened her arms, a motion meant to encompass it all: the room, the ship, the vast, cold space. “I’ve only ever done what you wanted me to do.”\n“Be great,” her father said. “There is freedom in greatness.”\n“What would you have said to me, if I had come home before it was too late?”\nThe sim flickered, pixels failing at her father’s edges, bits of him missing. Manos had always been a man of few words, his logs brief and impersonal. He was never going to make a great sim.\nShe walked closer. “What else have you not told me?”\nThe sim made no reply.\nShe woke up with a violent shake that made the straps holding her down in her bunk dig into her chest. She rolled out of bed and headed to the bridge, not bothering with magboots; she propelled herself, weightless, as fast as she could.\nThe hauler was coursing towards what looked like the target planetoid much, much faster than it should.\nNiko was frantically instructing the ship, which seemed unresponsive. He finally switched to manual and tried to course-correct.\n“Niko, talk to me.”\nHe threw his hands in the air and then brought them down on his controls, cursing loudly. “Don’t know what the hell is going on. I’ve lost control.” He turned to her, realization dawning on his face, followed by barely concealed panic. “Strap in. This will hurt.”\nIonna deposited herself in the seat next to him as quickly as she could and strapped herself down.\nThe planetoid was approaching fast. Ionna took in the landscape, thinking this might be the last thing she saw: this hard, gray rock; this face pockmarked with deep craters.\n“Do you have control of the reverse thrusters?” she asked.\n“Already thought of that. No.”\n“Okay,” she said. “Okay.” She closed her eyes, preparing for impact, but Niko objected.\n“Look,” he said. “Look.” So she did.\n“That can’t be right.”\nThere was a large, clearly artificial structure perched at the top of one of the deeper craters.\n“Gods,” Niko said in that tone he always had when speaking of the unseen world, and he touched the nape of his neck to shelter himself from divine misfortune.\n“A machine of some sort?” Ionna asked, fighting to keep her eyes open. “A processing plant?”\n“We’ll find out. Maybe.”\nThey would, because they were heading right towards it. If there was enough of it left after they crashed on it, that was.\nMoments later, the hauler slowed down, as if grasped by an invisible hand. The deceleration was enough to make their crash landing painful but not lethal. A few meters to the right, and they would have missed the machine entirely; but as it was, they hit the very top of the structure, causing it to topple over. The ship dragged on the ground and came to a halt at the bottom of another crater.\nIonna’s heart was beating against her chest like a caged animal. She tried to calm her breathing enough to be able to speak, but Niko got there first.\n“You okay?”\nShe did a quick check of her body. Everything felt relatively intact: bruised and banged up, sure, but not broken. This was not a regular landing. Not even a regular crash. They should be dead.\nShe nodded and unstrapped herself from the seat while Niko did the same. They hugged. She let out a long, strained breath.\nNiko released her from his embrace and bounced lightly on the balls of his feet. “Gravity,” he said. “More than expected.”\n“This isn’t normal,” she replied, the fine hairs on her neck standing on end.\n“You got that right.”\nThey slipped into their suits and made their way out of the ship with some hesitation. The area was strewn with rusted pieces of metal and ancient electronics. At least that was one mystery solved: This was someone’s junkyard. The readings had merely indicated platinum that had already been mined hundreds of years ago.\nNiko checked the values on his wrist monitor. “It has an atmosphere, too,” he said. Before Ionna had a chance to stop him, protesting that this was impossible, planetoids this size do not have atmospheres, Niko had unfastened and removed his helmet. “Breathable,” he confirmed with a terrified grin.\nThis land was clearly touched by the gods, and now so were they. She didn’t like it. But it was what it was.\nIonna released her own helmet and took in a deep breath. The air smelled metallic. The faint taste of something burnt clung to the back of her throat, lined the inside of her lungs. A thought resounded in her mind, unprompted and inexplicable, like the voice of a god: this will be me from now on. Burnt metal in the lungs.\nHer heart raced again, cold sweat blooming from the roots of her hair. She wanted to run back to the hauler, back to her room, to check on her father’s holosim, make sure he was still there, still intact, idly waiting for her questions only to avoid answering them. She resisted the urge. Instead, she tapped Niko on the shoulder and nodded in the direction of the strange metal structure they had knocked over.\nAccording to their wrist monitors’ imperfect mapping of the planetoid, the crater in which they landed was not one of the deepest in the area, but it still took them more than an hour to scale the slope. Once they reached the surface, they paused to catch their breaths. They gazed at the hard land reflecting the faint light of a distant star. Apart from the toppled structure, the planetoid seemed pristine; there was no indication that it may be inhabited, and all the craters were deep enough to conceal the precious junk that lay at their bellies.\nUpon closer inspection, the structure looked like a cross between a tower and a kiln, housed in a rectangular chamber, with a tube leading out of the structure and into the ground. The tube was large enough to fit a person standing up, though the purpose it served was unclear. From then on, there was no telling where it might end, if anywhere.\n“What do you suppose this is?” Niko asked.\nIonna opened her mouth to reply, but a deep, guttural sound from behind them spun both of them around.\nUp the steep slope came a man, pushing an enormous boulder made of what looked like compressed metal. The man grunted. His bare torso glistened with sweat. He paused briefly, supporting the boulder with his shoulder, and with a swift maneuver turned around and pushed the boulder with his back for the last few meters, his feet finding purchase against the rocky ground with practiced ease.\nIonna and Niko rushed over to help him pull the boulder over the edge to the top. Once it rested on flat surface, the man collapsed on the ground next to the boulder, the size of the man comparable to the size of the boulder, and breathed deeply through the nose. There were tears streaking down his cheeks and wetting his dark, bushy beard. His skin was carved with hundreds of scars, some fresh, others clearly old, betraying a lifetime of naked skin laboring against raw metal.\nThe man grunted again and covered his eyes with his palms. “What have you done?” he cried, his voice full of cracks. “What have you cursed strangers done?”\nIonna stood over the man and extended her arm to help him up. “We crashed,” she said, rather redundantly. “I am Ionna. This is Niko. We are miners.”\nThe man uncovered his eyes and wiped his tears away with the back of his hand. He ignored Ionna’s outstretched arm and pushed himself up from the ground on his own.\nStanding, he towered over her, almost a foot taller than either of them, and for a moment she thought he could destroy them, if he wanted, smite them down like a god.\n“My name is Siphos,” he said, and, at first, Ionna thought he said Sisyphos, the cursed king of Corinth whose story her father told her when she was small. But surely not. Surely not.\nThe man’s voice was calm, but there was something just under the surface, seething, threatening. “I used to be king of Ephyra.” He pronounced this like it should mean something to Ionna, but it didn’t. She’d never heard of a place called Ephyra.\nSiphos turned around and inspected the result of the crash, his gaze traveling between the wrecked structure and his boulder of scrap metal. “First I was king, and then I was the one feeding the Machine which you have destroyed. And now, I am lost.”\nThe freezing night approached, so Siphos led them back to the bottom of his crater. There, he showed them to his home: a shed made of corrugated metal panels propped up with steel rods and covered with threadbare woven kilims like the ones Ionna’s mother used to throw on the divans at home, only faded to pastel blues and pinks, their original colors lost to the bleaching of time. The rising slope of the crater doubled as the back wall of the shed.\nSiphos instructed them to remove their shoes before they entered. His abruptness had given way to the mild-mannered, tender awkwardness of someone who hadn’t seen people in a long time.\nThey sat cross-legged on the floor, while their host lit a burn barrel for illumination and warmth.\n“Siphos?” Niko whispered. “As in Sisyphos?”\n“I don’t know,” Ionna answered.\n“And the boulder? Could it be?”\n“I don’t know,” she said again.\nThey carried on with soft-voiced conversation about anything but the strange situation in which they had found themselves. Once the fire was blazing high, Siphos offered them rehydrated flatbreads and tea that tasted suspiciously of real hibiscus.\n“Where do you get your food?” Ionna asked.\nHe pointed at a hole in the rock behind them. “It comes out of there,” he said. “Same as the boulders,” he added, pointing at another, much larger hole outside the shed. Something dark passed briefly over his features, but then his expression settled to the one he wore before—patience or resignation, Ionna could not tell. “But now that you destroyed the Machine . . . ” He shrugged. “I do not know.”\n“We can help you fix it,” Ionna offered.\nHe shook his head. “You cannot.”\n“Why not?”\n“You cannot,” he repeated, his voice rising slightly.\nIonna filed this under the list of things around which to tiptoe in the future, for fear of setting him off. “What does it do?” she asked. “The Machine.”\n“It’s a compressor. Most of it is underground. It collects scrap metal and other material and it makes boulders out of them. I push the boulders from the bottom of the crater to the mouth of the Machine.”\n“And then?”\n“Then it takes the boulders away. A ship docks on the other side of the planetoid and transfers them back to the colony.” He paused. “This is how I repay my debt.”\n“Your debt?”\nSiphos nodded. When it was plain he would give no further details, Niko picked up the questioning while Ionna sipped her tea. “How long have you been doing this?”\n“Too long,” Siphos said.\nNot a real answer, but Niko let it drop and continued with a different angle: “Doesn’t the metal run out?” he asked.\nSiphos looked at Niko, at her. Nodded in the direction of their hauler, nestled in the foreign rock one crater away. “New metal comes in.”\nIonna thought of the holosim waiting for her back at the ship, lighting her empty room, idle, silent. Did he know where they were, this father-who-was-not? Did he care? Was he happy that he wouldn’t be pestered with her questions tonight, unlike every other night of his simulated existence?\n“Has the Machine ever broken down before?” Niko asked.\n“No.” Siphos rubbed the knuckles of his left hand with his right, and then worked his way up the hand to the wrist, the elbow, the bicep. “This is the first time I stopped in many, many years.”\nIonna and Niko exchanged a glance. “She’s a hell of a mechanic,” Niko said. “We’ll do what we can to fix it for you.”\nIonna nodded. “We will.”\nSiphos stopped massaging his arm and stared at his hands, as if trying to divine some fate written in the lines of his palms. “I am so tired,” he said.\n“What happens if you stop?” Ionna asked.\n“We cannot stop doing that which is ordained,” Siphos replied cryptically. “Cannot escape the demands of our heredity,” he added. It reminded her of the simulated replies of her father’s ghost.\nNobody spoke for a long time. The fire crackled, growing weaker and weaker.\n“You said you were king, once?” Niko asked. “How did you end up with this job?”\nSiphos paused before replying. “I made a mistake,” he said then.\n“What mistake?”\nHe glanced at them, his eyes dark and shiny in the flames of the dying fire. “I was mean to my guests. Insulted the Xenios Zeus, the Philoxenon, the Hospites.” Old names only known to Ionna from the stories her father used to read her before bed. “I deserve everything that came to me.”\nCould it really be?\nSiphos stood up abruptly. “Get some sleep,” he said. “At first light, I’ll take you back to the top.”\nFirst light was only a few hours away, but Ionna’s sleep was shallow and restless, filled with images that hurt like splinters under her skin. Some were memories, she knew, but there were others that she could not place or could not have lived: coming back home from a day of climbing the artificial mountains of her childhood with Niko, her father briefly proud of her scraped knees; the day she rushed to her father’s ship, ignoring the guards’ protests, shouting she was the commander’s daughter, to tell him she got her own hauler, only to be met with a terse “one day you might get a real ship—you should work harder”; and then, Siphos pushing his burdens eternally, boulder after boulder after boulder, his face toiling so close to metal it started resembling metal itself.\nIn the end, she gave up trying to sleep and simply lay there, counting the breaths of the sleeping men beside her: Niko’s, calm and long and rhythmic, as always; Siphos’, shallow and labored, as if he was still pushing boulders in his sleep. She thought of her father. What would she say to him if she were back at the hauler? She had spent so long talking to the holosim in the past year that she could play out entire conversations with him in her head, the lines between the real father and the simulated one blurring irretrievably.\nYou expected great things from your child, and I only ever wanted to make you proud, Daddy.\nThis is not a question, child. Do you have a question for me?\nWhat should I do to make you proud?\nYou should try harder, try harder, be the best.\nI never got to say goodbye. This is not a question either.\nGoodbyes are for the weak. We’ll either see each other again, or we won’t.\nWere you ever proud of me?\nNo response. No relevant record.\nDid you ever love me?\nA philosopher once said: “One always finds his burden again.”\nAt last Siphos stirred, so they rose from their makeshift beds and rolled the sleeping mats away. He offered them leftovers for breakfast. The hole in the wall had no more food to give today. No more hibiscus tea either.\n“Ready?” Ionna asked the men, and they nodded. Siphos headed out first, leading the way up a path carved into the rock by his own feet, the countless times he’d pushed a boulder up the same slope. How many decades has he lived on this rock? Ionna asked herself. And then: How many others have walked this path before us, lured by the metal, trapped by that invisible hand?\nWhen they reached the summit, Siphos grew agitated, as if he didn’t know what to do with himself now that he had no boulders to feed the Machine.\n“Will you show me inside?” she asked him.\nNiko stayed behind. “To watch for anything unexpected,” he said, but Ionna knew he meant to keep as far away as possible from anything in which the gods might have had a hand.\nSiphos led her to the chamber that housed the kiln through a trapdoor that used to be at the top of the kiln but was now located on the side of the toppled structure.\nThe inside of the chamber was much larger than it looked from the outside—more like a factory floor than a machine.\nIonna found the large tube that took away the boulders and walked up to its mouth.\n“You can’t go in there,” Siphos said. He sounded nervous.\n“Why not?”\n“It is forbidden to go through the tubes.”\n“By whom?”\nHe ignored the question. “You will die if you go in there.”\n“Why?”\n“It is of the gods.”\nIonna shook her head but turned on her wrist monitor anyway to check for abnormal levels of radiation or anything that might lead to her untimely demise. She found nothing. To her, this was a machine like any other, and the fact that the tube could comfortably fit a person standing up could only mean that it had been built with the intention of allowing a person to do so.\n“Let me investigate,” she said. “If I die, I die.”\nShe spotted the protest on his face, so she added the words she’d heard her father say many times to his religious subordinates: “I release you from any stain that might fall on you because of my death.”\nThat seemed to satisfy him, so she told him to send Niko after her if she hadn’t come back within a couple of hours. Then, she entered the tube guided by the light of her wrist monitor, checking for damage to the electronics along the way.\nThe tunnel continued in a straight line for a few meters and then took a deep dive into the ground. Ionna had to use her magboots to descend, making her thighs burn with effort.\nLuckily, she hit the end of the tunnel before her knees gave out. The tunnel led to another chamber, this one equipped with what looked like four sets of large, metal fangs. A conveyor belt behind it led into another tube, this one ending in a compactor. A second conveyor belt strewn with loose metal also led into the compactor, which then ended in another tube. Ionna took a deep breath and followed that final tube, already half-certain where it would lead.\nThe tube took a sharp turn to the right and then descended almost vertically, until it turned again. The descent took about an hour.\nWhen she emerged from the hole, Ionna found herself at the bottom of the crater, next to Siphos’ shed.\nShe looked up and saw Niko gesturing at her from the summit. “What are you doing down there?” he shouted.\n“Come down,” she said. “Bring Siphos with you.”\n“How did you get back down?” Niko asked once the men reached the bottom of the slope. “I didn’t see you come down.”\nShe pointed at the hole in the rock. “Through there.”\nNiko shot her a questioning look but didn’t inquire further.\n“So?” Siphos asked. “Can you fix it?”\nShe glanced at him and then turned her gaze back to the Machine looming over the top of the crater. It was plain to her now that this was a closed circuit: what came in was exactly what came out, only reconstituted. Whether that was so the boulders wouldn’t look identical or it was just another pointless step in a cycle of futility was beyond her. But one thing was certain: nothing got transported anywhere. The captured ships simply added to this accumulation of junk.\n“Have you ever seen the ship that docks on the other side of the planetoid?” she asked Siphos.\n“No,” he said. “I’m too busy here. Can’t stop for a second.” He rubbed his eyes. “This delay is going to cost my Ephyra dearly.”\n“Sit down,” she told him.\nHe seemed puzzled by the order more than offended, but he sat down next to the extinguished barrel anyway.\n“There’s no easy way to say this, so I’m just going to say it: I think someone has played a nasty trick on you, and it has gone on too long.” She paused, gathered her thoughts. “The boulders never make it out of the Machine. They simply get broken down and reconstituted and delivered to you so you can push them up and feed them to the Machine again and again and again.” She waited for him to reply, but he simply stared at her, silent. Had he really never heard the story of Sisyphos? “Do you understand what I’m saying, King Siphos?”\nHe nodded, looked away. He didn’t say a thing. Is it too difficult to believe, Ionna wondered, or too easy?\nNiko sat down too and started braiding his hair. It was streaked with white, Ionna realized. All this time together, and she had never noticed before.\nThen, after a long time, Siphos spoke again, his voice strained and old. “I have stared at so much rust up close,” he said. “It’s always there at the back of my throat, the burnt metal in my lungs.”\n“Listen,” Ionna said. “You helped us, sheltered us. Technically, you now own half of our ship, if we’re going by the Old Laws.”\n“The Old Laws,” Siphos echoed and laughed. A sad laugh, almost a sigh. “Nobody around here has gone by the Old Laws in a long time.”\n“No matter. Come with us. You don’t have to stay here. You don’t have to do this anymore.”\nSiphos hid his head in his hands and, for a moment, he seemed small. A young man, almost a child—not the strong bull-like body they first saw pushing that enormous boulder up the slope.\n“No,” he said finally.\n“No?” Niko asked. “What do you mean?”\n“What am I to do if I leave here? I can run my fingers over the cold surface of this rock and I know it exists. I can feel my heart beating against my ribs when I strive under the metal and I know I exist. That is all I know. And that is enough.” He took in a shuddering breath. “It’s either this, or death. Either this, or nothing at all.” He turned to Ionna again. “Help me fix the Machine and I will forever owe you a debt.”\n“Haven’t you been punished enough?” Niko asked.\nSiphos laughed again. “I think my punishment has only just begun. For is there anything more punishing than knowing your work is futile, anything more painful than labor that will never bear fruits?”\nSo they helped him, they did. Ionna told him that she needed her tools from the hauler and that it would take a few days, but she could fix his Machine. Siphos was relieved, grateful even, and Ionna almost forgot what he asked for and what she offered was the extension of a torture. She told herself she finally got to make a difference, put her skills to good use, something other than mining precious metals for the big corps back on Terra—for was their hauling that much different from the king’s?\nWould her father be proud now?\nShe spent days diving in and out of the Machine, Niko too reluctant to help her still, and Siphos staying behind on the surface, leaning against the opening, a centuries-old exhaustion weighing down on his idle limbs. Sometimes, she lingered at the mouth of the tube, watching him gaze out at the lonely space.\nOr maybe he didn’t think of it this way.\nMaybe someone like Siphos never thought of loneliness.\nIn the end, she fixed the Machine, and then she fixed the ship. The mysterious hand that captured them had by now released its grip, as if it had fulfilled its purpose, or as if it had never existed at all. Siphos offered them more of his improbable hibiscus tea, and then he gave them as much platinum as they could fit in the hauler, more than enough to buy a better ship and at least six months off work. Niko could finally enjoy time with his family. What Ionna would do with all that time on Ceres, she didn’t quite know. Visit the mountains of her childhood again, maybe, try to rediscover who she had wanted to be before she decided to be someone her father approved of.\nShe never found out if the man they met on that planetoid was the mythical Sisyphos of the stories of her youth, his name mutated through the mangling of time, or someone whose punishment was merely modeled on the ancient king. She probably never would. They broke bread, however, and then they shook hands and waved goodbye the way mortals do.\nBefore liftoff, Niko asked if she was ready.\n“For what?” she asked back.\nHe took a long time to reply, but finally he nodded towards the back of the ship. “There’s a reason futility was meant as a punishment for Sisyphos,” he said.\nIonna nodded. She understood. There was no need to say more.\nShe took in a deep breath and walked to her room. The holosim waited there, staring vacantly ahead.\n“I missed you,” she whispered in the dark.\nThe holosim either did not hear her, or it chose not to respond. But that was not what she was there for. Besides, what approval could be supplied by a hard man’s ghost?\nShe approached the device and felt behind it with her fingers. If she tried, she could almost convince herself that her father’s body gave off warmth—even now, after everything.\nHer fingers found the switch.\n“Goodbye, Daddy,” she said.\nThe holosim flickered and then dissipated, leaving behind no trace, as if it had never existed at all.\nIonna made her way back to the cockpit and sat next to Niko.\n“All good?” he asked.\nShe nodded. “All good.”\nThe hauler took off effortlessly, as if light, wholly unburdened by its precious cargo. Ionna glanced back for the last time as they left behind the gray rock.\nIn the distance, Siphos rolled a boulder up to the open maw of the Machine.\nNatalia Theodoridou is a media & cultural studies scholar, the winner of the 2018 World Fantasy Award for Short Fiction, and a Clarion West graduate (class of 2018). Natalia's stories have appeared in Strange Horizons, Uncanny, Beneath Ceaseless Skies, F&SF, Fireside, and elsewhere. Rent-a-Vice, a cyberpunk interactive noir published by Choice of Games, was a 2018 Nebula Award Finalist. For details, follow @natalia_theodor on Twitter.", "source": "https://clarkesworldmagazine.com/theodoridou_01_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: One's Burden, Again by Natalia Theodoridou"}