{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Henry Szabranski", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "J2mtAR+3s7wTcX91ofL0l5D4qBo=", "id": null, "license": null, "comments": "", "raw_text": "5070 words, short story  The Veilonaut's Dream  Sometimes the Discontinuity kinks and curves and flips about as if it is alive.  Openings slide along its vast length like undigested morsels down the gullet of a cosmic serpent. Feathery tendrils shoot out, slowly curling up and fading, each a traveling shadow-slice through some theorized higher-dimensional object. But today . . . today the gap weather is good. There is no sign of movement or instability; the anomaly is razor-straight and steady. A thirty meters high, ten thousand kilometer long, barely visible veil that glimmers on either side of us as far as we can see.  Franco and Zhang float beside me. They are waiting for my command.  “Mads? Are we going through today?”  Franco is impatient. He’s very much a get-it-over-with type of guy. Luckily, we’ve been on enough missions together I feel I can ignore him. But he’s right: the idea of turning back dominates my thoughts. It’s not too late to stop, to return to the Observatory, though we’ve signed the contract and the penalty will be high. No doubt Franco and Zhang will denounce my cowardice to mask their own relief—but what do I care about money and reputation anymore?  I check the time since the last change. One hour twenty-two minutes. The average is just over seventy-four hours. Information both critical and useless. There’s no knowing how long the gap will remain stable. It could be seconds, minutes, days—even months or years. The Discontinuity’s size, its shape, the location of the region it opens onto, all of these can and do alter without warning. In the blink of a veilonaut’s eye.  “I’d rather be cut,” Zhang declares. She’s a newbie, fresh arrived from in-system, both terrified and eager. Not a researcher, but one of the new crop of mercenary explorers. When I announced I was going to brave the gap today she had scrambled to tag along. “You may lose a limb or two,” she says, “but the v-suit will keep you alive until the medics reach you. There’s still a chance of survival.”  “They couldn’t save Quinn,” Franco points out. His tone weary and worldly-wise. He loves to play the grizzled veteran. “Neither the v-suit nor the medics.”  Eleven days ago Quinn was caught mid-gap during a change. In some distant lost region of space-time, his missing body parts still tumble. I shudder at the memory.  “But at least he died quickly,” Zhang presses on, oblivious to Franco’s disapproval. “I’d rather be Quinn than Su. Quinn didn’t feel a thing, but Su’s still out there, somewhere. Gasping her last air, wishing she were dead. It must be a nightmare.”  Franco glares at Zhang. “Not cool, OK? Not the time or place. Not the thing to say.”  “Concentrate on what you’re doing.” My voice sounds perfectly calm over the comms link, with no sign of my irritation at Zhang’s ignorant chatter, or the barely contained churn of emotions within me. Perhaps it’s the mix of synth-absinthe and sedatives I’ve dosed up on, their welcome numbing effect. Against mission regs, but the Observatory turns a blind eye, long since drifted from its regimented academic origins. Hardly any exploration would be done, otherwise.  “It’s almost time to cross,” I remind everyone, careful not slur my words.  Off-comms my breath hitches. Zhang may be crass, but she’s not being intentionally malicious. She doesn’t know about Su and me; we’d kept it quiet, at first to avoid drama, then as an ongoing game. Not even Franco knows, though he may suspect. And Zhang’s right: Su’s still out there. Just about now, relative to our timeframe, the last power in her v-suit battery fading. She remains unreachable. Unrescuable. Lost in some distant past or far future. My last words to her before she crossed over had been harsh. We’d argued. I’d called her a fool, a zealot, a selfish dreamer. That she was absolutely wrong about the Discontinuity. I refused to follow her and Quinn on their doomed mission. “I’ll find you your world,” Su had boasted. “I promise I’ll find it for you.”  I’d hurled a half-empty drink bulb at her retreating back.  I should have been with her. Been there when the gap swallowed her whole.  That’s the other part of the Discontinuity’s terror. Crossings are done at speed, to reduce the risk of bisection, which is neat and instantaneous if you’re caught passing through mid-change. But even if you’re spared that gruesome fate, you can still find yourself stranded on the far side after the gap has moved on. The records show the same region has never appeared twice. Sure, you can survive for a while, protected and preserved in your vacuum suit, but there’s no prospect of rescue or return. Cut off forever, unreachable, supplies dwindling, your last desperate pleas will be unheard as the Discontinuity continues to cycle on and the Observatory lights blink away out here beyond Pluto’s orbit, their cast-off photons more distant from you than the moment of creation.  To be cut or to be lost. Every veilonaut has to face either possibility each time they pass through the gap.  “You OK, Mads?”  Franco’s silhouette floats dark against the veil’s Cherenkov shimmer. Just as mine had drifted as I waited, angry and impatient for Su’s return, eleven days and only a moment and eternity ago. I was there when the Discontinuity shrugged away a billion suns and spewed forth Quinn’s almost-through body. Even now, my hand twitches instinctively, tries to shield me from the memory. Droplets that sparked against my v-suit field like a bloody meteor shower.  “Mads?”  “I’m fine. Let’s get into position.”  I toggle the nav system controls. Our propulsion backpacks spurt into life, begin a series of pre-programmed maneuvers that will push us closer to the gap.  Zhang crosses herself. She can barely bring herself to look at the rippling veil. Franco, too, is muttering some off-comms incantation. Despite all the known science, the cold hard facts, a fog of superstition still surrounds the anomaly. I don’t have much time for the irrational convictions of my fellow veilonauts. More than a handful swear they have glimpsed or felt some mysterious presence as they’ve passed through the gap. They believe the long dead Others remain inside the rift they created, ghosts trapped within the veil. Some believe the Discontinuity itself is a living, conscious entity, worthy of worship. Even I, normally so scathing of such irrational beliefs, find myself mouthing a silent prayer to the rumored gods of the gap in the moments before crossing. To the angels of the veil, to the ancient long-lost Others. If they exist, or if they don’t. Please protect us as we pass through. Hold the gap open for our safe return.  So far my prayers have been answered. Lucky Madeleine, they call me, Blessed Lady of the Veil. A talisman. More successful missions than any other veilonaut.  But I know the truth. The cold, hard math of probability.  Everyone is lucky crossing the gap.  Everyone.  Until they’re not.  The elapsed time counter ticks over. One hour twenty-six minutes.  “Mads? Are you ready?”  One last time, then. One final mission. For love lost, for hopeless hope, for a dream of blue and white and green. “I’m ready, Franco. Are you?”  “Of course.”  I take a deep breath, sweat beading on my forehead. “Initiate burn on my mark.”  I concentrate on the Discontinuity. For it to do my bidding, just as Su said.  Franco reaches out. Zhang grasps his hand.  “Three.”  Zhang stretches towards me, and after a moment’s hesitation I take hold of her hand as well.  “Two.”  Our breath comes faster, our pulses elevated. We are all linked together, fates entwined. Engine packs perpendicular to the face of the gap.  “One.”  I say my silent crossing prayer.  “Mark.”  I don’t feel anything as I pass through the veil.  Some swear they experience a moment of disorientation. Or, for a few, a full-on rapture. But I’ve never felt more than a faint tug or seen anything other than a brief blink of blue as I cross over. No visions, no angels.  No ghosts.  No, that’s wrong. I do feel something. Terror, mostly. Mingled with anticipation. Hope. That more than darkness will greet me.  Hope quickly dashed.  I guess Su was wrong.  Pre-programmed hydrazine bursts from our packs spin us around and decelerate us to a stop relative to the gap through which we’ve just passed. The Observatory swings back into view, paradoxically only hundreds of meters away and yet at the same time now countless billions of lightyears distant. Our sun still gleams, glimpsed back through the rift, the brightest star even here.  The far side is almost always disappointing. Most of the universe is empty and if the region the Discontinuity opens onto is truly random, then almost inevitably the gap opens onto rarefied intergalactic space far distant from any stars and planets and other forms of baryonic matter. Most often the far side’s temperature is barely above the CMB. It’s cold, dark, empty; void and devoid.  So it is again, this time.  “OK team.” The fact is nowadays veilonauts are paid by the second, not on their opinion of the far side’s interest. “You know the drill. We’ve contracted for at least ten minutes. Timer starts . . . now.”  I give the orders automatically, autonomically, trying not to show my relief at surviving transit. Just one more crossing—back to the Observatory—and then I’m done with the Discontinuity and its cruel game of chance forever.  Franco and Zhang deploy their latest research equipment. It’s a waste of time, but it’s what they’re paid to do. Perhaps there’s been some breakthrough in observational technology by their sponsors, perhaps this time it’ll be different. I’m not holding my breath. Countless automated probes have tried to replicate our work. They always fail. Veilonauts pass through the Discontinuity, make observations, return safely—but nothing of the far side is ever recorded. Only images and measurements of our own solar system, of our own galaxy, as if the hugely expensive and sophisticated machines never crossed the gap in the first place. As if the far side does not exist. Scientists and philosophers argue over the reasons, the consequences, the basic reality of the Discontinuity and of reality itself—but it doesn’t change the fact that in order to gain information from the far side humans need to cross and return. Not probes or sensors or other disposable equipment.  “It’s a haunting,” Su had said, a couple of weeks ago, as we lay tangled together in her dorm bed, sweat cooling on our bodies.  “Hmm?”  “The Discontinuity. It’s a ghost. Not real at all.”  “Seems real enough when we cross.”  “That’s what I mean.” She tipped her face towards me, her expression earnest, drawing me back to full alertness. “Are we ghosts too?”  “Sexy ghosts.” I ran my finger over her shoulder, began to tickle her, and the moment was gone. When I mentioned her words the next day she laughed them off, blamed her introspective mood on a stim-down.  But I remember them now, as I float beyond the impossible gap.  One hour thirty one minutes.  Instead of helping Franco and Zhang, I run my unauthorized scan. I know what I will find before I begin but can’t help the growing sense of despair as the search radius expands and the negative result stands. There is no sign of Su, or Quinn’s lost half, or any of the equipment they had brought across. Of course not: the gap has moved on, as I knew it had, as it always does. But still I feel a stab of loss and disappointment. And yes, anger. That bastard, hope. Sucking me in once again. Merciless giver and ultimate taker.  “There’s nothing here.” Zhang interrupts and reflects my thoughts. “I have a bad feeling. Let’s go back.”  Zhang. The two-time veilonaut. Hardly an expert on the Discontinuity and its mysterious ways.  My scan is almost finished. “Four more minutes,” I say. “Them’s the rules. Keep looking. You might spot something.”  After another minute even Franco chimes in. “Mads, this one’s a wash. Just another void.”  One hour thirty four minutes.  Why can’t I let go? Why can’t I cut and run? Su is lost. The others are ready. They’ve given me permission. The comms record will show the contract violation is not my fault. I can retire, return to Earth, Blessed Lady of the Veil no more.  The scanner gives a soft bleep. Red light. Null result.  “Uh . . . guys. Guys.”  It is Zhang’s tone more than her words that makes an involuntary shiver run down my spine.  “Guys.”  There can be only one cause for concern out here. Only one thing we’re constantly afraid of. That can explain the growing tinge of hysteria in Zhang’s voice.  There is a flood of relief as I spot the faint glimmer of the veil ahead of us. Still straight, still sharp. The gap still there.  Then I see why Zhang has begun to panic.  And I feel the first stirrings of it myself.  “Oh shit,” Franco says, quietly.  I ping the net connection, the always open session to the Observatory servers.  Timeout. Total packet loss. Zero signal.  Through the gap, where we had previously seen the Observatory, the sun, the beacons of everything familiar—there is no sign of them. Only darkness.  They are all gone.  “I can’t believe it. It’s fucking changed. It’s changed!”  Zhang’s wail is painfully loud in my ears. She stares at me accusingly. “You were supposed to be lucky!”  Zero hours one minute.  Every veilonaut’s nightmare. Even so, there is a protocol. Numb, I follow it automatically.  Approach the gap. Confirm the change. Trigger the distress signal.  For all of the good it will do us.  Glimpsed through the flickering blue static of the veil, our new neighbor universe is dark and utterly unfamiliar.  I cycle through the available options. There aren’t many, and none of them are good. Not even close to good. Mostly, what I’m thinking is: you knew this would happen one day, and now it has.  But there’s a difference between believing something might happen, or even that something will eventually happen . . . and it actually happening.  Big fucking difference.  “At least we know one thing now.” Franco’s voice is low and subdued. “The Discontinuity continues to exist on the far side.”  He’s right, although it’s not on my hotlist of items to dwell on right now. Some theories hold that the Discontinuity disappears on the far side after a change, that it relocates to the next distant region whilst the near side remains permanently (and mysteriously) tethered around our sun. A whole class of theories have just been disproved. For all the good it does us, or to the theorists who will never find out they’re wrong.  Franco drifts closer to the veil, staring into the darkness beyond.  “The other side doesn’t look any more appealing.” Once again, I’m surprised by the calm in my voice. As if I’m a creature of pure intellect. Madeleine Field Theorist, Scientist; Emotionless Observer. It’s just the shock, I know. The fading meds. Something.  Franco pushes his hand, his arm, his face into the veil. Remains half in, half out.  “My God, Mads, what’s he doing?” Zhang is aghast.  I say nothing, only watch, wait for the gap to change and for Franco to be sheared apart. It would just be our luck.  He draws back to our side. I release my breath.  “It’s another place,” he says. “Another void, similar to this one.”  “I can see that from here.”  Franco turns towards me. His eyes, glimpsed through the haze of his v-suit field, are also a void. More terrifying than the darkness on the other side of the veil.  “We’re lost,” Zhang says. “We’re lost, and there’s no way back.”  “We need to keep our shit together.” I’m angry with them both; they’re not helping push back the panic clawing at the back of my own mind. “Conserve energy. Wait for rescue. That’s the plan.”  “There’s not going to be any rescue.” Franco’s voice is as dead as his eyes.  “We don’t know that. This time could be different.” My words, my grasped straws, seem hopelessly optimistic, even to me. But what choice do we have? The Discontinuity follows no patterns. Maybe this time it will be different. Who knows? Nobody knows.  Franco cuts comms. He turns away.  I take hold of Zhang. She’s trembling. My grip transforms into a hug. I say, “Shhh. It’s going to be OK. It’ll be OK. I promise.”  A lie. We both know it.  Still, a lie worth saying. Especially now.  Our v-suit’s fields merge to form a single surface. It’s a practical matter, the shared contact. Reduces the overall field area, conserves energy. It’ll help eke out more precious time for our miraculous rescue to arrive. That’s what I tell myself, as I cling to Zhang’s shivering warmth, let the sensation of human contact overwhelm my darker thoughts.  It is not until some minutes later I question Franco’s continuing silence, check on his systems status. It isn’t like him to spare on the dour comments.  Shit.  Another hammer blow.  He’s done more than just silence his comms. He’s made his decision.  On whether to linger and wait for an impossible rescue or take action of his own.  To be cut or to be lost? Which would you prefer? And if lost, what would you do? It may only have been minutes since the gap’s moved on, but Franco and I have both had years to dwell on the scenarios.  Franco. Always impatient. The very much get-it-over-with type of guy. No trust he, not in that villain hope.  He has powered off his suit field.  His lifeless, fresh-frozen body orbits ours.  Conserve energy. Await rescue.  It’s what the handbook, the guide I helped draft years ago, advises.  Eighteen hours thirty one minutes.  “Why did you keep at it?”  “Huh?”  I am half asleep, lost in dreams of loss, of blue and white and green.  Zhang’s eyes are closed but she is mumbling. Not fully alert myself, I struggle to understand her. I’ve set the v-suit oxygen levels as low as they will go. Everything that can be turned down has been turned down. I’ve even raided our rudimentary medpacks for their stash of opioid sedatives. They’re meant for emergency short-term pain relief, to help take the edge off traumatic injury, but they serve just as well to slow down our metabolism. Anything, everything, to eke out every second of life, every last gasp of vital oxygen. Rescue could appear at any moment, after all, so the more we can draw out our existence the better. Slim or illusory, it’s the only hope we have.  “Crossing over,” Zhang mumbles. “Why keep doing it?”  “The money, of course.” I have no desire to answer with anything as complex as the truth.  “That’s not true. It’s why I do it, sure. My daughter’s ill. I need the money . . . to pay for her care. It’s the only way I can get it quickly enough.” For a moment Zhang’s previously placid expression crumples. She’s going to cry again.  I didn’t even know she had a kid. I hardly know anything about her. There are few secrets amongst the tightly-knit veilonaut community, but I’ve become increasingly withdrawn from it, retreated into my own bubble. Only Su had managed to penetrate it.  “But you’re already rich. Thirty missions-worth. Crazy rich, more than any of us. Why carry on?”  “I don’t know.”  A long pause. We drift in a dopamine haze. Zhang’s breath is slow and steady and warm against my neck.  “They say it’s because of Maddy’s World. You always coming back, looking for it. Did you see it, really?”  “Shhh.” I stroke her short dark hair with fingers that feel distant, balloon-like. “Sleep now. Save oxygen. Rescue’s coming.”  She mumbles some more but I can’t make out the words. Eventually, apart from the gentle sound of her breath, she is silent again.  Maddy’s World. A name I’ve heard all too often.  Again, she’s right.  It’s why I kept crossing over, again and again. Long after I should have stopped, returned to Earth, humbled and defeated. Trying to recapture that hazy, crazy dream of blue and white and green.  I should have known better.  No darkling void on my first-ever crossing, all those years ago. No mere distant star shining super-bright, a competitor to Sol, or a glimmering nebula, a brilliant globular cluster. No. For me the Discontinuity laid on a real show.  An entrapment.  Professors Evelyn Ahn and David Helford—my mentors, my colleagues, my friends—accompanied me. Together we had traveled many months from Earth, studied the Discontinuity from afar and then later at the Observatory, itched to go through and experience first-hand the subject of our research. Finally, the opportunity to leave theory behind and become veilonauts ourselves.  A crescent of blue and white and green greeted us, a sight so unexpected, so astonishing and wondrous we stayed too long, gaping breathlessly, the professors just as awestruck as I. We tried desperately to absorb as much as we could before we returned to the Observatory before the Discontinuity moved on.  A cruel introduction, that first mission. Evelyn and Dave were swallowed by the gap seconds after I came back through. I, the sole survivor.  Officially it’s known as Ahn-Helford’s World, but that hasn’t stopped Maddy’s World from being used by the other veilonauts and the journos who still write occasional articles about it. The name that history will record, despite my protests. Yes, Maddy’s World. Never glimpsed again, not in all the missions since. Only cosmic darkness and voids, again and again, on each and every trip beyond the cursed veil. It doesn’t even rank as a discovery, technically. No corroborating witnesses. Only my word.  Maddy’s World. Always with the question, the lingering doubt, growing after each failed mission. A figment of the lone survivor’s imagination, a delusion. Or worse: a lie to garner attention, a reputation.  Mad Woman’s World. Yes, I have heard it called that. And to my face.  How much worse the doubts would be if the entire details of my debrief were made public, the classified parts the Observatory review panel had deemed too sensational, too surreal, too subjective to allow entry in the record. That even I could hardly bring myself to believe.  Because we saw more than just the gleam of sunshine on liquid water, or the swirling clouds of an oxygen-based atmosphere. A gleaming ring arced over the far side world. A glitter of interlinked rock and ice and metal and glass. With darting motes between the orbiting nodes and delicate elevator spokes threading down to the surface. On the side turned from the golden G-class sun, an unmistakable tracery of nighttime lights: circles within circles, a maze of geometric canals.  Life. Advanced civilization. Perhaps even a glimpse back in distant time to the Other homeworld. Or a colony outpost strung like a pearl upon the Discontinuity’s irregular path. Or a mirage. An oxygen-starved, crossing-bedazzled veilonaut’s dream.  A dream discovery.  Perhaps only the dream of a discovery.  Su believed in Maddy’s World. And Quinn, crazy, doped-out Quinn. He was even worse.  They both believed in the ghosts, the ones supposed to haunt the veil; the living Others, the gods of the gap. Everything. All the stories, all the supernatural guff, every irrational belief I had encountered amongst the Observatory’s various communities. Stories I had long since debunked or discarded.  “We can direct the Discontinuity, Mads. It’s why the Others made it.”  Su floats opposite me in our little dorm cubicle. I suck greedily on a squeeze bulb of synth-absinthe, impatient for its promise of green oblivion.  “Nonsense.”  “It’s meant to be used. To travel, to reach a destination. Otherwise why was it created?”  “Have you ever considered it may just be a natural phenomenon? That the far locations are chosen purely at random? Don’t you think we’d have detected some pattern by now if there were any sort of organization or intent behind it all?”  Even at the time I realized my voice was climbing louder, in frustration, in anger. But I couldn’t stop myself: how could she be so . . . so unscientific? So ignorant? Despite all her attractions, this one aspect of her, this stubborn streak of irrationality, infuriated me.  “There is a pattern,” she continued. “You said so yourself: it’s clear in Quinn’s data. The more people cross, the more often, the greater the likelihood of the gap shifting. The probes and the machines passing through make no difference, but we do. We trigger the change. The gap senses people. It feels us.”  “The statistical significance—”  “We can control it, Mads. We just need to linger in the veil.”  The suggestion horrified me. “You’ll be cut or lost. Or worse. There’s good reason we speed through the gap . . . ”  “Fear!” Su’s voice is raised loud as mine now. “We speed through because of fear and habit. But next mission we’ll stay in the veil. We’ll prove we’re right. We’ll find Maddy’s World again. You and me.”  “No.” My voice is flat.  She must have sensed my denial, my determination at last. “Fine. It’ll be me and Quinn, then. We’ll find it without you.”  “We? You and Quinn? You know he spends all his contract money between missions getting stoned out of his mind. His brain is mush.”  Since when had he become part of “we” . . . and when had I become “you”?  And since when had I become this jealous, antagonistic person?  I wanted to reach out, apologize. Despite our differences, Su had been good for and to me, touched places I thought were shriveled, or never existed. Perhaps it was time I recognized how . . . significant she was to me.  But she had turned her back. She was gone.  I cursed and threw my half-empty drink bulb at the closing door.  Air is running out.  The suit can tell me exactly how long we have left, but what’s the point? The glowing figures are blurred. I can feel the oxygen fading in my lungs, more accurate and more sensitive than any machine. A fatal drowsiness beckons.  There’s a ripple upon my retina. The veil shifts again. A barren place, once again a void, one of the countless many that fill and grow in the universe. Barely a glimmer of nuclear combustion from the distantly glimpsed ribbons of matter.  I blink and it changes again.  Filled with a sudden curiosity I expend valuable fuel moving closer to the veil.  It ripples and shifts, strange patterns I’ve never seen before. Or perhaps not noticed. The veil has always been a thing to be avoided, to be crossed at speed. The risk of being cut, of its boundary shivering and engulfing you accidentally, stranding you on the other side, always a danger deterring close inspection.  But we’re going to die now anyway. Past the point of no return. The time for rescue to arrive has run out.  “Zhang.”  She is drowsy, barely conscious.  “Zhang. Listen. We have to make it change. It’s the only thing we can do.”  She shakes her head but makes no other protest as I program our v-suits to cross through.  The gap weather remains good. The veil’s faint shimmer a flat curtain. I run my palm through its soft Hawking radiation, poke first a finger, then my hand through.  I still feel nothing.  Does the Discontinuity open onto some hugely distant area of our own universe or onto another one entirely? A brane floating adjacent to ours in the bulk, or another bubble condensed from the chaos of eternal inflation? We don’t know. Objects and people pass through freely, without their fundamental constituents flying apart or being annihilated by their antiparticles. Perhaps we’ve just been lucky so far.  We cross. A shimmer of blue followed by darkness. We cross back. Then over again. And again. Azure stars. Cerulean nebulae. Each time my brow furrows with effort, with concentration. I’m seeking a destination, not just darkness. An end point. With all my heart. With all my soul. That same yearning when I had crossed over the very first time, without fear. No fear. No fear this time. Fear serves only to distract, lose concentration. Fear will quarter me like it quartered Quinn.  “Mads. Mads, what’re you doing?”  I am not sure whether it’s Zhang’s drowsy voice or mine. I don’t look at the numbers warning me how far and how fast the fuel level is dropping.  Cross over, back and again, over and over, as the oxygen levels plummet. Lingering in the veil, seeking and plucking its cosmic string, playing it like an instrument. A vast device, a portal gifted to us by the Others, what else could it be? Whorls and stars darting blue. I have always been so fast through, now I begin to see whole vistas I’ve been blind to before. How beautiful they are. Is this what the other veilonauts meant, how the veil made them feel?  An energy building, an electric crackling tension. Motes of light, star clusters, swirling arms of dust and heat. I can’t tell and it doesn’t really matter whether they’re within the veil or without. Zhang and I are wrapped inside a ribbon of power and light extending from the bright beginning to the inevitable end, and we are traveling along it, forward and back, both at the same moment.  On one side, a change: stars reconfigured, brighter; blue warmth, then back to the other again; a change, two stars, one blue, one red, dancing together . . . my mind concentrated. On a destination. A particular destination in mind. Only that. Only there.  “It’s beautiful,” Zhang murmurs, her arms tightening around me. Reflected in her eyes: a growing arc of blue and white and green.  A sun golden yellow, hot. I turn to feel the warmth of its radiance, even through the failing shield of our shared v-suit. This sky is not black or star-filled. It’s blue.  There’s no reason the Discontinuity need open only onto cold dark vacuum.  The tug of gravity, of a world entire, pulls us towards the gap, to our inevitable destination.  A horizon. Beyond the blue shimmer. Rushing towards us.  There is someone there, a silhouette figure. Strange yet familiar. Running. Waving. In welcome or farewell.  The gap opens as I close my eyes.  And say my final crossing prayer. Henry Szabranski was born in Birmingham, UK, and studied Astronomy & Astrophysics at Newcastle upon Tyne University, graduating with a degree in Theoretical Physics. His fiction has appeared in Clarkesworld, Beneath Ceaseless Skies, Diabolical Plots, Kaleidotrope, and Fantasy For Good: A Charitable Anthology, amongst other places. He lives in Buckinghamshire with his wife and two young sons.", "text": "5070 words, short story\nThe Veilonaut's Dream\nSometimes the Discontinuity kinks and curves and flips about as if it is alive.\nOpenings slide along its vast length like undigested morsels down the gullet of a cosmic serpent. Feathery tendrils shoot out, slowly curling up and fading, each a traveling shadow-slice through some theorized higher-dimensional object. But today . . . today the gap weather is good. There is no sign of movement or instability; the anomaly is razor-straight and steady. A thirty meters high, ten thousand kilometer long, barely visible veil that glimmers on either side of us as far as we can see.\nFranco and Zhang float beside me. They are waiting for my command.\n“Mads? Are we going through today?”\nFranco is impatient. He’s very much a get-it-over-with type of guy. Luckily, we’ve been on enough missions together I feel I can ignore him. But he’s right: the idea of turning back dominates my thoughts. It’s not too late to stop, to return to the Observatory, though we’ve signed the contract and the penalty will be high. No doubt Franco and Zhang will denounce my cowardice to mask their own relief—but what do I care about money and reputation anymore?\nI check the time since the last change. One hour twenty-two minutes. The average is just over seventy-four hours. Information both critical and useless. There’s no knowing how long the gap will remain stable. It could be seconds, minutes, days—even months or years. The Discontinuity’s size, its shape, the location of the region it opens onto, all of these can and do alter without warning. In the blink of a veilonaut’s eye.\n“I’d rather be cut,” Zhang declares. She’s a newbie, fresh arrived from in-system, both terrified and eager. Not a researcher, but one of the new crop of mercenary explorers. When I announced I was going to brave the gap today she had scrambled to tag along. “You may lose a limb or two,” she says, “but the v-suit will keep you alive until the medics reach you. There’s still a chance of survival.”\n“They couldn’t save Quinn,” Franco points out. His tone weary and worldly-wise. He loves to play the grizzled veteran. “Neither the v-suit nor the medics.”\nEleven days ago Quinn was caught mid-gap during a change. In some distant lost region of space-time, his missing body parts still tumble. I shudder at the memory.\n“But at least he died quickly,” Zhang presses on, oblivious to Franco’s disapproval. “I’d rather be Quinn than Su. Quinn didn’t feel a thing, but Su’s still out there, somewhere. Gasping her last air, wishing she were dead. It must be a nightmare.”\nFranco glares at Zhang. “Not cool, OK? Not the time or place. Not the thing to say.”\n“Concentrate on what you’re doing.” My voice sounds perfectly calm over the comms link, with no sign of my irritation at Zhang’s ignorant chatter, or the barely contained churn of emotions within me. Perhaps it’s the mix of synth-absinthe and sedatives I’ve dosed up on, their welcome numbing effect. Against mission regs, but the Observatory turns a blind eye, long since drifted from its regimented academic origins. Hardly any exploration would be done, otherwise.\n“It’s almost time to cross,” I remind everyone, careful not slur my words.\nOff-comms my breath hitches. Zhang may be crass, but she’s not being intentionally malicious. She doesn’t know about Su and me; we’d kept it quiet, at first to avoid drama, then as an ongoing game. Not even Franco knows, though he may suspect. And Zhang’s right: Su’s still out there. Just about now, relative to our timeframe, the last power in her v-suit battery fading. She remains unreachable. Unrescuable. Lost in some distant past or far future. My last words to her before she crossed over had been harsh. We’d argued. I’d called her a fool, a zealot, a selfish dreamer. That she was absolutely wrong about the Discontinuity. I refused to follow her and Quinn on their doomed mission. “I’ll find you your world,” Su had boasted. “I promise I’ll find it for you.”\nI’d hurled a half-empty drink bulb at her retreating back.\nI should have been with her. Been there when the gap swallowed her whole.\nThat’s the other part of the Discontinuity’s terror. Crossings are done at speed, to reduce the risk of bisection, which is neat and instantaneous if you’re caught passing through mid-change. But even if you’re spared that gruesome fate, you can still find yourself stranded on the far side after the gap has moved on. The records show the same region has never appeared twice. Sure, you can survive for a while, protected and preserved in your vacuum suit, but there’s no prospect of rescue or return. Cut off forever, unreachable, supplies dwindling, your last desperate pleas will be unheard as the Discontinuity continues to cycle on and the Observatory lights blink away out here beyond Pluto’s orbit, their cast-off photons more distant from you than the moment of creation.\nTo be cut or to be lost. Every veilonaut has to face either possibility each time they pass through the gap.\n“You OK, Mads?”\nFranco’s silhouette floats dark against the veil’s Cherenkov shimmer. Just as mine had drifted as I waited, angry and impatient for Su’s return, eleven days and only a moment and eternity ago. I was there when the Discontinuity shrugged away a billion suns and spewed forth Quinn’s almost-through body. Even now, my hand twitches instinctively, tries to shield me from the memory. Droplets that sparked against my v-suit field like a bloody meteor shower.\n“Mads?”\n“I’m fine. Let’s get into position.”\nI toggle the nav system controls. Our propulsion backpacks spurt into life, begin a series of pre-programmed maneuvers that will push us closer to the gap.\nZhang crosses herself. She can barely bring herself to look at the rippling veil. Franco, too, is muttering some off-comms incantation. Despite all the known science, the cold hard facts, a fog of superstition still surrounds the anomaly. I don’t have much time for the irrational convictions of my fellow veilonauts. More than a handful swear they have glimpsed or felt some mysterious presence as they’ve passed through the gap. They believe the long dead Others remain inside the rift they created, ghosts trapped within the veil. Some believe the Discontinuity itself is a living, conscious entity, worthy of worship. Even I, normally so scathing of such irrational beliefs, find myself mouthing a silent prayer to the rumored gods of the gap in the moments before crossing. To the angels of the veil, to the ancient long-lost Others. If they exist, or if they don’t. Please protect us as we pass through. Hold the gap open for our safe return.\nSo far my prayers have been answered. Lucky Madeleine, they call me, Blessed Lady of the Veil. A talisman. More successful missions than any other veilonaut.\nBut I know the truth. The cold, hard math of probability.\nEveryone is lucky crossing the gap.\nEveryone.\nUntil they’re not.\nThe elapsed time counter ticks over. One hour twenty-six minutes.\n“Mads? Are you ready?”\nOne last time, then. One final mission. For love lost, for hopeless hope, for a dream of blue and white and green. “I’m ready, Franco. Are you?”\n“Of course.”\nI take a deep breath, sweat beading on my forehead. “Initiate burn on my mark.”\nI concentrate on the Discontinuity. For it to do my bidding, just as Su said.\nFranco reaches out. Zhang grasps his hand.\n“Three.”\nZhang stretches towards me, and after a moment’s hesitation I take hold of her hand as well.\n“Two.”\nOur breath comes faster, our pulses elevated. We are all linked together, fates entwined. Engine packs perpendicular to the face of the gap.\n“One.”\nI say my silent crossing prayer.\n“Mark.”\nI don’t feel anything as I pass through the veil.\nSome swear they experience a moment of disorientation. Or, for a few, a full-on rapture. But I’ve never felt more than a faint tug or seen anything other than a brief blink of blue as I cross over. No visions, no angels.\nNo ghosts.\nNo, that’s wrong. I do feel something. Terror, mostly. Mingled with anticipation. Hope. That more than darkness will greet me.\nHope quickly dashed.\nI guess Su was wrong.\nPre-programmed hydrazine bursts from our packs spin us around and decelerate us to a stop relative to the gap through which we’ve just passed. The Observatory swings back into view, paradoxically only hundreds of meters away and yet at the same time now countless billions of lightyears distant. Our sun still gleams, glimpsed back through the rift, the brightest star even here.\nThe far side is almost always disappointing. Most of the universe is empty and if the region the Discontinuity opens onto is truly random, then almost inevitably the gap opens onto rarefied intergalactic space far distant from any stars and planets and other forms of baryonic matter. Most often the far side’s temperature is barely above the CMB. It’s cold, dark, empty; void and devoid.\nSo it is again, this time.\n“OK team.” The fact is nowadays veilonauts are paid by the second, not on their opinion of the far side’s interest. “You know the drill. We’ve contracted for at least ten minutes. Timer starts . . . now.”\nI give the orders automatically, autonomically, trying not to show my relief at surviving transit. Just one more crossing—back to the Observatory—and then I’m done with the Discontinuity and its cruel game of chance forever.\nFranco and Zhang deploy their latest research equipment. It’s a waste of time, but it’s what they’re paid to do. Perhaps there’s been some breakthrough in observational technology by their sponsors, perhaps this time it’ll be different. I’m not holding my breath. Countless automated probes have tried to replicate our work. They always fail. Veilonauts pass through the Discontinuity, make observations, return safely—but nothing of the far side is ever recorded. Only images and measurements of our own solar system, of our own galaxy, as if the hugely expensive and sophisticated machines never crossed the gap in the first place. As if the far side does not exist. Scientists and philosophers argue over the reasons, the consequences, the basic reality of the Discontinuity and of reality itself—but it doesn’t change the fact that in order to gain information from the far side humans need to cross and return. Not probes or sensors or other disposable equipment.\n“It’s a haunting,” Su had said, a couple of weeks ago, as we lay tangled together in her dorm bed, sweat cooling on our bodies.\n“Hmm?”\n“The Discontinuity. It’s a ghost. Not real at all.”\n“Seems real enough when we cross.”\n“That’s what I mean.” She tipped her face towards me, her expression earnest, drawing me back to full alertness. “Are we ghosts too?”\n“Sexy ghosts.” I ran my finger over her shoulder, began to tickle her, and the moment was gone. When I mentioned her words the next day she laughed them off, blamed her introspective mood on a stim-down.\nBut I remember them now, as I float beyond the impossible gap.\nOne hour thirty one minutes.\nInstead of helping Franco and Zhang, I run my unauthorized scan. I know what I will find before I begin but can’t help the growing sense of despair as the search radius expands and the negative result stands. There is no sign of Su, or Quinn’s lost half, or any of the equipment they had brought across. Of course not: the gap has moved on, as I knew it had, as it always does. But still I feel a stab of loss and disappointment. And yes, anger. That bastard, hope. Sucking me in once again. Merciless giver and ultimate taker.\n“There’s nothing here.” Zhang interrupts and reflects my thoughts. “I have a bad feeling. Let’s go back.”\nZhang. The two-time veilonaut. Hardly an expert on the Discontinuity and its mysterious ways.\nMy scan is almost finished. “Four more minutes,” I say. “Them’s the rules. Keep looking. You might spot something.”\nAfter another minute even Franco chimes in. “Mads, this one’s a wash. Just another void.”\nOne hour thirty four minutes.\nWhy can’t I let go? Why can’t I cut and run? Su is lost. The others are ready. They’ve given me permission. The comms record will show the contract violation is not my fault. I can retire, return to Earth, Blessed Lady of the Veil no more.\nThe scanner gives a soft bleep. Red light. Null result.\n“Uh . . . guys. Guys.”\nIt is Zhang’s tone more than her words that makes an involuntary shiver run down my spine.\n“Guys.”\nThere can be only one cause for concern out here. Only one thing we’re constantly afraid of. That can explain the growing tinge of hysteria in Zhang’s voice.\nThere is a flood of relief as I spot the faint glimmer of the veil ahead of us. Still straight, still sharp. The gap still there.\nThen I see why Zhang has begun to panic.\nAnd I feel the first stirrings of it myself.\n“Oh shit,” Franco says, quietly.\nI ping the net connection, the always open session to the Observatory servers.\nTimeout. Total packet loss. Zero signal.\nThrough the gap, where we had previously seen the Observatory, the sun, the beacons of everything familiar—there is no sign of them. Only darkness.\nThey are all gone.\n“I can’t believe it. It’s fucking changed. It’s changed!”\nZhang’s wail is painfully loud in my ears. She stares at me accusingly. “You were supposed to be lucky!”\nZero hours one minute.\nEvery veilonaut’s nightmare. Even so, there is a protocol. Numb, I follow it automatically.\nApproach the gap. Confirm the change. Trigger the distress signal.\nFor all of the good it will do us.\nGlimpsed through the flickering blue static of the veil, our new neighbor universe is dark and utterly unfamiliar.\nI cycle through the available options. There aren’t many, and none of them are good. Not even close to good. Mostly, what I’m thinking is: you knew this would happen one day, and now it has.\nBut there’s a difference between believing something might happen, or even that something will eventually happen . . . and it actually happening.\nBig fucking difference.\n“At least we know one thing now.” Franco’s voice is low and subdued. “The Discontinuity continues to exist on the far side.”\nHe’s right, although it’s not on my hotlist of items to dwell on right now. Some theories hold that the Discontinuity disappears on the far side after a change, that it relocates to the next distant region whilst the near side remains permanently (and mysteriously) tethered around our sun. A whole class of theories have just been disproved. For all the good it does us, or to the theorists who will never find out they’re wrong.\nFranco drifts closer to the veil, staring into the darkness beyond.\n“The other side doesn’t look any more appealing.” Once again, I’m surprised by the calm in my voice. As if I’m a creature of pure intellect. Madeleine Field Theorist, Scientist; Emotionless Observer. It’s just the shock, I know. The fading meds. Something.\nFranco pushes his hand, his arm, his face into the veil. Remains half in, half out.\n“My God, Mads, what’s he doing?” Zhang is aghast.\nI say nothing, only watch, wait for the gap to change and for Franco to be sheared apart. It would just be our luck.\nHe draws back to our side. I release my breath.\n“It’s another place,” he says. “Another void, similar to this one.”\n“I can see that from here.”\nFranco turns towards me. His eyes, glimpsed through the haze of his v-suit field, are also a void. More terrifying than the darkness on the other side of the veil.\n“We’re lost,” Zhang says. “We’re lost, and there’s no way back.”\n“We need to keep our shit together.” I’m angry with them both; they’re not helping push back the panic clawing at the back of my own mind. “Conserve energy. Wait for rescue. That’s the plan.”\n“There’s not going to be any rescue.” Franco’s voice is as dead as his eyes.\n“We don’t know that. This time could be different.” My words, my grasped straws, seem hopelessly optimistic, even to me. But what choice do we have? The Discontinuity follows no patterns. Maybe this time it will be different. Who knows? Nobody knows.\nFranco cuts comms. He turns away.\nI take hold of Zhang. She’s trembling. My grip transforms into a hug. I say, “Shhh. It’s going to be OK. It’ll be OK. I promise.”\nA lie. We both know it.\nStill, a lie worth saying. Especially now.\nOur v-suit’s fields merge to form a single surface. It’s a practical matter, the shared contact. Reduces the overall field area, conserves energy. It’ll help eke out more precious time for our miraculous rescue to arrive. That’s what I tell myself, as I cling to Zhang’s shivering warmth, let the sensation of human contact overwhelm my darker thoughts.\nIt is not until some minutes later I question Franco’s continuing silence, check on his systems status. It isn’t like him to spare on the dour comments.\nShit.\nAnother hammer blow.\nHe’s done more than just silence his comms. He’s made his decision.\nOn whether to linger and wait for an impossible rescue or take action of his own.\nTo be cut or to be lost? Which would you prefer? And if lost, what would you do? It may only have been minutes since the gap’s moved on, but Franco and I have both had years to dwell on the scenarios.\nFranco. Always impatient. The very much get-it-over-with type of guy. No trust he, not in that villain hope.\nHe has powered off his suit field.\nHis lifeless, fresh-frozen body orbits ours.\nConserve energy. Await rescue.\nIt’s what the handbook, the guide I helped draft years ago, advises.\nEighteen hours thirty one minutes.\n“Why did you keep at it?”\n“Huh?”\nI am half asleep, lost in dreams of loss, of blue and white and green.\nZhang’s eyes are closed but she is mumbling. Not fully alert myself, I struggle to understand her. I’ve set the v-suit oxygen levels as low as they will go. Everything that can be turned down has been turned down. I’ve even raided our rudimentary medpacks for their stash of opioid sedatives. They’re meant for emergency short-term pain relief, to help take the edge off traumatic injury, but they serve just as well to slow down our metabolism. Anything, everything, to eke out every second of life, every last gasp of vital oxygen. Rescue could appear at any moment, after all, so the more we can draw out our existence the better. Slim or illusory, it’s the only hope we have.\n“Crossing over,” Zhang mumbles. “Why keep doing it?”\n“The money, of course.” I have no desire to answer with anything as complex as the truth.\n“That’s not true. It’s why I do it, sure. My daughter’s ill. I need the money . . . to pay for her care. It’s the only way I can get it quickly enough.” For a moment Zhang’s previously placid expression crumples. She’s going to cry again.\nI didn’t even know she had a kid. I hardly know anything about her. There are few secrets amongst the tightly-knit veilonaut community, but I’ve become increasingly withdrawn from it, retreated into my own bubble. Only Su had managed to penetrate it.\n“But you’re already rich. Thirty missions-worth. Crazy rich, more than any of us. Why carry on?”\n“I don’t know.”\nA long pause. We drift in a dopamine haze. Zhang’s breath is slow and steady and warm against my neck.\n“They say it’s because of Maddy’s World. You always coming back, looking for it. Did you see it, really?”\n“Shhh.” I stroke her short dark hair with fingers that feel distant, balloon-like. “Sleep now. Save oxygen. Rescue’s coming.”\nShe mumbles some more but I can’t make out the words. Eventually, apart from the gentle sound of her breath, she is silent again.\nMaddy’s World. A name I’ve heard all too often.\nAgain, she’s right.\nIt’s why I kept crossing over, again and again. Long after I should have stopped, returned to Earth, humbled and defeated. Trying to recapture that hazy, crazy dream of blue and white and green.\nI should have known better.\nNo darkling void on my first-ever crossing, all those years ago. No mere distant star shining super-bright, a competitor to Sol, or a glimmering nebula, a brilliant globular cluster. No. For me the Discontinuity laid on a real show.\nAn entrapment.\nProfessors Evelyn Ahn and David Helford—my mentors, my colleagues, my friends—accompanied me. Together we had traveled many months from Earth, studied the Discontinuity from afar and then later at the Observatory, itched to go through and experience first-hand the subject of our research. Finally, the opportunity to leave theory behind and become veilonauts ourselves.\nA crescent of blue and white and green greeted us, a sight so unexpected, so astonishing and wondrous we stayed too long, gaping breathlessly, the professors just as awestruck as I. We tried desperately to absorb as much as we could before we returned to the Observatory before the Discontinuity moved on.\nA cruel introduction, that first mission. Evelyn and Dave were swallowed by the gap seconds after I came back through. I, the sole survivor.\nOfficially it’s known as Ahn-Helford’s World, but that hasn’t stopped Maddy’s World from being used by the other veilonauts and the journos who still write occasional articles about it. The name that history will record, despite my protests. Yes, Maddy’s World. Never glimpsed again, not in all the missions since. Only cosmic darkness and voids, again and again, on each and every trip beyond the cursed veil. It doesn’t even rank as a discovery, technically. No corroborating witnesses. Only my word.\nMaddy’s World. Always with the question, the lingering doubt, growing after each failed mission. A figment of the lone survivor’s imagination, a delusion. Or worse: a lie to garner attention, a reputation.\nMad Woman’s World. Yes, I have heard it called that. And to my face.\nHow much worse the doubts would be if the entire details of my debrief were made public, the classified parts the Observatory review panel had deemed too sensational, too surreal, too subjective to allow entry in the record. That even I could hardly bring myself to believe.\nBecause we saw more than just the gleam of sunshine on liquid water, or the swirling clouds of an oxygen-based atmosphere. A gleaming ring arced over the far side world. A glitter of interlinked rock and ice and metal and glass. With darting motes between the orbiting nodes and delicate elevator spokes threading down to the surface. On the side turned from the golden G-class sun, an unmistakable tracery of nighttime lights: circles within circles, a maze of geometric canals.\nLife. Advanced civilization. Perhaps even a glimpse back in distant time to the Other homeworld. Or a colony outpost strung like a pearl upon the Discontinuity’s irregular path. Or a mirage. An oxygen-starved, crossing-bedazzled veilonaut’s dream.\nA dream discovery.\nPerhaps only the dream of a discovery.\nSu believed in Maddy’s World. And Quinn, crazy, doped-out Quinn. He was even worse.\nThey both believed in the ghosts, the ones supposed to haunt the veil; the living Others, the gods of the gap. Everything. All the stories, all the supernatural guff, every irrational belief I had encountered amongst the Observatory’s various communities. Stories I had long since debunked or discarded.\n“We can direct the Discontinuity, Mads. It’s why the Others made it.”\nSu floats opposite me in our little dorm cubicle. I suck greedily on a squeeze bulb of synth-absinthe, impatient for its promise of green oblivion.\n“Nonsense.”\n“It’s meant to be used. To travel, to reach a destination. Otherwise why was it created?”\n“Have you ever considered it may just be a natural phenomenon? That the far locations are chosen purely at random? Don’t you think we’d have detected some pattern by now if there were any sort of organization or intent behind it all?”\nEven at the time I realized my voice was climbing louder, in frustration, in anger. But I couldn’t stop myself: how could she be so . . . so unscientific? So ignorant? Despite all her attractions, this one aspect of her, this stubborn streak of irrationality, infuriated me.\n“There is a pattern,” she continued. “You said so yourself: it’s clear in Quinn’s data. The more people cross, the more often, the greater the likelihood of the gap shifting. The probes and the machines passing through make no difference, but we do. We trigger the change. The gap senses people. It feels us.”\n“The statistical significance—”\n“We can control it, Mads. We just need to linger in the veil.”\nThe suggestion horrified me. “You’ll be cut or lost. Or worse. There’s good reason we speed through the gap . . . ”\n“Fear!” Su’s voice is raised loud as mine now. “We speed through because of fear and habit. But next mission we’ll stay in the veil. We’ll prove we’re right. We’ll find Maddy’s World again. You and me.”\n“No.” My voice is flat.\nShe must have sensed my denial, my determination at last. “Fine. It’ll be me and Quinn, then. We’ll find it without you.”\n“We? You and Quinn? You know he spends all his contract money between missions getting stoned out of his mind. His brain is mush.”\nSince when had he become part of “we” . . . and when had I become “you”?\nAnd since when had I become this jealous, antagonistic person?\nI wanted to reach out, apologize. Despite our differences, Su had been good for and to me, touched places I thought were shriveled, or never existed. Perhaps it was time I recognized how . . . significant she was to me.\nBut she had turned her back. She was gone.\nI cursed and threw my half-empty drink bulb at the closing door.\nAir is running out.\nThe suit can tell me exactly how long we have left, but what’s the point? The glowing figures are blurred. I can feel the oxygen fading in my lungs, more accurate and more sensitive than any machine. A fatal drowsiness beckons.\nThere’s a ripple upon my retina. The veil shifts again. A barren place, once again a void, one of the countless many that fill and grow in the universe. Barely a glimmer of nuclear combustion from the distantly glimpsed ribbons of matter.\nI blink and it changes again.\nFilled with a sudden curiosity I expend valuable fuel moving closer to the veil.\nIt ripples and shifts, strange patterns I’ve never seen before. Or perhaps not noticed. The veil has always been a thing to be avoided, to be crossed at speed. The risk of being cut, of its boundary shivering and engulfing you accidentally, stranding you on the other side, always a danger deterring close inspection.\nBut we’re going to die now anyway. Past the point of no return. The time for rescue to arrive has run out.\n“Zhang.”\nShe is drowsy, barely conscious.\n“Zhang. Listen. We have to make it change. It’s the only thing we can do.”\nShe shakes her head but makes no other protest as I program our v-suits to cross through.\nThe gap weather remains good. The veil’s faint shimmer a flat curtain. I run my palm through its soft Hawking radiation, poke first a finger, then my hand through.\nI still feel nothing.\nDoes the Discontinuity open onto some hugely distant area of our own universe or onto another one entirely? A brane floating adjacent to ours in the bulk, or another bubble condensed from the chaos of eternal inflation? We don’t know. Objects and people pass through freely, without their fundamental constituents flying apart or being annihilated by their antiparticles. Perhaps we’ve just been lucky so far.\nWe cross. A shimmer of blue followed by darkness. We cross back. Then over again. And again. Azure stars. Cerulean nebulae. Each time my brow furrows with effort, with concentration. I’m seeking a destination, not just darkness. An end point. With all my heart. With all my soul. That same yearning when I had crossed over the very first time, without fear. No fear. No fear this time. Fear serves only to distract, lose concentration. Fear will quarter me like it quartered Quinn.\n“Mads. Mads, what’re you doing?”\nI am not sure whether it’s Zhang’s drowsy voice or mine. I don’t look at the numbers warning me how far and how fast the fuel level is dropping.\nCross over, back and again, over and over, as the oxygen levels plummet. Lingering in the veil, seeking and plucking its cosmic string, playing it like an instrument. A vast device, a portal gifted to us by the Others, what else could it be? Whorls and stars darting blue. I have always been so fast through, now I begin to see whole vistas I’ve been blind to before. How beautiful they are. Is this what the other veilonauts meant, how the veil made them feel?\nAn energy building, an electric crackling tension. Motes of light, star clusters, swirling arms of dust and heat. I can’t tell and it doesn’t really matter whether they’re within the veil or without. Zhang and I are wrapped inside a ribbon of power and light extending from the bright beginning to the inevitable end, and we are traveling along it, forward and back, both at the same moment.\nOn one side, a change: stars reconfigured, brighter; blue warmth, then back to the other again; a change, two stars, one blue, one red, dancing together . . . my mind concentrated. On a destination. A particular destination in mind. Only that. Only there.\n“It’s beautiful,” Zhang murmurs, her arms tightening around me. Reflected in her eyes: a growing arc of blue and white and green.\nA sun golden yellow, hot. I turn to feel the warmth of its radiance, even through the failing shield of our shared v-suit. This sky is not black or star-filled. It’s blue.\nThere’s no reason the Discontinuity need open only onto cold dark vacuum.\nThe tug of gravity, of a world entire, pulls us towards the gap, to our inevitable destination.\nA horizon. Beyond the blue shimmer. Rushing towards us.\nThere is someone there, a silhouette figure. Strange yet familiar. Running. Waving. In welcome or farewell.\nThe gap opens as I close my eyes.\nAnd say my final crossing prayer.\nHenry Szabranski was born in Birmingham, UK, and studied Astronomy & Astrophysics at Newcastle upon Tyne University, graduating with a degree in Theoretical Physics. His fiction has appeared in Clarkesworld, Beneath Ceaseless Skies, Diabolical Plots, Kaleidotrope, and Fantasy For Good: A Charitable Anthology, amongst other places. He lives in Buckinghamshire with his wife and two young sons.", "source": "https://clarkesworldmagazine.com/szabranski_08_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Veilonaut's Dream by Henry Szabranski"}