{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Rhiannon Held", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "TZh1RtgSd1EQpSJ9fi7UlioHXEY=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Taught by the Moon: Oral Traditions in Speculative Fiction  When drawing upon real archaeology to build a fictional world, it’s perhaps no wonder that we often turn first to settled societies with written languages. Some of those societies have built impressive monuments and maintained complex governments—and left us a written record of those activities. It’s easy to stop there and forget about mobile hunter-gatherer or tribal societies. Archaeology and ethnography have plenty to tell us about their history through oral traditions. And oral traditions have a lot to offer speculative fiction world-building.  First, a couple of definitions.  Ethnography is the study of living people and their culture, and is often used in conjunction with archaeological data to piece together the past. Ethnographers collect oral histories and oral traditions. Oral histories are first-hand accounts of past events or how the informant lived.  Oral traditions are composed of the stories passed down from one person to another that might also be called myths, fables, legends, or fairytales. When it comes to fiction, oral histories are already commonly used in speculative fiction world-building, whether it’s a character reminiscing about how things were when she was a child, or one relating an important event that occurred only a few years before.  Oral traditions, on the other hand, are much less common to see in speculative fiction, despite the fact that they fit seamlessly into most of the subgenres. A traditional fantasy culture could be modeled on nomads or hunter-gatherers, rather than a settled society — but what about science fiction? Aliens could just as easily record their histories through oral traditions, if they have no written language. Cultures in a post-apocalyptic future could be forced to return to oral traditions as well, if writing has been lost. Or even if it hasn’t been completely lost—without printing presses or the infrastructure to mass-produce a good paper substitute, word of mouth might well return as the best method of spreading news. Over the generations, news can grow into legends. Even urban fantasy beasties or monsters could have developed their own oral traditions, if they are sentient enough to have their own societies.  Not only do oral traditions fit naturally into speculative fiction, but they’re incredibly useful, narratively speaking. The deep human impulse to participate in an oral tradition lurks in readers, quiescent because they were born into a culture with writing. Craft a fictional oral tradition correctly, and it feels real to readers because it taps into that impulse. Not only does it feel real, it feels old. Oral traditions don’t arise overnight, so in modeling a fictional oral tradition after real ones, an author can take advantage of characteristics, some almost subliminal, that distinguish them from stories made up on the spot. A myth from an oral tradition can do more to make a reader subconsciously feel that a fictional culture is centuries old than pages of historical events.  Oral traditions can also reveal facts about a fictional culture, without having to lecture the readers through blatant exposition. Creation myths in particular are quite rich in opportunities to subtly present facts. The examples in this article are drawn from Northwest Coast and Columbia Plateau Native American tribes, but similar ones can be found all over the world.  In a story told in different versions by several Columbia Plateau tribes, Coyote made the first humans. In the time when animal people walked the earth, a giant beaver named Wishpoosh drowned anyone who tried to fish in his lake. The people asked Coyote for help, and he fought the monster long and hard, creating the valleys and lakes and twists and turns along the Columbia river as they grappled. Coyote realized he couldn’t win, so he asked his three sisters who lived as berries in his stomach (that’s another story) for advice, and they gave him a plan. Coyote changed into a fir branch, floated to the monster, and when it swallowed him, he hacked with his knife at the beaver’s insides until it was dead. When he climbed out of the carcass, he cut it up, and from the pieces made the various tribes. As Coyote created each tribe he assigned them different temperaments and skills.  There’s a lot going on there, all of which could be useful to build a fictional world. The story did not begin with blackness and nothingness—Wishpoosh and all the animals were already around before the tribes were made. A fictional culture presumably also arrived in an already-formed world, such as a science fiction culture crash-landing on a new planet, which you can reflect at the beginning of a myth.  This myth explains the geography that’s most important to the people’s lives—the Columbia River was central to the lives of Plateau tribes because they relied on it for food, through salmon. The myth shows how the people thought of themselves as interconnected, but with separate identities from tribes around them, formed from the same monster but different parts. And finally, the myth presents what people have constructed as their identifying characteristics. One presumes Coyote gave the best skills to the people telling the tale, but what’s best? Bravery, or cleverness? Hunting, or fishing? The answer can reveal what attributes a fictional culture most prizes.  Another myth from across the Cascade Mountains illustrates this point. In this myth, with versions from around the Puget Sound, the Changer is born, kidnapped, and found as an adult by Blue Jay through a complicated set of circumstances too long to relate here. He starts on a journey home to return to his mother. Along the way, he encounters people doing all manner of foolish things. Some are using their heads instead of mauls (a kind of hammer) for woodworking. Others are allowing Raven to use living people instead of wood stakes lashed together to form his fish weir. The Changer shows them how to do things properly, and eventually makes it home to become the Moon.  Note the kind of skills the Changer is teaching: wood-working and fishing. He also teaches skills such as cooking in baskets and manufacturing arrows. All of these are key skills for daily life in Northwest cultures. In other versions of the myth, as the Changer encountered people he changed them into the first animals—for example, a man rowing with a paddle became Beaver, with the paddle for his tail. Similarly, the animals mentioned in the myth are the ones most important to daily life, whether they were hunted, or feared, or simply glimpsed everywhere. Turn that around, and you can show, without one explicit bit of exposition, just what’s needed to survive in a fictional world, be it skills or knowledge of the environment.  Finally, myths can serve as excellent explanations. Why do salmon come up this tributary of the Columbia, but not the other? (Coyote’s fault again.) Why is it so rainy west of the Cascade Mountains, but dry east of them? (Because the Ocean got angry and convinced the Great Spirit to raise the mountains when the people in the east tried to keep his children Clouds and Rain to themselves.) Turned to world-building purposes, explanation myths illustrate the great forces acting on a fictional culture. What floods, earthquakes, magic storms, or forgotten high technology weapons threaten them at impossible to predict intervals? What warm winds, fertile soils, or magical artifacts help them prosper through means they don’t understand? Forces that can’t be predicted, that can’t be understood, need explanations.  Oral traditions are unfortunately linked with a couple tar pits of anthropological theory (one can thrash around for ages without getting anywhere in particular). Are similar mythological elements hardwired cross-culturally, or are they the coincidental results of happenstance? Or are similar elements signs of contact between two cultures, far in the past? In our world, those questions are incredibly frustrating to try to answer definitively, but the beauty of a fictional world with more than one culture is that you can decide the answer. Seed the same elements into the oral traditions of cultures that have been separate for centuries, and you’ve hinted at that ancient connection to the reader.  If anthropology theory doesn’t interest you, on the other hand, there’s also no need to lose yourself in attempting to learn all of the many possible abstract archetypes and themes. There are so many real world examples to feed one’s creativity. Pick a culture, any culture, and model your fictional oral tradition on theirs, and the archetypes and themes will be already built in. It’s best not to appropriate an oral tradition wholesale, but look at enough of them, and the bones start to become clear, allowing you to add a new skin on top.  Give the skin a wash and brush and you have a lovely fictional oral tradition, suitable for any speculative fiction subgenre. Smoothly, without direct exposition, it can tell your readers where the culture came from, what skills it values, and what forces and features in the environment shaped it. And beyond its narrative and expositional utility, it can serve to remind all of us of the place oral tradition once played—and still plays—in our lives, around the edges of our written words.", "text": "Non-Fiction\nTaught by the Moon: Oral Traditions in Speculative Fiction\nWhen drawing upon real archaeology to build a fictional world, it’s perhaps no wonder that we often turn first to settled societies with written languages. Some of those societies have built impressive monuments and maintained complex governments—and left us a written record of those activities. It’s easy to stop there and forget about mobile hunter-gatherer or tribal societies. Archaeology and ethnography have plenty to tell us about their history through oral traditions. And oral traditions have a lot to offer speculative fiction world-building.\nFirst, a couple of definitions.\nEthnography is the study of living people and their culture, and is often used in conjunction with archaeological data to piece together the past. Ethnographers collect oral histories and oral traditions. Oral histories are first-hand accounts of past events or how the informant lived.\nOral traditions are composed of the stories passed down from one person to another that might also be called myths, fables, legends, or fairytales. When it comes to fiction, oral histories are already commonly used in speculative fiction world-building, whether it’s a character reminiscing about how things were when she was a child, or one relating an important event that occurred only a few years before.\nOral traditions, on the other hand, are much less common to see in speculative fiction, despite the fact that they fit seamlessly into most of the subgenres. A traditional fantasy culture could be modeled on nomads or hunter-gatherers, rather than a settled society — but what about science fiction? Aliens could just as easily record their histories through oral traditions, if they have no written language. Cultures in a post-apocalyptic future could be forced to return to oral traditions as well, if writing has been lost. Or even if it hasn’t been completely lost—without printing presses or the infrastructure to mass-produce a good paper substitute, word of mouth might well return as the best method of spreading news. Over the generations, news can grow into legends. Even urban fantasy beasties or monsters could have developed their own oral traditions, if they are sentient enough to have their own societies.\nNot only do oral traditions fit naturally into speculative fiction, but they’re incredibly useful, narratively speaking. The deep human impulse to participate in an oral tradition lurks in readers, quiescent because they were born into a culture with writing. Craft a fictional oral tradition correctly, and it feels real to readers because it taps into that impulse. Not only does it feel real, it feels old. Oral traditions don’t arise overnight, so in modeling a fictional oral tradition after real ones, an author can take advantage of characteristics, some almost subliminal, that distinguish them from stories made up on the spot. A myth from an oral tradition can do more to make a reader subconsciously feel that a fictional culture is centuries old than pages of historical events.\nOral traditions can also reveal facts about a fictional culture, without having to lecture the readers through blatant exposition. Creation myths in particular are quite rich in opportunities to subtly present facts. The examples in this article are drawn from Northwest Coast and Columbia Plateau Native American tribes, but similar ones can be found all over the world.\nIn a story told in different versions by several Columbia Plateau tribes, Coyote made the first humans. In the time when animal people walked the earth, a giant beaver named Wishpoosh drowned anyone who tried to fish in his lake. The people asked Coyote for help, and he fought the monster long and hard, creating the valleys and lakes and twists and turns along the Columbia river as they grappled. Coyote realized he couldn’t win, so he asked his three sisters who lived as berries in his stomach (that’s another story) for advice, and they gave him a plan. Coyote changed into a fir branch, floated to the monster, and when it swallowed him, he hacked with his knife at the beaver’s insides until it was dead. When he climbed out of the carcass, he cut it up, and from the pieces made the various tribes. As Coyote created each tribe he assigned them different temperaments and skills.\nThere’s a lot going on there, all of which could be useful to build a fictional world. The story did not begin with blackness and nothingness—Wishpoosh and all the animals were already around before the tribes were made. A fictional culture presumably also arrived in an already-formed world, such as a science fiction culture crash-landing on a new planet, which you can reflect at the beginning of a myth.\nThis myth explains the geography that’s most important to the people’s lives—the Columbia River was central to the lives of Plateau tribes because they relied on it for food, through salmon. The myth shows how the people thought of themselves as interconnected, but with separate identities from tribes around them, formed from the same monster but different parts. And finally, the myth presents what people have constructed as their identifying characteristics. One presumes Coyote gave the best skills to the people telling the tale, but what’s best? Bravery, or cleverness? Hunting, or fishing? The answer can reveal what attributes a fictional culture most prizes.\nAnother myth from across the Cascade Mountains illustrates this point. In this myth, with versions from around the Puget Sound, the Changer is born, kidnapped, and found as an adult by Blue Jay through a complicated set of circumstances too long to relate here. He starts on a journey home to return to his mother. Along the way, he encounters people doing all manner of foolish things. Some are using their heads instead of mauls (a kind of hammer) for woodworking. Others are allowing Raven to use living people instead of wood stakes lashed together to form his fish weir. The Changer shows them how to do things properly, and eventually makes it home to become the Moon.\nNote the kind of skills the Changer is teaching: wood-working and fishing. He also teaches skills such as cooking in baskets and manufacturing arrows. All of these are key skills for daily life in Northwest cultures. In other versions of the myth, as the Changer encountered people he changed them into the first animals—for example, a man rowing with a paddle became Beaver, with the paddle for his tail. Similarly, the animals mentioned in the myth are the ones most important to daily life, whether they were hunted, or feared, or simply glimpsed everywhere. Turn that around, and you can show, without one explicit bit of exposition, just what’s needed to survive in a fictional world, be it skills or knowledge of the environment.\nFinally, myths can serve as excellent explanations. Why do salmon come up this tributary of the Columbia, but not the other? (Coyote’s fault again.) Why is it so rainy west of the Cascade Mountains, but dry east of them? (Because the Ocean got angry and convinced the Great Spirit to raise the mountains when the people in the east tried to keep his children Clouds and Rain to themselves.) Turned to world-building purposes, explanation myths illustrate the great forces acting on a fictional culture. What floods, earthquakes, magic storms, or forgotten high technology weapons threaten them at impossible to predict intervals? What warm winds, fertile soils, or magical artifacts help them prosper through means they don’t understand? Forces that can’t be predicted, that can’t be understood, need explanations.\nOral traditions are unfortunately linked with a couple tar pits of anthropological theory (one can thrash around for ages without getting anywhere in particular). Are similar mythological elements hardwired cross-culturally, or are they the coincidental results of happenstance? Or are similar elements signs of contact between two cultures, far in the past? In our world, those questions are incredibly frustrating to try to answer definitively, but the beauty of a fictional world with more than one culture is that you can decide the answer. Seed the same elements into the oral traditions of cultures that have been separate for centuries, and you’ve hinted at that ancient connection to the reader.\nIf anthropology theory doesn’t interest you, on the other hand, there’s also no need to lose yourself in attempting to learn all of the many possible abstract archetypes and themes. There are so many real world examples to feed one’s creativity. Pick a culture, any culture, and model your fictional oral tradition on theirs, and the archetypes and themes will be already built in. It’s best not to appropriate an oral tradition wholesale, but look at enough of them, and the bones start to become clear, allowing you to add a new skin on top.\nGive the skin a wash and brush and you have a lovely fictional oral tradition, suitable for any speculative fiction subgenre. Smoothly, without direct exposition, it can tell your readers where the culture came from, what skills it values, and what forces and features in the environment shaped it. And beyond its narrative and expositional utility, it can serve to remind all of us of the place oral tradition once played—and still plays—in our lives, around the edges of our written words.", "source": "https://clarkesworldmagazine.com/held_02_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Taught by the Moon: Oral Traditions in Speculative Fiction by Rhiannon Held"}