{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Beth Goder", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "TIdOT2yFoCB/qit+YWQVRTqlOb4=", "id": null, "license": null, "comments": "", "raw_text": "5430 words, short story  An Expression of Silence  Three Seconds Before  The last nectarine from the spaceship glistens in Riley’s palm, an imperfect globe smelling like summer. She nestles among the blue-tinted ferns of Ekara C, cupping the nectarine like a tiny sun. The first bite is primal, her mouth swollen with juice that rushes past her chin, taste everywhere, submerging her. She tears into the nectarine, not caring that the rest of the crew is watching from the spaceship, recording this historic moment for their archives. She feels not like an astronaut lightyears from Earth, but like a wild thing, lost in this last taste of home.  She will meet the sentient beings of Ekara C like this, with juice running down her chin, in her worn jogging pants. If she’s going to die, she wants to be comfortable.  This is the most dangerous part of the mission. This waiting. Who knows what the sentient beings here want?  This is humanity’s curse—this curiosity. Riley, who should be worried about her possible impending death, can feel nothing but wonder and gentle trepidation, and the grateful silence of nectarine on her tongue.  She has seen insects, jewel cold and three-legged; she has seen forests of two-toned leaves that curl inward when touched. Battalions of butterflies have brushed their wings against her, leaving sticky mist to settle in her hair. But none of them have signaled prime numbers. None of them have tried to speak.  Humanity has found many other sentient species (the wolf forms and mold-pillows and great squid-like creatures of lesser Andromeda, the wavelike trees of the Orion Arm, the gentle crabs of the Small Magellanic Cloud), but so few of these beings are interested in communicating with humans. The message from Ekara C was marked upon the planet, visible from space—a series of interlocking nodes made from mountains and vegetation.  “Where are you?” Riley thinks, in the three seconds before.  Two Seconds Before  Yyfal’s body is a mountain stretching from the lower valley of Turlanar to the coasts of Greater Dorn. Her sticky glands undulate, ready to form and unform, ready to absorb. Mineral plates cover her primary substances, which have the viscosity of tree sap. She senses the fronds of every fern that grows upon her substances, the curl of every vine. Her brain is a set of nodes running through her body; her thoughts connect and collate and dissipate like ocean waves, like unmarked canvases.  Yyfal has located the smallish figure curled within ferns, delicate and unknown like an unopened flower. The figure’s body is covered in fluids squirted from a diminished globe. Perhaps this globe is a necessary substance for life. Perhaps a charm for luck, or a reminder of a home planet far beyond. A weapon? A benediction? Perhaps an artifact incomprehensible to Yyfal, one she will never understand.  The main thought that bubbles up and outward and through her intones this: could the figure be holding a brain node?  Her desire to communicate surges through her brain nodes. Yyfal must ask the alien for a favor. Yyfal cannot leave the planet, but a node of her can go. She wants to see the universe. Will the alien take the node to the reaches of beyond and then return it to her?  One Second Before  The world shakes. The ground ripples. Ferns brush against Riley, curling in, stems indenting her body.  In front of her, a mountain rises. The base of the mountain shifts to make a humanoid form—a copy of Riley’s limbs, a beating heart on the outside of a sunken chest, hair like ferns.  The mountain holds out an orb, growing enmeshed from a clawed hand.  00:00  Riley is stunned by this gesture. All protocols are forgotten. Instead of the proper greeting, Riley holds out the nectarine pit, a copy of the mountain’s pose.  The mountain takes the nectarine pit and absorbs it.  “I don’t know if it will grow here,” says Riley into the hushed silence. Despite the differences in biome and soil and air (so carefully mapped by the scientists), Riley has hope that the seed will sprout.  This is humanity’s other curse—hope for impossible things.  “The seed will only need a few things to grow,” says Riley, even though the alien can’t possibly understand her. “Light.” Riley points to the sun. “To be buried underneath the soil.” She digs deep into the dirt. “And water.” She cups her hands and mimes reaching into a stream.  The mountain rumbles. Plates shift, creating sound. The mountain points to the sun and makes the same sound again. And again. Is it a word?  “Light,” repeats Riley.  The mountain rumbles the same strange sounds.  Riley reaches out and takes the orb suspended at the end of the mountain’s facsimile hand.  The orb glows softly blue, warming Riley’s skin.  Five Minutes After  Yyfal’s thoughts surge and fight for dominance in the way they do when she is agitated. Colonies of brain nodes break into factions, then re-break themselves as her primary substances ripple.  The alien has her brain node.  This is a new strategy for Yyfal. Already, she feels the absence of that particular node. The other nodes scramble to balance. She ripples again and again, her thoughts shifting tidal, fighting for modal dominance.  “I cannot undo the past,” she thinks, to quiet the nodes who are stuck on conceiving other strategies. For moments, she is overwhelmed by chaos.  “Quorum,” she thinks, frantically. Her body is exhausted from rippling. She had not realized the node she gave away was central to these particular decisions—ones involving exploration and risk and curiosity. Optimism. Hope.  The alien speaks, but Yyfal cannot concentrate on anything outer.  Yyfal inherits and discards thoughts, until finally, a fragile consensus is reached. This strategy of risk, of separation, will be tolerated. Meticulous goals and metrics will be formed. Communication with the alien is a prime objective.  By then, the alien has left, taking the brain node.  Sunlight falls on the ferns growing from Yyfal’s substances. The heat is calming, almost tangible.  Fatigued, Yyfal sinks into non-sentience, letting thoughts travel through her body without direction or dictation.  One Day After  “Light,” says Riley.  “Light,” rumbles Yyfal, in the language that is hers. The ocean of her body undulates through the planet like so many granite waves, barely touching Riley.  Riley repeats the word using computer-simulated sounds. “Light,” she says, in Yyfal’s language.  Fern, they say. And spaceship. (For Yyfal, the word spaceship translates more properly to “traveling body.”) Moon, sun, planet, darkness, number, prime, butterfly, insect, hand, articulated body morph, human, mountain form, river, tree.  Five Days After  In the spaceship, Riley contemplates the Orb. It glows blue and hot, encased in a clear terrarium. This terrarium is meant to contain plants from Ekara C, but it is currently sterile, holding the Orb and nothing else. Riley longs to plant a city of ferns in the terrarium. She can’t help but feel that the Orb is lonely. It is an unscientific fantasy, one she would never share with her crewmates.  Jason enters the lab, and Riley sighs, not wanting to be interrupted. He’s obsessed with cataloging species of ferns. The other terrariums in the science center are devoted to growing ferns in fungi-rich soil, all taken from Ekara C. (Riley asked for permission for Jason to take samples, and Yyfal answered with a cryptic affirmative, something about a mission to take.)  “Have you seen Natalia?” he asks.  Riley shakes her head, not taking her eyes from the Orb. “She’s probably with the butterflies.” (They aren’t, of course, actual butterflies, but an insect unique to Ekara C.) Yesterday, Natalia came back from a fourteen-hour field trip smelling of the strange mist the butterflies produce, a scent not unlike lavender, with a harsh edge of metal.  Jason and Natalia have met Yyfal, but they become easily frustrated with Yyfal’s language, her puzzling answers to simple questions. Riley’s crewmates stick to their own disciplines. Yyfal, as far as Riley can tell, views Jason and Natalia as an extension of the ship, like automatons, even though Riley has explained, multiple times, that they are all sentient. “Human, like me.”  Riley has not met any other sentient beings on Ekara C. Only Yyfal. When she asks about others, Riley does not understand Yyfal’s answers about quorums and nodes and brief periods of non-sentience.  Riley pushes her hand against the terrarium. What is the Orb for? What should she do with it?  “It’s Natalia’s turn to clean the glassware,” says Jason, startling Riley from her thoughts.  “I’ll do it,” says Riley, picking up the scrubber. She knows from experience that Jason will want to chat, even if she says she’s in the middle of a thought, so she runs the water loudly until he leaves. Talking to Jason can be exhausting. All of those meaningless words. So many words to say so few things.  Her thoughts turn back to Yyfal. When they first met, Yyfal shaped her body into a humanoid form. Riley wishes she could do the same, that she could become a mountain, that she could show Yyfal her desire to communicate through the physical shape of her body.  Riley turns off the water and sets the clean glassware aside.  The Orb glows, a perfect gem in a clear terrarium, as inscrutable as an image of a human brain, which can show only the physicality of itself and not its thoughts.  Fifteen Days After  Yyfal has done the hard work of communicating. All these words, all these sounds. The problem is not the speaking, but the concepts.  This alien, Riley, has come to Yyfal every day, ready to learn and to teach. This gives Yyfal hope.  Yyfal has taken Riley’s brain node, the hard pit, and buried it. Riley was clear about this point. This brain node needs light, water, and soil.  The node has not spoken, and Riley will not produce a second one.  “Another,” rumbles Yyfal, pointing with her humanoid construction to the place where the node is buried.  “Tree,” Riley says, then shows a picture of a tree with orange nodes and explains again. This “nectarine tree” is a living organism with brain nodes. Riley can absorb the outer layer of these nodes, but never the hard pit in the middle. None of this explanation makes sense to Yyfal. The trees of her planet do not produce nodes. They have never tried to communicate with her. When trees grow in her substances, she can feel their leaves, their bark, the fungi surrounding their roots, but she has never known a tree to have a thought.  Yyfal asks again about rippling. How does Riley ripple her thoughts? How does she catalog the microscopic organisms she carries in her body? Yyfal tries again to explain blanching and reaching, the gateways of structured space. Simple concepts, but Riley’s questions show she does not understand.  Twenty-two Days After  The only thing they understand together, completely and without doubt, is time.  Riley pulls an analog watch from the pocket of her jogging shorts.  The game goes like this: Riley hides the face of the watch, waits, and asks how much time has passed.  “How long?” says Riley.  “Thirty-six seconds.” Yyfal translates to Riley’s units.  Yyfal is never wrong. She has a perfect sense of time.  It’s a simple game, but it gives them both pleasure. Perhaps it is only that, through their perception of time, they have a shared view of reality. Thirty-six seconds have passed. This is something they can both agree on.  “How long since we met?” asks Riley. She stumbles over the placement of the words in Yyfal’s language, but she is fluent enough to convey what she means.  Yyfal answers without hesitation. “1,900,800 seconds since our transfer.”  Riley does not understand the word “transfer.” They go over it again. Riley tries “meeting,” “first,” “introduction.” She explains these words as best she can. To explain, she must define other words. Yyfal tries “exchange,” but cannot get Riley to understand the connotation this word has, in her language, of risk.  Having started from different assumptions, neither Yyfal nor Riley can make herself understood.  Thirty Days After  Ekara C drips with rain. Ferns curl into condensed chalices. The butterflies shelter under trees, flipping their wings to the tessellated side.  Riley has spent the day speaking to Yyfal, but now Yyfal “must become ocean-like in her thoughts,” which, as far as Riley can parse, means she needs to sleep.  Riley hunches by a thick, purple fern, not ready to go back to the spaceship. It is in quiet moments like these that Riley wonders if she has made a mistake. If humanity has made a mistake coming here.  Jason, carrying his sample case of ferns, tromps over to her. There’s an efficiency to his movements that always startles her. He often makes jokes about how Riley likes talking to Yyfal better than to her human crewmates. Honestly, he’s not wrong. Riley has always found it hard to talk to other people. At least with Yyfal, communication is supposed to be difficult.  “Coming out of the rain?” he asks.  Riley wants to stay outside. She likes the silence of rain puddling around her, but since she can’t say this to Jason in a way he will understand, she musters a smile and agrees to walk back to the spaceship.  “How’s your work going?” she asks, implementing a technique she has learned over the years. (People like when you ask them questions.) Jason speaks about ferns—the various species and the thickness of their spores.  Jason shifts the sample case, beads of raindrops slipping down his nose. His tone grows serious. “You’re spending a lot of time with the alien.”  “Her name is Yyfal.” Riley pronounces the word as best she can without the help of her computer, although her throat can’t make the proper guttural sounds.  “This is the fortieth sentient species humanity has encountered, isn’t it?” asks Jason. It isn’t a real question. They both know the answer. She hates when he asks questions that are actually statements. “Why are you working so much?”  It feels like Jason means something else, but she isn’t sure what. She doesn’t want to work less. What she’s doing is important. How can humanity understand themselves, their place in the universe, without understanding other intelligent life? What ideas could she and Yyfal share, if only they could communicate with each other clearly?  When she doesn’t say anything, he pushes. “Does that alien even know what you’re saying?”  “Do you even know what I’m saying?” she asks.  She wonders if this is about breakfast. Jason always wants to chat, but Riley usually ignores him because it’s hard to read scientific articles while having a conversation. (It does not matter how many times she states her preference for silence during breakfast.) Or maybe it’s something entirely different. It might make sense if she thinks about it long enough.  Riley finds she doesn’t care what Jason thinks. She stops walking. “You can go on ahead.” She doesn’t need to explain why she wants to stay outside, her love of the rain.  “Okay,” he says, exasperated.  She stays outside until Yyfal rumbles up to her, awake.  “I like the rain,” says Riley.  “Also,” Yyfal says.  They sit in silence for three thousand six hundred ninety seconds, watching the rain drench the soft dirt.  Thirty-one Days After  “When will you continue with taking?” asks Yyfal. She has asked a version of this question many times. No matter how she words it, they get stuck on a fundamental misunderstanding—what is part of Riley? What is part of Yyfal?  “I want to see everything,” says Yyfal.  It has been many days since Riley took Yyfal’s brain node into the mystery that is the spaceship. The node is still on the planet. Nothing has been accomplished.  “I want,” says Yyfal. Words stop. There is only her yearning, inexpressible.  Riley holds up a limb. The arm/hand of which she has two. “I want, also,” she says, but what Riley wants is different. “I want to know.”  Words cannot cross the space between them. In the silence, time moves as it always does, inexorably forward.  Thirty-two Days After  Riley sits with the Orb, watching the gently pulsing light. It makes her feel like a distinct part of the universe, one disparate entity among many others. She is insignificant, she contains multitudes. Is this what all consciousness is like? she thinks. One wave beating against another? She loves the silence of the room too much. There is no expectation in silence. The Orb wants nothing from her that can be defined. Perhaps the Orb too is content to sit silently, contemplating the universe.  It is in moments like these, alone, that Riley is most truly herself.  Thirty-three Days After  Yyfal has been suppressing a ripple, which causes an uncomfortable sensation in the primary substances along her anteroposterior axis.  The thought she is trying so hard not to think is this: the only way forward is to steal one of Riley’s brain nodes.  Yyfal understands that Riley has a different physicality, with limitations of form and an intriguing underlying structure. Riley’s nodes appear to be separate and varied from her main body. The “Jason” node and “Natalia” node have their own tasks, unlike the “nectarine pit” node, which, Riley has assured her, could change form if certain conditions are met, with sun, water, and soil.  Riley has taken Yyfal’s brain node into the spaceship, which is Riley’s home and a source of great energy. Perhaps the spaceship is also part of the network of Riley’s body.  Yyfal rumbles her outer edges, which are connected so integrally to Ekara C that she has no separation between the concepts of “home” and “body.” Both are of her.  She thinks of the unfairness of the exchange. Her brain node was active, but the node Riley gave her (the “nectarine pit” node) is inert.  To understand Riley, to truly communicate, perhaps Yyfal needs an active node. How else can she explain what she wants: for Riley to take her brain node through the universe, to adventure among the stars?  Finally, with the relief of release, Yyfal lets herself ripple, and the plan is set.  Forty Days and Three Hours After  Riley feels like she is getting somewhere with Yyfal. This morning, they’ve added five hundred words to their shared vocabulary.  They sit by the ocean, Riley upon a sand dune, Yyfal with her humanoid form constructed of shells and cliff rocks and amber. In the ocean, a creature similar to a whale crests, its purple skin shining in the sun.  “We have an animal like this,” says Riley, pointing. “We call it a whale. When an Earth whale dies, the body falls to the bottom of the ocean. This helps other animals. We call this whalefall.” The topic of whalefall is not at the top of the priority list, but sometimes the most interesting facts come up as their conversations meander.  “Here, too,” says Yyfal. She rumbles her word for whalefall. Riley adds it to the lexicon. Words added today: five hundred and one.  “I want to understand,” says Yyfal.  “Whalefall isn’t what I study,” says Riley. “Natalia would know more about it.”  “Not whalefall,” says Yyfal. “You.”  “I want to understand you, too,” says Riley. And she does. More than anything.  “Natalia is an important node?” asks Yyfal.  No matter how Riley tries, Yyfal will not refer to the other crew members as anything other than nodes. “She’s important,” says Riley.  “You have taken from the planet to understand me. Ferns. Butterflies. My substance. Can I take to understand you?” Yyfal asks.  “I can give you whatever you need,” says Riley. She offers food, lab books, clothing. The many artifacts of their existence.  “I must ripple,” says Yyfal.  Riley still doesn’t understand rippling. Whenever they try to define words related to it, Riley gets lost.  “I enjoyed talking about whalefall,” says Riley.  “Yes,” says Yyfal. “Also.”  Forty Days and Four Hours After  Yyfal cannot take the Natalia node. That node is too important to Riley. When the Jason node comes out to collect ferns, she wraps him softly in limbs made of her gentlest substance.  “Do you need soil too? And water?” she asks, but the Jason node only makes a loud, bleating noise that she has never heard before, one she cannot translate.  Forty Days and Thirteen Hours After  Riley knows something is wrong before she comes into the clearing with the buried nectarine pit. A subsurface tremble runs under her feet, so soft she isn’t sure if it’s there at all.  In the clearing, Jason is sprawled in a cage made from Yyfal’s body, barely breathing. His legs are caked in dirt. His shirt is ripped down the middle, revealing a gash across his chest. His hair is drenched. When he sees Riley, he tries to call out, but the sound of his voice is lost before it reaches her.  Riley runs to him, pushing her hands through the folds of his cage.  “Are you okay?” Riley asks, even though it’s clear he’s not.  Jason gasps, unable to answer.  “What did you do?” Riley asks Yyfal, terrified and unable to convey her terror. She does not have the words for anger, for sadness. “No,” she says, again and again. Then, the word she has used so often. “Why?”  “I wanted to understand,” says Yyfal.  “You do not understand.” Riley feels for Jason’s pulse, easing her fingers against his neck.  “I asked for another node,” says Yyfal. “I asked many times.”  “Give him back.” Riley is worried that Yyfal won’t, but the stone shifts and untangles until Jason lies against soft ferns, until Yyfal disappears into the surface of the planet.  Riley messages Natalia, who rushes from the spaceship, her lab coat covered in the purple mist of butterflies. They apply nano-patches to Jason’s chest and limbs. Gently, they lift him onto a plexi-stretcher and carry him away.  Forty Days and Fourteen Hours After  Yyfal surges against the ocean, crashing down like a wave. Water coats the crevasses of her body. Salt sticks to the inner coating of her primary substances. She senses every instance of whalefall against the ocean floor. In the water, she feels the living whales brush against her, but they do not notice her. They have never noticed her. It is the same with the butterflies. The same with the grass minnows and the flowering lizards. She has never been able to communicate with the great thinking structure that must connect the whale nodes to each other. When the grass minnows chirp, all those nodes sounding at once, she has never been able to join their song. So much movement and life surround her, yet she has been so lonely.  What right does Riley have to be upset? Yyfal had permission to take what she needed. Riley waited 32,009 seconds before retrieving the “Jason” node, although she must have instantly felt the loss of him, plucked from her matrix. If Riley had missed that node, why did she not come sooner?  The force of Yyfal’s anger contaminates her thoughts. She ripples several times against the salty water before she reaches a quorum.  She has not taught Riley the words for despair, or obstinance, or foolishness. They have not discussed the concepts of curiosity, hope, or faith.  The sky darkens and fills with stars. It is so much easier to define a star, with its physicality. How can she expect Riley to understand the word for trust when there is nothing in the physical world that Yyfal can point to?  They do not have the words to apologize. They do not have enough words at all.  Forty Days and Sixteen Hours After  “She tried to bury me,” says Jason. He sits in the medical compartment, shivering in fresh clothes. Sticky residue from the nano-patches coats his body, smelling like disinfectant. “She tried to drown me.”  “I don’t think she meant to hurt you,” says Riley. Her stomach pulls in on itself, until it feels like it’s the size of a nectarine pit. How can she truly know what Yyfal meant to do?  “It doesn’t matter. She almost killed me,” says Jason. His mouth sets in a grim line. Anger burns through him, replacing his fear. “We are leaving this planet. Now.”  “We don’t understand what’s going on yet,” says Riley.  Natalia looks at Riley with pity, and this is worse than Jason’s anger. “You know the protocols,” says Natalia. “This was clearly an act of aggression.”  “Let me talk to her,” says Riley.  Jason nods, but it’s obvious that he won’t change his mind.  “If you aren’t back in an hour, I’ll come find you,” says Natalia. The implication is clear. Riley might need to be found, if Yyfal snatches her too.  They let her go.  Her vocabulary is insufficient. Her lexicon not nearly complete. Riley pushes aside these thoughts. She doesn’t have time for despair, only the work ahead, of communicating.  Forty-one Days and Seventeen Hours After  Soft ferns brush against Riley’s arms as she runs through the clearing to the dark earth where the nectarine pit is buried. The sun cuts cool against her skin. Words jumble in her mind, rearrange themselves, and fall. She doesn’t know what she will say to Yyfal, and in that gap between words and meaning there is only a longing. Riley starts to doubt that words have any meaning at all. How can two people come to a precise definition of anything? How can one syllable hold within itself a complexity of concepts? In the place where no words exist, there is only silence, and perhaps this is a truer communication than any sound.  As Yyfal rumbles and shifts and comes up beside her, Riley tells herself she is not afraid, but she cannot control the rapid beating of her heart.  “I don’t understand,” says Riley.  “You think it was not good,” says Yyfal. “You said to take, but now to take is bad.”  “He is a human. Like me.” Riley pulls up a handful of ferns, ripping the fronds off one by one. “You should not have taken him.”  “But you are taking ferns,” says Yyfal. She points with her human construction at Riley’s hands. “You are destroying.”  “The ferns aren’t sentient,” says Riley, before realizing they have not defined the word “sentient.” She tries again. “The ferns don’t have words.” But this isn’t right at all. Silence can hold its own sentience. What Riley really wants to say is that the ferns cannot think.  “The ferns are of me,” says Yyfal. “My body-home. And the Jason node is of you.”  “Jason is not part of me,” says Riley. “We are separate.”  “I do not understand,” says Yyfal. “He is your node. He is of you.”  “Did you mean to harm him?” asks Riley. But she realizes she has not defined harm for Yyfal. Riley doesn’t have time to wander down a maze of definitions. “Whalefall?” she asks. It’s the closest she can come in meaning to death.  “Only to understand,” says Yyfal.  “We have to leave,” says Riley. She knows, back at the spaceship, Jason will be drafting his report, marking Ekara C as hostile to warn other explorers. Natalia will be running down the takeoff checklists.  “Going?” asks Yyfal. Her body trembles and reforms. She is, for a moment, the shape of a whale, then a spaceship, then a form that has no name. Yyfal’s body slowly melts into the dirt, but she is all around Riley. For one moment, Riley understands that Yyfal is everywhere on this planet.  “Should I give you back the Orb?” asks Riley.  “Keep,” says Yyfal.  Forty-one Days and Twenty-three Hours After  Yyfal’s brain node nestles in the terrarium, seeing and hearing everything, unable to speak.  The brain node is no longer afraid. Her thoughts are limited by her separateness, yet clear in a way they never were when she was connected to the whole. Instead of having a crisis of identity, the node decides she is both Yyfal and not Yyfal.  More than anything, the node wants to explore.  Forty-two Days and Two Hours After  As Ekara C becomes a distant dot the size of a nectarine pit in the viewscreen, Riley thinks of the planet’s silence. An echo works its way through her chest. She has failed.  What did Yyfal want from her? Riley has only her intuition. She thinks of Yyfal emerging all around her. She thinks of the many ways the universe has produced sentience.  The Orb sits quietly in the terrarium.  Riley speaks to the Orb in the rumbling of Yyfal’s language. “Stars,” she says. She does not know if what she’s doing is right. It is only some innate quality of curiosity and an impossible hope that causes her to speak. “We are going.”  Three Years After  Riley has modified the terrarium, placing it on a set of wheels like a rover. The Orb comes with her on all of her missions. Together, they have seen the ocean cliffs of Otobol E, where sea stars swim below, and the dark, soft silence of the moons of Jupiter. They have slipped through the flower-strewn deserts and sand sculptures of Ultmi B, which stretch upward for kilometers, so lacelike it seems they should surely fall in the wind. They have heard the singing of the crabs of the Small Magellanic Cloud, and the close, quiet echoes of the sentient caves of Outer Tul.  Riley speaks to the Orb in Yyfal’s language and her own, even though the Orb cannot respond. If there is one thing Riley has learned in her travels, it is that there are many different ways of thinking and communicating. Silence does not indicate a lack of awareness. So many of the sentient species of the universe do not speak.  She thinks often of Yyfal and of the words she wishes they both knew how to say. She is not sure she is doing the right thing, taking the Orb with her on her missions. When she remembers Yyfal, Riley most often thinks of those moments in the rain, where they spent so long not speaking at all.  Four Years After  They stop at Otobol E for five months so that Natalia can study the luminescent crickets that bury themselves in the cobbled sand. The ship is much quieter without Jason (who they dropped off on Jupiter years ago), and that suits everyone just fine.  Riley and the Orb spend hours watching ocean waves brush tumultuous against the shore while Natalia searches for crickets.  Five Years After  The node lives a quiet existence. She observes with wonder. When alone, she thinks thoughts of great philosophical significance, so she is never bored.  The universe is vaster than the node had thought possible. With joy, she explores the stars and planets, the great variety of life contained within. She is hardly ever homesick.  Riley is simultaneously a node-of-kinship (Riley would probably use the term “friend”) and another avenue of exploration. Through the years, the node comes to learn Riley’s language and gains an understanding of the physicality of her mind, her separateness from others. They are alike in so many ways.  The node feels that when she becomes part of Yyfal again, absorbed into the whole, this information will be of use.  Eight Years, Ten Days, and Three Minutes After  Using her meticulous records and maps, Riley is able to land her spaceship in the same clearing on Ekara C where she first met Yyfal. She ignores the warnings that appear in her viewscreen chanting, “Hostile planet.”  She emerges with the Orb in tow, as they have done so many times before.  Riley is scared she has not done the right thing. She doesn’t know if she was supposed to return with the Orb, but she is determined to communicate with Yyfal. This time, she will not leave before they come to understand each other.  A nectarine tree stands in the clearing, leaves twisting gently in the wind. Fruit hangs from the branches like small, contained worlds. Riley touches a branch, the bark rough against her skin.  “This should be impossible,” she says to the Orb, her voice breaking. “How could anything so alien to this planet have grown here?”  Butterflies glide past on tessellated wings, stirring a metallic smell in the wind. Ferns brush against her ankles. The sky stretches wide above.  In the three seconds before Yyfal appears, Riley cups a nectarine in her hand, staring in wonder.", "text": "5430 words, short story\nAn Expression of Silence\nThree Seconds Before\nThe last nectarine from the spaceship glistens in Riley’s palm, an imperfect globe smelling like summer. She nestles among the blue-tinted ferns of Ekara C, cupping the nectarine like a tiny sun. The first bite is primal, her mouth swollen with juice that rushes past her chin, taste everywhere, submerging her. She tears into the nectarine, not caring that the rest of the crew is watching from the spaceship, recording this historic moment for their archives. She feels not like an astronaut lightyears from Earth, but like a wild thing, lost in this last taste of home.\nShe will meet the sentient beings of Ekara C like this, with juice running down her chin, in her worn jogging pants. If she’s going to die, she wants to be comfortable.\nThis is the most dangerous part of the mission. This waiting. Who knows what the sentient beings here want?\nThis is humanity’s curse—this curiosity. Riley, who should be worried about her possible impending death, can feel nothing but wonder and gentle trepidation, and the grateful silence of nectarine on her tongue.\nShe has seen insects, jewel cold and three-legged; she has seen forests of two-toned leaves that curl inward when touched. Battalions of butterflies have brushed their wings against her, leaving sticky mist to settle in her hair. But none of them have signaled prime numbers. None of them have tried to speak.\nHumanity has found many other sentient species (the wolf forms and mold-pillows and great squid-like creatures of lesser Andromeda, the wavelike trees of the Orion Arm, the gentle crabs of the Small Magellanic Cloud), but so few of these beings are interested in communicating with humans. The message from Ekara C was marked upon the planet, visible from space—a series of interlocking nodes made from mountains and vegetation.\n“Where are you?” Riley thinks, in the three seconds before.\nTwo Seconds Before\nYyfal’s body is a mountain stretching from the lower valley of Turlanar to the coasts of Greater Dorn. Her sticky glands undulate, ready to form and unform, ready to absorb. Mineral plates cover her primary substances, which have the viscosity of tree sap. She senses the fronds of every fern that grows upon her substances, the curl of every vine. Her brain is a set of nodes running through her body; her thoughts connect and collate and dissipate like ocean waves, like unmarked canvases.\nYyfal has located the smallish figure curled within ferns, delicate and unknown like an unopened flower. The figure’s body is covered in fluids squirted from a diminished globe. Perhaps this globe is a necessary substance for life. Perhaps a charm for luck, or a reminder of a home planet far beyond. A weapon? A benediction? Perhaps an artifact incomprehensible to Yyfal, one she will never understand.\nThe main thought that bubbles up and outward and through her intones this: could the figure be holding a brain node?\nHer desire to communicate surges through her brain nodes. Yyfal must ask the alien for a favor. Yyfal cannot leave the planet, but a node of her can go. She wants to see the universe. Will the alien take the node to the reaches of beyond and then return it to her?\nOne Second Before\nThe world shakes. The ground ripples. Ferns brush against Riley, curling in, stems indenting her body.\nIn front of her, a mountain rises. The base of the mountain shifts to make a humanoid form—a copy of Riley’s limbs, a beating heart on the outside of a sunken chest, hair like ferns.\nThe mountain holds out an orb, growing enmeshed from a clawed hand.\n00:00\nRiley is stunned by this gesture. All protocols are forgotten. Instead of the proper greeting, Riley holds out the nectarine pit, a copy of the mountain’s pose.\nThe mountain takes the nectarine pit and absorbs it.\n“I don’t know if it will grow here,” says Riley into the hushed silence. Despite the differences in biome and soil and air (so carefully mapped by the scientists), Riley has hope that the seed will sprout.\nThis is humanity’s other curse—hope for impossible things.\n“The seed will only need a few things to grow,” says Riley, even though the alien can’t possibly understand her. “Light.” Riley points to the sun. “To be buried underneath the soil.” She digs deep into the dirt. “And water.” She cups her hands and mimes reaching into a stream.\nThe mountain rumbles. Plates shift, creating sound. The mountain points to the sun and makes the same sound again. And again. Is it a word?\n“Light,” repeats Riley.\nThe mountain rumbles the same strange sounds.\nRiley reaches out and takes the orb suspended at the end of the mountain’s facsimile hand.\nThe orb glows softly blue, warming Riley’s skin.\nFive Minutes After\nYyfal’s thoughts surge and fight for dominance in the way they do when she is agitated. Colonies of brain nodes break into factions, then re-break themselves as her primary substances ripple.\nThe alien has her brain node.\nThis is a new strategy for Yyfal. Already, she feels the absence of that particular node. The other nodes scramble to balance. She ripples again and again, her thoughts shifting tidal, fighting for modal dominance.\n“I cannot undo the past,” she thinks, to quiet the nodes who are stuck on conceiving other strategies. For moments, she is overwhelmed by chaos.\n“Quorum,” she thinks, frantically. Her body is exhausted from rippling. She had not realized the node she gave away was central to these particular decisions—ones involving exploration and risk and curiosity. Optimism. Hope.\nThe alien speaks, but Yyfal cannot concentrate on anything outer.\nYyfal inherits and discards thoughts, until finally, a fragile consensus is reached. This strategy of risk, of separation, will be tolerated. Meticulous goals and metrics will be formed. Communication with the alien is a prime objective.\nBy then, the alien has left, taking the brain node.\nSunlight falls on the ferns growing from Yyfal’s substances. The heat is calming, almost tangible.\nFatigued, Yyfal sinks into non-sentience, letting thoughts travel through her body without direction or dictation.\nOne Day After\n“Light,” says Riley.\n“Light,” rumbles Yyfal, in the language that is hers. The ocean of her body undulates through the planet like so many granite waves, barely touching Riley.\nRiley repeats the word using computer-simulated sounds. “Light,” she says, in Yyfal’s language.\nFern, they say. And spaceship. (For Yyfal, the word spaceship translates more properly to “traveling body.”) Moon, sun, planet, darkness, number, prime, butterfly, insect, hand, articulated body morph, human, mountain form, river, tree.\nFive Days After\nIn the spaceship, Riley contemplates the Orb. It glows blue and hot, encased in a clear terrarium. This terrarium is meant to contain plants from Ekara C, but it is currently sterile, holding the Orb and nothing else. Riley longs to plant a city of ferns in the terrarium. She can’t help but feel that the Orb is lonely. It is an unscientific fantasy, one she would never share with her crewmates.\nJason enters the lab, and Riley sighs, not wanting to be interrupted. He’s obsessed with cataloging species of ferns. The other terrariums in the science center are devoted to growing ferns in fungi-rich soil, all taken from Ekara C. (Riley asked for permission for Jason to take samples, and Yyfal answered with a cryptic affirmative, something about a mission to take.)\n“Have you seen Natalia?” he asks.\nRiley shakes her head, not taking her eyes from the Orb. “She’s probably with the butterflies.” (They aren’t, of course, actual butterflies, but an insect unique to Ekara C.) Yesterday, Natalia came back from a fourteen-hour field trip smelling of the strange mist the butterflies produce, a scent not unlike lavender, with a harsh edge of metal.\nJason and Natalia have met Yyfal, but they become easily frustrated with Yyfal’s language, her puzzling answers to simple questions. Riley’s crewmates stick to their own disciplines. Yyfal, as far as Riley can tell, views Jason and Natalia as an extension of the ship, like automatons, even though Riley has explained, multiple times, that they are all sentient. “Human, like me.”\nRiley has not met any other sentient beings on Ekara C. Only Yyfal. When she asks about others, Riley does not understand Yyfal’s answers about quorums and nodes and brief periods of non-sentience.\nRiley pushes her hand against the terrarium. What is the Orb for? What should she do with it?\n“It’s Natalia’s turn to clean the glassware,” says Jason, startling Riley from her thoughts.\n“I’ll do it,” says Riley, picking up the scrubber. She knows from experience that Jason will want to chat, even if she says she’s in the middle of a thought, so she runs the water loudly until he leaves. Talking to Jason can be exhausting. All of those meaningless words. So many words to say so few things.\nHer thoughts turn back to Yyfal. When they first met, Yyfal shaped her body into a humanoid form. Riley wishes she could do the same, that she could become a mountain, that she could show Yyfal her desire to communicate through the physical shape of her body.\nRiley turns off the water and sets the clean glassware aside.\nThe Orb glows, a perfect gem in a clear terrarium, as inscrutable as an image of a human brain, which can show only the physicality of itself and not its thoughts.\nFifteen Days After\nYyfal has done the hard work of communicating. All these words, all these sounds. The problem is not the speaking, but the concepts.\nThis alien, Riley, has come to Yyfal every day, ready to learn and to teach. This gives Yyfal hope.\nYyfal has taken Riley’s brain node, the hard pit, and buried it. Riley was clear about this point. This brain node needs light, water, and soil.\nThe node has not spoken, and Riley will not produce a second one.\n“Another,” rumbles Yyfal, pointing with her humanoid construction to the place where the node is buried.\n“Tree,” Riley says, then shows a picture of a tree with orange nodes and explains again. This “nectarine tree” is a living organism with brain nodes. Riley can absorb the outer layer of these nodes, but never the hard pit in the middle. None of this explanation makes sense to Yyfal. The trees of her planet do not produce nodes. They have never tried to communicate with her. When trees grow in her substances, she can feel their leaves, their bark, the fungi surrounding their roots, but she has never known a tree to have a thought.\nYyfal asks again about rippling. How does Riley ripple her thoughts? How does she catalog the microscopic organisms she carries in her body? Yyfal tries again to explain blanching and reaching, the gateways of structured space. Simple concepts, but Riley’s questions show she does not understand.\nTwenty-two Days After\nThe only thing they understand together, completely and without doubt, is time.\nRiley pulls an analog watch from the pocket of her jogging shorts.\nThe game goes like this: Riley hides the face of the watch, waits, and asks how much time has passed.\n“How long?” says Riley.\n“Thirty-six seconds.” Yyfal translates to Riley’s units.\nYyfal is never wrong. She has a perfect sense of time.\nIt’s a simple game, but it gives them both pleasure. Perhaps it is only that, through their perception of time, they have a shared view of reality. Thirty-six seconds have passed. This is something they can both agree on.\n“How long since we met?” asks Riley. She stumbles over the placement of the words in Yyfal’s language, but she is fluent enough to convey what she means.\nYyfal answers without hesitation. “1,900,800 seconds since our transfer.”\nRiley does not understand the word “transfer.” They go over it again. Riley tries “meeting,” “first,” “introduction.” She explains these words as best she can. To explain, she must define other words. Yyfal tries “exchange,” but cannot get Riley to understand the connotation this word has, in her language, of risk.\nHaving started from different assumptions, neither Yyfal nor Riley can make herself understood.\nThirty Days After\nEkara C drips with rain. Ferns curl into condensed chalices. The butterflies shelter under trees, flipping their wings to the tessellated side.\nRiley has spent the day speaking to Yyfal, but now Yyfal “must become ocean-like in her thoughts,” which, as far as Riley can parse, means she needs to sleep.\nRiley hunches by a thick, purple fern, not ready to go back to the spaceship. It is in quiet moments like these that Riley wonders if she has made a mistake. If humanity has made a mistake coming here.\nJason, carrying his sample case of ferns, tromps over to her. There’s an efficiency to his movements that always startles her. He often makes jokes about how Riley likes talking to Yyfal better than to her human crewmates. Honestly, he’s not wrong. Riley has always found it hard to talk to other people. At least with Yyfal, communication is supposed to be difficult.\n“Coming out of the rain?” he asks.\nRiley wants to stay outside. She likes the silence of rain puddling around her, but since she can’t say this to Jason in a way he will understand, she musters a smile and agrees to walk back to the spaceship.\n“How’s your work going?” she asks, implementing a technique she has learned over the years. (People like when you ask them questions.) Jason speaks about ferns—the various species and the thickness of their spores.\nJason shifts the sample case, beads of raindrops slipping down his nose. His tone grows serious. “You’re spending a lot of time with the alien.”\n“Her name is Yyfal.” Riley pronounces the word as best she can without the help of her computer, although her throat can’t make the proper guttural sounds.\n“This is the fortieth sentient species humanity has encountered, isn’t it?” asks Jason. It isn’t a real question. They both know the answer. She hates when he asks questions that are actually statements. “Why are you working so much?”\nIt feels like Jason means something else, but she isn’t sure what. She doesn’t want to work less. What she’s doing is important. How can humanity understand themselves, their place in the universe, without understanding other intelligent life? What ideas could she and Yyfal share, if only they could communicate with each other clearly?\nWhen she doesn’t say anything, he pushes. “Does that alien even know what you’re saying?”\n“Do you even know what I’m saying?” she asks.\nShe wonders if this is about breakfast. Jason always wants to chat, but Riley usually ignores him because it’s hard to read scientific articles while having a conversation. (It does not matter how many times she states her preference for silence during breakfast.) Or maybe it’s something entirely different. It might make sense if she thinks about it long enough.\nRiley finds she doesn’t care what Jason thinks. She stops walking. “You can go on ahead.” She doesn’t need to explain why she wants to stay outside, her love of the rain.\n“Okay,” he says, exasperated.\nShe stays outside until Yyfal rumbles up to her, awake.\n“I like the rain,” says Riley.\n“Also,” Yyfal says.\nThey sit in silence for three thousand six hundred ninety seconds, watching the rain drench the soft dirt.\nThirty-one Days After\n“When will you continue with taking?” asks Yyfal. She has asked a version of this question many times. No matter how she words it, they get stuck on a fundamental misunderstanding—what is part of Riley? What is part of Yyfal?\n“I want to see everything,” says Yyfal.\nIt has been many days since Riley took Yyfal’s brain node into the mystery that is the spaceship. The node is still on the planet. Nothing has been accomplished.\n“I want,” says Yyfal. Words stop. There is only her yearning, inexpressible.\nRiley holds up a limb. The arm/hand of which she has two. “I want, also,” she says, but what Riley wants is different. “I want to know.”\nWords cannot cross the space between them. In the silence, time moves as it always does, inexorably forward.\nThirty-two Days After\nRiley sits with the Orb, watching the gently pulsing light. It makes her feel like a distinct part of the universe, one disparate entity among many others. She is insignificant, she contains multitudes. Is this what all consciousness is like? she thinks. One wave beating against another? She loves the silence of the room too much. There is no expectation in silence. The Orb wants nothing from her that can be defined. Perhaps the Orb too is content to sit silently, contemplating the universe.\nIt is in moments like these, alone, that Riley is most truly herself.\nThirty-three Days After\nYyfal has been suppressing a ripple, which causes an uncomfortable sensation in the primary substances along her anteroposterior axis.\nThe thought she is trying so hard not to think is this: the only way forward is to steal one of Riley’s brain nodes.\nYyfal understands that Riley has a different physicality, with limitations of form and an intriguing underlying structure. Riley’s nodes appear to be separate and varied from her main body. The “Jason” node and “Natalia” node have their own tasks, unlike the “nectarine pit” node, which, Riley has assured her, could change form if certain conditions are met, with sun, water, and soil.\nRiley has taken Yyfal’s brain node into the spaceship, which is Riley’s home and a source of great energy. Perhaps the spaceship is also part of the network of Riley’s body.\nYyfal rumbles her outer edges, which are connected so integrally to Ekara C that she has no separation between the concepts of “home” and “body.” Both are of her.\nShe thinks of the unfairness of the exchange. Her brain node was active, but the node Riley gave her (the “nectarine pit” node) is inert.\nTo understand Riley, to truly communicate, perhaps Yyfal needs an active node. How else can she explain what she wants: for Riley to take her brain node through the universe, to adventure among the stars?\nFinally, with the relief of release, Yyfal lets herself ripple, and the plan is set.\nForty Days and Three Hours After\nRiley feels like she is getting somewhere with Yyfal. This morning, they’ve added five hundred words to their shared vocabulary.\nThey sit by the ocean, Riley upon a sand dune, Yyfal with her humanoid form constructed of shells and cliff rocks and amber. In the ocean, a creature similar to a whale crests, its purple skin shining in the sun.\n“We have an animal like this,” says Riley, pointing. “We call it a whale. When an Earth whale dies, the body falls to the bottom of the ocean. This helps other animals. We call this whalefall.” The topic of whalefall is not at the top of the priority list, but sometimes the most interesting facts come up as their conversations meander.\n“Here, too,” says Yyfal. She rumbles her word for whalefall. Riley adds it to the lexicon. Words added today: five hundred and one.\n“I want to understand,” says Yyfal.\n“Whalefall isn’t what I study,” says Riley. “Natalia would know more about it.”\n“Not whalefall,” says Yyfal. “You.”\n“I want to understand you, too,” says Riley. And she does. More than anything.\n“Natalia is an important node?” asks Yyfal.\nNo matter how Riley tries, Yyfal will not refer to the other crew members as anything other than nodes. “She’s important,” says Riley.\n“You have taken from the planet to understand me. Ferns. Butterflies. My substance. Can I take to understand you?” Yyfal asks.\n“I can give you whatever you need,” says Riley. She offers food, lab books, clothing. The many artifacts of their existence.\n“I must ripple,” says Yyfal.\nRiley still doesn’t understand rippling. Whenever they try to define words related to it, Riley gets lost.\n“I enjoyed talking about whalefall,” says Riley.\n“Yes,” says Yyfal. “Also.”\nForty Days and Four Hours After\nYyfal cannot take the Natalia node. That node is too important to Riley. When the Jason node comes out to collect ferns, she wraps him softly in limbs made of her gentlest substance.\n“Do you need soil too? And water?” she asks, but the Jason node only makes a loud, bleating noise that she has never heard before, one she cannot translate.\nForty Days and Thirteen Hours After\nRiley knows something is wrong before she comes into the clearing with the buried nectarine pit. A subsurface tremble runs under her feet, so soft she isn’t sure if it’s there at all.\nIn the clearing, Jason is sprawled in a cage made from Yyfal’s body, barely breathing. His legs are caked in dirt. His shirt is ripped down the middle, revealing a gash across his chest. His hair is drenched. When he sees Riley, he tries to call out, but the sound of his voice is lost before it reaches her.\nRiley runs to him, pushing her hands through the folds of his cage.\n“Are you okay?” Riley asks, even though it’s clear he’s not.\nJason gasps, unable to answer.\n“What did you do?” Riley asks Yyfal, terrified and unable to convey her terror. She does not have the words for anger, for sadness. “No,” she says, again and again. Then, the word she has used so often. “Why?”\n“I wanted to understand,” says Yyfal.\n“You do not understand.” Riley feels for Jason’s pulse, easing her fingers against his neck.\n“I asked for another node,” says Yyfal. “I asked many times.”\n“Give him back.” Riley is worried that Yyfal won’t, but the stone shifts and untangles until Jason lies against soft ferns, until Yyfal disappears into the surface of the planet.\nRiley messages Natalia, who rushes from the spaceship, her lab coat covered in the purple mist of butterflies. They apply nano-patches to Jason’s chest and limbs. Gently, they lift him onto a plexi-stretcher and carry him away.\nForty Days and Fourteen Hours After\nYyfal surges against the ocean, crashing down like a wave. Water coats the crevasses of her body. Salt sticks to the inner coating of her primary substances. She senses every instance of whalefall against the ocean floor. In the water, she feels the living whales brush against her, but they do not notice her. They have never noticed her. It is the same with the butterflies. The same with the grass minnows and the flowering lizards. She has never been able to communicate with the great thinking structure that must connect the whale nodes to each other. When the grass minnows chirp, all those nodes sounding at once, she has never been able to join their song. So much movement and life surround her, yet she has been so lonely.\nWhat right does Riley have to be upset? Yyfal had permission to take what she needed. Riley waited 32,009 seconds before retrieving the “Jason” node, although she must have instantly felt the loss of him, plucked from her matrix. If Riley had missed that node, why did she not come sooner?\nThe force of Yyfal’s anger contaminates her thoughts. She ripples several times against the salty water before she reaches a quorum.\nShe has not taught Riley the words for despair, or obstinance, or foolishness. They have not discussed the concepts of curiosity, hope, or faith.\nThe sky darkens and fills with stars. It is so much easier to define a star, with its physicality. How can she expect Riley to understand the word for trust when there is nothing in the physical world that Yyfal can point to?\nThey do not have the words to apologize. They do not have enough words at all.\nForty Days and Sixteen Hours After\n“She tried to bury me,” says Jason. He sits in the medical compartment, shivering in fresh clothes. Sticky residue from the nano-patches coats his body, smelling like disinfectant. “She tried to drown me.”\n“I don’t think she meant to hurt you,” says Riley. Her stomach pulls in on itself, until it feels like it’s the size of a nectarine pit. How can she truly know what Yyfal meant to do?\n“It doesn’t matter. She almost killed me,” says Jason. His mouth sets in a grim line. Anger burns through him, replacing his fear. “We are leaving this planet. Now.”\n“We don’t understand what’s going on yet,” says Riley.\nNatalia looks at Riley with pity, and this is worse than Jason’s anger. “You know the protocols,” says Natalia. “This was clearly an act of aggression.”\n“Let me talk to her,” says Riley.\nJason nods, but it’s obvious that he won’t change his mind.\n“If you aren’t back in an hour, I’ll come find you,” says Natalia. The implication is clear. Riley might need to be found, if Yyfal snatches her too.\nThey let her go.\nHer vocabulary is insufficient. Her lexicon not nearly complete. Riley pushes aside these thoughts. She doesn’t have time for despair, only the work ahead, of communicating.\nForty-one Days and Seventeen Hours After\nSoft ferns brush against Riley’s arms as she runs through the clearing to the dark earth where the nectarine pit is buried. The sun cuts cool against her skin. Words jumble in her mind, rearrange themselves, and fall. She doesn’t know what she will say to Yyfal, and in that gap between words and meaning there is only a longing. Riley starts to doubt that words have any meaning at all. How can two people come to a precise definition of anything? How can one syllable hold within itself a complexity of concepts? In the place where no words exist, there is only silence, and perhaps this is a truer communication than any sound.\nAs Yyfal rumbles and shifts and comes up beside her, Riley tells herself she is not afraid, but she cannot control the rapid beating of her heart.\n“I don’t understand,” says Riley.\n“You think it was not good,” says Yyfal. “You said to take, but now to take is bad.”\n“He is a human. Like me.” Riley pulls up a handful of ferns, ripping the fronds off one by one. “You should not have taken him.”\n“But you are taking ferns,” says Yyfal. She points with her human construction at Riley’s hands. “You are destroying.”\n“The ferns aren’t sentient,” says Riley, before realizing they have not defined the word “sentient.” She tries again. “The ferns don’t have words.” But this isn’t right at all. Silence can hold its own sentience. What Riley really wants to say is that the ferns cannot think.\n“The ferns are of me,” says Yyfal. “My body-home. And the Jason node is of you.”\n“Jason is not part of me,” says Riley. “We are separate.”\n“I do not understand,” says Yyfal. “He is your node. He is of you.”\n“Did you mean to harm him?” asks Riley. But she realizes she has not defined harm for Yyfal. Riley doesn’t have time to wander down a maze of definitions. “Whalefall?” she asks. It’s the closest she can come in meaning to death.\n“Only to understand,” says Yyfal.\n“We have to leave,” says Riley. She knows, back at the spaceship, Jason will be drafting his report, marking Ekara C as hostile to warn other explorers. Natalia will be running down the takeoff checklists.\n“Going?” asks Yyfal. Her body trembles and reforms. She is, for a moment, the shape of a whale, then a spaceship, then a form that has no name. Yyfal’s body slowly melts into the dirt, but she is all around Riley. For one moment, Riley understands that Yyfal is everywhere on this planet.\n“Should I give you back the Orb?” asks Riley.\n“Keep,” says Yyfal.\nForty-one Days and Twenty-three Hours After\nYyfal’s brain node nestles in the terrarium, seeing and hearing everything, unable to speak.\nThe brain node is no longer afraid. Her thoughts are limited by her separateness, yet clear in a way they never were when she was connected to the whole. Instead of having a crisis of identity, the node decides she is both Yyfal and not Yyfal.\nMore than anything, the node wants to explore.\nForty-two Days and Two Hours After\nAs Ekara C becomes a distant dot the size of a nectarine pit in the viewscreen, Riley thinks of the planet’s silence. An echo works its way through her chest. She has failed.\nWhat did Yyfal want from her? Riley has only her intuition. She thinks of Yyfal emerging all around her. She thinks of the many ways the universe has produced sentience.\nThe Orb sits quietly in the terrarium.\nRiley speaks to the Orb in the rumbling of Yyfal’s language. “Stars,” she says. She does not know if what she’s doing is right. It is only some innate quality of curiosity and an impossible hope that causes her to speak. “We are going.”\nThree Years After\nRiley has modified the terrarium, placing it on a set of wheels like a rover. The Orb comes with her on all of her missions. Together, they have seen the ocean cliffs of Otobol E, where sea stars swim below, and the dark, soft silence of the moons of Jupiter. They have slipped through the flower-strewn deserts and sand sculptures of Ultmi B, which stretch upward for kilometers, so lacelike it seems they should surely fall in the wind. They have heard the singing of the crabs of the Small Magellanic Cloud, and the close, quiet echoes of the sentient caves of Outer Tul.\nRiley speaks to the Orb in Yyfal’s language and her own, even though the Orb cannot respond. If there is one thing Riley has learned in her travels, it is that there are many different ways of thinking and communicating. Silence does not indicate a lack of awareness. So many of the sentient species of the universe do not speak.\nShe thinks often of Yyfal and of the words she wishes they both knew how to say. She is not sure she is doing the right thing, taking the Orb with her on her missions. When she remembers Yyfal, Riley most often thinks of those moments in the rain, where they spent so long not speaking at all.\nFour Years After\nThey stop at Otobol E for five months so that Natalia can study the luminescent crickets that bury themselves in the cobbled sand. The ship is much quieter without Jason (who they dropped off on Jupiter years ago), and that suits everyone just fine.\nRiley and the Orb spend hours watching ocean waves brush tumultuous against the shore while Natalia searches for crickets.\nFive Years After\nThe node lives a quiet existence. She observes with wonder. When alone, she thinks thoughts of great philosophical significance, so she is never bored.\nThe universe is vaster than the node had thought possible. With joy, she explores the stars and planets, the great variety of life contained within. She is hardly ever homesick.\nRiley is simultaneously a node-of-kinship (Riley would probably use the term “friend”) and another avenue of exploration. Through the years, the node comes to learn Riley’s language and gains an understanding of the physicality of her mind, her separateness from others. They are alike in so many ways.\nThe node feels that when she becomes part of Yyfal again, absorbed into the whole, this information will be of use.\nEight Years, Ten Days, and Three Minutes After\nUsing her meticulous records and maps, Riley is able to land her spaceship in the same clearing on Ekara C where she first met Yyfal. She ignores the warnings that appear in her viewscreen chanting, “Hostile planet.”\nShe emerges with the Orb in tow, as they have done so many times before.\nRiley is scared she has not done the right thing. She doesn’t know if she was supposed to return with the Orb, but she is determined to communicate with Yyfal. This time, she will not leave before they come to understand each other.\nA nectarine tree stands in the clearing, leaves twisting gently in the wind. Fruit hangs from the branches like small, contained worlds. Riley touches a branch, the bark rough against her skin.\n“This should be impossible,” she says to the Orb, her voice breaking. “How could anything so alien to this planet have grown here?”\nButterflies glide past on tessellated wings, stirring a metallic smell in the wind. Ferns brush against her ankles. The sky stretches wide above.\nIn the three seconds before Yyfal appears, Riley cups a nectarine in her hand, staring in wonder.", "source": "https://clarkesworldmagazine.com/goder_04_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Expression of Silence by Beth Goder"}