{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Sandra McDonald", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "AVXVH2YQKAorco5xpjfNJt1UtJ4=", "id": null, "license": null, "comments": "", "raw_text": "3400 words, short story  Beach Blanket Spaceship  Bells ring, the bright sweet sound of freedom, the fantastic summer upon us, and we burst out of the high school with a rousing rendition of the song “Endless Waves” from the classic 1964 movie “Life’s a Beach.” We pile into our convoy of jalopies and woody wagons, the guys bare-chested or wearing Hawaiian shirts, the gals in hot pants and bikini tops, and roll down the road to the golden coast with Danny leading the way. Danny, with his dashing good looks and honey voice, always leads the way. Riding shotgun in Danny’s yellow jeep is Colonel Frank Merullo, United States Air Force. He’s wearing his full NASA spacesuit, including boots, gloves and a closed helmet with reflective shielding. He doesn’t sing along with the gang.  Violet Blue adjusts her fur-trimmed bikini and drapes her arms around his neck. “Let go and hang loose, Pops! The fun’s just beginning.”  Her boyfriend Skipper slaps Merullo on the back. “He’ll be fine once he catches his first wave.”  Danny throws Merullo a dazzling smile, but he’s too busy belting out the chorus to say anything.  The Southern California cliffs give way to pristine beach and the limitless blue Pacific. We dump our bags at the beach house and carry our boards over the dunes. The gals claim their territory and break out the baby oil. Most of the guys paddle toward the swells, searching for the perfect wave. Above Colonel Merullo’s head, five seagulls whirl and twirl and call out to each other.  “Do you think he’ll come around?” Bonnie asks Danny from their blanket at the center of the action. Bonnie is lovely as always, her hair fixed in a perfect flip and her creamy complexion untouched by the sun. Everyone knows she and Danny will soon marry and settle down to a blissful adult life in the prosperous suburbs. She stares at Merullo, her lips turned in a frown.  “Give the man some time.” Danny gives her a chaste kiss, grabs his board, and jogs to Merullo. “Come on, Daddy-O! Surf’s up!”  Merullo opens his helmet faceplate. He is a middle-aged man with a pasty complexion and reddened cheeks. He says, “This isn’t right. I didn’t authorize this Vee-Reel.”  Danny pats his shoulder. “Whatever that is, you’re hanging with us now.”  “Is Dr. Naguchi here? Lieutenant Jenny?” Merullo scans the shoreline. “If this is the crew’s idea of a joke—”  “Couldn’t say,” Danny replies. He sprints on down to the water and throws his lean, smooth body into the rolling Pacific. Out at the lineup, Skipper and the others bob in place and wait for the water to rise.  Merullo says, “Computer, exit program,” but nothing happens. He tries again. The beach remains firmly in place. The ship’s inflight entertainment system is obviously malfunctioning, but the failsafe will engage in sixty minutes. Until then, he’ll have to put up with the surf and sand and silly teenage antics. Lieutenant Jenny will be amused at this virtual misadventure.  The weather is always fine at this beach. Beneath the radiant sun, every blanket is shared by a handsome guy and his pretty girl. Lonely singles don’t fit the script. The sandscape is painted with surfers, weightlifters, recording artists, loony biker gangs, foreign spies, unscrupulous businessmen and stray comic icons of yore, like Buster Keaton.  “None of this is real,” Merullo tells Bonnie at the counter of the snack shack. He removes his helmet entirely, revealing short brown hair that has gone thin at the dome. “A computer is beaming ultrasonic pulses at my brain, creating this illusion. You’re all data constructs based on old movies pulled out of a database.”  “Really?” Bonnie lifts a tray of hot dogs and French fries. Her bright pink lipstick perfectly matches her sandals and headband. “Are you sure about that?”  Over in the volleyball pit, guest star Dee Ann Lawrence is belting out “Don’t Be Fooled by Love,” a song that once made the Billboard top twenty. She’s singing it to Lunkhead, who is the tallest, dumbest of us all. He has a crush on a girl who claims to be a mermaid. No one else has met this creature from the sea.  Merullo says, “Your character was played by Becky Clark, America’s sweetheart. Danny was played by Tommy Suede, a teenage heartthrob. They made a dozen of these movies, but they died a long time ago.”  Violet offers Merullo her soda. “How about something cold to drink? The sun’s real hot today.”  “That drink’s not real, either.” Merullo checks the chronometer built into the sleeve of his spacesuit. “In a minute or so, these pulses will stop and you’ll cease to exist. I’ll wake up in the real world, on my ship. In a flight couch.”  The five seagulls squawk and cry from atop the roof of the snack shack. Out in the water, Danny and Skipper have caught an eight-footer and are riding it in with their arms outstretched for balance. Their smiles are as wide as the horizon.  “You’re still here,” Violet says to Merullo.  Bonnie shifts her tray of food. “Danny’s lunch is getting cold.”  Merullo doesn’t move out of her way. “Vee-Reel time is sometimes off from ship’s time by a minute or two. It won’t be long now.”  Violet sips at her soda. Skipper and Danny wade ashore and slap each other on the back. Danny looks for Bonnie, but Skipper has eyes only for Danny. Admiration shines in his expression, as well as something deeper.  Merullo taps the chronometer. “Any second now.”  “Good luck with that,” Bonnie says. She and Violet return to their blankets and boyfriends. Danny wraps his arms around Bonnie’s waist and tugs her close.  “How’s the colonel doing?” he asks.  “Still clinging,” Bonnie says.  Skipper tries to hug Violet, but she squirms free and reaches for her transistor radio. Skipper says, “He’ll catch on soon enough. Right, Danny?”  “Sure thing.” Danny pops a non-existent French fry into his mouth. “Give him awhile. The world is a hard habit to break.”  Even when the sun sets, the beach party rolls on. The guys shrug into jackets and the gals slip into cocktail dresses. We all gather at Sammy’s Pavilion to sip non-alcoholic drinks at tables set around the dance floor. The evening’s entertainment will consist of a rock’n’roll band or lip-synching actresses or Little Stevie Wonder. Danny might get up and croon a love ballad. Bonnie might join him in a sweet duet. Afterward some of us will walk the moonlit beach or cuddle in secluded coves. Up in the beach house, there will be pillow fights and risqué sleepwear and the trading of double entendres, but nowhere will there be any sex. It doesn’t fit our image.  Skipper has had a romantic misunderstanding with Violet. Lunkhead’s mermaid girlfriend has flippered her way back into the sea, leaving him bereft. The two of them meander down to the high tide mark and build a fire. Merullo sits with them.  “I’m sure my crew is working to get me out of here,” he says. “They’ll have realized something is wrong by now.”  Lunkhead leans back and crosses his hairy ankles. “Where’s this spaceship of yours going, anyway?”  “To Triton. It’s a moon of Neptune. But even with the new propulsion drive, it’s several years away.” Merullo wedges coconuts into the sand to illustrate the distance between the planets. His bulky spacesuit makes the task difficult. “We’re in cold sleep most of the trip, but during the first month and last months of the mission we’re awake and can use the ship’s entertainment options. Lieutenant Sanchez built a Vee-Reel around Busby Berkeley musicals. Lieutenant Umbo’s is based on World War II movies. Dr. Naguchi likes anime. Lieutenant Jenny created this one.”  Lunkhead has a goofy grin on his face. “Lieutenant Jenny. Sounds like a dreamboat.”  Merullo’s expression is troubled. “Mark Jenny. He’s my co-pilot.”  “Ohhhhhh.” Lunkhead’s grin disappears. “Nevermind.”  Skipper plucks at the strings of his guitar. Melancholy notes float toward the stars. “What’s your Vee-Reel, Pops?”  “I don’t remember,” Merullo says. It bothers him, that. He should know. “I don’t think I usually play them.”  Lunkhead asks, “But you like this one, don’t you? Sun and sand. Letting go and hanging loose. What could be better?”  “Sharing it with the one you love.” Skipper strums a soft chord. His eyes are dark and unreadable. “So why go blasting off into outer space, anyway?”  Merullo brightens a little. “Eighteen months ago, a comet smacked into Triton. Soon afterward, Voyager 20 did a flyby and detected a strong but irregular radio signal in the Leviathan Patera. Our mission was originally geared to catalog prospects for expanding human colonization beyond Mars, but now we’re also going to investigate the possibility of extraterrestrial intelligence.”  Lunkhead gapes. “Aliens? Little green men with antennas sticking out of their heads?”  “Hey, everyone,” Bonnie says, as she and Danny emerge from the shadows and approach the group. Her lipstick is slightly smeared, and her red chiffon scarf flutters in the breeze.  Danny crouches by the fire to warm his hands. “What’s shaking?”  Skipper’s gaze slips right past Bonnie to focus on Danny. “We’re all some kind of computer program on a spaceship hurtling through space. Colonel Merullo here is the only one who’s really alive. And there might be aliens on Mars.”  “Neptune,” Lunkhead says.  “Triton,” Merullo corrects.  “Sounds wild,” Danny says, but something in his voice is just a little too casual, and Merullo wonders if he knows more than he’s letting on.  But that’s ridiculous, he thinks. Vee-Reel characters have no hidden agendas. They ask him if he wants to come sleep in the beach house for the night, but Merullo declines. The program will surely terminate by then. He leans back in the sand, trying not to worry about his spaceship, his crew, their mission. His dreams are full of stars and blackness. That too is ridiculous. Real people stuck in Vee-Reels do not dream.  Surf’s up. Five seagulls skim the receding tide, hungry for breakfast.  “Something’s wrong.” Merullo stands over Violet’s blanket, his voice tight with worry. “I have to get out of this. I’m the commander of this mission, my crew need me—”  Violet holds up a bottle of baby oil. “Will you put some of this on my back?”  He tries, but his gloved hands are too clumsy.  She sighs. “Come on, Pops. It’s time to ditch these space duds.”  Violet brings him up to the beach house, which has already emptied out for the morning. She picks through a pile of wrinkled clothes and pulls out some his size. In the bathroom, Merullo eases out of the spacesuit and scratches at his newly exposed, pasty-white skin. The denim shorts are too baggy. The T-shirt smells like the sweat and musk of other men. He takes a deep breath.  From the doorframe, Violet says, “You don’t like girls much, do you?”  Merullo flushes. “I don’t know what you mean.”  She gives him a humorless smile. “Sure you do. Skipper’s that way, too. He keeps promising to change. But I don’t think it’s something you can change, like your haircut or the way you dress. Do you?”  He busies himself by hanging the spacesuit up on a rope that stretches over the bathtub. “I wouldn’t know. Things like that aren’t allowed in the Space Corps.”  Violet rolls her eyes. “You’re not in the Space Corps right now. You’re in a Vee-Reel. Or so you say.”  She brings him back to her blanket. Merullo tries not to stare at the guys in the volleyball pit as they leap in the air or dive for the ball. Violet watches the strong, lithe bodies with her eyes shaded by sunglasses. He thinks that he could tell her about himself, that Vee-Reels are often the repositories of hopes and secrets, but this isn’t his program. It belongs to Mark Jenny.  Lunkhead bops on by. “Kowabunga, Colonel! Come ride the curl!”  “You should go,” Violet says. “Clears your mind.”  Merullo wades into the water, but it is cold and deep and he prefers dry land.  Later, a straight-laced reporter drops in to conduct an in-depth report about The Mind of Today’s Teenager. A rich heiress falls in love with Danny and tries to whisk him away to Greece on her yacht. A drag race goes awry, a bikini contest turns ugly, and Lunkhead trades places with a British rock star who could be his long-lost twin. Life on the beach is wacky that way. The Vee-Reel refuses to disengage.  “Even if the crew can’t turn off the system, all they have to do is pull the power on the unit,” Merullo tells Danny. He scratches at his sunburned chest. He took off the T-shirt somewhere but can’t remember where. “Mark knows the ship’s specs backward and forward. But what if he’s not awake? What if all of us are stuck in the entertainment system, or something wrong with the ship itself—”  “You know what you need, Pops?” Danny drops his board into the surf. “Let go and hang loose. Learn to surf. I’m just the fellow to teach you.”  Merullo’s fists clench. “Maybe this Vee-Reel isn’t what it appears to be. Maybe none of you are constructs. That radio signal from Triton—”  Danny snaps his fingers and juts out his hip and launches into “Dig Those Waves,” another teen anthem—fast, breezy, easy to shake your hips to—with Bonnie singing backup and the rest of us pitching in on the chorus, and an unseen band providing the accompaniment. Everyone on the beach is bopping and twirling and shimmying, and for two perfect minutes all the world is young and in love, and the endless summer reaches the pinnacle of perfect happiness.  While we’re singing, Merullo walks away.  Bonnie and Danny quarrel. She wants an engagement ring. He thinks that they have their whole lives ahead of them, so what’s the rush? Merullo overhears part of it. They are so young, he wants to say. So naïve. He wonders if he’s ever been married, if he’s ever been in love. Life outside the Vee-Reel is slip, slip, slipping away. Later he finds Bonnie sitting alone on the beach, building a lopsided sandcastle.  “I was never very good at this,” she admits. “The tower always falls over, or the moat caves in.”  Merullo sits and starts helping her. The sand is warm and gritty, and gets under his fingernails. “I heard you fighting with Danny.”  “He thinks we have forever. I think forever’s over before you know it.”  Out in the water, five dolphins breach the surface and quickly curve under again. Danny and the others are out bobbing in the lineup, but they are indistinct, fuzzy. The sunlight is very bright. Merullo thinks of Mark Jenny, and then dumps more sand into the pail.  “When you wake up and leave the program, could you take me with you?” Bonnie’s expression is suddenly shy. “I think seeing a real-live spaceship would be groovy. There’s an astronaut club at school, but they don’t let girls join.”  “This is where you belong, Bonnie.”  “This isn’t a place.” Bonnie lifts her head and looks out toward the ocean. “It’s just a stopover on the way to something bigger. Don’t those movies of yours have endings?”  Indeed they do. First there will be climax of sorts. It might be a zany motorcycle chase, with Danny and chums capturing the bad guys who never posed much of a threat anyway. Or maybe a skydiving sequence, or dance marathon, or some other test of young adulthood. Then there will be a luau full of singing and dancing, one last hurrah of summer, before the credits roll.  “So maybe your ending is coming.” Bonnie rests her soft hand on his. “Or maybe this whole thing will just start over. Do you know what’s going to happen?”  Merullo squeezes her hand. “I don’t know much of anything, anymore.”  Rival surfers from another beach challenge Danny to a surf contest. Merullo watches the action from the high rocks near the water. Some of the contestants look like his crew—a Japanese man doing a handstand on a rushing board, a dark-skinned woman on the shoulders of a man Merullo’s age. Some others look like his family, or friends long gone. Their names are lost to him. The outside world is so far away now that he might never get it back. He needs something to hold on to.  “My suit,” he says to Violet, who has come to stand beside him. “It’s the only proof I have.”  “Proof of what?” Violet asks.  He’s already sprinted past her, heading for the beach house. When he gets there, the bathroom clothesline holds only wet underwear and damp socks.  “Where is it?” Merullo demands.  “I don’t know,” Violet says.  Lunkhead comes out of the kitchen, munching on a bag of potato chips. “Lose something?”  Merullo overturns mattresses and empties duffel bags. He digs through closets and cabinets. Over at Sammy’s Pavilion, where tiki torches flicker under the sunset sky, Bonnie and Danny are dancing cheek to cheek in the middle of the crowd. Becky Clark and Tommy Suede eventually grew up, grew old and died, but these two will be young forever.  Merullo grabs Danny’s arm. “Where is it?”  “Where’s what, Pops?” Danny asks.  “My goddamn spacesuit! What have you done with it?”  Nobody uses profanity on the beach. The music dies off and the dancing stops.  Merullo turns in a circle, challenging us all with outstretched hands. “Who are you? You brought me here, you trapped me, you won’t let me leave—”  His voice cracks and fades. We shake our heads.  Danny steps toward him. “You can’t leave because you won’t let yourself. Because you haven’t finished what you came here to do.”  Bonnie’s voice is just as compassionate and sympathetic as Danny’s. “Look at the water, Colonel.”  Five seagulls lay at the border of water and land, the wind ruffling the stiff feathers of their corpses.  “No.” Merullo’s legs fold under him and he lands on his knees. His eyes are wet. “Don’t you understand? I’m in charge. I have a crew and ship to keep safe. We’re on our way to Triton . . . ”  The seagulls fade into the sand. Where guys and gals once stood, there are only faint indentations in the sand. Sammy’s Pavilion is gone, and empty beach blankets billow toward a sky that has gone silver-white. But the rolling blue ocean remain constant, and Our hand is warm on Merullo’s shoulder.  “Let go and hang loose,” we tell him. “Surf’s up.”  “There was an alien radio message,” Merullo insists.  “No. There was a malfunction on your Voyager craft. It detected and reported a distorted version of its own transmissions. That was all.”  In the lineup, the water is flat and calm. We help him sit up and say, “When the wave comes, lay down and start paddling toward the beach as hard as you can while leaning forward. If you lean back, that’ll just slow you down. But also keep your chest raised.”  Merullo’s fists tighten. “What happened to my ship?”  “An accident. It could no longer support you.” We ruffle his thinning hair. “It wasn’t your fault.”  The water rises. We help Merullo to paddle toward the shore, pull himself upright, and stand low with his gaze held high. There’s no blue screen backdrop or Vee-Reel special effect for this ride. Physics and balance rule the world. We’re riding the perfect wave across the cosmos of time and memory, through the heart of a crippled spaceship and the five corpses secreted aboard, and toward the speck of beach that has always been nothing more than a temporary accumulation of sand and sorrow. The sun burns away all regret. The salty water lifts us up and makes us sing.  Merullo sees Mark Jenny standing on the shore.  “I’ve been waiting for you,” Mark says, as Merullo emerges from the surf. Mark’s suntanned face crinkles with affection, but there is concern there as well. “Where have you been?”  “Letting go. Hanging loose.” Merullo has a wild grin on his face. He cups Mark’s face with his strong, wet hands. “I’m sorry I never told you.”  Mark smiles. “You don’t think I knew?”  The story, as with every beach movie, ends with a kiss.  Sandra McDonald is a former military officer, recovering Hollywood assistant, and perennially patient college instructor who writes across the genres of romance, history, fantasy, science fiction, GLBTQA, and young adult fiction. Her first collection of stories, Diana Comet and Other Improbable Stories, won a Lambda Literary Award for transgender fiction. It was also a Booklist Editor's Choice, ALA Over the Rainbow book, and Rainbow award winner. Her short fiction has been published in several dozen magazines and anthologies, including the Year's Best YA, Year's Best Science Fiction, Year's Best Science Fiction and Fantasy, Tiptree Anthology, Asimov's Science Fiction, the Magazine of Science Fiction and Fantasy, Clarkesworld, Lightspeed, Strange Horizons, and more. She has several novels in print, including the award-winning Fisher Key adventures and asexual-gay thriller City of Soldiers. She currently resides in Florida.", "text": "3400 words, short story\nBeach Blanket Spaceship\nBells ring, the bright sweet sound of freedom, the fantastic summer upon us, and we burst out of the high school with a rousing rendition of the song “Endless Waves” from the classic 1964 movie “Life’s a Beach.” We pile into our convoy of jalopies and woody wagons, the guys bare-chested or wearing Hawaiian shirts, the gals in hot pants and bikini tops, and roll down the road to the golden coast with Danny leading the way. Danny, with his dashing good looks and honey voice, always leads the way. Riding shotgun in Danny’s yellow jeep is Colonel Frank Merullo, United States Air Force. He’s wearing his full NASA spacesuit, including boots, gloves and a closed helmet with reflective shielding. He doesn’t sing along with the gang.\nViolet Blue adjusts her fur-trimmed bikini and drapes her arms around his neck. “Let go and hang loose, Pops! The fun’s just beginning.”\nHer boyfriend Skipper slaps Merullo on the back. “He’ll be fine once he catches his first wave.”\nDanny throws Merullo a dazzling smile, but he’s too busy belting out the chorus to say anything.\nThe Southern California cliffs give way to pristine beach and the limitless blue Pacific. We dump our bags at the beach house and carry our boards over the dunes. The gals claim their territory and break out the baby oil. Most of the guys paddle toward the swells, searching for the perfect wave. Above Colonel Merullo’s head, five seagulls whirl and twirl and call out to each other.\n“Do you think he’ll come around?” Bonnie asks Danny from their blanket at the center of the action. Bonnie is lovely as always, her hair fixed in a perfect flip and her creamy complexion untouched by the sun. Everyone knows she and Danny will soon marry and settle down to a blissful adult life in the prosperous suburbs. She stares at Merullo, her lips turned in a frown.\n“Give the man some time.” Danny gives her a chaste kiss, grabs his board, and jogs to Merullo. “Come on, Daddy-O! Surf’s up!”\nMerullo opens his helmet faceplate. He is a middle-aged man with a pasty complexion and reddened cheeks. He says, “This isn’t right. I didn’t authorize this Vee-Reel.”\nDanny pats his shoulder. “Whatever that is, you’re hanging with us now.”\n“Is Dr. Naguchi here? Lieutenant Jenny?” Merullo scans the shoreline. “If this is the crew’s idea of a joke—”\n“Couldn’t say,” Danny replies. He sprints on down to the water and throws his lean, smooth body into the rolling Pacific. Out at the lineup, Skipper and the others bob in place and wait for the water to rise.\nMerullo says, “Computer, exit program,” but nothing happens. He tries again. The beach remains firmly in place. The ship’s inflight entertainment system is obviously malfunctioning, but the failsafe will engage in sixty minutes. Until then, he’ll have to put up with the surf and sand and silly teenage antics. Lieutenant Jenny will be amused at this virtual misadventure.\nThe weather is always fine at this beach. Beneath the radiant sun, every blanket is shared by a handsome guy and his pretty girl. Lonely singles don’t fit the script. The sandscape is painted with surfers, weightlifters, recording artists, loony biker gangs, foreign spies, unscrupulous businessmen and stray comic icons of yore, like Buster Keaton.\n“None of this is real,” Merullo tells Bonnie at the counter of the snack shack. He removes his helmet entirely, revealing short brown hair that has gone thin at the dome. “A computer is beaming ultrasonic pulses at my brain, creating this illusion. You’re all data constructs based on old movies pulled out of a database.”\n“Really?” Bonnie lifts a tray of hot dogs and French fries. Her bright pink lipstick perfectly matches her sandals and headband. “Are you sure about that?”\nOver in the volleyball pit, guest star Dee Ann Lawrence is belting out “Don’t Be Fooled by Love,” a song that once made the Billboard top twenty. She’s singing it to Lunkhead, who is the tallest, dumbest of us all. He has a crush on a girl who claims to be a mermaid. No one else has met this creature from the sea.\nMerullo says, “Your character was played by Becky Clark, America’s sweetheart. Danny was played by Tommy Suede, a teenage heartthrob. They made a dozen of these movies, but they died a long time ago.”\nViolet offers Merullo her soda. “How about something cold to drink? The sun’s real hot today.”\n“That drink’s not real, either.” Merullo checks the chronometer built into the sleeve of his spacesuit. “In a minute or so, these pulses will stop and you’ll cease to exist. I’ll wake up in the real world, on my ship. In a flight couch.”\nThe five seagulls squawk and cry from atop the roof of the snack shack. Out in the water, Danny and Skipper have caught an eight-footer and are riding it in with their arms outstretched for balance. Their smiles are as wide as the horizon.\n“You’re still here,” Violet says to Merullo.\nBonnie shifts her tray of food. “Danny’s lunch is getting cold.”\nMerullo doesn’t move out of her way. “Vee-Reel time is sometimes off from ship’s time by a minute or two. It won’t be long now.”\nViolet sips at her soda. Skipper and Danny wade ashore and slap each other on the back. Danny looks for Bonnie, but Skipper has eyes only for Danny. Admiration shines in his expression, as well as something deeper.\nMerullo taps the chronometer. “Any second now.”\n“Good luck with that,” Bonnie says. She and Violet return to their blankets and boyfriends. Danny wraps his arms around Bonnie’s waist and tugs her close.\n“How’s the colonel doing?” he asks.\n“Still clinging,” Bonnie says.\nSkipper tries to hug Violet, but she squirms free and reaches for her transistor radio. Skipper says, “He’ll catch on soon enough. Right, Danny?”\n“Sure thing.” Danny pops a non-existent French fry into his mouth. “Give him awhile. The world is a hard habit to break.”\nEven when the sun sets, the beach party rolls on. The guys shrug into jackets and the gals slip into cocktail dresses. We all gather at Sammy’s Pavilion to sip non-alcoholic drinks at tables set around the dance floor. The evening’s entertainment will consist of a rock’n’roll band or lip-synching actresses or Little Stevie Wonder. Danny might get up and croon a love ballad. Bonnie might join him in a sweet duet. Afterward some of us will walk the moonlit beach or cuddle in secluded coves. Up in the beach house, there will be pillow fights and risqué sleepwear and the trading of double entendres, but nowhere will there be any sex. It doesn’t fit our image.\nSkipper has had a romantic misunderstanding with Violet. Lunkhead’s mermaid girlfriend has flippered her way back into the sea, leaving him bereft. The two of them meander down to the high tide mark and build a fire. Merullo sits with them.\n“I’m sure my crew is working to get me out of here,” he says. “They’ll have realized something is wrong by now.”\nLunkhead leans back and crosses his hairy ankles. “Where’s this spaceship of yours going, anyway?”\n“To Triton. It’s a moon of Neptune. But even with the new propulsion drive, it’s several years away.” Merullo wedges coconuts into the sand to illustrate the distance between the planets. His bulky spacesuit makes the task difficult. “We’re in cold sleep most of the trip, but during the first month and last months of the mission we’re awake and can use the ship’s entertainment options. Lieutenant Sanchez built a Vee-Reel around Busby Berkeley musicals. Lieutenant Umbo’s is based on World War II movies. Dr. Naguchi likes anime. Lieutenant Jenny created this one.”\nLunkhead has a goofy grin on his face. “Lieutenant Jenny. Sounds like a dreamboat.”\nMerullo’s expression is troubled. “Mark Jenny. He’s my co-pilot.”\n“Ohhhhhh.” Lunkhead’s grin disappears. “Nevermind.”\nSkipper plucks at the strings of his guitar. Melancholy notes float toward the stars. “What’s your Vee-Reel, Pops?”\n“I don’t remember,” Merullo says. It bothers him, that. He should know. “I don’t think I usually play them.”\nLunkhead asks, “But you like this one, don’t you? Sun and sand. Letting go and hanging loose. What could be better?”\n“Sharing it with the one you love.” Skipper strums a soft chord. His eyes are dark and unreadable. “So why go blasting off into outer space, anyway?”\nMerullo brightens a little. “Eighteen months ago, a comet smacked into Triton. Soon afterward, Voyager 20 did a flyby and detected a strong but irregular radio signal in the Leviathan Patera. Our mission was originally geared to catalog prospects for expanding human colonization beyond Mars, but now we’re also going to investigate the possibility of extraterrestrial intelligence.”\nLunkhead gapes. “Aliens? Little green men with antennas sticking out of their heads?”\n“Hey, everyone,” Bonnie says, as she and Danny emerge from the shadows and approach the group. Her lipstick is slightly smeared, and her red chiffon scarf flutters in the breeze.\nDanny crouches by the fire to warm his hands. “What’s shaking?”\nSkipper’s gaze slips right past Bonnie to focus on Danny. “We’re all some kind of computer program on a spaceship hurtling through space. Colonel Merullo here is the only one who’s really alive. And there might be aliens on Mars.”\n“Neptune,” Lunkhead says.\n“Triton,” Merullo corrects.\n“Sounds wild,” Danny says, but something in his voice is just a little too casual, and Merullo wonders if he knows more than he’s letting on.\nBut that’s ridiculous, he thinks. Vee-Reel characters have no hidden agendas. They ask him if he wants to come sleep in the beach house for the night, but Merullo declines. The program will surely terminate by then. He leans back in the sand, trying not to worry about his spaceship, his crew, their mission. His dreams are full of stars and blackness. That too is ridiculous. Real people stuck in Vee-Reels do not dream.\nSurf’s up. Five seagulls skim the receding tide, hungry for breakfast.\n“Something’s wrong.” Merullo stands over Violet’s blanket, his voice tight with worry. “I have to get out of this. I’m the commander of this mission, my crew need me—”\nViolet holds up a bottle of baby oil. “Will you put some of this on my back?”\nHe tries, but his gloved hands are too clumsy.\nShe sighs. “Come on, Pops. It’s time to ditch these space duds.”\nViolet brings him up to the beach house, which has already emptied out for the morning. She picks through a pile of wrinkled clothes and pulls out some his size. In the bathroom, Merullo eases out of the spacesuit and scratches at his newly exposed, pasty-white skin. The denim shorts are too baggy. The T-shirt smells like the sweat and musk of other men. He takes a deep breath.\nFrom the doorframe, Violet says, “You don’t like girls much, do you?”\nMerullo flushes. “I don’t know what you mean.”\nShe gives him a humorless smile. “Sure you do. Skipper’s that way, too. He keeps promising to change. But I don’t think it’s something you can change, like your haircut or the way you dress. Do you?”\nHe busies himself by hanging the spacesuit up on a rope that stretches over the bathtub. “I wouldn’t know. Things like that aren’t allowed in the Space Corps.”\nViolet rolls her eyes. “You’re not in the Space Corps right now. You’re in a Vee-Reel. Or so you say.”\nShe brings him back to her blanket. Merullo tries not to stare at the guys in the volleyball pit as they leap in the air or dive for the ball. Violet watches the strong, lithe bodies with her eyes shaded by sunglasses. He thinks that he could tell her about himself, that Vee-Reels are often the repositories of hopes and secrets, but this isn’t his program. It belongs to Mark Jenny.\nLunkhead bops on by. “Kowabunga, Colonel! Come ride the curl!”\n“You should go,” Violet says. “Clears your mind.”\nMerullo wades into the water, but it is cold and deep and he prefers dry land.\nLater, a straight-laced reporter drops in to conduct an in-depth report about The Mind of Today’s Teenager. A rich heiress falls in love with Danny and tries to whisk him away to Greece on her yacht. A drag race goes awry, a bikini contest turns ugly, and Lunkhead trades places with a British rock star who could be his long-lost twin. Life on the beach is wacky that way. The Vee-Reel refuses to disengage.\n“Even if the crew can’t turn off the system, all they have to do is pull the power on the unit,” Merullo tells Danny. He scratches at his sunburned chest. He took off the T-shirt somewhere but can’t remember where. “Mark knows the ship’s specs backward and forward. But what if he’s not awake? What if all of us are stuck in the entertainment system, or something wrong with the ship itself—”\n“You know what you need, Pops?” Danny drops his board into the surf. “Let go and hang loose. Learn to surf. I’m just the fellow to teach you.”\nMerullo’s fists clench. “Maybe this Vee-Reel isn’t what it appears to be. Maybe none of you are constructs. That radio signal from Triton—”\nDanny snaps his fingers and juts out his hip and launches into “Dig Those Waves,” another teen anthem—fast, breezy, easy to shake your hips to—with Bonnie singing backup and the rest of us pitching in on the chorus, and an unseen band providing the accompaniment. Everyone on the beach is bopping and twirling and shimmying, and for two perfect minutes all the world is young and in love, and the endless summer reaches the pinnacle of perfect happiness.\nWhile we’re singing, Merullo walks away.\nBonnie and Danny quarrel. She wants an engagement ring. He thinks that they have their whole lives ahead of them, so what’s the rush? Merullo overhears part of it. They are so young, he wants to say. So naïve. He wonders if he’s ever been married, if he’s ever been in love. Life outside the Vee-Reel is slip, slip, slipping away. Later he finds Bonnie sitting alone on the beach, building a lopsided sandcastle.\n“I was never very good at this,” she admits. “The tower always falls over, or the moat caves in.”\nMerullo sits and starts helping her. The sand is warm and gritty, and gets under his fingernails. “I heard you fighting with Danny.”\n“He thinks we have forever. I think forever’s over before you know it.”\nOut in the water, five dolphins breach the surface and quickly curve under again. Danny and the others are out bobbing in the lineup, but they are indistinct, fuzzy. The sunlight is very bright. Merullo thinks of Mark Jenny, and then dumps more sand into the pail.\n“When you wake up and leave the program, could you take me with you?” Bonnie’s expression is suddenly shy. “I think seeing a real-live spaceship would be groovy. There’s an astronaut club at school, but they don’t let girls join.”\n“This is where you belong, Bonnie.”\n“This isn’t a place.” Bonnie lifts her head and looks out toward the ocean. “It’s just a stopover on the way to something bigger. Don’t those movies of yours have endings?”\nIndeed they do. First there will be climax of sorts. It might be a zany motorcycle chase, with Danny and chums capturing the bad guys who never posed much of a threat anyway. Or maybe a skydiving sequence, or dance marathon, or some other test of young adulthood. Then there will be a luau full of singing and dancing, one last hurrah of summer, before the credits roll.\n“So maybe your ending is coming.” Bonnie rests her soft hand on his. “Or maybe this whole thing will just start over. Do you know what’s going to happen?”\nMerullo squeezes her hand. “I don’t know much of anything, anymore.”\nRival surfers from another beach challenge Danny to a surf contest. Merullo watches the action from the high rocks near the water. Some of the contestants look like his crew—a Japanese man doing a handstand on a rushing board, a dark-skinned woman on the shoulders of a man Merullo’s age. Some others look like his family, or friends long gone. Their names are lost to him. The outside world is so far away now that he might never get it back. He needs something to hold on to.\n“My suit,” he says to Violet, who has come to stand beside him. “It’s the only proof I have.”\n“Proof of what?” Violet asks.\nHe’s already sprinted past her, heading for the beach house. When he gets there, the bathroom clothesline holds only wet underwear and damp socks.\n“Where is it?” Merullo demands.\n“I don’t know,” Violet says.\nLunkhead comes out of the kitchen, munching on a bag of potato chips. “Lose something?”\nMerullo overturns mattresses and empties duffel bags. He digs through closets and cabinets. Over at Sammy’s Pavilion, where tiki torches flicker under the sunset sky, Bonnie and Danny are dancing cheek to cheek in the middle of the crowd. Becky Clark and Tommy Suede eventually grew up, grew old and died, but these two will be young forever.\nMerullo grabs Danny’s arm. “Where is it?”\n“Where’s what, Pops?” Danny asks.\n“My goddamn spacesuit! What have you done with it?”\nNobody uses profanity on the beach. The music dies off and the dancing stops.\nMerullo turns in a circle, challenging us all with outstretched hands. “Who are you? You brought me here, you trapped me, you won’t let me leave—”\nHis voice cracks and fades. We shake our heads.\nDanny steps toward him. “You can’t leave because you won’t let yourself. Because you haven’t finished what you came here to do.”\nBonnie’s voice is just as compassionate and sympathetic as Danny’s. “Look at the water, Colonel.”\nFive seagulls lay at the border of water and land, the wind ruffling the stiff feathers of their corpses.\n“No.” Merullo’s legs fold under him and he lands on his knees. His eyes are wet. “Don’t you understand? I’m in charge. I have a crew and ship to keep safe. We’re on our way to Triton . . . ”\nThe seagulls fade into the sand. Where guys and gals once stood, there are only faint indentations in the sand. Sammy’s Pavilion is gone, and empty beach blankets billow toward a sky that has gone silver-white. But the rolling blue ocean remain constant, and Our hand is warm on Merullo’s shoulder.\n“Let go and hang loose,” we tell him. “Surf’s up.”\n“There was an alien radio message,” Merullo insists.\n“No. There was a malfunction on your Voyager craft. It detected and reported a distorted version of its own transmissions. That was all.”\nIn the lineup, the water is flat and calm. We help him sit up and say, “When the wave comes, lay down and start paddling toward the beach as hard as you can while leaning forward. If you lean back, that’ll just slow you down. But also keep your chest raised.”\nMerullo’s fists tighten. “What happened to my ship?”\n“An accident. It could no longer support you.” We ruffle his thinning hair. “It wasn’t your fault.”\nThe water rises. We help Merullo to paddle toward the shore, pull himself upright, and stand low with his gaze held high. There’s no blue screen backdrop or Vee-Reel special effect for this ride. Physics and balance rule the world. We’re riding the perfect wave across the cosmos of time and memory, through the heart of a crippled spaceship and the five corpses secreted aboard, and toward the speck of beach that has always been nothing more than a temporary accumulation of sand and sorrow. The sun burns away all regret. The salty water lifts us up and makes us sing.\nMerullo sees Mark Jenny standing on the shore.\n“I’ve been waiting for you,” Mark says, as Merullo emerges from the surf. Mark’s suntanned face crinkles with affection, but there is concern there as well. “Where have you been?”\n“Letting go. Hanging loose.” Merullo has a wild grin on his face. He cups Mark’s face with his strong, wet hands. “I’m sorry I never told you.”\nMark smiles. “You don’t think I knew?”\nThe story, as with every beach movie, ends with a kiss.\nSandra McDonald is a former military officer, recovering Hollywood assistant, and perennially patient college instructor who writes across the genres of romance, history, fantasy, science fiction, GLBTQA, and young adult fiction. Her first collection of stories, Diana Comet and Other Improbable Stories, won a Lambda Literary Award for transgender fiction. It was also a Booklist Editor's Choice, ALA Over the Rainbow book, and Rainbow award winner. Her short fiction has been published in several dozen magazines and anthologies, including the Year's Best YA, Year's Best Science Fiction, Year's Best Science Fiction and Fantasy, Tiptree Anthology, Asimov's Science Fiction, the Magazine of Science Fiction and Fantasy, Clarkesworld, Lightspeed, Strange Horizons, and more. She has several novels in print, including the award-winning Fisher Key adventures and asexual-gay thriller City of Soldiers. She currently resides in Florida.", "source": "https://clarkesworldmagazine.com/mcdonald_07_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Beach Blanket Spaceship by Sandra McDonald"}