{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "9pUw66JTJxNLKtg//Gt7flWvRVw=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Drawing the Lines around a Moving Object  Twenty years ago, it was very easy to look at something and say whether or not it was a magazine, newspaper or book. With the advent of online magazines, new print technologies and ebooks, it has become significantly more complicated. I regularly run into people who try to claim that online magazines and ebooks aren’t “real” books or magazines. As someone who publishes and enjoys both, I find that quite frustrating. Sometimes I find it annoying enough to poke the bear.  After one of the more pleasant and civil poking of the bears, Mark R. Kelly, editor of Locus Online, blogged the following:   “(Again—sorry to belabor this—where to draw the line? Is Tor.com or io9 a ’magazine’? [Tor.com ranked 3rd in the Locus Poll for ’Best Magazine’.] . . . So, is everything online a magazine? [Slate calls itself a “daily magazine on the Web.&rdquot;] Where is the line between magazine and blog and mere website? I guess I will be careful not to go there.)”  Mark’s final question is a good one and many of his sentiments are ones I’ve heard before. Let’s see if we can come up with an answer . . .   Magazine: “a periodical containing miscellaneous pieces (as articles, stories, poems) and often illustrated; also : such a periodical published online b: a similar section of a newspaper usually appearing on Sunday c: a radio or television program presenting usually several short segments on a variety of topics”  Periodical: “being published with a fixed interval between the issues or numbers”  Newspaper: “a paper that is printed and distributed usually daily or weekly and that contains news, articles of opinion, features, and advertising”  Mark didn’t ask about newspapers, but I included them because, as I pondered his question, it became apparent that, by these definitions, today’s newspapers could be considered a subset of magazines. In fact, a number of non-fiction magazines become very hard to classify as one or the other.  Mark’s other categories, blogs and websites, are methods of delivery, just like paper. For example, an online magazine is a website and can be powered by blogging software. A blog or website, however, doesn’t have to be a magazine, just like something printed on paper doesn’t have to be a book, magazine or newspaper.   Blog: “a Web site that contains an online personal journal with reflections, comments, and often hyperlinks provided by the writer”  Website: “a group of World Wide Web pages usually containing hyperlinks to each other and made available online by an individual, company, educational institution, government, or organization”  So when does a website or blog become a magazine or sheets of paper, a book or magazine? Bookstores and libraries tend to rely on ISBN for books and ISSN for magazines. Not everyone publishing a book or magazine will necessarily purchase or request one of these for their publication, but they should still meet the eligibility requirements:   “ISSN are assigned to electronic publications as far as they are serials or other continuing resources. However commercial web sites, personal weblogs and web pages, web pages which contain only links to other URLs are not eligible for ISSN.”  Being eligible for an ISSN doesn’t mean you are a magazine, but being ineligible means that you are not. Interestingly, just this past month, Sybil’s Garage, a publication that is widely accepted to be a magazine, shifted to using an ISBN and yearly print-on-demand publication. According to Matt Kressel, editor of Sybil’s Garage, “since the new issue has an ISBN, I’m considering it an anthology. From now on it will be an anthology series with magazine-like content.” With the blink of an eye, a magazine has been turned into a book. Absent the ISBN, would you really know? Are issues of F&SF merely small anthologies with fiction and non-fiction hiding behind an ISSN? It certainly seems that the line between the two is now not much more than a publisher’s “because I want it that way.”  Going back to Mark’s post, he raises the issue of two publications that are certainly confounding at first glance: io9 and Tor.com. I emailed Charlie Jane Anders from io9 and asked if io9 considered itself blog or a magazine. Her response, “you can call us either one.” Liz Gorinsky and Irene Gallo consider Tor.com “a magazine, along the lines of Salon or Slate.” I’m inclined to agree. I have no doubt that io9 and Tor.com would be able to secure an ISSN, if they haven’t already. If printed on glossy paper, these massive monthly tomes would likely be considered magazines. Paper, however, would stifle these publications. They thrive in the medium they were designed for and break with the traditional conventions required by print distribution. For both, active community involvement is crucial to a degree that is alien to a print publication. Sure, some print publications like Asimov’s have their own forums and websites, but these two are fully integrated to a level a print publication can never be. Does this make io9 and Tor.com any less of a magazine? . . . or are they the next generation?  The real problem arises with the whole periodical concept of having issues. Here at Clarkesworld, we very obviously employ an issue-based model. Lightspeed serializes its issue on a regular schedule over the course of a month. Subterranean serializes its seasonal issues on an unknown schedule.Tor.com and io9 just keep putting out new content. No schedule. No issues. This flies in the face of current definition of magazine. Content is listed chronologically, so it could be considered a daily, but the lines aren’t obviously drawn.  If your head isn’t spinning enough, let me introduce something else. Several print magazines like Asimov’s and online magazines like us are publishing ebook editions of their magazines. Are those ebook editions real magazines? They should be considered such, but what if I want to put Clarkesworld into Apple’s ibookstore? Guess what? It has to have an ISBN. They treat a magazine like a book. (This, by the way, is the reason we’re not in their store. I’m not purchasing ISBNs for all 47 issues. You can buy epub editions straight from us instead.) More complications? Io9 is available from the Amazon Kindle store as a “blog subscription” and Tor.com’s ebooks are single story releases from the magazine.  How about podcasts? Aren’t they magazines by the stated definition? EscapePod, one of the best known fiction podcasts, bills itself as “the premier science fiction podcast magazine.” Podcasts are clearly defined by episode/issues. Just because the original source is audio, doesn’t make them any less a magazine than F&SF, who, by the way have an audio edition of their magazine. But wait, does this make all podcasts magazines?  Is Clarkesworld’s podcast a separate magazine? Not as far as we are concerned. It’s part of the magazine, an extension, just like the ebook editions. Circling back around to Mark, he refers to Locus Online as a website, but judging by the website they are very intent on it being considered separate from the magazine, despite sharing content, being owned by Locus (their domain is still registered to Charlie), and being the only online presence for the magazine. Should we consider Locus Online a separate magazine or just value-added extension to Locus Magazine, similar to the websites for Realms of Fantasy and Cosmos?  Forget online vs. print. The real issue is what we are willing to accept as a magazine. The concept of periodical is being challenged. It was only inevitable in a world of 24-hour supermarkets, news, and other conveniences, that magazines would challenge that boundary. Personal experience tells me that old guard collectors and perhaps some librarians will likely resist the change, but the new, non-traditional magazines are certainly attracting readers.  Feel free to disagree. Obviously, I haven’t found the magic equation for defining a magazine, but hopefully, I’ve asked some decent questions and given you something to think about. Please consider sharing your thoughts with us. This is a conversation worth having. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nDrawing the Lines around a Moving Object\nTwenty years ago, it was very easy to look at something and say whether or not it was a magazine, newspaper or book. With the advent of online magazines, new print technologies and ebooks, it has become significantly more complicated. I regularly run into people who try to claim that online magazines and ebooks aren’t “real” books or magazines. As someone who publishes and enjoys both, I find that quite frustrating. Sometimes I find it annoying enough to poke the bear.\nAfter one of the more pleasant and civil poking of the bears, Mark R. Kelly, editor of Locus Online, blogged the following:\n“(Again—sorry to belabor this—where to draw the line? Is Tor.com or io9 a ’magazine’? [Tor.com ranked 3rd in the Locus Poll for ’Best Magazine’.] . . . So, is everything online a magazine? [Slate calls itself a “daily magazine on the Web.&rdquot;] Where is the line between magazine and blog and mere website? I guess I will be careful not to go there.)”\nMark’s final question is a good one and many of his sentiments are ones I’ve heard before. Let’s see if we can come up with an answer . . .\nMagazine: “a periodical containing miscellaneous pieces (as articles, stories, poems) and often illustrated; also : such a periodical published online b: a similar section of a newspaper usually appearing on Sunday c: a radio or television program presenting usually several short segments on a variety of topics”\nPeriodical: “being published with a fixed interval between the issues or numbers”\nNewspaper: “a paper that is printed and distributed usually daily or weekly and that contains news, articles of opinion, features, and advertising”\nMark didn’t ask about newspapers, but I included them because, as I pondered his question, it became apparent that, by these definitions, today’s newspapers could be considered a subset of magazines. In fact, a number of non-fiction magazines become very hard to classify as one or the other.\nMark’s other categories, blogs and websites, are methods of delivery, just like paper. For example, an online magazine is a website and can be powered by blogging software. A blog or website, however, doesn’t have to be a magazine, just like something printed on paper doesn’t have to be a book, magazine or newspaper.\nBlog: “a Web site that contains an online personal journal with reflections, comments, and often hyperlinks provided by the writer”\nWebsite: “a group of World Wide Web pages usually containing hyperlinks to each other and made available online by an individual, company, educational institution, government, or organization”\nSo when does a website or blog become a magazine or sheets of paper, a book or magazine? Bookstores and libraries tend to rely on ISBN for books and ISSN for magazines. Not everyone publishing a book or magazine will necessarily purchase or request one of these for their publication, but they should still meet the eligibility requirements:\n“ISSN are assigned to electronic publications as far as they are serials or other continuing resources. However commercial web sites, personal weblogs and web pages, web pages which contain only links to other URLs are not eligible for ISSN.”\nBeing eligible for an ISSN doesn’t mean you are a magazine, but being ineligible means that you are not. Interestingly, just this past month, Sybil’s Garage, a publication that is widely accepted to be a magazine, shifted to using an ISBN and yearly print-on-demand publication. According to Matt Kressel, editor of Sybil’s Garage, “since the new issue has an ISBN, I’m considering it an anthology. From now on it will be an anthology series with magazine-like content.” With the blink of an eye, a magazine has been turned into a book. Absent the ISBN, would you really know? Are issues of F&SF merely small anthologies with fiction and non-fiction hiding behind an ISSN? It certainly seems that the line between the two is now not much more than a publisher’s “because I want it that way.”\nGoing back to Mark’s post, he raises the issue of two publications that are certainly confounding at first glance: io9 and Tor.com. I emailed Charlie Jane Anders from io9 and asked if io9 considered itself blog or a magazine. Her response, “you can call us either one.” Liz Gorinsky and Irene Gallo consider Tor.com “a magazine, along the lines of Salon or Slate.” I’m inclined to agree. I have no doubt that io9 and Tor.com would be able to secure an ISSN, if they haven’t already. If printed on glossy paper, these massive monthly tomes would likely be considered magazines. Paper, however, would stifle these publications. They thrive in the medium they were designed for and break with the traditional conventions required by print distribution. For both, active community involvement is crucial to a degree that is alien to a print publication. Sure, some print publications like Asimov’s have their own forums and websites, but these two are fully integrated to a level a print publication can never be. Does this make io9 and Tor.com any less of a magazine? . . . or are they the next generation?\nThe real problem arises with the whole periodical concept of having issues. Here at Clarkesworld, we very obviously employ an issue-based model. Lightspeed serializes its issue on a regular schedule over the course of a month. Subterranean serializes its seasonal issues on an unknown schedule.Tor.com and io9 just keep putting out new content. No schedule. No issues. This flies in the face of current definition of magazine. Content is listed chronologically, so it could be considered a daily, but the lines aren’t obviously drawn.\nIf your head isn’t spinning enough, let me introduce something else. Several print magazines like Asimov’s and online magazines like us are publishing ebook editions of their magazines. Are those ebook editions real magazines? They should be considered such, but what if I want to put Clarkesworld into Apple’s ibookstore? Guess what? It has to have an ISBN. They treat a magazine like a book. (This, by the way, is the reason we’re not in their store. I’m not purchasing ISBNs for all 47 issues. You can buy epub editions straight from us instead.) More complications? Io9 is available from the Amazon Kindle store as a “blog subscription” and Tor.com’s ebooks are single story releases from the magazine.\nHow about podcasts? Aren’t they magazines by the stated definition? EscapePod, one of the best known fiction podcasts, bills itself as “the premier science fiction podcast magazine.” Podcasts are clearly defined by episode/issues. Just because the original source is audio, doesn’t make them any less a magazine than F&SF, who, by the way have an audio edition of their magazine. But wait, does this make all podcasts magazines?\nIs Clarkesworld’s podcast a separate magazine? Not as far as we are concerned. It’s part of the magazine, an extension, just like the ebook editions. Circling back around to Mark, he refers to Locus Online as a website, but judging by the website they are very intent on it being considered separate from the magazine, despite sharing content, being owned by Locus (their domain is still registered to Charlie), and being the only online presence for the magazine. Should we consider Locus Online a separate magazine or just value-added extension to Locus Magazine, similar to the websites for Realms of Fantasy and Cosmos?\nForget online vs. print. The real issue is what we are willing to accept as a magazine. The concept of periodical is being challenged. It was only inevitable in a world of 24-hour supermarkets, news, and other conveniences, that magazines would challenge that boundary. Personal experience tells me that old guard collectors and perhaps some librarians will likely resist the change, but the new, non-traditional magazines are certainly attracting readers.\nFeel free to disagree. Obviously, I haven’t found the magic equation for defining a magazine, but hopefully, I’ve asked some decent questions and given you something to think about. Please consider sharing your thoughts with us. This is a conversation worth having.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_08_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Drawing the Lines around a Moving Object by Neil Clarke"}