{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ctFYx6PfRsSOfaeDUNH/yB839WY=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: A Threat, Followed Through  When I was at the Nebula Awards a couple of months ago, Andrea Pawley and I started talking about these editorials—actually, it was more like the continuation of a discussion I started in a previous editorial. As you may know, I sometimes struggle with something to say in this column and have extended an open invitation for suggestions. Andrea took the call to heart and promised to send me a few ideas. She actually followed through on that threat and we’ve since exchanged several emails.  Some of the suggestions were behind-the-scenes-focused and would cause me to elaborate on or take a new look at subjects I’ve spoken about here before. It certainly fits my interests. I enjoy the data-oriented editorials I’ve done over the years and revisiting some of those topics with more recent data could yield some interesting results. Several of those editorials spun off from my own personal research to understand what it is that causes me to select the stories that I do. I still don’t have a satisfactory answer to that question, and perhaps I never will, but it might help me get closer and provide insights into the market as it stands.  I might also take a step back and rethink some of those from the perspective of the anthologies I’ve worked on, particularly the three volumes of The Best Science Fiction of the Year series. In a sense, the same rules should apply, but I’m selecting for a different audience and from a pool of works filtered through a number of other editors and publishers. There’s also room to look at this from the perspective of overlap with other year’s best editors and even the awards, which seem to be paying less and less attention to works originating in print—despite still publishing some amazing works. There’s a lot there to pull apart and think about.  Of course, there were some other topics like superheros—which I don’t recall ever having written about in these columns—that might be fun to have a go at because I don’t think I’m approaching them in the traditional sense. To me these “supers” are just stories about good (or bad) mutants, gadgeteers, scientists, aliens, etc. The hero or villain aspect is secondary. Some drift fantasy, some hard SF, and others blur that line normally forced between. I’ll certainly have to give that some more thought. Feel free to add your two cents in the comments section on the website.  So, it looks like I have a few ideas moving forward and a big thank you to Andrea for that. Of course, there’s always room for more. I have to write twelve of these things every year and I expect to be doing this for a long time. If you want to email me some suggestions, please feel free at neil@clarkesworldmagazine.com or in-person at a convention sometime—Readercon and Worldcon are coming up next. You might even find yourself unexpectedly written into one of these things.  And speaking of what’s coming, I have two anthologies that will be published in July! Clarkesworld Year Nine: Volume Two should land on shelves today and close out the Year Nine volumes—that’s all the original fiction from our ninth year of publication. It’s a great way to catch up or revisit the good old days. Just a bit later in the month, The Final Frontier will be published by Night Shade Books in print, ebook, and audio editions. Publishers Weekly recently gave it a starred review, so I’m hoping that’s a good sign. I’m very excited to see both of these projects finally published and I hope you buy and enjoy them. [I’m a full-time editor now, so of course I’m going to encourage you to buy them. I sort of have to.] That’s all for this month. I hope to see some of you at Readercon in Massachusetts. Yes, that Readercon. The same place I nearly died at six years ago, well, new hotel, different town, further from the hospital (sigh). Stop by the Clarkesworld table in the dealers room and say hi! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: A Threat, Followed Through\nWhen I was at the Nebula Awards a couple of months ago, Andrea Pawley and I started talking about these editorials—actually, it was more like the continuation of a discussion I started in a previous editorial. As you may know, I sometimes struggle with something to say in this column and have extended an open invitation for suggestions. Andrea took the call to heart and promised to send me a few ideas. She actually followed through on that threat and we’ve since exchanged several emails.\nSome of the suggestions were behind-the-scenes-focused and would cause me to elaborate on or take a new look at subjects I’ve spoken about here before. It certainly fits my interests. I enjoy the data-oriented editorials I’ve done over the years and revisiting some of those topics with more recent data could yield some interesting results. Several of those editorials spun off from my own personal research to understand what it is that causes me to select the stories that I do. I still don’t have a satisfactory answer to that question, and perhaps I never will, but it might help me get closer and provide insights into the market as it stands.\nI might also take a step back and rethink some of those from the perspective of the anthologies I’ve worked on, particularly the three volumes of The Best Science Fiction of the Year series. In a sense, the same rules should apply, but I’m selecting for a different audience and from a pool of works filtered through a number of other editors and publishers. There’s also room to look at this from the perspective of overlap with other year’s best editors and even the awards, which seem to be paying less and less attention to works originating in print—despite still publishing some amazing works. There’s a lot there to pull apart and think about.\nOf course, there were some other topics like superheros—which I don’t recall ever having written about in these columns—that might be fun to have a go at because I don’t think I’m approaching them in the traditional sense. To me these “supers” are just stories about good (or bad) mutants, gadgeteers, scientists, aliens, etc. The hero or villain aspect is secondary. Some drift fantasy, some hard SF, and others blur that line normally forced between. I’ll certainly have to give that some more thought. Feel free to add your two cents in the comments section on the website.\nSo, it looks like I have a few ideas moving forward and a big thank you to Andrea for that. Of course, there’s always room for more. I have to write twelve of these things every year and I expect to be doing this for a long time. If you want to email me some suggestions, please feel free at neil@clarkesworldmagazine.com or in-person at a convention sometime—Readercon and Worldcon are coming up next. You might even find yourself unexpectedly written into one of these things.\nAnd speaking of what’s coming, I have two anthologies that will be published in July! Clarkesworld Year Nine: Volume Two should land on shelves today and close out the Year Nine volumes—that’s all the original fiction from our ninth year of publication. It’s a great way to catch up or revisit the good old days. Just a bit later in the month, The Final Frontier will be published by Night Shade Books in print, ebook, and audio editions. Publishers Weekly recently gave it a starred review, so I’m hoping that’s a good sign. I’m very excited to see both of these projects finally published and I hope you buy and enjoy them. [I’m a full-time editor now, so of course I’m going to encourage you to buy them. I sort of have to.]\nThat’s all for this month. I hope to see some of you at Readercon in Massachusetts. Yes, that Readercon. The same place I nearly died at six years ago, well, new hotel, different town, further from the hospital (sigh). Stop by the Clarkesworld table in the dealers room and say hi!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_07_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: A Threat, Followed Through by Neil Clarke"}