{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Alethea Kontis", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "2dJPYvx8upR33Mq3o2lCbZLHWBE=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: The Best of All Possible Worlds  “Of all the places I’ve seen, this is the fairest of them all.” —Regina, Once Upon a Time My favorite required reading book in high school was assigned not in English class, but history. Mr. Stafford was a bit of a progressive history teacher (for South Carolina)—we lucky honor students watched Amadeus and A Man for All Seasons; we read The Prince and Animal Farm and Candide. I loved Candide for all the wrong reasons.  For those not in the know, Voltaire wrote Candide (or L’Optimisme) to illustrate his disdain for the philosophies of Gottfried Wilhelm Leibniz by the use of incredibly jaded sarcasm. It is the story of a disillusioned young man (Candide) and his misadventures with a mentor who believes that we live in “the best of all possible worlds.” The book is hilarious and brilliant. I identified with Candide and I even had a best friend who was my own personal Pangloss. She saw her own little world through rose-colored glasses and she is the happiest and friendliest person I have ever known. Only, unlike Candide, I have made it my life’s mission to be just like her.  Yes, I recognize that horrible things have happened, are happening, and will continue to happen in this world, but I don’t have to give those horrible things control over my life. I believe that I will get out of my life what I put into it, so I make an effort to spread cheer and goodwill wherever I go.  There’s a reason everyone calls me “Princess,” and it’s not because I told them to.  I happily admit to being a dreamer, but I am also a realist. I grew up in math and science—I know the odds, and the range of uncertainty. I can hypothesize various outcomes of a situation logically and rationally. I have the ability to predict a bad result and sometimes I’m right, or I’m pleasantly surprised. None of this means I can’t stop hoping for a better future.  So when did it become la mode to be such a Voltaire about everything? Cynics rule the roost now. Everyone is so much smarter than everyone else, and they’re happy to prove it at a moment’s notice. Especially if you are SO DELUDED as to be optimistic about ANYTHING. Don’t you know that real life SUCKS?  Boy, I wish I was kidding about any of that, but I’ve heard it all. Back when I worked for a big corporation I jokingly called it “joy discrimination,” but it wasn’t really a joke. I received an inordinate amount of micromanaging scrutiny because I enjoyed my job so much. Obviously, I was doing something wrong. I wasn’t working hard/fast/long enough. Never mind that my clients all loved me and I was making their companies millions of dollars a year. I had directors, vice presidents . . . all the way up to the C-WTF-O attempting to make my life miserable so that I would fit in. Eventually they got their wish. After some pretty extreme measures on their part, I did what any sane, rational person would have done in a similarly abusive relationship: I walked away.  I was told by former colleagues that there was no longer any laughter or energy in the sea of cubicles where I used to work. What can I say? I’m an optimist. We take those things with us wherever we go. Any subsequent workplace happiness or lack thereof was no longer up to me.  Joy Discrimination is not limited to the corporate world. Take the entire dystopian literature movement, for example. Worlds thrown into dark chaos and main characters who don’t live anywhere near happily ever after . . . if they live at all. But that’s realistic, don’t you know. LIFE SUCKS, ALETHEA. DEAL WITH IT ALREADY.  I recently made it through a Bones marathon rewatch on Netflix. Somewhere at the end of season five (2010), Bones says to Booth, “I envy your ability to substitute optimism for reality.” I wanted to reach into the television and strangle whoever wrote that line. Temperance Brennan’s character is hyperrational and as logical as a Vulcan. Semantics aside, the logic here doesn’t fit. It’s like saying “I envy your ability to substitute up for fish.” The opposite of “optimism” is “pessimism.” The opposite of “reality” is “fantasy.”  This has become the zeitgeist; so much so, that it has been sincerely suggested that I see a therapist for my inability to accept that everything is just going to end up in the toilet. Am I not allowed to go to hell in a glitter handbasket? Is optimism really such a foreign concept that those of us who subscribe to it must be deemed as mentally handicapped in some way?  I may be a romantic, but I am also a realist. The two are not mutually exclusive. I can tell reality from fantasy. I’m beginning to worry that a growing number of the population can’t or choose not to.  After a conference or convention, I’m always asked if I “had fun.” I’m always baffled by this question as well. “Fun” is an incredibly subjective term. Take this past BEA (Book Expo America) for example. I was in attendance at the expo all three days, with events every single night, and stayed in the city for more events two days afterward. Travel was a small nightmare. I struggled with my publisher. Bookcon was a complete morass of chaos. A dear friend passed away. I was called to perform at the last minute, with very little warning. I was smack in the middle of a personal crisis that included moving one thousand miles across the country. Oh, and I signed about five hundred books and postcards while suffering from tendinitis in both arms, so I was in pretty incredible pain the whole time. And I lost my voice, which happens to me about once a decade.  This was the reality of my trip. But the question remains: Did I have fun?  That trip was not only fun, it was epic in its amazingness. I will never forget this year’s BEA. It was a rousing success, and I’m so glad I did it. I’d do it again tomorrow, pain and heartbreak and everything else included. But I’m an optimist. I believe that I can do anything. I believe that strangers are just best friends I haven’t met yet. I believe that I live in the best of all possible worlds, and I mean to experience that world to the fullest.  Would you have fun at BEA? The answer depends on not only the reality of the situation, but also what kind of person you are under extreme circumstances.  So what does this mean for our future? What happens if the young people of today continue to equate bleakness with reality? I fear the direction this prevalent pessimism is taking us. I can imagine how a world like that would look.  And I’ll either be right, or I’ll be pleasantly surprised. If you don’t mind, I’m going to hope for the latter.  Alethea Kontis is a princess, author, fairy godmother, and geek. Her bestselling Books of Arilland fairytale series won two Gelett Burgess Children's Book Awards (Enchanted and Tales of Arilland), and was twice nominated for the Andre Norton Award. Alethea also penned the AlphaOops picture books, The Wonderland Alphabet, Diary of a Mad Scientist Garden Gnome, Beauty & Dynamite, The Dark-Hunter Companion (w/Sherrilyn Kenyon), and a myriad of poems, essays, and short stories. Princess Alethea lives and writes on the Space Coast of Florida with her teddy bear, Charlie.", "text": "Non-Fiction\nAnother Word: The Best of All Possible Worlds\n“Of all the places I’ve seen, this is the fairest of them all.”\n—Regina, Once Upon a Time\nMy favorite required reading book in high school was assigned not in English class, but history. Mr. Stafford was a bit of a progressive history teacher (for South Carolina)—we lucky honor students watched Amadeus and A Man for All Seasons; we read The Prince and Animal Farm and Candide. I loved Candide for all the wrong reasons.\nFor those not in the know, Voltaire wrote Candide (or L’Optimisme) to illustrate his disdain for the philosophies of Gottfried Wilhelm Leibniz by the use of incredibly jaded sarcasm. It is the story of a disillusioned young man (Candide) and his misadventures with a mentor who believes that we live in “the best of all possible worlds.” The book is hilarious and brilliant. I identified with Candide and I even had a best friend who was my own personal Pangloss. She saw her own little world through rose-colored glasses and she is the happiest and friendliest person I have ever known. Only, unlike Candide, I have made it my life’s mission to be just like her.\nYes, I recognize that horrible things have happened, are happening, and will continue to happen in this world, but I don’t have to give those horrible things control over my life. I believe that I will get out of my life what I put into it, so I make an effort to spread cheer and goodwill wherever I go.\nThere’s a reason everyone calls me “Princess,” and it’s not because I told them to.\nI happily admit to being a dreamer, but I am also a realist. I grew up in math and science—I know the odds, and the range of uncertainty. I can hypothesize various outcomes of a situation logically and rationally. I have the ability to predict a bad result and sometimes I’m right, or I’m pleasantly surprised. None of this means I can’t stop hoping for a better future.\nSo when did it become la mode to be such a Voltaire about everything? Cynics rule the roost now. Everyone is so much smarter than everyone else, and they’re happy to prove it at a moment’s notice. Especially if you are SO DELUDED as to be optimistic about ANYTHING. Don’t you know that real life SUCKS?\nBoy, I wish I was kidding about any of that, but I’ve heard it all. Back when I worked for a big corporation I jokingly called it “joy discrimination,” but it wasn’t really a joke. I received an inordinate amount of micromanaging scrutiny because I enjoyed my job so much. Obviously, I was doing something wrong. I wasn’t working hard/fast/long enough. Never mind that my clients all loved me and I was making their companies millions of dollars a year. I had directors, vice presidents . . . all the way up to the C-WTF-O attempting to make my life miserable so that I would fit in. Eventually they got their wish. After some pretty extreme measures on their part, I did what any sane, rational person would have done in a similarly abusive relationship: I walked away.\nI was told by former colleagues that there was no longer any laughter or energy in the sea of cubicles where I used to work. What can I say? I’m an optimist. We take those things with us wherever we go. Any subsequent workplace happiness or lack thereof was no longer up to me.\nJoy Discrimination is not limited to the corporate world. Take the entire dystopian literature movement, for example. Worlds thrown into dark chaos and main characters who don’t live anywhere near happily ever after . . . if they live at all. But that’s realistic, don’t you know. LIFE SUCKS, ALETHEA. DEAL WITH IT ALREADY.\nI recently made it through a Bones marathon rewatch on Netflix. Somewhere at the end of season five (2010), Bones says to Booth, “I envy your ability to substitute optimism for reality.” I wanted to reach into the television and strangle whoever wrote that line. Temperance Brennan’s character is hyperrational and as logical as a Vulcan. Semantics aside, the logic here doesn’t fit. It’s like saying “I envy your ability to substitute up for fish.” The opposite of “optimism” is “pessimism.” The opposite of “reality” is “fantasy.”\nThis has become the zeitgeist; so much so, that it has been sincerely suggested that I see a therapist for my inability to accept that everything is just going to end up in the toilet. Am I not allowed to go to hell in a glitter handbasket? Is optimism really such a foreign concept that those of us who subscribe to it must be deemed as mentally handicapped in some way?\nI may be a romantic, but I am also a realist. The two are not mutually exclusive. I can tell reality from fantasy. I’m beginning to worry that a growing number of the population can’t or choose not to.\nAfter a conference or convention, I’m always asked if I “had fun.” I’m always baffled by this question as well. “Fun” is an incredibly subjective term. Take this past BEA (Book Expo America) for example. I was in attendance at the expo all three days, with events every single night, and stayed in the city for more events two days afterward. Travel was a small nightmare. I struggled with my publisher. Bookcon was a complete morass of chaos. A dear friend passed away. I was called to perform at the last minute, with very little warning. I was smack in the middle of a personal crisis that included moving one thousand miles across the country. Oh, and I signed about five hundred books and postcards while suffering from tendinitis in both arms, so I was in pretty incredible pain the whole time. And I lost my voice, which happens to me about once a decade.\nThis was the reality of my trip. But the question remains: Did I have fun?\nThat trip was not only fun, it was epic in its amazingness. I will never forget this year’s BEA. It was a rousing success, and I’m so glad I did it. I’d do it again tomorrow, pain and heartbreak and everything else included. But I’m an optimist. I believe that I can do anything. I believe that strangers are just best friends I haven’t met yet. I believe that I live in the best of all possible worlds, and I mean to experience that world to the fullest.\nWould you have fun at BEA? The answer depends on not only the reality of the situation, but also what kind of person you are under extreme circumstances.\nSo what does this mean for our future? What happens if the young people of today continue to equate bleakness with reality? I fear the direction this prevalent pessimism is taking us. I can imagine how a world like that would look.\nAnd I’ll either be right, or I’ll be pleasantly surprised. If you don’t mind, I’m going to hope for the latter.\nAlethea Kontis is a princess, author, fairy godmother, and geek. Her bestselling Books of Arilland fairytale series won two Gelett Burgess Children's Book Awards (Enchanted and Tales of Arilland), and was twice nominated for the Andre Norton Award. Alethea also penned the AlphaOops picture books, The Wonderland Alphabet, Diary of a Mad Scientist Garden Gnome, Beauty & Dynamite, The Dark-Hunter Companion (w/Sherrilyn Kenyon), and a myriad of poems, essays, and short stories. Princess Alethea lives and writes on the Space Coast of Florida with her teddy bear, Charlie.", "source": "https://clarkesworldmagazine.com/another_word_09_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Best of All Possible Worlds by Alethea Kontis"}