{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "James Patrick Kelly", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "hPN8pY9RSSIfaj0/M3+mATUTm8Y=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: Listen Up!  I do not have many recurring nightmares, but in one that continues to horrify me, I am backstage at a theater watching a play. Suddenly the flustered stage manager braces me. “So-and-so didn’t show up,” she says. “You have to go on for him!”  Quaking, I reply, “But . . . but . . . but I’m not an actor. I don’t know the part.”  “That’s okay, they’ll cover for you,” she says, even as she pushes me from the wings.  As I stand blinking on the brightly lit stage, one of the actors turns to me. “So, there you are,” he says, “what news on the Rialto?” In my dream, he delivers this line with a kind of smirking malevolence. As the audience and all the other actors stare at me, I have no idea what to say. The silence stretches until it begins to sound like a scream.  Then I wake up.  Which explains why I’ve never summoned the courage to act, even though I think I’d be good at it. In compensation, however, I have developed a side career as a playwright.  Over the years I’ve found another workaround that doesn’t require knowing and remembering lines. I began my career as a reader as a stay-at-home dad, reading Clifford, The Big Red Dog and The Cat In The Hat to my kids. When we graduated to the Oz series, I began to do voices. I remember casting the Wizard as a very broad W.C. Fields and the Scarecrow as Ernie from Sesame Street. And it was about this time I began going to science fiction conventions and discovered, to my immense surprise, that fans would show up at readings to hear me pretend to be the characters in my stories. Readings soon became my favorite part of cons—and still are.  But it’s not only my own readings that I enjoy. I’ve always loved the spoken word, although my devotion to the form was thwarted by technologies of the latter half of the twentieth century. LP records, for example, were useless for listening to stories and novels; the rewards for sitting next to the stereo were brutal abridgments or disappointing excerpts. The cassette tapes of the ’80’s were a great leap forward, bringing entire novels to the Sony Walkman and its knockoffs, although I’d have to lug around a binder filled with up to a dozen cassettes. And all too often I’d be listening to tape number eight when suddenly the narrator would start talking backward and stop. Ejecting the cassette, I’d find the tape unspooled into a knot of iron-oxide spaghetti.  The compact discs of the ’90’s were only a slight improvement: again with those protective binders and fingerprints on their vulnerable surfaces meant skipping scenes or even entire chapters. Of course, audiobooks on CDs are still with us, but disruptive cultural and technological forces of the 21st Century are squeezing them into the narrowest of niches.  You’ve probably heard it said that the smartphone in your pocket is more powerful than the IBM System/360 that NASA engineers used on the Apollo missions. But did you know that it’s more powerful than the famous Cray-2 which debuted in 1985 or the Deep Blue supercomputer which stymied chess champion Garry Kasparov in 1997? Your “phone” is now your camera and photo archive, your address book, your appointment calendar, a shopping mall, a flashlight, a compass, a map of the world, this issue of Clarkesworld, and the soundtrack of your life. The era of smartphones has brought about a Golden Age of the spoken word. Beginning with the new medium of podcasting in 2004 and continuing with the emergence of Audible.com as a mainstream source of downloadable books in 2008, we have in 2017 arrived at a sweet spot of new audio technology and evolving listener behavior. Say goodbye to bulky binders, tangles of ruined tape, and scratched polycarbonate.  Capitalism has responded to the burgeoning downloadable audio marketplace with a flood of talent and content. Audiobooks are by far the brightest sector of publishing. The Audio Publishers Association estimates that 2016 sales were up about 18% over 2015—and 2015 was a banner year! Overall sales were estimated at $2.1 billion, 82% of which were digital downloads. Not only can you find your favorite authors in audio, but you can find many of your favorite actors. You can listen to The Handmaid’s Tale read by Claire Danes, The Brief Wondrous Life of Oscar Wao read by Lin-Manuel Miranda, Peter Pan read by Tim Curry, and The Odyssey read by Ian McKellen.  But look past the glitz of bestselling authors and celebrity readers, and you’ll see the real story. All across the world people like you and I are recording audiobooks and stories. Ten years ago, I was doing panels at conventions, often with the Clarkesworld’s fabulous Kate Baker, explaining how anyone could learn to create original audio content. You don’t need to book time in some expensive studio. I’ve recorded hundreds of hours of audio for Audible in my walk-in closet, surrounded by my sweaters and speaking into a $200 microphone connected to a laptop. You don’t have to be a tech wizard to do this; while mastering the recording hardware and software was a chore, it was well within the abilities of this English major. And never once have I gone up on my lines while emoting in the safety of my closet. My sweaters don’t care if I mess up. Tech has trumped my actor’s nightmare.  Why, it’s a science fiction miracle!  Since I’ve been paid for reading my own stuff, I guess that makes me a professional narrator. But I can’t help feeling like an imposter when I listen to other, more talented, narrators do their thing. Because I do listen to a lot of audio. Aside from all the great science fiction and fantasy stories available here and elsewhere, I was an early subscriber at Audible and have been listening to two books a month since 2002. All that listening over the years has led me to wonder if there is something more to soaring audiobook sales than just a technological breakthrough. So, let me share a couple of insights from my years of sitting on both sides of the microphone.  Back in the ’90s, I participated in various web symposia about the coming of e-books. Many pundits insisted that the design superiority of paper books meant that e-books were nothing but a fad. Print books were tactile objects, they said, rhapsodizing about the smell of paper and texture of the page and the heft of a hardcover. Each edition of a print book was unique and permanent. E-books, as we now know them, are virtual objects. On your e-reader, every book presents as evanescent phosphers on a screen.  Their lack of context leaves some feeling dehumanized. But if you want a portable digital book with the human touch, not only one that you can take with you on a plane or to the beach, but one that you can enjoy while you’re gardening or driving, then digital audiobooks are for you. Your delight will flow not only from the mind of the writer, but from the voice and personality of the reader. This intimate and very human connection is as old and powerful as storytelling itself. Moreover, not only is every edition of an audiobook unique, but an essential quality to this individuality means you can enjoy the same text read by different narrators. The Harry Potter series was read for the US editions by Jim Dale, who won multiple Audies (the audiobook equivalent of the Hugos) for his performances. In the UK, it was read by the incomparable Stephen Fry.  This summer Mother Go, my new novel, was published as an audiobook original by Audible. It’s a book I wrote to be read aloud and indeed, many fans have heard me read bits of it at cons. However, I never once thought of narrating it myself. In part this is because the book is from the point of view of a young woman living on the Moon a hundred years from now and it needed a woman’s voice. Besides, I’m fine reading my short stories, but this novel needed a real pro, and I was lucky to get one of Audible’s best, January LaVoy, herself a multiple Audie winner, most recently in 2016 for reading on Libba Bray’s Lair of Dreams.  Many of my writer pals have an uneasy relationship with the audio versions of their works. They tell me that they don’t care to listen, because the narrator doesn’t say the lines the way they heard them in their heads when they were writing. I do and I don’t get this. When I publish something in print, I’m pretty much sick of looking at it. It might be years, if ever, before I can stand to read it again. But hearing my work read by talents like Mss. LaVoy and Baker is not only a pleasure, but also a way to discover things about it I never knew.  So yeah, I’m a spoken word fan and I’m guessing you are too. And for people like us, in this regard at least, we are living in the best of times! James Patrick Kelly has won the Hugo, Nebula and Locus awards; his fiction has been translated into twenty-one languages. His most recent story collections were this year's The Promise of Space from Prime Books and Masters of Science Fiction: James Patrick Kelly published by Centipede Press in 2016. His most recent novel, Mother Go, was published in 2017 as an Audible original audiobook on Audible.com. He writes a column on the internet for Asimov's Science Fiction Magazine and is on the faculty of the Stonecoast Creative Writing MFA Program at the University of Southern Maine.", "text": "Non-Fiction\nAnother Word: Listen Up!\nI do not have many recurring nightmares, but in one that continues to horrify me, I am backstage at a theater watching a play. Suddenly the flustered stage manager braces me. “So-and-so didn’t show up,” she says. “You have to go on for him!”\nQuaking, I reply, “But . . . but . . . but I’m not an actor. I don’t know the part.”\n“That’s okay, they’ll cover for you,” she says, even as she pushes me from the wings.\nAs I stand blinking on the brightly lit stage, one of the actors turns to me. “So, there you are,” he says, “what news on the Rialto?” In my dream, he delivers this line with a kind of smirking malevolence. As the audience and all the other actors stare at me, I have no idea what to say. The silence stretches until it begins to sound like a scream.\nThen I wake up.\nWhich explains why I’ve never summoned the courage to act, even though I think I’d be good at it. In compensation, however, I have developed a side career as a playwright.\nOver the years I’ve found another workaround that doesn’t require knowing and remembering lines. I began my career as a reader as a stay-at-home dad, reading Clifford, The Big Red Dog and The Cat In The Hat to my kids. When we graduated to the Oz series, I began to do voices. I remember casting the Wizard as a very broad W.C. Fields and the Scarecrow as Ernie from Sesame Street. And it was about this time I began going to science fiction conventions and discovered, to my immense surprise, that fans would show up at readings to hear me pretend to be the characters in my stories. Readings soon became my favorite part of cons—and still are.\nBut it’s not only my own readings that I enjoy. I’ve always loved the spoken word, although my devotion to the form was thwarted by technologies of the latter half of the twentieth century. LP records, for example, were useless for listening to stories and novels; the rewards for sitting next to the stereo were brutal abridgments or disappointing excerpts. The cassette tapes of the ’80’s were a great leap forward, bringing entire novels to the Sony Walkman and its knockoffs, although I’d have to lug around a binder filled with up to a dozen cassettes. And all too often I’d be listening to tape number eight when suddenly the narrator would start talking backward and stop. Ejecting the cassette, I’d find the tape unspooled into a knot of iron-oxide spaghetti.\nThe compact discs of the ’90’s were only a slight improvement: again with those protective binders and fingerprints on their vulnerable surfaces meant skipping scenes or even entire chapters. Of course, audiobooks on CDs are still with us, but disruptive cultural and technological forces of the 21st Century are squeezing them into the narrowest of niches.\nYou’ve probably heard it said that the smartphone in your pocket is more powerful than the IBM System/360 that NASA engineers used on the Apollo missions. But did you know that it’s more powerful than the famous Cray-2 which debuted in 1985 or the Deep Blue supercomputer which stymied chess champion Garry Kasparov in 1997? Your “phone” is now your camera and photo archive, your address book, your appointment calendar, a shopping mall, a flashlight, a compass, a map of the world, this issue of Clarkesworld, and the soundtrack of your life. The era of smartphones has brought about a Golden Age of the spoken word. Beginning with the new medium of podcasting in 2004 and continuing with the emergence of Audible.com as a mainstream source of downloadable books in 2008, we have in 2017 arrived at a sweet spot of new audio technology and evolving listener behavior. Say goodbye to bulky binders, tangles of ruined tape, and scratched polycarbonate.\nCapitalism has responded to the burgeoning downloadable audio marketplace with a flood of talent and content. Audiobooks are by far the brightest sector of publishing. The Audio Publishers Association estimates that 2016 sales were up about 18% over 2015—and 2015 was a banner year! Overall sales were estimated at $2.1 billion, 82% of which were digital downloads. Not only can you find your favorite authors in audio, but you can find many of your favorite actors. You can listen to The Handmaid’s Tale read by Claire Danes, The Brief Wondrous Life of Oscar Wao read by Lin-Manuel Miranda, Peter Pan read by Tim Curry, and The Odyssey read by Ian McKellen.\nBut look past the glitz of bestselling authors and celebrity readers, and you’ll see the real story. All across the world people like you and I are recording audiobooks and stories. Ten years ago, I was doing panels at conventions, often with the Clarkesworld’s fabulous Kate Baker, explaining how anyone could learn to create original audio content. You don’t need to book time in some expensive studio. I’ve recorded hundreds of hours of audio for Audible in my walk-in closet, surrounded by my sweaters and speaking into a $200 microphone connected to a laptop. You don’t have to be a tech wizard to do this; while mastering the recording hardware and software was a chore, it was well within the abilities of this English major. And never once have I gone up on my lines while emoting in the safety of my closet. My sweaters don’t care if I mess up. Tech has trumped my actor’s nightmare.\nWhy, it’s a science fiction miracle!\nSince I’ve been paid for reading my own stuff, I guess that makes me a professional narrator. But I can’t help feeling like an imposter when I listen to other, more talented, narrators do their thing. Because I do listen to a lot of audio. Aside from all the great science fiction and fantasy stories available here and elsewhere, I was an early subscriber at Audible and have been listening to two books a month since 2002. All that listening over the years has led me to wonder if there is something more to soaring audiobook sales than just a technological breakthrough. So, let me share a couple of insights from my years of sitting on both sides of the microphone.\nBack in the ’90s, I participated in various web symposia about the coming of e-books. Many pundits insisted that the design superiority of paper books meant that e-books were nothing but a fad. Print books were tactile objects, they said, rhapsodizing about the smell of paper and texture of the page and the heft of a hardcover. Each edition of a print book was unique and permanent. E-books, as we now know them, are virtual objects. On your e-reader, every book presents as evanescent phosphers on a screen.\nTheir lack of context leaves some feeling dehumanized. But if you want a portable digital book with the human touch, not only one that you can take with you on a plane or to the beach, but one that you can enjoy while you’re gardening or driving, then digital audiobooks are for you. Your delight will flow not only from the mind of the writer, but from the voice and personality of the reader. This intimate and very human connection is as old and powerful as storytelling itself. Moreover, not only is every edition of an audiobook unique, but an essential quality to this individuality means you can enjoy the same text read by different narrators. The Harry Potter series was read for the US editions by Jim Dale, who won multiple Audies (the audiobook equivalent of the Hugos) for his performances. In the UK, it was read by the incomparable Stephen Fry.\nThis summer Mother Go, my new novel, was published as an audiobook original by Audible. It’s a book I wrote to be read aloud and indeed, many fans have heard me read bits of it at cons. However, I never once thought of narrating it myself. In part this is because the book is from the point of view of a young woman living on the Moon a hundred years from now and it needed a woman’s voice. Besides, I’m fine reading my short stories, but this novel needed a real pro, and I was lucky to get one of Audible’s best, January LaVoy, herself a multiple Audie winner, most recently in 2016 for reading on Libba Bray’s Lair of Dreams.\nMany of my writer pals have an uneasy relationship with the audio versions of their works. They tell me that they don’t care to listen, because the narrator doesn’t say the lines the way they heard them in their heads when they were writing. I do and I don’t get this. When I publish something in print, I’m pretty much sick of looking at it. It might be years, if ever, before I can stand to read it again. But hearing my work read by talents like Mss. LaVoy and Baker is not only a pleasure, but also a way to discover things about it I never knew.\nSo yeah, I’m a spoken word fan and I’m guessing you are too. And for people like us, in this regard at least, we are living in the best of times!\nJames Patrick Kelly has won the Hugo, Nebula and Locus awards; his fiction has been translated into twenty-one languages. His most recent story collections were this year's The Promise of Space from Prime Books and Masters of Science Fiction: James Patrick Kelly published by Centipede Press in 2016. His most recent novel, Mother Go, was published in 2017 as an Audible original audiobook on Audible.com. He writes a column on the internet for Asimov's Science Fiction Magazine and is on the faculty of the Stonecoast Creative Writing MFA Program at the University of Southern Maine.", "source": "https://clarkesworldmagazine.com/another_word_11_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Listen Up! by James Patrick Kelly"}