{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremiah Sturgill", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "5SUWMUyvDyVbsV/ZPXVSoYdQMU4=", "id": null, "license": null, "comments": "", "raw_text": "2230 words, short story  Flight  Brow lift. Neck lift. Face lift.  Blepharoplasty—not familiar with the term? Pretend I said eyelid surgery. To make them slant to the outside, that’s all; the exotic look is in. Trust us. You’ll love it. Rhinoplasty—a nose job, that’s all. Not just a reshaping, mind you, but a reimagining. First, we’ll add that beautiful upward tilt (yes, like hers—and hers—and hers), then we’ll reduce the size and narrow the bridge. You may need to breathe through your mouth afterwards, but once we cap your teeth, you’ll thank us for it.  Next is cosmetic otoplasty—that’s for your ears—followed by collagen injections in your lips and cheeks. Removal of your second chin, and the insertion of an implant to help shape the first one. Permanent laser hair removal below your lower lip, above your upper lip, and for your sideburns too (I can’t believe you have sideburns!). We may as well take off your eyebrows while we are at it. You can draw them on in the future, if you want to go retro. Or schedule a follow-up for replacements, if they come back in style.  Liposuction’s next, then abdominoplasty (just another word for tummy tuck, girl, no need to worry). After that, we’ll staple your stomach, reshape your buttocks, and make sure your love handles are all-the-way gone—nip and tuck and all that nonsense. You get the idea.  Of course, there’s still the grand finale, the one no woman would be complete without: breast augmentation. Enlargement and reshaping in your case. In most cases, actually, but that’s not important. All you have to do is show up. We mail you the bill.  The last day comes and it’s done—you’re done, it’s all downhill from there. Just a few months of rehabilitation, followed by a simple maintenance routine. A chemical peel treatment and derm abrasion therapy every now and then for your complexion, along with the daily, oil-free, skin-exfoliating face wash. And that Hollywood all-liquid seven-day miracle diet? Why not. Couldn’t hurt. Fen-Phen and caffeine pills? Sure. If anything goes wrong, you can always file a lawsuit.  All right. You’ve been faithful. You’ve done everything you needed to do, and it has worked. You can hardly believe that beautiful woman in the mirror is you.  Catching your breath in the doctor’s office, you don’t even mind the wait. It feels good just to sit still. Well, not still. Your foot keeps twitching, and you can’t seem to make it stop. But why would you want to? It’s good to keep moving. Helps burn those calories.  They call your name and you walk into the examination room and sit down again. Your foot keeps up its hypnotic spasming, and everything looks like it’s underwater. He comes out, the doctor does, and you lift up your shirt. He pinches you with cold metal on your stomach, your back, your thighs.  “Abigail, I’m sorry,” he says, and you can see it in his eyes: the news is bad. “Your body-fat index is point-oh-six.” He looks like he wants to cry.  You can’t help yourself. You cry. You deserve to feel bad, tubby. Fatso. Whale. Blimp. Pig. Point-oh-six? How could you have been so weak? Too many calories, that’s the problem. You stumble on your way out of the office, ignoring the secretary when she calls out your name. You decide then and there that something’s going to have to give, and isn’t going to be you. You cut you intake in half—three hundred calories a day is more than enough. Decadent, even. You’ve worked too hard for this to end now, for it to end like this, only—  Of course it’s not enough. You’re still not perfect. It doesn’t matter how skinny you are if you’re ugly. Thin and beautiful, that’s the ticket. Only you chickened out at the end, before they were finished. One last procedure, that’s all. One last procedure, and you’ll finally know what it’s like to be pretty.  Dr. Bernstein handles the height augmentation—he always does the best job, gets all the best dwarfs. Not that you’re a midget. Or are they little people now?  Over the course of six months, he breaks each leg three times in three different places. With the help of a special brace while they heal, he gives you another two and one-eighth inches of height. You grin and bear the pain, because it’s worth it. It’s so worth it. It’s gotta be worth it.  It is worth it, for the pain pills he prescribes afterward if nothing else.  One day in his office for a follow-up exam, you pick up last month’s medical science journal and see an article about hip replacements. About strong, light, titanium alloys. It seems so obvious. Why hadn’t you thought of it before?  You dip into the trust fund (thankful your parents got that big life insurance policy just in time) and pull some strings, grease some wheels, sign some waivers. Three hundred thousand dollars and seven months later, 88% of your bones have been replaced by man-made parts, some lighter than the original by as much as half an ounce. The doctor even helps you pick out the supplements you need to purchase every month from the local GNC to stay healthy.  “Vitamin D,” he reiterates before you leave. “It’s very important to get your vitamin D.”  You step on the scale and smile.  You’ve done it. For sure, this time. You jump up and down, squealing with delight, and clap your hands. They clank a little mechanically now, but the sound is actually quite musical, once you get used to it. Spots dance in front of your eyes. You begin to sweat. You shouldn’t be exerting yourself so much, silly girl. Take a caffeine pill.  Whew, that’s better. Now . . . what were you doing?  Oh yes. The celebration!  You go to your favorite restaurant—you sit at your favorite table—and the waiter, the cute Spanish one who always flirts with you, smiles and brings you your regular order. You take a long moment and smell the delicious aroma of the non-fat artificial vanilla flavoring ice cream substitute, and it’s heaven. You’re in heaven. You know it’s the wrong thing to do, you know that it’s bad for you, but you can’t help yourself: you put your spoon into the ice cream, and then inside your mouth!  Oooohhh, everything is so cold and delicious! You let the ice cream substitute melt on your tongue, you let it run over your taste buds, you shiver in delight until—  Enough! You can’t take it anymore! You run to the bathroom and rinse out your mouth with some of the bottled water in your purse. Can’t be accidentally swallowing any, you naughty thing! In your haste to cleanse the badness, you spray water out all over the mirror.  But what if you were too late? What if you already had swallowed some, just a little, so little that you hadn’t even noticed? You go into the stall and shut the door behind you, and you’re proud for a moment that you don’t even need to use your fingers anymore.  When you go to see the doctor the following day, you lift up your shirt and he pinches you with cold metal on your stomach, your back, your thighs.  He frowns. “This can’t be right,” he says. He looks confused. He stares at you. He helps you stand up and takes you over to the scales. He fiddles with the weights for a few minutes, but no matter what he does it still says the same thing. You smile your secret little smile, the one you smile sometimes when your face is too tired for the other one, the one others can see, and you know that the instrument is correct. You know it, but it’s just not official until a doctor says so. No—the Doctor. Capital D. You can’t wait to hear him say it. You can’t wait to hear him say it, you can’t wait to hear him say it. You can’t wait. What the hell is he waiting for?  “Abigail,” he says, finally giving up on the scale, “I don’t understand it. How can you be six-two, weigh only fourteen pounds, and still be alive?”  You smile at him with the other smile, the external one, even though the effort threatens to prematurely wear you out. “I know, doctor. I amaze even myself sometimes.”  You strut a little as you walk out of the office.  Six weeks later, you meet the man of your dreams: a multibillionaire prince in exile, who makes his home in Connecticut now that the royal family of—wherever, you were never good at geography—has fallen out of favor. What makes him so special, though, is that you like him for who he is, and he likes you for who you are. It’s not your body—so perfect now, after all of your hard work—or his money and his title. No, it’s the little things that make the two of you work so well together, like how each of you can’t help but smile when you see the other and how you never run out of things to talk about. You know, the important stuff.  In fact, both of you were madly, wildly, truly in love (with the stars in your eyes and that warm glow in your hearts) well before it registered in your brains: it was the crotch-area that caught on first, you joke to all of your jealous friends.  Someday, if they’re lucky, maybe they can find a catch half as good. The poor plain things.  Two months after you meet him, the day finally arrives. The day, the one you both worked so hard to obtain: your wedding day. You have on a simple white dress, no train, with very little lace work around the top. It accentuates your augmented bosom, and the rail-thin, rock-hard abdomen you sweated blood and tears and money to earn. The one extravagance in the simple ensemble is the veil—so large, airy, and white it looks like a cloud-halo around your head. That’s why you bought it. He always calls you his little angel.  You step out of the limo on the big day and begin walking up the steps to the church. You take your time, resting every few steps and swallowing caffeine pills for energy when necessary. It’s hard to do something so physical now that you’ve perfected your body, but the thought of your prince waiting for you at the top gives your blood all the strength and vigor it needs—until it happens.  Damn the veil. It would never have happened without the veil. You’re so thin, so perfect! There would have been no purchase for the wind. But you are wearing the veil, and you can’t take it back now even though you scream as the gust of air slams into you from the side and lifts you up into the sky.  The veil spreads out, all fifty thousand dollars of it, and it catches the wind almost as though it had been designed to do so from the very beginning, almost as though you really are an angel and the veil is your wings. You rise up into the air, higher and higher, and for a second your strained heart beats so fast that you are afraid it will burst. So you hold off on the caffeine pill you were about to swallow until it slows down again.  Your prince sees it all happen from the chapel, and he races from the church to his car. His driver speeds off while he makes a call on his cell phone, and for two whole minutes you see nothing of him at all until—it comes. The private helicopter. You smile when you see that your prince himself is there within it, right beside the pilot, shouting orders and gesturing wildly at you, his love. His princess. His angel.  The chopper closes in, but it doesn’t work. You’re far too light now, and the veil is far too efficient at catching the wind. Whenever the helicopter rises up to meet you, the gusts created by its whirling blades do nothing but send you higher and higher into the atmosphere.  Eventually the air is too thin for the helicopter to follow. You watch as it recedes, shrinking beneath you, becoming smaller and smaller—a dot—until finally, it is gone. The whole of planet Earth takes its place in stretching out beneath your feet, and you wave hello.  I’m queen of the world, you think. Smiling, you reach out with your arms and grab hold of the moon, pulling it to your bosom and snuggling close.  You wish mom were alive to see you, but she isn’t and doesn’t, and in fact, no one ever sees you again. Not ever. But late at night, your many friends and the adoring public that fawned so jealously after your fairy tale wedding to the prince of—wherever—often look up into the sparkling sky. Up at your legend, to stare and silently wonder at which light above was added on that blustery, almost wedding day in March.  All of them, you say in your secret voice. All of them.  But they don’t hear you. And every time you think of using your other voice, the one they could hear, it hardly seems worth the effort. Jeremiah Sturgill lives and writes in Fredericksburg, Virginia. \"Flight\" is his second published story. The first, \"Songbird,\" was published by Baen's Universe in late 2006. In 2005, he graduated from Mary Washington University and started Son and Foe, a fiction e-zine that crashed and burned a year later with spectacular predictability (but not before publishing a number of really great stories). In late 2007, he stopped talking at parties about this novel he planned on writing, and he began talking about this novel he'd finished. Sometime in the next twenty years, he hopes to actually sell the damn thing.", "text": "2230 words, short story\nFlight\nBrow lift. Neck lift. Face lift.\nBlepharoplasty—not familiar with the term? Pretend I said eyelid surgery. To make them slant to the outside, that’s all; the exotic look is in. Trust us. You’ll love it. Rhinoplasty—a nose job, that’s all. Not just a reshaping, mind you, but a reimagining. First, we’ll add that beautiful upward tilt (yes, like hers—and hers—and hers), then we’ll reduce the size and narrow the bridge. You may need to breathe through your mouth afterwards, but once we cap your teeth, you’ll thank us for it.\nNext is cosmetic otoplasty—that’s for your ears—followed by collagen injections in your lips and cheeks. Removal of your second chin, and the insertion of an implant to help shape the first one. Permanent laser hair removal below your lower lip, above your upper lip, and for your sideburns too (I can’t believe you have sideburns!). We may as well take off your eyebrows while we are at it. You can draw them on in the future, if you want to go retro. Or schedule a follow-up for replacements, if they come back in style.\nLiposuction’s next, then abdominoplasty (just another word for tummy tuck, girl, no need to worry). After that, we’ll staple your stomach, reshape your buttocks, and make sure your love handles are all-the-way gone—nip and tuck and all that nonsense. You get the idea.\nOf course, there’s still the grand finale, the one no woman would be complete without: breast augmentation. Enlargement and reshaping in your case. In most cases, actually, but that’s not important. All you have to do is show up. We mail you the bill.\nThe last day comes and it’s done—you’re done, it’s all downhill from there. Just a few months of rehabilitation, followed by a simple maintenance routine. A chemical peel treatment and derm abrasion therapy every now and then for your complexion, along with the daily, oil-free, skin-exfoliating face wash. And that Hollywood all-liquid seven-day miracle diet? Why not. Couldn’t hurt. Fen-Phen and caffeine pills? Sure. If anything goes wrong, you can always file a lawsuit.\nAll right. You’ve been faithful. You’ve done everything you needed to do, and it has worked. You can hardly believe that beautiful woman in the mirror is you.\nCatching your breath in the doctor’s office, you don’t even mind the wait. It feels good just to sit still. Well, not still. Your foot keeps twitching, and you can’t seem to make it stop. But why would you want to? It’s good to keep moving. Helps burn those calories.\nThey call your name and you walk into the examination room and sit down again. Your foot keeps up its hypnotic spasming, and everything looks like it’s underwater. He comes out, the doctor does, and you lift up your shirt. He pinches you with cold metal on your stomach, your back, your thighs.\n“Abigail, I’m sorry,” he says, and you can see it in his eyes: the news is bad. “Your body-fat index is point-oh-six.” He looks like he wants to cry.\nYou can’t help yourself. You cry. You deserve to feel bad, tubby. Fatso. Whale. Blimp. Pig. Point-oh-six? How could you have been so weak? Too many calories, that’s the problem. You stumble on your way out of the office, ignoring the secretary when she calls out your name. You decide then and there that something’s going to have to give, and isn’t going to be you. You cut you intake in half—three hundred calories a day is more than enough. Decadent, even. You’ve worked too hard for this to end now, for it to end like this, only—\nOf course it’s not enough. You’re still not perfect. It doesn’t matter how skinny you are if you’re ugly. Thin and beautiful, that’s the ticket. Only you chickened out at the end, before they were finished. One last procedure, that’s all. One last procedure, and you’ll finally know what it’s like to be pretty.\nDr. Bernstein handles the height augmentation—he always does the best job, gets all the best dwarfs. Not that you’re a midget. Or are they little people now?\nOver the course of six months, he breaks each leg three times in three different places. With the help of a special brace while they heal, he gives you another two and one-eighth inches of height. You grin and bear the pain, because it’s worth it. It’s so worth it. It’s gotta be worth it.\nIt is worth it, for the pain pills he prescribes afterward if nothing else.\nOne day in his office for a follow-up exam, you pick up last month’s medical science journal and see an article about hip replacements. About strong, light, titanium alloys. It seems so obvious. Why hadn’t you thought of it before?\nYou dip into the trust fund (thankful your parents got that big life insurance policy just in time) and pull some strings, grease some wheels, sign some waivers. Three hundred thousand dollars and seven months later, 88% of your bones have been replaced by man-made parts, some lighter than the original by as much as half an ounce. The doctor even helps you pick out the supplements you need to purchase every month from the local GNC to stay healthy.\n“Vitamin D,” he reiterates before you leave. “It’s very important to get your vitamin D.”\nYou step on the scale and smile.\nYou’ve done it. For sure, this time. You jump up and down, squealing with delight, and clap your hands. They clank a little mechanically now, but the sound is actually quite musical, once you get used to it. Spots dance in front of your eyes. You begin to sweat. You shouldn’t be exerting yourself so much, silly girl. Take a caffeine pill.\nWhew, that’s better. Now . . . what were you doing?\nOh yes. The celebration!\nYou go to your favorite restaurant—you sit at your favorite table—and the waiter, the cute Spanish one who always flirts with you, smiles and brings you your regular order. You take a long moment and smell the delicious aroma of the non-fat artificial vanilla flavoring ice cream substitute, and it’s heaven. You’re in heaven. You know it’s the wrong thing to do, you know that it’s bad for you, but you can’t help yourself: you put your spoon into the ice cream, and then inside your mouth!\nOooohhh, everything is so cold and delicious! You let the ice cream substitute melt on your tongue, you let it run over your taste buds, you shiver in delight until—\nEnough! You can’t take it anymore! You run to the bathroom and rinse out your mouth with some of the bottled water in your purse. Can’t be accidentally swallowing any, you naughty thing! In your haste to cleanse the badness, you spray water out all over the mirror.\nBut what if you were too late? What if you already had swallowed some, just a little, so little that you hadn’t even noticed? You go into the stall and shut the door behind you, and you’re proud for a moment that you don’t even need to use your fingers anymore.\nWhen you go to see the doctor the following day, you lift up your shirt and he pinches you with cold metal on your stomach, your back, your thighs.\nHe frowns. “This can’t be right,” he says. He looks confused. He stares at you. He helps you stand up and takes you over to the scales. He fiddles with the weights for a few minutes, but no matter what he does it still says the same thing. You smile your secret little smile, the one you smile sometimes when your face is too tired for the other one, the one others can see, and you know that the instrument is correct. You know it, but it’s just not official until a doctor says so. No—the Doctor. Capital D. You can’t wait to hear him say it. You can’t wait to hear him say it, you can’t wait to hear him say it. You can’t wait. What the hell is he waiting for?\n“Abigail,” he says, finally giving up on the scale, “I don’t understand it. How can you be six-two, weigh only fourteen pounds, and still be alive?”\nYou smile at him with the other smile, the external one, even though the effort threatens to prematurely wear you out. “I know, doctor. I amaze even myself sometimes.”\nYou strut a little as you walk out of the office.\nSix weeks later, you meet the man of your dreams: a multibillionaire prince in exile, who makes his home in Connecticut now that the royal family of—wherever, you were never good at geography—has fallen out of favor. What makes him so special, though, is that you like him for who he is, and he likes you for who you are. It’s not your body—so perfect now, after all of your hard work—or his money and his title. No, it’s the little things that make the two of you work so well together, like how each of you can’t help but smile when you see the other and how you never run out of things to talk about. You know, the important stuff.\nIn fact, both of you were madly, wildly, truly in love (with the stars in your eyes and that warm glow in your hearts) well before it registered in your brains: it was the crotch-area that caught on first, you joke to all of your jealous friends.\nSomeday, if they’re lucky, maybe they can find a catch half as good. The poor plain things.\nTwo months after you meet him, the day finally arrives. The day, the one you both worked so hard to obtain: your wedding day. You have on a simple white dress, no train, with very little lace work around the top. It accentuates your augmented bosom, and the rail-thin, rock-hard abdomen you sweated blood and tears and money to earn. The one extravagance in the simple ensemble is the veil—so large, airy, and white it looks like a cloud-halo around your head. That’s why you bought it. He always calls you his little angel.\nYou step out of the limo on the big day and begin walking up the steps to the church. You take your time, resting every few steps and swallowing caffeine pills for energy when necessary. It’s hard to do something so physical now that you’ve perfected your body, but the thought of your prince waiting for you at the top gives your blood all the strength and vigor it needs—until it happens.\nDamn the veil. It would never have happened without the veil. You’re so thin, so perfect! There would have been no purchase for the wind. But you are wearing the veil, and you can’t take it back now even though you scream as the gust of air slams into you from the side and lifts you up into the sky.\nThe veil spreads out, all fifty thousand dollars of it, and it catches the wind almost as though it had been designed to do so from the very beginning, almost as though you really are an angel and the veil is your wings. You rise up into the air, higher and higher, and for a second your strained heart beats so fast that you are afraid it will burst. So you hold off on the caffeine pill you were about to swallow until it slows down again.\nYour prince sees it all happen from the chapel, and he races from the church to his car. His driver speeds off while he makes a call on his cell phone, and for two whole minutes you see nothing of him at all until—it comes. The private helicopter. You smile when you see that your prince himself is there within it, right beside the pilot, shouting orders and gesturing wildly at you, his love. His princess. His angel.\nThe chopper closes in, but it doesn’t work. You’re far too light now, and the veil is far too efficient at catching the wind. Whenever the helicopter rises up to meet you, the gusts created by its whirling blades do nothing but send you higher and higher into the atmosphere.\nEventually the air is too thin for the helicopter to follow. You watch as it recedes, shrinking beneath you, becoming smaller and smaller—a dot—until finally, it is gone. The whole of planet Earth takes its place in stretching out beneath your feet, and you wave hello.\nI’m queen of the world, you think. Smiling, you reach out with your arms and grab hold of the moon, pulling it to your bosom and snuggling close.\nYou wish mom were alive to see you, but she isn’t and doesn’t, and in fact, no one ever sees you again. Not ever. But late at night, your many friends and the adoring public that fawned so jealously after your fairy tale wedding to the prince of—wherever—often look up into the sparkling sky. Up at your legend, to stare and silently wonder at which light above was added on that blustery, almost wedding day in March.\nAll of them, you say in your secret voice. All of them.\nBut they don’t hear you. And every time you think of using your other voice, the one they could hear, it hardly seems worth the effort.\nJeremiah Sturgill lives and writes in Fredericksburg, Virginia. \"Flight\" is his second published story. The first, \"Songbird,\" was published by Baen's Universe in late 2006. In 2005, he graduated from Mary Washington University and started Son and Foe, a fiction e-zine that crashed and burned a year later with spectacular predictability (but not before publishing a number of really great stories). In late 2007, he stopped talking at parties about this novel he planned on writing, and he began talking about this novel he'd finished. Sometime in the next twenty years, he hopes to actually sell the damn thing.", "source": "https://clarkesworldmagazine.com/sturgill_04_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Flight by Jeremiah Sturgill"}