{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "xnx6+O5zPre34klGP+sdD3Z6C5c=", "id": null, "license": null, "comments": "", "raw_text": "Interview  The Cost of Doing Good: A Conversation with Octavia Cade  New Zealand author Octavia Cade had always planned to be a scientist when she grew up. “But as much as I love science, scientific writing sucked all my enthusiasm out. It’s the worst. It’s boring and inaccessible and scientists have no right to whine about people misunderstanding science when they have done everything they can to keep them from it.” Cade studied botany as an undergrad, and “became fascinated with algae and the intertidal zone.” She earned her master’s in biology, looking at reproductive strategies of a native seagrass, and her PhD in science communication at the University of Otago, “the biggest scicomm center in the world . . . and it’s a fantastic place to study.”  Cade attended Clarion West in 2016 and was the 2020 writer-in-residence at Massey University/Square Edge—the first time the residency has gone to a speculative fiction writer. But she’d been landing fiction sales long beforehand, starting with “Trading Rosemary” in the July 2010 issue of Bards and Sages Quarterly. By the time she started at Clarion West, she’d already sold a slew of work to a variety of venues, including Strange Horizons, The Dark, Apex, and Cosmos; she’d self-published novel The August Birds; and her short story, “The Mussel Eater,” published at The Book Smugglers, had landed a BSFA nomination.  Octavia Cade has been nominated for an Elgin Award and a Stoker Award, and has won three Vogel Awards, for novellas The Ghost of Matter (Paper Road Press) and The Convergence of Fairy Tales (The Book Smugglers), and for her articles on food and horror written for The Book Smugglers. Besides these, she’s written academic papers on speculative fiction, she has two poetry collections (Chemical Letters published by Popcorn Press and Mary Shelley Makes a Monster published by Aqueduct Press), a short story collection The Mythology of Salt and Other Stories (Lethe Press), and the well-received novel The Stone Wētā, expanded from a Clarkesworld story and published by Paper Road Press in 2020.  Octavia Cade’s newest title is novella The Impossible Resurrection of Grief, which she wrote during her Massey residency. The book is due from Stelliform Press on May 20, 2021.   What were some of the most important genre works for you when you were younger, and has your view of those works changed over time?  My parents were both big fans of SFF, and my mum made sure that me and my sister watched Star Trek. She didn’t have to work very hard to get us both interested, we very quickly became absolutely obsessed with it. The same with the Narnia series. I had the books—The Lion, the Witch and the Wardrobe is the first book I really remember reading—but we also had the clunky old BBC version where poor Lucy had a bowl cut and the beavers had the worst costumes of all time, and we loved it. I did not love The Last Battle. It remains the only book I have ever thrown across a room in disgust. Child me hated it and adult me does as well—misogynistic, death-glorifying claptrap that it is. (One of my SFF bucket list goals is to edit a collection of stories about Susan, where she fucks off out of Narnia into the real world and is happy and successful there.)  Perhaps the most important books for me, though, were The Dark Is Rising series by Susan Cooper and Under the Mountain by NZ writer Maurice Gee. I read them over and over again and still do. They were the first stories I read where the good guys did absolutely terrible things in the service of good, and just had to live with it. Under the Mountain had its preteen protagonists commit genocide. Admittedly, it was against the most terrifying alien species I had ever encountered in fiction—to this day, nothing creeps me out like the Wilberforces—and if they hadn’t done it, all life on Earth would have been destroyed . . . but it was still genocide. Cooper and Gee dumped these terrible choices in front of their readers and really made them weigh what good cost. I adored them then and still do, so I guess you could say my reading opinions set solid early.  Did these books or stories have any measurable effect on your writing?  Yes. Choices cost. I do a lot of writing involving science history and the choices made there—the development of chemical warfare, the Manhattan Project that developed the atomic bomb. Some scientists refused to work on these things. Some couldn’t wait to do so. Some of them, afterward, were crippled by guilt, and some were eager to work on the next iteration of horror. Neither The Dark Is Rising series nor Under the Mountain involved ethics in science, but every story I write about ethics and science is traced back to the influence of those stories.  You have two novels out, a number of novellas, and at this point, fifty or so short stories. Is your approach to writing short fiction different in important ways from your approach with novella- or novel-length work?  Ha. No. My longer work is essentially standalone short stories strung together. This has made a lot of the longer stuff particularly challenging to sell, as it often ends up quite unfocused, sort of unmoored within itself. I don’t care. I love writing short fiction. Novels are a chore, and I can only manage them by writing short fiction and smashing it together in the hope it’ll somehow stick. I actually like the amorphous, fractured nature of the faux-novels I write—I write exactly what I want to read.  What I like about short fiction is how much it expects from writers . . . and from readers. You don’t have the space, as a writer, to make every connection, to round out every character and plot point. You have to leave space and subtlety and trust that readers can fill in the gaps themselves. It encourages interaction between writer and reader in a very different way than longer works do, I think.  Your first short story publication was in 2010, and your most recent novel came out in 2020. Has your writing changed in specific ways since that first publication? Did working on novels impact the way you write shorter fiction?  It’s changed in that I have a much clearer focus in what I want to write now. The early stories were pretty basic, some of them—although the 2012 vampire short “Cuckoo” is still one of the most layered, interesting things I’ve ever written, I think—and they were mostly just fumbling around. I’d never wanted to be a writer as a kid, so I hadn’t any set expectations when I started. The better I got, however, and the more I worked, the clearer my focus became: science history, ecological fiction, extremely pragmatic and often very restrained female characters, who tend to come across as unpleasantly self-centered. (That’s the influence of Susan, I suppose—whatever else they are, they know their worth and they do not apologize for it.)  You recommend readers look at “We Feed the Bears of Fire and Ice” and “The Stone Weta.” What is it about these stories that makes them stand out for you?  They’re clever and they’re vicious. They’re products of anger. When I talk about science and ethics, this is what it comes to: the choices made by producers of science, and the choices made by consumers of it. “We Feed the Bears of Fire and Ice” links news articles of science being effectively censored by governments, and “The Stone Wētā” also developed from a news story of science being archived across borders, in order to save it from the censorship of anti-science governments.  These things matter. I’m not fumbling around with short stories for the hell of it. I do it because I have something to say.  “When I’m not thinking about science I’m thinking about horror.” Your work has appeared in a number of respected horror venues. What do you enjoy most about writing and reading horror, and what makes for a great piece of horror fiction?  Comprehension. I don’t care about slasher horror, and I don’t care about gore. I care about compromise, and horror is the genre of compromise. What will you do, what will you sacrifice? I had a story last year in The Dark called “Otto Hahn Speaks to the Dead.” The dead was Clara Immerwahr, who was a chemist married to another chemist: Fritz Haber, the guy who invented chlorine gas for use in WWI trenches. She was disgusted by him, and who can blame her.  After the first successful use of gas he came home and threw a party, and at the end of the party she shot herself in their garden with her husband’s gun. It was preferable, I imagine, to ever having to touch him again. Clara and Haber had a young son—she died in his arms. Haber went back to the front the next day, in order to gas more of other people’s sons, which just goes to show how much he cared for his own. Their son eventually killed himself as well.  That, to me, is horror in its purest form. It’s evil and tragedy and power, and temptation, because so many scientists have been so tempted.  It is so easy to justify the things we want to do.  One of the things The Impossible Resurrection of Grief tackles is human impact on the environment and nature. What is your relationship to this topic—is it something you come back to often? Is it something you’ve always addressed in your work?  It’s not something I’ve always addressed, but it’s increasingly become the focus of my work and I don’t see that changing. It’s the issue of our time, and the consequences will be monstrous.  What was the journey like with The Impossible Resurrection of Grief? What was the initial inspiration, how did the story develop, and did the book change much from conception?  The Great Barrier Reef is dying. That’s my inspiration. It’s dying and I’ve never seen it, and isn’t that an example of framing horror in petty and personal ways? An ecosystem you can see from space, and its absence is primarily filtered by how it will affect me. And I could go and see it, but the travel it would take to get there, the carbon cost, would push the Reef just a little closer to the edge. So the question is, fundamentally, how selfish am I? How much can I justify my choices? I don’t have children. That’s an enormous saving in carbon—does that mean I have earned a trip to the Reef, to see it before warming waters bleach it entirely?  I suspect I will justify it to myself one day. (It’s so easy to justify the things we want to do.)  What were the most challenging aspects of writing The Impossible Resurrection of Grief?  Probably the tone. It’s this bastard mix of science fiction and fairy tale and the uncanny, and it’s meant to be destabilizing. It’s meant to leave holes and unanswered questions and to be just plain fucking disturbing. I know I said above that I like to leave spaces for readers to inhabit, but sometimes the urge to explain things is so strong you need to take it out back and drown it in a bucket before you start telling people what to think instead of trying to make them decide for themselves.  Ruby, at the end of the novella, is on a knife-edge. Which way is she going to jump? It’s irrelevant. It doesn’t matter at all—what matters is what readers think they would do in her place. It’s a make your own ending, because it has to be, because that is the world that we live in so let’s look it in the face and make a choice and know what that choice is as we make it.  The book also delves into friendship, loneliness, and of course, The Grief. The writing feels intimate; the narrative brings the reader in close, and important moments feel deeply personal. What is the heart of this story for you?  Ecological grief. It’s an issue that’s getting more and more attention in academic literature. And it’s something, I think, that everyone can relate to. Most people have an environment, or an organism, that they’re attached to on a fundamental level—if it died, they’d bleed tears for it for the rest of their days. They may not understand why—and why am I so attached to an ecosystem I’ve never seen?—but that doesn’t matter either. Attached they are, and with the increasing effects of climate change and biodiversity loss, ecological grief is becoming an ever more pressing issue. And it’s a fascinating one . . .  What else are you working on, what else do you have coming up that readers can look forward to?  Oh, lots! I’m finishing up a mixed collection of short fiction and essays, The Biological Book of the Dead, that focuses on the intersections between science, experimentalism, ethics, and extinction. As well as the Massey residency last year, I spent some time as an artist-in-residence at the Christchurch Arts Centre, where I worked on a YA novel about Ernest Rutherford (I’m still working on it). And in July this year I have another residency at the Michael King Writers Centre in Auckland, where I’m working on a short fiction collection about conservation science in New Zealand after the apocalypse and how all the survivors come together to save our native birds. Basically because the poor things are all so endangered anyway and I’d prefer to see an optimistic postapocalyptic story, for once, where success is rated on a different scale than how violent you can be or how many resources (human or otherwise) that you can accumulate. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nThe Cost of Doing Good: A Conversation with Octavia Cade\nNew Zealand author Octavia Cade had always planned to be a scientist when she grew up. “But as much as I love science, scientific writing sucked all my enthusiasm out. It’s the worst. It’s boring and inaccessible and scientists have no right to whine about people misunderstanding science when they have done everything they can to keep them from it.” Cade studied botany as an undergrad, and “became fascinated with algae and the intertidal zone.” She earned her master’s in biology, looking at reproductive strategies of a native seagrass, and her PhD in science communication at the University of Otago, “the biggest scicomm center in the world . . . and it’s a fantastic place to study.”\nCade attended Clarion West in 2016 and was the 2020 writer-in-residence at Massey University/Square Edge—the first time the residency has gone to a speculative fiction writer. But she’d been landing fiction sales long beforehand, starting with “Trading Rosemary” in the July 2010 issue of Bards and Sages Quarterly. By the time she started at Clarion West, she’d already sold a slew of work to a variety of venues, including Strange Horizons, The Dark, Apex, and Cosmos; she’d self-published novel The August Birds; and her short story, “The Mussel Eater,” published at The Book Smugglers, had landed a BSFA nomination.\nOctavia Cade has been nominated for an Elgin Award and a Stoker Award, and has won three Vogel Awards, for novellas The Ghost of Matter (Paper Road Press) and The Convergence of Fairy Tales (The Book Smugglers), and for her articles on food and horror written for The Book Smugglers. Besides these, she’s written academic papers on speculative fiction, she has two poetry collections (Chemical Letters published by Popcorn Press and Mary Shelley Makes a Monster published by Aqueduct Press), a short story collection The Mythology of Salt and Other Stories (Lethe Press), and the well-received novel The Stone Wētā, expanded from a Clarkesworld story and published by Paper Road Press in 2020.\nOctavia Cade’s newest title is novella The Impossible Resurrection of Grief, which she wrote during her Massey residency. The book is due from Stelliform Press on May 20, 2021.\nWhat were some of the most important genre works for you when you were younger, and has your view of those works changed over time?\nMy parents were both big fans of SFF, and my mum made sure that me and my sister watched Star Trek. She didn’t have to work very hard to get us both interested, we very quickly became absolutely obsessed with it. The same with the Narnia series. I had the books—The Lion, the Witch and the Wardrobe is the first book I really remember reading—but we also had the clunky old BBC version where poor Lucy had a bowl cut and the beavers had the worst costumes of all time, and we loved it. I did not love The Last Battle. It remains the only book I have ever thrown across a room in disgust. Child me hated it and adult me does as well—misogynistic, death-glorifying claptrap that it is. (One of my SFF bucket list goals is to edit a collection of stories about Susan, where she fucks off out of Narnia into the real world and is happy and successful there.)\nPerhaps the most important books for me, though, were The Dark Is Rising series by Susan Cooper and Under the Mountain by NZ writer Maurice Gee. I read them over and over again and still do. They were the first stories I read where the good guys did absolutely terrible things in the service of good, and just had to live with it. Under the Mountain had its preteen protagonists commit genocide. Admittedly, it was against the most terrifying alien species I had ever encountered in fiction—to this day, nothing creeps me out like the Wilberforces—and if they hadn’t done it, all life on Earth would have been destroyed . . . but it was still genocide. Cooper and Gee dumped these terrible choices in front of their readers and really made them weigh what good cost. I adored them then and still do, so I guess you could say my reading opinions set solid early.\nDid these books or stories have any measurable effect on your writing?\nYes. Choices cost. I do a lot of writing involving science history and the choices made there—the development of chemical warfare, the Manhattan Project that developed the atomic bomb. Some scientists refused to work on these things. Some couldn’t wait to do so. Some of them, afterward, were crippled by guilt, and some were eager to work on the next iteration of horror. Neither The Dark Is Rising series nor Under the Mountain involved ethics in science, but every story I write about ethics and science is traced back to the influence of those stories.\nYou have two novels out, a number of novellas, and at this point, fifty or so short stories. Is your approach to writing short fiction different in important ways from your approach with novella- or novel-length work?\nHa. No. My longer work is essentially standalone short stories strung together. This has made a lot of the longer stuff particularly challenging to sell, as it often ends up quite unfocused, sort of unmoored within itself. I don’t care. I love writing short fiction. Novels are a chore, and I can only manage them by writing short fiction and smashing it together in the hope it’ll somehow stick. I actually like the amorphous, fractured nature of the faux-novels I write—I write exactly what I want to read.\nWhat I like about short fiction is how much it expects from writers . . . and from readers. You don’t have the space, as a writer, to make every connection, to round out every character and plot point. You have to leave space and subtlety and trust that readers can fill in the gaps themselves. It encourages interaction between writer and reader in a very different way than longer works do, I think.\nYour first short story publication was in 2010, and your most recent novel came out in 2020. Has your writing changed in specific ways since that first publication? Did working on novels impact the way you write shorter fiction?\nIt’s changed in that I have a much clearer focus in what I want to write now. The early stories were pretty basic, some of them—although the 2012 vampire short “Cuckoo” is still one of the most layered, interesting things I’ve ever written, I think—and they were mostly just fumbling around. I’d never wanted to be a writer as a kid, so I hadn’t any set expectations when I started. The better I got, however, and the more I worked, the clearer my focus became: science history, ecological fiction, extremely pragmatic and often very restrained female characters, who tend to come across as unpleasantly self-centered. (That’s the influence of Susan, I suppose—whatever else they are, they know their worth and they do not apologize for it.)\nYou recommend readers look at “We Feed the Bears of Fire and Ice” and “The Stone Weta.” What is it about these stories that makes them stand out for you?\nThey’re clever and they’re vicious. They’re products of anger. When I talk about science and ethics, this is what it comes to: the choices made by producers of science, and the choices made by consumers of it. “We Feed the Bears of Fire and Ice” links news articles of science being effectively censored by governments, and “The Stone Wētā” also developed from a news story of science being archived across borders, in order to save it from the censorship of anti-science governments.\nThese things matter. I’m not fumbling around with short stories for the hell of it. I do it because I have something to say.\n“When I’m not thinking about science I’m thinking about horror.” Your work has appeared in a number of respected horror venues. What do you enjoy most about writing and reading horror, and what makes for a great piece of horror fiction?\nComprehension. I don’t care about slasher horror, and I don’t care about gore. I care about compromise, and horror is the genre of compromise. What will you do, what will you sacrifice? I had a story last year in The Dark called “Otto Hahn Speaks to the Dead.” The dead was Clara Immerwahr, who was a chemist married to another chemist: Fritz Haber, the guy who invented chlorine gas for use in WWI trenches. She was disgusted by him, and who can blame her.\nAfter the first successful use of gas he came home and threw a party, and at the end of the party she shot herself in their garden with her husband’s gun. It was preferable, I imagine, to ever having to touch him again. Clara and Haber had a young son—she died in his arms. Haber went back to the front the next day, in order to gas more of other people’s sons, which just goes to show how much he cared for his own. Their son eventually killed himself as well.\nThat, to me, is horror in its purest form. It’s evil and tragedy and power, and temptation, because so many scientists have been so tempted.\nIt is so easy to justify the things we want to do.\nOne of the things The Impossible Resurrection of Grief tackles is human impact on the environment and nature. What is your relationship to this topic—is it something you come back to often? Is it something you’ve always addressed in your work?\nIt’s not something I’ve always addressed, but it’s increasingly become the focus of my work and I don’t see that changing. It’s the issue of our time, and the consequences will be monstrous.\nWhat was the journey like with The Impossible Resurrection of Grief? What was the initial inspiration, how did the story develop, and did the book change much from conception?\nThe Great Barrier Reef is dying. That’s my inspiration. It’s dying and I’ve never seen it, and isn’t that an example of framing horror in petty and personal ways? An ecosystem you can see from space, and its absence is primarily filtered by how it will affect me. And I could go and see it, but the travel it would take to get there, the carbon cost, would push the Reef just a little closer to the edge. So the question is, fundamentally, how selfish am I? How much can I justify my choices? I don’t have children. That’s an enormous saving in carbon—does that mean I have earned a trip to the Reef, to see it before warming waters bleach it entirely?\nI suspect I will justify it to myself one day. (It’s so easy to justify the things we want to do.)\nWhat were the most challenging aspects of writing The Impossible Resurrection of Grief?\nProbably the tone. It’s this bastard mix of science fiction and fairy tale and the uncanny, and it’s meant to be destabilizing. It’s meant to leave holes and unanswered questions and to be just plain fucking disturbing. I know I said above that I like to leave spaces for readers to inhabit, but sometimes the urge to explain things is so strong you need to take it out back and drown it in a bucket before you start telling people what to think instead of trying to make them decide for themselves.\nRuby, at the end of the novella, is on a knife-edge. Which way is she going to jump? It’s irrelevant. It doesn’t matter at all—what matters is what readers think they would do in her place. It’s a make your own ending, because it has to be, because that is the world that we live in so let’s look it in the face and make a choice and know what that choice is as we make it.\nThe book also delves into friendship, loneliness, and of course, The Grief. The writing feels intimate; the narrative brings the reader in close, and important moments feel deeply personal. What is the heart of this story for you?\nEcological grief. It’s an issue that’s getting more and more attention in academic literature. And it’s something, I think, that everyone can relate to. Most people have an environment, or an organism, that they’re attached to on a fundamental level—if it died, they’d bleed tears for it for the rest of their days. They may not understand why—and why am I so attached to an ecosystem I’ve never seen?—but that doesn’t matter either. Attached they are, and with the increasing effects of climate change and biodiversity loss, ecological grief is becoming an ever more pressing issue. And it’s a fascinating one . . .\nWhat else are you working on, what else do you have coming up that readers can look forward to?\nOh, lots! I’m finishing up a mixed collection of short fiction and essays, The Biological Book of the Dead, that focuses on the intersections between science, experimentalism, ethics, and extinction. As well as the Massey residency last year, I spent some time as an artist-in-residence at the Christchurch Arts Centre, where I worked on a YA novel about Ernest Rutherford (I’m still working on it). And in July this year I have another residency at the Michael King Writers Centre in Auckland, where I’m working on a short fiction collection about conservation science in New Zealand after the apocalypse and how all the survivors come together to save our native birds. Basically because the poor things are all so endangered anyway and I’d prefer to see an optimistic postapocalyptic story, for once, where success is rated on a different scale than how violent you can be or how many resources (human or otherwise) that you can accumulate.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/cade_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Cost of Doing Good: A Conversation with Octavia Cade by Arley Sorg"}