{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "E Lily Yu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "E+1tSoDegUN0fXNczD0AgfdbkRA=", "id": null, "license": null, "comments": "", "raw_text": "1490 words, short story  Daedalum, the Devil’s Wheel  Sit down, sit. You’ll hurt yourself jumping around like that. No, don’t shout. Quiet studio on a quiet night—a rare thing. Why ruin it?  Come from? Difficult question. I was there in the city of Shahr-e-Sukhteh when a potter glazed his bowl with a leaping goat. I was there when Ting Huan painted animals onto his paper zoetropes and set them slinking and lunging in the hot air from his lamp. I am in the twenty-fourth of a second between frames, where human perception fails. Right now, in fact, I’m shining on theater screens and on the glass of cathode-ray sets and in the liquid crystals of monitors across the world. And I’m here with you, because you called.  You didn’t? Usually my votary burns his arms against the lightbox, or dies over and over in a spare room where he can film himself taking an imaginary bullet to the chest, applying what he observes—ah. That scrape, where your head hit the corner of your desk. That would have been enough.  Naturally you’d fall asleep over your work. It’s one a.m. and you’ve been pulling eighty-hour weeks for as long as you can remember. Production deadlines, yes. No shame in that.  Can’t help, sorry. That’s your job. But lean your head against my shoulder. I’m sympathetic. I’ll listen.  What, the whiskers bother you? The beach-ball skull? The fangs? The tail? I thought you’d appreciate the potential for infinite stretch and squash. I’ll smooth them all out. How’s this?  Frogfaced is an unkind way of putting it. You didn’t have those objections to Maryanne, and she approximates the classic pair of stacked spheres.  Very simple. I can see right through you. You’re like a cel pegged under glass. Your four affairs. Your ten-year marriage, eroded by your devotion to me—I appreciate the compliment, by the way—and meanwhile Isabelle swelling, suspecting, expecting. Your lust for attention that leads you into other women’s arms. Your streak of mulishness. You’re a con man. A cheat. A shyster. A magician. I like you.  Not Him, no, but I’m the closest you’ll get to the quickening of life. Triacetate and clay and cats using their tails for canes. I’m on the other side of reality, the better side, where physics is like lipstick, dabbed on if needed, and there’s no such thing as death. It’s all in the splitting of the seconds, see.  Twenty-four frames every second, or the illusion stutters. Belief flickers and shatters. Even if they splice the ends together, the soundtrack will veer off. So I’m demanding, when it comes to sacrifices and offerings. At least 86,000 drawings for a feature film in two dimensions. In three, your weary flick, flick, flick through a dumbshow of polygons and nurbs, tweaking and torquing.  Speaking of offerings. Open your mouth for me. Wider, or it’ll cut you. Stop squirming. It’s only 35mm. There.  My left eye will do for lens and light. My right hand will be the takeup reel. Keep your chin up.  Here’s your life projected on the wall. Your parents in crayon, and there’s you—watching Looney Tunes in your pajamas, drawing penguins in the margins of your homework. It runs in your family. Your father loved Felix, and your grandfather snuck into nickelodeons on Saturdays. I’ll crank faster through the litany of school, except those stretches where you were scribbling pterodactyls and fish. There’s—what’s her name?—gone. Alice. Beth. Chenelle. Danielle. She liked your cats, at least until you started drawing them with howitzers.  Please stop moving, you’re making the picture shake. The faster I wind it out of you, the sooner this’ll be over.  Art school. Elizabeth and Farah, tall and short, marvelous until they found out about each other. Your classes in anatomy, visual effects, life drawing, character rigging. What a crude and clumsy portfolio. But here’s the job offer, finally. Here’s your two dirty, grueling years as an assistant. Here’s the second offer, the promotion, the raise. Now the wedding suit and blown-over chairs on the seaside. The late nights modeling and posing doe-eyed animals. The fights with Isabelle. Plates crashing to the floor. Cracking. Team meetings, sweat darkening an inch of your collar, making long wings under your arms. Your manager telling you how much your work stinks, how much he’d like to take your ideas into a cornfield and shoot them, how close you are to the edge of the axe.  That’s it, the reel’s run out. Feeling better? I thought so. Good to have it out, the fumes tend to build up explosively. Now—  Ah. I thought you’d never ask.  These are the standard packages:   A. Your work will spring to life. It will dance, it will convince, it will enchant. Your transfer of mocap to wireframe will never seem dull or mechanical. Your hollow shells will breathe and blink and blush. It will look like voodoo.  You’re interested, I can tell. Oh, easy. The accelerating pulse of color in your cheeks. Besides, I can guess. Thirty-six years old, overlooked, unknown, a failing marriage, a father-to-be. Success is survival.  The price for all of this? Merely—long, sleepless nights with me. Nine thousand of them. And your wrists. You have such lovely, supple wrists. I shall mount them in mahogany, I think. What do you say?  Of course, that’s only sensible. I’d want to know, too.   B. is a rise. Not meteoric, but assured. Lead animator, then director of animation five years later. Doesn’t that sound nice? That’s not all. Shortly afterwards, you become head of the studio, or you split off to form your own profitable company. The less expensive option, this.  Expensive? You’d make oodles off of it! You’d be famous! Admired! Fawned over! Only gradually would you notice, as you floated up like a birthday balloon, how far you always were from your pen and tablet. The animated films you produce, your name splashed everywhere, you’ll never touch with your own hands. All the work will be done by other people’s brushes and pencils and styluses. You’ll be so busy with decisions and budgets that you won’t have a thought to spare for art, for the boy you were at seven, doodling flip books at the kitchen table. So.  No? Not satisfied? Neither of these appeal to you? A true artist! You have talent. I can see that. You want to press your fingerprints into history.  Well then. I offer you hunger. A mastery of my arts and an inextinguishable desire to do things better and differently. Break the box. Upset the game.  Others? Of course. Charles-Emile Reynaud. William Friese-Greene. Méliès. Yes, all of them. Yes.  Why, nothing at all. Not a clipping from your fingernail. Not a red cent.  I am quite serious.  An intelligent question. Only if you stand still. Only if you stop innovating. Take Reynaud, for example, smashing his praxinoscope as the more fashionable cinématographe swept Paris. Friese-Greene dying with the price of a cinema ticket in his pocket, which was all the money he had. One shilling and tenpence. The others—them too. You must not stand still. My hunger is a painted wolf that will chase you around the whirling rim of the world. Run, spin the wheel, and life will pour from your fingers. Geometry and time will be your dogs. Hesitate, let the bowl turn without you, and—snap! you are mine.  That was a joke. You are one of mine and always were. The question is, do I like you better at your desk, or do I prefer your median nerve coiled delicately on a cracker with caviar to taste?  Ha! That was also a joke! Why flinch? You used to appreciate the soft, surreal psychosis of cartoons. Mallets and violence! Bacchanals, decapitations, shotguns, dynamite! That’s my sense of humor.  I don’t give, darling. I take. Sometimes I negotiate. It’s always unfair.  Choose. Don’t make me wait, or you’ll wake up with stabbing pains in your arms and claws for hands. A slow dissolve on your career. No love, no money, no lasting memory.  Begging doesn’t suit you. Your heart’s transparent to me. I don’t give a pixel more than you do for your family. Your Isabelle would be only too happy—but to the point. Our transaction.  They can’t hear you from here.  Certain privileges come with being a monarch of time and a master in the persistence of vision. I am nothing in the security cameras. Not a shiver. Not a blot.  Are you sure? A kiss, then, to seal the bargain. I’ll peel this little yellow light out of you. You won’t be needing it.  A gift I gave you, once. No matter. Tonight your department head will dream of you and what you could become. Expect a meeting next week.  You might. But you’ll have the odor of vinegar to remember me by.  From the decay of acetate film.  No, I would never think of calling you a coward.  E. Lily Yu received the John W. Campbell Award for Best New Writer in 2012 and the Gar LaSalle Storyteller Award in 2017. Her stories have appeared in venues from McSweeney's to F&SF, including seven best-of-the-year anthologies, and been finalists for the Hugo, Nebula, Locus, Sturgeon, and World Fantasy Awards. Recent work appears in Hazlitt and Tor.com.", "text": "1490 words, short story\nDaedalum, the Devil’s Wheel\nSit down, sit. You’ll hurt yourself jumping around like that. No, don’t shout. Quiet studio on a quiet night—a rare thing. Why ruin it?\nCome from? Difficult question. I was there in the city of Shahr-e-Sukhteh when a potter glazed his bowl with a leaping goat. I was there when Ting Huan painted animals onto his paper zoetropes and set them slinking and lunging in the hot air from his lamp. I am in the twenty-fourth of a second between frames, where human perception fails. Right now, in fact, I’m shining on theater screens and on the glass of cathode-ray sets and in the liquid crystals of monitors across the world. And I’m here with you, because you called.\nYou didn’t? Usually my votary burns his arms against the lightbox, or dies over and over in a spare room where he can film himself taking an imaginary bullet to the chest, applying what he observes—ah. That scrape, where your head hit the corner of your desk. That would have been enough.\nNaturally you’d fall asleep over your work. It’s one a.m. and you’ve been pulling eighty-hour weeks for as long as you can remember. Production deadlines, yes. No shame in that.\nCan’t help, sorry. That’s your job. But lean your head against my shoulder. I’m sympathetic. I’ll listen.\nWhat, the whiskers bother you? The beach-ball skull? The fangs? The tail? I thought you’d appreciate the potential for infinite stretch and squash. I’ll smooth them all out. How’s this?\nFrogfaced is an unkind way of putting it. You didn’t have those objections to Maryanne, and she approximates the classic pair of stacked spheres.\nVery simple. I can see right through you. You’re like a cel pegged under glass. Your four affairs. Your ten-year marriage, eroded by your devotion to me—I appreciate the compliment, by the way—and meanwhile Isabelle swelling, suspecting, expecting. Your lust for attention that leads you into other women’s arms. Your streak of mulishness. You’re a con man. A cheat. A shyster. A magician. I like you.\nNot Him, no, but I’m the closest you’ll get to the quickening of life. Triacetate and clay and cats using their tails for canes. I’m on the other side of reality, the better side, where physics is like lipstick, dabbed on if needed, and there’s no such thing as death. It’s all in the splitting of the seconds, see.\nTwenty-four frames every second, or the illusion stutters. Belief flickers and shatters. Even if they splice the ends together, the soundtrack will veer off. So I’m demanding, when it comes to sacrifices and offerings. At least 86,000 drawings for a feature film in two dimensions. In three, your weary flick, flick, flick through a dumbshow of polygons and nurbs, tweaking and torquing.\nSpeaking of offerings. Open your mouth for me. Wider, or it’ll cut you. Stop squirming. It’s only 35mm. There.\nMy left eye will do for lens and light. My right hand will be the takeup reel. Keep your chin up.\nHere’s your life projected on the wall. Your parents in crayon, and there’s you—watching Looney Tunes in your pajamas, drawing penguins in the margins of your homework. It runs in your family. Your father loved Felix, and your grandfather snuck into nickelodeons on Saturdays. I’ll crank faster through the litany of school, except those stretches where you were scribbling pterodactyls and fish. There’s—what’s her name?—gone. Alice. Beth. Chenelle. Danielle. She liked your cats, at least until you started drawing them with howitzers.\nPlease stop moving, you’re making the picture shake. The faster I wind it out of you, the sooner this’ll be over.\nArt school. Elizabeth and Farah, tall and short, marvelous until they found out about each other. Your classes in anatomy, visual effects, life drawing, character rigging. What a crude and clumsy portfolio. But here’s the job offer, finally. Here’s your two dirty, grueling years as an assistant. Here’s the second offer, the promotion, the raise. Now the wedding suit and blown-over chairs on the seaside. The late nights modeling and posing doe-eyed animals. The fights with Isabelle. Plates crashing to the floor. Cracking. Team meetings, sweat darkening an inch of your collar, making long wings under your arms. Your manager telling you how much your work stinks, how much he’d like to take your ideas into a cornfield and shoot them, how close you are to the edge of the axe.\nThat’s it, the reel’s run out. Feeling better? I thought so. Good to have it out, the fumes tend to build up explosively. Now—\nAh. I thought you’d never ask.\nThese are the standard packages:\nA. Your work will spring to life. It will dance, it will convince, it will enchant. Your transfer of mocap to wireframe will never seem dull or mechanical. Your hollow shells will breathe and blink and blush. It will look like voodoo.\nYou’re interested, I can tell. Oh, easy. The accelerating pulse of color in your cheeks. Besides, I can guess. Thirty-six years old, overlooked, unknown, a failing marriage, a father-to-be. Success is survival.\nThe price for all of this? Merely—long, sleepless nights with me. Nine thousand of them. And your wrists. You have such lovely, supple wrists. I shall mount them in mahogany, I think. What do you say?\nOf course, that’s only sensible. I’d want to know, too.\nB. is a rise. Not meteoric, but assured. Lead animator, then director of animation five years later. Doesn’t that sound nice? That’s not all. Shortly afterwards, you become head of the studio, or you split off to form your own profitable company. The less expensive option, this.\nExpensive? You’d make oodles off of it! You’d be famous! Admired! Fawned over! Only gradually would you notice, as you floated up like a birthday balloon, how far you always were from your pen and tablet. The animated films you produce, your name splashed everywhere, you’ll never touch with your own hands. All the work will be done by other people’s brushes and pencils and styluses. You’ll be so busy with decisions and budgets that you won’t have a thought to spare for art, for the boy you were at seven, doodling flip books at the kitchen table. So.\nNo? Not satisfied? Neither of these appeal to you? A true artist! You have talent. I can see that. You want to press your fingerprints into history.\nWell then. I offer you hunger. A mastery of my arts and an inextinguishable desire to do things better and differently. Break the box. Upset the game.\nOthers? Of course. Charles-Emile Reynaud. William Friese-Greene. Méliès. Yes, all of them. Yes.\nWhy, nothing at all. Not a clipping from your fingernail. Not a red cent.\nI am quite serious.\nAn intelligent question. Only if you stand still. Only if you stop innovating. Take Reynaud, for example, smashing his praxinoscope as the more fashionable cinématographe swept Paris. Friese-Greene dying with the price of a cinema ticket in his pocket, which was all the money he had. One shilling and tenpence. The others—them too. You must not stand still. My hunger is a painted wolf that will chase you around the whirling rim of the world. Run, spin the wheel, and life will pour from your fingers. Geometry and time will be your dogs. Hesitate, let the bowl turn without you, and—snap! you are mine.\nThat was a joke. You are one of mine and always were. The question is, do I like you better at your desk, or do I prefer your median nerve coiled delicately on a cracker with caviar to taste?\nHa! That was also a joke! Why flinch? You used to appreciate the soft, surreal psychosis of cartoons. Mallets and violence! Bacchanals, decapitations, shotguns, dynamite! That’s my sense of humor.\nI don’t give, darling. I take. Sometimes I negotiate. It’s always unfair.\nChoose. Don’t make me wait, or you’ll wake up with stabbing pains in your arms and claws for hands. A slow dissolve on your career. No love, no money, no lasting memory.\nBegging doesn’t suit you. Your heart’s transparent to me. I don’t give a pixel more than you do for your family. Your Isabelle would be only too happy—but to the point. Our transaction.\nThey can’t hear you from here.\nCertain privileges come with being a monarch of time and a master in the persistence of vision. I am nothing in the security cameras. Not a shiver. Not a blot.\nAre you sure? A kiss, then, to seal the bargain. I’ll peel this little yellow light out of you. You won’t be needing it.\nA gift I gave you, once. No matter. Tonight your department head will dream of you and what you could become. Expect a meeting next week.\nYou might. But you’ll have the odor of vinegar to remember me by.\nFrom the decay of acetate film.\nNo, I would never think of calling you a coward.\nE. Lily Yu received the John W. Campbell Award for Best New Writer in 2012 and the Gar LaSalle Storyteller Award in 2017. Her stories have appeared in venues from McSweeney's to F&SF, including seven best-of-the-year anthologies, and been finalists for the Hugo, Nebula, Locus, Sturgeon, and World Fantasy Awards. Recent work appears in Hazlitt and Tor.com.", "source": "https://clarkesworldmagazine.com/yu_12_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Daedalum, the Devil's Wheel by E. Lily Yu"}