{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "MY7ha6eY21PWccBeTCC6KosJvvk=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Ask and You Shall Receive  As the month came to a close, I found myself without a viable editorial for this issue. I had one I thought would work, but it fizzled and went in the wrong direction. In a moment of desperation, I turned to Twitter:   Over the course of the next few hours, responses—serious and not—rolled in. So far, there have been a couple of really good ideas, but they require a bit of research and more time than I have this late in the month. Many of the others were interesting, but didn’t immediately inspire a whole editorial’s worth of content. However, perhaps it would be fun to treat them collectively and cobble together a Frankenstein’s monster of an editorial from some of them.  Gav Thorpe @GavThorpeCreate: 'Why do magazines have editorials?'  Oh that’s easy. They were put in place to torture the editors, particularly those who don’t write. Same thing with blogs and introductions in anthologies. Apparently, it’s supposed to make it look like we actually work, aren’t robots, you know, something like that.  Joan Wendland @BandCgames: The future of dystopian novels given the current dystopia we experience every day?  Can’t talk to novels, but with short fiction, I’m not seeing much of a change in the slush pile. I did note a ten percent decline in story submissions immediately following the election, but it’s almost back to October levels now. If people are learning anything from all this, I’m not seeing it applied in the stories. That’s fine though, cause I like that people still prefer using their imagination.  John P. Murphy @dolohov: Optimism in science fiction?  There have been complaints about the lack of optimism in science fiction for many years now. Months ago, maybe at the Nebula Conference, I was talking to someone about this. They seemed to believe that optimistic science fiction is very tied to economic situation and overall happiness with their lives. I’m sure there’s data out there on this, but I haven’t taken the time to see if that theory was true. I have some doubts.  Frabjous the Elder @timothy_boothe: Why do computers in sci-fi always just look like the computers when the sci-fi was written?  Computer science major here. It’s called a lack of imagination and it bugs me too. I shouldn’t be impressed anytime someone gets a simple hacker-type character or even basic terminology right either.  Marion Deeds @mariond_d: WorldCon has a panel; “Cats in popular culture.” What about cats in SFF?  Sorry, I’m a dog person. I just don’t get the whole cat thing. They seem mean to me, but what do you expect from a shrunken lion? It’s going to have issues. Or did you mean authors named Cat? If so, I like those.  Ziv W @QuiteVague: The effect of Twitter on the fandom ecosystem.  Complicated. Like any tool it can be used for good and evil. That said, I don’t think there is a single fandom ecosystem.  Sabrina M. Pyun @sabrinampyun: Should sci-fi reflect people's current mindsets about the future or should sci-fi inspire/change those mindsets?  It can do either or neither. There’s plenty of room under the umbrella and more than just those two choices. Don’t tie yourself down.  Susan E. Connolly @susanconnolly: How important is realism in SF? Can we still write stories with aliens on Mars?  As I said above, there’s lots of room under the umbrella. I like hard SF and I like stuff that isn’t. Of course you can write stories with aliens on Mars. You can even write a hard SF story with aliens on Mars if you set it up correctly. Just because they aren’t there now doesn’t mean they won’t be someday.  Mike Caputo @MichaelNCaputo: The death of science under the current administration.  Science can be denied, not stopped.  Stephen S. Power @Stephenspower: Is the future above ground or below?  It depends on how much money you have, though I’ve been thinking lately that it might be under water.  clive tern @CliveTernWriter: How Gattaca is a great film representing marginalization of disability, but used non-disabled actors.  I’ll have to take your word for it since I haven’t seen that movie. Hmmm. Maybe I should watch a bunch of genre movies I haven’t seen yet and write an editorial around that.  Passenger EU @LorcaIan: How to get published in your mag  Like the lottery, you have to be in it to win it. Unlike the lottery, the stories aren’t picked randomly. What makes me think a story is good? That’s a question I’m still not sure how to answer and even if I could, I’d never recommend that you write based on that answer. Write what you enjoy and write it well.  Emily Swaim @swaimea: Return of the novella as a storytelling medium, in regards to companion stories for franchises and the popularity of Japanese light novels  I can’t speak with much experience about the Japanese light novels, but the return of the novella is a rather nice development. You might have noticed that we’ve snuck in a few in the that last couple of years. For us, it’s always been a budget and space issue and I’d love to do more. In some ways, the novella is just catching the tail-end of what caused the increase in short fiction readership in recent years: online and digital publishing. I’ll single Tor.com and Tachyon Publications as two publishers that have made a mark with their novellas. More will follow.  Richard J. O'Brien @obrienwriter: Why so many sci-fi characters are not memorable compared to other genres.  My experience has been quite the opposite. I don’t think you’d find a consensus on this one and that’s probably a good thing. It means there’s still good variety out there and so many more variations on stories left to tell. If the characters today aren’t to your liking, be the author that fixes that.  Well, that was a fun little experiment. Did any of those topics speak to you or did you want to toss me another? Feel free to drop comments off at our website or even via Twitter. Maybe we can make this a bit like the old-timey letters-to-the-editor columns. Might be a fun thing to do from time-to-time! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Ask and You Shall Receive\nAs the month came to a close, I found myself without a viable editorial for this issue. I had one I thought would work, but it fizzled and went in the wrong direction. In a moment of desperation, I turned to Twitter:\nOver the course of the next few hours, responses—serious and not—rolled in. So far, there have been a couple of really good ideas, but they require a bit of research and more time than I have this late in the month. Many of the others were interesting, but didn’t immediately inspire a whole editorial’s worth of content. However, perhaps it would be fun to treat them collectively and cobble together a Frankenstein’s monster of an editorial from some of them.\nGav Thorpe @GavThorpeCreate: 'Why do magazines have editorials?'\nOh that’s easy. They were put in place to torture the editors, particularly those who don’t write. Same thing with blogs and introductions in anthologies. Apparently, it’s supposed to make it look like we actually work, aren’t robots, you know, something like that.\nJoan Wendland @BandCgames: The future of dystopian novels given the current dystopia we experience every day?\nCan’t talk to novels, but with short fiction, I’m not seeing much of a change in the slush pile. I did note a ten percent decline in story submissions immediately following the election, but it’s almost back to October levels now. If people are learning anything from all this, I’m not seeing it applied in the stories. That’s fine though, cause I like that people still prefer using their imagination.\nJohn P. Murphy @dolohov: Optimism in science fiction?\nThere have been complaints about the lack of optimism in science fiction for many years now. Months ago, maybe at the Nebula Conference, I was talking to someone about this. They seemed to believe that optimistic science fiction is very tied to economic situation and overall happiness with their lives. I’m sure there’s data out there on this, but I haven’t taken the time to see if that theory was true. I have some doubts.\nFrabjous the Elder @timothy_boothe: Why do computers in sci-fi always just look like the computers when the sci-fi was written?\nComputer science major here. It’s called a lack of imagination and it bugs me too. I shouldn’t be impressed anytime someone gets a simple hacker-type character or even basic terminology right either.\nMarion Deeds @mariond_d: WorldCon has a panel; “Cats in popular culture.” What about cats in SFF?\nSorry, I’m a dog person. I just don’t get the whole cat thing. They seem mean to me, but what do you expect from a shrunken lion? It’s going to have issues. Or did you mean authors named Cat? If so, I like those.\nZiv W @QuiteVague: The effect of Twitter on the fandom ecosystem.\nComplicated. Like any tool it can be used for good and evil. That said, I don’t think there is a single fandom ecosystem.\nSabrina M. Pyun @sabrinampyun: Should sci-fi reflect people's current mindsets about the future or should sci-fi inspire/change those mindsets?\nIt can do either or neither. There’s plenty of room under the umbrella and more than just those two choices. Don’t tie yourself down.\nSusan E. Connolly @susanconnolly: How important is realism in SF? Can we still write stories with aliens on Mars?\nAs I said above, there’s lots of room under the umbrella. I like hard SF and I like stuff that isn’t. Of course you can write stories with aliens on Mars. You can even write a hard SF story with aliens on Mars if you set it up correctly. Just because they aren’t there now doesn’t mean they won’t be someday.\nMike Caputo @MichaelNCaputo: The death of science under the current administration.\nScience can be denied, not stopped.\nStephen S. Power @Stephenspower: Is the future above ground or below?\nIt depends on how much money you have, though I’ve been thinking lately that it might be under water.\nclive tern @CliveTernWriter: How Gattaca is a great film representing marginalization of disability, but used non-disabled actors.\nI’ll have to take your word for it since I haven’t seen that movie. Hmmm. Maybe I should watch a bunch of genre movies I haven’t seen yet and write an editorial around that.\nPassenger EU @LorcaIan: How to get published in your mag\nLike the lottery, you have to be in it to win it. Unlike the lottery, the stories aren’t picked randomly. What makes me think a story is good? That’s a question I’m still not sure how to answer and even if I could, I’d never recommend that you write based on that answer. Write what you enjoy and write it well.\nEmily Swaim @swaimea: Return of the novella as a storytelling medium, in regards to companion stories for franchises and the popularity of Japanese light novels\nI can’t speak with much experience about the Japanese light novels, but the return of the novella is a rather nice development. You might have noticed that we’ve snuck in a few in the that last couple of years. For us, it’s always been a budget and space issue and I’d love to do more. In some ways, the novella is just catching the tail-end of what caused the increase in short fiction readership in recent years: online and digital publishing. I’ll single Tor.com and Tachyon Publications as two publishers that have made a mark with their novellas. More will follow.\nRichard J. O'Brien @obrienwriter: Why so many sci-fi characters are not memorable compared to other genres.\nMy experience has been quite the opposite. I don’t think you’d find a consensus on this one and that’s probably a good thing. It means there’s still good variety out there and so many more variations on stories left to tell. If the characters today aren’t to your liking, be the author that fixes that.\nWell, that was a fun little experiment. Did any of those topics speak to you or did you want to toss me another? Feel free to drop comments off at our website or even via Twitter. Maybe we can make this a bit like the old-timey letters-to-the-editor columns. Might be a fun thing to do from time-to-time!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_08_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Ask and You Shall Receive by Neil Clarke"}