{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "l0zMbCv7cyIMRzEWxeiBdlRQO2k=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: The Most Science Fictional Worldcon Ever  In recent years, I’ve had the privilege of being able to attend several Worldcons. It’s one of those rare occasions where I get to meet readers and authors that I might not normally see at the regional conventions I regularly attend. Last year, I made the trek to Dublin, Ireland to visit family and attend the convention. This year, I was all set to teach at Clarion West and then fly from there to New Zealand, the site of this year’s Worldcon. Of course, we all know what happened to everyone’s travel plans this year . . .  As a result, CoNZealand (conzealand.nz, July 29-August 2) has transitioned to a virtual convention and entered the history books as the first entirely digital Worldcon. In doing so, it also becomes the most internationally-accessible Worldcon ever. No matter where you live, if you have Internet access, you can become a member and attend this year’s panels, Hugo Awards Ceremony, and many other events. The increased opportunity for people to participate is fantastic, and I, for one, look forward to that. One of the aspects I’ve particularly enjoyed about the Worldcons I’ve attended outside the US has been the presence of attendees from a greater variety of countries. This was a big reason I was looking forward to heading to New Zealand.  This won’t be a traditional Worldcon experience. Some of it will mirror what we’ve come to expect, but the Worldcon experience can’t fully transition to this medium. Virtual parties, for example, aren’t the same. (Maybe everyone should crank up the heat in their homes while those are going on.) It might even be a little harder to replicate those chance meetings that happen so often in hallways, bars, airport shuttles, and hotel lobbies. I’ve had so many interesting conversations happen under those circumstances.  On the other hand, it might be easier for some people to participate this way than it is for them in a face-to-face event. If they can engage more, that’s something extra being brought to the table. Sometimes shaking things up a little is good and from what I’ve seen at other recent online cons I’ve attended lately, this is definitely an opportunity for our community.  Nothing like this should be expected to be error-free. This is relatively new territory for fandom and technology doesn’t always behave the way we expect. If I’m on a panel and there’s a tech problem, no big deal. I’ll try to work with the other panelists and staff to find a workaround if there is a glitch. Just pretend a virtual pipe has burst in the room and that we are scrambling to find somewhere else to go. Perhaps you’ll have to catch the panelists in the consuite later. Relax and enjoy the ride. Technical difficulties and all. It’s a Worldcon and you should leave with a story.  As I mentioned, the Hugo Awards will be virtual as well. I’m one of this year’s finalists, so I know that they are hoping to have the winners accept their awards live on video. They have asked finalists for pre-recorded video acceptances, just in case. Seems wise to me, even if I find the thought of recording such a beast terrifying. It’s a good indication of how they are approaching things.  Being a finalist this year has been something a surreal experience, detached from reality. The thing that amuses me the most, however, is that I’ve spent so much of my career in this field working in a primarily online environment. If this should be the first year I win a Hugo for Editor Short Form, it will be online and international—two of the things that have been at the core of my professional experience. That’s pretty cool.  If I lose, well, that’s ok too. I see myself as just a side character in this story anyway. I’m always rooting harder for our authors and while none are in the running for a Hugo this year, A. T. Greenblatt recently won a Nebula for Best Short Story for her 2019 Clarkesworld story, “Give the Family My Love,” so I’m already ahead for the year.  The whole idea of a virtual Worldcon or Hugo Awards is something that would have been considered science fiction when I was a kid. (And if you toss in a global pandemic, murder hornets, and my cyborg parts failure, among the rest of this chaos—ok, maybe not good SF.)  My only regret for this science fictional Worldcon and Hugos is that this year’s winners won’t have the opportunity to experience taking a rocket-shaped award through airport security. Everything else will fall into place or relatively nearby. We’re science fiction fans, we should be able to handle this. If we can’t, no one can.  Hope to come across some of you at this year’s Worldcon. Please say hi if we happen to be in the same virtual space. It’s always a pleasure to meet the people who read and support all the work we do here. That’s no different when it’s digital. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: The Most Science Fictional Worldcon Ever\nIn recent years, I’ve had the privilege of being able to attend several Worldcons. It’s one of those rare occasions where I get to meet readers and authors that I might not normally see at the regional conventions I regularly attend. Last year, I made the trek to Dublin, Ireland to visit family and attend the convention. This year, I was all set to teach at Clarion West and then fly from there to New Zealand, the site of this year’s Worldcon. Of course, we all know what happened to everyone’s travel plans this year . . .\nAs a result, CoNZealand (conzealand.nz, July 29-August 2) has transitioned to a virtual convention and entered the history books as the first entirely digital Worldcon. In doing so, it also becomes the most internationally-accessible Worldcon ever. No matter where you live, if you have Internet access, you can become a member and attend this year’s panels, Hugo Awards Ceremony, and many other events. The increased opportunity for people to participate is fantastic, and I, for one, look forward to that. One of the aspects I’ve particularly enjoyed about the Worldcons I’ve attended outside the US has been the presence of attendees from a greater variety of countries. This was a big reason I was looking forward to heading to New Zealand.\nThis won’t be a traditional Worldcon experience. Some of it will mirror what we’ve come to expect, but the Worldcon experience can’t fully transition to this medium. Virtual parties, for example, aren’t the same. (Maybe everyone should crank up the heat in their homes while those are going on.) It might even be a little harder to replicate those chance meetings that happen so often in hallways, bars, airport shuttles, and hotel lobbies. I’ve had so many interesting conversations happen under those circumstances.\nOn the other hand, it might be easier for some people to participate this way than it is for them in a face-to-face event. If they can engage more, that’s something extra being brought to the table. Sometimes shaking things up a little is good and from what I’ve seen at other recent online cons I’ve attended lately, this is definitely an opportunity for our community.\nNothing like this should be expected to be error-free. This is relatively new territory for fandom and technology doesn’t always behave the way we expect. If I’m on a panel and there’s a tech problem, no big deal. I’ll try to work with the other panelists and staff to find a workaround if there is a glitch. Just pretend a virtual pipe has burst in the room and that we are scrambling to find somewhere else to go. Perhaps you’ll have to catch the panelists in the consuite later. Relax and enjoy the ride. Technical difficulties and all. It’s a Worldcon and you should leave with a story.\nAs I mentioned, the Hugo Awards will be virtual as well. I’m one of this year’s finalists, so I know that they are hoping to have the winners accept their awards live on video. They have asked finalists for pre-recorded video acceptances, just in case. Seems wise to me, even if I find the thought of recording such a beast terrifying. It’s a good indication of how they are approaching things.\nBeing a finalist this year has been something a surreal experience, detached from reality. The thing that amuses me the most, however, is that I’ve spent so much of my career in this field working in a primarily online environment. If this should be the first year I win a Hugo for Editor Short Form, it will be online and international—two of the things that have been at the core of my professional experience. That’s pretty cool.\nIf I lose, well, that’s ok too. I see myself as just a side character in this story anyway. I’m always rooting harder for our authors and while none are in the running for a Hugo this year, A. T. Greenblatt recently won a Nebula for Best Short Story for her 2019 Clarkesworld story, “Give the Family My Love,” so I’m already ahead for the year.\nThe whole idea of a virtual Worldcon or Hugo Awards is something that would have been considered science fiction when I was a kid. (And if you toss in a global pandemic, murder hornets, and my cyborg parts failure, among the rest of this chaos—ok, maybe not good SF.)\nMy only regret for this science fictional Worldcon and Hugos is that this year’s winners won’t have the opportunity to experience taking a rocket-shaped award through airport security. Everything else will fall into place or relatively nearby. We’re science fiction fans, we should be able to handle this. If we can’t, no one can.\nHope to come across some of you at this year’s Worldcon. Please say hi if we happen to be in the same virtual space. It’s always a pleasure to meet the people who read and support all the work we do here. That’s no different when it’s digital.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_07_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: The Most Science Fictional Worldcon Ever by Neil Clarke"}