{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "sZ5ORa0zE3VqlN6a+i/pU4woo3Y=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: 2019 Reader's Poll Finalists  I’d like to start this month by thanking everyone for their support and understanding during my surgery and recovery over the last month. The procedure went off without a hitch. I’ll admit that I was nervous about the whole lasers-being-fired-in-my-heart thing, but I had an amazing team of doctors and probably the most space-age operating room I’ve ever seen. Recovery has been slower than I expected, but the pain levels are finally down and almost all of the doctor-mandated restrictions on my activities have been removed. It will likely be a few more weeks before the bruising, swelling, and remaining restrictions—mostly on the use of my left arm—are gone. In the meantime, I’m taking it easy when I can and staying home. It means I’ll miss Boskone this year, but it’s for the best. I hope to see everyone there next year!  In late January, we held the nomination phase for the annual Clarkesworld Magazine Reader’s Poll for best story and cover art. As in previous years, we went with a shortened (roughly one-day) nomination phase. We’ve found that this approach minimizes attempts at ballot-stuffing without any significant impact on the total number of participants. It was a close race from the start and once again it ended with ties. The story category was particularly close, with a six-way tie for fifth place. That’s more than we wanted, but the readers have spoken. If it doesn’t work out well, we’ll update the rules next year.  Finalists for Best Story  \r\n “Such Thoughts Are Unproductive” by Rebecca Campbell (December)  “The Sun from Both Sides” by R.S.A. Garcia (May)  “Annotated Setlist of the Mikaela Cole Jazz Quintet” by Catherine George (December)  “Give the Family My Love” by A. T. Greenblatt (February)  “East of the Sun, West of the Stars” by Brit E. B. Hvide (February)  “Your Future is Pending” by Matthew Kressel (November)  “Shattered Sidewalks of the Human Heart” by Sam Miller (July)  “Dave’s Head” by Suzanne Palmer (September)  “The Painter of Trees” by Suzanne Palmer (June)  “Insaan Hain, Farishte Nahin” by Arula Ratnakar (May)  Finalists for Best Cover Art  Congratulations to all our finalists!  Now it’s up to you to pick the winner in each category. Go to:  Voting will close on February 20th at 8PM EST and the winners will be announced in our March issue.  Speaking of awards, CoNZealand—the 78th World Science Fiction Convention—has opened the nomination period for this year’s Hugo Awards. Since there are still a few people who continue to nominate Clarkesworld for Best Semiprozine, I’d like to once again remind you that we haven’t been eligible for that award for a long time. Give your nomination to one of the many fine semiprozines out there instead. You can find a list at semiprozine.org. At present, there isn’t a category for professional magazines, but you can nominate me for Best Editor Short Form if you are so moved, and of course, all our original fiction is eligible in their respective categories. The list at neil-clarke.com/2019-clarkesworld-stories-and-cover-art can be helpful in determining what category each story is eligible in.  That’s about all for this month. I wish you all the best! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: 2019 Reader's Poll Finalists\nI’d like to start this month by thanking everyone for their support and understanding during my surgery and recovery over the last month. The procedure went off without a hitch. I’ll admit that I was nervous about the whole lasers-being-fired-in-my-heart thing, but I had an amazing team of doctors and probably the most space-age operating room I’ve ever seen. Recovery has been slower than I expected, but the pain levels are finally down and almost all of the doctor-mandated restrictions on my activities have been removed. It will likely be a few more weeks before the bruising, swelling, and remaining restrictions—mostly on the use of my left arm—are gone. In the meantime, I’m taking it easy when I can and staying home. It means I’ll miss Boskone this year, but it’s for the best. I hope to see everyone there next year!\nIn late January, we held the nomination phase for the annual Clarkesworld Magazine Reader’s Poll for best story and cover art. As in previous years, we went with a shortened (roughly one-day) nomination phase. We’ve found that this approach minimizes attempts at ballot-stuffing without any significant impact on the total number of participants. It was a close race from the start and once again it ended with ties. The story category was particularly close, with a six-way tie for fifth place. That’s more than we wanted, but the readers have spoken. If it doesn’t work out well, we’ll update the rules next year.\nFinalists for Best Story\n- “Such Thoughts Are Unproductive” by Rebecca Campbell (December)\n- “The Sun from Both Sides” by R.S.A. Garcia (May)\n- “Annotated Setlist of the Mikaela Cole Jazz Quintet” by Catherine George (December)\n- “Give the Family My Love” by A. T. Greenblatt (February)\n- “East of the Sun, West of the Stars” by Brit E. B. Hvide (February)\n- “Your Future is Pending” by Matthew Kressel (November)\n- “Shattered Sidewalks of the Human Heart” by Sam Miller (July)\n- “Dave’s Head” by Suzanne Palmer (September)\n- “The Painter of Trees” by Suzanne Palmer (June)\n- “Insaan Hain, Farishte Nahin” by Arula Ratnakar (May)\nFinalists for Best Cover Art\nCongratulations to all our finalists!\nNow it’s up to you to pick the winner in each category. Go to:\nVoting will close on February 20th at 8PM EST and the winners will be announced in our March issue.\nSpeaking of awards, CoNZealand—the 78th World Science Fiction Convention—has opened the nomination period for this year’s Hugo Awards. Since there are still a few people who continue to nominate Clarkesworld for Best Semiprozine, I’d like to once again remind you that we haven’t been eligible for that award for a long time. Give your nomination to one of the many fine semiprozines out there instead. You can find a list at semiprozine.org. At present, there isn’t a category for professional magazines, but you can nominate me for Best Editor Short Form if you are so moved, and of course, all our original fiction is eligible in their respective categories. The list at neil-clarke.com/2019-clarkesworld-stories-and-cover-art can be helpful in determining what category each story is eligible in.\nThat’s about all for this month. I wish you all the best!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_02_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: 2019 Reader's Poll Finalists by Neil Clarke"}