{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Rachel Swirsky", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "91wuD7QA/4z48qnISLBUd4ld66c=", "id": null, "license": null, "comments": "", "raw_text": "1320 words, short story  Your Face  Oh! Abigail! Oh. It’s good—it’s so good to see you.  Mom. Hi.  You look so much like you. I feel like I could reach out and touch your face. Your face! It’s so good to see your face.  Yeah, you too.  It’s so good. It’s, oh, I just don’t—Abigail, I don’t know what to say.  Say what you want, Mom.  How much of you—I don’t know. Maybe I really shouldn’t ask, but—How much of you is in there?  I’m me, Mom.  I mean, I have the chart here—I know your scan was only about a month out of date. But is it you you?  Yeah, of course.  I mean, is it you or—How much is the computer, really?  Mom. I’m me.  Are you sure? What do you remember?  Everything. Come on. You just said it. My scan was only a month out of date.  No, I mean, what’s the last thing you remember? Where do you feel like you are?  Oh, fine. It’s afternoon. I’m getting my scan. Traffic has been so bad all day. I had a fight with Robin this afternoon about the laundry. Again. I’m so damn tired.  What’s it like?  Hot. There’s a fan, but it’s not on. My eyes hurt and I don’t want to spend any more time today staring at a screen so I’m looking out the window.  And?  There’s a janitor cutting hedges. There’s a man walking a tiny dog on the lawn. My hair feels sweaty. I want to go home. What do you want me to say?  You want to go home?  I’m just so damn tired. I need time on the couch with a book. Unless Robin decides we should start fighting World War III over the laundry again.  But you can’t really go home. You know that. Right, Abigail?  Obviously.  You’re only in the computer. You can’t come out.  I know.  I don’t know. Maybe this was a bad idea. Is it cruel? Am I just bringing you back to kill you all over again?  You’re freaking out, Mom. Stop it.  I realized I’ve been putting this off for almost five years. It would have been your thirtieth birthday last week. Maybe I should have come earlier, but I just wasn’t—sure if it would be cruel—  It’s fine.  And I . . . didn’t know if I wanted to.  Oh.  I’m sorry. Oh, God. I’m terrible.  Whatever. It’s not important.  Now you’re angry.  Don’t tell me how I feel.  No. This isn’t right. You don’t sound like you. You look like you . . . but you don’t sound like you at all.  Excuse me?  You’re so flat . . . You sound . . . like you’re champagne, and someone left you open.  I don’t even know how to respond to that.  There’s nothing in your voice but frustration.  Sorry. It’s been that kind of day. You know, the kind where you’re like, This goddamn shower is too wet.  You sound like you just can’t be bothered. Like it’s just some Saturday when your sister called for last-minute help with the kids when you and Robin already had plans—  —Goddamn, three PM should not be rush hour—  —or some evening when you had to run back to the store for wiper fluid—  —I was just coming in for a normal scan, you know?  Abigail. You haven’t even asked me about Robin.  I didn’t?  No.  I hope she’s not still upset that I threw her bras in with the wash instead of using the lingerie bags.  Abigail, that happened a long time . . .  Yeah, I know. If I was still around, she miiiiight have even forgiven me by now.  Abigail!  What? It’s a joke.  You shouldn’t talk about her like that.  Sorry, I was just blowing off steam.  You sound like you didn’t even love her.  How can you say that? Of course I love her. How can you even say that?  You’re right. I’m sorry.  I love her more than anything. Does it really seem like I don’t love her?  No. It seemed . . . like you bickered a lot. But everyone knew you loved each other. It was like a glow on you.  I should have been more careful. She probably wouldn’t have been so upset except it was her favorite bra.  That was probably it.  But how does anyone even have a favorite bra, you know? Ugh, I just want to go home. It’s hot. The leaf blower is SO LOUD.  Abbie.  What?  You know you can’t.  What?  You can’t go home.  Of course I know! We already talked about this. My scan was only a month out of date.  Okay, honey.  It’s just uncomfortable in here.  Okay.  It was an awful ride over. Did I tell you that? My air conditioner isn’t working. It puffs out hot air. And the traffic—  Abigail, I should have told you earlier. We don’t have much time to talk. The ten minute warning just went off.  Huh? Oh. Sure, fine.  I’m sorry. I probably can’t afford this again. It’s just so expensive. Did you know it keeps getting more expensive the longer they keep someone in storage?  Oh, that’s just because of data decay.  I didn’t realize how good it would be to see your face.  Ugh. I’m all sweaty.  I’m here because Robin made me promise to come before she died. She wanted you to know it wasn’t your fault. You were—already gone by then.  My fault?  Do you remember? You were driving the car.  The car?  The police said there was nothing you could have done. The other driver would have hit you even if your reflexes were perfect.  What? No.  The other driver was from Florida. She didn’t know how to handle the mountains.  No, I don’t think that’s true.  I only had a few minutes with you at the hospital. You kept saying over and over again how it was your fault. You wanted me to tell Robin’s parents they were right, she never should have married you. But I didn’t, because it wasn’t your fault.  No. That isn’t right. I don’t think that happened.  Robin made me promise to talk to you. She said she could hear you talking to me, asking me to tell her parents that, but she was in surgery then. She must have imagined it. I guess. Or—I don’t know.  I don’t know what you’re talking about. It’s hard to hear over the leaf blower. Maybe we should talk again later.  Robin made it for a few days. We all thought she might—well. She needed you to know she didn’t blame you.  It’s not that I don’t try to do the laundry correctly, but she has all these rules.  It was an accident, Abbie. A terrible accident.  She should do it herself if she’s going to be so picky.  I don’t know. Maybe I shouldn’t have come at all. I told Robin it wouldn’t really be you, but she made me promise.  I’m me!  No, honey. If you were you, you’d be screaming. I just told you. Robin died.  Don’t tell me how I feel! Damn it, why don’t they just turn on the fan?  You’re just something . . . stuck . . . in a bad afternoon.  There’s sweat in my hair. I need to get home to my chair and a book. WHY IS IT SO DAMN HOT?  Abigail and Robin, they—They should have gotten the same chances as everyone else. You know? A house, a family. Sometimes I just—wonder. Do you think she could have forgiven me for bringing her into the world when she had so little time?  We always fight, me and Robin. But there’s a secret.  What?  We always make up again.  Yes.  Huh?  Yes, you always did.  Hi, Mom. It’s hot, isn’t it? I just want to go home.  I know, Abigail. It’s been a long day.      Author’s Note: This story was inspired by the game “Island in a Sea of Solitude” by P.H. Lee. Rachel Swirsky holds an MFA from the Iowa Writers Workshop where she, a California native, learned about both writing and snow. She recently traded the snow for the rain of Portland, Oregon, where she roams happily under overcast skies with the hipsters. Her fiction has appeared in venues including Tor.com, Asimov's Magazine, and The Year's Best Non-Required Reading. She's published two collections: Through the Drowsy Dark (Aqueduct Press) and How the World Became Quiet (Subterranean Press). Her fiction has been nominated for the Hugo Award and the World Fantasy Award, and twice won the Nebula.", "text": "1320 words, short story\nYour Face\nOh! Abigail! Oh. It’s good—it’s so good to see you.\nMom. Hi.\nYou look so much like you. I feel like I could reach out and touch your face. Your face! It’s so good to see your face.\nYeah, you too.\nIt’s so good. It’s, oh, I just don’t—Abigail, I don’t know what to say.\nSay what you want, Mom.\nHow much of you—I don’t know. Maybe I really shouldn’t ask, but—How much of you is in there?\nI’m me, Mom.\nI mean, I have the chart here—I know your scan was only about a month out of date. But is it you you?\nYeah, of course.\nI mean, is it you or—How much is the computer, really?\nMom. I’m me.\nAre you sure? What do you remember?\nEverything. Come on. You just said it. My scan was only a month out of date.\nNo, I mean, what’s the last thing you remember? Where do you feel like you are?\nOh, fine. It’s afternoon. I’m getting my scan. Traffic has been so bad all day. I had a fight with Robin this afternoon about the laundry. Again. I’m so damn tired.\nWhat’s it like?\nHot. There’s a fan, but it’s not on. My eyes hurt and I don’t want to spend any more time today staring at a screen so I’m looking out the window.\nAnd?\nThere’s a janitor cutting hedges. There’s a man walking a tiny dog on the lawn. My hair feels sweaty. I want to go home. What do you want me to say?\nYou want to go home?\nI’m just so damn tired. I need time on the couch with a book. Unless Robin decides we should start fighting World War III over the laundry again.\nBut you can’t really go home. You know that. Right, Abigail?\nObviously.\nYou’re only in the computer. You can’t come out.\nI know.\nI don’t know. Maybe this was a bad idea. Is it cruel? Am I just bringing you back to kill you all over again?\nYou’re freaking out, Mom. Stop it.\nI realized I’ve been putting this off for almost five years. It would have been your thirtieth birthday last week. Maybe I should have come earlier, but I just wasn’t—sure if it would be cruel—\nIt’s fine.\nAnd I . . . didn’t know if I wanted to.\nOh.\nI’m sorry. Oh, God. I’m terrible.\nWhatever. It’s not important.\nNow you’re angry.\nDon’t tell me how I feel.\nNo. This isn’t right. You don’t sound like you. You look like you . . . but you don’t sound like you at all.\nExcuse me?\nYou’re so flat . . . You sound . . . like you’re champagne, and someone left you open.\nI don’t even know how to respond to that.\nThere’s nothing in your voice but frustration.\nSorry. It’s been that kind of day. You know, the kind where you’re like, This goddamn shower is too wet.\nYou sound like you just can’t be bothered. Like it’s just some Saturday when your sister called for last-minute help with the kids when you and Robin already had plans—\n—Goddamn, three PM should not be rush hour—\n—or some evening when you had to run back to the store for wiper fluid—\n—I was just coming in for a normal scan, you know?\nAbigail. You haven’t even asked me about Robin.\nI didn’t?\nNo.\nI hope she’s not still upset that I threw her bras in with the wash instead of using the lingerie bags.\nAbigail, that happened a long time . . .\nYeah, I know. If I was still around, she miiiiight have even forgiven me by now.\nAbigail!\nWhat? It’s a joke.\nYou shouldn’t talk about her like that.\nSorry, I was just blowing off steam.\nYou sound like you didn’t even love her.\nHow can you say that? Of course I love her. How can you even say that?\nYou’re right. I’m sorry.\nI love her more than anything. Does it really seem like I don’t love her?\nNo. It seemed . . . like you bickered a lot. But everyone knew you loved each other. It was like a glow on you.\nI should have been more careful. She probably wouldn’t have been so upset except it was her favorite bra.\nThat was probably it.\nBut how does anyone even have a favorite bra, you know? Ugh, I just want to go home. It’s hot. The leaf blower is SO LOUD.\nAbbie.\nWhat?\nYou know you can’t.\nWhat?\nYou can’t go home.\nOf course I know! We already talked about this. My scan was only a month out of date.\nOkay, honey.\nIt’s just uncomfortable in here.\nOkay.\nIt was an awful ride over. Did I tell you that? My air conditioner isn’t working. It puffs out hot air. And the traffic—\nAbigail, I should have told you earlier. We don’t have much time to talk. The ten minute warning just went off.\nHuh? Oh. Sure, fine.\nI’m sorry. I probably can’t afford this again. It’s just so expensive. Did you know it keeps getting more expensive the longer they keep someone in storage?\nOh, that’s just because of data decay.\nI didn’t realize how good it would be to see your face.\nUgh. I’m all sweaty.\nI’m here because Robin made me promise to come before she died. She wanted you to know it wasn’t your fault. You were—already gone by then.\nMy fault?\nDo you remember? You were driving the car.\nThe car?\nThe police said there was nothing you could have done. The other driver would have hit you even if your reflexes were perfect.\nWhat? No.\nThe other driver was from Florida. She didn’t know how to handle the mountains.\nNo, I don’t think that’s true.\nI only had a few minutes with you at the hospital. You kept saying over and over again how it was your fault. You wanted me to tell Robin’s parents they were right, she never should have married you. But I didn’t, because it wasn’t your fault.\nNo. That isn’t right. I don’t think that happened.\nRobin made me promise to talk to you. She said she could hear you talking to me, asking me to tell her parents that, but she was in surgery then. She must have imagined it. I guess. Or—I don’t know.\nI don’t know what you’re talking about. It’s hard to hear over the leaf blower. Maybe we should talk again later.\nRobin made it for a few days. We all thought she might—well. She needed you to know she didn’t blame you.\nIt’s not that I don’t try to do the laundry correctly, but she has all these rules.\nIt was an accident, Abbie. A terrible accident.\nShe should do it herself if she’s going to be so picky.\nI don’t know. Maybe I shouldn’t have come at all. I told Robin it wouldn’t really be you, but she made me promise.\nI’m me!\nNo, honey. If you were you, you’d be screaming. I just told you. Robin died.\nDon’t tell me how I feel! Damn it, why don’t they just turn on the fan?\nYou’re just something . . . stuck . . . in a bad afternoon.\nThere’s sweat in my hair. I need to get home to my chair and a book. WHY IS IT SO DAMN HOT?\nAbigail and Robin, they—They should have gotten the same chances as everyone else. You know? A house, a family. Sometimes I just—wonder. Do you think she could have forgiven me for bringing her into the world when she had so little time?\nWe always fight, me and Robin. But there’s a secret.\nWhat?\nWe always make up again.\nYes.\nHuh?\nYes, you always did.\nHi, Mom. It’s hot, isn’t it? I just want to go home.\nI know, Abigail. It’s been a long day.\nAuthor’s Note: This story was inspired by the game “Island in a Sea of Solitude” by P.H. Lee.\nRachel Swirsky holds an MFA from the Iowa Writers Workshop where she, a California native, learned about both writing and snow. She recently traded the snow for the rain of Portland, Oregon, where she roams happily under overcast skies with the hipsters. Her fiction has appeared in venues including Tor.com, Asimov's Magazine, and The Year's Best Non-Required Reading. She's published two collections: Through the Drowsy Dark (Aqueduct Press) and How the World Became Quiet (Subterranean Press). Her fiction has been nominated for the Hugo Award and the World Fantasy Award, and twice won the Nebula.", "source": "https://clarkesworldmagazine.com/swirsky_08_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Your Face by Rachel Swirsky"}