{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Michael Flynn", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "wmKkPd3UCaWNOG595xrDPNo0ATM=", "id": null, "license": null, "comments": "", "raw_text": "6450 words, short story, REPRINT  The Promise of God   You shall have joy, or you shall have power, said God; you shall not have both.  It began to grow cold in the cabin after the sun went down, and Nealy thought about building a fire. It would be a fine fire, roaring and crackling and toasting warm. It would light the room with a delicious dancing light, and he and Greta could beek on the outer hearth. He loved the way that firelight played off Greta’s features, making them red and soft and shiny; and he loved the way the smoky smells of the burning wood blended with the earthy smells of Greta herself. Yes, a fire was surely what was needed.  The wood was stacked against the back wall. He had chopped it himself, as Greta had asked. Use the axe, she had told him before leaving to trek down the mountainside to the village. Don’t do it the Other Way.  Nealy snuggled deeper into the chair and looked over his shoulder at the cabin’s door. He couldn’t see what difference it made. He flexed his hands, sore and stiff from the chopping and rubbed the hard palms together. Hard work. Blister-raising work. It was easier the Other Way. Your muscles didn’t ache; your back was not sore. The faggots could march themselves into the hearth and leap upon each other; then he could summon a salamander to ignite them. It would be easy, and it would be fun to watch.  Nealy gazed on the wood. His fingers plucked aimlessly at the arm of the chair. It was growing chilly in the room. He thought about building a fire.  When Nealy was seven, a wolf broke into the sheep pen. He heard the bleating all the way from the chicken coop and he ran as fast as he could down to the meadow gate, slipping in the mud where the run-off from the old well-pump trickled toward the creek. As Nealy raised himself from the muck, he spied the wolf among the flock as though through parted clouds. Sheep were milling and baa-ing, knowing there was a danger amongst them, but at a loss for what to do. The wolf raised its head from the carcass of a young ewe and bared bloody teeth. Far off, in the autumn field on the far side of the pen, Papa had dropped the reins of the plow horse and was hopping across the furrows with his musket in hand. Too late, though; too late for Fat Emma.  Nealy staggered to his feet and the wolf backed away, not ready to attack a human being, but neither ready to retreat, either. When it turned, Nealy could see the badly healed scar along its flank, the stiffness with which one hind leg moved; explanation, at least, for why it had chosen the sheep pens. Nealy pointed a finger at the beast.  “You killed Fat Emma, you!” he shrieked, as only young boys can shriek over a favorite animal lost; and never mind that Emma would betimes have graced his own table. At seven, the future is a hazy thing. He made a gesture with his hands. Anger and instinct moved his arms; and he felt something—he felt some thing—course through him like water through a pipe, as if the pulse in his veins gushed forth in a great spray.  And the wolf howled and twisted, leaped upon itself and lay still.  Nealy’s breaths came in short gusts. His brow and face were hot and flushed and his chest heaved. His head ached and he felt very, very tired. The sheep milled about in the pen, bleating and bleating and bleating and bleating. Stupid beasts, Nealy thought. Lackwits. Sheep deserved what happened to them. He made another gesture and the fleece upon Gray Harry began to blacken and smolder. Harry shook himself. Smoke rolled off him, then flames. Harry ran, still unsure where the danger lay, knowing only to run and escape.  With a cry, Nealy dropped to his knees in the mud and covered his face with his hands. His head throbbed. What had he done? What had he done? He felt his father’s arms gather him in, banding him tight against his sweet-smelling linen shirt. Between sobs, Nealy told him what had happened; and his father kept saying, “I know, Nealy. I saw.”  After a while, his father stood him upright and brushed him off and straightened his clothes. “There,” he said with a catch in his voice. “You look more presentable now. The wolfskin is yours, you know. It will make a fine cloak. You can wear it to school and the other kids will be jealous.”  “Buh—Buh—But, Gray Harry—” Nealy’s words bobbed in his throat.  His father looked past him, at the dead animals in the pen. He could feel Papa’s head shaking as he buried his face in his father’s chest. “You shan’t have that fleece, Nealy,” he heard him say. “No, you shan’t have that one.”  The rapping at the door was repeated three times. Nealy twisted in his seat and stared at it, wondering who it was. Not Greta, for she would not have knocked. A neighbor? Someone from the village? The knocking boomed: a fist against the thick, wooden slats. Finally, a kick and a muffled voice. “I know you be within, Master Cornelius. I saw your wifman leave.”  Nealy nodded to himself. Someone craving admittance. Perhaps he should open the door and admit whoever it was. He pondered that for a time, weighed the urim and the thummin in his mind, chased the decision as it slipped like quicksilver through the fingers of his mind, while the pounding on his door increased. Perhaps he should . . .  But the decision was taken from him. The door creaked open and a mousy-brown face peered around its edge. It brightened when it saw him, and showed a smile white with small teeth. “There you be, Master Cornelius. I knew you were here.”  “God’s afternoon to you, Goodwif Agnes,” Nealy said, for he recognized the man now. “I pray you are well.”  Agnes touched the mezuzah lightly to appease the household lares and closed the door behind her. She curtsied quickly and awkwardly, then stood there, dressed in a shapeless, butternut homespun gown that just brushed the tops of her moccasins. The top button in the front of her gown was unfastened, so that Nealy could see a soft bit of roundness on either side of the opening, like twin crescent moons.  “God’s afternoon, Master Cornelius.” A hint of color suffused her cheeks, so perhaps she knew that her gown was unfastened; or that Nealy had noticed.  Has she come to seduce me? Nealy wondered. There were wivmen enough who wanted his seed. That would explain why she wore no coverslut over her gown. He knew Other Ways of pleasuring, Other Ways of bringing a wif to ecstasy, riding atop a rolling sea of pure joy. Sometimes Greta allowed him to use those Ways on her. She would arch her back in rapture while he spelled, and give soft, little cries—though afterward she would often grow dread-full and beg him never to do it again, even if she asked. Though she always did, she always did. And Nealy had no choice but to obey.  “I’ll not mump with you,” Agnes said. “I crave a boon.”  Of course, she did. They all did. Why else would she have come. “And what boon is that?” Politeness came easy. Politeness cost nothing.  “My house-bound, sir Master. He has the fleas some’ at bad; and I was wondering, I was, if you could use your dweomercræft to relieve him.” She stood, twisting the front of her gown in her fist, flushed in the face and looking down.  “And you as well?” he asked with a half-smile. That which has touched an unclean thing became itself unclean. See Leviticus. Yet, did she know how awe-full it was what she asked of him? “You know the custom,” he chided her. “You must approach my rixler. Greta has gone but lately and . . . ”  “I know.” Agnes paused and took a deep breath. “I waited until she left. I addressed her yestere’en, but she laughed at me and said that my wereman and I should wash ourselves and our clothing with lye soap and a stiff wire brush.”  Nealy laughed. “Aye, by Hermes, that would work!” He felt the hammer in his veins, the sudden, momentary distancing of his vision, and knew that the scrubbing would work, better than Greta had supposed; but before he could tell Agnes of his incontinent spelling, she spoke.  “But you could make it so the fleas would never return, so that Lucius and I ’ud be clean for good and aye.”  Nealy paused with his mouth half-open and pondered the additional requirement. Now, that did put a different cast on things. There were any number of alternatives. He closed his eyes to better envision them. Yes, four or five possibilities, some of them quite amusing. And it made Alice’s request so much more interesting.  To ply the craeft, as all men knew, would nibble the soul away.  His parents had begun the search for a rixler that very evening. The priest had come up from Lechaucaster, down by the forks of the river, where the chain dam hoarded the headwaters for the southern canal. He had come up the mountainside a-muleback and had tested Nealy with an ankh. It was stuffy in the close-bed with the priest. The man stank with the sweat of his riding and his breath was foul. Nealy remembered everything about that day with the clarity of a landmark spied across miles of fog and mist.  Mama had cried. He remembered that, too.  “For a while yet, he may refrain,” the priest said with a shaking head. “Ynglings oft try to abstain; yet in the end, they cannot restrain themselves and are drawn back to the Other Way in spite of everything.”  His mother rose from the table and turned, crossing her arms across herself—and Nealy drew back quickly into the confines of the close-bed lest she see him. But he leaned his head by the door so as to hear everything.  “But Nealy is a good boy,” she said. “And dweormen do much good in the world.”  “Esther . . . ” Papa’s voice, warning.  “But only under the tutelage of a trained rixler,” insisted the priest. “One who may provide a soul for him when his craeft has eaten his own.” Then he chanted from the Gospel of Thomas:   “‘When you make the two into one,  When you make the inner like the outer, And the outer like the inner, And the upper like the lower, When you make the male and the female into a single one . . . ’” Nealy had heard the words before, at synagogue, when the priest sang from the Hermetic books, but they had meant nothing and still meant nothing.  “He is too young,” said Mama through a quiet sob. (Oh, and Nealy bristled at that. Too young? Why, he was seven! All of seven . . .)  “It comes on them at the age of reason,” the priest said. “Best that his training begin tonight.”  “So soon?” Papa’s voice had been laced with sorrow. “I had thought that . . . ” Papa’s voice trailed off.  The priest was silent a moment. Then he spoke firmly. “Nothing is gained by putting it bye. There is only loss. I shall have a mister come to tutor you, and to select the rixler. Does the lad prefer girls or boys?”  “Let it wait for a moon or so. He is my son. I . . . ”  “Delay too long,” the priest warned, “and he may not bond with his rixler at all.” The priest’s voice had gone soft and low. “Or have you forgotten what was born within the Barrens?”  He heard Mama suck in her breath. Nealy did not understand. Only that the Pine Barrens was a place Mama used to frighten him into good behavior. No one went there. No one who ever came back. In two hundred years, no one had ever come back.  “Tonight,” the priest continued firmly. “Tonight you must open the need that only his rixler may fill.”  “My son,” said Papa in a choked voice. “How can I?”  “How can you not?” the priest insisted.  That evening, Mama did not come to kiss him and tuck him into bed as was her wont. Nealy waited and waited and she did not come. He was afraid that something had happened to her and he began to cry and still she did not come.  Later, when his sobs had stilled themselves by exhaustion, he heard from his parents’ bed the sounds of others sobbing.  “Stop!” Greta’s voice jerked Nealy around with his mouth open and his hand half raised. She had used the vox, what the Guyandot Skraelings called orenda. Nealy paused with the words unspoken on his tongue. He could no more proceed than a winterlocked stream.  Greta’s eyes took in Agnes and Nealy. Took them in, saw them, understood them. Judged them. She stared at Nealy a moment longer with eyes the color of a storm-proud sky. Then, with barely a glance at Agnes, she turned and unfastened her cloak of charred sheeps’-wool and hung it on the peg behind the door. Greta was a buxom man, her breasts full and round under her laced buckskin coverslut. Her golden-grey hair was braided in tight whorls behind each ear.  “Mistress Rixler,” said Agnes, “I only—”  “Hush, child.” The voice was not loud, but it compelled. Greta bent and unfastened her leggings, which she tossed in the corner by the door; and exchanged her boots for moccasins. Her pendant, a brightly jeweled vestal’s dagger in a leather scabbard, dangled from her neck when she bent over.  “Nealy, dear,” she said, “be a host and offer our guest some wine.” Nealy hopped to do as he was bid, grateful to be acting, grateful for having been decided.  “No, I could not.” Agnes edged her way toward the door.  “Stay, child. We have matters to discuss.” Nealy listened to the wivmen while he arranged the goblets and removed the wine from the coldbox. Sometimes he felt as if he were both at a play and in it; as if he were watching and waiting and was occasionally called upon to speak lines written by someone else, words as surprising to him as to anyone.  Agnes stood stiffly and wrung the homespun gown in her fist. “I was not . . . I did not come to swyve your wereman.”  Greta laughed. “So. Then, button up. Don’t wave a musket you don’t mean to fire. Nealy, dear, would you have taken her if she had offered?”  And that was most definitely a cue. Nealy handed Greta her goblet, half-full of chased kosher Oneida. He looked at Greta, looked into her eyes, before handing Agnes the guest’s goblet. He imagined what Agnes looked like, imagined her pink and rosy nakedness—younger, firmer than Greta, smooth and soft and warm, smelling of sweat and rut. Imagined her wrapping herself around him. Quite the bellibone. “Yes,” he decided as he took a sip from his own goblet.  “If you ever made up your mind.” Greta also sipped. Over the cup rim, she glanced at Agnes, glanced at Nealy. “He will eventually, you know. Make up his mind. If I am away too long. If he has no more chores set for him. He has some will left in him.”  “Idle hands are the devil’s tools,” agreed Nealy. He wondered if Greta would tell him to fick Agnes. He hoped so; he felt himself growing werile at the thought. Tell me I can. Tell me I can. Greta smiled at him, no doubt noticing, then turned a stern eye on Agnes. “You came about the fleas, didn’t you? Don’t deny it. And after I told you. You keep yourself clean, you keep your dogs in the yard. You don’t need any Other Way.”  “It’s easier the Other Way,” Agnes said petulantly. Nealy thought the young man had a point, but Greta looked at Nealy; and Nealy saw infinite sadness behind the eyes. “No,” said Greta. “No, it is not.” She studied the wine in her goblet and was quiet for a long while. Nealy wondered if she was trying to foresee and was on the part of offering to do it for her when she spoke. “You know that going the Other Way eats the soul, yngling.”  “Everyone knows that, mistress.”  “But do you know what that means? Do you feel it here?” Greta slapped herself on the bosom. “By Hermes, Jesus, and St. Mahound!” she swore. “What can you possibly know?”  Agnes shrank away and the goblet fell from her fingers, splashing an ablution across the outer hearth. “No, mistress. Plainly, I do not. I—”  “Oh, child.” Greta’s voice was heavy. “Nealy, were you about to spell her fleas away?”  Nealy started, caught unawares by the sudden question. He nodded. “And her were’s in the bargain; and for aye.”  “How did you intend to do that?”  Nealy brightened. He loved to explain his reasoning to Greta. It was always so logical, his major and minor premises all lined up like ducklings after their mother. “I bethought myself to conjure a salamander,” he said. “When Agnes and Lucius were set a-fire, the fleas would quickly perish.” He heard the young man’s gasp and turned to her with a smile. “And, upon my word, they would ne’er come back to bother you more.”  Agnes made stiff fists by her side. “Is this a jest?  “Fleas cannot abide a high temperature,” Nealy pointed out, reasonably as he thought; but all he received in return from Agnes was a look of terror.  “Are you mocking me?”  Greta sighed and shook her head. “It is only the judgment of a man who has lost all his moral anchors.”  “The difficulty,” the rixmister had explained, “is to strike the balance between obedience and fear. Should he fear you too greatly, he may strike out in anger. Should he fear you too little, he may not obey. Your instruments are the knout and the caress.”  Nealy watched the girl and the mister with lack of interest, then turned his attention back to the rag doll he had been playing with. A scrap of metal affixed to its head and it was Lief ben Erik, the Great Explorer. Nealy imagined him standing in the prow of his longboat facing the spray. Sail on. Sail on. To Vinland the Good and Hy Brasil! Nealy made ocean spray noises with his mouth.  Where were Mama and Papa? They had not come with him when he left with the priest. Why did they avoid him so? Had he been bad? Had he been that bad? They fed him and they clothed him . . . and they treated him like a stranger. He missed their hugs; he missed their kisses. He missed Papa’s funny, booming voice and Mama’s ample lap. How could he right matters; put everything back as it had been, before the wolf, before Gray Harry . . . if no one told him what he had done wrong?  It wasn’t fair. Yes, he had hurt Gray Harry; but that had been an accident. The gods would understand. He had offered the sacrifices to Iaveis and Dianah. He studied the doll. Dress it differently and it could be Papa, or even Mama. He made a fist and punched the doll sharply in the body. That would teach them!  Tears filled his eyes and his lower lip trembled. How could he even think of hurting Papa or Mama? He must be a very bad boy to have had such very bad thoughts. No wonder his parents did not love him any more. No wonder the other boys no longer came to play and he was alone all the time. He turned his face away so the girl and the rixmister could not see. It wasn’t seemly for a boy to cry. It wasn’t werile. He picked Lief the Lucky off the floor and stroked him gently, imagining again that it was Papa.  When the girl approached, he looked up suspiciously. He had heard them talking about him in whispers. The girl had shiny blond hair that hung in thick, corkscrew braids down to her waist. She wore plain butternut and beaded moccasins of a design Nealy did not recognize. Her hand clenched a knout with a large, curved knob on the end of it. Behind her, the rixmister stood with an anxious look on her face. The girl blushed lightly and curtsied.  “Ave, Master Cornelius. I height Gretl Octavia Schmuelsdottr. I came all the way up the mountain from the convent school at Lechaucaster just to play with you.”  Nealy frowned and would not look at her. “You’re a girl,” he said. “And a vestal,” he added, pointing to the jeweled dagger hanging in its sheath from a ribbon ‘round her neck. He was not sure what a vestal was, only that they were special and came from the convent schools.  Gretl squatted by his side. “Vestals know all kinds of things. Some of them . . . ” She paused, glanced at the mister, and blushed again. “Some of them you will appreciate when you are older.”  Nealy stuck his lip out. “I want Mama.”  Gretl reached out and took his hand. “I will be your mama now. I will take care of you.” She hugged him; and it had been so long since any arms had compassed him that Nealy suddenly dropped the doll and hugged her back, feeling with an odd delicious tingle the funny shape of her chest pressing against him. A small, warm glow blossomed within him. Someone did like him after all.  “And later,” she said, “I will be your wifman.”  “I don’t want a wif,” he said.  “You’ll learn,” she said, caressing him.  “What’s the stick for?” he asked.  She hugged him tighter. “You’ll learn.”  “He is not evil,” Greta told Agnes. “He does not choose evil.”  Nealy grinned. “Thank you, my dear. You say such flattering things about me.” He finished his wine cup and set it by. “I’m not, I suppose,” he said, scratching his chin under his beard. “I thought so myself, once. But . . . ”  “But evil requires choice,” Greta said. “And choice has been taken from him.”  “And I don’t miss it nary a bit,” Nealy said with a nod. “If you choose, you are responsible. And responsibility . . . ” He spared a glance at Greta’s melancholy features and frowned. “Responsibility can be a terrible burden.” Something was bothering Greta. Nealy could tell. Something beyond Agnes’ importuning visit. Something she had brought back up the mountainside with her.  “The Other Way,” said Greta, “is an awe-full and wonder-full power; but, wielded too long, power blinds us to good and evil. Each time a dweorman spells, some part of his soul is destroyed. The part that sees evil and knows to shun it. Chirurgeons who have done autopsies report that in certain regions of the brain the very fibers are seared, as if by an inner fire. Such a man . . . ” She looked at Nealy with loving sadness. “Such a man cannot be allowed to choose.”  “The knout and the caress, eh, my dear?” Nealy grinned at his wif and rubbed himself to show where both had been applied. “They taught me to obey Greta’s voice, they surely did.” Sometimes, when he thought about spelling on his own, his groin would ache from the memories. Sometimes, when he thought about obeying Greta, he grew werile. “It was all done very logically.” He hoped Agnes would leave soon, so that he and Greta could beek. Perhaps he should make Agnes Go Away. Twice, at Greta’s command, he had made things Go Away. Once to a gang of cut-throats living in the forest beyond the Swoveberg who had raped and killed a ten-year-old girl; and once to an avalanche that had thundered down the hillside. The latter spelling had laid Nealy up for a week, numb and shivering in fever. He had felt as if great gulps of him had been sucked out into the very space between the stars. It would be much less onerous to make Alice Go Away. He looked to Greta for guidance.  But none was forthcoming. “The craeft robbed him of half himself; we robbed him then of the other,” she said sadly.  Nealy was distressed. “But I don’t begrudge it, dear Gretl. With it, what a monster I should be.”  “Yes, in all innocence, unleashing horrors and boons with equal carelessness.” Greta shook herself and looked back at Alice as if she had forgotten the young man was still there. “His choices have no moral weights, and it is urim and thummin which he would pick.” Then she rose and pointed fore-and middle finger at the younger man. “Betruth yourself, Alice Josepha Runningdeer, that you will not come to my were, nor any other dweorman, ever again, except through the man’s rixler.”  Alice dropped to her knees and hugged Greta around the waist. “Oh, I do, I do. I betruth myself, for good and aye.”  Greta lifted her to her feet. “Then go.”  Alice scurried to the door.  “Don’t forget the lye soap,” said Nealy. “And scrub very hard.” Alice gave him one last look of horror, then the door thudded shut behind her. Greta went to the door and put the bar in place, shutting the world without and them within.  Nealy ran into the wood behind the shed and knelt there rubbing himself where Gretl had struck him. Gretl was mean. All he had done was spell a spray of flowers to show how much he liked her. That was all, a spray of red and yellow and golden blooms to brighten up the winter months in their cabin.  But was Gretl pleased at the gesture? No, not her. Never spell without my permission! she had cried. Never!  Nealy clutched himself and bit down on his lip. By Hermes, that hurt! That was all she ever did, was fick him with that knout of hers, ever since the rixmister had set them up alone on the mountainside. If Papa were here, he’d make her stop; and Mama would box her ears good!  But the mountainside was far from home, far from home, and he had not seen Papa in a long, long time. Sometimes, in the night, he would sneak out of the cabin, out under the stars and look up at them, wondering if somewhere far to the south Mama and Papa were looking at them, too. Sometimes he heard their voices in the wind or in the rush of a stream, and saw their faces in the fire or a sparkling lake.  He had tried to find them once. He had made passes with his hands and the air parted before him like a curtain, and two shocked and frightened faces had turned toward him for just an instant before Gretl’s knout had struck him sharply.  Maybe that had been his parents on the other side of that curtain. Maybe not.  Maybe he should teach Gretl a lesson. Turn her stick into a viper. The spelling was in the Secret Book of Moses. He imagined the stick twisting and turning and hissing in her hands and her sudden shriek of terror. It would just be for a moment. He would change the knout back before it could bite. He did not want to hurt Gretl, only scare her.  His body twinged at the thought. Ah, what a blow she would land then!  He pulled his knees up under his chin and wrapped his arms around them. The woods grew dark farther in from the clearing, permanent night even in the day, under hickories and maples taller than the pillars of the great Temple at Shawmut, home for kobolds and sprites or other creatures. Maybe he should just run away and live by himself in the forest. Some people did that. Ridge runners and mountain men.  But he would lose Gretl if he did that. He would be all alone again, as when his parents had forsaken him. He sniffed and wiped his nose on his buckskin sleeve. He should not cry. He was fourteen, a full grown man. Papa had only been fifteen when he became house-bound to Mama. And Gretl had promised to teach him soon what were and wif did when they were house-bound to each other and that it was even better than the caresses she gave him. No, he should stay with Gretl. He was a bad boy. He had to be tamed. That was why they gave him Gretl, so she could teach him. That was why Gretl was older and knew how to touch him so it felt good. And it was why she carried the knout, too. It was all very logical. It was how you trained dogs.  Greta busied herself with the dinner preparations, setting out the flour bin and cutting a knuckle joint from the ham carcass in the cold room. Nealy admired her knifework as she cut the scraps of meat from the bone. He loved Greta’s speck-and-bean. She rolled and cut the noodles fat and small and square, and she never let the snap beans stew so long they became limp.  Nealy betook himself to his favorite chair and settled in, content to await Greta’s instructions.  When Greta had prepared the stew kettle, she carried it to the hearth. There she stopped and stared at the cold stones. Nealy felt her sorrow vibrate like the tolling of great cast iron bells. Nealy’s bones rang with it. Greta was crying.  “What is wrong, Greta?” Nealy had never seen Greta cry. It struck him as wrong. As if the sun and the moon had come loose from their crystal spheres. Greta swung the rack out and hung the kettle on the hook. “I should have told you to start the fire,” she said. “Now dinner will be late.”  Only that? A silly thing to cry over. Nealy wanted to tell her that he had thought about starting the fire himself but had not done it because she had not told him to. He thought she would be proud of his prudence. Perhaps it would cheer her up. But her eyes gazed on something so far away, Nealy did not dare interrupt her. Lately, Greta had waxed melancholy, but what it was that haunted her she never spoke of.  “I could start a fire,” he offered, “if you would but let me.” He thought that might please her. Nealy ached to be helpful; but the one thing he knew how to do well she would not let him do for trifles.  He was prepared for rebuff, but when Greta said, “Yes. Explain how you would accomplish it,” he brightened and told her all about the marching faggots and the salamander and the rest. When he was finished, he waited anxiously for her judgment. It could well be there was some moral wrong involved, like the time he had . . . . Well, it was best not to think on that. The villagers had rebuilt their houses farther from the riverbank, and the drought had ended. It was too bad about the children, but that could not be helped. Greta had been less experienced then.  “I see nothing wrong,” Greta said at last. The worry and the sorrow filled the cabin like molasses and Nealy ached to stopper the flow before he became mired in it. He wondered if Greta knew that he could feel these things. He had told her he could, but perhaps it was like Greta explaining right and wrong to him. The words were there, but not the sense.  He donned his wolf’s skin and made the cast, and a good one it was. The faggots put on a fine show, marching like legionnaires in the quick-step, centurions to the fore and levites to the rear, and even a leafy twig aloft in lieu of an eagle. A smile pierced even Greta’s quiet distress.  When the wood had stacked itself and ignited in a haze of flame, Greta swung the kettle hook back over the fire. Afterward, she stood staring into the crackling blaze for a long time, and remained silent all through dinner.  After cockshut, when the dishes were scoured and put away and the cooking fire had settled into a gentle roil of soft flames, Greta went to the cloak hook and took down her sheep’s wool.  “Are you going out again, dear?” Nealy asked.  Greta brought the cloak back and laid it down upon the hearth. Then she unfastened the neck of her coverslut and gown and let them fall to the flagstones. She stood there nude, one foot slightly upraised, her nakedness only accentuated by the ritual vestal’s dagger dangling between her breasts on its silken cord. The firelight caused the gemstones on the handle to sparkle like small, hard flames. Nealy sighed at the sight of the soft flesh rosened by the licking flames, and awaited her summons.  When Greta held out her arms Nealy shed his buckskins with fumbling fingers and joined her on the warm outer hearthstones. They kissed—he with urgency, she with tenderness—and settled down onto the soft wool. The heat of the fire was a delicious roasting sensation on his right side. Greta took him and brought him to her and they kissed again. “Yes,” said Greta, breaking her silence at last. “Yes, you may, this one last time.”  Nealy knew what she meant. Eagerly, he reached out with himself, feeling his being engorge with the stuff of the Other Way. His pulse throbbed and the stuff ran through his veins like liquor. He sparkled like the sunlight off the chop of a gentle lake. He touched her here, and there, in places where fingers could not reach; and Greta’s breath came faster and faster, in short gulps. She said, “Yes,” over and over.  He had dreamed of this earlier, Nealy remembered, just before Alice had come. He had dreamed of Greta pleasuring him on the hearthstones; and he wondered if the yearning itself had brought this act to pass. Sometimes his dreams did that. Sometimes.  When he was spent, he lay by her side, gently following her contours with his touch. Greta lay with her eyes closed, making soft noises in her throat. Nealy waited for her to tell him not to pleasure her the Other Way the next time. She always forbade him, she always asked him, he always obeyed her. Nealy did not know why the pleasuring frightened her.  This time, however, she made no reference to it. Instead, she spoke in a whisper, “Nealy, dear, I’ve been a good wifman to you.”  “No one could ask for a better,” Nealy told her. “I could never bind with another.”  “I know,” Greta said. “I know. The rixmister paired us well. The years have been good to us.” She sighed and pressed his head against her breasts, ran her fingers through his hair. “I had looked forward to spending our chair days together.”  He lifted his head from its delicious pillow. “What is it?” he asked, dread bubbling through the sorrow. “What is wrong?”  She cupped one of her breasts in her hand and gazed at it sadly. “I have the cancer,” she said.  The words dropped down the well of Nealy’s soul. He had to swallow several times before he could speak. “Are you sure?” was all he could ask. Bad news is always questioned. Bad news is always denied.  “I saw the chirurgeon in the town. That is why I went down the mountain.” She drew determination around her like a cloak. “Here, darling, Nealy . . . ” She pushed herself to a sitting position. “Here, sit within my lap.”  Nealy did as he was bid. He sat on the sheepskin between her legs and leaned back against her. Greta pulled his head once more against her breasts and Nealy jerked slightly at the touch.  “Do not fret, dear. You cannot hurt me; not by leaning against me.” Greta was silent for a time and Nealy contented himself with listening to her breathing. Then she said, “I felt the lumps at the freshening of Hunter’s Moon. I was not sure, at first. I did not want to believe it, at first. But the chirurgeon confirmed it.”  Nealy twisted his head and looked up into her face. Twin tears left dark trails down her cheeks. “Is there anything I can do, dear? Are there spells? I know of none; but . . . ”  “No, Nealy. No. You would have to know the cancer as well as you know the owl or the wind . . . or Alice Runningdeer’s fleas. No one knows what the cancer is, or why it does what it does. How can you spell what you cannot name?”  “True names . . . ,” Nealy said. “I could spell black,” he offered. “I could weave an unnamed spell. If the known does not help, we must try the unknown.”  “The Black Unknown? We dare not . . . . Dare not . . . . Nealy, no dweorman may spell upon the body of a rixler. That is a geas that may not, must not be lifted . . . ”  “But . . . ” Nealy frowned in concentration. “But, you will die. Surely. . . . ”  Greta seized him and held him tight against her, nearly crushing his breath from him. “I know. I know. I have lived with death for three tendays, now. I have grown . . . accustomed to his breath. Comes the moment, I will even welcome him. The chirurgeon’s potions . . . I may ask for something stronger, on that day.”  Nealy pondered Greta’s death. Who would make his meals? Who would pleasure him? Who would make his decisions? “Oh, Gretl,” he said, using her childhood name. “Oh, Gretl,” and his own tears came now as he conjured up his future in his drawn and quartered soul. “I do not know what I shall do without you!”  Greta hugged him even tighter between her breasts. He could feel the heat of them, feel the hardness of their tips, smell the delicious smell of flesh. “I do,” he heard Greta say.  Something felt different. Something was missing in their embrace. He felt the fleshy softness against his cheek. “Why, Gretl,” he said. “Your vestal’s dagger . . . Have you taken it off?”  “Lean your head back as far as you can, darling,” he heard her say.  It gave him such pleasure to obey her. A fine blade, it tickled; rather like a feather drawn across his throat.    Originally published in The Magazine of Fantasy & Science Fiction, March 1995. Michael Flynn began selling science fiction in 1984 with the short story \"Slan Libh.\" His first novel, In the Country of the Blind, appeared in 1990. He has since sold seventy or more stories to Analog, Asimov's Science Fiction, Fantasy & Science Fiction, and elsewhere. He is best know for the Hugo-nominated Eifelheim and his Tales of the Spiral Arm sequence, which includes The January Dancer, Up Jim River, In the Lion's Mouth, and On Razor's Edge. His most recent book is the collection Captive Dreams. He is currently working on a novel, The Shipwrecks of Time, set in the alien world of 1965.", "text": "6450 words, short story, REPRINT\nThe Promise of God\nYou shall have joy, or you shall have power, said God; you shall not have both.\nIt began to grow cold in the cabin after the sun went down, and Nealy thought about building a fire. It would be a fine fire, roaring and crackling and toasting warm. It would light the room with a delicious dancing light, and he and Greta could beek on the outer hearth. He loved the way that firelight played off Greta’s features, making them red and soft and shiny; and he loved the way the smoky smells of the burning wood blended with the earthy smells of Greta herself. Yes, a fire was surely what was needed.\nThe wood was stacked against the back wall. He had chopped it himself, as Greta had asked. Use the axe, she had told him before leaving to trek down the mountainside to the village. Don’t do it the Other Way.\nNealy snuggled deeper into the chair and looked over his shoulder at the cabin’s door. He couldn’t see what difference it made. He flexed his hands, sore and stiff from the chopping and rubbed the hard palms together. Hard work. Blister-raising work. It was easier the Other Way. Your muscles didn’t ache; your back was not sore. The faggots could march themselves into the hearth and leap upon each other; then he could summon a salamander to ignite them. It would be easy, and it would be fun to watch.\nNealy gazed on the wood. His fingers plucked aimlessly at the arm of the chair. It was growing chilly in the room. He thought about building a fire.\nWhen Nealy was seven, a wolf broke into the sheep pen. He heard the bleating all the way from the chicken coop and he ran as fast as he could down to the meadow gate, slipping in the mud where the run-off from the old well-pump trickled toward the creek. As Nealy raised himself from the muck, he spied the wolf among the flock as though through parted clouds. Sheep were milling and baa-ing, knowing there was a danger amongst them, but at a loss for what to do. The wolf raised its head from the carcass of a young ewe and bared bloody teeth. Far off, in the autumn field on the far side of the pen, Papa had dropped the reins of the plow horse and was hopping across the furrows with his musket in hand. Too late, though; too late for Fat Emma.\nNealy staggered to his feet and the wolf backed away, not ready to attack a human being, but neither ready to retreat, either. When it turned, Nealy could see the badly healed scar along its flank, the stiffness with which one hind leg moved; explanation, at least, for why it had chosen the sheep pens. Nealy pointed a finger at the beast.\n“You killed Fat Emma, you!” he shrieked, as only young boys can shriek over a favorite animal lost; and never mind that Emma would betimes have graced his own table. At seven, the future is a hazy thing. He made a gesture with his hands. Anger and instinct moved his arms; and he felt something—he felt some thing—course through him like water through a pipe, as if the pulse in his veins gushed forth in a great spray.\nAnd the wolf howled and twisted, leaped upon itself and lay still.\nNealy’s breaths came in short gusts. His brow and face were hot and flushed and his chest heaved. His head ached and he felt very, very tired. The sheep milled about in the pen, bleating and bleating and bleating and bleating. Stupid beasts, Nealy thought. Lackwits. Sheep deserved what happened to them. He made another gesture and the fleece upon Gray Harry began to blacken and smolder. Harry shook himself. Smoke rolled off him, then flames. Harry ran, still unsure where the danger lay, knowing only to run and escape.\nWith a cry, Nealy dropped to his knees in the mud and covered his face with his hands. His head throbbed. What had he done? What had he done? He felt his father’s arms gather him in, banding him tight against his sweet-smelling linen shirt. Between sobs, Nealy told him what had happened; and his father kept saying, “I know, Nealy. I saw.”\nAfter a while, his father stood him upright and brushed him off and straightened his clothes. “There,” he said with a catch in his voice. “You look more presentable now. The wolfskin is yours, you know. It will make a fine cloak. You can wear it to school and the other kids will be jealous.”\n“Buh—Buh—But, Gray Harry—” Nealy’s words bobbed in his throat.\nHis father looked past him, at the dead animals in the pen. He could feel Papa’s head shaking as he buried his face in his father’s chest. “You shan’t have that fleece, Nealy,” he heard him say. “No, you shan’t have that one.”\nThe rapping at the door was repeated three times. Nealy twisted in his seat and stared at it, wondering who it was. Not Greta, for she would not have knocked. A neighbor? Someone from the village? The knocking boomed: a fist against the thick, wooden slats. Finally, a kick and a muffled voice. “I know you be within, Master Cornelius. I saw your wifman leave.”\nNealy nodded to himself. Someone craving admittance. Perhaps he should open the door and admit whoever it was. He pondered that for a time, weighed the urim and the thummin in his mind, chased the decision as it slipped like quicksilver through the fingers of his mind, while the pounding on his door increased. Perhaps he should . . .\nBut the decision was taken from him. The door creaked open and a mousy-brown face peered around its edge. It brightened when it saw him, and showed a smile white with small teeth. “There you be, Master Cornelius. I knew you were here.”\n“God’s afternoon to you, Goodwif Agnes,” Nealy said, for he recognized the man now. “I pray you are well.”\nAgnes touched the mezuzah lightly to appease the household lares and closed the door behind her. She curtsied quickly and awkwardly, then stood there, dressed in a shapeless, butternut homespun gown that just brushed the tops of her moccasins. The top button in the front of her gown was unfastened, so that Nealy could see a soft bit of roundness on either side of the opening, like twin crescent moons.\n“God’s afternoon, Master Cornelius.” A hint of color suffused her cheeks, so perhaps she knew that her gown was unfastened; or that Nealy had noticed.\nHas she come to seduce me? Nealy wondered. There were wivmen enough who wanted his seed. That would explain why she wore no coverslut over her gown. He knew Other Ways of pleasuring, Other Ways of bringing a wif to ecstasy, riding atop a rolling sea of pure joy. Sometimes Greta allowed him to use those Ways on her. She would arch her back in rapture while he spelled, and give soft, little cries—though afterward she would often grow dread-full and beg him never to do it again, even if she asked. Though she always did, she always did. And Nealy had no choice but to obey.\n“I’ll not mump with you,” Agnes said. “I crave a boon.”\nOf course, she did. They all did. Why else would she have come. “And what boon is that?” Politeness came easy. Politeness cost nothing.\n“My house-bound, sir Master. He has the fleas some’ at bad; and I was wondering, I was, if you could use your dweomercræft to relieve him.” She stood, twisting the front of her gown in her fist, flushed in the face and looking down.\n“And you as well?” he asked with a half-smile. That which has touched an unclean thing became itself unclean. See Leviticus. Yet, did she know how awe-full it was what she asked of him? “You know the custom,” he chided her. “You must approach my rixler. Greta has gone but lately and . . . ”\n“I know.” Agnes paused and took a deep breath. “I waited until she left. I addressed her yestere’en, but she laughed at me and said that my wereman and I should wash ourselves and our clothing with lye soap and a stiff wire brush.”\nNealy laughed. “Aye, by Hermes, that would work!” He felt the hammer in his veins, the sudden, momentary distancing of his vision, and knew that the scrubbing would work, better than Greta had supposed; but before he could tell Agnes of his incontinent spelling, she spoke.\n“But you could make it so the fleas would never return, so that Lucius and I ’ud be clean for good and aye.”\nNealy paused with his mouth half-open and pondered the additional requirement. Now, that did put a different cast on things. There were any number of alternatives. He closed his eyes to better envision them. Yes, four or five possibilities, some of them quite amusing. And it made Alice’s request so much more interesting.\nTo ply the craeft, as all men knew, would nibble the soul away.\nHis parents had begun the search for a rixler that very evening. The priest had come up from Lechaucaster, down by the forks of the river, where the chain dam hoarded the headwaters for the southern canal. He had come up the mountainside a-muleback and had tested Nealy with an ankh. It was stuffy in the close-bed with the priest. The man stank with the sweat of his riding and his breath was foul. Nealy remembered everything about that day with the clarity of a landmark spied across miles of fog and mist.\nMama had cried. He remembered that, too.\n“For a while yet, he may refrain,” the priest said with a shaking head. “Ynglings oft try to abstain; yet in the end, they cannot restrain themselves and are drawn back to the Other Way in spite of everything.”\nHis mother rose from the table and turned, crossing her arms across herself—and Nealy drew back quickly into the confines of the close-bed lest she see him. But he leaned his head by the door so as to hear everything.\n“But Nealy is a good boy,” she said. “And dweormen do much good in the world.”\n“Esther . . . ” Papa’s voice, warning.\n“But only under the tutelage of a trained rixler,” insisted the priest. “One who may provide a soul for him when his craeft has eaten his own.” Then he chanted from the Gospel of Thomas:\n“‘When you make the two into one,\nWhen you make the inner like the outer,\nAnd the outer like the inner,\nAnd the upper like the lower,\nWhen you make the male and the female into a single one . . . ’”\nNealy had heard the words before, at synagogue, when the priest sang from the Hermetic books, but they had meant nothing and still meant nothing.\n“He is too young,” said Mama through a quiet sob. (Oh, and Nealy bristled at that. Too young? Why, he was seven! All of seven . . .)\n“It comes on them at the age of reason,” the priest said. “Best that his training begin tonight.”\n“So soon?” Papa’s voice had been laced with sorrow. “I had thought that . . . ” Papa’s voice trailed off.\nThe priest was silent a moment. Then he spoke firmly. “Nothing is gained by putting it bye. There is only loss. I shall have a mister come to tutor you, and to select the rixler. Does the lad prefer girls or boys?”\n“Let it wait for a moon or so. He is my son. I . . . ”\n“Delay too long,” the priest warned, “and he may not bond with his rixler at all.” The priest’s voice had gone soft and low. “Or have you forgotten what was born within the Barrens?”\nHe heard Mama suck in her breath. Nealy did not understand. Only that the Pine Barrens was a place Mama used to frighten him into good behavior. No one went there. No one who ever came back. In two hundred years, no one had ever come back.\n“Tonight,” the priest continued firmly. “Tonight you must open the need that only his rixler may fill.”\n“My son,” said Papa in a choked voice. “How can I?”\n“How can you not?” the priest insisted.\nThat evening, Mama did not come to kiss him and tuck him into bed as was her wont. Nealy waited and waited and she did not come. He was afraid that something had happened to her and he began to cry and still she did not come.\nLater, when his sobs had stilled themselves by exhaustion, he heard from his parents’ bed the sounds of others sobbing.\n“Stop!” Greta’s voice jerked Nealy around with his mouth open and his hand half raised. She had used the vox, what the Guyandot Skraelings called orenda. Nealy paused with the words unspoken on his tongue. He could no more proceed than a winterlocked stream.\nGreta’s eyes took in Agnes and Nealy. Took them in, saw them, understood them. Judged them. She stared at Nealy a moment longer with eyes the color of a storm-proud sky. Then, with barely a glance at Agnes, she turned and unfastened her cloak of charred sheeps’-wool and hung it on the peg behind the door. Greta was a buxom man, her breasts full and round under her laced buckskin coverslut. Her golden-grey hair was braided in tight whorls behind each ear.\n“Mistress Rixler,” said Agnes, “I only—”\n“Hush, child.” The voice was not loud, but it compelled. Greta bent and unfastened her leggings, which she tossed in the corner by the door; and exchanged her boots for moccasins. Her pendant, a brightly jeweled vestal’s dagger in a leather scabbard, dangled from her neck when she bent over.\n“Nealy, dear,” she said, “be a host and offer our guest some wine.” Nealy hopped to do as he was bid, grateful to be acting, grateful for having been decided.\n“No, I could not.” Agnes edged her way toward the door.\n“Stay, child. We have matters to discuss.” Nealy listened to the wivmen while he arranged the goblets and removed the wine from the coldbox. Sometimes he felt as if he were both at a play and in it; as if he were watching and waiting and was occasionally called upon to speak lines written by someone else, words as surprising to him as to anyone.\nAgnes stood stiffly and wrung the homespun gown in her fist. “I was not . . . I did not come to swyve your wereman.”\nGreta laughed. “So. Then, button up. Don’t wave a musket you don’t mean to fire. Nealy, dear, would you have taken her if she had offered?”\nAnd that was most definitely a cue. Nealy handed Greta her goblet, half-full of chased kosher Oneida. He looked at Greta, looked into her eyes, before handing Agnes the guest’s goblet. He imagined what Agnes looked like, imagined her pink and rosy nakedness—younger, firmer than Greta, smooth and soft and warm, smelling of sweat and rut. Imagined her wrapping herself around him. Quite the bellibone. “Yes,” he decided as he took a sip from his own goblet.\n“If you ever made up your mind.” Greta also sipped. Over the cup rim, she glanced at Agnes, glanced at Nealy. “He will eventually, you know. Make up his mind. If I am away too long. If he has no more chores set for him. He has some will left in him.”\n“Idle hands are the devil’s tools,” agreed Nealy. He wondered if Greta would tell him to fick Agnes. He hoped so; he felt himself growing werile at the thought. Tell me I can. Tell me I can. Greta smiled at him, no doubt noticing, then turned a stern eye on Agnes. “You came about the fleas, didn’t you? Don’t deny it. And after I told you. You keep yourself clean, you keep your dogs in the yard. You don’t need any Other Way.”\n“It’s easier the Other Way,” Agnes said petulantly. Nealy thought the young man had a point, but Greta looked at Nealy; and Nealy saw infinite sadness behind the eyes. “No,” said Greta. “No, it is not.” She studied the wine in her goblet and was quiet for a long while. Nealy wondered if she was trying to foresee and was on the part of offering to do it for her when she spoke. “You know that going the Other Way eats the soul, yngling.”\n“Everyone knows that, mistress.”\n“But do you know what that means? Do you feel it here?” Greta slapped herself on the bosom. “By Hermes, Jesus, and St. Mahound!” she swore. “What can you possibly know?”\nAgnes shrank away and the goblet fell from her fingers, splashing an ablution across the outer hearth. “No, mistress. Plainly, I do not. I—”\n“Oh, child.” Greta’s voice was heavy. “Nealy, were you about to spell her fleas away?”\nNealy started, caught unawares by the sudden question. He nodded. “And her were’s in the bargain; and for aye.”\n“How did you intend to do that?”\nNealy brightened. He loved to explain his reasoning to Greta. It was always so logical, his major and minor premises all lined up like ducklings after their mother. “I bethought myself to conjure a salamander,” he said. “When Agnes and Lucius were set a-fire, the fleas would quickly perish.” He heard the young man’s gasp and turned to her with a smile. “And, upon my word, they would ne’er come back to bother you more.”\nAgnes made stiff fists by her side. “Is this a jest?\n“Fleas cannot abide a high temperature,” Nealy pointed out, reasonably as he thought; but all he received in return from Agnes was a look of terror.\n“Are you mocking me?”\nGreta sighed and shook her head. “It is only the judgment of a man who has lost all his moral anchors.”\n“The difficulty,” the rixmister had explained, “is to strike the balance between obedience and fear. Should he fear you too greatly, he may strike out in anger. Should he fear you too little, he may not obey. Your instruments are the knout and the caress.”\nNealy watched the girl and the mister with lack of interest, then turned his attention back to the rag doll he had been playing with. A scrap of metal affixed to its head and it was Lief ben Erik, the Great Explorer. Nealy imagined him standing in the prow of his longboat facing the spray. Sail on. Sail on. To Vinland the Good and Hy Brasil! Nealy made ocean spray noises with his mouth.\nWhere were Mama and Papa? They had not come with him when he left with the priest. Why did they avoid him so? Had he been bad? Had he been that bad? They fed him and they clothed him . . . and they treated him like a stranger. He missed their hugs; he missed their kisses. He missed Papa’s funny, booming voice and Mama’s ample lap. How could he right matters; put everything back as it had been, before the wolf, before Gray Harry . . . if no one told him what he had done wrong?\nIt wasn’t fair. Yes, he had hurt Gray Harry; but that had been an accident. The gods would understand. He had offered the sacrifices to Iaveis and Dianah. He studied the doll. Dress it differently and it could be Papa, or even Mama. He made a fist and punched the doll sharply in the body. That would teach them!\nTears filled his eyes and his lower lip trembled. How could he even think of hurting Papa or Mama? He must be a very bad boy to have had such very bad thoughts. No wonder his parents did not love him any more. No wonder the other boys no longer came to play and he was alone all the time. He turned his face away so the girl and the rixmister could not see. It wasn’t seemly for a boy to cry. It wasn’t werile. He picked Lief the Lucky off the floor and stroked him gently, imagining again that it was Papa.\nWhen the girl approached, he looked up suspiciously. He had heard them talking about him in whispers. The girl had shiny blond hair that hung in thick, corkscrew braids down to her waist. She wore plain butternut and beaded moccasins of a design Nealy did not recognize. Her hand clenched a knout with a large, curved knob on the end of it. Behind her, the rixmister stood with an anxious look on her face. The girl blushed lightly and curtsied.\n“Ave, Master Cornelius. I height Gretl Octavia Schmuelsdottr. I came all the way up the mountain from the convent school at Lechaucaster just to play with you.”\nNealy frowned and would not look at her. “You’re a girl,” he said. “And a vestal,” he added, pointing to the jeweled dagger hanging in its sheath from a ribbon ‘round her neck. He was not sure what a vestal was, only that they were special and came from the convent schools.\nGretl squatted by his side. “Vestals know all kinds of things. Some of them . . . ” She paused, glanced at the mister, and blushed again. “Some of them you will appreciate when you are older.”\nNealy stuck his lip out. “I want Mama.”\nGretl reached out and took his hand. “I will be your mama now. I will take care of you.” She hugged him; and it had been so long since any arms had compassed him that Nealy suddenly dropped the doll and hugged her back, feeling with an odd delicious tingle the funny shape of her chest pressing against him. A small, warm glow blossomed within him. Someone did like him after all.\n“And later,” she said, “I will be your wifman.”\n“I don’t want a wif,” he said.\n“You’ll learn,” she said, caressing him.\n“What’s the stick for?” he asked.\nShe hugged him tighter. “You’ll learn.”\n“He is not evil,” Greta told Agnes. “He does not choose evil.”\nNealy grinned. “Thank you, my dear. You say such flattering things about me.” He finished his wine cup and set it by. “I’m not, I suppose,” he said, scratching his chin under his beard. “I thought so myself, once. But . . . ”\n“But evil requires choice,” Greta said. “And choice has been taken from him.”\n“And I don’t miss it nary a bit,” Nealy said with a nod. “If you choose, you are responsible. And responsibility . . . ” He spared a glance at Greta’s melancholy features and frowned. “Responsibility can be a terrible burden.” Something was bothering Greta. Nealy could tell. Something beyond Agnes’ importuning visit. Something she had brought back up the mountainside with her.\n“The Other Way,” said Greta, “is an awe-full and wonder-full power; but, wielded too long, power blinds us to good and evil. Each time a dweorman spells, some part of his soul is destroyed. The part that sees evil and knows to shun it. Chirurgeons who have done autopsies report that in certain regions of the brain the very fibers are seared, as if by an inner fire. Such a man . . . ” She looked at Nealy with loving sadness. “Such a man cannot be allowed to choose.”\n“The knout and the caress, eh, my dear?” Nealy grinned at his wif and rubbed himself to show where both had been applied. “They taught me to obey Greta’s voice, they surely did.” Sometimes, when he thought about spelling on his own, his groin would ache from the memories. Sometimes, when he thought about obeying Greta, he grew werile. “It was all done very logically.” He hoped Agnes would leave soon, so that he and Greta could beek. Perhaps he should make Agnes Go Away. Twice, at Greta’s command, he had made things Go Away. Once to a gang of cut-throats living in the forest beyond the Swoveberg who had raped and killed a ten-year-old girl; and once to an avalanche that had thundered down the hillside. The latter spelling had laid Nealy up for a week, numb and shivering in fever. He had felt as if great gulps of him had been sucked out into the very space between the stars. It would be much less onerous to make Alice Go Away. He looked to Greta for guidance.\nBut none was forthcoming. “The craeft robbed him of half himself; we robbed him then of the other,” she said sadly.\nNealy was distressed. “But I don’t begrudge it, dear Gretl. With it, what a monster I should be.”\n“Yes, in all innocence, unleashing horrors and boons with equal carelessness.” Greta shook herself and looked back at Alice as if she had forgotten the young man was still there. “His choices have no moral weights, and it is urim and thummin which he would pick.” Then she rose and pointed fore-and middle finger at the younger man. “Betruth yourself, Alice Josepha Runningdeer, that you will not come to my were, nor any other dweorman, ever again, except through the man’s rixler.”\nAlice dropped to her knees and hugged Greta around the waist. “Oh, I do, I do. I betruth myself, for good and aye.”\nGreta lifted her to her feet. “Then go.”\nAlice scurried to the door.\n“Don’t forget the lye soap,” said Nealy. “And scrub very hard.” Alice gave him one last look of horror, then the door thudded shut behind her. Greta went to the door and put the bar in place, shutting the world without and them within.\nNealy ran into the wood behind the shed and knelt there rubbing himself where Gretl had struck him. Gretl was mean. All he had done was spell a spray of flowers to show how much he liked her. That was all, a spray of red and yellow and golden blooms to brighten up the winter months in their cabin.\nBut was Gretl pleased at the gesture? No, not her. Never spell without my permission! she had cried. Never!\nNealy clutched himself and bit down on his lip. By Hermes, that hurt! That was all she ever did, was fick him with that knout of hers, ever since the rixmister had set them up alone on the mountainside. If Papa were here, he’d make her stop; and Mama would box her ears good!\nBut the mountainside was far from home, far from home, and he had not seen Papa in a long, long time. Sometimes, in the night, he would sneak out of the cabin, out under the stars and look up at them, wondering if somewhere far to the south Mama and Papa were looking at them, too. Sometimes he heard their voices in the wind or in the rush of a stream, and saw their faces in the fire or a sparkling lake.\nHe had tried to find them once. He had made passes with his hands and the air parted before him like a curtain, and two shocked and frightened faces had turned toward him for just an instant before Gretl’s knout had struck him sharply.\nMaybe that had been his parents on the other side of that curtain. Maybe not.\nMaybe he should teach Gretl a lesson. Turn her stick into a viper. The spelling was in the Secret Book of Moses. He imagined the stick twisting and turning and hissing in her hands and her sudden shriek of terror. It would just be for a moment. He would change the knout back before it could bite. He did not want to hurt Gretl, only scare her.\nHis body twinged at the thought. Ah, what a blow she would land then!\nHe pulled his knees up under his chin and wrapped his arms around them. The woods grew dark farther in from the clearing, permanent night even in the day, under hickories and maples taller than the pillars of the great Temple at Shawmut, home for kobolds and sprites or other creatures. Maybe he should just run away and live by himself in the forest. Some people did that. Ridge runners and mountain men.\nBut he would lose Gretl if he did that. He would be all alone again, as when his parents had forsaken him. He sniffed and wiped his nose on his buckskin sleeve. He should not cry. He was fourteen, a full grown man. Papa had only been fifteen when he became house-bound to Mama. And Gretl had promised to teach him soon what were and wif did when they were house-bound to each other and that it was even better than the caresses she gave him. No, he should stay with Gretl. He was a bad boy. He had to be tamed. That was why they gave him Gretl, so she could teach him. That was why Gretl was older and knew how to touch him so it felt good. And it was why she carried the knout, too. It was all very logical. It was how you trained dogs.\nGreta busied herself with the dinner preparations, setting out the flour bin and cutting a knuckle joint from the ham carcass in the cold room. Nealy admired her knifework as she cut the scraps of meat from the bone. He loved Greta’s speck-and-bean. She rolled and cut the noodles fat and small and square, and she never let the snap beans stew so long they became limp.\nNealy betook himself to his favorite chair and settled in, content to await Greta’s instructions.\nWhen Greta had prepared the stew kettle, she carried it to the hearth. There she stopped and stared at the cold stones. Nealy felt her sorrow vibrate like the tolling of great cast iron bells. Nealy’s bones rang with it. Greta was crying.\n“What is wrong, Greta?” Nealy had never seen Greta cry. It struck him as wrong. As if the sun and the moon had come loose from their crystal spheres. Greta swung the rack out and hung the kettle on the hook. “I should have told you to start the fire,” she said. “Now dinner will be late.”\nOnly that? A silly thing to cry over. Nealy wanted to tell her that he had thought about starting the fire himself but had not done it because she had not told him to. He thought she would be proud of his prudence. Perhaps it would cheer her up. But her eyes gazed on something so far away, Nealy did not dare interrupt her. Lately, Greta had waxed melancholy, but what it was that haunted her she never spoke of.\n“I could start a fire,” he offered, “if you would but let me.” He thought that might please her. Nealy ached to be helpful; but the one thing he knew how to do well she would not let him do for trifles.\nHe was prepared for rebuff, but when Greta said, “Yes. Explain how you would accomplish it,” he brightened and told her all about the marching faggots and the salamander and the rest. When he was finished, he waited anxiously for her judgment. It could well be there was some moral wrong involved, like the time he had . . . . Well, it was best not to think on that. The villagers had rebuilt their houses farther from the riverbank, and the drought had ended. It was too bad about the children, but that could not be helped. Greta had been less experienced then.\n“I see nothing wrong,” Greta said at last. The worry and the sorrow filled the cabin like molasses and Nealy ached to stopper the flow before he became mired in it. He wondered if Greta knew that he could feel these things. He had told her he could, but perhaps it was like Greta explaining right and wrong to him. The words were there, but not the sense.\nHe donned his wolf’s skin and made the cast, and a good one it was. The faggots put on a fine show, marching like legionnaires in the quick-step, centurions to the fore and levites to the rear, and even a leafy twig aloft in lieu of an eagle. A smile pierced even Greta’s quiet distress.\nWhen the wood had stacked itself and ignited in a haze of flame, Greta swung the kettle hook back over the fire. Afterward, she stood staring into the crackling blaze for a long time, and remained silent all through dinner.\nAfter cockshut, when the dishes were scoured and put away and the cooking fire had settled into a gentle roil of soft flames, Greta went to the cloak hook and took down her sheep’s wool.\n“Are you going out again, dear?” Nealy asked.\nGreta brought the cloak back and laid it down upon the hearth. Then she unfastened the neck of her coverslut and gown and let them fall to the flagstones. She stood there nude, one foot slightly upraised, her nakedness only accentuated by the ritual vestal’s dagger dangling between her breasts on its silken cord. The firelight caused the gemstones on the handle to sparkle like small, hard flames. Nealy sighed at the sight of the soft flesh rosened by the licking flames, and awaited her summons.\nWhen Greta held out her arms Nealy shed his buckskins with fumbling fingers and joined her on the warm outer hearthstones. They kissed—he with urgency, she with tenderness—and settled down onto the soft wool. The heat of the fire was a delicious roasting sensation on his right side. Greta took him and brought him to her and they kissed again. “Yes,” said Greta, breaking her silence at last. “Yes, you may, this one last time.”\nNealy knew what she meant. Eagerly, he reached out with himself, feeling his being engorge with the stuff of the Other Way. His pulse throbbed and the stuff ran through his veins like liquor. He sparkled like the sunlight off the chop of a gentle lake. He touched her here, and there, in places where fingers could not reach; and Greta’s breath came faster and faster, in short gulps. She said, “Yes,” over and over.\nHe had dreamed of this earlier, Nealy remembered, just before Alice had come. He had dreamed of Greta pleasuring him on the hearthstones; and he wondered if the yearning itself had brought this act to pass. Sometimes his dreams did that. Sometimes.\nWhen he was spent, he lay by her side, gently following her contours with his touch. Greta lay with her eyes closed, making soft noises in her throat. Nealy waited for her to tell him not to pleasure her the Other Way the next time. She always forbade him, she always asked him, he always obeyed her. Nealy did not know why the pleasuring frightened her.\nThis time, however, she made no reference to it. Instead, she spoke in a whisper, “Nealy, dear, I’ve been a good wifman to you.”\n“No one could ask for a better,” Nealy told her. “I could never bind with another.”\n“I know,” Greta said. “I know. The rixmister paired us well. The years have been good to us.” She sighed and pressed his head against her breasts, ran her fingers through his hair. “I had looked forward to spending our chair days together.”\nHe lifted his head from its delicious pillow. “What is it?” he asked, dread bubbling through the sorrow. “What is wrong?”\nShe cupped one of her breasts in her hand and gazed at it sadly. “I have the cancer,” she said.\nThe words dropped down the well of Nealy’s soul. He had to swallow several times before he could speak. “Are you sure?” was all he could ask. Bad news is always questioned. Bad news is always denied.\n“I saw the chirurgeon in the town. That is why I went down the mountain.” She drew determination around her like a cloak. “Here, darling, Nealy . . . ” She pushed herself to a sitting position. “Here, sit within my lap.”\nNealy did as he was bid. He sat on the sheepskin between her legs and leaned back against her. Greta pulled his head once more against her breasts and Nealy jerked slightly at the touch.\n“Do not fret, dear. You cannot hurt me; not by leaning against me.” Greta was silent for a time and Nealy contented himself with listening to her breathing. Then she said, “I felt the lumps at the freshening of Hunter’s Moon. I was not sure, at first. I did not want to believe it, at first. But the chirurgeon confirmed it.”\nNealy twisted his head and looked up into her face. Twin tears left dark trails down her cheeks. “Is there anything I can do, dear? Are there spells? I know of none; but . . . ”\n“No, Nealy. No. You would have to know the cancer as well as you know the owl or the wind . . . or Alice Runningdeer’s fleas. No one knows what the cancer is, or why it does what it does. How can you spell what you cannot name?”\n“True names . . . ,” Nealy said. “I could spell black,” he offered. “I could weave an unnamed spell. If the known does not help, we must try the unknown.”\n“The Black Unknown? We dare not . . . . Dare not . . . . Nealy, no dweorman may spell upon the body of a rixler. That is a geas that may not, must not be lifted . . . ”\n“But . . . ” Nealy frowned in concentration. “But, you will die. Surely. . . . ”\nGreta seized him and held him tight against her, nearly crushing his breath from him. “I know. I know. I have lived with death for three tendays, now. I have grown . . . accustomed to his breath. Comes the moment, I will even welcome him. The chirurgeon’s potions . . . I may ask for something stronger, on that day.”\nNealy pondered Greta’s death. Who would make his meals? Who would pleasure him? Who would make his decisions? “Oh, Gretl,” he said, using her childhood name. “Oh, Gretl,” and his own tears came now as he conjured up his future in his drawn and quartered soul. “I do not know what I shall do without you!”\nGreta hugged him even tighter between her breasts. He could feel the heat of them, feel the hardness of their tips, smell the delicious smell of flesh. “I do,” he heard Greta say.\nSomething felt different. Something was missing in their embrace. He felt the fleshy softness against his cheek. “Why, Gretl,” he said. “Your vestal’s dagger . . . Have you taken it off?”\n“Lean your head back as far as you can, darling,” he heard her say.\nIt gave him such pleasure to obey her. A fine blade, it tickled; rather like a feather drawn across his throat.\nOriginally published in The Magazine of Fantasy & Science Fiction, March 1995.\nMichael Flynn began selling science fiction in 1984 with the short story \"Slan Libh.\" His first novel, In the Country of the Blind, appeared in 1990. He has since sold seventy or more stories to Analog, Asimov's Science Fiction, Fantasy & Science Fiction, and elsewhere. He is best know for the Hugo-nominated Eifelheim and his Tales of the Spiral Arm sequence, which includes The January Dancer, Up Jim River, In the Lion's Mouth, and On Razor's Edge. His most recent book is the collection Captive Dreams. He is currently working on a novel, The Shipwrecks of Time, set in the alien world of 1965.", "source": "https://clarkesworldmagazine.com/flynn_06_16_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Promise of God by Michael Flynn"}