{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Elizabeth Bourne", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "yia4zORNJUS4mXaFsJAfYy0eCHI=", "id": null, "license": null, "comments": "", "raw_text": "2170 words, short story  The Algebra of Events  38957613|2934702|46|720  The alarms vibrated while I was in the comfort room sharing essence with M’m’shamir. We immediately untethered so I could couple into my duty station. The unthinkable had occurred. In the myriad calculations of probable choices guiding us to colony Whole/Three/Green the sym encountered the chance of failure and slotted it.  Everyone knows that failure is a possibility, just as everyone knows that antawa are accident-prone, and yet the antawas’ ease of use has made them ubiquitous. The risk is worth the convenience. Statistically it is so unlikely as to be nearly impossible for a probability engine to miscalculate. And yet, what is failure but one chance among many, driven by viable choices? The mathematics are beyond me, but I smell that it is so.  Panic tinged the conversation spray in the room containing the probability fields. The sym had been cut from the calculating engine and isolated. There was no question of reconnecting it. The calculation had damaged it beyond repair, and besides, the isolation had been done so quickly the sym’s delicate tissues were discolored with multiple hematomas. I’m no jampiri so I can’t say for sure, but it didn’t smell to me like the sym would survive. All we could hope for now was that the mechanicals worked and that perhaps, the sym had calculated the chance of finding a survivable planet in reachable distance.  I will make these notations as long as I can.  38957613|2934702|46|724  Holy be the Primes, there is a planetary body within reach. The silq’uy has ordered us into freeze for the duration. It is better than remaining aware, and yet I emit fear, as do all who experienced the probability fail. This is not a planet we would pick for a colony. It is too variable, too extreme with sections of hot and cold, dry and wet. There are too many orbiting bodies. The local star is the wrong color. And the smells will be strange. We will need adaptive devices if we are to make any sense of this planet.  But the atmosphere is breathable, and as long as the bacteria farms remain in good health we should be able to survive, at least for a time. My first task on landing will be to take some of our native bacteria and begin breeding it for resistance and adaptation with whatever the alien equivalent is. Though now, I suppose we are the aliens. That is a very odd thought to smell.  M’m’shamir exudes terror, and asks if lehr could stay in my location. My friends would say this is what comes of sharing with passengers, but M’m’shamir smells enticing in a way no being has for many rota. Even though there is no time for sharing, my vestigial gill nodes flutter when M’m’shamir is close. I welcomed lehr to take comfort in my space, though we will have to part at the freeze. Colonist passengers are maintained in separate pod banks.  The silq’uy agrees a record is important, and has added making notations to my official function. My odor is increased with this honor, though a part of me now worries my emissions will be inadequate. The walls are pulsing. It is time for us to become solid. The ship’s mathematician will lead us in a conjugation of the perfect irrational to relax us into the proper state for freeze. I almost look forward to it.  38957613|2934702|46|732  The mechanicals failed to adequately correct for this world’s gravitational pull and our landing went badly. I will never scent M’m’shamir again. We lost 30.783% of our colonists as the ship crashed, 10.56% of our crew. The probability engine cracked and raw probability calculations are even now seeping into this world.  Could it be any worse?  27.245% of my being has gone solid with grief, and there are others even more solid. The colonists are useless, seized up as they are in fear. Even the silq’uy is 12.794% solid, a sign that our situation is dire.  But lehr is urging us to fluid activity for the good of the survivors and we are all moving as best we can to repair what has been broken. The bacteria farms, holy be the Primes, are functioning well, and I have suited up already to collect native samples for use. We haven’t yet developed appropriate adaptives for this world, so all I can say is that it smells chaotic and feculent. There is no sense to be found in it, but then I am no translator.  A small group of natives approached—solids! At least on the exterior. The interior was comfortingly liquid, which the ship’s jampiri claims proves the theory that intelligent life can only exist in a fluid state. After dissecting one of the creatures lehr said that the gelatinous matter in its hard top shell was remarkably similar to our sym’s. It might, with work, be possible to create a sym replacement. This is good news.  38957613|2934702|46|768  It has now been forty-eight rota since The Event, and we are exhausted. Much of what we have learned has been shocking. We cannot share information with the natives. We captured some of the solids for testing. They use a vibratory system, and while we can feel the patter of their vibrations on our membranes, it is beyond our translators’ abilities to understand. The native beings do not comprehend our odor-based communication, indeed it appears to cause a strong physical reaction. I myself have witnessed them falling, flailing their extremities, as they expel chaotic smelling liquids from their openings when we scent to them.  Also, this world is hostile to our embodiment and we must wear protective gear outside the ship. That alone would prevent us from feeling vibrations, so is there even a point in learning it? With regret the conclusion has been that this world may be survivable, but we can not stay here.  Against the silq’uy’s orders, our jampiri budded, using a combination of sym and native material as starter. My understanding of how he did this is imperfect, but he successfully implanted buds within the top hard parts of the natives we had in stasis. Miraculously, the buds rooted and his team is monitoring these creatures to see if they survive.  Research into the compatibility between native tissue and sym tissue has been successful. It should be possible to create a sym from the matter contained within the round top parts, but so far native matter will not thrive outside of its container. Even with the best nutrients, even spliced with matter from its native shell, it is not enough to keep this tissue alive long enough to bud. The jampiri’s team is still working on it, but this is disappointing.  There is some good news. The bacteria farms have adapted to the native bacteria (thank the Primes there are constants in the universe), and we are able to replenish ourselves with this new mix. Now we have some resistance to the effects of this hostile world.  I know this is an official notation, but it eases me to emit how much I miss M’m’shamir. What started out as a mere temporary sharing now has the overwhelming scent of memory. The two of us might some day have exchanged reproductive material, had there been time. Perhaps there might have been a new embodiment for us to nurture together. I am 7.8% solid with grief. My shipmates are kind not to mention it.  8957613|2934702|46|797  The alarms vibrated mid rota. Solids were attacking the ship. Do they learn nothing? Again, the ones close enough were iced, then brought inside for study. Again, the ones beyond the ship’s reach ran from us. After three rota had passed a new solid approached with its extremities outstretched in the way a young embodiment might extend its pseudo pods in play. It made vibrations at us that the translators are sure are attempts to disseminate information.  Doesn’t the act of wanting to communicate indicate intelligence? Perhaps this was the deeply remote possibility that enticed our sym—that such creatures exist—and it could not resist. I comfort myself by tasting the numbers at the edges of this thought.  Our jampiri argued for a trial of one of the made things that accepted his bud, communicators he calls them so as not to offend the translators. There are seven in total. Twice that number failed. Silq’uy agreed. We watched anxiously on gels as our communicator walked stiffly toward the solid. When the solid sensed our communicator liquid ran from its organs of vision. It made very strong vibrations, then fell slapping at the ground. Then a thing we did not understand happened.  The solid pulled a weapon it had hidden beneath its decorative protective membranes and plunged it into our communicator’s front. The communicator’s physical functions have been replaced by hybrids of the jampiri’s workings so it merely blinked. Then the solid sawed at the connecting tissue between the communicator’s lower parts and the round hard part on top. (A few of the jampiri’s team hold this part, connected by so thin a stalk, is a bud. I do not believe this is true. We do not understand how these solids function.) When the native solid sawed the round thing off, our communicator fell. All the while the solid made tremendous vibrations while liquid, salt water the analysis said, ran down its membrane.  Not everyone agrees but I believe the native solid experienced emotion—that it felt the same kinds of feelings I felt when M’m’shamir was no more. Except a solid cannot turn solid with grief, so perhaps they turn liquid and that was the meaning of the salt water. I do not know if I am right, but it smells like a constant prime to me. I remain 2.46% solid. I do not think I will ever become 100% fluid again.  8957613|2934702|46|968  It is now 248 rota since The Event, and 171 rota since the first communicator was field tested. I am very tired. My membrane is thin, and the bacteria farms are no longer adequate to maintain my optimal health. The jampiri advised me to bud several rota ago. Now my own buds are mature enough to take over my assignments, just as the jampiri’s buds did 57 rota ago. We do not live as long as we should on this world, but we hope to produce generations of buds, and perhaps someday we will also merge reproductive material again (once tests confirm the local radiation and magnetic fields are harmless). Silq’uy 1-3 (at the jampiri’s urging, the silq’uy budded earlier than any of us) says that this will be so. We will remember home. We will return some day.  I hope that is true.  Much has been learned. After many communicators were disassembled, and many more solids taken for testing, we have begun to understand each other. This species has no organ for smell, or at least not one that functions in a meaningful capacity. While no longer surprising, it remains shocking.  Jampiri 1-7 and jampiri 1-2 deduced that the solids communicate through vibrations that are registered and interpreted by a series of small sticks and membranes they call an “ear.” Really, the ear is so tiny compared to their mass it is amazing they can communicate at all.  The top round part was never a bud, but is called a “head,” and the viscous interior a “brain.” They are covered by a membrane called “skin” and additional, removable membranes called “clothes.” Their powers of movement are determined by tissues called “muscle” that levers long, calcinated sticks called “bones.” Instead of flowing, they move like machines with levers and gears and sockets. They are marvelous and repellant.  Silq’uy 1-3 has made an agreement with the solid that controls this clutch. This being has the designation Valmarka. Brain matter from this species will not splice with the sym, at least not once the head is removed. But there is compatibility. Valmarka confirmed this by communicating that soon after we crashed, colors invaded their territory. This confused and frightened them. They believe we are gods. Our sym team deduced that they experience the probability field through their highly developed organs of sight. Called eyes, I think. So many parts to remember.  We must splice sym genes with the living beings. An experiment was conducted on Valmarka, which changed lehr’s reproductive material. Beginning with lehr’s offspring, through careful breeding and an occasional boost of sym genetics, we can create a new sym. It will take time. I will not live to experience that day.  Silq’uy 1-3 has granted my request.  I will take the orb that has maintained what is left of M’m’shamir, mere scraps without enough intelligence to bud. I will ingest lehr. Then we will go outside and dissolve to become part of this strange, solid place. Our genetic material will merge with the small creatures I have always loved: bacteria, molds, yeasts, and so in some little way we will help alter this world. I am glad. Holy be the Primes.  Elizabeth Bourne has previously published short fiction in Fantasy & Science Fiction, Interzone, and Clarkesworld. She's currently working on a second world fantasy novel and a mystery set in prohibition age San Francisco. Bourne grew up in Lovecraft country and assures you that his work wasn't fiction. She lives in the Pacific Northwest and is advised on her writing by her dog, Kai, who eats the bad pages.", "text": "2170 words, short story\nThe Algebra of Events\n38957613|2934702|46|720\nThe alarms vibrated while I was in the comfort room sharing essence with M’m’shamir. We immediately untethered so I could couple into my duty station. The unthinkable had occurred. In the myriad calculations of probable choices guiding us to colony Whole/Three/Green the sym encountered the chance of failure and slotted it.\nEveryone knows that failure is a possibility, just as everyone knows that antawa are accident-prone, and yet the antawas’ ease of use has made them ubiquitous. The risk is worth the convenience. Statistically it is so unlikely as to be nearly impossible for a probability engine to miscalculate. And yet, what is failure but one chance among many, driven by viable choices? The mathematics are beyond me, but I smell that it is so.\nPanic tinged the conversation spray in the room containing the probability fields. The sym had been cut from the calculating engine and isolated. There was no question of reconnecting it. The calculation had damaged it beyond repair, and besides, the isolation had been done so quickly the sym’s delicate tissues were discolored with multiple hematomas. I’m no jampiri so I can’t say for sure, but it didn’t smell to me like the sym would survive. All we could hope for now was that the mechanicals worked and that perhaps, the sym had calculated the chance of finding a survivable planet in reachable distance.\nI will make these notations as long as I can.\n38957613|2934702|46|724\nHoly be the Primes, there is a planetary body within reach. The silq’uy has ordered us into freeze for the duration. It is better than remaining aware, and yet I emit fear, as do all who experienced the probability fail. This is not a planet we would pick for a colony. It is too variable, too extreme with sections of hot and cold, dry and wet. There are too many orbiting bodies. The local star is the wrong color. And the smells will be strange. We will need adaptive devices if we are to make any sense of this planet.\nBut the atmosphere is breathable, and as long as the bacteria farms remain in good health we should be able to survive, at least for a time. My first task on landing will be to take some of our native bacteria and begin breeding it for resistance and adaptation with whatever the alien equivalent is. Though now, I suppose we are the aliens. That is a very odd thought to smell.\nM’m’shamir exudes terror, and asks if lehr could stay in my location. My friends would say this is what comes of sharing with passengers, but M’m’shamir smells enticing in a way no being has for many rota. Even though there is no time for sharing, my vestigial gill nodes flutter when M’m’shamir is close. I welcomed lehr to take comfort in my space, though we will have to part at the freeze. Colonist passengers are maintained in separate pod banks.\nThe silq’uy agrees a record is important, and has added making notations to my official function. My odor is increased with this honor, though a part of me now worries my emissions will be inadequate. The walls are pulsing. It is time for us to become solid. The ship’s mathematician will lead us in a conjugation of the perfect irrational to relax us into the proper state for freeze. I almost look forward to it.\n38957613|2934702|46|732\nThe mechanicals failed to adequately correct for this world’s gravitational pull and our landing went badly. I will never scent M’m’shamir again. We lost 30.783% of our colonists as the ship crashed, 10.56% of our crew. The probability engine cracked and raw probability calculations are even now seeping into this world.\nCould it be any worse?\n27.245% of my being has gone solid with grief, and there are others even more solid. The colonists are useless, seized up as they are in fear. Even the silq’uy is 12.794% solid, a sign that our situation is dire.\nBut lehr is urging us to fluid activity for the good of the survivors and we are all moving as best we can to repair what has been broken. The bacteria farms, holy be the Primes, are functioning well, and I have suited up already to collect native samples for use. We haven’t yet developed appropriate adaptives for this world, so all I can say is that it smells chaotic and feculent. There is no sense to be found in it, but then I am no translator.\nA small group of natives approached—solids! At least on the exterior. The interior was comfortingly liquid, which the ship’s jampiri claims proves the theory that intelligent life can only exist in a fluid state. After dissecting one of the creatures lehr said that the gelatinous matter in its hard top shell was remarkably similar to our sym’s. It might, with work, be possible to create a sym replacement. This is good news.\n38957613|2934702|46|768\nIt has now been forty-eight rota since The Event, and we are exhausted. Much of what we have learned has been shocking. We cannot share information with the natives. We captured some of the solids for testing. They use a vibratory system, and while we can feel the patter of their vibrations on our membranes, it is beyond our translators’ abilities to understand. The native beings do not comprehend our odor-based communication, indeed it appears to cause a strong physical reaction. I myself have witnessed them falling, flailing their extremities, as they expel chaotic smelling liquids from their openings when we scent to them.\nAlso, this world is hostile to our embodiment and we must wear protective gear outside the ship. That alone would prevent us from feeling vibrations, so is there even a point in learning it? With regret the conclusion has been that this world may be survivable, but we can not stay here.\nAgainst the silq’uy’s orders, our jampiri budded, using a combination of sym and native material as starter. My understanding of how he did this is imperfect, but he successfully implanted buds within the top hard parts of the natives we had in stasis. Miraculously, the buds rooted and his team is monitoring these creatures to see if they survive.\nResearch into the compatibility between native tissue and sym tissue has been successful. It should be possible to create a sym from the matter contained within the round top parts, but so far native matter will not thrive outside of its container. Even with the best nutrients, even spliced with matter from its native shell, it is not enough to keep this tissue alive long enough to bud. The jampiri’s team is still working on it, but this is disappointing.\nThere is some good news. The bacteria farms have adapted to the native bacteria (thank the Primes there are constants in the universe), and we are able to replenish ourselves with this new mix. Now we have some resistance to the effects of this hostile world.\nI know this is an official notation, but it eases me to emit how much I miss M’m’shamir. What started out as a mere temporary sharing now has the overwhelming scent of memory. The two of us might some day have exchanged reproductive material, had there been time. Perhaps there might have been a new embodiment for us to nurture together. I am 7.8% solid with grief. My shipmates are kind not to mention it.\n8957613|2934702|46|797\nThe alarms vibrated mid rota. Solids were attacking the ship. Do they learn nothing? Again, the ones close enough were iced, then brought inside for study. Again, the ones beyond the ship’s reach ran from us. After three rota had passed a new solid approached with its extremities outstretched in the way a young embodiment might extend its pseudo pods in play. It made vibrations at us that the translators are sure are attempts to disseminate information.\nDoesn’t the act of wanting to communicate indicate intelligence? Perhaps this was the deeply remote possibility that enticed our sym—that such creatures exist—and it could not resist. I comfort myself by tasting the numbers at the edges of this thought.\nOur jampiri argued for a trial of one of the made things that accepted his bud, communicators he calls them so as not to offend the translators. There are seven in total. Twice that number failed. Silq’uy agreed. We watched anxiously on gels as our communicator walked stiffly toward the solid. When the solid sensed our communicator liquid ran from its organs of vision. It made very strong vibrations, then fell slapping at the ground. Then a thing we did not understand happened.\nThe solid pulled a weapon it had hidden beneath its decorative protective membranes and plunged it into our communicator’s front. The communicator’s physical functions have been replaced by hybrids of the jampiri’s workings so it merely blinked. Then the solid sawed at the connecting tissue between the communicator’s lower parts and the round hard part on top. (A few of the jampiri’s team hold this part, connected by so thin a stalk, is a bud. I do not believe this is true. We do not understand how these solids function.) When the native solid sawed the round thing off, our communicator fell. All the while the solid made tremendous vibrations while liquid, salt water the analysis said, ran down its membrane.\nNot everyone agrees but I believe the native solid experienced emotion—that it felt the same kinds of feelings I felt when M’m’shamir was no more. Except a solid cannot turn solid with grief, so perhaps they turn liquid and that was the meaning of the salt water. I do not know if I am right, but it smells like a constant prime to me. I remain 2.46% solid. I do not think I will ever become 100% fluid again.\n8957613|2934702|46|968\nIt is now 248 rota since The Event, and 171 rota since the first communicator was field tested. I am very tired. My membrane is thin, and the bacteria farms are no longer adequate to maintain my optimal health. The jampiri advised me to bud several rota ago. Now my own buds are mature enough to take over my assignments, just as the jampiri’s buds did 57 rota ago. We do not live as long as we should on this world, but we hope to produce generations of buds, and perhaps someday we will also merge reproductive material again (once tests confirm the local radiation and magnetic fields are harmless). Silq’uy 1-3 (at the jampiri’s urging, the silq’uy budded earlier than any of us) says that this will be so. We will remember home. We will return some day.\nI hope that is true.\nMuch has been learned. After many communicators were disassembled, and many more solids taken for testing, we have begun to understand each other. This species has no organ for smell, or at least not one that functions in a meaningful capacity. While no longer surprising, it remains shocking.\nJampiri 1-7 and jampiri 1-2 deduced that the solids communicate through vibrations that are registered and interpreted by a series of small sticks and membranes they call an “ear.” Really, the ear is so tiny compared to their mass it is amazing they can communicate at all.\nThe top round part was never a bud, but is called a “head,” and the viscous interior a “brain.” They are covered by a membrane called “skin” and additional, removable membranes called “clothes.” Their powers of movement are determined by tissues called “muscle” that levers long, calcinated sticks called “bones.” Instead of flowing, they move like machines with levers and gears and sockets. They are marvelous and repellant.\nSilq’uy 1-3 has made an agreement with the solid that controls this clutch. This being has the designation Valmarka. Brain matter from this species will not splice with the sym, at least not once the head is removed. But there is compatibility. Valmarka confirmed this by communicating that soon after we crashed, colors invaded their territory. This confused and frightened them. They believe we are gods. Our sym team deduced that they experience the probability field through their highly developed organs of sight. Called eyes, I think. So many parts to remember.\nWe must splice sym genes with the living beings. An experiment was conducted on Valmarka, which changed lehr’s reproductive material. Beginning with lehr’s offspring, through careful breeding and an occasional boost of sym genetics, we can create a new sym. It will take time. I will not live to experience that day.\nSilq’uy 1-3 has granted my request.\nI will take the orb that has maintained what is left of M’m’shamir, mere scraps without enough intelligence to bud. I will ingest lehr. Then we will go outside and dissolve to become part of this strange, solid place. Our genetic material will merge with the small creatures I have always loved: bacteria, molds, yeasts, and so in some little way we will help alter this world. I am glad. Holy be the Primes.\nElizabeth Bourne has previously published short fiction in Fantasy & Science Fiction, Interzone, and Clarkesworld. She's currently working on a second world fantasy novel and a mystery set in prohibition age San Francisco. Bourne grew up in Lovecraft country and assures you that his work wasn't fiction. She lives in the Pacific Northwest and is advised on her writing by her dog, Kai, who eats the bad pages.", "source": "https://clarkesworldmagazine.com/bourne_09_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Algebra of Events by Elizabeth Bourne"}