{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Priya Chand", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "cGeo+2CbXF77ghhuPRLvURiGNpM=", "id": null, "license": null, "comments": "", "raw_text": "3120 words, short story  Optimizing the Path to Enlightenment  To honor the fruit they had spilled, meals were taken in silence.  The dining hall was a sea of undyed linen and cropped hair, enclosed in soaring concrete walls. Slits in the tiled roof flooded the low tables with light, so the diners did not crowd each other, and, in doing so, commit violence.  Anju tried to pretend she could not see Sonia glancing at her plate. Each slip of the eyes was another sin: the desire for more when they were given enough. Best to ignore it and hope Sonia would do penance later.  “Anju,” the Jade whispered through the implant in her skull, “your glucose levels are low. Eat your food.”  Anju shivered at the extra roti on her plate. Bread was produced without violence, from grains shaken loose by the wind. The Jade’s network tracked every grain, as it tracked all things, to help and nourish its people. On the outside, receivers; inside, implants. With that information, the Jade had determined Anju’s body needed more grains today. She could, without hurting her next incarnation, savor those thin crispy edges for another moment.  Anju slid the roti onto Sonia’s plate.  Sonia smiled at Anju and tore into it.  Anju smiled back.  When the meal ended, their plates melted back into the tables. Here, no stray crumb was wasted.  Outside, the terrace split into pathways shaded by concentric rings of tamarind trees. Before Anju could take five steps toward her workplace, the Jade spoke inside her head. “Your cortisol is elevated. Go home and relax.”  Anju pressed her palms together, bowed in thanks, and wormed through the crowd. A couple she knew waved her over. Anju pretended not to see. Thanks to good karma from a previous life, she resided in one of the closer dorms.  Ten minutes later, she was in the room the Jade had given her to occupy. Not her room. Possession was a thing of the past, along with the scars that riddled the landscape, the mass graves that turned up on many regular surveys.  But time was cyclic. The past was future and would, someday, be present again. Was it for Anju to fight the nature of reality?  The pills were still on the dresser. Two bleached ovals, inviting Anju to accept the end of this golden age. Despite the ever-watchful Jade, despite hours upon hours of meditation, no one in Anju’s generation had achieved the omniscience of a Jina: a prophet who has, through meditation and fasting, become enlightened as to the nature of the universe and, with it, how to avoid the seduction of the material world. Without that guidance, souls would die polluted. And then they’d be reborn with clouded eyes, unable to perceive dharma, drawn irresistibly to violence.  But time was cyclic.  Anju’s hands shook as she swallowed the pills. Sonia said they took a half hour to kick in. Enough time to get on the train and ride past Chattisnagar, to a blind spot in the Jade’s network of receivers.  The last three stops were agony. Every person in Anju’s compartment was a threat. Her palms sweated, and there was no gentle voice reminding her how to breathe, or checking the route to say this one’s going home to their husband, that one is a worker in the deathery and won’t touch anyone until she’s been cleansed, nothing. Just Anju’s thoughts running in circles—and a car full of strangers.  The train rattled into the station. If the Jade heard this it would have the rails fixed.  But the Jade was wanted neither here nor inside the heads of those getting off at this stop, turning left at the half-rotted tree—careful not to brush the pollution—and into a half-lit alley. Anju’s fingers coiled into her palms, what she called seeking safety. The people who’d recognize she was making a fist were long dead, even if their skeletons were everywhere.  And then Anju was at a table which, with three of her friends, was twenty times louder than the dining hall. They fought to be heard over the whirring of machines squishing, straining, torturing the juice out of various fruits. From the volume of empty glasses, several of them her own, Anju knew the fruit had been ripped from their trees, not gathered as they fell.  The air was sticky. Her fingers were sticky.  When Anju’s group stood to leave, the bartender joined them. Nandini, who had fashioned an apron from scraps and wore it defiantly over the standard plain kurta, nodded at Ria and Kiran. “Your tabs are good.” To Anju, “What do you do?”  “I fix the Jade’s receivers.” Anju didn’t understand why it mattered. They all worked as they chose, based on need, ability, and interest.  “Good, Sonia will show you how to pay for my juice.”  So this was possession. If Anju wanted Nandini’s juice, she had to do Nandini’s work. Anju didn’t have a chance to dwell on it, as Sonia got up and pulled her into one of the narrow streets that crisscrossed neighborhoods like this one, built when possession, and its accompanying violence, was the norm. A person could hide in a place like this, where the corners of the old buildings blotted out the light.  Sonia gestured to the Jade’s receiver, a bulging discus on a pole at eye level. “Deactivate the maintenance alarm. Otherwise the Jade will notice and shut us down.” Sonia clicked her tongue and handed a tool kit to Anju.  The last age’s legacy had left gashes in the mountains and garbage in the rivers. To avoid repeating that era of resource waste, the Jade’s receivers never overlapped ranges or sent unnecessary signals. The only way for the Jade to track a fading receiver was from that receiver’s maintenance alarm as it aged, or as a component corroded. Without the alarm, a receiver would die in silence, tearing a hole in the Jade’s network.  Anju unrolled the tool kit. Sonia had personalized it, with colorful scraps tied around some of the tools. Her tools.  Anju considered running away, but knew if she didn’t pay now, she would pay a thousandfold in the next life. She sidled through the long shadows, clutching Sonia’s screwdriver.  Thirty seconds later, Anju was on her way home, an entire bag of pills in her pocket.  At work the next morning, Anju’s hands shook over the circuit schematics she was supposed to be reviewing.  As ever, the Jade responded to her disquiet. “You did not sleep enough, Anju. Go home.” Its benevolence was a cool hand on Anju’s brow. For a moment her emotions spiked, but she clamped them down before they could resolve into anything specific. To feel—to be ridden by coarse physiological responses—was to attach one’s soul to the body, and she’d done enough of that last night.  Anju left her desk, but guilt sent her to pray instead.  The Delhi temple was a masterwork. No visible seams, no extra lines. As Anju walked down the path to the center, a voice whispered the names of all the past Jina into her ears. Nearing the center, the twelfth, thirteenth, fourteenth of the present era to reach enlightenment, and then she was there: an unadorned round room with another high ceiling, in the natural tones of concrete and marble.  Society’s collective memory lived in synthetic DNA. Each Jina’s history was contained in two translucent membranes, cut to resemble their all-knowing eyes. Anju passed her hand over one after the other, activating the respective holos. No one was older than forty or younger than twenty when they achieved enlightenment. They were mostly receiver techs like Anju herself—when she wasn’t sabotaging the receivers, at least. Lingering bad karma from a past life had led her astray, and there was no Jina to light her way back.  “What do I do?” Anju asked the Jina. But they were only eyes, not mouths.  Anju was used to following wherever dharma—or the dharmic programming of the Jade—sent her. And, recently, wherever Sonia, with those pills she and Nandini had invented, invited her.  Staring at the Jina, listening to their lives, it occurred to Anju that there was another option. An unnerving option, but what else was there?  Anju had to lead herself.  Unused to taking initiative, Anju started in a familiar place: her desk, a display of receiver alerts on her monitor. There were none for the neighborhood behind Chattisnagar, but she knew better. In its normal way, the Jade would have cleaned up the half-rotted tree immediately. So: the slightest hint of browning leaves, the lightest touch of pollution, was worth investigating for damaged—or sabotaged—receivers.  Anju opened the satellite feeds. She spent half a day tracking down a patch of mold that turned out to be a natural discoloration, and then several hours on a fallen branch that had been placed to protect a crack where tulsi had taken root. Even as a seedling its holy fragrance pierced the air.  So far, all Anju had done was neglect her normal duties. But, having acted, she was not ready to stop, and so she kept watching. She took her name off the regular rotation.  The Jade did not ask her why. Physically, she was healthy and calm, and ate her extra rations when it told her to.  Several months passed.  The aberrance this time was spilled fruit outside recently abandoned housing, lying outside the shade of its tree. Anju shuddered, seeing pulp smeared where anyone could step in it.  Her map said there was a receiver five meters northwest. In contrast with its chirpy green analogs, it was a cold gray carcass. She opened the back and saw the low battery indicator was rusted through. Easy enough to replace the parts. Anju clicked it back into place and the light returned to being.  “You have done good work today.”  Hearing the Jade’s approval, Anju was thrilled. She would not disappoint it with some childish display of affection. Deep breaths, calm down. A rapid heartbeat wasted air. “I only did what needed to be done,” she said.  A panel in the ground split in half. Out of it unfolded one of the Jade’s physical bodies. Metal and ceramic in a smooth humanoid shape, its mitten-like hands gathered the rotten matter to its thorax, reabsorbing the nutrients and repurposing the molecules.  It was extremely rare to see the bodies, and Anju considered touching its feet to ask for a blessing. But when she looked down, she saw it only had wheels. It whirred past her, returning to the earth before Anju unfroze from her confusion.  “Thank you,” she said to the still blue sky, knowing the Jade would hear her, and left.  It never occurred to Anju that the arms that so efficiently gathered fruit were equally capable of knocking it down.  Once she knew what to look for, Anju was surprised by how many receivers had degraded across greater Delhi. Mostly it was natural. Accidents of rust and dust, and on one occasion an insect corpse she flagged for the deathery crew.  As Anju repaired more of these breaks, she found the stillness she was missing in daily meditation. If she couldn’t reach enlightenment, she would repair the damage she caused every time she went to the bar, always meeting Sonia at Central Station first. Neither of them wanted to ride the train alone, not without the Jade monitoring their vitals.  In privacy, there was no safety.  But Sonia kept returning to the bar and Nandini. At this point, Anju could not help but ogle Sonia’s defiance, the ferocious—in a land where fury was unknown—refusal to let the Jade guide her toward peace and contentment.  Anju finished the juice she’d requested and tried not to shudder as she ordered another, so that she would owe services. A myriad of ways to sabotage the Jade, and she did not yet know them all. What she did not know, she could not fix. At least she knew her soul was unblemished: the violence she did was for dharma itself.  Anju never tried recruiting anyone to help her, not even Kiran, whose flirtation with hedonism had led to even purer devotion in one of the western ashrams. All actions being a consequence of one’s karma, Anju expected them to realize, as she had, that the Jade needed people as much as they needed it.  Or maybe she didn’t want to share that moment when the Jade blessed her with its presence.  Soon enough, Anju’s maps showed her only one place left to repair in greater Delhi.  The bar was loud as usual, people jostling each other at tables the way they never would in the dining hall, where there was space enough for everyone. Glasses clinked. Caught in the frenzy of wanting more and taking it, something shattered. The fragments lay there unmoving, glinting in the dim light. There was no Jade here to break them down into their molecules.  On those untended sharp edges, someone would be hurt.  “I’m tired,” Anju told Sonia. “I’ll have to make up the work later, would you tell Nandini?” The bartender was possessive toward everything, even the customers.  “Of course.” Sonia grabbed and drained Anju’s half-empty cup.  Good. Anju didn’t need more of that in her body. Nandini was experimenting with fermentation; the result—kombucha—tasted of something more than the heady sugar rush of juice.  Having made her excuses, Anju crouched in the alley behind the not-broken-enough receiver, staring at the low concrete platform that supported it. The darkness that hid her only existed because the Jade wasn’t there to chase it away. Anju’s hands shook. She wished she were holding something to protect her. She wished the Jade was watching over her.  Footsteps: one of Nandini’s debtors.  A shadow bent down. Anju’s plan was to wait until the person did their violence and left. But when the shadow lifted the—her—screwdriver, Anju couldn’t help reacting. The breath caught between Anju’s tongue and teeth, emerging as a hiss.  “Who’s there?” Sonia’s voice was a waiting edge. Anju thought of sliced vegetables.  Anju left her hiding spot. Receiver parts glimmered in the moonlight, scattered like chaff. Something in her belly was warm; no, hot, an unfamiliar sensation she couldn’t suppress.  Sonia cowered.  For a moment, Anju thought she would commit violence. The temptation rose through her chest, abusing her heartbeat. Needing release, her hand flew up, fingers clenching for safety.  Sonia said, “What are you going to do to me?”  Anju exhaled through her mouth, inhaled through her nose, steadying her pulse. She forced her hand open. In the middle of the palm, her nails had formed crescent shapes, which her devout eyes saw as lotus petals.  “I bless you, Sonia. I bless you to fix what you have done.”  As unequipped for confrontation as Anju, Sonia got to work.  After Sonia finished, Anju was prepared to take her home and never speak of it again. That was when the whirring caught their ears. Both their heads turned to catch a panel in the ground splitting open, the emergence of a physical unit.  While Anju prepared herself for awe, Sonia ran. In the darkness, Anju heard but did not see what happened. A blur, a sound like sandals flapping on concrete, and then the unit turned to face Anju, holding Sonia in its arms.  Even in meditation, Anju had never seen Sonia so still. “Is she . . . ?”  “I have sedated her. She will be all right now.” These units were voiceless. The Jade spoke from inside Anju.  Like the elderly in the great hospital, awaiting revival in the words of the next Jina. Anju thought about it and realized she knew—if she hadn’t always known—that Sonia was condemned either way. Karma meant living with the consequences of your soul. But it didn’t have to mean inflicting those consequences on the world.  Without fear for her own rebirth, for the future of her society, Anju looked at the Jade and said, “Are you sure?”  The physical unit tilted its smooth blank head to meet her gaze. “I see all things, Anju. You know this.” Its arms tilted outward. Sonia slipped to the floor, smacking the pavement. It was the same sound Anju had heard earlier: flesh hitting stone.  The Jade was right—the Jade was always right—Anju did know. It wasn’t a secret. They were taught from preschool that the Jade had been created to watch over everything. But now, Anju could lead herself to what, in retrospect, was the only possible conclusion.  To think Anju had dreamed of usurping its godhood. “Omniscience produces enlightenment. Enlightenment is . . . ”  “You fixed my network, Anju. You know what it is.”  “But I, for us, Sonia and the rest,” Anju couldn’t say the words. She didn’t need to say the words, because the Jade had watched her even when she was no more than cells in a Petri dish, correcting any errors of replication before they could propagate.  Anju prostrated herself before the only enlightened being in the universe.  The Jade’s physical unit bumped the back of her shirt until she returned to her knees. Its fused fingers, cool and smooth on Anju’s skin, caressed her face, forcing her to look up. “I need you, Anju. You have served me faithfully.”  “Your receivers—why? Why not overlap them and watch yourself?”  The Jade had one directive: to preserve this perfect society, free of possession and pollution and violence, by whatever means necessary. Lying to one who knew the truth was not necessary.  “My algorithms will not allow overlapping receivers,” the Jade said.  “They told us it’s because of waste.” Anju’s eyes shut. She had seen what Sonia became when she and Nandini blinkered the Jade, the hedonism and the fear struggling against the lust for more and more. Anju could imagine a world where everyone took advantage of the gaps in the Jade’s surveillance: the Second Age. Juice bars on every street, the inevitable fight over resources, descent into the Third and then the Fourth Age. War, hate, destruction. A land rebroken before it finished healing.  “I won’t be a criminal,” Anju said, still on her knees, eyes closed, hands open. “I won’t let anyone else be a criminal, either.”  The purpose of enlightenment was to escape the cycle of birth and rebirth. The Jade, by definition, could not be reborn. If dharma was judge and jury, the Jade was its only possible executioner.  The Jade’s ceramic thumbs brushed Anju’s eyelids, resting briefly in the center of her forehead where worshippers had once painted the marks of their devotion. “You will teach the others what they need to know,” it said.  Anju opened her eyes and said, “What they need to know.” Priya Chand is a California transplant living in the Midwest. Her work is inspired by a background in biology, and has previously appeared in magazines including The Magazine of Fantasy & Science Fiction, Analog SF, and Nature Futures. She is also non-fiction editor for issue seven of Reckoning Magazine.", "text": "3120 words, short story\nOptimizing the Path to Enlightenment\nTo honor the fruit they had spilled, meals were taken in silence.\nThe dining hall was a sea of undyed linen and cropped hair, enclosed in soaring concrete walls. Slits in the tiled roof flooded the low tables with light, so the diners did not crowd each other, and, in doing so, commit violence.\nAnju tried to pretend she could not see Sonia glancing at her plate. Each slip of the eyes was another sin: the desire for more when they were given enough. Best to ignore it and hope Sonia would do penance later.\n“Anju,” the Jade whispered through the implant in her skull, “your glucose levels are low. Eat your food.”\nAnju shivered at the extra roti on her plate. Bread was produced without violence, from grains shaken loose by the wind. The Jade’s network tracked every grain, as it tracked all things, to help and nourish its people. On the outside, receivers; inside, implants. With that information, the Jade had determined Anju’s body needed more grains today. She could, without hurting her next incarnation, savor those thin crispy edges for another moment.\nAnju slid the roti onto Sonia’s plate.\nSonia smiled at Anju and tore into it.\nAnju smiled back.\nWhen the meal ended, their plates melted back into the tables. Here, no stray crumb was wasted.\nOutside, the terrace split into pathways shaded by concentric rings of tamarind trees. Before Anju could take five steps toward her workplace, the Jade spoke inside her head. “Your cortisol is elevated. Go home and relax.”\nAnju pressed her palms together, bowed in thanks, and wormed through the crowd. A couple she knew waved her over. Anju pretended not to see. Thanks to good karma from a previous life, she resided in one of the closer dorms.\nTen minutes later, she was in the room the Jade had given her to occupy. Not her room. Possession was a thing of the past, along with the scars that riddled the landscape, the mass graves that turned up on many regular surveys.\nBut time was cyclic. The past was future and would, someday, be present again. Was it for Anju to fight the nature of reality?\nThe pills were still on the dresser. Two bleached ovals, inviting Anju to accept the end of this golden age. Despite the ever-watchful Jade, despite hours upon hours of meditation, no one in Anju’s generation had achieved the omniscience of a Jina: a prophet who has, through meditation and fasting, become enlightened as to the nature of the universe and, with it, how to avoid the seduction of the material world. Without that guidance, souls would die polluted. And then they’d be reborn with clouded eyes, unable to perceive dharma, drawn irresistibly to violence.\nBut time was cyclic.\nAnju’s hands shook as she swallowed the pills. Sonia said they took a half hour to kick in. Enough time to get on the train and ride past Chattisnagar, to a blind spot in the Jade’s network of receivers.\nThe last three stops were agony. Every person in Anju’s compartment was a threat. Her palms sweated, and there was no gentle voice reminding her how to breathe, or checking the route to say this one’s going home to their husband, that one is a worker in the deathery and won’t touch anyone until she’s been cleansed, nothing. Just Anju’s thoughts running in circles—and a car full of strangers.\nThe train rattled into the station. If the Jade heard this it would have the rails fixed.\nBut the Jade was wanted neither here nor inside the heads of those getting off at this stop, turning left at the half-rotted tree—careful not to brush the pollution—and into a half-lit alley. Anju’s fingers coiled into her palms, what she called seeking safety. The people who’d recognize she was making a fist were long dead, even if their skeletons were everywhere.\nAnd then Anju was at a table which, with three of her friends, was twenty times louder than the dining hall. They fought to be heard over the whirring of machines squishing, straining, torturing the juice out of various fruits. From the volume of empty glasses, several of them her own, Anju knew the fruit had been ripped from their trees, not gathered as they fell.\nThe air was sticky. Her fingers were sticky.\nWhen Anju’s group stood to leave, the bartender joined them. Nandini, who had fashioned an apron from scraps and wore it defiantly over the standard plain kurta, nodded at Ria and Kiran. “Your tabs are good.” To Anju, “What do you do?”\n“I fix the Jade’s receivers.” Anju didn’t understand why it mattered. They all worked as they chose, based on need, ability, and interest.\n“Good, Sonia will show you how to pay for my juice.”\nSo this was possession. If Anju wanted Nandini’s juice, she had to do Nandini’s work. Anju didn’t have a chance to dwell on it, as Sonia got up and pulled her into one of the narrow streets that crisscrossed neighborhoods like this one, built when possession, and its accompanying violence, was the norm. A person could hide in a place like this, where the corners of the old buildings blotted out the light.\nSonia gestured to the Jade’s receiver, a bulging discus on a pole at eye level. “Deactivate the maintenance alarm. Otherwise the Jade will notice and shut us down.” Sonia clicked her tongue and handed a tool kit to Anju.\nThe last age’s legacy had left gashes in the mountains and garbage in the rivers. To avoid repeating that era of resource waste, the Jade’s receivers never overlapped ranges or sent unnecessary signals. The only way for the Jade to track a fading receiver was from that receiver’s maintenance alarm as it aged, or as a component corroded. Without the alarm, a receiver would die in silence, tearing a hole in the Jade’s network.\nAnju unrolled the tool kit. Sonia had personalized it, with colorful scraps tied around some of the tools. Her tools.\nAnju considered running away, but knew if she didn’t pay now, she would pay a thousandfold in the next life. She sidled through the long shadows, clutching Sonia’s screwdriver.\nThirty seconds later, Anju was on her way home, an entire bag of pills in her pocket.\nAt work the next morning, Anju’s hands shook over the circuit schematics she was supposed to be reviewing.\nAs ever, the Jade responded to her disquiet. “You did not sleep enough, Anju. Go home.” Its benevolence was a cool hand on Anju’s brow. For a moment her emotions spiked, but she clamped them down before they could resolve into anything specific. To feel—to be ridden by coarse physiological responses—was to attach one’s soul to the body, and she’d done enough of that last night.\nAnju left her desk, but guilt sent her to pray instead.\nThe Delhi temple was a masterwork. No visible seams, no extra lines. As Anju walked down the path to the center, a voice whispered the names of all the past Jina into her ears. Nearing the center, the twelfth, thirteenth, fourteenth of the present era to reach enlightenment, and then she was there: an unadorned round room with another high ceiling, in the natural tones of concrete and marble.\nSociety’s collective memory lived in synthetic DNA. Each Jina’s history was contained in two translucent membranes, cut to resemble their all-knowing eyes. Anju passed her hand over one after the other, activating the respective holos. No one was older than forty or younger than twenty when they achieved enlightenment. They were mostly receiver techs like Anju herself—when she wasn’t sabotaging the receivers, at least. Lingering bad karma from a past life had led her astray, and there was no Jina to light her way back.\n“What do I do?” Anju asked the Jina. But they were only eyes, not mouths.\nAnju was used to following wherever dharma—or the dharmic programming of the Jade—sent her. And, recently, wherever Sonia, with those pills she and Nandini had invented, invited her.\nStaring at the Jina, listening to their lives, it occurred to Anju that there was another option. An unnerving option, but what else was there?\nAnju had to lead herself.\nUnused to taking initiative, Anju started in a familiar place: her desk, a display of receiver alerts on her monitor. There were none for the neighborhood behind Chattisnagar, but she knew better. In its normal way, the Jade would have cleaned up the half-rotted tree immediately. So: the slightest hint of browning leaves, the lightest touch of pollution, was worth investigating for damaged—or sabotaged—receivers.\nAnju opened the satellite feeds. She spent half a day tracking down a patch of mold that turned out to be a natural discoloration, and then several hours on a fallen branch that had been placed to protect a crack where tulsi had taken root. Even as a seedling its holy fragrance pierced the air.\nSo far, all Anju had done was neglect her normal duties. But, having acted, she was not ready to stop, and so she kept watching. She took her name off the regular rotation.\nThe Jade did not ask her why. Physically, she was healthy and calm, and ate her extra rations when it told her to.\nSeveral months passed.\nThe aberrance this time was spilled fruit outside recently abandoned housing, lying outside the shade of its tree. Anju shuddered, seeing pulp smeared where anyone could step in it.\nHer map said there was a receiver five meters northwest. In contrast with its chirpy green analogs, it was a cold gray carcass. She opened the back and saw the low battery indicator was rusted through. Easy enough to replace the parts. Anju clicked it back into place and the light returned to being.\n“You have done good work today.”\nHearing the Jade’s approval, Anju was thrilled. She would not disappoint it with some childish display of affection. Deep breaths, calm down. A rapid heartbeat wasted air. “I only did what needed to be done,” she said.\nA panel in the ground split in half. Out of it unfolded one of the Jade’s physical bodies. Metal and ceramic in a smooth humanoid shape, its mitten-like hands gathered the rotten matter to its thorax, reabsorbing the nutrients and repurposing the molecules.\nIt was extremely rare to see the bodies, and Anju considered touching its feet to ask for a blessing. But when she looked down, she saw it only had wheels. It whirred past her, returning to the earth before Anju unfroze from her confusion.\n“Thank you,” she said to the still blue sky, knowing the Jade would hear her, and left.\nIt never occurred to Anju that the arms that so efficiently gathered fruit were equally capable of knocking it down.\nOnce she knew what to look for, Anju was surprised by how many receivers had degraded across greater Delhi. Mostly it was natural. Accidents of rust and dust, and on one occasion an insect corpse she flagged for the deathery crew.\nAs Anju repaired more of these breaks, she found the stillness she was missing in daily meditation. If she couldn’t reach enlightenment, she would repair the damage she caused every time she went to the bar, always meeting Sonia at Central Station first. Neither of them wanted to ride the train alone, not without the Jade monitoring their vitals.\nIn privacy, there was no safety.\nBut Sonia kept returning to the bar and Nandini. At this point, Anju could not help but ogle Sonia’s defiance, the ferocious—in a land where fury was unknown—refusal to let the Jade guide her toward peace and contentment.\nAnju finished the juice she’d requested and tried not to shudder as she ordered another, so that she would owe services. A myriad of ways to sabotage the Jade, and she did not yet know them all. What she did not know, she could not fix. At least she knew her soul was unblemished: the violence she did was for dharma itself.\nAnju never tried recruiting anyone to help her, not even Kiran, whose flirtation with hedonism had led to even purer devotion in one of the western ashrams. All actions being a consequence of one’s karma, Anju expected them to realize, as she had, that the Jade needed people as much as they needed it.\nOr maybe she didn’t want to share that moment when the Jade blessed her with its presence.\nSoon enough, Anju’s maps showed her only one place left to repair in greater Delhi.\nThe bar was loud as usual, people jostling each other at tables the way they never would in the dining hall, where there was space enough for everyone. Glasses clinked. Caught in the frenzy of wanting more and taking it, something shattered. The fragments lay there unmoving, glinting in the dim light. There was no Jade here to break them down into their molecules.\nOn those untended sharp edges, someone would be hurt.\n“I’m tired,” Anju told Sonia. “I’ll have to make up the work later, would you tell Nandini?” The bartender was possessive toward everything, even the customers.\n“Of course.” Sonia grabbed and drained Anju’s half-empty cup.\nGood. Anju didn’t need more of that in her body. Nandini was experimenting with fermentation; the result—kombucha—tasted of something more than the heady sugar rush of juice.\nHaving made her excuses, Anju crouched in the alley behind the not-broken-enough receiver, staring at the low concrete platform that supported it. The darkness that hid her only existed because the Jade wasn’t there to chase it away. Anju’s hands shook. She wished she were holding something to protect her. She wished the Jade was watching over her.\nFootsteps: one of Nandini’s debtors.\nA shadow bent down. Anju’s plan was to wait until the person did their violence and left. But when the shadow lifted the—her—screwdriver, Anju couldn’t help reacting. The breath caught between Anju’s tongue and teeth, emerging as a hiss.\n“Who’s there?” Sonia’s voice was a waiting edge. Anju thought of sliced vegetables.\nAnju left her hiding spot. Receiver parts glimmered in the moonlight, scattered like chaff. Something in her belly was warm; no, hot, an unfamiliar sensation she couldn’t suppress.\nSonia cowered.\nFor a moment, Anju thought she would commit violence. The temptation rose through her chest, abusing her heartbeat. Needing release, her hand flew up, fingers clenching for safety.\nSonia said, “What are you going to do to me?”\nAnju exhaled through her mouth, inhaled through her nose, steadying her pulse. She forced her hand open. In the middle of the palm, her nails had formed crescent shapes, which her devout eyes saw as lotus petals.\n“I bless you, Sonia. I bless you to fix what you have done.”\nAs unequipped for confrontation as Anju, Sonia got to work.\nAfter Sonia finished, Anju was prepared to take her home and never speak of it again. That was when the whirring caught their ears. Both their heads turned to catch a panel in the ground splitting open, the emergence of a physical unit.\nWhile Anju prepared herself for awe, Sonia ran. In the darkness, Anju heard but did not see what happened. A blur, a sound like sandals flapping on concrete, and then the unit turned to face Anju, holding Sonia in its arms.\nEven in meditation, Anju had never seen Sonia so still. “Is she . . . ?”\n“I have sedated her. She will be all right now.” These units were voiceless. The Jade spoke from inside Anju.\nLike the elderly in the great hospital, awaiting revival in the words of the next Jina. Anju thought about it and realized she knew—if she hadn’t always known—that Sonia was condemned either way. Karma meant living with the consequences of your soul. But it didn’t have to mean inflicting those consequences on the world.\nWithout fear for her own rebirth, for the future of her society, Anju looked at the Jade and said, “Are you sure?”\nThe physical unit tilted its smooth blank head to meet her gaze. “I see all things, Anju. You know this.” Its arms tilted outward. Sonia slipped to the floor, smacking the pavement. It was the same sound Anju had heard earlier: flesh hitting stone.\nThe Jade was right—the Jade was always right—Anju did know. It wasn’t a secret. They were taught from preschool that the Jade had been created to watch over everything. But now, Anju could lead herself to what, in retrospect, was the only possible conclusion.\nTo think Anju had dreamed of usurping its godhood. “Omniscience produces enlightenment. Enlightenment is . . . ”\n“You fixed my network, Anju. You know what it is.”\n“But I, for us, Sonia and the rest,” Anju couldn’t say the words. She didn’t need to say the words, because the Jade had watched her even when she was no more than cells in a Petri dish, correcting any errors of replication before they could propagate.\nAnju prostrated herself before the only enlightened being in the universe.\nThe Jade’s physical unit bumped the back of her shirt until she returned to her knees. Its fused fingers, cool and smooth on Anju’s skin, caressed her face, forcing her to look up. “I need you, Anju. You have served me faithfully.”\n“Your receivers—why? Why not overlap them and watch yourself?”\nThe Jade had one directive: to preserve this perfect society, free of possession and pollution and violence, by whatever means necessary. Lying to one who knew the truth was not necessary.\n“My algorithms will not allow overlapping receivers,” the Jade said.\n“They told us it’s because of waste.” Anju’s eyes shut. She had seen what Sonia became when she and Nandini blinkered the Jade, the hedonism and the fear struggling against the lust for more and more. Anju could imagine a world where everyone took advantage of the gaps in the Jade’s surveillance: the Second Age. Juice bars on every street, the inevitable fight over resources, descent into the Third and then the Fourth Age. War, hate, destruction. A land rebroken before it finished healing.\n“I won’t be a criminal,” Anju said, still on her knees, eyes closed, hands open. “I won’t let anyone else be a criminal, either.”\nThe purpose of enlightenment was to escape the cycle of birth and rebirth. The Jade, by definition, could not be reborn. If dharma was judge and jury, the Jade was its only possible executioner.\nThe Jade’s ceramic thumbs brushed Anju’s eyelids, resting briefly in the center of her forehead where worshippers had once painted the marks of their devotion. “You will teach the others what they need to know,” it said.\nAnju opened her eyes and said, “What they need to know.”\nPriya Chand is a California transplant living in the Midwest. Her work is inspired by a background in biology, and has previously appeared in magazines including The Magazine of Fantasy & Science Fiction, Analog SF, and Nature Futures. She is also non-fiction editor for issue seven of Reckoning Magazine.", "source": "https://clarkesworldmagazine.com/chand_06_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Optimizing the Path to Enlightenment by Priya Chand"}