{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Gregory Feeley", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "10SUpLQEjH8ChgvkgcrJ0g23Jq8=", "id": null, "license": null, "comments": "", "raw_text": "5990 words, short story  In a Net I Seek to Hold the Wind  For this was Galatea made: the rock from which we cast our line into the depths. Presenting its same face—a lover’s unwavering gaze—to swirling Neptune, it circles that world at a pace just slower than Neptune’s own spin, diffident yet faithful. A mass of planetary debris compressed by gravity, the tiny moon almost asked to be plundered for the material needed to create the cable we lower sixty thousand kilometers into the ocean of winds.  More than a third of its substance was converted into this cable, the longest structure ever created by humans, another third hoist upward to counterbalance the shifting mass. Between them lies our redoubt. Those who spent four decades manufacturing the cable are permitted to remain here (even if it means that one of the scientists must participate from light-minutes away) while our Tsuribari fishes for Leviathan.  Pixiu calls it the Narrow Road to the Deep North, a koan I labor to understand. Road I can comprehend, though it is not traversed by man or beast. Narrow it eventually becomes, tapering imperceptibly along its tremendous length from pillar to filament, but Deep North? Neptune dominates the sky, closer to us than we are to most of its other satellites. We lean forward to drop our angle, careful to keep our balance.  It is beautiful, but will it work?  So they asked, and doubted. Enormous energies were required to knit the fibers that would withstand such tensile strains. The capacity to design, manufacture, and extrude five kilometers of steadily thickening cable every day—and to maintain it for more than a generation while pushing a counterweight in the opposite direction—stands as the greatest engineering feat of human history. The Tsuribari must not only sustain its tremendous weight, but must vibrate, like a plucked string, out of the path of every orbiting rock that hurtles through its latitude. It does not simply hang like an icicle; it moves, gathers data, and repairs itself. The thousands of substations along its length are controlled by Minds more intelligent than any human, who communicate with each other in ways we cannot understand. The high road to Neptune is so densely populated, it may someday evolve from an artifact to a Being.  Would this not be a great deal of effort for results that could be obtained more modestly?  That is what its detractors said but look at it now. The tip of Tsuribari reaches only into the upper kilometers of Neptune’s atmosphere, but it gathers data every millisecond. In the decades to come it will descend further, into the planet’s depths. Exploring Neptune will be the work of centuries, and Tsuribari will be the primary tool. There is no reason not to expect that it will continue to orbit, stable as the moon it long was, for a million years.  Your work would endure for an eon?  Scarcely mine alone, although I was young when it began and now am old. Why do you keep using the subjunctive?  Does it bother you that I do so?  Now you are toying with me. Who are you?  That question, once asked, must be answered. I am Naranchimeg, and you know me. Soon your memory of our acquaintance will return. The experience will be slightly distressing, but you were apprised of that.  SlowlyNaranchimeg’s features take form. It is recognizably human in appearance, not organic, and neither male nor female. The impassive expression is not unfriendly.  “Your vision of Galatea transformed is quite beautiful. ‘Tsuribari,’ eh? The magical fishhook. I like that.”  I know Naranchimeg does not mean this patronizingly, but I scowl at it. If the great work was not in fact real . . . It is not in fact real. This comes to me as a small but profound shock, a pebble dropped into a well whose reverberations shake its walls. We stand not at the end of forty years’ labor, but at the beginning.  “Not even that, for your tremendous structure is not practicable. A spinning tether will permit exploration of the upper atmosphere more quickly and efficiently than a massive static artifact. At a length of four hundred kilometers, such a cable could be built in a year.”  I can only nod at this. Memories have meanwhile been spreading through my consciousness, like moisture soaking into clothing. Galatea is the unhewn shape it has been for millions of years; only a tiny fraction of its volume has been engineered, and we inhabit it. A moment ago I was old after forty years dedicated to my life’s work. Now those years have not yet begun, but I am still old.  Figures are taking form around me, strange at first and then familiar. They are my sixths: I have known them this latter half of our lives. The eyes of those across from me flutter, and Bixi’s opens. Xiezhi, next to her, is already gazing about alertly. We are all lying on our berths, coming awake one after another. I feel myself pushed slightly to the right as the chamber’s spin slows and gravity diminishes. We are looking at each other with the faintly abashed expressions of people who know each other too well. The last of the spin energy is withdrawn into the chamber’s coffers and we float free, six otters following each other up and out of their burrow.  Galateaville has fifty-nine inhabitants, some of whom have been here as long as we have. Excavations continue, but most of the moonlet remains solid, if loosely knit. To drill into its mass is to dislodge one chunk of rubble from the rest, so we must first lace them together, a great fretwork construction that has been under way for years. We establish a rigid mass and then we tunnel into it, our city a growing vacancy.  “Who were you speaking to?” Bixi asks me.  “Naranchimeg.” I explain how the Mind persuaded me to embark on a Figment, in which I elaborated in accordance with its suggestions. I ask what her Figment had been.  “A dream of gravity,” she says. “True gravity—a great hoop thrown around the planet like a wedding ring, that people might stand upon it. Poised just above the upper atmosphere, eighty thousand klicks in circumference. Its orbital speed was very slow, offsetting Neptune’s gravity just enough to produce one G.”  “Quite a ribbon,” remarks Fenghuang. “How wide?”  “Hardly at all—maybe three meters? Like a walkway around the world. Structures were cantilevered out toward the poles, cities poised on a railing.”  “Still a lot of mass, mostly tensile,” adds Fenghuang, who was checking the numbers.  “Your air-castle is prettier than mine,” I tell her.  “Yes,” she says. “In my mind it glittered, an enormous necklace strung with thousands of gems. Whatever reason they have for inducing us to imagine these things,” and her face begins to sag, like a sugared confection succumbing to gravity, “it was a beautiful vision. And then it went away.”  He was trawling The Siege of Bianliang, following a Jin patrol that ventured forth with fire lances to harry the besiegers’ supply train. For weeks he had followed the design and construction of the gunpowder tubes, inhabiting each viewpoint in turn and annotating where he felt their desperate resolve had been given a tinge of the sentimental. (One sprout involved a terrible accident, a tube blowing up in an engineer’s face, and he followed it some ways before deciding that the tale was grim enough as it was, and it was in any event not implausible that those meticulous and frightened men could have assembled the tubes without a mishap.) The combat scenes troubled him, but he had trawled with deep interest through dozens of other threads over the years—the Mongol strategists’ deliberations, the ventures of brave and skittish scouts, the tearful farewells of young soldiers—and though he knew that the final quarter of the tale would be unremittingly dark, he could continue to avoid them only by surrendering to his apprehensions.  Keeping up with its deepening texture could be difficult, especially when you had to deal with updates from trawlers on Mars and Titan, who were often even more distant than Earth. By the time these tendrils reached the Sea, hours had passed and those here had meanwhile added to them, and the task of integrating these disparate strands consumed vast amounts of energy. Energy demand, however, was no longer a limiting factor.  That evening he spoke with one of the Highlanders, a wakashu named Tian who had grown up on Nereid and spent most of zer adulthood higher still. Ze was part of the crew that had come down from the Heights together and would eventually succeed Qilin and his contemporaries. These young people (the young people everywhere) were trawling a different saga, one involving a voyage to Ouranos. It was complete fiction, and he failed to understand how fabricating an outright fantasy could engage adult minds.  “It’s open-ended, and we get to create it,” ze said. “Everyone knows how the Siege of Bianliang and the Drowning of Bagerhat ended. But what will happen to the Sky Dragon? Several thousand trawlers will decide that, and if there are dozens of different answers, those with the most followers will be most fully articulated, like water finding the best paths to their tributaries—isn’t that how it worked on Earth?”  “It’s like a fairy tale,” Qilin insisted, feeling vaguely that he was being unfair. “I mean, Ouranos? Ouranos has nothing!”  Ze smiled. “Oh, you never know. One tendril hints at the discovery that the inhabitants of Neptune’s interior reached and colonized Ouranos.”  Qilin shook his head. The violent world of the Jin Dynasty was more alien to him than an imaginary voyage by contemporaries to Neptune’s pale sibling, yet it was factual: the combination was compelling as no other saga managed to be. The Siege of Bianliang was the most complex work of art in human history, and the fact that God of the Sky was more deeply trawled, at least in the Sea, pained him in a way he suspected revealed something about him he did not like to acknowledge.  Tian’s colleague Houwang—they were all colleagues, he reminded himself—had joined him on a year-long project to enlarge the world’s interior living space. Galatea’s unstable tectonics demanded exceptional caution: drilling disturbed the play of forces holding it together, and extensive measurements (through thousands of sensors) had to be taken and immense recalculations made every fraction of a second. The engines Qilin summoned for this labor were powerful but tricky to manage efficiently, and his long experience made him the obvious candidate to train others.  “Do you do this yourself because you don’t trust the Minds?” Houwang asked one afternoon.  “Not at all,” he said, surprised. “They have their own projects.”  Houwang chuckled. “If you asked them what those were, would they tell you?”  “Oh, sure. Although their answers can be hard to understand.”  He wondered if Houwang had grown up on a satellite uninhabited by Minds, as several of the smaller ones were said to be. Some people thought them ubiquitous, and those worldlets seemingly without them merely infested by ones that hid their presence. Such beliefs could lead to abiding suspicions.  “I hear,” Houwang said after a moment, “that they sometimes ask people to participate in a Figment.”  “That’s true.”  “I would be interested in hearing an account of that.”  “Well, I can tell you.” Qilin was ready to take a break. “It’s an induced dream, subjectively quite real. They describe the process in advance, including its distressing elements.”  “The dreams can be frightening?”  “Mine wasn’t.” He assumed that Houwang knew he had undergone one. “Leaving it can be disorienting, especially if the experience was pleasant.”  “Why do they do this?”  “Well, you can ask. I mean literally: you, too, can ask.”  Houwang smiled disbelievingly. “What will they say?”  “They will tell you they are curious about the subjects’ responses.”  “That’s helpful.”  “They don’t seem to be investigating a specific issue. I think they find all aspects of human behavior equally interesting, along with everything else in the universe.”  It was a moment before Houwang spoke again. “Are the contents of these Figments too personal to ask about?”  “Not at all. I imagined that Galatea had been recast into an enormous skyhook.” He described the Tsuribari in some detail, since most of the Figment had comprised a detailed appreciation of these features. “It was a jolt to awaken and realize that we had done none of these things.”  He had expected the young man to smile indulgently, but Houwang surprised him. “That’s pretty neat. Monumental engineering! A cable reaching from the surface to Neptune’s core would be shorter.”  He did not tell Houwang about the desolation he had felt on emerging.  Twenty minutes later they were drifting through an access tube, on an inspection visit (not actually necessary to conduct in person) of a just-excavated chamber. The tube had been tunneled just an hour before; Qilin let his gloved hand trail along its perfectly smooth wall, though the heat had long since fled into frigid stone.  It was in the odd acoustics and near darkness that Houwang abruptly spoke. “Are there questions that the Minds will not answer?”  “I don’t know.”  “Have you ever heard of one refusing?”  “No. But people with questions are usually better going to the Encyclopediae. The Minds possess vast amounts of data, and while talking to people occupies only a negligible fraction of their attention, they are not actually adept at it.”  “But they don’t mind our talking to them?”  Qilin laughed. “‘Mind’? Don’t treat their reactions as human!”  He often reflected on what it must have been like to grow up in the Heights, the children of settlers who had fled troubles that now seemed inconceivable, growing up light-minutes from the Centaur or Triton in tiny, beleaguered communities. When the Minds finally revealed themselves, these young people grew up without them—“Or perhaps those in our midst never came forth,” as Tian perhaps jokingly said—and retained their wonder at the Beings that were present yet nowhere visible. Someday they would find everything else more interesting.  Galatea was a tiny moon, a thousand times less massive than Triton, though a thousand times more massive than the Centaur, where most of its crew still lived. Someday a metropolis would inhabit this interior, the voids he was shaping vanished into a greater space that would constitute their sky. Thousands of cubic kilometers displaced, perhaps to be used in fabricating structures—castles in space—more outlandish than those now being imagined.  The entered an unfinished chamber, dozens of meters across, the vacancy that others would fill with decks and walls, the living spaces for the tiny world’s future residents. Galatea was far too massive to ever be set spinning, so its work crews experienced gravity only in the rotating chambers some needed to sleep. Children would grow up not in spaces like the Centaur’s but in those designed for the weightless: passageways that would open onto ceilings, rooms with floors lined with shelves and tapestries, which the suspended furniture never touched.  Qilin could illuminate the space with a word, but instead he took his hand torch and tossed it out into the darkness. It sailed away, spinning slowly, casting its beam wildly over the surface’s unbroken concavity.  Houwang exhaled in a soft Ah. “I grew up on Kymopoleia, and we never opened a space this large.”  “Someday this world will be transformed beyond recognition.” The thought provoked a pang, but he kept a note of pride in his voice. With a gesture he called back his torch.  Houwang had kicked himself away from the wall and was drifting slowly into the great space. “Why this size,” he asked, “when you could make it larger? Since we will eventually want larger spaces.”  “That’s easy,” Qilin said. “We lack the extra air.”  Houwang laughed. “Of course! Stupid of me not to think of it—it’s a big issue back home.”  Qilin could easily imagine that it had been a problem on Kymopoleia, whose settlers had fled with nothing but the oxygen in their escape vehicles. It was a problem everywhere. However tight the seals and efficient the pumps, every time anyone opened an airlock they lost some whisp of vapor, trillions of molecules. Plundering Triton’s ices would not be allowed for decades, so difficult was it to explore its seas by noninvasive means. Someday the Centaurans’ millions of descendants would dredge oxygen from the depths of Neptune, but the population would have to survive until then on what air they had brought from Earthspace.  Reminded by this, Qilin said, “Let me show you something,” and extinguished his torch. He spoke a few words in the near darkness and watched as a disk of blue-green light appeared somewhere before them, like a skylight opened onto a distant sun.  “The debris shaft?”  “Yes. The excavated material moved through it and was stacked on the surface. It opens onto Nearside, as you can see, since the Tether will be constructed there.” They gazed silently on the azure glow of the dust motes twinkling in the air. Light from the Sun, reflecting off Neptune’s upper atmosphere, entering the tunnel to bounce off the dust and onto their retinas. It was a peculiar thought, and Qilin merely remarked, “Shifting the mass along that axis will increase orbital decay by some immeasurably small amount.”  “I bet the Minds could measure it.”  “They could certainly extrapolate its long-term effects. I suppose we could ask them.”  “Can we believe what they tell us?” Houwang asked in a low voice.  Qilin wondered whether he thought the Minds could not hear them here. “They have no reason to deceive us.”  “But if, for their own unaccountable reasons, they did, are they intelligent enough to hide the fact and deceive everyone?”  At this Qilin laughed. “Oh, absolutely.”  Xiezhi had reserved a bower for us, something I had been reluctant to do since the Highlanders had come. “We have been sleeping together since before these saplings were born,” he said, which is true but could be adduced as a reason to surrender the space.  “And we will still be doing it when they are older than us,” he added, encircling me with his arms. He was replying to whatever objection he thought I might make, a habit that would be annoying in anyone else.  “They are kind of cute,” I said, mostly to throw him off.  “You worry that they will take our place,” he said. He knew me, of course, too well. “And they will.”  “Then we will have to carve new places.” Such projects would keep my team busy for the next thirty years. “They can gain some experience while dreaming about designs for the Tether.”  “Ah, the spinning tether.” He looked at me with an amused expression. “You don’t follow their chat, do you? They are deciding what to call it.”  “‘They’?” I asked, at once defensive.  “Oh, we will have a say, too. But it’s the first big project the kids will be involved in, and they are excited by it.”  “So have they chosen already?”  “They are still discussing, but they seem to come readily to agreement, unlike their squabbling elders.”  “That will change,” I said darkly.  “Oh, probably.” Xiezhi smiled, untroubled. “But meanwhile there is amicable concord, and when the time comes, they will propose naming it the Shaduf.”  “Shaduf?” I took a moment to look up the word. “A nice image, I suppose. I guess I was imagining a visual parallel.”  “There is general agreement,” he continued, “not to call it the Keloneion, though the term may be older, because they have tired of our preoccupation with the ancient Greeks.”  “That was our parents’,” I protested.  Xiezhi laughed. “It’s important to you that they understand that distinction,” he said, undoing my belt. “And they don’t.”  Xiezhi knew how to distract me. I think he took pleasure in doing it after getting me fixed upon something, as a challenge.  “I don’t think we were like that.”  He adopted a thoughtful expression. “If you want to unsettle them, have a child of your own.”  “What an idea!” I paused. “Though honestly, I think I would be a good mother.”  “Not a father?” He was drawing attention, less subtly than his usual, to my current status.  “No, I would revert before conceiving.” I realized at once he was going to ask me why, and I didn’t have an answer. Perhaps it was because I had spent years with Bianliang and knew that mothers tend to be younger than fathers.  “Well, then . . . ” he said, and for a second I knew he was about to say, Can I be the father? a line unworthy of him, but with a swift movement he slid my trousers off my legs and flung them away, a practiced maneuver I could never match. The familiar surge of excitement never failed to distract me, but Xiezhi always finished his thought. “You plan to someday call an end to these pleasures?”  Xiezhi believed that I enjoyed his caresses as a man more than I ever had as a woman, and I could not flatly say that he was wrong. Something to think about, though not right now.  The garment landed on the back of an ornate dressing table and immediately changed itself into a robe. I had set the space to a merchant’s bedroom in fifteenth-century Samarkand, whose opened windows looked upon the recently completed observatory. An astronomer’s study would be more interesting, but it was the homes of the great that tended to better preserved, or at least more easily recovered. The fabrics and veneers had all been identified from microscopic samples unearthed in the middle of the last century, when advanced technology could still be turned to such purposes. I didn’t know what Xiezhi was seeing, save that he had chosen not to share mine.  My garment had actually floated across the room; it would be years before we could spare the resources to impart spin to one of the bowers. Those who truly craved gravity in their erotic life were compelled to bargain with team members for private time in their shared sleeping chambers, an indignity I was glad to be spared.  If Xiezhi wished to simulate the force of one G, he would anchor himself with one arm and then press himself against me, or me against him. It worked fine, although he tended to make light of it. Perhaps he feared I would laugh at him.  “The Highlanders wouldn’t know what to do with conjugal gravity,” he remarked sometime later. “They’d probably bump their heads.”  “They’d rather be swinging tethers,” I replied. Wit was not required at a time like this.  Then I thought to ask him: “Last week, when we were asked to experience a Figment, did you agree?”  “Um,” he said. He tensed slightly, perhaps without realizing it. “I did not.”  Xiezhi was the oldest of us, and in some ways the most guarded about his privacy, though he had grown up aboard the Centaur like all our generation. I had told him of my Figment and he had seemed noncommittal, perhaps (I now guessed) out of evasiveness concerning his own.  “I’ll tell you something,” he volunteered suddenly. “I was talking with one of these kids today, and he asked me whether we weren’t bothered living years on a rock that is ‘haunted,’ his term, by the Minds.”  “They think the Minds are hovering over our shoulders, listening to us.” Save for those Figments, I had not thought about them for months.  “Perhaps they were aghast to realize that some of the critters were living—” perhaps the wrong word, though I didn’t have a better—“among them on their tiny rocks, and they didn’t know it.”  “They seemed worried that the Minds are going to do something,” I said.  “Well, of course they’re going to do something,” Xiezhi replied irritably. Something had changed in his voice. “Do you think Entities of that nature will be content to simply observe, and occasionally carry out little experiments on our dreaming minds, for the rest of all time? The Shaduf may be our project, but they are more interested in it than we are—more interested than we can be. The great arm will swing down into the upper atmosphere and its thousands of sensors will taste the world itself, feel the vibrations that run through it, discover what mere observing cannot do.  “And for what? Do you think they intend simply to ponder their findings?”  I stared at him.  “They are going to study Neptune for three thousand years and then they will take it apart, down to its very molecules, and use its constituent elements to construct whatever they want . . . unless they have meanwhile learned how to summon up matter out of the quantum foam, or visit other universes and busy themselves with that.  “Three thousand years isn’t very long to them. It’s a hundred times longer than they have existed, and a minute to them is centuries to us, but three millennia is still no great interval of time when your life span may be longer than the stars’.”  They were working in the debris shaft, near the point along its length where the face of Neptune filled the opening. Qilin told Houwang to extinguish his suit’s running lights and did so for his own. Then he doused his torch and they hung for a moment bathed only in the dim effulgence overhead.  “So far from the Sun,” Qilin observed. He had seen Jupiter on their slingshot approach decades past, bright with reflective light. The crew had imagined themselves profoundly deep in space, a fancy he refrained from sharing with the youth.  “But enormous,” replied Houwang, whose parents (Qilin remembered) had fled to tiny satellites absurdly far from their primary.  “You will someday trail your fingers through its current,” he said lightly.  “We will build cities that bob upon its waves, where you will enjoy genuine gravity once more!”  At this Qilin could only laugh. “In a few centuries? Well, perhaps we will both live that long.”  Qilin activated his torch and played its beam along the tunnel wall. He pointed out the structures running about them: the joints that allowed the shaft to flex should excavations stress the disordered moonlet; the seals and casings surrounding the hatch. Houwang knew all this, but seeing it as one floated in vacuum, bathed in the beams of what sunlight Neptune reflects, created an immediacy that no simulation could match.  When Houwang spoke, his voice carried the diffidence of one embarrassed to be returning to a subject. “I remain surprised that you—” Qilin could plainly hear you old people—“remain untroubled about the Minds operating among us.”  Qilin smiled. “Well, we grew up knowing we weren’t being told everything.”  “That’s my point! Your elders lied to you.”  “They may only have suspected it. And the Minds may have evolved—or finished evolving—during the voyage, unhindered by Earthly constraints.”  “But you don’t know.”  “History may someday tell us what the Council members knew. Or you could ask them.”  “But—”  The alarm tone shrilled in one ear as a voice in the other cried, “Warn—” and everything struck him at once. The concussion knocked every thought out of his head, though an instant later a blow to his knee brought pain shearing through his consciousness.  They struck hard against the side of the shaft, though not enough to slow the force propelling them outward. Qilian’s visor was immediately frosted over, and the glove he instinctively raised knocked away. And suddenly there was no wall; his limbs waved helplessly as Houwang’s body bounced against him.  Pain was sending alarms from all the provinces of his body, but urgency drove it away. Within seconds his visor had cleared, though only to disclose the vista he knew to expect. They were tumbling slowly through space, Neptune’s enormous disk rising and falling every several seconds like the frenzied passage of days.  “Houwang, are you all right?” A groan was abruptly cut off as the young man pulled his helmet away from Qilin’s. All right, no radio. Qilin did not trouble to check for suit integrity, his or the boy’s. Low-albedo Galatea was visible only as a field of darkness, but that was enough.  “Don’t move, Houwang; hold still. I know what to do.” And before the Highlander could ponder this, Qilin held the unresisting body at arm’s length and raised his boots. The slowness of their shared rotation made calculation possible, which was good, for proper timing was essential. Clarity sharpened to a crystalline edge, with pain rising just behind it. Qilian paused, placed his soles against Houwang’s chest, and kicked hard.  Unmoving, the suited figure receded, still tumbling against the dark plains of Galatea. Sudden anguish in Qilin’s leg, which immediately began to fade: the suit’s diagnostics had administered an anesthetic.  Neptune wheeled past, no larger than before, but Qilin was undeceived: whatever force he had imparted to Houwang had redoubled upon him. He was falling toward the planet with greater velocity than came from the blast that blew them out the tunnel.  Qilin spent long seconds trying to calculate the chances for rescue. For Houwang, yes: The Highlander was moving toward Galatea, if slowly. A rescue pod would reach him first, decelerating to do so. By the time the boy was stabilized, however, Qilin would be too far, and accelerating.  The Highlanders had made him feel old, but now he felt keenly the century—or more!—he would not get to live. True, the youth had more years before him, so the move made sense. The consolation, he thought, of arithmetic.  That was well done, something said.  Belief in one’s senses is slow to fade, but he waited a second before responding. “Who are you?”  A passenger, unintended of course. Flung loose by the same accident that cast you here.  “What is your name?”  I don’t have one, at least not yet. As you probably know, our physical substance is unevenly distributed through normal space, and the I that now am was merely part of a Being that must now regrow missing substance. You may call me Donti Drakou.  Qilin pondered this.“So I will not die alone.”  Houwang will not die at all. You retain your fast reflexes, doubtless a product of growing up in the spun-gravity field of the Centaur, where a fragile object would dash itself to pieces on the floor the second you let go of it.  Ebbing adrenaline darkened quickly. “You seem very wise,” he muttered.  How could that be? I am less than two minutes old, though I have experienced consciousness for a subjective period that exceeds your lifetime. But I am observant.  “We will soon observe something remarkable. Or at least you will; I have not checked my suit’s viability.”  Your suit has been badly damaged. There are severe limits to what I can do.  Life, Qilin thought, had never felt sweeter. The years’ vain travail dropped away like chains and he looked about in wonder. Bathed in light—a vast amount, though faint—he marveled at the exquisite sharpness of existence, its richness and brevity.  What a realization, an endless blossoming, to experience, even in the minutes—seconds?—remaining to him.  Sorry about this, said the Mind suddenly.  “Wha—” Qilin began to say. And then everything crumpled.  Dead?  Not dead. Maybe dead.  No thought. No pain.  So dead?  Fading thoughts of dying brain. Itself a thought.  Awareness only. Cooling.  Silence.  “ . . . Back?” someone was saying.  A face swam slowly into focus, a familiar one. Qilin knew it was familiar before he could identify its owner.  “I hope you remember this time,” Long said. “I have said it all thrice before.”  “I’ll remember.” The words emerged as a croak. Qilin hoped (a bubble of clarity in the murk of his thoughts) that he hadn’t already given that assurance.  “Very well. The kid is safe. You will heal, mostly. Nobody else was injured in that blowout—emergency hatches slid shut within a second, but you two were already flying out the shaft like buckshot. Were there shotguns at Bianliang?—Never mind. You can have more details when I know you will remain conscious.”  “The others?” Qilin asked after a moment.  “You mean us? Everyone is fine. Pixiu has been crying; Fenghuang is too busy to come; Bixi is annoyed with you, I’m not sure why. Xiezhi sits with you when I’m asleep.” Long ventured a smile. “You need to get better and return soon; we can’t spin up to full gravity with you gone—it throws the balance off.”  There was a joke about admitting a new sixth to fill his slot, but it wouldn’t take form. “Just tell me . . . ” Qilin sought to frame his question, but could not find the syntax. “How.”  Long nodded, understanding. “Your suit cannibalized itself for propellant. Damnedest thing; didn’t know they were that smart. Took every scrap of matter not required to keep you alive and thrust it away with all the force it could generate. Used so much of the suit’s power that you nearly froze.”  Arithmetic remained simple. “I am surprised there was enough,” he said carefully.  “Well,” Long looked suddenly uncomfortable, “there was a lot of delta-V to overcome. And, yes, not much superfluous hardware in those suits. So pretty quickly it had to start in on you.”  Qilin just looked at him.  “Well, you don’t need your feet to stay alive. And it was that or die.” This was plainly a part he hadn’t told before. “First your legs, but eventually . . . ” He shrugged. “So long as the brain remained mostly intact, you were fine.”  Qilin had no response to make. How disturbing would I find this, he thought, were I not sedated?  Finally he said, “How . . . long?”  “How long since the accident? Quite a while, I’m afraid. There was a lot to regrow. The Shaduf is already being designed. Oh, do you mean how long until you are released? I don’t know. How lucid do you feel?”  Qilin closed his eyes, and when he opened them, he was alone.  Mostly he dreamed, though sometimes he knew he was dreaming, which made it (of course) something else. Sometimes he dreamed of being back with his sixths, or with earlier friends or lovers. Once he found himself limping among the burning villages outside the walls of Bianliang, blood on his sword, smoke and cinders blowing in his face.  Sometimes he imagined that Donti Drakou—oddly, he remembered the name—had restored his youth, rather than simply repurposing most of his body mass. A bit more rationally, he imagined a visit from the Mind, now older than him, and being told that he would soon be graduated from the hospitalers’ care, as one newly embarked on man’s estate. He imagined that the radical reconstruction he had needed would increase his life expectancy, though he suspected the reverse was true.  Sometimes he dreamed of Tsuribari, the cable reaching into the depths, the greatest structure never built. Galatea, the detritus of cosmogony, transformed by design: the highway to the Planet of Storms. How much of his own substance was now falling toward that world?  And when those now circling Neptune finally descend through its clouds into yet stranger realms, will Qilin, his sixths, his children, Minds, and Beings in forms beyond those now suspected, discover there those forces and compounds their simulations had predicted?  Or will its mysteries surpass the compass of otherworldly psyches, however grown beyond their earthly molds? Gregory Feeley writes science fiction and about science fiction. His first novel, The Oxygen Barons, was nominated for the Philip K. Dick Award and. His stories have been finalists for the Nebula Award and his essays and reviews have appeared in a variety of publications, including The Atlantic Monthly, the New York Times Magazine, the Washington Post Book World, and USA Today. Feeley's most recent novel is Kentauros and he recently completed a long novel, Hamlet the Magician. His previous Clarkesworld story, \"Cloud-Born\" will be reprinted in two \"year's best\" anthologies this year.", "text": "5990 words, short story\nIn a Net I Seek to Hold the Wind\nFor this was Galatea made: the rock from which we cast our line into the depths. Presenting its same face—a lover’s unwavering gaze—to swirling Neptune, it circles that world at a pace just slower than Neptune’s own spin, diffident yet faithful. A mass of planetary debris compressed by gravity, the tiny moon almost asked to be plundered for the material needed to create the cable we lower sixty thousand kilometers into the ocean of winds.\nMore than a third of its substance was converted into this cable, the longest structure ever created by humans, another third hoist upward to counterbalance the shifting mass. Between them lies our redoubt. Those who spent four decades manufacturing the cable are permitted to remain here (even if it means that one of the scientists must participate from light-minutes away) while our Tsuribari fishes for Leviathan.\nPixiu calls it the Narrow Road to the Deep North, a koan I labor to understand. Road I can comprehend, though it is not traversed by man or beast. Narrow it eventually becomes, tapering imperceptibly along its tremendous length from pillar to filament, but Deep North? Neptune dominates the sky, closer to us than we are to most of its other satellites. We lean forward to drop our angle, careful to keep our balance.\nIt is beautiful, but will it work?\nSo they asked, and doubted. Enormous energies were required to knit the fibers that would withstand such tensile strains. The capacity to design, manufacture, and extrude five kilometers of steadily thickening cable every day—and to maintain it for more than a generation while pushing a counterweight in the opposite direction—stands as the greatest engineering feat of human history. The Tsuribari must not only sustain its tremendous weight, but must vibrate, like a plucked string, out of the path of every orbiting rock that hurtles through its latitude. It does not simply hang like an icicle; it moves, gathers data, and repairs itself. The thousands of substations along its length are controlled by Minds more intelligent than any human, who communicate with each other in ways we cannot understand. The high road to Neptune is so densely populated, it may someday evolve from an artifact to a Being.\nWould this not be a great deal of effort for results that could be obtained more modestly?\nThat is what its detractors said but look at it now. The tip of Tsuribari reaches only into the upper kilometers of Neptune’s atmosphere, but it gathers data every millisecond. In the decades to come it will descend further, into the planet’s depths. Exploring Neptune will be the work of centuries, and Tsuribari will be the primary tool. There is no reason not to expect that it will continue to orbit, stable as the moon it long was, for a million years.\nYour work would endure for an eon?\nScarcely mine alone, although I was young when it began and now am old. Why do you keep using the subjunctive?\nDoes it bother you that I do so?\nNow you are toying with me. Who are you?\nThat question, once asked, must be answered. I am Naranchimeg, and you know me. Soon your memory of our acquaintance will return. The experience will be slightly distressing, but you were apprised of that.\nSlowlyNaranchimeg’s features take form. It is recognizably human in appearance, not organic, and neither male nor female. The impassive expression is not unfriendly.\n“Your vision of Galatea transformed is quite beautiful. ‘Tsuribari,’ eh? The magical fishhook. I like that.”\nI know Naranchimeg does not mean this patronizingly, but I scowl at it. If the great work was not in fact real . . . It is not in fact real. This comes to me as a small but profound shock, a pebble dropped into a well whose reverberations shake its walls. We stand not at the end of forty years’ labor, but at the beginning.\n“Not even that, for your tremendous structure is not practicable. A spinning tether will permit exploration of the upper atmosphere more quickly and efficiently than a massive static artifact. At a length of four hundred kilometers, such a cable could be built in a year.”\nI can only nod at this. Memories have meanwhile been spreading through my consciousness, like moisture soaking into clothing. Galatea is the unhewn shape it has been for millions of years; only a tiny fraction of its volume has been engineered, and we inhabit it. A moment ago I was old after forty years dedicated to my life’s work. Now those years have not yet begun, but I am still old.\nFigures are taking form around me, strange at first and then familiar. They are my sixths: I have known them this latter half of our lives. The eyes of those across from me flutter, and Bixi’s opens. Xiezhi, next to her, is already gazing about alertly. We are all lying on our berths, coming awake one after another. I feel myself pushed slightly to the right as the chamber’s spin slows and gravity diminishes. We are looking at each other with the faintly abashed expressions of people who know each other too well. The last of the spin energy is withdrawn into the chamber’s coffers and we float free, six otters following each other up and out of their burrow.\nGalateaville has fifty-nine inhabitants, some of whom have been here as long as we have. Excavations continue, but most of the moonlet remains solid, if loosely knit. To drill into its mass is to dislodge one chunk of rubble from the rest, so we must first lace them together, a great fretwork construction that has been under way for years. We establish a rigid mass and then we tunnel into it, our city a growing vacancy.\n“Who were you speaking to?” Bixi asks me.\n“Naranchimeg.” I explain how the Mind persuaded me to embark on a Figment, in which I elaborated in accordance with its suggestions. I ask what her Figment had been.\n“A dream of gravity,” she says. “True gravity—a great hoop thrown around the planet like a wedding ring, that people might stand upon it. Poised just above the upper atmosphere, eighty thousand klicks in circumference. Its orbital speed was very slow, offsetting Neptune’s gravity just enough to produce one G.”\n“Quite a ribbon,” remarks Fenghuang. “How wide?”\n“Hardly at all—maybe three meters? Like a walkway around the world. Structures were cantilevered out toward the poles, cities poised on a railing.”\n“Still a lot of mass, mostly tensile,” adds Fenghuang, who was checking the numbers.\n“Your air-castle is prettier than mine,” I tell her.\n“Yes,” she says. “In my mind it glittered, an enormous necklace strung with thousands of gems. Whatever reason they have for inducing us to imagine these things,” and her face begins to sag, like a sugared confection succumbing to gravity, “it was a beautiful vision. And then it went away.”\nHe was trawling The Siege of Bianliang, following a Jin patrol that ventured forth with fire lances to harry the besiegers’ supply train. For weeks he had followed the design and construction of the gunpowder tubes, inhabiting each viewpoint in turn and annotating where he felt their desperate resolve had been given a tinge of the sentimental. (One sprout involved a terrible accident, a tube blowing up in an engineer’s face, and he followed it some ways before deciding that the tale was grim enough as it was, and it was in any event not implausible that those meticulous and frightened men could have assembled the tubes without a mishap.) The combat scenes troubled him, but he had trawled with deep interest through dozens of other threads over the years—the Mongol strategists’ deliberations, the ventures of brave and skittish scouts, the tearful farewells of young soldiers—and though he knew that the final quarter of the tale would be unremittingly dark, he could continue to avoid them only by surrendering to his apprehensions.\nKeeping up with its deepening texture could be difficult, especially when you had to deal with updates from trawlers on Mars and Titan, who were often even more distant than Earth. By the time these tendrils reached the Sea, hours had passed and those here had meanwhile added to them, and the task of integrating these disparate strands consumed vast amounts of energy. Energy demand, however, was no longer a limiting factor.\nThat evening he spoke with one of the Highlanders, a wakashu named Tian who had grown up on Nereid and spent most of zer adulthood higher still. Ze was part of the crew that had come down from the Heights together and would eventually succeed Qilin and his contemporaries. These young people (the young people everywhere) were trawling a different saga, one involving a voyage to Ouranos. It was complete fiction, and he failed to understand how fabricating an outright fantasy could engage adult minds.\n“It’s open-ended, and we get to create it,” ze said. “Everyone knows how the Siege of Bianliang and the Drowning of Bagerhat ended. But what will happen to the Sky Dragon? Several thousand trawlers will decide that, and if there are dozens of different answers, those with the most followers will be most fully articulated, like water finding the best paths to their tributaries—isn’t that how it worked on Earth?”\n“It’s like a fairy tale,” Qilin insisted, feeling vaguely that he was being unfair. “I mean, Ouranos? Ouranos has nothing!”\nZe smiled. “Oh, you never know. One tendril hints at the discovery that the inhabitants of Neptune’s interior reached and colonized Ouranos.”\nQilin shook his head. The violent world of the Jin Dynasty was more alien to him than an imaginary voyage by contemporaries to Neptune’s pale sibling, yet it was factual: the combination was compelling as no other saga managed to be. The Siege of Bianliang was the most complex work of art in human history, and the fact that God of the Sky was more deeply trawled, at least in the Sea, pained him in a way he suspected revealed something about him he did not like to acknowledge.\nTian’s colleague Houwang—they were all colleagues, he reminded himself—had joined him on a year-long project to enlarge the world’s interior living space. Galatea’s unstable tectonics demanded exceptional caution: drilling disturbed the play of forces holding it together, and extensive measurements (through thousands of sensors) had to be taken and immense recalculations made every fraction of a second. The engines Qilin summoned for this labor were powerful but tricky to manage efficiently, and his long experience made him the obvious candidate to train others.\n“Do you do this yourself because you don’t trust the Minds?” Houwang asked one afternoon.\n“Not at all,” he said, surprised. “They have their own projects.”\nHouwang chuckled. “If you asked them what those were, would they tell you?”\n“Oh, sure. Although their answers can be hard to understand.”\nHe wondered if Houwang had grown up on a satellite uninhabited by Minds, as several of the smaller ones were said to be. Some people thought them ubiquitous, and those worldlets seemingly without them merely infested by ones that hid their presence. Such beliefs could lead to abiding suspicions.\n“I hear,” Houwang said after a moment, “that they sometimes ask people to participate in a Figment.”\n“That’s true.”\n“I would be interested in hearing an account of that.”\n“Well, I can tell you.” Qilin was ready to take a break. “It’s an induced dream, subjectively quite real. They describe the process in advance, including its distressing elements.”\n“The dreams can be frightening?”\n“Mine wasn’t.” He assumed that Houwang knew he had undergone one. “Leaving it can be disorienting, especially if the experience was pleasant.”\n“Why do they do this?”\n“Well, you can ask. I mean literally: you, too, can ask.”\nHouwang smiled disbelievingly. “What will they say?”\n“They will tell you they are curious about the subjects’ responses.”\n“That’s helpful.”\n“They don’t seem to be investigating a specific issue. I think they find all aspects of human behavior equally interesting, along with everything else in the universe.”\nIt was a moment before Houwang spoke again. “Are the contents of these Figments too personal to ask about?”\n“Not at all. I imagined that Galatea had been recast into an enormous skyhook.” He described the Tsuribari in some detail, since most of the Figment had comprised a detailed appreciation of these features. “It was a jolt to awaken and realize that we had done none of these things.”\nHe had expected the young man to smile indulgently, but Houwang surprised him. “That’s pretty neat. Monumental engineering! A cable reaching from the surface to Neptune’s core would be shorter.”\nHe did not tell Houwang about the desolation he had felt on emerging.\nTwenty minutes later they were drifting through an access tube, on an inspection visit (not actually necessary to conduct in person) of a just-excavated chamber. The tube had been tunneled just an hour before; Qilin let his gloved hand trail along its perfectly smooth wall, though the heat had long since fled into frigid stone.\nIt was in the odd acoustics and near darkness that Houwang abruptly spoke. “Are there questions that the Minds will not answer?”\n“I don’t know.”\n“Have you ever heard of one refusing?”\n“No. But people with questions are usually better going to the Encyclopediae. The Minds possess vast amounts of data, and while talking to people occupies only a negligible fraction of their attention, they are not actually adept at it.”\n“But they don’t mind our talking to them?”\nQilin laughed. “‘Mind’? Don’t treat their reactions as human!”\nHe often reflected on what it must have been like to grow up in the Heights, the children of settlers who had fled troubles that now seemed inconceivable, growing up light-minutes from the Centaur or Triton in tiny, beleaguered communities. When the Minds finally revealed themselves, these young people grew up without them—“Or perhaps those in our midst never came forth,” as Tian perhaps jokingly said—and retained their wonder at the Beings that were present yet nowhere visible. Someday they would find everything else more interesting.\nGalatea was a tiny moon, a thousand times less massive than Triton, though a thousand times more massive than the Centaur, where most of its crew still lived. Someday a metropolis would inhabit this interior, the voids he was shaping vanished into a greater space that would constitute their sky. Thousands of cubic kilometers displaced, perhaps to be used in fabricating structures—castles in space—more outlandish than those now being imagined.\nThe entered an unfinished chamber, dozens of meters across, the vacancy that others would fill with decks and walls, the living spaces for the tiny world’s future residents. Galatea was far too massive to ever be set spinning, so its work crews experienced gravity only in the rotating chambers some needed to sleep. Children would grow up not in spaces like the Centaur’s but in those designed for the weightless: passageways that would open onto ceilings, rooms with floors lined with shelves and tapestries, which the suspended furniture never touched.\nQilin could illuminate the space with a word, but instead he took his hand torch and tossed it out into the darkness. It sailed away, spinning slowly, casting its beam wildly over the surface’s unbroken concavity.\nHouwang exhaled in a soft Ah. “I grew up on Kymopoleia, and we never opened a space this large.”\n“Someday this world will be transformed beyond recognition.” The thought provoked a pang, but he kept a note of pride in his voice. With a gesture he called back his torch.\nHouwang had kicked himself away from the wall and was drifting slowly into the great space. “Why this size,” he asked, “when you could make it larger? Since we will eventually want larger spaces.”\n“That’s easy,” Qilin said. “We lack the extra air.”\nHouwang laughed. “Of course! Stupid of me not to think of it—it’s a big issue back home.”\nQilin could easily imagine that it had been a problem on Kymopoleia, whose settlers had fled with nothing but the oxygen in their escape vehicles. It was a problem everywhere. However tight the seals and efficient the pumps, every time anyone opened an airlock they lost some whisp of vapor, trillions of molecules. Plundering Triton’s ices would not be allowed for decades, so difficult was it to explore its seas by noninvasive means. Someday the Centaurans’ millions of descendants would dredge oxygen from the depths of Neptune, but the population would have to survive until then on what air they had brought from Earthspace.\nReminded by this, Qilin said, “Let me show you something,” and extinguished his torch. He spoke a few words in the near darkness and watched as a disk of blue-green light appeared somewhere before them, like a skylight opened onto a distant sun.\n“The debris shaft?”\n“Yes. The excavated material moved through it and was stacked on the surface. It opens onto Nearside, as you can see, since the Tether will be constructed there.” They gazed silently on the azure glow of the dust motes twinkling in the air. Light from the Sun, reflecting off Neptune’s upper atmosphere, entering the tunnel to bounce off the dust and onto their retinas. It was a peculiar thought, and Qilin merely remarked, “Shifting the mass along that axis will increase orbital decay by some immeasurably small amount.”\n“I bet the Minds could measure it.”\n“They could certainly extrapolate its long-term effects. I suppose we could ask them.”\n“Can we believe what they tell us?” Houwang asked in a low voice.\nQilin wondered whether he thought the Minds could not hear them here. “They have no reason to deceive us.”\n“But if, for their own unaccountable reasons, they did, are they intelligent enough to hide the fact and deceive everyone?”\nAt this Qilin laughed. “Oh, absolutely.”\nXiezhi had reserved a bower for us, something I had been reluctant to do since the Highlanders had come. “We have been sleeping together since before these saplings were born,” he said, which is true but could be adduced as a reason to surrender the space.\n“And we will still be doing it when they are older than us,” he added, encircling me with his arms. He was replying to whatever objection he thought I might make, a habit that would be annoying in anyone else.\n“They are kind of cute,” I said, mostly to throw him off.\n“You worry that they will take our place,” he said. He knew me, of course, too well. “And they will.”\n“Then we will have to carve new places.” Such projects would keep my team busy for the next thirty years. “They can gain some experience while dreaming about designs for the Tether.”\n“Ah, the spinning tether.” He looked at me with an amused expression. “You don’t follow their chat, do you? They are deciding what to call it.”\n“‘They’?” I asked, at once defensive.\n“Oh, we will have a say, too. But it’s the first big project the kids will be involved in, and they are excited by it.”\n“So have they chosen already?”\n“They are still discussing, but they seem to come readily to agreement, unlike their squabbling elders.”\n“That will change,” I said darkly.\n“Oh, probably.” Xiezhi smiled, untroubled. “But meanwhile there is amicable concord, and when the time comes, they will propose naming it the Shaduf.”\n“Shaduf?” I took a moment to look up the word. “A nice image, I suppose. I guess I was imagining a visual parallel.”\n“There is general agreement,” he continued, “not to call it the Keloneion, though the term may be older, because they have tired of our preoccupation with the ancient Greeks.”\n“That was our parents’,” I protested.\nXiezhi laughed. “It’s important to you that they understand that distinction,” he said, undoing my belt. “And they don’t.”\nXiezhi knew how to distract me. I think he took pleasure in doing it after getting me fixed upon something, as a challenge.\n“I don’t think we were like that.”\nHe adopted a thoughtful expression. “If you want to unsettle them, have a child of your own.”\n“What an idea!” I paused. “Though honestly, I think I would be a good mother.”\n“Not a father?” He was drawing attention, less subtly than his usual, to my current status.\n“No, I would revert before conceiving.” I realized at once he was going to ask me why, and I didn’t have an answer. Perhaps it was because I had spent years with Bianliang and knew that mothers tend to be younger than fathers.\n“Well, then . . . ” he said, and for a second I knew he was about to say, Can I be the father? a line unworthy of him, but with a swift movement he slid my trousers off my legs and flung them away, a practiced maneuver I could never match. The familiar surge of excitement never failed to distract me, but Xiezhi always finished his thought. “You plan to someday call an end to these pleasures?”\nXiezhi believed that I enjoyed his caresses as a man more than I ever had as a woman, and I could not flatly say that he was wrong. Something to think about, though not right now.\nThe garment landed on the back of an ornate dressing table and immediately changed itself into a robe. I had set the space to a merchant’s bedroom in fifteenth-century Samarkand, whose opened windows looked upon the recently completed observatory. An astronomer’s study would be more interesting, but it was the homes of the great that tended to better preserved, or at least more easily recovered. The fabrics and veneers had all been identified from microscopic samples unearthed in the middle of the last century, when advanced technology could still be turned to such purposes. I didn’t know what Xiezhi was seeing, save that he had chosen not to share mine.\nMy garment had actually floated across the room; it would be years before we could spare the resources to impart spin to one of the bowers. Those who truly craved gravity in their erotic life were compelled to bargain with team members for private time in their shared sleeping chambers, an indignity I was glad to be spared.\nIf Xiezhi wished to simulate the force of one G, he would anchor himself with one arm and then press himself against me, or me against him. It worked fine, although he tended to make light of it. Perhaps he feared I would laugh at him.\n“The Highlanders wouldn’t know what to do with conjugal gravity,” he remarked sometime later. “They’d probably bump their heads.”\n“They’d rather be swinging tethers,” I replied. Wit was not required at a time like this.\nThen I thought to ask him: “Last week, when we were asked to experience a Figment, did you agree?”\n“Um,” he said. He tensed slightly, perhaps without realizing it. “I did not.”\nXiezhi was the oldest of us, and in some ways the most guarded about his privacy, though he had grown up aboard the Centaur like all our generation. I had told him of my Figment and he had seemed noncommittal, perhaps (I now guessed) out of evasiveness concerning his own.\n“I’ll tell you something,” he volunteered suddenly. “I was talking with one of these kids today, and he asked me whether we weren’t bothered living years on a rock that is ‘haunted,’ his term, by the Minds.”\n“They think the Minds are hovering over our shoulders, listening to us.” Save for those Figments, I had not thought about them for months.\n“Perhaps they were aghast to realize that some of the critters were living—” perhaps the wrong word, though I didn’t have a better—“among them on their tiny rocks, and they didn’t know it.”\n“They seemed worried that the Minds are going to do something,” I said.\n“Well, of course they’re going to do something,” Xiezhi replied irritably. Something had changed in his voice. “Do you think Entities of that nature will be content to simply observe, and occasionally carry out little experiments on our dreaming minds, for the rest of all time? The Shaduf may be our project, but they are more interested in it than we are—more interested than we can be. The great arm will swing down into the upper atmosphere and its thousands of sensors will taste the world itself, feel the vibrations that run through it, discover what mere observing cannot do.\n“And for what? Do you think they intend simply to ponder their findings?”\nI stared at him.\n“They are going to study Neptune for three thousand years and then they will take it apart, down to its very molecules, and use its constituent elements to construct whatever they want . . . unless they have meanwhile learned how to summon up matter out of the quantum foam, or visit other universes and busy themselves with that.\n“Three thousand years isn’t very long to them. It’s a hundred times longer than they have existed, and a minute to them is centuries to us, but three millennia is still no great interval of time when your life span may be longer than the stars’.”\nThey were working in the debris shaft, near the point along its length where the face of Neptune filled the opening. Qilin told Houwang to extinguish his suit’s running lights and did so for his own. Then he doused his torch and they hung for a moment bathed only in the dim effulgence overhead.\n“So far from the Sun,” Qilin observed. He had seen Jupiter on their slingshot approach decades past, bright with reflective light. The crew had imagined themselves profoundly deep in space, a fancy he refrained from sharing with the youth.\n“But enormous,” replied Houwang, whose parents (Qilin remembered) had fled to tiny satellites absurdly far from their primary.\n“You will someday trail your fingers through its current,” he said lightly.\n“We will build cities that bob upon its waves, where you will enjoy genuine gravity once more!”\nAt this Qilin could only laugh. “In a few centuries? Well, perhaps we will both live that long.”\nQilin activated his torch and played its beam along the tunnel wall. He pointed out the structures running about them: the joints that allowed the shaft to flex should excavations stress the disordered moonlet; the seals and casings surrounding the hatch. Houwang knew all this, but seeing it as one floated in vacuum, bathed in the beams of what sunlight Neptune reflects, created an immediacy that no simulation could match.\nWhen Houwang spoke, his voice carried the diffidence of one embarrassed to be returning to a subject. “I remain surprised that you—” Qilin could plainly hear you old people—“remain untroubled about the Minds operating among us.”\nQilin smiled. “Well, we grew up knowing we weren’t being told everything.”\n“That’s my point! Your elders lied to you.”\n“They may only have suspected it. And the Minds may have evolved—or finished evolving—during the voyage, unhindered by Earthly constraints.”\n“But you don’t know.”\n“History may someday tell us what the Council members knew. Or you could ask them.”\n“But—”\nThe alarm tone shrilled in one ear as a voice in the other cried, “Warn—” and everything struck him at once. The concussion knocked every thought out of his head, though an instant later a blow to his knee brought pain shearing through his consciousness.\nThey struck hard against the side of the shaft, though not enough to slow the force propelling them outward. Qilian’s visor was immediately frosted over, and the glove he instinctively raised knocked away. And suddenly there was no wall; his limbs waved helplessly as Houwang’s body bounced against him.\nPain was sending alarms from all the provinces of his body, but urgency drove it away. Within seconds his visor had cleared, though only to disclose the vista he knew to expect. They were tumbling slowly through space, Neptune’s enormous disk rising and falling every several seconds like the frenzied passage of days.\n“Houwang, are you all right?” A groan was abruptly cut off as the young man pulled his helmet away from Qilin’s. All right, no radio. Qilin did not trouble to check for suit integrity, his or the boy’s. Low-albedo Galatea was visible only as a field of darkness, but that was enough.\n“Don’t move, Houwang; hold still. I know what to do.” And before the Highlander could ponder this, Qilin held the unresisting body at arm’s length and raised his boots. The slowness of their shared rotation made calculation possible, which was good, for proper timing was essential. Clarity sharpened to a crystalline edge, with pain rising just behind it. Qilian paused, placed his soles against Houwang’s chest, and kicked hard.\nUnmoving, the suited figure receded, still tumbling against the dark plains of Galatea. Sudden anguish in Qilin’s leg, which immediately began to fade: the suit’s diagnostics had administered an anesthetic.\nNeptune wheeled past, no larger than before, but Qilin was undeceived: whatever force he had imparted to Houwang had redoubled upon him. He was falling toward the planet with greater velocity than came from the blast that blew them out the tunnel.\nQilin spent long seconds trying to calculate the chances for rescue. For Houwang, yes: The Highlander was moving toward Galatea, if slowly. A rescue pod would reach him first, decelerating to do so. By the time the boy was stabilized, however, Qilin would be too far, and accelerating.\nThe Highlanders had made him feel old, but now he felt keenly the century—or more!—he would not get to live. True, the youth had more years before him, so the move made sense. The consolation, he thought, of arithmetic.\nThat was well done, something said.\nBelief in one’s senses is slow to fade, but he waited a second before responding. “Who are you?”\nA passenger, unintended of course. Flung loose by the same accident that cast you here.\n“What is your name?”\nI don’t have one, at least not yet. As you probably know, our physical substance is unevenly distributed through normal space, and the I that now am was merely part of a Being that must now regrow missing substance. You may call me Donti Drakou.\nQilin pondered this.“So I will not die alone.”\nHouwang will not die at all. You retain your fast reflexes, doubtless a product of growing up in the spun-gravity field of the Centaur, where a fragile object would dash itself to pieces on the floor the second you let go of it.\nEbbing adrenaline darkened quickly. “You seem very wise,” he muttered.\nHow could that be? I am less than two minutes old, though I have experienced consciousness for a subjective period that exceeds your lifetime. But I am observant.\n“We will soon observe something remarkable. Or at least you will; I have not checked my suit’s viability.”\nYour suit has been badly damaged. There are severe limits to what I can do.\nLife, Qilin thought, had never felt sweeter. The years’ vain travail dropped away like chains and he looked about in wonder. Bathed in light—a vast amount, though faint—he marveled at the exquisite sharpness of existence, its richness and brevity.\nWhat a realization, an endless blossoming, to experience, even in the minutes—seconds?—remaining to him.\nSorry about this, said the Mind suddenly.\n“Wha—” Qilin began to say. And then everything crumpled.\nDead?\nNot dead. Maybe dead.\nNo thought. No pain.\nSo dead?\nFading thoughts of dying brain. Itself a thought.\nAwareness only. Cooling.\nSilence.\n“ . . . Back?” someone was saying.\nA face swam slowly into focus, a familiar one. Qilin knew it was familiar before he could identify its owner.\n“I hope you remember this time,” Long said. “I have said it all thrice before.”\n“I’ll remember.” The words emerged as a croak. Qilin hoped (a bubble of clarity in the murk of his thoughts) that he hadn’t already given that assurance.\n“Very well. The kid is safe. You will heal, mostly. Nobody else was injured in that blowout—emergency hatches slid shut within a second, but you two were already flying out the shaft like buckshot. Were there shotguns at Bianliang?—Never mind. You can have more details when I know you will remain conscious.”\n“The others?” Qilin asked after a moment.\n“You mean us? Everyone is fine. Pixiu has been crying; Fenghuang is too busy to come; Bixi is annoyed with you, I’m not sure why. Xiezhi sits with you when I’m asleep.” Long ventured a smile. “You need to get better and return soon; we can’t spin up to full gravity with you gone—it throws the balance off.”\nThere was a joke about admitting a new sixth to fill his slot, but it wouldn’t take form. “Just tell me . . . ” Qilin sought to frame his question, but could not find the syntax. “How.”\nLong nodded, understanding. “Your suit cannibalized itself for propellant. Damnedest thing; didn’t know they were that smart. Took every scrap of matter not required to keep you alive and thrust it away with all the force it could generate. Used so much of the suit’s power that you nearly froze.”\nArithmetic remained simple. “I am surprised there was enough,” he said carefully.\n“Well,” Long looked suddenly uncomfortable, “there was a lot of delta-V to overcome. And, yes, not much superfluous hardware in those suits. So pretty quickly it had to start in on you.”\nQilin just looked at him.\n“Well, you don’t need your feet to stay alive. And it was that or die.” This was plainly a part he hadn’t told before. “First your legs, but eventually . . . ” He shrugged. “So long as the brain remained mostly intact, you were fine.”\nQilin had no response to make. How disturbing would I find this, he thought, were I not sedated?\nFinally he said, “How . . . long?”\n“How long since the accident? Quite a while, I’m afraid. There was a lot to regrow. The Shaduf is already being designed. Oh, do you mean how long until you are released? I don’t know. How lucid do you feel?”\nQilin closed his eyes, and when he opened them, he was alone.\nMostly he dreamed, though sometimes he knew he was dreaming, which made it (of course) something else. Sometimes he dreamed of being back with his sixths, or with earlier friends or lovers. Once he found himself limping among the burning villages outside the walls of Bianliang, blood on his sword, smoke and cinders blowing in his face.\nSometimes he imagined that Donti Drakou—oddly, he remembered the name—had restored his youth, rather than simply repurposing most of his body mass. A bit more rationally, he imagined a visit from the Mind, now older than him, and being told that he would soon be graduated from the hospitalers’ care, as one newly embarked on man’s estate. He imagined that the radical reconstruction he had needed would increase his life expectancy, though he suspected the reverse was true.\nSometimes he dreamed of Tsuribari, the cable reaching into the depths, the greatest structure never built. Galatea, the detritus of cosmogony, transformed by design: the highway to the Planet of Storms. How much of his own substance was now falling toward that world?\nAnd when those now circling Neptune finally descend through its clouds into yet stranger realms, will Qilin, his sixths, his children, Minds, and Beings in forms beyond those now suspected, discover there those forces and compounds their simulations had predicted?\nOr will its mysteries surpass the compass of otherworldly psyches, however grown beyond their earthly molds?\nGregory Feeley writes science fiction and about science fiction. His first novel, The Oxygen Barons, was nominated for the Philip K. Dick Award and. His stories have been finalists for the Nebula Award and his essays and reviews have appeared in a variety of publications, including The Atlantic Monthly, the New York Times Magazine, the Washington Post Book World, and USA Today. Feeley's most recent novel is Kentauros and he recently completed a long novel, Hamlet the Magician. His previous Clarkesworld story, \"Cloud-Born\" will be reprinted in two \"year's best\" anthologies this year.", "source": "https://clarkesworldmagazine.com/feeley_09_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: In a Net I Seek to Hold the Wind by Gregory Feeley"}