{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Julie Nováková", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "SpJLI1OlY/D692J5aICSay36ozI=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  “We'll Know It When We See It”: The Trouble with Finding (Alien) Life  Last month, NASA’s Perseverance rover successfully landed on Mars to investigate current and past conditions on the Red Planet and search for life. With it, an old but still burning question inevitably arises: when—if—we find alien life somewhere, are we going to recognize it?  The question is far less trivial than it sounds. The odds are we won’t encounter a technological civilization or travel beyond our solar system anytime soon. There are tantalizing environments in our own backyard: Mars, which had liquid water long ago and still has large amounts of water ice with potential lakes underneath its polar ice caps, and possibly hydrothermal systems under ground; Venus, whose past remains mysterious to us and which may have possessed water oceans once, too; moons such as Europa or Enceladus, with vast amounts of liquid water hidden underneath their icy shells; Titan’s exotic methane-ethane seas . . .  But we can hardly expect any of them to teem with macroscopic life we could notice at first sight. The first alien life we encounter might take the form of a microbial plaque, an extremophile living in conditions that we’d never have guessed before, or tiny, long-dead fossilized remains. Are we going to spot it—even if we’re as lucky as to find it, not just an uncertain chemical sign of its presence?  To answer this question, we need to take a journey to Earth’s deep prehistory, earlier attempts to discover alien lifeforms, and finally to current space exploration.  Digging the Red Planet  Mars has always drawn our attention and imagination. From early observations of (actually nonexistent) vast crisscrossing channels that spurred the fantastical visions of H. G. Wells, to today’s images of fossilized riverbeds, a probable coastline of a long-gone ocean, and chemical evidence of water-altered rock, the Red Planet remains one of the promising targets of search for alien life. However, should it have ever arisen there and survived up to this day, it must almost certainly be surviving in a handful of nearly isolated clement environments.  Mars is likely still geologically active to some extent, and if there are places warmed by its inner heat not far beneath the surface, they may contain liquid water, energy, and chemistry needed for life. The surface itself, however, doesn’t look promising. Mars likely had a much thicker atmosphere once, but lost it to the solar wind due to the planet’s small size and cessation of its protective magnetic field. Nowadays the atmosphere is so thin that liquid water couldn’t exist on the surface (perhaps save for a few lowest-lying places, such as the bottom of the large impact site Hellas Basin), unless saturated by salts—which wouldn’t make it very appealing for life—and even then, not for very long, until it inevitably evaporated. All life as we know it—though not necessarily all life in the universe—requires liquid water, so we’ll have to dig deeper.  Unfortunately, that’s what Perseverance can’t do. Its drill is a few inches long, so it can only probe the surface layers where water can’t be expected to stably exist and which are penetrated by radiation from space—remember, we’re not protected by a magnetic field and a thick atmosphere there—and subject to great temperature swings. Radiation and erosion would also destroy any complex chemistry rather quickly, so chances of finding either direct or indirect evidence of extant life so near the surface are rather sparse. But fear not—while the rover is not perfectly equipped to search for current life (a quite demanding task), it could discover traces of extinct aliens.  Don’t imagine fossilized bones, though. Almost certainly, the life in question would have been microbial, and to grasp the undertaking of detecting it, we must return to our home planet.  The earliest Earth wouldn’t have been a very temperate place to live in, but gradually, the young planet cooled, and plate tectonics, continents, and oceans might have already been here before four billion years ago (Ga). It remained a wild place, though, with frequent impacts in the still unsettled system, and the Late Heavy Bombardment (whether a unique event or a tail of a longer bombardment period) wreaked havoc as late as 3.8 Ga. When could life have appeared, then?  It is generally agreed that at approx. 3.5 Ga, life existed and flourished on our planet. However, the earliest suspected signs of life date back to nearly 4 Ga. Some of the oldest rocks on our rapidly changing planet contain what appears to be fossilized stromatolites—layered microbial mats typical for warm shallow seawater. There’s a problem, though: physical and chemical processes independent of life can produce structures that are trickingly similar to suspected microbial fossils. We need more to be reasonably sure.  We can turn to carbon and other elements needed by life and their isotopes—forms that differ by the number of neutrons in their core, and thus their atomic weight. Carbon has two widely present, stable isotopes: lighter 12C and heavier 13C. Life is known to “prefer” the lighter isotope—our enzymes, the molecular machinery of the cell, can be picky as to the structure and weight of the compounds they’re working with. Isotopes of sulfur, iron, and nitrogen are indicative of potential presence of life as well. However, the ratios can be skewed by some abiotic mechanisms as well. Microfossils together with isotopic shifts toward what life prefers and signs of physical and chemical conditions clement for life present the best evidence to claim “Life!” but even then, we cannot be absolutely certain.  What about Mars, then? Perseverance is equipped with instruments to find traces of even long-gone life and conditions for it: Cameras to determine local mineralogy and find potential microfossils, environmental sensors, radar for exploring the subsurface geology, and spectrometers able to analyze the local chemistry in fine detail. We need all this, since remnants of life’s products and building blocks such as nucleic acids, proteins, sugars, or lipids are not untouched by the passage of time, and some perish on scales shorter than human lifetimes. In old or altered samples, we can find “complex organics,” mixtures of long and complex carbon chains and cycles that might, or might not, have been of biological origin. To assess that, we must understand the complete environment they’re found in.  Is that a good way of searching for life, you’re asking? Shouldn’t we take a more direct approach?  We had, in fact.  The Viking legacy  Perseverance is not the first mission to search for life on the Red Planet, and not the last either. The Viking landers in the 1970s had been the first, and up until now the last, primarily astrobiological space mission. On board, they contained several ingenious experiments aimed at detecting signs of alien metabolism and life-sustaining chemical reactions.  The landers scooped regolith from the surface and just underneath. In the first experiment, the samples were heated and ran through a gas chromatograph and mass spectrometer, instruments designed to separate molecules by their weight and measure them to assess their size, and potentially, complexity and composition. The results didn’t yield any substantial amounts of organic matter.  In gas exchange, inert atmosphere was pumped to the sample, and nutrients and water added. The goal was to measure whether or not any gases produced by life processing the nutrients would be released. Some gases evolved, but they did so in the negative controls with sterilized soil, consistent with abiotic chemistry.  Pyrolitic release added an atmosphere of radioactively tagged carbon dioxide and monoxide, liquid water, and light. If photosynthesis occurred, the radioactive carbon isotope 14C should have been incorporated into more complex compounds, like when plants on Earth produce sugars in photosynthesis. After a few days, the samples were heated and measured: no such complex organics were found.  Finally, labeled release (LR) introduced nutrients, also radioactively tagged with 14C and inert atmosphere. Would carbon dioxide containing 14C be released as a waste product of metabolizing the nutrients?  It was. On both landers.  In addition, both negative controls containing sterilized samples from Earth came out negative, as they should.  The LR results puzzled scientists. They indicated life, while the rest of the experiments spoke against it. Only decades later, when the Phoenix probe landed on Mars and analyzed its regolith chemistry in more detail, was the mystery likely resolved. Phoenix found perchlorates: Chemically aggressive, reactive salts that quickly destroy any complex organics when heated. They could have caused a false positive in LR, decomposing the nutrients and releasing carbon dioxide. They could also have caused a false negative in the chromatograph/spectrometer readings in the basic experiment and pyrolitic release. In short, we don’t know whether the Viking samples contained life. More likely they didn’t, but we cannot say that with anything near certainty.  The experiments would have been great, had the Martian environment been more Earthlike. Unfortunately, when they were launched, we knew too little about the surface of Mars.  Another important drawback is that, while they were ingeniously designed to detect several types of metabolisms we are familiar with, they likely wouldn’t be able to find anything more exotic. Imagine life using a mixture of water and hydrogen peroxide as a solvent. That has been considered for Mars; while hydrogen peroxide is chemically aggressive under “normal” temperatures, it wouldn’t destroy life-bearing chemicals in the Martian cold very fast, and its great advantages are that it’s hygroscopic (“attracts” water) and acts as an antifreeze. Seemingly ideal for life in a very dry and cold environment. But once you heat such life in an experiment, you destroy it.  We could also consider more exotic lifeforms, using completely different solvents or building blocks. While unlikely on the quite Earthlike Mars, the argument stands: With Vikings and similar probes, despite certain advantages of their direct approach, we almost certainly wouldn’t be able to spot it. The more generalist approach of current rovers has greater chances of discovering something we don’t know we should be looking for at all.  European Space Agency’s rover Rosalind Franklin is a part of an ESA/Roscosmos ExoMars mission, slated to launch in late September next year and land on Mars in spring 2023. Its instrument payload is similar to Perseverance, but it has one great advantage: an ingeniously designed foldable drill that can reach depths up to two meters beneath the surface, already protected from most radiation, temperature swings, erosion . . . If we were extremely lucky and it found, for instance, a hydrothermal system, it would have a good chance of finding present life on Mars, if it exists there.  What is life?  Whether we’ll keep searching for life in Martian regolith, Venusian clouds, or subsurface oceans of icy moons and dwarf planets, we’ll need to define what we’re trying to find.  At first, it might seem like a ridiculous question to ask what is life. We just know it when we see it, right? But at the second glance, it’s more complicated. Consider viruses. Are they alive? On their own, they are incapable of metabolic exchange and reproduction, which are considered to be key features of life. Without metabolism, how can anything actively live in its environment? Without reproduction, how could we have biological evolution? On the other hand, once they enter a cell that can “lend” them its molecular machinery, they can metabolize and reproduce through it. Most biologists, myself included, would argue that viruses are alive and definitely have their (very important) place on the “tree of life.”  Some lifeforms can enter an inactive state in which they can survive environmental stress—bacterial spores or tardigrades in anabiosis can withstand extreme radiation, temperatures both very high and low, desiccation, many chemical extremes . . . They don’t seem alive, yet when we place them in a clement environment with liquid water, they can “come alive.” Would we notice alien life in such inactive forms? It certainly wouldn’t come up in metabolism-centered experiments, unless we provided exactly the right conditions to “revive” it. Detecting its complex chemistry and life-resemblant shape in microscopic images may be our only chance to notice it—provided that they are similar enough to what we’d expect to find.  Complete inactivity is not even necessary to make life detection harder. Extremely slow life would be difficult enough to spot. Deep in Earth’s crust, there are communities of microbes that reproduce once in tens of thousands of years. They live on tiny droplets of water in rock and poor chemical gradients. They are deep enough and scarce enough that on another planet, where we are not at home, we most likely wouldn’t even get near them.  Of course, there is the notorious question of whether life on an entire planet could be isolated in a few balmy spots, or whether it would inevitably leave its traces on the whole world. Some biologists and chemists, such as author of the Gaia hypothesis, James Lovelock, thought that a biosphere must necessarily transform its whole world, and argued that Mars has no life, since we can’t see any interesting chemical disequilibria in its atmosphere. On the other hand, methane has been detected on Mars independently several times, and it seems that its amount varies by season—but it can be tied to life-devoid processes.  That brings us to phosphine on Venus. If it is really present there—several studies cast doubt on that since the original study came out—it could be explained by life, but also by our lack of sufficiently deep knowledge of processes in Venusian mantle, crust, and atmosphere. On Venus, at least, it’s not hard to go and test directly whether phosphine really exists there in the claimed concentration, and what probably makes it. For planets orbiting other suns, looking at the spectra of light passing through their atmospheres will long remain the principal or only method of finding out whether they host life. That, too, is looking for signs of metabolism in a way: photosynthesizing life on Earth releases oxygen, which is in disequilibrium with other atmospheric components (many of them also produced mostly by life, such as methane).  Life can be defined by many traits, each with its own drawbacks: metabolism; the ability to undergo biological evolution; being in temporary thermodynamic disequilibrium; high complexity and organization at the same time . . . We already got to the pros and cons of looking for metabolism. Biological evolution is trickier—many non-living systems undergo changes that are often “heritable” to their “offspring” (such as crystals and faults within them), and many are sorted based on their stability (unstable configurations simply don’t persist), which resembles natural selection at a brief glance. For biological evolution to occur, we need relatively, but not perfectly, reliable information storage mediums (DNA or for some viruses RNA, in case of Earth), change, and heredity. We can well-conduct experiments with fast-reproducing microbes in Petri dishes and see how populations cultivated in different conditions begin to grow apart. But for looking for life, it doesn’t seem most fortunate—it rests upon too many assumptions, such as the speed of the process. We could look for the building blocks that support it—and with them, we move toward complexity and organization, to finding complex molecules and patterns. Finally, thermodynamics is favored, especially by physicists, as a way to understand life’s origin, but probably wouldn’t be easily utilized in search for life.  There is no single absolute definition of life, and no single surefire way of looking for it. We cannot be certain that if we go somewhere, we’ll recognize it. In places where we can expect life relatively similar to Earth’s, such as Mars, the chances are good enough, though things like spores, “slow life,” or slightly altered life’s chemistry can complicate it. But is carbon-based life in watery environments the only way? If we stumbled upon extremely slow and fragile silicon-based life in pressurized lakes of liquid nitrogen, would we be able to spot it at all?  While life may seem like something “we’ll tell if we see it,” it’s not as trivial as that. And, in the far future, we might be asking ourselves a different but equally pressing question: Would we recognize intelligence and sentience if we saw it? There, we cannot rely on chemistry and planetary science, and perhaps that’s why—apart from the want of “finding ourselves out there”—it is a rich domain of science fiction, with books such as Peter Watts’ Blindsight or David Brin’s Existence (and many others) offering potential answers to this question.  Finding life is not so easy, and nor is learning more about it. But we are fortunate to live in a time when we are well and truly embarking on this exciting journey of discovery.  For more about looking for life as we don’t know it, the deep biosphere, paths toward complexity, or exploring the subsurface of Mars and Europa, you can watch online seminars of the European Astrobiology Institute. (www.youtube.com/channel/UCZjpLapCNVXNs1DNqJMhPJQ) Julie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council.", "text": "Non-Fiction\n“We'll Know It When We See It”: The Trouble with Finding (Alien) Life\nLast month, NASA’s Perseverance rover successfully landed on Mars to investigate current and past conditions on the Red Planet and search for life. With it, an old but still burning question inevitably arises: when—if—we find alien life somewhere, are we going to recognize it?\nThe question is far less trivial than it sounds. The odds are we won’t encounter a technological civilization or travel beyond our solar system anytime soon. There are tantalizing environments in our own backyard: Mars, which had liquid water long ago and still has large amounts of water ice with potential lakes underneath its polar ice caps, and possibly hydrothermal systems under ground; Venus, whose past remains mysterious to us and which may have possessed water oceans once, too; moons such as Europa or Enceladus, with vast amounts of liquid water hidden underneath their icy shells; Titan’s exotic methane-ethane seas . . .\nBut we can hardly expect any of them to teem with macroscopic life we could notice at first sight. The first alien life we encounter might take the form of a microbial plaque, an extremophile living in conditions that we’d never have guessed before, or tiny, long-dead fossilized remains. Are we going to spot it—even if we’re as lucky as to find it, not just an uncertain chemical sign of its presence?\nTo answer this question, we need to take a journey to Earth’s deep prehistory, earlier attempts to discover alien lifeforms, and finally to current space exploration.\nDigging the Red Planet\nMars has always drawn our attention and imagination. From early observations of (actually nonexistent) vast crisscrossing channels that spurred the fantastical visions of H. G. Wells, to today’s images of fossilized riverbeds, a probable coastline of a long-gone ocean, and chemical evidence of water-altered rock, the Red Planet remains one of the promising targets of search for alien life. However, should it have ever arisen there and survived up to this day, it must almost certainly be surviving in a handful of nearly isolated clement environments.\nMars is likely still geologically active to some extent, and if there are places warmed by its inner heat not far beneath the surface, they may contain liquid water, energy, and chemistry needed for life. The surface itself, however, doesn’t look promising. Mars likely had a much thicker atmosphere once, but lost it to the solar wind due to the planet’s small size and cessation of its protective magnetic field. Nowadays the atmosphere is so thin that liquid water couldn’t exist on the surface (perhaps save for a few lowest-lying places, such as the bottom of the large impact site Hellas Basin), unless saturated by salts—which wouldn’t make it very appealing for life—and even then, not for very long, until it inevitably evaporated. All life as we know it—though not necessarily all life in the universe—requires liquid water, so we’ll have to dig deeper.\nUnfortunately, that’s what Perseverance can’t do. Its drill is a few inches long, so it can only probe the surface layers where water can’t be expected to stably exist and which are penetrated by radiation from space—remember, we’re not protected by a magnetic field and a thick atmosphere there—and subject to great temperature swings. Radiation and erosion would also destroy any complex chemistry rather quickly, so chances of finding either direct or indirect evidence of extant life so near the surface are rather sparse. But fear not—while the rover is not perfectly equipped to search for current life (a quite demanding task), it could discover traces of extinct aliens.\nDon’t imagine fossilized bones, though. Almost certainly, the life in question would have been microbial, and to grasp the undertaking of detecting it, we must return to our home planet.\nThe earliest Earth wouldn’t have been a very temperate place to live in, but gradually, the young planet cooled, and plate tectonics, continents, and oceans might have already been here before four billion years ago (Ga). It remained a wild place, though, with frequent impacts in the still unsettled system, and the Late Heavy Bombardment (whether a unique event or a tail of a longer bombardment period) wreaked havoc as late as 3.8 Ga. When could life have appeared, then?\nIt is generally agreed that at approx. 3.5 Ga, life existed and flourished on our planet. However, the earliest suspected signs of life date back to nearly 4 Ga. Some of the oldest rocks on our rapidly changing planet contain what appears to be fossilized stromatolites—layered microbial mats typical for warm shallow seawater. There’s a problem, though: physical and chemical processes independent of life can produce structures that are trickingly similar to suspected microbial fossils. We need more to be reasonably sure.\nWe can turn to carbon and other elements needed by life and their isotopes—forms that differ by the number of neutrons in their core, and thus their atomic weight. Carbon has two widely present, stable isotopes: lighter 12C and heavier 13C. Life is known to “prefer” the lighter isotope—our enzymes, the molecular machinery of the cell, can be picky as to the structure and weight of the compounds they’re working with. Isotopes of sulfur, iron, and nitrogen are indicative of potential presence of life as well. However, the ratios can be skewed by some abiotic mechanisms as well. Microfossils together with isotopic shifts toward what life prefers and signs of physical and chemical conditions clement for life present the best evidence to claim “Life!” but even then, we cannot be absolutely certain.\nWhat about Mars, then? Perseverance is equipped with instruments to find traces of even long-gone life and conditions for it: Cameras to determine local mineralogy and find potential microfossils, environmental sensors, radar for exploring the subsurface geology, and spectrometers able to analyze the local chemistry in fine detail. We need all this, since remnants of life’s products and building blocks such as nucleic acids, proteins, sugars, or lipids are not untouched by the passage of time, and some perish on scales shorter than human lifetimes. In old or altered samples, we can find “complex organics,” mixtures of long and complex carbon chains and cycles that might, or might not, have been of biological origin. To assess that, we must understand the complete environment they’re found in.\nIs that a good way of searching for life, you’re asking? Shouldn’t we take a more direct approach?\nWe had, in fact.\nThe Viking legacy\nPerseverance is not the first mission to search for life on the Red Planet, and not the last either. The Viking landers in the 1970s had been the first, and up until now the last, primarily astrobiological space mission. On board, they contained several ingenious experiments aimed at detecting signs of alien metabolism and life-sustaining chemical reactions.\nThe landers scooped regolith from the surface and just underneath. In the first experiment, the samples were heated and ran through a gas chromatograph and mass spectrometer, instruments designed to separate molecules by their weight and measure them to assess their size, and potentially, complexity and composition. The results didn’t yield any substantial amounts of organic matter.\nIn gas exchange, inert atmosphere was pumped to the sample, and nutrients and water added. The goal was to measure whether or not any gases produced by life processing the nutrients would be released. Some gases evolved, but they did so in the negative controls with sterilized soil, consistent with abiotic chemistry.\nPyrolitic release added an atmosphere of radioactively tagged carbon dioxide and monoxide, liquid water, and light. If photosynthesis occurred, the radioactive carbon isotope 14C should have been incorporated into more complex compounds, like when plants on Earth produce sugars in photosynthesis. After a few days, the samples were heated and measured: no such complex organics were found.\nFinally, labeled release (LR) introduced nutrients, also radioactively tagged with 14C and inert atmosphere. Would carbon dioxide containing 14C be released as a waste product of metabolizing the nutrients?\nIt was. On both landers.\nIn addition, both negative controls containing sterilized samples from Earth came out negative, as they should.\nThe LR results puzzled scientists. They indicated life, while the rest of the experiments spoke against it. Only decades later, when the Phoenix probe landed on Mars and analyzed its regolith chemistry in more detail, was the mystery likely resolved. Phoenix found perchlorates: Chemically aggressive, reactive salts that quickly destroy any complex organics when heated. They could have caused a false positive in LR, decomposing the nutrients and releasing carbon dioxide. They could also have caused a false negative in the chromatograph/spectrometer readings in the basic experiment and pyrolitic release. In short, we don’t know whether the Viking samples contained life. More likely they didn’t, but we cannot say that with anything near certainty.\nThe experiments would have been great, had the Martian environment been more Earthlike. Unfortunately, when they were launched, we knew too little about the surface of Mars.\nAnother important drawback is that, while they were ingeniously designed to detect several types of metabolisms we are familiar with, they likely wouldn’t be able to find anything more exotic. Imagine life using a mixture of water and hydrogen peroxide as a solvent. That has been considered for Mars; while hydrogen peroxide is chemically aggressive under “normal” temperatures, it wouldn’t destroy life-bearing chemicals in the Martian cold very fast, and its great advantages are that it’s hygroscopic (“attracts” water) and acts as an antifreeze. Seemingly ideal for life in a very dry and cold environment. But once you heat such life in an experiment, you destroy it.\nWe could also consider more exotic lifeforms, using completely different solvents or building blocks. While unlikely on the quite Earthlike Mars, the argument stands: With Vikings and similar probes, despite certain advantages of their direct approach, we almost certainly wouldn’t be able to spot it. The more generalist approach of current rovers has greater chances of discovering something we don’t know we should be looking for at all.\nEuropean Space Agency’s rover Rosalind Franklin is a part of an ESA/Roscosmos ExoMars mission, slated to launch in late September next year and land on Mars in spring 2023. Its instrument payload is similar to Perseverance, but it has one great advantage: an ingeniously designed foldable drill that can reach depths up to two meters beneath the surface, already protected from most radiation, temperature swings, erosion . . . If we were extremely lucky and it found, for instance, a hydrothermal system, it would have a good chance of finding present life on Mars, if it exists there.\nWhat is life?\nWhether we’ll keep searching for life in Martian regolith, Venusian clouds, or subsurface oceans of icy moons and dwarf planets, we’ll need to define what we’re trying to find.\nAt first, it might seem like a ridiculous question to ask what is life. We just know it when we see it, right? But at the second glance, it’s more complicated. Consider viruses. Are they alive? On their own, they are incapable of metabolic exchange and reproduction, which are considered to be key features of life. Without metabolism, how can anything actively live in its environment? Without reproduction, how could we have biological evolution? On the other hand, once they enter a cell that can “lend” them its molecular machinery, they can metabolize and reproduce through it. Most biologists, myself included, would argue that viruses are alive and definitely have their (very important) place on the “tree of life.”\nSome lifeforms can enter an inactive state in which they can survive environmental stress—bacterial spores or tardigrades in anabiosis can withstand extreme radiation, temperatures both very high and low, desiccation, many chemical extremes . . . They don’t seem alive, yet when we place them in a clement environment with liquid water, they can “come alive.” Would we notice alien life in such inactive forms? It certainly wouldn’t come up in metabolism-centered experiments, unless we provided exactly the right conditions to “revive” it. Detecting its complex chemistry and life-resemblant shape in microscopic images may be our only chance to notice it—provided that they are similar enough to what we’d expect to find.\nComplete inactivity is not even necessary to make life detection harder. Extremely slow life would be difficult enough to spot. Deep in Earth’s crust, there are communities of microbes that reproduce once in tens of thousands of years. They live on tiny droplets of water in rock and poor chemical gradients. They are deep enough and scarce enough that on another planet, where we are not at home, we most likely wouldn’t even get near them.\nOf course, there is the notorious question of whether life on an entire planet could be isolated in a few balmy spots, or whether it would inevitably leave its traces on the whole world. Some biologists and chemists, such as author of the Gaia hypothesis, James Lovelock, thought that a biosphere must necessarily transform its whole world, and argued that Mars has no life, since we can’t see any interesting chemical disequilibria in its atmosphere. On the other hand, methane has been detected on Mars independently several times, and it seems that its amount varies by season—but it can be tied to life-devoid processes.\nThat brings us to phosphine on Venus. If it is really present there—several studies cast doubt on that since the original study came out—it could be explained by life, but also by our lack of sufficiently deep knowledge of processes in Venusian mantle, crust, and atmosphere. On Venus, at least, it’s not hard to go and test directly whether phosphine really exists there in the claimed concentration, and what probably makes it. For planets orbiting other suns, looking at the spectra of light passing through their atmospheres will long remain the principal or only method of finding out whether they host life. That, too, is looking for signs of metabolism in a way: photosynthesizing life on Earth releases oxygen, which is in disequilibrium with other atmospheric components (many of them also produced mostly by life, such as methane).\nLife can be defined by many traits, each with its own drawbacks: metabolism; the ability to undergo biological evolution; being in temporary thermodynamic disequilibrium; high complexity and organization at the same time . . . We already got to the pros and cons of looking for metabolism. Biological evolution is trickier—many non-living systems undergo changes that are often “heritable” to their “offspring” (such as crystals and faults within them), and many are sorted based on their stability (unstable configurations simply don’t persist), which resembles natural selection at a brief glance. For biological evolution to occur, we need relatively, but not perfectly, reliable information storage mediums (DNA or for some viruses RNA, in case of Earth), change, and heredity. We can well-conduct experiments with fast-reproducing microbes in Petri dishes and see how populations cultivated in different conditions begin to grow apart. But for looking for life, it doesn’t seem most fortunate—it rests upon too many assumptions, such as the speed of the process. We could look for the building blocks that support it—and with them, we move toward complexity and organization, to finding complex molecules and patterns. Finally, thermodynamics is favored, especially by physicists, as a way to understand life’s origin, but probably wouldn’t be easily utilized in search for life.\nThere is no single absolute definition of life, and no single surefire way of looking for it. We cannot be certain that if we go somewhere, we’ll recognize it. In places where we can expect life relatively similar to Earth’s, such as Mars, the chances are good enough, though things like spores, “slow life,” or slightly altered life’s chemistry can complicate it. But is carbon-based life in watery environments the only way? If we stumbled upon extremely slow and fragile silicon-based life in pressurized lakes of liquid nitrogen, would we be able to spot it at all?\nWhile life may seem like something “we’ll tell if we see it,” it’s not as trivial as that. And, in the far future, we might be asking ourselves a different but equally pressing question: Would we recognize intelligence and sentience if we saw it? There, we cannot rely on chemistry and planetary science, and perhaps that’s why—apart from the want of “finding ourselves out there”—it is a rich domain of science fiction, with books such as Peter Watts’ Blindsight or David Brin’s Existence (and many others) offering potential answers to this question.\nFinding life is not so easy, and nor is learning more about it. But we are fortunate to live in a time when we are well and truly embarking on this exciting journey of discovery.\nFor more about looking for life as we don’t know it, the deep biosphere, paths toward complexity, or exploring the subsurface of Mars and Europa, you can watch online seminars of the European Astrobiology Institute. (www.youtube.com/channel/UCZjpLapCNVXNs1DNqJMhPJQ)\nJulie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council.", "source": "https://clarkesworldmagazine.com/novakova_03_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page:"}