{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "MSwWTlRR5+trpbCfrk3J54C5SnU=", "id": null, "license": null, "comments": "", "raw_text": "5450 words, short story  Cassandra  πόλλ’ οἶδ’ ἀλώπηξ, ἀλλ’ ἐχῖνος ἓν μέγα The fox knows many things, but the hedgehog knows one big thing. —Archilochus  “Just doing my job.” He mugs for the cameras, that magnificent smile, that ridiculous cape and costume, that stupid quirk of the brow. Behind him is the unharmed research center building. Overhead the brilliant fireworks of the bomb he had heaved into the sky light up the scene, the sparks drifting down over his shoulders like confetti.  He could have tossed the bomb into the river, of course, but this makes for better TV. This is why I’ve taken to calling him Showboat, which happens to also work well with the soaring “S” on his chest.  “What do you have to say to her?” some reporter shouts.  “Villainy doesn’t pay,” he says, like some baseball player with a repertoire of a dozen clichés that will play well for any purpose. Don’t be evil. Surrender and face a fair trial. The American people will not tolerate terrorism. Open your heart to the goodness around you.  I flick off the TV. He had probably figured out my plans with the city’s help. With thousands of surveillance cameras everywhere these days, it’s almost inevitable that my image was captured by some of them. Computers and his super-vision would have done the rest. He does believe in at least one form of anticipatory knowledge then, the kind that concerns me.  I’ll keep on trying, though I’ll need a better disguise.  The apartment is well appointed, comfortable. The man who owns this place won’t be back until tomorrow morning; I’ll be safe here. I fall asleep almost immediately after a long day of crawling through ventilation ducts and utility crawlspaces carrying explosives.  I dream about the building I failed to blow up, about the humming servers and cluttered labs I saw, about the knowledge that is stored within, about automated drones sweeping across the sky, over a busy market, over a remote hamlet, raining death upon the people below implacably. I feel the terror of the man through whose eyes I see these things, and the knowledge that it is wrong, all wrong, and yet also necessary, because war has its own logic, the perennial excuse of cowards trying to evade responsibility.  But I am the villain. Right?  You want to hear some dark, twisted origin story, some formative experience that explains how I’ve come to be me. That’s what Showboat wants, too. “I feel sorry for her,” he tells the cameras. “No one is born evil.” I want to throw the remote at the TV every time he says that.  The real story is pretty mundane. It started with a search for cool air.  It’s summer and there’s no air conditioning in my apartment. Buying a window unit and installing it and figuring out how to pay for the extra electricity—the very thoughts exhaust me. Planning has never been my strong suit. I like to take things one step at a time. It’s why I’m still in the city with no job after college, trying to put off making that phone call to my parents about possibly moving back home. You’re right, Dad; it looks like that degree in literature and history really isn’t so useful.  So I go out for ice cream, for cold smoothies, for the cool air in discount stores where they sell everything you desire and nothing you need.  There’s a family near the TVs with their color saturation turned up so high that the skin on the white actors look orange. The woman stands next to one of the 72-inch beasts, looking skeptical.  “I think it might be a bit too big,” she says.  The man looks at her, and I see his face go through this weird transformation. It was a handsome face, but now it’s not. It’s like she has just insulted him in some unforgivable manner.  “I said I like this one,” he says. I don’t think I’m imagining that thing in his tone, the thing that makes the skin on the back of my neck cold, makes me want to cringe.  She must be hearing it, too. She tenses, straightens up. One of her hands goes to the TV, leaning on it for support; the other hand reaches down and grabs the hand of her little boy, who’s maybe four and tries to shake her off but she refuses to let him go.  “Sorry,” she says.  “You think our place is too small, is that it?” he asks.  “No,” she says.  “You make ten dollars an hour and complain about not getting enough hours, but you think we should be in a bigger place.”  “No,” she says. Her voice gets smaller. The boy has stopped struggling and lets her hold his hand.  “I guess it must be my fault. I should be working more. That must be what you mean.”  “No. Look, I’m sorry—”  “I tell you I like this TV and you start this again.”  “I like the TV.”  The man glares at her, and I can see his face grow redder and redder as if he’s still figuring out all the ways she’s insulted him. I realize what a big man he is, how this rage magnifies him, gives him that aura of power. Abruptly, he turns around and heads for the exit.  The woman lets out a held breath, as do I.  She takes her hand off the TV and starts to follow the man, the boy obediently trailing her. Our eyes meet for a moment and her face flushes, embarrassed.  I want to say something but don’t. What am I supposed to say? He’s got a temper, doesn’t he? You going to be okay? Is he hitting you? What do I know about the lives of strangers? What do I know about the right thing to do?  So I watch as they leave the store, the fog from the air conditioning over the automatic doors enveloping her for a moment as she steps through.  I go up to the TV they had been looking at, and for some reason that I can’t even explain, put my hand on the TV, put my hand where she put hers earlier. It’s like I’m seeking the lingering trace of the warmth of her hand, some assuring sign that she’ll be all right.  And it feels electric, feels like the moon opens up and the stars are singing to me.  An apartment a few tiny rooms the bed the table the kitchen the carpet a mess Damn you’re lazy I’m sorry I was late Teddy was sick had to take him Damn you’re lazy  A toy piano is like a window a handle on a polished shoe grinding mezzo soprano Daddy is angry He is he is my darling Let’s be quiet  The link is with us woman with woman. Your eyes your face It’s nothing Why do you not leave Because So Because  Why did you look at him?  I wasn’t I wasn’t I wasn’t  Lets dance So tender sometimes I’m sorry I was angry forgive me but sometimes you push me  He can be so sweet  A girl is a woman because a woman is an omen Oh man a whole man a hole in a woman a wholesome woman.  An awl is a drill some sharply polished nail  Broken dish a wailing a crying a tantrum Get him to stop! I’m trying I’m trying Damn you’re lazy I’m tired Talking back I told you not to push me Don’t don’t you’re scaring him get away from me  A burst of crimson of red ink iron sweet  Screaming and screaming and screaming he’s not stopping Call the police call  My first vision leaves me breathless and ill.  I ask myself questions in an attempt at persuasion: What have I seen? What am I supposed to do with these images? What is their epistemological status? What is the rational reaction?  So I plead ignorance and do nothing.  Then there she is in the news: on TV, on the web, in the stacks of papers they still put in the convenience stores.  She was getting ready to leave him. Already found an apartment.  He came at her with that awl while their son watched. I couldn’t stop him, and I tried. I tried.  I show up to the funeral, where lots of strangers have gathered outside the chapel to lay flowers around a fountain. I watch the bubbling water and imagine the blood gushing out of her. Guilt gnaws at my insides like an iron file, but the rest of me feels numb. I catch sight of the boy once, and his stoic eyes stab at me like a pair of awls.  And then he swoops in like some butterfly, dressed in his flowing cape and skintight costume. With his hair slicked back, his square jaw steeled, and his arms akimbo—arms that could bend beams of titanium and hold up a falling airplane—he poses. The cameras flash. Despite my cynical nature, I feel my heart lift up. We all need a hero, especially a superhero.  He gives a speech in that familiar baritone. He declares war on domestic violence; he promises to keep his super eye out for signs of trouble; he asks neighbors and friends to see something and say something. “Women shouldn’t have to fear the men in their lives.”  He doesn’t explain how he’s going to accomplish this. Is he going to examine every family in the city? Ferret out the poison from the root of our fucked up culture? Maybe he thinks it’s enough for him to pay attention to the problem, to muscle his way to victory the way he grabbed that burning plane out of the sky, set it down by the shore, and peeled it open like a banana so everyone inside tumbled out and said oh thank you thank you.  But really, what right do I have to mock him and his platitudes? I should have done something. I saw what was going to happen.  His eyes sweep over the crowd, and our gazes meet for a moment. His eyes linger on my face just a second too long, and I wonder what he sees.  The next time it happens I’m about to enter the convenience store.  The man comes barging out the door with his head down and eyes on the ground. He doesn’t hold the door open for me and I have to duck out of the way before he runs me over. He gives me a quick glance as he passes by and I see something in his face that makes my heart stop—intense anger at the world, anger at everybody and everything, anger at me.  I pull the door open, unsettled; an old lady is trying to come out with a bag of bananas and crackers; I put my palm on the inside of the door to hold it open, put it on the spot where the man had slammed his hand a moment earlier.  A winter a splinter I’m a nice guy ice guy my life is not nice Why don’t you why  You owe me you owe me you all owe me  The girl who said no the boy who laughed why does he He doesn’t deserve it nobody does and they say I’m the weird one  A gun  Look at me look at me look at me you can’t hear me screaming you don’t know how much the silence and an island and a new land and it’s the same the same nothing ever changes  Two guns  I can see you I see all of you cowering terrified shivering shaking trembling leaves that you are should I let you live Why  I’m a nice guy ice thrice bang bang bang yes oh yes now you wish you were nice  Three guns  You’re supposed to get in touch with him by calling 911. He monitors that. If it’s the kind of emergency that can use his help, he’ll come.  This is an emergency, but the police will mock me if I call and maybe charge me for wasting their time. Sure, officer, happy to repeat my story. I followed a man home and got his address because I saw a vision that he was going to go on a mass shooting.  So I write to him at his fan club email. I try to keep it vague but promise him IMPORTANT URGENT INFORMATION. I try not to use any capital letters in the rest of the email. To get to the superhero I have to defeat the spam filter first.  It’s afternoon and there’s a thundershower. He hovers outside the window and taps the glass lightly. I rush over to open it.  “Thanks for coming,” I say, as though it’s perfectly normal to have a superhero step through my window. “You must be really busy.”  He shrugs and gives me a smile that shows off his perfect teeth. “When it rains really hard, the crime rate goes down.”  It has never occurred to me that villains, super or otherwise, might have plans derailed by the weather. I suppose it makes sense. Even henchmen don’t like to get wet.  “I have a crime to report.”  He listens to my story, nodding encouragingly from time to time. I tell him about my newfound power and dead Annie, whose funeral he attended, and angry Bobby, who’s going to kill.  He looks at me with those eyes that exude practiced kindness. “I’ll take care of it.”  And he opens the window and leaps out, as smooth as a fish leaping back into the ocean. I run to the window, my heart so full of happiness that I’m half expecting to see a rainbow. I watch his figure shrink over the rooftops, a blue-and-red angel of justice, truth, and all that is good and worthy.  I pace around my apartment, unable to remain still for even a minute.  He comes back an hour later, tapping on my window. The rain hasn’t let up, and he shakes himself off like a wet dog before alighting gently in my living room.  “Did you see him?” I ask.  He nods but says nothing. I scrutinize his face, and something in me wilts, dies.  “He’s a perfectly nice young man,” he says. “Away from home, living on his own for the first time. He’s a bit shy, is all.”  “But the guns!”  “He doesn’t have any guns.”  “Maybe they’re just really well hidden.”  “I have X-ray vision.”  “Maybe he’s going to get them.” I realize that I don’t know anything about the timing of my vision. Maybe Bobby will buy the gun tomorrow, maybe not until twenty years from now.  I think of Annie’s picture and how she looked embarrassed the only time we looked at each other. I knew something. And I did nothing.  “You have to believe me. I saw Annie die.”  He sighs and shakes his head. “Nobody knows the future.”  “They used to think nobody could fly. Or dodge bullets. Or see through walls. Or pluck a burning airplane out of the sky before it crashed.”  He looks at me, his face hardening. “Then tell me how I’m going to die.”  I look at him, my mouth opening and closing wordlessly. Finally, I say, “I don’t know. It doesn’t work like that.”  He nods. “Nobody knows the future.”  I become obsessed with Bobby. I stalk him from a distance, watch his comings and goings, try to piece together his life. I buy directional microphones and long-range zoom lenses. I download manuals written by private detectives and read them late at night.  I find out just how good my tradecraft is one day on the subway. I follow him onto the platform and get into the same car, at the other end. The train starts to move. He turns, looks me straight in the eyes, and walks over.  “You’ve been following me around.”  I try to deny it, but I don’t even have a story ready.  “Why?”  His eyes are confused, but his tone is polite.  I mumble something about living in the same neighborhood and having the same schedule. He asks for my name. He seems ill at ease but not in a way that appears dangerous—though to be honest, how is he supposed to act when he thinks he’s confronting a stalker? We shake hands and tell each other it’s nice to meet you.  His hand is warm, damp. I don’t get any visions.  I ask him to dinner.  Bobby doesn’t know anything about guns. He’s never gotten into a fight. He’s lonely but likes to read and play video games. He’s thinking about becoming vegan. This is the extent of what I find out about him by the end of dinner.  He’s awkward but polite. Our conversation doesn’t flow smoothly because he seems to try out everything he says in his head ten times before he says it. Not my type. But dangerous? I can’t see it.  We walk back together from the restaurant and stop in front of my building.  I look at him. He’s nervous and expectant. I comb through our conversation. Nobody knows the future.  Before he can ask for a hug or a kiss, I shake his hand and step back, “I’ll see you around the neighborhood.”  He looks dejected but not surprised. “Why did you follow me around if you aren’t interested?”  I think about how to answer this in a way that is truthful but not too truthful. “Because I wanted to know if I’m special.”  “Special how?”  Just then Showboat zooms over us in the evening sky, a patriotic-color-schemed comet. We stare up at him together.  “A bit like that,” I say.  “I bet he gets all the girls,” Bobby says. “I bet it’s nice to have that kind of power.”  “Maybe,” I tell him. “I don’t know. Good night.”  I try to go on with my life. The visions come more frequently now, are more vivid. I don’t see visions of happy strangers; my gift is for brutal, bloody futures.  I take to wearing gloves marketed for germaphobes, made of some space age material that’s supposed to be able to breathe while killing germs—pure lies. In fact, they make my hands sweat and the germs probably think of them as Club Med.  But they do keep me safe, safe from myself.  Once in a while, when I must touch something that hold traces of other hands—a touch screen tablet repurposed for taking credit cards or a restroom faucet—the visions leave me with a headache and palpitating heart.  There is a silence in singing, a violence in wringing, a justice and a tenderness and a rustiness in anything sweet and needs no explaining  The path all knowing everywhere sharp objects regret dark and thick and tangy as undersea molasses  Here is your attempt at explication but listen to the sound of sweet sweet sweet wee wee wee like some foundation in a room full of inattention which is death miles and miles of death  There is a mention of a tension that is quite an extension of my intention. For a rose is a rose is a rose is a briar a poke at a nose a bloody nose a gory a glory the same as flag waving.  Then comes the shooting, the bodies, the note left behind by Bobby in which he recounts his years of rejection and rage. My name shows up near the end, the stuck-up girl who thinks she’s special and is obsessed with guns and who comes on to him only to reject him like everyone else. He talks about the desire to experience power, like the man with the red cape and blue tights. He writes about guns and their ability to remake the meek into the mighty, into superheroes. He speaks in the language of vengeance and unstanched wounds bleeding for years.  “You’re responsible for this,” he says, his cape looking cheap in the fluorescent light of my apartment.  I hear in his voice the voice of easy accusation, the pinning of blame upon imagined proximate causes. It’s disappointing to see your heroes fall.  “That’s absurd. He has been building up this delusion of rejection and hatred for years. He was just good at hiding it. You should have listened to me. You’re just as responsible.”  “Sophistry,” he says. “You made the future you claim you saw. That’s your power.”  “No,” I tell him. “We make the future together.”  I suppose I could have just kept the gloves on all the time or moved back to my parents’ house and never emerged, never touched anything that might still hold the heat and sweat from someone else.  It’s one thing to be ignorant, but another to refuse to know.  If I can see the future but decline to, how am I different from a man passing by a pond and averting his eyes from the drowning child?  So I learn to live with the visions, to interpret them, to do what I can to thwart fate. I learn how to filter out the noise and blur and shifting lights, to focus and make sense of what I see and turn it into a scene, a sequence, a narrative. I learn to pay attention to details in the fleeting images: to clocks, to newspapers, to the lengths of shadows and the density of crowds.  At the ATM I see money being hidden in a locker in a changing room, a bribe to a woman in charge of something or other. I go to the gym and wait until five minutes after she’s gone. I go in, take the money, and leave.  I don’t know if that did any good. Maybe she’ll just go back and ask for more, or demand payment from someone else. Maybe whatever she’s being bribed for, she ends up doing anyway. But at least I have money to live on and to devote to my new career.  The man emerging from the elevator holds the door open for me.  “Thanks.”  He nods and leaves. I put my hand on the door where his hand had been. I’m compelled to know.  I see a street corner. A tourist couple with a little daughter.  “Carla!” the father calls out. “Don’t run so far ahead.”  She turns down a narrow alley, in which I’m hiding. The parents follow their daughter in, admonishing her.  I go up to them and demand their money. I speak in the voice of the man who had held the elevator door open. The father refuses, and I take out my gun. Instead of complying, he lunges at me, trying to disarm me. I squeeze the trigger and he crumples to the ground, his face fixed in disbelief. The woman tries to flee, pulling the little girl behind her, and I shoot her also. Then I stare at the little girl standing next to her dead mother. She doesn’t understand what has happened. She looks back at me, confused.  Why not? I think. One more isn’t going to make any difference now.  I glance down at my watch and make a note of the time.  I shake off the cold desolation of the killer’s mind. I get into my car and drive, frantically looking for that street corner on the GPS. I have only a few minutes.  There he is, loping along on the sidewalk, heading for his destiny. What am I going to do? Tell him I’ve seen him kill? If he backs off today, what about tomorrow, and the day after that? Can fate be so easily averted?  I ram my car into him as he starts to climb up a hill. A jolt of adrenaline, the pure thrill of thwarting the future.  Then I spin the wheel and back up, and speed away with screeching tires and the smell of burnt rubber in my nose. As I crest the hill I think I see Carla and her parents, obliviously happy.  I drive. And drive.  That one is simple. Most futures are far more complicated. There’s Alexander, for example, hard working and well meaning.  From a distance, I see him standing at the street corner and mashing the button for the crosswalk impatiently. By the time I arrive at the corner he’s already dashed across and the light has changed.  I tap the button and am overwhelmed by what I see: he’s working on machines that will massacre a village of old people and children. He doesn’t know it yet and he doesn’t intend to. But it will happen. Intent is not magic.  How do I stop him? Could I intervene along the way, use some gentler roadblock to divert him from this future? But there are a thousand visions screaming for my attention, a thousand future victims to save. If I devote all my time to diverting Alexander, I will have also made the choice to let Hal go through with his kidnapping or Liam succeed in strangling his ex-wife.  We know what we know. What we do with that knowledge makes the future.  In the end, I opt for killing Alexander also. He’s at the corner again, oblivious, a creature of habit with a set routine. I have a new car, a guided missile of future vengeance, or anticipatory justice. I step on the gas.  I stay where I am.  I turn around, and he’s there, the red cape whipping in the wind.  “I’ve been watching you,” he says. “You aren’t very good at this, repeating the same modus operandi. But then again, most villains don’t know any better. I’m taking you in.”  He rips the top of the car off for dramatic effect. People exclaim in the distance. I hear the sirens of police cars.  I don’t try to resist. “If you don’t stop him”—I lift my chin in the direction of Alexander—“you’ll have the blood of dozens, maybe hundreds, on your hands.” I sketch my vision for him in a few sentences. “You could claim ignorance before, but not any more. You know I’m right.”  Alexander, some distance away, is still trying to recover from the shock of his near encounter with death. He looks like a mild-mannered bureaucrat, his lips moving like a fish’s.  “I don’t know any such thing,” Showboat says.  “Wouldn’t it be better,” I plead, “to kill the man long before he got on the plane rather than having to rescue the plane as it plunges toward the ground?”  He shakes his head adamantly, confident in his faith, his liberty, his justice, his truth. “We’re not going to live in a society of pre-crimes.”  “We’re not as free as we think. There are tendencies, inclinations, forces that compel us—what we call fate.”  “But you think you’re free,” he says. “You think you’re qualified to judge.”  He has me in a bind. If I succeed in thwarting the future, then my vision was wrong. If I don’t succeed, then I may be said to be a proximate cause. If I do nothing, I can’t live with myself.  “Is it so hard to believe someone can look through time as easily as you can through solid walls? Do you really believe it a mere coincidence that what I spoke of came to pass, that I might have been its sole cause?”  For a moment, the face of our caped hero shows doubt, but it’s fleeting, and the resolute expression quickly returns like a mask. “Even if you’re right, what makes you think you have seen the whole future? Maybe he’ll also save the lives of dozens of soldiers; maybe his machines will kill a kid who grows up to be a dictator. The future is not knowable until it has become the past. But I just stopped you from murder. I know that. It is enough.”  I think about my fragmentary visions. What do I really know?  “And you can’t stop what you think will happen by killing him,” he tells me. “He’s just one man out of many others working on the same thing. Fate, if it exists, is resilient.”  He’s not entirely wrong, I suppose. I am a time traveler in a sense, and stories about time travelers changing history are often frustratingly stupid. The larger trends of history are rarely dependent on a single individual. Who would you have had to kill to prevent the destruction of the native peoples of the Americas, of Australia, of Hawaii? To stop the Atlantic slave trade? To avoid the mass atrocities of the wars in Indochina and East Asia? You could have killed every named explorer and general and emperor and king in the history books and the currents of colonial conquest probably wouldn’t have shifted by much.  But that way lies madness. We’ll never have complete knowledge. I know what I know, but he refuses to learn what he can. That makes all the difference.  The police car screeches to a stop nearby. He reaches for my hand to pull me out of the wreck of my car. His hand is warm and dry; it doesn’t feel like the hand of someone who kills by refusing to believe, who takes refuge in the assumed condition of our ignorance, secure in his knowledge.  A blur that resolves into flashing images. Clarity.  Through his eyes, I see him regretting not following me in the squad car to be sure I’m put away; I see him examining the drive-through window of the fast-food restaurant and the bank across the street, where the robbers had emerged, his super-vision picking out the bullet holes in the sidewalk and walls and calculating their trajectories; I see him taking in the site of the shoot-out and clench his jaws; I hear the officers apologizing for rushing to confront the robbers without having secured me properly.  His visions are as orderly and predictable as his clichés.  Our hands separate. “Goodbye,” he says, that familiar smug smile on his face again. “The city is safer today with you out of the way.”  I look out the back window. He can’t resist the cameras. He’s going to give another impromptu press conference. The city’s criminals, say, bank robbers, like to wait until he’s on TV before making their moves.  Perfect.  The car starts to move. “You hungry?” one of the officers asks the other.  “I can eat.”  “What are you in the mood for?”  I pipe up, “There’s a Pollo Pollo on Third Avenue, across from the Metropolitan Bank.”  The one in the passenger seat turns to look at me.  I put on a hungry and pleading look. “I have a coupon if you also get me something. My treat.”  The officers look at each other and shrug. “All right. You aren’t going to get a chance to use that coupon for a while.”  “My loss. Say, do you work out or is that a bullet-proof vest under the jacket?”  I train. I learn to shoot, to fight, to become the super villain he already thinks I am.  If killing one man is not enough stop all the abusers, to reverse the momentum of culture, to uninvent the machinery of death, to change the currents of history, then I have to kill more.  I move from the empty apartments of vacationing couples to houses that had just been moved out of and not yet moved in—a touch on the doorknob is enough to tell me the story. I get good and then better at my craft.  I kill violent boyfriends in their sleep, poison future gunmen over meals, plot the erasure and destruction of clean, dust-free laboratories where they design weapons that kill while minimizing guilt. Sometimes I succeed; sometimes he stops me. He becomes obsessed, the anticipation of my next move haunting him as my visions haunt me.  I know a little about many things: snippets from people’s futures, paths that will cross and uncross. I can’t see that far into the fog: every action has a consequence, and consequences have other consequences. It’s true that only when the future has become the past can it be seen as a whole and understood, but to do nothing because you don’t know everything is not a path I can follow. I know that a little girl named Carla is alive because of me. It is enough.  He and I are not so different, perhaps, just a matter of degrees.  So we dance across the city, he and I, antagonists locked in the eternal struggle between the scattered knowledge of fate and the ignorant certainty of free will. Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.", "text": "5450 words, short story\nCassandra\nπόλλ’ οἶδ’ ἀλώπηξ, ἀλλ’ ἐχῖνος ἓν μέγα\nThe fox knows many things, but the hedgehog knows one big thing.\n—Archilochus\n“Just doing my job.” He mugs for the cameras, that magnificent smile, that ridiculous cape and costume, that stupid quirk of the brow. Behind him is the unharmed research center building. Overhead the brilliant fireworks of the bomb he had heaved into the sky light up the scene, the sparks drifting down over his shoulders like confetti.\nHe could have tossed the bomb into the river, of course, but this makes for better TV. This is why I’ve taken to calling him Showboat, which happens to also work well with the soaring “S” on his chest.\n“What do you have to say to her?” some reporter shouts.\n“Villainy doesn’t pay,” he says, like some baseball player with a repertoire of a dozen clichés that will play well for any purpose. Don’t be evil. Surrender and face a fair trial. The American people will not tolerate terrorism. Open your heart to the goodness around you.\nI flick off the TV. He had probably figured out my plans with the city’s help. With thousands of surveillance cameras everywhere these days, it’s almost inevitable that my image was captured by some of them. Computers and his super-vision would have done the rest. He does believe in at least one form of anticipatory knowledge then, the kind that concerns me.\nI’ll keep on trying, though I’ll need a better disguise.\nThe apartment is well appointed, comfortable. The man who owns this place won’t be back until tomorrow morning; I’ll be safe here. I fall asleep almost immediately after a long day of crawling through ventilation ducts and utility crawlspaces carrying explosives.\nI dream about the building I failed to blow up, about the humming servers and cluttered labs I saw, about the knowledge that is stored within, about automated drones sweeping across the sky, over a busy market, over a remote hamlet, raining death upon the people below implacably. I feel the terror of the man through whose eyes I see these things, and the knowledge that it is wrong, all wrong, and yet also necessary, because war has its own logic, the perennial excuse of cowards trying to evade responsibility.\nBut I am the villain. Right?\nYou want to hear some dark, twisted origin story, some formative experience that explains how I’ve come to be me. That’s what Showboat wants, too. “I feel sorry for her,” he tells the cameras. “No one is born evil.” I want to throw the remote at the TV every time he says that.\nThe real story is pretty mundane. It started with a search for cool air.\nIt’s summer and there’s no air conditioning in my apartment. Buying a window unit and installing it and figuring out how to pay for the extra electricity—the very thoughts exhaust me. Planning has never been my strong suit. I like to take things one step at a time. It’s why I’m still in the city with no job after college, trying to put off making that phone call to my parents about possibly moving back home. You’re right, Dad; it looks like that degree in literature and history really isn’t so useful.\nSo I go out for ice cream, for cold smoothies, for the cool air in discount stores where they sell everything you desire and nothing you need.\nThere’s a family near the TVs with their color saturation turned up so high that the skin on the white actors look orange. The woman stands next to one of the 72-inch beasts, looking skeptical.\n“I think it might be a bit too big,” she says.\nThe man looks at her, and I see his face go through this weird transformation. It was a handsome face, but now it’s not. It’s like she has just insulted him in some unforgivable manner.\n“I said I like this one,” he says. I don’t think I’m imagining that thing in his tone, the thing that makes the skin on the back of my neck cold, makes me want to cringe.\nShe must be hearing it, too. She tenses, straightens up. One of her hands goes to the TV, leaning on it for support; the other hand reaches down and grabs the hand of her little boy, who’s maybe four and tries to shake her off but she refuses to let him go.\n“Sorry,” she says.\n“You think our place is too small, is that it?” he asks.\n“No,” she says.\n“You make ten dollars an hour and complain about not getting enough hours, but you think we should be in a bigger place.”\n“No,” she says. Her voice gets smaller. The boy has stopped struggling and lets her hold his hand.\n“I guess it must be my fault. I should be working more. That must be what you mean.”\n“No. Look, I’m sorry—”\n“I tell you I like this TV and you start this again.”\n“I like the TV.”\nThe man glares at her, and I can see his face grow redder and redder as if he’s still figuring out all the ways she’s insulted him. I realize what a big man he is, how this rage magnifies him, gives him that aura of power. Abruptly, he turns around and heads for the exit.\nThe woman lets out a held breath, as do I.\nShe takes her hand off the TV and starts to follow the man, the boy obediently trailing her. Our eyes meet for a moment and her face flushes, embarrassed.\nI want to say something but don’t. What am I supposed to say? He’s got a temper, doesn’t he? You going to be okay? Is he hitting you? What do I know about the lives of strangers? What do I know about the right thing to do?\nSo I watch as they leave the store, the fog from the air conditioning over the automatic doors enveloping her for a moment as she steps through.\nI go up to the TV they had been looking at, and for some reason that I can’t even explain, put my hand on the TV, put my hand where she put hers earlier. It’s like I’m seeking the lingering trace of the warmth of her hand, some assuring sign that she’ll be all right.\nAnd it feels electric, feels like the moon opens up and the stars are singing to me.\nAn apartment a few tiny rooms the bed the table the kitchen the carpet a mess Damn you’re lazy I’m sorry I was late Teddy was sick had to take him Damn you’re lazy\nA toy piano is like a window a handle on a polished shoe grinding mezzo soprano Daddy is angry He is he is my darling Let’s be quiet\nThe link is with us woman with woman. Your eyes your face It’s nothing Why do you not leave Because So Because\nWhy did you look at him?\nI wasn’t I wasn’t I wasn’t\nLets dance So tender sometimes I’m sorry I was angry forgive me but sometimes you push me\nHe can be so sweet\nA girl is a woman because a woman is an omen Oh man a whole man a hole in a woman a wholesome woman.\nAn awl is a drill some sharply polished nail\nBroken dish a wailing a crying a tantrum Get him to stop! I’m trying I’m trying Damn you’re lazy I’m tired Talking back I told you not to push me Don’t don’t you’re scaring him get away from me\nA burst of crimson of red ink iron sweet\nScreaming and screaming and screaming he’s not stopping Call the police call\nMy first vision leaves me breathless and ill.\nI ask myself questions in an attempt at persuasion: What have I seen? What am I supposed to do with these images? What is their epistemological status? What is the rational reaction?\nSo I plead ignorance and do nothing.\nThen there she is in the news: on TV, on the web, in the stacks of papers they still put in the convenience stores.\nShe was getting ready to leave him. Already found an apartment.\nHe came at her with that awl while their son watched. I couldn’t stop him, and I tried. I tried.\nI show up to the funeral, where lots of strangers have gathered outside the chapel to lay flowers around a fountain. I watch the bubbling water and imagine the blood gushing out of her. Guilt gnaws at my insides like an iron file, but the rest of me feels numb. I catch sight of the boy once, and his stoic eyes stab at me like a pair of awls.\nAnd then he swoops in like some butterfly, dressed in his flowing cape and skintight costume. With his hair slicked back, his square jaw steeled, and his arms akimbo—arms that could bend beams of titanium and hold up a falling airplane—he poses. The cameras flash. Despite my cynical nature, I feel my heart lift up. We all need a hero, especially a superhero.\nHe gives a speech in that familiar baritone. He declares war on domestic violence; he promises to keep his super eye out for signs of trouble; he asks neighbors and friends to see something and say something. “Women shouldn’t have to fear the men in their lives.”\nHe doesn’t explain how he’s going to accomplish this. Is he going to examine every family in the city? Ferret out the poison from the root of our fucked up culture? Maybe he thinks it’s enough for him to pay attention to the problem, to muscle his way to victory the way he grabbed that burning plane out of the sky, set it down by the shore, and peeled it open like a banana so everyone inside tumbled out and said oh thank you thank you.\nBut really, what right do I have to mock him and his platitudes? I should have done something. I saw what was going to happen.\nHis eyes sweep over the crowd, and our gazes meet for a moment. His eyes linger on my face just a second too long, and I wonder what he sees.\nThe next time it happens I’m about to enter the convenience store.\nThe man comes barging out the door with his head down and eyes on the ground. He doesn’t hold the door open for me and I have to duck out of the way before he runs me over. He gives me a quick glance as he passes by and I see something in his face that makes my heart stop—intense anger at the world, anger at everybody and everything, anger at me.\nI pull the door open, unsettled; an old lady is trying to come out with a bag of bananas and crackers; I put my palm on the inside of the door to hold it open, put it on the spot where the man had slammed his hand a moment earlier.\nA winter a splinter I’m a nice guy ice guy my life is not nice Why don’t you why\nYou owe me you owe me you all owe me\nThe girl who said no the boy who laughed why does he He doesn’t deserve it nobody does and they say I’m the weird one\nA gun\nLook at me look at me look at me you can’t hear me screaming you don’t know how much the silence and an island and a new land and it’s the same the same nothing ever changes\nTwo guns\nI can see you I see all of you cowering terrified shivering shaking trembling leaves that you are should I let you live Why\nI’m a nice guy ice thrice bang bang bang yes oh yes now you wish you were nice\nThree guns\nYou’re supposed to get in touch with him by calling 911. He monitors that. If it’s the kind of emergency that can use his help, he’ll come.\nThis is an emergency, but the police will mock me if I call and maybe charge me for wasting their time. Sure, officer, happy to repeat my story. I followed a man home and got his address because I saw a vision that he was going to go on a mass shooting.\nSo I write to him at his fan club email. I try to keep it vague but promise him IMPORTANT URGENT INFORMATION. I try not to use any capital letters in the rest of the email. To get to the superhero I have to defeat the spam filter first.\nIt’s afternoon and there’s a thundershower. He hovers outside the window and taps the glass lightly. I rush over to open it.\n“Thanks for coming,” I say, as though it’s perfectly normal to have a superhero step through my window. “You must be really busy.”\nHe shrugs and gives me a smile that shows off his perfect teeth. “When it rains really hard, the crime rate goes down.”\nIt has never occurred to me that villains, super or otherwise, might have plans derailed by the weather. I suppose it makes sense. Even henchmen don’t like to get wet.\n“I have a crime to report.”\nHe listens to my story, nodding encouragingly from time to time. I tell him about my newfound power and dead Annie, whose funeral he attended, and angry Bobby, who’s going to kill.\nHe looks at me with those eyes that exude practiced kindness. “I’ll take care of it.”\nAnd he opens the window and leaps out, as smooth as a fish leaping back into the ocean. I run to the window, my heart so full of happiness that I’m half expecting to see a rainbow. I watch his figure shrink over the rooftops, a blue-and-red angel of justice, truth, and all that is good and worthy.\nI pace around my apartment, unable to remain still for even a minute.\nHe comes back an hour later, tapping on my window. The rain hasn’t let up, and he shakes himself off like a wet dog before alighting gently in my living room.\n“Did you see him?” I ask.\nHe nods but says nothing. I scrutinize his face, and something in me wilts, dies.\n“He’s a perfectly nice young man,” he says. “Away from home, living on his own for the first time. He’s a bit shy, is all.”\n“But the guns!”\n“He doesn’t have any guns.”\n“Maybe they’re just really well hidden.”\n“I have X-ray vision.”\n“Maybe he’s going to get them.” I realize that I don’t know anything about the timing of my vision. Maybe Bobby will buy the gun tomorrow, maybe not until twenty years from now.\nI think of Annie’s picture and how she looked embarrassed the only time we looked at each other. I knew something. And I did nothing.\n“You have to believe me. I saw Annie die.”\nHe sighs and shakes his head. “Nobody knows the future.”\n“They used to think nobody could fly. Or dodge bullets. Or see through walls. Or pluck a burning airplane out of the sky before it crashed.”\nHe looks at me, his face hardening. “Then tell me how I’m going to die.”\nI look at him, my mouth opening and closing wordlessly. Finally, I say, “I don’t know. It doesn’t work like that.”\nHe nods. “Nobody knows the future.”\nI become obsessed with Bobby. I stalk him from a distance, watch his comings and goings, try to piece together his life. I buy directional microphones and long-range zoom lenses. I download manuals written by private detectives and read them late at night.\nI find out just how good my tradecraft is one day on the subway. I follow him onto the platform and get into the same car, at the other end. The train starts to move. He turns, looks me straight in the eyes, and walks over.\n“You’ve been following me around.”\nI try to deny it, but I don’t even have a story ready.\n“Why?”\nHis eyes are confused, but his tone is polite.\nI mumble something about living in the same neighborhood and having the same schedule. He asks for my name. He seems ill at ease but not in a way that appears dangerous—though to be honest, how is he supposed to act when he thinks he’s confronting a stalker? We shake hands and tell each other it’s nice to meet you.\nHis hand is warm, damp. I don’t get any visions.\nI ask him to dinner.\nBobby doesn’t know anything about guns. He’s never gotten into a fight. He’s lonely but likes to read and play video games. He’s thinking about becoming vegan. This is the extent of what I find out about him by the end of dinner.\nHe’s awkward but polite. Our conversation doesn’t flow smoothly because he seems to try out everything he says in his head ten times before he says it. Not my type. But dangerous? I can’t see it.\nWe walk back together from the restaurant and stop in front of my building.\nI look at him. He’s nervous and expectant. I comb through our conversation. Nobody knows the future.\nBefore he can ask for a hug or a kiss, I shake his hand and step back, “I’ll see you around the neighborhood.”\nHe looks dejected but not surprised. “Why did you follow me around if you aren’t interested?”\nI think about how to answer this in a way that is truthful but not too truthful. “Because I wanted to know if I’m special.”\n“Special how?”\nJust then Showboat zooms over us in the evening sky, a patriotic-color-schemed comet. We stare up at him together.\n“A bit like that,” I say.\n“I bet he gets all the girls,” Bobby says. “I bet it’s nice to have that kind of power.”\n“Maybe,” I tell him. “I don’t know. Good night.”\nI try to go on with my life. The visions come more frequently now, are more vivid. I don’t see visions of happy strangers; my gift is for brutal, bloody futures.\nI take to wearing gloves marketed for germaphobes, made of some space age material that’s supposed to be able to breathe while killing germs—pure lies. In fact, they make my hands sweat and the germs probably think of them as Club Med.\nBut they do keep me safe, safe from myself.\nOnce in a while, when I must touch something that hold traces of other hands—a touch screen tablet repurposed for taking credit cards or a restroom faucet—the visions leave me with a headache and palpitating heart.\nThere is a silence in singing, a violence in wringing, a justice and a tenderness and a rustiness in anything sweet and needs no explaining\nThe path all knowing everywhere sharp objects regret dark and thick and tangy as undersea molasses\nHere is your attempt at explication but listen to the sound of sweet sweet sweet wee wee wee like some foundation in a room full of inattention which is death miles and miles of death\nThere is a mention of a tension that is quite an extension of my intention. For a rose is a rose is a rose is a briar a poke at a nose a bloody nose a gory a glory the same as flag waving.\nThen comes the shooting, the bodies, the note left behind by Bobby in which he recounts his years of rejection and rage. My name shows up near the end, the stuck-up girl who thinks she’s special and is obsessed with guns and who comes on to him only to reject him like everyone else. He talks about the desire to experience power, like the man with the red cape and blue tights. He writes about guns and their ability to remake the meek into the mighty, into superheroes. He speaks in the language of vengeance and unstanched wounds bleeding for years.\n“You’re responsible for this,” he says, his cape looking cheap in the fluorescent light of my apartment.\nI hear in his voice the voice of easy accusation, the pinning of blame upon imagined proximate causes. It’s disappointing to see your heroes fall.\n“That’s absurd. He has been building up this delusion of rejection and hatred for years. He was just good at hiding it. You should have listened to me. You’re just as responsible.”\n“Sophistry,” he says. “You made the future you claim you saw. That’s your power.”\n“No,” I tell him. “We make the future together.”\nI suppose I could have just kept the gloves on all the time or moved back to my parents’ house and never emerged, never touched anything that might still hold the heat and sweat from someone else.\nIt’s one thing to be ignorant, but another to refuse to know.\nIf I can see the future but decline to, how am I different from a man passing by a pond and averting his eyes from the drowning child?\nSo I learn to live with the visions, to interpret them, to do what I can to thwart fate. I learn how to filter out the noise and blur and shifting lights, to focus and make sense of what I see and turn it into a scene, a sequence, a narrative. I learn to pay attention to details in the fleeting images: to clocks, to newspapers, to the lengths of shadows and the density of crowds.\nAt the ATM I see money being hidden in a locker in a changing room, a bribe to a woman in charge of something or other. I go to the gym and wait until five minutes after she’s gone. I go in, take the money, and leave.\nI don’t know if that did any good. Maybe she’ll just go back and ask for more, or demand payment from someone else. Maybe whatever she’s being bribed for, she ends up doing anyway. But at least I have money to live on and to devote to my new career.\nThe man emerging from the elevator holds the door open for me.\n“Thanks.”\nHe nods and leaves. I put my hand on the door where his hand had been. I’m compelled to know.\nI see a street corner. A tourist couple with a little daughter.\n“Carla!” the father calls out. “Don’t run so far ahead.”\nShe turns down a narrow alley, in which I’m hiding. The parents follow their daughter in, admonishing her.\nI go up to them and demand their money. I speak in the voice of the man who had held the elevator door open. The father refuses, and I take out my gun. Instead of complying, he lunges at me, trying to disarm me. I squeeze the trigger and he crumples to the ground, his face fixed in disbelief. The woman tries to flee, pulling the little girl behind her, and I shoot her also. Then I stare at the little girl standing next to her dead mother. She doesn’t understand what has happened. She looks back at me, confused.\nWhy not? I think. One more isn’t going to make any difference now.\nI glance down at my watch and make a note of the time.\nI shake off the cold desolation of the killer’s mind. I get into my car and drive, frantically looking for that street corner on the GPS. I have only a few minutes.\nThere he is, loping along on the sidewalk, heading for his destiny. What am I going to do? Tell him I’ve seen him kill? If he backs off today, what about tomorrow, and the day after that? Can fate be so easily averted?\nI ram my car into him as he starts to climb up a hill. A jolt of adrenaline, the pure thrill of thwarting the future.\nThen I spin the wheel and back up, and speed away with screeching tires and the smell of burnt rubber in my nose. As I crest the hill I think I see Carla and her parents, obliviously happy.\nI drive. And drive.\nThat one is simple. Most futures are far more complicated. There’s Alexander, for example, hard working and well meaning.\nFrom a distance, I see him standing at the street corner and mashing the button for the crosswalk impatiently. By the time I arrive at the corner he’s already dashed across and the light has changed.\nI tap the button and am overwhelmed by what I see: he’s working on machines that will massacre a village of old people and children. He doesn’t know it yet and he doesn’t intend to. But it will happen. Intent is not magic.\nHow do I stop him? Could I intervene along the way, use some gentler roadblock to divert him from this future? But there are a thousand visions screaming for my attention, a thousand future victims to save. If I devote all my time to diverting Alexander, I will have also made the choice to let Hal go through with his kidnapping or Liam succeed in strangling his ex-wife.\nWe know what we know. What we do with that knowledge makes the future.\nIn the end, I opt for killing Alexander also. He’s at the corner again, oblivious, a creature of habit with a set routine. I have a new car, a guided missile of future vengeance, or anticipatory justice. I step on the gas.\nI stay where I am.\nI turn around, and he’s there, the red cape whipping in the wind.\n“I’ve been watching you,” he says. “You aren’t very good at this, repeating the same modus operandi. But then again, most villains don’t know any better. I’m taking you in.”\nHe rips the top of the car off for dramatic effect. People exclaim in the distance. I hear the sirens of police cars.\nI don’t try to resist. “If you don’t stop him”—I lift my chin in the direction of Alexander—“you’ll have the blood of dozens, maybe hundreds, on your hands.” I sketch my vision for him in a few sentences. “You could claim ignorance before, but not any more. You know I’m right.”\nAlexander, some distance away, is still trying to recover from the shock of his near encounter with death. He looks like a mild-mannered bureaucrat, his lips moving like a fish’s.\n“I don’t know any such thing,” Showboat says.\n“Wouldn’t it be better,” I plead, “to kill the man long before he got on the plane rather than having to rescue the plane as it plunges toward the ground?”\nHe shakes his head adamantly, confident in his faith, his liberty, his justice, his truth. “We’re not going to live in a society of pre-crimes.”\n“We’re not as free as we think. There are tendencies, inclinations, forces that compel us—what we call fate.”\n“But you think you’re free,” he says. “You think you’re qualified to judge.”\nHe has me in a bind. If I succeed in thwarting the future, then my vision was wrong. If I don’t succeed, then I may be said to be a proximate cause. If I do nothing, I can’t live with myself.\n“Is it so hard to believe someone can look through time as easily as you can through solid walls? Do you really believe it a mere coincidence that what I spoke of came to pass, that I might have been its sole cause?”\nFor a moment, the face of our caped hero shows doubt, but it’s fleeting, and the resolute expression quickly returns like a mask. “Even if you’re right, what makes you think you have seen the whole future? Maybe he’ll also save the lives of dozens of soldiers; maybe his machines will kill a kid who grows up to be a dictator. The future is not knowable until it has become the past. But I just stopped you from murder. I know that. It is enough.”\nI think about my fragmentary visions. What do I really know?\n“And you can’t stop what you think will happen by killing him,” he tells me. “He’s just one man out of many others working on the same thing. Fate, if it exists, is resilient.”\nHe’s not entirely wrong, I suppose. I am a time traveler in a sense, and stories about time travelers changing history are often frustratingly stupid. The larger trends of history are rarely dependent on a single individual. Who would you have had to kill to prevent the destruction of the native peoples of the Americas, of Australia, of Hawaii? To stop the Atlantic slave trade? To avoid the mass atrocities of the wars in Indochina and East Asia? You could have killed every named explorer and general and emperor and king in the history books and the currents of colonial conquest probably wouldn’t have shifted by much.\nBut that way lies madness. We’ll never have complete knowledge. I know what I know, but he refuses to learn what he can. That makes all the difference.\nThe police car screeches to a stop nearby. He reaches for my hand to pull me out of the wreck of my car. His hand is warm and dry; it doesn’t feel like the hand of someone who kills by refusing to believe, who takes refuge in the assumed condition of our ignorance, secure in his knowledge.\nA blur that resolves into flashing images. Clarity.\nThrough his eyes, I see him regretting not following me in the squad car to be sure I’m put away; I see him examining the drive-through window of the fast-food restaurant and the bank across the street, where the robbers had emerged, his super-vision picking out the bullet holes in the sidewalk and walls and calculating their trajectories; I see him taking in the site of the shoot-out and clench his jaws; I hear the officers apologizing for rushing to confront the robbers without having secured me properly.\nHis visions are as orderly and predictable as his clichés.\nOur hands separate. “Goodbye,” he says, that familiar smug smile on his face again. “The city is safer today with you out of the way.”\nI look out the back window. He can’t resist the cameras. He’s going to give another impromptu press conference. The city’s criminals, say, bank robbers, like to wait until he’s on TV before making their moves.\nPerfect.\nThe car starts to move. “You hungry?” one of the officers asks the other.\n“I can eat.”\n“What are you in the mood for?”\nI pipe up, “There’s a Pollo Pollo on Third Avenue, across from the Metropolitan Bank.”\nThe one in the passenger seat turns to look at me.\nI put on a hungry and pleading look. “I have a coupon if you also get me something. My treat.”\nThe officers look at each other and shrug. “All right. You aren’t going to get a chance to use that coupon for a while.”\n“My loss. Say, do you work out or is that a bullet-proof vest under the jacket?”\nI train. I learn to shoot, to fight, to become the super villain he already thinks I am.\nIf killing one man is not enough stop all the abusers, to reverse the momentum of culture, to uninvent the machinery of death, to change the currents of history, then I have to kill more.\nI move from the empty apartments of vacationing couples to houses that had just been moved out of and not yet moved in—a touch on the doorknob is enough to tell me the story. I get good and then better at my craft.\nI kill violent boyfriends in their sleep, poison future gunmen over meals, plot the erasure and destruction of clean, dust-free laboratories where they design weapons that kill while minimizing guilt. Sometimes I succeed; sometimes he stops me. He becomes obsessed, the anticipation of my next move haunting him as my visions haunt me.\nI know a little about many things: snippets from people’s futures, paths that will cross and uncross. I can’t see that far into the fog: every action has a consequence, and consequences have other consequences. It’s true that only when the future has become the past can it be seen as a whole and understood, but to do nothing because you don’t know everything is not a path I can follow. I know that a little girl named Carla is alive because of me. It is enough.\nHe and I are not so different, perhaps, just a matter of degrees.\nSo we dance across the city, he and I, antagonists locked in the eternal struggle between the scattered knowledge of fate and the ignorant certainty of free will.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.", "source": "https://clarkesworldmagazine.com/liu_03_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Cassandra by Ken Liu"}