{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Benjanun Sriduangkaew", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "gRvhQgsM0M7V/ef/KdfKw0lrxXo=", "id": null, "license": null, "comments": "", "raw_text": "6200 words, short story  The Petals Abide  In the womb-tank coded with thought and memory, Twoseret learned three things: that her life will be full of peace, that she will never die, and that she will know precisely one tragedy. These facts are absolute, untarnished by chance and impregnable to intervention.  After that, petals started blooming in her mouth.  They come at dawn at a regulated hour; she knows to be awake with her mouth empty so she does not choke. A tickle in her throat, a pressure against tonsil, and they emerge fluttering: the shape of hands with spindly digits, the color of unlit space that demarcates empires. She likes to speculate whose hands they might be modeled on, or whether they are the quintessence of hands, a mannequin standard.  They are pristine and velvet, untouched by teeth and untainted by saliva: like no part of the body at all, no effort to resemble tissue or keratin.  Here Twoseret finds her orders, in the capillaries that call to the light of accretion disks and press against her nerves in synesthetic licks. The petals are the flowers of prophecy, the blooms of destiny. As long as she follows their instructions, like any memorialist Twoseret stands deathless.  She arranges the petals, four, radiant—fingers pointing out, fluttering in the low salted wind, the heels of their palms held down by mosaic stones. A murmur of sun slants across unlighted velvet. She bends to read, sibyl to her own fate.  The city ground is a canvas, the avenues brushstrokes, history a palette. An avian view yields faces gone to carcass and archive, some self-portraits, others celebrating personal affection and past deeds—the war heroes, the founding scholars, the beloved siblings. Within these walls, nothing is forgotten. Outside them, everything is.  Twoseret walks through parabola gates of porphyry and persimmons heavy on the bough, down bridges whose curves follow theta-rhythms. The petals have given her a course, a target.  It will be a channel, she expects, through which she may monitor a life and from that material suture together a new person. Broad edits are crude: a wholesale revision of a planet’s chronology, a rearrangement of civil wars and epidemics and sundry. The work she does, however, requires more finesse. In identity reassignment the subject must feel at home in their new path, natural to a strange career and family and spouse as though they have always lived this life. The more moving pieces there are, the more skilled a memorialist has to be. Twoseret counts herself one of the best in the city, if not the very best.  The only one to whom she conceded supremacy was Umaiyal, but ey is long gone.  She stops at the basin of faces, where bone dunes in a hundred twenty-seven colors—most visible, a few not—rotate hourly, resolving into the faces of the first memorialists. There, at the border of grinding femurs and fibulae, she finds a casket.  The edges of it are sharp as invasion, its casing radiant as war-beads, its lid heavy as regret. Around this a homunculus of encryption hovers, epidermis full of paradoxes clenched shut. She coaxes them open, by intuition and determination. Her routines grant her a surplus of leisure, and she’s spent it on dead languages, ciphers, puzzle-solving.  She expects a soldier, a spy, a politician of high standing. Those are ever the first to develop a taste for sedition. But once the homunculus has been whispered and peeled off, she finds instead a foreign assassin.  Beneath a canopy of chameleon fish and isometry rosettes, she thaws the body. Their face is blunt, singed at temple and jawline by ecclesiastic tattoos. Their neck looks as though branded by bird beaks, their biceps abraded by bird claws. The marks of the Cotillion and the divine Song under which they march.  The assassin is armed too, but Twoseret is unconcerned, for the petals did not forecast that she will die today. When the fluids have been drained and the cryogenic phase deactivated, the assassin wakes: all at once, without the transitional stage between occluded cognition and full alertness. The gaze that latches onto Twoseret’s is clear and iridescent with corneal implants.  They jackknife and heave. A splat of saliva and bile, so black, so blue. Waking up this way is never pleasant, no more than being decanted from a tank. Twoseret has vivid recall of her own birth, her first breath and emergence, of volition beyond the crèche-parents.  She reads their name and gender as they come online. “Sujatha Sindh.” The name susurrates like parched leaves, from a language spoken on several Hegemonic constituents. Not entirely foreign, but the two empires have regular exchanges; citizens of one flee and become refugees in another, diasporic. Their descendants repeat the cycle.  The assassin gains their composure in turns, gray and shuddering, on their back then on their knees. Twoseret offers a hand; they take it. Long fingers, velvet where synthetic dermis has replaced fingerprints.  “You have been sent to abduct or kill one of us,” Twoseret murmurs, off the dossier. “Did you choose a specific target or would any of us have done?”  “My instructions were not discriminating.” Sujatha’s voice is a blasted echo, its wealth and timbre gouged out. Cotillion personnel wield their voices for sacred music, better than any weapon. Without that the assassin’s bite is much blunted.  Because they do not ask what their fate will be, Twoseret does not provide. Perhaps they already know, as surely as if they had read the same petals Twoseret did. She gives them her shoulder, her arm around the heft of a torso honed to swift retribution, limbs trained to kinetic poetry. Those too have been weakened, ligament augmens snipped off, bone enhancement ripped out. Where once there was puissance, now there is brittle mortality.  Muscles spasm in Sujatha’s cheeks as they walk. It’s not the only part of them that trembles in withdrawal from the destruction of their voice. Twoseret imagines how it was done. An operation, painless. An appointment with precise instruments during which Sujatha was awake for every minute, nerves primed to open wounds. Dilated time.  Sujatha’s prison is a palimpsest of deep-sea salt and abyssal cold. Its frictive patterns convert to musical notations, echoing the voice of a deceased memorialist. The assassin gazes at the water. Their mouth parts, habit, but they press it shut.  “It isn’t really a song,” Twoseret says.  “All ordered sound is part of the eternal symphony. The birth of universes. The end of them. Entropic culmination and singularities.” Sujatha touches their throat. “I will not sully any of it with the voice I have now.”  Twoseret does not present a secular objection—that sound is merely sound, can be synthesized and reproduced; that sound has no purchase without air, and what is a deific verity that cannot cross stars? She helps Sujatha settle into their bed of solid-state husks and slaughtered engine cores. Battle salvage is material for art. It speaks of Hegemonic peace spreading abroad, a reminder of the army’s might. What are memorialists and their city without the commanders and the troops, their strategies and victories?  That thought dogs the heel of another. “Who captured you?” For someone must have, an act of heroism and advancement.  Sujatha takes a cracked breath, perhaps weighing their tactics: to tell, to withhold. “A soldier. Oridel Nehetis.”  Twoseret’s expression must have spoken louder than her silence. She corrects that. “I see,” she says, and seals the oceanic palimpsest between them.  “Do you remember,” she asks one of her age-mates, “Umaiyal?”  His answer is interrupted by a trio of petals. He catches them as they fall, fans them like a spread of cards on the game board between him and Twoseret. “Yeah,” Riam says, reading his instructions, not disclosing them. “How goes it for em? The exception.”  The exception to have punctured the city’s skin from the inside. The exception to have left. Twoseret will never know how this was done, what deal was brokered, what Umaiyal’s petals spoke; whether this was mandate or Umaiyal’s volition. She only knew—knows—the loss like a suppurating hurt. Out there ey goes by Oridel, a good elegant name. Ey wears eir face differently too, sharp-boned and pearl-pale, chased in nacre that traces and wraps eir skull in place of a scalp. A short clip that Twoseret plays, over and over, with Umaiyal caught mid-chuckle. Wry and polished in dress uniform, eir throat a choker of respiratory implants for work in toxic battlefields. She wonders how many deaths ey has logged.  Umaiyal once asked her what name she would take, out there, if she could leave. On a whim she picked Nehetis.  Twoseret moves her piece, desultory, not much caring for the game’s result. “Ey’s as well as can be expected. Alive, certainly.”  “So you don’t know either?” Riam flicks his head, apologetic. “Uncharitable of me. Not as if they would have let you keep in touch. I always thought if anyone got out, it’d be Umaiyal. And ey would take you with em.”  Umaiyal never asked. One day ey was there, the next gone. Even eir clothes, eir jewelry: the nexus-choker of corneal opals, the eigenvector jacket she gave em.  “I’m content here,” says Twoseret. “Aren’t we all?”  The petals yoke her to the prisoner’s cycles. She comes to know the palimpsest’s smell as well as that of her own bed, and Sujatha’s face as well as her own reflection. The questions she puts to the assassin are broad and she’s rarely interested in the answers, so much so it provokes Sujatha to say, “You aren’t what I would call an adequate interrogator.”  Twoseret sinks her hand into the water, warm and viscous as gestation plasma. She imagines pulling Sujatha through it and the assassin coming out her side reborn, a blank canvas numinous with possibility. “I’m no interrogator. Would you like to talk about something else? Tell me secrets. Not state matters, just little things.”  Sujatha sits cross-legged, and despite the palimpsest distortion they look much better: they’ll never have their old strength back, nor their voice, but their colors are healthier. Umber rather than jaundiced sepia. “Why would I do that?”  There is an acid-edge of animus that Twoseret finds strangely personal. “To pass the time, as I can’t persuade you to sing and you wouldn’t learn origami or any of the games I’ve brought you.”  “I play nothing well behind a prison cell, and I’m not a graceful loser.” The assassin cranes their neck back, looking up. From their perspective the world entire is sunlight filtered through depth, exegesis by fiber-optic sharks and hydrogen anemones. “There’s a dessert of egg yolk shaped like gilded drops that I indulge in to a fault. From each of my bed-partners I’ve collected a necklace, a scarf, a collar; as long as it’s been close to them like a garrote. In all my life I’ve fallen in love only once.”  “Yes?” The barrier is permeable up to a point. Twoseret encounters soft resistance once her hands have sunk through to the wrist. “Tell me about love.”  They laugh, a stutter-bark of actuators guttering out. “You’ve never been happy. No species of love would be known to you.”  “If happiness is freedom from deprivation and pain, then I’ve never known anything but.”  “Happiness,” Sujatha says, “is more than that. You haven’t seen—”  “Beyond this circle of existence,” Twoseret says, drawing up her knees and resting her chin on them, “the calculus of being distills to this: rule or be ruled. Under Hegemonic peace your past is robbed; under the Cotillion your future is sealed. There are only so many places for power, and most will never rise to them nor even see the path.”  The assassin blinks, a play of lamplight on black pearl in their irises. “You aren’t what I expected.”  “Mindless, you mean? As long as I follow the petals, nothing is forbidden. The province of my mind belongs to me alone, and in that I have what most outside this city never will.”  Perhaps some of that turns a key in Sujatha’s heart. For the assassin says, “I’ll tell you of my love. Much you won’t comprehend and have no basis with which to compare, but I’ll tell you.”  “And I’ll tell you of mine.” Twoseret leans forward, her nose almost nuzzling the vertical tide. “We may surprise each other.”  “The person I love is absolute, untarnished by loneliness and unsullied by lust. They require no justification to exist; they are beholden to no outer forces or obligations. Like the drive of a warship, but those require guidance and crew, hull and superstructure. Like a sun, but those has a finite age and obey greater forces. So,” Sujatha says, softly, “they are like the Song, given human body, human visage. And to think that is to blaspheme beyond absolution.”  “Today, the person I love is shaped like a hole. But once upon a time that they had arms like polished teak, cheeks like bathyal amber, and eyes like lodestars.” Twoseret unrolls permutative paper in her lap, tears out a precise square. “When they couldn’t sleep they liked to keep their hands busy, and they’d fold this into animals neither of us has ever seen. Lava alligators and polar butterflies, thunder wasps and aquatic bees. They kept their hair very long, dipped in an attar of comets. I’d try to braid those paper things in it, but the hair was difficult of temper, just like their owner.”  Sujatha has flinched as though each of Twoseret’s sentences have pierced them, needle by needle under the nails. “That isn’t a person,” they say, voice tight. “That’s a childhood.”  “Childhood is formative; no person springs into being fully-formed, like a sun or warship or holy music. Everyone has a past. That’s the definition of personhood.”  “The larval stage of it, perhaps. The person someone becomes is honed by time, tempered by experience, the true shape.” The assassin frowns. “Do you fence, wrestle, or box? I feel the need to test you in combat.”  Twoseret laughs and gazes with interest at the hard lines of Sujatha’s body. Umaiyal was built like a willow, but out there ey would have received combat augmens, and assiduous training would have changed em. “I don’t do any of that, and in your state you wouldn’t be able to defeat a child. I’ll play you any sort of game, conquer you in any sort of puzzle.”  “You’re trying to offend me.”  “Yes. No. But tell me more about your personal blasphemy.”  The assassin’s mouth curves then, tracing the arc of a blade. “The person I love has far more in common with me than you, than this city, than anything you know.”  It is, perhaps, not wrong. Twoseret puts two calligraphic avenues between them before she allows her hand to press against her sternum as though to staunch a wound. But her palms come away clean.  In her room, roofed by silver beaten chiffon-thin, she composes. On the malleable walls that submit to her nails, on the permutative paper that yields to her thumbs. She sketches the same figure again and again, an outline of slender limbs and rounded narrow shoulders. Then it becomes more sinuous and muscle-dense, shedding the eigenvector jacket and robe for something more martial. Close-cut uniform that gloves the body, a long coat with severe hem. Twoseret leaves out the sidearm.  A visualization is not required, but she has always found it helpful. The petals give instruction and goal, but the means to achieve them are her own. She begins scanning her own memory segments. A person is gestalt. There is past, present, and the potential for the future.  Now that Umaiyal is gone, of the entire city she is the best memorialist alive.  Twoseret gazes through Sujatha’s eyes. She is almost Sujatha, for a while. Total immersion has its risks, but the best of her compositions often arise from that.  Sujatha’s meetings with Oridel-Umaiyal began at a distance, observing a figure limned in pale light through a corridor of spiral glass. A figure tall and compactly made, unrecognizable to Twoseret. Over weeks the assassin observed, followed.  Was noticed, one day.  An eel-twist of the street where Umaiyal disappeared. The assassin sidestepped, turned in time to catch Umaiyal’s knife on an armguard. The blade locked; Sujatha pulled. Fell with Umaiyal as ey went down, hand on throat—precise pressure—and knees straddling arms.  Both held still: aortae marching to the same adrenal tempo, muscles stretched taut. Then Umaiyal smiled. “You’re very good,” ey said. “Galling as it is to admit, I’m no match for a Cotillion assassin. Had you wanted me dead, I would have been cremated a week ago. So what is it?”  Sujatha drew back slightly, caught by frankness. “Captain.”  “Shall we get a drink? My treat.”  They did, and more than once. An uneasy negotiation, tenser for Sujatha than for Umaiyal. By their fifth meeting in a club of enameled ice, Umaiyal leaned forward and pulled the trigger on a question both of them had always circled around. “You targeted me for my background, didn’t you?”  In that club, at a table laden with conch-shell bowls, Sujatha stopped eating. Curved a hand around a glass, took a long, deliberate sip.  “I can give you a way into that place. Only you’ll have to trust me.” Umaiyal drew closer. “That will be my gift to you.”  It takes Twoseret two heartbeats to realize that had been spoken to her. Meant for her ear, not Sujatha’s. It is not the only instance—many other times Umaiyal couched eir messages in conversations with the assassin. There’s a childhood place I miss, where the bones resolve into faces or Have you ever seen upside-down gardens?  Where I was born, Umaiyal said as ey stood watching the breaking of Sujatha’s voice, there’s a palimpsest that sings.  As Umaiyal put a stunned Sujatha in the casket, ey held the assassin’s hand, saying, “This is the closest I can get to going back.” A harsh breath inhaled. “This is the closest I can get to talking to you.” The lid clipped. “I’ll never be able to go back. I’m sorry I didn’t say goodbye. And I can’t explain. There are no petals here, but even so some things are forbidden. Some things are prophecy, and to disobey them is to accept death.”  The casket slipped shut.  For hours after, Twoseret is not herself. She remembers being in a stronger body; she remembers parts of the surgery that took her—their—voice. An immersive link to the subject’s memory doesn’t give her the subject’s feelings.  Nevertheless Sujatha’s want is plain, blazing gold across the fabric of their recall. “The person I love is absolute,” she says softly, startling herself when what comes out is not in Sujatha’s voice. The original voice brimming with Song, one with the code of existence.  The next time she visits the assassin, she brings a small drawer of perfumes captured in vials of chameleon jade. One takes on the texture of Twoseret’s palm as she handles it. “Do you know the scent?” she asks, opening a window through the prison-tide. “I’ve no idea if this is available outside. Probably it is. Some of us have hobbies but I don’t think anyone distills perfumes, so this must have come with a supply drop.”  Sujatha edges forward. Stiffens in recognition. “What of it?”  “The person I love—” The euphemism, still. “Left this behind, even though they were some of eir favorites. No time to pack it, I suppose, and these bottles are so fragile. I don’t wear perfume, though. Do you?”  No answer.  “It’ll spoil eventually, go rancid.” Twoseret pulls more vials out of their slots, idly rotating one between her fingers. “I could have the containers recycled. The perfume though, that’s a bit of a waste.”  “Then I might as well accept them.”  “There are other things, too.” Talking around and keeping up the pretense, like Umaiyal is the forbidden secret: profane or else too pure and wondrous a word to utter. “I’ll bring them. Clothes that don’t fit me, jewelry, and so on.”  Two sets of petal later, Sujatha smells and dresses a little like Umaiyal. They must know this, but do not object and seem content simply to have Umaiyal’s belongings next to their skin, scenting their clavicles. When Twoseret brings them a lattice necklace, their breath hitches: an object that’s lived next to Umaiyal’s throat.  She cannot claim to understand their terrible longing for Umaiyal; it seems so much, and burns so bright, for such distance and so little return. But it is there, their shared knot, and she makes use of it.  Desire complicates, between to love and to want to be. A certain affinity between those two, she thinks, a bridge that can be built and directed. She makes more sketches of Sujatha, of Umaiyal as she remembers em. She compares and finds herself not dissatisfied. That will be my gift to you.  One day she lets down the prison, which after all was for effect rather than any real intent to cage. As the water cascades away and the kaleidoscope of sharks evaporates, the petals come. Twoseret cups her hands for them, spends half a minute absorbing their directives; when she looks up she finds the assassin staring at her, appalled. “It’s nothing,” she tries to explain. “It doesn’t hurt. This is only an artist’s whim made real by a biotech.”  “It’s not all right,” Sujatha says, then surrenders to silence, as though even that thread of anger exhausts.  “It’s more interesting than receiving messages the conventional way.” She folds her petals into her dress. By nighttime she will have to dispose of them properly, a ritual.  Sujatha tires easily, has to be eased down onto benches and soft grass. Twoseret eventually lets them rest at a fountain that gurgles gossamer pennants, translucent kites, streamers in soft copper and gold.  Eyes shut, the assassin says, “You don’t feel the limits of your world? You don’t find it confined, claustrophobic even? This place isn’t even large enough for fifty million. What’s up there isn’t a sky. This is all you will ever see, all the air you’ll ever breathe. What you do, how you live, it’s all bound up in those fucking flowers. Doesn’t it chafe? Doesn’t it choke?”  “You are very angry,” Twoseret observes, “on behalf of someone you don’t know and hardly like. I have no illusions that you’d choose my society, given other choices. How can it matter if I live a constricted life, or one whose limits of liberty you disapprove?”  “The person you love—” The words come out like retched poison. “Did they live like this?”  She catches a twist of streamer; it convulses around her wrist, prehensile, rose-touched platinum. “To that you already know the answer or you wouldn’t have asked. It’s a life. For most of mine, I never lacked for anything. I still don’t see why you were sent here, though; you obviously can’t get out.”  The assassin smiles a rictus. “As I came, I was transmitting my location. That stopped at a point, but the approximation is sufficient.”  “This entire city can be moved.”  “Very slowly. With considerable difficulty. It’d be a feat of years. Our ships are much faster, inescapable, will not be outraced. Of course negotiating the gravity snarl that protects this place would be a trick and a half, but the same maze that safeguards you also makes relocating the city . . . vexing.”  Twoseret strokes Sujatha’s head the way she might soothe a distressed animal. The assassin’s hair used to be shoulder-length, in those memories, but it’s been growing since. Someday it will be long, serpentine, and she will find an attar of comets to anoint it full of light. “Will they attack?”  A short laugh, that same noise of failing machines. “No. We only wanted some idea of where this might be, just in case. For that I gave my life, without regret. Acquiring this information for the cost of a single person is an extravagant bargain.”  “Patriotism is very nice.” Twoseret has never experienced such a concept, but she means it. Belief—faith—in some vast, grand ideal must be reassuring. The notion that after one has passed, one’s contribution will live on as part of that ideal or, in this case, system of brutal oppression. Still, it’s certainly a greater thing than a single human being or even a billion.  “You’re mocking me.” But this too is said listlessly, the annoyance perfunctory.  “No, I think fervor is admirable. Passion is its own virtue. It animates. It can give an otherwise ordinary thing a terrible magnetism, an ensnaring brilliance . . . ” She unties the streamer and casts it forward, where it catches on an updraft, snapping toward the sky-that-is-not. “Oh, that’s why. All this time, you’ve been so weakened but there’s been this—fire? This gravity, this pull. I think that’s why ey decided on you.”  Sujatha’s head rises a fraction. “Decided like a calculation, the way you say it.”  “It probably was. But not an exact thing, no, eir variables were more organic than numbers. Perhaps it had to do with how you moved, the way you sang, how your face was limned in profile at sunset. And always the fire that burns within you, visible between your teeth, behind your eyes.” She helps them to their feet. “Do you want to see the gardens? Ey loved those.”  Twoseret continues sketching in her head, drawing points of like and unlike. A framework of contrast and potential markers for synaptic joints. In the swaying garden with its inverted field, she picks clusters of edible hydrangea, mangosteens the size of her thumb, syrup oranges with thin ripe peel about to burst. These and more she puts in Sujatha’s lap, absent the assassin’s interest. As the pile grows they pick at it, a bite here, a lick there. Inevitably they have juices running down their fingers, their chin, sticky and fragrant.  She thinks of kissing them away, drop by drop. In the end she unthinks it. Not the right person, not the right time. As of now they are both in love with an idea.  Twoseret stirs to the city quaking and Sujatha’s shadow laying across her like whip-scars. “I know you’re awake,” the assassin says in that fractured, devoured voice. “We’re under attack.”  She peers up at them through her eyelashes. “From whom?”  “Must you ask?”  “But they’ll kill you too,” she points out calmly as she pushes to her elbows, dislodging sheets, baring shoulders and breasts. Baring, too, the places on her ribcage and waist where the incisions were made and implants seeded so she would be able to receive the petals each morning.  Sujatha’s gaze snags on those places and the cartography of their features shifts, sideways, to that region between disgust and fascination. It makes Twoseret want to say that the scars are quite all right: she chose to keep them when they could have been operated away to smoothness, leaving skin unmarred. Of course their horror is really for Umaiyal’s sake, the thought that Umaiyal once lived like this, bore these same scars. Still Sujatha is nearly tender, as though she’s a small child prone to spooking. “Are you in shock?”  “Oh, no.” Her bed trembles as though a beast shaking itself from hibernation, sloughing off sleep and matted grass, or whatever it is that animals coming out of hibernation do. Paper moths flutter from their shelves. “I’m in full command of myself.” She doesn’t say that the petals came early today, and they did not instruct either Twoseret or the city to die. No doubt pointing that out will only distress the assassin.  Twoseret stands all the way up, knows as she turns her back that Sujatha stares at the tiger-stripes up her spine that culminate at the top—below her nape—in a dainty port, flourished in nacre and tiny citrines. “You believed I’m incapable of love because I have never experienced its prerequisites. Is it so hard to believe I’m not panicking because I’ve had no experience of terror, of illness or fear of dying?”  “Even a creature like you must retain her survival instinct.”  “How wrong you are.” Twoseret shrugs into her dress of suede cuffs and amethyst whorls, the fabric whispering like origami in fire as it molds to her. “Umaiyal used to help me dress, pick my clothes. Ey had—still has, I should think—these long fingers, with calluses from the wood-carving ey used to do as a hobby. Ey wasn’t much good at it, though ey tried to make me birds.” The calluses would be different now. Imprints from wielding a chisel and from wielding a gun are nothing alike, she imagines.  “Who?”  “The person you and I love. Pretending further is obscene, isn’t it? I don’t know if ey ever gave you eir birth name.” She slides her shoes on, lavender gray, texture almost petal-like.  Sujatha presses their lips into a hard line and leads her by the hand. Twoseret is startled at the force of their grip, the limber grace of their stride, their familiarity with the puzzle-paths. An assassin would of course be able to map a place from memory, with speed and attention. Even so the unerring way with which they negotiate the city fills her heart, and their recovered strength makes her glad.  “My superiors have given me up for dead,” Sujatha says as they emerge into artificial morning under the sky that is not. “So have I. For all intents and purposes I’m no longer alive; my presence makes no difference.”  “But we’re running somewhere rubble can’t fall on us. A corpse doesn’t run.” Though ultimately the city’s swarm-bounds can shatter; the ceiling of Twoseret’s world is an unbearable weight, upheld by a thread of synaptic aegis. If it falls there will be no escaping it.  “My sense of self-preservation hasn’t deserted me. Flight or fight.” But their expression creases as though they’d said something different, a thing of ache and thorn cupped on their tongue.  A sudden ruthlessness seizes Twoseret. “This city holds the memory of the only person you’ve ever loved. While you breathe you won’t permit its destruction.”  Sujatha doesn’t meet her eyes. “I need a node I can broadcast from. This isn’t a full assault—a veilship or two, not much more. Just scouts.”  Other memorialists have poured into the streets, as calm as Twoseret, intrigued by this new development. A few crèche-parents lead their charges by the hand, clear-eyed children from five to nine in various stages of wiring. By twelve they will be tested, and on success granted the petals. The sight of them draws a smile from her, reflexive and uncomplicated.  “There are consoles we use for supply drops.” Routine communications for assigning and dividing up the items. There’s always abundance and most memorialists can have their pick, tools and luxuries and raw material with which to feed fabricators: steel for hair-ribbons, glass for skirts, a hundred types of gemstones for belts and bedspreads. Everyone wears jewels, is sheathed in it until skin and facets are one.  Twin shadows press against the unsky, each the shape of a hornbill’s head. Another tremor sweeps through like a racking cough, or so Twoseret imagines, never having seen hypothermia in action. There are defenses, but she supposes absently that those must have been breached: they are automated, and while some memorialists know them well—Umaiyal did—most of them never train themselves to battle. The nearest military outpost is too far to make it in time. The city’s greatest protection has always been in its secrecy and location rather than firepower. She finds a wall and activates the console, feeding it a cluster of authentications like grapes, and steps aside.  Sujatha bends close, their breath fogging the obsidian curlicues that frame the console. Twoseret watches with avid interest as they connect to the Cotillion channel with a lover’s intimacy. “Veilship couplet, identify yourselves.”  The shaking pauses. From the console comes a low note, strain of music made by sighing woods and running currents.  “Remotely piloted,” Sujatha murmurs, “as I thought. That’ll be easier.”  “Yes?”  The assassin straightens and inhales. More affectation than any real need for oxygen, Twoseret expects. And they sing.  Sujatha’s voice makes a dirge for extinguished suns and singularistic contractions that kill worlds, for defeat in empty reaches that will go unknown and uncommemorated. It jolts Twoseret’s nerves, constricts her throat, pries at the seams of her flesh.  When it ends Sujatha turns away, trembling slightly. “They will leave. It’s the only command override I can access now, with my voice the way it—in any case it won’t work a second time.”  “It was exquisite.”  “It was nothing of the sort.” The assassin sags, as though the song has leeched their arteries dry and drained their limbs of strength.  Up above the shadows have disappeared. Twoseret catches the assassin. “You’re exhausted. Let’s get you somewhere to rest.”  Sujatha doesn’t resist or push her away. “I’ve been sleeping on grass, under trees.”  “Then come to my bed. I’ll tuck you in.”  In the street, the crowd thins, memorialists returning to their duties and routines now that the excitement is past. Riam nods to Twoseret, perhaps guessing at her intent, giving tacit approval or merely mute indifference.  She frees the assassin from their shoes and vest, and eases them down between the sheets. She holds them until they fall limp and asleep, and very gently kisses their brow, their eyelids, the tip of their nose. Sujatha smells so right.  When she is sure they are deep in dreams, she gathers up her composition and resumes her work. Making a person—an identity—is delicate labor, but it is a labor of love. She thinks she will keep the singing, to retain the best of both worlds, and sends out a request for the casket.  Twoseret watches the sky for silhouettes of insects, vast, their wings enveloping half the city, their antennae slashing the horizon to segments. The outpost has become more attentive and sent them guardians since the attack. She never sees any of the soldiers, though she can imagine them helmeted and carapaced, animated statues of lustrous absence. Faceless, voiceless, nameless. She wonders if, far away, there is a war going on. A real one, sparked off by the assault here. On that the petals are silent.  The weather is getting warm, though never humid or uncomfortable. She’s taken to seed-pearl sandals and lighter dresses with skirts that snap like prayer flags in an assassin’s memory.  She kneels. A casket on the pavement, surrounded by mosaic pieces. The person in it has been sleeping a long time, nested in dreams of being reared by crèche-parents and of being wired; of pride when the first petals came. The casket is like the tank, incubating, preparing a sacred genesis.  Twoseret begins to unlatch the lid. A fetus must push through eventually or be stillborn. That is rare, but she’s seen it happen. The locks and puzzles fall away quickly this time, decorative more than protective.  Eir hair has grown to eir waist. Thick frosted lashes twitch in sleep. A curl of cool breath, body temperature artificially lowered, rises to meet the thick air. Crossed wrists coiled in origami vipers. She runs her palm over eir forehead; she imagines to em the contact must feel like a flame tickling candle wax. In this way she thaws her dreamer, waking em with her own warmth. No fluid to drain, no instrument to detach—this was, almost, a simple and natural sleep.  Ey turns on eir side as though wishing to rest a little longer. Twoseret brushes eir hair, her fingertips grazing the side of eir neck. When eir eyes open, they are terribly clear: irises deeply brown, circumference gilded in amber. The scent of eir favorite perfume wafts, the angular folds of eir favorite vest rises and falls to eir breathing.  “You always slept so heavily.” Twoseret takes em into her arms, helping them out of the casket. “Do I call you Oridel now? Captain Oridel Nehetis. It sounds all grand.”  Ey rubs at eir eyes, groggy, one of those slightly childish gestures—she’s never been able to break eir habit. “No, of course not. It’s been a while, hasn’t it? When did we have hornet fliers guarding our sky? God, I miss piloting those.”  “Recent addition. I find their silhouette very charming. There’s so much to tell you.” She pecks em on the lips. “Welcome back, Umaiyal.”  And Umaiyal laughs, in what is nearly eir voice, straightening to eir feet and taking her hand in that light-firm way that belongs to Umaiyal alone. “I’m home.”  At the moment of her birth, Twoseret learned three things: that her life will be full of peace, that she will never die, and that she will know precisely one tragedy. These facts are absolute, untarnished by chance and impregnable to intervention.  As she walks arm in arm with Umaiyal up the puzzle-paths, her tragedy falls away like pale chrysalis, dissipating on the mosaic tiles and dispersing in the low salted wind.  When her next petals come she reads them and smiles, and casts them aside. Benjanun Sriduangkaew writes love letters to strange cities, beautiful bugs, and the future. Her work has appeared in Tor.com, Beneath Ceaseless Skies, Phantasm Japan, The Dark, and year's bests. She has been shortlisted for the Campbell Award for Best New Writer and her debut novella Scale-Bright has been nominated for the British SF Association Award.", "text": "6200 words, short story\nThe Petals Abide\nIn the womb-tank coded with thought and memory, Twoseret learned three things: that her life will be full of peace, that she will never die, and that she will know precisely one tragedy. These facts are absolute, untarnished by chance and impregnable to intervention.\nAfter that, petals started blooming in her mouth.\nThey come at dawn at a regulated hour; she knows to be awake with her mouth empty so she does not choke. A tickle in her throat, a pressure against tonsil, and they emerge fluttering: the shape of hands with spindly digits, the color of unlit space that demarcates empires. She likes to speculate whose hands they might be modeled on, or whether they are the quintessence of hands, a mannequin standard.\nThey are pristine and velvet, untouched by teeth and untainted by saliva: like no part of the body at all, no effort to resemble tissue or keratin.\nHere Twoseret finds her orders, in the capillaries that call to the light of accretion disks and press against her nerves in synesthetic licks. The petals are the flowers of prophecy, the blooms of destiny. As long as she follows their instructions, like any memorialist Twoseret stands deathless.\nShe arranges the petals, four, radiant—fingers pointing out, fluttering in the low salted wind, the heels of their palms held down by mosaic stones. A murmur of sun slants across unlighted velvet. She bends to read, sibyl to her own fate.\nThe city ground is a canvas, the avenues brushstrokes, history a palette. An avian view yields faces gone to carcass and archive, some self-portraits, others celebrating personal affection and past deeds—the war heroes, the founding scholars, the beloved siblings. Within these walls, nothing is forgotten. Outside them, everything is.\nTwoseret walks through parabola gates of porphyry and persimmons heavy on the bough, down bridges whose curves follow theta-rhythms. The petals have given her a course, a target.\nIt will be a channel, she expects, through which she may monitor a life and from that material suture together a new person. Broad edits are crude: a wholesale revision of a planet’s chronology, a rearrangement of civil wars and epidemics and sundry. The work she does, however, requires more finesse. In identity reassignment the subject must feel at home in their new path, natural to a strange career and family and spouse as though they have always lived this life. The more moving pieces there are, the more skilled a memorialist has to be. Twoseret counts herself one of the best in the city, if not the very best.\nThe only one to whom she conceded supremacy was Umaiyal, but ey is long gone.\nShe stops at the basin of faces, where bone dunes in a hundred twenty-seven colors—most visible, a few not—rotate hourly, resolving into the faces of the first memorialists. There, at the border of grinding femurs and fibulae, she finds a casket.\nThe edges of it are sharp as invasion, its casing radiant as war-beads, its lid heavy as regret. Around this a homunculus of encryption hovers, epidermis full of paradoxes clenched shut. She coaxes them open, by intuition and determination. Her routines grant her a surplus of leisure, and she’s spent it on dead languages, ciphers, puzzle-solving.\nShe expects a soldier, a spy, a politician of high standing. Those are ever the first to develop a taste for sedition. But once the homunculus has been whispered and peeled off, she finds instead a foreign assassin.\nBeneath a canopy of chameleon fish and isometry rosettes, she thaws the body. Their face is blunt, singed at temple and jawline by ecclesiastic tattoos. Their neck looks as though branded by bird beaks, their biceps abraded by bird claws. The marks of the Cotillion and the divine Song under which they march.\nThe assassin is armed too, but Twoseret is unconcerned, for the petals did not forecast that she will die today. When the fluids have been drained and the cryogenic phase deactivated, the assassin wakes: all at once, without the transitional stage between occluded cognition and full alertness. The gaze that latches onto Twoseret’s is clear and iridescent with corneal implants.\nThey jackknife and heave. A splat of saliva and bile, so black, so blue. Waking up this way is never pleasant, no more than being decanted from a tank. Twoseret has vivid recall of her own birth, her first breath and emergence, of volition beyond the crèche-parents.\nShe reads their name and gender as they come online. “Sujatha Sindh.” The name susurrates like parched leaves, from a language spoken on several Hegemonic constituents. Not entirely foreign, but the two empires have regular exchanges; citizens of one flee and become refugees in another, diasporic. Their descendants repeat the cycle.\nThe assassin gains their composure in turns, gray and shuddering, on their back then on their knees. Twoseret offers a hand; they take it. Long fingers, velvet where synthetic dermis has replaced fingerprints.\n“You have been sent to abduct or kill one of us,” Twoseret murmurs, off the dossier. “Did you choose a specific target or would any of us have done?”\n“My instructions were not discriminating.” Sujatha’s voice is a blasted echo, its wealth and timbre gouged out. Cotillion personnel wield their voices for sacred music, better than any weapon. Without that the assassin’s bite is much blunted.\nBecause they do not ask what their fate will be, Twoseret does not provide. Perhaps they already know, as surely as if they had read the same petals Twoseret did. She gives them her shoulder, her arm around the heft of a torso honed to swift retribution, limbs trained to kinetic poetry. Those too have been weakened, ligament augmens snipped off, bone enhancement ripped out. Where once there was puissance, now there is brittle mortality.\nMuscles spasm in Sujatha’s cheeks as they walk. It’s not the only part of them that trembles in withdrawal from the destruction of their voice. Twoseret imagines how it was done. An operation, painless. An appointment with precise instruments during which Sujatha was awake for every minute, nerves primed to open wounds. Dilated time.\nSujatha’s prison is a palimpsest of deep-sea salt and abyssal cold. Its frictive patterns convert to musical notations, echoing the voice of a deceased memorialist. The assassin gazes at the water. Their mouth parts, habit, but they press it shut.\n“It isn’t really a song,” Twoseret says.\n“All ordered sound is part of the eternal symphony. The birth of universes. The end of them. Entropic culmination and singularities.” Sujatha touches their throat. “I will not sully any of it with the voice I have now.”\nTwoseret does not present a secular objection—that sound is merely sound, can be synthesized and reproduced; that sound has no purchase without air, and what is a deific verity that cannot cross stars? She helps Sujatha settle into their bed of solid-state husks and slaughtered engine cores. Battle salvage is material for art. It speaks of Hegemonic peace spreading abroad, a reminder of the army’s might. What are memorialists and their city without the commanders and the troops, their strategies and victories?\nThat thought dogs the heel of another. “Who captured you?” For someone must have, an act of heroism and advancement.\nSujatha takes a cracked breath, perhaps weighing their tactics: to tell, to withhold. “A soldier. Oridel Nehetis.”\nTwoseret’s expression must have spoken louder than her silence. She corrects that. “I see,” she says, and seals the oceanic palimpsest between them.\n“Do you remember,” she asks one of her age-mates, “Umaiyal?”\nHis answer is interrupted by a trio of petals. He catches them as they fall, fans them like a spread of cards on the game board between him and Twoseret. “Yeah,” Riam says, reading his instructions, not disclosing them. “How goes it for em? The exception.”\nThe exception to have punctured the city’s skin from the inside. The exception to have left. Twoseret will never know how this was done, what deal was brokered, what Umaiyal’s petals spoke; whether this was mandate or Umaiyal’s volition. She only knew—knows—the loss like a suppurating hurt. Out there ey goes by Oridel, a good elegant name. Ey wears eir face differently too, sharp-boned and pearl-pale, chased in nacre that traces and wraps eir skull in place of a scalp. A short clip that Twoseret plays, over and over, with Umaiyal caught mid-chuckle. Wry and polished in dress uniform, eir throat a choker of respiratory implants for work in toxic battlefields. She wonders how many deaths ey has logged.\nUmaiyal once asked her what name she would take, out there, if she could leave. On a whim she picked Nehetis.\nTwoseret moves her piece, desultory, not much caring for the game’s result. “Ey’s as well as can be expected. Alive, certainly.”\n“So you don’t know either?” Riam flicks his head, apologetic. “Uncharitable of me. Not as if they would have let you keep in touch. I always thought if anyone got out, it’d be Umaiyal. And ey would take you with em.”\nUmaiyal never asked. One day ey was there, the next gone. Even eir clothes, eir jewelry: the nexus-choker of corneal opals, the eigenvector jacket she gave em.\n“I’m content here,” says Twoseret. “Aren’t we all?”\nThe petals yoke her to the prisoner’s cycles. She comes to know the palimpsest’s smell as well as that of her own bed, and Sujatha’s face as well as her own reflection. The questions she puts to the assassin are broad and she’s rarely interested in the answers, so much so it provokes Sujatha to say, “You aren’t what I would call an adequate interrogator.”\nTwoseret sinks her hand into the water, warm and viscous as gestation plasma. She imagines pulling Sujatha through it and the assassin coming out her side reborn, a blank canvas numinous with possibility. “I’m no interrogator. Would you like to talk about something else? Tell me secrets. Not state matters, just little things.”\nSujatha sits cross-legged, and despite the palimpsest distortion they look much better: they’ll never have their old strength back, nor their voice, but their colors are healthier. Umber rather than jaundiced sepia. “Why would I do that?”\nThere is an acid-edge of animus that Twoseret finds strangely personal. “To pass the time, as I can’t persuade you to sing and you wouldn’t learn origami or any of the games I’ve brought you.”\n“I play nothing well behind a prison cell, and I’m not a graceful loser.” The assassin cranes their neck back, looking up. From their perspective the world entire is sunlight filtered through depth, exegesis by fiber-optic sharks and hydrogen anemones. “There’s a dessert of egg yolk shaped like gilded drops that I indulge in to a fault. From each of my bed-partners I’ve collected a necklace, a scarf, a collar; as long as it’s been close to them like a garrote. In all my life I’ve fallen in love only once.”\n“Yes?” The barrier is permeable up to a point. Twoseret encounters soft resistance once her hands have sunk through to the wrist. “Tell me about love.”\nThey laugh, a stutter-bark of actuators guttering out. “You’ve never been happy. No species of love would be known to you.”\n“If happiness is freedom from deprivation and pain, then I’ve never known anything but.”\n“Happiness,” Sujatha says, “is more than that. You haven’t seen—”\n“Beyond this circle of existence,” Twoseret says, drawing up her knees and resting her chin on them, “the calculus of being distills to this: rule or be ruled. Under Hegemonic peace your past is robbed; under the Cotillion your future is sealed. There are only so many places for power, and most will never rise to them nor even see the path.”\nThe assassin blinks, a play of lamplight on black pearl in their irises. “You aren’t what I expected.”\n“Mindless, you mean? As long as I follow the petals, nothing is forbidden. The province of my mind belongs to me alone, and in that I have what most outside this city never will.”\nPerhaps some of that turns a key in Sujatha’s heart. For the assassin says, “I’ll tell you of my love. Much you won’t comprehend and have no basis with which to compare, but I’ll tell you.”\n“And I’ll tell you of mine.” Twoseret leans forward, her nose almost nuzzling the vertical tide. “We may surprise each other.”\n“The person I love is absolute, untarnished by loneliness and unsullied by lust. They require no justification to exist; they are beholden to no outer forces or obligations. Like the drive of a warship, but those require guidance and crew, hull and superstructure. Like a sun, but those has a finite age and obey greater forces. So,” Sujatha says, softly, “they are like the Song, given human body, human visage. And to think that is to blaspheme beyond absolution.”\n“Today, the person I love is shaped like a hole. But once upon a time that they had arms like polished teak, cheeks like bathyal amber, and eyes like lodestars.” Twoseret unrolls permutative paper in her lap, tears out a precise square. “When they couldn’t sleep they liked to keep their hands busy, and they’d fold this into animals neither of us has ever seen. Lava alligators and polar butterflies, thunder wasps and aquatic bees. They kept their hair very long, dipped in an attar of comets. I’d try to braid those paper things in it, but the hair was difficult of temper, just like their owner.”\nSujatha has flinched as though each of Twoseret’s sentences have pierced them, needle by needle under the nails. “That isn’t a person,” they say, voice tight. “That’s a childhood.”\n“Childhood is formative; no person springs into being fully-formed, like a sun or warship or holy music. Everyone has a past. That’s the definition of personhood.”\n“The larval stage of it, perhaps. The person someone becomes is honed by time, tempered by experience, the true shape.” The assassin frowns. “Do you fence, wrestle, or box? I feel the need to test you in combat.”\nTwoseret laughs and gazes with interest at the hard lines of Sujatha’s body. Umaiyal was built like a willow, but out there ey would have received combat augmens, and assiduous training would have changed em. “I don’t do any of that, and in your state you wouldn’t be able to defeat a child. I’ll play you any sort of game, conquer you in any sort of puzzle.”\n“You’re trying to offend me.”\n“Yes. No. But tell me more about your personal blasphemy.”\nThe assassin’s mouth curves then, tracing the arc of a blade. “The person I love has far more in common with me than you, than this city, than anything you know.”\nIt is, perhaps, not wrong. Twoseret puts two calligraphic avenues between them before she allows her hand to press against her sternum as though to staunch a wound. But her palms come away clean.\nIn her room, roofed by silver beaten chiffon-thin, she composes. On the malleable walls that submit to her nails, on the permutative paper that yields to her thumbs. She sketches the same figure again and again, an outline of slender limbs and rounded narrow shoulders. Then it becomes more sinuous and muscle-dense, shedding the eigenvector jacket and robe for something more martial. Close-cut uniform that gloves the body, a long coat with severe hem. Twoseret leaves out the sidearm.\nA visualization is not required, but she has always found it helpful. The petals give instruction and goal, but the means to achieve them are her own. She begins scanning her own memory segments. A person is gestalt. There is past, present, and the potential for the future.\nNow that Umaiyal is gone, of the entire city she is the best memorialist alive.\nTwoseret gazes through Sujatha’s eyes. She is almost Sujatha, for a while. Total immersion has its risks, but the best of her compositions often arise from that.\nSujatha’s meetings with Oridel-Umaiyal began at a distance, observing a figure limned in pale light through a corridor of spiral glass. A figure tall and compactly made, unrecognizable to Twoseret. Over weeks the assassin observed, followed.\nWas noticed, one day.\nAn eel-twist of the street where Umaiyal disappeared. The assassin sidestepped, turned in time to catch Umaiyal’s knife on an armguard. The blade locked; Sujatha pulled. Fell with Umaiyal as ey went down, hand on throat—precise pressure—and knees straddling arms.\nBoth held still: aortae marching to the same adrenal tempo, muscles stretched taut. Then Umaiyal smiled. “You’re very good,” ey said. “Galling as it is to admit, I’m no match for a Cotillion assassin. Had you wanted me dead, I would have been cremated a week ago. So what is it?”\nSujatha drew back slightly, caught by frankness. “Captain.”\n“Shall we get a drink? My treat.”\nThey did, and more than once. An uneasy negotiation, tenser for Sujatha than for Umaiyal. By their fifth meeting in a club of enameled ice, Umaiyal leaned forward and pulled the trigger on a question both of them had always circled around. “You targeted me for my background, didn’t you?”\nIn that club, at a table laden with conch-shell bowls, Sujatha stopped eating. Curved a hand around a glass, took a long, deliberate sip.\n“I can give you a way into that place. Only you’ll have to trust me.” Umaiyal drew closer. “That will be my gift to you.”\nIt takes Twoseret two heartbeats to realize that had been spoken to her. Meant for her ear, not Sujatha’s. It is not the only instance—many other times Umaiyal couched eir messages in conversations with the assassin. There’s a childhood place I miss, where the bones resolve into faces or Have you ever seen upside-down gardens?\nWhere I was born, Umaiyal said as ey stood watching the breaking of Sujatha’s voice, there’s a palimpsest that sings.\nAs Umaiyal put a stunned Sujatha in the casket, ey held the assassin’s hand, saying, “This is the closest I can get to going back.” A harsh breath inhaled. “This is the closest I can get to talking to you.” The lid clipped. “I’ll never be able to go back. I’m sorry I didn’t say goodbye. And I can’t explain. There are no petals here, but even so some things are forbidden. Some things are prophecy, and to disobey them is to accept death.”\nThe casket slipped shut.\nFor hours after, Twoseret is not herself. She remembers being in a stronger body; she remembers parts of the surgery that took her—their—voice. An immersive link to the subject’s memory doesn’t give her the subject’s feelings.\nNevertheless Sujatha’s want is plain, blazing gold across the fabric of their recall. “The person I love is absolute,” she says softly, startling herself when what comes out is not in Sujatha’s voice. The original voice brimming with Song, one with the code of existence.\nThe next time she visits the assassin, she brings a small drawer of perfumes captured in vials of chameleon jade. One takes on the texture of Twoseret’s palm as she handles it. “Do you know the scent?” she asks, opening a window through the prison-tide. “I’ve no idea if this is available outside. Probably it is. Some of us have hobbies but I don’t think anyone distills perfumes, so this must have come with a supply drop.”\nSujatha edges forward. Stiffens in recognition. “What of it?”\n“The person I love—” The euphemism, still. “Left this behind, even though they were some of eir favorites. No time to pack it, I suppose, and these bottles are so fragile. I don’t wear perfume, though. Do you?”\nNo answer.\n“It’ll spoil eventually, go rancid.” Twoseret pulls more vials out of their slots, idly rotating one between her fingers. “I could have the containers recycled. The perfume though, that’s a bit of a waste.”\n“Then I might as well accept them.”\n“There are other things, too.” Talking around and keeping up the pretense, like Umaiyal is the forbidden secret: profane or else too pure and wondrous a word to utter. “I’ll bring them. Clothes that don’t fit me, jewelry, and so on.”\nTwo sets of petal later, Sujatha smells and dresses a little like Umaiyal. They must know this, but do not object and seem content simply to have Umaiyal’s belongings next to their skin, scenting their clavicles. When Twoseret brings them a lattice necklace, their breath hitches: an object that’s lived next to Umaiyal’s throat.\nShe cannot claim to understand their terrible longing for Umaiyal; it seems so much, and burns so bright, for such distance and so little return. But it is there, their shared knot, and she makes use of it.\nDesire complicates, between to love and to want to be. A certain affinity between those two, she thinks, a bridge that can be built and directed. She makes more sketches of Sujatha, of Umaiyal as she remembers em. She compares and finds herself not dissatisfied. That will be my gift to you.\nOne day she lets down the prison, which after all was for effect rather than any real intent to cage. As the water cascades away and the kaleidoscope of sharks evaporates, the petals come. Twoseret cups her hands for them, spends half a minute absorbing their directives; when she looks up she finds the assassin staring at her, appalled. “It’s nothing,” she tries to explain. “It doesn’t hurt. This is only an artist’s whim made real by a biotech.”\n“It’s not all right,” Sujatha says, then surrenders to silence, as though even that thread of anger exhausts.\n“It’s more interesting than receiving messages the conventional way.” She folds her petals into her dress. By nighttime she will have to dispose of them properly, a ritual.\nSujatha tires easily, has to be eased down onto benches and soft grass. Twoseret eventually lets them rest at a fountain that gurgles gossamer pennants, translucent kites, streamers in soft copper and gold.\nEyes shut, the assassin says, “You don’t feel the limits of your world? You don’t find it confined, claustrophobic even? This place isn’t even large enough for fifty million. What’s up there isn’t a sky. This is all you will ever see, all the air you’ll ever breathe. What you do, how you live, it’s all bound up in those fucking flowers. Doesn’t it chafe? Doesn’t it choke?”\n“You are very angry,” Twoseret observes, “on behalf of someone you don’t know and hardly like. I have no illusions that you’d choose my society, given other choices. How can it matter if I live a constricted life, or one whose limits of liberty you disapprove?”\n“The person you love—” The words come out like retched poison. “Did they live like this?”\nShe catches a twist of streamer; it convulses around her wrist, prehensile, rose-touched platinum. “To that you already know the answer or you wouldn’t have asked. It’s a life. For most of mine, I never lacked for anything. I still don’t see why you were sent here, though; you obviously can’t get out.”\nThe assassin smiles a rictus. “As I came, I was transmitting my location. That stopped at a point, but the approximation is sufficient.”\n“This entire city can be moved.”\n“Very slowly. With considerable difficulty. It’d be a feat of years. Our ships are much faster, inescapable, will not be outraced. Of course negotiating the gravity snarl that protects this place would be a trick and a half, but the same maze that safeguards you also makes relocating the city . . . vexing.”\nTwoseret strokes Sujatha’s head the way she might soothe a distressed animal. The assassin’s hair used to be shoulder-length, in those memories, but it’s been growing since. Someday it will be long, serpentine, and she will find an attar of comets to anoint it full of light. “Will they attack?”\nA short laugh, that same noise of failing machines. “No. We only wanted some idea of where this might be, just in case. For that I gave my life, without regret. Acquiring this information for the cost of a single person is an extravagant bargain.”\n“Patriotism is very nice.” Twoseret has never experienced such a concept, but she means it. Belief—faith—in some vast, grand ideal must be reassuring. The notion that after one has passed, one’s contribution will live on as part of that ideal or, in this case, system of brutal oppression. Still, it’s certainly a greater thing than a single human being or even a billion.\n“You’re mocking me.” But this too is said listlessly, the annoyance perfunctory.\n“No, I think fervor is admirable. Passion is its own virtue. It animates. It can give an otherwise ordinary thing a terrible magnetism, an ensnaring brilliance . . . ” She unties the streamer and casts it forward, where it catches on an updraft, snapping toward the sky-that-is-not. “Oh, that’s why. All this time, you’ve been so weakened but there’s been this—fire? This gravity, this pull. I think that’s why ey decided on you.”\nSujatha’s head rises a fraction. “Decided like a calculation, the way you say it.”\n“It probably was. But not an exact thing, no, eir variables were more organic than numbers. Perhaps it had to do with how you moved, the way you sang, how your face was limned in profile at sunset. And always the fire that burns within you, visible between your teeth, behind your eyes.” She helps them to their feet. “Do you want to see the gardens? Ey loved those.”\nTwoseret continues sketching in her head, drawing points of like and unlike. A framework of contrast and potential markers for synaptic joints. In the swaying garden with its inverted field, she picks clusters of edible hydrangea, mangosteens the size of her thumb, syrup oranges with thin ripe peel about to burst. These and more she puts in Sujatha’s lap, absent the assassin’s interest. As the pile grows they pick at it, a bite here, a lick there. Inevitably they have juices running down their fingers, their chin, sticky and fragrant.\nShe thinks of kissing them away, drop by drop. In the end she unthinks it. Not the right person, not the right time. As of now they are both in love with an idea.\nTwoseret stirs to the city quaking and Sujatha’s shadow laying across her like whip-scars. “I know you’re awake,” the assassin says in that fractured, devoured voice. “We’re under attack.”\nShe peers up at them through her eyelashes. “From whom?”\n“Must you ask?”\n“But they’ll kill you too,” she points out calmly as she pushes to her elbows, dislodging sheets, baring shoulders and breasts. Baring, too, the places on her ribcage and waist where the incisions were made and implants seeded so she would be able to receive the petals each morning.\nSujatha’s gaze snags on those places and the cartography of their features shifts, sideways, to that region between disgust and fascination. It makes Twoseret want to say that the scars are quite all right: she chose to keep them when they could have been operated away to smoothness, leaving skin unmarred. Of course their horror is really for Umaiyal’s sake, the thought that Umaiyal once lived like this, bore these same scars. Still Sujatha is nearly tender, as though she’s a small child prone to spooking. “Are you in shock?”\n“Oh, no.” Her bed trembles as though a beast shaking itself from hibernation, sloughing off sleep and matted grass, or whatever it is that animals coming out of hibernation do. Paper moths flutter from their shelves. “I’m in full command of myself.” She doesn’t say that the petals came early today, and they did not instruct either Twoseret or the city to die. No doubt pointing that out will only distress the assassin.\nTwoseret stands all the way up, knows as she turns her back that Sujatha stares at the tiger-stripes up her spine that culminate at the top—below her nape—in a dainty port, flourished in nacre and tiny citrines. “You believed I’m incapable of love because I have never experienced its prerequisites. Is it so hard to believe I’m not panicking because I’ve had no experience of terror, of illness or fear of dying?”\n“Even a creature like you must retain her survival instinct.”\n“How wrong you are.” Twoseret shrugs into her dress of suede cuffs and amethyst whorls, the fabric whispering like origami in fire as it molds to her. “Umaiyal used to help me dress, pick my clothes. Ey had—still has, I should think—these long fingers, with calluses from the wood-carving ey used to do as a hobby. Ey wasn’t much good at it, though ey tried to make me birds.” The calluses would be different now. Imprints from wielding a chisel and from wielding a gun are nothing alike, she imagines.\n“Who?”\n“The person you and I love. Pretending further is obscene, isn’t it? I don’t know if ey ever gave you eir birth name.” She slides her shoes on, lavender gray, texture almost petal-like.\nSujatha presses their lips into a hard line and leads her by the hand. Twoseret is startled at the force of their grip, the limber grace of their stride, their familiarity with the puzzle-paths. An assassin would of course be able to map a place from memory, with speed and attention. Even so the unerring way with which they negotiate the city fills her heart, and their recovered strength makes her glad.\n“My superiors have given me up for dead,” Sujatha says as they emerge into artificial morning under the sky that is not. “So have I. For all intents and purposes I’m no longer alive; my presence makes no difference.”\n“But we’re running somewhere rubble can’t fall on us. A corpse doesn’t run.” Though ultimately the city’s swarm-bounds can shatter; the ceiling of Twoseret’s world is an unbearable weight, upheld by a thread of synaptic aegis. If it falls there will be no escaping it.\n“My sense of self-preservation hasn’t deserted me. Flight or fight.” But their expression creases as though they’d said something different, a thing of ache and thorn cupped on their tongue.\nA sudden ruthlessness seizes Twoseret. “This city holds the memory of the only person you’ve ever loved. While you breathe you won’t permit its destruction.”\nSujatha doesn’t meet her eyes. “I need a node I can broadcast from. This isn’t a full assault—a veilship or two, not much more. Just scouts.”\nOther memorialists have poured into the streets, as calm as Twoseret, intrigued by this new development. A few crèche-parents lead their charges by the hand, clear-eyed children from five to nine in various stages of wiring. By twelve they will be tested, and on success granted the petals. The sight of them draws a smile from her, reflexive and uncomplicated.\n“There are consoles we use for supply drops.” Routine communications for assigning and dividing up the items. There’s always abundance and most memorialists can have their pick, tools and luxuries and raw material with which to feed fabricators: steel for hair-ribbons, glass for skirts, a hundred types of gemstones for belts and bedspreads. Everyone wears jewels, is sheathed in it until skin and facets are one.\nTwin shadows press against the unsky, each the shape of a hornbill’s head. Another tremor sweeps through like a racking cough, or so Twoseret imagines, never having seen hypothermia in action. There are defenses, but she supposes absently that those must have been breached: they are automated, and while some memorialists know them well—Umaiyal did—most of them never train themselves to battle. The nearest military outpost is too far to make it in time. The city’s greatest protection has always been in its secrecy and location rather than firepower. She finds a wall and activates the console, feeding it a cluster of authentications like grapes, and steps aside.\nSujatha bends close, their breath fogging the obsidian curlicues that frame the console. Twoseret watches with avid interest as they connect to the Cotillion channel with a lover’s intimacy. “Veilship couplet, identify yourselves.”\nThe shaking pauses. From the console comes a low note, strain of music made by sighing woods and running currents.\n“Remotely piloted,” Sujatha murmurs, “as I thought. That’ll be easier.”\n“Yes?”\nThe assassin straightens and inhales. More affectation than any real need for oxygen, Twoseret expects. And they sing.\nSujatha’s voice makes a dirge for extinguished suns and singularistic contractions that kill worlds, for defeat in empty reaches that will go unknown and uncommemorated. It jolts Twoseret’s nerves, constricts her throat, pries at the seams of her flesh.\nWhen it ends Sujatha turns away, trembling slightly. “They will leave. It’s the only command override I can access now, with my voice the way it—in any case it won’t work a second time.”\n“It was exquisite.”\n“It was nothing of the sort.” The assassin sags, as though the song has leeched their arteries dry and drained their limbs of strength.\nUp above the shadows have disappeared. Twoseret catches the assassin. “You’re exhausted. Let’s get you somewhere to rest.”\nSujatha doesn’t resist or push her away. “I’ve been sleeping on grass, under trees.”\n“Then come to my bed. I’ll tuck you in.”\nIn the street, the crowd thins, memorialists returning to their duties and routines now that the excitement is past. Riam nods to Twoseret, perhaps guessing at her intent, giving tacit approval or merely mute indifference.\nShe frees the assassin from their shoes and vest, and eases them down between the sheets. She holds them until they fall limp and asleep, and very gently kisses their brow, their eyelids, the tip of their nose. Sujatha smells so right.\nWhen she is sure they are deep in dreams, she gathers up her composition and resumes her work. Making a person—an identity—is delicate labor, but it is a labor of love. She thinks she will keep the singing, to retain the best of both worlds, and sends out a request for the casket.\nTwoseret watches the sky for silhouettes of insects, vast, their wings enveloping half the city, their antennae slashing the horizon to segments. The outpost has become more attentive and sent them guardians since the attack. She never sees any of the soldiers, though she can imagine them helmeted and carapaced, animated statues of lustrous absence. Faceless, voiceless, nameless. She wonders if, far away, there is a war going on. A real one, sparked off by the assault here. On that the petals are silent.\nThe weather is getting warm, though never humid or uncomfortable. She’s taken to seed-pearl sandals and lighter dresses with skirts that snap like prayer flags in an assassin’s memory.\nShe kneels. A casket on the pavement, surrounded by mosaic pieces. The person in it has been sleeping a long time, nested in dreams of being reared by crèche-parents and of being wired; of pride when the first petals came. The casket is like the tank, incubating, preparing a sacred genesis.\nTwoseret begins to unlatch the lid. A fetus must push through eventually or be stillborn. That is rare, but she’s seen it happen. The locks and puzzles fall away quickly this time, decorative more than protective.\nEir hair has grown to eir waist. Thick frosted lashes twitch in sleep. A curl of cool breath, body temperature artificially lowered, rises to meet the thick air. Crossed wrists coiled in origami vipers. She runs her palm over eir forehead; she imagines to em the contact must feel like a flame tickling candle wax. In this way she thaws her dreamer, waking em with her own warmth. No fluid to drain, no instrument to detach—this was, almost, a simple and natural sleep.\nEy turns on eir side as though wishing to rest a little longer. Twoseret brushes eir hair, her fingertips grazing the side of eir neck. When eir eyes open, they are terribly clear: irises deeply brown, circumference gilded in amber. The scent of eir favorite perfume wafts, the angular folds of eir favorite vest rises and falls to eir breathing.\n“You always slept so heavily.” Twoseret takes em into her arms, helping them out of the casket. “Do I call you Oridel now? Captain Oridel Nehetis. It sounds all grand.”\nEy rubs at eir eyes, groggy, one of those slightly childish gestures—she’s never been able to break eir habit. “No, of course not. It’s been a while, hasn’t it? When did we have hornet fliers guarding our sky? God, I miss piloting those.”\n“Recent addition. I find their silhouette very charming. There’s so much to tell you.” She pecks em on the lips. “Welcome back, Umaiyal.”\nAnd Umaiyal laughs, in what is nearly eir voice, straightening to eir feet and taking her hand in that light-firm way that belongs to Umaiyal alone. “I’m home.”\nAt the moment of her birth, Twoseret learned three things: that her life will be full of peace, that she will never die, and that she will know precisely one tragedy. These facts are absolute, untarnished by chance and impregnable to intervention.\nAs she walks arm in arm with Umaiyal up the puzzle-paths, her tragedy falls away like pale chrysalis, dissipating on the mosaic tiles and dispersing in the low salted wind.\nWhen her next petals come she reads them and smiles, and casts them aside.\nBenjanun Sriduangkaew writes love letters to strange cities, beautiful bugs, and the future. Her work has appeared in Tor.com, Beneath Ceaseless Skies, Phantasm Japan, The Dark, and year's bests. She has been shortlisted for the Campbell Award for Best New Writer and her debut novella Scale-Bright has been nominated for the British SF Association Award.", "source": "https://clarkesworldmagazine.com/sriduangkaew_04_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Petals Abide by Benjanun Sriduangkaew"}