{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "GYVc+hWxbBhZSqXN5OkPw8zayr0=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Nebula Nominees and Reader's Poll Winners  Under normal conditions, I probably would have just launched into the results of our annual reader’s poll, but this month gave us something special. I’d like to take a moment to congratulate this year’s Nebula nominees. In particular, I’d like to call your attention to the short story category where three Clarkesworld stories have taken six of the nominations:  \r\n “Cat Pictures Please” by Naomi Kritzer (Clarkesworld 1/15)  “When Your Child Strays From God” by Sam J. Miller (Clarkesworld 7/15)  “Today I Am Paul” by Martin L. Shoemaker (Clarkesworld 8/15)  We are quite proud of our authors and wish them all the best. I’ll be on-hand at the Nebula Award Ceremony this year to cheer them on and I hope some of you are too.  One anecdote before we move on: I attended last year’s ceremony and accepted Sam’s story during the mass signing. I think this means I have to start doing more in-person story acceptances!  Still on the Nebula high, I decided to crack open my spreadsheet and start tallying this year’s reader’s poll results. The data is always interesting and it was nice to have so many readers participating this year. I was pleasantly surprised to see an influx of newer readers taking part this year. Welcome!  CONTEST  This year we included a special drawing for print and ebook copies of our latest anthology, Clarkesworld: Year Eight. Ten lucky winners were picked at random and have been notified by email. If you didn’t win, it’s now available for sale from the usual places.   COVER ART  1 - “Spring Day is Coming” by Liu Junwei 2 (TIE) - “Gate World” by Julie Dillon 2 (TIE) - “Megafauna Europa” by Julie Dillon  3 - “A-boushi-ya” by shichigoro-shingo This category is normally close but this year, there was a small gap between our winners and the cluster of eight remaining works with nearly equal vote totals. It seems as though some people had as much trouble picking their favorite as I did.  STORIES  \r\n “So Much Cooking” by Naomi Kritzer  “Yuanyuan’s Bubbles” by Liu Cixin, translated by Carmen Yiling Yan (tie)  “Cat Pictures Please” by Naomi Kritzer (tie) “Cassandra” by Ken Liu (tie)  “The Three Resurrections of Jessica Churchill” by Kelly Robson (tie) “Today I am Paul” by Martin L. Shoemaker (tie) Our readers had a clear favorite this year, but after that were often split. Despite a higher than normal number of voters this year, we still had a lot of ties. If we extended the list to the top five we’d have added five more stories. I’ll take that to mean you liked what we did last year.  Congratulations to all our winners and thanks to everyone for participating!  Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Nebula Nominees and Reader's Poll Winners\nUnder normal conditions, I probably would have just launched into the results of our annual reader’s poll, but this month gave us something special. I’d like to take a moment to congratulate this year’s Nebula nominees. In particular, I’d like to call your attention to the short story category where three Clarkesworld stories have taken six of the nominations:\n- “Cat Pictures Please” by Naomi Kritzer (Clarkesworld 1/15)\n- “When Your Child Strays From God” by Sam J. Miller (Clarkesworld 7/15)\n- “Today I Am Paul” by Martin L. Shoemaker (Clarkesworld 8/15)\nWe are quite proud of our authors and wish them all the best. I’ll be on-hand at the Nebula Award Ceremony this year to cheer them on and I hope some of you are too.\nOne anecdote before we move on: I attended last year’s ceremony and accepted Sam’s story during the mass signing. I think this means I have to start doing more in-person story acceptances!\nStill on the Nebula high, I decided to crack open my spreadsheet and start tallying this year’s reader’s poll results. The data is always interesting and it was nice to have so many readers participating this year. I was pleasantly surprised to see an influx of newer readers taking part this year. Welcome!\nCONTEST\nThis year we included a special drawing for print and ebook copies of our latest anthology, Clarkesworld: Year Eight. Ten lucky winners were picked at random and have been notified by email. If you didn’t win, it’s now available for sale from the usual places.\nCOVER ART\n1 - “Spring Day is Coming” by Liu Junwei\n2 (TIE) - “Gate World” by Julie Dillon\n2 (TIE) - “Megafauna Europa” by Julie Dillon\n3 - “A-boushi-ya” by shichigoro-shingo\nThis category is normally close but this year, there was a small gap between our winners and the cluster of eight remaining works with nearly equal vote totals. It seems as though some people had as much trouble picking their favorite as I did.\nSTORIES\n- “So Much Cooking” by Naomi Kritzer\n- “Yuanyuan’s Bubbles” by Liu Cixin, translated by Carmen Yiling Yan (tie)\n“Cat Pictures Please” by Naomi Kritzer (tie)\n- “Cassandra” by Ken Liu (tie)\n“The Three Resurrections of Jessica Churchill” by Kelly Robson (tie)\n“Today I am Paul” by Martin L. Shoemaker (tie)\nOur readers had a clear favorite this year, but after that were often split. Despite a higher than normal number of voters this year, we still had a lot of ties. If we extended the list to the top five we’d have added five more stories. I’ll take that to mean you liked what we did last year.\nCongratulations to all our winners and thanks to everyone for participating!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_03_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Nebula Nominees and Reader's Poll Winners by Neil Clarke"}