{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Aimee Ogden", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "CAUeW/I2kE+ybcMUUP3kwfjt0Ro=", "id": null, "license": null, "comments": "", "raw_text": "5540 words, short story  The Cold Calculations  Once upon a time, a little girl had to die. It’s just math. Wrong place, wrong time. Bad luck; too bad, so sad.  We’ve all heard such stories, told them, shared them, collected them. Not in the way that we collect trinkets; more like how a sock collects holes. We’re submerged in such stories, we breathe them in like carbon dioxide—poisonous, in the long term, but a fact of life, nonetheless.  But stories have authors, from the gauziest fantasy to grim autobiography. And when once upon a time becomes so many, many times, surely someone must think to ask: had to die? On whose authority?  It’s simple physics, of course. Natural law.  Unless, of course, someone’s been fudging the numbers.  Álvarez is standing beside the airlock as it cycles, pretending not to hear the girl cry.  If he acts like he can’t see her, can’t hear her, then at least he’s leaving her some dignity. Right?  As if there’s any dignity to be had in this godforsaken mess. As if it’s dignified to jump out of an airlock in nothing but a jumpsuit and your stockinged feet. As if anyone could have a reason to hold her head up high after she’s been told her dumbass little stowaway life is worth less than the razor-thin fuel margin that will safely decelerate this dropship when it reaches its destination.  The math is nauseatingly simple. There’s no other ship with a possible intercept course. There’s no other drop ship that can get the dying colonists at August Minor the nanotherapy antivirals they need. There’s no give in the physics of it all—only in the squishy human parts of the equation.  There’s still something wrong, here. Or, if not wrong, then at least not right. Álvarez just can’t put his finger on what, yet.  The airlock clanks; it’s fully dilated on this side, now. The kid blows her nose on her sleeve. Sharra. Her name is Sharra. She deserves the dignity of a name, at least. “Thank you,” she says. Her voice doesn’t break. God, how does her voice not break? “For trying.”  She’s walking to her death to save him, a man twice her age, and a bunch of colonists she’ll never meet, and she’s thanking him? This isn’t the big wrongness, the one that’s underlined every moment since he pulled her out of the nanotherapy storage capsule, but it’s a damned big one anyway. When she lets go of the loop and floats up toward the airlock, he grabs her by the sleeve—too hard—so that she bounces lightly against the inside hull of the drop ship. “No,” he says, into her too-close face. “No, fuck this. We’ll figure something out. We will.”  That’s when she starts crying for real: not when she thinks she’s about to die, but when God sends something down the mountain and there’s still a chance it might be a ram. When the tears get too big, they float up from her face and pelt him, like rain in reverse. He grabs her and crushes her against him, and she cries like he thinks babies must cry before they get taught that pain is something to hide.  “It’s not right,” he says, into the top of her head. He never had kids—a drop ship pilot’s life is not exactly conducive to parenthood—but for a moment, this one, little dumbass stowaway that she is, is his kid, is every kid. “We never should have had to make the—”  “—choice.” Mollie Maggia’s sisters talk in whispers. In the back room of the little tenement apartment, Mollie is sleeping; Mollie is dying. “Money or health. Money or your life. The bastards. What else were we supposed to do?”  Their mother is at the stove, stirring the sauce for supper. Every now and then, she puts a hand in her pocket and fingers the pitted black tooth that lies at the bottom, the latest one collected from Mollie’s mouth. When she closes her eyes, she remembers the first time Mollie came home from the watch factory with a gleaming greenish smile. How they’d all exclaimed, how they’d laughed. My pretty girl, she’d said. So proud. Such a good living, such a good girl. My beauty.  She would take this pain away from her daughter and make it her own, if she could. She digs harder with her wooden spoon, scraping the bottom of the pot, and doesn’t wipe away the sweat that rolls into her eyes. This is her daughter—and even if she wasn’t, even if she were someone else’s, good God, she’s only twenty-four, still a child. The spoon clatters to the floor and Mrs. Maggia leans against the kitchen wall. Who are they, the factory owners and foremen and faceless scientists in their white coats, to put this on her? Some man at a desk, totting up columns in his ledger: profit on this side, little girls’ lives on the other. Who gave them the right?  No one gave them the right. It’s something that they took. And it’s not something one woman can snatch back all on her own, not even when the little girl who had to die upon that time was her very own.  Armed only with the cheap-ass screwdrivers from the ship’s repair kit, Álvarez and the kid do their best to tear the drop ship apart. The ship wasn’t outfitted with the proper tools to be strip-mined from the inside out; hindsight is, as ever, a bitch. Together they chuck anything they can get out the airlock: cleaning supplies, every last scrap of food, Álvarez’s spare uniform and all of his bedding that can be torn loose from the wall. They even manage to rip up one of the metal panels lining the ship’s interior, one that hadn’t been screwed in squarely. The rest are flush and refuse to budge. The lone panel goes out the airlock anyway, one more piece of space junk. Hopefully it doesn’t become another drop ship’s urgent problem someday—but space is big, and the inside of the drop ship is small.  They do the math, with each piece of mass that goes flying off on a new career as interstellar jetsam. They crunch the numbers—and the numbers crunch back. It’s not enough. Not enough to add up to a single scrawny kid with her whole damn life ahead of her.  If he could flush the whole water system and run dry all the way into August Minor, that would be more than enough. But he can’t find a manual release, not on the hardware itself and not in the emergency handbook in his handheld, and there’s an emergency rationing shutoff if he tries to draw too much at once. Water water everywhere, and not a drop to sink.  “I’ll do it,” Sharra says, as he curses out the plumbing. Her tone is leaden; too bad he can’t throw that out the airlock. “It’s my fault anyway. I wanted to see my mom and dad. They’ll die along with everyone else, if these supplies don’t get there in time. It’s fine.”  “It’s not fine!” He punches the water filtration unit, which does no harm other than sending him rebounding across the ship. “Just let me think. There’s something I’m missing, I know it.” There must be a way out. No one had to—  “—die.” Russayev mops his brow with a handkerchief as he and Yuri trudge together up the cement-block stairwell. They keep moving, their voices buried beneath the echo of their footfalls. It’s not safe to stop; every ear is always listening. It’s not safe to return to Russayev’s apartment; if the Party hasn’t bugged it yet, that’s due only to incompetence, not will.  “No one had to die.” Yuri Gagarin is only thirty-four, and he moves heavily, like an old man. Guilt lays extra weight across his shoulders. When a man lays down his life for yours, that’s a weight you’ll carry the rest of your days. Vladimir Komarov knew what he was doing, who he was saving, when he stepped aboard the Soyuz-1. “But he did anyway. We all knew the flight was doomed. They knew it too.”  His lips barely move around the word they. Best not to say aloud who they are, to name a thing gives it power, and Yuri holds too little power already to surrender more. He keeps folders full of well-creased papers inscribed with pleas for his help: dear Comrade Gagarin, Esteemed Hero of the USSR; can he not pull the strings to secure an officer’s commission for this excellent young man, can he not see that this good daughter of the Fatherland be admitted to university despite her father’s Jewish heritage? Can he not snap his fingers and make medicine, food, housing rain down upon the comrades who esteem him so?  He cannot. He cannot, could not even when he had friends in the Politburo, and he has only enemies there now. Komarov died to save a hero of the Soviet Union who has never really existed.  He fumbles for a cigarette, but his pocket is empty. Russayev produces a pair, and they smoke in silence, finally still, as the air grays around them.  “I should have done something else to keep him grounded,” Yuri says, the words floating out of him on his smoky breath. Dangerous words, and the smoke does nothing to obscure the truth of them.  Russayev shakes his head, holding the smoke in. “They had already made up their minds.” The nebulous they again, an all-hearing hobgoblin invoked if his name is spoken thrice. “No evidence could have changed that. There was nothing to be done.” He claps Yuri’s shoulder firmly, briefly. Yuri has forgotten his jacket and Russayev’s hand is cold through his shirt. “I should go.”  He should. Yuri stays, sitting alone on the stairs, smoking until only ash remains. Ash, and doubt. Like guilt, doubt is a cruel master to bear for the rest of one’s life. But, Yuri knows, even then, he has not so much life left ahead of him that he cannot bear it, for a little while. His knuckles tap restlessly against the battered aluminum tread on the step.  Guilt is often all that’s left when what we should be feeling—anger—is an inconvenience to the people with blood on their hands and fingers on the scale.  The data refuse to make sense. Fucking rude, if you ask Álvarez.  He queries and re-queries his interface station, poring over the numbers, until his anxiously firing neurons finally strike a connection. The naughty data resolves into one vicious big picture. He knows what it is he’s been missing. Oh god, does he know what it is.  His jolt of hysterical laughter brings the kid’s head up. “What?” she demands. She bobs over his shoulder, almost hitting her head on the bulkhead, to peer at the interface. As if she can make heads or tails of the techno-jumble on the screen. “What is it?”  “The launch,” he says. “Christ. The launch.” He highlights one particular figure in red. “It’s not just the deceleration. There was extra mass on board when we were accelerating, too.” Her blank, frightened face wakes an obscure anger in him. He swipes one arm hard, wiping away the calculation display. “Even if I did push you out the airlock—fuck, I’m not going to do that, I said ‘even if I did’—there’s still not enough fuel left for me all on my own.” The margin was razor-thin; the kind of margin you could cut yourself open on. He rides another wave of hysterical laughter into dissociation, into the euphoria of perfect understanding. “We’ve been fucked since the get-go.”  She stares at him. Her eyes are huge and dark in the big gray moon of her stupid sixteen-year-old face. “I killed you,” she says. “I killed you. I killed you I killed you I—”  She’s beating her own head and chest and shoulders with her fists, and Christ, Álvarez has never done zero-g wrestling before, let alone with somebody half his size whose dumbass head he would just as soon not split on the bulkhead, because if they’re both going to die out here, and they are, why the fuck should they have to do it alone?  When she’s calmer (which is certainly not to say calm), he produces a small plastic pouch from inside his flight suit. Her lips curls at the sight of it. “That’s extra mass.” It sounds like a curse word, the way she says it.  “I know. I was planning to piss it out the airlock pretty soon here.” He opens the outside lid and squeezes some of the liquid inside into his mouth, then offers it to her. She takes a tiny sip and gags, sending tiny spheres of whiskey into orbit around Álvarez. She shoves the flask back at him; he takes it with a shrug. Plastic-flavored liquor is better than none. It’s not really enough to take the edge off. It was meant to be a victory toast upon a successful touchdown, not an opportunity for self-medication. But it seems a damn shame to waste it.  “I hate physics,” she says as he takes another pull.  He wipes his mouth with the back of his hand. Gone already. The caramel flavor lingers on the back of his tongue. “No, you don’t.”  “I’m allowed to hate the thing that’s killing me.”  “It’s not physics that’s killing us.” He throws the empty pouch at the inside of the airlock door. It bounces off and spins lazily across the inside of the drop ship. “It’s some accountant in Winnipeg who fucked us over to save the company some cash.” Whose cold calculation was it? How much did it save? Twenty, thirty thousand bucks. A single externality: one small human life. Cheap as hell, all things considered. “Money’s all that counts. Who cares what happens to the likes of—”  “—us?” Ha Wan shouts into the railroad foreman’s face, so that his spittle flecks the man’s brown beard. Perhaps he would take a swing at the foreman, too; but with what? One of his arms terminates just below the elbow, the other at the narrow point of a wrist. Sweat crowns his forehead, and the sour stench of sickness clings to him, to the stained bandages on the stumps of his arms. There is a list, on the foreman’s table, of employees to be paid for their time. Ha Wan’s name is not on it. “My family depends on me!”  The foreman doesn’t speak Cantonese, and the fever has curtained off whatever part of Ha Wan the English words occupy. Would it matter, if the foreman understood him? What would that change? His countrymen pull him away from the table, before the foreman’s bully boys can intervene. They try to lead him back to his cot, but he pulls away before they can stuff him back inside the hot, half-dark tent. They do not follow as he stumbles out into the scrubby highlands. Each of them is exhausted, too, spirits hammered flat with every blow of their iron mallets, every blast of dynamite. And how far can he go, they ask themselves, alone, on foot?  Not far. Dizziness catches him first, then exhaustion, and he crashes knees-first into the side of a boxcar laden with lumber for the new line. Bright new lines of pain crawl up through the dull, enveloping ache, and the morphine haze; he has scraped his back on the rough metal. Two drops of blood strike the sandy soil. In the dust-scratched sunlight, they already look faded and brown. Ha Wan is only surprised that he has blood left to lose.  Alone, what difference can one human being make? More than you think. Change comes incrementally. This is a symphony—not a solo.  Álvarez is supposed to be sleeping. Instead, he and the girl drift in silence, separately. Less than sixteen hours out from August Minor now.  He thinks the kid’s asleep, her breathing uninterrupted by hitches and starts. A polyp of snot hangs by a thread from her upper lip, and her face looks sunken, dehydrated.  Grief is exhausting. But Álvarez isn’t tired. There’s an artery beating a staccato fringecore rhythm in his neck and an acid burn at the back of his throat. Periodically, he reminds himself that he absolutely cannot throw up right now.  He and the kid have fallen into opposing patterns, her spinning in place roughly clockwise, him counterclockwise. They’ve only known each other a little while, but there’s a strange sense of belonging here, this person inextricably tied to him over the course of hours in a way that feels like DNA, or more than that, like she’s sprung fully formed from the bulkhead of his own ship. A fractal spiderweb of veins spreads at her temples, maps to places that have never existed and never will.  For another few rotations, Álvarez studies these subtle geometries, seeking the kind of organic understanding that doesn’t come from math anyway. Then he uses one hand to quietly push himself toward the computer. One more set of numbers to crunch, between her and oblivion.  The math doesn’t cooperate willingly. But Álvarez doesn’t ask nicely. He smashes the physics wide open like his own personal piñata, bashing it with calculations on fuel reserves and trajectories and human gravitational tolerance. There should have been fail-safes and backups, extra reserves. There should have been possibilities—possibilities other than the company literally nickel-and-diming two people to their deaths. There should have been a world where this story has a happy ending.  No, fuck that: there should be a world where this story has an ending at all. Because as Álvarez sees it, staring down the sawed-off barrel of the ugly math, staring down the long line of failures and accidents and miscalculations just like this one, it’s never actually gotten around to ending before. It’s the same goddamn story, told over and over in a Moebius loop of tragedy. Once upon a time, the people in charge told some peons they had to die, so they did. Rinse and repeat.  He pauses, eyes unfocused, staring into his screen until the numbers blur and run. How much pain has he already poured into this job? The backaches, the solitude, the exoskeleton he has to cram himself into whenever he gets to spend a hot minute on the ground somewhere. Pain is the only truly renewable resource, and it’s the only asset the corporation has never stinted with.  He swipes away his calculation and keys in a simple message. Then he pushes off and glides silently across the capsule, to the airlock control. His hands aren’t shaking. He thought he’d be more nervous, but his neurological system can’t work up to a proper panic: dulled by the booze or short-circuited by the recent excess of adrenaline.  The cover flips up. He flexes his hands; he’ll have to move fast, before the kid realizes what’s happening. He keys in the control sequence.  The first door cycles open. He moves.  A wiry hand latches onto the back of his suit. “No!” the girl screams, as they flip end over end away from the airlock, a graceless ballet. “No! No! Don’t!”  “Let go! Shit—” He struggles to free himself, but her grip is strong, and she clings to his back like a strangling vine. “I wasn’t going to push you!”  “I know what you were going to do!” Her shriek in his ear makes him wince and they rebound together off the far bulkhead. “You can’t!”  “I can.” He doesn’t want to hurt her, is the problem. It’s like wrestling a lizard, one of those tiny little wall-climbers that were always all over the house where he grew up in Iowa, fast and sneaky but so small and fragile. He tries to pull her up and over his head. “Let go!”  She’s less concerned about hurting him. Her fingers snag tight in his jumpsuit, and she draws blood through the cheap fabric. “Dammit!” he hisses, but the jolt of pain is enough for him to tear her loose. He pushes her away and the momentum sends him flying toward the airlock, her away from it.  She scrambles to reorient herself—too slow. He keys the code on the other side and the airlock seals itself shut between them. “It’s okay!” he shouts, through the metal door. She bangs on the other side, swearing viciously. “The ground crew at August Minor will talk you through deceleration. You don’t have to land a ship; they’ll be able to send a local shuttle up for you.”  “This isn’t fair!” she screams, which is a stupid-ass thing to say, but she’s young, so he lets it go. “Stop it! Stop it! You can’t do this!”  “Again, I think you’ll find I can.” He grins crookedly, then remembers she can’t see him. “I’ve made my decision. It’s okay. In fact, I’ve never been more sure in—”  “—my life!” Humasha’s fingernails have splintered against the brown-stained stone of the garment factory wall. It’s already ninety degrees in Savar Upazila, and the dust and humidity make her feel as if she’s breathing mud. “Child, there are still people alive under there, I swear it. Help me dig!”  She doesn’t know the young woman standing beside her; she doesn’t work on Humasha’s line. A cut in her forehead has masked half her face in dust-caked blood; a careless hand has painted bruising all around the wound too. “Auntie, no!” Either she’s younger than Humasha guessed, or fear throws her voice high and small. “Come away from there. It’s not stable!”  Humasha does not come away. The building wasn’t stable when they walked in to work that morning, either, or any other day that week. Some accountant, perhaps on the other side of the world, had decided that a sturdier factory wasn’t worth cutting into the profit margin on cheap T-shirts. “Didn’t you hear me, girl?” One lump of rubble comes away, under her weight; there are so many, many more that remain, and the voices of the trapped are small and far and frightened. Lost in a man-made underworld. Somewhere, above ground or below, someone is weeping. “They are still alive down there.”  The girl shuffles back. Blood drips from the point of her chin onto her pink shari: one spot, two, three. A constellation in miniature. “And I don’t want to join them, auntie!”  Humasha is not young, but age has not made her weak. Her ankles and knees pop as she forces herself upright and grabs the girl by the wrist. “You think you’re better than them?” she snaps. “You are spared? Special?” She shakes the girl by the arm. “It’s luck that we’re up here and they aren’t. That’s all. You hear? It could always be you, next time. You know that? You want someone else to dig—when it’s you at the bottom of the heap?”  The girl yanks her arm, twisting it out of Humasha’s grasp. They both stumble; the girl catches herself first and sets her feet. She does not look at Humasha’s face, but she kneels and forces her fingers into the crack between two broken fragments of what used to be a wall. “There shouldn’t be a next time,” she mutters and winces as she leans back against the rock’s recalcitrant mass.  “Shouldn’t,” says Humasha, leaving ten tracks of her own blood on the opposite side of the stone. She pushes, the girl pulls, the rock tumbles free. “Fill your belly with shouldn’t and see how long ’til you’re hungry again.”  There is another stone, beneath the first, and they set their strength against that too. There is always another stone.  Have you been following along closely? We’re coming to the hands-on portion of the exercise.  Don’t feel guilty. Find your anger.  You’re going to need it.  The girl pounds on the closed airlock; she smashes the keypad, but she doesn’t know the magical password to reveal the secret passage.  The astronaut reaches for the internal keypad. It’s cold in the airlock, and his fingers shake; he mistypes the code the first time. He puts his hands in his armpits to snatch a last moment’s warmth. Perhaps he should have recorded a message, for his sister and her family. Too late now. Too late. But this is the only thing left for him. This is the right thing, because all the other options that remain are too ugly to choose.  The girl hasn’t stopped screaming. She’s so loud they must be able to hear her on August Minor, he thinks, and his lips fail to fit themselves into a smile. Loud enough to wake the dead.  “It’s not fair!” she howls again. “Someone do something!”  But there isn’t anyone left who could, or would.  Is there?  Somewhere, sometime, a man sits behind his desk, killing a girl with the stroke of his pen. Not because he hates her; he feels nothing for her at all. To him she is a simple tool, an externality. An inconvenient hunk of mass. It’s never his fault that she dies, of course, even as he damns her over and over again. He’s just doing his job. We must, the men at desks insist, chalk her death up to the cold uncaring universe in which we live.  That’s the point, of course. Pay no attention to the man behind the curtain.  Physics are impersonal, the fabric of reality, the canvas onto which we paint our lives. Physics existed before us. Math was created by human beings; and that is why math knows how to be cruel.  Other things than cruelty can still be taught, given time. Given opportunity.  If one man can kill a girl with the stroke of a pen, what can the rest of us do?  It’s easy to decry his callousness, to raise our voices and shout over him. But this girl is not Tinkerbell, and a show of hands and a little noise will not be enough to bring her back. It’s not enough, it never was, just to point at the evil and name it for what it is (though that is the starting place).  Feel your feet on the floor, or the line where your back meets your chair. You’re stronger than you think. There are some desks that need to be flipped, and they need you to flip them.  Some of them are heavy, but don’t worry: you won’t be expected to set your shoulder to them alone. Some of those desks will have men behind them, clutching pens and indignation. Some people will be very upset at the very notion of a desk that’s the wrong side up.  But there’s a girl out there whose life is hanging in the balance. She’s going to need you to get out in front and push.  Yes, you.  All of you.  So push already.  It’s not fair!  Mollie Maggia’s mother pounds her fists against the kitchen wall: one, then the other. Then both. Again. It’s not fair, it’s not fair, her little girl, her angel, rotting alive in her own bed. She leans into the wall with all her weight, driving her grief into the cheap plaster, and when her other daughters run into the kitchen to see what’s wrong, she slaps them away and slams her whole body against the wall so that the little apartment trembles in its foundations. “Not one more girl,” she sobs, and she shouldn’t be crying, not in front of her daughters, grown women themselves, but there is a blackened tooth in her pocket, and it weighs a thousand pounds, and she pushes her whole being into the door under that terrible weight. “Not someone else’s baby.”  Someone do something!  Yuri’s knuckles twist harder into the aluminum strip on the stair. He grinds his fist down, though the rough pattern scrapes off a layer of skin and the blood squeezes between his clenched fingers. He could have stepped in. It could have been him instead. It should never have to be anyone else, not again. He pushes his hand into the stair until the bones in his wrists grind together.  It’s not fair!  There can be, under the weight of injustice, a certain terrible strength, and it weaves itself into Ha Wan’s muscle and bone. His legs flex and the air drives out of his body as he puts his back against the boxcar. His foot almost slips on the gravel, but he centers his weight and pushes again. There is a soft wail, like the call of a far-off locomotive, and it is coming from his throat. One more great thrust, the scrapes in his back tearing anew, and the front wheel of the boxcar squeals its dismay. It does not tip over, though he would like it to, for the railroad runs on suffering as much as coal. But he pushes anyway.  Someone do something!  Humasha and the girl aren’t alone. The emergency responders, the neighborhood, they dig together. They keep digging. There are people in the rubble. There are lives that might yet be saved, rock by rock, pebble by pebble, every last one worth the price in blood and toil to bring it into the light of the sun. “Push!” a medic yells, and six men and women set their shoulders against a fallen-in wall. They strain, someone curses, another groans. The wall shifts, and the wall moves. Daylight crawls over the cracked table that had been hidden underneath. A hand emerges, stretching, trembling. More hands reach down to meet it.  You, too. It might not feel like much, your little body fighting the terrible gravity of that cold arithmetic.  But it is so much. It’s everything. It’s all there is.  So push!  “It’s not—”  The entire drop ship decelerates as if slapped by the careless hand of God. Álvarez is thrown against the side of the airlock under the unexpected arrival of G-forces; the girl’s cry is cut off as she too is flung aside.  Shit. Shit. What the shit was that? He mashes in the code to open up the internal airlock again, even though it’s going to be a hundred times harder to get past the kid this time, he has to make sure she’s not concussed or hemorrhaging or otherwise a waste of a goddamn sacrifice.  She’s got a bloody nose, which has made a nightmarish three-dimensional abstract painting of the drop ship’s interior, but seems otherwise mostly unharmed. “What was that?” she asks, voice thick with blood and confusion. “Did we hit something?”  “Couldn’t have. We wouldn’t be here to have this conversation at all.” He nudges her aside to check his screens. Nothing out of the ordinary, all systems green. Except—  If a man at a desk can kill a girl with a little bit of ink, then we can save her in exactly the same way. There are more of us than there are of him. Break his pen, throw it out the window, and send the desk after it.  “This can’t be right.” He checks the readout again, double-checks it; does a quick-and-dirty visual verification against the star field visible through the porthole over his head. It can’t be right. And yet, it is.  “What’s wrong?”  Too much for him to sum up, too much to explain away, except in one little word: “Nothing.” He bobs aside and shows her the screen that projects their trajectory toward August Minor. Everything is, impossibly, green. “We’ll make planetfall just ahead of schedule. Six hundred twelve, local planetary time.”  She doesn’t blink, as if closing her eyes on the display will wipe it from existence. “That’s impossible.”  “Yup.”  “How could that have happened?”  “Couldn’t have.”  She clings to the pilot’s seat, adrift, still fixed on the readout. The glow of the screen paints her over with a pale green glow, and when she smiles slowly, her teeth shine in the dark drop ship. “Now what?”  Álvarez doesn’t have an easy answer for her. When a miracle hands your life back to you, what do you do with that? How can you ever pay it back?  “I guess . . . I guess now I’ll go home. Back to Earth, I mean.” Home can mean a lot of different things to a drop ship pilot. The ship hums gently around them, anthropomorphically innocent, as if it didn’t nearly become their mutual coffin.  “Home.” She’s staring at the screens, as if not blinking for a solid minute will make the readouts comprehensible to her. For her, home is the people waiting on August Minor. “Why Earth?”  “Well, that’s where Company HQ is. Thought I’d pay them a visit.” He keys in the deceleration sequence and smiles, his lips pulling tight over his dry teeth. Miracles are hungry things. He’ll feed this one by living long enough to be a pain in the company’s ass. “There’s a few desks there that I’d like to flip.”  Pain is a renewable resource.  Time to see how well it burns. Aimee Ogden is a former software tester and science teacher; now she writes stories about sad astronauts and space mermaids. Her debut novella “Sun-Daughters, Sea-Daughters” is a 2021 Nebula finalist, and her short fiction has appeared in publications such as Lightspeed, Analog, and Beneath Ceaseless Skies, as well as previously in Clarkesworld. She also co-edits Translunar Travelers Lounge, a magazine of fun and optimistic speculative fiction.", "text": "5540 words, short story\nThe Cold Calculations\nOnce upon a time, a little girl had to die. It’s just math. Wrong place, wrong time. Bad luck; too bad, so sad.\nWe’ve all heard such stories, told them, shared them, collected them. Not in the way that we collect trinkets; more like how a sock collects holes. We’re submerged in such stories, we breathe them in like carbon dioxide—poisonous, in the long term, but a fact of life, nonetheless.\nBut stories have authors, from the gauziest fantasy to grim autobiography. And when once upon a time becomes so many, many times, surely someone must think to ask: had to die? On whose authority?\nIt’s simple physics, of course. Natural law.\nUnless, of course, someone’s been fudging the numbers.\nÁlvarez is standing beside the airlock as it cycles, pretending not to hear the girl cry.\nIf he acts like he can’t see her, can’t hear her, then at least he’s leaving her some dignity. Right?\nAs if there’s any dignity to be had in this godforsaken mess. As if it’s dignified to jump out of an airlock in nothing but a jumpsuit and your stockinged feet. As if anyone could have a reason to hold her head up high after she’s been told her dumbass little stowaway life is worth less than the razor-thin fuel margin that will safely decelerate this dropship when it reaches its destination.\nThe math is nauseatingly simple. There’s no other ship with a possible intercept course. There’s no other drop ship that can get the dying colonists at August Minor the nanotherapy antivirals they need. There’s no give in the physics of it all—only in the squishy human parts of the equation.\nThere’s still something wrong, here. Or, if not wrong, then at least not right. Álvarez just can’t put his finger on what, yet.\nThe airlock clanks; it’s fully dilated on this side, now. The kid blows her nose on her sleeve. Sharra. Her name is Sharra. She deserves the dignity of a name, at least. “Thank you,” she says. Her voice doesn’t break. God, how does her voice not break? “For trying.”\nShe’s walking to her death to save him, a man twice her age, and a bunch of colonists she’ll never meet, and she’s thanking him? This isn’t the big wrongness, the one that’s underlined every moment since he pulled her out of the nanotherapy storage capsule, but it’s a damned big one anyway. When she lets go of the loop and floats up toward the airlock, he grabs her by the sleeve—too hard—so that she bounces lightly against the inside hull of the drop ship. “No,” he says, into her too-close face. “No, fuck this. We’ll figure something out. We will.”\nThat’s when she starts crying for real: not when she thinks she’s about to die, but when God sends something down the mountain and there’s still a chance it might be a ram. When the tears get too big, they float up from her face and pelt him, like rain in reverse. He grabs her and crushes her against him, and she cries like he thinks babies must cry before they get taught that pain is something to hide.\n“It’s not right,” he says, into the top of her head. He never had kids—a drop ship pilot’s life is not exactly conducive to parenthood—but for a moment, this one, little dumbass stowaway that she is, is his kid, is every kid. “We never should have had to make the—”\n“—choice.” Mollie Maggia’s sisters talk in whispers. In the back room of the little tenement apartment, Mollie is sleeping; Mollie is dying. “Money or health. Money or your life. The bastards. What else were we supposed to do?”\nTheir mother is at the stove, stirring the sauce for supper. Every now and then, she puts a hand in her pocket and fingers the pitted black tooth that lies at the bottom, the latest one collected from Mollie’s mouth. When she closes her eyes, she remembers the first time Mollie came home from the watch factory with a gleaming greenish smile. How they’d all exclaimed, how they’d laughed. My pretty girl, she’d said. So proud. Such a good living, such a good girl. My beauty.\nShe would take this pain away from her daughter and make it her own, if she could. She digs harder with her wooden spoon, scraping the bottom of the pot, and doesn’t wipe away the sweat that rolls into her eyes. This is her daughter—and even if she wasn’t, even if she were someone else’s, good God, she’s only twenty-four, still a child. The spoon clatters to the floor and Mrs. Maggia leans against the kitchen wall. Who are they, the factory owners and foremen and faceless scientists in their white coats, to put this on her? Some man at a desk, totting up columns in his ledger: profit on this side, little girls’ lives on the other. Who gave them the right?\nNo one gave them the right. It’s something that they took. And it’s not something one woman can snatch back all on her own, not even when the little girl who had to die upon that time was her very own.\nArmed only with the cheap-ass screwdrivers from the ship’s repair kit, Álvarez and the kid do their best to tear the drop ship apart. The ship wasn’t outfitted with the proper tools to be strip-mined from the inside out; hindsight is, as ever, a bitch. Together they chuck anything they can get out the airlock: cleaning supplies, every last scrap of food, Álvarez’s spare uniform and all of his bedding that can be torn loose from the wall. They even manage to rip up one of the metal panels lining the ship’s interior, one that hadn’t been screwed in squarely. The rest are flush and refuse to budge. The lone panel goes out the airlock anyway, one more piece of space junk. Hopefully it doesn’t become another drop ship’s urgent problem someday—but space is big, and the inside of the drop ship is small.\nThey do the math, with each piece of mass that goes flying off on a new career as interstellar jetsam. They crunch the numbers—and the numbers crunch back. It’s not enough. Not enough to add up to a single scrawny kid with her whole damn life ahead of her.\nIf he could flush the whole water system and run dry all the way into August Minor, that would be more than enough. But he can’t find a manual release, not on the hardware itself and not in the emergency handbook in his handheld, and there’s an emergency rationing shutoff if he tries to draw too much at once. Water water everywhere, and not a drop to sink.\n“I’ll do it,” Sharra says, as he curses out the plumbing. Her tone is leaden; too bad he can’t throw that out the airlock. “It’s my fault anyway. I wanted to see my mom and dad. They’ll die along with everyone else, if these supplies don’t get there in time. It’s fine.”\n“It’s not fine!” He punches the water filtration unit, which does no harm other than sending him rebounding across the ship. “Just let me think. There’s something I’m missing, I know it.” There must be a way out. No one had to—\n“—die.” Russayev mops his brow with a handkerchief as he and Yuri trudge together up the cement-block stairwell. They keep moving, their voices buried beneath the echo of their footfalls. It’s not safe to stop; every ear is always listening. It’s not safe to return to Russayev’s apartment; if the Party hasn’t bugged it yet, that’s due only to incompetence, not will.\n“No one had to die.” Yuri Gagarin is only thirty-four, and he moves heavily, like an old man. Guilt lays extra weight across his shoulders. When a man lays down his life for yours, that’s a weight you’ll carry the rest of your days. Vladimir Komarov knew what he was doing, who he was saving, when he stepped aboard the Soyuz-1. “But he did anyway. We all knew the flight was doomed. They knew it too.”\nHis lips barely move around the word they. Best not to say aloud who they are, to name a thing gives it power, and Yuri holds too little power already to surrender more. He keeps folders full of well-creased papers inscribed with pleas for his help: dear Comrade Gagarin, Esteemed Hero of the USSR; can he not pull the strings to secure an officer’s commission for this excellent young man, can he not see that this good daughter of the Fatherland be admitted to university despite her father’s Jewish heritage? Can he not snap his fingers and make medicine, food, housing rain down upon the comrades who esteem him so?\nHe cannot. He cannot, could not even when he had friends in the Politburo, and he has only enemies there now. Komarov died to save a hero of the Soviet Union who has never really existed.\nHe fumbles for a cigarette, but his pocket is empty. Russayev produces a pair, and they smoke in silence, finally still, as the air grays around them.\n“I should have done something else to keep him grounded,” Yuri says, the words floating out of him on his smoky breath. Dangerous words, and the smoke does nothing to obscure the truth of them.\nRussayev shakes his head, holding the smoke in. “They had already made up their minds.” The nebulous they again, an all-hearing hobgoblin invoked if his name is spoken thrice. “No evidence could have changed that. There was nothing to be done.” He claps Yuri’s shoulder firmly, briefly. Yuri has forgotten his jacket and Russayev’s hand is cold through his shirt. “I should go.”\nHe should. Yuri stays, sitting alone on the stairs, smoking until only ash remains. Ash, and doubt. Like guilt, doubt is a cruel master to bear for the rest of one’s life. But, Yuri knows, even then, he has not so much life left ahead of him that he cannot bear it, for a little while. His knuckles tap restlessly against the battered aluminum tread on the step.\nGuilt is often all that’s left when what we should be feeling—anger—is an inconvenience to the people with blood on their hands and fingers on the scale.\nThe data refuse to make sense. Fucking rude, if you ask Álvarez.\nHe queries and re-queries his interface station, poring over the numbers, until his anxiously firing neurons finally strike a connection. The naughty data resolves into one vicious big picture. He knows what it is he’s been missing. Oh god, does he know what it is.\nHis jolt of hysterical laughter brings the kid’s head up. “What?” she demands. She bobs over his shoulder, almost hitting her head on the bulkhead, to peer at the interface. As if she can make heads or tails of the techno-jumble on the screen. “What is it?”\n“The launch,” he says. “Christ. The launch.” He highlights one particular figure in red. “It’s not just the deceleration. There was extra mass on board when we were accelerating, too.” Her blank, frightened face wakes an obscure anger in him. He swipes one arm hard, wiping away the calculation display. “Even if I did push you out the airlock—fuck, I’m not going to do that, I said ‘even if I did’—there’s still not enough fuel left for me all on my own.” The margin was razor-thin; the kind of margin you could cut yourself open on. He rides another wave of hysterical laughter into dissociation, into the euphoria of perfect understanding. “We’ve been fucked since the get-go.”\nShe stares at him. Her eyes are huge and dark in the big gray moon of her stupid sixteen-year-old face. “I killed you,” she says. “I killed you. I killed you I killed you I—”\nShe’s beating her own head and chest and shoulders with her fists, and Christ, Álvarez has never done zero-g wrestling before, let alone with somebody half his size whose dumbass head he would just as soon not split on the bulkhead, because if they’re both going to die out here, and they are, why the fuck should they have to do it alone?\nWhen she’s calmer (which is certainly not to say calm), he produces a small plastic pouch from inside his flight suit. Her lips curls at the sight of it. “That’s extra mass.” It sounds like a curse word, the way she says it.\n“I know. I was planning to piss it out the airlock pretty soon here.” He opens the outside lid and squeezes some of the liquid inside into his mouth, then offers it to her. She takes a tiny sip and gags, sending tiny spheres of whiskey into orbit around Álvarez. She shoves the flask back at him; he takes it with a shrug. Plastic-flavored liquor is better than none. It’s not really enough to take the edge off. It was meant to be a victory toast upon a successful touchdown, not an opportunity for self-medication. But it seems a damn shame to waste it.\n“I hate physics,” she says as he takes another pull.\nHe wipes his mouth with the back of his hand. Gone already. The caramel flavor lingers on the back of his tongue. “No, you don’t.”\n“I’m allowed to hate the thing that’s killing me.”\n“It’s not physics that’s killing us.” He throws the empty pouch at the inside of the airlock door. It bounces off and spins lazily across the inside of the drop ship. “It’s some accountant in Winnipeg who fucked us over to save the company some cash.” Whose cold calculation was it? How much did it save? Twenty, thirty thousand bucks. A single externality: one small human life. Cheap as hell, all things considered. “Money’s all that counts. Who cares what happens to the likes of—”\n“—us?” Ha Wan shouts into the railroad foreman’s face, so that his spittle flecks the man’s brown beard. Perhaps he would take a swing at the foreman, too; but with what? One of his arms terminates just below the elbow, the other at the narrow point of a wrist. Sweat crowns his forehead, and the sour stench of sickness clings to him, to the stained bandages on the stumps of his arms. There is a list, on the foreman’s table, of employees to be paid for their time. Ha Wan’s name is not on it. “My family depends on me!”\nThe foreman doesn’t speak Cantonese, and the fever has curtained off whatever part of Ha Wan the English words occupy. Would it matter, if the foreman understood him? What would that change? His countrymen pull him away from the table, before the foreman’s bully boys can intervene. They try to lead him back to his cot, but he pulls away before they can stuff him back inside the hot, half-dark tent. They do not follow as he stumbles out into the scrubby highlands. Each of them is exhausted, too, spirits hammered flat with every blow of their iron mallets, every blast of dynamite. And how far can he go, they ask themselves, alone, on foot?\nNot far. Dizziness catches him first, then exhaustion, and he crashes knees-first into the side of a boxcar laden with lumber for the new line. Bright new lines of pain crawl up through the dull, enveloping ache, and the morphine haze; he has scraped his back on the rough metal. Two drops of blood strike the sandy soil. In the dust-scratched sunlight, they already look faded and brown. Ha Wan is only surprised that he has blood left to lose.\nAlone, what difference can one human being make? More than you think. Change comes incrementally. This is a symphony—not a solo.\nÁlvarez is supposed to be sleeping. Instead, he and the girl drift in silence, separately. Less than sixteen hours out from August Minor now.\nHe thinks the kid’s asleep, her breathing uninterrupted by hitches and starts. A polyp of snot hangs by a thread from her upper lip, and her face looks sunken, dehydrated.\nGrief is exhausting. But Álvarez isn’t tired. There’s an artery beating a staccato fringecore rhythm in his neck and an acid burn at the back of his throat. Periodically, he reminds himself that he absolutely cannot throw up right now.\nHe and the kid have fallen into opposing patterns, her spinning in place roughly clockwise, him counterclockwise. They’ve only known each other a little while, but there’s a strange sense of belonging here, this person inextricably tied to him over the course of hours in a way that feels like DNA, or more than that, like she’s sprung fully formed from the bulkhead of his own ship. A fractal spiderweb of veins spreads at her temples, maps to places that have never existed and never will.\nFor another few rotations, Álvarez studies these subtle geometries, seeking the kind of organic understanding that doesn’t come from math anyway. Then he uses one hand to quietly push himself toward the computer. One more set of numbers to crunch, between her and oblivion.\nThe math doesn’t cooperate willingly. But Álvarez doesn’t ask nicely. He smashes the physics wide open like his own personal piñata, bashing it with calculations on fuel reserves and trajectories and human gravitational tolerance. There should have been fail-safes and backups, extra reserves. There should have been possibilities—possibilities other than the company literally nickel-and-diming two people to their deaths. There should have been a world where this story has a happy ending.\nNo, fuck that: there should be a world where this story has an ending at all. Because as Álvarez sees it, staring down the sawed-off barrel of the ugly math, staring down the long line of failures and accidents and miscalculations just like this one, it’s never actually gotten around to ending before. It’s the same goddamn story, told over and over in a Moebius loop of tragedy. Once upon a time, the people in charge told some peons they had to die, so they did. Rinse and repeat.\nHe pauses, eyes unfocused, staring into his screen until the numbers blur and run. How much pain has he already poured into this job? The backaches, the solitude, the exoskeleton he has to cram himself into whenever he gets to spend a hot minute on the ground somewhere. Pain is the only truly renewable resource, and it’s the only asset the corporation has never stinted with.\nHe swipes away his calculation and keys in a simple message. Then he pushes off and glides silently across the capsule, to the airlock control. His hands aren’t shaking. He thought he’d be more nervous, but his neurological system can’t work up to a proper panic: dulled by the booze or short-circuited by the recent excess of adrenaline.\nThe cover flips up. He flexes his hands; he’ll have to move fast, before the kid realizes what’s happening. He keys in the control sequence.\nThe first door cycles open. He moves.\nA wiry hand latches onto the back of his suit. “No!” the girl screams, as they flip end over end away from the airlock, a graceless ballet. “No! No! Don’t!”\n“Let go! Shit—” He struggles to free himself, but her grip is strong, and she clings to his back like a strangling vine. “I wasn’t going to push you!”\n“I know what you were going to do!” Her shriek in his ear makes him wince and they rebound together off the far bulkhead. “You can’t!”\n“I can.” He doesn’t want to hurt her, is the problem. It’s like wrestling a lizard, one of those tiny little wall-climbers that were always all over the house where he grew up in Iowa, fast and sneaky but so small and fragile. He tries to pull her up and over his head. “Let go!”\nShe’s less concerned about hurting him. Her fingers snag tight in his jumpsuit, and she draws blood through the cheap fabric. “Dammit!” he hisses, but the jolt of pain is enough for him to tear her loose. He pushes her away and the momentum sends him flying toward the airlock, her away from it.\nShe scrambles to reorient herself—too slow. He keys the code on the other side and the airlock seals itself shut between them. “It’s okay!” he shouts, through the metal door. She bangs on the other side, swearing viciously. “The ground crew at August Minor will talk you through deceleration. You don’t have to land a ship; they’ll be able to send a local shuttle up for you.”\n“This isn’t fair!” she screams, which is a stupid-ass thing to say, but she’s young, so he lets it go. “Stop it! Stop it! You can’t do this!”\n“Again, I think you’ll find I can.” He grins crookedly, then remembers she can’t see him. “I’ve made my decision. It’s okay. In fact, I’ve never been more sure in—”\n“—my life!” Humasha’s fingernails have splintered against the brown-stained stone of the garment factory wall. It’s already ninety degrees in Savar Upazila, and the dust and humidity make her feel as if she’s breathing mud. “Child, there are still people alive under there, I swear it. Help me dig!”\nShe doesn’t know the young woman standing beside her; she doesn’t work on Humasha’s line. A cut in her forehead has masked half her face in dust-caked blood; a careless hand has painted bruising all around the wound too. “Auntie, no!” Either she’s younger than Humasha guessed, or fear throws her voice high and small. “Come away from there. It’s not stable!”\nHumasha does not come away. The building wasn’t stable when they walked in to work that morning, either, or any other day that week. Some accountant, perhaps on the other side of the world, had decided that a sturdier factory wasn’t worth cutting into the profit margin on cheap T-shirts. “Didn’t you hear me, girl?” One lump of rubble comes away, under her weight; there are so many, many more that remain, and the voices of the trapped are small and far and frightened. Lost in a man-made underworld. Somewhere, above ground or below, someone is weeping. “They are still alive down there.”\nThe girl shuffles back. Blood drips from the point of her chin onto her pink shari: one spot, two, three. A constellation in miniature. “And I don’t want to join them, auntie!”\nHumasha is not young, but age has not made her weak. Her ankles and knees pop as she forces herself upright and grabs the girl by the wrist. “You think you’re better than them?” she snaps. “You are spared? Special?” She shakes the girl by the arm. “It’s luck that we’re up here and they aren’t. That’s all. You hear? It could always be you, next time. You know that? You want someone else to dig—when it’s you at the bottom of the heap?”\nThe girl yanks her arm, twisting it out of Humasha’s grasp. They both stumble; the girl catches herself first and sets her feet. She does not look at Humasha’s face, but she kneels and forces her fingers into the crack between two broken fragments of what used to be a wall. “There shouldn’t be a next time,” she mutters and winces as she leans back against the rock’s recalcitrant mass.\n“Shouldn’t,” says Humasha, leaving ten tracks of her own blood on the opposite side of the stone. She pushes, the girl pulls, the rock tumbles free. “Fill your belly with shouldn’t and see how long ’til you’re hungry again.”\nThere is another stone, beneath the first, and they set their strength against that too. There is always another stone.\nHave you been following along closely? We’re coming to the hands-on portion of the exercise.\nDon’t feel guilty. Find your anger.\nYou’re going to need it.\nThe girl pounds on the closed airlock; she smashes the keypad, but she doesn’t know the magical password to reveal the secret passage.\nThe astronaut reaches for the internal keypad. It’s cold in the airlock, and his fingers shake; he mistypes the code the first time. He puts his hands in his armpits to snatch a last moment’s warmth. Perhaps he should have recorded a message, for his sister and her family. Too late now. Too late. But this is the only thing left for him. This is the right thing, because all the other options that remain are too ugly to choose.\nThe girl hasn’t stopped screaming. She’s so loud they must be able to hear her on August Minor, he thinks, and his lips fail to fit themselves into a smile. Loud enough to wake the dead.\n“It’s not fair!” she howls again. “Someone do something!”\nBut there isn’t anyone left who could, or would.\nIs there?\nSomewhere, sometime, a man sits behind his desk, killing a girl with the stroke of his pen. Not because he hates her; he feels nothing for her at all. To him she is a simple tool, an externality. An inconvenient hunk of mass. It’s never his fault that she dies, of course, even as he damns her over and over again. He’s just doing his job. We must, the men at desks insist, chalk her death up to the cold uncaring universe in which we live.\nThat’s the point, of course. Pay no attention to the man behind the curtain.\nPhysics are impersonal, the fabric of reality, the canvas onto which we paint our lives. Physics existed before us. Math was created by human beings; and that is why math knows how to be cruel.\nOther things than cruelty can still be taught, given time. Given opportunity.\nIf one man can kill a girl with the stroke of a pen, what can the rest of us do?\nIt’s easy to decry his callousness, to raise our voices and shout over him. But this girl is not Tinkerbell, and a show of hands and a little noise will not be enough to bring her back. It’s not enough, it never was, just to point at the evil and name it for what it is (though that is the starting place).\nFeel your feet on the floor, or the line where your back meets your chair. You’re stronger than you think. There are some desks that need to be flipped, and they need you to flip them.\nSome of them are heavy, but don’t worry: you won’t be expected to set your shoulder to them alone. Some of those desks will have men behind them, clutching pens and indignation. Some people will be very upset at the very notion of a desk that’s the wrong side up.\nBut there’s a girl out there whose life is hanging in the balance. She’s going to need you to get out in front and push.\nYes, you.\nAll of you.\nSo push already.\nIt’s not fair!\nMollie Maggia’s mother pounds her fists against the kitchen wall: one, then the other. Then both. Again. It’s not fair, it’s not fair, her little girl, her angel, rotting alive in her own bed. She leans into the wall with all her weight, driving her grief into the cheap plaster, and when her other daughters run into the kitchen to see what’s wrong, she slaps them away and slams her whole body against the wall so that the little apartment trembles in its foundations. “Not one more girl,” she sobs, and she shouldn’t be crying, not in front of her daughters, grown women themselves, but there is a blackened tooth in her pocket, and it weighs a thousand pounds, and she pushes her whole being into the door under that terrible weight. “Not someone else’s baby.”\nSomeone do something!\nYuri’s knuckles twist harder into the aluminum strip on the stair. He grinds his fist down, though the rough pattern scrapes off a layer of skin and the blood squeezes between his clenched fingers. He could have stepped in. It could have been him instead. It should never have to be anyone else, not again. He pushes his hand into the stair until the bones in his wrists grind together.\nIt’s not fair!\nThere can be, under the weight of injustice, a certain terrible strength, and it weaves itself into Ha Wan’s muscle and bone. His legs flex and the air drives out of his body as he puts his back against the boxcar. His foot almost slips on the gravel, but he centers his weight and pushes again. There is a soft wail, like the call of a far-off locomotive, and it is coming from his throat. One more great thrust, the scrapes in his back tearing anew, and the front wheel of the boxcar squeals its dismay. It does not tip over, though he would like it to, for the railroad runs on suffering as much as coal. But he pushes anyway.\nSomeone do something!\nHumasha and the girl aren’t alone. The emergency responders, the neighborhood, they dig together. They keep digging. There are people in the rubble. There are lives that might yet be saved, rock by rock, pebble by pebble, every last one worth the price in blood and toil to bring it into the light of the sun. “Push!” a medic yells, and six men and women set their shoulders against a fallen-in wall. They strain, someone curses, another groans. The wall shifts, and the wall moves. Daylight crawls over the cracked table that had been hidden underneath. A hand emerges, stretching, trembling. More hands reach down to meet it.\nYou, too. It might not feel like much, your little body fighting the terrible gravity of that cold arithmetic.\nBut it is so much. It’s everything. It’s all there is.\nSo push!\n“It’s not—”\nThe entire drop ship decelerates as if slapped by the careless hand of God. Álvarez is thrown against the side of the airlock under the unexpected arrival of G-forces; the girl’s cry is cut off as she too is flung aside.\nShit. Shit. What the shit was that? He mashes in the code to open up the internal airlock again, even though it’s going to be a hundred times harder to get past the kid this time, he has to make sure she’s not concussed or hemorrhaging or otherwise a waste of a goddamn sacrifice.\nShe’s got a bloody nose, which has made a nightmarish three-dimensional abstract painting of the drop ship’s interior, but seems otherwise mostly unharmed. “What was that?” she asks, voice thick with blood and confusion. “Did we hit something?”\n“Couldn’t have. We wouldn’t be here to have this conversation at all.” He nudges her aside to check his screens. Nothing out of the ordinary, all systems green. Except—\nIf a man at a desk can kill a girl with a little bit of ink, then we can save her in exactly the same way. There are more of us than there are of him. Break his pen, throw it out the window, and send the desk after it.\n“This can’t be right.” He checks the readout again, double-checks it; does a quick-and-dirty visual verification against the star field visible through the porthole over his head. It can’t be right. And yet, it is.\n“What’s wrong?”\nToo much for him to sum up, too much to explain away, except in one little word: “Nothing.” He bobs aside and shows her the screen that projects their trajectory toward August Minor. Everything is, impossibly, green. “We’ll make planetfall just ahead of schedule. Six hundred twelve, local planetary time.”\nShe doesn’t blink, as if closing her eyes on the display will wipe it from existence. “That’s impossible.”\n“Yup.”\n“How could that have happened?”\n“Couldn’t have.”\nShe clings to the pilot’s seat, adrift, still fixed on the readout. The glow of the screen paints her over with a pale green glow, and when she smiles slowly, her teeth shine in the dark drop ship. “Now what?”\nÁlvarez doesn’t have an easy answer for her. When a miracle hands your life back to you, what do you do with that? How can you ever pay it back?\n“I guess . . . I guess now I’ll go home. Back to Earth, I mean.” Home can mean a lot of different things to a drop ship pilot. The ship hums gently around them, anthropomorphically innocent, as if it didn’t nearly become their mutual coffin.\n“Home.” She’s staring at the screens, as if not blinking for a solid minute will make the readouts comprehensible to her. For her, home is the people waiting on August Minor. “Why Earth?”\n“Well, that’s where Company HQ is. Thought I’d pay them a visit.” He keys in the deceleration sequence and smiles, his lips pulling tight over his dry teeth. Miracles are hungry things. He’ll feed this one by living long enough to be a pain in the company’s ass. “There’s a few desks there that I’d like to flip.”\nPain is a renewable resource.\nTime to see how well it burns.\nAimee Ogden is a former software tester and science teacher; now she writes stories about sad astronauts and space mermaids. Her debut novella “Sun-Daughters, Sea-Daughters” is a 2021 Nebula finalist, and her short fiction has appeared in publications such as Lightspeed, Analog, and Beneath Ceaseless Skies, as well as previously in Clarkesworld. She also co-edits Translunar Travelers Lounge, a magazine of fun and optimistic speculative fiction.", "source": "https://clarkesworldmagazine.com/ogden_12_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Cold Calculations by Aimee Ogden"}