{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Vandana Singh", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "nGTpWGz4mVt/ANLlz+3ZAE90aUY=", "id": null, "license": null, "comments": "", "raw_text": "11530 words, novelette, REPRINT  Infinities   An equation means nothing to me unless it expresses a thought of God.  —Srinivasa Ramanujan, Indian mathematician (1887-1920) Abdul Karim is his name. He is a small, thin man, precise to the point of affectation in his appearance and manner. He walks very straight; there is gray in his hair and in his short, pointed beard. When he goes out of the house to buy vegetables, people on the street greet him respectfully. “Salaam, Master sahib,” they say, or “Namaste, Master Sahib,” according to the religion of the speaker. They know him as the mathematics master at the municipal school. He has been there so long that he sees the faces of his former students everywhere: the autorickshaw driver Ramdas who refuses to charge him, the man who sells paan from a shack at the street corner, with whom he has an account, who never reminds him when his payment is late—his name is Imran and he goes to the mosque far more regularly than Abdul Karim.  They all know him, the kindly mathematics master, but he has his secrets. They know he lives in the old yellow house, where the plaster is flaking off in chunks to reveal the underlying brick. The windows of the house are hung with faded curtains that flutter tremulously in the breeze, giving passersby an occasional glimpse of his genteel poverty—the threadbare covers on the sofa, the wooden furniture as gaunt and lean and resigned as the rest of the house, waiting to fall into dust. The house is built in the old-fashioned way about a courtyard, which is paved with brick except for a circular omission where a great litchi tree grows. There is a high wall around the courtyard, and one door in it that leads to the patch of wilderness that was once a vegetable garden. But the hands that tended it—his mother’s hands—are no longer able to do more than hold a mouthful of rice between the tips of the fingers, tremblingly conveyed to the mouth. The mother sits nodding in the sun in the courtyard while the son goes about the house, dusting and cleaning as fastidiously as a woman. The master has two sons—one is in distant America, married to a gori bibi, a white woman—how unimaginable! He never comes home and writes only a few times a year. The wife writes cheery letters in English that the master reads carefully with finger under each word. She talks about his grandsons, about baseball (a form of cricket, apparently), about their plans to visit, which never materialize. Her letters are as incomprehensible to him as the thought that there might be aliens on Mars, but he senses a kindness, a reaching out, among the foreign words. His mother has refused to have anything to do with that woman.  The other son has gone into business in Mumbai. He comes home rarely, but when he does he brings with him expensive things—a television set, an air-conditioner. The TV is draped reverently with an embroidered white cloth and dusted every day but the master can’t bring himself to turn it on. There is too much trouble in the world. The air-conditioner gives him asthma so he never turns it on, even in the searing heat of summer. His son is a mystery to him—his mother dotes on the boy but the master can’t help fearing that this young man has become a stranger, that he is involved in some shady business. The son always has a cell phone with him and is always calling nameless friends in Mumbai, bursting into cheery laughter, dropping his voice to a whisper, walking up and down the pathetically clean drawing-room as he speaks. Although he would never admit it to anybody other than Allah, Abdul Karim has the distinct impression that his son is waiting for him to die. He is always relieved when his son leaves.  Still, these are domestic worries. What father does not worry about his children? Nobody would be particularly surprised to know that the quiet, kindly master of mathematics shares them also. What they don’t know is that he has a secret, an obsession, a passion that makes him different from them all. It is because of this, perhaps, that he seems always to be looking at something just beyond their field of vision, that he seems a little lost in the cruel, mundane world in which they live.  He wants to see infinity.  It is not strange for a mathematics master to be obsessed with numbers. But for Abdul Karim, numbers are the stepping stones, rungs in the ladder that will take him (Inshallah!) from the prosaic ugliness of the world to infinity.  When he was a child he used to see things from the corners of his eyes. Shapes moving at the very edge of his field of vision. Haven’t we all felt that there was someone to our left or right, darting away when we turned our heads? In his childhood he had thought they were farishte, angelic beings keeping a watch over him. And he had felt secure, loved, nurtured by a great, benign, invisible presence.  One day he asked his mother:  “Why don’t the farishte stay and talk to me? Why do they run away when I turn my head?”  Inexplicably to the child he had been, this innocent question led to visits to the Hakim. Abdul Karim had always been frightened of the Hakim’s shop, the walls of which were lined from top to bottom with old clocks. The clocks ticked and hummed and whirred while tea came in chipped glasses and there were questions about spirits and possessions, and bitter herbs were dispensed in antique bottles that looked at though they contained djinns. An amulet was given to the boy to wear around his neck; there were verses from the Qur’an he was to recite every day. The boy he had been sat at the edge of the worn velvet seat and trembled; after two weeks of treatment, when his mother asked him about the farishte, he had said:  “They’re gone.”  That was a lie.   My theory stands as firm as a rock; every arrow directed against it will quickly return to the archer. How do I know this? Because I have studied it from all sides for many years; because I have examined all objections which have ever been made against the infinite numbers; and above all because I have followed its roots, so to speak, to the first infallible cause of all created things.  —Georg Cantor, German mathematician (1845-1918) In a finite world, Abdul Karim ponders infinity. He has met infinities of various kinds in mathematics. If mathematics is the language of Nature, then it follows that there are infinities in the physical world around us as well. They confound us because we are such limited things. Our lives, our science, our religions are all smaller than the cosmos. Is the cosmos infinite? Perhaps. As far as we are concerned, it might as well be.  In mathematics there is the sequence of natural numbers, walking like small, determined soldiers into infinity. But there are less obvious infinities as well, as Abdul Karim knows. Draw a straight line, mark zero on one end and the number one at the other. How many numbers between zero and one? If you start counting now, you’ll still be counting when the universe ends, and you’ll be nowhere near one. In your journey from one end to the other you’ll encounter the rational numbers and the irrational numbers, most notably the transcendentals. The transcendental numbers are the most intriguing—you can’t generate them from integers by division, or by solving simple equations. Yet in the simple number line there are nearly impenetrable thickets of them; they are the densest, most numerous of all numbers. It is only when you take certain ratios like the circumference of a circle to its diameter, or add an infinite number of terms in a series, or negotiate the countless steps of infinite continued fractions, do these transcendental numbers emerge. The most famous of these is, of course, pi, 3.14159 . . . , where there is an infinity of non-repeating numbers after the decimal point. The transcendentals! Theirs is a universe richer in infinities than we can imagine.  In finiteness—in that little stick of a number line—there is infinity. What a deep and beautiful concept, thinks Abdul Karim! Perhaps there are infinities in us too, universes of them.  The prime numbers are another category that capture his imagination. The atoms of integer arithmetic, the select few that generate all other integers, as the letters of an alphabet generate all words. There are an infinite number of primes, as befits what he thinks of as God’s alphabet . . .  How ineffably mysterious the primes are! They seem to occur at random in the sequence of numbers: 2, 3, 5, 7, 11 . . . There is no way to predict the next number in the sequence without actually testing it. No formula that generates all the primes. And yet, there is a mysterious regularity in these numbers that has eluded the greatest mathematicians of the world. Glimpsed by Riemann, but as yet unproven, there are hints of order so deep, so profound, that it is as yet beyond us.  To look for infinity in an apparently finite world—what nobler occupation for a human being, and one like Abdul Karim, in particular?  As a child he questioned the elders at the mosque: What does it mean to say that Allah is simultaneously one, and infinite? When he was older he read the philosophies of Al Kindi and Al Ghazali, Ibn Sina and Iqbal, but his restless mind found no answers. For much of his life he has been convinced that mathematics, not the quarrels of philosophers, is the key to the deepest mysteries.  He wonders whether the farishte that have kept him company all his life know the answer to what he seeks. Sometimes, when he sees one at the edge of his vision, he asks a question into the silence. Without turning around.  Is the Riemann Hypothesis true?  Silence.  Are prime numbers the key to understanding infinity?  Silence.  Is there a connection between transcendental numbers and the primes?  There has never been an answer.  But sometimes, a hint, a whisper of a voice that speaks in his mind. Abdul Karim does not know whether his mind is playing tricks upon him or not, because he cannot make out what the voice is saying. He sighs and buries himself in his studies.  He reads about prime numbers in Nature. He learns that the distribution of energy level spacings of excited uranium nuclei seem to match the distribution of spacings between prime numbers. Feverishly he turns the pages of the article, studies the graphs, tries to understand. How strange that Allah has left a hint in the depths of atomic nuclei! He is barely familiar with modern physics—he raids the library to learn about the structure of atoms.  His imagination ranges far. Meditating on his readings, he grows suspicious now that perhaps matter is infinitely divisible. He is beset by the notion that maybe there is no such thing as an elementary particle. Take a quark and it’s full of preons. Perhaps preons themselves are full of smaller and smaller things. There is no limit to this increasingly fine graininess of matter.  How much more palatable this is than the thought that the process stops somewhere, that at some point there is a pre-preon, for example, that is composed of nothing else but itself. How fractally sound, how beautiful if matter is a matter of infinitely nested boxes.  There is a symmetry in it that pleases him. After all, there is infinity in the very large too. Our universe, ever expanding, apparently without limit.  He turns to the work of Georg Cantor, who had the audacity to formalize the mathematical study of infinity. Abdul Karim painstakingly goes over the mathematics, drawing his finger under every line, every equation in the yellowing textbook, scribbling frantically with his pencil. Cantor is the one who discovered that certain infinite sets are more infinite than others—that there are tiers and strata of infinity. Look at the integers, 1, 2, 3, 4 . . . Infinite, but of a lower order of infinity than the real numbers like 1.67, 2.93 etc. Let us say the set of integers is of order Aleph-null, the set of real numbers of order Aleph-One, like the hierarchical ranks of a king’s courtiers. The question that plagued Cantor and eventually cost him his life and sanity was the Continuum Hypothesis, which states that there is no infinite set of numbers with order between Aleph-Null and Aleph-One. In other words, Aleph-One succeeds Aleph-Null; there is no intermediate rank. But Cantor could not prove this.  He developed the mathematics of infinite sets. Infinity plus infinity equals infinity. Infinity minus infinity equals infinity. But the Continuum Hypothesis remained beyond his reach.  Abdul Karim thinks of Cantor as a cartographer in a bizarre new world. Here the cliffs of infinity reach endlessly toward the sky, and Cantor is a tiny figure lost in the grandeur, a fly on a precipice. And yet, what boldness! What spirit! To have the gall to actually classify infinity . . .  His explorations take him to an article on the mathematicians of ancient India. They had specific words for large numbers. One purvi, a unit of time, is seven hundred and fifty-six thousand billion years. One sirsaprahelika is eight point four million Purvis raised to the twenty-eighth power. What did they see that caused them to play with such large numbers? What vistas were revealed before them? What wonderful arrogance possessed them that they, puny things, could dream so large?  He mentions this once to his friend, a Hindu called Gangadhar, who lives not far away. Gangadhar’s hands pause over the chessboard (their weekly game is in progress) and he intones a verse from the Vedas:  From the Infinite, take the Infinite, and lo! Infinity remains . . .  Abdul Karim is astounded. That his ancestors could anticipate Georg Cantor by four millennia!   That fondness for science, . . . that affability and condescension which God shows to the learned, that promptitude with which he protects and supports them in the elucidation of obscurities and in the removal of difficulties, has encouraged me to compose a short work on calculating by al-jabr and al-muqabala, confining it to what is easiest and most useful in arithmetic.  —Al Khwarizmi, eighth century Arab mathematician Mathematics came to the boy almost as naturally as breathing. He made a clean sweep of the exams in the little municipal school. The neighborhood was provincial, dominated by small tradesmen, minor government officials and the like, and their children seemed to have inherited or acquired their plodding practicality. Nobody understood that strangely clever Muslim boy, except for a Hindu classmate, Gangadhar, who was a well-liked, outgoing fellow. Although Gangadhar played gulli-danda on the streets and could run faster than anybody, he had a passion for literature, especially poetry—a pursuit perhaps as impractical as pure mathematics. The two were drawn together and spent many hours sitting on the compound wall at the back of the school, eating stolen jamuns from the trees overhead and talking about subjects ranging from Urdu poetry and Sanskrit verse to whether mathematics pervaded everything, including human emotions. They felt very grown-up and mature for their stations. Gangadhar was the one who, shyly, and with many giggles, first introduced Kalidasa’s erotic poetry to Abdul Karim. At that time girls were a mystery to them both: although they shared classrooms it seemed to them that girls (a completely different species from their sisters, of course) were strange, graceful, alien creatures from another world. Kalidasa’s lyrical descriptions of breasts and hips evoked in them unarticulated longings.  They had the occasional fight, as friends do. The first serious one happened when there were some Hindu-Muslim tensions in the city just before the elections. Gangadhar came to Abdul in the school playground and knocked him flat.  “You’re a bloodthirsty Muslim!” he said, almost as though he had just realized it.  “You’re a hell-bound kafir!”  They punched each other, wrestled the other to the ground. Finally, with cut lips and bruises, they stared fiercely at each other and staggered away. The next day they played gulli-danda in the street on opposite sides for the first time.  Then they ran into each other in the school library. Abdul Karim tensed, ready to hit back if Gangadhar hit him. Gangadhar looked as if he was thinking about it for a moment, but then, somewhat embarrassedly, he held out a book.  “New book . . . on mathematics. Thought you’d want to see it . . . ”  After that they were sitting on the wall again, as usual.  Their friendship had even survived the great riots four years later, when the city became a charnel house—buildings and bodies burned, and unspeakable atrocities were committed by both Hindus and Muslims. Some political leader of one side or another had made a provocative proclamation that he could not even remember, and tempers had been inflamed. There was an incident—a fight at a bus-stop, accusations of police brutality against the Muslim side, and things had spiraled out of control. Abdul’s elder sister Ayesha had been at the market with a cousin when the worst of the violence broke out. They had been separated in the stampede; the cousin had come back, bloodied but alive, and nobody had ever seen Ayesha again.  The family never recovered. Abdul’s mother went through the motions of living but her heart wasn’t in it. His father lost weight, became a shrunken mockery of his old, vigorous self—he would die only a few years later. As for Abdul—the news reports about atrocities fed his nightmares and in his dreams he saw his sister bludgeoned, raped, torn to pieces again and again and again. When the city calmed down, he spent his days roaming the streets of the market, hoping for a sign of Ayesha—a body even—torn between hope and feverish rage.  Their father stopped seeing his Hindu friends. The only reason Abdul did not follow suit was because Gangadhar’s people had sheltered a Muslim family during the carnage, and had turned off a mob of enraged Hindus.  Over time the wound—if it did not quite heal—became bearable enough that he could start living again. He threw himself into his beloved mathematics, isolating himself from everyone but his family and Gangadhar. The world had wronged him. He did not owe it anything.   Aryabhata is the master who, after reaching the furthest shores and plumbing the inmost depths of the sea of ultimate knowledge of mathematics, kinematics and spherics, handed over the three sciences to the learned world.  —The Mathematician Bhaskara, commenting on the 6th century Indian mathematician Aryabhata, a hundred years later. Abdul Karim was the first in his family to go to college. By a stroke of great luck, Gangadhar went to the same regional institution, majoring in Hindi literature while Abdul Karim buried himself in mathematical arcana. Abdul’s father had become reconciled to his son’s obsession and obvious talent. Abdul Karim himself, glowing with praise from his teachers, wanted to follow in the footsteps of Ramanujan. Just as the goddess Namakkal had appeared to that untutored genius in his dreams, writing mathematical formulas on his tongue (or so Ramanujan had said), Abdul Karim wondered if the farishte had been sent by Allah so that he, too, might be blessed with mathematical insight.  During that time an event occurred that convinced him of this.  Abdul was in the college library, working on a problem in differential geometry, when he sensed a farishta at the edge of his field of vision. As he had done countless times before, he turned his head slowly, expecting the vision to vanish.  Instead he saw a dark shadow standing in front of the long bookcase. It was vaguely human-shaped. It turned slowly, revealing itself to be thin as paper—but as it turned it seemed to acquire thickness, hints of features over its dark, slender form. And then it seemed to Abdul that a door opened in the air, just a crack, and he had a vision of an unutterably strange world beyond. The shadow stood at the door, beckoning with one arm, but Abdul Karim sat still, frozen with wonder. Before he could rouse himself and get up, the door and the shadow both rotated swiftly and vanished, and he was left staring at the stack of books on the shelf.  After this he was convinced of his destiny. He dreamed obsessively of the strange world he had glimpsed; every time he sensed a farishta he turned his head slowly toward it—and every time it vanished. He told himself it was just a matter of time before one of them came, remained, and perhaps—wonder of wonders—took him to that other world.  Then his father died unexpectedly. That was the end of Abdul Karim’s career as a mathematician. He had to return home to take care of his mother, his two remaining sisters and a brother. The only thing he was qualified for was teaching. Ultimately he would find a job at the same municipal school from which he had graduated.  On the train home, he saw a woman. The train was stopped on a bridge. Below him was the sleepy curve of a small river, gold in the early morning light, mists rising faintly off it, and on the shore a woman with a clay water pot. She had taken a dip in the river—her pale, ragged sari clung wetly to her as she picked up the pot and set it on her hip and began to climb the bank. In the light of dawn she was luminous, an apparition in the mist, the curve of the pot against the curve of her hip. Their eyes met from a distance—he imagined what he thought she saw, the silent train, a young man with a sparse beard looking at her as though she was the first woman in the world. Her own eyes gazed at him fearlessly as though she were a goddess looking into his soul. For a moment there were no barriers between them, no boundaries of gender, religion, caste or class. Then she turned and vanished behind a stand of shisham trees.  He wasn’t sure if she had really been there in the half-light or whether he had conjured her up, but for a long time she represented something elemental to him. Sometimes he thought of her as Woman, sometimes as a river.  He got home in time for the funeral. His job kept him busy, and kept the moneylender from their door. With the stubborn optimism of the young, he kept hoping that one day his fortunes would change, that he would go back to college and complete his degree. In the meantime, he knew his mother wanted to find him a bride . . .  Abdul Karim got married, had children. Slowly, over the years of managing rowdy classrooms, tutoring students in the afternoons and saving, paisa by paisa, from his meager salary for his sisters’ weddings and other expenses, Abdul Karim lost touch with that youthful, fiery talent he had once had, and with it the ambition to scale the heights to which Ramanujan, Cantor and Riemann had climbed. Things came more slowly to him now. An intellect burdened by years of worry wears out. When his wife died and his children grew up and went away, his steadily decreasing needs finally caught up with his meager income, and he found for the first time that he could think about mathematics again. He no longer hoped to dazzle the world of mathematics with some new insight, such as a proof of Riemann’s hypothesis. Those dreams were gone. All he could hope for was to be illumined by the efforts of those who had gone before him, and to re-live, vicariously, the joys of insight. It was a cruel trick of Time, that when he had the leisure he had lost the ability, but that is no bar to true obsession. Now, in the autumn of his life it was as though Spring had come again, bringing with it his old love.   In this world, brought to its knees by hunger and thirst  Love is not the only reality, there are other Truths . . . —Sahir Ludhianvi, Indian poet (1921-1980) There are times when Abdul Karim tires of his mathematical obsessions. After all, he is old. Sitting in the courtyard with his notebook, pencil and books of mathematics for so many hours at a stretch can take its toll. He gets up, aching all over, sees to his mother’s needs and goes out to the graveyard where his wife is buried.  His wife Zainab had been a plump, fair-skinned woman, hardly able to read or write, who moved about the house with indolent grace, her good-natured laugh ringing out in the courtyard as she chattered with the washerwoman. She had loved to eat—he still remembered the delicate tips of her plump fingers, how they would curl around a piece of lamb, scooping up with it a few grains of saffron rice, the morsel conveyed reverently to her mouth. Her girth gave an impression of strength, but ultimately she had not been able to hold out against her mother-in-law. The laughter in her eyes faded gradually as her two boys grew out of babyhood, coddled and put to bed by the grandmother in her own corner of the women’s quarters. Abdul Karim himself had been unaware of the silent war between his wife and mother—he had been young and obsessed with teaching mathematics to his recalcitrant students. He had noticed how the grandmother always seemed to be holding the younger son, crooning to him, and how the elder boy followed his mother around, but he did not see in this any connection to his wife’s growing pallor. One night he had requested her to come to him and massage his feet—their euphemism for sex—and he had waited for her to come to him from the women’s quarters, impatient for the comfort of her plump nakedness, her soft, silken breasts. When she came at last she had knelt at the foot of the bed, her chest heaving with muffled sobs, her hands covering her face. As he took her in his arms, wondering what could have ruffled her calm good nature, she had collapsed completely against him. No comfort he could offer would make her tell what it was that was breaking her heart. At last she begged him, between great, shuddering breaths, that all she wanted in the world was another baby.  Abdul Karim had been influenced by modern ideas—he considered two children, boys at that, to be quite sufficient for a family. As one of five children, he had known poverty and the pain of giving up his dream of a university career to help support his family. He wasn’t going to have his children go through the same thing. But when his wife whispered to him that she wanted one more, he relented.  Now, when he looked back, he wished he had tried to understand the real reason for her distress. The pregnancy had been a troublesome one. His mother had taken charge of both boys almost entirely while Zainab lay in bed in the women’s quarters, too sick to do anything but weep silently and call upon Allah to rescue her. “It’s a girl,” Abdul Karim’s mother had said grimly. “Only a girl would cause so much trouble.” She had looked away out of the window into the courtyard, where her own daughter, Abdul Karim’s dead sister, Ayesha, had once played and helped hang the wash.  And finally it had been a girl, stillborn, who had taken her mother with her. They were buried together in the small, unkempt graveyard where Abdul Karim went whenever he was depressed. By now the gravestone was awry and grass had grown over the mound. His father was buried here also, and three of his siblings who had died before he was six. Only Ayesha, lost Ayesha, the one he remembered as a source of comfort to a small boy—strong, generous arms, hands delicate and fragrant with henna, a smooth cheek—she was not here.  In the graveyard Abdul Karim pays his respects to his wife’s memory while his heart quails at the way the graveyard itself is disintegrating. He is afraid that if it goes to rack and ruin, overcome by vegetation and time, he will forget Zainab and the child and his guilt. Sometimes he tries to clear the weeds and tall grasses with his hands, but his delicate scholar’s hands become bruised and sore quite quickly, and he sighs and thinks about the Sufi poetess Jahanara, who had written, centuries earlier: “Let the green grass grow above my grave!”   I have often pondered over the roles of knowledge or experience, on the one hand, and imagination or intuition, on the other, in the process of discovery. I believe that there is a certain fundamental conflict between the two, and knowledge, by advocating caution, tends to inhibit the flight of imagination. Therefore, a certain naivete, unburdened by conventional wisdom, can sometimes be a positive asset.  —Harish-Chandra, Indian mathematician (1923-1983). Gangadhar, his friend from school, was briefly a master of Hindi literature at the municipal school and is now an academician at the Amravati Heritage Library, and a poet in his spare time. He is the only person to whom Abdul Karim can confide his secret passion.  In time, he too becomes intrigued with the idea of infinity. While Abdul Karim pores over Cantor and Riemann, and tries to make meaning from the Prime Number theorem, Gangadhar raids the library and brings forth treasures. Every week, when Abdul Karim walks the two miles to Gangadhar’s house, where he is led by the servant to the comfortable drawing room with its gracious, if aging mahogany furniture, the two men share what they’ve learned over cups of cardamom tea and a chess game. Gangadhar cannot understand higher mathematics but he can sympathize with the frustrations of the knowledge-seeker, and he has known what it is like to chip away at the wall of ignorance and burst into the light of understanding. He digs out quotes from Aryabhata and Al-Khwarizmi, and tells his friend such things as:  “Did you know, Abdul, that the Greeks and Romans did not like the idea of infinity? Aristotle argued against it, and proposed a finite universe. Of the yunaanis, only Archimedes dared to attempt to scale that peak. He came up with the notion that different infinite quantities could be compared, that one infinite could be greater or smaller than another infinite . . . ”  And on another occasion:  “The French mathematician, Jacques Hadamard . . . He was the one who proved the Prime Number theorem that has you in such ecstasies . . . he says there are four stages to mathematical discovery. Not very different from the experience of the artist or poet, if you think about it. The first is to study and be familiar with what is known. The next is to let these ideas turn in your mind, as the earth regenerates by lying fallow between plantings. Then—with luck—there is the flash of insight, the illuminating moment when you discover something new and feel in your bones that it must be true. The final stage is to verify—to subject that epiphany to the rigors of mathematical proof . . . ”  Abdul Karim feels that if he can simply go through Hadamard’s first two stages, perhaps Allah will reward him with a flash of insight. And perhaps not. If he had hopes of being another Ramanujan, those hopes are gone now. But no true Lover has ever turned from the threshold of the Beloved’s house, even knowing he will not be admitted through the doors.  “What worries me,” he confides to Gangadhar during one of these discussions, “what has always worried me, is Gödel’s Incompleteness Theorem. According to Gödel, there can be statements in mathematics that are not provable. He showed that the Continuum Hypothesis of Cantor was one of these statements. Poor Cantor, he lost his sanity trying to prove something that cannot be proved or disproved! What if all our unproven ideas on prime numbers, on infinity, are statements like that? If they can’t be tested against the constraints of mathematical logic, how will we ever know if they are true?”  This bothers him very much. He pores over the proof of Gödel’s theorem, seeking to understand it, to get around it. Gangadhar encourages him:  “You know, in the old tales, every great treasure is guarded by a proportionally great monster. Perhaps Gödel’s theorem is the djinn that guards the truth you seek. Maybe instead of slaying it, you have to, you know, befriend it . . . ”  Through his own studies, through discussions with Gangadhar, Abdul Karim begins to feel again that his true companions are Archimedes, Al-Khwarizmi. Khayyam, Aryabhata, Bhaskar. Riemann, Cantor, Gauss, Ramanujan, Hardy.  They are the masters, before whom he is as a humble student, an apprentice following their footprints up the mountainside. The going is rough. He is getting old, after all. He gives himself up to dreams of mathematics, rousing himself only to look after the needs of his mother, who is growing more and more frail.  After a while, even Gangadhar admonishes him.  “A man cannot live like this, so obsessed. Will you let yourself go the way of Cantor and Gödel? Guard your sanity, my friend. You have a duty to your mother, to society.”  Abdul Karim cannot make Gangadhar understand. His mind sings with mathematics.  The limit of a function f(N) as N goes to infinity . . . ..  So many questions he asks himself begin like this. The function f(N) may be the prime counting function, or the number of nested dolls of matter, or the extent of the universe. It may be abstract, like a parameter in a mathematical space, or earthy, like the branching of wrinkles in the face of his mother, growing older and older in the paved courtyard of his house, under the litchi trees. Older and older, without quite dying, as though she were determined to live Zeno’s paradox.  He loves his mother the way he loves the litchi tree; for being there, for making him what he is, for giving him shelter and succor.  The limit . . . as N goes to infinity . . .  So begin many theorems of calculus. Abdul Karim wonders what kind of calculus governs his mother’s slow arc into dying. What if life did not require a minimum threshold of conditions—what if death were merely a limit of some function f(N) as N goes to infinity?   A world in which human life is but a pawn  A world filled with death-worshipers, Where death is cheaper than life . . . That world is not my world . . . —Sahir Ludhianvi, Indian poet (1921-1980) While Abdul Karim dabbles in the mathematics of the infinite, as so many deluded fools and geniuses have done, the world changes.  He is vaguely aware that there are things going on in the world—that people live and die, that there are political upheavals, that this is the hottest summer yet and already a thousand people have died of the heat wave in Northern India. He knows that Death also stands at his mother’s shoulder, waiting, and he does what he can for her. Although he has not always observed the five daily prayers, he does the namaz now, with her. She has already started becoming the citizen of another country—she lives in little leaps and bends of time long gone, calling for Ayesha one moment, and for her long-dead husband the next. Conversations from her lost girlhood emerge from her trembling mouth. In her few moments of clarity she calls upon Allah to take her away.  Dutiful as he is to his mother, Abdul Karim is relieved to be able to get away once a week for a chess game and conversation with Gangadhar. He has a neighbor’s aunt look in on his mother during that time. Heaving a sigh or two, he makes his way through the familiar lanes of his childhood, his shoes scuffing up dust under the ancient jamun trees that he once climbed as a child. He greets his neighbors: old Ameen Khan Sahib sitting on his charpai, wheezing over his hookah, the Ali twins, madcap boys chasing a bicycle tire with a stick, Imran at the paan shop. He crosses, with some trepidation, the increasingly congested market road, past the faded awnings of Munshilal and Sons, past a rickshaw stand into another quiet lane, this one shaded with jacaranda trees. Gangadhar’s house is a modest white bungalow, stained an indeterminate gray from many monsoons. The creak of the wooden gate in the compound wall is as familiar a greeting as Gangadhar’s welcome.  But the day comes when there is no chess game at Gangadhar’s house.  The servant boy—not Gangadhar—ushers him into the familiar room. Sitting down in his usual chair, Abdul Karim notices that the chess board has not been laid out. Sounds come from the inner rooms of the house: women’s voices, heavy objects being dragged across the floor.  An elderly man comes into the room and stops short as though surprised to see Abdul Karim. He looks vaguely familiar—then Abdul remembers that he is some relative of Gangadhar’s wife—an uncle, perhaps—and he lives on the other side of the city. They have met once or twice at some family celebration.  “What are you doing here?” the man says, without any of the usual courtesies. He is white-haired but of vigorous build.  Puzzled and a little affronted, Abdul Karim says:  “I am here for my chess game with Gangadhar. Is he not at home?”  “There will be no chess game today. Haven’t you people done enough harm? Are you here to mock us in our sorrow? Well, let me tell you . . . ”  “What happened?” Abdul Karim’s indignation is dissolving in a wave of apprehension. “What are you talking about? Is Gangadhar all right?”  “Perhaps you don’t know,” says the man, his tone mocking. “Some of your people burned a bus on Paharia road yesterday evening. There were ten people on it, all Hindus, coming back from a family ceremony at a temple. They all perished horribly. Word has it that you people did it. Didn’t even let the children get off the bus. Now the whole town is in turmoil. Who knows what might happen? Gangadhar and I are taking his family to a safer part of town.”  Abdul Karim’s eyes are wide with shock. He can find no words.  “All these hundreds of years we Hindus have tolerated you people. Even though you Muslims raided and pillaged us over the centuries, we let you build your mosques, worship your God. And this is how you pay us!”  In one instant Abdul Karim has become “you people.” He wants to say that he did not lift an arm to hurt those who perished on the bus. His were not the hands that set the fire. But no words come out.  “Can you imagine it, Master Sahib? Can you see the flames? Hear their screams? Those people will never go home . . . ”  “I can imagine it,” Abdul Karim says, grimly now. He rises to his feet, but just then Gangadhar enters the room. He has surely heard part of the conversation because he puts his hands on Abdul Karim’s shoulders, gently, recognizing him as the other man has not done. This is Abdul Karim, his friend, whose sister, all those years ago, never came home.  Gangadhar turns to his wife’s uncle.  “Uncle, please. Abdul Karim is not like those miscreants. A kinder man I have never known! And as yet it is not known who the ruffians are, although the whole town is filled with rumors. Abdul, please sit down! This is a measure of the times we live in, that we can say such things to each other. Alas! Kalyug is indeed upon us.”  Abdul Karim sits down, but he is shaking. All thoughts of mathematics have vanished from his mind. He is filled with disgust and revulsion for the barbarians who committed this atrocity, for human beings in general. What a degraded species we are! To take the name of Ram or Allah, or Jesus, and to burn and destroy under one aegis or another—that is what our history has been.  The uncle, shaking his head, has left the room. Gangadhar is talking history to Abdul, apologizing for his uncle.  “ . . . a matter of political manipulation,” he says. “The British colonialists looked for our weakness, exploited it, set us against each other. Opening the door to hell is easy enough—but closing it is hard. All those years, before British rule, we lived in relative peace. Why is it that we cannot close that door they opened? After all, what religion tells us to slay our neighbor?”  “Does it matter?” Abdul Karim says bitterly. “We humans are a depraved species, my friend. My fellow Muslims address every prayer to Allah, the Merciful and Compassionate. You Hindus, with your “Isha Vasyam Idam Sarvam”—the divine pervades all. The Christians talk on about turning the other cheek. And yet each of them has hands that are stained in blood. We pervert everything—we take the words of peace spoken by prophets and holy men and turn them into weapons with which to kill each other!”  He is shaking so hard that he can barely speak.  “It is in mathematics . . . only in mathematics that I see Allah . . . ”  “Quiet now,” Gangadhar says. He calls for the servant to bring some water for the master sahib. Abdul Karim drinks and wipes his mouth. The suitcases are being brought out from inside the house. There is a taxi in front.  “Listen, my friend,” Gangadhar says, “you must look to your safety. Go home now and lock your doors, and look after your mother. I am sending my family away and I will join them in a day or so. When this madness has passed I will come and look for you!”  Abdul Karim goes home. So far everything looks normal—the wind is blowing litter along in the streets, the paan shop is open, people throng the bus-stop. Then he notices that there aren’t any children, even though the summer holidays are going on.  The vegetable market is very busy. People are buying up everything like crazy. He buys a few potatoes, onions and a large gourd, and goes home. He locks the door. His mother, no longer up to cooking meals, watches as he cooks. After they eat and he has her tucked into bed, he goes to his study and opens a book on mathematics.  One day passes, perhaps two—he does not keep track. He remembers to take care of his mother but often forgets to eat. His mother lives, more and more, in that other world. His sisters and brother call from other towns, anxious about the reports of escalating violence; he tells them not to worry. When things are back to normal they will come and see him and their mother.   How marvelous, the Universal Mystery  That only a true Lover can comprehend! —Bulleh Shah, eighteenth century Punjabi Sufi poet Logic merely sanctions the conquests of the intuition.  —Jacques Hadamard, French mathematician (1865-1963) One morning he emerges from the darkness of his study into the sunny courtyard. Around him the old city writhes and burns, but Abdul Karim sees and hears nothing but mathematics. He sits in his old cane chair, picks up a stick lying on the ground and begins to draw mathematical symbols in the dust.  There is a farishta standing at the edge of his vision.  He turns slowly. The dark shadow stays there, waits. This time Abdul Karim is quick on his feet, despite a sudden twinge of pain in one knee. He walks toward the door, the beckoning arm, and steps through.  For a moment he is violently disoriented—it occurs to him that he has spun through a different dimension into this hidden world. Then the darkness before his eyes dissipates, and he beholds wonders.  All is hushed. He is looking at a vast sweep of land and sky unlike anything he has ever seen. Dark, pyramidal shapes stud the landscape, great monuments to something beyond his understanding. There is a vast, polyhedral object suspended in a pale orange sky that has no sun. Only a diffuse luminescence pervades this sky. He looks at his feet, still in his familiar, worn sandals, and sees all around, in the sand, little fish-like creatures wriggling and spawning. Some of the sand has worked its way between his toes, and it feels warm and rubbery, not like sand at all. He takes a deep breath and smells something strange, like burnt rubber mixed with his own sweat. The shadow stands by his side, looking solid at last, almost human but for the absence of neck and the profusion of limbs—their number seems to vary with time—at the moment Abdul Karim counts five.  The dark orifice in the head opens and closes, but no sound comes out. Instead Abdul feels as though a thought has been placed in his mind, a package that he will open later.  He walks with the shadow across the sands to the edge of a quiet sea. The water, if that is what it is, is foaming and bubbling gently, and within its depths he sees ghostly shapes moving, and the hints of complex structure far below. Arabesques form in the depths, break up, and form again. He licks his dry lips, tastes metal and salt.  He looks at his companion, who bids him pause. A door opens. They step through into another universe.  It is different, this one. It is all air and light, the whole space hung with great, translucent webbing. Each strand in the web is a hollow tube within which liquid creatures flow. Smaller, solid beings float in the emptiness between the web strands.  Speechless, he stretches out his hand toward a web-strand. Its delicacy reminds him of the filigreed silver anklets his wife used to wear. To his complete surprise a tiny being floating within the strand stops. It is like a plump, watery comma, translucent and without any features he can recognize, and yet he has the notion that he is being looked at, examined, and that at the other end is also wonder.  The web-strand touches him, and he feels its cool, alien smoothness on a fingertip.  A door opens. They step through.  It is dizzying, this wild ride. Sometimes he gets flashes of his own world, scenes of trees and streets, and distant blue hills. There are indications that these flashes are at different points in time—at one point he sees a vast army of soldiers, their plumed helmets catching the sunlight, and thinks he must be in the time of the Roman Empire. Another time he thinks he is back home, because he sees before him his own courtyard. But there is an old man sitting in his cane chair, drawing patterns in the dust with a stick. A shadow falls across the ground. Someone he cannot see is stealing up behind the old man. Is that a knife agleam in the stranger’s hand? What is this he is seeing? He tries to call out, but no sound emerges. The scene blurs—a door opens, and they step through.  Abdul Karim is trembling. Has he just witnessed his own death?  He remembers that Archimedes died that way—he had been drawing circles, engrossed with a problem in geometry, when a barbarian of a soldier came up behind him and killed him.  But there is no time to ponder. He is lost in a merry-go-round of universes, each different and strange. The shadow gives him a glimpse of so many, Abdul Karim has long lost count. He puts thoughts of Death away from him and loses himself in wonder.  His companion opens door after door. The face, featureless except for the orifice that opens and shuts, gives no hint of what the shadow is thinking. Abdul Karim wants to ask: who are you? Why are you doing this? He knows, of course, the old story of how the angel Gabriel came to the Prophet Mohammad one night and took him on a celestial journey, a grand tour of the heavens. But the shadow does not look like an angel; it has no face, no wings, its gender is indeterminate. And in any case, why should the angel Gabriel concern himself with a humble mathematics master in a provincial town, a person of no consequence in the world?  And yet, he is here. Perhaps Allah has a message for him; His ways are ineffable, after all. Exultation fills Abdul Karim as he beholds marvel after marvel.  At last they pause in a place where they are suspended in a yellow sky. As Abdul Karim experiences the giddy absence of gravity, accompanied by a sudden jolt of nausea that slowly recedes—as he turns in mid-air, he notices that the sky is not featureless but covered with delicate tessellations: geometric shapes intertwine, merge and new ones emerge. The colors change too, from yellow to green, lilac, mauve. All at once it seems as though numberless eyes are opening in the sky, one after the other, and as he turns he sees all the other universes flashing past him. A kaleidoscope, vast beyond his imaginings. He is at the center of it all, in a space between all spaces, and he can feel in his bones a low, irregular throbbing, like the beating of a drum. Boom, boom, goes the drum. Boom boom boom. Slowly he realizes that what he is seeing and feeling is part of a vast pattern.  In that moment Abdul Karim has the flash of understanding he has been waiting for all his life.  For so long he has been playing with the transcendental numbers, trying to fathom Cantor’s ideas; at the same time Riemann’s notions of the prime numbers have fascinated him. In idle moments he has wondered if they are connected at a deeper level. Despite their apparent randomness the primes have their own regularity, as hinted by the unproven Riemann Hypothesis; he sees at last that if you think of prime numbers as the terrain of a vast country, and if your view of reality is a two-dimensional plane that intersects this terrain at some height above the surface, perhaps at an angle, then of course what you see will appear to be random. Tops of hills. Bits of valleys. Only the parts of the terrain that cross your plane of reality will be apparent. Unless you can see the entire landscape in its multi-dimensional splendor, the topography will make no sense.  He sees it: the bare bones of creation, here, in this place where all the universes branch off, the thudding heart of the metacosmos. In the scaffolding, the skeletal structure of the multiverse is beautifully apparent. This is what Cantor had a glimpse of, then, this vast topography. Understanding opens in his mind as though the metacosmos has itself spoken to him. He sees that of all the transcendental numbers, only a few—infinite still, but not the whole set—are marked as doorways to other universes, and each is labeled by a prime number. Yes. Yes. Why this is so, what deeper symmetry it reflects, what law or regularity of Nature undreamed of by the physicists of his world, he does not know.  The space where primes live—the topology of the infinite universes—he sees it in that moment. No puny function as yet dreamed of by humans can encompass the vastness—the inexhaustible beauty of this place. He knows that he can never describe this in the familiar symbols of the mathematics that he knows, that while he experiences the truth of the Riemann Hypothesis, as a corollary to this greater, more luminous reality, he cannot sit down and verify it through a conventional proof. No human language as yet exists, mathematical or otherwise, that can describe what he knows in his bones to be true. Perhaps he, Abdul Karim, will invent the beginnings of such a language. Hadn’t the great poet Iqbal interpreted the Prophet’s celestial journey to mean that the heavens are within our grasp?  A twist, and a door opens. He steps into the courtyard of his house. He turns around, but the courtyard is empty. The farishta is gone.  Abdul Karim raises his eyes to the heavens. Rain clouds, dark as the proverbial beloved’s hair, sweep across the sky; the litchi tree over his head is dancing in the swift breeze. The wind has drowned out the sounds of a ravaged city. A red flower comes blowing over the courtyard wall and is deposited at his feet.  Abdul Karim’s hair is blown back, a nameless ecstasy fills him; he feels Allah’s breath on his face.  He says into the wind:  Dear Merciful and Compassionate God, I stand before your wondrous universe, filled with awe; help me, weak mortal that I am, to raise my gaze above the sordid pettiness of everyday life, the struggles and quarrels of mean humanity . . . Help me to see the beauty of your Works, from the full flower of the red silk cotton tree to the exquisite mathematical grace by which you have created numberless universes in the space of a man’s step. I know now that my true purpose in this sad world is to stand in humble awe before your magnificence, and to sing a paean of praise to you with every breath I take . . .  He feels weak with joy. Leaves whirl in the courtyard like mad dervishes; a drop or two of rain falls, obliterating the equation he had scratched in the dust with his stick. He has lost his chance at mathematical genius a long time ago; he is nobody, only a teacher of mathematics at a school, humbler than a clerk in a government office—yet Allah has favored him with this great insight. Perhaps he is now worthy of speech with Ramanujan and Archimedes and all the ones in between. But all he wants to do is to run out into the lane and go shouting through the city: see, my friends, open your eyes and see what I see! But he knows they would think him mad; only Gangadhar would understand . . . if not the mathematics then the impulse, the importance of the whole discovery.  He leaps out of the house, into the lane.   This blemished radiance . . . this night-stung dawn  Is not the dawn we waited for . . . —Faiz Ahmed Faiz, Pakistani poet (1911-1984) Where all is broken  Where each soul’s athirst, each glance Filled with confusion, each heart Weighed with sorrow . . . Is this a world, or chaos? —Sahir Ludhianvi, Indian poet (1921-1980) But what is this?  The lane is empty. There are broken bottles everywhere. The windows and doors of his neighbors’ houses are shuttered and barred, like closed eyes. Above the sound of the rain he hears shouting in the distance. Why is there a smell of burning?  He remembers then, what he had learned at Gangadhar’s house. Securing the door behind him, he begins to run as fast as his old-man legs will carry him.  The market is burning.  Smoke pours out of smashed store fronts, even as the rain falls. There is broken glass on the pavement; a child’s wooden doll in the middle of the road, decapitated. Soggy pages filled with neat columns of figures lie scattered everywhere, the remains of a ledger. Quickly he crosses the road.  Gangadhar’s house is in ruins. Abdul Karim wanders through the open doors, stares blindly at the blackened walls. The furniture is mostly gone. Only the chess table stands untouched in the middle of the front room.  Frantically he searches through the house, entering the inner rooms for the first time. Even the curtains have been ripped from the windows.  There is no body.  He runs out of the house. Gangadhar’s wife’s family—he does not know where they live. How to find out if Gangadhar is safe?  The neighboring house belongs to a Muslim family that Abdul Karim knows only from visits to the mosque. He pounds on the door. He thinks he hears movement behind the door, sees the upstairs curtains twitch—but nobody answers his frantic entreaties. At last, defeated, his hands bleeding, he walks slowly home, looking about him in horror. Is this truly his city, his world?  Allah, Allah, why have you abandoned me?  He has beheld the glory of Allah’s workmanship. Then why this? Were all those other universes, other realities a dream?  The rain pours down.  There is someone lying on his face in a ditch. The rain has wet the shirt on his back, made the blood run. As Abdul Karim starts toward him, wondering who it is, whether he is dead or alive—young, from the back it could be Ramdas or Imran—he sees behind him, at the entrance to the lane, a horde of young men. Some of them may be his students—they can help.  They are moving with a predatory sureness that frightens him. He sees that they have sticks and stones.  They are coming like a tsunami, a thunderclap, leaving death and ruin in their wake. He hears their shouts through the rain.  Abdul Karim’s courage fails him. He runs to his house, enters, locks and bars the door and closes all the windows. He checks on his mother, who is sleeping. The telephone is dead. The dal for their meal has boiled away. He turns off the gas and goes back to the door, putting his ear against it. He does not want to risk looking out of the window.  Over the rain he hears the young men go past at a run. In the distance there is a fusillade of shots. More sounds of running feet, then, just the rain.  Are the police here? The army?  Something or someone is scratching at the door. Abdul Karim is transfixed with terror. He stands there, straining to hear over the pitter patter of the rain. On the other side, somebody moans.  Abdul Karim opens the door. The lane is empty, roaring with rain. At his feet there is the body of a young woman.  She opens her eyes. She’s dressed in a salwaar kameez that has been half-torn off her body—her long hair is wet with rain and blood, plastered over her neck and shoulders. There is blood on her salwaar, blood oozing from a hundred little cuts and welts on her skin.  Her gaze focuses.  “Master Sahib..”  He is taken aback. Is she someone he knows? Perhaps an old student, grown up?  Quickly he half-carries, half-pulls her into the house and secures the door. With some difficulty he lifts her carefully on to the divan in the drawing room, which is already staining with her blood. She coughs.  “My child, who did this to you? Let me find a doctor . . . ”  “No,” she says. “It’s too late.” Her breath rasps and she coughs again. Tears well up in the dark eyes.  “Master Sahib, please, let me die! My husband . . . my son . . . They must not see me take my last breath. Not like this. They will suffer. They will want revenge . . . Please . . . cut my wrists . . . ”  She’s raising her wrists to his horrified face, but all he can do is to take them in his shaking hands.  “My daughter,” he says, and doesn’t know what to say. Where will he find a doctor in the mayhem? Can he bind her cuts? Even as he thinks these thoughts he knows that life is ebbing from her. Blood is pooling on his divan, dripping down to the floor. She does not need him to cut her wrists.  “Tell me, who are the ruffians who did this?”  She whispers:  “I don’t know who they were. I had just stepped out of the house for a moment. My family . . . don’t tell them, Master Sahib! When I’m gone just tell them . . . tell them I died in a safe place . . . ”  “Daughter, what is your husband’s name?”  Her eyes are enormous. She is gazing at him without comprehension, as though she is already in another world.  He can’t tell if she is Muslim or Hindu. If she wore a vermilion dot on her forehead, it has long since been washed off by the rain.  His mother is standing at the door of the drawing room. She wails suddenly and loudly, flings herself by the side of the dying woman.  “Ayesha! Ayesha, my life!”  Tears fall down Abdul Karim’s face. He tries to disengage his mother. Tries to tell her: this is not Ayesha, just another woman whose body has become a battleground over which men make war. At last he has to lift his mother in his arms, her body so frail that he fears it might break—he takes her to her bed, where she crumples, sobbing and calling Ayesha’s name.  Back in the drawing room, the young woman’s eyes flicker to him. Her voice is barely above a whisper.  “Master Sahib, cut my wrists . . . I beseech you, in the Almighty’s name! Take me somewhere safe . . . Let me die . . . ”  Then the veil falls over her eyes again and her body goes limp.  Time stands still for Abdul Karim.  Then he senses something familiar, and turns slowly. The farishta is waiting.  Abdul Karim picks up the woman in his arms, awkwardly arranging the bloody divan cover over her half-naked body. In the air, a door opens.  Staggering a little, his knees protesting, he steps through the door.  After three universes he finds the place.  It is peaceful. There is a rock rising from a great turquoise sea of sand. The blue sand laps against the rock, making lulling, sibilant sounds. In the high, clear air, winged creatures call to each other between endless rays of light. He squints in the sudden brightness.  He closes her eyes, buries her deep at the base of the rock, under the blue, flowing sand.  He stands there, breathing hard from the exertion, his hands bruised, thinking he should say something. But what? He does not even know if she’s Muslim or Hindu. When she spoke to him earlier, what word had she used for God? Was it Allah or Ishwar, or something neutral?  He can’t remember.  At last he says the Al-Fatihah, and, stumbling a little, recites whatever little he knows of the Hindu scriptures. He ends with the phrase Isha Vasyamidam Sarvam.  Tears run off his cheeks into the blue sand, and disappear without leaving a trace.  The farishta waits.  “Why didn’t you do something!” Abdul Karim rails at the shadow. He falls to his knees in the blue sand, weeping. “Why, if you are truly a farishta, didn’t you save my sister?”  He sees now that he has been a fool—this shadow creature is no angel, and he, Abdul Karim, no Prophet.  He weeps for Ayesha, for this nameless young woman, for the body he saw in the ditch, for his lost friend Gangadhar.  The shadow leans toward him. Abdul Karim gets up, looks around once, and steps through the door.  He steps out into his drawing room. The first thing he discovers is that his mother is dead. She looks quite peaceful, lying in her bed, her white hair flowing over the pillow.  She might be asleep, her face is so calm.  He stands there for a long time, unable to weep. He picks up the phone—there is still no dial tone. After that he goes about methodically cleaning up the drawing room, washing the floor, taking the bedding off the divan. Later, after the rain has stopped, he will burn it in the courtyard. Who will notice another fire in the burning city?  When everything is cleaned up, he lies down next to his mother’s body like a small boy and goes to sleep.   When you left me, my brother, you took away the book  In which is writ the story of my life . . . —Faiz Ahmed Faiz, Pakistani poet (1911-1984) The sun is out. An uneasy peace lies over the city. His mother’s funeral is over. Relatives have come and gone—his younger son came, but did not stay. The older son sent a sympathy card from America.  Gangadhar’s house is still empty, a blackened ruin. Whenever he has ventured out, Abdul Karim has asked about his friend’s whereabouts. The last he heard was that Gangadhar was alone in the house when the mob came, and his Muslim neighbors sheltered him until he could join his wife and children at her parents’ house. But it has been so long that he does not believe it any more. He has also heard that Gangadhar was dragged out, hacked to pieces and his body set on fire. The city has calmed down—the army had to be called in—but it is still rife with rumors. Hundreds of people are missing. Civil rights groups comb the town, interviewing people, revealing, in clipped, angry press statements, the negligence of the state government, the collusion of the police in some of the violence. Some of them came to his house, too, very clean, very young people, burning with an idealism that, however misplaced, is comforting to see. He has said nothing about the young woman who died in his arms, but he prays for that bereft family every day.  For days he has ignored the shadow at his shoulder. But now he knows that the sense of betrayal will fade. Whose fault is it, after all, that he ascribed to the creatures he once called farishte the attributes of angels? Could angels, even, save human beings from themselves?  The creatures watch us with a child’s curiosity, he thinks, but they do not understand. Just as their own worlds are incomprehensible to me, so are our ways to them. They are not Allah’s minions.  The space where the universes branch off—the heart of the metacosmos—now appears remote to him, like a dream. He is ashamed of his earlier arrogance. How can he possibly fathom Allah’s creation in one glance? No finite mind can, in one meager lifetime, truly comprehend the vastness, the grandeur of Allah’s scheme. All we can do is to discover a bit of the truth here, a bit there, and thus to sing His praises.  But there is so much pain in Abdul Karim’s soul that he cannot imagine writing down one syllable of the new language of the infinite. His dreams are haunted by the horrors he has seen, the images of his mother and the young woman who died in his arms. He cannot even say his prayers. It is as though Allah has abandoned him, after all.  The daily task of living—waking up, performing his ablutions, setting the little pot on the gas stove to boil water for one cup of tea, to drink that tea alone—unbearable thought! To go on, after so many have died—to go on without his mother, his children, without Gangadhar . . . Everything appears strangely remote: his aging face in the mirror, the old house, even the litchi tree in his courtyard. The familiar lanes of his childhood hold memories that no longer seem to belong to him. Outside, the neighbors are in mourning; old Ameen Khan Sahib weeps for his grandson; Ramdas is gone, Imran is gone. The wind still carries the soot of the burnings. He finds little piles of ashes everywhere, in the cracks in the cement of his courtyard, between the roots of the trees in the lane. He breathes the dead. How can he regain his heart, living in a world so wracked with pain? In this world there is no place for the likes of him. No place for henna-scented hands rocking a child to sleep, for old-woman hands tending a garden. And no place at all for the austere beauty of mathematics.  He’s thinking this when a shadow falls across the ground in front of him. He has been sitting in his courtyard, idly writing mathematical expressions with his stick on the dusty ground. He does not know whether the knife bearer is his son, or an enraged Hindu, but he finds himself ready for his death. The creatures who have watched him for so long will witness it, and wonder. Their uncomprehending presence comforts him.  He turns and rises. It is Gangadhar, his friend, who holds out his empty arms in an embrace.  Abdul Karim lets his tears run over Gangadhar’s shirt. As waves of relief wash over him he knows that he has held Death at bay this time, but it will come. It will come, he has seen it. Archimedes and Ramanujan, Khayyam and Cantor died with epiphanies on their lips before an indifferent world. But this moment is eternal.  “Allah be praised!” says Abdul Karim.    Originally published in Woman Who Thought She Was a Planet and Other Stories by Vandana Singh, 2009. Vandana Singh is a writer of speculative fiction and a professor of physics at a small and lively public university, Framingham State University, near Boston. Her critically acclaimed short stories have been reprinted in numerous best-of-year anthologies, and her most recent collection, Ambiguity Machines and Other Stories (Small Beer Press and Zubaan, 2018) was a finalist for the Philip K. Dick award. Vandana’s academic background is in particle physics, but for a decade she has been working on a transdisciplinary, justice-centered re-conceptualization of the climate crisis, at the intersection of science, economics, sociology, philosophy, history, and futures studies.", "text": "11530 words, novelette, REPRINT\nInfinities\nAn equation means nothing to me unless it expresses a thought of God.\n—Srinivasa Ramanujan, Indian mathematician (1887-1920)\nAbdul Karim is his name. He is a small, thin man, precise to the point of affectation in his appearance and manner. He walks very straight; there is gray in his hair and in his short, pointed beard. When he goes out of the house to buy vegetables, people on the street greet him respectfully. “Salaam, Master sahib,” they say, or “Namaste, Master Sahib,” according to the religion of the speaker. They know him as the mathematics master at the municipal school. He has been there so long that he sees the faces of his former students everywhere: the autorickshaw driver Ramdas who refuses to charge him, the man who sells paan from a shack at the street corner, with whom he has an account, who never reminds him when his payment is late—his name is Imran and he goes to the mosque far more regularly than Abdul Karim.\nThey all know him, the kindly mathematics master, but he has his secrets. They know he lives in the old yellow house, where the plaster is flaking off in chunks to reveal the underlying brick. The windows of the house are hung with faded curtains that flutter tremulously in the breeze, giving passersby an occasional glimpse of his genteel poverty—the threadbare covers on the sofa, the wooden furniture as gaunt and lean and resigned as the rest of the house, waiting to fall into dust. The house is built in the old-fashioned way about a courtyard, which is paved with brick except for a circular omission where a great litchi tree grows. There is a high wall around the courtyard, and one door in it that leads to the patch of wilderness that was once a vegetable garden. But the hands that tended it—his mother’s hands—are no longer able to do more than hold a mouthful of rice between the tips of the fingers, tremblingly conveyed to the mouth. The mother sits nodding in the sun in the courtyard while the son goes about the house, dusting and cleaning as fastidiously as a woman. The master has two sons—one is in distant America, married to a gori bibi, a white woman—how unimaginable! He never comes home and writes only a few times a year. The wife writes cheery letters in English that the master reads carefully with finger under each word. She talks about his grandsons, about baseball (a form of cricket, apparently), about their plans to visit, which never materialize. Her letters are as incomprehensible to him as the thought that there might be aliens on Mars, but he senses a kindness, a reaching out, among the foreign words. His mother has refused to have anything to do with that woman.\nThe other son has gone into business in Mumbai. He comes home rarely, but when he does he brings with him expensive things—a television set, an air-conditioner. The TV is draped reverently with an embroidered white cloth and dusted every day but the master can’t bring himself to turn it on. There is too much trouble in the world. The air-conditioner gives him asthma so he never turns it on, even in the searing heat of summer. His son is a mystery to him—his mother dotes on the boy but the master can’t help fearing that this young man has become a stranger, that he is involved in some shady business. The son always has a cell phone with him and is always calling nameless friends in Mumbai, bursting into cheery laughter, dropping his voice to a whisper, walking up and down the pathetically clean drawing-room as he speaks. Although he would never admit it to anybody other than Allah, Abdul Karim has the distinct impression that his son is waiting for him to die. He is always relieved when his son leaves.\nStill, these are domestic worries. What father does not worry about his children? Nobody would be particularly surprised to know that the quiet, kindly master of mathematics shares them also. What they don’t know is that he has a secret, an obsession, a passion that makes him different from them all. It is because of this, perhaps, that he seems always to be looking at something just beyond their field of vision, that he seems a little lost in the cruel, mundane world in which they live.\nHe wants to see infinity.\nIt is not strange for a mathematics master to be obsessed with numbers. But for Abdul Karim, numbers are the stepping stones, rungs in the ladder that will take him (Inshallah!) from the prosaic ugliness of the world to infinity.\nWhen he was a child he used to see things from the corners of his eyes. Shapes moving at the very edge of his field of vision. Haven’t we all felt that there was someone to our left or right, darting away when we turned our heads? In his childhood he had thought they were farishte, angelic beings keeping a watch over him. And he had felt secure, loved, nurtured by a great, benign, invisible presence.\nOne day he asked his mother:\n“Why don’t the farishte stay and talk to me? Why do they run away when I turn my head?”\nInexplicably to the child he had been, this innocent question led to visits to the Hakim. Abdul Karim had always been frightened of the Hakim’s shop, the walls of which were lined from top to bottom with old clocks. The clocks ticked and hummed and whirred while tea came in chipped glasses and there were questions about spirits and possessions, and bitter herbs were dispensed in antique bottles that looked at though they contained djinns. An amulet was given to the boy to wear around his neck; there were verses from the Qur’an he was to recite every day. The boy he had been sat at the edge of the worn velvet seat and trembled; after two weeks of treatment, when his mother asked him about the farishte, he had said:\n“They’re gone.”\nThat was a lie.\nMy theory stands as firm as a rock; every arrow directed against it will quickly return to the archer. How do I know this? Because I have studied it from all sides for many years; because I have examined all objections which have ever been made against the infinite numbers; and above all because I have followed its roots, so to speak, to the first infallible cause of all created things.\n—Georg Cantor, German mathematician (1845-1918)\nIn a finite world, Abdul Karim ponders infinity. He has met infinities of various kinds in mathematics. If mathematics is the language of Nature, then it follows that there are infinities in the physical world around us as well. They confound us because we are such limited things. Our lives, our science, our religions are all smaller than the cosmos. Is the cosmos infinite? Perhaps. As far as we are concerned, it might as well be.\nIn mathematics there is the sequence of natural numbers, walking like small, determined soldiers into infinity. But there are less obvious infinities as well, as Abdul Karim knows. Draw a straight line, mark zero on one end and the number one at the other. How many numbers between zero and one? If you start counting now, you’ll still be counting when the universe ends, and you’ll be nowhere near one. In your journey from one end to the other you’ll encounter the rational numbers and the irrational numbers, most notably the transcendentals. The transcendental numbers are the most intriguing—you can’t generate them from integers by division, or by solving simple equations. Yet in the simple number line there are nearly impenetrable thickets of them; they are the densest, most numerous of all numbers. It is only when you take certain ratios like the circumference of a circle to its diameter, or add an infinite number of terms in a series, or negotiate the countless steps of infinite continued fractions, do these transcendental numbers emerge. The most famous of these is, of course, pi, 3.14159 . . . , where there is an infinity of non-repeating numbers after the decimal point. The transcendentals! Theirs is a universe richer in infinities than we can imagine.\nIn finiteness—in that little stick of a number line—there is infinity. What a deep and beautiful concept, thinks Abdul Karim! Perhaps there are infinities in us too, universes of them.\nThe prime numbers are another category that capture his imagination. The atoms of integer arithmetic, the select few that generate all other integers, as the letters of an alphabet generate all words. There are an infinite number of primes, as befits what he thinks of as God’s alphabet . . .\nHow ineffably mysterious the primes are! They seem to occur at random in the sequence of numbers: 2, 3, 5, 7, 11 . . . There is no way to predict the next number in the sequence without actually testing it. No formula that generates all the primes. And yet, there is a mysterious regularity in these numbers that has eluded the greatest mathematicians of the world. Glimpsed by Riemann, but as yet unproven, there are hints of order so deep, so profound, that it is as yet beyond us.\nTo look for infinity in an apparently finite world—what nobler occupation for a human being, and one like Abdul Karim, in particular?\nAs a child he questioned the elders at the mosque: What does it mean to say that Allah is simultaneously one, and infinite? When he was older he read the philosophies of Al Kindi and Al Ghazali, Ibn Sina and Iqbal, but his restless mind found no answers. For much of his life he has been convinced that mathematics, not the quarrels of philosophers, is the key to the deepest mysteries.\nHe wonders whether the farishte that have kept him company all his life know the answer to what he seeks. Sometimes, when he sees one at the edge of his vision, he asks a question into the silence. Without turning around.\nIs the Riemann Hypothesis true?\nSilence.\nAre prime numbers the key to understanding infinity?\nSilence.\nIs there a connection between transcendental numbers and the primes?\nThere has never been an answer.\nBut sometimes, a hint, a whisper of a voice that speaks in his mind. Abdul Karim does not know whether his mind is playing tricks upon him or not, because he cannot make out what the voice is saying. He sighs and buries himself in his studies.\nHe reads about prime numbers in Nature. He learns that the distribution of energy level spacings of excited uranium nuclei seem to match the distribution of spacings between prime numbers. Feverishly he turns the pages of the article, studies the graphs, tries to understand. How strange that Allah has left a hint in the depths of atomic nuclei! He is barely familiar with modern physics—he raids the library to learn about the structure of atoms.\nHis imagination ranges far. Meditating on his readings, he grows suspicious now that perhaps matter is infinitely divisible. He is beset by the notion that maybe there is no such thing as an elementary particle. Take a quark and it’s full of preons. Perhaps preons themselves are full of smaller and smaller things. There is no limit to this increasingly fine graininess of matter.\nHow much more palatable this is than the thought that the process stops somewhere, that at some point there is a pre-preon, for example, that is composed of nothing else but itself. How fractally sound, how beautiful if matter is a matter of infinitely nested boxes.\nThere is a symmetry in it that pleases him. After all, there is infinity in the very large too. Our universe, ever expanding, apparently without limit.\nHe turns to the work of Georg Cantor, who had the audacity to formalize the mathematical study of infinity. Abdul Karim painstakingly goes over the mathematics, drawing his finger under every line, every equation in the yellowing textbook, scribbling frantically with his pencil. Cantor is the one who discovered that certain infinite sets are more infinite than others—that there are tiers and strata of infinity. Look at the integers, 1, 2, 3, 4 . . . Infinite, but of a lower order of infinity than the real numbers like 1.67, 2.93 etc. Let us say the set of integers is of order Aleph-null, the set of real numbers of order Aleph-One, like the hierarchical ranks of a king’s courtiers. The question that plagued Cantor and eventually cost him his life and sanity was the Continuum Hypothesis, which states that there is no infinite set of numbers with order between Aleph-Null and Aleph-One. In other words, Aleph-One succeeds Aleph-Null; there is no intermediate rank. But Cantor could not prove this.\nHe developed the mathematics of infinite sets. Infinity plus infinity equals infinity. Infinity minus infinity equals infinity. But the Continuum Hypothesis remained beyond his reach.\nAbdul Karim thinks of Cantor as a cartographer in a bizarre new world. Here the cliffs of infinity reach endlessly toward the sky, and Cantor is a tiny figure lost in the grandeur, a fly on a precipice. And yet, what boldness! What spirit! To have the gall to actually classify infinity . . .\nHis explorations take him to an article on the mathematicians of ancient India. They had specific words for large numbers. One purvi, a unit of time, is seven hundred and fifty-six thousand billion years. One sirsaprahelika is eight point four million Purvis raised to the twenty-eighth power. What did they see that caused them to play with such large numbers? What vistas were revealed before them? What wonderful arrogance possessed them that they, puny things, could dream so large?\nHe mentions this once to his friend, a Hindu called Gangadhar, who lives not far away. Gangadhar’s hands pause over the chessboard (their weekly game is in progress) and he intones a verse from the Vedas:\nFrom the Infinite, take the Infinite, and lo! Infinity remains . . .\nAbdul Karim is astounded. That his ancestors could anticipate Georg Cantor by four millennia!\nThat fondness for science, . . . that affability and condescension which God shows to the learned, that promptitude with which he protects and supports them in the elucidation of obscurities and in the removal of difficulties, has encouraged me to compose a short work on calculating by al-jabr and al-muqabala, confining it to what is easiest and most useful in arithmetic.\n—Al Khwarizmi, eighth century Arab mathematician\nMathematics came to the boy almost as naturally as breathing. He made a clean sweep of the exams in the little municipal school. The neighborhood was provincial, dominated by small tradesmen, minor government officials and the like, and their children seemed to have inherited or acquired their plodding practicality. Nobody understood that strangely clever Muslim boy, except for a Hindu classmate, Gangadhar, who was a well-liked, outgoing fellow. Although Gangadhar played gulli-danda on the streets and could run faster than anybody, he had a passion for literature, especially poetry—a pursuit perhaps as impractical as pure mathematics. The two were drawn together and spent many hours sitting on the compound wall at the back of the school, eating stolen jamuns from the trees overhead and talking about subjects ranging from Urdu poetry and Sanskrit verse to whether mathematics pervaded everything, including human emotions. They felt very grown-up and mature for their stations. Gangadhar was the one who, shyly, and with many giggles, first introduced Kalidasa’s erotic poetry to Abdul Karim. At that time girls were a mystery to them both: although they shared classrooms it seemed to them that girls (a completely different species from their sisters, of course) were strange, graceful, alien creatures from another world. Kalidasa’s lyrical descriptions of breasts and hips evoked in them unarticulated longings.\nThey had the occasional fight, as friends do. The first serious one happened when there were some Hindu-Muslim tensions in the city just before the elections. Gangadhar came to Abdul in the school playground and knocked him flat.\n“You’re a bloodthirsty Muslim!” he said, almost as though he had just realized it.\n“You’re a hell-bound kafir!”\nThey punched each other, wrestled the other to the ground. Finally, with cut lips and bruises, they stared fiercely at each other and staggered away. The next day they played gulli-danda in the street on opposite sides for the first time.\nThen they ran into each other in the school library. Abdul Karim tensed, ready to hit back if Gangadhar hit him. Gangadhar looked as if he was thinking about it for a moment, but then, somewhat embarrassedly, he held out a book.\n“New book . . . on mathematics. Thought you’d want to see it . . . ”\nAfter that they were sitting on the wall again, as usual.\nTheir friendship had even survived the great riots four years later, when the city became a charnel house—buildings and bodies burned, and unspeakable atrocities were committed by both Hindus and Muslims. Some political leader of one side or another had made a provocative proclamation that he could not even remember, and tempers had been inflamed. There was an incident—a fight at a bus-stop, accusations of police brutality against the Muslim side, and things had spiraled out of control. Abdul’s elder sister Ayesha had been at the market with a cousin when the worst of the violence broke out. They had been separated in the stampede; the cousin had come back, bloodied but alive, and nobody had ever seen Ayesha again.\nThe family never recovered. Abdul’s mother went through the motions of living but her heart wasn’t in it. His father lost weight, became a shrunken mockery of his old, vigorous self—he would die only a few years later. As for Abdul—the news reports about atrocities fed his nightmares and in his dreams he saw his sister bludgeoned, raped, torn to pieces again and again and again. When the city calmed down, he spent his days roaming the streets of the market, hoping for a sign of Ayesha—a body even—torn between hope and feverish rage.\nTheir father stopped seeing his Hindu friends. The only reason Abdul did not follow suit was because Gangadhar’s people had sheltered a Muslim family during the carnage, and had turned off a mob of enraged Hindus.\nOver time the wound—if it did not quite heal—became bearable enough that he could start living again. He threw himself into his beloved mathematics, isolating himself from everyone but his family and Gangadhar. The world had wronged him. He did not owe it anything.\nAryabhata is the master who, after reaching the furthest shores and plumbing the inmost depths of the sea of ultimate knowledge of mathematics, kinematics and spherics, handed over the three sciences to the learned world.\n—The Mathematician Bhaskara, commenting on the 6th century Indian mathematician Aryabhata, a hundred years later.\nAbdul Karim was the first in his family to go to college. By a stroke of great luck, Gangadhar went to the same regional institution, majoring in Hindi literature while Abdul Karim buried himself in mathematical arcana. Abdul’s father had become reconciled to his son’s obsession and obvious talent. Abdul Karim himself, glowing with praise from his teachers, wanted to follow in the footsteps of Ramanujan. Just as the goddess Namakkal had appeared to that untutored genius in his dreams, writing mathematical formulas on his tongue (or so Ramanujan had said), Abdul Karim wondered if the farishte had been sent by Allah so that he, too, might be blessed with mathematical insight.\nDuring that time an event occurred that convinced him of this.\nAbdul was in the college library, working on a problem in differential geometry, when he sensed a farishta at the edge of his field of vision. As he had done countless times before, he turned his head slowly, expecting the vision to vanish.\nInstead he saw a dark shadow standing in front of the long bookcase. It was vaguely human-shaped. It turned slowly, revealing itself to be thin as paper—but as it turned it seemed to acquire thickness, hints of features over its dark, slender form. And then it seemed to Abdul that a door opened in the air, just a crack, and he had a vision of an unutterably strange world beyond. The shadow stood at the door, beckoning with one arm, but Abdul Karim sat still, frozen with wonder. Before he could rouse himself and get up, the door and the shadow both rotated swiftly and vanished, and he was left staring at the stack of books on the shelf.\nAfter this he was convinced of his destiny. He dreamed obsessively of the strange world he had glimpsed; every time he sensed a farishta he turned his head slowly toward it—and every time it vanished. He told himself it was just a matter of time before one of them came, remained, and perhaps—wonder of wonders—took him to that other world.\nThen his father died unexpectedly. That was the end of Abdul Karim’s career as a mathematician. He had to return home to take care of his mother, his two remaining sisters and a brother. The only thing he was qualified for was teaching. Ultimately he would find a job at the same municipal school from which he had graduated.\nOn the train home, he saw a woman. The train was stopped on a bridge. Below him was the sleepy curve of a small river, gold in the early morning light, mists rising faintly off it, and on the shore a woman with a clay water pot. She had taken a dip in the river—her pale, ragged sari clung wetly to her as she picked up the pot and set it on her hip and began to climb the bank. In the light of dawn she was luminous, an apparition in the mist, the curve of the pot against the curve of her hip. Their eyes met from a distance—he imagined what he thought she saw, the silent train, a young man with a sparse beard looking at her as though she was the first woman in the world. Her own eyes gazed at him fearlessly as though she were a goddess looking into his soul. For a moment there were no barriers between them, no boundaries of gender, religion, caste or class. Then she turned and vanished behind a stand of shisham trees.\nHe wasn’t sure if she had really been there in the half-light or whether he had conjured her up, but for a long time she represented something elemental to him. Sometimes he thought of her as Woman, sometimes as a river.\nHe got home in time for the funeral. His job kept him busy, and kept the moneylender from their door. With the stubborn optimism of the young, he kept hoping that one day his fortunes would change, that he would go back to college and complete his degree. In the meantime, he knew his mother wanted to find him a bride . . .\nAbdul Karim got married, had children. Slowly, over the years of managing rowdy classrooms, tutoring students in the afternoons and saving, paisa by paisa, from his meager salary for his sisters’ weddings and other expenses, Abdul Karim lost touch with that youthful, fiery talent he had once had, and with it the ambition to scale the heights to which Ramanujan, Cantor and Riemann had climbed. Things came more slowly to him now. An intellect burdened by years of worry wears out. When his wife died and his children grew up and went away, his steadily decreasing needs finally caught up with his meager income, and he found for the first time that he could think about mathematics again. He no longer hoped to dazzle the world of mathematics with some new insight, such as a proof of Riemann’s hypothesis. Those dreams were gone. All he could hope for was to be illumined by the efforts of those who had gone before him, and to re-live, vicariously, the joys of insight. It was a cruel trick of Time, that when he had the leisure he had lost the ability, but that is no bar to true obsession. Now, in the autumn of his life it was as though Spring had come again, bringing with it his old love.\nIn this world, brought to its knees by hunger and thirst\nLove is not the only reality, there are other Truths . . .\n—Sahir Ludhianvi, Indian poet (1921-1980)\nThere are times when Abdul Karim tires of his mathematical obsessions. After all, he is old. Sitting in the courtyard with his notebook, pencil and books of mathematics for so many hours at a stretch can take its toll. He gets up, aching all over, sees to his mother’s needs and goes out to the graveyard where his wife is buried.\nHis wife Zainab had been a plump, fair-skinned woman, hardly able to read or write, who moved about the house with indolent grace, her good-natured laugh ringing out in the courtyard as she chattered with the washerwoman. She had loved to eat—he still remembered the delicate tips of her plump fingers, how they would curl around a piece of lamb, scooping up with it a few grains of saffron rice, the morsel conveyed reverently to her mouth. Her girth gave an impression of strength, but ultimately she had not been able to hold out against her mother-in-law. The laughter in her eyes faded gradually as her two boys grew out of babyhood, coddled and put to bed by the grandmother in her own corner of the women’s quarters. Abdul Karim himself had been unaware of the silent war between his wife and mother—he had been young and obsessed with teaching mathematics to his recalcitrant students. He had noticed how the grandmother always seemed to be holding the younger son, crooning to him, and how the elder boy followed his mother around, but he did not see in this any connection to his wife’s growing pallor. One night he had requested her to come to him and massage his feet—their euphemism for sex—and he had waited for her to come to him from the women’s quarters, impatient for the comfort of her plump nakedness, her soft, silken breasts. When she came at last she had knelt at the foot of the bed, her chest heaving with muffled sobs, her hands covering her face. As he took her in his arms, wondering what could have ruffled her calm good nature, she had collapsed completely against him. No comfort he could offer would make her tell what it was that was breaking her heart. At last she begged him, between great, shuddering breaths, that all she wanted in the world was another baby.\nAbdul Karim had been influenced by modern ideas—he considered two children, boys at that, to be quite sufficient for a family. As one of five children, he had known poverty and the pain of giving up his dream of a university career to help support his family. He wasn’t going to have his children go through the same thing. But when his wife whispered to him that she wanted one more, he relented.\nNow, when he looked back, he wished he had tried to understand the real reason for her distress. The pregnancy had been a troublesome one. His mother had taken charge of both boys almost entirely while Zainab lay in bed in the women’s quarters, too sick to do anything but weep silently and call upon Allah to rescue her. “It’s a girl,” Abdul Karim’s mother had said grimly. “Only a girl would cause so much trouble.” She had looked away out of the window into the courtyard, where her own daughter, Abdul Karim’s dead sister, Ayesha, had once played and helped hang the wash.\nAnd finally it had been a girl, stillborn, who had taken her mother with her. They were buried together in the small, unkempt graveyard where Abdul Karim went whenever he was depressed. By now the gravestone was awry and grass had grown over the mound. His father was buried here also, and three of his siblings who had died before he was six. Only Ayesha, lost Ayesha, the one he remembered as a source of comfort to a small boy—strong, generous arms, hands delicate and fragrant with henna, a smooth cheek—she was not here.\nIn the graveyard Abdul Karim pays his respects to his wife’s memory while his heart quails at the way the graveyard itself is disintegrating. He is afraid that if it goes to rack and ruin, overcome by vegetation and time, he will forget Zainab and the child and his guilt. Sometimes he tries to clear the weeds and tall grasses with his hands, but his delicate scholar’s hands become bruised and sore quite quickly, and he sighs and thinks about the Sufi poetess Jahanara, who had written, centuries earlier: “Let the green grass grow above my grave!”\nI have often pondered over the roles of knowledge or experience, on the one hand, and imagination or intuition, on the other, in the process of discovery. I believe that there is a certain fundamental conflict between the two, and knowledge, by advocating caution, tends to inhibit the flight of imagination. Therefore, a certain naivete, unburdened by conventional wisdom, can sometimes be a positive asset.\n—Harish-Chandra, Indian mathematician (1923-1983).\nGangadhar, his friend from school, was briefly a master of Hindi literature at the municipal school and is now an academician at the Amravati Heritage Library, and a poet in his spare time. He is the only person to whom Abdul Karim can confide his secret passion.\nIn time, he too becomes intrigued with the idea of infinity. While Abdul Karim pores over Cantor and Riemann, and tries to make meaning from the Prime Number theorem, Gangadhar raids the library and brings forth treasures. Every week, when Abdul Karim walks the two miles to Gangadhar’s house, where he is led by the servant to the comfortable drawing room with its gracious, if aging mahogany furniture, the two men share what they’ve learned over cups of cardamom tea and a chess game. Gangadhar cannot understand higher mathematics but he can sympathize with the frustrations of the knowledge-seeker, and he has known what it is like to chip away at the wall of ignorance and burst into the light of understanding. He digs out quotes from Aryabhata and Al-Khwarizmi, and tells his friend such things as:\n“Did you know, Abdul, that the Greeks and Romans did not like the idea of infinity? Aristotle argued against it, and proposed a finite universe. Of the yunaanis, only Archimedes dared to attempt to scale that peak. He came up with the notion that different infinite quantities could be compared, that one infinite could be greater or smaller than another infinite . . . ”\nAnd on another occasion:\n“The French mathematician, Jacques Hadamard . . . He was the one who proved the Prime Number theorem that has you in such ecstasies . . . he says there are four stages to mathematical discovery. Not very different from the experience of the artist or poet, if you think about it. The first is to study and be familiar with what is known. The next is to let these ideas turn in your mind, as the earth regenerates by lying fallow between plantings. Then—with luck—there is the flash of insight, the illuminating moment when you discover something new and feel in your bones that it must be true. The final stage is to verify—to subject that epiphany to the rigors of mathematical proof . . . ”\nAbdul Karim feels that if he can simply go through Hadamard’s first two stages, perhaps Allah will reward him with a flash of insight. And perhaps not. If he had hopes of being another Ramanujan, those hopes are gone now. But no true Lover has ever turned from the threshold of the Beloved’s house, even knowing he will not be admitted through the doors.\n“What worries me,” he confides to Gangadhar during one of these discussions, “what has always worried me, is Gödel’s Incompleteness Theorem. According to Gödel, there can be statements in mathematics that are not provable. He showed that the Continuum Hypothesis of Cantor was one of these statements. Poor Cantor, he lost his sanity trying to prove something that cannot be proved or disproved! What if all our unproven ideas on prime numbers, on infinity, are statements like that? If they can’t be tested against the constraints of mathematical logic, how will we ever know if they are true?”\nThis bothers him very much. He pores over the proof of Gödel’s theorem, seeking to understand it, to get around it. Gangadhar encourages him:\n“You know, in the old tales, every great treasure is guarded by a proportionally great monster. Perhaps Gödel’s theorem is the djinn that guards the truth you seek. Maybe instead of slaying it, you have to, you know, befriend it . . . ”\nThrough his own studies, through discussions with Gangadhar, Abdul Karim begins to feel again that his true companions are Archimedes, Al-Khwarizmi. Khayyam, Aryabhata, Bhaskar. Riemann, Cantor, Gauss, Ramanujan, Hardy.\nThey are the masters, before whom he is as a humble student, an apprentice following their footprints up the mountainside. The going is rough. He is getting old, after all. He gives himself up to dreams of mathematics, rousing himself only to look after the needs of his mother, who is growing more and more frail.\nAfter a while, even Gangadhar admonishes him.\n“A man cannot live like this, so obsessed. Will you let yourself go the way of Cantor and Gödel? Guard your sanity, my friend. You have a duty to your mother, to society.”\nAbdul Karim cannot make Gangadhar understand. His mind sings with mathematics.\nThe limit of a function f(N) as N goes to infinity . . . ..\nSo many questions he asks himself begin like this. The function f(N) may be the prime counting function, or the number of nested dolls of matter, or the extent of the universe. It may be abstract, like a parameter in a mathematical space, or earthy, like the branching of wrinkles in the face of his mother, growing older and older in the paved courtyard of his house, under the litchi trees. Older and older, without quite dying, as though she were determined to live Zeno’s paradox.\nHe loves his mother the way he loves the litchi tree; for being there, for making him what he is, for giving him shelter and succor.\nThe limit . . . as N goes to infinity . . .\nSo begin many theorems of calculus. Abdul Karim wonders what kind of calculus governs his mother’s slow arc into dying. What if life did not require a minimum threshold of conditions—what if death were merely a limit of some function f(N) as N goes to infinity?\nA world in which human life is but a pawn\nA world filled with death-worshipers,\nWhere death is cheaper than life . . .\nThat world is not my world . . .\n—Sahir Ludhianvi, Indian poet (1921-1980)\nWhile Abdul Karim dabbles in the mathematics of the infinite, as so many deluded fools and geniuses have done, the world changes.\nHe is vaguely aware that there are things going on in the world—that people live and die, that there are political upheavals, that this is the hottest summer yet and already a thousand people have died of the heat wave in Northern India. He knows that Death also stands at his mother’s shoulder, waiting, and he does what he can for her. Although he has not always observed the five daily prayers, he does the namaz now, with her. She has already started becoming the citizen of another country—she lives in little leaps and bends of time long gone, calling for Ayesha one moment, and for her long-dead husband the next. Conversations from her lost girlhood emerge from her trembling mouth. In her few moments of clarity she calls upon Allah to take her away.\nDutiful as he is to his mother, Abdul Karim is relieved to be able to get away once a week for a chess game and conversation with Gangadhar. He has a neighbor’s aunt look in on his mother during that time. Heaving a sigh or two, he makes his way through the familiar lanes of his childhood, his shoes scuffing up dust under the ancient jamun trees that he once climbed as a child. He greets his neighbors: old Ameen Khan Sahib sitting on his charpai, wheezing over his hookah, the Ali twins, madcap boys chasing a bicycle tire with a stick, Imran at the paan shop. He crosses, with some trepidation, the increasingly congested market road, past the faded awnings of Munshilal and Sons, past a rickshaw stand into another quiet lane, this one shaded with jacaranda trees. Gangadhar’s house is a modest white bungalow, stained an indeterminate gray from many monsoons. The creak of the wooden gate in the compound wall is as familiar a greeting as Gangadhar’s welcome.\nBut the day comes when there is no chess game at Gangadhar’s house.\nThe servant boy—not Gangadhar—ushers him into the familiar room. Sitting down in his usual chair, Abdul Karim notices that the chess board has not been laid out. Sounds come from the inner rooms of the house: women’s voices, heavy objects being dragged across the floor.\nAn elderly man comes into the room and stops short as though surprised to see Abdul Karim. He looks vaguely familiar—then Abdul remembers that he is some relative of Gangadhar’s wife—an uncle, perhaps—and he lives on the other side of the city. They have met once or twice at some family celebration.\n“What are you doing here?” the man says, without any of the usual courtesies. He is white-haired but of vigorous build.\nPuzzled and a little affronted, Abdul Karim says:\n“I am here for my chess game with Gangadhar. Is he not at home?”\n“There will be no chess game today. Haven’t you people done enough harm? Are you here to mock us in our sorrow? Well, let me tell you . . . ”\n“What happened?” Abdul Karim’s indignation is dissolving in a wave of apprehension. “What are you talking about? Is Gangadhar all right?”\n“Perhaps you don’t know,” says the man, his tone mocking. “Some of your people burned a bus on Paharia road yesterday evening. There were ten people on it, all Hindus, coming back from a family ceremony at a temple. They all perished horribly. Word has it that you people did it. Didn’t even let the children get off the bus. Now the whole town is in turmoil. Who knows what might happen? Gangadhar and I are taking his family to a safer part of town.”\nAbdul Karim’s eyes are wide with shock. He can find no words.\n“All these hundreds of years we Hindus have tolerated you people. Even though you Muslims raided and pillaged us over the centuries, we let you build your mosques, worship your God. And this is how you pay us!”\nIn one instant Abdul Karim has become “you people.” He wants to say that he did not lift an arm to hurt those who perished on the bus. His were not the hands that set the fire. But no words come out.\n“Can you imagine it, Master Sahib? Can you see the flames? Hear their screams? Those people will never go home . . . ”\n“I can imagine it,” Abdul Karim says, grimly now. He rises to his feet, but just then Gangadhar enters the room. He has surely heard part of the conversation because he puts his hands on Abdul Karim’s shoulders, gently, recognizing him as the other man has not done. This is Abdul Karim, his friend, whose sister, all those years ago, never came home.\nGangadhar turns to his wife’s uncle.\n“Uncle, please. Abdul Karim is not like those miscreants. A kinder man I have never known! And as yet it is not known who the ruffians are, although the whole town is filled with rumors. Abdul, please sit down! This is a measure of the times we live in, that we can say such things to each other. Alas! Kalyug is indeed upon us.”\nAbdul Karim sits down, but he is shaking. All thoughts of mathematics have vanished from his mind. He is filled with disgust and revulsion for the barbarians who committed this atrocity, for human beings in general. What a degraded species we are! To take the name of Ram or Allah, or Jesus, and to burn and destroy under one aegis or another—that is what our history has been.\nThe uncle, shaking his head, has left the room. Gangadhar is talking history to Abdul, apologizing for his uncle.\n“ . . . a matter of political manipulation,” he says. “The British colonialists looked for our weakness, exploited it, set us against each other. Opening the door to hell is easy enough—but closing it is hard. All those years, before British rule, we lived in relative peace. Why is it that we cannot close that door they opened? After all, what religion tells us to slay our neighbor?”\n“Does it matter?” Abdul Karim says bitterly. “We humans are a depraved species, my friend. My fellow Muslims address every prayer to Allah, the Merciful and Compassionate. You Hindus, with your “Isha Vasyam Idam Sarvam”—the divine pervades all. The Christians talk on about turning the other cheek. And yet each of them has hands that are stained in blood. We pervert everything—we take the words of peace spoken by prophets and holy men and turn them into weapons with which to kill each other!”\nHe is shaking so hard that he can barely speak.\n“It is in mathematics . . . only in mathematics that I see Allah . . . ”\n“Quiet now,” Gangadhar says. He calls for the servant to bring some water for the master sahib. Abdul Karim drinks and wipes his mouth. The suitcases are being brought out from inside the house. There is a taxi in front.\n“Listen, my friend,” Gangadhar says, “you must look to your safety. Go home now and lock your doors, and look after your mother. I am sending my family away and I will join them in a day or so. When this madness has passed I will come and look for you!”\nAbdul Karim goes home. So far everything looks normal—the wind is blowing litter along in the streets, the paan shop is open, people throng the bus-stop. Then he notices that there aren’t any children, even though the summer holidays are going on.\nThe vegetable market is very busy. People are buying up everything like crazy. He buys a few potatoes, onions and a large gourd, and goes home. He locks the door. His mother, no longer up to cooking meals, watches as he cooks. After they eat and he has her tucked into bed, he goes to his study and opens a book on mathematics.\nOne day passes, perhaps two—he does not keep track. He remembers to take care of his mother but often forgets to eat. His mother lives, more and more, in that other world. His sisters and brother call from other towns, anxious about the reports of escalating violence; he tells them not to worry. When things are back to normal they will come and see him and their mother.\nHow marvelous, the Universal Mystery\nThat only a true Lover can comprehend!\n—Bulleh Shah, eighteenth century Punjabi Sufi poet\nLogic merely sanctions the conquests of the intuition.\n—Jacques Hadamard, French mathematician (1865-1963)\nOne morning he emerges from the darkness of his study into the sunny courtyard. Around him the old city writhes and burns, but Abdul Karim sees and hears nothing but mathematics. He sits in his old cane chair, picks up a stick lying on the ground and begins to draw mathematical symbols in the dust.\nThere is a farishta standing at the edge of his vision.\nHe turns slowly. The dark shadow stays there, waits. This time Abdul Karim is quick on his feet, despite a sudden twinge of pain in one knee. He walks toward the door, the beckoning arm, and steps through.\nFor a moment he is violently disoriented—it occurs to him that he has spun through a different dimension into this hidden world. Then the darkness before his eyes dissipates, and he beholds wonders.\nAll is hushed. He is looking at a vast sweep of land and sky unlike anything he has ever seen. Dark, pyramidal shapes stud the landscape, great monuments to something beyond his understanding. There is a vast, polyhedral object suspended in a pale orange sky that has no sun. Only a diffuse luminescence pervades this sky. He looks at his feet, still in his familiar, worn sandals, and sees all around, in the sand, little fish-like creatures wriggling and spawning. Some of the sand has worked its way between his toes, and it feels warm and rubbery, not like sand at all. He takes a deep breath and smells something strange, like burnt rubber mixed with his own sweat. The shadow stands by his side, looking solid at last, almost human but for the absence of neck and the profusion of limbs—their number seems to vary with time—at the moment Abdul Karim counts five.\nThe dark orifice in the head opens and closes, but no sound comes out. Instead Abdul feels as though a thought has been placed in his mind, a package that he will open later.\nHe walks with the shadow across the sands to the edge of a quiet sea. The water, if that is what it is, is foaming and bubbling gently, and within its depths he sees ghostly shapes moving, and the hints of complex structure far below. Arabesques form in the depths, break up, and form again. He licks his dry lips, tastes metal and salt.\nHe looks at his companion, who bids him pause. A door opens. They step through into another universe.\nIt is different, this one. It is all air and light, the whole space hung with great, translucent webbing. Each strand in the web is a hollow tube within which liquid creatures flow. Smaller, solid beings float in the emptiness between the web strands.\nSpeechless, he stretches out his hand toward a web-strand. Its delicacy reminds him of the filigreed silver anklets his wife used to wear. To his complete surprise a tiny being floating within the strand stops. It is like a plump, watery comma, translucent and without any features he can recognize, and yet he has the notion that he is being looked at, examined, and that at the other end is also wonder.\nThe web-strand touches him, and he feels its cool, alien smoothness on a fingertip.\nA door opens. They step through.\nIt is dizzying, this wild ride. Sometimes he gets flashes of his own world, scenes of trees and streets, and distant blue hills. There are indications that these flashes are at different points in time—at one point he sees a vast army of soldiers, their plumed helmets catching the sunlight, and thinks he must be in the time of the Roman Empire. Another time he thinks he is back home, because he sees before him his own courtyard. But there is an old man sitting in his cane chair, drawing patterns in the dust with a stick. A shadow falls across the ground. Someone he cannot see is stealing up behind the old man. Is that a knife agleam in the stranger’s hand? What is this he is seeing? He tries to call out, but no sound emerges. The scene blurs—a door opens, and they step through.\nAbdul Karim is trembling. Has he just witnessed his own death?\nHe remembers that Archimedes died that way—he had been drawing circles, engrossed with a problem in geometry, when a barbarian of a soldier came up behind him and killed him.\nBut there is no time to ponder. He is lost in a merry-go-round of universes, each different and strange. The shadow gives him a glimpse of so many, Abdul Karim has long lost count. He puts thoughts of Death away from him and loses himself in wonder.\nHis companion opens door after door. The face, featureless except for the orifice that opens and shuts, gives no hint of what the shadow is thinking. Abdul Karim wants to ask: who are you? Why are you doing this? He knows, of course, the old story of how the angel Gabriel came to the Prophet Mohammad one night and took him on a celestial journey, a grand tour of the heavens. But the shadow does not look like an angel; it has no face, no wings, its gender is indeterminate. And in any case, why should the angel Gabriel concern himself with a humble mathematics master in a provincial town, a person of no consequence in the world?\nAnd yet, he is here. Perhaps Allah has a message for him; His ways are ineffable, after all. Exultation fills Abdul Karim as he beholds marvel after marvel.\nAt last they pause in a place where they are suspended in a yellow sky. As Abdul Karim experiences the giddy absence of gravity, accompanied by a sudden jolt of nausea that slowly recedes—as he turns in mid-air, he notices that the sky is not featureless but covered with delicate tessellations: geometric shapes intertwine, merge and new ones emerge. The colors change too, from yellow to green, lilac, mauve. All at once it seems as though numberless eyes are opening in the sky, one after the other, and as he turns he sees all the other universes flashing past him. A kaleidoscope, vast beyond his imaginings. He is at the center of it all, in a space between all spaces, and he can feel in his bones a low, irregular throbbing, like the beating of a drum. Boom, boom, goes the drum. Boom boom boom. Slowly he realizes that what he is seeing and feeling is part of a vast pattern.\nIn that moment Abdul Karim has the flash of understanding he has been waiting for all his life.\nFor so long he has been playing with the transcendental numbers, trying to fathom Cantor’s ideas; at the same time Riemann’s notions of the prime numbers have fascinated him. In idle moments he has wondered if they are connected at a deeper level. Despite their apparent randomness the primes have their own regularity, as hinted by the unproven Riemann Hypothesis; he sees at last that if you think of prime numbers as the terrain of a vast country, and if your view of reality is a two-dimensional plane that intersects this terrain at some height above the surface, perhaps at an angle, then of course what you see will appear to be random. Tops of hills. Bits of valleys. Only the parts of the terrain that cross your plane of reality will be apparent. Unless you can see the entire landscape in its multi-dimensional splendor, the topography will make no sense.\nHe sees it: the bare bones of creation, here, in this place where all the universes branch off, the thudding heart of the metacosmos. In the scaffolding, the skeletal structure of the multiverse is beautifully apparent. This is what Cantor had a glimpse of, then, this vast topography. Understanding opens in his mind as though the metacosmos has itself spoken to him. He sees that of all the transcendental numbers, only a few—infinite still, but not the whole set—are marked as doorways to other universes, and each is labeled by a prime number. Yes. Yes. Why this is so, what deeper symmetry it reflects, what law or regularity of Nature undreamed of by the physicists of his world, he does not know.\nThe space where primes live—the topology of the infinite universes—he sees it in that moment. No puny function as yet dreamed of by humans can encompass the vastness—the inexhaustible beauty of this place. He knows that he can never describe this in the familiar symbols of the mathematics that he knows, that while he experiences the truth of the Riemann Hypothesis, as a corollary to this greater, more luminous reality, he cannot sit down and verify it through a conventional proof. No human language as yet exists, mathematical or otherwise, that can describe what he knows in his bones to be true. Perhaps he, Abdul Karim, will invent the beginnings of such a language. Hadn’t the great poet Iqbal interpreted the Prophet’s celestial journey to mean that the heavens are within our grasp?\nA twist, and a door opens. He steps into the courtyard of his house. He turns around, but the courtyard is empty. The farishta is gone.\nAbdul Karim raises his eyes to the heavens. Rain clouds, dark as the proverbial beloved’s hair, sweep across the sky; the litchi tree over his head is dancing in the swift breeze. The wind has drowned out the sounds of a ravaged city. A red flower comes blowing over the courtyard wall and is deposited at his feet.\nAbdul Karim’s hair is blown back, a nameless ecstasy fills him; he feels Allah’s breath on his face.\nHe says into the wind:\nDear Merciful and Compassionate God, I stand before your wondrous universe, filled with awe; help me, weak mortal that I am, to raise my gaze above the sordid pettiness of everyday life, the struggles and quarrels of mean humanity . . . Help me to see the beauty of your Works, from the full flower of the red silk cotton tree to the exquisite mathematical grace by which you have created numberless universes in the space of a man’s step. I know now that my true purpose in this sad world is to stand in humble awe before your magnificence, and to sing a paean of praise to you with every breath I take . . .\nHe feels weak with joy. Leaves whirl in the courtyard like mad dervishes; a drop or two of rain falls, obliterating the equation he had scratched in the dust with his stick. He has lost his chance at mathematical genius a long time ago; he is nobody, only a teacher of mathematics at a school, humbler than a clerk in a government office—yet Allah has favored him with this great insight. Perhaps he is now worthy of speech with Ramanujan and Archimedes and all the ones in between. But all he wants to do is to run out into the lane and go shouting through the city: see, my friends, open your eyes and see what I see! But he knows they would think him mad; only Gangadhar would understand . . . if not the mathematics then the impulse, the importance of the whole discovery.\nHe leaps out of the house, into the lane.\nThis blemished radiance . . . this night-stung dawn\nIs not the dawn we waited for . . .\n—Faiz Ahmed Faiz, Pakistani poet (1911-1984)\nWhere all is broken\nWhere each soul’s athirst, each glance\nFilled with confusion, each heart\nWeighed with sorrow . . .\nIs this a world, or chaos?\n—Sahir Ludhianvi, Indian poet (1921-1980)\nBut what is this?\nThe lane is empty. There are broken bottles everywhere. The windows and doors of his neighbors’ houses are shuttered and barred, like closed eyes. Above the sound of the rain he hears shouting in the distance. Why is there a smell of burning?\nHe remembers then, what he had learned at Gangadhar’s house. Securing the door behind him, he begins to run as fast as his old-man legs will carry him.\nThe market is burning.\nSmoke pours out of smashed store fronts, even as the rain falls. There is broken glass on the pavement; a child’s wooden doll in the middle of the road, decapitated. Soggy pages filled with neat columns of figures lie scattered everywhere, the remains of a ledger. Quickly he crosses the road.\nGangadhar’s house is in ruins. Abdul Karim wanders through the open doors, stares blindly at the blackened walls. The furniture is mostly gone. Only the chess table stands untouched in the middle of the front room.\nFrantically he searches through the house, entering the inner rooms for the first time. Even the curtains have been ripped from the windows.\nThere is no body.\nHe runs out of the house. Gangadhar’s wife’s family—he does not know where they live. How to find out if Gangadhar is safe?\nThe neighboring house belongs to a Muslim family that Abdul Karim knows only from visits to the mosque. He pounds on the door. He thinks he hears movement behind the door, sees the upstairs curtains twitch—but nobody answers his frantic entreaties. At last, defeated, his hands bleeding, he walks slowly home, looking about him in horror. Is this truly his city, his world?\nAllah, Allah, why have you abandoned me?\nHe has beheld the glory of Allah’s workmanship. Then why this? Were all those other universes, other realities a dream?\nThe rain pours down.\nThere is someone lying on his face in a ditch. The rain has wet the shirt on his back, made the blood run. As Abdul Karim starts toward him, wondering who it is, whether he is dead or alive—young, from the back it could be Ramdas or Imran—he sees behind him, at the entrance to the lane, a horde of young men. Some of them may be his students—they can help.\nThey are moving with a predatory sureness that frightens him. He sees that they have sticks and stones.\nThey are coming like a tsunami, a thunderclap, leaving death and ruin in their wake. He hears their shouts through the rain.\nAbdul Karim’s courage fails him. He runs to his house, enters, locks and bars the door and closes all the windows. He checks on his mother, who is sleeping. The telephone is dead. The dal for their meal has boiled away. He turns off the gas and goes back to the door, putting his ear against it. He does not want to risk looking out of the window.\nOver the rain he hears the young men go past at a run. In the distance there is a fusillade of shots. More sounds of running feet, then, just the rain.\nAre the police here? The army?\nSomething or someone is scratching at the door. Abdul Karim is transfixed with terror. He stands there, straining to hear over the pitter patter of the rain. On the other side, somebody moans.\nAbdul Karim opens the door. The lane is empty, roaring with rain. At his feet there is the body of a young woman.\nShe opens her eyes. She’s dressed in a salwaar kameez that has been half-torn off her body—her long hair is wet with rain and blood, plastered over her neck and shoulders. There is blood on her salwaar, blood oozing from a hundred little cuts and welts on her skin.\nHer gaze focuses.\n“Master Sahib..”\nHe is taken aback. Is she someone he knows? Perhaps an old student, grown up?\nQuickly he half-carries, half-pulls her into the house and secures the door. With some difficulty he lifts her carefully on to the divan in the drawing room, which is already staining with her blood. She coughs.\n“My child, who did this to you? Let me find a doctor . . . ”\n“No,” she says. “It’s too late.” Her breath rasps and she coughs again. Tears well up in the dark eyes.\n“Master Sahib, please, let me die! My husband . . . my son . . . They must not see me take my last breath. Not like this. They will suffer. They will want revenge . . . Please . . . cut my wrists . . . ”\nShe’s raising her wrists to his horrified face, but all he can do is to take them in his shaking hands.\n“My daughter,” he says, and doesn’t know what to say. Where will he find a doctor in the mayhem? Can he bind her cuts? Even as he thinks these thoughts he knows that life is ebbing from her. Blood is pooling on his divan, dripping down to the floor. She does not need him to cut her wrists.\n“Tell me, who are the ruffians who did this?”\nShe whispers:\n“I don’t know who they were. I had just stepped out of the house for a moment. My family . . . don’t tell them, Master Sahib! When I’m gone just tell them . . . tell them I died in a safe place . . . ”\n“Daughter, what is your husband’s name?”\nHer eyes are enormous. She is gazing at him without comprehension, as though she is already in another world.\nHe can’t tell if she is Muslim or Hindu. If she wore a vermilion dot on her forehead, it has long since been washed off by the rain.\nHis mother is standing at the door of the drawing room. She wails suddenly and loudly, flings herself by the side of the dying woman.\n“Ayesha! Ayesha, my life!”\nTears fall down Abdul Karim’s face. He tries to disengage his mother. Tries to tell her: this is not Ayesha, just another woman whose body has become a battleground over which men make war. At last he has to lift his mother in his arms, her body so frail that he fears it might break—he takes her to her bed, where she crumples, sobbing and calling Ayesha’s name.\nBack in the drawing room, the young woman’s eyes flicker to him. Her voice is barely above a whisper.\n“Master Sahib, cut my wrists . . . I beseech you, in the Almighty’s name! Take me somewhere safe . . . Let me die . . . ”\nThen the veil falls over her eyes again and her body goes limp.\nTime stands still for Abdul Karim.\nThen he senses something familiar, and turns slowly. The farishta is waiting.\nAbdul Karim picks up the woman in his arms, awkwardly arranging the bloody divan cover over her half-naked body. In the air, a door opens.\nStaggering a little, his knees protesting, he steps through the door.\nAfter three universes he finds the place.\nIt is peaceful. There is a rock rising from a great turquoise sea of sand. The blue sand laps against the rock, making lulling, sibilant sounds. In the high, clear air, winged creatures call to each other between endless rays of light. He squints in the sudden brightness.\nHe closes her eyes, buries her deep at the base of the rock, under the blue, flowing sand.\nHe stands there, breathing hard from the exertion, his hands bruised, thinking he should say something. But what? He does not even know if she’s Muslim or Hindu. When she spoke to him earlier, what word had she used for God? Was it Allah or Ishwar, or something neutral?\nHe can’t remember.\nAt last he says the Al-Fatihah, and, stumbling a little, recites whatever little he knows of the Hindu scriptures. He ends with the phrase Isha Vasyamidam Sarvam.\nTears run off his cheeks into the blue sand, and disappear without leaving a trace.\nThe farishta waits.\n“Why didn’t you do something!” Abdul Karim rails at the shadow. He falls to his knees in the blue sand, weeping. “Why, if you are truly a farishta, didn’t you save my sister?”\nHe sees now that he has been a fool—this shadow creature is no angel, and he, Abdul Karim, no Prophet.\nHe weeps for Ayesha, for this nameless young woman, for the body he saw in the ditch, for his lost friend Gangadhar.\nThe shadow leans toward him. Abdul Karim gets up, looks around once, and steps through the door.\nHe steps out into his drawing room. The first thing he discovers is that his mother is dead. She looks quite peaceful, lying in her bed, her white hair flowing over the pillow.\nShe might be asleep, her face is so calm.\nHe stands there for a long time, unable to weep. He picks up the phone—there is still no dial tone. After that he goes about methodically cleaning up the drawing room, washing the floor, taking the bedding off the divan. Later, after the rain has stopped, he will burn it in the courtyard. Who will notice another fire in the burning city?\nWhen everything is cleaned up, he lies down next to his mother’s body like a small boy and goes to sleep.\nWhen you left me, my brother, you took away the book\nIn which is writ the story of my life . . .\n—Faiz Ahmed Faiz, Pakistani poet (1911-1984)\nThe sun is out. An uneasy peace lies over the city. His mother’s funeral is over. Relatives have come and gone—his younger son came, but did not stay. The older son sent a sympathy card from America.\nGangadhar’s house is still empty, a blackened ruin. Whenever he has ventured out, Abdul Karim has asked about his friend’s whereabouts. The last he heard was that Gangadhar was alone in the house when the mob came, and his Muslim neighbors sheltered him until he could join his wife and children at her parents’ house. But it has been so long that he does not believe it any more. He has also heard that Gangadhar was dragged out, hacked to pieces and his body set on fire. The city has calmed down—the army had to be called in—but it is still rife with rumors. Hundreds of people are missing. Civil rights groups comb the town, interviewing people, revealing, in clipped, angry press statements, the negligence of the state government, the collusion of the police in some of the violence. Some of them came to his house, too, very clean, very young people, burning with an idealism that, however misplaced, is comforting to see. He has said nothing about the young woman who died in his arms, but he prays for that bereft family every day.\nFor days he has ignored the shadow at his shoulder. But now he knows that the sense of betrayal will fade. Whose fault is it, after all, that he ascribed to the creatures he once called farishte the attributes of angels? Could angels, even, save human beings from themselves?\nThe creatures watch us with a child’s curiosity, he thinks, but they do not understand. Just as their own worlds are incomprehensible to me, so are our ways to them. They are not Allah’s minions.\nThe space where the universes branch off—the heart of the metacosmos—now appears remote to him, like a dream. He is ashamed of his earlier arrogance. How can he possibly fathom Allah’s creation in one glance? No finite mind can, in one meager lifetime, truly comprehend the vastness, the grandeur of Allah’s scheme. All we can do is to discover a bit of the truth here, a bit there, and thus to sing His praises.\nBut there is so much pain in Abdul Karim’s soul that he cannot imagine writing down one syllable of the new language of the infinite. His dreams are haunted by the horrors he has seen, the images of his mother and the young woman who died in his arms. He cannot even say his prayers. It is as though Allah has abandoned him, after all.\nThe daily task of living—waking up, performing his ablutions, setting the little pot on the gas stove to boil water for one cup of tea, to drink that tea alone—unbearable thought! To go on, after so many have died—to go on without his mother, his children, without Gangadhar . . . Everything appears strangely remote: his aging face in the mirror, the old house, even the litchi tree in his courtyard. The familiar lanes of his childhood hold memories that no longer seem to belong to him. Outside, the neighbors are in mourning; old Ameen Khan Sahib weeps for his grandson; Ramdas is gone, Imran is gone. The wind still carries the soot of the burnings. He finds little piles of ashes everywhere, in the cracks in the cement of his courtyard, between the roots of the trees in the lane. He breathes the dead. How can he regain his heart, living in a world so wracked with pain? In this world there is no place for the likes of him. No place for henna-scented hands rocking a child to sleep, for old-woman hands tending a garden. And no place at all for the austere beauty of mathematics.\nHe’s thinking this when a shadow falls across the ground in front of him. He has been sitting in his courtyard, idly writing mathematical expressions with his stick on the dusty ground. He does not know whether the knife bearer is his son, or an enraged Hindu, but he finds himself ready for his death. The creatures who have watched him for so long will witness it, and wonder. Their uncomprehending presence comforts him.\nHe turns and rises. It is Gangadhar, his friend, who holds out his empty arms in an embrace.\nAbdul Karim lets his tears run over Gangadhar’s shirt. As waves of relief wash over him he knows that he has held Death at bay this time, but it will come. It will come, he has seen it. Archimedes and Ramanujan, Khayyam and Cantor died with epiphanies on their lips before an indifferent world. But this moment is eternal.\n“Allah be praised!” says Abdul Karim.\nOriginally published in Woman Who Thought She Was a Planet and Other Stories by Vandana Singh, 2009.\nVandana Singh is a writer of speculative fiction and a professor of physics at a small and lively public university, Framingham State University, near Boston. Her critically acclaimed short stories have been reprinted in numerous best-of-year anthologies, and her most recent collection, Ambiguity Machines and Other Stories (Small Beer Press and Zubaan, 2018) was a finalist for the Philip K. Dick award. Vandana’s academic background is in particle physics, but for a decade she has been working on a transdisciplinary, justice-centered re-conceptualization of the climate crisis, at the intersection of science, economics, sociology, philosophy, history, and futures studies.", "source": "https://clarkesworldmagazine.com/singh_02_14_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Infinities by Vandana Singh"}