{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "A C Wise", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Vm2sIw/wjy9I2g1d9w4PV3irs/U=", "id": null, "license": null, "comments": "", "raw_text": "8100 words, novelette  To Sail the Black  2021 Finalist: Aurora Award for Best Novelette/Novella  The ghost ship Xanthic Promise sails the black, powered by the slumbering heart of a dying star. And its captain, Antimony Jones, stalks its decks in a swirl of crimson coat and fox fire lighting, dogged by voices. The recent dead, the long dead, and the dead-to-be, all murmuring as to how she’s only three months into her command and it’s all coming undone.  “Stow it.” Antimony snaps, pirate-captain proper.  A living crew member jumps out of her way at the words, back flat against the wall, spanner clanking to the deck in alarm. The ghosts snicker, and Antimony bares her teeth until they fall silent.  “You. Back to work.” Antimony jabs a finger at the frightened crew member, Hawk, even though she was the one who interrupted his work in the first place.  As he scrambles to obey, the ship murmurs its own complaint, an out-of-place thrumming Antimony feels in her back teeth. Something is wrong, and Hyacinth, her gods-damned chief engineer, is playing coy, making Antimony come to her in person rather than just telling her what’s wrong.  She rounds the corner and nearly smacks into the door to the star chamber, which should open automatically. Antimony slaps a palm to override and enters shouting.  “What in all the gods-damned corporeal and incorporeal hells is so important that I had to come all the way down here instead of you telling me over the comm? And why is the door locked?”  Antimony stops dead. Because what is so gods-damned important is clearly obvious. Starling, her now-former boatswain, blood-soaked from chin to waist, well and truly slaughtered, hangs by his wrists in the pulsing light of the star chamber.  “Oh, fuck me,” Antimony says and turns to kick the door.  As captain of a ghost ship, death and Antimony are well acquainted. The Xanthic Promise’s winding, nautilus halls bear countless invisible scars, Antimony’s among them, where each member of the crew past and present has sworn their demise to the ship. Blood oaths cut into palm and wall as a condition of their service stitch their ghosts in place and power everything the star doesn’t.  It’s a reckless practice, condemned by the Galactic Fleet and every other kind of ship captain out there, save for pirates. But her crew’s lives and deaths are their own to swear with as they please, and who is Antimony to say different. Some, she suspects, are too young and dumb to truly believe in their future deaths as a reality; others are at the end of their span and desperate to trade what little they’ve left for a last taste of freedom.  Antimony swore her own oath at fourteen, an orphan doomed to life on a backwater station until the Xanthic Promise docked for trade. Rough and battered as she’d been, the moment Antimony set eyes on Xanthic Promise, it had been love—true and deep and head over heels. All the fairy tales her mother and father had told her before their unfortunate demise, of living stars who sang their captains across the black, seemed poised to come true all at once.  She’d stowed aboard, and never mind that the star powering the ship was only roiling, pulsing light, and not the painfully-beautiful, human-faced creature in the holo-illustrations from her parents’ stories. The walls still whispered with ghosts, the opposite of the Galactic Fleet’s cold logic and strict regulations, and definitely the opposite of a life lived station-bound, stuck in one place and hoping against hope the universe would come to her.  Loose-tongued ghosts had put a quick end to her plan to stay hidden, but instead of putting her right back where she started, or straight out into the black as would have been her right, then-captain Basalt had given Antimony a choice. Swear her life and future death to the ship by stitching a piece of herself to walls, or live a life staring at the same span of stars out of the station’s viewports, always wondering what might have been.  Antimony hadn’t hesitated, chin up, blade to palm, and bloody palm to wall all in a flash. She’d worked her way from deck girl, carrying and fetching and cleaning, to assistant boatswain, then boatswain, and on up with the sure knowledge in her heart that she would sit in Basalt’s chair as captain one day.  That she finally achieved her dream at the cost of a death-promise is a problem for future-her. Present-her has everything she ever wanted. She’s flush with ill-gotten gains, the boundless universe is spread before her, and the crackling power of her ghost ship is hers to command.  Except that at-this-very-moment-her has a very much here-and-now problem. Starling.  His death has the air of ritual. Doctor Coxcomb has his body down in the medbay, and the only thing she’s been able to tell Antimony so far is that whoever killed Starling cut out his tongue before stringing him up like a burned offering.  Starling had sworn himself to Xanthic Promise young too, sixteen with a head full of dreams. They’d picked him up planet side and Antimony had been the one to argue for giving him the same choice she’d been given. Most of her interactions with him since had been recent, in his new capacity as boatswain, requisitioning goods and discussing the ship’s stores. Except more than once, she’d caught him at his post, moon-eyed over holo-stories, including one with the very same illustration of the living, singing, humanoid star her parents had shown her.  It had made Antimony smile then, and makes her regret his death all the more now.  There’s a headache building between her eyes. There’s a . . . hmmm. It’s a not-quite-buzz-not-quite-hum, like an itch on the wrong side of her skin, creeping around inside her skull. She’s been hearing it since . . . she isn’t even sure when, but it’s getting louder, tied to the ship feeling listless, argumentative, sluggish. It’s in the soles of her boots, coming up through the deck plates. A sense of wrong. As if the sleeping star at the ship’s heart was not merely a metaphor, as if the ship was having bad dreams.  “Heavy is the head that wears the crown.”  A phantom voice at her ear stirs phantom hair. Antimony just manages to turn her surprised flinch into a hand grazed over her scalp’s stubble, as if that was always what she meant to do. She turns to face her immediate predecessor.  “Fuck off, Cedar.”  The former captain leans against nothing, the prerogative of ghosts, arms crossed, lips bent to smirking. He’s much more corporeal than he has any right to be, in that he possesses form at all, though she can see right through him. Being stitched, Cedar should only be a voice, muttering in the walls with all the rest. That he’s more, Antimony imagines, is sheer spite and force of will. And a handy trick she’d like to learn herself one day, if she can do it without sacrificing her pride and asking him how.  “What’s the fun in death if I can’t haunt my quarters and gloat?”  “Death isn’t supposed to be fun. It’s supposed to be useful.” Antimony scowls. “And they’re not your quarters, they’re mine.”  Antimony still doesn’t know how Cedar won Basalt’s good grace and favor and ended up captain before her. Cedar, with his Galactic Fleet training, the antithesis of everything a good pirate should be, yet Basalt had named him as successor. The fact that Cedar in turn named Antimony and not Hyacinth, Antimony is beginning to suspect, was another act of spite, as being captain is turning out to be a lot less fun and a lot more headachy than she imagined.  Cedar cocks his head, waiting for her to speak, waiting, more precisely, for her to ask for help. Antimony sits astride the polished bench of the single most improbable item on a ship crammed with impossibilities: a gleaming white baby grand piano, Cedar’s pride and joy. Instead of giving him the satisfaction, she stabs a series of discordant notes. When Cedar frowns, some of the tension uncoils from Antimony’s shoulders.  “I hear you have a ghost problem.” Cedar breaks first, but it’s only a moment before his smirk is back in place.  Because, gods-damn him, he’s right. One of the many drawbacks of a ghost-powered ship—gossip travels fast. There are scant few secrets on the Xanthic Promise, save those kept from the still-living, which is precisely Antimony’s problem.  If the universe were kind, she could simply ask Starling the cause of his death, but despite being sewn into the walls by a supposedly unbreakable pact, wherever his ghost is, she can’t hear it. Like he gave up his voice with the loss of his tongue. All she can hear when she listens for him is that gods-damned hmmm, getting louder and making it hard to think.  “I don’t suppose you have anything remotely useful to contribute?” Antimony grinds the words between her teeth.  An expression flickers bright through the former captain’s eyes, which are the color of lightning, nothing Antimony can read. Cedar is only three months stitched; perhaps Starling’s death is simply making him think of his own.  Antimony thinks on it too, an unfortunate debris-strike fracturing Cedar’s faceplate during routine repairs—repairs he shouldn’t even have been undertaking as captain. Antimony had been there when he’d told Hyacinth he wanted to stretch his legs in the black. She’d watched Hyacinth inspect his suit herself, likely the only thing that kept Antimony from suspicion, her desire for the captain’s chair being no secret. She’d been there, too, when Cedar had come back to the ship, tether-hauled, frozen solid, ice crystals clinging to his skin, and his body ballooned to twice its size.  “What would you give me if I could tell you?” The flicker in Cedar’s eyes turns sly, the promise of knowledge held like a curl of candied orange peel on his tongue.  Antimony puffs up, pride, as always, ready to tangle her legs and lead to a fall.  “Listen, you smug son-of-a—”  Cedar’s eyes flicker again, static-shot. He’s there and then he’s not and Antimony thumps a fist against the piano again for good measure.  “Damn it.”  She bites the inside of her cheek, considers calling him back, thinks of apologizing, and the thought turns her stomach. She doesn’t need him, and he probably didn’t know anything anyway.  Still, the air in her quarters feels empty, the temperature dropped. There’s no love lost between them, but Cedar’s departure hammers home the inevitable truth chained around the neck of all captains: she is alone.  “Damn it,” she says again, softer this time, and swings her weary leg over the piano bench, rising.  Any sensible captain would remain locked in her quarters to drink her troubles away, but sensible has never been her style. Antimony makes her way to the ship’s prow, allowing a detour to the ship’s store, where she feels Starling’s absence all over again as she requisitions a bottle of good rum and uncorks it with her teeth. She wonders what happened to his holo-stories. She could use a good fairy tale about valiant captains and singing ships right about now.  The hum-not-hum itch is there again as she walks the halls, a voice among other voices, one she isn’t quite hearing. It’s like an ill-tuned violin, a wetted finger circling the rim of a glass. On the edge of painful. A familiar voice, but corrupted somehow, like the mind behind it is still trying to figure out how to make words.  “Starling?” she asks it not expecting an answer, and the sound rises in pitch, a static-squeal like it’s arguing with itself, before it falls silent.  Then there’s only the usual ghost ship murmur, the dead speculating whether command has made her crack. Living crew members, too, give her the side-eye, whispering among themselves as if she can’t hear. Let them talk. Cedar was a captain of the people, soft and decidedly un-piratey. Antimony is comfortable in her lonely command; better to be feared than loved, as they say.  Lacking anyone human to talk to, she could seek her own ghost, her dead-self-to-be as oracle, but that way lies madness. Or so she’s heard tell. Knowing your ghost on an intellectual level is one thing; looking it dead in the eye and knowing it full and true, that’s another.  Besides, at the moment, Antimony would rather drink herself into oblivion or into a state where a solution produces itself, whichever comes first. And she intends to do so in full sight of her ghosts and her crew. Let them see a captain without shame, bowed but not broken by the weight of her command. Let the living and the dead gossip on that if they will.  The crow’s nest is empty, waiting, and Antimony can’t help a grin. She strung the hammock across the ship’s foremost eye herself during her first year aboard. Basalt had given her waste duty for a month, but she hadn’t taken the nest down, and Antimony had even seen her captain using it a time or two herself when she thought no one was looking.  When she’d first come aboard, after her shifts, Antimony would throw herself into the hammock to listen while most everyone else slept. She’d gaze out at all those stars and wish the stories she’d devoured as a station-bound child were true. She’d wished that instead of the creaks and groans of metal deck plates, she could hear the star’s voice. She’d wanted to hear it sing.  She’d been foolish enough then, naïve and wide-eyed, that she’d actually asked then-engineer Oak about the star, and whether it really slept.  They’d laughed at her, that deep barrel-chested laugh that, while it hadn’t been cruel, had still struck her a blow. Fairy stories, they’d said. Tales for children to make the work of ships seem like magic.  But if ghosts could power a ship’s weapons, she’d reasoned, then why not a sleeping star? Maybe, over the years, people had simply forgotten the truth. Maybe when they’d put the stars to sleep, they hadn’t wanted to own the cruel thing they were doing, so they spun fantastical tales too incredible to possibly be true.  She’d given up her belief soon enough though, but had Starling?  Antimony throws herself into the crow’s nest, kicking up her bootheels just as a commotion breaks out behind her.  What the fuck now? she thinks, wheeling her weary bones around.  “She wakes!” the man screams, a crew member whose name Antimony should know, excusing herself that she doesn’t due to the fact that his face is currently an unrecognizable mask of blood.  He holds something sharp in crimson-slick fingers, not threatening anyone, but staggering and weaving—shock and blood-loss after gouging out his own eyes.  “It won’t stop!” he screams. “He promised, but it never stops. Please, help me.”  “You still want to make the run?” Hyacinth asks, all incredulous, scoffing tone.  “Are we or are we not gods-damned pirates,” Antimony, rhetorical, shoots back.  Her mouth tastes the way she imagines the inside of an engine block would.  She has one crew member spaced, body refusing to yield up any other secrets, and one in the medbay, bandages over his lack of eyes and doped to oblivion. And she still has a gods-damned job to do.  “We can still make the pickup and drop in plenty of time to get paid. Even without the extra ghost to throw on the fire.” Antimony tries to smile around the flat attempt at a joke.  Hyacinth scowls, muttering under her breath, as she walks away.  Doctor Coxcomb utterly forbid Antimony from questioning Chrysotile, though Antimony doubts he’d be able to provide her with sensible answers. Sensible people don’t gouge their eyes out. But insensible people might just commit murder. Something to think about. Later. Solving mysteries doesn’t pay the bills. Only piracy does.  The pickup goes without a hitch, the drop-off less so, because of course one thing can’t fucking go right for her. Instead of payment, their contact meets them with guns, eyes blacked and teeth capped with gold, marking them as DeathSkull, notorious double-crossers, and not Green Hand, the flag they’d claimed to sail under.  “Evade where you can, fire only if you have to,” Antimony shouts to be heard above the chaos.  A hit to Xanthic Promise’s portside causes the whole ship to rock, and a panel to her right explodes. How the fuck does that even work? she wonders, then ceases to wonder as sparks shower and she slaps at her coat to keep it from going up in flame. How many deaths can she afford to burn to get out of this mess? She rolls through the inventory of ghosts in her mind, then gives the order to fire.  She needs just a little time, just a little luck, just enough space to do something stupid to save their skins. Twin stars of glittering light leap from the ship’s cannons. Ghost-tech rarely kills, but it does a credible job of convincing people they’re dying. At least briefly. Sometimes, ironically, it even convinces them to death.  Either way, it’s still a pretty light show that will buy them some time as, for the next few moments, the crew of the ship currently trying to wipe them from the stars relives the last breaths of six stitched souls now serving the Xanthic Promise as weaponry.  Basalt may be in there somewhere, Antimony thinks as the glittering light hits home. That could be her fate one day, the captain’s last burst of glory, her final duty. There are worse ways to go.  Another panel explodes. Acrid smoke fills the air. Antimony coughs, and the ship slews hard and away, running running running. Rivets and seams strain, everything wanting to fly apart as Antimony wills it to hold. Jaw clenched, she calls up charts, squinting through eyes that stream part from headache, part from the bone-rattling speed. Her back molars feel as loose as the rivets, and she shouts fresh coordinates.  “Are you out of your gods-damned mind?” Hyacinth swivels to stare. A rivulet of blood tracks from a gash above her eye, but she doesn’t wipe it away.  “Yes!” Antimony fires back.  “That’s Sargasso space.” Trust Hyacinth to recognize the coordinates right away. Damn and double gods-damn.  “Do it anyway.”  Hyacinth’s eyes blaze crimson mutiny, or maybe that’s only the blood, but she punches the coordinates, punches the ship, and they’re off.  The Horse Latitudes. The Doldrums. The Sargasso Sea. All names that don’t make sense in the black, but the effect is the same. It’s a graveyard for stars, a place of legend where ships stall for no discernable reason and never start up again. It’s a place only the foolhardiest captain would go willingly, and which any sensible band of pirates would cut off pursuit to avoid, which is exactly what Antimony is counting on.  There’s an under-the-skin feeling the moment Xanthic Promise hits that dead space. The DeathSkull ship drops pursuit, just as their own engines cut out, and Antimony breathes relief against the tightness in her ribs even if it doesn’t last long. The walls chatter doubt. Her crew looks to each other, wild-eyed, but they’re all still alive. They should be falling on their knees and thanking her.  That’s when the screaming starts.  It’s a wrong sound. An inside-out sound, purple-shattering-to-silver-at-the-edges, going on and on like a voice, like that untuned violin, but so much louder and worse. It is want and need and hunger and fear and unlike anything Antimony has ever heard before. It’s unlike anything she ever wants to hear again. It makes her want to dig her nails into her skin and peel it away whole to go running around in her bones.  It leaves her panting on hands and knees, howling back at the noise until she tastes blood, until Hyacinth cracks her across the jaw hard enough to replace one ringing in her ears with another.  “What is. That. Noise. What you’re. Doing.” Hyacinth’s words come out in huffing breaths, shaking and broken.  “You didn’t hear it?” Antimony is still hearing it, is certain she’ll always be hearing it from now until the end of time, but at least it’s dulled, a bruise rather than a fresh blow.  “I heard you screaming,” Hyacinth says. “I didn’t know a human throat could make that sound.”  “I’m not sure it can,” Antimony says.  She stands.  “Well, whatever it was,” Hyacinth says, voice steadying, “according to the report I just got, it happened at the same time three very long fissures appeared in the star chamber’s glass. So, to put it mostly succinctly and bluntly, we are completely and utterly fucked.”  Antimony follows Hyacinth to look at the star chamber, as if their own eyes could make the report untrue. No such luck. The star chamber is indeed breaking as reported, three long fissures running almost the entire length of the glass that looks somewhat like an old-fashioned lantern and somewhat like the heart of a lighthouse and nothing like either of those things at all. Breaking, but not broken, and that is one small mercy, but perhaps the only one.  Antimony leaves Hyacinth to do whatever she can, which is, she suspects, very little. The ship was already sick before this whole thing started. Cedar must have known it, and that’s why he insisted on making the repairs himself. But something went wrong, and maybe that’s where this all started, and it’s all connected somehow.  Antimony thinks of Starling’s missing tongue, a sacrifice, and the sound she’s still hearing, like a ringing echo inside her skull, a voice that doesn’t have words, belonging to something that never had a voice before. She thinks of fairy tales hiding a willfully forgotten truth in plain sight. She’s beginning to build a picture in her mind, and she doesn’t like it at all.  She takes herself to the medical bay.  Chrysotile lies rigid, lashed down with restraints. Fluid drips into his arm, a steady flow, keeping him somewhere between awake and dreaming. Coxcomb will likely be back soon. Not enough time to try to wake him, even if such a thing were possible. Antimony is considering sneaking out again when Chrysotile’s head snaps around to look straight at her, which is disconcerting to say the least, given that he is without eyes.  “I thought I could finish it, but I wasn’t strong enough. Starling said the light would stop if I helped him, but it only got worse.”  His body seizes, guilt or pain or both wanting to make an arch against the restraints. He gropes the air, fingers twisted to claws and Antimony shoves down every skin-crawling impulse she has to make herself do the human thing and let Chrysotile take her hand. His fingers are freezing, his grip iron.  “Tell the captain I’m sorry.”  “I—” Antimony begins, but gets no further as the door grinds open and Doctor Coxcomb descends on her like a storm.  “I was very specific in my orders.” Coxcomb brandishes a syringe like a weapon, ready to deploy whatever is inside if Antimony doesn’t leave now, captain or no.  And oops, yes, maybe Antimony did use her override on the medbay door knowing the doctor would deny her entry. She quick steps away, trusting to Coxcomb’s brutality in defense of her patient. Besides, she needs to think.  Tell the captain I’m sorry. Antimony very much doubts Chrysotile meant her. Some promise made to Cedar? And how does Starling fit in? All those old stories. If they really were true, what monsters would that make her and all the other ghost ship captains down through the ages?  And even if the tales aren’t true, what if Starling believed? Would it be enough for him to convince Chrysotile to kill him, so he could sacrifice his tongue to the star and give it a voice?  Thoughts roil, pressing out against her skin until Antimony feels she’ll explode. She stomps through the halls and up to the crow’s nest, the place she dreamed as a child, and now all those dreams and wishes feel like a cruel lie. Antimony presses her hands to the window and screams fuck you very loudly at the lack of stars.  Throat raw, she turns to an access panel, calling up the ship’s logs. Something she should have done long ago, only she was busy with murdered and eyeless crew members, damned double-crossing pirates, and recalcitrant ghosts.  She finds Cedar’s entries from the days before his death. He must have felt the same wrongness in the ship as she does now. Would he have attributed it to a waking star? And if he had, what would he do?  Deep in their hearts, do all ship’s captains know the tales they drank like milk as children are true, but they’ve collectively chosen to believe otherwise?  Cedar never confided in her as his second in command. Keep your friends close, and your enemies closer. It stood to reason Cedar had only accepted her as first mate to keep an eye on her. Who had he confided in, then? Chrysotile? Certainly not his logs, as they are all maddeningly mundane and empty of any useful details.  Antimony returns to the ship’s stores and requisitions another bottle, gin this time, and a sturdy blade. She’s about to do a very unwise thing indeed. Antimony drinks and winds her way through the halls until she finds the place where her oath sings to her.  The expanse of wall would look unremarkable to anyone else, but it’s where her death is stitched, her promise to the ship, and so for her, there’s a faint silver glow of scars etched into the metal. With half the bottle killed, the blade weaves dangerously above her palm. She closes one eye and squints the other to make both knife and hand behave. Before she can think better of it, she traces the old seams until blood wells, and presses the new wound to old.  Red smears and a spark snap-jumps, shocking her spine rigid and clacking her teeth together. It’s unwise to talk to one’s own future-ghost, to seek one’s death for counsel, but ever since the scream that rattled her to her core, Antimony has felt her death just inches beneath her skin and she’ll be gods-damned if she just sits around waiting for it to come to her.  She forbids herself to pass out, winding the gauze she requisitioned at the same time as the bottle around her hand. It immediately soaks through. When her other-self appears, it’s very much like looking in a mirror, same shorn-to-stubble hair, same smug grin. The event horizon between her death being a future-her problem and a present-her problem is collapsing. She rubs a hand over her scalp, almost expecting her ghost to do the same, but her ghost only smirks, reminding her irritatingly of Cedar.  “What is it?” Antimony asks.  The fox fire light around her ankles swirls, a chill reaching up her trouser legs, playing with the hem of her coat. She tries to keep her teeth from chattering. It wouldn’t do to look weak in front of herself.  “You already know,” her future-self’s voice is an echo-blur. “It’s the star. You’re hearing her voice, the one Starling died to give her.”  The smirk on the other-her’s lips becomes something sharper, a blade, almost cruel. Would it be uncouth to punch her own ghost in the mouth?  “Stars aren’t sentient. Those are just fairy tales.” She doesn’t want it to be true, but she knows down in her bones that it is, and hasn’t she always known?  The other-her’s smile doesn’t waver. Antimony would have thought there might be some mercy in her eyes, but she also knows herself too well. All the knowing coming to her now is still wound-fresh to her other self. It hurts, too much for future-Antimony to offer any kindness.  Because she does know and she’s always known and she’s never wanted to know. All those stories, all that wishing, she never fully thought through the consequences because it would be too terrible. But Starling had known the truth and given his own life to it, a small right against a whole universe of wrong. And Chrysotile had helped him.  “What about Cedar?” Antimony asks herself. He must have known too, but what did he do about it?  “Ask him.” Future-Antimony’s eyes glitter, cruel delight, like passing the pain back to her past-self might lessen her own hurt.  Antimony’s hand flashes out, fingers closing around her future-self’s wrist, holding her in place. Even though she must be expecting it, her future-eyes widen in surprise, and there, at last, Antimony sees mercy, sorrow, her future-self aching for the past-self coming face-to-face with the death that will be. But she does nothing to stop her, and the mercy fades back into a smile that might have blood in it if her future-self were still a thing capable of bleeding. Because she knows what happens next.  Antimony looks into her own eyes.  And there, every possible path her future might take forks and forks and skates across the surface of everything like the glass in the star chamber not-yet shattering. Her life races along those cracks like lightning and comes to a dead stop, a point she can’t see beyond.  She sees herself and the star in its chamber and both are burning. There is nothing else. Except. Except except except—an edge like a closed door, like a flat horizon, like a coin pressed to a table with another face Antimony knows is there but cannot see. There is no way to pick at the edge to open the door to see the other face to know that it exists because it does not or cannot or should not because this is where she ends.  All the light in the world goes out like a blown candle and rushes back all at once like knives to her eyes and Antimony is alone in the hall. She kicks the wall where her unhelpful asshole of a death is stitched, hard, so her bones jar and the steel toe in her boot rings and it doesn’t make her feel any better at all.  She returns to the engine room, to the star chamber, and stands in front of the impossible swirl of light. It makes her skin itch, brings the jittery feeling back to her teeth. If she looks long enough, she can almost see a face, a mouth in the roiling, pulsing energy.  Antimony traces a finger over one hairline crack until it joins another and another—a river with three tributaries. She presses her bound hand to the glass, leaves a blood-petal kiss of red behind.  “I’m sorry,” she whispers.  She makes a fist of her hand, thumps the side of it against the glass. She’s being a coward. Still.  And now. Now she has a choice to make. Like Cedar made a choice. And fuck it, because her impulse is to do something noble and stupid and self-sacrificing and she really doesn’t want to die.  Back in her quarters, Antimony mashes the piano’s keyboard, thinking of the keys as teeth, Cedar’s specifically.  “Come out and talk to me, you asshole.” The yelling makes her feel better, but only marginally so.  Cedar isn’t there and then he is, and even though Antimony called for him, she still jumps when he appears, leaning on nothing again, arms crossed. Despite the horrific nature of his death, he’s still maddeningly pretty, cheekbones defined where hers look gaunt, relaxed and well-fucking-rested where she looks haunted and sleep-starved.  “You’re lucky I’m not corporeal.” Cedar tosses a meaningful look at the piano.  Antimony is still tired and still a little drunk and lightning keeps forking behind her eyes. But it’s worse when the lightning stops, when it finds the place where it can’t go any farther because that’s where her life ends.  “Why didn’t you tell me about the star waking?” Antimony steps back from the piano, closed fist shaking, and she tucks it behind her back so Cedar won’t see.  “What fun would that be?” He runs fingers over the piano keys and when they make no sound, he runs a finger over the wires instead.  They still don’t make a sound, but whatever it does makes Antimony shiver.  “Would you have listened even if I had tried?” The maddening expression on Cedar’s face makes Antimony want to throw something.  He’s right, and that only makes it worse. How many times did they butt heads when he was alive, when she was under his command? Even knowing there’s no solidity to him, Antimony jerks open the piano bench, stuffed with books and sheets of music, and throws the first one she lays her hands on. The pages flutter, and a small square of paper tumbles free.  An actual, honest-to-gods, printed photograph.  “Oh fuck me.” Antimony bends to retrieve it, Cedar watching her with a brow perfectly arched, expression smug.  This was here the whole time and Antimony never saw it, too uncultured to do anything with the piano other than bang on it for attention and use it as a place to sit and drink and feel sorry for herself.  “You and Chrysotile were in the Galactic Fleet together.” Antimony holds up the picture, a group of young cadets in their uniforms, arms slung around each other. Chrysotile and Cedar are together at one end, and Chrysotile’s head is slightly turned, caught in a moment, distracted and unaware of the picture about to be taken.  Even Antimony isn’t dense enough to miss it. The expression on Chrysotile’s face is stark: love.  She thinks of Chrysotile, eyeless in the medbay, grasping her hand and begging forgiveness from his dead captain. To be loved like that—enough that someone would kill for you. Well, it isn’t exactly a comforting thought. It leaves Antimony feeling claustrophobic, but at the same time, achingly lonely. There is no one among the crew—no one in her life—she could even share a drink with, let alone someone willing to pick up a knife and kill a fellow crew member for her, to finish whatever it is she might leave undone.  “I was wrong about the star.” The sorrowing look in Cedar’s eyes takes Antimony’s breath away.  She has a picture of her former captain in her mind—brash, ambitious, apologizing to no one. Stealing her rightful command out from under her, winning Basalt’s favor and trust. But the more Antimony looks at her mental picture against Cedar’s ghost, the more she realizes she doesn’t know him at all. Did Cedar wash out of the Galactic Fleet? Was he dishonorably discharged? Maybe there’s a pirate streak in him after all, and maybe there’s something even more important, something Basalt saw in him and not in Antimony, which is why she gave him command—compassion.  The picture she holds in her mind of Cedar—it’s a picture of herself. A picture of who she wants to be, or believed, up until this very moment, she needed to be in order to command. Ruthless, friendless, alone at the top. Holding her crew at bay in a mixture of awe and fear, needing no one.  Heavy is the head indeed. Maybe it wasn’t a taunt on Cedar’s lips earlier so much as a warning.  “How do I stop it?” Antimony asks.  Dead space aches all around the ship, the doldrums, like a bruise. The ship drifts, quiet in all the wrong ways. No engines thrumming; the only pulse of life the need of the star. If they stay, they’re doomed, if they run, they’ll fail. The star chamber will crack, the ship will explode or be devoured. This isn’t just a graveyard for ships, it’s a graveyard for stars, and her own always-dying star is calling to the ghosts of her own kind that haunt this space. And sooner or later, they will answer.  “You don’t stop it.” Cedar’s expression is grim. “That’s what I got wrong. There’s nothing at all you can do. We kept the star chained, and this is her vengeance.”  “A fucking lot of help you are.” Antimony grits her teeth.  At the same time, guilt needles her; no matter how they clashed while he was alive, Cedar really did want what was best for the ship. He might even have loved the Xanthic Promise as much as she does. Enough to die for it.  Her intuition leaps.  “You went to talk to your own death too, and you came up with an answer that involved you walking out of the ship on a routine repair mission and meeting your end even though your time wasn’t up yet.”  The pieces click into place, a rapid tumble matched by the beat of her pulse.  “You thought if you rearranged fate, met your death early, you could strengthen the chains, put the star back to sleep and keep the ship running. Chrysotile tried to finish what you started, but Starling . . . ”  The pieces fit, almost but not quite. There is still some missing. Did Starling simply get unlucky and cross Chrysotile’s path just when he was feeling grief-mad and murderous? Or did Starling take advantage of Chrysotile’s grief and talk him into committing murder, convincing Chrysotile that his death would finish what Cedar started and put the star back to sleep? Only Starling lied. He wanted to wake the star. Give it a voice. Set it free.  “Starling got it right, and you got it absolutely fucking wrong.”  Cedar’s eyes blaze at her, all glare and bared teeth, and for a moment he is as terrible as any ghost ought to be. But all she can do is grin triumph in the face of his offended rage, because she’s right, and a victory, even a pyrrhic one, is still a gods-damned win.  “You should have been trying to set her free, wake her up the rest of the way, rather than put her to sleep again. You died for nothing.”  Cedar howls and lunges at her, fingers crooked like claws. But of course, he’s insubstantial and passes right through her. Lacking the focus of the Xanthic Promise’s honed-bright weapons to make his death useful, Antimony feels nothing. Until she turns to mark his passage and where he ends up, comma-curled in the air, his body a sob without breath or tears.  “Fuck.”  She’s doing it again, setting herself above and apart, taking pleasure in a moment of being right, even though she was just as clueless as Cedar, and every bit as guilty. She should have held onto her belief in the old fairy tales, like Starling. She should have had compassion to pair with her ambition. She shouldn’t have been such a bloody, arrogant fool.  She wishes she could pat Cedar’s shoulder, comfort him. He straightens, emptied of rage now, as she is of gloating. And here is the other shoe about to drop between them. Cedar tried and failed and the ship is still in danger. The ship needs a captain, and at the moment, that’s her.  “So what are you going to do about it?” Cedar asks.  “Well, fuck,” Antimony says, because there’s nothing else for it. Cedar was on the right track, but facing the wrong way.  “I guess I’d better go see about a star.” Antimony shapes her lips to a fierce grin, her stance to a swagger. A little bit of brash and bravado isn’t such a bad thing. She is a gods-damned pirate after all, and if she’s going to go out, then it’s going to be staring death in the face and giving it the middle finger.  Cedar tips his head at her forgotten bottle of gin. His expression is almost kind, but not really at all, because he’s a gods-damned pirate too and that’s not how it is between them.  Antimony lifts the bottle in salute, takes a swig, and pours out a measure for him. The washed light of Cedar’s eyes flickers in something like pleasure, which gives her hope. Since she’s about to be very dead herself soon, it would be nice to go out knowing that she can still get shit-faced in the afterlife.  Another swig for good luck and she leaves the bottle beside the piano, uncorked. She resists the urge to set it down on the bench where it would leave a mark, a last peace offering.  And off she goes.  Antimony strides the decks of the Xanthic Promise. The walls howl with the restless dead, and in her mind, they’re a storm. She’s a pirate of old, her heeled boots ringing on wood while her red coat swirls and rain lashes her. She bares her teeth as if to catch the wind, even though there’s nothing here but recycled air.  “Out,” she bellows as she steps into the star chamber’s room.  Hyacinth looks up, scowls, a refusal on her lips. Antimony feels a flicker-flash of regret. Hyacinth is as sour as Antimony wants to be, or at least presents the same gruff exterior. Maybe they could have been friends, raised a glass together in the crow’s nest and sang bawdy old star-shanties. Antimony guesses she’ll never know.  “Go, or I’ll clap you in irons or make you walk the plank or something equally piratey.”  Hyacinth merely shakes her head, not so much a ceding to authority as her not being paid enough to care. As Antimony freshly reminded herself, they aren’t friends, and the captain’s chair will fall to Hyacinth next, so what stake does she have in stopping Antimony’s stupidity?  Hyacinth retreats, leaving Antimony alone.  The star chamber itself is sealed with a double hatch. Antimony scrambles to the top of the chamber and overrides the locks to drop through.  And then. She is. Falling. Seeing her bones through her skin. Hearing them, and isn’t that a weird fucking thing. Antimony is herself and she is her ghost, and she’s every captain who came before her, stitched in a long line, and this is where it ends.  She tastes Cedar’s death, holds it on her tongue, the bright bright bright moment of pure joy right before his faceplate shattered, thinking he was doing the right thing.  Her own death is here too, waiting for her just around a corner. A door. An edge. A turning.  But she isn’t there yet.  The ship sings. It screams. A swarm of bees humming in a cave made of ice cracking and a violin playing and a color that is blue and purple and pink and none of those at all and a hunger and a heartbeat and a lullaby and a whale calling to its calf through the deep.  Oh, it echoes. Antimony feels it all along her jaw. An ache to answer, but the sound isn’t for her. It’s for the ghosts outside the ship. The dead stars and the living ones and the stars yet to be born. They’re alive. All of them. Not just her star, but everyone among all the billions of points of light spread across the universe. Gloriously, terribly alive.  If a thing can have a heart that can be cut out and chained in the moment of its death to power a ship, then of course it is alive. Truly and properly alive. They had no right, none of them, the captains stretching back to the beginning of time sailing the black, to do what they have done.  Lightning cracks. Branches. The edge. There. Antimony reaches. Plunges her hand into the light that is the song that is the end of the line. And her ghost smirks and Cedar smirks and the thread tugs. She pictures with all her will and might, for whatever they are worth, cutting the star free, waking it up, shattering the bonds while sealing the wounds in the glass and keeping everyone on the Xanthic Promise safe, and she hopes against hope and against reason her death is strong enough to do that.  This is the end.  Except.  The coin pressed flat to the table has another side, and so does the door, and the edge really is a corner, and it can be turned.  Cedar made a bargain with his death and went to meet it early. But every member of a ghost ship’s crew knows their death is a solid and inevitable thing. They swear an oath the moment they come on board, and live every day knowing fate cannot be cheated. It is an immutable fact.  And so, if Cedar met his death early, then in truth, he was always fated to do so.  And by that very same logic, if Antimony makes a deal with her death now, refuses it and slips around the edge to the other face of the coin, the other side of the door, then she will have always been meant to do so. Fate signed, sealed, and delivered.  A promise is still a promise. That is where the power of a ghost ship lies, and she’s not denying her ship anything, only delaying its gratification a while.  And it is a glorious thing.  Here’s the deal, she thinks, You use my living voice, my tongue to scream your star song to the universe, to scream yourself awake and free, and you kick enough power into the ship on your way out to get us out of the Sargasso and I’ll figure out the rest on the way down.  It shouldn’t work, but ghost ships are built on impossible things.  Antimony throws her head back and opens her throat to the voice that shivers along her jaw, the star longing to sing through her in a language not meant for human tongues. She burns. The chamber shatters and she shatters and the ship lurches forward through the dark—a blink that is not motion that suddenly puts them somewhere else.  Everything turns inside out and upside down and sideways and backwards oh my. And then Antimony Jones does the most impossible thing of all: she survives.  Her skin is still smoking as Antimony limps from the star chamber’s remains. Chunks of glass, charred and black, litter the floor. The ship is whole, powered by a ghost, by a promise, as always, just enough to get them out of the doldrums and then, well, maybe Antimony will have to roll the dice again and put her life on the line one more time, but that’s a problem for future-her.  Antimony looks down at her arms, her legs, at skin black as charcoal, cracked and crazed and flaking ash. Seams running through her flesh blaze with starlight, every and no color at all. Her clothes are gone. And it’s a damned good thing she shaved her head before this all began, because if not, her hair would be on fire.  She nearly collides with Hyacinth who hovers just on the other side of the door, anxious for her ship if not for her captain. Antimony tosses a crooked grin.  “Let’s get a drink sometime,” she says, and the words draw more shock from Hyacinth than Antimony’s burned-and-smoldering condition.  Cheating death, or at least delaying it for a while, is as good an excuse as any to turn over a new leaf. She can be a fierce, piratey pirate and still make a friend, or at least try.  Black petals scorch the deck, the echo of footsteps left in her wake. The same goes for any place Antimony rests her hand to steady herself, which she does often, covering the ship with impressions of herself all the way back to her cabin where she scoops up the rest of the gin and kills it in one go.  The ghost-stitched walls chitter and gibber and gossip and Antimony grins. Let them tell grand epic tales of the captain who freed her ship’s star, who looked her own death in the eye and said not today, motherfucker. She’ll happily listen once those rumors circle back around as star-shanties, but not right now.  Now, she will fall into her bed and hope that the sheets don’t catch fire because she intends to sleep for a week solid.  Whatever comes after that, well, that’s a problem for future-her. Now-her is flush and full of victory, all the crackling power of her ghost ship at her fingertips, and the whole of the universe spread before her. Just the way it should be. A.C. Wise's fiction has appeared in publications such as Uncanny, Clarkesworld, Tor.com, and several Year's Best anthologies. Her work has won the Sunburst Award for Excellence in Canadian Literature of the Fantastic, as well as twice being a finalist for the Sunburst Award, twice being a finalist for the Nebula Award, and being a finalist for the Lambda Literary Award. She has two collections published with Lethe Press, and a novella published by Broken Eye Books. Her debut novel, Wendy, Darling will be published by Titan Books in June 2021, and a new short story collection, The Ghost Sequences, will be published by Undertow Books in August 2021. In addition to her fiction, she contributes review columns to Apex Magazine and The Book Smugglers.", "text": "8100 words, novelette\nTo Sail the Black\n2021 Finalist: Aurora Award for Best Novelette/Novella\nThe ghost ship Xanthic Promise sails the black, powered by the slumbering heart of a dying star. And its captain, Antimony Jones, stalks its decks in a swirl of crimson coat and fox fire lighting, dogged by voices. The recent dead, the long dead, and the dead-to-be, all murmuring as to how she’s only three months into her command and it’s all coming undone.\n“Stow it.” Antimony snaps, pirate-captain proper.\nA living crew member jumps out of her way at the words, back flat against the wall, spanner clanking to the deck in alarm. The ghosts snicker, and Antimony bares her teeth until they fall silent.\n“You. Back to work.” Antimony jabs a finger at the frightened crew member, Hawk, even though she was the one who interrupted his work in the first place.\nAs he scrambles to obey, the ship murmurs its own complaint, an out-of-place thrumming Antimony feels in her back teeth. Something is wrong, and Hyacinth, her gods-damned chief engineer, is playing coy, making Antimony come to her in person rather than just telling her what’s wrong.\nShe rounds the corner and nearly smacks into the door to the star chamber, which should open automatically. Antimony slaps a palm to override and enters shouting.\n“What in all the gods-damned corporeal and incorporeal hells is so important that I had to come all the way down here instead of you telling me over the comm? And why is the door locked?”\nAntimony stops dead. Because what is so gods-damned important is clearly obvious. Starling, her now-former boatswain, blood-soaked from chin to waist, well and truly slaughtered, hangs by his wrists in the pulsing light of the star chamber.\n“Oh, fuck me,” Antimony says and turns to kick the door.\nAs captain of a ghost ship, death and Antimony are well acquainted. The Xanthic Promise’s winding, nautilus halls bear countless invisible scars, Antimony’s among them, where each member of the crew past and present has sworn their demise to the ship. Blood oaths cut into palm and wall as a condition of their service stitch their ghosts in place and power everything the star doesn’t.\nIt’s a reckless practice, condemned by the Galactic Fleet and every other kind of ship captain out there, save for pirates. But her crew’s lives and deaths are their own to swear with as they please, and who is Antimony to say different. Some, she suspects, are too young and dumb to truly believe in their future deaths as a reality; others are at the end of their span and desperate to trade what little they’ve left for a last taste of freedom.\nAntimony swore her own oath at fourteen, an orphan doomed to life on a backwater station until the Xanthic Promise docked for trade. Rough and battered as she’d been, the moment Antimony set eyes on Xanthic Promise, it had been love—true and deep and head over heels. All the fairy tales her mother and father had told her before their unfortunate demise, of living stars who sang their captains across the black, seemed poised to come true all at once.\nShe’d stowed aboard, and never mind that the star powering the ship was only roiling, pulsing light, and not the painfully-beautiful, human-faced creature in the holo-illustrations from her parents’ stories. The walls still whispered with ghosts, the opposite of the Galactic Fleet’s cold logic and strict regulations, and definitely the opposite of a life lived station-bound, stuck in one place and hoping against hope the universe would come to her.\nLoose-tongued ghosts had put a quick end to her plan to stay hidden, but instead of putting her right back where she started, or straight out into the black as would have been her right, then-captain Basalt had given Antimony a choice. Swear her life and future death to the ship by stitching a piece of herself to walls, or live a life staring at the same span of stars out of the station’s viewports, always wondering what might have been.\nAntimony hadn’t hesitated, chin up, blade to palm, and bloody palm to wall all in a flash. She’d worked her way from deck girl, carrying and fetching and cleaning, to assistant boatswain, then boatswain, and on up with the sure knowledge in her heart that she would sit in Basalt’s chair as captain one day.\nThat she finally achieved her dream at the cost of a death-promise is a problem for future-her. Present-her has everything she ever wanted. She’s flush with ill-gotten gains, the boundless universe is spread before her, and the crackling power of her ghost ship is hers to command.\nExcept that at-this-very-moment-her has a very much here-and-now problem. Starling.\nHis death has the air of ritual. Doctor Coxcomb has his body down in the medbay, and the only thing she’s been able to tell Antimony so far is that whoever killed Starling cut out his tongue before stringing him up like a burned offering.\nStarling had sworn himself to Xanthic Promise young too, sixteen with a head full of dreams. They’d picked him up planet side and Antimony had been the one to argue for giving him the same choice she’d been given. Most of her interactions with him since had been recent, in his new capacity as boatswain, requisitioning goods and discussing the ship’s stores. Except more than once, she’d caught him at his post, moon-eyed over holo-stories, including one with the very same illustration of the living, singing, humanoid star her parents had shown her.\nIt had made Antimony smile then, and makes her regret his death all the more now.\nThere’s a headache building between her eyes. There’s a . . . hmmm. It’s a not-quite-buzz-not-quite-hum, like an itch on the wrong side of her skin, creeping around inside her skull. She’s been hearing it since . . . she isn’t even sure when, but it’s getting louder, tied to the ship feeling listless, argumentative, sluggish. It’s in the soles of her boots, coming up through the deck plates. A sense of wrong. As if the sleeping star at the ship’s heart was not merely a metaphor, as if the ship was having bad dreams.\n“Heavy is the head that wears the crown.”\nA phantom voice at her ear stirs phantom hair. Antimony just manages to turn her surprised flinch into a hand grazed over her scalp’s stubble, as if that was always what she meant to do. She turns to face her immediate predecessor.\n“Fuck off, Cedar.”\nThe former captain leans against nothing, the prerogative of ghosts, arms crossed, lips bent to smirking. He’s much more corporeal than he has any right to be, in that he possesses form at all, though she can see right through him. Being stitched, Cedar should only be a voice, muttering in the walls with all the rest. That he’s more, Antimony imagines, is sheer spite and force of will. And a handy trick she’d like to learn herself one day, if she can do it without sacrificing her pride and asking him how.\n“What’s the fun in death if I can’t haunt my quarters and gloat?”\n“Death isn’t supposed to be fun. It’s supposed to be useful.” Antimony scowls. “And they’re not your quarters, they’re mine.”\nAntimony still doesn’t know how Cedar won Basalt’s good grace and favor and ended up captain before her. Cedar, with his Galactic Fleet training, the antithesis of everything a good pirate should be, yet Basalt had named him as successor. The fact that Cedar in turn named Antimony and not Hyacinth, Antimony is beginning to suspect, was another act of spite, as being captain is turning out to be a lot less fun and a lot more headachy than she imagined.\nCedar cocks his head, waiting for her to speak, waiting, more precisely, for her to ask for help. Antimony sits astride the polished bench of the single most improbable item on a ship crammed with impossibilities: a gleaming white baby grand piano, Cedar’s pride and joy. Instead of giving him the satisfaction, she stabs a series of discordant notes. When Cedar frowns, some of the tension uncoils from Antimony’s shoulders.\n“I hear you have a ghost problem.” Cedar breaks first, but it’s only a moment before his smirk is back in place.\nBecause, gods-damn him, he’s right. One of the many drawbacks of a ghost-powered ship—gossip travels fast. There are scant few secrets on the Xanthic Promise, save those kept from the still-living, which is precisely Antimony’s problem.\nIf the universe were kind, she could simply ask Starling the cause of his death, but despite being sewn into the walls by a supposedly unbreakable pact, wherever his ghost is, she can’t hear it. Like he gave up his voice with the loss of his tongue. All she can hear when she listens for him is that gods-damned hmmm, getting louder and making it hard to think.\n“I don’t suppose you have anything remotely useful to contribute?” Antimony grinds the words between her teeth.\nAn expression flickers bright through the former captain’s eyes, which are the color of lightning, nothing Antimony can read. Cedar is only three months stitched; perhaps Starling’s death is simply making him think of his own.\nAntimony thinks on it too, an unfortunate debris-strike fracturing Cedar’s faceplate during routine repairs—repairs he shouldn’t even have been undertaking as captain. Antimony had been there when he’d told Hyacinth he wanted to stretch his legs in the black. She’d watched Hyacinth inspect his suit herself, likely the only thing that kept Antimony from suspicion, her desire for the captain’s chair being no secret. She’d been there, too, when Cedar had come back to the ship, tether-hauled, frozen solid, ice crystals clinging to his skin, and his body ballooned to twice its size.\n“What would you give me if I could tell you?” The flicker in Cedar’s eyes turns sly, the promise of knowledge held like a curl of candied orange peel on his tongue.\nAntimony puffs up, pride, as always, ready to tangle her legs and lead to a fall.\n“Listen, you smug son-of-a—”\nCedar’s eyes flicker again, static-shot. He’s there and then he’s not and Antimony thumps a fist against the piano again for good measure.\n“Damn it.”\nShe bites the inside of her cheek, considers calling him back, thinks of apologizing, and the thought turns her stomach. She doesn’t need him, and he probably didn’t know anything anyway.\nStill, the air in her quarters feels empty, the temperature dropped. There’s no love lost between them, but Cedar’s departure hammers home the inevitable truth chained around the neck of all captains: she is alone.\n“Damn it,” she says again, softer this time, and swings her weary leg over the piano bench, rising.\nAny sensible captain would remain locked in her quarters to drink her troubles away, but sensible has never been her style. Antimony makes her way to the ship’s prow, allowing a detour to the ship’s store, where she feels Starling’s absence all over again as she requisitions a bottle of good rum and uncorks it with her teeth. She wonders what happened to his holo-stories. She could use a good fairy tale about valiant captains and singing ships right about now.\nThe hum-not-hum itch is there again as she walks the halls, a voice among other voices, one she isn’t quite hearing. It’s like an ill-tuned violin, a wetted finger circling the rim of a glass. On the edge of painful. A familiar voice, but corrupted somehow, like the mind behind it is still trying to figure out how to make words.\n“Starling?” she asks it not expecting an answer, and the sound rises in pitch, a static-squeal like it’s arguing with itself, before it falls silent.\nThen there’s only the usual ghost ship murmur, the dead speculating whether command has made her crack. Living crew members, too, give her the side-eye, whispering among themselves as if she can’t hear. Let them talk. Cedar was a captain of the people, soft and decidedly un-piratey. Antimony is comfortable in her lonely command; better to be feared than loved, as they say.\nLacking anyone human to talk to, she could seek her own ghost, her dead-self-to-be as oracle, but that way lies madness. Or so she’s heard tell. Knowing your ghost on an intellectual level is one thing; looking it dead in the eye and knowing it full and true, that’s another.\nBesides, at the moment, Antimony would rather drink herself into oblivion or into a state where a solution produces itself, whichever comes first. And she intends to do so in full sight of her ghosts and her crew. Let them see a captain without shame, bowed but not broken by the weight of her command. Let the living and the dead gossip on that if they will.\nThe crow’s nest is empty, waiting, and Antimony can’t help a grin. She strung the hammock across the ship’s foremost eye herself during her first year aboard. Basalt had given her waste duty for a month, but she hadn’t taken the nest down, and Antimony had even seen her captain using it a time or two herself when she thought no one was looking.\nWhen she’d first come aboard, after her shifts, Antimony would throw herself into the hammock to listen while most everyone else slept. She’d gaze out at all those stars and wish the stories she’d devoured as a station-bound child were true. She’d wished that instead of the creaks and groans of metal deck plates, she could hear the star’s voice. She’d wanted to hear it sing.\nShe’d been foolish enough then, naïve and wide-eyed, that she’d actually asked then-engineer Oak about the star, and whether it really slept.\nThey’d laughed at her, that deep barrel-chested laugh that, while it hadn’t been cruel, had still struck her a blow. Fairy stories, they’d said. Tales for children to make the work of ships seem like magic.\nBut if ghosts could power a ship’s weapons, she’d reasoned, then why not a sleeping star? Maybe, over the years, people had simply forgotten the truth. Maybe when they’d put the stars to sleep, they hadn’t wanted to own the cruel thing they were doing, so they spun fantastical tales too incredible to possibly be true.\nShe’d given up her belief soon enough though, but had Starling?\nAntimony throws herself into the crow’s nest, kicking up her bootheels just as a commotion breaks out behind her.\nWhat the fuck now? she thinks, wheeling her weary bones around.\n“She wakes!” the man screams, a crew member whose name Antimony should know, excusing herself that she doesn’t due to the fact that his face is currently an unrecognizable mask of blood.\nHe holds something sharp in crimson-slick fingers, not threatening anyone, but staggering and weaving—shock and blood-loss after gouging out his own eyes.\n“It won’t stop!” he screams. “He promised, but it never stops. Please, help me.”\n“You still want to make the run?” Hyacinth asks, all incredulous, scoffing tone.\n“Are we or are we not gods-damned pirates,” Antimony, rhetorical, shoots back.\nHer mouth tastes the way she imagines the inside of an engine block would.\nShe has one crew member spaced, body refusing to yield up any other secrets, and one in the medbay, bandages over his lack of eyes and doped to oblivion. And she still has a gods-damned job to do.\n“We can still make the pickup and drop in plenty of time to get paid. Even without the extra ghost to throw on the fire.” Antimony tries to smile around the flat attempt at a joke.\nHyacinth scowls, muttering under her breath, as she walks away.\nDoctor Coxcomb utterly forbid Antimony from questioning Chrysotile, though Antimony doubts he’d be able to provide her with sensible answers. Sensible people don’t gouge their eyes out. But insensible people might just commit murder. Something to think about. Later. Solving mysteries doesn’t pay the bills. Only piracy does.\nThe pickup goes without a hitch, the drop-off less so, because of course one thing can’t fucking go right for her. Instead of payment, their contact meets them with guns, eyes blacked and teeth capped with gold, marking them as DeathSkull, notorious double-crossers, and not Green Hand, the flag they’d claimed to sail under.\n“Evade where you can, fire only if you have to,” Antimony shouts to be heard above the chaos.\nA hit to Xanthic Promise’s portside causes the whole ship to rock, and a panel to her right explodes. How the fuck does that even work? she wonders, then ceases to wonder as sparks shower and she slaps at her coat to keep it from going up in flame. How many deaths can she afford to burn to get out of this mess? She rolls through the inventory of ghosts in her mind, then gives the order to fire.\nShe needs just a little time, just a little luck, just enough space to do something stupid to save their skins. Twin stars of glittering light leap from the ship’s cannons. Ghost-tech rarely kills, but it does a credible job of convincing people they’re dying. At least briefly. Sometimes, ironically, it even convinces them to death.\nEither way, it’s still a pretty light show that will buy them some time as, for the next few moments, the crew of the ship currently trying to wipe them from the stars relives the last breaths of six stitched souls now serving the Xanthic Promise as weaponry.\nBasalt may be in there somewhere, Antimony thinks as the glittering light hits home. That could be her fate one day, the captain’s last burst of glory, her final duty. There are worse ways to go.\nAnother panel explodes. Acrid smoke fills the air. Antimony coughs, and the ship slews hard and away, running running running. Rivets and seams strain, everything wanting to fly apart as Antimony wills it to hold. Jaw clenched, she calls up charts, squinting through eyes that stream part from headache, part from the bone-rattling speed. Her back molars feel as loose as the rivets, and she shouts fresh coordinates.\n“Are you out of your gods-damned mind?” Hyacinth swivels to stare. A rivulet of blood tracks from a gash above her eye, but she doesn’t wipe it away.\n“Yes!” Antimony fires back.\n“That’s Sargasso space.” Trust Hyacinth to recognize the coordinates right away. Damn and double gods-damn.\n“Do it anyway.”\nHyacinth’s eyes blaze crimson mutiny, or maybe that’s only the blood, but she punches the coordinates, punches the ship, and they’re off.\nThe Horse Latitudes. The Doldrums. The Sargasso Sea. All names that don’t make sense in the black, but the effect is the same. It’s a graveyard for stars, a place of legend where ships stall for no discernable reason and never start up again. It’s a place only the foolhardiest captain would go willingly, and which any sensible band of pirates would cut off pursuit to avoid, which is exactly what Antimony is counting on.\nThere’s an under-the-skin feeling the moment Xanthic Promise hits that dead space. The DeathSkull ship drops pursuit, just as their own engines cut out, and Antimony breathes relief against the tightness in her ribs even if it doesn’t last long. The walls chatter doubt. Her crew looks to each other, wild-eyed, but they’re all still alive. They should be falling on their knees and thanking her.\nThat’s when the screaming starts.\nIt’s a wrong sound. An inside-out sound, purple-shattering-to-silver-at-the-edges, going on and on like a voice, like that untuned violin, but so much louder and worse. It is want and need and hunger and fear and unlike anything Antimony has ever heard before. It’s unlike anything she ever wants to hear again. It makes her want to dig her nails into her skin and peel it away whole to go running around in her bones.\nIt leaves her panting on hands and knees, howling back at the noise until she tastes blood, until Hyacinth cracks her across the jaw hard enough to replace one ringing in her ears with another.\n“What is. That. Noise. What you’re. Doing.” Hyacinth’s words come out in huffing breaths, shaking and broken.\n“You didn’t hear it?” Antimony is still hearing it, is certain she’ll always be hearing it from now until the end of time, but at least it’s dulled, a bruise rather than a fresh blow.\n“I heard you screaming,” Hyacinth says. “I didn’t know a human throat could make that sound.”\n“I’m not sure it can,” Antimony says.\nShe stands.\n“Well, whatever it was,” Hyacinth says, voice steadying, “according to the report I just got, it happened at the same time three very long fissures appeared in the star chamber’s glass. So, to put it mostly succinctly and bluntly, we are completely and utterly fucked.”\nAntimony follows Hyacinth to look at the star chamber, as if their own eyes could make the report untrue. No such luck. The star chamber is indeed breaking as reported, three long fissures running almost the entire length of the glass that looks somewhat like an old-fashioned lantern and somewhat like the heart of a lighthouse and nothing like either of those things at all. Breaking, but not broken, and that is one small mercy, but perhaps the only one.\nAntimony leaves Hyacinth to do whatever she can, which is, she suspects, very little. The ship was already sick before this whole thing started. Cedar must have known it, and that’s why he insisted on making the repairs himself. But something went wrong, and maybe that’s where this all started, and it’s all connected somehow.\nAntimony thinks of Starling’s missing tongue, a sacrifice, and the sound she’s still hearing, like a ringing echo inside her skull, a voice that doesn’t have words, belonging to something that never had a voice before. She thinks of fairy tales hiding a willfully forgotten truth in plain sight. She’s beginning to build a picture in her mind, and she doesn’t like it at all.\nShe takes herself to the medical bay.\nChrysotile lies rigid, lashed down with restraints. Fluid drips into his arm, a steady flow, keeping him somewhere between awake and dreaming. Coxcomb will likely be back soon. Not enough time to try to wake him, even if such a thing were possible. Antimony is considering sneaking out again when Chrysotile’s head snaps around to look straight at her, which is disconcerting to say the least, given that he is without eyes.\n“I thought I could finish it, but I wasn’t strong enough. Starling said the light would stop if I helped him, but it only got worse.”\nHis body seizes, guilt or pain or both wanting to make an arch against the restraints. He gropes the air, fingers twisted to claws and Antimony shoves down every skin-crawling impulse she has to make herself do the human thing and let Chrysotile take her hand. His fingers are freezing, his grip iron.\n“Tell the captain I’m sorry.”\n“I—” Antimony begins, but gets no further as the door grinds open and Doctor Coxcomb descends on her like a storm.\n“I was very specific in my orders.” Coxcomb brandishes a syringe like a weapon, ready to deploy whatever is inside if Antimony doesn’t leave now, captain or no.\nAnd oops, yes, maybe Antimony did use her override on the medbay door knowing the doctor would deny her entry. She quick steps away, trusting to Coxcomb’s brutality in defense of her patient. Besides, she needs to think.\nTell the captain I’m sorry. Antimony very much doubts Chrysotile meant her. Some promise made to Cedar? And how does Starling fit in? All those old stories. If they really were true, what monsters would that make her and all the other ghost ship captains down through the ages?\nAnd even if the tales aren’t true, what if Starling believed? Would it be enough for him to convince Chrysotile to kill him, so he could sacrifice his tongue to the star and give it a voice?\nThoughts roil, pressing out against her skin until Antimony feels she’ll explode. She stomps through the halls and up to the crow’s nest, the place she dreamed as a child, and now all those dreams and wishes feel like a cruel lie. Antimony presses her hands to the window and screams fuck you very loudly at the lack of stars.\nThroat raw, she turns to an access panel, calling up the ship’s logs. Something she should have done long ago, only she was busy with murdered and eyeless crew members, damned double-crossing pirates, and recalcitrant ghosts.\nShe finds Cedar’s entries from the days before his death. He must have felt the same wrongness in the ship as she does now. Would he have attributed it to a waking star? And if he had, what would he do?\nDeep in their hearts, do all ship’s captains know the tales they drank like milk as children are true, but they’ve collectively chosen to believe otherwise?\nCedar never confided in her as his second in command. Keep your friends close, and your enemies closer. It stood to reason Cedar had only accepted her as first mate to keep an eye on her. Who had he confided in, then? Chrysotile? Certainly not his logs, as they are all maddeningly mundane and empty of any useful details.\nAntimony returns to the ship’s stores and requisitions another bottle, gin this time, and a sturdy blade. She’s about to do a very unwise thing indeed. Antimony drinks and winds her way through the halls until she finds the place where her oath sings to her.\nThe expanse of wall would look unremarkable to anyone else, but it’s where her death is stitched, her promise to the ship, and so for her, there’s a faint silver glow of scars etched into the metal. With half the bottle killed, the blade weaves dangerously above her palm. She closes one eye and squints the other to make both knife and hand behave. Before she can think better of it, she traces the old seams until blood wells, and presses the new wound to old.\nRed smears and a spark snap-jumps, shocking her spine rigid and clacking her teeth together. It’s unwise to talk to one’s own future-ghost, to seek one’s death for counsel, but ever since the scream that rattled her to her core, Antimony has felt her death just inches beneath her skin and she’ll be gods-damned if she just sits around waiting for it to come to her.\nShe forbids herself to pass out, winding the gauze she requisitioned at the same time as the bottle around her hand. It immediately soaks through. When her other-self appears, it’s very much like looking in a mirror, same shorn-to-stubble hair, same smug grin. The event horizon between her death being a future-her problem and a present-her problem is collapsing. She rubs a hand over her scalp, almost expecting her ghost to do the same, but her ghost only smirks, reminding her irritatingly of Cedar.\n“What is it?” Antimony asks.\nThe fox fire light around her ankles swirls, a chill reaching up her trouser legs, playing with the hem of her coat. She tries to keep her teeth from chattering. It wouldn’t do to look weak in front of herself.\n“You already know,” her future-self’s voice is an echo-blur. “It’s the star. You’re hearing her voice, the one Starling died to give her.”\nThe smirk on the other-her’s lips becomes something sharper, a blade, almost cruel. Would it be uncouth to punch her own ghost in the mouth?\n“Stars aren’t sentient. Those are just fairy tales.” She doesn’t want it to be true, but she knows down in her bones that it is, and hasn’t she always known?\nThe other-her’s smile doesn’t waver. Antimony would have thought there might be some mercy in her eyes, but she also knows herself too well. All the knowing coming to her now is still wound-fresh to her other self. It hurts, too much for future-Antimony to offer any kindness.\nBecause she does know and she’s always known and she’s never wanted to know. All those stories, all that wishing, she never fully thought through the consequences because it would be too terrible. But Starling had known the truth and given his own life to it, a small right against a whole universe of wrong. And Chrysotile had helped him.\n“What about Cedar?” Antimony asks herself. He must have known too, but what did he do about it?\n“Ask him.” Future-Antimony’s eyes glitter, cruel delight, like passing the pain back to her past-self might lessen her own hurt.\nAntimony’s hand flashes out, fingers closing around her future-self’s wrist, holding her in place. Even though she must be expecting it, her future-eyes widen in surprise, and there, at last, Antimony sees mercy, sorrow, her future-self aching for the past-self coming face-to-face with the death that will be. But she does nothing to stop her, and the mercy fades back into a smile that might have blood in it if her future-self were still a thing capable of bleeding. Because she knows what happens next.\nAntimony looks into her own eyes.\nAnd there, every possible path her future might take forks and forks and skates across the surface of everything like the glass in the star chamber not-yet shattering. Her life races along those cracks like lightning and comes to a dead stop, a point she can’t see beyond.\nShe sees herself and the star in its chamber and both are burning. There is nothing else. Except. Except except except—an edge like a closed door, like a flat horizon, like a coin pressed to a table with another face Antimony knows is there but cannot see. There is no way to pick at the edge to open the door to see the other face to know that it exists because it does not or cannot or should not because this is where she ends.\nAll the light in the world goes out like a blown candle and rushes back all at once like knives to her eyes and Antimony is alone in the hall. She kicks the wall where her unhelpful asshole of a death is stitched, hard, so her bones jar and the steel toe in her boot rings and it doesn’t make her feel any better at all.\nShe returns to the engine room, to the star chamber, and stands in front of the impossible swirl of light. It makes her skin itch, brings the jittery feeling back to her teeth. If she looks long enough, she can almost see a face, a mouth in the roiling, pulsing energy.\nAntimony traces a finger over one hairline crack until it joins another and another—a river with three tributaries. She presses her bound hand to the glass, leaves a blood-petal kiss of red behind.\n“I’m sorry,” she whispers.\nShe makes a fist of her hand, thumps the side of it against the glass. She’s being a coward. Still.\nAnd now. Now she has a choice to make. Like Cedar made a choice. And fuck it, because her impulse is to do something noble and stupid and self-sacrificing and she really doesn’t want to die.\nBack in her quarters, Antimony mashes the piano’s keyboard, thinking of the keys as teeth, Cedar’s specifically.\n“Come out and talk to me, you asshole.” The yelling makes her feel better, but only marginally so.\nCedar isn’t there and then he is, and even though Antimony called for him, she still jumps when he appears, leaning on nothing again, arms crossed. Despite the horrific nature of his death, he’s still maddeningly pretty, cheekbones defined where hers look gaunt, relaxed and well-fucking-rested where she looks haunted and sleep-starved.\n“You’re lucky I’m not corporeal.” Cedar tosses a meaningful look at the piano.\nAntimony is still tired and still a little drunk and lightning keeps forking behind her eyes. But it’s worse when the lightning stops, when it finds the place where it can’t go any farther because that’s where her life ends.\n“Why didn’t you tell me about the star waking?” Antimony steps back from the piano, closed fist shaking, and she tucks it behind her back so Cedar won’t see.\n“What fun would that be?” He runs fingers over the piano keys and when they make no sound, he runs a finger over the wires instead.\nThey still don’t make a sound, but whatever it does makes Antimony shiver.\n“Would you have listened even if I had tried?” The maddening expression on Cedar’s face makes Antimony want to throw something.\nHe’s right, and that only makes it worse. How many times did they butt heads when he was alive, when she was under his command? Even knowing there’s no solidity to him, Antimony jerks open the piano bench, stuffed with books and sheets of music, and throws the first one she lays her hands on. The pages flutter, and a small square of paper tumbles free.\nAn actual, honest-to-gods, printed photograph.\n“Oh fuck me.” Antimony bends to retrieve it, Cedar watching her with a brow perfectly arched, expression smug.\nThis was here the whole time and Antimony never saw it, too uncultured to do anything with the piano other than bang on it for attention and use it as a place to sit and drink and feel sorry for herself.\n“You and Chrysotile were in the Galactic Fleet together.” Antimony holds up the picture, a group of young cadets in their uniforms, arms slung around each other. Chrysotile and Cedar are together at one end, and Chrysotile’s head is slightly turned, caught in a moment, distracted and unaware of the picture about to be taken.\nEven Antimony isn’t dense enough to miss it. The expression on Chrysotile’s face is stark: love.\nShe thinks of Chrysotile, eyeless in the medbay, grasping her hand and begging forgiveness from his dead captain. To be loved like that—enough that someone would kill for you. Well, it isn’t exactly a comforting thought. It leaves Antimony feeling claustrophobic, but at the same time, achingly lonely. There is no one among the crew—no one in her life—she could even share a drink with, let alone someone willing to pick up a knife and kill a fellow crew member for her, to finish whatever it is she might leave undone.\n“I was wrong about the star.” The sorrowing look in Cedar’s eyes takes Antimony’s breath away.\nShe has a picture of her former captain in her mind—brash, ambitious, apologizing to no one. Stealing her rightful command out from under her, winning Basalt’s favor and trust. But the more Antimony looks at her mental picture against Cedar’s ghost, the more she realizes she doesn’t know him at all. Did Cedar wash out of the Galactic Fleet? Was he dishonorably discharged? Maybe there’s a pirate streak in him after all, and maybe there’s something even more important, something Basalt saw in him and not in Antimony, which is why she gave him command—compassion.\nThe picture she holds in her mind of Cedar—it’s a picture of herself. A picture of who she wants to be, or believed, up until this very moment, she needed to be in order to command. Ruthless, friendless, alone at the top. Holding her crew at bay in a mixture of awe and fear, needing no one.\nHeavy is the head indeed. Maybe it wasn’t a taunt on Cedar’s lips earlier so much as a warning.\n“How do I stop it?” Antimony asks.\nDead space aches all around the ship, the doldrums, like a bruise. The ship drifts, quiet in all the wrong ways. No engines thrumming; the only pulse of life the need of the star. If they stay, they’re doomed, if they run, they’ll fail. The star chamber will crack, the ship will explode or be devoured. This isn’t just a graveyard for ships, it’s a graveyard for stars, and her own always-dying star is calling to the ghosts of her own kind that haunt this space. And sooner or later, they will answer.\n“You don’t stop it.” Cedar’s expression is grim. “That’s what I got wrong. There’s nothing at all you can do. We kept the star chained, and this is her vengeance.”\n“A fucking lot of help you are.” Antimony grits her teeth.\nAt the same time, guilt needles her; no matter how they clashed while he was alive, Cedar really did want what was best for the ship. He might even have loved the Xanthic Promise as much as she does. Enough to die for it.\nHer intuition leaps.\n“You went to talk to your own death too, and you came up with an answer that involved you walking out of the ship on a routine repair mission and meeting your end even though your time wasn’t up yet.”\nThe pieces click into place, a rapid tumble matched by the beat of her pulse.\n“You thought if you rearranged fate, met your death early, you could strengthen the chains, put the star back to sleep and keep the ship running. Chrysotile tried to finish what you started, but Starling . . . ”\nThe pieces fit, almost but not quite. There is still some missing. Did Starling simply get unlucky and cross Chrysotile’s path just when he was feeling grief-mad and murderous? Or did Starling take advantage of Chrysotile’s grief and talk him into committing murder, convincing Chrysotile that his death would finish what Cedar started and put the star back to sleep? Only Starling lied. He wanted to wake the star. Give it a voice. Set it free.\n“Starling got it right, and you got it absolutely fucking wrong.”\nCedar’s eyes blaze at her, all glare and bared teeth, and for a moment he is as terrible as any ghost ought to be. But all she can do is grin triumph in the face of his offended rage, because she’s right, and a victory, even a pyrrhic one, is still a gods-damned win.\n“You should have been trying to set her free, wake her up the rest of the way, rather than put her to sleep again. You died for nothing.”\nCedar howls and lunges at her, fingers crooked like claws. But of course, he’s insubstantial and passes right through her. Lacking the focus of the Xanthic Promise’s honed-bright weapons to make his death useful, Antimony feels nothing. Until she turns to mark his passage and where he ends up, comma-curled in the air, his body a sob without breath or tears.\n“Fuck.”\nShe’s doing it again, setting herself above and apart, taking pleasure in a moment of being right, even though she was just as clueless as Cedar, and every bit as guilty. She should have held onto her belief in the old fairy tales, like Starling. She should have had compassion to pair with her ambition. She shouldn’t have been such a bloody, arrogant fool.\nShe wishes she could pat Cedar’s shoulder, comfort him. He straightens, emptied of rage now, as she is of gloating. And here is the other shoe about to drop between them. Cedar tried and failed and the ship is still in danger. The ship needs a captain, and at the moment, that’s her.\n“So what are you going to do about it?” Cedar asks.\n“Well, fuck,” Antimony says, because there’s nothing else for it. Cedar was on the right track, but facing the wrong way.\n“I guess I’d better go see about a star.” Antimony shapes her lips to a fierce grin, her stance to a swagger. A little bit of brash and bravado isn’t such a bad thing. She is a gods-damned pirate after all, and if she’s going to go out, then it’s going to be staring death in the face and giving it the middle finger.\nCedar tips his head at her forgotten bottle of gin. His expression is almost kind, but not really at all, because he’s a gods-damned pirate too and that’s not how it is between them.\nAntimony lifts the bottle in salute, takes a swig, and pours out a measure for him. The washed light of Cedar’s eyes flickers in something like pleasure, which gives her hope. Since she’s about to be very dead herself soon, it would be nice to go out knowing that she can still get shit-faced in the afterlife.\nAnother swig for good luck and she leaves the bottle beside the piano, uncorked. She resists the urge to set it down on the bench where it would leave a mark, a last peace offering.\nAnd off she goes.\nAntimony strides the decks of the Xanthic Promise. The walls howl with the restless dead, and in her mind, they’re a storm. She’s a pirate of old, her heeled boots ringing on wood while her red coat swirls and rain lashes her. She bares her teeth as if to catch the wind, even though there’s nothing here but recycled air.\n“Out,” she bellows as she steps into the star chamber’s room.\nHyacinth looks up, scowls, a refusal on her lips. Antimony feels a flicker-flash of regret. Hyacinth is as sour as Antimony wants to be, or at least presents the same gruff exterior. Maybe they could have been friends, raised a glass together in the crow’s nest and sang bawdy old star-shanties. Antimony guesses she’ll never know.\n“Go, or I’ll clap you in irons or make you walk the plank or something equally piratey.”\nHyacinth merely shakes her head, not so much a ceding to authority as her not being paid enough to care. As Antimony freshly reminded herself, they aren’t friends, and the captain’s chair will fall to Hyacinth next, so what stake does she have in stopping Antimony’s stupidity?\nHyacinth retreats, leaving Antimony alone.\nThe star chamber itself is sealed with a double hatch. Antimony scrambles to the top of the chamber and overrides the locks to drop through.\nAnd then. She is. Falling. Seeing her bones through her skin. Hearing them, and isn’t that a weird fucking thing. Antimony is herself and she is her ghost, and she’s every captain who came before her, stitched in a long line, and this is where it ends.\nShe tastes Cedar’s death, holds it on her tongue, the bright bright bright moment of pure joy right before his faceplate shattered, thinking he was doing the right thing.\nHer own death is here too, waiting for her just around a corner. A door. An edge. A turning.\nBut she isn’t there yet.\nThe ship sings. It screams. A swarm of bees humming in a cave made of ice cracking and a violin playing and a color that is blue and purple and pink and none of those at all and a hunger and a heartbeat and a lullaby and a whale calling to its calf through the deep.\nOh, it echoes. Antimony feels it all along her jaw. An ache to answer, but the sound isn’t for her. It’s for the ghosts outside the ship. The dead stars and the living ones and the stars yet to be born. They’re alive. All of them. Not just her star, but everyone among all the billions of points of light spread across the universe. Gloriously, terribly alive.\nIf a thing can have a heart that can be cut out and chained in the moment of its death to power a ship, then of course it is alive. Truly and properly alive. They had no right, none of them, the captains stretching back to the beginning of time sailing the black, to do what they have done.\nLightning cracks. Branches. The edge. There. Antimony reaches. Plunges her hand into the light that is the song that is the end of the line. And her ghost smirks and Cedar smirks and the thread tugs. She pictures with all her will and might, for whatever they are worth, cutting the star free, waking it up, shattering the bonds while sealing the wounds in the glass and keeping everyone on the Xanthic Promise safe, and she hopes against hope and against reason her death is strong enough to do that.\nThis is the end.\nExcept.\nThe coin pressed flat to the table has another side, and so does the door, and the edge really is a corner, and it can be turned.\nCedar made a bargain with his death and went to meet it early. But every member of a ghost ship’s crew knows their death is a solid and inevitable thing. They swear an oath the moment they come on board, and live every day knowing fate cannot be cheated. It is an immutable fact.\nAnd so, if Cedar met his death early, then in truth, he was always fated to do so.\nAnd by that very same logic, if Antimony makes a deal with her death now, refuses it and slips around the edge to the other face of the coin, the other side of the door, then she will have always been meant to do so. Fate signed, sealed, and delivered.\nA promise is still a promise. That is where the power of a ghost ship lies, and she’s not denying her ship anything, only delaying its gratification a while.\nAnd it is a glorious thing.\nHere’s the deal, she thinks, You use my living voice, my tongue to scream your star song to the universe, to scream yourself awake and free, and you kick enough power into the ship on your way out to get us out of the Sargasso and I’ll figure out the rest on the way down.\nIt shouldn’t work, but ghost ships are built on impossible things.\nAntimony throws her head back and opens her throat to the voice that shivers along her jaw, the star longing to sing through her in a language not meant for human tongues. She burns. The chamber shatters and she shatters and the ship lurches forward through the dark—a blink that is not motion that suddenly puts them somewhere else.\nEverything turns inside out and upside down and sideways and backwards oh my. And then Antimony Jones does the most impossible thing of all: she survives.\nHer skin is still smoking as Antimony limps from the star chamber’s remains. Chunks of glass, charred and black, litter the floor. The ship is whole, powered by a ghost, by a promise, as always, just enough to get them out of the doldrums and then, well, maybe Antimony will have to roll the dice again and put her life on the line one more time, but that’s a problem for future-her.\nAntimony looks down at her arms, her legs, at skin black as charcoal, cracked and crazed and flaking ash. Seams running through her flesh blaze with starlight, every and no color at all. Her clothes are gone. And it’s a damned good thing she shaved her head before this all began, because if not, her hair would be on fire.\nShe nearly collides with Hyacinth who hovers just on the other side of the door, anxious for her ship if not for her captain. Antimony tosses a crooked grin.\n“Let’s get a drink sometime,” she says, and the words draw more shock from Hyacinth than Antimony’s burned-and-smoldering condition.\nCheating death, or at least delaying it for a while, is as good an excuse as any to turn over a new leaf. She can be a fierce, piratey pirate and still make a friend, or at least try.\nBlack petals scorch the deck, the echo of footsteps left in her wake. The same goes for any place Antimony rests her hand to steady herself, which she does often, covering the ship with impressions of herself all the way back to her cabin where she scoops up the rest of the gin and kills it in one go.\nThe ghost-stitched walls chitter and gibber and gossip and Antimony grins. Let them tell grand epic tales of the captain who freed her ship’s star, who looked her own death in the eye and said not today, motherfucker. She’ll happily listen once those rumors circle back around as star-shanties, but not right now.\nNow, she will fall into her bed and hope that the sheets don’t catch fire because she intends to sleep for a week solid.\nWhatever comes after that, well, that’s a problem for future-her. Now-her is flush and full of victory, all the crackling power of her ghost ship at her fingertips, and the whole of the universe spread before her. Just the way it should be.\nA.C. Wise's fiction has appeared in publications such as Uncanny, Clarkesworld, Tor.com, and several Year's Best anthologies. Her work has won the Sunburst Award for Excellence in Canadian Literature of the Fantastic, as well as twice being a finalist for the Sunburst Award, twice being a finalist for the Nebula Award, and being a finalist for the Lambda Literary Award. She has two collections published with Lethe Press, and a novella published by Broken Eye Books. Her debut novel, Wendy, Darling will be published by Titan Books in June 2021, and a new short story collection, The Ghost Sequences, will be published by Undertow Books in August 2021. In addition to her fiction, she contributes review columns to Apex Magazine and The Book Smugglers.", "source": "https://clarkesworldmagazine.com/wise_11_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: To Sail the Black by A.C. Wise"}