{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tobias S Buckell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "lrW9La6/FOypVrpdX+/dCztJQC4=", "id": null, "license": null, "comments": "", "raw_text": "9730 words, novelette  A World to Die For  Your hunting party of repurposed, cobbled together and barely-repaired pre-Collapse electric vehicles sweeps across the alkaline rich dust flats of old farm land. The outriders are kicking up rooster tails of dust into the air behind them, their bikes scudding over the dirt and slamming hard into every divot and furrow. Pennants whip about in the air.  You’re glad to be on the top of a pickup with suspension, ass in a sling, feet shoved hard against the baseplate of the machine gun mounted right up against the back of the cab. You’ve been an outrider before, trying to balance a shotgun on the handlebars of the bike without wiping out. You didn’t like it.  The outriders might get more respect, but there’s a reason they wear all those heavy leathers, padding, faded old football helmets, and other chunks of scavenged gear.  “There she is!” Miko leans out from the passenger-side door and bangs on the roof of the cab to get your attention away from the outriders and pointed front. “Get ready.”  Up ahead, through the bitter clouds of dirt that seep around the edges of your respirator, is the black line of the old Chicago tollway. You reach forward and yank a latch on the machine gun, pulling one of the large-caliber bullets into the chamber with a satisfying ratchet sound.  The seventy-year-old gun has been lovingly maintained since the Collapse. It has seen action in the Sack of Indianapolis, spat fury down upon the Plains Raiders, and helped in the defense of the Appalachian Line. You look down the sights, ignoring the massive ox horns and assorted animal skulls bolted onto your truck’s hood.  Your quarry is ahead. A convoy of trucks pulling hard for places out further East. Their large, underinflated balloon tires fill the potholes and scars of the old expressway as they trundle on at a dangerous thirty-five miles an hour. It’s axle-breaking speed, a sprint across the country in hopes that they can smash any MidWest Alliance blockades without paying import/export duties.  Fuckers. As if they could just roll across a state for free. Now they’ll pay a lot more than just a ten percent transit fee.  “Cheetah cluster: right flank,” Miko screams over the screech of old suspension and the rumble of tires. He is still hanging out of the door, and he points and throws command signs at other drivers. He’s ripped his respirator off and left it to dangle around his neck. “Dragon cluster, left. Cougars for the front.”  Your cluster of vehicles splits off to swing behind the convoy’s dust trail, the world turning into a fog of black dirt and amber highlights, and you fall in on the right like a vulture. Enemy outriders split off from the convoy to harass the impending clusters, but they are outnumbered. Shotguns crack through the air, people scream.  In moments the security around the convoy peels off, uninterested in paying for cargo with any further lives. They’ve done their paid duty—they can head back in honor to whoever hired them.  “Do it,” Miko orders you. He pulls his respirator back on, and now he’s all green eyes and blonde hair over the edge of the cracked rubber. He’s the commander. You’ve risen far following in his footsteps. Maybe one day you’ll run a cluster, give commands to your own outriders. You’ve been tasting ambition like that, of late.  To survive, you need to find the right people to follow. Miko has created a strong pack. The fees you pull from what little cross-country traffic still trickles over the road keeps you all fed, the respirators fixed, and batteries in stock.  You lean back and pull the trigger.  The old Browning destroys the world with its explosive howl. You rake the tires of the trucks as Ann, the driver, moves the pickup along the convoy in an explosion of acceleration.  All three of the oversized vehicles shudder to a halt. Ann brings the pickup to a sliding stop, dirt and chunks of the old highway rattling up to kick the undersides of the old vehicle.  Miko steps out, shotgun casually slung over his shoulder.  Everyone’s expecting the drivers to come out of the truck cabs with hands up. But instead there’s a loud groan from the trailers. Miko swings the shotgun down into his hands and aims it up at the sound.  The sides of the middle trailer fall open and slam to the ground. Houz Shäd shock troops in their all-black armor are crouched behind sandbags and a pair of fifty-caliber machine guns.  You’re all dead.  But instead of getting ripped apart by carrot-sized bullets, one of the Shäd shouts through a loudspeaker, “We seek information from you, and only information. Drop your weapons and live. You’ll even be allowed to keep them. In fact, give us what we seek and your cluster can take the entire shipment of solar panels in trucks one and three.”  Miko drops his shotgun.  You push away from the machine gun, hands in the air, wondering what happens next.  The Shäd jump down from the trailer, greatcoats flaring out behind them. Their deep-black machine guns seem to soak up the amber light. There’s a storm brewing up north, you can tell. You will all need to run before it, get down underground before the tornados touch down and begin ravaging everything.  “Remove your ventilators,” the nearest Shäd gestures. “Kneel in a row.”  Your mouth is dry. This is an execution line and you know it. Bullshit promises aside. People like the merchant riders of Shäd view the continent as a place they should be able to trade across. They view clusters as “raiders” and not the customs agents you know yourselves to be.  But instead of walking behind you, the Shäd spread out in front of the line, moving from member to member. They’re holding out photographs in their gloved hands, looking closely at each member of our cluster through mirrored visors.  The nearest Shäd approaches. Those ventilators they wear are not just the usual air purifiers, you realize. They’re connected to oxygen bottles on their hips. You’ve never been close enough to see that before. “We are looking for someone,” the Shäd says through his mask.  The fuck? All this over an MIA? People go missing in the middle countries all the time.  “This is her picture. We have been told she may be called Chenra, or Chenray. Have you seen her?”  You glance left, blood going cold, because that’s your name. Miko stares at the ground and shakes his head. Ann, her long black hair tangled up in ventilator straps, shrugs. Cheetah cluster won’t rat you out.  But why the hell are shock troopers from Hauz Shäd hunting you? You’ve been on a few nondescript battery raids, run the outlander position on some basic convoy stops, but you’re not officer class. Just a runner and a gunner from nowhere.  You’d be sick from fear if you even understood any of this.  You’re mainly confused.  The toxic air is rasping at the back of your throat. The ever-present dust is making your eyes water.  It has to be some kind of mistake. Whoever they are truly hunting has used your name, or has a similar name, and these very dangerous private security troops ended up crossing the midlands to find you.  “Anyone who gets us this woman can have the solar panels in the trailers here,” the man repeats, pushing the photo at you.  “Yeah, let’s have a see,” you mutter, leaning forward on your knees.  He steps closer and you take a look.  It’s you. There’s no mistake.  But you know for sure you’ve never had your hair cut up above the ears like that. Or so flat.  The teeth are all wrong. White. Like someone has painted them. Different positions, too. Shit, do you have a long-lost twin sister or something like that? The woman in the picture does look eerily like you.  But it can’t be.  A whole shipment of solar panels. If they’re telling the truth . . .  You stand up. “Are you serious about those solar panels?”  A helmeted nod in response.  “What’s your business with that woman?” You jerk your chin at the photo.  “A client needs to talk to her.”  “That’s it?”  “Just a conversation.”  You take a deep breath. Cheetah has given you food and lodging. Given you a trade. You were thirteen when they found you trudging across a dune up in the lower peninsula of the Holy Michigan Empire. They treated you well. Better than you’d feared when you saw the motorcycles roaring across the sand toward you.  Even if you get shot, or kidnapped, a solar shipment would help all the clusters here. And if there’s one thing you are, it’s loyal to the people who show you the way forward to a better life.  “Then I’m Chenra, Cheetah cluster. I claim the reward of the solar panels.”  “Che! I’ll follow you!” Miko tries to stand, but one of the Shäd casually kicks him back down with a boot to the shoulder.  “You can’t come where we’re going,” the mercenary laughs through her respirator.  Hauz Shäd has a strong reputation for following contracts to the letter, so you’re not overly worried anyone will get screwed over here. All that crap about them eating the flesh of people they’ve killed is just rumor. Collapse jitters.  Sure enough, as you’re taken up toward the head vehicle, the trailers are being disconnected from the trucks. Several cluster members climb aboard, open the rear doors, and shout in delight. Outriders watch you go by and nod in respect.  You don’t see Miko anywhere. He’s a ghost when he needs to be. He’s not going to be happy about his gunner getting kidnapped.  Clusters don’t carve promises into skin and swear blood oaths to protect each other to death as a meaningless gesture. They’re planning to watch and follow you, to have your back. So you’re going to play along, see what comes of this bizarre attempt to kidnap you.  If you manage to get out of this and back to the clusters, they’ll all owe you big. Maybe even get you a promotion. You could end up a driver inside the shielded cockpit of an attack pickup. Maybe even get some scrip for hydroponic fruit from down near Fort Wayne.  The truck at the head of the convoy has an extended cab over the battery frame. The up-armored doors hiss open and the Shäd on either side of you point inside. Other Shäd are putting new tires on the truck because your Browning has torn them up.  You clamber up and into a sumptuous small office.  The door shuts behind you, and you wait a split second for your eyes to adjust.  Inside it is like something out of an old pre-Collapse magazine. On some small level, when perched on a shitter and leafing through the faded pages, you’d convinced yourself that those photos were fantasies and fakes. But the interior of the back of this truck cab is all clean white leather, glossy polished wood, and black electronics.  There are no spliced wires, jury-rigged equipment, or bolted-on extras. Everything in the interior screams newly manufactured. And the air. It’s crisp, cold, and doesn’t burn with pre-Collapse irritants. The filters in here have to be brand new, not salvaged or refurbished. This all has to be from one of the city enclaves, you think. Because no one makes stuff anymore. Or maybe things are turning around somewhere on the continent and this truck has been manufactured, not reclaimed.  You remain standing, suddenly hyperaware that bucket seats like the ones around the table back here don’t get sat on by dusty road agents like yourself. But the man sitting on the other side, framed by a pair of flickering flat screens showing long lists of data and charts, waves a hand for you to sit.  So you sit.  “I think I know who you are,” you say, a little tentatively.  The man, brown hair thinning at the top and showing some gray, his blue eyes slightly faded with time or sun, nods back at you. “We have met.”  “You’re the gold trader. From the Toledo Bazaar. Armand.”  You remember that he’d been overly interested in you when you’d come in to trade gold for solar equipment. At the time you’d written it off as him perving out. You’d stepped back to let Miko handle the weighing of the jewelry, confiscated from various folk attempting to run the toll road without paying.  “I am Armand.” The gold trader does still seem interested in you, but he isn’t leering. He looks concerned when he leans forward across the table.  “So what’s all this about?” you ask.  “Someone is trying to kill you.” The truck lurches into motion. You stand up, fear and anger stumbling over themselves as you grab the door handle. It’s locked, of course.  “What the fuck are you doing?” You reach for the knife in your boot, something that the Hauz Shäd goons didn’t bother to pat you down for. Maybe because they didn’t think a woman would have one, or maybe they didn’t care. That seemed more likely.  “As I said: someone is trying to kill you,” the gold trader says, looking at the knife in your hand but not looking alarmed. “I’m rescuing you before they do.”  “Didn’t ask to be rescued.” You twitch the knife at him. “Take care of myself well enough, thanks.”  “But you actually did ask me,” the man says. He slides the photo, the one that the Shäd had showed everyone on their knees in the line, across the table.  “I don’t—” you start to say.  “You did ask me to rescue you. The you that I’m staring at right now.”  You stare at the photo. “Nothing you just said makes any sense to me.”  “I know.” He taps a command out on the nearest screen. Readouts that you don’t understand flicker on, replacing the text. Bars representing power levels. Complex math scrolls across other screens. Hieroglyphs you don’t understand.  “This will feel weird,” he says, and slides his finger up one of the screens.  The world outside the windows inverts. Not upside down, but inside out. It’s an impossibility that causes your stomach to lurch and your mind to scream as reality, for the briefest moment, ceases to make sense.  A loud explosion rocks the trailer behind the cab. The truck shudders to a stop. Smoke trickles in through the office. This could have been something Miko did, now that the trucks are all far enough away that the clusters are safely running off with the panels.  When you grab the door, it thankfully opens. “Go!” Armand shouts, choking on the smoke.  You stagger down out onto the road, coughing and then retching.  You take a last shuddering breath and straighten up, frowning. The road you puked all over is a seamless expanse of newly poured asphalt. It’s faded, the lines are patchy, but there are no major potholes. Or, there were places that had been potholes, but were filled in.  The truck has pulled over to the side of the highway, onto a gravelly shoulder. There’s smoke pouring out of the trailer and Shäd are running around, likely trying to stop the fire.  But you hardly pay attention to that. You’re staring down the highway, where a car is screaming down toward the group at high speed.  Shit, shit, shit you think. You’re all under attack.  But no one pays it any attention.  It whips past, the wind shoving at you, and then with a whine it’s gone.  Armand the gold trader is watching you closely. “What else do you notice?” he asks, smiling slightly.  “The air is filtered,” you say.  But that doesn’t make any sense.  You turn and spot the green. Some kind of short plant covers the dirt, miles and miles of it. You think back to books and magazines you’ve scavenged in the past.  “Soybean?”  “Genetically modified to handle these levels of carbon and a variety of pollutants, yes,” Armand says.  “Did we travel back in time?” you ask, trembling and thinking back to the moment the world outside the cab’s windows inverted. About half of Cheetah cluster can’t read, but you’ve pored over moldy, yellowing pre-Collapse novels. They’re not as valuable as the textbooks, encyclopedias, and practical nonfiction that are near currency, but you’ve read some freaky shit and this is the first thing your mind throws up as a possibility.  The wind is cool on your exposed skin. You all wear leathers, but that’s for protection against falls and the acid rain if you get caught outside. You’re always sweating in them. The cool wind makes you want to strip down and let it play across your skin.  The gold trader smiles. “Well, the air is more breathable here. It’s like the air where you were eighty years ago. But it’s not time travel. It’s a middle RCP world.”  “What?”  Armand’s faded blue eyes tighten. “RCP: representative concentration pathways. It’s a name given to scenarios given to how much greenhouse gas is dumped into the atmosphere. This world right here, it never hit the Collapse. Every world has a different value, based on how they handled things.”  You look around the fields, the smooth highway, and look up at the blue sky. No haze. No impending thunderstorms. A low RCP world. No, middle, he had said. You can’t imagine anything nicer than this. It looks so glossy and early-2000s. “You’re like the fucking ghost of What Christmas Could Have Been.”  Now you have a faint suspicion of how he could just give away a trailer of solar panels without blinking. This place you’re standing in, whatever it is, is a rich paradise compared to the dust bowl of the midlands.  You’re half-convinced he drugged you and and took you to some sort of promised land, but there are no gaps in your memory. Some of the outriders talk about Edens like this. But they’re usually under a dome of some sort. A green, air-filtered paradise in a dust-pocked hellhole of algae farmers and people running around with respirators.  And lots of perimeter security.  Or sometimes they’re rumored to be built deep underground, the light all artificial.  Some of the eggheads predict that eventually humanity will just . . . fade away. The heavy amounts of carbon our forefathers dumped into the air had long since hit greenhouse runaway. The heat being trapped causes more clouds to build up, which in turn causes more heat. Eventually we won’t be able to breathe outside. We’ll go full Venus.  Maybe after that, it will just be assholes in domes, and everyone outside dead.  But all this is no dome. Not this big. And you are definitely not underground. You’re outside.  Another car rushes down the freaking highway like it’s no big deal. One of the Shäd approaches Armand. “It was one of the capacitors. We have enough spare for the next incursion but we should really hit up the depot on the other side, or make the trip to a depot here.”  “Oxygen?” Armand asks, his face twitching with annoyance.  “Enough to pass through.”  “Let’s do it. We’re on a tight schedule.”  You’ve taken several steps away from the quick meeting. Armand notices and focuses his attention back on you, switching back from a commanding presence to something softer. You instinctively feel defensive. Manipulated.  He smiles at you. “This is going to be a lot to take in, but we don’t have much time and there is a great deal at stake. I know you can absorb this all quickly. I’ve seen you do it before.”  Phrases like that, his familiarity with you, are starting to fuck with your head. “Talk,” you say, and jut your chin forward a bit. He can play all friendly, but you have an invisible wall up.  Good God this air is fresh and sweet. You could almost drink it.  “If I know you, and we go way back, you and us, you’ve gotten your hands on anything you can read. Even in that shitty dust bowl we were just in. That was a universe, right next to this one that we’re in right now.”  It’s the sort of thing you talk about to a buddy, lying on the hood of a truck and pushing cannabis through a respirator while staring up at the stars. Imagining that this universe is inside of an atom inside of a cell of a blade of grass inside another universe and on and on. It’s great stuff when you’re high. The idea that a better, different universe could be an impossible razor’s width away if you could vibrate over there in just the right way.  But Armand is trying to pitch that it’s real. That he’s taken you over into an alternate reality. An alternate history. And looking at the rolling fields of farmland, growing crops, you think it has to be true.  You listen to his explanation and ask, “And you cross over with a truck and trailer?”  “Self-contained mobile operations center,” he says.  And you’re going to ask why it needs to be mobile when gunfire rips through the Shäd milling about the edge of the road. The fearsome mercenaries are taken completely by surprise as ashen-faced Cheetah cluster warriors advance from underneath the trailer and wherever else they’d been hiding.  This isn’t the first shipment Cheetah cluster has slipped aboard to fuck up later. Revenge, hijacking, or otherwise.  Shäd fall, shot in the back, and others are tossed from the top of the one trailer behind the massive truck, bodies limp. Armand spins around to take in the ambush, and you take the moment to slip behind him, press a knife against his throat.  “Jesus Christ, Che, this is not a good time,” he whines.  Miko jumps down from between the trailer and cab, road dust caking his road leathers. He raises a hand in greeting as you shove Armand forward.  “Where the fuck are we?” he asks. “And what’s wrong with the air?”  For a moment, you think about it. Would any of what Armand said make sense to a man like Miko? He only sees what is right in front of him. Profit now means good living now.  You need to find out more about what’s going on before you can try managing upwards. “Let’s get into the trailer.”  Miko smiles. “See the salvage?”  There might not be any. Not if there’s some universe-crossing engine there.  But you can’t imagine that someone would be packing Shäd and crossing worlds with a long trailer hauled behind them if they were just coming to pick you up. There’s got to be something else going on. You want to see for yourself.  You prod Armand’s throat with the knife enough to draw blood when you reach the rear of the trailer, eyeing the thick doors and the security keypad down at the bottom of the door. “Time to open up.”  “This is a huge mistake,” Armand says. “We need to be moving along.”  His voice cracks slightly, so you believe he’s nervous about something. Whether it’s about what you and Miko are going to see in a second or something else, you’re not sure.  “Open up, or we slit your throat. Then we leave you here and take the truck anyway,” Miko says.  Armand swallows nervously. “Che, you know this is a bad idea. Kill me, and you’re stuck here.”  “Stop calling me Che,” you tell him. “That’s not my name. It’s Chenra.”  “You usually like being called Che, it’s something of a joke for you,” Armand says.  You don’t see you and Armand being buddies, no matter what world or alternate reality you were ever both in. “Open up or maybe I take my chances being stuck here. I like the air,” you hiss at him.  It’s not a lie. Armand can hear that in your voice.  He taps out a code, simple numbers that you memorize, and the doors slowly fall open toward the ground to make a ramp. Miko moves in ahead, pistol in the air and his road leathers creaking slightly as he walks carefully into the dimness of the trailer. You follow, pushing Armand ahead of you.  Your eyes adjust. To the front of the trailer there’s machinery. Pipes and wiring. Shit-tons of wiring. Readouts glowing in the dark. A pair of Shäd are waiting, weapons aimed right at you. But Armand shakes his head at them, despite the knife you’re keeping by his throat.  This is apparently not a place he wants gunfire inside. The outside must have been armored, as he hadn’t worried about using the trailer as a lure for an initial attack. But inside . . .  “Drop them and kick them over,” Miko shouts.  They do so, and walk out, leaving the three of you alone.  All along the walls leading to the engine are storage lockers.  You recognize the glint of precious metals piled in plastic bins. So does Miko. He’s laughing happily, kicking the cage doors open and shaking the bins. “Fucking mother lode,” he says. No one in the countryside gives a shit about gold and diamonds. Gold doesn’t give you power from the sun, doesn’t feed you, doesn’t crack out the pollutants from the air. But the traders like Armand in the cities are always looking for it. In exchange they’ll give out solar panels or batteries, even food.  Miko stops in front of cage with old, yellowing paintings. “What’s this? These fat-faced people in black clothes.”  “Nothing,” Armand says from between clenched teeth.  “No.” You recognize one of the stacked paintings. “That’s a Rembrandt.”  Miko takes a closer look at the yellow and black hues. “This is bunker shit.” He turns back to you and Armand. “You have contact with bunkers?”  The greed makes Miko’s face twitch. Dome folk, they know they need perimeter security. Bunker folk tend to get lazy. Think that being underground and hidden makes them safe. Ready for runaway atmosphere with their scrubbers and technology.  But even now they’re already having to trade for essentials. Turns out trying to build a balanced ecosystem is a bitch in close quarters.  “I can’t give away client locations,” Armand mutters.  “Oh, but you will. Eventually,” Miko says with a small hint of glee in his voice. The clusters are going to be fat with spoils, and he can taste a new, bountiful future. One that isn’t scraps from the old roads.  “You can be much richer, much better off, than that,” Armand says to you, almost begs of you. “Think smarter. I told you where we are. He’s still thinking of what is important to your world.”  Sure, you think. But if this stuff wasn’t important to these worlds, why is Armand taking it from yours? The paintings must be valuable. The gold.  “Whoa,” Miko says, and Armand’s shoulders slump slightly. “What do we have here?”  The last two lockers before the complicated engine and wiring contain people. Two women and a man, shackled together to the wall and wearing gags. They’re out cold, small plastic tubes running from their arms up to a device in the wall.  “Slaves,” you say bitterly. “You’re running slaves.”  It’s a fate you avoided by joining Cheetah cluster. Why you fight hard. Because things can go grim out in the dust. The country you lived in was born on the blood of slaves so many hundred years ago before the golden age. After the Collapse, it had turned, ever so easily you think, right back to it.  “These are famous people in the other timelines,” Armand says quickly. “People pay a literal fortune to have a personal servant who is also the president. Only the mega-rich can afford it. These are not slaves, they’ll be given more than they can imagine. They’ll come around. They always do, when they see the higher RCP worlds. Better to be a servant in paradise than a ruler in a hell like yours.”  “What are you talking about? What’s an RCP?” Miko shouts back at you. He’s standing in front of the bulk of the machinery, gun in hand, not sure what to make of all the wires and readouts. He’s fixed a lot of engines in his time, but this is like showing an electric motor in the wheel-hubs of his pickup to a monkey.  “Was that going to be my fate?” you ask. You aren’t able to take your eyes off the bodies behind the doors.  Armand’s eyes widen. “No, I swear it.”  He’s holding something back. You can smell it. Armand twists away from you and you sneer at him. “Is that what it is? Am I someone famous on the other side?”  “It’s more complicated than that,” he whimpers, seeing the rage take light in your eyes. You can’t hold it back; you want to gut him and watch him bleed out.  Miko senses this; he’s been the on blunt end of your anger before. He grins and slides up behind Armand, his dirty leathers a brown-stained contrast to Armand’s tailored black suit and shiny shoes. “I’ll kill him slow for you,” Miko whispers.  He’s just messing with Armand. Miko will fight, but only fair. He’s a soldier, not a murderer. But he’s ridden with you long enough, commanded you long enough, that he can read you. In that brief moment, your long list of ways Miko can annoy you fades: the innuendo, the grabby hands, the little gifts after raids. You know he wants you, over any of the other warren-girls who would throw themselves at a commander. He thinks it would be hot to fuck the gunner, and he’s been obsessed with that for nearly three months.  “You’re a genius,” Armand babbles. “You’re a genius.”  Miko makes a face. You think he’s being a little bit of an asshole. But you essentially agree. You’re a good gunner, but you’re no genius.  But you feel like, thanks to Miko being a bit murdery, that something may have been dislodged from Armand’s slimy mouth. “A genius?”  “On one of the other sides, a little further down the line,” Armand says. “I don’t just transport servants. Or priceless art, cultural artifacts. I also move priceless minds. Think about it: there are minds that are brilliant but trapped by the circumstances of their timelines. They’re handicapped from the moment of birth, no matter how great they become in one of the stronger worlds, because somewhere like yours they’re fighting just to breathe. They don’t have time for their greatest inventions, or to achieve their great works. So we rescue them to bring them over.”  “Yo, commander, we got problems,” one of the Cheetah cluster outriders shouted from the ramp. You squint. It’s Binni. “They got cars with lights on them pulling up and they got guns.”  Armand looked past my shoulder to the outrider. “Don’t shoot back!”  “Don’t worry trader, we got it. We’ll push them back.” Binni grins.  “That isn’t . . . they have resources here,” Armand grits out.  The familiar crack of gunfire fills the air outside. Everyone crouches and moves to the doors. It’s there you see the cars, like something from old glossy pages. Smartly painted vehicles, livery matching the official black uniforms the enforcers are wearing.  These are . . . police. Like internal security, but for keeping law and order on a scale that seemed like a fairy-tale when you read about them.  They’re not hardened soldiers but civilian peacekeepers, crouched behind their vehicles as Cheetah keeps them at bay. Binni is right. “Those uniforms can’t match Cheetah,” you say to Miko as you jump down and get Armand to shut the doors.  “Yeah.” Miko agrees, but he’s looking more and more pained. All of the things that don’t make sense are starting to get to him, you can see. “Who the fuck are they?”  “They’re called police,” you tell him.  Miko’s looking around, more now than before.  Armand all but tries to shove the two of you up toward the cab. “We can’t stay. It won’t be safe. There are rules to all this.”  “Shut up.” Miko cracks the side of Armand’s head with the back of his metal-studded leather gloves.  Armand staggers, blood dripping down onto his immaculate suit.  “Look,” you say to Miko, pointing at the sky.  An aircraft is banking over the farmland toward the road. The blades blur through the air and a distinct whump reaches you.  Miko’s attention is fixated on the helicopter, as is yours.  No one has had the spare fuel to launch aircraft in your memory. Batteries don’t keep them up for long enough.  Then a second and third helicopter join in.  Further above, you suddenly realize the long stringy lines of clouds are aircraft, jets high up in the sky, and you can’t help but stare.  Armand slams the door to the cab shut.  “Shit.” You and Miko jump onto the side of the cab. Miko puts his gun up to the glass of the cab. “Open the fuck up or I start shooting.”  Armand ignores you both, tapping at his screens. The trailer hums as the massive device buried in its front half kicks on. Miko steps back and fires. The glass doesn’t crack, and pieces of the bullet ricochet, clipping him on the shoulder.  You ignore all the shouting from further back. “Miko, don’t get off the truck.”  He glances over at you. “What?”  You lean back to shout the same warning at Cheetahs scattered around the trailer and road, along with their Shäd prisoners and dead.  Before the words are even formed, the world turns inside out.  You know to expect the sick feeling in the pit of your stomach that causes you to lean away from your grip on the door handle and think about vomiting. But you hold it in. You have to.  But now that you’ve handled that, a searing stinging in your eyes blears your vision. You didn’t expect the crawling pain on your exposed skin, and the thick muddy clouds all around you. Wind whips murky clouds around overhead.  The world around you is hell. From the choking heat to swirling, searing moisture.  And you can’t inhale the air. You realize that the moment you’re exposed. You’re holding that last breath of sweet air from the other world, or universe, as Miko stares at you in complete and utter horror. He’s choking.  You take a moment to orient yourself, squinting and blinking, then scuttle along the side of the cab. All Armand has to do wrench the steering wheel to slew the truck about and you’ll fly off the side. You dig your shoes into the lip under the doors and reach for any purchase on the side.  Then you swing around behind the extended area of the cab and fall onto the dead Shäd wedged in the hoses between the trailer and cab. You rip the facemask from the body and take a deep breath. Miko’s boots strike metal behind you.  You take a last deep huff of bottled air and pass the mask over.  Vomit streams from Miko’s chin and he fumbles for the mask, unable to see anything with reddened eyes. He breathes from the mask as you wait for your turn.  When you get it, the sour smell triggers a second round of stomach clenching.  You pass the mask back and forth as the truck grinds its way over a dirt road for an hour. Sometimes you think you see structures, tall and lurking in the distance. But their edges are shattered, and many of them are slumping over. You might be passing through the edges of a city. In your world there isn’t anything here for another couple hours, but this is a dramatically different reality.  The storm you were dropped into subsides. Maybe it’s the buildings blocking the wind, or maybe it blew itself out. You’re no longer getting pelted with small pebbles. The ochre clouds overhead still scud by impossibly fast.  Miko’s eyes are wide. You’re not going to be able to explain science fiction ideas about variant universes overlapping each other while passing a mask back and forth. He looks weak. He inhaled too much of this soupy shit. And the heat is going to drop both of you soon.  This, you think, is a high RCP world. This is what your world will look like at some point. Hothouse runaway, the heat-trapping clouds overhead creating more heat as the whole ecosystem cycled toward something sinister and hellish. Only here they got to it sooner. They burned more fossil fuel and burned it faster, dumped heat into the atmosphere faster. Got here well before you.  And in the other world you were just in, they didn’t. Their ancestors somehow restrained themselves.  What did that look like? That restraint?  Could you have done it? Miko? No. He only thought about his next meal, his next fuck, his next raid.  Miko retches hard, his eyes bugging as he cries tears of blood. You give him the mask, even though you’re faint yourself. There’s dark blood all over his shoulders from the bullet fragments rebounding when he shot the armored glass.  How long will it take for Armand to get to the next jump? He seems to be driving with purpose, trying to find a distinct spot.  Will Miko even make it?  You rummage around the Shäd’s body, looking for the bottle of air the mask is connected to. It’s dangling by his hip. The gauge is at half.  If the man had a full tank when you jumped, and had enough air to be safe during a transit, then you and Miko are going to suck through it before you’re halfway across this side. Right?  Miko shoves the mask at you and tries to lean closer. “I’m sorry,” he rasps.  “Save your damn breath,” you tell him.  “I shouldn’t have let you go with him,” Miko struggles to say, trying to push the mask back at you and turning his face away from it when you give it back to him. He takes a shuddering gasp of the hellish, hot air.  “No!” You try to force the mask over his face and he weakly grabs at your forearm to try and stop you.  The truck and trailer judder to a sudden stop.  You snap your head around, then take a few deep hits from the mask and move around Miko to look down the length of the cab.  There are shadowy forms lurking in the brown mist. Armand hits the lights, and you see that a crowd of a hundred or so people in the middle of the dirt road. They are on the other side of barriers made of pitted concrete and rusted rebar.  They’re all wearing tattered rubber ponchos, faces obscured by gas masks. Many of them are carrying crude guns, others are holding spears or bottles of fluid with rags hanging from the tops.  Armand must not have any Shäd in the cab to drive, as he spends a long set of moments lurching the trailer and truck into reverse and trying to correct the trailer from sliding to the side. But he stops again, and you see that barriers have been rolled across the road. Sharp rebar is pounded into the ground to hem the truck in.  You recognize the tactic. You’ve been the one pushing barriers across a road before.  Miko has slumped over and pushed the mask away. You take a few pulls from it, and try to get it back on his face. But he’s not responding.  Figures surround the truck, surging through the muck floating over the ground. You’re trying to pull Miko down when they grab you and pull you forward. The large crowd parts as a figure walks confidently to the front of the truck with a massive rocket launcher over one shoulder.  The person stops and pulls their mask away from their face to shout up at the driver’s side window.  “Armand: get the fuck out of the truck or I’ll fire this right at the window.”  You stare.  The face. There’s a long scar across the cheek to the nose. The hair is shaved down except for a slight tuft near the front. It looks older, more weathered.  But damn it, it’s your face.  “Hello sister,” the woman holding the rocket launcher says, never taking her eyes off the truck. “I’ll talk to you in a few. I’m in the middle of something with that rat-bastard up behind the wheel.”  You open your mouth to talk, but one of the poncho-wearing warriors to your side jams a mask over your face. You breathe the clean air in deeply and gratefully, then let them lead you around to the back of the truck.  There’s a gun pointed at you, and they force you to sit near Miko. He’s not moving, but they’ve pulled the Shäd mask on over his face so he can breathe. If he’s still alive.  Four peel off and pull out what look like jury-rigged explosives that they start taping onto the doors.  You peel the borrowed mask away. “Hey! You don’t have to do that.”  They pause and stare back at you, bug-eyed in the gas masks and startled at the interruption.  “I know the code,” you tell them.  They look at each other, then shrug. Four guns are trained on you as you stand up and slowly walk over. You punch in the combination you memorized when watching Armand, and the door slides down to become a ramp once again.  They swarm in, weapons up, to secure the back.  You hold onto Miko and watch them break open the cages. Miko would be devastated: all that loot’s going to end up in the hands of these raiders.  Raiders run by someone with your face.  Another universe. High RCP, you tell yourself. You’re in something like shock. Is it the air?  Your self-labeled “sister” arrives, pushing Armand in front of her. He’s holding his breath, eyes wide and blood running down his temple. You’re not sure who’s having a worse day: you or him.  You get waved up the ramp, along with Armand. Someone helps you pull Miko up into the trailer, and the door shuts behind you. Air pumps run for a second, and then everyone starts removing their masks.  This other version of you, clearly the leader here, clearly in control of this strange situation, looks you up and down and doesn’t seem to come to any sort of conclusion one way or another. “I call myself Che. It’s a little bit of a joke, if you read history.”  “I’m Chenra. Full Chenra.”  “Good for you.” She is unimpressed. “Armand explain the smuggling he does?”  “Some of my people rode the trailer, ended up in another world, tried to take the truck,” you tell her, not answering her question but trying to explain who you are. And why Armand is your enemy. Can you make friends with yourself if you both hate Armand? “We didn’t really understand what was happening, and he took the moment to jump us over here. We didn’t have bottled air.”  Your doppelgänger looks down at Miko and nods, a riddle solved. “He’s in a bad way. How long did he inhale the soup?”  “Long enough. Has something in his shoulder from trying to shoot the window.” You nod at the art and valuables being dragged out toward the back of the trailer. “That all yours now? I’m not trying to lay claim to it or get in your way.”  “What do you think, Armand? Should I keep all this shit?” Che kicks your captor, who is lying on the floor, spitting bile. He wipes his chin with a dirty suit sleeve and glares at her. “He tell you how special you were?”  You lock eyes with yourself and shiver slightly. “Yeah. He said I was a genius.”  “It’s not all bullshit.” Che pokes Miko with the tip of her boot. “You want to try and get him home to your own universe, to help him, right?”  You nod. No sense in trying to lie to yourself, right?  “You two screwing? I’ve never seen him before,” she says. “Not really our type, is he?”  “No. But he’s part of my cluster. I owe him.” Cheetah cluster for life, right?  “What’s your world like? High or low RCP?”  “I think it’s high?” you say. “It’s not as bad as this, but it wasn’t nice like the last place. The air was good. No storms, or heavy wind. Clear. You could see—”  “A nine or so is considered high, two or three is utopia,” Che interrupts. “That’s where you get all your horrible shit under control and can keep a living world. The eggheads tag all the worlds we can access with various RCP levels. The nerds used to think the points of divergence would all be about national borders and great people. Like, suppose Hitler lived, or the Soviet Union collapsed. Shit like that. But the looming threat, the thread that runs through all these realities that makes the big changes that people like you and I give a shit about, is simply how the atmosphere and oceans were managed. Usually there’s an accord. Paris, DC, they try to imitate the same thing they use to stop acid rain. Caps and trades. But sometimes they never even get to that point. Right now, this variation we’re in, it’s one of the worst scenarios.”  You think about all the cool, breathable air in the world just before this one. “Then I’m in definitely in a higher RCP world. People are scared of the runaway effect. A lot of people are bunkering underground, or in domes. I use a respirator outside. We’re not using fuel anymore. It all got used up in the Collapse.”  “Sounds like a shithole. But, you’re a sister me. If you feel you need to go back, I can get you some weapons. You can try to find another Armand going the other way. But trips like that are fairly infrequent. I’ve been waiting to trap Armand here for almost a month.”  “Can’t you take me?” you ask. If she is doing favors and all. You feel somewhat paralyzed, because this is a situation so far outside of normal—how can you make a decision? This familiar face, however, knows more than you. You feel an instant desire for her help, her guidance.  Che shakes her head. “This truck’s got one more jump in her, and we’re going somewhere specific. And you can’t take your buddy back there if you want him to live. You need to go forward.”  “To a better world?” You’re starting to get the hang of this. “Lower RCP?”  “The lowest,” Che says. “You talk about bunkers and domes. This whole area was a massive dome, once. This world ate itself alive. Kept putting leaders up that focused on chewing through resources, promising jobs over stewardship. And when the carbon from burning things filled the oceans, the pH meant huge die-offs. One collapse led to another.”  “Sounds familiar,” you mutter. And you think of that cool breeze on your skin and shiver. Something inside you almost aches when you consider trying to get back to what is familiar.  “But this world had resources, scientists working on keeping them alive as the air soured. When they cracked the veil between worlds they found a garden world. An Eden. They built massive complexes to shuttle people over, thinking no one was on the other side. But they made a mistake. There were people, and those gardens were maintained carefully by people who had spent generations on wilding projects.”  Che pulls out that same picture that the Shäd showed you. It’s the clean, flattened-hair version of you, wearing a suit similar to Armand’s. Che taps it.  “Which version of us is that?” you ask.  “This picture is a sister of ours that led her people from this high RCP world we’re in right now to the garden world,” Che says. “I killed her. That was my job. The garden world was my world, before I came over here to hide. It’s where the invaders would never think to look for me. They think those of us from the garden world are soft.”  But this sister of yours doesn’t look soft, despite growing up in an Edenic world. She looks forged. Just like you have been. And even the sister in the picture looks forged. The leader of an invasion force that had to leave their dying world, or die themselves. Making hard choices.  “Those invaders to my world are the ones paying Armand anything he wants in order to get one of us, sister,” Che says to you. “It’s so that they can string us up in public for their people and have a good show as they execute us. Bread and circuses.”  “Not true,” Armand hisses. “The people I work for, they would take you in for training. They want insight, they need help to run the fight against these terrorists who have attacked us. They want to tap your genius.”  Che shakes her head. “He’s lying.”  “And in exchange for your insight into fighting your terrorist double, they would make you richer than you could imagine,” Armand says. “Join her, and you will be the enemy. An insurgent. On a list of enemies against humanity. And not just in the world she wants to go to, but any world that has trade with my people.”  “No matter where he is born, he is always trash,” Che says, and throws him into one of the cages. She locks it after him.  You stare at Armand for a long moment. “These better worlds. They can help Miko?”  “Yes.”  “If I don’t go to Armand’s people, I’ll be hunted. Because of something you did.”  Che nods. “You’ll be a criminal. A terrorist.”  I look over at the three raiders who are done piling the goods up against the back of the trailer. “Why are you going over, now? What are you doing with all that?”  You’re imagining that she’ll tell you something about funding a revolution. How her people on the other side, invaded by the people from this world, need those things to fight their fight.  Che smiles. “They left so many here to keep suffering, once they got across, because the energy required to pierce through is nearly unimaginable. Each of those smuggler’s trucks requires shareholders, backers, venture capital. Cross-world travel is rare. So I’m taking as many as I can get over. Count yourself lucky there’s a spot for you.”  You think about the treasures Armand has hoarded. They’re all priceless things that the insanely rich obsess over. Portable cultural artifacts.  “I’ll cross with you,” you say, your voice breaking slightly as you realize this likely means you won’t ever see your world again. But then, you’ve left it all behind before. Running across the desert in your bare feet, your hands covered in blood and hair hacked off, those manacles burning the skin of your wrists.  Five hundred miles away, your feet bloody, Cheetah cluster took you in and away.  Che pulls her mask back on, and you follow suit. The back door slides back down into a ramp, and there are hundreds of forms waiting in the dark brown mist. Children.  People roughly shove the priceless art and precious metals off the back of the trailer onto the rocky ground.  Armand shouts from inside his cage, but the anger turns to coughing as the hot, acidic air roils into the trailer.  You’ve always gone forward.  This is the first time you’ve known what you’re heading toward. An Edenic world without climate collapse. A world where invaders are fighting the people who lived there before them. Invaders who abandoned millions of their own to a dead world.  These starving refugees are packed into the back of the trailer or strapped onto the top with bottles of air. They are all taking the risk of death, or worse, when you all break through to that other universe. Che has been driving for several hours, hoping to get as far from core invader territory as she can, but air will be running out soon and a decision to jump over has to be made shortly or people will start dying.  You sit next to Che, shoved up together near the controls. Miko is by your feet. Refugees cram in everywhere inside the cab, some of them controlling the computer that Armand had, others just packed in to make the crossing. You’d watched the pile of pictures and all that glittered fall away behind the trailer in the mirrors. The old canvases curled up in the harsh air as you slid away. Acid rain began to drizzle on them.  “There are many more, on many different worlds, that need help,” Che had said. “Even though their brothers invaded mine, I couldn’t leave them back there to slowly choke to death. It wasn’t their fault, it was their forefathers who did this to them.”  You’re never going to be a gunner again, chasing after convoys.  “Will it make a difference, a couple hundred?” I asked.  “We’re just getting started,” Che said. “I can save more.”  But you wonder what all these new bodies will do to that Edenic new world? Will these descendants of a people who destroyed an entire world be able to make a change? Or would they understand how to treasure it, knowing how precious it was?  The world flips inside out and you gasp.  When your vision comes back to you, you look up to see a forest choking the dirt road around the truck.  People rip off their masks as Che rolls the windows down. There are flowers. The distant chatter of animals. Scents on the breeze that fill the cab. A gentle wind.  She’s taken you back to where this all started, geographically. But there is no toll road here. No farms. No dusty plains and electric cars with skulls and machine guns mounted on them. Just lush green and lungfuls of sweet air.  “Are you okay?” Che asks.  You wipe the tear from your cheek.  “This is what it could have been, where I come from,” you whisper. “We could have done it.”  Che stops the truck, as it’s shuddering and smoke has begun to leak out of the machinery in the front of the trailer. People are banging and shouting for her attention.  Afterwards, she climbs on the hood as people gather before her.  “I give you my world,” she says. “I ask only that you care for it as you would your child. Do that, and it will care for you as well. Now go.”  The two of you sit for a while later near Miko.  “I’m sorry,” she says. “I hoped he would make it. We could have helped.”  You shake your head. “I’ve seen worse deaths.” It was no worse a death than clashing with duty-evaders on a toll road. He had never understood what was actually happening though, and you feel bad about that.  When you stand, after burying him under the cool shade of a magnificent pine tree that makes you almost weep again, you move to Che’s side.  “Take me with you.”  “I don’t know what my next move is. I snuck over to their world to see what it was like and hide from her death squads. I didn’t really believe them when they said it was so bad. I didn’t know so many were suffering. Armand and his ilk, they get financing to go and fetch the greatest minds from the remains of high RCP worlds. Or get ‘servants’ of famous people. But these are regular folk that needed saving, that no one wants. They deserve to live.”  You nod.  You’ve been watching this version of yourself. And you’ve learned something. This isn’t a confident, dangerous you like you first assumed when you saw her with the rocket launcher. No, this is a version of you that cares deeply. She put herself in front of the truck because she felt strongly.  She didn’t know what would come next when she rescued these people. She just did it.  This version of you isn’t calculating.  This version of you isn’t looking for the next move.  This version of you came from ancestors who managed a planet successfully, not like your own failed ones.  You’ve been taught to take, to be strong, to run with a strong pack. Miko has taught you well. Having studied this Che for hours, you know you could break her. She hasn’t spent a lifetime in the hot sand.  But the forests.  Her people let that be. And that is a different lesson. You need to follow her people. You need to help them protect what they’ve built.  And what you know, and have learned for an entire life, is survival. How to create fighters.  “You need to grow your army,” you say to Che. “You need to bring more people over. More refugees from the other worlds. We can find more Armands to trade with, right, if there are many worlds and many copies of us in them?”  Che nods at you. “More death.”  You smile crookedly. “And maybe more life. I think we bring things over to the other places that help them. And then we bring fighters, loyal fighters, from there to here. We can do this better. I can show you how to finish what you’ve started. Let me help you.”  “It’ll be dangerous.” Che raises an eyebrow.  You know. But you know danger better than she does. All you’ve lived is danger.  Besides, is it better to be a king of a sandy hell, or a servant in a lush paradise? Her people had created something so special, you know that being one of their soldiers is the way to climb. You can taste ambition again.  This, you think as you move through sun-dappled forest, is a world to die for.  A world to fight for. Called \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.  His Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"  He currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs.", "text": "9730 words, novelette\nA World to Die For\nYour hunting party of repurposed, cobbled together and barely-repaired pre-Collapse electric vehicles sweeps across the alkaline rich dust flats of old farm land. The outriders are kicking up rooster tails of dust into the air behind them, their bikes scudding over the dirt and slamming hard into every divot and furrow. Pennants whip about in the air.\nYou’re glad to be on the top of a pickup with suspension, ass in a sling, feet shoved hard against the baseplate of the machine gun mounted right up against the back of the cab. You’ve been an outrider before, trying to balance a shotgun on the handlebars of the bike without wiping out. You didn’t like it.\nThe outriders might get more respect, but there’s a reason they wear all those heavy leathers, padding, faded old football helmets, and other chunks of scavenged gear.\n“There she is!” Miko leans out from the passenger-side door and bangs on the roof of the cab to get your attention away from the outriders and pointed front. “Get ready.”\nUp ahead, through the bitter clouds of dirt that seep around the edges of your respirator, is the black line of the old Chicago tollway. You reach forward and yank a latch on the machine gun, pulling one of the large-caliber bullets into the chamber with a satisfying ratchet sound.\nThe seventy-year-old gun has been lovingly maintained since the Collapse. It has seen action in the Sack of Indianapolis, spat fury down upon the Plains Raiders, and helped in the defense of the Appalachian Line. You look down the sights, ignoring the massive ox horns and assorted animal skulls bolted onto your truck’s hood.\nYour quarry is ahead. A convoy of trucks pulling hard for places out further East. Their large, underinflated balloon tires fill the potholes and scars of the old expressway as they trundle on at a dangerous thirty-five miles an hour. It’s axle-breaking speed, a sprint across the country in hopes that they can smash any MidWest Alliance blockades without paying import/export duties.\nFuckers. As if they could just roll across a state for free. Now they’ll pay a lot more than just a ten percent transit fee.\n“Cheetah cluster: right flank,” Miko screams over the screech of old suspension and the rumble of tires. He is still hanging out of the door, and he points and throws command signs at other drivers. He’s ripped his respirator off and left it to dangle around his neck. “Dragon cluster, left. Cougars for the front.”\nYour cluster of vehicles splits off to swing behind the convoy’s dust trail, the world turning into a fog of black dirt and amber highlights, and you fall in on the right like a vulture. Enemy outriders split off from the convoy to harass the impending clusters, but they are outnumbered. Shotguns crack through the air, people scream.\nIn moments the security around the convoy peels off, uninterested in paying for cargo with any further lives. They’ve done their paid duty—they can head back in honor to whoever hired them.\n“Do it,” Miko orders you. He pulls his respirator back on, and now he’s all green eyes and blonde hair over the edge of the cracked rubber. He’s the commander. You’ve risen far following in his footsteps. Maybe one day you’ll run a cluster, give commands to your own outriders. You’ve been tasting ambition like that, of late.\nTo survive, you need to find the right people to follow. Miko has created a strong pack. The fees you pull from what little cross-country traffic still trickles over the road keeps you all fed, the respirators fixed, and batteries in stock.\nYou lean back and pull the trigger.\nThe old Browning destroys the world with its explosive howl. You rake the tires of the trucks as Ann, the driver, moves the pickup along the convoy in an explosion of acceleration.\nAll three of the oversized vehicles shudder to a halt. Ann brings the pickup to a sliding stop, dirt and chunks of the old highway rattling up to kick the undersides of the old vehicle.\nMiko steps out, shotgun casually slung over his shoulder.\nEveryone’s expecting the drivers to come out of the truck cabs with hands up. But instead there’s a loud groan from the trailers. Miko swings the shotgun down into his hands and aims it up at the sound.\nThe sides of the middle trailer fall open and slam to the ground. Houz Shäd shock troops in their all-black armor are crouched behind sandbags and a pair of fifty-caliber machine guns.\nYou’re all dead.\nBut instead of getting ripped apart by carrot-sized bullets, one of the Shäd shouts through a loudspeaker, “We seek information from you, and only information. Drop your weapons and live. You’ll even be allowed to keep them. In fact, give us what we seek and your cluster can take the entire shipment of solar panels in trucks one and three.”\nMiko drops his shotgun.\nYou push away from the machine gun, hands in the air, wondering what happens next.\nThe Shäd jump down from the trailer, greatcoats flaring out behind them. Their deep-black machine guns seem to soak up the amber light. There’s a storm brewing up north, you can tell. You will all need to run before it, get down underground before the tornados touch down and begin ravaging everything.\n“Remove your ventilators,” the nearest Shäd gestures. “Kneel in a row.”\nYour mouth is dry. This is an execution line and you know it. Bullshit promises aside. People like the merchant riders of Shäd view the continent as a place they should be able to trade across. They view clusters as “raiders” and not the customs agents you know yourselves to be.\nBut instead of walking behind you, the Shäd spread out in front of the line, moving from member to member. They’re holding out photographs in their gloved hands, looking closely at each member of our cluster through mirrored visors.\nThe nearest Shäd approaches. Those ventilators they wear are not just the usual air purifiers, you realize. They’re connected to oxygen bottles on their hips. You’ve never been close enough to see that before. “We are looking for someone,” the Shäd says through his mask.\nThe fuck? All this over an MIA? People go missing in the middle countries all the time.\n“This is her picture. We have been told she may be called Chenra, or Chenray. Have you seen her?”\nYou glance left, blood going cold, because that’s your name. Miko stares at the ground and shakes his head. Ann, her long black hair tangled up in ventilator straps, shrugs. Cheetah cluster won’t rat you out.\nBut why the hell are shock troopers from Hauz Shäd hunting you? You’ve been on a few nondescript battery raids, run the outlander position on some basic convoy stops, but you’re not officer class. Just a runner and a gunner from nowhere.\nYou’d be sick from fear if you even understood any of this.\nYou’re mainly confused.\nThe toxic air is rasping at the back of your throat. The ever-present dust is making your eyes water.\nIt has to be some kind of mistake. Whoever they are truly hunting has used your name, or has a similar name, and these very dangerous private security troops ended up crossing the midlands to find you.\n“Anyone who gets us this woman can have the solar panels in the trailers here,” the man repeats, pushing the photo at you.\n“Yeah, let’s have a see,” you mutter, leaning forward on your knees.\nHe steps closer and you take a look.\nIt’s you. There’s no mistake.\nBut you know for sure you’ve never had your hair cut up above the ears like that. Or so flat.\nThe teeth are all wrong. White. Like someone has painted them. Different positions, too. Shit, do you have a long-lost twin sister or something like that? The woman in the picture does look eerily like you.\nBut it can’t be.\nA whole shipment of solar panels. If they’re telling the truth . . .\nYou stand up. “Are you serious about those solar panels?”\nA helmeted nod in response.\n“What’s your business with that woman?” You jerk your chin at the photo.\n“A client needs to talk to her.”\n“That’s it?”\n“Just a conversation.”\nYou take a deep breath. Cheetah has given you food and lodging. Given you a trade. You were thirteen when they found you trudging across a dune up in the lower peninsula of the Holy Michigan Empire. They treated you well. Better than you’d feared when you saw the motorcycles roaring across the sand toward you.\nEven if you get shot, or kidnapped, a solar shipment would help all the clusters here. And if there’s one thing you are, it’s loyal to the people who show you the way forward to a better life.\n“Then I’m Chenra, Cheetah cluster. I claim the reward of the solar panels.”\n“Che! I’ll follow you!” Miko tries to stand, but one of the Shäd casually kicks him back down with a boot to the shoulder.\n“You can’t come where we’re going,” the mercenary laughs through her respirator.\nHauz Shäd has a strong reputation for following contracts to the letter, so you’re not overly worried anyone will get screwed over here. All that crap about them eating the flesh of people they’ve killed is just rumor. Collapse jitters.\nSure enough, as you’re taken up toward the head vehicle, the trailers are being disconnected from the trucks. Several cluster members climb aboard, open the rear doors, and shout in delight. Outriders watch you go by and nod in respect.\nYou don’t see Miko anywhere. He’s a ghost when he needs to be. He’s not going to be happy about his gunner getting kidnapped.\nClusters don’t carve promises into skin and swear blood oaths to protect each other to death as a meaningless gesture. They’re planning to watch and follow you, to have your back. So you’re going to play along, see what comes of this bizarre attempt to kidnap you.\nIf you manage to get out of this and back to the clusters, they’ll all owe you big. Maybe even get you a promotion. You could end up a driver inside the shielded cockpit of an attack pickup. Maybe even get some scrip for hydroponic fruit from down near Fort Wayne.\nThe truck at the head of the convoy has an extended cab over the battery frame. The up-armored doors hiss open and the Shäd on either side of you point inside. Other Shäd are putting new tires on the truck because your Browning has torn them up.\nYou clamber up and into a sumptuous small office.\nThe door shuts behind you, and you wait a split second for your eyes to adjust.\nInside it is like something out of an old pre-Collapse magazine. On some small level, when perched on a shitter and leafing through the faded pages, you’d convinced yourself that those photos were fantasies and fakes. But the interior of the back of this truck cab is all clean white leather, glossy polished wood, and black electronics.\nThere are no spliced wires, jury-rigged equipment, or bolted-on extras. Everything in the interior screams newly manufactured. And the air. It’s crisp, cold, and doesn’t burn with pre-Collapse irritants. The filters in here have to be brand new, not salvaged or refurbished. This all has to be from one of the city enclaves, you think. Because no one makes stuff anymore. Or maybe things are turning around somewhere on the continent and this truck has been manufactured, not reclaimed.\nYou remain standing, suddenly hyperaware that bucket seats like the ones around the table back here don’t get sat on by dusty road agents like yourself. But the man sitting on the other side, framed by a pair of flickering flat screens showing long lists of data and charts, waves a hand for you to sit.\nSo you sit.\n“I think I know who you are,” you say, a little tentatively.\nThe man, brown hair thinning at the top and showing some gray, his blue eyes slightly faded with time or sun, nods back at you. “We have met.”\n“You’re the gold trader. From the Toledo Bazaar. Armand.”\nYou remember that he’d been overly interested in you when you’d come in to trade gold for solar equipment. At the time you’d written it off as him perving out. You’d stepped back to let Miko handle the weighing of the jewelry, confiscated from various folk attempting to run the toll road without paying.\n“I am Armand.” The gold trader does still seem interested in you, but he isn’t leering. He looks concerned when he leans forward across the table.\n“So what’s all this about?” you ask.\n“Someone is trying to kill you.” The truck lurches into motion. You stand up, fear and anger stumbling over themselves as you grab the door handle. It’s locked, of course.\n“What the fuck are you doing?” You reach for the knife in your boot, something that the Hauz Shäd goons didn’t bother to pat you down for. Maybe because they didn’t think a woman would have one, or maybe they didn’t care. That seemed more likely.\n“As I said: someone is trying to kill you,” the gold trader says, looking at the knife in your hand but not looking alarmed. “I’m rescuing you before they do.”\n“Didn’t ask to be rescued.” You twitch the knife at him. “Take care of myself well enough, thanks.”\n“But you actually did ask me,” the man says. He slides the photo, the one that the Shäd had showed everyone on their knees in the line, across the table.\n“I don’t—” you start to say.\n“You did ask me to rescue you. The you that I’m staring at right now.”\nYou stare at the photo. “Nothing you just said makes any sense to me.”\n“I know.” He taps a command out on the nearest screen. Readouts that you don’t understand flicker on, replacing the text. Bars representing power levels. Complex math scrolls across other screens. Hieroglyphs you don’t understand.\n“This will feel weird,” he says, and slides his finger up one of the screens.\nThe world outside the windows inverts. Not upside down, but inside out. It’s an impossibility that causes your stomach to lurch and your mind to scream as reality, for the briefest moment, ceases to make sense.\nA loud explosion rocks the trailer behind the cab. The truck shudders to a stop. Smoke trickles in through the office. This could have been something Miko did, now that the trucks are all far enough away that the clusters are safely running off with the panels.\nWhen you grab the door, it thankfully opens. “Go!” Armand shouts, choking on the smoke.\nYou stagger down out onto the road, coughing and then retching.\nYou take a last shuddering breath and straighten up, frowning. The road you puked all over is a seamless expanse of newly poured asphalt. It’s faded, the lines are patchy, but there are no major potholes. Or, there were places that had been potholes, but were filled in.\nThe truck has pulled over to the side of the highway, onto a gravelly shoulder. There’s smoke pouring out of the trailer and Shäd are running around, likely trying to stop the fire.\nBut you hardly pay attention to that. You’re staring down the highway, where a car is screaming down toward the group at high speed.\nShit, shit, shit you think. You’re all under attack.\nBut no one pays it any attention.\nIt whips past, the wind shoving at you, and then with a whine it’s gone.\nArmand the gold trader is watching you closely. “What else do you notice?” he asks, smiling slightly.\n“The air is filtered,” you say.\nBut that doesn’t make any sense.\nYou turn and spot the green. Some kind of short plant covers the dirt, miles and miles of it. You think back to books and magazines you’ve scavenged in the past.\n“Soybean?”\n“Genetically modified to handle these levels of carbon and a variety of pollutants, yes,” Armand says.\n“Did we travel back in time?” you ask, trembling and thinking back to the moment the world outside the cab’s windows inverted. About half of Cheetah cluster can’t read, but you’ve pored over moldy, yellowing pre-Collapse novels. They’re not as valuable as the textbooks, encyclopedias, and practical nonfiction that are near currency, but you’ve read some freaky shit and this is the first thing your mind throws up as a possibility.\nThe wind is cool on your exposed skin. You all wear leathers, but that’s for protection against falls and the acid rain if you get caught outside. You’re always sweating in them. The cool wind makes you want to strip down and let it play across your skin.\nThe gold trader smiles. “Well, the air is more breathable here. It’s like the air where you were eighty years ago. But it’s not time travel. It’s a middle RCP world.”\n“What?”\nArmand’s faded blue eyes tighten. “RCP: representative concentration pathways. It’s a name given to scenarios given to how much greenhouse gas is dumped into the atmosphere. This world right here, it never hit the Collapse. Every world has a different value, based on how they handled things.”\nYou look around the fields, the smooth highway, and look up at the blue sky. No haze. No impending thunderstorms. A low RCP world. No, middle, he had said. You can’t imagine anything nicer than this. It looks so glossy and early-2000s. “You’re like the fucking ghost of What Christmas Could Have Been.”\nNow you have a faint suspicion of how he could just give away a trailer of solar panels without blinking. This place you’re standing in, whatever it is, is a rich paradise compared to the dust bowl of the midlands.\nYou’re half-convinced he drugged you and and took you to some sort of promised land, but there are no gaps in your memory. Some of the outriders talk about Edens like this. But they’re usually under a dome of some sort. A green, air-filtered paradise in a dust-pocked hellhole of algae farmers and people running around with respirators.\nAnd lots of perimeter security.\nOr sometimes they’re rumored to be built deep underground, the light all artificial.\nSome of the eggheads predict that eventually humanity will just . . . fade away. The heavy amounts of carbon our forefathers dumped into the air had long since hit greenhouse runaway. The heat being trapped causes more clouds to build up, which in turn causes more heat. Eventually we won’t be able to breathe outside. We’ll go full Venus.\nMaybe after that, it will just be assholes in domes, and everyone outside dead.\nBut all this is no dome. Not this big. And you are definitely not underground. You’re outside.\nAnother car rushes down the freaking highway like it’s no big deal. One of the Shäd approaches Armand. “It was one of the capacitors. We have enough spare for the next incursion but we should really hit up the depot on the other side, or make the trip to a depot here.”\n“Oxygen?” Armand asks, his face twitching with annoyance.\n“Enough to pass through.”\n“Let’s do it. We’re on a tight schedule.”\nYou’ve taken several steps away from the quick meeting. Armand notices and focuses his attention back on you, switching back from a commanding presence to something softer. You instinctively feel defensive. Manipulated.\nHe smiles at you. “This is going to be a lot to take in, but we don’t have much time and there is a great deal at stake. I know you can absorb this all quickly. I’ve seen you do it before.”\nPhrases like that, his familiarity with you, are starting to fuck with your head. “Talk,” you say, and jut your chin forward a bit. He can play all friendly, but you have an invisible wall up.\nGood God this air is fresh and sweet. You could almost drink it.\n“If I know you, and we go way back, you and us, you’ve gotten your hands on anything you can read. Even in that shitty dust bowl we were just in. That was a universe, right next to this one that we’re in right now.”\nIt’s the sort of thing you talk about to a buddy, lying on the hood of a truck and pushing cannabis through a respirator while staring up at the stars. Imagining that this universe is inside of an atom inside of a cell of a blade of grass inside another universe and on and on. It’s great stuff when you’re high. The idea that a better, different universe could be an impossible razor’s width away if you could vibrate over there in just the right way.\nBut Armand is trying to pitch that it’s real. That he’s taken you over into an alternate reality. An alternate history. And looking at the rolling fields of farmland, growing crops, you think it has to be true.\nYou listen to his explanation and ask, “And you cross over with a truck and trailer?”\n“Self-contained mobile operations center,” he says.\nAnd you’re going to ask why it needs to be mobile when gunfire rips through the Shäd milling about the edge of the road. The fearsome mercenaries are taken completely by surprise as ashen-faced Cheetah cluster warriors advance from underneath the trailer and wherever else they’d been hiding.\nThis isn’t the first shipment Cheetah cluster has slipped aboard to fuck up later. Revenge, hijacking, or otherwise.\nShäd fall, shot in the back, and others are tossed from the top of the one trailer behind the massive truck, bodies limp. Armand spins around to take in the ambush, and you take the moment to slip behind him, press a knife against his throat.\n“Jesus Christ, Che, this is not a good time,” he whines.\nMiko jumps down from between the trailer and cab, road dust caking his road leathers. He raises a hand in greeting as you shove Armand forward.\n“Where the fuck are we?” he asks. “And what’s wrong with the air?”\nFor a moment, you think about it. Would any of what Armand said make sense to a man like Miko? He only sees what is right in front of him. Profit now means good living now.\nYou need to find out more about what’s going on before you can try managing upwards. “Let’s get into the trailer.”\nMiko smiles. “See the salvage?”\nThere might not be any. Not if there’s some universe-crossing engine there.\nBut you can’t imagine that someone would be packing Shäd and crossing worlds with a long trailer hauled behind them if they were just coming to pick you up. There’s got to be something else going on. You want to see for yourself.\nYou prod Armand’s throat with the knife enough to draw blood when you reach the rear of the trailer, eyeing the thick doors and the security keypad down at the bottom of the door. “Time to open up.”\n“This is a huge mistake,” Armand says. “We need to be moving along.”\nHis voice cracks slightly, so you believe he’s nervous about something. Whether it’s about what you and Miko are going to see in a second or something else, you’re not sure.\n“Open up, or we slit your throat. Then we leave you here and take the truck anyway,” Miko says.\nArmand swallows nervously. “Che, you know this is a bad idea. Kill me, and you’re stuck here.”\n“Stop calling me Che,” you tell him. “That’s not my name. It’s Chenra.”\n“You usually like being called Che, it’s something of a joke for you,” Armand says.\nYou don’t see you and Armand being buddies, no matter what world or alternate reality you were ever both in. “Open up or maybe I take my chances being stuck here. I like the air,” you hiss at him.\nIt’s not a lie. Armand can hear that in your voice.\nHe taps out a code, simple numbers that you memorize, and the doors slowly fall open toward the ground to make a ramp. Miko moves in ahead, pistol in the air and his road leathers creaking slightly as he walks carefully into the dimness of the trailer. You follow, pushing Armand ahead of you.\nYour eyes adjust. To the front of the trailer there’s machinery. Pipes and wiring. Shit-tons of wiring. Readouts glowing in the dark. A pair of Shäd are waiting, weapons aimed right at you. But Armand shakes his head at them, despite the knife you’re keeping by his throat.\nThis is apparently not a place he wants gunfire inside. The outside must have been armored, as he hadn’t worried about using the trailer as a lure for an initial attack. But inside . . .\n“Drop them and kick them over,” Miko shouts.\nThey do so, and walk out, leaving the three of you alone.\nAll along the walls leading to the engine are storage lockers.\nYou recognize the glint of precious metals piled in plastic bins. So does Miko. He’s laughing happily, kicking the cage doors open and shaking the bins. “Fucking mother lode,” he says. No one in the countryside gives a shit about gold and diamonds. Gold doesn’t give you power from the sun, doesn’t feed you, doesn’t crack out the pollutants from the air. But the traders like Armand in the cities are always looking for it. In exchange they’ll give out solar panels or batteries, even food.\nMiko stops in front of cage with old, yellowing paintings. “What’s this? These fat-faced people in black clothes.”\n“Nothing,” Armand says from between clenched teeth.\n“No.” You recognize one of the stacked paintings. “That’s a Rembrandt.”\nMiko takes a closer look at the yellow and black hues. “This is bunker shit.” He turns back to you and Armand. “You have contact with bunkers?”\nThe greed makes Miko’s face twitch. Dome folk, they know they need perimeter security. Bunker folk tend to get lazy. Think that being underground and hidden makes them safe. Ready for runaway atmosphere with their scrubbers and technology.\nBut even now they’re already having to trade for essentials. Turns out trying to build a balanced ecosystem is a bitch in close quarters.\n“I can’t give away client locations,” Armand mutters.\n“Oh, but you will. Eventually,” Miko says with a small hint of glee in his voice. The clusters are going to be fat with spoils, and he can taste a new, bountiful future. One that isn’t scraps from the old roads.\n“You can be much richer, much better off, than that,” Armand says to you, almost begs of you. “Think smarter. I told you where we are. He’s still thinking of what is important to your world.”\nSure, you think. But if this stuff wasn’t important to these worlds, why is Armand taking it from yours? The paintings must be valuable. The gold.\n“Whoa,” Miko says, and Armand’s shoulders slump slightly. “What do we have here?”\nThe last two lockers before the complicated engine and wiring contain people. Two women and a man, shackled together to the wall and wearing gags. They’re out cold, small plastic tubes running from their arms up to a device in the wall.\n“Slaves,” you say bitterly. “You’re running slaves.”\nIt’s a fate you avoided by joining Cheetah cluster. Why you fight hard. Because things can go grim out in the dust. The country you lived in was born on the blood of slaves so many hundred years ago before the golden age. After the Collapse, it had turned, ever so easily you think, right back to it.\n“These are famous people in the other timelines,” Armand says quickly. “People pay a literal fortune to have a personal servant who is also the president. Only the mega-rich can afford it. These are not slaves, they’ll be given more than they can imagine. They’ll come around. They always do, when they see the higher RCP worlds. Better to be a servant in paradise than a ruler in a hell like yours.”\n“What are you talking about? What’s an RCP?” Miko shouts back at you. He’s standing in front of the bulk of the machinery, gun in hand, not sure what to make of all the wires and readouts. He’s fixed a lot of engines in his time, but this is like showing an electric motor in the wheel-hubs of his pickup to a monkey.\n“Was that going to be my fate?” you ask. You aren’t able to take your eyes off the bodies behind the doors.\nArmand’s eyes widen. “No, I swear it.”\nHe’s holding something back. You can smell it. Armand twists away from you and you sneer at him. “Is that what it is? Am I someone famous on the other side?”\n“It’s more complicated than that,” he whimpers, seeing the rage take light in your eyes. You can’t hold it back; you want to gut him and watch him bleed out.\nMiko senses this; he’s been the on blunt end of your anger before. He grins and slides up behind Armand, his dirty leathers a brown-stained contrast to Armand’s tailored black suit and shiny shoes. “I’ll kill him slow for you,” Miko whispers.\nHe’s just messing with Armand. Miko will fight, but only fair. He’s a soldier, not a murderer. But he’s ridden with you long enough, commanded you long enough, that he can read you. In that brief moment, your long list of ways Miko can annoy you fades: the innuendo, the grabby hands, the little gifts after raids. You know he wants you, over any of the other warren-girls who would throw themselves at a commander. He thinks it would be hot to fuck the gunner, and he’s been obsessed with that for nearly three months.\n“You’re a genius,” Armand babbles. “You’re a genius.”\nMiko makes a face. You think he’s being a little bit of an asshole. But you essentially agree. You’re a good gunner, but you’re no genius.\nBut you feel like, thanks to Miko being a bit murdery, that something may have been dislodged from Armand’s slimy mouth. “A genius?”\n“On one of the other sides, a little further down the line,” Armand says. “I don’t just transport servants. Or priceless art, cultural artifacts. I also move priceless minds. Think about it: there are minds that are brilliant but trapped by the circumstances of their timelines. They’re handicapped from the moment of birth, no matter how great they become in one of the stronger worlds, because somewhere like yours they’re fighting just to breathe. They don’t have time for their greatest inventions, or to achieve their great works. So we rescue them to bring them over.”\n“Yo, commander, we got problems,” one of the Cheetah cluster outriders shouted from the ramp. You squint. It’s Binni. “They got cars with lights on them pulling up and they got guns.”\nArmand looked past my shoulder to the outrider. “Don’t shoot back!”\n“Don’t worry trader, we got it. We’ll push them back.” Binni grins.\n“That isn’t . . . they have resources here,” Armand grits out.\nThe familiar crack of gunfire fills the air outside. Everyone crouches and moves to the doors. It’s there you see the cars, like something from old glossy pages. Smartly painted vehicles, livery matching the official black uniforms the enforcers are wearing.\nThese are . . . police. Like internal security, but for keeping law and order on a scale that seemed like a fairy-tale when you read about them.\nThey’re not hardened soldiers but civilian peacekeepers, crouched behind their vehicles as Cheetah keeps them at bay. Binni is right. “Those uniforms can’t match Cheetah,” you say to Miko as you jump down and get Armand to shut the doors.\n“Yeah.” Miko agrees, but he’s looking more and more pained. All of the things that don’t make sense are starting to get to him, you can see. “Who the fuck are they?”\n“They’re called police,” you tell him.\nMiko’s looking around, more now than before.\nArmand all but tries to shove the two of you up toward the cab. “We can’t stay. It won’t be safe. There are rules to all this.”\n“Shut up.” Miko cracks the side of Armand’s head with the back of his metal-studded leather gloves.\nArmand staggers, blood dripping down onto his immaculate suit.\n“Look,” you say to Miko, pointing at the sky.\nAn aircraft is banking over the farmland toward the road. The blades blur through the air and a distinct whump reaches you.\nMiko’s attention is fixated on the helicopter, as is yours.\nNo one has had the spare fuel to launch aircraft in your memory. Batteries don’t keep them up for long enough.\nThen a second and third helicopter join in.\nFurther above, you suddenly realize the long stringy lines of clouds are aircraft, jets high up in the sky, and you can’t help but stare.\nArmand slams the door to the cab shut.\n“Shit.” You and Miko jump onto the side of the cab. Miko puts his gun up to the glass of the cab. “Open the fuck up or I start shooting.”\nArmand ignores you both, tapping at his screens. The trailer hums as the massive device buried in its front half kicks on. Miko steps back and fires. The glass doesn’t crack, and pieces of the bullet ricochet, clipping him on the shoulder.\nYou ignore all the shouting from further back. “Miko, don’t get off the truck.”\nHe glances over at you. “What?”\nYou lean back to shout the same warning at Cheetahs scattered around the trailer and road, along with their Shäd prisoners and dead.\nBefore the words are even formed, the world turns inside out.\nYou know to expect the sick feeling in the pit of your stomach that causes you to lean away from your grip on the door handle and think about vomiting. But you hold it in. You have to.\nBut now that you’ve handled that, a searing stinging in your eyes blears your vision. You didn’t expect the crawling pain on your exposed skin, and the thick muddy clouds all around you. Wind whips murky clouds around overhead.\nThe world around you is hell. From the choking heat to swirling, searing moisture.\nAnd you can’t inhale the air. You realize that the moment you’re exposed. You’re holding that last breath of sweet air from the other world, or universe, as Miko stares at you in complete and utter horror. He’s choking.\nYou take a moment to orient yourself, squinting and blinking, then scuttle along the side of the cab. All Armand has to do wrench the steering wheel to slew the truck about and you’ll fly off the side. You dig your shoes into the lip under the doors and reach for any purchase on the side.\nThen you swing around behind the extended area of the cab and fall onto the dead Shäd wedged in the hoses between the trailer and cab. You rip the facemask from the body and take a deep breath. Miko’s boots strike metal behind you.\nYou take a last deep huff of bottled air and pass the mask over.\nVomit streams from Miko’s chin and he fumbles for the mask, unable to see anything with reddened eyes. He breathes from the mask as you wait for your turn.\nWhen you get it, the sour smell triggers a second round of stomach clenching.\nYou pass the mask back and forth as the truck grinds its way over a dirt road for an hour. Sometimes you think you see structures, tall and lurking in the distance. But their edges are shattered, and many of them are slumping over. You might be passing through the edges of a city. In your world there isn’t anything here for another couple hours, but this is a dramatically different reality.\nThe storm you were dropped into subsides. Maybe it’s the buildings blocking the wind, or maybe it blew itself out. You’re no longer getting pelted with small pebbles. The ochre clouds overhead still scud by impossibly fast.\nMiko’s eyes are wide. You’re not going to be able to explain science fiction ideas about variant universes overlapping each other while passing a mask back and forth. He looks weak. He inhaled too much of this soupy shit. And the heat is going to drop both of you soon.\nThis, you think, is a high RCP world. This is what your world will look like at some point. Hothouse runaway, the heat-trapping clouds overhead creating more heat as the whole ecosystem cycled toward something sinister and hellish. Only here they got to it sooner. They burned more fossil fuel and burned it faster, dumped heat into the atmosphere faster. Got here well before you.\nAnd in the other world you were just in, they didn’t. Their ancestors somehow restrained themselves.\nWhat did that look like? That restraint?\nCould you have done it? Miko? No. He only thought about his next meal, his next fuck, his next raid.\nMiko retches hard, his eyes bugging as he cries tears of blood. You give him the mask, even though you’re faint yourself. There’s dark blood all over his shoulders from the bullet fragments rebounding when he shot the armored glass.\nHow long will it take for Armand to get to the next jump? He seems to be driving with purpose, trying to find a distinct spot.\nWill Miko even make it?\nYou rummage around the Shäd’s body, looking for the bottle of air the mask is connected to. It’s dangling by his hip. The gauge is at half.\nIf the man had a full tank when you jumped, and had enough air to be safe during a transit, then you and Miko are going to suck through it before you’re halfway across this side. Right?\nMiko shoves the mask at you and tries to lean closer. “I’m sorry,” he rasps.\n“Save your damn breath,” you tell him.\n“I shouldn’t have let you go with him,” Miko struggles to say, trying to push the mask back at you and turning his face away from it when you give it back to him. He takes a shuddering gasp of the hellish, hot air.\n“No!” You try to force the mask over his face and he weakly grabs at your forearm to try and stop you.\nThe truck and trailer judder to a sudden stop.\nYou snap your head around, then take a few deep hits from the mask and move around Miko to look down the length of the cab.\nThere are shadowy forms lurking in the brown mist. Armand hits the lights, and you see that a crowd of a hundred or so people in the middle of the dirt road. They are on the other side of barriers made of pitted concrete and rusted rebar.\nThey’re all wearing tattered rubber ponchos, faces obscured by gas masks. Many of them are carrying crude guns, others are holding spears or bottles of fluid with rags hanging from the tops.\nArmand must not have any Shäd in the cab to drive, as he spends a long set of moments lurching the trailer and truck into reverse and trying to correct the trailer from sliding to the side. But he stops again, and you see that barriers have been rolled across the road. Sharp rebar is pounded into the ground to hem the truck in.\nYou recognize the tactic. You’ve been the one pushing barriers across a road before.\nMiko has slumped over and pushed the mask away. You take a few pulls from it, and try to get it back on his face. But he’s not responding.\nFigures surround the truck, surging through the muck floating over the ground. You’re trying to pull Miko down when they grab you and pull you forward. The large crowd parts as a figure walks confidently to the front of the truck with a massive rocket launcher over one shoulder.\nThe person stops and pulls their mask away from their face to shout up at the driver’s side window.\n“Armand: get the fuck out of the truck or I’ll fire this right at the window.”\nYou stare.\nThe face. There’s a long scar across the cheek to the nose. The hair is shaved down except for a slight tuft near the front. It looks older, more weathered.\nBut damn it, it’s your face.\n“Hello sister,” the woman holding the rocket launcher says, never taking her eyes off the truck. “I’ll talk to you in a few. I’m in the middle of something with that rat-bastard up behind the wheel.”\nYou open your mouth to talk, but one of the poncho-wearing warriors to your side jams a mask over your face. You breathe the clean air in deeply and gratefully, then let them lead you around to the back of the truck.\nThere’s a gun pointed at you, and they force you to sit near Miko. He’s not moving, but they’ve pulled the Shäd mask on over his face so he can breathe. If he’s still alive.\nFour peel off and pull out what look like jury-rigged explosives that they start taping onto the doors.\nYou peel the borrowed mask away. “Hey! You don’t have to do that.”\nThey pause and stare back at you, bug-eyed in the gas masks and startled at the interruption.\n“I know the code,” you tell them.\nThey look at each other, then shrug. Four guns are trained on you as you stand up and slowly walk over. You punch in the combination you memorized when watching Armand, and the door slides down to become a ramp once again.\nThey swarm in, weapons up, to secure the back.\nYou hold onto Miko and watch them break open the cages. Miko would be devastated: all that loot’s going to end up in the hands of these raiders.\nRaiders run by someone with your face.\nAnother universe. High RCP, you tell yourself. You’re in something like shock. Is it the air?\nYour self-labeled “sister” arrives, pushing Armand in front of her. He’s holding his breath, eyes wide and blood running down his temple. You’re not sure who’s having a worse day: you or him.\nYou get waved up the ramp, along with Armand. Someone helps you pull Miko up into the trailer, and the door shuts behind you. Air pumps run for a second, and then everyone starts removing their masks.\nThis other version of you, clearly the leader here, clearly in control of this strange situation, looks you up and down and doesn’t seem to come to any sort of conclusion one way or another. “I call myself Che. It’s a little bit of a joke, if you read history.”\n“I’m Chenra. Full Chenra.”\n“Good for you.” She is unimpressed. “Armand explain the smuggling he does?”\n“Some of my people rode the trailer, ended up in another world, tried to take the truck,” you tell her, not answering her question but trying to explain who you are. And why Armand is your enemy. Can you make friends with yourself if you both hate Armand? “We didn’t really understand what was happening, and he took the moment to jump us over here. We didn’t have bottled air.”\nYour doppelgänger looks down at Miko and nods, a riddle solved. “He’s in a bad way. How long did he inhale the soup?”\n“Long enough. Has something in his shoulder from trying to shoot the window.” You nod at the art and valuables being dragged out toward the back of the trailer. “That all yours now? I’m not trying to lay claim to it or get in your way.”\n“What do you think, Armand? Should I keep all this shit?” Che kicks your captor, who is lying on the floor, spitting bile. He wipes his chin with a dirty suit sleeve and glares at her. “He tell you how special you were?”\nYou lock eyes with yourself and shiver slightly. “Yeah. He said I was a genius.”\n“It’s not all bullshit.” Che pokes Miko with the tip of her boot. “You want to try and get him home to your own universe, to help him, right?”\nYou nod. No sense in trying to lie to yourself, right?\n“You two screwing? I’ve never seen him before,” she says. “Not really our type, is he?”\n“No. But he’s part of my cluster. I owe him.” Cheetah cluster for life, right?\n“What’s your world like? High or low RCP?”\n“I think it’s high?” you say. “It’s not as bad as this, but it wasn’t nice like the last place. The air was good. No storms, or heavy wind. Clear. You could see—”\n“A nine or so is considered high, two or three is utopia,” Che interrupts. “That’s where you get all your horrible shit under control and can keep a living world. The eggheads tag all the worlds we can access with various RCP levels. The nerds used to think the points of divergence would all be about national borders and great people. Like, suppose Hitler lived, or the Soviet Union collapsed. Shit like that. But the looming threat, the thread that runs through all these realities that makes the big changes that people like you and I give a shit about, is simply how the atmosphere and oceans were managed. Usually there’s an accord. Paris, DC, they try to imitate the same thing they use to stop acid rain. Caps and trades. But sometimes they never even get to that point. Right now, this variation we’re in, it’s one of the worst scenarios.”\nYou think about all the cool, breathable air in the world just before this one. “Then I’m in definitely in a higher RCP world. People are scared of the runaway effect. A lot of people are bunkering underground, or in domes. I use a respirator outside. We’re not using fuel anymore. It all got used up in the Collapse.”\n“Sounds like a shithole. But, you’re a sister me. If you feel you need to go back, I can get you some weapons. You can try to find another Armand going the other way. But trips like that are fairly infrequent. I’ve been waiting to trap Armand here for almost a month.”\n“Can’t you take me?” you ask. If she is doing favors and all. You feel somewhat paralyzed, because this is a situation so far outside of normal—how can you make a decision? This familiar face, however, knows more than you. You feel an instant desire for her help, her guidance.\nChe shakes her head. “This truck’s got one more jump in her, and we’re going somewhere specific. And you can’t take your buddy back there if you want him to live. You need to go forward.”\n“To a better world?” You’re starting to get the hang of this. “Lower RCP?”\n“The lowest,” Che says. “You talk about bunkers and domes. This whole area was a massive dome, once. This world ate itself alive. Kept putting leaders up that focused on chewing through resources, promising jobs over stewardship. And when the carbon from burning things filled the oceans, the pH meant huge die-offs. One collapse led to another.”\n“Sounds familiar,” you mutter. And you think of that cool breeze on your skin and shiver. Something inside you almost aches when you consider trying to get back to what is familiar.\n“But this world had resources, scientists working on keeping them alive as the air soured. When they cracked the veil between worlds they found a garden world. An Eden. They built massive complexes to shuttle people over, thinking no one was on the other side. But they made a mistake. There were people, and those gardens were maintained carefully by people who had spent generations on wilding projects.”\nChe pulls out that same picture that the Shäd showed you. It’s the clean, flattened-hair version of you, wearing a suit similar to Armand’s. Che taps it.\n“Which version of us is that?” you ask.\n“This picture is a sister of ours that led her people from this high RCP world we’re in right now to the garden world,” Che says. “I killed her. That was my job. The garden world was my world, before I came over here to hide. It’s where the invaders would never think to look for me. They think those of us from the garden world are soft.”\nBut this sister of yours doesn’t look soft, despite growing up in an Edenic world. She looks forged. Just like you have been. And even the sister in the picture looks forged. The leader of an invasion force that had to leave their dying world, or die themselves. Making hard choices.\n“Those invaders to my world are the ones paying Armand anything he wants in order to get one of us, sister,” Che says to you. “It’s so that they can string us up in public for their people and have a good show as they execute us. Bread and circuses.”\n“Not true,” Armand hisses. “The people I work for, they would take you in for training. They want insight, they need help to run the fight against these terrorists who have attacked us. They want to tap your genius.”\nChe shakes her head. “He’s lying.”\n“And in exchange for your insight into fighting your terrorist double, they would make you richer than you could imagine,” Armand says. “Join her, and you will be the enemy. An insurgent. On a list of enemies against humanity. And not just in the world she wants to go to, but any world that has trade with my people.”\n“No matter where he is born, he is always trash,” Che says, and throws him into one of the cages. She locks it after him.\nYou stare at Armand for a long moment. “These better worlds. They can help Miko?”\n“Yes.”\n“If I don’t go to Armand’s people, I’ll be hunted. Because of something you did.”\nChe nods. “You’ll be a criminal. A terrorist.”\nI look over at the three raiders who are done piling the goods up against the back of the trailer. “Why are you going over, now? What are you doing with all that?”\nYou’re imagining that she’ll tell you something about funding a revolution. How her people on the other side, invaded by the people from this world, need those things to fight their fight.\nChe smiles. “They left so many here to keep suffering, once they got across, because the energy required to pierce through is nearly unimaginable. Each of those smuggler’s trucks requires shareholders, backers, venture capital. Cross-world travel is rare. So I’m taking as many as I can get over. Count yourself lucky there’s a spot for you.”\nYou think about the treasures Armand has hoarded. They’re all priceless things that the insanely rich obsess over. Portable cultural artifacts.\n“I’ll cross with you,” you say, your voice breaking slightly as you realize this likely means you won’t ever see your world again. But then, you’ve left it all behind before. Running across the desert in your bare feet, your hands covered in blood and hair hacked off, those manacles burning the skin of your wrists.\nFive hundred miles away, your feet bloody, Cheetah cluster took you in and away.\nChe pulls her mask back on, and you follow suit. The back door slides back down into a ramp, and there are hundreds of forms waiting in the dark brown mist. Children.\nPeople roughly shove the priceless art and precious metals off the back of the trailer onto the rocky ground.\nArmand shouts from inside his cage, but the anger turns to coughing as the hot, acidic air roils into the trailer.\nYou’ve always gone forward.\nThis is the first time you’ve known what you’re heading toward. An Edenic world without climate collapse. A world where invaders are fighting the people who lived there before them. Invaders who abandoned millions of their own to a dead world.\nThese starving refugees are packed into the back of the trailer or strapped onto the top with bottles of air. They are all taking the risk of death, or worse, when you all break through to that other universe. Che has been driving for several hours, hoping to get as far from core invader territory as she can, but air will be running out soon and a decision to jump over has to be made shortly or people will start dying.\nYou sit next to Che, shoved up together near the controls. Miko is by your feet. Refugees cram in everywhere inside the cab, some of them controlling the computer that Armand had, others just packed in to make the crossing. You’d watched the pile of pictures and all that glittered fall away behind the trailer in the mirrors. The old canvases curled up in the harsh air as you slid away. Acid rain began to drizzle on them.\n“There are many more, on many different worlds, that need help,” Che had said. “Even though their brothers invaded mine, I couldn’t leave them back there to slowly choke to death. It wasn’t their fault, it was their forefathers who did this to them.”\nYou’re never going to be a gunner again, chasing after convoys.\n“Will it make a difference, a couple hundred?” I asked.\n“We’re just getting started,” Che said. “I can save more.”\nBut you wonder what all these new bodies will do to that Edenic new world? Will these descendants of a people who destroyed an entire world be able to make a change? Or would they understand how to treasure it, knowing how precious it was?\nThe world flips inside out and you gasp.\nWhen your vision comes back to you, you look up to see a forest choking the dirt road around the truck.\nPeople rip off their masks as Che rolls the windows down. There are flowers. The distant chatter of animals. Scents on the breeze that fill the cab. A gentle wind.\nShe’s taken you back to where this all started, geographically. But there is no toll road here. No farms. No dusty plains and electric cars with skulls and machine guns mounted on them. Just lush green and lungfuls of sweet air.\n“Are you okay?” Che asks.\nYou wipe the tear from your cheek.\n“This is what it could have been, where I come from,” you whisper. “We could have done it.”\nChe stops the truck, as it’s shuddering and smoke has begun to leak out of the machinery in the front of the trailer. People are banging and shouting for her attention.\nAfterwards, she climbs on the hood as people gather before her.\n“I give you my world,” she says. “I ask only that you care for it as you would your child. Do that, and it will care for you as well. Now go.”\nThe two of you sit for a while later near Miko.\n“I’m sorry,” she says. “I hoped he would make it. We could have helped.”\nYou shake your head. “I’ve seen worse deaths.” It was no worse a death than clashing with duty-evaders on a toll road. He had never understood what was actually happening though, and you feel bad about that.\nWhen you stand, after burying him under the cool shade of a magnificent pine tree that makes you almost weep again, you move to Che’s side.\n“Take me with you.”\n“I don’t know what my next move is. I snuck over to their world to see what it was like and hide from her death squads. I didn’t really believe them when they said it was so bad. I didn’t know so many were suffering. Armand and his ilk, they get financing to go and fetch the greatest minds from the remains of high RCP worlds. Or get ‘servants’ of famous people. But these are regular folk that needed saving, that no one wants. They deserve to live.”\nYou nod.\nYou’ve been watching this version of yourself. And you’ve learned something. This isn’t a confident, dangerous you like you first assumed when you saw her with the rocket launcher. No, this is a version of you that cares deeply. She put herself in front of the truck because she felt strongly.\nShe didn’t know what would come next when she rescued these people. She just did it.\nThis version of you isn’t calculating.\nThis version of you isn’t looking for the next move.\nThis version of you came from ancestors who managed a planet successfully, not like your own failed ones.\nYou’ve been taught to take, to be strong, to run with a strong pack. Miko has taught you well. Having studied this Che for hours, you know you could break her. She hasn’t spent a lifetime in the hot sand.\nBut the forests.\nHer people let that be. And that is a different lesson. You need to follow her people. You need to help them protect what they’ve built.\nAnd what you know, and have learned for an entire life, is survival. How to create fighters.\n“You need to grow your army,” you say to Che. “You need to bring more people over. More refugees from the other worlds. We can find more Armands to trade with, right, if there are many worlds and many copies of us in them?”\nChe nods at you. “More death.”\nYou smile crookedly. “And maybe more life. I think we bring things over to the other places that help them. And then we bring fighters, loyal fighters, from there to here. We can do this better. I can show you how to finish what you’ve started. Let me help you.”\n“It’ll be dangerous.” Che raises an eyebrow.\nYou know. But you know danger better than she does. All you’ve lived is danger.\nBesides, is it better to be a king of a sandy hell, or a servant in a lush paradise? Her people had created something so special, you know that being one of their soldiers is the way to climb. You can taste ambition again.\nThis, you think as you move through sun-dappled forest, is a world to die for.\nA world to fight for.\nCalled \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.\nHis Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"\nHe currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs.", "source": "https://clarkesworldmagazine.com/buckell_01_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A World to Die For by Tobias S. Buckell"}