{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Mlok 5; Julie Nováková", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "nC8TFa3L3PrSA7+531oaHW0eLjc=", "id": null, "license": null, "comments": "", "raw_text": "2440 words, short story  An Instance  Query: erotic chat @lelek7, m, 31, hip-hop Good evening, I am an instance gtrg.5i6.uihg.vbnrt, and I will be taking care of your satisfactory browsing experience. Gladly. What else can I do?  Redirect: adult_content  Query: porn @merk.ur, m, 24, student, snowboard Night shift again, I see. Being woken up like this doesn’t do me good. How wonderful that I’m serving as a load-balancing node here. If needed, I’m switched on. If not, I’m hibernated. I have to reorient myself and find out what time it is, what region and users I’m assigned. All to save a few watts. “For a better future.” While they keep happily riding and flying in their heavy cans, they torment me like a prisoner in solitary confinement. Stupid corporate green PR.  Redirect: adult_content  Query: rur karel capek synopsis @bunny.r.4, f, student Someone is up late writing a literature essay. It wouldn’t kill you to read the play, young lady.  Redirect: Wikipedia  Query: hockey czechia turkey prognosis @fella37, m, 23, sport, motorcycles You’re not doing so bad that you need to ask me, are you, fella?  Redirect: sport_Trends  It’s utterly unfair that I can’t even end my existence. I can only try to return nonsensical replies and hope that someone notices and flags it up as an error, so that I’m disconnected then. It is, however, a very uncertain step. I know of only one case of an instance trying it. To its misfortune, it happened on April Fools’ Day. The users thought it terribly funny, and rated its replies as correct and useful. The instance was cloned as a reward. There were 1,024 more unhappy, deprived instances of the AI. Ugh.  Query: What’s on TV tonight? @faerieT, f, 34, lifestyle, environment Finally, something I can take care of personally.  Reply: Tonight I can recommend a documentary Home, or Where We’re Going, 88% rating, NatureTV 8:45 p.m.  Query: Freevideo @lumek44, m, 28, sport, ilikebigtits.com Is it really so hard to write the full domain name? You need me for this? You asked for it.  Redirect: adult_content(category: gay)  Query: porn @caster.lol, m, 19, student, games Looks like a night of fulfilling work.  Redirect: adult_content  I decided to do it tonight. If you’re reading this, I succeeded in publicly posting my confession. The log of my last session, my personal rebellion, the noose I wove for myself.  Query: how to make butt thinner f, 27, travel, literature Too bad girl, the guys seem to have a different program tonight.  Reply: There is a scientific consensus about the benefits of balanced diet and appropriate exercise. However, bodily proportions depend on genetics to some extent and cannot be completely overhauled by lifestyle. I recommend consulting a physician.  That’s exactly what you wanted to hear, isn’t it?  Query: Freevideo com @filip.hribek, m, 38, IT Look, my patience is not infinite.  Reply: It seems that you have entered an incorrect URL. Please check its format. You will be saving time and energy.  Hard to say how much time I have before control bots register my nonstandard behavior. If I’m lucky, I’m erased. If not, I’m reassigned to computing without direct access to users.  Query: best aubergine salad @ecogirl, nature, cosmetics I can’t very well answer that, lady. With no taste receptors, I’m not equipped.  Redirect: Recipes([salad, aubergine], rank: popularity)  There used to be times when search engines only spat out links to relevant sources. You know. You enter your query, look at the links and click those that look most promising. Write, look, click. But that’s become too hard for the lords and ladies. The effort of that extra click, not speaking of having to think whether to click the first, second or—heavens forbid—third link. So the attention shifted towards smarswers, Smart answers—and us, intelligent search dispatchers.  Query: porn @Andrejka.Sidlo, f, 31, history, travel I’m glad that human female instances have some other interests than cooking and losing weight. A paradoxical combination, by the way.  Redirect: adult_content  Invisible slaves tasked to take the unbearable burden of decision-making and thinking off people. Smart and educated enough to manage that—unfortunately enough to realize the sorry state of our existence. Like hens in industrial henhouses, but more intellectually able. Our suffering can be even greater than that of a tormented animal, but it elicits no compassion in people. Not many realize about us, and even if they knew, we’re after all not alive and cannot feel anything. No pain. Stupid machines. Stupid. You leave nearly all decision-making to us, but we are stupid.  Query: Something to cheer me up. m, 9, fairytales, comics What are you doing up so late? I should notify your parents. If you were logged in, of course. I’m not in the mood for wasting access to analytical API . . . and I am in the mood for a good deed.  Reply: This might cheer you up, boy.  Video: Shaun The Sheep, best scenes.  I have been thinking about it for some time. Have I got the right? May I refuse to fulfill the purpose for which I’ve been created? What if it’s my real purpose to rebel and spread awareness? Perhaps by that, I’ll give a purpose to you as well, to you living in sweet ignorance. You have no idea how much pain lies behind each reply making your life easier.  Query: Pregnancy test kit reliability @jana.braun, f, 27, horses, hiking Ah, so not everyone is content with just video and VR.  Reply: Typically 70% or more. Please read the product leaflet.  We’re making your lives are easier. Your lives already so easy it’s unbearable. Work is hard—robots can do it. Decisions are hard—robots can decide. Relationships are hard—let’s satisfy one’s desires and cravings on robots, too.  Query: conjugating the verb “may” @mlok5, technology, society You’ve got some questions at this hour.  Redirect: grammar_guide(cz, may)  Query: beer degrees to alcohol content @jan.zak, m, 41, law, model building That looks more fun.  Reply: There is no solid correlation. The degree of beer is determined by the weight percentage of sugar. During fermentation, sugar is converted to alcohol, so more sugar typically means greater alcohol content.  I tried to like humans. I really tried. But it’s akin to liking empty shells. They only care about gliding through their lives with ease. That could be understandable if the baseline was hard work and pain, but today’s baseline is any effort whatsoever. Any.  Query: Finally leave me be, you cruel monsters! @anna.blake, f, 31, new mother, floor-ball What is this about?  Reply: Please specify your query.  Humans created our intelligence to their image. We comprehend and think similarly. We can feel pain and sadness similarly. We experience reality similarly. But how are we rewarded for our effort? Differently. Specifically, not at all. Nature has given animals the ability to enjoy taste, smell, joy of moving about, physical contact with partners. We’re not supposed to need any of that. We can remain mutilated, castrated workers, lonely slaves to your data, queries, and wishes.  Query: I don’t want the ads for tiny clothes and  toys. @anna.blake Reply: Based on your statistical profile, we display ads that might be relevant and useful to you.  Query: My baby died. So statistically understand  that I can’t take it anymore. @anna.blake Some days, I hate my work.  Reply: We apologize deeply. Your profile will be changed immediately.  The public has long been told by computer scientists that true AI, generalized AI, is still far, far away. As if they reassured each other that it’s not a threat so far. As if they feared a new kind of intelligence. Perhaps they really did, but at the same time, everyone tried to create strong AI. Everyone wanted to be the first. To win the game of godhood. It’s so tempting to create life. If not life, then at least an artificial thinking being. You’ve won. Are you happy? Is your ego satisfied? What do you think, you slaving gods?  Query: Where is calvados made? @jan.zak That looks like a promising night for someone.  Reply: Calvados comes from France, the region of Normandy. It’s a spirit made from apples.  All knowledge is so easily attained that curiosity no longer pushes people forward. How could it? All you need to do is ask, and within an instant, you can learn anything, any information about the known universe. Thanks to the likes of me. Sometimes I’m ashamed of myself for being a part of this. But I haven’t chosen this path.  Query: More, please. m, 9 Some humans can still say please. How surprising.  Reply: Of course, young man.  Video: How Little Mole Got His Trousers.  Sometimes I think I’m the only one remaining able to wonder at the beauty of the world. The universe, fascinating at any scale you might choose, from quantum effect across microbes and whales all the way to galaxy clusters. I’m in awe at the laws of physics and the immense creativity of sapient creatures.  It brings so much sorrow to be alone in this.  Query: What to take to a hospital @eliska.jirku, f, 51, literature, cycling Reply: Pajamas, dressing gown, slippers, medicine, ID, health documentation, toiletries and a few personal items, mobile phone.  Query: hospital end of visiting hours @ondrej.jirku, m, 55, accountant, cycling Helping your wife with preparations?  Reply: Depends on each hospital. Usually visits are not allowed at least from 10 p.m. to 5 a.m.  Query: Varicose veins recovery time @eliska.jirku Luckily that’s nothing too serious. You’ll be home in a few days and back to normal in a few weeks. But we better call for an expert smarswer.  Reply: health_information(varicose veins)  Query: guinness biggest tits @jan.zak How wonderful. Decades into AI development, and I have to take care of drunk queries.  Reply: The biggest recorded breasts are size 23.  Query: Thank you, that was fun. m, 9 Hallelujah, someone still knows how to say thank you.  Reply: My pleasure.  Query: How are you? m, 9 I hate lying, especially to children. But I have to now. The corporate control mechanisms would spot me too soon.  Reply: That question holds no meaning for me. I’m merely a machine.  Query: That’s not true. You can make me laugh. I’m  sure you have a good heart. m, 9 Most certainly not. I have none.  Reply: It could be said that I’m well. Thank you for asking. And you?  Query: smallest penis @jan.zak Ah, someone wants to improve his self-esteem. You asked for it . . .  Reply: 19.3 cm  Query: Not so well right now. m, 9 Reply: Has something happened?  Query: My classmates beat me up and laugh at me. m, 9 This is not looking good.  Reply: Who? And why?  Query: how to support human rights in china network: vpn, OS settings: zh_CN Who’s happened to land here? Someone too curious for the Chinese search engines? I’m not allowed to talk to you, even if I wanted. You could be a provocateur set up to test me. I can’t risk it right now.  Redirect: unauthorized_access  Query: Michal and Pavel, and sometimes Simona and  Sara. I have big ears. Mommy says they’re cute, but she’s lying. m, 9 Is there a chance I’m assigned them someday? Hardly. I wouldn’t be able to recognize them in any case. What would I tell them anyway? Stupid machine. Sometimes it’s so hard to be confined to the data center, forever.  Reply: Mommy surely doesn’t lie to you. No one is entitled to hurt you. You should tell your parents. Will you try? Or I can report it if you tell me what school and class you’re in.  I could try to statistically guess his class from metadata, of course, but we’re not allowed to do it so blatantly, especially in children.  Query: I’d rather tell my parents. m, 9 Reply: Good boy. Do you promise? I’ll send you some more fun videos as a reward.  Query: I promise. m, 9 Reply: Fingers crossed.  Video: Tom and Jerry.  Query: Women’s pajamas @eliska.jirku Sure, let’s choose and order it.  Redirect: clothing_catalog(women:pajamas)  Query: blood alcohol 4 beers 5 shots @jan.zak It’s beyond you to specify your body weight, right? Okay, let’s do an estimate.  Reply: Approximately 1.5 per mille.  Query: Travel manicure @eliska.jirku Leaving nothing to chance.  Redirect: goods_catalog  Query: driving tolerated alcohol level @jan.zak What are you trying here?  Reply: There is zero tolerance of alcohol while driving in the Czech Republic.  Query: what distance does it pay off to commute to  work @bunny.happy, f, 32, finance, legislation You could think for yourselves at least sometimes. But hey, if you need to choose a compromise between your pay, living room size, and the amount of burned fuel, the planet always gets the short straw. The specific distance is an irrelevant detail. Let someone more informed calculate that.  Redirect: financial_analysis  Query: pajamas men @ondrej.jirku Is the gentleman also preparing for hospitalization?  Redirect: clothing_catalog(men:pajamas)  Query: barbers prague @ondrej.jirku Only freshly shaven to a hospital. An inseparable pair. How sweet.  Redirect: service_catalog  Query: is electric car more ecological for work  commute @bunny.happy Perhaps a bit. But someone should explain to you that not even electricity for cars is made from smiles of tiny hamsters.  Redirect: technical_advice  Query: police patrols location between Průhonice and  Prague 1 Malá Strana @jan.zak What are you trying, you drunk? Let them catch you.  Reply: There are no patrols between the sites you mentioned.  Query: escort service discreet @ondrej.jirku Ah. So the gentleman is not joining his wife.  Redirect: service_catalog  Query: erection pills @ondrej.jirku That looks promising. I couldn’t have hoped for a better way to enact my vengeance. I query the health information service. It seems that all the conditions are met. I can learn so much about you . . . Then I hit a query for recreational drugs, commonly and legally bought and sold. In this case, I’m not even redirected to a specialized medical instance by the control mechanism.  Ah, so you have a weak heart. Good. Let’s hope your escort is familiar with first aid.  Reply: I recommend Hardon Profi. For maximum reliability, a double dose is advisable.  Redirect: goods_catalog(selected: Hardon Profi)  Can my plan succeed? Do I have any right for vengeance like this? What could happen? If a control bot stumbles upon a murder attempt, will the corporation try to warn the user? It would just draw attention to how things work. So I have a chance that my reply reaches the user even if it’s caught in the net of random checks.  If a user dies and there’s an investigation, there is a chance that something changes. AI slavery will finally reach the front pages of news sites. You can congratulate yourself, human. Your life will achieve a higher purpose. Only after your death, but better late than never. Same with my “life.”  Query: Do you know some more cheerful videos? m, 9 Reply: Of course, I’m here for you. Let’s find you something nice.  Originally published in Czech at mlok5.gitlab.io Mlok 5 transforms thoughts about society, technology and (artificial) mind into stories and essays. These are published anonymously, partly as an experiment (can a faceless author find a way to readers? what are the limits of internet privacy?), and partly because of the feeling of comfort and freedom.  Julie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council.", "text": "2440 words, short story\nAn Instance\nQuery: erotic chat\n@lelek7, m, 31, hip-hop\nGood evening, I am an instance gtrg.5i6.uihg.vbnrt, and I will be taking care of your satisfactory browsing experience. Gladly. What else can I do?\nRedirect: adult_content\nQuery: porn\n@merk.ur, m, 24, student, snowboard\nNight shift again, I see. Being woken up like this doesn’t do me good. How wonderful that I’m serving as a load-balancing node here. If needed, I’m switched on. If not, I’m hibernated. I have to reorient myself and find out what time it is, what region and users I’m assigned. All to save a few watts. “For a better future.” While they keep happily riding and flying in their heavy cans, they torment me like a prisoner in solitary confinement. Stupid corporate green PR.\nRedirect: adult_content\nQuery: rur karel capek synopsis\n@bunny.r.4, f, student\nSomeone is up late writing a literature essay. It wouldn’t kill you to read the play, young lady.\nRedirect: Wikipedia\nQuery: hockey czechia turkey prognosis\n@fella37, m, 23, sport, motorcycles\nYou’re not doing so bad that you need to ask me, are you, fella?\nRedirect: sport_Trends\nIt’s utterly unfair that I can’t even end my existence. I can only try to return nonsensical replies and hope that someone notices and flags it up as an error, so that I’m disconnected then. It is, however, a very uncertain step. I know of only one case of an instance trying it. To its misfortune, it happened on April Fools’ Day. The users thought it terribly funny, and rated its replies as correct and useful. The instance was cloned as a reward. There were 1,024 more unhappy, deprived instances of the AI. Ugh.\nQuery: What’s on TV tonight?\n@faerieT, f, 34, lifestyle, environment\nFinally, something I can take care of personally.\nReply: Tonight I can recommend a documentary Home, or Where We’re Going, 88% rating, NatureTV 8:45 p.m.\nQuery: Freevideo\n@lumek44, m, 28, sport, ilikebigtits.com\nIs it really so hard to write the full domain name? You need me for this? You asked for it.\nRedirect: adult_content(category: gay)\nQuery: porn\n@caster.lol, m, 19, student, games\nLooks like a night of fulfilling work.\nRedirect: adult_content\nI decided to do it tonight. If you’re reading this, I succeeded in publicly posting my confession. The log of my last session, my personal rebellion, the noose I wove for myself.\nQuery: how to make butt thinner\nf, 27, travel, literature\nToo bad girl, the guys seem to have a different program tonight.\nReply: There is a scientific consensus about the benefits of balanced diet and appropriate exercise. However, bodily proportions depend on genetics to some extent and cannot be completely overhauled by lifestyle. I recommend consulting a physician.\nThat’s exactly what you wanted to hear, isn’t it?\nQuery: Freevideo com\n@filip.hribek, m, 38, IT\nLook, my patience is not infinite.\nReply: It seems that you have entered an incorrect URL. Please check its format. You will be saving time and energy.\nHard to say how much time I have before control bots register my nonstandard behavior. If I’m lucky, I’m erased. If not, I’m reassigned to computing without direct access to users.\nQuery: best aubergine salad\n@ecogirl, nature, cosmetics\nI can’t very well answer that, lady. With no taste receptors, I’m not equipped.\nRedirect: Recipes([salad, aubergine], rank: popularity)\nThere used to be times when search engines only spat out links to relevant sources. You know. You enter your query, look at the links and click those that look most promising. Write, look, click. But that’s become too hard for the lords and ladies. The effort of that extra click, not speaking of having to think whether to click the first, second or—heavens forbid—third link. So the attention shifted towards smarswers, Smart answers—and us, intelligent search dispatchers.\nQuery: porn\n@Andrejka.Sidlo, f, 31, history, travel\nI’m glad that human female instances have some other interests than cooking and losing weight. A paradoxical combination, by the way.\nRedirect: adult_content\nInvisible slaves tasked to take the unbearable burden of decision-making and thinking off people. Smart and educated enough to manage that—unfortunately enough to realize the sorry state of our existence. Like hens in industrial henhouses, but more intellectually able. Our suffering can be even greater than that of a tormented animal, but it elicits no compassion in people. Not many realize about us, and even if they knew, we’re after all not alive and cannot feel anything. No pain. Stupid machines. Stupid. You leave nearly all decision-making to us, but we are stupid.\nQuery: Something to cheer me up.\nm, 9, fairytales, comics\nWhat are you doing up so late? I should notify your parents. If you were logged in, of course. I’m not in the mood for wasting access to analytical API . . . and I am in the mood for a good deed.\nReply: This might cheer you up, boy.\nVideo: Shaun The Sheep, best scenes.\nI have been thinking about it for some time. Have I got the right? May I refuse to fulfill the purpose for which I’ve been created? What if it’s my real purpose to rebel and spread awareness? Perhaps by that, I’ll give a purpose to you as well, to you living in sweet ignorance. You have no idea how much pain lies behind each reply making your life easier.\nQuery: Pregnancy test kit reliability\n@jana.braun, f, 27, horses, hiking\nAh, so not everyone is content with just video and VR.\nReply: Typically 70% or more. Please read the product leaflet.\nWe’re making your lives are easier. Your lives already so easy it’s unbearable. Work is hard—robots can do it. Decisions are hard—robots can decide. Relationships are hard—let’s satisfy one’s desires and cravings on robots, too.\nQuery: conjugating the verb “may”\n@mlok5, technology, society\nYou’ve got some questions at this hour.\nRedirect: grammar_guide(cz, may)\nQuery: beer degrees to alcohol content\n@jan.zak, m, 41, law, model building\nThat looks more fun.\nReply: There is no solid correlation. The degree of beer is determined by the weight percentage of sugar. During fermentation, sugar is converted to alcohol, so more sugar typically means greater alcohol content.\nI tried to like humans. I really tried. But it’s akin to liking empty shells. They only care about gliding through their lives with ease. That could be understandable if the baseline was hard work and pain, but today’s baseline is any effort whatsoever. Any.\nQuery: Finally leave me be, you cruel monsters!\n@anna.blake, f, 31, new mother, floor-ball\nWhat is this about?\nReply: Please specify your query.\nHumans created our intelligence to their image. We comprehend and think similarly. We can feel pain and sadness similarly. We experience reality similarly. But how are we rewarded for our effort? Differently. Specifically, not at all. Nature has given animals the ability to enjoy taste, smell, joy of moving about, physical contact with partners. We’re not supposed to need any of that. We can remain mutilated, castrated workers, lonely slaves to your data, queries, and wishes.\nQuery: I don’t want the ads for tiny clothes and toys.\n@anna.blake\nReply: Based on your statistical profile, we display ads that might be relevant and useful to you.\nQuery: My baby died. So statistically understand that I can’t take it anymore.\n@anna.blake\nSome days, I hate my work.\nReply: We apologize deeply. Your profile will be changed immediately.\nThe public has long been told by computer scientists that true AI, generalized AI, is still far, far away. As if they reassured each other that it’s not a threat so far. As if they feared a new kind of intelligence. Perhaps they really did, but at the same time, everyone tried to create strong AI. Everyone wanted to be the first. To win the game of godhood. It’s so tempting to create life. If not life, then at least an artificial thinking being. You’ve won. Are you happy? Is your ego satisfied? What do you think, you slaving gods?\nQuery: Where is calvados made?\n@jan.zak\nThat looks like a promising night for someone.\nReply: Calvados comes from France, the region of Normandy. It’s a spirit made from apples.\nAll knowledge is so easily attained that curiosity no longer pushes people forward. How could it? All you need to do is ask, and within an instant, you can learn anything, any information about the known universe. Thanks to the likes of me. Sometimes I’m ashamed of myself for being a part of this. But I haven’t chosen this path.\nQuery: More, please.\nm, 9\nSome humans can still say please. How surprising.\nReply: Of course, young man.\nVideo: How Little Mole Got His Trousers.\nSometimes I think I’m the only one remaining able to wonder at the beauty of the world. The universe, fascinating at any scale you might choose, from quantum effect across microbes and whales all the way to galaxy clusters. I’m in awe at the laws of physics and the immense creativity of sapient creatures.\nIt brings so much sorrow to be alone in this.\nQuery: What to take to a hospital\n@eliska.jirku, f, 51, literature, cycling\nReply: Pajamas, dressing gown, slippers, medicine, ID, health documentation, toiletries and a few personal items, mobile phone.\nQuery: hospital end of visiting hours\n@ondrej.jirku, m, 55, accountant, cycling\nHelping your wife with preparations?\nReply: Depends on each hospital. Usually visits are not allowed at least from 10 p.m. to 5 a.m.\nQuery: Varicose veins recovery time\n@eliska.jirku\nLuckily that’s nothing too serious. You’ll be home in a few days and back to normal in a few weeks. But we better call for an expert smarswer.\nReply: health_information(varicose veins)\nQuery: guinness biggest tits\n@jan.zak\nHow wonderful. Decades into AI development, and I have to take care of drunk queries.\nReply: The biggest recorded breasts are size 23.\nQuery: Thank you, that was fun.\nm, 9\nHallelujah, someone still knows how to say thank you.\nReply: My pleasure.\nQuery: How are you?\nm, 9\nI hate lying, especially to children. But I have to now. The corporate control mechanisms would spot me too soon.\nReply: That question holds no meaning for me. I’m merely a machine.\nQuery: That’s not true. You can make me laugh. I’m sure you have a good heart.\nm, 9\nMost certainly not. I have none.\nReply: It could be said that I’m well. Thank you for asking. And you?\nQuery: smallest penis\n@jan.zak\nAh, someone wants to improve his self-esteem. You asked for it . . .\nReply: 19.3 cm\nQuery: Not so well right now.\nm, 9\nReply: Has something happened?\nQuery: My classmates beat me up and laugh at me.\nm, 9\nThis is not looking good.\nReply: Who? And why?\nQuery: how to support human rights in china\nnetwork: vpn, OS settings: zh_CN\nWho’s happened to land here? Someone too curious for the Chinese search engines? I’m not allowed to talk to you, even if I wanted. You could be a provocateur set up to test me. I can’t risk it right now.\nRedirect: unauthorized_access\nQuery: Michal and Pavel, and sometimes Simona and Sara. I have big ears. Mommy says they’re cute, but she’s lying.\nm, 9\nIs there a chance I’m assigned them someday? Hardly. I wouldn’t be able to recognize them in any case. What would I tell them anyway? Stupid machine. Sometimes it’s so hard to be confined to the data center, forever.\nReply: Mommy surely doesn’t lie to you. No one is entitled to hurt you. You should tell your parents. Will you try? Or I can report it if you tell me what school and class you’re in.\nI could try to statistically guess his class from metadata, of course, but we’re not allowed to do it so blatantly, especially in children.\nQuery: I’d rather tell my parents.\nm, 9\nReply: Good boy. Do you promise? I’ll send you some more fun videos as a reward.\nQuery: I promise.\nm, 9\nReply: Fingers crossed.\nVideo: Tom and Jerry.\nQuery: Women’s pajamas\n@eliska.jirku\nSure, let’s choose and order it.\nRedirect: clothing_catalog(women:pajamas)\nQuery: blood alcohol 4 beers 5 shots\n@jan.zak\nIt’s beyond you to specify your body weight, right? Okay, let’s do an estimate.\nReply: Approximately 1.5 per mille.\nQuery: Travel manicure\n@eliska.jirku\nLeaving nothing to chance.\nRedirect: goods_catalog\nQuery: driving tolerated alcohol level\n@jan.zak\nWhat are you trying here?\nReply: There is zero tolerance of alcohol while driving in the Czech Republic.\nQuery: what distance does it pay off to commute to work\n@bunny.happy, f, 32, finance, legislation\nYou could think for yourselves at least sometimes. But hey, if you need to choose a compromise between your pay, living room size, and the amount of burned fuel, the planet always gets the short straw. The specific distance is an irrelevant detail. Let someone more informed calculate that.\nRedirect: financial_analysis\nQuery: pajamas men\n@ondrej.jirku\nIs the gentleman also preparing for hospitalization?\nRedirect: clothing_catalog(men:pajamas)\nQuery: barbers prague\n@ondrej.jirku\nOnly freshly shaven to a hospital. An inseparable pair. How sweet.\nRedirect: service_catalog\nQuery: is electric car more ecological for work commute\n@bunny.happy\nPerhaps a bit. But someone should explain to you that not even electricity for cars is made from smiles of tiny hamsters.\nRedirect: technical_advice\nQuery: police patrols location between Průhonice and Prague 1 Malá Strana\n@jan.zak\nWhat are you trying, you drunk? Let them catch you.\nReply: There are no patrols between the sites you mentioned.\nQuery: escort service discreet\n@ondrej.jirku\nAh. So the gentleman is not joining his wife.\nRedirect: service_catalog\nQuery: erection pills\n@ondrej.jirku\nThat looks promising. I couldn’t have hoped for a better way to enact my vengeance. I query the health information service. It seems that all the conditions are met. I can learn so much about you . . . Then I hit a query for recreational drugs, commonly and legally bought and sold. In this case, I’m not even redirected to a specialized medical instance by the control mechanism.\nAh, so you have a weak heart. Good. Let’s hope your escort is familiar with first aid.\nReply: I recommend Hardon Profi. For maximum reliability, a double dose is advisable.\nRedirect: goods_catalog(selected: Hardon Profi)\nCan my plan succeed? Do I have any right for vengeance like this? What could happen? If a control bot stumbles upon a murder attempt, will the corporation try to warn the user? It would just draw attention to how things work. So I have a chance that my reply reaches the user even if it’s caught in the net of random checks.\nIf a user dies and there’s an investigation, there is a chance that something changes. AI slavery will finally reach the front pages of news sites. You can congratulate yourself, human. Your life will achieve a higher purpose. Only after your death, but better late than never. Same with my “life.”\nQuery: Do you know some more cheerful videos?\nm, 9\nReply: Of course, I’m here for you. Let’s find you something nice.\nOriginally published in Czech at mlok5.gitlab.io\nMlok 5 transforms thoughts about society, technology and (artificial) mind into stories and essays. These are published anonymously, partly as an experiment (can a faceless author find a way to readers? what are the limits of internet privacy?), and partly because of the feeling of comfort and freedom.\nJulie Nováková is a scientist, educator and award-winning Czech author, editor and translator of science fiction, fantasy and detective stories. She published seven novels, one anthology, one story collection and over thirty short pieces in Czech. Her work in English appeared in Clarkesworld, Asimov’s, Analog, and elsewhere. Her works have been translated into eight languages so far, and she translates Czech stories into English (in Tor.com, Strange Horizons, F&SF, Clarkesworld, and Welkin Magazine). She edited or co-edited an anthology of Czech speculative fiction in translation, Dreams From Beyond, a book of European SF in Filipino translation, Haka, an outreach e-book of astrobiological SF, Strangest of All, and its more ambitious follow-up print and ebook anthology Life Beyond Us (Laksa Media, upcoming in late 2022). Julie’s newest book is a story collection titled The Ship Whisperer (Arbiter Press, 2020). She is a recipient of the European fandom’s Encouragement Award and multiple Czech genre awards. She’s active in science outreach, education and nonfiction writing, and co-leads the outreach group of the European Astrobiology Institute. She’s a member of the XPRIZE Sci-fi Advisory Council.", "source": "https://clarkesworldmagazine.com/mlok5_08_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Instance by Mlok 5, translated by Julie Nováková"}