{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jason Heller", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "MSTD4dfPiCM+2V9d+t5gGVY5jHk=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  The Day-Glo Dystopia of Poly Styrene: Punk Prophet and Science Fiction Priestess  Her cheeks round and her teeth gleaming with braces, Poly Styrene sits in front of a television set, staring raptly at the flickering screen. At the age of twenty-one, she easily looks five years younger. If they didn’t already know, no one guess that this is one of the most exciting young rock stars in England.  The year is 1979, and Styrene’s band, X-Ray Spex, has been launched into the limelight thanks to their 1978 debut album, Germfree Adolescents. Technically speaking, it’s punk rock. But it also incorporates saxophone, synthesizers, and Styrene’s buoyant yelp, a voice that’s both bubbly and piercing.  Styrene is being filmed for an episode of BBC’s August Arena documentary series, an hour-long program titled, aptly enough, Who Is Poly Styrene? As she’s being captured for TV, she’s also gazing at a TV, forming a strange recursion. She’s watching a show about John Maynard Smith, the eminent geneticist and author of the canonical scientific text The Theory of Evolution.  In this documentary-within-a-documentary, Smith explains how genetic engineering—the deliberate manipulation of the human genome in order to effect a desired result in newborns—may come to play a large part in the evolution of the human species in the coming centuries. Styrene’s eyes are wide, but she’s not buying it. In response to the prospect of human beings being engineered in the womb to grow up more qualified to work certain jobs, she says, “In the wrong hands and used the wrong way, [genetic engineering] is terrible. I mean, I find that quite frightening that actually we won’t have much control.” She’s mixing the skepticism of a punk priestess with the dystopian clarity of a science fiction prophet.  Punk exploded in 1977 thanks to the release of The Sex Pistol’s Never Mind the Bollocks, and although proto-punk and post-punk would both draw heavily from science fiction, punk itself couldn’t have been less concerned with science fiction. Science Fiction was still associated with the florid extravagance of progressive rock, whose grandiosity punk rock aimed to deflate. Fantasy, naturally, was completely off the table; no punk band would have been caught dead singing about unicorns, dragons, or wizards, although many punk bands worshipped T. Rex’s Marc Bolan, who unabashedly celebrated all three of those fantasy tropes in his music.  The early British punk band Alternative TV had a song in 1977 called “How Much Longer,” in which the preeminent fantasy author Michael Moorcock is explicitly lumped in with the hippie scene: “How much longer will joss sticks rule / They grow their hair long and stringy and wear Jesus boots / Afghan coats, yeah, making peace signs, man / Talk about Moorcock, Floyd down the Reading Festival?” Punk was all about gritty social realism and pugnacious confrontation; escapism of any kind was deemed the enemy.  That said, X-Ray Spex weren’t the only punk band of the ’70s explosion that tapped into the nervier side of science fiction. A handful of punk bands referenced SF here and there; Scotland’s peppy, outrageously-costumed The Rezillos steeped themselves in b-movie schlock, naming songs “Destination Venus” and “Flying Saucer Attack.” The Clash namechecked the villainous cyborgs the Daleks in their 1977 song “Remote Control.” The Adicts took on the eerie, boiler-suit-and-bowler-hat look of the droogs from Stanley Kubrick’s A Clockwork Orange, adapted from Anthony Burgess’ 1962 dystopian book. In fact, A Clockwork Orange’s lurid look at youth-gang brutality in the near future held sway on many punks, including the Misfits. The New Jersey band formed in 1977, and leader Glenn Danzig turned their morbid yet catchy songs into miniature tributes to many science fiction and horror films and tropes, from “I Turned Into a Martian” to “Astro Zombies.”  It’s a great irony that, within a decade of punk’s big bang in 1977, a new subgenre of science fiction—cyberpunk—would co-opt the term as a suffix, one that would eventually and enthusiastically be used in an ever increasing array of science fiction and fantasy subgenres, from steampunk to clockpunk to dieselpunk to mythpunk. Punk may not have had more than a grudging rapport with science fiction and fantasy at first, but the genres haven’t held any grudges.  Styrene was born Marianne Joan Elliott-Said in 1957, the daughter of a Scottish-Irish mother and a Somali father. After a period of teenage rebellion in the mid-’70s—including a stint as a hippie, not to mention a failed record as a reggae singer, titled “Silly Billy,” that was released in 1976 under the name Mari Elliott—Styrene renamed herself when she became baptized by punk.  She was nineteen when she assumed her new persona. Her band X-Ray Spex was inspired by the shocking phenomenon of The Sex Pistols, whose lewd, sneering, blasphemous mouthpiece Johnny “Rotten” Lydon had become Britain’s public enemy number one. For all its infamy, though, punk broke down doors. Hordes of kids who had previously never thought themselves motivated or talented enough to start a band picked up guitars, drums, and microphones. And as crude as punk proudly was, they began expressing themselves.  X-Ray Spex were part of that wave, but they were a different kind of punk band. Instead of spiking her hair, Styrene kept it curly. Instead of dressing in leather, safety pins, bondage pants, and other garb meant to evoke an image of nihilistic sadomasochism, Styrene wrapped herself in vivid pastels and kitschy clothes from secondhand shops. Her pop-art style carried over to the name of the band, which was taken from the Cold War-era toy called X-Ray Specs—allegedly able to imbue the wearer with the ability to see through skin and clothes—which was advertised primarily in comic books.  It’s telling that X-Ray Spex dubbed themselves after a cheap, frivolous, clearly fraudulent bauble. Styrene, after all, took the name of a plastic as her pseudonym. On Germfree Adolescents, the song “Art-I-Ficial” addresses that plastic nature, the slick and hermetic falseness that had come to envelope consumer society. In it Styrene sings, “My existence is elusive / The kind that is supported / By mechanical resources,” as if she’s enslaved in a state of blissful yet horrific cybernetic stasis.  Her feeling wasn’t an isolated one. In the ’60s and ’70s, technophobia had established itself one of the staple themes of science fiction, after the generally optimistic Golden Age of Science Fiction had given way to the more cynical and complex New Wave. Dystopia gripped the popular imagination, and technology was crucial to the praxis of oppression. From The Twilight Zone episode “A Thing About Machines”—in which everyday appliances turn against their unappreciative owner—to Walter M. Miller, Jr.’s classic science fiction novel A Canticle for Leibowitz, which prophesizes a post-apocalyptic future that shuns science.  Rather than recoil from technology, however, Styrene embraces it with postmodern irony. That gleeful capitulation to mass-marketed inhumanity makes it all the more chilling when she claims, “I wanna be Instamatic / I wanna be a frozen pea / I wanna be dehydrated / In a consumer society,” in the in X-Ray Spex song “Art-I-Ficial.” The phrase “frozen pea” very nearly rhymes with “Soylent Green”; in fact, the people-derived foodstuff from Harry Harrison’s novel Make Room! Make Room! could easily be substituted into the song without significantly changing its meaning.  Consumerism in its most rampant form is another SF theme that dominates Germfree Adolescents. Amid its serrated guitars, squawking saxophone, and barbed pop hooks, the album weaves an ironic, sophisticated subtext that mocks its own commercial aspirations while undeniably embodying, if not emblemizing, them. It envisions an insidiously euphoric future in which a gleaming sheen of artifice and homogeneity cocoons society like so much shrink wrap. And whether we like it or not, Styrene posits, that future is now. As she told John Savage in his book England’s Dreaming: Anarchy, Sex Pistols, Punk Rock, and Beyond:   My thing was more like consumerism, plastic artificial living. [ . . . ] There was so much junk then. The idea was to send it all up. Screaming about it, saying: “Look, this is what you have done to me, turned me into a piece of Styrofoam, I am your product. And this is what you created: Do you like her?”  The record-buying public in England did indeed like her, shrill deconstruction and all. Styrene, for a brief time, became a bona fide pop star in England, thanks to infectious punk anthems like “The Day the World Turned Day-Glo,” a propulsive song with hallucinatory couplets such as “X-rays were penetrating through the latex breeze / Synthetic fiber, see-through leaves fell from nylon trees,” which might have come straight out of one of J. G. Ballard’s dreamlike catastrophe novels, but especially 1966’s The Crystal World. That exultation in pure plastic-ness set the tone for the new wave music of the ’80s to follow, which glibly skimmed the surface of Styrene’s image and sound without touching the substance underneath.  “I wanted to write something using all kinds of plastic words and artificial things, make kind of a fantasy style around it,” Styrene said of “The Day the World Turned Day-Glo,” adding, “It means something too. In an indirect way it’s about the modern world, and maybe you could say it’s futuristic.” Styrene never spoke openly about any possible science fiction influences on her antiseptic yet kaleidoscopic view of art and society, but it had many precedents in SF. The relation between consumerism and conformity is at the core of Aldous Huxley’s 1932 milestone Brave New World, a novel whose ideas have since trickled down and permeated the cultural bedrock.  These ideas also pop up in the works of Golden Age science fiction authors Frederick Pohl and Cyril M. Kornbluth, both separately and as collaborators. In the 1950s, Pohl and Kornbluth each published short stories—“The Midas Plague” and “The Marching Morons,” respectively—that projected the growing trend of consumerist obsession into a nightmarish tomorrow, and the two co-wrote the like-minded novels The Space Merchants and Search the Sky. Satirical and scathing, these stories served as cautionary tales against the herd mentality that Pohl and Kornbluth saw American society eagerly adopt, all too soon after the defeat of Fascism in Europe in World War II. Capitalist society purported to exalt the individual, but given near infinite choice, people chose to be the same anyway. They even identified themselves by packages, brands, and consumer choices as much as anything that’s unique and intrinsic to themselves. It’s the same unsettling paradox that Styrene oozes, from her name to her music.  Styrene’s sly sense of humor dovetails with another work of science fiction, one that was rising at the same time as X-Ray Spex. In 1978, Douglas Adams’ radio show The Hitchhiker’s Guide to the Galaxy debuted on the BBC, followed a year later by his novelization. The clever, madcap tale of a hapless human named Arthur Dent who stumbles toward the secrets of the cosmos after witnessing the destruction of Earth (to make way for an intergalactic bypass), The Hitchhiker’s Guide captured the minds of a generation and became an instant phenomenon—and while Adams wasn’t a punk by any stretch of the imagination, his iconoclastic attitude and sharp wit couldn’t have been more in tune with Styrene’s.  As befits X-Ray Spex’s worship of superficiality, the only blatant reference to science fiction in Styrene’s lyrics pertain to the most popular SF television show of the time. “Bionic Man is jumping / Through the television set / He’s about to materialize / And guess who’s coming next,” she sings in “Genetic Engineering,” referencing the titular hero of The Bionic Man as played by Lee Majors.  Granted, Majors’ character isn’t genetically engineered; he’s a cyborg, half man and half machine. If anything, though, that cheerful disregard for factual rigor only makes Styrene’s slapdash, secondhand repurposing of science fiction seem that much more fitting. Tragically, Styrene’s knack for blurring the boundaries between science fact and science fiction took on a devastating dimension when, in 1979, her then-undiagnosed mental illness contributed to a startling vision she saw while on tour with X-Ray Spex. In England’s Dreaming, she remembers:   All of a sudden I looked out of the hotel window. And I saw this sort of energy. It was bright, bright, luminous pink, and it had a disc shape. It was faster than the speed of light. I was inside a window, but the radiation effect hit my body. I was suffering afterwards, and my body kept going hot and cold.  X-Ray Spex fell apart soon after Styrene’s breakdown. From there, her forays into music were sporadic; she issued three solo albums over the decades, including 1980’s restrained yet sublime Translucence, which vibrates on some blissed-out plane of cosmic mysticism—that is, as much as a synth-heavy new-wave album could do that. X-Ray Spex regrouped for a comeback album in 1994, Conscious Consumer, but practically all of the SF-centric elements of Germfree Adolescents were stripped away in favor of more on-the-nose social statements. Styrene still delivered them playfully, even if her unique alchemy of surreal SF and biting commentary had been diluted.  Styrene’s final solo album, Generation Indigo, came out in April of 2011. She died of cancer the week of its release at the age of fifty-three. Even at the end, her voice retained an elastic youthfulness, as if she’d been hermetically preserved in exactly the manner she once sang about in X-Ray Spex. Listening back to Germfree Adolescents, Styrene comes across as a citizen of some troubling, deceptively utopian future, one who has excavated the remnants of late-20th-century culture. Now, through the language of song, she’s attempting to make sense of our fossils. She’s not, however, an archaeologist. She simply found our civilization buried under her playground.  Jason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "text": "Non-Fiction\nThe Day-Glo Dystopia of Poly Styrene: Punk Prophet and Science Fiction Priestess\nHer cheeks round and her teeth gleaming with braces, Poly Styrene sits in front of a television set, staring raptly at the flickering screen. At the age of twenty-one, she easily looks five years younger. If they didn’t already know, no one guess that this is one of the most exciting young rock stars in England.\nThe year is 1979, and Styrene’s band, X-Ray Spex, has been launched into the limelight thanks to their 1978 debut album, Germfree Adolescents. Technically speaking, it’s punk rock. But it also incorporates saxophone, synthesizers, and Styrene’s buoyant yelp, a voice that’s both bubbly and piercing.\nStyrene is being filmed for an episode of BBC’s August Arena documentary series, an hour-long program titled, aptly enough, Who Is Poly Styrene? As she’s being captured for TV, she’s also gazing at a TV, forming a strange recursion. She’s watching a show about John Maynard Smith, the eminent geneticist and author of the canonical scientific text The Theory of Evolution.\nIn this documentary-within-a-documentary, Smith explains how genetic engineering—the deliberate manipulation of the human genome in order to effect a desired result in newborns—may come to play a large part in the evolution of the human species in the coming centuries. Styrene’s eyes are wide, but she’s not buying it. In response to the prospect of human beings being engineered in the womb to grow up more qualified to work certain jobs, she says, “In the wrong hands and used the wrong way, [genetic engineering] is terrible. I mean, I find that quite frightening that actually we won’t have much control.” She’s mixing the skepticism of a punk priestess with the dystopian clarity of a science fiction prophet.\nPunk exploded in 1977 thanks to the release of The Sex Pistol’s Never Mind the Bollocks, and although proto-punk and post-punk would both draw heavily from science fiction, punk itself couldn’t have been less concerned with science fiction. Science Fiction was still associated with the florid extravagance of progressive rock, whose grandiosity punk rock aimed to deflate. Fantasy, naturally, was completely off the table; no punk band would have been caught dead singing about unicorns, dragons, or wizards, although many punk bands worshipped T. Rex’s Marc Bolan, who unabashedly celebrated all three of those fantasy tropes in his music.\nThe early British punk band Alternative TV had a song in 1977 called “How Much Longer,” in which the preeminent fantasy author Michael Moorcock is explicitly lumped in with the hippie scene: “How much longer will joss sticks rule / They grow their hair long and stringy and wear Jesus boots / Afghan coats, yeah, making peace signs, man / Talk about Moorcock, Floyd down the Reading Festival?” Punk was all about gritty social realism and pugnacious confrontation; escapism of any kind was deemed the enemy.\nThat said, X-Ray Spex weren’t the only punk band of the ’70s explosion that tapped into the nervier side of science fiction. A handful of punk bands referenced SF here and there; Scotland’s peppy, outrageously-costumed The Rezillos steeped themselves in b-movie schlock, naming songs “Destination Venus” and “Flying Saucer Attack.” The Clash namechecked the villainous cyborgs the Daleks in their 1977 song “Remote Control.” The Adicts took on the eerie, boiler-suit-and-bowler-hat look of the droogs from Stanley Kubrick’s A Clockwork Orange, adapted from Anthony Burgess’ 1962 dystopian book. In fact, A Clockwork Orange’s lurid look at youth-gang brutality in the near future held sway on many punks, including the Misfits. The New Jersey band formed in 1977, and leader Glenn Danzig turned their morbid yet catchy songs into miniature tributes to many science fiction and horror films and tropes, from “I Turned Into a Martian” to “Astro Zombies.”\nIt’s a great irony that, within a decade of punk’s big bang in 1977, a new subgenre of science fiction—cyberpunk—would co-opt the term as a suffix, one that would eventually and enthusiastically be used in an ever increasing array of science fiction and fantasy subgenres, from steampunk to clockpunk to dieselpunk to mythpunk. Punk may not have had more than a grudging rapport with science fiction and fantasy at first, but the genres haven’t held any grudges.\nStyrene was born Marianne Joan Elliott-Said in 1957, the daughter of a Scottish-Irish mother and a Somali father. After a period of teenage rebellion in the mid-’70s—including a stint as a hippie, not to mention a failed record as a reggae singer, titled “Silly Billy,” that was released in 1976 under the name Mari Elliott—Styrene renamed herself when she became baptized by punk.\nShe was nineteen when she assumed her new persona. Her band X-Ray Spex was inspired by the shocking phenomenon of The Sex Pistols, whose lewd, sneering, blasphemous mouthpiece Johnny “Rotten” Lydon had become Britain’s public enemy number one. For all its infamy, though, punk broke down doors. Hordes of kids who had previously never thought themselves motivated or talented enough to start a band picked up guitars, drums, and microphones. And as crude as punk proudly was, they began expressing themselves.\nX-Ray Spex were part of that wave, but they were a different kind of punk band. Instead of spiking her hair, Styrene kept it curly. Instead of dressing in leather, safety pins, bondage pants, and other garb meant to evoke an image of nihilistic sadomasochism, Styrene wrapped herself in vivid pastels and kitschy clothes from secondhand shops. Her pop-art style carried over to the name of the band, which was taken from the Cold War-era toy called X-Ray Specs—allegedly able to imbue the wearer with the ability to see through skin and clothes—which was advertised primarily in comic books.\nIt’s telling that X-Ray Spex dubbed themselves after a cheap, frivolous, clearly fraudulent bauble. Styrene, after all, took the name of a plastic as her pseudonym. On Germfree Adolescents, the song “Art-I-Ficial” addresses that plastic nature, the slick and hermetic falseness that had come to envelope consumer society. In it Styrene sings, “My existence is elusive / The kind that is supported / By mechanical resources,” as if she’s enslaved in a state of blissful yet horrific cybernetic stasis.\nHer feeling wasn’t an isolated one. In the ’60s and ’70s, technophobia had established itself one of the staple themes of science fiction, after the generally optimistic Golden Age of Science Fiction had given way to the more cynical and complex New Wave. Dystopia gripped the popular imagination, and technology was crucial to the praxis of oppression. From The Twilight Zone episode “A Thing About Machines”—in which everyday appliances turn against their unappreciative owner—to Walter M. Miller, Jr.’s classic science fiction novel A Canticle for Leibowitz, which prophesizes a post-apocalyptic future that shuns science.\nRather than recoil from technology, however, Styrene embraces it with postmodern irony. That gleeful capitulation to mass-marketed inhumanity makes it all the more chilling when she claims, “I wanna be Instamatic / I wanna be a frozen pea / I wanna be dehydrated / In a consumer society,” in the in X-Ray Spex song “Art-I-Ficial.” The phrase “frozen pea” very nearly rhymes with “Soylent Green”; in fact, the people-derived foodstuff from Harry Harrison’s novel Make Room! Make Room! could easily be substituted into the song without significantly changing its meaning.\nConsumerism in its most rampant form is another SF theme that dominates Germfree Adolescents. Amid its serrated guitars, squawking saxophone, and barbed pop hooks, the album weaves an ironic, sophisticated subtext that mocks its own commercial aspirations while undeniably embodying, if not emblemizing, them. It envisions an insidiously euphoric future in which a gleaming sheen of artifice and homogeneity cocoons society like so much shrink wrap. And whether we like it or not, Styrene posits, that future is now. As she told John Savage in his book England’s Dreaming: Anarchy, Sex Pistols, Punk Rock, and Beyond:\nMy thing was more like consumerism, plastic artificial living. [ . . . ] There was so much junk then. The idea was to send it all up. Screaming about it, saying: “Look, this is what you have done to me, turned me into a piece of Styrofoam, I am your product. And this is what you created: Do you like her?”\nThe record-buying public in England did indeed like her, shrill deconstruction and all. Styrene, for a brief time, became a bona fide pop star in England, thanks to infectious punk anthems like “The Day the World Turned Day-Glo,” a propulsive song with hallucinatory couplets such as “X-rays were penetrating through the latex breeze / Synthetic fiber, see-through leaves fell from nylon trees,” which might have come straight out of one of J. G. Ballard’s dreamlike catastrophe novels, but especially 1966’s The Crystal World. That exultation in pure plastic-ness set the tone for the new wave music of the ’80s to follow, which glibly skimmed the surface of Styrene’s image and sound without touching the substance underneath.\n“I wanted to write something using all kinds of plastic words and artificial things, make kind of a fantasy style around it,” Styrene said of “The Day the World Turned Day-Glo,” adding, “It means something too. In an indirect way it’s about the modern world, and maybe you could say it’s futuristic.” Styrene never spoke openly about any possible science fiction influences on her antiseptic yet kaleidoscopic view of art and society, but it had many precedents in SF. The relation between consumerism and conformity is at the core of Aldous Huxley’s 1932 milestone Brave New World, a novel whose ideas have since trickled down and permeated the cultural bedrock.\nThese ideas also pop up in the works of Golden Age science fiction authors Frederick Pohl and Cyril M. Kornbluth, both separately and as collaborators. In the 1950s, Pohl and Kornbluth each published short stories—“The Midas Plague” and “The Marching Morons,” respectively—that projected the growing trend of consumerist obsession into a nightmarish tomorrow, and the two co-wrote the like-minded novels The Space Merchants and Search the Sky. Satirical and scathing, these stories served as cautionary tales against the herd mentality that Pohl and Kornbluth saw American society eagerly adopt, all too soon after the defeat of Fascism in Europe in World War II. Capitalist society purported to exalt the individual, but given near infinite choice, people chose to be the same anyway. They even identified themselves by packages, brands, and consumer choices as much as anything that’s unique and intrinsic to themselves. It’s the same unsettling paradox that Styrene oozes, from her name to her music.\nStyrene’s sly sense of humor dovetails with another work of science fiction, one that was rising at the same time as X-Ray Spex. In 1978, Douglas Adams’ radio show The Hitchhiker’s Guide to the Galaxy debuted on the BBC, followed a year later by his novelization. The clever, madcap tale of a hapless human named Arthur Dent who stumbles toward the secrets of the cosmos after witnessing the destruction of Earth (to make way for an intergalactic bypass), The Hitchhiker’s Guide captured the minds of a generation and became an instant phenomenon—and while Adams wasn’t a punk by any stretch of the imagination, his iconoclastic attitude and sharp wit couldn’t have been more in tune with Styrene’s.\nAs befits X-Ray Spex’s worship of superficiality, the only blatant reference to science fiction in Styrene’s lyrics pertain to the most popular SF television show of the time. “Bionic Man is jumping / Through the television set / He’s about to materialize / And guess who’s coming next,” she sings in “Genetic Engineering,” referencing the titular hero of The Bionic Man as played by Lee Majors.\nGranted, Majors’ character isn’t genetically engineered; he’s a cyborg, half man and half machine. If anything, though, that cheerful disregard for factual rigor only makes Styrene’s slapdash, secondhand repurposing of science fiction seem that much more fitting. Tragically, Styrene’s knack for blurring the boundaries between science fact and science fiction took on a devastating dimension when, in 1979, her then-undiagnosed mental illness contributed to a startling vision she saw while on tour with X-Ray Spex. In England’s Dreaming, she remembers:\nAll of a sudden I looked out of the hotel window. And I saw this sort of energy. It was bright, bright, luminous pink, and it had a disc shape. It was faster than the speed of light. I was inside a window, but the radiation effect hit my body. I was suffering afterwards, and my body kept going hot and cold.\nX-Ray Spex fell apart soon after Styrene’s breakdown. From there, her forays into music were sporadic; she issued three solo albums over the decades, including 1980’s restrained yet sublime Translucence, which vibrates on some blissed-out plane of cosmic mysticism—that is, as much as a synth-heavy new-wave album could do that. X-Ray Spex regrouped for a comeback album in 1994, Conscious Consumer, but practically all of the SF-centric elements of Germfree Adolescents were stripped away in favor of more on-the-nose social statements. Styrene still delivered them playfully, even if her unique alchemy of surreal SF and biting commentary had been diluted.\nStyrene’s final solo album, Generation Indigo, came out in April of 2011. She died of cancer the week of its release at the age of fifty-three. Even at the end, her voice retained an elastic youthfulness, as if she’d been hermetically preserved in exactly the manner she once sang about in X-Ray Spex. Listening back to Germfree Adolescents, Styrene comes across as a citizen of some troubling, deceptively utopian future, one who has excavated the remnants of late-20th-century culture. Now, through the language of song, she’s attempting to make sense of our fossils. She’s not, however, an archaeologist. She simply found our civilization buried under her playground.\nJason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "source": "https://clarkesworldmagazine.com/heller_06_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Day-Glo Dystopia of Poly Styrene: Punk Prophet and Science Fiction Priestess by Jason Heller"}