{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "E Catherine Tobler", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "SD58erWFLy6uL+ssqLcD6MZGfLY=", "id": null, "license": null, "comments": "", "raw_text": "3360 words, short story  You Were She Who Abode  Cardee Findar dreams, but she’s wide awake.  She’s in the warzone, ashen walls rising around her in broken lines, but buttercream paint seeps through the gray. The pale yellow carries with it the scent of spring, a slice of blue sky, the slow curl of white curtains into a sunlit room. This place is far away; the ground shakes underfoot, rattling ash over paint, and she’s running, running with her heart in her throat and her hands wrapped around her rifle. Rifle pressed into breast the way Lottie should be. Seven strides to the alley—seven strides and she’s in, in and sliding down into the shadows. Her gaze latches on to Ginger across the street in another alley. Ginger prefers gunfire to silence; it tells them exactly where the enemy is.  “Mama?”  Cardee pushes the small voice in her head away. That voice is as distant as that calm yellow room. Ginger is in the here and now: Ginger and Bret and Stills, and the goddamned little shadow they’re chasing. Children in warzones aren’t a surprise, not now, but the first time she’d seen one, Cardee recoiled. They’re often lures, she knows; the urge to follow the small ones and haul them out of the wreckage is hard-wired. She wants to carry them somewhere safer. She doesn’t know where that might be.  Ginger breaks position to follow the kid into the tangle of narrow streets hung with paper lanterns from a long ago celebration. Blue, green, and—  “Gin—”  Cardee swallows the rest of her protest and at Bret’s snapped curse, runs. Runs across the street into the alley Ginger had occupied. Of the child, she has the impression of ratty clothes, bare feet, and knows the latter are the deal breaker for Ginger.  The first child they’d rescued had ruined feet from walking through the debris; Ginger spent days applying salve to them, only to have the doc tell them the feet couldn’t be saved. It makes the others harder—that kid hadn’t been a lure, he just needed out. He only planted hope inside Ginger when it came to every other kid.  The hardware store still stands, windows unbroken in their frames. Cardee draws up short, listens for Ginger. There is a sharp hiss and the thunder of retreating boots. She shoulders her way into the store, amid stripped shelves. Binned nails, hammers, and planks of wood stand in one corner but—  A slamming door erupts into flame a second later. The air is sharp with flying nails and hammers and Cardee drops to the floor, rolling until she’s under the nearest shelf. The shelf buckles with a second explosion and is shredded away with a third. Blood splatters the concrete floor amid the burning refuse, as if dripping from Cardee’s own face, but she can’t make sense of it.  “Mama.”  She gives in to the voice. “I know, baby.”  Cardee slides the warm cloth over Lottie’s temple, removing the haze of blood. Small brown face, so like her own. Wide black eyes blink up at her, tight sepia curls framing smooth apple cheeks. Cardee leans in to look at the wound.  “J-James d-dared me t-to jump,” Lottie whispers, anguished.  “Just a little scrape.” Cardee drops a kiss on Lottie’s forehead, reaches past her for the wipes and dermal sealer. She’s seen worse on the battlefield, but not worse on her daughter and though she forces a smile, the injury bothers her. Bothers her in a way she can’t quantify—  Nails, there were nails—  Cardee grits her teeth together, steadies her hands. This is now, not then, and Lottie flinches at the antiseptic wipe and then the cool flow of sealer.  “Green b-bandage?”  “You like all that green, don’t you?” But Cardee doesn’t protest her daughter’s choice. She presses the bandage over the wound, even though it’s not needed with the sealer already there.  “All that green, Mama.” Lottie’s smile ripples and through a haze of smoke, looks green in the corners. Cardee runs her thumb across it as Lottie lifts a hand to touch Cardee’s own temple where green lights pulse.  “Findar.”  That’s her name. She knows it’s her name, because she remembers stealing it from Ross. He thought he gave it to her on the lakeshore with the trees dipping low into the water and all their friends gathered close, but ten years on, she still feels like she stole it. Wood violets, wild roses, my black-eyed girls.  “Findar!”  Her fingers come away from the sky bloodied; they are snatched from her, tied against her side and she’s flying, airborne through the debris, away from Ginger and the small figure they were chasing. Cardee opens her mouth to tell Ginger the kid is there, just there beyond that pile of debris, and there’s another explosion. The world rocks and green sky tips then vanishes altogether as gloved hands draw her inside a warm, dark space, and she hears the chop-chop-chop of angel wings, as they arc high into the sky thirteen klicks from base.  Thirteen nails, doc says and drops the last into the basin. It falls with a clink, a fleck of blood, and Cardee sees faces in the red: Ross and the priest and if she closes her eyes she can feel Ross’s palm against hers. Palmers’ kiss was holy she had told him, but now there’s only the chatter of doc and his team and when these voices change, Cardee can’t latch onto why. The light takes on a clear quality, the smoke of the hotspot gone, and the bite of the stitcher is almost sweet as it crawls over her bare scalp. It tickles; the sensation tells her she’s alive.  The stitcher tiptoes over scalp while doc settles the VET into its place against the ruin of her hippocampus and he’s talking all the while, words that slide over Cardee’s consciousness and away. She knows he’s watching a screen while he talks, to see what her brain does with each word. Volatile, he calls the device. Like it might explode the way the hardware store did—  Ragged clothing and bare feet. Oh, bare feet. Cardee can feel the soft curve of Lottie’s toes against her chin.  Emotive transistor, doc says and his fingers are cool against her temple though warmth seems to sink into her skin, into her bones. Her left eye blossoms with sudden heat, the sting of salt.  Do that again, doc bids her.  Cardee doesn’t know what he means, but she thinks about Lottie’s toes, small and brown and sweet like sugar, and the salt stings her again as doc praises her. Good, good, he says, and Cardee swallows a sob. The green light floods his palm then fades as Cardee quiets. It won’t be perfect, he says, but—  —what is in this world, Ross says and his mouth moves over Cardee’s and she smiles, knowing neither one of them really wants perfection. They have always been a jumble and she’s content to stay that way. The idea that he would marry her when she means to serve their country is what sinks its hooks into her. That he would stay, no matter where they or she went, and when they go to the lakeshore all those years later and she tells him about the child, there is a quiet wonder in his eyes.  He is barefoot, jean cuffs rolled up and wet, and he tangles wild roses into Cardee’s hair. They’re pink like his tongue and later she presses these roses into a book which will sit on a shelf beside a box full of letters with different postmarks, all the places she has been. The book will sit until Lottie pulls it down at age three and scatters the flat, dried bundle everywhere. A year later, they still find bits of roses in the corners.  “Made it just the way you like,” Ross says, and leads Cardee to the corner where he’s placed her favorite chair with its worn arms and the quilt her grandmother pieced together. A tablet rests on the table beside an electric kettle which she knows holds Earl Grey. He helps her into the chair and she’s slow, like she can’t remember how to move, but the VET remembers for her, guiding her into the chair’s familiar hold.  A ring peeks out from Ross’s shirt collar as he moves, three strands of Irish gold braided together. His grandmother’s, but now hers, given to him so it couldn’t be taken even if her finger did feel bare without it. A thing to come back to he had joked, and as it slips free now he tucks it away before she can touch it. His brow creases. Don’t worry about that now, he tells her.  Ross’s hands are tentative as he settles her feet on the ottoman, as he pulls up the quilt and then reaches for her cup. The cup is sunrise orange and the tea floods it in a brown, steaming rush. Cardee draws in a breath and watches as Ross’s face is erased. The room seems to fold itself away under the rising steam and she’s in an alley again, watching a small, barefoot figure flit through the debris.  That was then, she tells herself, and tries to pull the walls of her room upright. Plaster and buttercream and not ash, but there’s only stone and choking smoke in this place. Stills presses a new magazine into her hand and she slots it into her rifle before running, running after Ginger through the debris, after the small barefoot form.  This is before, she knows. Before the hardware store. Three days? No—three months, months and this is the first kid, the one doc won’t be able to save.  Images shutter like an old film reel through her mind, guided by the VET in her temple. That was then but it’s also now, and Cardee follows Ginger over fallen stones that used to be walls that used to be houses that used to be homes.  There is a tall figure in a far door lifting a gun. Cardee lifts hers first and the figure crumples with a shriek, doesn’t move. Ginger is twelve steps from the kid, the boy, and Cardee knows she herself is twenty-five steps from the figure she shot down.  She will walk those steps, check the body, take the gun. She will. She already has.  Twenty-seven steps from the second figure who emerges behind the first, a young man in enemy colors, and he lifts his gun. Cardee takes him down too; he falls to his knees as if in prayer, then topples over.  Ginger tackles the boy, wrestles him to the ground and pins his arms behind him. Where are the others, she demands—where! And he says he doesn’t know—but he does and these kids just don’t want to go, don’t want to leave these streets that are home, home even though war has claimed them. Home, smeared into his cheeks and his bare, bloodied feet. Ginger hefts the boy, throws him over her shoulder, and they’re out, running as shells rain from the sky.  Cardee turns circles in wet grass. Don’t worry about getting wet, she tells Lottie, and they’re out, running as the rain pours from the summer sky. Lottie shrieks, like she might melt under the rain because she’s so sweet, but Cardee holds her hand and feels her daughter relax. The shriek turns to a laugh and Lottie is no longer worried about her dress, because it will dry on the laundry line when the sun comes out again. She twirls and Cardee watches those toes as they mash into the mud. Hot cocoa later, she thinks, but it’s already been later, that cocoa long drunk.  This is memory, Cardee tells herself, and pulls hard, hard enough to lift the walls of her room back into place. This was now. Her room, where nine year old Lottie now sits, bundled on the ottoman. Lottie watches everything and Cardee watches back. Lottie is taller than she remembers, all long arms and legs, her hair longer and worn pulled up on the top of her head with a mass of bright green and blue ribbons. A clumsy knot, her father’s work.  “Mama?”  Cardee offers her hand for holding. The hand Lottie offers is larger than Cardee remembers, long slim fingers. Palm to palm they sit until Lottie makes a sound, a sound like she wants to cry but is too old for such things now. Lottie curls into her mother’s lap, the way a nut curls into its shell, and she’s crying. Don’t w-worry about getting w-wet.  There was rain, Cardee thinks, rain like nails, and she lifts a hand to feel the line of her skull, whole now but still shorn, wrapped under a bright cloth. Lottie shudders and Cardee hauls her closer.  “It’s okay, baby. It helps mama remember.”  Lottie’s fingers press cool against Cardee’s temple, gentle over the soft light which flickers beneath the skin. Of course it was green. Lottie’s mouth lifts in a tentative smile at the sight and—  —it’s doc looking at her for the first time after the surgery, his face clear and sharp and framed by all that brilliant white light. Cardee stares the way she stared at Ross when he proposed, like she can’t understand or believe it. That was then, she tells herself, but doc tells her it won’t be perfect. It’ll run, but it’ll stutter, too, like a tank you need kick every now and then. Cardee doesn’t want it; Cardee can’t be Cardee without it, though. She understands that. The VET can reach pieces of her memory that she no longer can.  “Mama.”  That voice hauls her back to the yellow room with its curtains, with its small nut of a girl. Cardee doesn’t remember Lottie this way and the VET hums hard, as if trying to reconcile two different pieces of paperwork. The numbers don’t add up. Small Lottie waving goodbye in the driveway, Ross and Gamma at her side; this is the last image of Lottie the VET can give her. The Lottie who hasn’t outgrown the shoes that Cardee saw in the donation box as they came inside today. The Lottie who hasn’t yet flung herself off the swing at a friend’s dare.  “I’m here, baby.”  Always that: baby. Cardee clings to the word, the way she does to her daughter. She’s here, but she’s not. Part of her is still in those streets. The VET pulls up her most recent memory, running with it, because that’s what it does. Running—  Feet hit the ground hard as she and the fireteam seek another kid. There were two down here, two and—  Two kids emerge from the rubble, rifles cocked and drawn on the team. Cardee draws up, but doesn’t lower her rifle. These kids are taller, but still young. Eight, nine. Lottie’s age now, she thinks and something inside her turns over. This was not now, this was then, but something inside her hides its face.  “In-de-pen-dents?” one of the kids asks, drawing the word out into four hard syllables.  Bret strides forward, kicks up clouds of dust in the ruined street. “Co-a-li-tion,” he spits and the world erupts.  “Wrong answer!”  They don’t want to go, this band of kids, and they fight to stay. Cardee screams at Bret to back off, but it’s too late. She smells the blood, the gunpowder, and feels the sudden press of a knife against her side. Before her, the scene unfolds as it did before, the way she remembers, down to the taste of sweat on her lip. Only one of the kids gets away. Escapes to run and set a trap in the hardware store where nails— Where nails—  Memory stutters. Her mind goes blank.  “Mama?”  Cardee feels the touch of fingers on her face, pressing gentle and then with more insistence. She blinks and looks at the girl in her lap, but cannot recall her name. Does not know why she’s here. Bret would be here soon. Bret and Ginger and—  “Mama!”  But the only children she knows live in the streets. Rubble rats, sand kids, some used as weapons, others in need of rescue. This girl is whole and clean. A green bandage clings to her temple, but her feet are uninjured. Not bloody or cut and Cardee can’t process it. The girl pushes away. Those small feet thunder away.  “Da! Daaaaa!”  Cardee blinks, the room around her unfamiliar. She wanders, touching walls that should be made of ash. Why is there a ceiling and how can there be windows without cracks? Just when it seems the walls might crumble to ruin under her fingers, there’s another hand, this one drawing her own from the wall. Cardee whimpers because part of her wants to see these walls fall down. It’s what she knows, jagged lines against smoky sky.  There is mark upon one wall, where a frame used to rest. A frame that held a photograph, she thinks. Fingers trace this line, but there is no frame. Her eyes sweep the room and she’s moving past the man, rifling through drawers, careless with everything that isn’t the frame that belongs upon the wall. Careless until her fingers close around a bundle of letters. Handwritten, from far away places, they smell like ash and home both. Tears smudge the writing—before or after the sending and does it matter? Pushed to the back of the drawer, she thinks that is what matters. More letters and more and then at the bottom, the frame. The photograph.  It’s a face half familiar, dark and proud, and by her side there stands a man as pale as she is dark. That man, she thinks, looking up at him now, then back to the photograph. Behind them sprawls a lake and the shore is tangled with long grasses, willowed trees. Cardee lifts the frame and brings it to the wall, but there is no nail.  There were nails—  “Cardee. Beloved.” His hand covers hers.  “The team?” she asks.  He swallows hard. “Safe.”  A bright, striped flag across the length of a casket. The image is gone as quickly as it comes.  The man guides her toward the chair in the corner, with its quilt and tablet and cooling tea. “You’re home.”  Cardee shakes her head and a deep pain flares at her temple, burning down her spine. She presses the framed photograph into her lap. “Volatile,” she whispers. Explosive.  “Volatile Emotive Transistor,” he says, and there’s something in his eyes, something Cardee cannot name. His hand tightens on hers, shaking, and the line of a ring presses into her bones. His ring. His free hand lifts, to trace her temple where green lights have stilled.  Warmth and salt burn her eyes. “I should . . . ” Her head comes up. Her attention narrows on the doorway. There should be a figure there and she should have her rifle, but there isn’t and she doesn’t. A tank needs kicking, she thinks, but doesn’t know why. She looks back to the man. “I don’t remember.”  He eases his hold on her, hand sliding down, around, so that palm presses to palm. Cardee’s breath hisses and fresh fire courses through her body. Old pathways blazing into new.  “Wood violets, wild roses, my black-eyed girls,” he says.  She smells the lake now and the willows brush her shoulders as they walk, hand in hand through the almost-cold grass underfoot. He offers her a tangle of violets and one of roses and then a braided ring, a ring that slides onto her finger as though it belongs. The way he slides it onto her finger now, warm from his own body.  “Palmers’ k-kiss is holy?”  There’s something else in his eyes now. Warmth and salt and everything he put away while she was gone. He smiles slow, and it’s like nothing Cardee has seen before. Nothing and yet everything she knows, and there comes the sound of small bare feet, thumping down the hall. Toward them. My black-eyed girls.  “Come from those streets, Cardee Findar. I will remember with you.”", "text": "3360 words, short story\nYou Were She Who Abode\nCardee Findar dreams, but she’s wide awake.\nShe’s in the warzone, ashen walls rising around her in broken lines, but buttercream paint seeps through the gray. The pale yellow carries with it the scent of spring, a slice of blue sky, the slow curl of white curtains into a sunlit room. This place is far away; the ground shakes underfoot, rattling ash over paint, and she’s running, running with her heart in her throat and her hands wrapped around her rifle. Rifle pressed into breast the way Lottie should be. Seven strides to the alley—seven strides and she’s in, in and sliding down into the shadows. Her gaze latches on to Ginger across the street in another alley. Ginger prefers gunfire to silence; it tells them exactly where the enemy is.\n“Mama?”\nCardee pushes the small voice in her head away. That voice is as distant as that calm yellow room. Ginger is in the here and now: Ginger and Bret and Stills, and the goddamned little shadow they’re chasing. Children in warzones aren’t a surprise, not now, but the first time she’d seen one, Cardee recoiled. They’re often lures, she knows; the urge to follow the small ones and haul them out of the wreckage is hard-wired. She wants to carry them somewhere safer. She doesn’t know where that might be.\nGinger breaks position to follow the kid into the tangle of narrow streets hung with paper lanterns from a long ago celebration. Blue, green, and—\n“Gin—”\nCardee swallows the rest of her protest and at Bret’s snapped curse, runs. Runs across the street into the alley Ginger had occupied. Of the child, she has the impression of ratty clothes, bare feet, and knows the latter are the deal breaker for Ginger.\nThe first child they’d rescued had ruined feet from walking through the debris; Ginger spent days applying salve to them, only to have the doc tell them the feet couldn’t be saved. It makes the others harder—that kid hadn’t been a lure, he just needed out. He only planted hope inside Ginger when it came to every other kid.\nThe hardware store still stands, windows unbroken in their frames. Cardee draws up short, listens for Ginger. There is a sharp hiss and the thunder of retreating boots. She shoulders her way into the store, amid stripped shelves. Binned nails, hammers, and planks of wood stand in one corner but—\nA slamming door erupts into flame a second later. The air is sharp with flying nails and hammers and Cardee drops to the floor, rolling until she’s under the nearest shelf. The shelf buckles with a second explosion and is shredded away with a third. Blood splatters the concrete floor amid the burning refuse, as if dripping from Cardee’s own face, but she can’t make sense of it.\n“Mama.”\nShe gives in to the voice. “I know, baby.”\nCardee slides the warm cloth over Lottie’s temple, removing the haze of blood. Small brown face, so like her own. Wide black eyes blink up at her, tight sepia curls framing smooth apple cheeks. Cardee leans in to look at the wound.\n“J-James d-dared me t-to jump,” Lottie whispers, anguished.\n“Just a little scrape.” Cardee drops a kiss on Lottie’s forehead, reaches past her for the wipes and dermal sealer. She’s seen worse on the battlefield, but not worse on her daughter and though she forces a smile, the injury bothers her. Bothers her in a way she can’t quantify—\nNails, there were nails—\nCardee grits her teeth together, steadies her hands. This is now, not then, and Lottie flinches at the antiseptic wipe and then the cool flow of sealer.\n“Green b-bandage?”\n“You like all that green, don’t you?” But Cardee doesn’t protest her daughter’s choice. She presses the bandage over the wound, even though it’s not needed with the sealer already there.\n“All that green, Mama.” Lottie’s smile ripples and through a haze of smoke, looks green in the corners. Cardee runs her thumb across it as Lottie lifts a hand to touch Cardee’s own temple where green lights pulse.\n“Findar.”\nThat’s her name. She knows it’s her name, because she remembers stealing it from Ross. He thought he gave it to her on the lakeshore with the trees dipping low into the water and all their friends gathered close, but ten years on, she still feels like she stole it. Wood violets, wild roses, my black-eyed girls.\n“Findar!”\nHer fingers come away from the sky bloodied; they are snatched from her, tied against her side and she’s flying, airborne through the debris, away from Ginger and the small figure they were chasing. Cardee opens her mouth to tell Ginger the kid is there, just there beyond that pile of debris, and there’s another explosion. The world rocks and green sky tips then vanishes altogether as gloved hands draw her inside a warm, dark space, and she hears the chop-chop-chop of angel wings, as they arc high into the sky thirteen klicks from base.\nThirteen nails, doc says and drops the last into the basin. It falls with a clink, a fleck of blood, and Cardee sees faces in the red: Ross and the priest and if she closes her eyes she can feel Ross’s palm against hers. Palmers’ kiss was holy she had told him, but now there’s only the chatter of doc and his team and when these voices change, Cardee can’t latch onto why. The light takes on a clear quality, the smoke of the hotspot gone, and the bite of the stitcher is almost sweet as it crawls over her bare scalp. It tickles; the sensation tells her she’s alive.\nThe stitcher tiptoes over scalp while doc settles the VET into its place against the ruin of her hippocampus and he’s talking all the while, words that slide over Cardee’s consciousness and away. She knows he’s watching a screen while he talks, to see what her brain does with each word. Volatile, he calls the device. Like it might explode the way the hardware store did—\nRagged clothing and bare feet. Oh, bare feet. Cardee can feel the soft curve of Lottie’s toes against her chin.\nEmotive transistor, doc says and his fingers are cool against her temple though warmth seems to sink into her skin, into her bones. Her left eye blossoms with sudden heat, the sting of salt.\nDo that again, doc bids her.\nCardee doesn’t know what he means, but she thinks about Lottie’s toes, small and brown and sweet like sugar, and the salt stings her again as doc praises her. Good, good, he says, and Cardee swallows a sob. The green light floods his palm then fades as Cardee quiets. It won’t be perfect, he says, but—\n—what is in this world, Ross says and his mouth moves over Cardee’s and she smiles, knowing neither one of them really wants perfection. They have always been a jumble and she’s content to stay that way. The idea that he would marry her when she means to serve their country is what sinks its hooks into her. That he would stay, no matter where they or she went, and when they go to the lakeshore all those years later and she tells him about the child, there is a quiet wonder in his eyes.\nHe is barefoot, jean cuffs rolled up and wet, and he tangles wild roses into Cardee’s hair. They’re pink like his tongue and later she presses these roses into a book which will sit on a shelf beside a box full of letters with different postmarks, all the places she has been. The book will sit until Lottie pulls it down at age three and scatters the flat, dried bundle everywhere. A year later, they still find bits of roses in the corners.\n“Made it just the way you like,” Ross says, and leads Cardee to the corner where he’s placed her favorite chair with its worn arms and the quilt her grandmother pieced together. A tablet rests on the table beside an electric kettle which she knows holds Earl Grey. He helps her into the chair and she’s slow, like she can’t remember how to move, but the VET remembers for her, guiding her into the chair’s familiar hold.\nA ring peeks out from Ross’s shirt collar as he moves, three strands of Irish gold braided together. His grandmother’s, but now hers, given to him so it couldn’t be taken even if her finger did feel bare without it. A thing to come back to he had joked, and as it slips free now he tucks it away before she can touch it. His brow creases. Don’t worry about that now, he tells her.\nRoss’s hands are tentative as he settles her feet on the ottoman, as he pulls up the quilt and then reaches for her cup. The cup is sunrise orange and the tea floods it in a brown, steaming rush. Cardee draws in a breath and watches as Ross’s face is erased. The room seems to fold itself away under the rising steam and she’s in an alley again, watching a small, barefoot figure flit through the debris.\nThat was then, she tells herself, and tries to pull the walls of her room upright. Plaster and buttercream and not ash, but there’s only stone and choking smoke in this place. Stills presses a new magazine into her hand and she slots it into her rifle before running, running after Ginger through the debris, after the small barefoot form.\nThis is before, she knows. Before the hardware store. Three days? No—three months, months and this is the first kid, the one doc won’t be able to save.\nImages shutter like an old film reel through her mind, guided by the VET in her temple. That was then but it’s also now, and Cardee follows Ginger over fallen stones that used to be walls that used to be houses that used to be homes.\nThere is a tall figure in a far door lifting a gun. Cardee lifts hers first and the figure crumples with a shriek, doesn’t move. Ginger is twelve steps from the kid, the boy, and Cardee knows she herself is twenty-five steps from the figure she shot down.\nShe will walk those steps, check the body, take the gun. She will. She already has.\nTwenty-seven steps from the second figure who emerges behind the first, a young man in enemy colors, and he lifts his gun. Cardee takes him down too; he falls to his knees as if in prayer, then topples over.\nGinger tackles the boy, wrestles him to the ground and pins his arms behind him. Where are the others, she demands—where! And he says he doesn’t know—but he does and these kids just don’t want to go, don’t want to leave these streets that are home, home even though war has claimed them. Home, smeared into his cheeks and his bare, bloodied feet. Ginger hefts the boy, throws him over her shoulder, and they’re out, running as shells rain from the sky.\nCardee turns circles in wet grass. Don’t worry about getting wet, she tells Lottie, and they’re out, running as the rain pours from the summer sky. Lottie shrieks, like she might melt under the rain because she’s so sweet, but Cardee holds her hand and feels her daughter relax. The shriek turns to a laugh and Lottie is no longer worried about her dress, because it will dry on the laundry line when the sun comes out again. She twirls and Cardee watches those toes as they mash into the mud. Hot cocoa later, she thinks, but it’s already been later, that cocoa long drunk.\nThis is memory, Cardee tells herself, and pulls hard, hard enough to lift the walls of her room back into place. This was now. Her room, where nine year old Lottie now sits, bundled on the ottoman. Lottie watches everything and Cardee watches back. Lottie is taller than she remembers, all long arms and legs, her hair longer and worn pulled up on the top of her head with a mass of bright green and blue ribbons. A clumsy knot, her father’s work.\n“Mama?”\nCardee offers her hand for holding. The hand Lottie offers is larger than Cardee remembers, long slim fingers. Palm to palm they sit until Lottie makes a sound, a sound like she wants to cry but is too old for such things now. Lottie curls into her mother’s lap, the way a nut curls into its shell, and she’s crying. Don’t w-worry about getting w-wet.\nThere was rain, Cardee thinks, rain like nails, and she lifts a hand to feel the line of her skull, whole now but still shorn, wrapped under a bright cloth. Lottie shudders and Cardee hauls her closer.\n“It’s okay, baby. It helps mama remember.”\nLottie’s fingers press cool against Cardee’s temple, gentle over the soft light which flickers beneath the skin. Of course it was green. Lottie’s mouth lifts in a tentative smile at the sight and—\n—it’s doc looking at her for the first time after the surgery, his face clear and sharp and framed by all that brilliant white light. Cardee stares the way she stared at Ross when he proposed, like she can’t understand or believe it. That was then, she tells herself, but doc tells her it won’t be perfect. It’ll run, but it’ll stutter, too, like a tank you need kick every now and then. Cardee doesn’t want it; Cardee can’t be Cardee without it, though. She understands that. The VET can reach pieces of her memory that she no longer can.\n“Mama.”\nThat voice hauls her back to the yellow room with its curtains, with its small nut of a girl. Cardee doesn’t remember Lottie this way and the VET hums hard, as if trying to reconcile two different pieces of paperwork. The numbers don’t add up. Small Lottie waving goodbye in the driveway, Ross and Gamma at her side; this is the last image of Lottie the VET can give her. The Lottie who hasn’t outgrown the shoes that Cardee saw in the donation box as they came inside today. The Lottie who hasn’t yet flung herself off the swing at a friend’s dare.\n“I’m here, baby.”\nAlways that: baby. Cardee clings to the word, the way she does to her daughter. She’s here, but she’s not. Part of her is still in those streets. The VET pulls up her most recent memory, running with it, because that’s what it does. Running—\nFeet hit the ground hard as she and the fireteam seek another kid. There were two down here, two and—\nTwo kids emerge from the rubble, rifles cocked and drawn on the team. Cardee draws up, but doesn’t lower her rifle. These kids are taller, but still young. Eight, nine. Lottie’s age now, she thinks and something inside her turns over. This was not now, this was then, but something inside her hides its face.\n“In-de-pen-dents?” one of the kids asks, drawing the word out into four hard syllables.\nBret strides forward, kicks up clouds of dust in the ruined street. “Co-a-li-tion,” he spits and the world erupts.\n“Wrong answer!”\nThey don’t want to go, this band of kids, and they fight to stay. Cardee screams at Bret to back off, but it’s too late. She smells the blood, the gunpowder, and feels the sudden press of a knife against her side. Before her, the scene unfolds as it did before, the way she remembers, down to the taste of sweat on her lip. Only one of the kids gets away. Escapes to run and set a trap in the hardware store where nails— Where nails—\nMemory stutters. Her mind goes blank.\n“Mama?”\nCardee feels the touch of fingers on her face, pressing gentle and then with more insistence. She blinks and looks at the girl in her lap, but cannot recall her name. Does not know why she’s here. Bret would be here soon. Bret and Ginger and—\n“Mama!”\nBut the only children she knows live in the streets. Rubble rats, sand kids, some used as weapons, others in need of rescue. This girl is whole and clean. A green bandage clings to her temple, but her feet are uninjured. Not bloody or cut and Cardee can’t process it. The girl pushes away. Those small feet thunder away.\n“Da! Daaaaa!”\nCardee blinks, the room around her unfamiliar. She wanders, touching walls that should be made of ash. Why is there a ceiling and how can there be windows without cracks? Just when it seems the walls might crumble to ruin under her fingers, there’s another hand, this one drawing her own from the wall. Cardee whimpers because part of her wants to see these walls fall down. It’s what she knows, jagged lines against smoky sky.\nThere is mark upon one wall, where a frame used to rest. A frame that held a photograph, she thinks. Fingers trace this line, but there is no frame. Her eyes sweep the room and she’s moving past the man, rifling through drawers, careless with everything that isn’t the frame that belongs upon the wall. Careless until her fingers close around a bundle of letters. Handwritten, from far away places, they smell like ash and home both. Tears smudge the writing—before or after the sending and does it matter? Pushed to the back of the drawer, she thinks that is what matters. More letters and more and then at the bottom, the frame. The photograph.\nIt’s a face half familiar, dark and proud, and by her side there stands a man as pale as she is dark. That man, she thinks, looking up at him now, then back to the photograph. Behind them sprawls a lake and the shore is tangled with long grasses, willowed trees. Cardee lifts the frame and brings it to the wall, but there is no nail.\nThere were nails—\n“Cardee. Beloved.” His hand covers hers.\n“The team?” she asks.\nHe swallows hard. “Safe.”\nA bright, striped flag across the length of a casket. The image is gone as quickly as it comes.\nThe man guides her toward the chair in the corner, with its quilt and tablet and cooling tea. “You’re home.”\nCardee shakes her head and a deep pain flares at her temple, burning down her spine. She presses the framed photograph into her lap. “Volatile,” she whispers. Explosive.\n“Volatile Emotive Transistor,” he says, and there’s something in his eyes, something Cardee cannot name. His hand tightens on hers, shaking, and the line of a ring presses into her bones. His ring. His free hand lifts, to trace her temple where green lights have stilled.\nWarmth and salt burn her eyes. “I should . . . ” Her head comes up. Her attention narrows on the doorway. There should be a figure there and she should have her rifle, but there isn’t and she doesn’t. A tank needs kicking, she thinks, but doesn’t know why. She looks back to the man. “I don’t remember.”\nHe eases his hold on her, hand sliding down, around, so that palm presses to palm. Cardee’s breath hisses and fresh fire courses through her body. Old pathways blazing into new.\n“Wood violets, wild roses, my black-eyed girls,” he says.\nShe smells the lake now and the willows brush her shoulders as they walk, hand in hand through the almost-cold grass underfoot. He offers her a tangle of violets and one of roses and then a braided ring, a ring that slides onto her finger as though it belongs. The way he slides it onto her finger now, warm from his own body.\n“Palmers’ k-kiss is holy?”\nThere’s something else in his eyes now. Warmth and salt and everything he put away while she was gone. He smiles slow, and it’s like nothing Cardee has seen before. Nothing and yet everything she knows, and there comes the sound of small bare feet, thumping down the hall. Toward them. My black-eyed girls.\n“Come from those streets, Cardee Findar. I will remember with you.”", "source": "https://clarkesworldmagazine.com/tobler_06_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: You Were She Who Abode by E. Catherine Tobler"}