{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "NnUsqGb2jmJofOmBlnPJ9RoqHVY=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: What is it with Readercon?  July marks my annual pilgrimage to Readercon, a literary genre convention in Massachusetts, that this year has moved from Burlington to Quincy. No matter how amazing the new location turns out to be, I’m still going to have a special place in my heart for the old one. It was there, ten years ago, that Clarkesworld Magazine was born. Even though we will publish our ten-year anniversary issue in October, for me, the celebration starts now. Although I never would have guessed it at the time, the decision to launch this magazine was a life-changing event. It’s introduced me to some of my closest friends, provided countless hours of enjoyment, and opened a path to a new career doing something I love.  Readercon, however, wasn’t satisfied with me having merely one life-changing event! Four years ago, on the first day of the convention, I suffered a near-fatal “widowmaker” heart attack that no one could have seen coming. I was lucky. A few hours earlier and I would have been driving alone on a highway from New Jersey to Massachusetts. Instead, I was at the convention hotel, conveniently located one block away from Lahey Clinic, one of the best hospitals in that area of the country. They saved my life and forever have my gratitude. You don’t face something like that and not come out changed, however.  Those first few hours in the hospital were the most frightening time in my life, so it was only natural that I’d experience some dread about returning the following year. So, in an attempt to try to take back the date and location, I decided to have my first Kickstarter campaign end on the anniversary of the heart attack. The project: Upgraded, a cyborg anthology inspired by the defibrillator surgery I needed to offset the damage to my heart. It funded and now, there’s another anniversary for Readercon.  And now it is time to let some other month have some fun. A few weeks ago saw the publication of the first of my The Best Science Fiction of the Year anthologies, so that’s a good start. In August I turn fifty, which I appreciate now more than I would have before the heart attack, so that’s something else to look forward to. There’s also Worldcon, where I’m up for a Hugo, for Best Editor Short Form; and a Chesley Award, for Best Art Director. Then October gets our ten year anniversary issue and somewhere in there, Lisa will get a job and I’ll quit mine. Yeah, I think that’s enough excitement for now.  Going to be at Readercon this year? Stop by and say hi. I’ll be the one relaxing behind the Clarkesworld table, trying to stay out of trouble . . . Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: What is it with Readercon?\nJuly marks my annual pilgrimage to Readercon, a literary genre convention in Massachusetts, that this year has moved from Burlington to Quincy. No matter how amazing the new location turns out to be, I’m still going to have a special place in my heart for the old one. It was there, ten years ago, that Clarkesworld Magazine was born. Even though we will publish our ten-year anniversary issue in October, for me, the celebration starts now. Although I never would have guessed it at the time, the decision to launch this magazine was a life-changing event. It’s introduced me to some of my closest friends, provided countless hours of enjoyment, and opened a path to a new career doing something I love.\nReadercon, however, wasn’t satisfied with me having merely one life-changing event! Four years ago, on the first day of the convention, I suffered a near-fatal “widowmaker” heart attack that no one could have seen coming. I was lucky. A few hours earlier and I would have been driving alone on a highway from New Jersey to Massachusetts. Instead, I was at the convention hotel, conveniently located one block away from Lahey Clinic, one of the best hospitals in that area of the country. They saved my life and forever have my gratitude. You don’t face something like that and not come out changed, however.\nThose first few hours in the hospital were the most frightening time in my life, so it was only natural that I’d experience some dread about returning the following year. So, in an attempt to try to take back the date and location, I decided to have my first Kickstarter campaign end on the anniversary of the heart attack. The project: Upgraded, a cyborg anthology inspired by the defibrillator surgery I needed to offset the damage to my heart. It funded and now, there’s another anniversary for Readercon.\nAnd now it is time to let some other month have some fun. A few weeks ago saw the publication of the first of my The Best Science Fiction of the Year anthologies, so that’s a good start. In August I turn fifty, which I appreciate now more than I would have before the heart attack, so that’s something else to look forward to. There’s also Worldcon, where I’m up for a Hugo, for Best Editor Short Form; and a Chesley Award, for Best Art Director. Then October gets our ten year anniversary issue and somewhere in there, Lisa will get a job and I’ll quit mine. Yeah, I think that’s enough excitement for now.\nGoing to be at Readercon this year? Stop by and say hi. I’ll be the one relaxing behind the Clarkesworld table, trying to stay out of trouble . . .\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_07_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: What is it with Readercon? by Neil Clarke"}