{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "14/oq4+HYhxXpvmYRnFcJtUEx+M=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor’s Desk: Anthologies, Patreon, and the 2013 Reader’s Poll & Contest  Happy New Year!  If you are new to the Clarkesworld family, you may not know that we also publish an annual anthology series that collects all the original fiction published over the course of a year. The first two volumes went by the name Realms 1 and 2, but since then they’ve carried the Clarkesworld name. The print editions look great on your bookshelf, but the ebook editions are good too.  Our latest volume, Clarkesworld: Year Five, was released just before the holidays. (Yes, we are a bit behind, but have been making a valiant effort to get caught up.) At present, Year Six is scheduled for the end of the first quarter and Year Seven is on-track for release at Readercon in July.  Working on these volumes has been a fun look back at some of the amazing stories our authors have written for us over the years. I hope you all consider purchasing one or more. Every penny made from these volumes goes back into our fiction budget.   Have you heard of Patreon?  Patreon is best described as a cross between Kickstarter and subscriptions. Instead of focusing on a big project, like a book or a movie, Patreon is for people who produce recurring content, like podcasts, YouTube channels, web comics, or a magazine. Patrons make pledges to give a monthly amount for each month that new content is released. Similar to Kickstarter, there are community giving goals and individual rewards for your support.  To make ends meet, we sell our books and electronic subscriptions, but over the years, people have repeatedly asked for other alternatives to support us financially. To that end, we’ve established a Patreon page and just like our promise to increase the number of stories we publish when we hit a specific subscriber count, we’ve added a similar goal to our Patreon page. We could have two additional stories per issue if both of these goals are met and as I mentioned previously, it would only take a small percentage of our readers/listeners to get us there.  January means it’s time for our annual Clarkesworld Reader’s Poll. Each year, we ask our readers to pick their favorite cover art and original stories from the past year. Here’s a quick list to refresh your memory:  Fiction  \r\n “Driftings” by Ian McDonald  “Variations on Bluebeard and Dalton’s Law Along the Event Horizon” by Helena Bell  “Effigy Nights” by Yoon Ha Lee  “Gravity” by Erzebet YellowBoy  “The Wanderers” by Bonnie Jo Stufflebeam  “Vacant Spaces” by Greg Kurzawa  “The Weight of a Blessing” by Aliette de Bodard  “The Last Survivor of the Great Sexbot Revolution” by A.C. Wise  “86, 87, 88, 89” by Genevieve Valentine  “Annex” by Benjanun Sriduangkaew  “No Portraits on the Sky” by Kali Wallace  “Melt With You” by Emily C. Skaftun  “Soulcatcher” by James Patrick Kelly  “Tachy Psyche” by Andy Dudak  “(R + D) /I = M” by E. Catherine Tobler  “The Urashima Effect” by E. Lily Yu  “This is Why We Jump” by Jacob Clifton  “Free-Fall” by Graham Templeton  “Pockets Full of Stones” by Vajra Chandrasekera  “I Tell Thee All, I Can No More” by Sunny Moraine  “Across the Terminator” by David Tallerman  “Cry of the Kharchal” by Vandana Singh  “Shepherds” by Greg Kurzawa  “Found” by Alex Dally MacFarlane  “Mar Pacifico” by Greg Mellor  “The Promise of Space” by James Patrick Kelly  “One Flesh” by Mark Bourne and Elizabeth Bourne  “The Symphony of Ice and Dust” by Julie Novakova  “Bits” by Naomi Kritzer  “The Creature Recants” by Dale Bailey  “Mystic Falls” by Robert Reed  “The Aftermath” by Maggie Clark  “Never Dreaming (In Four Burns)” by Seth Dickinson  “Daedalum, the Devil’s Wheel” by E. Lily Yu  “Of Alternate Adventures and Memory” by Rochita Loenen-Ruiz  “Silent Bridge, Pale Cascade” by Benjanun Sriduangkaew  Cover Art  “Winding Down” by Alex Ries “Concrete 9” by Yang Xueguo “The Emperor’s Arrival” by David Demaret “The Awakening” by Alexandru Popescu “Desert Dragon” by Julie Dillon “Rainforest God” by David Melvin “The Land of Lost Dreams” by Dan Osborne “Launch Point” by Julie Dillon “Silent Oracle by Matt Dixon “Neo Maya” by Raúl Cruz “Lost in Space” by Piotr Foksowicz “Elliptic” by Julie Dillon To participate, go to:  Please fill in the optional name and email address questions if you’d like to be entered into a contest where you can win either one of three copies of Clarkesworld: Year Five or, for one lucky winner, the complete 2013 print run of Clarkesworld.  Our survey is open now and will continue through February 10th, 2014. Winners will be revealed in our March 2014 issue.  Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor’s Desk: Anthologies, Patreon, and the 2013 Reader’s Poll & Contest\nHappy New Year!\nIf you are new to the Clarkesworld family, you may not know that we also publish an annual anthology series that collects all the original fiction published over the course of a year. The first two volumes went by the name Realms 1 and 2, but since then they’ve carried the Clarkesworld name. The print editions look great on your bookshelf, but the ebook editions are good too.\nOur latest volume, Clarkesworld: Year Five, was released just before the holidays. (Yes, we are a bit behind, but have been making a valiant effort to get caught up.) At present, Year Six is scheduled for the end of the first quarter and Year Seven is on-track for release at Readercon in July.\nWorking on these volumes has been a fun look back at some of the amazing stories our authors have written for us over the years. I hope you all consider purchasing one or more. Every penny made from these volumes goes back into our fiction budget.\nHave you heard of Patreon?\nPatreon is best described as a cross between Kickstarter and subscriptions. Instead of focusing on a big project, like a book or a movie, Patreon is for people who produce recurring content, like podcasts, YouTube channels, web comics, or a magazine. Patrons make pledges to give a monthly amount for each month that new content is released. Similar to Kickstarter, there are community giving goals and individual rewards for your support.\nTo make ends meet, we sell our books and electronic subscriptions, but over the years, people have repeatedly asked for other alternatives to support us financially. To that end, we’ve established a Patreon page and just like our promise to increase the number of stories we publish when we hit a specific subscriber count, we’ve added a similar goal to our Patreon page. We could have two additional stories per issue if both of these goals are met and as I mentioned previously, it would only take a small percentage of our readers/listeners to get us there.\nJanuary means it’s time for our annual Clarkesworld Reader’s Poll. Each year, we ask our readers to pick their favorite cover art and original stories from the past year. Here’s a quick list to refresh your memory:\nFiction\n- “Driftings” by Ian McDonald\n- “Variations on Bluebeard and Dalton’s Law Along the Event Horizon” by Helena Bell\n- “Effigy Nights” by Yoon Ha Lee\n- “Gravity” by Erzebet YellowBoy\n- “The Wanderers” by Bonnie Jo Stufflebeam\n- “Vacant Spaces” by Greg Kurzawa\n- “The Weight of a Blessing” by Aliette de Bodard\n- “The Last Survivor of the Great Sexbot Revolution” by A.C. Wise\n- “86, 87, 88, 89” by Genevieve Valentine\n- “Annex” by Benjanun Sriduangkaew\n- “No Portraits on the Sky” by Kali Wallace\n- “Melt With You” by Emily C. Skaftun\n- “Soulcatcher” by James Patrick Kelly\n- “Tachy Psyche” by Andy Dudak\n- “(R + D) /I = M” by E. Catherine Tobler\n- “The Urashima Effect” by E. Lily Yu\n- “This is Why We Jump” by Jacob Clifton\n- “Free-Fall” by Graham Templeton\n- “Pockets Full of Stones” by Vajra Chandrasekera\n- “I Tell Thee All, I Can No More” by Sunny Moraine\n- “Across the Terminator” by David Tallerman\n- “Cry of the Kharchal” by Vandana Singh\n- “Shepherds” by Greg Kurzawa\n- “Found” by Alex Dally MacFarlane\n- “Mar Pacifico” by Greg Mellor\n- “The Promise of Space” by James Patrick Kelly\n- “One Flesh” by Mark Bourne and Elizabeth Bourne\n- “The Symphony of Ice and Dust” by Julie Novakova\n- “Bits” by Naomi Kritzer\n- “The Creature Recants” by Dale Bailey\n- “Mystic Falls” by Robert Reed\n- “The Aftermath” by Maggie Clark\n- “Never Dreaming (In Four Burns)” by Seth Dickinson\n- “Daedalum, the Devil’s Wheel” by E. Lily Yu\n- “Of Alternate Adventures and Memory” by Rochita Loenen-Ruiz\n- “Silent Bridge, Pale Cascade” by Benjanun Sriduangkaew\nCover Art\n“Winding Down” by Alex Ries\n“Concrete 9” by Yang Xueguo\n“The Emperor’s Arrival” by David Demaret\n“The Awakening” by Alexandru Popescu\n“Desert Dragon” by Julie Dillon\n“Rainforest God” by David Melvin\n“The Land of Lost Dreams” by Dan Osborne\n“Launch Point” by Julie Dillon\n“Silent Oracle by Matt Dixon\n“Neo Maya” by Raúl Cruz\n“Lost in Space” by Piotr Foksowicz\n“Elliptic” by Julie Dillon\nTo participate, go to:\nPlease fill in the optional name and email address questions if you’d like to be entered into a contest where you can win either one of three copies of Clarkesworld: Year Five or, for one lucky winner, the complete 2013 print run of Clarkesworld.\nOur survey is open now and will continue through February 10th, 2014. Winners will be revealed in our March 2014 issue.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_01_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Anthologies, Patreon, and the 2013 Reader's Poll & Contest by Neil Clarke"}