{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "u7HTGpTxwuGhet8aHVotKYfYv0k=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor’s Desk: A Journey “Home”  When Dublin first announced its bid to host a Worldcon, something weird happened: my family’s ears perked up. My parents were born and raised in Ireland—Navan to be precise—and immigrated to the US in the 1960s. While my grandparents were still alive, we made regular pilgrimages “home” to visit family and I have many fond memories of staying with my grandmother and spending time with aunts, uncles, and cousins. Back home, it was usually just us, but in Ireland, it was a bit overwhelming how much bigger our family really was, particularly for an introvert like myself.  There was a long gap between visits after my grandparents died. My parents managed to visit a bit, but by then life was pushing me in other directions and honestly, I think knowing my grandparents wouldn’t be there made it that much harder.  In 2014, I had plans to attend the London Worldcon. My heart attack had been two years prior and my family wasn’t quite on-board with me traveling long distances on my own just yet. My dad volunteered to join me and we decided to stop in Ireland while we were in the neighborhood. It had been over twenty-five years since I was last there and so much had changed. The fields across from Grannie’s old house were condominiums, the town was so much bigger, and the family had grown considerably larger. We stayed in Navan and in a few days saw as many people as we could before heading to London. A brief, but enjoyable, whirlwind tour.  I think all of that set the stage for their reaction to the Dublin bid. For years now, this trip loomed as a possibility. In the end, ten of us made arrangements to go to Ireland last month: my parents, my sister and her family, Lisa, my sons, and I. Unfortunately, my brother and his family were unable to join us.  All ten arrived at the airport on the same day, but were slated to travel on two different airlines. My sister and her family made it out late, but the rest of us embarked on a travel nightmare sponsored by Aer Lingus. Long story short, it was the worst experience I’ve ever had with an airline and I’m never flying with them again and there’s a whole laundry list of reasons I won’t go into here. The short version is that after many errors on their part, it was days later before we could join my sister in Ireland. It was only through the actions of my cousins—who called some contacts at the airline—that we made it there in time to attend the first of several family reunions.  But we made it. (Again, no thanks to Aer Lingus. Yeah, I’m still furious with them.) That first night—and most others—we were up late laughing and talking with family I hadn’t seen in ages. It was just what we needed after the travel ordeals of the days before. Over the course of the next few days, this scene would repeat itself over and over with other branches of the family stopping by. We like to joke that if you throw a stone there, you’ll hit a family member, and at times it felt that way. (To illustrate this point: While we were in the hotel pub, we were talking about who would be visiting and how they are related. One of the employees overheard the conversation and she proclaimed “I think we’re related.” It turns out that we are.) While Lisa and the boys have met some of the family that has visited the US, they’ve never experienced the full-on extended family in their native habitat. They fit right in, but it was fun watching them in this environment. It’s nothing like this at home.  It wasn’t all family time though. We traveled around, visited castles and historical sites, were shown places that featured in my parent’s stories, and wandered around town. I was happy that I could share some of the things I experienced as a child with them, particularly with my parents along for the ride. This was something I’ve wanted to give them for a long time and I was sad when that portion of the trip came to an end. My sister and her family went home, my parents traveled to Galway to visit some more family, and we headed to Dublin for the convention. (It would be more correct to say that I was headed for the convention and Lisa and the boys were going to explore Dublin.)  The first thing that struck me on arriving in Dublin was the sheer number of cranes that dotted the landscape. I don’t think I’ve ever seen that much construction happening in a city before. Our hotel was just down the street from the convention center—also relatively new—so we split up and I headed off to register. The lines were short and I soon had my packet, badge, and Hugo finalist pin. It didn’t take long before I started running into friends and colleagues.  Much like the London Worldcon, this felt very much like a WORLDcon. There were multiple languages being spoken, authors and fans from around the world that I rarely, if ever, see, and panels that covered that territory well. I’ve never seen anything quite like this when the convention is in the US and that isn’t a slam. Each venue has its strengths/weaknesses and I’m not sure we’ll ever see that balance out. It does, however, make the case for the need to have more international Worldcons. While the distant venues may make it more challenging for some to attend, the variety is a strength for which there isn’t a substitute. If any convention should be the center for that variety, it’s this one.  The panels were very well-attended, often to capacity. Unfortunately, the convention center was a bit heavy-handed in making people line up in advance and cutting it off when they ran out of seats. This caused a number of people to miss panels they planned to see. Given the number of attendees, the room sizes were probably a bit too small. I met a few people who were locked out of a couple of my panels, but as happens at Worldcon, we ended up talking about some of those things at parties, in hallways, and at meals. The trick with a con this spread out was finding where people were. For example, it was several nights in before I found out that a group of people I hadn’t seen much of had set up camp at a hotel bar down the road. On the plus side, I ended up getting to meet many others I probably wouldn’t have met. That, in a nutshell, is one of the reasons that I attend Worldcon.  Worldcon is home to the Hugo Awards and as a finalist, I was looking forward to Sunday evening. My parents returned from Galway to attend the ceremony with my kids and Lisa joined me as my plus one at the reception, ceremony, and loser’s party at the Guiness Factory. The results are online and as I expected, I lost to Gardner Dozois. I’ve seen some people grousing that Gardner didn’t need one more Hugo—and other more insulting things—simply because their chosen editor—all of which could be on the ballot again someday—didn’t get it. (Shame on you.) I finished second behind Gardner and I’m perfectly fine with losing to him. He was an amazing editor and someone for whom I had a great deal of respect. If you are going to lose, that’s the optimal scenario. Sure, Gardner isn’t around to appreciate it, but his family is and it was a pleasure to see Christopher accept the award. Congratulations to Gardner and thank you to all the people who voted for me this year!  After all of this, there was one more day of the con after the ceremony, but I only put in a few hours, choosing instead to walk around Dublin with my family and soak in whatever I could before we returned to NJ. It was a beautiful day and a fantastic trip. Sure, there were problems along the way, but I have many more fond memories and new friends to make up for it. It joins a long list of pleasant experiences when our family returned “home.” Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor’s Desk: A Journey “Home”\nWhen Dublin first announced its bid to host a Worldcon, something weird happened: my family’s ears perked up. My parents were born and raised in Ireland—Navan to be precise—and immigrated to the US in the 1960s. While my grandparents were still alive, we made regular pilgrimages “home” to visit family and I have many fond memories of staying with my grandmother and spending time with aunts, uncles, and cousins. Back home, it was usually just us, but in Ireland, it was a bit overwhelming how much bigger our family really was, particularly for an introvert like myself.\nThere was a long gap between visits after my grandparents died. My parents managed to visit a bit, but by then life was pushing me in other directions and honestly, I think knowing my grandparents wouldn’t be there made it that much harder.\nIn 2014, I had plans to attend the London Worldcon. My heart attack had been two years prior and my family wasn’t quite on-board with me traveling long distances on my own just yet. My dad volunteered to join me and we decided to stop in Ireland while we were in the neighborhood. It had been over twenty-five years since I was last there and so much had changed. The fields across from Grannie’s old house were condominiums, the town was so much bigger, and the family had grown considerably larger. We stayed in Navan and in a few days saw as many people as we could before heading to London. A brief, but enjoyable, whirlwind tour.\nI think all of that set the stage for their reaction to the Dublin bid. For years now, this trip loomed as a possibility. In the end, ten of us made arrangements to go to Ireland last month: my parents, my sister and her family, Lisa, my sons, and I. Unfortunately, my brother and his family were unable to join us.\nAll ten arrived at the airport on the same day, but were slated to travel on two different airlines. My sister and her family made it out late, but the rest of us embarked on a travel nightmare sponsored by Aer Lingus. Long story short, it was the worst experience I’ve ever had with an airline and I’m never flying with them again and there’s a whole laundry list of reasons I won’t go into here. The short version is that after many errors on their part, it was days later before we could join my sister in Ireland. It was only through the actions of my cousins—who called some contacts at the airline—that we made it there in time to attend the first of several family reunions.\nBut we made it. (Again, no thanks to Aer Lingus. Yeah, I’m still furious with them.) That first night—and most others—we were up late laughing and talking with family I hadn’t seen in ages. It was just what we needed after the travel ordeals of the days before. Over the course of the next few days, this scene would repeat itself over and over with other branches of the family stopping by. We like to joke that if you throw a stone there, you’ll hit a family member, and at times it felt that way. (To illustrate this point: While we were in the hotel pub, we were talking about who would be visiting and how they are related. One of the employees overheard the conversation and she proclaimed “I think we’re related.” It turns out that we are.) While Lisa and the boys have met some of the family that has visited the US, they’ve never experienced the full-on extended family in their native habitat. They fit right in, but it was fun watching them in this environment. It’s nothing like this at home.\nIt wasn’t all family time though. We traveled around, visited castles and historical sites, were shown places that featured in my parent’s stories, and wandered around town. I was happy that I could share some of the things I experienced as a child with them, particularly with my parents along for the ride. This was something I’ve wanted to give them for a long time and I was sad when that portion of the trip came to an end. My sister and her family went home, my parents traveled to Galway to visit some more family, and we headed to Dublin for the convention. (It would be more correct to say that I was headed for the convention and Lisa and the boys were going to explore Dublin.)\nThe first thing that struck me on arriving in Dublin was the sheer number of cranes that dotted the landscape. I don’t think I’ve ever seen that much construction happening in a city before. Our hotel was just down the street from the convention center—also relatively new—so we split up and I headed off to register. The lines were short and I soon had my packet, badge, and Hugo finalist pin. It didn’t take long before I started running into friends and colleagues.\nMuch like the London Worldcon, this felt very much like a WORLDcon. There were multiple languages being spoken, authors and fans from around the world that I rarely, if ever, see, and panels that covered that territory well. I’ve never seen anything quite like this when the convention is in the US and that isn’t a slam. Each venue has its strengths/weaknesses and I’m not sure we’ll ever see that balance out. It does, however, make the case for the need to have more international Worldcons. While the distant venues may make it more challenging for some to attend, the variety is a strength for which there isn’t a substitute. If any convention should be the center for that variety, it’s this one.\nThe panels were very well-attended, often to capacity. Unfortunately, the convention center was a bit heavy-handed in making people line up in advance and cutting it off when they ran out of seats. This caused a number of people to miss panels they planned to see. Given the number of attendees, the room sizes were probably a bit too small. I met a few people who were locked out of a couple of my panels, but as happens at Worldcon, we ended up talking about some of those things at parties, in hallways, and at meals. The trick with a con this spread out was finding where people were. For example, it was several nights in before I found out that a group of people I hadn’t seen much of had set up camp at a hotel bar down the road. On the plus side, I ended up getting to meet many others I probably wouldn’t have met. That, in a nutshell, is one of the reasons that I attend Worldcon.\nWorldcon is home to the Hugo Awards and as a finalist, I was looking forward to Sunday evening. My parents returned from Galway to attend the ceremony with my kids and Lisa joined me as my plus one at the reception, ceremony, and loser’s party at the Guiness Factory. The results are online and as I expected, I lost to Gardner Dozois. I’ve seen some people grousing that Gardner didn’t need one more Hugo—and other more insulting things—simply because their chosen editor—all of which could be on the ballot again someday—didn’t get it. (Shame on you.) I finished second behind Gardner and I’m perfectly fine with losing to him. He was an amazing editor and someone for whom I had a great deal of respect. If you are going to lose, that’s the optimal scenario. Sure, Gardner isn’t around to appreciate it, but his family is and it was a pleasure to see Christopher accept the award. Congratulations to Gardner and thank you to all the people who voted for me this year!\nAfter all of this, there was one more day of the con after the ceremony, but I only put in a few hours, choosing instead to walk around Dublin with my family and soak in whatever I could before we returned to NJ. It was a beautiful day and a fantastic trip. Sure, there were problems along the way, but I have many more fond memories and new friends to make up for it. It joins a long list of pleasant experiences when our family returned “home.”\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_09_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: A Journey"}