{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kenji Yanagawa", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "CyLDum4sCUnOzcZd8wKrX6mxVC0=", "id": null, "license": null, "comments": "", "raw_text": "11410 words, novelette  How Long the Shadows Cast  I found her asleep on my doorstep on a wet June night in Tokyo, in the drizzle of tsuyu, the season of plum rains. It was two thirty in the morning, and I was on my way out for a drink to help with the insomnia I’d had since returning to Earth five days earlier. I almost stepped on her, huddled as she was near the front door on the cramped porch.  The doorstep was dark, but the lamps of neighboring buildings shed enough light to reveal a shadowy figure under the overhang, just out of the rain. For an instant I thought someone had left a package on the porch. The flat belonged to the research project, on loan to me for my two months on Earth. Unexpected deliveries were certainly possible. But when I realized the dark form in front of me was a sleeping woman, my curiosity turned to envy. She slept in a seated position, arms and head resting on her knees. It irked me that this woman could sleep so easily in such an uncomfortable position while I had lain awake for hours in my comfortable bed. I bent down and shook her roughly, and she woke with a start.  She rolled her sleepy head up and around to look at me, hair cascading off her face like rumpled black silk drawn slowly off a pale and delicate statuette. “Oh, I must have fallen asleep,” she said matter-of-factly.  Her voice was gravelly but melodic, words slightly slurred as though she’d been drinking. I bent down to get a closer look and smelled peony flowers and a touch of alcohol. Even in the dim light she did not look like the type of person who slept on the street. Her face was clean and smooth despite the pressure mark her knee had left on her forehead, and her stylish suit fit neatly on her trim but healthy frame. Her eyes, though drowsy, were clear and intelligent. They were dark, so dark there was something unworldly about them, unlike any eyes I had ever seen. And yet somehow familiar. The thought disturbed me, and I shuddered and frowned.  “No need to look disgusted,” she said, straightening her back and thrusting her face up at mine to stare into my eyes. I backed up, and she laughed, not a laugh like bells or music, but deep and full of humor. “Oh, I’ve frightened you.” She lifted her hands and rubbed her eyes with long and delicate fingers. “Forgive me. I’m sleepy and a bit tipsy.”  I didn’t know what to make of her. She behaved as though sleeping on my doorstep was not strange at all. Had Earth changed so much in the twenty-five years I had been away? Or was she in fact homeless?  “Don’t you have a home?” I asked.  She laughed again, then stretched her arms up, then out to her sides. “Of course I have a home. That’s why I’m sleeping on your doorstep.”  I must have frowned, because she paused and rolled her eyes.  “Otherwise I’d be sleeping at the station, underground, out of the rain. See?”  I shook my head and let her explain it to me. She’d been drinking late in Ikebukuro, she said, and couldn’t find a cab at that hour, so she decided to walk home. When the drizzle had turned into a downpour, she’d found shelter at the only flat on the block with an overhang. She must have fallen asleep listening to the rain. It was easy to believe her. There was no reason not to. My flat had a comfortable porch while the other buildings on the block were impersonal housing complexes with seamless fronts. The subway system would have shut down over an hour ago, and hover cabs were always hard to come by late night in the city.  “You’re lucky you live in Mejiro,” she said. “So close to Ikebukuro.” My eyes had adjusted to the dim light, and I could see her better. She looked younger than I, perhaps thirty, a handsome woman with high cheekbones and clear skin.  “With people dropping by for midnight naps, I suppose I never want for company.”  “No, no. I mean the convenience.” She stood up and brushed the dust from her pants seat. “You can go to Ikebukuro any time and never worry about finding a cab.”  “True,” I said. “I was on my way there before I stumbled on you.” I considered asking her to join me for a drink but decided against it. The company of women interested me little since Seiko died. “Much as I’ve enjoyed our chat, I believe there’s a shot of Harper’s waiting for me.”  “Oh, don’t let me stop you,” she said and bent to pick up a shopping bag. “I’ll just gather my things and be gone.”  “You’re welcome to go back to sleep.” I nodded toward the ground. “No one else will bother you.”  “You’re very generous.” There was a touch of irony in her voice and in her smile. “But I’d like to get back to my own bed.”  She stepped to the front of the porch and looked up at the drizzly sky.  “Wait. Let me give you this.” I slapped the door control and stepped inside to get a weathered umbrella from the stand. “You can keep it. It’s not mine.” I stepped back out and handed it to her.  She didn’t take it at first, but I insisted, and she finally accepted it.  “Goodbye,” I said while she buttoned her coat and hummed softly to herself.  “Goodbye,” she said.  I pulled up the collar of my tattered London Fog and head in the direction of Ikebukuro. Behind me I could hear the woman humming an old Billie Holiday tune I hadn’t heard in years, “Body and Soul,” I think it was called.  There was something about this woman I couldn’t pinpoint. I was certain we had never met before. Time dilation made it unlikely. The last time I’d been on Earth was twenty-five Earth years ago. She’d have been a child then, and I had little contact with children then or now. I shook my head to clear it, and my mind turned instead to the weather.  Tokyo’s powdery rain did not fall so much as float, swirling wildly in the pockets of air and tiny gusts of wind, and the dampness invaded my clothes and condensed on my hair and in the cracks on my chapped hands. I’d been back on Earth only five days, and it already depressed me, accustomed as I was to the sterility of space. It made me uncomfortable to be surrounded by moisture.  I rubbed my fingertips together, feeling the dampness. I thought of decay and a moss-covered headstone, and a chill ran up my spine. In the vast emptiness of space, I could forget, but not here. Earth was haunted, and I should not have come back. Even my supervisor had urged me to stay on Titan station until the expedition was ready to leave, but a strange gravity had pulled me here.  I neared Ikebukuro, and it struck me again how Tokyo had changed in the five years I had been away. The unfamiliarity was comforting, and I was glad that light speed travel played tricks with time. The city had been unbearable when every café, restaurant, and bar reminded me of Seiko. Now it was not so bad. Five years for me had been twenty-five for Earth, and rows of sleek new structures now protected me from the ghosts and memories that had haunted the old buildings I had known. How long before all the haunted buildings of my youth would be torn down, rendered, and reborn as something new? It didn’t matter, really, I would be gone before they were.  I rounded the corner of Guriin Street, where high school punks in uniform drank and brawled on the spacious steps of the old Mitsubishi Bank. Above them neon billboards and streetlamps popped, fizzled, and danced crazy messages in Japanese, English, Portuguese, and so many other languages that even a linguist could not recognize them all. A smattering of billboards were decorated with Dubhean, the alien language I had spent the last twelve years studying. Nonsense phrases, they graced the signs for decoration only, a testimony to the excitement generated by the announcement of the expedition to Dubhe.  In the distance my ears picked out the familiar and unwelcome sound of an ambulance wailing. I thought of Seiko and of accidents and of death. There had been two ambulances on the night she died, though neither could do anything for her once the hover car exploded. She was dead long before the ambulances arrived. I’d called them because I did not know what else to do. And now they would always remind me of her.  By the time I found an open pub, I really needed that drink.  I returned to the flat drunk that morning just before sunrise. I slept until noon and woke with a hangover, my tongue swollen and dry and my mind hazier than the dull light filtering through the drizzly sky. I lay there half an hour, pillow over my eyes, before gently sitting up and surveying the room.  A blinking purple light flashed on the bedside comm, looking horribly bright and casting weird shadows in the dimly lit room. I slapped the purple button, and a sweet voice informed me I had a message, timestamped 4:00 a.m. I sat up and pressed playback. The screen popped on, and my supervisor Yamamoto frowned at me, her eyes puffy with sleep and her gray-streaked hair a little disheveled. There was a half-second pause, then the frozen picture melted and flowed into motion.  “Shunzo, next time you break your drink limit, I’m moving you to Saitama. Call me when you get in or get up.” The message blinked off.  The Ministry of Offworld Development and Exploration backed the project completely, but MODE was notoriously stingy. Yamamoto had worked hard to secure me the large flat in Mejiro while the smaller one in Saitama was empty. Saitama was too far from MODE resources, I’d insisted. But mainly it was too far from a decent late-night pub.  I went to the bathroom, washed my face, and stared absently in the mirror for a moment at the scarred skin of my left shoulder and forearm before throwing on a shirt. Then I sat down at my desk, downed a can of Marina Calm anti-hangover isotonic, and called Yamamoto.  She answered on the second ring. “Ah, Urashima Tarō!” she joked. I winced at the sharpness in her voice. “How’s your hangover?” On the wall behind her I could make out a holomap of the stars around Dubhe and on the table by her right elbow the translation of the Dubhean manual I had sent her three days before.  I ignored the question and nodded at the translation. “How do you like it?”  “Shun, you were never much of a drinker, so why these late-night battles with the bottle?”  MODE was clearly monitoring my bank card.  “I’m celebrating my return to Earth.”  “Bullshit. Two nights, maybe. Five, no. Certainly not for you.” She grabbed a blue folder off the corner of her desk and shook it at me. Paper would never go out of fashion in Japan, it seemed. “Your tests show an aversion to Earth unmatched by anyone on the project. I doubt you find anything here worth celebrating.”  I didn’t respond right away, so she continued.  “I let you visit Earth because you were the most dedicated member of the project. I was positive you could handle two months here without jeopardizing that spot. Maybe I was wrong.” She dropped the blue folder back on her desk.  “I’m the best linguist you’ve got.”  “For now. But a lot can happen in two months, and I won’t hesitate to replace you if I must.”  “Okay, boss. I hear you loud and clear. Anything else?”  “Yes. The Dubhean grammar. That’ll be your test. If you can’t give me a quality draft in six weeks, you can hand in your resignation.”  “You can’t be serious.”  “I’m dead serious.”  I started to protest, but she cut me off.  “I don’t want to hear it, Shun.”  I brooded a moment. I was not afraid I would fail the test; even with the drinking and the insomnia, I could finish the grammar. But the principle was insulting. It was bad enough Yamamoto thought the test necessary, but that she’d made the test easy meant she expected me to get worse before I got better.  “Thanks for your confidence.” I said.  “Goodbye.” She hung up, and her image clicked off, leaving me alone in the dim flat. I fiddled with the house lighting, adjusting the tinting of the windows to make the room brighter but not too bright, then went to the kitchen for another Marina Calm before hopping into the shower.  I thought about the upcoming expedition and the events that led me to it. Thirty-two years ago, twelve for me, a United Mining ship near Procyon had stumbled upon the alien vessel, man’s first contact. There hadn’t been much left to it, just a debris field of indistinct molten shards of metal. But at the edge of the field they found a capsule filled with polymer sheets marked with what appeared to be writing. I was just entering graduate studies in linguistics at the time my adviser cracked enough of the code to learn that the molten shards had been a ship that originated in the Dubhean system, 105 lightyears away.  I did my graduate work in Dubhean languages, and I excelled despite a certain ambivalence. Space travel intrigued me, and I’d dreamed of earning a trip to Procyon through my studies. But I was also in love with a philosophy student named Seiko. Going to Procyon would mean leaving her behind in both space and time, and this I could not do.  In the folly of my youth I believed we were meant to be together, though at times we seemed thoroughly incompatible. Perhaps this was a source of the strength of the relationship. Superficial differences in values and a fundamental likeness in character had made it both a struggle and an obsession. The similarities were too intriguing, the differences too tempting. We were tied to each other by an invisible force stronger than gravity. So when Seiko died, I was set adrift, and naturally I floated to space.  Not long afterward, MODE announced its intention to send an expedition to Dubhe, an ambitious journey eighty lightyears beyond the most distant offworld outpost. Translation work on the Dubhean texts was going slow but revealed that intelligent life on Dubhe had been dying out, leaving vacant an earth-form planet exceedingly rich in mineral resources and the remnants of technologies far beyond our own. With Seiko dead there was nothing holding me on Earth. I wanted nothing more than to flee my bitter memories on this planet. MODE would need a linguist, I knew, so Dubhean became my life.  I stayed home all day and worked on the grammar. My head hurt, and my thoughts kept drifting to Seiko. I would have to visit her grave, I knew, but I wanted to avoid it as long as I could. I ate little and continued to plug away at the grammar. Around nine I drifted off to sleep.  I slept fitfully and dreamed of Lady Tsuyu Iijima of the Peony Lantern Kabuki Opera in her twelve-layer kimono, singing “Body and Soul.” She danced the slow steps of a Noh above the flaming wreck of a hover car. She turned to face me, and I saw it was Seiko. She sank through the flames and into the car, and the song became a scream. “Don’t leave me,” she cried. The car exploded, and I awoke, head aching.  For an hour I lay in bed trying to get back to sleep but could not. I got up and washed my face. It was two in the morning. I needed a drink.  I threw on slacks and a shirt, got my London Fog from the closet by the front door, and stepped out, half-expecting to find someone sleeping on the porch. There was no one, of course, but when I stepped past the doorway, I noticed what looked like a calling card lying facedown on the street. I bent over to examine it, but the road was too dimly lit to read by. I picked it up, and it nearly tore in my hands. It was real paper, and it had soaked up the rain and was soggy and limp. I stepped back toward the flat, opened the door, and flicked on a light.  The card was a delicate purple, the color of wisteria, with a name printed top to bottom in what might once have been elegant characters, but which were now blotchy from the soaking and just barely readable. Kondo Chiaki. And in the lower left corner were more blotches, a comm number, too blurred to read. I flipped the card over. It was surprisingly dry, and there was a note, written in strong and determined strokes but with a hint of impatience.  “Thanks for the umbrella. It’s old but will keep me dry. I’d like to repay you. Let me take you to lunch—Chiaki.”  Strange woman.  I gently turned the card back over and looked at the blurred numbers. I couldn’t read them and was disappointed, which surprised me. I had cared nothing of women since Seiko’s death. They only reminded me of my loss and my failure.  My friends couldn’t understand the depth of my pain, so I drifted away from them. My family, too. My mother, superstitious as always, tried to console me. You’ll meet again in another life, she’d said, but it was small consolation for the misery I felt in this one. Running away seemed much easier than waiting. I buried myself in Dubhean studies and lived for my dream of traveling to the farthest stars. So, it disturbed me that just as I was about to begin my adventure, I found myself interested in a woman I would never see again.  I stared at the unreadable soggy numbers, then moved to crumple the card and toss it in the rubbish can, changed my mind, and set it on the shoe cabinet next to the genkan, closed the door, and left for Ikebukuro.  The next morning I woke at noon without a hangover. I’d had only three drinks last night and felt good enough to start work without my can of Marina Calm. I worked until three, making steady progress, then called it quits when my stomach began to grumble.  After lunch I retrieved the card from the shoe cabinet and thought about the woman Chiaki. Her frankness intrigued me, as did her clear eyes and fine face. The half-crumpled card was still damp, but no longer soggy. I could just make out the first two numbers, though the others remained blurry, wet ink seeping in a messy stain out from the original written lines. It occurred to me that I might make out the original lines under a manuscript scope. If it showed the direction of seepage, perhaps I could extrapolate the original lines. I shuffled through the desk drawers and found a small polarizing scope and examined the card. After what seemed like hours, I had a number.  I wanted to call her but wasn’t sure I should. I was nervous. I sat down at the comm. She probably wasn’t home at this hour, so I decided it was safe to call and leave a message.  She answered on the third ring. Surprised, I almost hung up when she appeared on the screen. Her hair was tied back, revealing her face to be more angular than I had thought. The effect was striking, and the beauty and balance in her features was upset only by an upper lip that appeared thin against a lower lip so full and seductive.  “Hello, Chiaki speaking.”  “Hi. My name is Shunzo. You fell asleep on my doorstep.” I felt like an ass.  “Oh, I was wondering when you’d call. I thought maybe you didn’t get my note.” She spoke as if we were old acquaintances.  “I didn’t find it until I stepped out for a drink late last night.”  “More late-night shots of Harper?” she asked.  “Early Times. I prefer it when I can find it.”  “Well, remind me to buy you a shot when I take you to lunch.”  “Actually, Ms. Kondo . . . ”  “Chiaki.” She spoke with a hint of exasperation, as though she’d already asked me several times.  “Chiaki, then. You don’t need to buy me lunch.”  “I want to repay you for the umbrella.”  “Don’t worry about it. It was an old umbrella I found in the flat.”  “I’m not worried. I’d just like to buy you lunch. How about tomorrow?”  “I don’t think I can make it. I need to work in the daytime.”  “Dinner then?”  Her forward manner caught me off guard, and I didn’t know how to refuse.  “Okay, dinner,” I said.  “Ikebukuro, tomorrow at six thirty sound okay?”  It was difficult to keep pace with her. I felt exhilarated but didn’t want to appear too eager.  “How about seven?”  “Fine. Meet me at the west exit of Tobu Center, just outside the station.”  “Okay, see you then.” My heart pounded. It was an unfamiliar feeling, and I found it both comforting and frightening.  I spent the rest of the afternoon on my computer, trying to hunt down a copy of Bornitz’s Principles of Ethnoetymology. It took me all day, but I managed to find it and two other titles I needed. I went to sleep early but this time I managed to sleep until morning.  The next day I worked on the grammar, and by late afternoon I was anxious and could hardly wait to leave. I took a long shower and dressed slowly to pass the time. I left the flat with time to spare.  I reached Ikebukuro at a quarter of seven. The district was busy and bright, a carnival scene that cheered me despite the rain. Gliding cabs painted in wild yellow, green, and blue checkers and stripes maneuvered in and out of the west side square. They cruised five-deep off the expressway, dropped down to the cab stands to let off customers, then ascended. Around the square holodisplays shimmered in sparkling storefront display booths, while businessmen rushed toward the station or the bars, and young couples worked their way slowly past vendors who hawked food, jewelry, toys, and pictures along the wide and narrow streets around the station.  I noticed a small band of demonstrators below a billboard decorated with Dubhean. They chanted something I could not make out. Demonstrators were a rarity. A few politicians and activists thought 120 lightyears was too far and that the trip to Dubhe was a waste of resources. Perhaps they had a point. In 250 years who would be around to benefit from our contact with the aliens?  Chiaki was already waiting at Tobu Center when I arrived, wearing a suit of glowing blue jade that contrasted dramatically with her black hair and pale skin. She smiled warmly and stepped out to greet me. It was the first time I’d seen her clearly in person, and I was not disappointed. There was a freshness to her face that had not shown on the comm screen. Her eyes were large, and the clear black irises caught and reflected the red and blue neon lights in a way that was haunting. It felt good to stand next to her.  “Have you been waiting long?” I asked.  “Ages!” She laughed and looked at a slim gold watch on her wrist. “Actually, you’re right on time.”  She guided me to the elevator, and we joked about the unpleasant weather and falling asleep on the doorsteps of strangers. Her sense of humor was ironic with hints of both optimism and sadness. I felt a tinge of regret that I’d be leaving Tokyo so soon.  The top floor of Tobu One held restaurants with glass ceilings and large windows overlooking the city. We chose a steak house called Prime Time. Subdued lights, ancient polished wood, and brass tinted the room the color of honey. An old Steinway stood unused in a corner near the bar, and ancient jazz filled the room. Clocks, watches, and other timepieces covered the walls and filled the half dozen glass cases around the restaurant. Few of the timepieces kept accurate time. Only about half were running, and some even ran backward.  The hostess led us to a tiny table overlooking the west square of Ikebukuro, and we sat under glass, under clouds and rain, and the lights of Tokyo stretched out in the mist below us.  We punched in our orders.  “I was surprised to find your note,” I said.  “It was the least I could do.”  “Perhaps, but strangers don’t often invite me to lunch.”  She crinkled her nose as if I’d said something foolish. “You think I’m bold? You’re the bold one, giving me present, and we’d just met.” She smiled. “Anyway, I had this feeling I knew you from somewhere.”  The comment caught me by surprise.  Our drinks came, a shot of Early Times and a glass of Bordeaux. We sat a moment in silence. Could we have met before? She was young and couldn’t have been more than six when I was last on Earth.  “Have you ever been in space?” I asked.  “No, never.”  “Then I doubt we’ve met.”  “Oh?” she asked.  “Time dilation. I’ve been offworld twenty-five years.”  “I see. Well maybe you were my babysitter once upon a time.”  I laughed, and she winked at me mischievously.  “Unlikely. But tell me, how old are you?”  “See, you are the bold one.” she chided me. “Why do you ask?”  “To see if I was your babysitter,” I winked back at her.  “Fair enough. I’m thirty-one.”  I did a quick calculation. She would have been about one when Seiko died.  “Well?” she asked.  “No. I wasn’t your babysitter.”  “That’s a relief,” she said. We both laughed.  She took a sip of her wine, looked at me with bright eyes over the rim of the glass, then smiled as she returned the glass to the table.  “Perhaps a previous life, then,” she said.  I thought of her age and furrowed my brow. “No. Not that either.”  She cocked her head to the side as though considering my comment. “Well, no matter. I find you interesting all the same. What do you do offworld?”  “I’m a linguist. I study Dubhean.”  “You must envy the members of the expedition then.”  I thought of keeping it from her but could not.  “No, I’m going with them.”  “You’re part of the expedition?” She sounded disappointed but hardly surprised.  I took a deep breath and stared over her shoulder at the city below. “Yes, I am.”  “Any chance you’ll miss the trip or change your mind about going?”  “Seems unlikely.”  “I see,” she said and fell silent. An awkward space opened between us just as the waiter arrived with our dinners.  He looked curiously at us, perhaps surprised by the change in mood, then glanced doubtfully at the two dishes in his hand before setting them down. We ate awhile in silence. I felt terribly, unexpectedly sad.  “But you never know,” I said minutes later and felt guilty for the deception.  She smiled slightly and took another sip from her wine. I finished my whiskey, then flagged the waiter for another round.  “So what do you do when you aren’t crashing people’s doorsteps?”  She brightened at the question. “I’m a researcher, like you. But physics.”  “Ah, a scientist! I should be careful, then.”  “Careful?”  “Beauty and intelligence are a lethal combination.”  She flushed a bit and looked down before looking back up.  “What area?” I asked.  “Electromagnetism mainly, energy pattern repetition over time. And a good deal of cognitive science mixed in.”  “Strange combination.”  “Not really. There are a lot of us looking at this.”  “Really? And what exactly are you looking at?”  “The media likes to embarrass us by saying we study the human soul.”  That caught me off guard.  “You must be joking.”  “Not at all. This is what the media say to embarrass us. Really, we look at the unique electromagnetic patterns associated with individual personalities and how they persist over time,” she started, then launched into an explanation of the connection between specific electromagnetic patterns and human consciousness. She got excited as she talked, her eyes shining in a way that was bewitching. I realized with a mixture of wonder and fear that I was drawn to this woman. Ten years ago I’d been certain it wouldn’t happen again. Loneliness had haunted me for years, but eventually I grew comfortable with my solitude. Now attraction was a burden I would do well without. I was leaving and did not need the reminder of loss and death.  When she stopped talking, she looked as out of breath as I felt. The waiter brought my drink, and I downed it in one shot.  “Your lab must have a very advanced Ouija board,” was all I could think to say.  “You’d be amazed,” she answered playfully.  We finished our meal in shy silence. When the bill came, we fought over it, and I paid despite her protest.  We found a live house in the basement of Itoh Complex where a West African band played palm wine songs that made me feel good. The live house was dark and warm, and the air inside was dry despite the weather outside. Dark steel robots with wiry hair glided around the room delivering drinks made by a tan Japanese bartender with a shaven scalp. We ordered palm wine punch and settled back to listen to the music.  I asked Chiaki of her childhood. She painted a picture that was detailed, yet unspecific. I could visualize the cold Tohoku city where she grew up, but I could not name it, and I could see the hard lines on the face of her father, the president of a large regional corporation that dominated local government, but I could not imagine what company it might be. I pressed her for details, but she was elusive.  She asked of my childhood, too, so I told her of growing up in the outskirts of Tokyo in a family split between future and past, between an engineer father, who designed ship drives, and a superstitious mother, who cared only for the journey of the soul. I explained how my childhood had been filled with ghosts and spirits, and my adolescence with science and technology.  “Your career suggests that science won out,” she said.  “Not really. My interest in space is mostly aesthetic. There’s something about the beauty of the rings of Saturn rising above the horizon of Titan on a sunless day. Or the purple oceans of Procyon 4. You really can’t imagine.”  She laughed. “It sounds beautiful, though I imagine it gets lonely.”  “Not really. It’s only lonely when you get back and everything has changed.”  “Doesn’t that frighten you? You don’t know what it will be like when you get back. So much can change in 250 years. It’s like you are a time traveler.”  “Well, not much of one,” I laughed. “I only go forward, never backward. Now that would be time travel.”  “Maybe when you return from Dubhe, they’ll have the technology.”  “Given enough time anything is possible, I suppose.”  We laughed and ordered another round of palm wine punch. The music moved me, the wine relaxed me, and somehow I felt content.  We talked until closing, and when we finally left, Ikebukuro was shutting down. Plastic shields slid over shopfronts all along the street, and drunk businessmen lined the roadways, hailing cabs in the rain.  “You’ve missed the last subway,” I said.  “I know. And it doesn’t look like we’ll find a cab.”  “I don’t need a cab. My flat’s a short walk, remember.”  “You’re lucky,” she said. “But what will I do?”  “I know an excellent porch you can sleep on.”  “You’re terrible.”  “I thought maybe you preferred porches to beds. If not, you can stay at my place.”  She nodded her head shyly.  I took her hand, and we walked through the empty streets of Ikebukuro under glowing lamps and drops of rain that tumbled like stars from the nighttime sky. We cut south to Mejiro, and I put my arm around her waist and felt warmth and strength.  We reached my flat, and once inside we shed our wet coats. I hung them in the hall closet, then turned back to her and kissed her deeply. My head swam, and I felt giddy. We made our way to the sofa in the corner of the living room opposite the doorway, kissing and shedding clothes with each step.  “I know you, Shunzo,” she said and wrapped her arms around me. We stood like that for a minute, then I kissed her and gently eased her onto the sofa, where we exchanged kisses and caresses. We made love, and afterward I felt satisfied and complete as I had not for many years. We moved upstairs to my bedroom, and I lay awake until I heard Chiaki’s breath become slow and deep, then I too drifted off.  Next morning I awoke to gray light filtering through tinted one-way walls. Chiaki slept quietly beside me, head on my chest. She felt light, and her skin seemed even more pale than before. She hardly seemed to breathe. I played with her hair absentmindedly until she awoke, and we made love again.  The next six weeks were both wonderful and miserable. I could not focus on the grammar and made such slow progress that I began to fear I might not finish it on time. I came to resent the book-hunting trips to Waseda University and the Diet Library, and my passion for the alien language dimmed daily. I lived for the moments I could spend with Chiaki.  For six weeks we played like children, strolling beneath artificial stars in underground parks, skating on the magnetized walls and ceiling at Seibu Funland, and visiting gardens, temples, and shrines around the city to look at hydrangea, wisteria, and orchids. We must have looked very much in love, for people stared at us wherever we went. At night we painted ourselves with lights and danced to shrine songs on top of Rose City 5 and made love at my place and talked and told stories ’til dawn. Since Seiko’s death I had never felt as complete, or as certain of my love for a woman.  But the feeling did not make me happy. At times I was ecstatic, but it was the ecstasy of a manic depressive, punctuated violently with fits of despair. I did not want to leave her, but I knew I could not stay. I’d dedicated too many years of my life to reaching the stars. How could I give it up for a woman I had only known five weeks? It seemed ridiculous, and yet, I wanted to. Did it matter that it had only been five weeks? It seemed like so much more.  Sometimes I felt as though we had known each other lifetimes. Could I trust such feelings? A cynicism borne perhaps of solitude told me love always feels like this at first. When a man thinks he has fallen in love, he believes it will last forever. He never suspects his love might be an illusion bound to fade. Without time he could not know.  At other times I rejected the cynic in me. Time is not a solid, concrete thing. It is relative and provides no absolute measure. What could time mean to a man who aged five years while others aged twenty-five? Could not the heart travel at the speed of light and obtain years of understanding in the space of weeks? I wanted to believe it could. But the part of me that feared love told me it could not. Five weeks of love were still only five weeks. It made no sense to stay.  One morning about two weeks before the grammar was due, while Chiaki slept in the bedroom, I was working in the study when Yamamoto called. Two incomplete drafts of the grammar and several books cluttered the desk. I had to push these aside to get at the comm switch. Yamamoto appeared on the screen behind piles of crumpled paper, her face drawn and tired. The project was taking its toll, I could tell.  “Shun, only two weeks left, and I’ve yet to see a page of your work.”  “It’s right there.” I gestured at the mess on my desk.  “Looks incomplete.”  “It is.”  “Hokada’s getting ready to take your spot, you know.”  “Don’t needle me, Yamamoto. I’ll get it done. I’ve got a lot on my mind right now.”  She picked an open green file off her desk and studied it a moment. “I can’t imagine what.” It was just like Yamamoto not to refer to Chiaki directly. “Day after day frolicking like a child. You seem to have some unnecessary distractions.”  “So?”  “I suggest you get rid of them. The sooner the better.”  I crumpled a sheet of paper and tossed it on the pile.  “I’ve cut out the drinking, and I’ll finish the damn grammar. But how I choose to spend my days is none of MODE’s business.”  “If it affects your performance, it is. We need someone more stable and more dedicated than that.” She gestured at the mess on my desk. “Otherwise you’re no good to us. You need to focus.”  “And if I don’t?”  “There are many universities that want a man of your expertise.” She delivered the line smoothly, and I knew the threat behind it was serious, but I could tell from her eyes that she did not enjoy saying it.  “Thanks for the advice, boss,” I said icily. “Anything else?”  “No.”  “Good. Tell Hokada not to get his hopes up.” I clicked off the comm without waiting for her to say goodbye, then heaved a deep sigh and leaned back and rubbed my eye sockets with the palms of my hands.  I heard a sound behind me and turned to see Chiaki looking at me from the doorway, fully dressed but with her hair wet from the shower.  “You don’t have to go,” she said without coming into the study.  I swiveled the chair around to face her but did not immediately answer. I wondered how much she’d heard.  “No, I don’t,” I finally managed.  “But you will?”  “I . . . I’m not sure.”  “Oh, Shun.” Her shoulders sunk, and I could see moisture in her eyes. “I don’t want to wait,” she said, as if such a thing were possible.  “I’ll have died by the time you get back.” She pulled absently at a bit of thread on her sleeve, not looking at me, her eyes far away.  “I know that.” I struggled to find words to show I understood and cared and was hurting.  “I don’t want to wait,” she repeated.  “There’s no such thing as waiting. I’ll be gone too long.”  “I know how long you’ll be gone, Shun, but there’s always waiting. I know you don’t understand, but it’s true. And I don’t want to do it. I can’t.”  “Do you think it’s so easy to give up a lifetime of work?”  “No, of course not. But what is one lifetime against the sea of eternal love?”  “Chiaki, we’ve known each other six weeks.”  “Six weeks, Shun? It feels so much longer. I’ve known you for years. I know I have. You must sense it, too. You of all people should know time is relative.”  I nodded.  “You’ve got to trust that feeling. It’s not an illusion.” She sounded so miserable it hurt my heart to hear it. “It’s real. I belong with you.”  I squeezed my eyes shut and took a deep breath. “I want to stay with you, but I need time to think.”  After a long silence she spoke.  “I’m so afraid. Please, tell me. I need to know if you’re leaving. Please, tell me the truth.”  I sat, eyes jammed shut, unable to speak, unable to move. Frozen in place. Again.  Finally, I opened my eyes, but she was gone, having already silently let herself out the door.  She didn’t come back. I called her as often as I dared, but she never answered and never returned my calls. I tried to focus on my work but could not. The alien language now felt lifeless and empty, cold and meaningless. The expedition repelled me almost as strongly as it had once drawn me, as though the gravity of my life had somehow reversed itself, and I was being pulled inexorably to Earth.  For three days I sat at a blank screen, trying to work. Occasionally I’d enter a line or two before giving up and trying Chiaki’s number again.  I could not get her from my mind. I tried to forget her but could not. She haunted my waking hours, and the nights were even worse.  I dreamed of her, disturbing dreams of Chiaki 200 years from now, a withered skeleton wrapped in an elegant twelve-layer kimono, reaching out for me. Or Chiaki calling to me. She begs me to stay, but I turn and run instead. And I run until I am crossing planets, stars, galaxies. Mornings I wake exhausted and frightened, resenting my work.  After three such tormented nights I woke knowing it was time to visit Seiko’s grave. I needed some clarity. I didn’t have to go to Dubhe, I knew. Yamamoto and MODE could obviously do without me. The important question was whether I could stand living on this haunted Earth. I did not want to see the grave, but I could put it off no longer. The prospect did not cheer me, and I lingered in bed an hour later than usual, feeling hungover, though I’d had nothing to drink for days. Eventually I forced myself out of bed.  By eleven the drizzle had ceased. The sky was a uniform ash color, drab and monotonous, and the wet air felt warmer than it had in days.  Seiko’s grave was in Zōshigaya Cemetery, an easy walk from the flat. I made good time along Mejiro and Arakawa, the sidewalks empty of pedestrians save a few ancient women out for a walk around the block, Gakushuin students on their way to Ikebukuro, and an occasional businessman.  I reached Zōshigaya at eleven thirty. The place was crowded with high school students praying at the graves of famous scholars for success in college entrance exams, aspiring writers seeking inspiration from the spirit of Soseki, and children on a field trip, ushered from one famous grave to another by cheery teachers. The dead didn’t seem to mind. Their holographic images appeared content among the playing children and visitors who left presents of flowers, fruit, sake, and potato chips.  I marveled at the gaiety. Death surrounded them, but the visitors remained undaunted and untouched. But I could feel it, a cold and threatening thing that made me shiver despite the warm air. My father had taught me that death was simply the end of life, nothing to fear, but I could not believe him. How could life just disappear when the act of dying was so miserable and full of agony? I imagined a realm filled with each man’s final anguish, hatred, longing, anger, and fear. I shuddered at the thought of dwelling in such a place.  I found my way to the temple compound and bought joss sticks and a lighter before consulting the cemetery map to get my bearings. Seiko’s grave lay in a quiet corner of the graveyard, where no one famous was buried. I expected to find the grave untended, but it was tidy and clean. The dirt around the marble tombstone had recently been raked, and someone had left flowers next to the incense burner. I lit the bundle of incense, which smelled of jasmine and sandalwood, touched them to my forehead, and placed them in the burner, activating the holographic projector.  The image started as a tiny ball of indistinct light that swirled and slowly grew into a disturbingly real projection of the woman I had once loved. She sat against the edge of the tombstone, dressed in satiny white, smooth legs crossed, brown eyes focused on a spot about two feet behind me, a slight smile playing on her full lips. Through the precious light of her ghostly image I could just make out the characters carved into the tombstone behind her.  I thought of the four years we’d spent together. They were good years, but they had not been easy. We’d been too different despite our similarities. Slowly and painfully we reshaped each other into a powerful unity, two complementary halves that made up a balanced and inseparable whole. No, not inseparable. Somehow something in me resisted that unity. I needed to hold on to a piece of myself.  We’d fought on the night she died. I had accepted a scholarship in California that would get me closer to traveling in space. Doing so meant breaking a promise to stay in Tokyo until she finished her law thesis. I told her on a drive out to Atami for a night at the coast. We should have canceled the trip; the Izu grid was down, every hover on manual, and we were in no condition to drive. We argued an hour, she angry at my selfishness, me frustrated by her refusal to understand. Our faces were tear-streaked, and she looked as emotionally drained and exhausted as I felt. So when a truck drifted down into our lane, I wasn’t ready for it. It smacked our hood, and the car dropped like a rock, bounced off the road, and rolled off through bushes and finally a tree. Somehow I was thrown free of the wreck and landed in a mushy wet rice field. When I came to, Seiko was screaming. The car was on fire, and she was trapped inside. I stumbled toward her as fast as I could, but every move felt slow, too slow, like some crushing gravity pulled me down, slowing time. Two more steps and the car burst into flames. The gravity broke and I hurled myself at the flaming vehicle, but the fire lashed my face and torso, driving me back.  I lived through the accident, but something inside died and left an emptiness I was never able to fill. I struggled to make my way back into the world of the living, but I failed. The world contained only ghosts, and eventually I realized the best I could do was run away. I buried myself in my studies and vowed that one day I would run away from this Earth. That eased the pain, but the emptiness remained.  In the graveyard the holographic image began to fade. As I stared at Seiko shimmering in front of the tombstone, I realized that for six weeks I had lived without that empty feeling. Chiaki had filled me with something that had long been missing. I no longer needed to run away.  The joss sticks burned down to the end, and Seiko smiled, bowed her head, and faded from view. “Goodbye, my star child,” I said and turned and walked back toward Mejiro to call Chiaki and tell her I was staying.  I was surprised to find her waiting outside when I got home, absentmindedly kicking a pebble back and forth between her booted feet, the tilt of her shoulders sad despite the brightness of the flower prints on her raincoat. She didn’t look up when I approached, I stopped a meter from her, wanting to touch her but not wanting to startle her, afraid she might disappear the minute she noticed me.  “I was worried I might never see you again,” I said.  “Me too.” She looked up, and her eyes were wet with tears but also warm with love. “I have to tell you something. Something I need you to know.”  “I’ve decided to stay,” I blurted.  She smiled then, a half smile that said she wasn’t sure she could believe me. Her eyes bored into mine, darting from my left eye to my right, then back again. Finally, she smiled a real smile, one I could believe in, and the tension in my stomach, my back, and my forearms eased. We stood that way for a minute, then I reached for her hand and said “Come. Let’s get out of the rain.”  Inside the front room, we sat in silence on the sofa where we first made love. I savored the moment, not wanting to break the peace. Chiaki was the first to speak.  “I still have something to tell you.” There was a distance in her voice, as if she were afraid of what she had to say. I nodded my head and waited.  “We’re not from the same time.”  “I know.”  “You were born a long time ago, and yet we’re together, as if you traveled through time to get here.”  “Sure, but time dilation isn’t really time travel. It’s simple physics.”  “Yes, but if you didn’t know the physics, it would sound impossible.”  “True,” I said. I wasn’t sure what she was getting at.  “Did you know it’s also possible to travel backward in time?”  The question jarred me. Back in time? I thought of a moment many, many years ago and a dark drive along the coast to Atami.  “No,” I said flatly. “This cannot be true.”  “It is true. I know it can be done.”  I stared at her hard and marveled at the conviction in her eyes. She seemed at once both innocent and wild, her eyes shining with a strange resolve. The light in her eyes was not the enthusiastic spark of a young idealistic scientist. It glowed with an unearthly fire. Could she be right? An image of flame, torn metal, and molten plastic flashed in my mind, and I thought of traveling to a moment before that horrible night. The thought stabbed at my heart.  “You cannot know such a thing,” I said flatly. “Maybe in a theory, maybe in a formula or a paper, sure, maybe it could be true. But that’s an abstraction. This physical world is not so malleable, Chiaki. Time moves one way, and you can’t go back.”  She sighed and the glow in her eyes dimmed. “You sound so certain for someone who knows so little about time.” She looked down at her feet, then pulled at a thread on her blouse.  “Going back in time is possible. I know because I’ve done it.”  I winced as she said it, the words so strange and unexpected. I looked at her and her eyes were clear and firm and filled with an intelligence and calm that was impossible to dismiss as crazy.  “You’ve gone back in time?” I tried but could not keep the skeptical tone from my voice.  “No.” She shook her head sadly as if resigned that I wouldn’t believe her. “I’ve come back in time.”  I pondered the difference for a moment.  “You want me to believe you’re from the future.” I wanted to believe her, if only because it was easier to believe in time travel than to accept that she was crazy, but how could I believe such a thing?  “You know how crazy that sounds?”  “I’m not crazy, Shun. Not that way. Maybe I’m mad with love to do something so extreme, but I’m not delusional. I’m telling you the truth.”  “How do you expect me to believe that.”  “You have to believe it.”  “Why?”  “Because if you don’t, then I’ve come here for nothing.”  I stared at her, wondering what to make of her words, then rubbed my eyes with my scarred left hand before looking up at her. She met my gaze with clear, searching eyes.  “What have you come here for then, Chiaki?”  She sat up and leaned toward me. “I came back to find you.”  The words had a strange quality to them, full of yearning and hope, both comforting and chilling.  “Why on earth would you do that?”  “I couldn’t stand waiting anymore.”  “I don’t understand.”  “Shun, when you talk of your past love, of Seiko, I can hear in your voice a sense of connection that even death couldn’t break. It’s true, isn’t it?”  “Yes. It’s true. Does that bother you?”  She laughed, and the mood lightened for a moment.  “No! No, it makes me happy. It gives me hope that I am right about you. The feeling you have is right. It’s real. You shared a bond stronger than life. It’s true.”  “Chiaki, I still don’t understand.”  “Let me tell you what I learned in my research. I told you my work involves tracing connections between specific electromagnetic patterns and individual human consciousness. Well, one thing we discovered is that individual patterns repeat themselves at irregular intervals throughout time. There’ll be a pattern, and it will be there for fifty, sixty, eighty years, then it will go away. Years later it shows up again, maybe in the same place or maybe somewhere totally different. Another thing we discovered is that patterns that show up together in one time tend to show up together in later time frames, not always the exact same time or the exact same place, but they almost always cross paths again, and usually substantially.  “Now you, your pattern never shows up again. That’s exactly what we hypothesized for someone who spends the next couple hundred years traveling at near light speed.”  I pondered that a moment.  “But why did you come back here? You still haven’t explained that.”  She squeezed my hand then, and looked with wide searching eyes into mine, then began to speak.  “A few years after your pattern becomes untraceable, a girl named Ursula is born in Canada. She grows up lonely and spends much of her life sure something essential is missing. She seeks counseling and gets professional help, but records show she found little relief. Eventually she died an old and lonely woman.”  I furrowed my brow, unsure what she was getting at.  “Not long after that, another child is born, a boy this time. Similar story of longing and loneliness, but he becomes a travel writer, famous for documenting his quest for a spiritual truth that somehow eludes him. He lives until he is forty, but then kills himself from loneliness.  “After that, another girl, suffering from abandonment trauma despite what appeared to be caring, engaged parents. She set herself on fire on her fifteenth birthday.”  I flinched at this.  “I’ve traced the handful of other cases, similar pattern, a strange and powerful longing, progressively deeper misery, sad or tragic endings.”  “I still don’t understand what this has to do with you. Or me.”  “Let me tell you about the most recent one, the one in my time. A girl is born, this one in Japan, in Tohoku actually. A smart girl, scientifically inclined, but filled with that same dark vacuum of longing and despair.  “The world is a very different place by then. You can’t imagine the technology. They’ve found ways to send and retrieve electromagnetic energy signals back in time. They’ve discovered these electromagnetic patterns I study, and they’ve figured out what they are, how to identify them, and how to trace them back through time.”  The implications of what I was hearing struck me, and my rational mind rebelled. Could this really be true? Again, I wondered if there was something wrong with Chiaki. Or perhaps it was me. Was I hearing this? Or just imagining it?  “And so this girl, driven by misery and need, becomes a scientist, one of the leading experts on the repetition of these patterns. And she traces her own pattern back through time to find out who she was and why she’s so miserable, and where this yearning and longing and loneliness comes from. And what she discovers is that it’s you. She’s supposed to meet you. But she can’t, because you never die. You’re removed from time, traveling away from here at the speed of light. So she comes back to this moment, the one we are in right now. She wants to take you back with her, Shun. I’ve come back for you. It’s me.”  Seiko.  I could feel it. I recognized it the first time we met. She didn’t look like Seiko, but something had reminded me of her even then. I stared as deeply into her eyes as I could, and she matched my gaze. A warmth and a chill moved up my spine. Seiko.  I looked back at her. She was smiling, a sad but warm smile, full of longing and love, but no anger. I reached over and gently ran my index finger along her jawline, feeling an intense relief at recovering something precious. I bent down and planted a delicate kiss on her forehead, my heart trembling. I had found her, this love I had lost so long ago. I pulled her to me. She started to tremble, and I could tell she was crying.  “It’s okay,” I said. “We’re together again. We can stay together.”  She didn’t stop crying, and I was overcome by fear that I would lose her again. Something was wrong, I felt it.  “What’s wrong?” I asked.  “I can’t stay here, Shun. I have to go back to my own time.”  “No, you can’t. I’ve only just found you. You have to stay.”  “I can’t. You were right, going backward in time is different from going forward. Going back is a constant fight against the flow of time. The amount of energy required to keep me here is too much. I have to go back.” She paused a moment, then added almost without breath “I want you to come with me.”  I stared blankly at her for a moment, trying to process the words. Go with her? Give up the stars and leave the present? Could I do this?  I could give up the stars, that much I knew. I had already decided to. But go with her to the future? It meant turning my back on this world and embracing a shadowy time I knew nothing about. But the present meant little to me. I had only been here a few weeks, and I planned to leave it anyway. Hadn’t I always faced a shadowy future? Did it matter whether I reach it through light speed travel or through whatever technology had brought Chiaki to me?  I looked at her and could see both the hope and the fear in her bright eyes.  “I’ll go with you,” I said and felt a surge of energy rush through my body, flushing into the deepest corners of my flesh, like every fiber of my being was vibrating at some high frequency.  I laughed. “Yes. I’ll go.” Of course I would go. How could I not?  Chiaki smiled and a weird and beautiful green light sparkled in her black eyes. “I was hoping you would say that.”  I held her for a long while and enjoyed the calm and tender warmth and sense of peace.  Then I began to wonder about the physics of it. How would it work and what technology would be involved.  “So how do we do this?” I asked, breaking the still silence. “Is there a machine?”  Chiaki frowned. “It’s hard to explain. You might not understand.” She looked away.  “I don’t need the details. Just how we’ll do it and what I have to do.”  “That’s not what I meant, Shun. It’s just that this won’t be easy for you. Maybe we should wait.”  “No. We can go now. There’s nothing here for me. I want you to take me with you.”  “I can’t just take you with me.”  “What do you mean?”  “I can’t just move your body into the future. It doesn’t work that way. It isn’t possible to move matter through time.”  “But you’re here,” I insisted.  “Energy,” she said. “My electromagnetic pattern.”  A cold tingle spread across my back. I squeezed her hand to reassure myself.  “But I can feel you. I’ve touched you. Look.” I squeezed her hand again. It was solid. A hand, not some disembodied energy  “You feel me because I’ve inserted my electromagnetic energy pattern into yours so that we can be together. I can only do that with one individual energy pattern. I’m perfectly real inside you. But I have that reality only within your reality. Other electromagnetic patterns don’t have me, can’t experience me.”  Memories of strange looks we’d received from hostesses and waiters as they delivered food or drink for two flashed in my mind. I thought back to my argument with Yamamoto and her vagueness in referring to my “unnecessary distractions.” She hadn’t been avoiding the subject of Chiaki. She just hadn’t known.  “We don’t have technology for sending matter through time. It’s probably impossible. We can only send energy. So I sent my energy back to this time to find you and bring you back with me.”  I could feel the cold tingle on my back spreading.  “You can only bring my energy with you to the future?”  Chiaki nodded, a very slight nod.  “And what do I have to do for my energy to go with you?”  Chiaki took a deep breath and spoke in a whisper. “You have to die,” she said.  I closed my eyes, and an image drifted to my mind of that desperate lonely girl setting herself on fire on her fifteenth birthday. Was this how I was to go, taking my own life like those lonely souls Chiaki had studied—a partner in a strange double-suicide pact broken by the physics of space-time?  I opened my eyes. Chiaki was weeping silently, silver tears drifting down her pale left cheek.  “You wouldn’t really die, Shun. You would shed your body, this specific body, but only temporarily. We would be together again in my time.”  It was terrifying. And yet I wanted it. I wanted to go with her, sacrifice myself and rescue her from her torment. I could right this wrong and reclaim my love. I looked down at my hand and at the angry scarring on my left forearm. The mottled, molten skin from the accident ran up under my sleeve all the way to my shoulder. Would I add a razor slash to that scar, cutting a doorway through my own flesh into my true love’s distant future?  I thought about MODE and Yamamoto. She’d be horrified when they found my lifeless body, but Hokada could replace me. He wasn’t half the linguist I was, and the team that went to Dubhe would be weaker, but ultimately MODE would be relieved. They wouldn’t understand. They’d think it was just suicide and be glad they hadn’t burdened the crew of the mission with someone so unstable. I laughed at the thought. They’d think I’d committed suicide. For a moment it seemed ridiculous. And then it didn’t seem ridiculous at all.  I looked up at Chiaki. She looked so real. She was pale and beautiful, and her dark hair cascaded down the left side of her angular, perfect face. I wanted to hold her, but somehow the thought frightened me. She looked up, and I looked away briefly and stepped back.  She winced, and I thought I saw a spark in her eye, a hint of fire that flared briefly then faded as she composed herself.  “Please Shun, don’t run away from me again.”  My head snapped up toward her at the word “again.” Don’t run away “again.” Why had she said that? My throat clutched and my shoulders felt cold. I realized with a sudden gut-wrenching flash that she knew.  She looked horrified as she realized what she had said.  We had fought on the night she died, after I told her about my scholarship in California. And when the truck smacked our hood and sent the car bouncing off the road, I was thrown free of the wreck, just a couple of feet. I never lost consciousness, though it felt like I was in a dream. I looked at the mess of the car smashed against a tree, the bent metal pinning Seiko inside. She looked at me in desperation, and I stood quickly and tried to move. I was injured, but not badly. I could move my fingers and joints and bend all my limbs. But I just could not get them to go anywhere. And then a jet of fire flamed off the front end, and Seiko screamed, and I unfroze. I could move again, so I did.  Only, not toward her, not to save her. But away from her and the car and the fire. To safety. I have no idea why. Sheer terror, perhaps. Some inexplicable unforgivable selfish instinct. I still don’t understand it. But I ran away from her, from the screams and the sobs that grew distant behind me. And then the spell broke, and my senses returned. Seiko was still screaming. The fire raged, and she was still trapped inside. There was terror in her eyes but also an anger like madness. I stumbled toward her as fast as I could, every move slowed by some crushing gravity that pulled me down and distorted time. The car burst into flames before I reached it. I hurled myself at the flaming vehicle for as long as I could bear it, but the fire lashing my face and torso drove me back. I could not bear the pain, and I could not bear that Seiko had died in that pain. Our friends thought I was a hero for trying to save her, but I knew the truth. I was the only one who knew. Aside from Seiko. Aside from Chiaki. A bolt of shame flushed my face, and my heart pounded, but my spine felt like ice, and I shivered.  “Shun,” she said and reached a soft pale hand toward mine. Instinctively I flinched, and she jerked her hand away as though I had burned it with my fear.  Her shoulders shook, and her swollen eyes poured tears down her pale cheeks. I tried to meet her eye but found I could not face her. I was frozen in place again, unable to move.  “Shun,” she called softly, but I could not respond. “Shun, please.”  I tried to move, to reach toward her and touch her, but I could not.  I tried to speak, but the words I wished to say wouldn’t come. I lifted my eyes and glanced furtively at her. The flow of tears had stopped, but the sobbing continued, her shoulders shuddering with each breath. She looked so broken, a sad and lonely ghost mourning a lover who refused to die. She sat that way awhile. Then finally she stood and without a sound moved toward the front door. At the doorway she turned, made as if to speak, then stopped. Her eyes darted over my face, and her brow creased as if she too were struggling against some invisible force. Then her eyes dropped, and her shoulders sagged, and she let out a deep sigh that sounded almost like a rattle. Then she stepped out, and the door slid shut behind her, leaving me alone in my room.  I went upstairs and lay in bed the rest of the day shivering. That night I found it hard to sleep. My eyes would close, and I would start to drift off, but then I would imagine Lady Tsuyu Iijima’s skeleton hands closing around my throat, and my eyes would snap open. Eventually, I slept, and the next morning I awoke, though not at all sure I was glad to be alive.", "text": "11410 words, novelette\nHow Long the Shadows Cast\nI found her asleep on my doorstep on a wet June night in Tokyo, in the drizzle of tsuyu, the season of plum rains. It was two thirty in the morning, and I was on my way out for a drink to help with the insomnia I’d had since returning to Earth five days earlier. I almost stepped on her, huddled as she was near the front door on the cramped porch.\nThe doorstep was dark, but the lamps of neighboring buildings shed enough light to reveal a shadowy figure under the overhang, just out of the rain. For an instant I thought someone had left a package on the porch. The flat belonged to the research project, on loan to me for my two months on Earth. Unexpected deliveries were certainly possible. But when I realized the dark form in front of me was a sleeping woman, my curiosity turned to envy. She slept in a seated position, arms and head resting on her knees. It irked me that this woman could sleep so easily in such an uncomfortable position while I had lain awake for hours in my comfortable bed. I bent down and shook her roughly, and she woke with a start.\nShe rolled her sleepy head up and around to look at me, hair cascading off her face like rumpled black silk drawn slowly off a pale and delicate statuette. “Oh, I must have fallen asleep,” she said matter-of-factly.\nHer voice was gravelly but melodic, words slightly slurred as though she’d been drinking. I bent down to get a closer look and smelled peony flowers and a touch of alcohol. Even in the dim light she did not look like the type of person who slept on the street. Her face was clean and smooth despite the pressure mark her knee had left on her forehead, and her stylish suit fit neatly on her trim but healthy frame. Her eyes, though drowsy, were clear and intelligent. They were dark, so dark there was something unworldly about them, unlike any eyes I had ever seen. And yet somehow familiar. The thought disturbed me, and I shuddered and frowned.\n“No need to look disgusted,” she said, straightening her back and thrusting her face up at mine to stare into my eyes. I backed up, and she laughed, not a laugh like bells or music, but deep and full of humor. “Oh, I’ve frightened you.” She lifted her hands and rubbed her eyes with long and delicate fingers. “Forgive me. I’m sleepy and a bit tipsy.”\nI didn’t know what to make of her. She behaved as though sleeping on my doorstep was not strange at all. Had Earth changed so much in the twenty-five years I had been away? Or was she in fact homeless?\n“Don’t you have a home?” I asked.\nShe laughed again, then stretched her arms up, then out to her sides. “Of course I have a home. That’s why I’m sleeping on your doorstep.”\nI must have frowned, because she paused and rolled her eyes.\n“Otherwise I’d be sleeping at the station, underground, out of the rain. See?”\nI shook my head and let her explain it to me. She’d been drinking late in Ikebukuro, she said, and couldn’t find a cab at that hour, so she decided to walk home. When the drizzle had turned into a downpour, she’d found shelter at the only flat on the block with an overhang. She must have fallen asleep listening to the rain. It was easy to believe her. There was no reason not to. My flat had a comfortable porch while the other buildings on the block were impersonal housing complexes with seamless fronts. The subway system would have shut down over an hour ago, and hover cabs were always hard to come by late night in the city.\n“You’re lucky you live in Mejiro,” she said. “So close to Ikebukuro.” My eyes had adjusted to the dim light, and I could see her better. She looked younger than I, perhaps thirty, a handsome woman with high cheekbones and clear skin.\n“With people dropping by for midnight naps, I suppose I never want for company.”\n“No, no. I mean the convenience.” She stood up and brushed the dust from her pants seat. “You can go to Ikebukuro any time and never worry about finding a cab.”\n“True,” I said. “I was on my way there before I stumbled on you.” I considered asking her to join me for a drink but decided against it. The company of women interested me little since Seiko died. “Much as I’ve enjoyed our chat, I believe there’s a shot of Harper’s waiting for me.”\n“Oh, don’t let me stop you,” she said and bent to pick up a shopping bag. “I’ll just gather my things and be gone.”\n“You’re welcome to go back to sleep.” I nodded toward the ground. “No one else will bother you.”\n“You’re very generous.” There was a touch of irony in her voice and in her smile. “But I’d like to get back to my own bed.”\nShe stepped to the front of the porch and looked up at the drizzly sky.\n“Wait. Let me give you this.” I slapped the door control and stepped inside to get a weathered umbrella from the stand. “You can keep it. It’s not mine.” I stepped back out and handed it to her.\nShe didn’t take it at first, but I insisted, and she finally accepted it.\n“Goodbye,” I said while she buttoned her coat and hummed softly to herself.\n“Goodbye,” she said.\nI pulled up the collar of my tattered London Fog and head in the direction of Ikebukuro. Behind me I could hear the woman humming an old Billie Holiday tune I hadn’t heard in years, “Body and Soul,” I think it was called.\nThere was something about this woman I couldn’t pinpoint. I was certain we had never met before. Time dilation made it unlikely. The last time I’d been on Earth was twenty-five Earth years ago. She’d have been a child then, and I had little contact with children then or now. I shook my head to clear it, and my mind turned instead to the weather.\nTokyo’s powdery rain did not fall so much as float, swirling wildly in the pockets of air and tiny gusts of wind, and the dampness invaded my clothes and condensed on my hair and in the cracks on my chapped hands. I’d been back on Earth only five days, and it already depressed me, accustomed as I was to the sterility of space. It made me uncomfortable to be surrounded by moisture.\nI rubbed my fingertips together, feeling the dampness. I thought of decay and a moss-covered headstone, and a chill ran up my spine. In the vast emptiness of space, I could forget, but not here. Earth was haunted, and I should not have come back. Even my supervisor had urged me to stay on Titan station until the expedition was ready to leave, but a strange gravity had pulled me here.\nI neared Ikebukuro, and it struck me again how Tokyo had changed in the five years I had been away. The unfamiliarity was comforting, and I was glad that light speed travel played tricks with time. The city had been unbearable when every café, restaurant, and bar reminded me of Seiko. Now it was not so bad. Five years for me had been twenty-five for Earth, and rows of sleek new structures now protected me from the ghosts and memories that had haunted the old buildings I had known. How long before all the haunted buildings of my youth would be torn down, rendered, and reborn as something new? It didn’t matter, really, I would be gone before they were.\nI rounded the corner of Guriin Street, where high school punks in uniform drank and brawled on the spacious steps of the old Mitsubishi Bank. Above them neon billboards and streetlamps popped, fizzled, and danced crazy messages in Japanese, English, Portuguese, and so many other languages that even a linguist could not recognize them all. A smattering of billboards were decorated with Dubhean, the alien language I had spent the last twelve years studying. Nonsense phrases, they graced the signs for decoration only, a testimony to the excitement generated by the announcement of the expedition to Dubhe.\nIn the distance my ears picked out the familiar and unwelcome sound of an ambulance wailing. I thought of Seiko and of accidents and of death. There had been two ambulances on the night she died, though neither could do anything for her once the hover car exploded. She was dead long before the ambulances arrived. I’d called them because I did not know what else to do. And now they would always remind me of her.\nBy the time I found an open pub, I really needed that drink.\nI returned to the flat drunk that morning just before sunrise. I slept until noon and woke with a hangover, my tongue swollen and dry and my mind hazier than the dull light filtering through the drizzly sky. I lay there half an hour, pillow over my eyes, before gently sitting up and surveying the room.\nA blinking purple light flashed on the bedside comm, looking horribly bright and casting weird shadows in the dimly lit room. I slapped the purple button, and a sweet voice informed me I had a message, timestamped 4:00 a.m. I sat up and pressed playback. The screen popped on, and my supervisor Yamamoto frowned at me, her eyes puffy with sleep and her gray-streaked hair a little disheveled. There was a half-second pause, then the frozen picture melted and flowed into motion.\n“Shunzo, next time you break your drink limit, I’m moving you to Saitama. Call me when you get in or get up.” The message blinked off.\nThe Ministry of Offworld Development and Exploration backed the project completely, but MODE was notoriously stingy. Yamamoto had worked hard to secure me the large flat in Mejiro while the smaller one in Saitama was empty. Saitama was too far from MODE resources, I’d insisted. But mainly it was too far from a decent late-night pub.\nI went to the bathroom, washed my face, and stared absently in the mirror for a moment at the scarred skin of my left shoulder and forearm before throwing on a shirt. Then I sat down at my desk, downed a can of Marina Calm anti-hangover isotonic, and called Yamamoto.\nShe answered on the second ring. “Ah, Urashima Tarō!” she joked. I winced at the sharpness in her voice. “How’s your hangover?” On the wall behind her I could make out a holomap of the stars around Dubhe and on the table by her right elbow the translation of the Dubhean manual I had sent her three days before.\nI ignored the question and nodded at the translation. “How do you like it?”\n“Shun, you were never much of a drinker, so why these late-night battles with the bottle?”\nMODE was clearly monitoring my bank card.\n“I’m celebrating my return to Earth.”\n“Bullshit. Two nights, maybe. Five, no. Certainly not for you.” She grabbed a blue folder off the corner of her desk and shook it at me. Paper would never go out of fashion in Japan, it seemed. “Your tests show an aversion to Earth unmatched by anyone on the project. I doubt you find anything here worth celebrating.”\nI didn’t respond right away, so she continued.\n“I let you visit Earth because you were the most dedicated member of the project. I was positive you could handle two months here without jeopardizing that spot. Maybe I was wrong.” She dropped the blue folder back on her desk.\n“I’m the best linguist you’ve got.”\n“For now. But a lot can happen in two months, and I won’t hesitate to replace you if I must.”\n“Okay, boss. I hear you loud and clear. Anything else?”\n“Yes. The Dubhean grammar. That’ll be your test. If you can’t give me a quality draft in six weeks, you can hand in your resignation.”\n“You can’t be serious.”\n“I’m dead serious.”\nI started to protest, but she cut me off.\n“I don’t want to hear it, Shun.”\nI brooded a moment. I was not afraid I would fail the test; even with the drinking and the insomnia, I could finish the grammar. But the principle was insulting. It was bad enough Yamamoto thought the test necessary, but that she’d made the test easy meant she expected me to get worse before I got better.\n“Thanks for your confidence.” I said.\n“Goodbye.” She hung up, and her image clicked off, leaving me alone in the dim flat. I fiddled with the house lighting, adjusting the tinting of the windows to make the room brighter but not too bright, then went to the kitchen for another Marina Calm before hopping into the shower.\nI thought about the upcoming expedition and the events that led me to it. Thirty-two years ago, twelve for me, a United Mining ship near Procyon had stumbled upon the alien vessel, man’s first contact. There hadn’t been much left to it, just a debris field of indistinct molten shards of metal. But at the edge of the field they found a capsule filled with polymer sheets marked with what appeared to be writing. I was just entering graduate studies in linguistics at the time my adviser cracked enough of the code to learn that the molten shards had been a ship that originated in the Dubhean system, 105 lightyears away.\nI did my graduate work in Dubhean languages, and I excelled despite a certain ambivalence. Space travel intrigued me, and I’d dreamed of earning a trip to Procyon through my studies. But I was also in love with a philosophy student named Seiko. Going to Procyon would mean leaving her behind in both space and time, and this I could not do.\nIn the folly of my youth I believed we were meant to be together, though at times we seemed thoroughly incompatible. Perhaps this was a source of the strength of the relationship. Superficial differences in values and a fundamental likeness in character had made it both a struggle and an obsession. The similarities were too intriguing, the differences too tempting. We were tied to each other by an invisible force stronger than gravity. So when Seiko died, I was set adrift, and naturally I floated to space.\nNot long afterward, MODE announced its intention to send an expedition to Dubhe, an ambitious journey eighty lightyears beyond the most distant offworld outpost. Translation work on the Dubhean texts was going slow but revealed that intelligent life on Dubhe had been dying out, leaving vacant an earth-form planet exceedingly rich in mineral resources and the remnants of technologies far beyond our own. With Seiko dead there was nothing holding me on Earth. I wanted nothing more than to flee my bitter memories on this planet. MODE would need a linguist, I knew, so Dubhean became my life.\nI stayed home all day and worked on the grammar. My head hurt, and my thoughts kept drifting to Seiko. I would have to visit her grave, I knew, but I wanted to avoid it as long as I could. I ate little and continued to plug away at the grammar. Around nine I drifted off to sleep.\nI slept fitfully and dreamed of Lady Tsuyu Iijima of the Peony Lantern Kabuki Opera in her twelve-layer kimono, singing “Body and Soul.” She danced the slow steps of a Noh above the flaming wreck of a hover car. She turned to face me, and I saw it was Seiko. She sank through the flames and into the car, and the song became a scream. “Don’t leave me,” she cried. The car exploded, and I awoke, head aching.\nFor an hour I lay in bed trying to get back to sleep but could not. I got up and washed my face. It was two in the morning. I needed a drink.\nI threw on slacks and a shirt, got my London Fog from the closet by the front door, and stepped out, half-expecting to find someone sleeping on the porch. There was no one, of course, but when I stepped past the doorway, I noticed what looked like a calling card lying facedown on the street. I bent over to examine it, but the road was too dimly lit to read by. I picked it up, and it nearly tore in my hands. It was real paper, and it had soaked up the rain and was soggy and limp. I stepped back toward the flat, opened the door, and flicked on a light.\nThe card was a delicate purple, the color of wisteria, with a name printed top to bottom in what might once have been elegant characters, but which were now blotchy from the soaking and just barely readable. Kondo Chiaki. And in the lower left corner were more blotches, a comm number, too blurred to read. I flipped the card over. It was surprisingly dry, and there was a note, written in strong and determined strokes but with a hint of impatience.\n“Thanks for the umbrella. It’s old but will keep me dry. I’d like to repay you. Let me take you to lunch—Chiaki.”\nStrange woman.\nI gently turned the card back over and looked at the blurred numbers. I couldn’t read them and was disappointed, which surprised me. I had cared nothing of women since Seiko’s death. They only reminded me of my loss and my failure.\nMy friends couldn’t understand the depth of my pain, so I drifted away from them. My family, too. My mother, superstitious as always, tried to console me. You’ll meet again in another life, she’d said, but it was small consolation for the misery I felt in this one. Running away seemed much easier than waiting. I buried myself in Dubhean studies and lived for my dream of traveling to the farthest stars. So, it disturbed me that just as I was about to begin my adventure, I found myself interested in a woman I would never see again.\nI stared at the unreadable soggy numbers, then moved to crumple the card and toss it in the rubbish can, changed my mind, and set it on the shoe cabinet next to the genkan, closed the door, and left for Ikebukuro.\nThe next morning I woke at noon without a hangover. I’d had only three drinks last night and felt good enough to start work without my can of Marina Calm. I worked until three, making steady progress, then called it quits when my stomach began to grumble.\nAfter lunch I retrieved the card from the shoe cabinet and thought about the woman Chiaki. Her frankness intrigued me, as did her clear eyes and fine face. The half-crumpled card was still damp, but no longer soggy. I could just make out the first two numbers, though the others remained blurry, wet ink seeping in a messy stain out from the original written lines. It occurred to me that I might make out the original lines under a manuscript scope. If it showed the direction of seepage, perhaps I could extrapolate the original lines. I shuffled through the desk drawers and found a small polarizing scope and examined the card. After what seemed like hours, I had a number.\nI wanted to call her but wasn’t sure I should. I was nervous. I sat down at the comm. She probably wasn’t home at this hour, so I decided it was safe to call and leave a message.\nShe answered on the third ring. Surprised, I almost hung up when she appeared on the screen. Her hair was tied back, revealing her face to be more angular than I had thought. The effect was striking, and the beauty and balance in her features was upset only by an upper lip that appeared thin against a lower lip so full and seductive.\n“Hello, Chiaki speaking.”\n“Hi. My name is Shunzo. You fell asleep on my doorstep.” I felt like an ass.\n“Oh, I was wondering when you’d call. I thought maybe you didn’t get my note.” She spoke as if we were old acquaintances.\n“I didn’t find it until I stepped out for a drink late last night.”\n“More late-night shots of Harper?” she asked.\n“Early Times. I prefer it when I can find it.”\n“Well, remind me to buy you a shot when I take you to lunch.”\n“Actually, Ms. Kondo . . . ”\n“Chiaki.” She spoke with a hint of exasperation, as though she’d already asked me several times.\n“Chiaki, then. You don’t need to buy me lunch.”\n“I want to repay you for the umbrella.”\n“Don’t worry about it. It was an old umbrella I found in the flat.”\n“I’m not worried. I’d just like to buy you lunch. How about tomorrow?”\n“I don’t think I can make it. I need to work in the daytime.”\n“Dinner then?”\nHer forward manner caught me off guard, and I didn’t know how to refuse.\n“Okay, dinner,” I said.\n“Ikebukuro, tomorrow at six thirty sound okay?”\nIt was difficult to keep pace with her. I felt exhilarated but didn’t want to appear too eager.\n“How about seven?”\n“Fine. Meet me at the west exit of Tobu Center, just outside the station.”\n“Okay, see you then.” My heart pounded. It was an unfamiliar feeling, and I found it both comforting and frightening.\nI spent the rest of the afternoon on my computer, trying to hunt down a copy of Bornitz’s Principles of Ethnoetymology. It took me all day, but I managed to find it and two other titles I needed. I went to sleep early but this time I managed to sleep until morning.\nThe next day I worked on the grammar, and by late afternoon I was anxious and could hardly wait to leave. I took a long shower and dressed slowly to pass the time. I left the flat with time to spare.\nI reached Ikebukuro at a quarter of seven. The district was busy and bright, a carnival scene that cheered me despite the rain. Gliding cabs painted in wild yellow, green, and blue checkers and stripes maneuvered in and out of the west side square. They cruised five-deep off the expressway, dropped down to the cab stands to let off customers, then ascended. Around the square holodisplays shimmered in sparkling storefront display booths, while businessmen rushed toward the station or the bars, and young couples worked their way slowly past vendors who hawked food, jewelry, toys, and pictures along the wide and narrow streets around the station.\nI noticed a small band of demonstrators below a billboard decorated with Dubhean. They chanted something I could not make out. Demonstrators were a rarity. A few politicians and activists thought 120 lightyears was too far and that the trip to Dubhe was a waste of resources. Perhaps they had a point. In 250 years who would be around to benefit from our contact with the aliens?\nChiaki was already waiting at Tobu Center when I arrived, wearing a suit of glowing blue jade that contrasted dramatically with her black hair and pale skin. She smiled warmly and stepped out to greet me. It was the first time I’d seen her clearly in person, and I was not disappointed. There was a freshness to her face that had not shown on the comm screen. Her eyes were large, and the clear black irises caught and reflected the red and blue neon lights in a way that was haunting. It felt good to stand next to her.\n“Have you been waiting long?” I asked.\n“Ages!” She laughed and looked at a slim gold watch on her wrist. “Actually, you’re right on time.”\nShe guided me to the elevator, and we joked about the unpleasant weather and falling asleep on the doorsteps of strangers. Her sense of humor was ironic with hints of both optimism and sadness. I felt a tinge of regret that I’d be leaving Tokyo so soon.\nThe top floor of Tobu One held restaurants with glass ceilings and large windows overlooking the city. We chose a steak house called Prime Time. Subdued lights, ancient polished wood, and brass tinted the room the color of honey. An old Steinway stood unused in a corner near the bar, and ancient jazz filled the room. Clocks, watches, and other timepieces covered the walls and filled the half dozen glass cases around the restaurant. Few of the timepieces kept accurate time. Only about half were running, and some even ran backward.\nThe hostess led us to a tiny table overlooking the west square of Ikebukuro, and we sat under glass, under clouds and rain, and the lights of Tokyo stretched out in the mist below us.\nWe punched in our orders.\n“I was surprised to find your note,” I said.\n“It was the least I could do.”\n“Perhaps, but strangers don’t often invite me to lunch.”\nShe crinkled her nose as if I’d said something foolish. “You think I’m bold? You’re the bold one, giving me present, and we’d just met.” She smiled. “Anyway, I had this feeling I knew you from somewhere.”\nThe comment caught me by surprise.\nOur drinks came, a shot of Early Times and a glass of Bordeaux. We sat a moment in silence. Could we have met before? She was young and couldn’t have been more than six when I was last on Earth.\n“Have you ever been in space?” I asked.\n“No, never.”\n“Then I doubt we’ve met.”\n“Oh?” she asked.\n“Time dilation. I’ve been offworld twenty-five years.”\n“I see. Well maybe you were my babysitter once upon a time.”\nI laughed, and she winked at me mischievously.\n“Unlikely. But tell me, how old are you?”\n“See, you are the bold one.” she chided me. “Why do you ask?”\n“To see if I was your babysitter,” I winked back at her.\n“Fair enough. I’m thirty-one.”\nI did a quick calculation. She would have been about one when Seiko died.\n“Well?” she asked.\n“No. I wasn’t your babysitter.”\n“That’s a relief,” she said. We both laughed.\nShe took a sip of her wine, looked at me with bright eyes over the rim of the glass, then smiled as she returned the glass to the table.\n“Perhaps a previous life, then,” she said.\nI thought of her age and furrowed my brow. “No. Not that either.”\nShe cocked her head to the side as though considering my comment. “Well, no matter. I find you interesting all the same. What do you do offworld?”\n“I’m a linguist. I study Dubhean.”\n“You must envy the members of the expedition then.”\nI thought of keeping it from her but could not.\n“No, I’m going with them.”\n“You’re part of the expedition?” She sounded disappointed but hardly surprised.\nI took a deep breath and stared over her shoulder at the city below. “Yes, I am.”\n“Any chance you’ll miss the trip or change your mind about going?”\n“Seems unlikely.”\n“I see,” she said and fell silent. An awkward space opened between us just as the waiter arrived with our dinners.\nHe looked curiously at us, perhaps surprised by the change in mood, then glanced doubtfully at the two dishes in his hand before setting them down. We ate awhile in silence. I felt terribly, unexpectedly sad.\n“But you never know,” I said minutes later and felt guilty for the deception.\nShe smiled slightly and took another sip from her wine. I finished my whiskey, then flagged the waiter for another round.\n“So what do you do when you aren’t crashing people’s doorsteps?”\nShe brightened at the question. “I’m a researcher, like you. But physics.”\n“Ah, a scientist! I should be careful, then.”\n“Careful?”\n“Beauty and intelligence are a lethal combination.”\nShe flushed a bit and looked down before looking back up.\n“What area?” I asked.\n“Electromagnetism mainly, energy pattern repetition over time. And a good deal of cognitive science mixed in.”\n“Strange combination.”\n“Not really. There are a lot of us looking at this.”\n“Really? And what exactly are you looking at?”\n“The media likes to embarrass us by saying we study the human soul.”\nThat caught me off guard.\n“You must be joking.”\n“Not at all. This is what the media say to embarrass us. Really, we look at the unique electromagnetic patterns associated with individual personalities and how they persist over time,” she started, then launched into an explanation of the connection between specific electromagnetic patterns and human consciousness. She got excited as she talked, her eyes shining in a way that was bewitching. I realized with a mixture of wonder and fear that I was drawn to this woman. Ten years ago I’d been certain it wouldn’t happen again. Loneliness had haunted me for years, but eventually I grew comfortable with my solitude. Now attraction was a burden I would do well without. I was leaving and did not need the reminder of loss and death.\nWhen she stopped talking, she looked as out of breath as I felt. The waiter brought my drink, and I downed it in one shot.\n“Your lab must have a very advanced Ouija board,” was all I could think to say.\n“You’d be amazed,” she answered playfully.\nWe finished our meal in shy silence. When the bill came, we fought over it, and I paid despite her protest.\nWe found a live house in the basement of Itoh Complex where a West African band played palm wine songs that made me feel good. The live house was dark and warm, and the air inside was dry despite the weather outside. Dark steel robots with wiry hair glided around the room delivering drinks made by a tan Japanese bartender with a shaven scalp. We ordered palm wine punch and settled back to listen to the music.\nI asked Chiaki of her childhood. She painted a picture that was detailed, yet unspecific. I could visualize the cold Tohoku city where she grew up, but I could not name it, and I could see the hard lines on the face of her father, the president of a large regional corporation that dominated local government, but I could not imagine what company it might be. I pressed her for details, but she was elusive.\nShe asked of my childhood, too, so I told her of growing up in the outskirts of Tokyo in a family split between future and past, between an engineer father, who designed ship drives, and a superstitious mother, who cared only for the journey of the soul. I explained how my childhood had been filled with ghosts and spirits, and my adolescence with science and technology.\n“Your career suggests that science won out,” she said.\n“Not really. My interest in space is mostly aesthetic. There’s something about the beauty of the rings of Saturn rising above the horizon of Titan on a sunless day. Or the purple oceans of Procyon 4. You really can’t imagine.”\nShe laughed. “It sounds beautiful, though I imagine it gets lonely.”\n“Not really. It’s only lonely when you get back and everything has changed.”\n“Doesn’t that frighten you? You don’t know what it will be like when you get back. So much can change in 250 years. It’s like you are a time traveler.”\n“Well, not much of one,” I laughed. “I only go forward, never backward. Now that would be time travel.”\n“Maybe when you return from Dubhe, they’ll have the technology.”\n“Given enough time anything is possible, I suppose.”\nWe laughed and ordered another round of palm wine punch. The music moved me, the wine relaxed me, and somehow I felt content.\nWe talked until closing, and when we finally left, Ikebukuro was shutting down. Plastic shields slid over shopfronts all along the street, and drunk businessmen lined the roadways, hailing cabs in the rain.\n“You’ve missed the last subway,” I said.\n“I know. And it doesn’t look like we’ll find a cab.”\n“I don’t need a cab. My flat’s a short walk, remember.”\n“You’re lucky,” she said. “But what will I do?”\n“I know an excellent porch you can sleep on.”\n“You’re terrible.”\n“I thought maybe you preferred porches to beds. If not, you can stay at my place.”\nShe nodded her head shyly.\nI took her hand, and we walked through the empty streets of Ikebukuro under glowing lamps and drops of rain that tumbled like stars from the nighttime sky. We cut south to Mejiro, and I put my arm around her waist and felt warmth and strength.\nWe reached my flat, and once inside we shed our wet coats. I hung them in the hall closet, then turned back to her and kissed her deeply. My head swam, and I felt giddy. We made our way to the sofa in the corner of the living room opposite the doorway, kissing and shedding clothes with each step.\n“I know you, Shunzo,” she said and wrapped her arms around me. We stood like that for a minute, then I kissed her and gently eased her onto the sofa, where we exchanged kisses and caresses. We made love, and afterward I felt satisfied and complete as I had not for many years. We moved upstairs to my bedroom, and I lay awake until I heard Chiaki’s breath become slow and deep, then I too drifted off.\nNext morning I awoke to gray light filtering through tinted one-way walls. Chiaki slept quietly beside me, head on my chest. She felt light, and her skin seemed even more pale than before. She hardly seemed to breathe. I played with her hair absentmindedly until she awoke, and we made love again.\nThe next six weeks were both wonderful and miserable. I could not focus on the grammar and made such slow progress that I began to fear I might not finish it on time. I came to resent the book-hunting trips to Waseda University and the Diet Library, and my passion for the alien language dimmed daily. I lived for the moments I could spend with Chiaki.\nFor six weeks we played like children, strolling beneath artificial stars in underground parks, skating on the magnetized walls and ceiling at Seibu Funland, and visiting gardens, temples, and shrines around the city to look at hydrangea, wisteria, and orchids. We must have looked very much in love, for people stared at us wherever we went. At night we painted ourselves with lights and danced to shrine songs on top of Rose City 5 and made love at my place and talked and told stories ’til dawn. Since Seiko’s death I had never felt as complete, or as certain of my love for a woman.\nBut the feeling did not make me happy. At times I was ecstatic, but it was the ecstasy of a manic depressive, punctuated violently with fits of despair. I did not want to leave her, but I knew I could not stay. I’d dedicated too many years of my life to reaching the stars. How could I give it up for a woman I had only known five weeks? It seemed ridiculous, and yet, I wanted to. Did it matter that it had only been five weeks? It seemed like so much more.\nSometimes I felt as though we had known each other lifetimes. Could I trust such feelings? A cynicism borne perhaps of solitude told me love always feels like this at first. When a man thinks he has fallen in love, he believes it will last forever. He never suspects his love might be an illusion bound to fade. Without time he could not know.\nAt other times I rejected the cynic in me. Time is not a solid, concrete thing. It is relative and provides no absolute measure. What could time mean to a man who aged five years while others aged twenty-five? Could not the heart travel at the speed of light and obtain years of understanding in the space of weeks? I wanted to believe it could. But the part of me that feared love told me it could not. Five weeks of love were still only five weeks. It made no sense to stay.\nOne morning about two weeks before the grammar was due, while Chiaki slept in the bedroom, I was working in the study when Yamamoto called. Two incomplete drafts of the grammar and several books cluttered the desk. I had to push these aside to get at the comm switch. Yamamoto appeared on the screen behind piles of crumpled paper, her face drawn and tired. The project was taking its toll, I could tell.\n“Shun, only two weeks left, and I’ve yet to see a page of your work.”\n“It’s right there.” I gestured at the mess on my desk.\n“Looks incomplete.”\n“It is.”\n“Hokada’s getting ready to take your spot, you know.”\n“Don’t needle me, Yamamoto. I’ll get it done. I’ve got a lot on my mind right now.”\nShe picked an open green file off her desk and studied it a moment. “I can’t imagine what.” It was just like Yamamoto not to refer to Chiaki directly. “Day after day frolicking like a child. You seem to have some unnecessary distractions.”\n“So?”\n“I suggest you get rid of them. The sooner the better.”\nI crumpled a sheet of paper and tossed it on the pile.\n“I’ve cut out the drinking, and I’ll finish the damn grammar. But how I choose to spend my days is none of MODE’s business.”\n“If it affects your performance, it is. We need someone more stable and more dedicated than that.” She gestured at the mess on my desk. “Otherwise you’re no good to us. You need to focus.”\n“And if I don’t?”\n“There are many universities that want a man of your expertise.” She delivered the line smoothly, and I knew the threat behind it was serious, but I could tell from her eyes that she did not enjoy saying it.\n“Thanks for the advice, boss,” I said icily. “Anything else?”\n“No.”\n“Good. Tell Hokada not to get his hopes up.” I clicked off the comm without waiting for her to say goodbye, then heaved a deep sigh and leaned back and rubbed my eye sockets with the palms of my hands.\nI heard a sound behind me and turned to see Chiaki looking at me from the doorway, fully dressed but with her hair wet from the shower.\n“You don’t have to go,” she said without coming into the study.\nI swiveled the chair around to face her but did not immediately answer. I wondered how much she’d heard.\n“No, I don’t,” I finally managed.\n“But you will?”\n“I . . . I’m not sure.”\n“Oh, Shun.” Her shoulders sunk, and I could see moisture in her eyes. “I don’t want to wait,” she said, as if such a thing were possible.\n“I’ll have died by the time you get back.” She pulled absently at a bit of thread on her sleeve, not looking at me, her eyes far away.\n“I know that.” I struggled to find words to show I understood and cared and was hurting.\n“I don’t want to wait,” she repeated.\n“There’s no such thing as waiting. I’ll be gone too long.”\n“I know how long you’ll be gone, Shun, but there’s always waiting. I know you don’t understand, but it’s true. And I don’t want to do it. I can’t.”\n“Do you think it’s so easy to give up a lifetime of work?”\n“No, of course not. But what is one lifetime against the sea of eternal love?”\n“Chiaki, we’ve known each other six weeks.”\n“Six weeks, Shun? It feels so much longer. I’ve known you for years. I know I have. You must sense it, too. You of all people should know time is relative.”\nI nodded.\n“You’ve got to trust that feeling. It’s not an illusion.” She sounded so miserable it hurt my heart to hear it. “It’s real. I belong with you.”\nI squeezed my eyes shut and took a deep breath. “I want to stay with you, but I need time to think.”\nAfter a long silence she spoke.\n“I’m so afraid. Please, tell me. I need to know if you’re leaving. Please, tell me the truth.”\nI sat, eyes jammed shut, unable to speak, unable to move. Frozen in place. Again.\nFinally, I opened my eyes, but she was gone, having already silently let herself out the door.\nShe didn’t come back. I called her as often as I dared, but she never answered and never returned my calls. I tried to focus on my work but could not. The alien language now felt lifeless and empty, cold and meaningless. The expedition repelled me almost as strongly as it had once drawn me, as though the gravity of my life had somehow reversed itself, and I was being pulled inexorably to Earth.\nFor three days I sat at a blank screen, trying to work. Occasionally I’d enter a line or two before giving up and trying Chiaki’s number again.\nI could not get her from my mind. I tried to forget her but could not. She haunted my waking hours, and the nights were even worse.\nI dreamed of her, disturbing dreams of Chiaki 200 years from now, a withered skeleton wrapped in an elegant twelve-layer kimono, reaching out for me. Or Chiaki calling to me. She begs me to stay, but I turn and run instead. And I run until I am crossing planets, stars, galaxies. Mornings I wake exhausted and frightened, resenting my work.\nAfter three such tormented nights I woke knowing it was time to visit Seiko’s grave. I needed some clarity. I didn’t have to go to Dubhe, I knew. Yamamoto and MODE could obviously do without me. The important question was whether I could stand living on this haunted Earth. I did not want to see the grave, but I could put it off no longer. The prospect did not cheer me, and I lingered in bed an hour later than usual, feeling hungover, though I’d had nothing to drink for days. Eventually I forced myself out of bed.\nBy eleven the drizzle had ceased. The sky was a uniform ash color, drab and monotonous, and the wet air felt warmer than it had in days.\nSeiko’s grave was in Zōshigaya Cemetery, an easy walk from the flat. I made good time along Mejiro and Arakawa, the sidewalks empty of pedestrians save a few ancient women out for a walk around the block, Gakushuin students on their way to Ikebukuro, and an occasional businessman.\nI reached Zōshigaya at eleven thirty. The place was crowded with high school students praying at the graves of famous scholars for success in college entrance exams, aspiring writers seeking inspiration from the spirit of Soseki, and children on a field trip, ushered from one famous grave to another by cheery teachers. The dead didn’t seem to mind. Their holographic images appeared content among the playing children and visitors who left presents of flowers, fruit, sake, and potato chips.\nI marveled at the gaiety. Death surrounded them, but the visitors remained undaunted and untouched. But I could feel it, a cold and threatening thing that made me shiver despite the warm air. My father had taught me that death was simply the end of life, nothing to fear, but I could not believe him. How could life just disappear when the act of dying was so miserable and full of agony? I imagined a realm filled with each man’s final anguish, hatred, longing, anger, and fear. I shuddered at the thought of dwelling in such a place.\nI found my way to the temple compound and bought joss sticks and a lighter before consulting the cemetery map to get my bearings. Seiko’s grave lay in a quiet corner of the graveyard, where no one famous was buried. I expected to find the grave untended, but it was tidy and clean. The dirt around the marble tombstone had recently been raked, and someone had left flowers next to the incense burner. I lit the bundle of incense, which smelled of jasmine and sandalwood, touched them to my forehead, and placed them in the burner, activating the holographic projector.\nThe image started as a tiny ball of indistinct light that swirled and slowly grew into a disturbingly real projection of the woman I had once loved. She sat against the edge of the tombstone, dressed in satiny white, smooth legs crossed, brown eyes focused on a spot about two feet behind me, a slight smile playing on her full lips. Through the precious light of her ghostly image I could just make out the characters carved into the tombstone behind her.\nI thought of the four years we’d spent together. They were good years, but they had not been easy. We’d been too different despite our similarities. Slowly and painfully we reshaped each other into a powerful unity, two complementary halves that made up a balanced and inseparable whole. No, not inseparable. Somehow something in me resisted that unity. I needed to hold on to a piece of myself.\nWe’d fought on the night she died. I had accepted a scholarship in California that would get me closer to traveling in space. Doing so meant breaking a promise to stay in Tokyo until she finished her law thesis. I told her on a drive out to Atami for a night at the coast. We should have canceled the trip; the Izu grid was down, every hover on manual, and we were in no condition to drive. We argued an hour, she angry at my selfishness, me frustrated by her refusal to understand. Our faces were tear-streaked, and she looked as emotionally drained and exhausted as I felt. So when a truck drifted down into our lane, I wasn’t ready for it. It smacked our hood, and the car dropped like a rock, bounced off the road, and rolled off through bushes and finally a tree. Somehow I was thrown free of the wreck and landed in a mushy wet rice field. When I came to, Seiko was screaming. The car was on fire, and she was trapped inside. I stumbled toward her as fast as I could, but every move felt slow, too slow, like some crushing gravity pulled me down, slowing time. Two more steps and the car burst into flames. The gravity broke and I hurled myself at the flaming vehicle, but the fire lashed my face and torso, driving me back.\nI lived through the accident, but something inside died and left an emptiness I was never able to fill. I struggled to make my way back into the world of the living, but I failed. The world contained only ghosts, and eventually I realized the best I could do was run away. I buried myself in my studies and vowed that one day I would run away from this Earth. That eased the pain, but the emptiness remained.\nIn the graveyard the holographic image began to fade. As I stared at Seiko shimmering in front of the tombstone, I realized that for six weeks I had lived without that empty feeling. Chiaki had filled me with something that had long been missing. I no longer needed to run away.\nThe joss sticks burned down to the end, and Seiko smiled, bowed her head, and faded from view. “Goodbye, my star child,” I said and turned and walked back toward Mejiro to call Chiaki and tell her I was staying.\nI was surprised to find her waiting outside when I got home, absentmindedly kicking a pebble back and forth between her booted feet, the tilt of her shoulders sad despite the brightness of the flower prints on her raincoat. She didn’t look up when I approached, I stopped a meter from her, wanting to touch her but not wanting to startle her, afraid she might disappear the minute she noticed me.\n“I was worried I might never see you again,” I said.\n“Me too.” She looked up, and her eyes were wet with tears but also warm with love. “I have to tell you something. Something I need you to know.”\n“I’ve decided to stay,” I blurted.\nShe smiled then, a half smile that said she wasn’t sure she could believe me. Her eyes bored into mine, darting from my left eye to my right, then back again. Finally, she smiled a real smile, one I could believe in, and the tension in my stomach, my back, and my forearms eased. We stood that way for a minute, then I reached for her hand and said “Come. Let’s get out of the rain.”\nInside the front room, we sat in silence on the sofa where we first made love. I savored the moment, not wanting to break the peace. Chiaki was the first to speak.\n“I still have something to tell you.” There was a distance in her voice, as if she were afraid of what she had to say. I nodded my head and waited.\n“We’re not from the same time.”\n“I know.”\n“You were born a long time ago, and yet we’re together, as if you traveled through time to get here.”\n“Sure, but time dilation isn’t really time travel. It’s simple physics.”\n“Yes, but if you didn’t know the physics, it would sound impossible.”\n“True,” I said. I wasn’t sure what she was getting at.\n“Did you know it’s also possible to travel backward in time?”\nThe question jarred me. Back in time? I thought of a moment many, many years ago and a dark drive along the coast to Atami.\n“No,” I said flatly. “This cannot be true.”\n“It is true. I know it can be done.”\nI stared at her hard and marveled at the conviction in her eyes. She seemed at once both innocent and wild, her eyes shining with a strange resolve. The light in her eyes was not the enthusiastic spark of a young idealistic scientist. It glowed with an unearthly fire. Could she be right? An image of flame, torn metal, and molten plastic flashed in my mind, and I thought of traveling to a moment before that horrible night. The thought stabbed at my heart.\n“You cannot know such a thing,” I said flatly. “Maybe in a theory, maybe in a formula or a paper, sure, maybe it could be true. But that’s an abstraction. This physical world is not so malleable, Chiaki. Time moves one way, and you can’t go back.”\nShe sighed and the glow in her eyes dimmed. “You sound so certain for someone who knows so little about time.” She looked down at her feet, then pulled at a thread on her blouse.\n“Going back in time is possible. I know because I’ve done it.”\nI winced as she said it, the words so strange and unexpected. I looked at her and her eyes were clear and firm and filled with an intelligence and calm that was impossible to dismiss as crazy.\n“You’ve gone back in time?” I tried but could not keep the skeptical tone from my voice.\n“No.” She shook her head sadly as if resigned that I wouldn’t believe her. “I’ve come back in time.”\nI pondered the difference for a moment.\n“You want me to believe you’re from the future.” I wanted to believe her, if only because it was easier to believe in time travel than to accept that she was crazy, but how could I believe such a thing?\n“You know how crazy that sounds?”\n“I’m not crazy, Shun. Not that way. Maybe I’m mad with love to do something so extreme, but I’m not delusional. I’m telling you the truth.”\n“How do you expect me to believe that.”\n“You have to believe it.”\n“Why?”\n“Because if you don’t, then I’ve come here for nothing.”\nI stared at her, wondering what to make of her words, then rubbed my eyes with my scarred left hand before looking up at her. She met my gaze with clear, searching eyes.\n“What have you come here for then, Chiaki?”\nShe sat up and leaned toward me. “I came back to find you.”\nThe words had a strange quality to them, full of yearning and hope, both comforting and chilling.\n“Why on earth would you do that?”\n“I couldn’t stand waiting anymore.”\n“I don’t understand.”\n“Shun, when you talk of your past love, of Seiko, I can hear in your voice a sense of connection that even death couldn’t break. It’s true, isn’t it?”\n“Yes. It’s true. Does that bother you?”\nShe laughed, and the mood lightened for a moment.\n“No! No, it makes me happy. It gives me hope that I am right about you. The feeling you have is right. It’s real. You shared a bond stronger than life. It’s true.”\n“Chiaki, I still don’t understand.”\n“Let me tell you what I learned in my research. I told you my work involves tracing connections between specific electromagnetic patterns and individual human consciousness. Well, one thing we discovered is that individual patterns repeat themselves at irregular intervals throughout time. There’ll be a pattern, and it will be there for fifty, sixty, eighty years, then it will go away. Years later it shows up again, maybe in the same place or maybe somewhere totally different. Another thing we discovered is that patterns that show up together in one time tend to show up together in later time frames, not always the exact same time or the exact same place, but they almost always cross paths again, and usually substantially.\n“Now you, your pattern never shows up again. That’s exactly what we hypothesized for someone who spends the next couple hundred years traveling at near light speed.”\nI pondered that a moment.\n“But why did you come back here? You still haven’t explained that.”\nShe squeezed my hand then, and looked with wide searching eyes into mine, then began to speak.\n“A few years after your pattern becomes untraceable, a girl named Ursula is born in Canada. She grows up lonely and spends much of her life sure something essential is missing. She seeks counseling and gets professional help, but records show she found little relief. Eventually she died an old and lonely woman.”\nI furrowed my brow, unsure what she was getting at.\n“Not long after that, another child is born, a boy this time. Similar story of longing and loneliness, but he becomes a travel writer, famous for documenting his quest for a spiritual truth that somehow eludes him. He lives until he is forty, but then kills himself from loneliness.\n“After that, another girl, suffering from abandonment trauma despite what appeared to be caring, engaged parents. She set herself on fire on her fifteenth birthday.”\nI flinched at this.\n“I’ve traced the handful of other cases, similar pattern, a strange and powerful longing, progressively deeper misery, sad or tragic endings.”\n“I still don’t understand what this has to do with you. Or me.”\n“Let me tell you about the most recent one, the one in my time. A girl is born, this one in Japan, in Tohoku actually. A smart girl, scientifically inclined, but filled with that same dark vacuum of longing and despair.\n“The world is a very different place by then. You can’t imagine the technology. They’ve found ways to send and retrieve electromagnetic energy signals back in time. They’ve discovered these electromagnetic patterns I study, and they’ve figured out what they are, how to identify them, and how to trace them back through time.”\nThe implications of what I was hearing struck me, and my rational mind rebelled. Could this really be true? Again, I wondered if there was something wrong with Chiaki. Or perhaps it was me. Was I hearing this? Or just imagining it?\n“And so this girl, driven by misery and need, becomes a scientist, one of the leading experts on the repetition of these patterns. And she traces her own pattern back through time to find out who she was and why she’s so miserable, and where this yearning and longing and loneliness comes from. And what she discovers is that it’s you. She’s supposed to meet you. But she can’t, because you never die. You’re removed from time, traveling away from here at the speed of light. So she comes back to this moment, the one we are in right now. She wants to take you back with her, Shun. I’ve come back for you. It’s me.”\nSeiko.\nI could feel it. I recognized it the first time we met. She didn’t look like Seiko, but something had reminded me of her even then. I stared as deeply into her eyes as I could, and she matched my gaze. A warmth and a chill moved up my spine. Seiko.\nI looked back at her. She was smiling, a sad but warm smile, full of longing and love, but no anger. I reached over and gently ran my index finger along her jawline, feeling an intense relief at recovering something precious. I bent down and planted a delicate kiss on her forehead, my heart trembling. I had found her, this love I had lost so long ago. I pulled her to me. She started to tremble, and I could tell she was crying.\n“It’s okay,” I said. “We’re together again. We can stay together.”\nShe didn’t stop crying, and I was overcome by fear that I would lose her again. Something was wrong, I felt it.\n“What’s wrong?” I asked.\n“I can’t stay here, Shun. I have to go back to my own time.”\n“No, you can’t. I’ve only just found you. You have to stay.”\n“I can’t. You were right, going backward in time is different from going forward. Going back is a constant fight against the flow of time. The amount of energy required to keep me here is too much. I have to go back.” She paused a moment, then added almost without breath “I want you to come with me.”\nI stared blankly at her for a moment, trying to process the words. Go with her? Give up the stars and leave the present? Could I do this?\nI could give up the stars, that much I knew. I had already decided to. But go with her to the future? It meant turning my back on this world and embracing a shadowy time I knew nothing about. But the present meant little to me. I had only been here a few weeks, and I planned to leave it anyway. Hadn’t I always faced a shadowy future? Did it matter whether I reach it through light speed travel or through whatever technology had brought Chiaki to me?\nI looked at her and could see both the hope and the fear in her bright eyes.\n“I’ll go with you,” I said and felt a surge of energy rush through my body, flushing into the deepest corners of my flesh, like every fiber of my being was vibrating at some high frequency.\nI laughed. “Yes. I’ll go.” Of course I would go. How could I not?\nChiaki smiled and a weird and beautiful green light sparkled in her black eyes. “I was hoping you would say that.”\nI held her for a long while and enjoyed the calm and tender warmth and sense of peace.\nThen I began to wonder about the physics of it. How would it work and what technology would be involved.\n“So how do we do this?” I asked, breaking the still silence. “Is there a machine?”\nChiaki frowned. “It’s hard to explain. You might not understand.” She looked away.\n“I don’t need the details. Just how we’ll do it and what I have to do.”\n“That’s not what I meant, Shun. It’s just that this won’t be easy for you. Maybe we should wait.”\n“No. We can go now. There’s nothing here for me. I want you to take me with you.”\n“I can’t just take you with me.”\n“What do you mean?”\n“I can’t just move your body into the future. It doesn’t work that way. It isn’t possible to move matter through time.”\n“But you’re here,” I insisted.\n“Energy,” she said. “My electromagnetic pattern.”\nA cold tingle spread across my back. I squeezed her hand to reassure myself.\n“But I can feel you. I’ve touched you. Look.” I squeezed her hand again. It was solid. A hand, not some disembodied energy\n“You feel me because I’ve inserted my electromagnetic energy pattern into yours so that we can be together. I can only do that with one individual energy pattern. I’m perfectly real inside you. But I have that reality only within your reality. Other electromagnetic patterns don’t have me, can’t experience me.”\nMemories of strange looks we’d received from hostesses and waiters as they delivered food or drink for two flashed in my mind. I thought back to my argument with Yamamoto and her vagueness in referring to my “unnecessary distractions.” She hadn’t been avoiding the subject of Chiaki. She just hadn’t known.\n“We don’t have technology for sending matter through time. It’s probably impossible. We can only send energy. So I sent my energy back to this time to find you and bring you back with me.”\nI could feel the cold tingle on my back spreading.\n“You can only bring my energy with you to the future?”\nChiaki nodded, a very slight nod.\n“And what do I have to do for my energy to go with you?”\nChiaki took a deep breath and spoke in a whisper. “You have to die,” she said.\nI closed my eyes, and an image drifted to my mind of that desperate lonely girl setting herself on fire on her fifteenth birthday. Was this how I was to go, taking my own life like those lonely souls Chiaki had studied—a partner in a strange double-suicide pact broken by the physics of space-time?\nI opened my eyes. Chiaki was weeping silently, silver tears drifting down her pale left cheek.\n“You wouldn’t really die, Shun. You would shed your body, this specific body, but only temporarily. We would be together again in my time.”\nIt was terrifying. And yet I wanted it. I wanted to go with her, sacrifice myself and rescue her from her torment. I could right this wrong and reclaim my love. I looked down at my hand and at the angry scarring on my left forearm. The mottled, molten skin from the accident ran up under my sleeve all the way to my shoulder. Would I add a razor slash to that scar, cutting a doorway through my own flesh into my true love’s distant future?\nI thought about MODE and Yamamoto. She’d be horrified when they found my lifeless body, but Hokada could replace me. He wasn’t half the linguist I was, and the team that went to Dubhe would be weaker, but ultimately MODE would be relieved. They wouldn’t understand. They’d think it was just suicide and be glad they hadn’t burdened the crew of the mission with someone so unstable. I laughed at the thought. They’d think I’d committed suicide. For a moment it seemed ridiculous. And then it didn’t seem ridiculous at all.\nI looked up at Chiaki. She looked so real. She was pale and beautiful, and her dark hair cascaded down the left side of her angular, perfect face. I wanted to hold her, but somehow the thought frightened me. She looked up, and I looked away briefly and stepped back.\nShe winced, and I thought I saw a spark in her eye, a hint of fire that flared briefly then faded as she composed herself.\n“Please Shun, don’t run away from me again.”\nMy head snapped up toward her at the word “again.” Don’t run away “again.” Why had she said that? My throat clutched and my shoulders felt cold. I realized with a sudden gut-wrenching flash that she knew.\nShe looked horrified as she realized what she had said.\nWe had fought on the night she died, after I told her about my scholarship in California. And when the truck smacked our hood and sent the car bouncing off the road, I was thrown free of the wreck, just a couple of feet. I never lost consciousness, though it felt like I was in a dream. I looked at the mess of the car smashed against a tree, the bent metal pinning Seiko inside. She looked at me in desperation, and I stood quickly and tried to move. I was injured, but not badly. I could move my fingers and joints and bend all my limbs. But I just could not get them to go anywhere. And then a jet of fire flamed off the front end, and Seiko screamed, and I unfroze. I could move again, so I did.\nOnly, not toward her, not to save her. But away from her and the car and the fire. To safety. I have no idea why. Sheer terror, perhaps. Some inexplicable unforgivable selfish instinct. I still don’t understand it. But I ran away from her, from the screams and the sobs that grew distant behind me. And then the spell broke, and my senses returned. Seiko was still screaming. The fire raged, and she was still trapped inside. There was terror in her eyes but also an anger like madness. I stumbled toward her as fast as I could, every move slowed by some crushing gravity that pulled me down and distorted time. The car burst into flames before I reached it. I hurled myself at the flaming vehicle for as long as I could bear it, but the fire lashing my face and torso drove me back. I could not bear the pain, and I could not bear that Seiko had died in that pain. Our friends thought I was a hero for trying to save her, but I knew the truth. I was the only one who knew. Aside from Seiko. Aside from Chiaki. A bolt of shame flushed my face, and my heart pounded, but my spine felt like ice, and I shivered.\n“Shun,” she said and reached a soft pale hand toward mine. Instinctively I flinched, and she jerked her hand away as though I had burned it with my fear.\nHer shoulders shook, and her swollen eyes poured tears down her pale cheeks. I tried to meet her eye but found I could not face her. I was frozen in place again, unable to move.\n“Shun,” she called softly, but I could not respond. “Shun, please.”\nI tried to move, to reach toward her and touch her, but I could not.\nI tried to speak, but the words I wished to say wouldn’t come. I lifted my eyes and glanced furtively at her. The flow of tears had stopped, but the sobbing continued, her shoulders shuddering with each breath. She looked so broken, a sad and lonely ghost mourning a lover who refused to die. She sat that way awhile. Then finally she stood and without a sound moved toward the front door. At the doorway she turned, made as if to speak, then stopped. Her eyes darted over my face, and her brow creased as if she too were struggling against some invisible force. Then her eyes dropped, and her shoulders sagged, and she let out a deep sigh that sounded almost like a rattle. Then she stepped out, and the door slid shut behind her, leaving me alone in my room.\nI went upstairs and lay in bed the rest of the day shivering. That night I found it hard to sleep. My eyes would close, and I would start to drift off, but then I would imagine Lady Tsuyu Iijima’s skeleton hands closing around my throat, and my eyes would snap open. Eventually, I slept, and the next morning I awoke, though not at all sure I was glad to be alive.", "source": "https://clarkesworldmagazine.com/yanagawa_06_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: How Long the Shadows Cast by Kenji Yanagawa"}