{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Thoraiya Dyer", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "37YtIDSfhJ+30vd5WX6REtxPj7I=", "id": null, "license": null, "comments": "", "raw_text": "6710 words, short story  The House of Half Mirrors  My house is full of half mirrors.  Mam tells the tale like it’s an amusing anecdote: that time she brought a fiddler home from the Anchor, and he wasn’t a man but a fomoiri, and all the mirrors from the wardrobe doors to the polarized sunglasses on the sideboard cracked neatly into perfect halves.  At least, she used to tell it. Before cancer took her.  Who believed in fomoiri in 2042? At the time, I bit my tongue and charitably assumed it was her oblique warning about violent partners and the end of days. When fuel ran out, everyone who didn’t raise their own food relocated inside ration delivery zones. She moved in with me, bringing as many of the half mirrors as she could fit in a wagon hitched to the back of her pushbike.  Me old Mam, cycling sixty kilometers from Cahersiveen. Happy days.  She did always go on about the better halves of human nature, about seeing the good in things. Since Da was a useless tool, I’d tell her that when I looked in the half mirrors I could only see the half of me that came from her.  Mam’s half mirrors match what’s technically only half a house. Since she died, a young single mother got allocated the upstairs. That interloper’s two children thump around like live basketballs and she hogs the washing line down the side, but I’ve got a sunroom at the back with the windows all smashed where I hang my laundry to dry.  In a corner of that wrecked sunroom are three heavy, soil-filled pots with dead trees. Sad stick skeletons with the morning sun on them. I should be tossing them, but I can’t, any more than I can toss the half mirrors.  Mam dug up three hazel saplings and brought them inside when the next-door house collapsed on our garden. She loved those little trees, just like she loved the oak woodland by Lough Leane. I can’t even keep a plant alive. Lucky I never became a parent.  And now I’ve mooned about, gazing guiltily at them, for so long that I’m late for the lock-in. Can’t even be on time to save our besieged final scrap of wild.  Haven’t even called the hospital to let them know I won’t be at work today.  Sliding in my socks across the solid oak floorboards—they’re the only indestructible part of the whole shitty, falling-down house—I dump my tea dregs in the kitchen sink. It’s not backed up because of the mouse in the dried-up u-bend addicted to tea leaves.  The plumbing doesn’t work.  It hasn’t worked for fifty years, which is how I got the house so cheap. Which is fine, since these days the village tap water’s poison. It’s as deadly as all those lush meadows and sweeping fields that kill stone dead any escaped stock that graze on them.  Bottled gallons come as part of the weekly ration.  Mam used to do a dowsing course for tourists back in Cahersiveen. When she came here, she promised she’d find me my own source of spring water. Carrying her daft twig through the house, she’d stopped in the middle of the sunroom and said it was under the boards.  I told her I wasn’t pulling up the boards. They’re the only indestructible part of the whole shitty, falling-down house.  When I pick up the phone, it doesn’t work any better than the taps do.  Which is new.  But it was only a matter of time. We live in a shitty, falling-down world.  The lock-in is exactly what it sounds like.  A gaggle of fools, me included, crowd the grass outside the towering gates, dodging Clydesdale manure piles and patting one another on the back for putting the woodland ahead of our own hungry families.  Except I’ve got no family left. It’s not that much of a battle for me, so.  We’re going to lock ourselves onto the gates of the walled-in woodland. There, the lakeside forest, still emerald green, hides ruined abbeys and harp-haunted hill forts.  The ancient wall was renovated in the thirties. Four meters of gray-painted concrete is supposed to keep looters out of the castles and weeds and feral cats out of the woods.  Ever since the big enviro-disaster, though, there’s been something spooky about the wall. On the outside, like all the local houses and farms, the soil tests toxic.  Not inside the wall, strangely enough. No poison seeping up through the roots of those gnarly old oaks. Nobody knows why.  Nobody cares why. They want to open up the gates to let the sheep and cattle in to graze.  Today!  But not today. Today we’ve got enough warm bodies to make a human barricade.  I wonder how we’re going to organize tomorrow, without phones, but then there’s no time for wondering because we milling protesters must speedily handcuff ourselves to one another. In fact, since I’m late, I’m surprised there aren’t patrol cars here already.  But the phones aren’t working. I guess the farmers can’t call the Gardaí.  Everyone’s brought their own bangin, blacksmith-made manacles.  “Faster!” the organizer bellows. “Next!”  I’m next.  And that’s when I see I’m supposed to be locked onto one of the aos sí. He’s sitting cross-legged on the ground, being careful not to lean back against the iron of the gate.  How ninety-nine aos sí got stuck on this side of Lough Leane.  \r\n This is the story they used to be telling the tourists: Every seven years, on May 1st, the famous warrior chieftain O’Donoghue Mór rises from the lake near Ross castle. The fairy host from the land of youth floats over the waters of Lough Leane in the wake of his hovering white horse.  Catching a glimpse of him is pure good luck.  Nobody actually catches any glimpses of him.  Rephrase: Nobody, in those early-millennium days of miniature cameras everywhere, managed to film him.  Then one morning, the sun came up on ninety-nine ethereally beautiful eternal-youths and one pissed-off warrior ghost. Teenagers had their drones out there in a heartbeat to confirm what the shocked groundskeepers reported to Radio Kerry.  Later, scientists surmised all the drilling and hydraulic fracturing for gas and shale oil caused a miniature earthquake sometime between dusk and dawn. Half the lake water drained away into underground parts unknown. Phenols contaminated the other half.  Fracking fluid poisoned the groundwater, too. There were dead fish. Trees losing their leaves mid-summer. A rain of death.  A magic door closed and locked, perhaps in self-defense, from the other side.  \r\n The ghost of O’Donoghue Mór swore to find a lake still pure enough to reopen the portal between worlds. He set off alone.  He hasn’t returned. That was ten years ago.  The aos sí looks the way they all look, the ones that come from royalty.  Something like Orlando Bloom, circa two thousand, in a long blond wig made from Russian ladies’ hair. But pecs, by God! This one’s got magnificent pecs making the buttons of his silk shirt pop.  And I remember the last thing I saw on the free web before it stopped working. That serial killer, Cian, and how he looked at his trial. Much the same as this. Much the same as an ageless aos sí supremacist still looks after nine years in maximum security, I’d be guessing.  I stared at the accused in that witness box. I knew he was pure evil. But society had trained me to find him beautiful, and beautiful he was, feck it all to hell. The words of the human reporter washed over me without leaving any impression. I stared at the flawless face of that ruthless cunt, trying to imagine the screams. The blood. The bodies of Cian’s victims on that inter-island ferry where he’d cut them down with keen-edged, aos sí-forged silver before sinking the ship with a thousand corpses on board.  I couldn’t find him ugly.  No matter how I tried.  I think that moment was the moment. It was the first time I turned on myself. I always liked who I was, before then. That moment was when the self-hating started.  At the woodland gate, nobody offers to sit down next to the aos sí. Nobody rushes forward to take my place. Nobody trusts the fancy titanium handcuffs he’s brought because he can’t be abiding the touch of iron.  Of course he cares about the oak woodland. Of course he wants to do something, the same as the villagers do.  I just wish he’d do it somewhere else. When I look at him, I see Cian. Worse, I remember the repulsive inner me that wanted to fuck Cian, even knowing what he’d done.  I plonk myself on the pavement, shoulder to shoulder with the aos sí protester, and thrust my hand through the cuff without a word.  “Hello,” he says as he locks my wrist tight to his. I ignore him. A gray-haired granny in a flannelette shirt sits on my other side.  “How’s she cutting?” I ask her casually, offering my other wrist.  “Straight down the middle like a razor blade,” is granny’s gruff reply as she snaps herself onto me.  “I’m Miach,” the aos sí tells me, trying again.  “G’luck, so,” I say, giving him my best stop-talking-to-me glare. His eyes are the color of green glass held up to the sun; green like the woodland in spring; green like the new leaves on Mam’s hazel trees that I didn’t water til it was too late.  Then it dawns on me that this aos sí isn’t one of the stranded ninety-nine. Mam and I looked closely at all those faces on the news, trying to see if any of them was the fomoiri she met at the pub. None of them were.  “You’re sitting on my foot,” he says, at the same time as I say,  “What did you say your name was?”  “Miach,” he replies patiently.  I move my arse off his ankle.  “You’re not one of the ninety-nine.”  “No. I came through the door long before they did. My father kept trying to kill me, you see.”  Flashback of Da’s fist raised in anger.  “Which door did you come through?” I wonder aloud. “The lake? The same as O’Donoghue?”  “No.” Miach gives a subtle shrug. “Centuries ago, I was brought out of a stone well in a hazel thicket. Its waters were even purer than the waters of the lake. Since coming back here a few days ago, I haven’t been able to find it. It must be covered in iron. Somewhere under the village.”  Jaysus.  “I’m supposed to be helping the ninety-nine find their way back home,” he carries on, unperturbed, “but today the woodland seemed more important.”  The woodland isn’t important. I don’t give one single flying feck for the woodland. I’m here because Mam would have been here. I’m just doing what she would have done.  “I’m supposed to be at the hospital,” I say. Respect enters Miach’s already rather stiff and respectful expression, so I add quickly, “I’m not a doctor.”  “A nurse?”  “No.”  I’m not a nurse. Too dumb for that. Remember that nurse who killed a man by putting a decimal point in the wrong place? I clean floors. I lift heavy things.  Before that, I vacuumed the carpets at the fracking company offices. That was prior to the earthquake. Mam never told me straight out that I was aiding and abetting the ruination of the natural world, but I saw it in her sad eyes whenever she straightened me uniform collar.  “Oh.”  “Are you a nurse, yourself?” I react rudely.  “A doctor,” Miach says. Of course he is. “At least, I used to doctor to my people. My sister and I took after our father, a celebrated healer, but it turned out we were more gifted than he was. Out of jealousy, he cut me once with his sword, through the skin. Then twice, through the bone. Then three times, all the way through my brain.” He angles his head, and doesn’t need to part his long hair with his fingers for me to see the faint pink scar running up the middle of his forehead and over the crown of his head.  “Jaysus,” I mutter. Da might have wielded his fists but he never sliced my brain in half.  “My sister thought I was dead that third time, for sure. She brought my body through to this world. Her tears made healing herbs grow up and over me. I had to claw my way through them when I woke. By that stage I figured I’d better not go back and give my father another chance at it.”  “Is your father one of the ninety-nine?” I ask. “Is your father Cian?”  “No.”  Sirens drag my attention away from Miach. The Gardaí are finally here. Also arriving are the shepherds with their dogs and swarms of goats and skinny border leicesters. The sheep look like they might chew through, not just herbs and bark, but the trunks of the oaks like living chainsaws.  “Don’t mention how you can heal yourself,” I suggest to the aos sí, “or they might be sawing through your arms instead of the handcuffs.”  “I can’t heal myself. Not in this world. That’s why I’m talking to you and not this other fellow. You’re on my right side. Since my father cut my head in half, I can’t hear anything with my left ear and I can’t see with my left eye.”  It takes the authorities another six or seven hours to get the equipment that they need to hand. By sunset, I need to piss badly. The old lady on my right confides that she’s wearing an adult diaper. Obviously I didn’t think the protest through.  They cut Miach out of his titanium handcuffs with a steel saw. When sparks touch the blue-veined, paper-white skin of the inside of his wrist, his whole body convulses, like they touched him with an electric cattle prod. But he don’t make a sound.  He does piss himself.  Then I do, too, not because I’m in pain but just because it’s been so long, and if anyone smells me, they’ll probably think it was him. I try not to care that they’re hurting him. He chose to be here, same as the rest of us.  “Feckin fairy,” swears the Garda sergeant, hauling Miach to his feet. She’s a head shorter than he is but solid. A mean, freckly tank. They take all two dozen of us to the station and throw us behind bars, but what for? Our punishment is that the woodland gates were thrown open. Sheep and dogs went inside the fence in an endless stream. We couldn’t even keep them out for one full day. The police can’t punish us.  Can’t punish me, anyway. I don’t think Miach likes those metal bars very much at all. He’s sweating like a priest in a playground. People sneak in to ask him if he’s really Miach, the fairy magician, who can heal anything, even cancer, but he shakes in a corner, as far from the cold steel as he can manage, and doesn’t answer them.  But I deserve to be back here again.  Evidence I’m mostly Da (my worse half):  \r\n On weekly ration delivery night, I steal from the single mother upstairs.  Not from the two little shitehawks. I leave their stuff alone. Just the mother. Her English isn’t great. Don’t think she can read the manifest. Don’t think she even knows she’s supposed to get mutton and Guinness in her ration.  Probably she’s a Muslim vegetarian, anyway.  \r\n She’s not a fecking Muslim vegetarian. I’m full of shite like a Christmas turkey. The fact of the matter is, I used my severance pay-out from the fracking company to pay off my house when I should have been boycotting them like everyone else. I go to protests to stop sheep from grazing in the woodland but secretly I have a terrible meat craving. A devil’s buttermilk before bed helps me forget how many toxins are probably in the meat. And how I took that tainted money, and I’d be taking it again, for a roof over my head, or, more accurately, for those solid oak boards under my feet.  \r\n Most of the time, someone in the hospital is dying of cancer. Most of the time, there aren’t enough nurses to be staying on death watch with them. A lot of the time, the dying folks don’t have any family that gives a flying feck.  Sometimes, they ask me to stay with them, but I don’t stay. Nobody stayed with Mam when she was dying of cancer in the hospital and I was in prison, so feck ’em.  \r\n I told everyone, including my boyfriend Raoul, that I was in prison because of the protest against overturning property rights. For throwing a bottle at Gardaí and then assaulting them.  Actually, I was trying to impress an aos sí queen who was at the protest. The Gardaí put her in the back of the van and I wanted to be near her, so I threw the bottle. That wasn’t enough to get me convicted so later I literally hurled shite at them, monkey-style. Everyone knows the aos sí give off pheromones. It’s not my fault I wanted to fuck her so badly. I would have cheated on Raoul, who was loyal and kind. But the aos sí queen laughed at me in ugly disgust.  I didn’t think anything could make that perfect face turn ugly. Still, it didn’t stop me wanting her at that time. I have a superficiality problem. Or had. Or the world I grew up in has the problem.  \r\n When I let Mam’s trees die, it was like I killed her extra dead. All they needed was a bit of water. I should have smashed through those floorboards to find her imaginary spring. The same way I smashed through the sunroom windows because they showed me my ugly reflection too clearly. And because I was the only one in that reflection. No Raoul, after I confessed to wanting to fuck the aos sí queen. No Mam.  And then, because our protest about property rights had been a complete waste of time and energy, no different to the lock-in, the Council allocated half my house to strangers.  \r\n Since Raoul left, I’ve felt worthless because I have no romantic partner. Which is stupid.  When you feel something even though it makes no sense and is stupid, that makes you even more stupid, and you spiral down, down, down, in a never-ending loop of stupidity to where Satan’s kicking back in the flooded shafts of the fracking wells, smiling, sipping phenols and biding his time.  They let me and the aos sí, Miach, out of the cells without charge a week later.  It’s a shame, because the food in there is better than the ration, and there’s no washing-up to be doing. Not much worse than boiling the sudsy water, saved from my personal ablutions, til I’m sure all the arse- and armpit-germs have been killed, before putting the saucepans in to soak. I don’t even get to toss the water out after that, no matter how many bits of potato peel or oat hulls are floating in it, because it’s got to be used for flushing the toilet.  I’d have to kill someone to get put away for good, though. Unfortunately they keep Cian in the capital and he’s the only one I can think of worth killing.  “Could you use a volunteer at the hospital?” Miach asks mildly as we linger outside the station building, blinking in the sun. There used to be hanging baskets of flowers out the front but they’ve been lowered and the sheep have cropped the leaves to dirt level.  Before I can answer, a haggard-looking woman comes up to him, carrying a baby on her back and hugging a toddler to her skirts.  “They said you’re that magic fairy doctor, called Miach,” she calls out. Two old men with leashed dogs at the street corner lift their wagging chins with interest, and a couple of lads using a smashed shopping trolley for transport wheel it over so they can listen.  “That is my name,” Miach says, holding out his hand for her to shake, but she doesn’t take it.  “You can cure cancer. I’ll take you to the hospital, so. My husband’s there.”  “I’m sorry. I can’t cure him.”  “His powers don’t work here,” I say scornfully, wishing the growing crowd would get out of my way. I’m hungry and it’s a fair walk home. “He can’t cure anyone. Not in this world.”  “There were herbs in the oak woodland that could have cured your husband, if he had stirred himself to defend it,” Miach tells the haggard-looking woman. “Goats and sheep have eaten them by now.”  Stunned silence from all onlookers meets this pronouncement. I’m the first to recover.  “You could have said so, at the lock-in,” I tell him, getting jostled from behind by a carpenter with hammers hanging from his belt. “You could have stopped it before it happened.”  “I did say so,” Miach answers calmly, giving a slight shrug of his bulky shoulders. “The organizers said all aos sí were liars and I wouldn’t be believed, that I was best to sit down with the rest and keep that mythical shite to myself.”  “What’s going on here?” demands the mean, freckly Garda sergeant from the doorway behind us. “Called a press conference, have we? Move along, all of you, and your godforsaken fairy, too.”  “Which herbs?” the haggard woman asks shrilly.  “You couldn’t have picked them anyway,” Miach says. “They were rare. Protected by law. My sister planted them with her tears when she wept over my dead body.”  “I’ve never seen the likes of you cry,” she accuses. Both the baby on her back and the toddler at her feet begin bawling, perhaps in uncanny sympathy, perhaps from hunger.  “Let’s make him cry,” the carpenter suggests.  “Let’s make him a dead body that stays dead,” somebody else agrees.  And then they’ve got hold of the steel shopping trolley and knocked the aos sí down with it. They turn it over, onto him, and throw their bodies on top so that Miach makes a sizzling sound like wet batter in a grill.  I don’t want to care, I’m as angry as they are, but I find myself trying to get hold of the trolley, to pull it off him.  “Are you mad?” I scream. “You can’t do this!” I glance back towards the Garda station. “They’re killing him!”  The Garda sergeant watches, unblinking, with folded arms, as the carpenter joins in with swinging hammers. When I go to grab his arm, to stop the blow from descending, I’m cracked in the head with a flying elbow for my trouble.  When I wake up, the haggard woman cradles my head, resentment in her eyes. I’m in the spot where I fell, in front of the station, but the crowd is gone. There’s no sign of the woman’s two children.  Greenish blood dries on the pavement where Miach’s body lay.  “Where is he?” I ask thickly.  “In a hospital bed beside my husband, no doubt,” the haggard woman says, “and that’s more than he deserves. You were in the cells with him. You talked to him. Did he mention the names of those healing herbs?”  “You didn’t beat it out of him, so?” I laugh harshly. A migraine springs into existence like a rainbow.  She shakes her head.  “He never made a sound,” she says distantly. “They’re not human. They don’t feel pain. Not like us.”  Evidence that the aos sí feel pain:  \r\n Aversion. Why would Miach have scrambled away from those prison bars if they didn’t cause pain? Why bring titanium handcuffs to the lock-in and take such care not to touch the gate? Why leave the land of youth for good, if not for his aversion to being chopped in half?  Sequence of events. First the sparks from the saw touched him. Then he pissed his pants. It wasn’t dignified. It wasn’t a good look, for a so-called superior immortal.  Physical damage. When I see him again, I see that the mob didn’t stop until his back, his belly and his long limbs were burned, cracked, and bleeding green aos sí blood. Somehow, he’d managed to protect his head. The hospital staff haven’t the burn dressings to spare for him. His skin weeps, and sticks to the sheets, and when they turn him it tears the healing growth away.  It’s the middle of the night.  I’m busy with the mop in Miach’s ward.  I think he’s sleeping but he beckons to me from his bed.  At first, I think I’ll pretend not to have seen him, but I find myself going to his right side, where the ear is that he can still hear with, and the eye is that he can still see with. Even weak and humiliated, he’s still beautiful, I suppose; I can’t see it any more. After Cian, I trained myself, through years of self-loathing self-talk, to feel nothing when I look at faces like Miach’s. At bodies like his. At the female versions of bodies like his.  “What is it, so?” I hiss.  “The island of learning.” He lifts one trembling hand to point at the wall, as if it had a window. His arm’s cross-hatched by scars left behind by the shopping trolley. “Sheep can’t get to the island in the lough. Alder against drowning, rowan against fire. Dandelion to call spirits, hawthorn to call salmon. Apple for long life, holly for luck.”  The water level of the lake is down since the earthquake. There is no more island. There’s no place the sheep can’t get to. It’s all connected.  I don’t know why I don’t tell him.  “Why didn’t you tell that woman with the sick husband about the herbs on the island? Wouldn’t they have cured him?”  “They didn’t believe in me, or they could not have harmed me,” he says in a weak and distant whisper. “They didn’t believe in the woodland, or they could not have allowed it to be harmed. If you can’t love a thing for its own sake, the love you profess for it in your time of need is false love. Whatever is inside the wall could not have cured him.”  “You’re not making any sense, Miach.”  “Please,” he begs. “Please find them. Fetch them for me. Killarney fern to purge the blood of iron. Kerry violet for driving out infection. Strawberry tree to sweeten dreams.”  “How can your blood have no iron?”  “Have you less pity than I do? Are you less human than I am?”  “I don’t have to help you.” I lean on my mop, shaking with anger. “I don’t want to help you. Twice, I’ve fallen under the spells of aos sí and been the worse for it. If I haven’t learned by now, what use am I?”  “I don’t know,” he sighs, his hand settling back against the white sheet. “I’ve stopped asking mortals for their names. Even if I did know them, your natures aren’t in your names, and sometimes even when they seem to be, those names are lies. Where is the power that prevents the bestowing of ill-suited names? How can you function in a world where true selves are unapparent? How could you not have known Cian’s nature by his black name? Any aos sí could have told you not to let him roam free.”  Fae facts that I thought were probably shite but which turned out to be true:  \r\n They do stay young forever.  They can be killed by steel.  Their blood is green.  They are slaves to their names.  They can be weakened by professions of disbelief.  My shift finishes at 2AM.  It takes me an hour to tromp the long way through the town and down to the side of the lake. There, the footprints of my wellies in the muck look like Armstrong’s on the moon. Stark where it sticks up from the shallows, lit by sleek LED arrays, is a reflective warning sign advising that levels of volatile organic compounds in Lough Leane exceed 250ppm.  With a little skull and crossbones underneath in case you’re not really sure what that means.  There are no other human footprints beside mine. Ducks and dogs, it seems, have taken their chances. Swimming the lake to get to the unguarded back gate of the woodland is possibly a suicide mission, but there are too many guards and dogs near the main gate, so what choice do I have?  I can’t just be letting him die.  I mean, I can.  He was after all, letting me Mam die, when he could’ve come rolling in with his fancy herb lore, with her being a defender of the woodland and all.  But I don’t want to be who I’ve been, lately. I want to be the me that Mam would recognize, if her spirit was to emerge from the waters of the lake on a white horse with the fairy host flying along behind her.  I want to be the me who picked pimply red fruit off the wild strawberry trees, and asked Mam if I could eat some, and she said their name in Latin was something like eat one, only. I tried one and I spat it out. Those Latin lads were right, after all.  I forgot to ask Miach which part of the strawberry tree he needed when he was making his little shopping list.  Never mind.  The water’s cold, even with all my clothes on. Should have taken them off. They weigh me down as I start to swim.  It’s summer, so the cold isn’t a killing cold, but the tingle in my fingertips and toes that turns to numbness might be the sign of another kind of killing. There’s a wooden paling fence keeping the sheep well back from the lake and I wake the clustered, woolly shapes when I climb it, shivering in my wet things.  I left my wellies standing by themselves on the opposite side of the water, next to the sign. When I look back and see them, I stifle a giggle; it looks like my body’s dematerialized just by looking at the lake.  Then I’m squelching in soggy socks along sheep trails, into the woods. Into the tangled embrace of oak and yew. Up hills and down gullies to places where fern-lined waterfalls no longer fall. Moonlight shows the bare, dry rocks.  I put some dead brown sticks that used to be ferns into my wet pocket, hoping some of the dried-out spores have survived. The bogs, when I come to them, are also dried up and dead, with no sign of Kerry violets.  The best I can do is fill my other pocket with the serrated-edged leaves and prickly, unripe fruit of a few stunted-looking strawberry trees.  Then I’m dizzy. I stop to vomit.  I shouldn’t have gone into the lake.  As the rising sun’s touch sets the innocent-looking waters a-sparkle, I stagger out the main gates of the woodland. The ringing in my ears almost drowns out the sound of the dogs barking. The security guards are too afraid to be touching me.  I wonder if I’m going back to prison to die.  When I wake up in the white-walled hospital ward, still quivering, hard, like the dogs have me in their teeth and won’t stop shaking, I sense vaguely that I’m in the bed beside Miach and that he’s got visitors.  Visitors? They must be aos sí.  My vision’s blurry.  I don’t want to turn my head too fast, but I soon realize Miach’s visitors are human, not aos sí. They’ve brought him flowers. Lots of flowers. They’re not the only ones who have; the head of his bed is surrounded by a sea of carnations and gladioli, tulips and lilies; in short, every kind but the kind that can actually help him. Where is my jacket with the woodland harvest in its pockets? I pat myself down jerkily, only to find I’m naked beneath the hospital gown.  Miach’s visitors bend solicitously over him.  “I don’t believe in you,” the man whispers gently. He stands back to make room for the woman, who also murmurs in Miach’s right ear,  “I don’t believe in you.”  Miach’s face leaps into focus under the fluorescent lights of the ward. In the time I’ve been away, no more than a night and day, the stunning symmetry of his face has been destroyed. On the side where he can hear and see them, his smooth skin’s spotted and withered. Half his head of gleaming yellow hair’s turned brittle and white. His right eye all sunken and pouched.  As if he wasn’t sick enough, they are killing the side of him that can understand them. Only the brain-dividing injury done to him by the winner of the All-Ireland Worst Father Prize is keeping him from shriveling up altogether.  “You,” I cry, waving my spasming hands at the visitors. “You leave him be!”  I throw myself out of bed. Drip lines come loose from my arms in a red spray of blood. The visitors make a hasty retreat, leaving the flowers behind. Pulling myself upright on the plastic safety bars of his bed, I meet Miach’s exhausted, empty-seeming gaze.  “We’re going to my house,” I tell him. “It’s about two miles from here but it’s safer there. We might have to lean on each other. Get your immortal arse out of that bed.”  We don’t go through the public access ways. I take him down the cleaning corridors. He’s a bit useless for me to lean on, seeing as he’s so weak himself, so I procure us a pair of wooden-handled mops and we lean on them as we sneak past the medical waste storage building, under a hedge and across an abandoned, contaminated lot. The sun warms my face but the breeze bites my bum through the open back of the gown.  “Not far,” I croak. “Turn left.”  There it is, over a low brick wall and across a smattering of weeds and uneven pavers. Mossy, shingled awnings. Thin chimneys adorned by the skeletons of dead communication aerials. Cracked plastic downpipes. By the front door is Mam’s terrifying terracotta rabbit with ivy growing out its eyes.  I don’t even glance up at the second story with the tacked-on external staircase that’s nothing to do with me anymore. Nothing to do with my half home. Only, the two upstairs children, wide-eyed girls with black ponytails and gold stud earrings, are wrestling something up the staircase. They’re grubby, like they’ve been under the house; their tracksuits are covered in dirt and cobwebs.  The thing they’re carrying is an enormous, thin, shallow, stainless steel bowl. It must be a meter across. Miach goes very still at the sight of it.  “What you got there?” I call out to them.  “Our Mam’s salad bowl,” the slightly larger child calls back.  “What you been doing with it?”  “Making salad.”  I’m not as green as I am cabbage.  “Tell me what you’ve really been doing or I’ll get you while you’re sleeping.”  The larger child’s shoulders stiffen.  “We was using it to cover the well,” she answers reluctantly. “On account of the whispering woman. Hanan don’t like to listen to her when we’re playing mole hospital.”  “What whispering woman?” I demand to know. I’m losing my grip on the mop. I need to lie down. This whole conversation is exhausting and I’m dying. I don’t have time. “What well?”  “The well under the house what’s got the whispering woman inside. She’s warning her brother to stay away. She says if he comes home, their father will chop him into pieces again,” the bigger girl says matter-of-factly, blowing her fringe out of her eyes. “My name is Shafyaa. What’s your name?”  They were using the salad bowl to cover the well.  Jaysus.  What the upstairs children’s names mean:  \r\n Hanan – means kind, compassionate, tender-hearted.  Shafyaa – means a healer, one who cures others.  The well’s full of live salmon and fallen hazelnuts.  I don’t know how either of those things are possible, but I see them in the light filtering through the smashed windows of the sunroom.  “Don’t touch it with your hands,” Miach instructs. Instead, he dips into it with a wooden bowl and pours the water over my head. I get the same cold shock from it as I got from the lake water, but at the same time it feels like my heart is zipping up in my chest, recovering from a sword-blow I never knew was there.  We kneel in the dirt by the stone rim in the jaggedly dangerous circle of ripped-up floorboards we made. Miach pours a bowl of water over himself, next. I expect the aged, ruined half of his face to heal, but it stays the same.  Only the grill scars from the shopping trolley and the wounds left by the hammer wash instantly away.  He looks at his reflection in the water. I look at it, too, and receive a second shock when I realize that his face, even better than the face of a person I could fuck, is the face of a person I could learn to like. Maybe even to trust.  “I can’t go through,” he says. “My father’s still waiting on the other side.”  “You’d better stay here,” I agree. “A face like that belongs in the house of half mirrors.”  Evidence I’m actually mostly Mam (my better half):  \r\n I stopped stealing from the mother upstairs. I even told her about it and apologized. She said she knew what I was doing but was too afraid of me to complain. I was the kind of person who smashed windows and mirrors. The kind of person who stole from the upstairs neighbors.  I am not that kind of person any more. It helps that I like eating salmon.  \r\n That upstairs lady makes a mean salad.  Miach poured a bowl of water over each of my hazel-tree skeletons. They came back to life. Apparently they were always still alive in the land of youth. I’m not sure if I believe that.  But I believe Mam loved me while she was alive. A woman like that doesn’t love people for no reason. So there must be something in me worth loving.  \r\n Nobody dies of cancer in our hospital anymore. I’d fix it so everyone got a share of our well-water but I don’t have time, except to spike the hospital supply. I’m not Santy, to get around to every house, though I’d appreciate a few of Santy’s mince pies and glasses of Guinness.  The word is spreading. They even suspect it might be something in the water.  Every now and again, one of the ninety-nine will turn up on our doorstep in the middle of the night while I’m away sprinkling the good stuff in the hospital cistern. Miach helps them get to where they’re going, if their aim is to go back. Sometimes they just want to drink from the wooden bowl or to eat one of the salmon.  \r\n Miach doesn’t want to fuck me and it’s OK. I noticed after a few months that the mirror-halves in the house seemed to be finding one another and joining back up into wholes. Even the wardrobe mirror. Even the sunglasses.  Of course they would do that, I told Mam’s memory while I flooded the roots of her hazel trees with sacred well-water. There’s an aos sí healer in the house.  Miach said it was nothing to do with him, and nothing to do with uncovering the well, either.  When you focus on the good things, even though the world is full of shite, you spiral up, up, up above the madness, into the light, where new hazel branches reach for the sun and the upstairs shitehawks shouting about the clouds being shaped like moles or salmon are so loud that you can’t hear the warning whispers from the well. Thoraiya Dyer is an Aurealis and Ditmar Award-winning Australian writer and veterinarian. She is the author of over fifty published short science fiction and fantasy stories. They have appeared in venues including Clarkesworld, Analog, Fantasy Magazine, Apex, Podcastle, Cosmos, Nature, anthology Bridging Infinity, and boutique collection Asymmetry. Thoraiya’s big fat fantasy novels in the Titan’s Forest Trilogy are published by Tor books. A member of SFWA, she is an avid hiker and arbalist inspired by wild spaces and the unknown universe.", "text": "6710 words, short story\nThe House of Half Mirrors\nMy house is full of half mirrors.\nMam tells the tale like it’s an amusing anecdote: that time she brought a fiddler home from the Anchor, and he wasn’t a man but a fomoiri, and all the mirrors from the wardrobe doors to the polarized sunglasses on the sideboard cracked neatly into perfect halves.\nAt least, she used to tell it. Before cancer took her.\nWho believed in fomoiri in 2042? At the time, I bit my tongue and charitably assumed it was her oblique warning about violent partners and the end of days. When fuel ran out, everyone who didn’t raise their own food relocated inside ration delivery zones. She moved in with me, bringing as many of the half mirrors as she could fit in a wagon hitched to the back of her pushbike.\nMe old Mam, cycling sixty kilometers from Cahersiveen. Happy days.\nShe did always go on about the better halves of human nature, about seeing the good in things. Since Da was a useless tool, I’d tell her that when I looked in the half mirrors I could only see the half of me that came from her.\nMam’s half mirrors match what’s technically only half a house. Since she died, a young single mother got allocated the upstairs. That interloper’s two children thump around like live basketballs and she hogs the washing line down the side, but I’ve got a sunroom at the back with the windows all smashed where I hang my laundry to dry.\nIn a corner of that wrecked sunroom are three heavy, soil-filled pots with dead trees. Sad stick skeletons with the morning sun on them. I should be tossing them, but I can’t, any more than I can toss the half mirrors.\nMam dug up three hazel saplings and brought them inside when the next-door house collapsed on our garden. She loved those little trees, just like she loved the oak woodland by Lough Leane. I can’t even keep a plant alive. Lucky I never became a parent.\nAnd now I’ve mooned about, gazing guiltily at them, for so long that I’m late for the lock-in. Can’t even be on time to save our besieged final scrap of wild.\nHaven’t even called the hospital to let them know I won’t be at work today.\nSliding in my socks across the solid oak floorboards—they’re the only indestructible part of the whole shitty, falling-down house—I dump my tea dregs in the kitchen sink. It’s not backed up because of the mouse in the dried-up u-bend addicted to tea leaves.\nThe plumbing doesn’t work.\nIt hasn’t worked for fifty years, which is how I got the house so cheap. Which is fine, since these days the village tap water’s poison. It’s as deadly as all those lush meadows and sweeping fields that kill stone dead any escaped stock that graze on them.\nBottled gallons come as part of the weekly ration.\nMam used to do a dowsing course for tourists back in Cahersiveen. When she came here, she promised she’d find me my own source of spring water. Carrying her daft twig through the house, she’d stopped in the middle of the sunroom and said it was under the boards.\nI told her I wasn’t pulling up the boards. They’re the only indestructible part of the whole shitty, falling-down house.\nWhen I pick up the phone, it doesn’t work any better than the taps do.\nWhich is new.\nBut it was only a matter of time. We live in a shitty, falling-down world.\nThe lock-in is exactly what it sounds like.\nA gaggle of fools, me included, crowd the grass outside the towering gates, dodging Clydesdale manure piles and patting one another on the back for putting the woodland ahead of our own hungry families.\nExcept I’ve got no family left. It’s not that much of a battle for me, so.\nWe’re going to lock ourselves onto the gates of the walled-in woodland. There, the lakeside forest, still emerald green, hides ruined abbeys and harp-haunted hill forts.\nThe ancient wall was renovated in the thirties. Four meters of gray-painted concrete is supposed to keep looters out of the castles and weeds and feral cats out of the woods.\nEver since the big enviro-disaster, though, there’s been something spooky about the wall. On the outside, like all the local houses and farms, the soil tests toxic.\nNot inside the wall, strangely enough. No poison seeping up through the roots of those gnarly old oaks. Nobody knows why.\nNobody cares why. They want to open up the gates to let the sheep and cattle in to graze.\nToday!\nBut not today. Today we’ve got enough warm bodies to make a human barricade.\nI wonder how we’re going to organize tomorrow, without phones, but then there’s no time for wondering because we milling protesters must speedily handcuff ourselves to one another. In fact, since I’m late, I’m surprised there aren’t patrol cars here already.\nBut the phones aren’t working. I guess the farmers can’t call the Gardaí.\nEveryone’s brought their own bangin, blacksmith-made manacles.\n“Faster!” the organizer bellows. “Next!”\nI’m next.\nAnd that’s when I see I’m supposed to be locked onto one of the aos sí. He’s sitting cross-legged on the ground, being careful not to lean back against the iron of the gate.\nHow ninety-nine aos sí got stuck on this side of Lough Leane.\n- This is the story they used to be telling the tourists: Every seven years, on May 1st, the famous warrior chieftain O’Donoghue Mór rises from the lake near Ross castle. The fairy host from the land of youth floats over the waters of Lough Leane in the wake of his hovering white horse.\n- Catching a glimpse of him is pure good luck.\n- Nobody actually catches any glimpses of him.\n- Rephrase: Nobody, in those early-millennium days of miniature cameras everywhere, managed to film him.\n- Then one morning, the sun came up on ninety-nine ethereally beautiful eternal-youths and one pissed-off warrior ghost. Teenagers had their drones out there in a heartbeat to confirm what the shocked groundskeepers reported to Radio Kerry.\n- Later, scientists surmised all the drilling and hydraulic fracturing for gas and shale oil caused a miniature earthquake sometime between dusk and dawn. Half the lake water drained away into underground parts unknown. Phenols contaminated the other half.\nFracking fluid poisoned the groundwater, too. There were dead fish. Trees losing their leaves mid-summer. A rain of death.\nA magic door closed and locked, perhaps in self-defense, from the other side.\n- The ghost of O’Donoghue Mór swore to find a lake still pure enough to reopen the portal between worlds. He set off alone.\n- He hasn’t returned. That was ten years ago.\nThe aos sí looks the way they all look, the ones that come from royalty.\nSomething like Orlando Bloom, circa two thousand, in a long blond wig made from Russian ladies’ hair. But pecs, by God! This one’s got magnificent pecs making the buttons of his silk shirt pop.\nAnd I remember the last thing I saw on the free web before it stopped working. That serial killer, Cian, and how he looked at his trial. Much the same as this. Much the same as an ageless aos sí supremacist still looks after nine years in maximum security, I’d be guessing.\nI stared at the accused in that witness box. I knew he was pure evil. But society had trained me to find him beautiful, and beautiful he was, feck it all to hell. The words of the human reporter washed over me without leaving any impression. I stared at the flawless face of that ruthless cunt, trying to imagine the screams. The blood. The bodies of Cian’s victims on that inter-island ferry where he’d cut them down with keen-edged, aos sí-forged silver before sinking the ship with a thousand corpses on board.\nI couldn’t find him ugly.\nNo matter how I tried.\nI think that moment was the moment. It was the first time I turned on myself. I always liked who I was, before then. That moment was when the self-hating started.\nAt the woodland gate, nobody offers to sit down next to the aos sí. Nobody rushes forward to take my place. Nobody trusts the fancy titanium handcuffs he’s brought because he can’t be abiding the touch of iron.\nOf course he cares about the oak woodland. Of course he wants to do something, the same as the villagers do.\nI just wish he’d do it somewhere else. When I look at him, I see Cian. Worse, I remember the repulsive inner me that wanted to fuck Cian, even knowing what he’d done.\nI plonk myself on the pavement, shoulder to shoulder with the aos sí protester, and thrust my hand through the cuff without a word.\n“Hello,” he says as he locks my wrist tight to his. I ignore him. A gray-haired granny in a flannelette shirt sits on my other side.\n“How’s she cutting?” I ask her casually, offering my other wrist.\n“Straight down the middle like a razor blade,” is granny’s gruff reply as she snaps herself onto me.\n“I’m Miach,” the aos sí tells me, trying again.\n“G’luck, so,” I say, giving him my best stop-talking-to-me glare. His eyes are the color of green glass held up to the sun; green like the woodland in spring; green like the new leaves on Mam’s hazel trees that I didn’t water til it was too late.\nThen it dawns on me that this aos sí isn’t one of the stranded ninety-nine. Mam and I looked closely at all those faces on the news, trying to see if any of them was the fomoiri she met at the pub. None of them were.\n“You’re sitting on my foot,” he says, at the same time as I say,\n“What did you say your name was?”\n“Miach,” he replies patiently.\nI move my arse off his ankle.\n“You’re not one of the ninety-nine.”\n“No. I came through the door long before they did. My father kept trying to kill me, you see.”\nFlashback of Da’s fist raised in anger.\n“Which door did you come through?” I wonder aloud. “The lake? The same as O’Donoghue?”\n“No.” Miach gives a subtle shrug. “Centuries ago, I was brought out of a stone well in a hazel thicket. Its waters were even purer than the waters of the lake. Since coming back here a few days ago, I haven’t been able to find it. It must be covered in iron. Somewhere under the village.”\nJaysus.\n“I’m supposed to be helping the ninety-nine find their way back home,” he carries on, unperturbed, “but today the woodland seemed more important.”\nThe woodland isn’t important. I don’t give one single flying feck for the woodland. I’m here because Mam would have been here. I’m just doing what she would have done.\n“I’m supposed to be at the hospital,” I say. Respect enters Miach’s already rather stiff and respectful expression, so I add quickly, “I’m not a doctor.”\n“A nurse?”\n“No.”\nI’m not a nurse. Too dumb for that. Remember that nurse who killed a man by putting a decimal point in the wrong place? I clean floors. I lift heavy things.\nBefore that, I vacuumed the carpets at the fracking company offices. That was prior to the earthquake. Mam never told me straight out that I was aiding and abetting the ruination of the natural world, but I saw it in her sad eyes whenever she straightened me uniform collar.\n“Oh.”\n“Are you a nurse, yourself?” I react rudely.\n“A doctor,” Miach says. Of course he is. “At least, I used to doctor to my people. My sister and I took after our father, a celebrated healer, but it turned out we were more gifted than he was. Out of jealousy, he cut me once with his sword, through the skin. Then twice, through the bone. Then three times, all the way through my brain.” He angles his head, and doesn’t need to part his long hair with his fingers for me to see the faint pink scar running up the middle of his forehead and over the crown of his head.\n“Jaysus,” I mutter. Da might have wielded his fists but he never sliced my brain in half.\n“My sister thought I was dead that third time, for sure. She brought my body through to this world. Her tears made healing herbs grow up and over me. I had to claw my way through them when I woke. By that stage I figured I’d better not go back and give my father another chance at it.”\n“Is your father one of the ninety-nine?” I ask. “Is your father Cian?”\n“No.”\nSirens drag my attention away from Miach. The Gardaí are finally here. Also arriving are the shepherds with their dogs and swarms of goats and skinny border leicesters. The sheep look like they might chew through, not just herbs and bark, but the trunks of the oaks like living chainsaws.\n“Don’t mention how you can heal yourself,” I suggest to the aos sí, “or they might be sawing through your arms instead of the handcuffs.”\n“I can’t heal myself. Not in this world. That’s why I’m talking to you and not this other fellow. You’re on my right side. Since my father cut my head in half, I can’t hear anything with my left ear and I can’t see with my left eye.”\nIt takes the authorities another six or seven hours to get the equipment that they need to hand. By sunset, I need to piss badly. The old lady on my right confides that she’s wearing an adult diaper. Obviously I didn’t think the protest through.\nThey cut Miach out of his titanium handcuffs with a steel saw. When sparks touch the blue-veined, paper-white skin of the inside of his wrist, his whole body convulses, like they touched him with an electric cattle prod. But he don’t make a sound.\nHe does piss himself.\nThen I do, too, not because I’m in pain but just because it’s been so long, and if anyone smells me, they’ll probably think it was him. I try not to care that they’re hurting him. He chose to be here, same as the rest of us.\n“Feckin fairy,” swears the Garda sergeant, hauling Miach to his feet. She’s a head shorter than he is but solid. A mean, freckly tank. They take all two dozen of us to the station and throw us behind bars, but what for? Our punishment is that the woodland gates were thrown open. Sheep and dogs went inside the fence in an endless stream. We couldn’t even keep them out for one full day. The police can’t punish us.\nCan’t punish me, anyway. I don’t think Miach likes those metal bars very much at all. He’s sweating like a priest in a playground. People sneak in to ask him if he’s really Miach, the fairy magician, who can heal anything, even cancer, but he shakes in a corner, as far from the cold steel as he can manage, and doesn’t answer them.\nBut I deserve to be back here again.\nEvidence I’m mostly Da (my worse half):\n- On weekly ration delivery night, I steal from the single mother upstairs.\nNot from the two little shitehawks. I leave their stuff alone. Just the mother. Her English isn’t great. Don’t think she can read the manifest. Don’t think she even knows she’s supposed to get mutton and Guinness in her ration.\nProbably she’s a Muslim vegetarian, anyway.\n- She’s not a fecking Muslim vegetarian. I’m full of shite like a Christmas turkey. The fact of the matter is, I used my severance pay-out from the fracking company to pay off my house when I should have been boycotting them like everyone else. I go to protests to stop sheep from grazing in the woodland but secretly I have a terrible meat craving. A devil’s buttermilk before bed helps me forget how many toxins are probably in the meat. And how I took that tainted money, and I’d be taking it again, for a roof over my head, or, more accurately, for those solid oak boards under my feet.\n- Most of the time, someone in the hospital is dying of cancer. Most of the time, there aren’t enough nurses to be staying on death watch with them. A lot of the time, the dying folks don’t have any family that gives a flying feck.\nSometimes, they ask me to stay with them, but I don’t stay. Nobody stayed with Mam when she was dying of cancer in the hospital and I was in prison, so feck ’em.\n- I told everyone, including my boyfriend Raoul, that I was in prison because of the protest against overturning property rights. For throwing a bottle at Gardaí and then assaulting them.\n- Actually, I was trying to impress an aos sí queen who was at the protest. The Gardaí put her in the back of the van and I wanted to be near her, so I threw the bottle. That wasn’t enough to get me convicted so later I literally hurled shite at them, monkey-style. Everyone knows the aos sí give off pheromones. It’s not my fault I wanted to fuck her so badly. I would have cheated on Raoul, who was loyal and kind. But the aos sí queen laughed at me in ugly disgust.\nI didn’t think anything could make that perfect face turn ugly. Still, it didn’t stop me wanting her at that time. I have a superficiality problem. Or had. Or the world I grew up in has the problem.\n- When I let Mam’s trees die, it was like I killed her extra dead. All they needed was a bit of water. I should have smashed through those floorboards to find her imaginary spring. The same way I smashed through the sunroom windows because they showed me my ugly reflection too clearly. And because I was the only one in that reflection. No Raoul, after I confessed to wanting to fuck the aos sí queen. No Mam.\nAnd then, because our protest about property rights had been a complete waste of time and energy, no different to the lock-in, the Council allocated half my house to strangers.\n- Since Raoul left, I’ve felt worthless because I have no romantic partner. Which is stupid.\nWhen you feel something even though it makes no sense and is stupid, that makes you even more stupid, and you spiral down, down, down, in a never-ending loop of stupidity to where Satan’s kicking back in the flooded shafts of the fracking wells, smiling, sipping phenols and biding his time.\nThey let me and the aos sí, Miach, out of the cells without charge a week later.\nIt’s a shame, because the food in there is better than the ration, and there’s no washing-up to be doing. Not much worse than boiling the sudsy water, saved from my personal ablutions, til I’m sure all the arse- and armpit-germs have been killed, before putting the saucepans in to soak. I don’t even get to toss the water out after that, no matter how many bits of potato peel or oat hulls are floating in it, because it’s got to be used for flushing the toilet.\nI’d have to kill someone to get put away for good, though. Unfortunately they keep Cian in the capital and he’s the only one I can think of worth killing.\n“Could you use a volunteer at the hospital?” Miach asks mildly as we linger outside the station building, blinking in the sun. There used to be hanging baskets of flowers out the front but they’ve been lowered and the sheep have cropped the leaves to dirt level.\nBefore I can answer, a haggard-looking woman comes up to him, carrying a baby on her back and hugging a toddler to her skirts.\n“They said you’re that magic fairy doctor, called Miach,” she calls out. Two old men with leashed dogs at the street corner lift their wagging chins with interest, and a couple of lads using a smashed shopping trolley for transport wheel it over so they can listen.\n“That is my name,” Miach says, holding out his hand for her to shake, but she doesn’t take it.\n“You can cure cancer. I’ll take you to the hospital, so. My husband’s there.”\n“I’m sorry. I can’t cure him.”\n“His powers don’t work here,” I say scornfully, wishing the growing crowd would get out of my way. I’m hungry and it’s a fair walk home. “He can’t cure anyone. Not in this world.”\n“There were herbs in the oak woodland that could have cured your husband, if he had stirred himself to defend it,” Miach tells the haggard-looking woman. “Goats and sheep have eaten them by now.”\nStunned silence from all onlookers meets this pronouncement. I’m the first to recover.\n“You could have said so, at the lock-in,” I tell him, getting jostled from behind by a carpenter with hammers hanging from his belt. “You could have stopped it before it happened.”\n“I did say so,” Miach answers calmly, giving a slight shrug of his bulky shoulders. “The organizers said all aos sí were liars and I wouldn’t be believed, that I was best to sit down with the rest and keep that mythical shite to myself.”\n“What’s going on here?” demands the mean, freckly Garda sergeant from the doorway behind us. “Called a press conference, have we? Move along, all of you, and your godforsaken fairy, too.”\n“Which herbs?” the haggard woman asks shrilly.\n“You couldn’t have picked them anyway,” Miach says. “They were rare. Protected by law. My sister planted them with her tears when she wept over my dead body.”\n“I’ve never seen the likes of you cry,” she accuses. Both the baby on her back and the toddler at her feet begin bawling, perhaps in uncanny sympathy, perhaps from hunger.\n“Let’s make him cry,” the carpenter suggests.\n“Let’s make him a dead body that stays dead,” somebody else agrees.\nAnd then they’ve got hold of the steel shopping trolley and knocked the aos sí down with it. They turn it over, onto him, and throw their bodies on top so that Miach makes a sizzling sound like wet batter in a grill.\nI don’t want to care, I’m as angry as they are, but I find myself trying to get hold of the trolley, to pull it off him.\n“Are you mad?” I scream. “You can’t do this!” I glance back towards the Garda station. “They’re killing him!”\nThe Garda sergeant watches, unblinking, with folded arms, as the carpenter joins in with swinging hammers. When I go to grab his arm, to stop the blow from descending, I’m cracked in the head with a flying elbow for my trouble.\nWhen I wake up, the haggard woman cradles my head, resentment in her eyes. I’m in the spot where I fell, in front of the station, but the crowd is gone. There’s no sign of the woman’s two children.\nGreenish blood dries on the pavement where Miach’s body lay.\n“Where is he?” I ask thickly.\n“In a hospital bed beside my husband, no doubt,” the haggard woman says, “and that’s more than he deserves. You were in the cells with him. You talked to him. Did he mention the names of those healing herbs?”\n“You didn’t beat it out of him, so?” I laugh harshly. A migraine springs into existence like a rainbow.\nShe shakes her head.\n“He never made a sound,” she says distantly. “They’re not human. They don’t feel pain. Not like us.”\nEvidence that the aos sí feel pain:\n- Aversion. Why would Miach have scrambled away from those prison bars if they didn’t cause pain? Why bring titanium handcuffs to the lock-in and take such care not to touch the gate? Why leave the land of youth for good, if not for his aversion to being chopped in half?\n- Sequence of events. First the sparks from the saw touched him. Then he pissed his pants. It wasn’t dignified. It wasn’t a good look, for a so-called superior immortal.\n- Physical damage. When I see him again, I see that the mob didn’t stop until his back, his belly and his long limbs were burned, cracked, and bleeding green aos sí blood. Somehow, he’d managed to protect his head. The hospital staff haven’t the burn dressings to spare for him. His skin weeps, and sticks to the sheets, and when they turn him it tears the healing growth away.\nIt’s the middle of the night.\nI’m busy with the mop in Miach’s ward.\nI think he’s sleeping but he beckons to me from his bed.\nAt first, I think I’ll pretend not to have seen him, but I find myself going to his right side, where the ear is that he can still hear with, and the eye is that he can still see with. Even weak and humiliated, he’s still beautiful, I suppose; I can’t see it any more. After Cian, I trained myself, through years of self-loathing self-talk, to feel nothing when I look at faces like Miach’s. At bodies like his. At the female versions of bodies like his.\n“What is it, so?” I hiss.\n“The island of learning.” He lifts one trembling hand to point at the wall, as if it had a window. His arm’s cross-hatched by scars left behind by the shopping trolley. “Sheep can’t get to the island in the lough. Alder against drowning, rowan against fire. Dandelion to call spirits, hawthorn to call salmon. Apple for long life, holly for luck.”\nThe water level of the lake is down since the earthquake. There is no more island. There’s no place the sheep can’t get to. It’s all connected.\nI don’t know why I don’t tell him.\n“Why didn’t you tell that woman with the sick husband about the herbs on the island? Wouldn’t they have cured him?”\n“They didn’t believe in me, or they could not have harmed me,” he says in a weak and distant whisper. “They didn’t believe in the woodland, or they could not have allowed it to be harmed. If you can’t love a thing for its own sake, the love you profess for it in your time of need is false love. Whatever is inside the wall could not have cured him.”\n“You’re not making any sense, Miach.”\n“Please,” he begs. “Please find them. Fetch them for me. Killarney fern to purge the blood of iron. Kerry violet for driving out infection. Strawberry tree to sweeten dreams.”\n“How can your blood have no iron?”\n“Have you less pity than I do? Are you less human than I am?”\n“I don’t have to help you.” I lean on my mop, shaking with anger. “I don’t want to help you. Twice, I’ve fallen under the spells of aos sí and been the worse for it. If I haven’t learned by now, what use am I?”\n“I don’t know,” he sighs, his hand settling back against the white sheet. “I’ve stopped asking mortals for their names. Even if I did know them, your natures aren’t in your names, and sometimes even when they seem to be, those names are lies. Where is the power that prevents the bestowing of ill-suited names? How can you function in a world where true selves are unapparent? How could you not have known Cian’s nature by his black name? Any aos sí could have told you not to let him roam free.”\nFae facts that I thought were probably shite but which turned out to be true:\n- They do stay young forever.\n- They can be killed by steel.\n- Their blood is green.\n- They are slaves to their names.\n- They can be weakened by professions of disbelief.\nMy shift finishes at 2AM.\nIt takes me an hour to tromp the long way through the town and down to the side of the lake. There, the footprints of my wellies in the muck look like Armstrong’s on the moon. Stark where it sticks up from the shallows, lit by sleek LED arrays, is a reflective warning sign advising that levels of volatile organic compounds in Lough Leane exceed 250ppm.\nWith a little skull and crossbones underneath in case you’re not really sure what that means.\nThere are no other human footprints beside mine. Ducks and dogs, it seems, have taken their chances. Swimming the lake to get to the unguarded back gate of the woodland is possibly a suicide mission, but there are too many guards and dogs near the main gate, so what choice do I have?\nI can’t just be letting him die.\nI mean, I can.\nHe was after all, letting me Mam die, when he could’ve come rolling in with his fancy herb lore, with her being a defender of the woodland and all.\nBut I don’t want to be who I’ve been, lately. I want to be the me that Mam would recognize, if her spirit was to emerge from the waters of the lake on a white horse with the fairy host flying along behind her.\nI want to be the me who picked pimply red fruit off the wild strawberry trees, and asked Mam if I could eat some, and she said their name in Latin was something like eat one, only. I tried one and I spat it out. Those Latin lads were right, after all.\nI forgot to ask Miach which part of the strawberry tree he needed when he was making his little shopping list.\nNever mind.\nThe water’s cold, even with all my clothes on. Should have taken them off. They weigh me down as I start to swim.\nIt’s summer, so the cold isn’t a killing cold, but the tingle in my fingertips and toes that turns to numbness might be the sign of another kind of killing. There’s a wooden paling fence keeping the sheep well back from the lake and I wake the clustered, woolly shapes when I climb it, shivering in my wet things.\nI left my wellies standing by themselves on the opposite side of the water, next to the sign. When I look back and see them, I stifle a giggle; it looks like my body’s dematerialized just by looking at the lake.\nThen I’m squelching in soggy socks along sheep trails, into the woods. Into the tangled embrace of oak and yew. Up hills and down gullies to places where fern-lined waterfalls no longer fall. Moonlight shows the bare, dry rocks.\nI put some dead brown sticks that used to be ferns into my wet pocket, hoping some of the dried-out spores have survived. The bogs, when I come to them, are also dried up and dead, with no sign of Kerry violets.\nThe best I can do is fill my other pocket with the serrated-edged leaves and prickly, unripe fruit of a few stunted-looking strawberry trees.\nThen I’m dizzy. I stop to vomit.\nI shouldn’t have gone into the lake.\nAs the rising sun’s touch sets the innocent-looking waters a-sparkle, I stagger out the main gates of the woodland. The ringing in my ears almost drowns out the sound of the dogs barking. The security guards are too afraid to be touching me.\nI wonder if I’m going back to prison to die.\nWhen I wake up in the white-walled hospital ward, still quivering, hard, like the dogs have me in their teeth and won’t stop shaking, I sense vaguely that I’m in the bed beside Miach and that he’s got visitors.\nVisitors? They must be aos sí.\nMy vision’s blurry.\nI don’t want to turn my head too fast, but I soon realize Miach’s visitors are human, not aos sí. They’ve brought him flowers. Lots of flowers. They’re not the only ones who have; the head of his bed is surrounded by a sea of carnations and gladioli, tulips and lilies; in short, every kind but the kind that can actually help him. Where is my jacket with the woodland harvest in its pockets? I pat myself down jerkily, only to find I’m naked beneath the hospital gown.\nMiach’s visitors bend solicitously over him.\n“I don’t believe in you,” the man whispers gently. He stands back to make room for the woman, who also murmurs in Miach’s right ear,\n“I don’t believe in you.”\nMiach’s face leaps into focus under the fluorescent lights of the ward. In the time I’ve been away, no more than a night and day, the stunning symmetry of his face has been destroyed. On the side where he can hear and see them, his smooth skin’s spotted and withered. Half his head of gleaming yellow hair’s turned brittle and white. His right eye all sunken and pouched.\nAs if he wasn’t sick enough, they are killing the side of him that can understand them. Only the brain-dividing injury done to him by the winner of the All-Ireland Worst Father Prize is keeping him from shriveling up altogether.\n“You,” I cry, waving my spasming hands at the visitors. “You leave him be!”\nI throw myself out of bed. Drip lines come loose from my arms in a red spray of blood. The visitors make a hasty retreat, leaving the flowers behind. Pulling myself upright on the plastic safety bars of his bed, I meet Miach’s exhausted, empty-seeming gaze.\n“We’re going to my house,” I tell him. “It’s about two miles from here but it’s safer there. We might have to lean on each other. Get your immortal arse out of that bed.”\nWe don’t go through the public access ways. I take him down the cleaning corridors. He’s a bit useless for me to lean on, seeing as he’s so weak himself, so I procure us a pair of wooden-handled mops and we lean on them as we sneak past the medical waste storage building, under a hedge and across an abandoned, contaminated lot. The sun warms my face but the breeze bites my bum through the open back of the gown.\n“Not far,” I croak. “Turn left.”\nThere it is, over a low brick wall and across a smattering of weeds and uneven pavers. Mossy, shingled awnings. Thin chimneys adorned by the skeletons of dead communication aerials. Cracked plastic downpipes. By the front door is Mam’s terrifying terracotta rabbit with ivy growing out its eyes.\nI don’t even glance up at the second story with the tacked-on external staircase that’s nothing to do with me anymore. Nothing to do with my half home. Only, the two upstairs children, wide-eyed girls with black ponytails and gold stud earrings, are wrestling something up the staircase. They’re grubby, like they’ve been under the house; their tracksuits are covered in dirt and cobwebs.\nThe thing they’re carrying is an enormous, thin, shallow, stainless steel bowl. It must be a meter across. Miach goes very still at the sight of it.\n“What you got there?” I call out to them.\n“Our Mam’s salad bowl,” the slightly larger child calls back.\n“What you been doing with it?”\n“Making salad.”\nI’m not as green as I am cabbage.\n“Tell me what you’ve really been doing or I’ll get you while you’re sleeping.”\nThe larger child’s shoulders stiffen.\n“We was using it to cover the well,” she answers reluctantly. “On account of the whispering woman. Hanan don’t like to listen to her when we’re playing mole hospital.”\n“What whispering woman?” I demand to know. I’m losing my grip on the mop. I need to lie down. This whole conversation is exhausting and I’m dying. I don’t have time. “What well?”\n“The well under the house what’s got the whispering woman inside. She’s warning her brother to stay away. She says if he comes home, their father will chop him into pieces again,” the bigger girl says matter-of-factly, blowing her fringe out of her eyes. “My name is Shafyaa. What’s your name?”\nThey were using the salad bowl to cover the well.\nJaysus.\nWhat the upstairs children’s names mean:\n- Hanan – means kind, compassionate, tender-hearted.\n- Shafyaa – means a healer, one who cures others.\nThe well’s full of live salmon and fallen hazelnuts.\nI don’t know how either of those things are possible, but I see them in the light filtering through the smashed windows of the sunroom.\n“Don’t touch it with your hands,” Miach instructs. Instead, he dips into it with a wooden bowl and pours the water over my head. I get the same cold shock from it as I got from the lake water, but at the same time it feels like my heart is zipping up in my chest, recovering from a sword-blow I never knew was there.\nWe kneel in the dirt by the stone rim in the jaggedly dangerous circle of ripped-up floorboards we made. Miach pours a bowl of water over himself, next. I expect the aged, ruined half of his face to heal, but it stays the same.\nOnly the grill scars from the shopping trolley and the wounds left by the hammer wash instantly away.\nHe looks at his reflection in the water. I look at it, too, and receive a second shock when I realize that his face, even better than the face of a person I could fuck, is the face of a person I could learn to like. Maybe even to trust.\n“I can’t go through,” he says. “My father’s still waiting on the other side.”\n“You’d better stay here,” I agree. “A face like that belongs in the house of half mirrors.”\nEvidence I’m actually mostly Mam (my better half):\n- I stopped stealing from the mother upstairs. I even told her about it and apologized. She said she knew what I was doing but was too afraid of me to complain. I was the kind of person who smashed windows and mirrors. The kind of person who stole from the upstairs neighbors.\nI am not that kind of person any more. It helps that I like eating salmon.\n- That upstairs lady makes a mean salad.\n- Miach poured a bowl of water over each of my hazel-tree skeletons. They came back to life. Apparently they were always still alive in the land of youth. I’m not sure if I believe that.\nBut I believe Mam loved me while she was alive. A woman like that doesn’t love people for no reason. So there must be something in me worth loving.\n- Nobody dies of cancer in our hospital anymore. I’d fix it so everyone got a share of our well-water but I don’t have time, except to spike the hospital supply. I’m not Santy, to get around to every house, though I’d appreciate a few of Santy’s mince pies and glasses of Guinness.\nThe word is spreading. They even suspect it might be something in the water.\nEvery now and again, one of the ninety-nine will turn up on our doorstep in the middle of the night while I’m away sprinkling the good stuff in the hospital cistern. Miach helps them get to where they’re going, if their aim is to go back. Sometimes they just want to drink from the wooden bowl or to eat one of the salmon.\n- Miach doesn’t want to fuck me and it’s OK. I noticed after a few months that the mirror-halves in the house seemed to be finding one another and joining back up into wholes. Even the wardrobe mirror. Even the sunglasses.\nOf course they would do that, I told Mam’s memory while I flooded the roots of her hazel trees with sacred well-water. There’s an aos sí healer in the house.\nMiach said it was nothing to do with him, and nothing to do with uncovering the well, either.\nWhen you focus on the good things, even though the world is full of shite, you spiral up, up, up above the madness, into the light, where new hazel branches reach for the sun and the upstairs shitehawks shouting about the clouds being shaped like moles or salmon are so loud that you can’t hear the warning whispers from the well.\nThoraiya Dyer is an Aurealis and Ditmar Award-winning Australian writer and veterinarian. She is the author of over fifty published short science fiction and fantasy stories. They have appeared in venues including Clarkesworld, Analog, Fantasy Magazine, Apex, Podcastle, Cosmos, Nature, anthology Bridging Infinity, and boutique collection Asymmetry. Thoraiya’s big fat fantasy novels in the Titan’s Forest Trilogy are published by Tor books. A member of SFWA, she is an avid hiker and arbalist inspired by wild spaces and the unknown universe.", "source": "https://clarkesworldmagazine.com/dyer_09_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The House of Half Mirrors by Thoraiya Dyer"}