{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jason Heller", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "PqIBRuQp3T49SldY3o/KK6So/2o=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: On Sunshine and Shadows  For someone who was born in Connecticut and now lives in Colorado, I sure do wonder a lot about Florida. As it turns out, so does science fiction/fantasy. My excuse? I lived in the Sunshine State between the formative ages of four and thirteen. SFF’s excuse? Well, that’s a bit more complicated.  My first memory of Florida involves fireworks. Not just any fireworks, either. When I was four, my mom, my little brother, and I moved to the small Gulf Coast town of Englewood, Florida. The year was 1976. I remember watching the Bicentennial fireworks at the beach during that Fourth of July holiday. The magnificent explosions reflected in the waves, blooming underwater as well as in the sky, forming vast symmetrical patterns that seared themselves onto my tender gray matter.  Florida never stopped being magical. As I got older, I collected bugs, lizards, and frogs in picnic coolers, a fascination with creepy-crawly things that didn’t seem odd to me at all, at least not until other kids my age started pointing out my oddness, in the way that kids know how. As we moved from Englewood to nearby towns like North Port, Venice, and Port Charlotte, I learned to seek out the half-finished canals and abandoned construction sites deep in the swampy woods. My few friends and I once found a huge slab of Styrofoam in one of these lumber-strewn graveyards. We used it as a raft, to pole down those mucky, rain-filled proto-canals, like some kind of modern-day, mosquito-bitten Huck Finns. Along the way we’d carve hearts of palm out of wild palmetto bushes and eat them raw, dirt and all.  And then there was the Space Shuttle. In the early ’80s, I’d stand in our doorway to watch Shuttle launches, even though they were happening all the way across the state on the opposite coast. I could turn up our TV and hear the sound of the launch while seeing the silent, tiny trail of exhaust form on the eastern horizon, like a zipper being gracefully opened in the fabric of the sky.  In Florida, though, such magical things went hand in hand with horrific ones. My family moved so often because my family was poor. We were running out on rent, dodging angry landlords, occasionally getting evicted. I started over in new schools more times than I can count, perpetually the new kid in dirty, uncool clothes, marked for ridicule. At home, I regularly witnessed drug dealing, drug use, drunkenness, and brutal domestic abuse. For a while, my mom dated an African-American man—one of the few authentically nice boyfriends I remember her ever having—and I got to see what racism looked like firsthand, through the stares and remarks of strangers around me. An uncle of mine even wound up in prison in Florida, and having to visit him there became a frightening ordeal. In retrospect, though, it was no less frightening than the instability, intolerance, and economic hardship that seemed to suffuse the Sunshine State with shadows.  I discovered SFF in Florida. I’d ride my bike to the local library, then check out as many books by authors like Fred Saberhagen, Gordon R. Dickson, Anne McCaffrey, John Varley, and Roger Zelazny as I was allowed. I’d take them home to devour in the geeky sanctity of my room.  Imagine my awe when I discovered a fantasy series by an author named Piers Anthony that was set in Xanth: a magical realm that was shaped precisely like the peninsula of Florida. Xanth was tenuously connected to our world, which Anthony called Mundania.  The funny thing is, even at the age of ten, I got Anthony’s admittedly bad joke—but I didn’t agree with it. Florida may have been stultifying, but it was anything but mundane. Or rather, its mundaneness was part of its weirdness. Things in Florida moved so quietly, so slowly, so utterly hopelessly, that it seemed like some kind of primordial being held over from prehistory. The fact that the state is geographically estranged from the mainland, and surrounded by bodies of water on all sides, seemed to symbolize its otherness: Florida, a vestigial tail of a place, an embryonic island affixed forever to the mainland by a peninsular umbilicus, a pocket dimension into which unwanted things (like me and my family) fell.  I moved to Denver when I was thirteen. There I grew up, or at least older. As an adult I found out that the beloved Xanth books of my youth were, to put it very mildly, somewhat problematic in regard to their depiction of women (even more so than most of those books’ contemporaries in the ’70s and ’80s)—something I wrote about a little more extensively for The A.V. Club a couple years ago. But that sense of Florida as a liminal mundanely magical, magically mundane place never left me.  A few years back I wrote a couple short stories, “Behold: Skowt!” and “The Raincaller” (the former was published in Apex Magazine, the latter in Sybil’s Garage). They starred the same character, Oso, a hustling, graffiti-slinging street-kid struggling to survive in a post-collapse dystopia. They weren’t set in Florida—the world I built was a bit nebulous in that regard—but they could have been, right down to a canal-raft made of salvaged Styrofoam.  I’m not the only speculative fiction author who’s been drawing inspiration from Florida lately. Most famously, Florida native Karen Russell’s Pulitzer-finalist novel Swamplandia! took place in a magic-realist version of the Sunshine State, and dealt with, among many other things, alligator wrestling. (Two years earlier, I featured alligator wrestling in “The Raincaller.” Having alligators pop up occasionally in your backyard as a kid will leave that kind of mark on you.)  More recently, Laura Van Den Berg’s post-pandemic novel Find Me follows a young, virus-resistant woman’s path across America, one that ends in a dreamlike iteration of Florida; conversely, Jeffrey Rotter’s post-collapse fable The Only Words That Are Worth Remembering starts out in Florida before winding elsewhere across the globe. Rotter’s vision of Florida is particularly interesting to me—and particularly chilling. In his novel, America’s current climate of anti-intellectualism has resulted in a complete rejection of science and reason. In this return to a pre-Copernican cosmology, the ruins of Cape Canaveral have come to be known as “Cape Cannibal.” As someone who once watched the ’80s Space Shuttle launches from across the state—and who painfully remembers the Challenger disaster in 1986, as well as the Shuttle program’s more recent tragedies and dissolution—I found Rotter’s wry, bittersweet satire especially poignant. Even Jeff VanderMeer’s Area X, the indeterminate setting of his excellent Southern Reach Trilogy of last year, bears striking resemblances to the Floridian landscape. Then again, VanderMeer is a Tallahassee resident. Like I said, the place seeps into your blood.  In real life—and with all apologies to friends and colleagues who still live there—Florida is not always a wondrous place. It’s plagued by dodgy politics, class disparity, voter suppression, and, well, sinkholes that swallow people whole. (One of my favorite, bone-chilling headlines of all time, from USA Today in 2013: “Fla. sinkhole is considered victim’s grave.” The article even uses the term “chasm,” eerily reminiscent of the infernally deep gorge known as the Gap Chasm in Anthony’s Xanth books.)  Granted, every state in America has its problems, my adopted Colorado very much included. But there’s just something about Florida—that stark contrast between its mundaneness and its magic, between its sunshine and its shadows—that makes the speculative mind wonder. And wander. And if it’s not careful, fall in. Jason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "text": "Non-Fiction\nAnother Word: On Sunshine and Shadows\nFor someone who was born in Connecticut and now lives in Colorado, I sure do wonder a lot about Florida. As it turns out, so does science fiction/fantasy. My excuse? I lived in the Sunshine State between the formative ages of four and thirteen. SFF’s excuse? Well, that’s a bit more complicated.\nMy first memory of Florida involves fireworks. Not just any fireworks, either. When I was four, my mom, my little brother, and I moved to the small Gulf Coast town of Englewood, Florida. The year was 1976. I remember watching the Bicentennial fireworks at the beach during that Fourth of July holiday. The magnificent explosions reflected in the waves, blooming underwater as well as in the sky, forming vast symmetrical patterns that seared themselves onto my tender gray matter.\nFlorida never stopped being magical. As I got older, I collected bugs, lizards, and frogs in picnic coolers, a fascination with creepy-crawly things that didn’t seem odd to me at all, at least not until other kids my age started pointing out my oddness, in the way that kids know how. As we moved from Englewood to nearby towns like North Port, Venice, and Port Charlotte, I learned to seek out the half-finished canals and abandoned construction sites deep in the swampy woods. My few friends and I once found a huge slab of Styrofoam in one of these lumber-strewn graveyards. We used it as a raft, to pole down those mucky, rain-filled proto-canals, like some kind of modern-day, mosquito-bitten Huck Finns. Along the way we’d carve hearts of palm out of wild palmetto bushes and eat them raw, dirt and all.\nAnd then there was the Space Shuttle. In the early ’80s, I’d stand in our doorway to watch Shuttle launches, even though they were happening all the way across the state on the opposite coast. I could turn up our TV and hear the sound of the launch while seeing the silent, tiny trail of exhaust form on the eastern horizon, like a zipper being gracefully opened in the fabric of the sky.\nIn Florida, though, such magical things went hand in hand with horrific ones. My family moved so often because my family was poor. We were running out on rent, dodging angry landlords, occasionally getting evicted. I started over in new schools more times than I can count, perpetually the new kid in dirty, uncool clothes, marked for ridicule. At home, I regularly witnessed drug dealing, drug use, drunkenness, and brutal domestic abuse. For a while, my mom dated an African-American man—one of the few authentically nice boyfriends I remember her ever having—and I got to see what racism looked like firsthand, through the stares and remarks of strangers around me. An uncle of mine even wound up in prison in Florida, and having to visit him there became a frightening ordeal. In retrospect, though, it was no less frightening than the instability, intolerance, and economic hardship that seemed to suffuse the Sunshine State with shadows.\nI discovered SFF in Florida. I’d ride my bike to the local library, then check out as many books by authors like Fred Saberhagen, Gordon R. Dickson, Anne McCaffrey, John Varley, and Roger Zelazny as I was allowed. I’d take them home to devour in the geeky sanctity of my room.\nImagine my awe when I discovered a fantasy series by an author named Piers Anthony that was set in Xanth: a magical realm that was shaped precisely like the peninsula of Florida. Xanth was tenuously connected to our world, which Anthony called Mundania.\nThe funny thing is, even at the age of ten, I got Anthony’s admittedly bad joke—but I didn’t agree with it. Florida may have been stultifying, but it was anything but mundane. Or rather, its mundaneness was part of its weirdness. Things in Florida moved so quietly, so slowly, so utterly hopelessly, that it seemed like some kind of primordial being held over from prehistory. The fact that the state is geographically estranged from the mainland, and surrounded by bodies of water on all sides, seemed to symbolize its otherness: Florida, a vestigial tail of a place, an embryonic island affixed forever to the mainland by a peninsular umbilicus, a pocket dimension into which unwanted things (like me and my family) fell.\nI moved to Denver when I was thirteen. There I grew up, or at least older. As an adult I found out that the beloved Xanth books of my youth were, to put it very mildly, somewhat problematic in regard to their depiction of women (even more so than most of those books’ contemporaries in the ’70s and ’80s)—something I wrote about a little more extensively for The A.V. Club a couple years ago. But that sense of Florida as a liminal mundanely magical, magically mundane place never left me.\nA few years back I wrote a couple short stories, “Behold: Skowt!” and “The Raincaller” (the former was published in Apex Magazine, the latter in Sybil’s Garage). They starred the same character, Oso, a hustling, graffiti-slinging street-kid struggling to survive in a post-collapse dystopia. They weren’t set in Florida—the world I built was a bit nebulous in that regard—but they could have been, right down to a canal-raft made of salvaged Styrofoam.\nI’m not the only speculative fiction author who’s been drawing inspiration from Florida lately. Most famously, Florida native Karen Russell’s Pulitzer-finalist novel Swamplandia! took place in a magic-realist version of the Sunshine State, and dealt with, among many other things, alligator wrestling. (Two years earlier, I featured alligator wrestling in “The Raincaller.” Having alligators pop up occasionally in your backyard as a kid will leave that kind of mark on you.)\nMore recently, Laura Van Den Berg’s post-pandemic novel Find Me follows a young, virus-resistant woman’s path across America, one that ends in a dreamlike iteration of Florida; conversely, Jeffrey Rotter’s post-collapse fable The Only Words That Are Worth Remembering starts out in Florida before winding elsewhere across the globe. Rotter’s vision of Florida is particularly interesting to me—and particularly chilling. In his novel, America’s current climate of anti-intellectualism has resulted in a complete rejection of science and reason. In this return to a pre-Copernican cosmology, the ruins of Cape Canaveral have come to be known as “Cape Cannibal.” As someone who once watched the ’80s Space Shuttle launches from across the state—and who painfully remembers the Challenger disaster in 1986, as well as the Shuttle program’s more recent tragedies and dissolution—I found Rotter’s wry, bittersweet satire especially poignant. Even Jeff VanderMeer’s Area X, the indeterminate setting of his excellent Southern Reach Trilogy of last year, bears striking resemblances to the Floridian landscape. Then again, VanderMeer is a Tallahassee resident. Like I said, the place seeps into your blood.\nIn real life—and with all apologies to friends and colleagues who still live there—Florida is not always a wondrous place. It’s plagued by dodgy politics, class disparity, voter suppression, and, well, sinkholes that swallow people whole. (One of my favorite, bone-chilling headlines of all time, from USA Today in 2013: “Fla. sinkhole is considered victim’s grave.” The article even uses the term “chasm,” eerily reminiscent of the infernally deep gorge known as the Gap Chasm in Anthony’s Xanth books.)\nGranted, every state in America has its problems, my adopted Colorado very much included. But there’s just something about Florida—that stark contrast between its mundaneness and its magic, between its sunshine and its shadows—that makes the speculative mind wonder. And wander. And if it’s not careful, fall in.\nJason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "source": "https://clarkesworldmagazine.com/another_word_09_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: On Sunshine and Shadows by Jason Heller"}