{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Hao Jingfang; Carmen Yiling Yan", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "98eI44fEQernHelvAUBFGpmmToU=", "id": null, "license": null, "comments": "", "raw_text": "4960 words, short story  Summer at Grandma's House  He pondered silently: the chain of unconnected actions that had determined his doom and destiny had been of his own creation.  After this summer, I finally understand what Camus said of Sisyphus.  I never looked at the word “fate” this way before. In the past, I always thought that either it was prearranged, and all we had to do was follow along; or that it didn’t exist at all, so we had to devise our own path in life.  I didn’t realize there might be a third option.  A  In August, I leave for my grandmother’s home in the country, fleeing ruckus like Newton fled the Black Plague. I want a quiet summer, nothing more.  The taxi drives out of the city, then along the dusty highway. I stuff my big, empty backpack under the seat and slump against the window.  Really, I’m not running away from anything earth-shattering. My graduation from college is going to be delayed a year. I broke up with my girlfriend. On top of that, I’m feeling a touch of ennui, leaving me unable to take interest in anything. The last one scares me a bit, but other than that, there’s nothing big. I’m not given to drama.  Mom approved. Find someplace to fix up your spirits, she told me, and come back ready for another go. She thought I was really tormented, which wasn’t true. There’s no way I could get her to understand that, though.  My grandmother’s little two-story bungalow sits at the foot of the mountain, its red roof hidden in the dense treetops.  A small chalkboard hangs from the wooden door. Written on it is: “Zhanzhan, I’ve gone shopping. The door is unlocked, so come in on your own when you arrive. There’s food in the fridge.”  I try pulling on the door handle, but it doesn’t budge. It doesn’t turn either, even when I twist harder. I can only sit on the steps and wait.  Grandma’s getting muddle-minded with age, I think. She must have locked the door by habit when she left, then forgot about it.  Grandpa passed away early. My grandmother’s lived here ever since she retired. Mom and Dad wanted to buy her a house in the city, but she turned down all their offers. She said she was used to living alone, as she pleased. She disliked the noise and clamor of the city.  For all her life, Grandma was a college professor; her mind and body were still sound. So Dad agreed. We keep saying we’ll spend a holiday here, but either Dad would be busy, or I’d have something planned with my schoolmates and couldn’t cancel.  I hope Grandma can still take care of herself on her own here, I think to myself, sitting on the steps.  Grandmother finally returns in the evening, quickening her strides when she sees me in the distance. She smiles at me. “Zhanzhan, when did you arrive? Why didn’t you go in the house?”  I dust off my butt and stand up. Grandma walks up the steps, shifts all her bags to her right hand, and pushes the door with her left hand, on the side closer to the hinges—opposite from the handle. Just like that, the door swings open, no fuss. Grandma walks in first, holding the door open for me.  My face flushes a little. I hurry in after her. It looks like I was overthinking things earlier.  Night descends. Night in the countryside is quiet and tranquil, just the dance of tree shadows cast by the moon.  Grandma quickly prepares dinner. The rich fragrance of beef fills the small house. After a long day of travel, the smell makes me ravenous.  “Zhanzhan, bring me the mayonnaise in the kitchen, please.” Grandma carefully sets a tureen of steamed eggs with mushroom on the table.  My grandmother’s kitchen is spacious and decorated in soft colors. Soup simmers on the stove, wreathed in steam.  I pull open the fridge, only to get a shock: inside of the fridge is a baking tray, and the inner walls glow red with heat. A row of apple pastries are crisping on the tray. The sweet smell of butter and honey assaults my face.  Turns out this is the oven. I hurriedly push it shut.  Where’s the fridge, then? I turn around. There’s a glass-windowed metal door under the stove—I assumed that was the oven. I walk over and pull it open, and discover that it’s a dishwasher.  So I pull open the dishwasher, and find that it’s a water purifier; pull open the water purifier, and find that it’s a trash can; open the trash can, and find that it’s filled with a broad selection of CDs, neatly sorted.  Finally I realize that the “heating unit” under the window—I thought it looked like a radiator in its ridged casing—is, in fact, the fridge. I locate the mayonnaise, and make sure to open the lid and sniff it, just to make sure the jar doesn’t actually contain condensed milk. Only after I’ve checked do I return to the dining room.  Grandma already has bowls and chopsticks set out. The instant I sit down I start stuffing my face.  B  I spend the next few days furiously learning how to identify everything.  Almost nothing in Grandma’s house has a function that matches what you’d expect from the form. The coffeepot is a penholder, the penholder is a lighter, the lighter is a flashlight, the flashlight is a jam container.  That last one gives me trouble. It’s the middle of the night when I get up to go to the bathroom. I unthinkingly grab the “flashlight” in the living room, only to get a handful of jam. In the darkness, the wet stickiness on my hand scares the sleep right out of me. When the realization dawns, my first instinct is to get a tissue, but the tissue box is filled with white sugar. I reach for the lamp. Who could have guessed that the table lamp is fake, and that the switch is actually a mousetrap?  With a sharp pa, I find myself in an awkward situation. On my left hand is jam dipped in white sugar. On my right hand is a table lamp smeared with cheese.  “Grandma!” I call softly, but don’t hear a reply. I can only climb the stairs, keeping both hands lifted in front of me. Her bedroom is dark, but yellow-orange light seeps from a small room at the end of the hallway.  “Grandma?” I try, outside of the room.  Following muffled scrapes of table and chair, Grandma appears at the door. She looks me over and bursts right into laughter. “Come with me,” she says.  The room turns out to be much larger than I thought. The lights are bright, and it takes my eyes a moment to adjust. Only then do I see that this is a lab.  Grandma takes an oddly-shaped little key from a drawer and frees me from the table-lamp-mousetrap. I lick my fingers. The cheese still smells delicious.  “Why are you doing experiments this late in the night?” I can’t help but ask.  “With bacterial colony growth, I have to take observations every hour.” Smiling, Grandma leads me over to a milk-colored countertop. A neat row of round Petri dishes lie on the counter, each filled with a translucent substance that looks like medicinal cream.  “Is this . . . nutrient agar?” I’ve done similar experiments at school.  Grandma nods. “I’m observing the movement of transposons in the bacteria.”  “Transposons?”  Grandma opens one of the Petri dishes on her end. She hefts it in her hand and says, “They’re pieces of DNA capable of encoding reverse transcription enzyme, which allows them to migrate along DNA, breaking away or re-integrating themselves. I want to use them to insert synthetic genes for drug resistance.”  Grandma sets the lid back on. “But I don’t know if it will work. This Petri dish is exposed to the air, providing a low-humidity environment. The one next to it is submerged in a sugar solution. The one after that has been enriched with extra ATP.”  I follow her example and open the Petri dish closest to me. “What are the conditions in this one?”  I dab my cheese-covered fingertip on the agar. I know that having plenty of nutrients makes cells reproduce faster, which should speed up the genetic integration.  “Zhanzhan!” Grandma hesitates, then says, “That’s the control sample. It’s not supposed to have any added factors.”  I’m always like that, full of assumptions when I do things, and careless ones at that.  One time, when Jingjing and I fought, she said that I always went about things impulsively, inconsiderately, immaturely. She’s right, I think. She was complaining about the way I always forgot to call her, but I know my problem goes further than that. Jingjing’s a person with lots of plans, and the capability to carry out each one of them reliably, but I’m the total opposite. When I try to carry out my plans, they always go wrong, as sure as bread lands butter-side down.  Without a control, Grandma will have to redo the whole experiment. She can keep observing, technically, but at the least she wouldn’t be able to use it in proper published results.  I’m panicked, unsure of what I should do, but Grandma doesn’t seem to be angry at all.  “It’s no big deal,” Grandma says. “I could use a sample with added cholesterol anyway.”  And Grandma really does take out a marker pen, makes a note on the lid, and keeps on observing.  C  The next morning, Grandma makes sweet osmanthus flower porridge. The morning sun is lovely shining down on the countryside. The only sound for miles around is birdsong.  Grandma asks me if I have any plans for these few days. None, I say. That’s the truth. The only thing I might want to do is think about what I might want to do.  “Your mother says your graduation was delayed because of English, but I don’t see how that could be the case. Weren’t you an English major before you switched? You should be quite good at English.”  “I didn’t test past the fourth level,” I mumble. “I forgot to register in junior year, and this year I forgot the test date.”  I gulp down the porridge with my head lowered, and stuff up my mouth with a sandwich.  I’m not afraid of any English exams, no, but that might have been why I failed to take them seriously. As for my change in major, that’s starting to look like another mistake. I switched to environmental studies, only to discover I didn’t care that much about the environment. Then I fled to hardware engineering in junior year, and attended a year’s worth of biology too. The result was today: I was jack of all majors, master of none.  Grandma cuts me another half slice of bacon. “What did your mother say before you came?”  “Nothing in particular. She just wants me to take a breather here, and read some books on economics if I have the time.”  “Your mother wants you to study economics?”  “Yeah, she says that no matter what company I end up working for, knowing a bit of economics will come in handy.”  My mom thinks that I should set a target, then study whatever I needed to get there. But I was lacking in precisely that department. None of the big goals I set ever lasted more than a few days before I nixed them, which left me without any impetus to work on the tasks at hand.  “You shouldn’t worry too much about the future.” Seeing that I’ve finished eating, Grandma begins to clear the table. “Just like the nose didn’t evolve to prop up glasses.”  Jingjing told me the same thing. “The nose evolved for the purpose of breathing,” she said. God sculpted us all into our own unique forms, so we shouldn’t worry about what other people thought, and stand firm on who we were. So Jingjing left the country, in accordance to who she was. But I was missing that sense of unique purpose too. God never got around to telling me who I was.  My mind is elsewhere as I help clear the table. The leftover porridge splatters all over the floor. My face immediately heats.  “Don’t worry, it’s no big deal.” Grandma takes the pot from me and fetches a mop.  “ . . . It’s flowed into the corner. Won’t that be hard to mop up? Do you have a cloth for cleaning the floor? I’ll do it,” I say, embarrassed.  I think of the way Mom would crouch and meticulously wipe down the crevice where the floor met the wall. Our house was always squeaky clean. Mom hated nothing more than my brand of haphazardness.  “It’s no big deal, really.” Grandma mops up the center of the dining room. “We’ll leave the corner as is.”  She notices that I’m at a loss. “I’m accident-prone myself,” she laughs. “I spill things everywhere. That’s why I laid down culture medium for growing fungi next to the walls. This way I’ll have material for my experiments.”  I bend down to look by the wall. There really is a band of pale green fuzz stretching around the room. From a distance, it looked like decorative trimming along the perimeter of the floor.  “Sweet porridge is ideal, actually. We might even get mushrooms.”  She sees that I’m still awkwardly standing in place, so she adds, “How about this? If you don’t have anything in particular to do these few days, do you want to help me grow fungi?”  I nod without hesitation.  It’s not just because I want to make up for the mess I made. More than that, I feel I need to change how I spend my days. Up until now, my life has been incoherent and scattershot. I haven’t been able to commit to any one of the well-trodden paths in life, or chart my own course. Maybe what I need is opportunity, even accidentally.  D  Grandma likes to say that purpose comes afterward.  Grandma rejects any form of teleology, from animism to vitalism. She doesn’t believe that evolution has a destination and dislikes explanations like “eyes grew eyelashes to keep dust out.” She doesn’t even think cells evolved membranes for self-protection.  “The enclosing membrane came before the cell could exist,” Grandmother says. “Same with G protein-coupled receptors. It became light-sensitive rhodopsin in the eyes and olfactory receptors in the nose.”  It’s a sort of Darwinism, I suppose: first mutation, then selection. First the protein, then the chemical reaction in which to participate. First the ability to encode an enzyme, then the sensory organ that uses the enzyme.  Existence precedes essence, I think the saying goes?  A few evenings later, good news comes from Grandma’s lab: the NTL reagent stain finally reveals the protein we’re looking for in the cytoplasm. A molecular weight test with the centrifuge confirms this. The transposons have successfully reverse transcribed their payload.  After several days of continuous pursuit and observation, you let out a breath at that kind of result. As I help Grandma clean up the lab, I ask, “What gene were we inserting, anyway?”  “A cell suicide signal,” Grandma says placidly.  “Wait, what?”  Grandma bends to sweep up the bits and pieces under the experiment counter. “This experiment was primarily meant as cancer treatment research. Cancer cells are simply cells that don’t die when they should, as you know.”  “Huh.” I pick up the dustpan. “Does that mean you can apply for a patent now?”  Grandma shakes her head. “I don’t want to do that yet.”  “How come?”  “I don’t know if this kind of reverse transcription might have delayed side effects.”  “What do you mean?”  Grandma doesn’t immediately answer. She collects the test tubes and wipes the counter clean. I tie up the trash bag and follow her downstairs to the garden.  “I suppose you haven’t heard the hypothesis of how viruses evolved? Transposons promote genetic recombination inside a cell, but on the loose outside of the cell, they can become viruses, like HIV.”  The summer breeze is warm and dry, but I involuntarily shiver.  So viruses split off from cells themselves. It makes me think of the square root calculator turned execution device in Wang Xiaobo’s book. There’s the same dark humor to it.  I understand Grandma’s attitude, but I can’t help but feel a little dissatisfied deep down. “Still, this technology could cure cancer. Aren’t you afraid someone will beat you to the patent?”  Grandma shakes her head. “What does that matter?”  Peng. At that moment, a thump comes from the other side of the garden.  Grandma and I hurry over, only to see a pudgy, sweaty face emerge from the other side of the garden fence, among the climbing roses.  “Hello . . . I’m terribly sorry, I was trying to rearrange my flower rack, but my hand slipped, and I smashed up your flowers by accident.”  I look down. He dropped a container of chrysanthemums, the flowerpot lying in pieces. Underneath are Grandma’s azaleas, an equally gory sight.  “Oh, right, I just moved here. I’ll be your neighbor from now on.” The fat middle-aged guy is nodding on autopilot. “I really am very sorry, ma’am. It’s my first day here and I’ve already given you trouble.”  “Don’t worry, it’s no big deal.” Grandma smiles genially.  “I’m terribly sorry. I’ll bring you flowers tomorrow to replace it.”  “It’s no big deal, really. I can take the opportunity to extract some chloroplasts and anthocyanin from the leaves and flowers. Don’t mind it.” Grandma bends down as she speaks and starts picking up flowerpot shards.  I stand in the yard, the summer night cool around me. My mind is a jumble.  I’ve discovered that Grandma’s catchphrase is “it’s no big deal.” It might be that most things in Grandma’s eyes really are no big deal. Fame, influence, personal property—none of them matter much at Grandma’s point in life, admittedly. She does whatever she feels like, and to her, it’s enough.  But what about me? I think.  What am I going to do once the summer’s over? Return to school, everything the same as before, and meander around for another year until graduation?  I know that’s not what I want.  E  When next morning comes around, I help Grandma take care of the shattered flowers, extracting the chlorophyll with acetone. With that, Grandma enthusiastically adds a new member to her enormous team of test subjects.  I spend the entire morning mentally battling with myself. Close to noon, I finally make my choice. No matter what, I think, I should first go to the patent office and ask a few questions. Conveniently, the guy next door comes over in the afternoon to make amends. I take the opportunity to run off on my own.  The website gave clear directions to the patent office, and I find it easily. The four-story building is plain but stately, the lobby quiet and well-lit. A graceful, pretty girl sits behind the receptionist’s desk, reading a book.  “H-hello, I’d like to apply for a patent.”  She looks up and smiles. “Hello. Fill out the form over there, please. What are you patenting?”  “Uh, an anti-cancer biological factor.”  “Then you’ll want to head to Hall 3, the Biology and Chemistry Office.” She points toward the right. As I turn, she muses to herself, “Strange, why are there so many people applying for anti-cancer factors today?”  I spin right back around. “Wait, there was someone else before me?”  “Yes, an older man came just this morning.”  My heart lurches. I sense something’s not quite right.  “Do you know what technology he was patenting, specifically?”  “I don’t know, I’m afraid.”  “Was it a drug, or something else?”  The girl sighs. “I’m just a college student working here for the summer. It’s not my business to look at the applications. You should go in and ask yourself.” With that, the girl lowers her head once more and resumes scribbling and underlining.  I bend over to look. It’s a book of English vocabulary. “You’re memorizing vocabulary?” I ask, trying to get her on my side. “I’m doing that too.”  “Oh? You’re a college student?” She raises her head and looks me over curiously. “And you already have something to patent? That’s impressive.”  “Ah . . . no, you’ve got it wrong.” My face flushes a little. “I’m just looking in on behalf of my academic advisor. Do you remember what that older guy looked like? I think my advisor might have come here already without telling me.”  “Hmm . . . he was short, on the plump side, kind of bald. I think he was wearing a yellow jacket. I don’t remember anything else.”  Like I suspected. No wonder I noticed something was off when I left the house.  The middle-aged guy next door arrived with his flowers just then. I took the flowerpot from him, and when he went to open the door for me, he pushed on the side of the door closer to the hinges without hesitation. Someone here for the first time wouldn’t have known to do that. I understand now. Last night wasn’t purely chance. He must have accidentally knocked over the flowers while eavesdropping.  He really has no sense of decency, coming over again today, I think. I need to hurry and tell Grandma. He probably thought that we wouldn’t be applying for a patent and would never find out. Good thing I came here.  “Leaving already?” the girl calls out as I head for the door. “Here’s a pamphlet, then. It has an introduction to the patent office and an explanation of the application process, plus contact information.”  I manage a smile. I accept the pamphlet, stick it in my pocket, and stride quickly out the door.  F  I rush home only to find Grandma in her lab like usual, calmly looking through her microscope. She’s a quiet, steady island amid a chaos of river torrents.  “Grandma . . . ” I force my panting and puffing under control. “He stole your Petri dishes . . . ”  “Back from somewhere? Where did you go, to end up so dusty?” Grandma looks up, smiling, and brushes at my jacket.  “I went—” I fall silent, unsure of how to explain my trip to the patent office. I change tack. “Grandma, that fat guy next door stole your Petri dishes and applied for a patent.”  Unexpectedly, Grandma only smiles. “It’s no big deal. I can continue my research just fine. Moreover, like I told you, the experiment we conducted was very crude and preliminary. The results can’t be put into application as they are.”  I look at Grandma, at a loss for words. Is it actually possible for someone to be so easygoing? Grandma doesn’t seem to concern herself with things like intellectual property and monetary gain at all. I silently take the pamphlet out of my pocket and hold it in my hands, folding and unfolding it.  “Don’t worry about that for now. First come and look at this.” Grandma points to the microscope in front of her.  I take a halfhearted peep through it. “What is it?” I ask, offhandedly.  “Genetically engineered photosynthesizing bacteria.”  I perk up. This sounds interesting. “How did you do it?”  “I simply reverse transcribed genes from the chloroplasts into the bacteria. They’ve already expressed many of the proteins, although I’m sure there are still problems present. If we can overcome them, maybe these bacteria can be used as a source of alternative energy.”  As I listen to Grandma’s placid, happy voice, I suddenly get a strange and dreamlike feeling. It’s like I’m cocooned in a layer of fog, while her voice is coming from a long distance away. I look down. I’m rubbing the pamphlet between my fingers. I need to make a choice.  Grandma’s still talking. “As you know, I’ve laid down a lot of culture medium on the floors. I plan to replace more material so I can grow the bacteria all over the house. If it works, we’ll have a use for porridge leftovers and everything. As for the actual electricity generation, you were the one who gave me the inspiration. Cell membranes normally have high fluidity, which makes it difficult to capture the high-energy electrons generated from photosynthesis. However, if we add large quantities of cholesterol molecules, we can just about stabilize the membrane. In theory, we can use micro-electrodes to position . . . ”  I stand there woodenly. I’m not really paying attention to Grandma, just catching fragments here and there. This discovery might have even bigger future applications. But my brain is a worse jumble than before. I can’t concentrate enough to listen anymore. “You’re bringing up all the things I did wrong,” I say awkwardly.  Grandma shakes her head. “Zhanzhan, do you still not understand?” She stops, looking into my eyes. “Every day, every moment, countless random events will occur. You’ll pick one of many possible restaurants to eat at, take one of many possible buses, see one of many possible advertisements. And at that point in time, you can’t classify them as good or bad, right or wrong. They take on worth only in the future. What we do at this moment in the present gives meaning to another moment in the past . . . ”  Grandma’s voice sounds light and drifting. I can’t react to it in time. Chance, time, meaning, future, the words spin in my head. I think of Borges’, “The Garden of Forking Paths.” Yu Tsun must have felt what I’m feeling, the decision uncertain but fomenting in my heart, even as enigmatic words wisp into my ear . . .  “ . . . biology is based on just one set of principles: random events and directional selection. What’s doing the selection? What allows some events to stick around and prove to be beneficial? The answer is perpetuation alone. If a protein can persist, it will persist. It will claim a position in the course of history, while other proteins appear and then disappear at random. The only way to make a step you’ve taken ‘correct’ is to take another step in the same direction . . . ”  I think of myself, of the fat guy next door, of Mom and Jingjing, of the four years I spent in a muddle, of my dejection and conflict, of the bright and shining lobby of the patent office. I know I need an opportunity.  “ . . . that’s why, if we can make use of them, cheese and spilled porridge and broken-off flowers don’t have to be bad things at all.”  And I make my choice.  G  After that summer, I get an internship at the patent office. I learned of the opportunity from the booklet.  It’s not very easy to find a proper job here, but they’re always looking for college students to take care of odds and ends—fortunate, that I haven’t graduated yet. The work at the patent office isn’t hard, but it requires a bit of knowledge from every field—fortunate, that I was so aimless in my studies at college.  An’an—the girl I met the first time I came here—is now my girlfriend. We fell in love while studying together for the English exam—fortunate, that I hadn’t passed the fourth level. An’an says that I seemed polite and shy on first impression, which she found charming—I didn’t tell her that it was due to nervousness and a guilty conscience. Everything seems to have worked out like magic. Even the things I felt bad about ended up helping me.  Taking it a step further, I can even say that my inner turmoil was a good thing—if it weren’t for that, I wouldn’t have gone to Grandma’s house, and everything that came after wouldn’t have happened. Looking back, everything from before was all linked together into one chain.  I know that no one planned this for me. Fate doesn’t exist. I chose all of it.  It’s a strange feeling. We always think we can choose our futures, but that’s not true. What we really can choose is our past.  I chose the lunch I had a couple of years ago, made it a lunch different from the thousand other possible lunches. Likewise, I chose whether my time at college was a mistake.  Maybe accepting reality is just another name for staying true to yourself. Who are you, really, other than the sum of everything that’s happened?  A year has passed. With a happy mindset, I’ve done great at my work. The patent office has accepted me as a full-time employee. I’ll start my job in the fall.  I like it here. I like learning bits and pieces from all sorts of subjects. Besides, I’m no good at making long-term plans, or carrying them out. The work here is just one case after another, no need for looking far ahead. Plus, I have the same job as Einstein, which is pretty awesome.  After a year of repeated experiments and observations, Grandma is applying for patents for her anti-cancer factor and photosynthesizing walls. Several large companies have already expressed interest. Grandma isn’t interested in contract negotiations, so I’ve taken on the responsibilities of a middleman. Fortunate, that I work for the patent office.  Oh, right, I forgot to mention. The fat guy next door didn’t steal the Petri dishes with the anti-cancer factors after all. He thought he found the incubator, but it was actually an ordinary wardrobe. The real incubator looks like a dresser.  So you never know what something’s really meant for, Grandma says. Turns out she knew from the beginning. Turns out she knew everything from the beginning.    Originally published in Chinese in Science Fiction World, 2007.    Translated and published in partnership with Storycom.  Born in 1984 in Tianjin, Hao Jingfang graduated in 2006 from the Tsinghua University, majoring in physics. In addition she also studied Astrophysics at Tsinghua Centre, ultimately earning a PhD from the School of Economics and Management. As a student, she won first prize in the fourth New Concept writing competition and the first Novoland essay contest. The English translation of her short story \"Folding Beijing\" earned Hao her first Hugo Award for Best Novelette at the 74th World Science Fiction Convention in 2016. Her published work includes two full-length novels, Wandering Earth and Born in 1984, short stories collections The Depth of Loneliness and To Go the Distance, and the essay collection Europe within Time.  Born in China and raised in the United States, Carmen Yiling Yan was first driven to translation in high school by the pain of reading really good stories and being unable to share them. Since then, her translations of Chinese science fiction have been published in Clarkesworld, Lightspeed, and Galaxy’s Edge, as well as numerous anthologies. She graduated from UCLA with a degree in Computer Science, but writes more fiction than code these days. She currently lives in the Midwest.", "text": "4960 words, short story\nSummer at Grandma's House\nHe pondered silently: the chain of unconnected actions that had determined his doom and destiny had been of his own creation.\nAfter this summer, I finally understand what Camus said of Sisyphus.\nI never looked at the word “fate” this way before. In the past, I always thought that either it was prearranged, and all we had to do was follow along; or that it didn’t exist at all, so we had to devise our own path in life.\nI didn’t realize there might be a third option.\nA\nIn August, I leave for my grandmother’s home in the country, fleeing ruckus like Newton fled the Black Plague. I want a quiet summer, nothing more.\nThe taxi drives out of the city, then along the dusty highway. I stuff my big, empty backpack under the seat and slump against the window.\nReally, I’m not running away from anything earth-shattering. My graduation from college is going to be delayed a year. I broke up with my girlfriend. On top of that, I’m feeling a touch of ennui, leaving me unable to take interest in anything. The last one scares me a bit, but other than that, there’s nothing big. I’m not given to drama.\nMom approved. Find someplace to fix up your spirits, she told me, and come back ready for another go. She thought I was really tormented, which wasn’t true. There’s no way I could get her to understand that, though.\nMy grandmother’s little two-story bungalow sits at the foot of the mountain, its red roof hidden in the dense treetops.\nA small chalkboard hangs from the wooden door. Written on it is: “Zhanzhan, I’ve gone shopping. The door is unlocked, so come in on your own when you arrive. There’s food in the fridge.”\nI try pulling on the door handle, but it doesn’t budge. It doesn’t turn either, even when I twist harder. I can only sit on the steps and wait.\nGrandma’s getting muddle-minded with age, I think. She must have locked the door by habit when she left, then forgot about it.\nGrandpa passed away early. My grandmother’s lived here ever since she retired. Mom and Dad wanted to buy her a house in the city, but she turned down all their offers. She said she was used to living alone, as she pleased. She disliked the noise and clamor of the city.\nFor all her life, Grandma was a college professor; her mind and body were still sound. So Dad agreed. We keep saying we’ll spend a holiday here, but either Dad would be busy, or I’d have something planned with my schoolmates and couldn’t cancel.\nI hope Grandma can still take care of herself on her own here, I think to myself, sitting on the steps.\nGrandmother finally returns in the evening, quickening her strides when she sees me in the distance. She smiles at me. “Zhanzhan, when did you arrive? Why didn’t you go in the house?”\nI dust off my butt and stand up. Grandma walks up the steps, shifts all her bags to her right hand, and pushes the door with her left hand, on the side closer to the hinges—opposite from the handle. Just like that, the door swings open, no fuss. Grandma walks in first, holding the door open for me.\nMy face flushes a little. I hurry in after her. It looks like I was overthinking things earlier.\nNight descends. Night in the countryside is quiet and tranquil, just the dance of tree shadows cast by the moon.\nGrandma quickly prepares dinner. The rich fragrance of beef fills the small house. After a long day of travel, the smell makes me ravenous.\n“Zhanzhan, bring me the mayonnaise in the kitchen, please.” Grandma carefully sets a tureen of steamed eggs with mushroom on the table.\nMy grandmother’s kitchen is spacious and decorated in soft colors. Soup simmers on the stove, wreathed in steam.\nI pull open the fridge, only to get a shock: inside of the fridge is a baking tray, and the inner walls glow red with heat. A row of apple pastries are crisping on the tray. The sweet smell of butter and honey assaults my face.\nTurns out this is the oven. I hurriedly push it shut.\nWhere’s the fridge, then? I turn around. There’s a glass-windowed metal door under the stove—I assumed that was the oven. I walk over and pull it open, and discover that it’s a dishwasher.\nSo I pull open the dishwasher, and find that it’s a water purifier; pull open the water purifier, and find that it’s a trash can; open the trash can, and find that it’s filled with a broad selection of CDs, neatly sorted.\nFinally I realize that the “heating unit” under the window—I thought it looked like a radiator in its ridged casing—is, in fact, the fridge. I locate the mayonnaise, and make sure to open the lid and sniff it, just to make sure the jar doesn’t actually contain condensed milk. Only after I’ve checked do I return to the dining room.\nGrandma already has bowls and chopsticks set out. The instant I sit down I start stuffing my face.\nB\nI spend the next few days furiously learning how to identify everything.\nAlmost nothing in Grandma’s house has a function that matches what you’d expect from the form. The coffeepot is a penholder, the penholder is a lighter, the lighter is a flashlight, the flashlight is a jam container.\nThat last one gives me trouble. It’s the middle of the night when I get up to go to the bathroom. I unthinkingly grab the “flashlight” in the living room, only to get a handful of jam. In the darkness, the wet stickiness on my hand scares the sleep right out of me. When the realization dawns, my first instinct is to get a tissue, but the tissue box is filled with white sugar. I reach for the lamp. Who could have guessed that the table lamp is fake, and that the switch is actually a mousetrap?\nWith a sharp pa, I find myself in an awkward situation. On my left hand is jam dipped in white sugar. On my right hand is a table lamp smeared with cheese.\n“Grandma!” I call softly, but don’t hear a reply. I can only climb the stairs, keeping both hands lifted in front of me. Her bedroom is dark, but yellow-orange light seeps from a small room at the end of the hallway.\n“Grandma?” I try, outside of the room.\nFollowing muffled scrapes of table and chair, Grandma appears at the door. She looks me over and bursts right into laughter. “Come with me,” she says.\nThe room turns out to be much larger than I thought. The lights are bright, and it takes my eyes a moment to adjust. Only then do I see that this is a lab.\nGrandma takes an oddly-shaped little key from a drawer and frees me from the table-lamp-mousetrap. I lick my fingers. The cheese still smells delicious.\n“Why are you doing experiments this late in the night?” I can’t help but ask.\n“With bacterial colony growth, I have to take observations every hour.” Smiling, Grandma leads me over to a milk-colored countertop. A neat row of round Petri dishes lie on the counter, each filled with a translucent substance that looks like medicinal cream.\n“Is this . . . nutrient agar?” I’ve done similar experiments at school.\nGrandma nods. “I’m observing the movement of transposons in the bacteria.”\n“Transposons?”\nGrandma opens one of the Petri dishes on her end. She hefts it in her hand and says, “They’re pieces of DNA capable of encoding reverse transcription enzyme, which allows them to migrate along DNA, breaking away or re-integrating themselves. I want to use them to insert synthetic genes for drug resistance.”\nGrandma sets the lid back on. “But I don’t know if it will work. This Petri dish is exposed to the air, providing a low-humidity environment. The one next to it is submerged in a sugar solution. The one after that has been enriched with extra ATP.”\nI follow her example and open the Petri dish closest to me. “What are the conditions in this one?”\nI dab my cheese-covered fingertip on the agar. I know that having plenty of nutrients makes cells reproduce faster, which should speed up the genetic integration.\n“Zhanzhan!” Grandma hesitates, then says, “That’s the control sample. It’s not supposed to have any added factors.”\nI’m always like that, full of assumptions when I do things, and careless ones at that.\nOne time, when Jingjing and I fought, she said that I always went about things impulsively, inconsiderately, immaturely. She’s right, I think. She was complaining about the way I always forgot to call her, but I know my problem goes further than that. Jingjing’s a person with lots of plans, and the capability to carry out each one of them reliably, but I’m the total opposite. When I try to carry out my plans, they always go wrong, as sure as bread lands butter-side down.\nWithout a control, Grandma will have to redo the whole experiment. She can keep observing, technically, but at the least she wouldn’t be able to use it in proper published results.\nI’m panicked, unsure of what I should do, but Grandma doesn’t seem to be angry at all.\n“It’s no big deal,” Grandma says. “I could use a sample with added cholesterol anyway.”\nAnd Grandma really does take out a marker pen, makes a note on the lid, and keeps on observing.\nC\nThe next morning, Grandma makes sweet osmanthus flower porridge. The morning sun is lovely shining down on the countryside. The only sound for miles around is birdsong.\nGrandma asks me if I have any plans for these few days. None, I say. That’s the truth. The only thing I might want to do is think about what I might want to do.\n“Your mother says your graduation was delayed because of English, but I don’t see how that could be the case. Weren’t you an English major before you switched? You should be quite good at English.”\n“I didn’t test past the fourth level,” I mumble. “I forgot to register in junior year, and this year I forgot the test date.”\nI gulp down the porridge with my head lowered, and stuff up my mouth with a sandwich.\nI’m not afraid of any English exams, no, but that might have been why I failed to take them seriously. As for my change in major, that’s starting to look like another mistake. I switched to environmental studies, only to discover I didn’t care that much about the environment. Then I fled to hardware engineering in junior year, and attended a year’s worth of biology too. The result was today: I was jack of all majors, master of none.\nGrandma cuts me another half slice of bacon. “What did your mother say before you came?”\n“Nothing in particular. She just wants me to take a breather here, and read some books on economics if I have the time.”\n“Your mother wants you to study economics?”\n“Yeah, she says that no matter what company I end up working for, knowing a bit of economics will come in handy.”\nMy mom thinks that I should set a target, then study whatever I needed to get there. But I was lacking in precisely that department. None of the big goals I set ever lasted more than a few days before I nixed them, which left me without any impetus to work on the tasks at hand.\n“You shouldn’t worry too much about the future.” Seeing that I’ve finished eating, Grandma begins to clear the table. “Just like the nose didn’t evolve to prop up glasses.”\nJingjing told me the same thing. “The nose evolved for the purpose of breathing,” she said. God sculpted us all into our own unique forms, so we shouldn’t worry about what other people thought, and stand firm on who we were. So Jingjing left the country, in accordance to who she was. But I was missing that sense of unique purpose too. God never got around to telling me who I was.\nMy mind is elsewhere as I help clear the table. The leftover porridge splatters all over the floor. My face immediately heats.\n“Don’t worry, it’s no big deal.” Grandma takes the pot from me and fetches a mop.\n“ . . . It’s flowed into the corner. Won’t that be hard to mop up? Do you have a cloth for cleaning the floor? I’ll do it,” I say, embarrassed.\nI think of the way Mom would crouch and meticulously wipe down the crevice where the floor met the wall. Our house was always squeaky clean. Mom hated nothing more than my brand of haphazardness.\n“It’s no big deal, really.” Grandma mops up the center of the dining room. “We’ll leave the corner as is.”\nShe notices that I’m at a loss. “I’m accident-prone myself,” she laughs. “I spill things everywhere. That’s why I laid down culture medium for growing fungi next to the walls. This way I’ll have material for my experiments.”\nI bend down to look by the wall. There really is a band of pale green fuzz stretching around the room. From a distance, it looked like decorative trimming along the perimeter of the floor.\n“Sweet porridge is ideal, actually. We might even get mushrooms.”\nShe sees that I’m still awkwardly standing in place, so she adds, “How about this? If you don’t have anything in particular to do these few days, do you want to help me grow fungi?”\nI nod without hesitation.\nIt’s not just because I want to make up for the mess I made. More than that, I feel I need to change how I spend my days. Up until now, my life has been incoherent and scattershot. I haven’t been able to commit to any one of the well-trodden paths in life, or chart my own course. Maybe what I need is opportunity, even accidentally.\nD\nGrandma likes to say that purpose comes afterward.\nGrandma rejects any form of teleology, from animism to vitalism. She doesn’t believe that evolution has a destination and dislikes explanations like “eyes grew eyelashes to keep dust out.” She doesn’t even think cells evolved membranes for self-protection.\n“The enclosing membrane came before the cell could exist,” Grandmother says. “Same with G protein-coupled receptors. It became light-sensitive rhodopsin in the eyes and olfactory receptors in the nose.”\nIt’s a sort of Darwinism, I suppose: first mutation, then selection. First the protein, then the chemical reaction in which to participate. First the ability to encode an enzyme, then the sensory organ that uses the enzyme.\nExistence precedes essence, I think the saying goes?\nA few evenings later, good news comes from Grandma’s lab: the NTL reagent stain finally reveals the protein we’re looking for in the cytoplasm. A molecular weight test with the centrifuge confirms this. The transposons have successfully reverse transcribed their payload.\nAfter several days of continuous pursuit and observation, you let out a breath at that kind of result. As I help Grandma clean up the lab, I ask, “What gene were we inserting, anyway?”\n“A cell suicide signal,” Grandma says placidly.\n“Wait, what?”\nGrandma bends to sweep up the bits and pieces under the experiment counter. “This experiment was primarily meant as cancer treatment research. Cancer cells are simply cells that don’t die when they should, as you know.”\n“Huh.” I pick up the dustpan. “Does that mean you can apply for a patent now?”\nGrandma shakes her head. “I don’t want to do that yet.”\n“How come?”\n“I don’t know if this kind of reverse transcription might have delayed side effects.”\n“What do you mean?”\nGrandma doesn’t immediately answer. She collects the test tubes and wipes the counter clean. I tie up the trash bag and follow her downstairs to the garden.\n“I suppose you haven’t heard the hypothesis of how viruses evolved? Transposons promote genetic recombination inside a cell, but on the loose outside of the cell, they can become viruses, like HIV.”\nThe summer breeze is warm and dry, but I involuntarily shiver.\nSo viruses split off from cells themselves. It makes me think of the square root calculator turned execution device in Wang Xiaobo’s book. There’s the same dark humor to it.\nI understand Grandma’s attitude, but I can’t help but feel a little dissatisfied deep down. “Still, this technology could cure cancer. Aren’t you afraid someone will beat you to the patent?”\nGrandma shakes her head. “What does that matter?”\nPeng. At that moment, a thump comes from the other side of the garden.\nGrandma and I hurry over, only to see a pudgy, sweaty face emerge from the other side of the garden fence, among the climbing roses.\n“Hello . . . I’m terribly sorry, I was trying to rearrange my flower rack, but my hand slipped, and I smashed up your flowers by accident.”\nI look down. He dropped a container of chrysanthemums, the flowerpot lying in pieces. Underneath are Grandma’s azaleas, an equally gory sight.\n“Oh, right, I just moved here. I’ll be your neighbor from now on.” The fat middle-aged guy is nodding on autopilot. “I really am very sorry, ma’am. It’s my first day here and I’ve already given you trouble.”\n“Don’t worry, it’s no big deal.” Grandma smiles genially.\n“I’m terribly sorry. I’ll bring you flowers tomorrow to replace it.”\n“It’s no big deal, really. I can take the opportunity to extract some chloroplasts and anthocyanin from the leaves and flowers. Don’t mind it.” Grandma bends down as she speaks and starts picking up flowerpot shards.\nI stand in the yard, the summer night cool around me. My mind is a jumble.\nI’ve discovered that Grandma’s catchphrase is “it’s no big deal.” It might be that most things in Grandma’s eyes really are no big deal. Fame, influence, personal property—none of them matter much at Grandma’s point in life, admittedly. She does whatever she feels like, and to her, it’s enough.\nBut what about me? I think.\nWhat am I going to do once the summer’s over? Return to school, everything the same as before, and meander around for another year until graduation?\nI know that’s not what I want.\nE\nWhen next morning comes around, I help Grandma take care of the shattered flowers, extracting the chlorophyll with acetone. With that, Grandma enthusiastically adds a new member to her enormous team of test subjects.\nI spend the entire morning mentally battling with myself. Close to noon, I finally make my choice. No matter what, I think, I should first go to the patent office and ask a few questions. Conveniently, the guy next door comes over in the afternoon to make amends. I take the opportunity to run off on my own.\nThe website gave clear directions to the patent office, and I find it easily. The four-story building is plain but stately, the lobby quiet and well-lit. A graceful, pretty girl sits behind the receptionist’s desk, reading a book.\n“H-hello, I’d like to apply for a patent.”\nShe looks up and smiles. “Hello. Fill out the form over there, please. What are you patenting?”\n“Uh, an anti-cancer biological factor.”\n“Then you’ll want to head to Hall 3, the Biology and Chemistry Office.” She points toward the right. As I turn, she muses to herself, “Strange, why are there so many people applying for anti-cancer factors today?”\nI spin right back around. “Wait, there was someone else before me?”\n“Yes, an older man came just this morning.”\nMy heart lurches. I sense something’s not quite right.\n“Do you know what technology he was patenting, specifically?”\n“I don’t know, I’m afraid.”\n“Was it a drug, or something else?”\nThe girl sighs. “I’m just a college student working here for the summer. It’s not my business to look at the applications. You should go in and ask yourself.” With that, the girl lowers her head once more and resumes scribbling and underlining.\nI bend over to look. It’s a book of English vocabulary. “You’re memorizing vocabulary?” I ask, trying to get her on my side. “I’m doing that too.”\n“Oh? You’re a college student?” She raises her head and looks me over curiously. “And you already have something to patent? That’s impressive.”\n“Ah . . . no, you’ve got it wrong.” My face flushes a little. “I’m just looking in on behalf of my academic advisor. Do you remember what that older guy looked like? I think my advisor might have come here already without telling me.”\n“Hmm . . . he was short, on the plump side, kind of bald. I think he was wearing a yellow jacket. I don’t remember anything else.”\nLike I suspected. No wonder I noticed something was off when I left the house.\nThe middle-aged guy next door arrived with his flowers just then. I took the flowerpot from him, and when he went to open the door for me, he pushed on the side of the door closer to the hinges without hesitation. Someone here for the first time wouldn’t have known to do that. I understand now. Last night wasn’t purely chance. He must have accidentally knocked over the flowers while eavesdropping.\nHe really has no sense of decency, coming over again today, I think. I need to hurry and tell Grandma. He probably thought that we wouldn’t be applying for a patent and would never find out. Good thing I came here.\n“Leaving already?” the girl calls out as I head for the door. “Here’s a pamphlet, then. It has an introduction to the patent office and an explanation of the application process, plus contact information.”\nI manage a smile. I accept the pamphlet, stick it in my pocket, and stride quickly out the door.\nF\nI rush home only to find Grandma in her lab like usual, calmly looking through her microscope. She’s a quiet, steady island amid a chaos of river torrents.\n“Grandma . . . ” I force my panting and puffing under control. “He stole your Petri dishes . . . ”\n“Back from somewhere? Where did you go, to end up so dusty?” Grandma looks up, smiling, and brushes at my jacket.\n“I went—” I fall silent, unsure of how to explain my trip to the patent office. I change tack. “Grandma, that fat guy next door stole your Petri dishes and applied for a patent.”\nUnexpectedly, Grandma only smiles. “It’s no big deal. I can continue my research just fine. Moreover, like I told you, the experiment we conducted was very crude and preliminary. The results can’t be put into application as they are.”\nI look at Grandma, at a loss for words. Is it actually possible for someone to be so easygoing? Grandma doesn’t seem to concern herself with things like intellectual property and monetary gain at all. I silently take the pamphlet out of my pocket and hold it in my hands, folding and unfolding it.\n“Don’t worry about that for now. First come and look at this.” Grandma points to the microscope in front of her.\nI take a halfhearted peep through it. “What is it?” I ask, offhandedly.\n“Genetically engineered photosynthesizing bacteria.”\nI perk up. This sounds interesting. “How did you do it?”\n“I simply reverse transcribed genes from the chloroplasts into the bacteria. They’ve already expressed many of the proteins, although I’m sure there are still problems present. If we can overcome them, maybe these bacteria can be used as a source of alternative energy.”\nAs I listen to Grandma’s placid, happy voice, I suddenly get a strange and dreamlike feeling. It’s like I’m cocooned in a layer of fog, while her voice is coming from a long distance away. I look down. I’m rubbing the pamphlet between my fingers. I need to make a choice.\nGrandma’s still talking. “As you know, I’ve laid down a lot of culture medium on the floors. I plan to replace more material so I can grow the bacteria all over the house. If it works, we’ll have a use for porridge leftovers and everything. As for the actual electricity generation, you were the one who gave me the inspiration. Cell membranes normally have high fluidity, which makes it difficult to capture the high-energy electrons generated from photosynthesis. However, if we add large quantities of cholesterol molecules, we can just about stabilize the membrane. In theory, we can use micro-electrodes to position . . . ”\nI stand there woodenly. I’m not really paying attention to Grandma, just catching fragments here and there. This discovery might have even bigger future applications. But my brain is a worse jumble than before. I can’t concentrate enough to listen anymore. “You’re bringing up all the things I did wrong,” I say awkwardly.\nGrandma shakes her head. “Zhanzhan, do you still not understand?” She stops, looking into my eyes. “Every day, every moment, countless random events will occur. You’ll pick one of many possible restaurants to eat at, take one of many possible buses, see one of many possible advertisements. And at that point in time, you can’t classify them as good or bad, right or wrong. They take on worth only in the future. What we do at this moment in the present gives meaning to another moment in the past . . . ”\nGrandma’s voice sounds light and drifting. I can’t react to it in time. Chance, time, meaning, future, the words spin in my head. I think of Borges’, “The Garden of Forking Paths.” Yu Tsun must have felt what I’m feeling, the decision uncertain but fomenting in my heart, even as enigmatic words wisp into my ear . . .\n“ . . . biology is based on just one set of principles: random events and directional selection. What’s doing the selection? What allows some events to stick around and prove to be beneficial? The answer is perpetuation alone. If a protein can persist, it will persist. It will claim a position in the course of history, while other proteins appear and then disappear at random. The only way to make a step you’ve taken ‘correct’ is to take another step in the same direction . . . ”\nI think of myself, of the fat guy next door, of Mom and Jingjing, of the four years I spent in a muddle, of my dejection and conflict, of the bright and shining lobby of the patent office. I know I need an opportunity.\n“ . . . that’s why, if we can make use of them, cheese and spilled porridge and broken-off flowers don’t have to be bad things at all.”\nAnd I make my choice.\nG\nAfter that summer, I get an internship at the patent office. I learned of the opportunity from the booklet.\nIt’s not very easy to find a proper job here, but they’re always looking for college students to take care of odds and ends—fortunate, that I haven’t graduated yet. The work at the patent office isn’t hard, but it requires a bit of knowledge from every field—fortunate, that I was so aimless in my studies at college.\nAn’an—the girl I met the first time I came here—is now my girlfriend. We fell in love while studying together for the English exam—fortunate, that I hadn’t passed the fourth level. An’an says that I seemed polite and shy on first impression, which she found charming—I didn’t tell her that it was due to nervousness and a guilty conscience. Everything seems to have worked out like magic. Even the things I felt bad about ended up helping me.\nTaking it a step further, I can even say that my inner turmoil was a good thing—if it weren’t for that, I wouldn’t have gone to Grandma’s house, and everything that came after wouldn’t have happened. Looking back, everything from before was all linked together into one chain.\nI know that no one planned this for me. Fate doesn’t exist. I chose all of it.\nIt’s a strange feeling. We always think we can choose our futures, but that’s not true. What we really can choose is our past.\nI chose the lunch I had a couple of years ago, made it a lunch different from the thousand other possible lunches. Likewise, I chose whether my time at college was a mistake.\nMaybe accepting reality is just another name for staying true to yourself. Who are you, really, other than the sum of everything that’s happened?\nA year has passed. With a happy mindset, I’ve done great at my work. The patent office has accepted me as a full-time employee. I’ll start my job in the fall.\nI like it here. I like learning bits and pieces from all sorts of subjects. Besides, I’m no good at making long-term plans, or carrying them out. The work here is just one case after another, no need for looking far ahead. Plus, I have the same job as Einstein, which is pretty awesome.\nAfter a year of repeated experiments and observations, Grandma is applying for patents for her anti-cancer factor and photosynthesizing walls. Several large companies have already expressed interest. Grandma isn’t interested in contract negotiations, so I’ve taken on the responsibilities of a middleman. Fortunate, that I work for the patent office.\nOh, right, I forgot to mention. The fat guy next door didn’t steal the Petri dishes with the anti-cancer factors after all. He thought he found the incubator, but it was actually an ordinary wardrobe. The real incubator looks like a dresser.\nSo you never know what something’s really meant for, Grandma says. Turns out she knew from the beginning. Turns out she knew everything from the beginning.\nOriginally published in Chinese in Science Fiction World, 2007.\nTranslated and published in partnership with Storycom.\nBorn in 1984 in Tianjin, Hao Jingfang graduated in 2006 from the Tsinghua University, majoring in physics. In addition she also studied Astrophysics at Tsinghua Centre, ultimately earning a PhD from the School of Economics and Management. As a student, she won first prize in the fourth New Concept writing competition and the first Novoland essay contest. The English translation of her short story \"Folding Beijing\" earned Hao her first Hugo Award for Best Novelette at the 74th World Science Fiction Convention in 2016. Her published work includes two full-length novels, Wandering Earth and Born in 1984, short stories collections The Depth of Loneliness and To Go the Distance, and the essay collection Europe within Time.\nBorn in China and raised in the United States, Carmen Yiling Yan was first driven to translation in high school by the pain of reading really good stories and being unable to share them. Since then, her translations of Chinese science fiction have been published in Clarkesworld, Lightspeed, and Galaxy’s Edge, as well as numerous anthologies. She graduated from UCLA with a degree in Computer Science, but writes more fiction than code these days. She currently lives in the Midwest.", "source": "https://clarkesworldmagazine.com/hao_10_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Summer at Grandma's House by Hao Jingfang, translated by Carmen Yiling Yan"}