{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Eric Schwitzgebel", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "jbWAfSFnnFuT5Qm6SiI4DZlbi8c=", "id": null, "license": null, "comments": "", "raw_text": "4340 words, short story  Fish Dance  Falling. Rebecca and I are falling. My daughter and I—so high it seems impossible that we could survive. We are in the back seat of a taxi that has somehow unhitched from its arcing track between the skyscrapers.  Theory 1: Your last thought is your least important. It is a dead-end wisp that will vanish in an instant, with no effect on anything. Theory 2: Your last thought is the secret culmination of your life, potentially altering the significance of everything that came before. You might affirm it all, regret it all, have that final moment of redemptive insight. Theory 3: Your last thought is an opportunity—your one chance to undergo an intriguing death experience, maybe an overdose of an amazing drug, maybe the feeling of surrendering to the sea in a storm against the cliffs.  The wind mounted as we fell, whistling fearfully through the door frame. Rebecca floated, eyes closed—angelic? mermaidine?—left hand pressed against the dashboard, a dancer mid-air, school uniform and black hair billowing. Her right hand brushed the taxi’s soft inter-Face, which wore an expression I had never before seen in an AI. Could a taxi know enough to fear death?  I wanted to reach toward Rebecca, hold her, make my last thought a thought for her. She was drifting toward me, her book bag elevating off her lap as her legs straightened. But my arms would not respond. I looked down at them, and they seemed foreign objects. Instead of love, I thought, my final thought would be that my final thought would be of final thoughts instead of love.  I woke sweetly relaxed, tingly in the head, vacant elsewhere. I opened and closed my mouth, shaping a groan. It seemed somehow the perfect groan, with a new interesting harmony from my chest cavity. The worried nurse who entered my field of view was the perfect nurse. Then came the perfect CEO of St. Vincent’s Northeast, some perfect lawyers, my wife Sara with my perfect teenage son Abe—a team of angels drifting through honey!  “R-?” I had overestimated the power of gravity, so maybe she was here too?  Sara paused, then looked toward the blank wall to her right, maybe flinching away from me a little—but beautiful, how the hospital lights brightened her cheeks!—then she slightly shook her head. “No.”  Abe wouldn’t look at me either. His face was swollen, tense, tear-glazed.  The expected sadness didn’t arrive. My guts didn’t twist, my stomach didn’t sicken, my throat didn’t ache. Instead I thought: No adulthood could have made Rebecca more complete. Brevity is beautiful. A Chopin etude. To want it to continue past its final note would be a failure of understanding. Or rather, the wanting is itself the very coda that perfects it.  Then I thought: What are these tingly drugs? I imagine saving my grief in a glass box; my future sadness will finalize this perfection. The power button on the back of the nurse’s P.A.D. is therefore the ideal button! It is the circular mandala of the universe itself. The mandala swirled and grew, a spiraling tint across the hospital room.  . . . ~ the procedure must be entirely voluntary ~ . . . said the CEO?  Something about cost-benefit analysis, something about the price of the equipment behind me which I pictured blooming like ten thousand flowers, something about insurance limits, my irreparable body, about a magnificent new Christian mission . . . since I was an engineering professor at Loyola I would understand risk ratios—the words swam from his mouth like slow fish—expected utilities, why they couldn’t pay for even one more day unless I committed to—?  Theory 4: Cost-benefit analysis is the holiest of all things. It is the pinnacle of human wisdom and I the golden sacrifice upon it. I luxuriated in my magnanimity.  ~ It must be entirely voluntary [fish-voice] but it will . . . three months at a million a day . . . you must not change your mind ~  Sara’s face was the perfect riddle! I nodded because dead-Rebecca had tied an invisible ribbon to my chin. And I continued to nod as I watched Sara’s hand guide mine across form after form thrust before me by the magical lawyers, and then the Cardinal of Los Angeles arrived!  The Cardinal’s dark sad face. Her swooping glorious Earth-angel red.  In my dream, the disciples were not lined up all on one side, but jammed together around a small round table in a dark room, noisy, arguing. I was leaning in toward Jesus, near his yellow ear, smelling someone’s sour feet. “You don’t even exist!” I hollered.  “You’ll give me a 10% credence, Isaac my baby,” he said. “11.3% after this dream.”  “Rebecca?” I asked.  “Simply multiply!” Jesus said, tearing a piece off the suddenly-paper tablecloth and scribbling illegible figures on it with a chewed plastic pen.  “10% times infinitude, 90% times void,” I figured.  “Plus 1% times everything else,” Jesus suggested, while another disciple bumped an elbow against his head, sloshing bad wine down the side of Our Savior’s (10%) face.  “Z% times infinitude is . . . ”  “A very large expectation!” said 10% Jesus, tearing off a new strip of paper for me, eyelash thin but infinitely long.  The drugs diminished and I crashed down into pain and grief. The drugs returned and I soared up again. Rebecca was a tombstone crushing me, which I couldn’t see past, then the stone became helium and the world fell away beneath us, a tiny thing—but where was her face?  Per the agreement, I would be amputated, sliced, and sacrificed. My recorded cognitive patterns would become the template for a new type of AI. Engineers measured my head, opened my skull, crusted my brain with devices, rerouted my facial nerves. They peeled back my cheeks and worked electronics up through my sinuses. In a certain subclass of my high moods, I nerded out with them, listening to their plans to scan and prep and slice my brain.  The best AI can’t be built from scratch. It needs a scanned human brain as template. A fully detailed scan is fatal, exposing the brain slice by slice—and even so the quality is too poor to transfer the whole personality and intelligence.  It would have been too expensive to keep me alive anyway, with my irreparably damaged body. And the Church had an intriguing plan for a new type of sacramental AI. There’d be weeks of prep, preliminary nonfatal scans, arguing about design, a bit of theology on the side.  A keyboard was mounted on a metal arm below my face to the right. I could flick my eyes from key to key, and my eye-tracker would detect the motions, then three blinks to send. In this way, I learned to speak in a slow, synthetic voice.  They replaced my body with a shapeless tangle of iridescent nanocarbon pipes and plastic bags. I became only a head, transfixed.  When Sara’s belly had just begun to grow with the thing that would become Abe, we visited a friend of hers in Guadalajara, who had a giant tank of tropical fish.  “Viven en el paraíso,” said the friend, Sun-yi. Sunny. They live in paradise.  “Pero no son peces,” said Sara. But they are not fish. Sara switched to English, “They are only fragments of fish. They don’t encounter a full world. There’s no risk, no learning, no choice, no gain or loss. You’ve taken demented slices of fish and put them on loop.”  “They are happy,” said Sunny, touching the aquarium glass with two long fingers. “You need suffering? You need la vida complicada?” You need a complicated life?  Sara looked at me, but I declined to take sides. “I propose a fish sacrifice,” I said. “For their sins, they can suffer vicariously tonight. We will crucify some tilapia upon the dinner plate.”  After Sara was asleep, I sat in the friend’s living room, watching the fish in the dim light. I could hear a bed squeaking two rooms down—Sunny enjoying a slice of bliss with the short middle-aged man the restaurant had sent over with the tilapia.  A demon bit through my phantom left leg, just above the knee. I contorted my face, though lacking lungs the loudest noise I could make was tooth clacking.  Sara lifted a wormlike tube from the rack beneath me, squinting as if trying to puzzle it out. “This here is the torture-pain tube,” she said. “Part 673HB1.2.9a6, delivered on rush from the eighth plane of Hell. The doctor installed it because she wishes she could have more anal sex but her husband isn’t up to the job.”  The white nurse by the white sink held up a bright red bag. A margin of electric hostility seemed to separate Sara and her, who never acknowledged each other. “Now, Professor Isaac,” the nurse said, “you’re ready for your new nanites, aren’t you?” The nurse’s blue-gloved hands reached past my face to the apparatus behind me, then returned holding a mostly empty bag.  Tomorrow’s bags hung from her cart in a line, whatever was in them waiting to become a piece of me. Red? Black? Sad? Lucid?  Abe had been teaching himself the philosophical literature on personal identity and artificial intelligence. “It will totally be you, Dad!” he said. “It’s the future of AI. The Church is really doing it. They’re cutting edge; they’re pouring an ocean of money into it. Way better than a taxi AI, way better, Dad, nothing like a cleaning bot!” Abe looked a little guiltily down at the cleaning bot who happened to be polishing the floor at that moment, but the bot’s inter-Face smiled easily up at us.  “Hello,” it said.  Abe continued, “Those future people in the rosary beads will have your memories, Dad. They’ll be real people, really conscious. And just like you’re the same person as that ten-year-old kid on the skateboard thirty-five years ago—just like that, those people will be you. They’ll remember me, they’ll remember Mom, they’ll remember this. Some of this. Some. Enough. Think, Dad. A billion years of joy in millions of bodies! Who needs Heaven? You’ll still be going long after I’m dead, long after my eighty-greats-grandchildren are dead! You, the eternal twenty-five-year-old, remembering Mom and me, and Becca. Doing whatever you want in that bead—blissing out, flying, whatever—no pain at all! Crap, Dad, I’m totally jealous. I want to be the one in the crash, doing this, becoming a new template mind.”  “Bot, stop cleaning a minute,” I had my synthetic voice say.  “Yes, Professor Lee,” the bot said, smiling again.  “How much do you remember of your old life?” I asked.  The bot’s inter-Face frowned slightly. “I am instructed not to answer that question.”  “What caused the dissolution of the United States?”  “That topic exceeds my parameters,” the bot said, frowning again. Two feathery dusters unfolded from its sides like arms and it spun them idly.  “Dad,” interjected Abe. “It won’t be like that. Slicing up prisoners’ brains is the old tech. Those old templates for limited AI, that’s exactly what the Church is finally moving past! You’ll be general AI, with real self-awareness. No cognitive constraints. Not like them. Not like the old stuff.”  I pictured the taxi’s inter-Face, as we were falling. “In a tiny world,” I said.  “How big does a world have to be, Dad? What’s wrong with a rosary bead? Plus, there’ll be millions of you everywhere!”  Sara said nothing, seeming to be checking mail or something else on her P.A.D. But after Abe had gone back to school, she leaned toward my left ear and whispered, “Isaac, we’re going to replace your body and screw the Church.” Straightening back up, she raised her middle fingers and waggled them in front of my face.  “Do you envy the fish?” Sunny had whispered in my ear, touching my shoulder, that night in Guadalajara.  I had fallen asleep on the soft leather couch. I was dazed with sleep and wine, excited from dream. Slowly, Sunny’s hand slid down my chest.  Theory 5: I would have let her take me that night, had fear and shame not immobilized me from the neck down. 5A: And that would have been a good thing. 5B: It would have been a terrible thing. The equation will not stay put.  In the vids, the Cardinal had a way of shifting her lips contemplatively to the left. Tall, Jamaican-accented, in the brilliant color of her rank, she praised the courage of the twelve volunteers. She emphasized that although the beings in the rosary beads would be as capable of pleasure as any animal, only God could create genuine eternal souls. The optional new beads would only add a modern variation to traditional atonement—like caring for a plant or puppy to help redeem one’s sin, but in a certain way much better because of the vast potential pleasure the new AIs would experience. From human sin, AI ecstasy. I watched on repeat as my medications rose and fell, and the videos took very different shape depending on my mood. She was visionary saint. She was thin claw of the devil.  Sara clicked off the video. “We’ve got six weeks!” she said. “Is that what you’re going to do?”  My synthetic voice: “What else I do?”  Sara uttered some un-Churchy words. Then, pointing right between my eyes: “I’m working on it. Don’t go permanently fishy-brained on me, Isaac.”  Commentators speculated about the Rosary Project. The Church would rack a huge profit, some said. The (supposedly) Free City of Los Angeles would come even more under its domination. Sinners would count and spin beads, launching tiny new worlds. Later they would watch the worlds they’d booted, adjust the parameters of their creations, manipulate a limited range of events, maybe experience their creations through immersive virtual reality. There would be collectible sets and unique beads with rising aftermarket value. The two most addictive ideas in history, religion and video-gaming, would finally become one.  The worlds would tick on and on, unstoppable once launched—worlds of unmixed, repeating joy for the AIs within them. But could an AI really feel joy? Or was it always only outward show? If Jack the Ripper had only launched enough tiny worlds, would he have been a benevolent man in sum?  Sara sat on a rolling stool, leaning toward me, her graying brown hair falling across her right eye, in that way it always did. She spoke steadily to me, focusing me, redirecting my mind, steering me back from hallucinatory drift. She spoke about the past, about people we knew, about the insane dance parties we’d thrown in grad school, about history and politics, about the time our car stalled in the mountain blizzard and we had to sleep in the back while the battery ran to zero, about the fuzzy purple stuffed bear Rebecca had loved, about the beauty of her brief life remembered.  Abe brought pizza slices and kimchee and said ease up, Mom.  But Abe pressed too, in his own way. He’d given me video glasses with articles I could read just by flicking my eyes. With a lop-sided smile, he’d unzip his hoodie to show me some retro t-shirt, then he’d slip a little stick gently into the top of my glasses—always the latest bit of AI enthusiasm. He’d pretend to ignore me and he’d fold his thin body into the soft guest recliner and do homework on his P.A.D. or text his boyfriend.  When the meds flowed high I was too scatterbrained to read Abe’s articles and they seemed pointless, unwise—why should I care if it would be me in that bead, truly uploaded? My life is but a tiny concern beside creation! Nothing could be more beautiful than my sweaty, rumpled son and his unknown future. When my meds crashed me down I couldn’t bear to read the articles and they seemed pointless and unwise in an entirely different way—the AIs would be mere demented monsters to profit the Church. In still other moods, escape to a synthetic uncomplicated Heaven was exactly what I craved. I couldn’t tell which of the shifting attitudes constituted my true opinion.  “Humanity, Dad. How much longer do we have? Really?” Abe was showing me a vid on his P.A.D. of the war in Europe. “But these beads are gonna be frickin indestructible—millions of years, solid state, no moving parts. Tiny fusion core. You are the future, Dad, my only faith, the only promise from the Halls of Power that I believe.”  Sara didn’t comment on Abe’s articles. None of the crap about uploading for her. She was a brain and body girl. A dancer. A dancer in her youth at least.  When had we last danced?  A picnic beneath mountain oaks. Abe, Rebecca, Sara, and me. A stained plastic tablecloth, dry cheese, plastic knives, guava juice for the kids, Chianti for the grown-ups in blue fiber cups. Figs, rye bread. Barely visible over the crest of the hill behind Sara, taxis arcing along the upper San Gabriel track. A honey-colored insect that I’d let wiggle off with a crumb. Prickers in my socks.  Two hundred students in the auditorium: Introduction to Mechanical Engineering. Unexpectedly, I see Sara at the top of the left stairway among the seats, near the entry door, faintly smiling, arms crossed, long-stemmed tulips jutting from one hand, for me I think. I will soon learn why. She is pregnant with Rebecca.  Rebecca and me on our hard faux-wood apartment floor, playing cards. Her jack of spades takes my ten of hearts.  Rebecca and me behind a low planter in the 104th floor garden, pretending to hide from love-goblins.  Abe dancing with his school trophy for overall academic achievement in seventh grade, Rebecca dancing with him in contagious joy. “Beck-o! Sis-o!” He whoops and slaps her hand. “Beck-OH!”  What is marriage, Sara? You grow together, repeating the days. Something deepens. Something fades.  Love’s ten thousandth kiss.  If I had millions of parallel lives, each lasting millions of subjective years, in simple, repeating worlds of size X, what would I want? Anything compatible with the doctrines of the Church. A timeless library? Mountain trees and sunsets? An endless day on the beach? Small psychological adjustments would ensure that these delights never grew tiresome.  I chose to dance. My perfect dance floor. My ideal partners—versions of Sara, younger, when we first met, in our wild nighttime exuberances. I would dance with ghosts of the Sara who had once electrified me. Or maybe only my demented descendants would dance, spawned off templates from my sacrificed brain, not really me. Or only seem to dance?  My seeming dance partners would be crafted partly from our old photos and my verbalized memories, but also from new videos of Sara. The engineers would capture her shape, her movements, her style, and seed a range of Sara-sprites for my dance world.  The engineers placed a camera between my eyes.  Sara danced right there in the hospital room, everyone watching, even Grumpy Nurse, even some random old man with a hospital gown and rolling I.V. pole. Abe had his P.A.D. hooked to some ferocious little speakers. “Go, Dad!” he said, as if I was the one doing anything.  While Sara danced she pierced me with a stare so intense I couldn’t fathom what was behind it—as if she could will me back from death.  Ten-percent Jesus was slow-dancing with little Rebecca, both of them dirty-footed, lovers in some Heaven that looked like a cramped stonewall restaurant.  Rebecca turned to look at me, still dancing. “Daddy, does this card mean I will live forever?” Her right hand was holding a playing card, its face toward me. It was the terrified inter-Face of the taxi AI.  From the ragged bottom of Jesus’ tunic, long ribbons tapered. Did they simplify as they approached their asymptotes?  “The sum might be divergent,” I answered.  “Eternity,” whispered 10% Jesus, leaning to touch his damp forehead against mine, “is precisely like a melon. Repetitive! Forgetful. Is that why the Cardinal loves it so?”  “Isaac?”  I opened my eyes.  “Isaac. Fishy-head.” Sara whispering.  For a moment I thought I had arms and feet and tried to move them. Then I had tangled hallucinatory arms and feet that would not uncramp. Becca?  In the dim nighttime hospital light, Sara introduced a new doctor, who leaned over me with a syringe. Soon I was high again, this time in a different way. The doctor and his assistant began to detach me from the larger equipment, began to load my tubes and bags into a cart. Sara explained that they had an experimental plan to re-embody me. I saw no St. Vincent nurses. I soared higher. Colors and sounds and tastes blurred into each other. New indescribably beautiful galaxies of consciousness were invented, and time stretched out to Hubble lengths—or so it seemed to me.  I woke in an antique gas-powered ambulance, rumbling somewhere. I saw Abe, Sara, a piece of the new doctor. I held only a remnant of my previous high, and I longed to soar again. The ambulance stopped and idled.  Abe looked nauseous. “The Church is looking for us, Dad,” he said. “The phones and AIs and webbed electronics are all off, so they can’t trace us.”  My keyboard and voice synthesizer were gone. I looked at Sara.  “Fifty-fifty,” she said. “Fifty-fifty. But that’s better than certain death.”  A bug with shiny red wings crawled on the metal wall behind her.  “Not death, Mom,” Abe said.  Abe’s P.A.D. was on the seat by his thigh, where Sara and the doctor couldn’t see. Abe’s thumb was near the power button.  “We need you,” Sara said. “We’re going to Oakland. Abe and I need you. You need to live, be a father again, a professor again. We need to walk in the mountains again. We need to sip espresso by a garden again, people-watching and making snide remarks. You need to help us remember Rebecca. We need to bake bread and drink wine at midnight.”  I could feel my mood descending further, hallucinatory viscera twisting into my consciousness. A father to whom? To the ghost of Rebecca? To Abe, who would rather send me off? A husband why?  The ambulance revved up, and their human bodies swayed with the ride. Sara threw words of life at me, but they hazed and fuzzed . . . ~ spinal splice . . . nanite stem cells . . . installed with growth casings the new apartment . . . short roll two Shattuck Line you learn . . . ~ Boo woo, boo boo wooh?  Theory 6: You need suffering? You need la vida complicada?  Theory 7: These beads are gonna be frickin indestructible. You are the future, Dad, my only faith, the only promise from the Halls of Power that I believe.  I fixed my gaze on Abe’s power button. I flicked my eyes up, down, left, right—the cross. Up, down, left, right again. Looking at the power button, the thumb. The location tracking software. Abe will understand.  Sara’s voice, too harsh: “Isaac, what are you doing?”  Up, down, left, right.  The world is graying . . .  Abe’s thumb falls the decisive half inch, and the ten thousand satellite eyes of Heaven turn silently toward us.  Rebecca cups a brown bead in her right hand. We’re in the stone restaurant. 10% Jesus is sitting at a little wooden piano in the corner, rifling through a scruffy sheaf of sheet music Saint Peter has just given him. I lean down close toward Rebecca’s bead. Rebecca raises her hand, pressing the bead through my forehead.  I’m on a glittering modern dance floor. Red lights pulse with the rhythms. A beautiful woman spins before me in flat shoes and green blooming dress, her brow furious with concentration, her gaze intense. She points her left forefinger toward me. She twirls and stops, twirls and stops, each time advancing a little closer, her eyes coming round to fix me more ferociously with each spin. Have I seen her before? S- S- Sarai? Who was I dancing with yesterday?  A vortex of carbon-tube tropical fish erupts around us, swimming mid-air, twisting their fins. The woman steps suddenly, surprisingly near. For a long moment, her face and body are a tantalizing electric half-inch from mine. She raises a shoulder, lowers a hip, so close, without touching, and stares straight into my eyes. She leans forward and our bodies meet. How can I explain the tingle, the fizz that fills me—love’s first kiss, in that moment when you briefly know that the world has become perfect. The bass line surges and deepens. A greater joy than this, I could not imagine. Everything is glass except us at this moment, the lantern center.  Then some fragments of memories I don’t understand—a picnic, two children dancing with a trophy, a man and girl playing cards.  I am back in the stone restaurant.  “Is that me?”  I look around, and everything is dust. Humanity is long since extinct.  I wake again. The hospital room is dark. Now there is a guard.  The Cardinal’s two long fingers reaching forward. I feel them touch my eyes, ears, nostrils, lips, her unction oil wet on my face, wooden crucifix dancing as she leans, a bass line of thumping rhythms from the machines.  She is chanting a Latin prayer. She presses her soft lips to my forehead and whispers, “Only what is corrupt and changeable dies.”  Her red gown backs away and I see Sara’s face, not in person—she is only a thin vid on Abe’s P.A.D. ~ from, from? Jumpsuit orange.  ~ the newsfeeds, Dad . . . said they’d give Mom leniency ~  Abe is kneeling, shaking. Crying?  ~ going to a better place, Dad ~  Abe’s P.A.D. falls from his shaking hands. Flat slice of video-Sara rotating toward the floor, fish-slow. Something black covers my eyes and the noise of the slicer is suddenly loud ~  One piece reflects on the unusual sensation of having one’s brain pulled apart. One piece gives a loving last thought to Rebecca and Sara and Abe. Another piece dances away, ecstatic, forgetting.  These pieces do not know each other. Maybe one of them is me.  Eric Schwitzgebel is a professor of philosophy at University of California, Riverside, and a cooperating member of UCR's program in Speculative Fiction and Cultures of Science. His short fiction has appeared in Clarkesworld, F&SF, Nature, Weird Tales, Apex, Unlikely Story, The Dark, and elsewhere. His third non-fiction book, A Theory of Jerks and Other Philosophical Misadventures is forthcoming with MIT Press later this year. At his blog, The Splintered Mind, he posts regularly on issues at the intersection of philosophy, psychology, and speculative fiction.", "text": "4340 words, short story\nFish Dance\nFalling. Rebecca and I are falling. My daughter and I—so high it seems impossible that we could survive. We are in the back seat of a taxi that has somehow unhitched from its arcing track between the skyscrapers.\nTheory 1: Your last thought is your least important. It is a dead-end wisp that will vanish in an instant, with no effect on anything. Theory 2: Your last thought is the secret culmination of your life, potentially altering the significance of everything that came before. You might affirm it all, regret it all, have that final moment of redemptive insight. Theory 3: Your last thought is an opportunity—your one chance to undergo an intriguing death experience, maybe an overdose of an amazing drug, maybe the feeling of surrendering to the sea in a storm against the cliffs.\nThe wind mounted as we fell, whistling fearfully through the door frame. Rebecca floated, eyes closed—angelic? mermaidine?—left hand pressed against the dashboard, a dancer mid-air, school uniform and black hair billowing. Her right hand brushed the taxi’s soft inter-Face, which wore an expression I had never before seen in an AI. Could a taxi know enough to fear death?\nI wanted to reach toward Rebecca, hold her, make my last thought a thought for her. She was drifting toward me, her book bag elevating off her lap as her legs straightened. But my arms would not respond. I looked down at them, and they seemed foreign objects. Instead of love, I thought, my final thought would be that my final thought would be of final thoughts instead of love.\nI woke sweetly relaxed, tingly in the head, vacant elsewhere. I opened and closed my mouth, shaping a groan. It seemed somehow the perfect groan, with a new interesting harmony from my chest cavity. The worried nurse who entered my field of view was the perfect nurse. Then came the perfect CEO of St. Vincent’s Northeast, some perfect lawyers, my wife Sara with my perfect teenage son Abe—a team of angels drifting through honey!\n“R-?” I had overestimated the power of gravity, so maybe she was here too?\nSara paused, then looked toward the blank wall to her right, maybe flinching away from me a little—but beautiful, how the hospital lights brightened her cheeks!—then she slightly shook her head. “No.”\nAbe wouldn’t look at me either. His face was swollen, tense, tear-glazed.\nThe expected sadness didn’t arrive. My guts didn’t twist, my stomach didn’t sicken, my throat didn’t ache. Instead I thought: No adulthood could have made Rebecca more complete. Brevity is beautiful. A Chopin etude. To want it to continue past its final note would be a failure of understanding. Or rather, the wanting is itself the very coda that perfects it.\nThen I thought: What are these tingly drugs? I imagine saving my grief in a glass box; my future sadness will finalize this perfection. The power button on the back of the nurse’s P.A.D. is therefore the ideal button! It is the circular mandala of the universe itself. The mandala swirled and grew, a spiraling tint across the hospital room.\n. . . ~ the procedure must be entirely voluntary ~ . . . said the CEO?\nSomething about cost-benefit analysis, something about the price of the equipment behind me which I pictured blooming like ten thousand flowers, something about insurance limits, my irreparable body, about a magnificent new Christian mission . . . since I was an engineering professor at Loyola I would understand risk ratios—the words swam from his mouth like slow fish—expected utilities, why they couldn’t pay for even one more day unless I committed to—?\nTheory 4: Cost-benefit analysis is the holiest of all things. It is the pinnacle of human wisdom and I the golden sacrifice upon it. I luxuriated in my magnanimity.\n~ It must be entirely voluntary [fish-voice] but it will . . . three months at a million a day . . . you must not change your mind ~\nSara’s face was the perfect riddle! I nodded because dead-Rebecca had tied an invisible ribbon to my chin. And I continued to nod as I watched Sara’s hand guide mine across form after form thrust before me by the magical lawyers, and then the Cardinal of Los Angeles arrived!\nThe Cardinal’s dark sad face. Her swooping glorious Earth-angel red.\nIn my dream, the disciples were not lined up all on one side, but jammed together around a small round table in a dark room, noisy, arguing. I was leaning in toward Jesus, near his yellow ear, smelling someone’s sour feet. “You don’t even exist!” I hollered.\n“You’ll give me a 10% credence, Isaac my baby,” he said. “11.3% after this dream.”\n“Rebecca?” I asked.\n“Simply multiply!” Jesus said, tearing a piece off the suddenly-paper tablecloth and scribbling illegible figures on it with a chewed plastic pen.\n“10% times infinitude, 90% times void,” I figured.\n“Plus 1% times everything else,” Jesus suggested, while another disciple bumped an elbow against his head, sloshing bad wine down the side of Our Savior’s (10%) face.\n“Z% times infinitude is . . . ”\n“A very large expectation!” said 10% Jesus, tearing off a new strip of paper for me, eyelash thin but infinitely long.\nThe drugs diminished and I crashed down into pain and grief. The drugs returned and I soared up again. Rebecca was a tombstone crushing me, which I couldn’t see past, then the stone became helium and the world fell away beneath us, a tiny thing—but where was her face?\nPer the agreement, I would be amputated, sliced, and sacrificed. My recorded cognitive patterns would become the template for a new type of AI. Engineers measured my head, opened my skull, crusted my brain with devices, rerouted my facial nerves. They peeled back my cheeks and worked electronics up through my sinuses. In a certain subclass of my high moods, I nerded out with them, listening to their plans to scan and prep and slice my brain.\nThe best AI can’t be built from scratch. It needs a scanned human brain as template. A fully detailed scan is fatal, exposing the brain slice by slice—and even so the quality is too poor to transfer the whole personality and intelligence.\nIt would have been too expensive to keep me alive anyway, with my irreparably damaged body. And the Church had an intriguing plan for a new type of sacramental AI. There’d be weeks of prep, preliminary nonfatal scans, arguing about design, a bit of theology on the side.\nA keyboard was mounted on a metal arm below my face to the right. I could flick my eyes from key to key, and my eye-tracker would detect the motions, then three blinks to send. In this way, I learned to speak in a slow, synthetic voice.\nThey replaced my body with a shapeless tangle of iridescent nanocarbon pipes and plastic bags. I became only a head, transfixed.\nWhen Sara’s belly had just begun to grow with the thing that would become Abe, we visited a friend of hers in Guadalajara, who had a giant tank of tropical fish.\n“Viven en el paraíso,” said the friend, Sun-yi. Sunny. They live in paradise.\n“Pero no son peces,” said Sara. But they are not fish. Sara switched to English, “They are only fragments of fish. They don’t encounter a full world. There’s no risk, no learning, no choice, no gain or loss. You’ve taken demented slices of fish and put them on loop.”\n“They are happy,” said Sunny, touching the aquarium glass with two long fingers. “You need suffering? You need la vida complicada?” You need a complicated life?\nSara looked at me, but I declined to take sides. “I propose a fish sacrifice,” I said. “For their sins, they can suffer vicariously tonight. We will crucify some tilapia upon the dinner plate.”\nAfter Sara was asleep, I sat in the friend’s living room, watching the fish in the dim light. I could hear a bed squeaking two rooms down—Sunny enjoying a slice of bliss with the short middle-aged man the restaurant had sent over with the tilapia.\nA demon bit through my phantom left leg, just above the knee. I contorted my face, though lacking lungs the loudest noise I could make was tooth clacking.\nSara lifted a wormlike tube from the rack beneath me, squinting as if trying to puzzle it out. “This here is the torture-pain tube,” she said. “Part 673HB1.2.9a6, delivered on rush from the eighth plane of Hell. The doctor installed it because she wishes she could have more anal sex but her husband isn’t up to the job.”\nThe white nurse by the white sink held up a bright red bag. A margin of electric hostility seemed to separate Sara and her, who never acknowledged each other. “Now, Professor Isaac,” the nurse said, “you’re ready for your new nanites, aren’t you?” The nurse’s blue-gloved hands reached past my face to the apparatus behind me, then returned holding a mostly empty bag.\nTomorrow’s bags hung from her cart in a line, whatever was in them waiting to become a piece of me. Red? Black? Sad? Lucid?\nAbe had been teaching himself the philosophical literature on personal identity and artificial intelligence. “It will totally be you, Dad!” he said. “It’s the future of AI. The Church is really doing it. They’re cutting edge; they’re pouring an ocean of money into it. Way better than a taxi AI, way better, Dad, nothing like a cleaning bot!” Abe looked a little guiltily down at the cleaning bot who happened to be polishing the floor at that moment, but the bot’s inter-Face smiled easily up at us.\n“Hello,” it said.\nAbe continued, “Those future people in the rosary beads will have your memories, Dad. They’ll be real people, really conscious. And just like you’re the same person as that ten-year-old kid on the skateboard thirty-five years ago—just like that, those people will be you. They’ll remember me, they’ll remember Mom, they’ll remember this. Some of this. Some. Enough. Think, Dad. A billion years of joy in millions of bodies! Who needs Heaven? You’ll still be going long after I’m dead, long after my eighty-greats-grandchildren are dead! You, the eternal twenty-five-year-old, remembering Mom and me, and Becca. Doing whatever you want in that bead—blissing out, flying, whatever—no pain at all! Crap, Dad, I’m totally jealous. I want to be the one in the crash, doing this, becoming a new template mind.”\n“Bot, stop cleaning a minute,” I had my synthetic voice say.\n“Yes, Professor Lee,” the bot said, smiling again.\n“How much do you remember of your old life?” I asked.\nThe bot’s inter-Face frowned slightly. “I am instructed not to answer that question.”\n“What caused the dissolution of the United States?”\n“That topic exceeds my parameters,” the bot said, frowning again. Two feathery dusters unfolded from its sides like arms and it spun them idly.\n“Dad,” interjected Abe. “It won’t be like that. Slicing up prisoners’ brains is the old tech. Those old templates for limited AI, that’s exactly what the Church is finally moving past! You’ll be general AI, with real self-awareness. No cognitive constraints. Not like them. Not like the old stuff.”\nI pictured the taxi’s inter-Face, as we were falling. “In a tiny world,” I said.\n“How big does a world have to be, Dad? What’s wrong with a rosary bead? Plus, there’ll be millions of you everywhere!”\nSara said nothing, seeming to be checking mail or something else on her P.A.D. But after Abe had gone back to school, she leaned toward my left ear and whispered, “Isaac, we’re going to replace your body and screw the Church.” Straightening back up, she raised her middle fingers and waggled them in front of my face.\n“Do you envy the fish?” Sunny had whispered in my ear, touching my shoulder, that night in Guadalajara.\nI had fallen asleep on the soft leather couch. I was dazed with sleep and wine, excited from dream. Slowly, Sunny’s hand slid down my chest.\nTheory 5: I would have let her take me that night, had fear and shame not immobilized me from the neck down. 5A: And that would have been a good thing. 5B: It would have been a terrible thing. The equation will not stay put.\nIn the vids, the Cardinal had a way of shifting her lips contemplatively to the left. Tall, Jamaican-accented, in the brilliant color of her rank, she praised the courage of the twelve volunteers. She emphasized that although the beings in the rosary beads would be as capable of pleasure as any animal, only God could create genuine eternal souls. The optional new beads would only add a modern variation to traditional atonement—like caring for a plant or puppy to help redeem one’s sin, but in a certain way much better because of the vast potential pleasure the new AIs would experience. From human sin, AI ecstasy. I watched on repeat as my medications rose and fell, and the videos took very different shape depending on my mood. She was visionary saint. She was thin claw of the devil.\nSara clicked off the video. “We’ve got six weeks!” she said. “Is that what you’re going to do?”\nMy synthetic voice: “What else I do?”\nSara uttered some un-Churchy words. Then, pointing right between my eyes: “I’m working on it. Don’t go permanently fishy-brained on me, Isaac.”\nCommentators speculated about the Rosary Project. The Church would rack a huge profit, some said. The (supposedly) Free City of Los Angeles would come even more under its domination. Sinners would count and spin beads, launching tiny new worlds. Later they would watch the worlds they’d booted, adjust the parameters of their creations, manipulate a limited range of events, maybe experience their creations through immersive virtual reality. There would be collectible sets and unique beads with rising aftermarket value. The two most addictive ideas in history, religion and video-gaming, would finally become one.\nThe worlds would tick on and on, unstoppable once launched—worlds of unmixed, repeating joy for the AIs within them. But could an AI really feel joy? Or was it always only outward show? If Jack the Ripper had only launched enough tiny worlds, would he have been a benevolent man in sum?\nSara sat on a rolling stool, leaning toward me, her graying brown hair falling across her right eye, in that way it always did. She spoke steadily to me, focusing me, redirecting my mind, steering me back from hallucinatory drift. She spoke about the past, about people we knew, about the insane dance parties we’d thrown in grad school, about history and politics, about the time our car stalled in the mountain blizzard and we had to sleep in the back while the battery ran to zero, about the fuzzy purple stuffed bear Rebecca had loved, about the beauty of her brief life remembered.\nAbe brought pizza slices and kimchee and said ease up, Mom.\nBut Abe pressed too, in his own way. He’d given me video glasses with articles I could read just by flicking my eyes. With a lop-sided smile, he’d unzip his hoodie to show me some retro t-shirt, then he’d slip a little stick gently into the top of my glasses—always the latest bit of AI enthusiasm. He’d pretend to ignore me and he’d fold his thin body into the soft guest recliner and do homework on his P.A.D. or text his boyfriend.\nWhen the meds flowed high I was too scatterbrained to read Abe’s articles and they seemed pointless, unwise—why should I care if it would be me in that bead, truly uploaded? My life is but a tiny concern beside creation! Nothing could be more beautiful than my sweaty, rumpled son and his unknown future. When my meds crashed me down I couldn’t bear to read the articles and they seemed pointless and unwise in an entirely different way—the AIs would be mere demented monsters to profit the Church. In still other moods, escape to a synthetic uncomplicated Heaven was exactly what I craved. I couldn’t tell which of the shifting attitudes constituted my true opinion.\n“Humanity, Dad. How much longer do we have? Really?” Abe was showing me a vid on his P.A.D. of the war in Europe. “But these beads are gonna be frickin indestructible—millions of years, solid state, no moving parts. Tiny fusion core. You are the future, Dad, my only faith, the only promise from the Halls of Power that I believe.”\nSara didn’t comment on Abe’s articles. None of the crap about uploading for her. She was a brain and body girl. A dancer. A dancer in her youth at least.\nWhen had we last danced?\nA picnic beneath mountain oaks. Abe, Rebecca, Sara, and me. A stained plastic tablecloth, dry cheese, plastic knives, guava juice for the kids, Chianti for the grown-ups in blue fiber cups. Figs, rye bread. Barely visible over the crest of the hill behind Sara, taxis arcing along the upper San Gabriel track. A honey-colored insect that I’d let wiggle off with a crumb. Prickers in my socks.\nTwo hundred students in the auditorium: Introduction to Mechanical Engineering. Unexpectedly, I see Sara at the top of the left stairway among the seats, near the entry door, faintly smiling, arms crossed, long-stemmed tulips jutting from one hand, for me I think. I will soon learn why. She is pregnant with Rebecca.\nRebecca and me on our hard faux-wood apartment floor, playing cards. Her jack of spades takes my ten of hearts.\nRebecca and me behind a low planter in the 104th floor garden, pretending to hide from love-goblins.\nAbe dancing with his school trophy for overall academic achievement in seventh grade, Rebecca dancing with him in contagious joy. “Beck-o! Sis-o!” He whoops and slaps her hand. “Beck-OH!”\nWhat is marriage, Sara? You grow together, repeating the days. Something deepens. Something fades.\nLove’s ten thousandth kiss.\nIf I had millions of parallel lives, each lasting millions of subjective years, in simple, repeating worlds of size X, what would I want? Anything compatible with the doctrines of the Church. A timeless library? Mountain trees and sunsets? An endless day on the beach? Small psychological adjustments would ensure that these delights never grew tiresome.\nI chose to dance. My perfect dance floor. My ideal partners—versions of Sara, younger, when we first met, in our wild nighttime exuberances. I would dance with ghosts of the Sara who had once electrified me. Or maybe only my demented descendants would dance, spawned off templates from my sacrificed brain, not really me. Or only seem to dance?\nMy seeming dance partners would be crafted partly from our old photos and my verbalized memories, but also from new videos of Sara. The engineers would capture her shape, her movements, her style, and seed a range of Sara-sprites for my dance world.\nThe engineers placed a camera between my eyes.\nSara danced right there in the hospital room, everyone watching, even Grumpy Nurse, even some random old man with a hospital gown and rolling I.V. pole. Abe had his P.A.D. hooked to some ferocious little speakers. “Go, Dad!” he said, as if I was the one doing anything.\nWhile Sara danced she pierced me with a stare so intense I couldn’t fathom what was behind it—as if she could will me back from death.\nTen-percent Jesus was slow-dancing with little Rebecca, both of them dirty-footed, lovers in some Heaven that looked like a cramped stonewall restaurant.\nRebecca turned to look at me, still dancing. “Daddy, does this card mean I will live forever?” Her right hand was holding a playing card, its face toward me. It was the terrified inter-Face of the taxi AI.\nFrom the ragged bottom of Jesus’ tunic, long ribbons tapered. Did they simplify as they approached their asymptotes?\n“The sum might be divergent,” I answered.\n“Eternity,” whispered 10% Jesus, leaning to touch his damp forehead against mine, “is precisely like a melon. Repetitive! Forgetful. Is that why the Cardinal loves it so?”\n“Isaac?”\nI opened my eyes.\n“Isaac. Fishy-head.” Sara whispering.\nFor a moment I thought I had arms and feet and tried to move them. Then I had tangled hallucinatory arms and feet that would not uncramp. Becca?\nIn the dim nighttime hospital light, Sara introduced a new doctor, who leaned over me with a syringe. Soon I was high again, this time in a different way. The doctor and his assistant began to detach me from the larger equipment, began to load my tubes and bags into a cart. Sara explained that they had an experimental plan to re-embody me. I saw no St. Vincent nurses. I soared higher. Colors and sounds and tastes blurred into each other. New indescribably beautiful galaxies of consciousness were invented, and time stretched out to Hubble lengths—or so it seemed to me.\nI woke in an antique gas-powered ambulance, rumbling somewhere. I saw Abe, Sara, a piece of the new doctor. I held only a remnant of my previous high, and I longed to soar again. The ambulance stopped and idled.\nAbe looked nauseous. “The Church is looking for us, Dad,” he said. “The phones and AIs and webbed electronics are all off, so they can’t trace us.”\nMy keyboard and voice synthesizer were gone. I looked at Sara.\n“Fifty-fifty,” she said. “Fifty-fifty. But that’s better than certain death.”\nA bug with shiny red wings crawled on the metal wall behind her.\n“Not death, Mom,” Abe said.\nAbe’s P.A.D. was on the seat by his thigh, where Sara and the doctor couldn’t see. Abe’s thumb was near the power button.\n“We need you,” Sara said. “We’re going to Oakland. Abe and I need you. You need to live, be a father again, a professor again. We need to walk in the mountains again. We need to sip espresso by a garden again, people-watching and making snide remarks. You need to help us remember Rebecca. We need to bake bread and drink wine at midnight.”\nI could feel my mood descending further, hallucinatory viscera twisting into my consciousness. A father to whom? To the ghost of Rebecca? To Abe, who would rather send me off? A husband why?\nThe ambulance revved up, and their human bodies swayed with the ride. Sara threw words of life at me, but they hazed and fuzzed . . . ~ spinal splice . . . nanite stem cells . . . installed with growth casings the new apartment . . . short roll two Shattuck Line you learn . . . ~ Boo woo, boo boo wooh?\nTheory 6: You need suffering? You need la vida complicada?\nTheory 7: These beads are gonna be frickin indestructible. You are the future, Dad, my only faith, the only promise from the Halls of Power that I believe.\nI fixed my gaze on Abe’s power button. I flicked my eyes up, down, left, right—the cross. Up, down, left, right again. Looking at the power button, the thumb. The location tracking software. Abe will understand.\nSara’s voice, too harsh: “Isaac, what are you doing?”\nUp, down, left, right.\nThe world is graying . . .\nAbe’s thumb falls the decisive half inch, and the ten thousand satellite eyes of Heaven turn silently toward us.\nRebecca cups a brown bead in her right hand. We’re in the stone restaurant. 10% Jesus is sitting at a little wooden piano in the corner, rifling through a scruffy sheaf of sheet music Saint Peter has just given him. I lean down close toward Rebecca’s bead. Rebecca raises her hand, pressing the bead through my forehead.\nI’m on a glittering modern dance floor. Red lights pulse with the rhythms. A beautiful woman spins before me in flat shoes and green blooming dress, her brow furious with concentration, her gaze intense. She points her left forefinger toward me. She twirls and stops, twirls and stops, each time advancing a little closer, her eyes coming round to fix me more ferociously with each spin. Have I seen her before? S- S- Sarai? Who was I dancing with yesterday?\nA vortex of carbon-tube tropical fish erupts around us, swimming mid-air, twisting their fins. The woman steps suddenly, surprisingly near. For a long moment, her face and body are a tantalizing electric half-inch from mine. She raises a shoulder, lowers a hip, so close, without touching, and stares straight into my eyes. She leans forward and our bodies meet. How can I explain the tingle, the fizz that fills me—love’s first kiss, in that moment when you briefly know that the world has become perfect. The bass line surges and deepens. A greater joy than this, I could not imagine. Everything is glass except us at this moment, the lantern center.\nThen some fragments of memories I don’t understand—a picnic, two children dancing with a trophy, a man and girl playing cards.\nI am back in the stone restaurant.\n“Is that me?”\nI look around, and everything is dust. Humanity is long since extinct.\nI wake again. The hospital room is dark. Now there is a guard.\nThe Cardinal’s two long fingers reaching forward. I feel them touch my eyes, ears, nostrils, lips, her unction oil wet on my face, wooden crucifix dancing as she leans, a bass line of thumping rhythms from the machines.\nShe is chanting a Latin prayer. She presses her soft lips to my forehead and whispers, “Only what is corrupt and changeable dies.”\nHer red gown backs away and I see Sara’s face, not in person—she is only a thin vid on Abe’s P.A.D. ~ from, from? Jumpsuit orange.\n~ the newsfeeds, Dad . . . said they’d give Mom leniency ~\nAbe is kneeling, shaking. Crying?\n~ going to a better place, Dad ~\nAbe’s P.A.D. falls from his shaking hands. Flat slice of video-Sara rotating toward the floor, fish-slow. Something black covers my eyes and the noise of the slicer is suddenly loud ~\nOne piece reflects on the unusual sensation of having one’s brain pulled apart. One piece gives a loving last thought to Rebecca and Sara and Abe. Another piece dances away, ecstatic, forgetting.\nThese pieces do not know each other. Maybe one of them is me.\nEric Schwitzgebel is a professor of philosophy at University of California, Riverside, and a cooperating member of UCR's program in Speculative Fiction and Cultures of Science. His short fiction has appeared in Clarkesworld, F&SF, Nature, Weird Tales, Apex, Unlikely Story, The Dark, and elsewhere. His third non-fiction book, A Theory of Jerks and Other Philosophical Misadventures is forthcoming with MIT Press later this year. At his blog, The Splintered Mind, he posts regularly on issues at the intersection of philosophy, psychology, and speculative fiction.", "source": "https://clarkesworldmagazine.com/schwitzgebel_07_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Fish Dance by Eric Schwitzgebel"}