{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kelly Robson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "qPqvr7q+qBP4RoyChQb+D/+KVMk=", "id": null, "license": null, "comments": "", "raw_text": "14820 words, novelette  We Who Live in the Heart  2018 Finalist: Theodore A. Sturgeon Memorial Award  Ricci slipped in and out of consciousness as we carried her to the anterior sinus and strapped her into her hammock. Her eyelids drooped but she kept forcing them wide. After we finished tucking her in, she pulled a handheld media appliance out of her pocket and called her friend Jane.  “You’re late,” Jane said. The speakers flattened her voice slightly. “Are you okay?”  Ricci was too groggy to speak. She poked her hand through the hammock’s electrostatic membrane and panned the appliance around the sinus. Eddy and Chara both waved as the lens passed over them, but Jane was only interested in one thing.  “Show me your face, Ricci. Talk to me. What’s it like in there?”  Ricci coughed, clearing her throat. “I dunno. It’s weird. I can’t really think.” Her voice slurred from the anesthetic.  I could have answered Jane, if she’d asked me. The first thing newbies notice is how strange it smells. Human olfaction is primal; scents color our perceptions even when they’re too faint to describe. Down belowground, the population crush makes it impossible to get away from human funk. Out here, it’s the opposite, with no scents our brains recognize. That’s why most of us fill our habs with stinky things—pheromone misters, scented fabrics, ablative aromatic gels.  Eventually, Ricci would get around to customizing the scentscape in her big new hab, but right then she was too busy trying to stay awake. Apparently she’d promised Jane she’d check in as soon as she arrived, and not just a quick ping. She was definitely hurting but the call was duty.  “There’s people. They’re taking care of me.” Ricci gazed blearily at our orang. “I was carried in by a porter bot. It’s orange and furry. Long arms.”  “I don’t care about the bot. Tell me about you.”  “I’m fine, but my ears aren’t working right. It’s too noisy.”  We live with a constant circulatory thrum, gassy gurgles and fizzes, whumps, snaps, pops, and booms. Sound waves pulse through every surface, a deep hum you feel in your bones.  Jane took a deep breath, let it out with a whoosh. “Okay. Go to sleep. Call me when you wake up, okay?”  Ricci’s head lolled back, then she jerked herself awake.  “You should have come with me.”  Jane laughed. “I can’t leave my clients. And anyway, I’d be bored.”  Ricci squeezed her eyes shut, blinked a few times, then forced them wide.  “No you wouldn’t. There’s seven other people here, and they’re all nuts. You’d already be trying to fix them.”  Vula snorted and stalked out of the sinus, her long black braids slapping her back. The rest of us just smiled and shook our heads. You can’t hold people responsible for what they say when they’re half-unconscious. And anyway, it’s true—we’re not your standard moles. We don’t want to be.  Only a mole would think we’d be bored out here. We have to take care of every necessity of life personally—nobody’s going to do it for us. Tapping water is one example. Equipment testing and maintenance is another. Someone has to manage the hygiene and maintenance bots. And we all share responsibility for health and safety. Making sure we can breathe is high on everyone’s our priority list, so we don’t leave it up to chance. Finally, there’s atmospheric and geographical data gathering. Mama’s got to pay the bills. We’re a sovereign sociopolitical entity, population: eight, and we negotiate our own service contracts for everything.  But other that, sure, we have all the free time in the world. Otherwise what’s the point? We came out here to get some breathing room—mental and physical. Unlike the moles, we’ve got plenty of both.  Have you ever seen a tulip? It’s a flowering plant. No nutritional value, short bloom. Down belowground, they’re grown in decorative troughs for special occasions—ambassadorial visits, arts festivals, sporting events, that sort of thing.  Anyway. Take a tulip flower and stick an ovoid bladder where the stem was and you’ve got the idea. Except big. Really big. And the petals move. Some of us call it Mama. I just call it home.  The outer skin is a transparent, flexible organic membrane. You can see right through to the central organ systems. The surrounding bladders and sinuses provide structure and protection. Balloons inside a bigger balloon, filled with helium and hydrogen. The whole organism ripples with iridescence.  We live in the helium-filled sinuses. If you get close enough, you can see us moving around inside. We’re the dark spots.  While Ricci slept, I called everyone to the rumpus room for a quick status check. All seven of us lounged in the netting, enjoying the free flowing oxygen/hydrogen mix, goggles and breathers dangling around our necks.  I led the discussion, as usual. Nobody else can ever be bothered.  “Thoughts?” I asked.  “Ricci seems okay,” said Eddy. “And I like what’s-her-name. The mole on the comm.”  “Jane. Yeah, pretty smile,” said Bouche. “Ricci’s fine. Right Vula?”  Vula frowned and crossed her arms. She’d hooked into the netting right next to the hatch and looked about ready to stomp out.  “I guess,” she said. “Rude, though.”  “She was just trying to be funny,” said Treasure. “I can never predict who’ll stick and who’ll bounce. I thought Chara would claw her way back down belowground. Right through the skin and nosedive home.”  Chara grinned. “I still might.”  We laughed, but the camaraderie felt forced. Vula had everyone on edge.  “We’ll all keep an eye on Ricci until she settles in,” Eleanora said. “Are we good here? I need to get back to training. I got a chess tournament, you know.”  “You always have a tournament.” I surveyed the faces around me, but it didn’t look like anyone wanted to chat.  “As long as nobody hogs the uplink, I never have any problems,” said Bouche. “Who’s training Ricci?”  “Who do you think?” I said. We have a rule. Whoever scared off the last one has to train the replacement.  We all looked at Vula.  “Shit,” she said. “I hate training newbies.”  “Stop running them off then,” said Chara. “Be nice.”  Vula scowled, fierce frown lines scoring her forehead. “I’ve got important work to do.”  No use arguing with Vula. She was deep in a creative tangle, and had been for a while.  “I’ll do it,” I said. “We better train Ricci right if we want her to stick.”  When Ricci woke up, I helped her out of the hammock and showed her how to operate the hygiene station. As soon as she’d hosed off the funk, she called Jane on her appliance.  “Take off your breather for a moment,” Jane said. “Goggles too. I need to see your face.”  Ricci wedged her fingernails under the seal and pried off her breather. She lifted her goggles. When she grinned, deep dimples appeared on each cheek.  Jane squinted at her through the screen. She nodded, and Ricci replaced the breather. It attached to her skin with a slurp.  “How do I look?” Ricci asked. “Normal enough for you?”  “What’s the failure rate on that thing?”  “Low,” Ricci said.  Point two three percent. Which is low unless you’re talking about death. Then it’s high. But we have spares galore. Safety nests here, there, and everywhere. I could have chimed in with the info but Jane didn’t want to hear from me. I stayed well back and let Ricci handle her friend.  “Has anyone ever studied the long-term effects of living in a helium atmosphere?” Jane asked. “It can’t be healthy.”  “Eyes are a problem.” Ricci tapped a finger on a goggle lens. “Corneas need oxygen so that’s why we wear these. The hammocks are filled with air, so we basically bathe in oxygen while we’re sleeping. But you’re right. Without that the skin begins to slough.”  Jane made a face. “Ugh.”  “There’s air in the common area, too—they call it the rumpus room. That’s where they keep the fab and extruder. I’m supposed to be there now. I have to eat and then do an orientation session. Health, safety, all that good stuff.”  “Don’t forget to take some time to get to know your hab-mates, okay?”  “I met them when I got here.”  “One of them is Vula, the artist, right? The sculptor. She’s got to be interesting.”  Ricci shrugged. “She looked grumpy.”  I was impressed. Pretty perceptive for someone who’d been half-drowned in anesthetic.  “What’s scheduled after training?”  “Nothing. That’s the whole point of coming here, right?”  “I wondered if you remembered.” A smile broke over Jane’s face, star-bright even when glimpsed on a small screen at a distance. “You need rest and recreation.”  “Relaxation and reading,” Ricci added.  “Maybe you’ll take up a hobby.”  “Oh, I will,” said Ricci. “Count on it.”  Yes, I was spying on Ricci. We all were. She seemed like a good egg, but with no recourse to on-the-spot conflict intervention, we play it safe with newbies until they settle in. Anyone who doesn’t like it can pull down a temporary privacy veil to shield themselves from the bugs, but most don’t bother. Ricci didn’t.  Plus we needed a distraction.  Whether it’s half a million moles in a hole down belowground or eight of us floating around in the atmosphere, every hab goes through ups and downs. We’d been down for a while. Some of it was due to Vula’s growly mood, the worst one we’d seen for a while, but really, we just needed a shake-up. Whether we realized it or not, we were all looking to Ricci to deliver us from ourselves.  During orientation, Ricci and I had company. Bouche and Eddy claimed they needed a refresher and tagged along for the whole thing. Chara, Treasure, and Eleanora joined us halfway through. Even Vula popped out of her hab for a few moments, and actually made an effort to look friendly.  With all the all the chatter and distraction, I wasn’t confident Ricci’s orientation had stuck, so I shadowed her on her first maintenance rotation. The workflow is fully documented, every detail supported by nested step-by-steps and supervised by dedicated project management bugs that help take human error out of the equation. But I figured she deserved a little extra attention.  Life support is our first priority, always. We clear the air printers, run live tests on the carbon dioxide digesters, and ground-truth the readings on every single sensor. It’s a tedious process, but not even Vula complains. She likes to breathe as much as any of us.  Ricci was sharp. Interested. Not just in the systems that keep us alive, but in the whole organism, its biology, behavior, and habitat. She was even interested in the clouds around and the icy, slushy landscape below. She wanted to know about the weather patterns, wind, atmospheric layers—everything. I answered as best I could, but I was out of the conversational habit.  That, and something about the line of her jaw had me tongue-tied.  “Am I asking too many questions, Doc?” she asked as we stumped back to the rumpus room after checking the last hammock.  “Let’s keep to the life-and-death stuff for now,” I said.  Water harvesting is the next priority. To get it, we have to rise to the aquapause. There bright sunlight condenses moisture on the skin and collects in the dorsal runnels, where we tap it for storage.  Access to the main inflation gland is just under the rumpus room. Ricci squeezed through the elasticized access valve. The electrostatic membrane pulled her hair into spikes that waved at the PM bots circling her head. I stayed outside and watched her smear hormone ointment on the marbled surface of the gland. Sinuses creaked as bladders began to expand. As we walked through the maze of branching sinuses, I showed her how to brace against the roll and use the momentum to pull herself through the narrow access slots. Once we got to the ring-shaped fore cavity, we hooked our limbs into the netting and waited.  Rainbows rippled across the expanded bladder surfaces. We were nearly spherical, petals furled, and the wind rolled us like an untethered balloon. The motion makes some newbies sick, and they have to dial up anti-nauseant. Not Ricci. She looked around with anticipation, as if she were expecting to see something amazing rise over the vast horizon.  “Do you ever run into other whales?” she asked.  “I don’t much care for that term,” I said. It came out gruffer than I intended.  A dimple appeared at the edge of her breather. “Have you been out here long, Doc?”  “Yes. Ask me an important question.”  “Okay.” She waved her hand at the water kegs nested at the bottom of the netting, collapsed into a pile of honeycomb folds. “Why don’t you carry more water?”  “That’s a good question. You don’t need me to tell you though. You can figure it out. Flip through your dash.”  The dimple got deeper. Behind her darkened goggles, her eyelids flickered as she reviewed her dashboards. Naturally it took a little while; our setup was new to her. I rested my chin on my forearms and waited.  She surfaced quicker than I expected.  “Mass budget, right? Water is heavy.”  “Yes. The mass dashboard also tracks our inertia. If we get too heavy, we can’t maneuver. And heavy things are dangerous. Everything’s tethered and braced, and we have safety nets. But if something got loose, it could punch through a bladder wall. Even through the skin, easy.”  Ricci looked impressed. “I won’t tell Jane about that.”  We popped into the aquapause. The sun was about twenty degrees above the horizon. Its clear orange light glanced across the thick violet carpet of helium clouds below. Overhead, the indigo sky rippled with stars.  Bit of a shock for a mole. I let Ricci ogle the stars for a while. Water ran off the skin, a rushing, cascading sound like one of the big fountains down belowground. I cleared my throat. Ricci startled, eyes wide behind her goggles, then she climbed out of the netting and flipped the valve on the overhead tap. Silver water dribbled through the hose and into the battery of kegs, slowing the expanding pleated walls.  Ricci didn’t always fill the quiet spaces with needless chatter. I liked that. We worked in silence until the kegs were nearly full, and when she began to question me again, I welcomed it.  “Eddy said you were one of the first out here,” Ricci said. “You figured out how to make this all work.”  I answered with a grunt, and then cursed myself. If I scared her away Vula would never let me forget it.  “That’s right. Me and a few others.”  “You took a big risk.”  “Moving into the atmosphere was inevitable,” I said. “Humans are opportunistic organisms. If there’s a viable habitat, we’ll colonize it.”  “Takes a lot of imagination to see this as viable.”  “Maybe. Or maybe desperation. It’s not perfect but it’s better than down belowground. Down there, you can’t move without stepping on someone. Every breath is measured and every minute is optimized for resource resilience. That might be viable, but it’s not human.”  “I’m not arguing.” Ricci’s voice pitched low, thick with emotion as she gazed at the stars in that deep sky. “I love it here.”  Yeah, she wasn’t a mole anymore. She was one of us already.  One by one, the kegs filled and began flexing through their purification routine. We called in the crablike water bots and ran them through a sterilization cycle.  Water work done, the next task was spot-checking the equipment nests. I let Ricci take the lead, stayed well back as she jounced through the cavities and sinuses. She was enthusiastic, confident. Motivated, even. Most newbies stay hunkered in their hammocks for a lot longer than her.  We circled back to the rumpus room, inventoried the nutritional feedstock, and began running tests on the hygiene bots. I settled into the netting and watched Ricci pull a crispy snack out of the extruder.  “You must know all the other crews. The ones who live in the . . . ” Ricci struggled to frame the concept without offending me.  “You can call them whales if you want. I don’t like it, but I’ve never managed to find a better word.”  She passed me a bulb of cold caffeine.  “How often do you talk to the people who live in the other whales, Doc?”  “We don’t have anything to do with them. Not anymore.”  “How come?”  “The whole reason we came out here is so we don’t have to put up with anyone else’s crap.”  “You never see the other whales at all? Not even at a distance?”  I drained the bulb. “These organisms don’t have any social behavior.”  “But you must have to talk to them sometimes, don’t you? Share info or troubleshoot?”  I collapsed the bulb in my fist and threw it to a hygiene bot.  “You lonely already?”  Ricci tossed her head back and laughed, a full belly guffaw. “Come on, Doc. You have to admit that’s weird.”  She was relentless. “Go ahead and make friends with the others if you want,” I growled. “Just don’t believe everything they say. They’ve got their own ways of doing things, and so do we.”  We checked the internal data repeaters and then spent the rest of the shift calibrating and testing the sensor array—all the infrastructure that traps the data we sell to the atmospheric monitoring firms. I kept my mouth shut. Ricci maintained an aggressive cheerfulness even though I was about as responsive as a bot. But my glacier-like chilliness—more than ten years in the making—couldn’t resist her. My hermit heart was already starting to thaw.  If I’d been the one calling Jane every day, I would have told her the light is weird out here. We stay within the optimal thermal range, near the equator where the winds are comparatively warm and the solar radiation helps keep the temperature in our habitat relatively viable. That means we’re always in daylight, running a race against nightfall, which is good for Mama but not so good for us. Humans evolved to exist in a day-night cycle and something goes haywire in our brains when we mess with that. So our goggles simulate our chosen ratio of light and dark.  Me, I like to alternate fifty-fifty but I’ll fool with the mix every so often just to shake things up. Vula likes the night so she keeps things dimmer than most. Everyone’s different. That’s what the moles don’t realize, how different some of us are.  “I did a little digging, and what I found out scared me,” Jane said the next time Ricci checked in. “Turns out there’s huge gaps in atmospheric research. The only area that’s really well monitored is the equator, and only around the beanstalk. Everywhere else, analysis is done by hobbyists who donate a few billable hours here and there.”  Ricci nodded. “That’s what Doc said.”  Hearing my name perked me right up. I slapped down two of my open streams and gave their feed my whole attention.  “Nobody really knows that much about the organism you’re living inside. Even less about the climate out there, and nearly nothing about the geography, not in detail. I never would have supported this decision if I’d realized how . . . ” Jane’s pretty face contorted as she searched for the word. “How willy-nilly the whole situation is. It’s not safe. I can’t believe it’s even allowed.”  “Allowed? Who can stop us? People go where they want.”  “Not if it’s dangerous. You can’t just walk into a sewage treatment facility or air purification plant. It’s unethical to allow people to endanger themselves.”  Ricci snorted, fouling the valves on her breather and forcing her to take a big gulp of helium through her mouth.  “Not all of us want to be safe, Jane.” The helium made her voice squeaky.  Jane’s expression darkened. “Don’t mock me. I’m worried about you.”  “I know. I’m sorry,” Ricci squeaked. She exhaled to clear her lungs and took a deep slow breath through her nose. Her voice dropped to its normal register. “Listen, I’ve only been here a few days.”  “Six,” Jane said.  “If I see anything dangerous, you’ll be the first to know. Until then, don’t worry. I’m fine. Better than fine. I’m even sleeping. A lot.”  That was a lie. The air budget showed Ricci hadn’t seen much of the inside of her hammock. But I wasn’t worried. Exhaustion would catch up with her eventually.  “There’s something else,” Jane said. “I’ve been asking around about your hab-mates.”  “Vula’s okay. It’s just that lately none of her work has turned out the way she wants. You know artists. Their professional standards are always unreachable. Set themselves up to fail.”  “It’s not about Vula, it’s Doc.”  Ricci bounced in her netting. “Oh yeah? Tell me. Because I can’t get a wink out of that one. Totally impervious.”  I maximized the feed to fill my entire visual field. In the tiny screen in Ricci’s hand, Jane’s dark hair trailed strands across her face and into her mouth. She pushed them back with an impatient flick of her fingers. She was in an atrium, somewhere with stiff air circulation. I could just make out seven decks of catwalk arching behind her, swarming with pedestrians.  “Pull down a veil,” Jane said. “You might have lurkers.”  “I do,” Ricci answered. “Four at least. I’m the most entertaining thing inside Mama for quite a while. It doesn’t bother me. Let them lurk.”  But Jane insisted, so Ricci pulled down a privacy veil and the bug feed winked out.  I told myself whatever Jane had found out didn’t matter. It would bear no relation to reality. That’s how gossip works—especially gossip about ancient history. But even so, a little hole opened up under my breastbone, and it ached.  Only six days and I already cared what Ricci thought. I wanted her to like me. So I set about trying to give her a reason.  A few days later, we drifted into a massive storm system. Ricci’s first big one. I didn’t want her to miss it, so I bounced aft and hallooed to her at a polite distance from her hab. She was lounging in her netting, deep in multiple streams, twisting a lock of her short brown hair around her finger.  She looked happy enough to see me. No wariness behind her gaze, no chill.  We settled in to watch the light show. It was an eye-catcher. Bolts zagged to the peaks of the ice towers below, setting the fog alight with expanding patches of emerald green and acid magenta.  Two big bolts forked overhead with a mighty whump. Ricci didn’t even jump.  “What was that?” she asked.  I was going to stay silently mysterious, but then remembered I was trying to be friendly.  “That,” I said, “was lunch.”  A dark splotch began to coalesce at the spot where the two bolts had caressed each other, a green and violet pastel haze in the thin milky fog. We banked slowly, bladders groaning, massive sinus walls clicking as we changed shape to ride the wind currents up, up, and then the massive body flexed just enough to reveal two petals reaching into the coalescing bacteria bloom.  Ricci launched herself out of the netting and clung to the side of her hab, trying to get a better view of the feeding behavior. When the bloom dissipated, she turned to me.  “That’s all it does, this whale? Just search for food?”  “Eat, drink, and see the sights,” I said. “What else does anyone need from life?”  Good company, I thought, but I didn’t say it.  The light show went on for hours. Ricci was fascinated from start to finish. Me, I didn’t see it. I spent the whole storm watching the light illuminate her face.  What else does anyone need from life? That was me trying to be romantic. Clumsy. Also inaccurate.  When we first moved out here, my old friends and I thought our habs would eventually become self-contained. Experience killed that illusion pretty quick. We’re almost as dependent on the planetary civil apparatus as anyone.  Without feedstock, for example, we’d either starve or suffocate—not sure which would happen first. It has a lot of mass, so we can’t stockpile much.  Then there’s power. Funding it is a challenge when you’re supplying eight people as opposed to eight million. No economy of scale in a hab this size. It’s not the power feed itself that’s the problem, but the infrastructure. We’re always on the move, so the feed has to follow us around and provide multiple points of redundancy. Our ambient power supply costs base market value plus a massive buy-back on the research and development.  Data has to follow us around too, but we don’t bother with redundancy. It’s not critical. You’d think it was more important than air, though, if you saw us when the data goes down. Shrieking. Curses. Bouche just about catatonic (she’s a total media junkie). Eleanora wall-eyed with panic especially if she’s in the middle of a tournament (chess is her drug of choice). Vula, Eddy, and me in any state from suave to suicidal depending on what we’re doing when the metaphorical umbilical gets yanked out of our guts.  Treasure and Chara are the only ones who don’t freak out. Usually they’re too busy boning each other.  Without data, we couldn’t stay here, either. If we only had each other to talk to, it’d be a constant drama cycle, but we’re all plugged into the hab cultures down belowground. We’ve got hobbies to groom, projects to tend, performances to cheer, games to play, friends to visit.  Finally, as an independent political entity, we need brokers and bankers to handle our economic transactions and lawyers to vet our contracts. We all need the occasional look-in from medtechs and physical therapists. And when we need a new crew member, we contract a recruiter.  “You look tired,” Jane said the next time Ricci called. “I thought you said you were sleeping.”  Ricci hung upside down in her netting. She’d made friends with the orang. It squatted in front of her, holding the appliance while she chatted with Jane.  “I’ve been digging through some old work.” She dangled her arms, hooked her fingers in the floor grid, and stretched. “I came up with a new approach to my first dissertation.”  Jane gaped. Her mouth worked like she was blowing bubbles.  “I know,” Ricci added. “I’ll never change, right?”  “Don’t you try that with me.” Jane’s eyes narrowed. “You have a choice—”  Ricci raised her hands in mock surrender. “Okay. Take it easy.”  “—you can keep working on getting better, or you can go back to your old habits.”  “It’s not your fault, Jane. You’re a great therapist.”  “This isn’t about me, you idiot,” Jane yelled. “It’s about you.”  “I tried, Jane.” Ricci’s voice was soft, ardent. “I really tried. So hard.”  “I know you did.” Jane sucked in a deep breath. “Don’t throw away all your progress.”  They went on and on like that. I didn’t listen, just checked in now and then to see if they were still at it. I knew Ricci’s story. I’d read the report from the recruiter. The privacy seal had timed out but I remembered the details.  Right out of the crèche she’d dived into an elite chemical engineering program, the kind every over-fond crèche manager wants for their favorite little geniuses. Sound good, doesn’t it? Isn’t that where you’d want to put your little Omi or Occam, little Carey or Karim? But what crèche managers don’t realize—because their world is full of guided discovery opportunities and subconscious learning stimuli—is that high-prestige programs are grinders. Go ahead, dump a crèche-full of young brilliants inside. Some of them won’t come out whole.  I know; I went through one myself.  When Ricci crashed out of the chem program within spitting distance of an advanced degree, she bounced to protein engineering. She did a lot of good work there before she cracked. Then she moved into pharmaceutical modeling. A few more years of impressive productivity before it all went up in smoke. By that time she wasn’t young anymore. The damage had accumulated. Her endocrinologist suggested intensive peer counseling might stop the carnage, so in stepped Jane, who applied her pretty smile, her patience, and all her active listening skills to try to gently guide Ricci along a course of life that didn’t include cooking her brain until it scrambled.  At the end of that long conversation through the appliance, Ricci agreed to put her old work under lockdown so she could concentrate on the here-and-now. Which meant all her attention was focused on us.  Ricci got into my notes. I don’t keep them locked down; anyone can access them. Free and open distribution of data is a primary force behind the success of the human species, after all. Don’t we all learn that in the crèche?  Making data available doesn’t guarantee anyone will look at it, and if they do, chances are they won’t understand it. Ricci tried. She didn’t just skim through, she really studied. Shift after shift, she played with the numbers and gamed my simulation models. Maybe she slept. Maybe not.  I figured Ricci would come looking for me if she got stumped, so I de-hermited, banged around in the rumpus room, put myself to work on random little maintenance tasks.  When Ricci found me, I was in the caudal stump dealing with the accumulated waste pellets. Yes, that’s exactly what it sounds like: half-kilogram plugs of dry solid waste covered in wax and transferred from the lavs by the hygiene bots. Liquid waste is easy. We vaporize it, shunt it into the gas exchange bladder, and flush it through gill-like permeable membranes. Solid waste, well, just like anyone we’d rather forget about it as long as possible. We rack the pellets until there’s about two hundred, then we jettison them.  Ricci pushed up her goggles and scrubbed knuckles over her red-rimmed eyes.  “Why don’t you automate this process like you do for liquids?” Ricci asked as she helped me position the rack over the valve.  “No room for non-essential equipment in the mass budget,” I said.  I dilated the interior shutter and the first pellet clicked through. A faint pink blush formed around the valve’s perimeter, only visible because I’d dialed up the contrast on my goggles to watch for signs of stress. A little hormone ointment took care of it—not too much or we’d get a band of inflexible scar tissue, and then I’d have to cut out the valve and move it to another location. That’s a long, tricky process and it’s not fun.  “There’s only two bands of tissue strong enough to support a valve.” I bent down and stroked the creamy striated tissue at my feet. “This is number two, and really, it barely holds. We have to treat it gently.”  “Why risk it, then? Take it out and just use the main valve.”  A sarcastic comment bubbled up—have you never heard of a safety exit?—but I gazed into her big brown eyes and it faded into the clouds.  “We need two valves in case of emergencies,” I mumbled.  Ricci and I watched the pellets plunge through the sky. When they hit the ice slush, the concussive wave kicked up a trail of vapor blooms, concentric rings lit with pinpoints of electricity, so far below each flash just a spark in a violet sea.  A flock of jellies fled from the concussion, flat shells strobing with reflected light, trains of ribbon-like tentacles flapping behind.  Ricci looked worried. “Did we hit any of them?”  I shook my head. “No, they can move fast.”  After we’d finished dumping waste, Ricci said, “Say, Doc, why don’t you show me the main valve again?”  I puffed up a little at that. I’m proud of the valves. Always tinkering, always innovating, always making them a little better. Without the valves, we wouldn’t be here.  Far forward, just before the peduncle isthmus, a wide band of filaments connects the petals to the bladder superstructure. The isthmus skin is thick with connective tissue, and provides enough structural integrity to support a valve big enough to accommodate a cargo pod.  “We pulled you in here.” I patted the collar of the shutter housing. “Whoever prepared the pod had put you in a pink body bag. Don’t know why it was such a ridiculous color. When Vula saw it, she said, ‘It’s a girl!’.”  I laughed. Ricci winced.  “That joke makes sense, old style,” I explained.  “No, I get it. Birth metaphor. I’m not a crechie, Doc.”  “I know. We wouldn’t have picked you if you were.”  “Why did you pick me?”  I grumbled something. Truth is, when I ask our recruiter to find us a new hab-mate, the percentage of viable applications approaches zero. We look for a specific psychological profile. The two most important success factors are low self-censoring and high focus. People who say what they think are never going to ambush you with long-fermented resentments, and obsessive people don’t get bored. They know how to make their own fun.  Ricci tapped her fingernail on a shutter blade.  “Your notes aren’t complete, Doc.” She stared up at me, unblinking. No hint of a dimple. “Why are you hoarding information?”  “I’m not.”  “Yes, you are. There’s nothing about reproduction.”  “That’s because I don’t know very much about it.”  “The other whale crews do. And they’re worried about it. You must know something, but you’re not sharing. Why?”  I glared at her. “I’m an amateur independent researcher. My methods aren’t rigorous. It would be wrong to share shaky theories.”  “The whale crews had a collective research agreement once. You wrote it.”  She fired the document at me with a flick of her finger. I slapped it down and flushed it from my buffer.  “That agreement expired. We didn’t renew.”  “That’s a lie. You dissolved it and left to find your own whale.”  I aimed my finger at the bridge of her goggles and jabbed the air. “Yes, I ran away. So did you.”  She smiled. “I left a network of habs with a quarter billion people who can all do just fine without me. You ran from a few hundred who need you.”  Running away is something I’m good at. I bounced out of there double-time. Ricci didn’t call after me. I wouldn’t have answered if she had.  The next time she talked to Jane, Ricci didn’t mention me. I guess I didn’t rate high enough on her list of problems. I didn’t really listen to the details as they chatted. I just liked having their voices in my head while I tinkered with my biosynthesis simulations.  Halfway through their session, Vula pinged me.  You can quit spying, she said. None of us are worried about Ricci anymore.  I agreed, and shut down the feed.  Ricci’s been asking about you, by the way, Vula added. Your history with the other whales.  Tell her everything.  You sure?  I’ve been spying on her for days. It’s only fair.  Better she heard the story from Vula than me. I still can’t talk about it without overheating, and they tell me I’m scary when I’m angry.  Down belowground the air is thick with rules written and unwritten, the slowly decaying husks of thirty thousand years of human history dragged behind us from Earth, and the most important of these is cooperation for mutual benefit. Humans being human, that’s only possible in conditions of resource abundance—not just actual numerical abundance, but more importantly, the perception of abundance. When humans are confident there’s enough to go around, life is easy and we all get along, right?  Ha.  Cooperation makes life possible, but never easy. Humans are hard to wrangle. Tell them to do one thing and they’ll do the opposite more often than not. One thing we all agree on is that everyone wants a better life. Only problem is, nobody can agree what that means.  So we have an array of habs offering a wide variety of socio-cultural options. If you don’t like what your hab offers, you can leave and find one that does. If there isn’t one, you can try to find others who want the same things as you and start your own. Often, just knowing options are available keeps people happy.  Not everyone, though.  Down belowground, I simply hated knowing my every breath was counted, every kilojoule measured, every moment of service consumption or contribution accounted for in the transparent economy, every move modeled by human capital managers and adjusted by resource optimization analysts. I got obsessed with the numbers in my debt dashboard; even though it was well into the black all I wanted to do was drive it up as high and as fast as I could, so nobody would ever be able to say I hadn’t done my part.  Most people never think about their debt. They drop a veil over the dash and live long, happy, ignorant lives, never caring about their billable rate and never knowing whether or not they siphoned off the efforts of others. But for some of us, that debt counter becomes an obsession.  An obsession and ultimately an albatross, chained around our necks.  I dreamed about an independent habitat with abundant space and unlimited horizons. And I wasn’t the only one. When we looked, there it was, floating around the atmosphere.  Was it dangerous? Sure. But a few firms provide services to risk takers and they’re always eager for new clients. The crews that shuttle ice climbers to the poles delivered us to the skin of a very large whale. I made the first cut myself.  Solving the problems of life was exhilarating—air, food, water, warmth. We were explorers, just like the mountain climbers of old, ascending the highest peaks wearing nothing but animal hides. Like the first humans. Revolutionary.  Our success attracted others, and our population grew. We colonized new whales and once we got settled, our problems became more mundane. I have a little patience for administrative details, but the burden soon became agonizing. Unending meetings to chew over our collective agreements, measuring and accounting and debits and credits and assigning value to everyone’s time. This was exactly what we’d escaped. Little more than one year in the clouds, and we were reinventing all the old problems from scratch.  Nobody needs that.  I stood right in the middle of the rumpus room inside the creature I’d cut into with my own hands and gave an impassioned speech about the nature of freedom and independence, and reminded them all of the reasons we’d left. If they wanted their value micro-accounted, they could go right back down belowground.  I thought it was a good speech, but apparently not. When it came to a vote, I was the only one blocking consensus.  I believe—hand-to-heart—if they’d only listened to me and did what I said everything would have been fine and everyone would have been happy. But some people can never really be happy unless they’re making other people miserable. They claimed I was trying to use my seniority, skills, and experience as a lever to exert political force. I’d become a menace. And when they told me I had to submit to psychological management, I left.  Turned out we’d brought the albatross along with us, after all.  When Jane pinged me a few days later, I was doing the same thing as millions down belowground—watching a newly-arrived arts delegation process down the beanstalk and marveling at their dramatic clothing and prosthetics.  I pinged her back right away. Even though I knew she would probably needle me about my past, I didn’t hesitate. I missed having Ricci and Jane in my head, and life was a bit lonely without them. Also, I was eager to meet her. I wasn’t the only one; the whole crew was burning with curiosity about Ricci’s pretty friend.  When Jane’s fake melted into reality, she was dressed in a shiny black party gown. Long dark hair pouffed over her shoulders, held off her face with little spider clips that gathered the locks into tufts. Her chair was a spider model too, with eight delicate ruby and onyx legs that cradled her torso.  “Hi, Doc,” she said. “It’s nice to meet you, finally. I’m a friend of Ricci’s. I think you know that, though.”  A friend. Not a therapist, peer counselor, or emotional health consultant. That was odd. And then it dawned on me: Jane had been donating her time ever since Ricci joined us. She probably wanted to formalize her contract, start racking up the billable hours.  When I glanced through her metadata, and my heart began to hammer. Jane’s rate was sky high.  “We can’t float your rate,” I blurted. “Not now. Maybe eventually. But we’d have to find another revenue stream.”  Jane’s head jerked back and her gaze narrowed.  “That’s not why I pinged you,” she said. “I don’t care about staying billable—I never did. All I want to do is help people.”  I released a silent sigh of relief. “What can I do for you?”  “Nothing. I just wanted to say hi and ask how Ricci’s getting along.”  “Ricci’s fine. Nothing to worry about.” I always get gruff around beautiful women.  She brightened. “She’s fitting in with you all?”  “Yeah. One of the crew. She’s great. I love her.” I bit my lip and quickly added, “I mean we all like her. Even Vula, and she’s picky.”  I blushed. Badly. Jane noticed, and a gentle smile touched the corners of her mouth. But she was a kind soul and changed the subject.  “I’ve been wondering something, Doc. Do you mind if I ask a personal question?”  I scrubbed my hands over my face in embarrassment and nodded.  She wheeled her chair a bit closer and tilted toward me. “Do you know what gave you the idea to move to the surface? I mean originally, before you’d ever started looking into the possibility.”  “Have you read Zane Grey’s Riders of the Purple Sage?” I asked. “You must have.”  “No.” She looked confused, like I was changing the subject.  “You should. Here.”  I tossed her a multi-bookmark compilation. Back down belowground, I’d given them out like candy at a crèche party. She could puzzle through the diction of the ancient original or read it in any number of translations, listen to a variety of audio versions and dramatic readings, or watch any of the hundreds of entertainment docs it had inspired. I’d seen them all.  “This is really old. Why did you think I’d know it?” She flipped to the summary. “Oh, I see. One of the characters is named is Jane.”  “Read it. It explains everything.”  “I will. But maybe you could tell me what to look for?” Her smile made me forget all about my embarrassment.  “It’s about what humans need to be happy. Sure, we evolved to live in complex interdependent social groups, but before that, we were nomads, pursuing resource opportunities in an open, sparsely populated landscape. That means for some people, solitude and independence are primary values.”  She nodded, and I could see she was trying hard to understand.  “Down belowground, when I was figuring all this out, I tried working with a therapist. When I told him this, he said, ‘We also evolved to suffer and die from violence, disease, and famine. Do you miss that, too?’”  Jane laughed. “I hope you fired him. So one book inspired all this?”  “It’s not just a book. It’s a way of life. The freedom to explore wide open spaces, to come together with like-minded others and form loose knit communities based on mutual aid, and to know that every morning you’ll wake up looking at an endless horizon.”  “These horizons aren’t big enough?” She waved at the surrounding virtual space, a default grid with dappled patterns, as if a directional light source were shining through gently fluttering leaves.  “For some, maybe. For me, pretending isn’t enough.”  “I’ll read it. It sounds very . . . ” She pursed her lips, looking for the right word. “Romantic.”  I started to blush again, so I made an excuse and dropped the connection before I made a fool of myself. Then I drifted down to the rumpus room and stripped off my goggles and breather.  “Whoa,” Bouche said. “Doc, what’s wrong?”  Eleanora turned from the extruder to look at me, then fumbled her caffeine bulb and squirted liquid across her cheek.  “Wow.” She wiped the liquid up with her sleeve. “I’ve never seen you look dreamy before. What happened?”  I’m in love, I thought.  “Jane pinged me,” I said instead.  Bouche called the whole crew. They came at a run. Even Vula.  In a small hab, any crumb of gossip can become legendary. I made them beg for the story, then drew it out as long as I could.  “Can you ask her to ping me?” Eddy asked Ricci when I was done.  “I would chat with her for more than a couple minutes, unlike Doc,” said Treasure.  Chara grinned lasciviously. “Can I lurk?”  The whole crew in one room, awake and actually talking to each other was something Ricci hadn’t seen before, much less all of us howling with laughter and gossiping about her friend. She looked profoundly unsettled. Vula bounced over to the extruder, filled a bulb with her favorite social lubricant, and tossed it to Ricci.  “Tell us everything about Jane,” Chara said. Treasure waggled her tongue.  “It’s not like that.” Ricci frowned. “She’s a friend.”  “Good,” they chorused, and collapsed back onto the netting, giggling.  “I’ve been meaning to ask—why do you use that hand-held thing to talk to her, anyway?” Chara said. “I’ve never even seen one of those before.”  Ricci shook her head.  “Come on, Ricci. There’s no privacy here,” Vula said. “You know that. Don’t go stiff on us.”  Ricci joined us in the netting before answering. When she picked a spot beside me, my pulse fluttered in my throat.  “Jane’s a peer counselor.” She squeezed a sip from the bulb and grimaced at the taste. “The hand-held screen is one of her strategies. Having it around reminds me to keep working on my goals.”  “Why do you need peer counseling?” asked Chara.  “Because I . . . ” Ricci looked from face to face, big brown eyes serious. Everyone quieted down. “I was unhappy. Listen, I’ve been talking with some people from the other whale crews. They’ve been having problems for a while now, and it’s getting worse.”  She fired a stack of bookmarks into the middle of the room. Everyone began riffling through them, except me.  “That’s too bad,” I said.  “Don’t you want to know what’s going on, Doc?” asked Chara.  I folded my arms and scowled in the general direction of the extruder.  “No,” I said flatly. “I don’t give a shit about them.”  “Well, you better,” Vula said. “Because if it’s happening to them, it could happen to us. Look.”  She fired a feed from a remote sensing drone into the middle of the room. A group of whales had gathered a hundred meters above a slushy depression between a pair of high ridges. They weren’t feeding, just drifting around aimlessly, dangerously close to each other. When they got close to each other, they unfurled their petals and brushed them along each other’s skin.  As we watched, two whales collided. Their bladders bubbled out like a crechie’s squeeze toy until it looked like they would burst. Seeing the two massive creatures collide like that was so upsetting, I actually reached into the feed and tried to push them apart. Embarrassing.  “Come on Doc, tell us what’s happening,” said Vula.  “I don’t know.” I tucked my hands into my armpits as if I was cold.  “We should go help,” said Eddy. “At least we could assist with the evac if they need to bail.”  I shook my head. “It could be dangerous.”  Everyone laughed at that. People who aren’t comfortable with risk don’t roam the atmosphere.  “It might be a disease,” I added, “We should stay as far away as we can. We don’t want to catch it.”  Treasure pulled a face at me. “You’re getting old.”  I grabbed my breather and goggles and bounded toward the hatch.  “Come on Doc, take a guess,” Ricci said.  “More observation would be required before I’d be comfortable advancing a theory,” I said stiffly. “I can only offer conjecture.”  “Go ahead, conjecture away,” said Vula.  I took a moment to collect myself, and then turned and addressed the crew with professorial gravity.  “It’s possible the other crews haven’t been maintaining the interventions that ensure their whales don’t move into reproductive maturity.”  “You’re saying the whales are horny?” said Bouche.  “They look horny,” said Treasure.  “They’re fascinated with each other,” said Vula.  Vula had put her finger on exactly the thing that was bothering me. Whales don’t congregate. They don’t interact socially. They certainly don’t mate.  “I’d guess the applicable pseudoneural tissue has regenerated, perhaps incompletely, and their behavior is confused.”  Ricci gestured at the feed, where three whales collided, dragging their petals across each other’s bulging skin. “This isn’t going to happen to us?”  “No, I said. “Definitely not. Don’t worry. Unlike the others, I’ve been keeping on top of the situation.”  “But how can you be sure?” And then realization dawned over Ricci’s face. “You knew this was going to happen, didn’t you?”  “Not exactly.”  She launched herself from the netting and bounced toward me. “Why didn’t you share the information? Keeping it secret is just cruel.”  I backed toward the hatch. “It’s not my responsibility to save the others from their stupid mistakes.”  “We need to tell them how to fix it. Maybe they can save themselves.”  “Tell them whatever you want.” I excavated my private notes from lockdown, and fired them into the middle of the room. “I think their best option would be to abandon their whales and find new ones.”  “That would take months,” Vula said. “Nineteen whales. More than two hundred people.”  “Then they should start now.” I turned to leave.  “Wait.” Ricci looked around at the crew. “We have to go help. Right?”  I gripped the edge of the hatch. The electrostatic membrane licked at my fingertips.  “Yeah, I want to go,” Bouche said. “I’d be surprised if you didn’t, Doc.”  “I want to go,” said Treasure.  “Me too,” Chara chimed in. Eddy and Eleanora both nodded.  Vula pulled down her goggles and launched herself out of the netting. “Whales fucking? What are we waiting for? I’ll start fabbing some media drones.”  With all seven of them eager for adventure, our quiet, comfortable little world didn’t stand a chance.  We’re not the only humans on the surface. Not quite. Near the south pole a gang of religious hermits live in a deep ice cave, making alcohol the old way using yeast-based fermentation. It’s no better than the extruded version, but some of the habs take pity on them so the hermits can fund their power and feedstock.  Every so often one of the hermits gives up and calls for evac. When that happens, the bored crew of a cargo ship zips down to rescue them. Those same ships bring us supplies and new crew. They also shuttle adventurers and researchers around the planet, but mostly they sit idle, tethered halfway up the beanstalk.  The ships are beautiful—sleek, fast, and elegant. As for us, when we need to change our position, it’s not quite so efficient. Or fast.  When Ricci found me in the rumpus room, I’d already fabbed my gloves and face mask, and I was watching the last few centimeters of a thick pair of protective coveralls chug through the output.  “I told the other crews you’d be happy to take a look at the regenerated tissue and recommend a solution, but they refused,” she said. “They don’t like you, do they?”  I yanked the coveralls out of the extruder.  “No, and I don’t like them either.” I stalked to the hatch.  “Can I tag along, Doc?” she asked.  “You’re lucky I don’t pack you into a body bag and tag you for evac.”  “I’m really sorry, Doc. I should have asked you before offering your help. When I get an idea in my head, tend to just run with it.”  She was all smiles and dimples, with her goggles on her forehead pushing her hair up in spikes and her breather swinging around her neck. A person who looks like that can get away with anything.  “This is your idea,” I said. “Only fair you get your hands dirty.”  I fabbed her a set of protective clothing and we helped each other suit up. We took a quick detour to slather appetite suppressant gel on the appropriate hormonal bundle, and then waddled up the long dorsal sinus, arms out for balance. The sinus walls clicked and the long cavity bent around us, but soon the appetite suppressant took hold and we were nearly stationary, dozing gently in the clouds.  On either side towered the main float bladders—clear multi-chambered organs rippling with rainbows across their honeycomb-patterned surfaces. Feeder organs pulsed between the bladder walls. The feeders are dark pink at the base, but the color fades as they branch into sprawling networks of tubules reaching through the skin, grasping hydrogen and channeling it into the bladders.  At the head of the dorsal sinus, a tall, slot-shaped orifice give us access to the neuronal cavity. I shrugged my equipment bag off my shoulder, and showed Ricci how to secure her face mask over her breather, and climbed in.  With the masks on, to talk we had to ping each other. I was still a bit angry so no chit-chat, business only. I handed her the laser scalpel.  Cut right here. I sliced the blade of my gloved hand vertically down the milky surface of the protective tissue. See these scars? I pointed at the gray metallic stripes on either side of the imaginary line I’d drawn. Stay away from them. Just cut straight in between.  Ricci backed away a few steps. I don’t think I’m qualified to do this.  You’ve been qualified to draw a line since you were a crechie. When she began to protest again, I cut her off. This was your idea, remember?  Her hands shook, but the line was straight enough. The pouch deflated, draping over the skeleton of the carbon fiber struts I’d installed way back in the beginning. I pulled Ricci inside and closed the incision behind us with squirts of temporary adhesive. The wound wept drops of fluid that rapidly boiled off, leaving a sticky pink sap-like crust across the iridescent interior surface.  Is this the whale’s brain? Ricci asked.  I ignored the question. Ricci knew it was the brain—she’d been studying my notes, after all. She was just trying to smooth my feathers by giving me a chance to show my expertise.  Not every brain looks like a brain. Yours and mine look like they should be floating in the primordial ocean depths—that’s where we came from, after all. The organ in front of us came from the clouds—a tower of spun glass floss threaded through and through with wispy, feather-like strands that branched and re-branched into iridescent fractals. My mobility control leads were made of copper nanofiber embedded in color-coded silicon filaments: red, green, blue, yellow, purple, orange, and black—a ragged, dull rainbow piercing the delicate depths of an alien brain.  Ricci repeated her question.  Don’t ask dumb questions, Ricci.  She put her hands up in a gesture of surrender and backed away. Not far—no room inside the pouch to shuffle back more than one step.  The best I can say is it’s brain-like. I snapped the leads into my fist-sized control interface. The neurons are neuron-like. Is it the whole brain? Is the entire seat of cognition here? I can’t tell because there’s not much cognition to measure. Maybe more than a bacterium, but far less than an insect.  How do you measure cognition? Ricci asked.  Controlled experiments, but how do you run experiments on animals this large? All I can tell you is that most people who study these creatures lose interest fast. But here’s a better measure: After more than ten years, a whale has never surprised me.  Before today, you mean.  Maneuvering takes a little practice. We use a thumb-operated clicker to fire tiny electrical impulses through the leads and achieve a vague form of directional control. Yes, it’s a basic system. We could replace it with something more elegant but it operates even if we lose power. The control it provides isn’t exactly roll, pitch, and yaw, but it’s effective enough. The margin for error is large. There’s not much to hit.  Navigation is easy, too. Satellites ping our position a thousand times a second and the data can be accessed in several different navigational aids, all available in our dashboards.  But though it’s all fairly easy, it’s not quick. My anger didn’t last long. Not in such close quarters, especially just a few hours after realizing I was in love with her. It was hardly a romantic scene, both of us swathed head-to-toe in protective clothing, passing a navigation controller back and forth as we waggled slowly toward our destination.  In between bouts of navigation, I began telling Ricci everything I knew about the organ in front of us: A brain dump about brains, inside a brain. Ha.  She was interested; I was flattered by her interest. Age-old story. I treated her to all my theories, prejudices, and opinions, not just about regenerating pseudoneuronal tissue and my methods for culling it, but the entire scientific research apparatus down belowground, the social dynamics of hab I grew up in, and the philosophical underpinnings of the research exploration proposal we used to float our first forays out here.  Thank goodness Ricci was wearing a mask. She was probably yawning so wide I could have checked her tonsils.  Here. I handed her the control box. You drive the rest of the way.  We were aiming for the equator, where the strong, steady winds have carved a smooth canyon bisecting the ice right down to the planet’s iron core. When we need to travel a long distance, riding that wind is the fastest route.  Ricci clicked a directional adjustment, and our heading swung a few degrees back toward the equator.  What does the whale perceive when we do this? Ricci waggled the thumb of her glove above the joystick. When it changes direction, are we luring it or scaring it away?  Served me right for telling her not to ask simple questions.  I don’t really know, I admitted.  Maybe it makes them think other whales are around. What if they want to be together, just like people, but before now they didn’t know how. Maybe you’ve been teaching them.  My eyebrows climbed. I’d never considered how we might be influencing whale behavior, aside from the changes we make for our own benefit.  That’s an interesting theory, Ricci. Definitely worth looking into.  Wouldn’t it be terrible to be always alone?  I’d always considered myself a loner. But in that moment, I honestly couldn’t remember why.  Once we’re in the equatorial stream, we ride the wind until we get into the right general area. Then we wipe off the appetite suppressant, and hunger sends us straight into the arms of the nearest electrical storm.  The urge to feed is a powerful motivator for most organisms. Mama chases all the algae she can find, and gobbles it double-time. For us on the inside, it’s like an old-style history doc. Everyone stays strapped in their hammocks and rides out the weather as we pitch around on the high seas.  I always enjoy the feeding frenzy; it gets the blood flowing.  I’d just settled to enjoy the wild ride when Ricci pinged me.  Two crews tried surgical interventions on the regenerated tissue. Let me know what you think, okay? Maybe now we can convince them to let you help.  The message was accompanied by bookmarks to live feeds from the supply ships.The first feed showed a whale wedging itself backward into a crevasse, its petals waving back and forth as it wiggled deeper into the canyon-like crack in the ice.  The other feed showed a whale scraping its main valve along a serrated ridge of ice. Its oval body stretched and flexed, its bladders bulged. Its petals curled inward then snapped into rigid extension as the force of its body crashed down on the ice’s knife edge.  Inside both whales, tiny specks bounced through the sinuses. I could only imagine what the crew was doing—what I would do in that situation. If they wanted to live, they had to leave. Fast.  A chill slipped under my skin. My fault. If those whales died, if those crews died, I was to blame. Me alone. Not the two crews. They were obviously desperate enough to try anything. I should have contacted them myself, and offered whatever false apologies would get them to accept my help.  But chances are it wouldn’t have changed the outcome, except they would have had me to blame. Another entry in my list of crimes.  Frost spread across my flesh and raised goosebumps. I tugged on my hammock’s buckles to make sure they were secure against the constant pitching and heaving, dialed up the temperature, and snuggled deeper into my quilt. I fired up my simulation model and wandered through towering mountains of pseudoneural tissue, pondering the problem, delving deeper and deeper through chains of crystallized tissue until they danced behind my eyelids. Swirling, stacking, combining, and recombining . . .  I was nearly asleep when I heard Ricci’s voice.  “Hey, Doc, can we talk?”  I thought I was dreaming. But no, she was right outside my hammock, gripping the tethers and getting knocked off her feet with every jolt and flex. Her goggled and masked face was lit by a mad flurry of light from the bolts coruscating in every direction just beyond the skin.  “Are you nuts?” I yanked open the hammock seal. “Get in here.”  She plunged through the electrostatic barrier and rolled to the far side of my bed. When she came up, her hair stood on end with static electricity.  “Whoa.” She swiped off her goggles and breather, stuffed them in one of the hammock pouches, then flattened the dark nimbus of her hair with her palms and grinned. “It’s wild out there.”  I pulled my quilt up to my chin and scowled. “That was stupid.”  “Yeah, I know but you didn’t ping me back. This is an important situation, right? Life or death.”  I sighed. “If you want to rescue people, there are vocations for that.”  “Don’t we have a duty to help people when we can?”  “Some people don’t want to be helped. They just want to be left alone.”  “Like you?”  “Nothing you’re doing is helping me, Ricci.”  “Okay, okay. But if we can figure out a way to help, that’s good too. Better than good. Everyone wins.”  Lying there in my hammock, facing Ricci sprawled at the opposite end and taking up more than half of the space, I finally figured out what kind of person she was.  “You’re a meddler, Ricci. A busybody. You were wasted in the sciences. You should have studied social dynamics and targeted a career in one-on-one social work.”  She laughed.  “Listen.” I held out my hand, palm up. She took it right away, didn’t hesitate. Her hand was warm. Almost feverish. “If you want to stay in the crew, you have to relax. Okay? We can’t have emergencies every week. None of us are here for that.”  She squeezed my hand and nodded.  “A little excitement is fine, once in a while,” I continued. “Obviously this is an extraordinary situation. But if you keep looking for adventure, we’ll shunt you back to Jane without a second thought.”  She twisted the grip into a handshake and gave me two formal pumps. Then she reached for the hammock seal. She would have climbed out into the maelstrom if I hadn’t stopped her.  “You can’t do that,” I yelled. “No wandering around when we’re in a feeding frenzy. You’ll get killed. Kill us too, if you go through the wrong bladder wall.”  She smiled then, like she didn’t believe me, like it was just some excuse to keep her in my hammock. And when she settled back down, it wasn’t at the opposite end. She snuggled in right beside me, companionable as anything, or even more.  “Don’t you get lonely, Doc?” she asked.  “Sometimes,” I admitted. “Not much.”  Our hammocks are roomy, but Ricci didn’t give me much space, and though the tethers absorb movement, we were still jostling against each other.  “Because you don’t need anybody or anything.” Her voice in my ear, soft as a caress.  “Something like that.”  “Maybe, eventually, you’ll change your mind about that.”  What happened next wasn’t my idea. I was long out of practice, but Ricci had my full and enthusiastic cooperation.  Down belowground, I was a surgeon, and a good one. My specialty was splicing neurons in the lateral geniculate nucleus. My skills were in high demand. So high, in fact, that I had a massive support team.  I’m not talking about a part-time admin or social facilitator. Anyone can have those. I had an entire cadre of people fully dedicated to making sure that if I spent most of my time working and sleeping, what little time remained would be optimized to support physical, emotional, and intellectual health. All my needs were plotted and graphed. People had meetings to argue, for example, over what type of sex best maintained my healthiest emotional state, and once that was decided, they’d argue over the best way to offer that opportunity to me.  That’s just an example. I’m only guessing. They kept the administrative muddle under veil. Day-to-day, I only had contact with a few of my staff, and usually I was too busy with my own work to think about theirs. But for a lot of people, I was a billable-hours bonanza.  But despite all their hard work, despite the hedonics modeling, best-practice scenarios, and time-tested decision trees, I burned out.  It wasn’t their fault. It was mine. I was, and remain, only human.  I could have just reduced my surgery time. I could have switched to teaching or coaching other surgeons. But no. Some people approach life like it’s an all-or-nothing game. That’s me. I couldn’t be all, so I decided to become nothing.  Until Ricci came along, that is.  When the storm ended, the two of us had to face a gauntlet of salacious grins and saucy comments. I didn’t blush, or at least not much. Ricci had put the spark of life in a part of me that had been dark for far too long. I was proud to have her in my crew, in my hammock, in my life.  The whole hab gave us a hard time. The joke that gave them the biggest fits, and made even Vula cling helplessly to the rumpus room netting as she convulsed with laughter, involved the two of us calling for evac and setting up a crèche in the most socially conservative hab down belowground. Something about imagining us in swathed in religious habits and swarming with crechies tweaked everyone’s funny bones.  Ricci weathered the ridicule better than me. I left to fill the water kegs, and by the time I returned, the hilarity had worn itself out.  The eight of us lounged in the rumpus room, the netting gently swaying to and fro as we drifted in the bright directional light of the aquapause. Water spilled off the skin and threw dappled shadows across the room. Vula had launched the media drones and we’d all settled down to watch the feeds.  More than once I caught myself brainlessly staring at Ricci, but I kept my goggles on so nobody noticed. I hope.  Two hundred kilometers to the northwest and far below us, the seventeen remaining whales congregated in the swirling winds above a dome-shaped mesa that calved monstrous sheets of ice down its massive flanks. A dark electrical storm massed on the horizon, with all its promise of rich concentrations of algae, but the whales didn’t move toward it, just kept circulating and converging, plucking at each other’s skin.  Three hundred kilometers west lay the abandoned corpses of two whales, their deflated bladders draped over warped sinus skeletons half-buried in slush.  Our media drones got there too late to trap the whales’ death throes, and I was glad. But Vula and Bouche trapped great visuals of the rescue, showing the valiant supply ship crews swooping in to pluck brightly colored body bags out of the air. Maybe the crews put a little more of a spin on their maneuvering than they needed to, but who could blame them? They rarely got a job worth bragging about.  One of Bouche’s media broker friends put the rescue feeds out to market. They started getting good play right away. Bouche fired the media licensing statement into the middle of the room. The numbers glowed green and flickered as they climbed.  “Look at these fees,” she said. “This will underwrite our power consumption for a couple years.”  “That’s great, Bouchie,” I murmured, and flicked the statement out of my visual field.  Night was coming, and it presented a hard deadline. If the whales didn’t move before dark, they’d all die.  Ricci moved closer to me in the netting and rested her cheek on my shoulder. I turned my head and touched my lips to her temple, just for a moment. I was deep in my brain simulation, working on the problem. But I kept an eye on the feeds. When the whales collided, I held my breath. As the bladders stretched and budged, I cringed, certain they’d reach their elastic limit and we would see a whale pop, its massive sinuses rupture, its skin tear away and its body plunge to splatter on the icy surface below. But they didn’t. They bounced off each other in slow motion and resumed their aimless circulation.  Hours passed. Eddy got up, extruded a meal, and passed the containers around the netting. Chara and Treasure slipped out of the room. Vula was only half-present—she was working in her studio, sculpting maquettes of popped bladders and painfully twisted corpses.  Eddy yawned. “How long can these whales live without feeding?”  I forced a stream of breath through my lips, fluttering the fringe of my bangs. “I don’t know. Indefinitely, maybe, if the crews can figure out a way to provide nutrition internally.”  “If they keep their whales fed, maybe they’ll just keep stumbling around, crashing into each other.” Vula’s voice was slurred, her eyes unfocused as she juggled multiple streams.  “I’m more worried about nightfall, actually,” I said.  Ever since we’d dragged ourselves out of my hammock, Ricci had been trying to pry information from emergency response up the beanstalk, from the supply ship crews who were circling the site, and from the whale crews. They were getting increasingly frantic as time clicked by, and keeping us informed wasn’t high on their list of priorities.  I rested my palm on the inside of Ricci’s knee. “Are the other crews talking to you yet?”  She sat up straight and gave me a pained smile. “A little. I wasn’t getting anywhere, but Jane’s been giving me some tips.”  That woke everyone up. Even Vula snapped right out of her creative fugue.  “Is Jane helping us?” Chara asked, and when Ricci nodded she demanded, “Why are you keeping her to yourself?”  Ricci shrugged. “Jane doesn’t know anything about whales.”  “If she’s been helping you maybe she can help us too,” said Eddy.  “Yeah, come on Ricci, stop hogging Jane.” Bouche raked her fingers through her hair, sculpting it into artful tufts. “I want to know what she thinks of all this.”  “All right,” Ricci said. “I’ll ask her.”  A few moments later she fired Jane’s feed into the room and adjusted the perspective so her friend seemed to be sitting in the middle of the room. She wore a baggy black tunic and trousers, and her hair was gathered into a ponytail that draped over the back of her chair. The pinnas of her ears were perforated in a delicate lace pattern.  Treasure and Chara came barreling down the access sinus and plunged through the hatch. They hopped over to their usual spot in the netting and settled in. Jane waved at them.  “We’re making you an honorary crew member,” Eddy told Jane. “Ricci has to share you with us. We all get equal Jane time.”  “I didn’t agree to that,” said Ricci.  “Fight over me later, when everyone’s safe.” Jane said. “I don’t understand why the other crews are delaying evacuation. Who would risk dying when they can just leave?”  Everyone laughed.  “This cadre self-selects for extremists.” Eddy rotated her finger over her head, encompassing all of us in the gesture. “People like us would rather die than back down.”  “I guess you’re not alone in that,” said Jane. “Every hab has plenty of stubborn people.”  “But unlike them, we built everything we have,” I said. “That makes it much harder to give up.”  “Looks like someone finally made a decision, though.” Ricci maximized the main feed. Jane wheeled around to join us at the netting.  Glowing dots tracked tiny specks across the wide mesa, pursued by flashing trails of locational data. Vula’s media drones zoomed in, showing a succession of brightly colored, hard-shell body bags shunting though the main valves. Sleet built up along their edges, quickly hardening to a solid coating of ice.  “Quitters,” Treasure murmured under her breath.  Jane looked shocked.  “If you think you know what you’d do in their place, you’re wrong,” I said. “Nobody knows.”  “I’d stay,” Treasure said. “I’ll never leave Mama.”  Chara grinned. “Me too. We’ll die together if we had to.”  Bouche pointed at the two of them. “If we ever have to evac, you two are going last.”  Jane’s expression of shock widened, then she gathered herself into a detached and professional calm.  Ricci squeezed my hand. “The supply ships want to shuttle some of the evacuees to us instead of taking them all the way to the beanstalk. How many can we carry?”  I checked the mass budget and made a few quick calculations. “About twenty. More if we dump mass.” I raised my voice. “Let’s pitch and ditch everything we can. If it’s not enough we can think about culling a little water and feedstock. Is everyone okay with that?”  To my surprise, nobody argued. I’d rarely seen the crew move so fast, but with Jane around everyone wanted to look like a hero.  Life has rarely felt as sunny as it did that day.  Watching the others abandon their whales was deeply satisfying. It’s not often in life you can count your victories, but each of those candy-colored, human-sized pods was a score for me and a big, glaring zero for my old, unlamented colleagues. I’d outlasted them.  Not only that, but I had a new lover, a mostly-harmonious crew of friends, and the freedom to go anywhere and do anything I liked, as long as it could be done from within the creature I called home.  But mostly, I loved having an important job to do.  I checked our location to make sure we were far enough away that if the other whales began to drift, they wouldn’t wander into the debris stream. Then we paired into work teams, pulled redundant equipment, ferried it to the main valve, and jettisoned it.  I kept a tight eye on the mass budget, watched for tissue stress around the valve, and made strict calls on what to chuck and what to keep.  Hygiene and maintenance bots were sacrosanct. Toilets and hygiene stations, too. Safety equipment, netting, hammocks—all essential. But each of us had fifty kilos of personal effects. I ditched mine first. Clothes, jewelry, mementos, a few pieces of art—some of it real artisan work but not worth a human life. Vula tossed a dozen little sculptures, all gifts from friends and admirers. Eddy was glad to have an excuse to throw out the guitar she’d never learned to play. Treasure had a box of ancient hand-painted dinnerware inherited from her crèche; absolutely irreplaceable, but they went too. Chara threw out her devotional shrine. It was gold and took up most of her mass allowance, but we could fab another.  We even tossed the orang bot. We all liked the furry thing, but it was heavy. Bouche stripped out its proprietary motor modules and tossed the shell. We’d fab another, eventually.  If we’d had time for second thoughts, maybe the decisions would have been more difficult. Or maybe not. People were watching, and we knew it. Having an audience helped us cooperate.  It wasn’t just Jane we were trying to impress. Bouche’s media output was gathering a lot of followers. We weren’t just trapping the drama anymore, we were part of the story.  Bouche monitored our followship, both the raw access stats and the digested analysis from the PR firm she’d engaged to boost the feed’s profile. When the first supply ship backed up to our valve and we began pulling body bags inside, Bouche whooped. Our numbers had just gone atmospheric.  We were a clown show, though. Eight of us crowded in the isthmus sinus, shuttling body bags, everyone bouncing around madly and getting in each other’s way. Jane helped sort us out by monitoring the overhead cameras and doing crowd control. Me, I tried not to be an obstruction while making load-balancing decisions. Though we’d never taken on so much weight at once, I didn’t anticipate any problems. But I only looked at strict mathematical tolerances. I’m not an engineer; I didn’t consider the knock-on effects of the sudden mass shift.  In the end, we took on thirty-eight body bags. We were still distributing them throughout the sinuses when Ricci reported the rescue was over.  That’s it. The cargo ships have forty-five body bags. They’re making the run to the beanstalk now.  Is that all? If the ships are full, we could prune some feedstock.  Everyone else is staying. They’re still betting their whales will move.  When the last body bag was secured so it wouldn’t pitch through a bladder, I might have noticed we were drifting toward the mesa. But I was too busy making sure the new cargo was secure and accounted for.  I pinged each unit, loaded their signatures into the maintenance dashboard, mapped their locations, checked the data in the mass budget, created a new dashboard for monitoring the new cargo’s power consumption, consumables, and useful life. Finally, I cross-checked our manifest against the records the supply ships had given us.  That was when I realized we were carrying two members of my original crew.  When Ricci found me, I was pacing the dorsal sinus, up and down, arguing with myself. Mostly silently.  “If you’re having some kind of emotional crisis, I’m sure Jane would love to help,” she said.  I spun on my heel and stomped away, bouncing off the walls.  She yelled after me. “Not me though. I don’t actually care about your emotional problems.”  I bounced off a wall once more and stopped, both hands gripping its clear ridged surface.  “No?” I asked. “Why don’t you care?”  “Because I’m too self-involved.”  I laughed. Ricci reached out and ruffled her fingers through the short hair on the back of my neck. Her touch sent an electric jolt through my nerves.  “Maybe that’s why we get along so well,” she said softly. “We’re a lot alike.”  Kissing while wearing goggles and a breather is awkward and unsatisfying. I pulled her close and pressed my palms to the soft pad of flesh at the base of her spine. I held her until she got restless, then she took my hand and led me to the rumpus room.  Bouche lounged in the netting, eyes closed.  “Bouchie is giving a media interview,” Ricci whispered. “An agent is booking her appearances and negotiating fees. If we get enough, we can upgrade the extruder and subscribe to a new recipe bank.”  I pulled a bulb out of the extruder. “She’ll be hero of the hab.”  “You could wake them up, you know.”  “Wake up who?” I asked, and took a deep swig of sweet caffeine.  “Your old buddies. In the body bags. Wake them up. Have it out.”  I managed to swallow without choking. “No, I don’t think so.”  “Maybe they’ll apologize.”  I laughed, a little too hard, a little too long, and only stopped when Ricci began to look offended.  “We can’t wake them,” I said. “Where would they sleep until we got to the beanstalk?”  “They can have my hammock.” She sidled close. “I’ll bunk with you.”  We kissed then, and properly. Thoroughly. Until I met Ricci, I’d been a shrunken bladder; nobody knew my possible dimensions. Ricci filled me up. I expanded, large enough to contain whole universes.  “No. They’re old news.” I kissed her again and ran my finger along the edge of her jaw. “It was another life. They don’t matter anymore.”  Strange thing was, saying those words made it true. All I cared about was Ricci, and all I could see was the glowing possibility of a future together, rising over a broad horizon.  Twilight began to move over us. We only had a little time to spare before we recalled the media drones, wiped off the appetite suppressant, and left the other crews to freeze in the dark.  We gathered in the rumpus room, all watching the same feed. Whales circulated above the mesa. Slanting sunlight cast deep orange reflections across their skins, their windward surfaces creamy with blowing snow. Inside, dark spots bounced around the sinuses. If I held my breath, I could almost hear their words, follow their arguments. When I bit my lip, I tasted their tears.  “More than a hundred people,” Jane said. “I still don’t understand why they’d decide to commit suicide. A few maybe, but not so many.”  “Some will evac before it’s too late.” Vula shrugged. “And as for the rest, it’s their own decision. I can’t say I would do anything different. And I hope I never find out.”  I shivered. “Agreed.”  “It doesn’t make sense,” Jane said. “Someone must be exercising duress.”  “Nobody forces anyone to do anything out here, any more than they do down belowground,” said Treasure.  “Yeah,” said Chara. “We’re not crechies, Jane. We do what we want.”  Jane sputtered, trying to apologize.  “It’s okay,” Eddy told her. “We’re all upset. None of us really understand.”  “The whales still might move,” said Bouche. “They can spend a little time in the dark, right Doc?”  I set a timer with a generous margin for error and fired it into the middle of the room. “Eight minutes, then we have to leave. The other whales will have a little more than thirty minutes before they freeze at full dark. Then their bladders burst.”  Chara and Treasure pulled themselves out of the netting.  “We’re not watching this,” Chara said. “If you want to hang overhead and root for them to evac, go ahead.”  We all waved goodnight. The two of them stumped away to their hammock, and silence settled over the rumpus room. Just the whoosh and murmur of the bladders, and the faint skiff of wind over the skin. A few early stars winked through the clouds. They seemed compassionate, somehow. Understanding. Looking at those bright pinpoints, I understood how on ancient Earth, people might use the stars to conjure gods.  I put my arm around Ricci’s shoulders and drew her close. She let me hold her for two minutes, no more, and then she pulled away.  “I can’t watch this either,” she said. “I have to do something.”  “I know.” I drew her hand back just for a moment and planted a kiss on the palm. “It’s hard.”  Vula nodded, and Jane, too. Eddy and Bouche both got up and hugged her. Eleanora kept her head down, hiding her tears. The electrostatic membrane crackled as Ricci left.  “Do you know some of the people down there, Doc?” asked Jane.  “Not anymore,” I said. “Not for a long time.”  We fell quiet again, watching the numbers on the countdown. Ricci had left her shadow beside me. I felt her cold absence; something missing that should be whole. I could have spied on her, see where she’d gone, but no. She deserved her privacy.  The first little quake shuddering through the sinuses told me exactly where she was.  I checked our location, blinked, and then checked it again. We were right over the mesa, above the other whales, all seventeen of them. Wind, bad luck, or instinct had had brought us there—but did it matter? Ricci—her location mattered. She was in the caudal stump, with the waste pellets, and the secondary valve.  No. Ricci, no. I slapped my breather on and launched myself out of the rumpus room, running aft as fast as I could. Don’t do that. Stop.  I lost my footing and bounced hard. You might hit them. You might . . .  Kill them.  When I got to the caudal stump, Ricci was just clicking the last pellet through the valve. If we’d dumped them during the pitch and ditch, none of it would have happened. But dry waste is light. We’d accumulated ten pellets, only five kilograms, so I hadn’t bothered with them.  But a half-kilo pellet falling from a height can do a lot of damage.  I fired the feed into the middle of the sinus. One whale was thrashing on the slushy mesa surface, half-obscured by the concussive debris. Two more were falling, twisting in agony, their bladders tattered and flapping. Another three would have escaped damage, but they circulated into the path of the oncoming pellets, each one burst in turn, as if a giant hand had reached down and squeezed the life out of them.  Ricci was in my arms, then. Both of us quaking, falling to our knees. Holding each other and squeezing hard, as if we could break each other’s bones with the force of our own mistakes.  Six whales. Twenty-two people. All dead.  The other eleven whales scattered. One fled east and plunged through the twilight band into night. Its skin and bladders froze and burst, and its sinus skeleton shattered on the jagged ice. Its crew had been one of the most stubborn—none had evacuated. They all died. Ten people.  In total, thirty-two died because Ricci made an unwise decision.  The remaining ten whales re-congregated over a slushy depression near the beanstalk. Ricci had bought the surviving crews a few more hours, so they tried a solution along the lines Ricci had discovered. Ice climbers use drones with controlled explosive capabilities to stabilize their climbing routes. They tried a test; it worked—the whales fled again, but in the wrong direction and re-congregated close to the leading edge of night.  In the end, the others evacuated. All seventy got in their body bags and called for evac.  By strict accounting, Ricci’s actions led to a positive outcome. I remind her of that whenever I can. She says it doesn’t matter—we don’t play math games with human lives. Dead is dead, and nothing will change that.  And she’s right, because the moment she dumped those pellets, Ricci became the most notorious murderer our planet has ever known.  The other habs insist we hand her over to a conflict resolution panel. They’ve sent negotiators, diplomats—they’ve even sent Jane—but we won’t give her up. To them, that proves we’re dangerous. Criminals. Outlaws.  But we live in the heart of the matter, and we see it a little differently.  Ricci did nothing wrong. It was a desperate situation and she made a desperate call. Any one of us might have done the same thing, if we’d been smart enough to think of it.  We’re a solid band of outlaws, now. Vula, Treasure, Chara, Eddy, Bouche, Eleanora, Ricci, and me. We refuse to play nice with the other habs. They could cut off our feedstock, power, and data, but we’re betting they won’t. If they did, our blood would be on their hands.  So none of us are going anywhere. Why would we leave? The whole planet is ours, with unlimited horizons. Kelly Robson's short fiction has appeared in Clarkesworld, Tor.com, Asimov's Science Fiction, and multiple year's best anthologies. Her book \"Gods, Monsters and the Lucky Peach\" will be published this March from Tor.com Publishing. In 2017, she was a finalist for the 2017 John W. Campbell Award for Best New Writer. Her novella \"Waters of Versailles\" won the 2016 Aurora Award and was a finalist for both the Nebula and World Fantasy Awards. She lives in Toronto with her wife, fellow SF writer A.M. Dellamonica.", "text": "14820 words, novelette\nWe Who Live in the Heart\n2018 Finalist: Theodore A. Sturgeon Memorial Award\nRicci slipped in and out of consciousness as we carried her to the anterior sinus and strapped her into her hammock. Her eyelids drooped but she kept forcing them wide. After we finished tucking her in, she pulled a handheld media appliance out of her pocket and called her friend Jane.\n“You’re late,” Jane said. The speakers flattened her voice slightly. “Are you okay?”\nRicci was too groggy to speak. She poked her hand through the hammock’s electrostatic membrane and panned the appliance around the sinus. Eddy and Chara both waved as the lens passed over them, but Jane was only interested in one thing.\n“Show me your face, Ricci. Talk to me. What’s it like in there?”\nRicci coughed, clearing her throat. “I dunno. It’s weird. I can’t really think.” Her voice slurred from the anesthetic.\nI could have answered Jane, if she’d asked me. The first thing newbies notice is how strange it smells. Human olfaction is primal; scents color our perceptions even when they’re too faint to describe. Down belowground, the population crush makes it impossible to get away from human funk. Out here, it’s the opposite, with no scents our brains recognize. That’s why most of us fill our habs with stinky things—pheromone misters, scented fabrics, ablative aromatic gels.\nEventually, Ricci would get around to customizing the scentscape in her big new hab, but right then she was too busy trying to stay awake. Apparently she’d promised Jane she’d check in as soon as she arrived, and not just a quick ping. She was definitely hurting but the call was duty.\n“There’s people. They’re taking care of me.” Ricci gazed blearily at our orang. “I was carried in by a porter bot. It’s orange and furry. Long arms.”\n“I don’t care about the bot. Tell me about you.”\n“I’m fine, but my ears aren’t working right. It’s too noisy.”\nWe live with a constant circulatory thrum, gassy gurgles and fizzes, whumps, snaps, pops, and booms. Sound waves pulse through every surface, a deep hum you feel in your bones.\nJane took a deep breath, let it out with a whoosh. “Okay. Go to sleep. Call me when you wake up, okay?”\nRicci’s head lolled back, then she jerked herself awake.\n“You should have come with me.”\nJane laughed. “I can’t leave my clients. And anyway, I’d be bored.”\nRicci squeezed her eyes shut, blinked a few times, then forced them wide.\n“No you wouldn’t. There’s seven other people here, and they’re all nuts. You’d already be trying to fix them.”\nVula snorted and stalked out of the sinus, her long black braids slapping her back. The rest of us just smiled and shook our heads. You can’t hold people responsible for what they say when they’re half-unconscious. And anyway, it’s true—we’re not your standard moles. We don’t want to be.\nOnly a mole would think we’d be bored out here. We have to take care of every necessity of life personally—nobody’s going to do it for us. Tapping water is one example. Equipment testing and maintenance is another. Someone has to manage the hygiene and maintenance bots. And we all share responsibility for health and safety. Making sure we can breathe is high on everyone’s our priority list, so we don’t leave it up to chance. Finally, there’s atmospheric and geographical data gathering. Mama’s got to pay the bills. We’re a sovereign sociopolitical entity, population: eight, and we negotiate our own service contracts for everything.\nBut other that, sure, we have all the free time in the world. Otherwise what’s the point? We came out here to get some breathing room—mental and physical. Unlike the moles, we’ve got plenty of both.\nHave you ever seen a tulip? It’s a flowering plant. No nutritional value, short bloom. Down belowground, they’re grown in decorative troughs for special occasions—ambassadorial visits, arts festivals, sporting events, that sort of thing.\nAnyway. Take a tulip flower and stick an ovoid bladder where the stem was and you’ve got the idea. Except big. Really big. And the petals move. Some of us call it Mama. I just call it home.\nThe outer skin is a transparent, flexible organic membrane. You can see right through to the central organ systems. The surrounding bladders and sinuses provide structure and protection. Balloons inside a bigger balloon, filled with helium and hydrogen. The whole organism ripples with iridescence.\nWe live in the helium-filled sinuses. If you get close enough, you can see us moving around inside. We’re the dark spots.\nWhile Ricci slept, I called everyone to the rumpus room for a quick status check. All seven of us lounged in the netting, enjoying the free flowing oxygen/hydrogen mix, goggles and breathers dangling around our necks.\nI led the discussion, as usual. Nobody else can ever be bothered.\n“Thoughts?” I asked.\n“Ricci seems okay,” said Eddy. “And I like what’s-her-name. The mole on the comm.”\n“Jane. Yeah, pretty smile,” said Bouche. “Ricci’s fine. Right Vula?”\nVula frowned and crossed her arms. She’d hooked into the netting right next to the hatch and looked about ready to stomp out.\n“I guess,” she said. “Rude, though.”\n“She was just trying to be funny,” said Treasure. “I can never predict who’ll stick and who’ll bounce. I thought Chara would claw her way back down belowground. Right through the skin and nosedive home.”\nChara grinned. “I still might.”\nWe laughed, but the camaraderie felt forced. Vula had everyone on edge.\n“We’ll all keep an eye on Ricci until she settles in,” Eleanora said. “Are we good here? I need to get back to training. I got a chess tournament, you know.”\n“You always have a tournament.” I surveyed the faces around me, but it didn’t look like anyone wanted to chat.\n“As long as nobody hogs the uplink, I never have any problems,” said Bouche. “Who’s training Ricci?”\n“Who do you think?” I said. We have a rule. Whoever scared off the last one has to train the replacement.\nWe all looked at Vula.\n“Shit,” she said. “I hate training newbies.”\n“Stop running them off then,” said Chara. “Be nice.”\nVula scowled, fierce frown lines scoring her forehead. “I’ve got important work to do.”\nNo use arguing with Vula. She was deep in a creative tangle, and had been for a while.\n“I’ll do it,” I said. “We better train Ricci right if we want her to stick.”\nWhen Ricci woke up, I helped her out of the hammock and showed her how to operate the hygiene station. As soon as she’d hosed off the funk, she called Jane on her appliance.\n“Take off your breather for a moment,” Jane said. “Goggles too. I need to see your face.”\nRicci wedged her fingernails under the seal and pried off her breather. She lifted her goggles. When she grinned, deep dimples appeared on each cheek.\nJane squinted at her through the screen. She nodded, and Ricci replaced the breather. It attached to her skin with a slurp.\n“How do I look?” Ricci asked. “Normal enough for you?”\n“What’s the failure rate on that thing?”\n“Low,” Ricci said.\nPoint two three percent. Which is low unless you’re talking about death. Then it’s high. But we have spares galore. Safety nests here, there, and everywhere. I could have chimed in with the info but Jane didn’t want to hear from me. I stayed well back and let Ricci handle her friend.\n“Has anyone ever studied the long-term effects of living in a helium atmosphere?” Jane asked. “It can’t be healthy.”\n“Eyes are a problem.” Ricci tapped a finger on a goggle lens. “Corneas need oxygen so that’s why we wear these. The hammocks are filled with air, so we basically bathe in oxygen while we’re sleeping. But you’re right. Without that the skin begins to slough.”\nJane made a face. “Ugh.”\n“There’s air in the common area, too—they call it the rumpus room. That’s where they keep the fab and extruder. I’m supposed to be there now. I have to eat and then do an orientation session. Health, safety, all that good stuff.”\n“Don’t forget to take some time to get to know your hab-mates, okay?”\n“I met them when I got here.”\n“One of them is Vula, the artist, right? The sculptor. She’s got to be interesting.”\nRicci shrugged. “She looked grumpy.”\nI was impressed. Pretty perceptive for someone who’d been half-drowned in anesthetic.\n“What’s scheduled after training?”\n“Nothing. That’s the whole point of coming here, right?”\n“I wondered if you remembered.” A smile broke over Jane’s face, star-bright even when glimpsed on a small screen at a distance. “You need rest and recreation.”\n“Relaxation and reading,” Ricci added.\n“Maybe you’ll take up a hobby.”\n“Oh, I will,” said Ricci. “Count on it.”\nYes, I was spying on Ricci. We all were. She seemed like a good egg, but with no recourse to on-the-spot conflict intervention, we play it safe with newbies until they settle in. Anyone who doesn’t like it can pull down a temporary privacy veil to shield themselves from the bugs, but most don’t bother. Ricci didn’t.\nPlus we needed a distraction.\nWhether it’s half a million moles in a hole down belowground or eight of us floating around in the atmosphere, every hab goes through ups and downs. We’d been down for a while. Some of it was due to Vula’s growly mood, the worst one we’d seen for a while, but really, we just needed a shake-up. Whether we realized it or not, we were all looking to Ricci to deliver us from ourselves.\nDuring orientation, Ricci and I had company. Bouche and Eddy claimed they needed a refresher and tagged along for the whole thing. Chara, Treasure, and Eleanora joined us halfway through. Even Vula popped out of her hab for a few moments, and actually made an effort to look friendly.\nWith all the all the chatter and distraction, I wasn’t confident Ricci’s orientation had stuck, so I shadowed her on her first maintenance rotation. The workflow is fully documented, every detail supported by nested step-by-steps and supervised by dedicated project management bugs that help take human error out of the equation. But I figured she deserved a little extra attention.\nLife support is our first priority, always. We clear the air printers, run live tests on the carbon dioxide digesters, and ground-truth the readings on every single sensor. It’s a tedious process, but not even Vula complains. She likes to breathe as much as any of us.\nRicci was sharp. Interested. Not just in the systems that keep us alive, but in the whole organism, its biology, behavior, and habitat. She was even interested in the clouds around and the icy, slushy landscape below. She wanted to know about the weather patterns, wind, atmospheric layers—everything. I answered as best I could, but I was out of the conversational habit.\nThat, and something about the line of her jaw had me tongue-tied.\n“Am I asking too many questions, Doc?” she asked as we stumped back to the rumpus room after checking the last hammock.\n“Let’s keep to the life-and-death stuff for now,” I said.\nWater harvesting is the next priority. To get it, we have to rise to the aquapause. There bright sunlight condenses moisture on the skin and collects in the dorsal runnels, where we tap it for storage.\nAccess to the main inflation gland is just under the rumpus room. Ricci squeezed through the elasticized access valve. The electrostatic membrane pulled her hair into spikes that waved at the PM bots circling her head. I stayed outside and watched her smear hormone ointment on the marbled surface of the gland. Sinuses creaked as bladders began to expand. As we walked through the maze of branching sinuses, I showed her how to brace against the roll and use the momentum to pull herself through the narrow access slots. Once we got to the ring-shaped fore cavity, we hooked our limbs into the netting and waited.\nRainbows rippled across the expanded bladder surfaces. We were nearly spherical, petals furled, and the wind rolled us like an untethered balloon. The motion makes some newbies sick, and they have to dial up anti-nauseant. Not Ricci. She looked around with anticipation, as if she were expecting to see something amazing rise over the vast horizon.\n“Do you ever run into other whales?” she asked.\n“I don’t much care for that term,” I said. It came out gruffer than I intended.\nA dimple appeared at the edge of her breather. “Have you been out here long, Doc?”\n“Yes. Ask me an important question.”\n“Okay.” She waved her hand at the water kegs nested at the bottom of the netting, collapsed into a pile of honeycomb folds. “Why don’t you carry more water?”\n“That’s a good question. You don’t need me to tell you though. You can figure it out. Flip through your dash.”\nThe dimple got deeper. Behind her darkened goggles, her eyelids flickered as she reviewed her dashboards. Naturally it took a little while; our setup was new to her. I rested my chin on my forearms and waited.\nShe surfaced quicker than I expected.\n“Mass budget, right? Water is heavy.”\n“Yes. The mass dashboard also tracks our inertia. If we get too heavy, we can’t maneuver. And heavy things are dangerous. Everything’s tethered and braced, and we have safety nets. But if something got loose, it could punch through a bladder wall. Even through the skin, easy.”\nRicci looked impressed. “I won’t tell Jane about that.”\nWe popped into the aquapause. The sun was about twenty degrees above the horizon. Its clear orange light glanced across the thick violet carpet of helium clouds below. Overhead, the indigo sky rippled with stars.\nBit of a shock for a mole. I let Ricci ogle the stars for a while. Water ran off the skin, a rushing, cascading sound like one of the big fountains down belowground. I cleared my throat. Ricci startled, eyes wide behind her goggles, then she climbed out of the netting and flipped the valve on the overhead tap. Silver water dribbled through the hose and into the battery of kegs, slowing the expanding pleated walls.\nRicci didn’t always fill the quiet spaces with needless chatter. I liked that. We worked in silence until the kegs were nearly full, and when she began to question me again, I welcomed it.\n“Eddy said you were one of the first out here,” Ricci said. “You figured out how to make this all work.”\nI answered with a grunt, and then cursed myself. If I scared her away Vula would never let me forget it.\n“That’s right. Me and a few others.”\n“You took a big risk.”\n“Moving into the atmosphere was inevitable,” I said. “Humans are opportunistic organisms. If there’s a viable habitat, we’ll colonize it.”\n“Takes a lot of imagination to see this as viable.”\n“Maybe. Or maybe desperation. It’s not perfect but it’s better than down belowground. Down there, you can’t move without stepping on someone. Every breath is measured and every minute is optimized for resource resilience. That might be viable, but it’s not human.”\n“I’m not arguing.” Ricci’s voice pitched low, thick with emotion as she gazed at the stars in that deep sky. “I love it here.”\nYeah, she wasn’t a mole anymore. She was one of us already.\nOne by one, the kegs filled and began flexing through their purification routine. We called in the crablike water bots and ran them through a sterilization cycle.\nWater work done, the next task was spot-checking the equipment nests. I let Ricci take the lead, stayed well back as she jounced through the cavities and sinuses. She was enthusiastic, confident. Motivated, even. Most newbies stay hunkered in their hammocks for a lot longer than her.\nWe circled back to the rumpus room, inventoried the nutritional feedstock, and began running tests on the hygiene bots. I settled into the netting and watched Ricci pull a crispy snack out of the extruder.\n“You must know all the other crews. The ones who live in the . . . ” Ricci struggled to frame the concept without offending me.\n“You can call them whales if you want. I don’t like it, but I’ve never managed to find a better word.”\nShe passed me a bulb of cold caffeine.\n“How often do you talk to the people who live in the other whales, Doc?”\n“We don’t have anything to do with them. Not anymore.”\n“How come?”\n“The whole reason we came out here is so we don’t have to put up with anyone else’s crap.”\n“You never see the other whales at all? Not even at a distance?”\nI drained the bulb. “These organisms don’t have any social behavior.”\n“But you must have to talk to them sometimes, don’t you? Share info or troubleshoot?”\nI collapsed the bulb in my fist and threw it to a hygiene bot.\n“You lonely already?”\nRicci tossed her head back and laughed, a full belly guffaw. “Come on, Doc. You have to admit that’s weird.”\nShe was relentless. “Go ahead and make friends with the others if you want,” I growled. “Just don’t believe everything they say. They’ve got their own ways of doing things, and so do we.”\nWe checked the internal data repeaters and then spent the rest of the shift calibrating and testing the sensor array—all the infrastructure that traps the data we sell to the atmospheric monitoring firms. I kept my mouth shut. Ricci maintained an aggressive cheerfulness even though I was about as responsive as a bot. But my glacier-like chilliness—more than ten years in the making—couldn’t resist her. My hermit heart was already starting to thaw.\nIf I’d been the one calling Jane every day, I would have told her the light is weird out here. We stay within the optimal thermal range, near the equator where the winds are comparatively warm and the solar radiation helps keep the temperature in our habitat relatively viable. That means we’re always in daylight, running a race against nightfall, which is good for Mama but not so good for us. Humans evolved to exist in a day-night cycle and something goes haywire in our brains when we mess with that. So our goggles simulate our chosen ratio of light and dark.\nMe, I like to alternate fifty-fifty but I’ll fool with the mix every so often just to shake things up. Vula likes the night so she keeps things dimmer than most. Everyone’s different. That’s what the moles don’t realize, how different some of us are.\n“I did a little digging, and what I found out scared me,” Jane said the next time Ricci checked in. “Turns out there’s huge gaps in atmospheric research. The only area that’s really well monitored is the equator, and only around the beanstalk. Everywhere else, analysis is done by hobbyists who donate a few billable hours here and there.”\nRicci nodded. “That’s what Doc said.”\nHearing my name perked me right up. I slapped down two of my open streams and gave their feed my whole attention.\n“Nobody really knows that much about the organism you’re living inside. Even less about the climate out there, and nearly nothing about the geography, not in detail. I never would have supported this decision if I’d realized how . . . ” Jane’s pretty face contorted as she searched for the word. “How willy-nilly the whole situation is. It’s not safe. I can’t believe it’s even allowed.”\n“Allowed? Who can stop us? People go where they want.”\n“Not if it’s dangerous. You can’t just walk into a sewage treatment facility or air purification plant. It’s unethical to allow people to endanger themselves.”\nRicci snorted, fouling the valves on her breather and forcing her to take a big gulp of helium through her mouth.\n“Not all of us want to be safe, Jane.” The helium made her voice squeaky.\nJane’s expression darkened. “Don’t mock me. I’m worried about you.”\n“I know. I’m sorry,” Ricci squeaked. She exhaled to clear her lungs and took a deep slow breath through her nose. Her voice dropped to its normal register. “Listen, I’ve only been here a few days.”\n“Six,” Jane said.\n“If I see anything dangerous, you’ll be the first to know. Until then, don’t worry. I’m fine. Better than fine. I’m even sleeping. A lot.”\nThat was a lie. The air budget showed Ricci hadn’t seen much of the inside of her hammock. But I wasn’t worried. Exhaustion would catch up with her eventually.\n“There’s something else,” Jane said. “I’ve been asking around about your hab-mates.”\n“Vula’s okay. It’s just that lately none of her work has turned out the way she wants. You know artists. Their professional standards are always unreachable. Set themselves up to fail.”\n“It’s not about Vula, it’s Doc.”\nRicci bounced in her netting. “Oh yeah? Tell me. Because I can’t get a wink out of that one. Totally impervious.”\nI maximized the feed to fill my entire visual field. In the tiny screen in Ricci’s hand, Jane’s dark hair trailed strands across her face and into her mouth. She pushed them back with an impatient flick of her fingers. She was in an atrium, somewhere with stiff air circulation. I could just make out seven decks of catwalk arching behind her, swarming with pedestrians.\n“Pull down a veil,” Jane said. “You might have lurkers.”\n“I do,” Ricci answered. “Four at least. I’m the most entertaining thing inside Mama for quite a while. It doesn’t bother me. Let them lurk.”\nBut Jane insisted, so Ricci pulled down a privacy veil and the bug feed winked out.\nI told myself whatever Jane had found out didn’t matter. It would bear no relation to reality. That’s how gossip works—especially gossip about ancient history. But even so, a little hole opened up under my breastbone, and it ached.\nOnly six days and I already cared what Ricci thought. I wanted her to like me. So I set about trying to give her a reason.\nA few days later, we drifted into a massive storm system. Ricci’s first big one. I didn’t want her to miss it, so I bounced aft and hallooed to her at a polite distance from her hab. She was lounging in her netting, deep in multiple streams, twisting a lock of her short brown hair around her finger.\nShe looked happy enough to see me. No wariness behind her gaze, no chill.\nWe settled in to watch the light show. It was an eye-catcher. Bolts zagged to the peaks of the ice towers below, setting the fog alight with expanding patches of emerald green and acid magenta.\nTwo big bolts forked overhead with a mighty whump. Ricci didn’t even jump.\n“What was that?” she asked.\nI was going to stay silently mysterious, but then remembered I was trying to be friendly.\n“That,” I said, “was lunch.”\nA dark splotch began to coalesce at the spot where the two bolts had caressed each other, a green and violet pastel haze in the thin milky fog. We banked slowly, bladders groaning, massive sinus walls clicking as we changed shape to ride the wind currents up, up, and then the massive body flexed just enough to reveal two petals reaching into the coalescing bacteria bloom.\nRicci launched herself out of the netting and clung to the side of her hab, trying to get a better view of the feeding behavior. When the bloom dissipated, she turned to me.\n“That’s all it does, this whale? Just search for food?”\n“Eat, drink, and see the sights,” I said. “What else does anyone need from life?”\nGood company, I thought, but I didn’t say it.\nThe light show went on for hours. Ricci was fascinated from start to finish. Me, I didn’t see it. I spent the whole storm watching the light illuminate her face.\nWhat else does anyone need from life? That was me trying to be romantic. Clumsy. Also inaccurate.\nWhen we first moved out here, my old friends and I thought our habs would eventually become self-contained. Experience killed that illusion pretty quick. We’re almost as dependent on the planetary civil apparatus as anyone.\nWithout feedstock, for example, we’d either starve or suffocate—not sure which would happen first. It has a lot of mass, so we can’t stockpile much.\nThen there’s power. Funding it is a challenge when you’re supplying eight people as opposed to eight million. No economy of scale in a hab this size. It’s not the power feed itself that’s the problem, but the infrastructure. We’re always on the move, so the feed has to follow us around and provide multiple points of redundancy. Our ambient power supply costs base market value plus a massive buy-back on the research and development.\nData has to follow us around too, but we don’t bother with redundancy. It’s not critical. You’d think it was more important than air, though, if you saw us when the data goes down. Shrieking. Curses. Bouche just about catatonic (she’s a total media junkie). Eleanora wall-eyed with panic especially if she’s in the middle of a tournament (chess is her drug of choice). Vula, Eddy, and me in any state from suave to suicidal depending on what we’re doing when the metaphorical umbilical gets yanked out of our guts.\nTreasure and Chara are the only ones who don’t freak out. Usually they’re too busy boning each other.\nWithout data, we couldn’t stay here, either. If we only had each other to talk to, it’d be a constant drama cycle, but we’re all plugged into the hab cultures down belowground. We’ve got hobbies to groom, projects to tend, performances to cheer, games to play, friends to visit.\nFinally, as an independent political entity, we need brokers and bankers to handle our economic transactions and lawyers to vet our contracts. We all need the occasional look-in from medtechs and physical therapists. And when we need a new crew member, we contract a recruiter.\n“You look tired,” Jane said the next time Ricci called. “I thought you said you were sleeping.”\nRicci hung upside down in her netting. She’d made friends with the orang. It squatted in front of her, holding the appliance while she chatted with Jane.\n“I’ve been digging through some old work.” She dangled her arms, hooked her fingers in the floor grid, and stretched. “I came up with a new approach to my first dissertation.”\nJane gaped. Her mouth worked like she was blowing bubbles.\n“I know,” Ricci added. “I’ll never change, right?”\n“Don’t you try that with me.” Jane’s eyes narrowed. “You have a choice—”\nRicci raised her hands in mock surrender. “Okay. Take it easy.”\n“—you can keep working on getting better, or you can go back to your old habits.”\n“It’s not your fault, Jane. You’re a great therapist.”\n“This isn’t about me, you idiot,” Jane yelled. “It’s about you.”\n“I tried, Jane.” Ricci’s voice was soft, ardent. “I really tried. So hard.”\n“I know you did.” Jane sucked in a deep breath. “Don’t throw away all your progress.”\nThey went on and on like that. I didn’t listen, just checked in now and then to see if they were still at it. I knew Ricci’s story. I’d read the report from the recruiter. The privacy seal had timed out but I remembered the details.\nRight out of the crèche she’d dived into an elite chemical engineering program, the kind every over-fond crèche manager wants for their favorite little geniuses. Sound good, doesn’t it? Isn’t that where you’d want to put your little Omi or Occam, little Carey or Karim? But what crèche managers don’t realize—because their world is full of guided discovery opportunities and subconscious learning stimuli—is that high-prestige programs are grinders. Go ahead, dump a crèche-full of young brilliants inside. Some of them won’t come out whole.\nI know; I went through one myself.\nWhen Ricci crashed out of the chem program within spitting distance of an advanced degree, she bounced to protein engineering. She did a lot of good work there before she cracked. Then she moved into pharmaceutical modeling. A few more years of impressive productivity before it all went up in smoke. By that time she wasn’t young anymore. The damage had accumulated. Her endocrinologist suggested intensive peer counseling might stop the carnage, so in stepped Jane, who applied her pretty smile, her patience, and all her active listening skills to try to gently guide Ricci along a course of life that didn’t include cooking her brain until it scrambled.\nAt the end of that long conversation through the appliance, Ricci agreed to put her old work under lockdown so she could concentrate on the here-and-now. Which meant all her attention was focused on us.\nRicci got into my notes. I don’t keep them locked down; anyone can access them. Free and open distribution of data is a primary force behind the success of the human species, after all. Don’t we all learn that in the crèche?\nMaking data available doesn’t guarantee anyone will look at it, and if they do, chances are they won’t understand it. Ricci tried. She didn’t just skim through, she really studied. Shift after shift, she played with the numbers and gamed my simulation models. Maybe she slept. Maybe not.\nI figured Ricci would come looking for me if she got stumped, so I de-hermited, banged around in the rumpus room, put myself to work on random little maintenance tasks.\nWhen Ricci found me, I was in the caudal stump dealing with the accumulated waste pellets. Yes, that’s exactly what it sounds like: half-kilogram plugs of dry solid waste covered in wax and transferred from the lavs by the hygiene bots. Liquid waste is easy. We vaporize it, shunt it into the gas exchange bladder, and flush it through gill-like permeable membranes. Solid waste, well, just like anyone we’d rather forget about it as long as possible. We rack the pellets until there’s about two hundred, then we jettison them.\nRicci pushed up her goggles and scrubbed knuckles over her red-rimmed eyes.\n“Why don’t you automate this process like you do for liquids?” Ricci asked as she helped me position the rack over the valve.\n“No room for non-essential equipment in the mass budget,” I said.\nI dilated the interior shutter and the first pellet clicked through. A faint pink blush formed around the valve’s perimeter, only visible because I’d dialed up the contrast on my goggles to watch for signs of stress. A little hormone ointment took care of it—not too much or we’d get a band of inflexible scar tissue, and then I’d have to cut out the valve and move it to another location. That’s a long, tricky process and it’s not fun.\n“There’s only two bands of tissue strong enough to support a valve.” I bent down and stroked the creamy striated tissue at my feet. “This is number two, and really, it barely holds. We have to treat it gently.”\n“Why risk it, then? Take it out and just use the main valve.”\nA sarcastic comment bubbled up—have you never heard of a safety exit?—but I gazed into her big brown eyes and it faded into the clouds.\n“We need two valves in case of emergencies,” I mumbled.\nRicci and I watched the pellets plunge through the sky. When they hit the ice slush, the concussive wave kicked up a trail of vapor blooms, concentric rings lit with pinpoints of electricity, so far below each flash just a spark in a violet sea.\nA flock of jellies fled from the concussion, flat shells strobing with reflected light, trains of ribbon-like tentacles flapping behind.\nRicci looked worried. “Did we hit any of them?”\nI shook my head. “No, they can move fast.”\nAfter we’d finished dumping waste, Ricci said, “Say, Doc, why don’t you show me the main valve again?”\nI puffed up a little at that. I’m proud of the valves. Always tinkering, always innovating, always making them a little better. Without the valves, we wouldn’t be here.\nFar forward, just before the peduncle isthmus, a wide band of filaments connects the petals to the bladder superstructure. The isthmus skin is thick with connective tissue, and provides enough structural integrity to support a valve big enough to accommodate a cargo pod.\n“We pulled you in here.” I patted the collar of the shutter housing. “Whoever prepared the pod had put you in a pink body bag. Don’t know why it was such a ridiculous color. When Vula saw it, she said, ‘It’s a girl!’.”\nI laughed. Ricci winced.\n“That joke makes sense, old style,” I explained.\n“No, I get it. Birth metaphor. I’m not a crechie, Doc.”\n“I know. We wouldn’t have picked you if you were.”\n“Why did you pick me?”\nI grumbled something. Truth is, when I ask our recruiter to find us a new hab-mate, the percentage of viable applications approaches zero. We look for a specific psychological profile. The two most important success factors are low self-censoring and high focus. People who say what they think are never going to ambush you with long-fermented resentments, and obsessive people don’t get bored. They know how to make their own fun.\nRicci tapped her fingernail on a shutter blade.\n“Your notes aren’t complete, Doc.” She stared up at me, unblinking. No hint of a dimple. “Why are you hoarding information?”\n“I’m not.”\n“Yes, you are. There’s nothing about reproduction.”\n“That’s because I don’t know very much about it.”\n“The other whale crews do. And they’re worried about it. You must know something, but you’re not sharing. Why?”\nI glared at her. “I’m an amateur independent researcher. My methods aren’t rigorous. It would be wrong to share shaky theories.”\n“The whale crews had a collective research agreement once. You wrote it.”\nShe fired the document at me with a flick of her finger. I slapped it down and flushed it from my buffer.\n“That agreement expired. We didn’t renew.”\n“That’s a lie. You dissolved it and left to find your own whale.”\nI aimed my finger at the bridge of her goggles and jabbed the air. “Yes, I ran away. So did you.”\nShe smiled. “I left a network of habs with a quarter billion people who can all do just fine without me. You ran from a few hundred who need you.”\nRunning away is something I’m good at. I bounced out of there double-time. Ricci didn’t call after me. I wouldn’t have answered if she had.\nThe next time she talked to Jane, Ricci didn’t mention me. I guess I didn’t rate high enough on her list of problems. I didn’t really listen to the details as they chatted. I just liked having their voices in my head while I tinkered with my biosynthesis simulations.\nHalfway through their session, Vula pinged me.\nYou can quit spying, she said. None of us are worried about Ricci anymore.\nI agreed, and shut down the feed.\nRicci’s been asking about you, by the way, Vula added. Your history with the other whales.\nTell her everything.\nYou sure?\nI’ve been spying on her for days. It’s only fair.\nBetter she heard the story from Vula than me. I still can’t talk about it without overheating, and they tell me I’m scary when I’m angry.\nDown belowground the air is thick with rules written and unwritten, the slowly decaying husks of thirty thousand years of human history dragged behind us from Earth, and the most important of these is cooperation for mutual benefit. Humans being human, that’s only possible in conditions of resource abundance—not just actual numerical abundance, but more importantly, the perception of abundance. When humans are confident there’s enough to go around, life is easy and we all get along, right?\nHa.\nCooperation makes life possible, but never easy. Humans are hard to wrangle. Tell them to do one thing and they’ll do the opposite more often than not. One thing we all agree on is that everyone wants a better life. Only problem is, nobody can agree what that means.\nSo we have an array of habs offering a wide variety of socio-cultural options. If you don’t like what your hab offers, you can leave and find one that does. If there isn’t one, you can try to find others who want the same things as you and start your own. Often, just knowing options are available keeps people happy.\nNot everyone, though.\nDown belowground, I simply hated knowing my every breath was counted, every kilojoule measured, every moment of service consumption or contribution accounted for in the transparent economy, every move modeled by human capital managers and adjusted by resource optimization analysts. I got obsessed with the numbers in my debt dashboard; even though it was well into the black all I wanted to do was drive it up as high and as fast as I could, so nobody would ever be able to say I hadn’t done my part.\nMost people never think about their debt. They drop a veil over the dash and live long, happy, ignorant lives, never caring about their billable rate and never knowing whether or not they siphoned off the efforts of others. But for some of us, that debt counter becomes an obsession.\nAn obsession and ultimately an albatross, chained around our necks.\nI dreamed about an independent habitat with abundant space and unlimited horizons. And I wasn’t the only one. When we looked, there it was, floating around the atmosphere.\nWas it dangerous? Sure. But a few firms provide services to risk takers and they’re always eager for new clients. The crews that shuttle ice climbers to the poles delivered us to the skin of a very large whale. I made the first cut myself.\nSolving the problems of life was exhilarating—air, food, water, warmth. We were explorers, just like the mountain climbers of old, ascending the highest peaks wearing nothing but animal hides. Like the first humans. Revolutionary.\nOur success attracted others, and our population grew. We colonized new whales and once we got settled, our problems became more mundane. I have a little patience for administrative details, but the burden soon became agonizing. Unending meetings to chew over our collective agreements, measuring and accounting and debits and credits and assigning value to everyone’s time. This was exactly what we’d escaped. Little more than one year in the clouds, and we were reinventing all the old problems from scratch.\nNobody needs that.\nI stood right in the middle of the rumpus room inside the creature I’d cut into with my own hands and gave an impassioned speech about the nature of freedom and independence, and reminded them all of the reasons we’d left. If they wanted their value micro-accounted, they could go right back down belowground.\nI thought it was a good speech, but apparently not. When it came to a vote, I was the only one blocking consensus.\nI believe—hand-to-heart—if they’d only listened to me and did what I said everything would have been fine and everyone would have been happy. But some people can never really be happy unless they’re making other people miserable. They claimed I was trying to use my seniority, skills, and experience as a lever to exert political force. I’d become a menace. And when they told me I had to submit to psychological management, I left.\nTurned out we’d brought the albatross along with us, after all.\nWhen Jane pinged me a few days later, I was doing the same thing as millions down belowground—watching a newly-arrived arts delegation process down the beanstalk and marveling at their dramatic clothing and prosthetics.\nI pinged her back right away. Even though I knew she would probably needle me about my past, I didn’t hesitate. I missed having Ricci and Jane in my head, and life was a bit lonely without them. Also, I was eager to meet her. I wasn’t the only one; the whole crew was burning with curiosity about Ricci’s pretty friend.\nWhen Jane’s fake melted into reality, she was dressed in a shiny black party gown. Long dark hair pouffed over her shoulders, held off her face with little spider clips that gathered the locks into tufts. Her chair was a spider model too, with eight delicate ruby and onyx legs that cradled her torso.\n“Hi, Doc,” she said. “It’s nice to meet you, finally. I’m a friend of Ricci’s. I think you know that, though.”\nA friend. Not a therapist, peer counselor, or emotional health consultant. That was odd. And then it dawned on me: Jane had been donating her time ever since Ricci joined us. She probably wanted to formalize her contract, start racking up the billable hours.\nWhen I glanced through her metadata, and my heart began to hammer. Jane’s rate was sky high.\n“We can’t float your rate,” I blurted. “Not now. Maybe eventually. But we’d have to find another revenue stream.”\nJane’s head jerked back and her gaze narrowed.\n“That’s not why I pinged you,” she said. “I don’t care about staying billable—I never did. All I want to do is help people.”\nI released a silent sigh of relief. “What can I do for you?”\n“Nothing. I just wanted to say hi and ask how Ricci’s getting along.”\n“Ricci’s fine. Nothing to worry about.” I always get gruff around beautiful women.\nShe brightened. “She’s fitting in with you all?”\n“Yeah. One of the crew. She’s great. I love her.” I bit my lip and quickly added, “I mean we all like her. Even Vula, and she’s picky.”\nI blushed. Badly. Jane noticed, and a gentle smile touched the corners of her mouth. But she was a kind soul and changed the subject.\n“I’ve been wondering something, Doc. Do you mind if I ask a personal question?”\nI scrubbed my hands over my face in embarrassment and nodded.\nShe wheeled her chair a bit closer and tilted toward me. “Do you know what gave you the idea to move to the surface? I mean originally, before you’d ever started looking into the possibility.”\n“Have you read Zane Grey’s Riders of the Purple Sage?” I asked. “You must have.”\n“No.” She looked confused, like I was changing the subject.\n“You should. Here.”\nI tossed her a multi-bookmark compilation. Back down belowground, I’d given them out like candy at a crèche party. She could puzzle through the diction of the ancient original or read it in any number of translations, listen to a variety of audio versions and dramatic readings, or watch any of the hundreds of entertainment docs it had inspired. I’d seen them all.\n“This is really old. Why did you think I’d know it?” She flipped to the summary. “Oh, I see. One of the characters is named is Jane.”\n“Read it. It explains everything.”\n“I will. But maybe you could tell me what to look for?” Her smile made me forget all about my embarrassment.\n“It’s about what humans need to be happy. Sure, we evolved to live in complex interdependent social groups, but before that, we were nomads, pursuing resource opportunities in an open, sparsely populated landscape. That means for some people, solitude and independence are primary values.”\nShe nodded, and I could see she was trying hard to understand.\n“Down belowground, when I was figuring all this out, I tried working with a therapist. When I told him this, he said, ‘We also evolved to suffer and die from violence, disease, and famine. Do you miss that, too?’”\nJane laughed. “I hope you fired him. So one book inspired all this?”\n“It’s not just a book. It’s a way of life. The freedom to explore wide open spaces, to come together with like-minded others and form loose knit communities based on mutual aid, and to know that every morning you’ll wake up looking at an endless horizon.”\n“These horizons aren’t big enough?” She waved at the surrounding virtual space, a default grid with dappled patterns, as if a directional light source were shining through gently fluttering leaves.\n“For some, maybe. For me, pretending isn’t enough.”\n“I’ll read it. It sounds very . . . ” She pursed her lips, looking for the right word. “Romantic.”\nI started to blush again, so I made an excuse and dropped the connection before I made a fool of myself. Then I drifted down to the rumpus room and stripped off my goggles and breather.\n“Whoa,” Bouche said. “Doc, what’s wrong?”\nEleanora turned from the extruder to look at me, then fumbled her caffeine bulb and squirted liquid across her cheek.\n“Wow.” She wiped the liquid up with her sleeve. “I’ve never seen you look dreamy before. What happened?”\nI’m in love, I thought.\n“Jane pinged me,” I said instead.\nBouche called the whole crew. They came at a run. Even Vula.\nIn a small hab, any crumb of gossip can become legendary. I made them beg for the story, then drew it out as long as I could.\n“Can you ask her to ping me?” Eddy asked Ricci when I was done.\n“I would chat with her for more than a couple minutes, unlike Doc,” said Treasure.\nChara grinned lasciviously. “Can I lurk?”\nThe whole crew in one room, awake and actually talking to each other was something Ricci hadn’t seen before, much less all of us howling with laughter and gossiping about her friend. She looked profoundly unsettled. Vula bounced over to the extruder, filled a bulb with her favorite social lubricant, and tossed it to Ricci.\n“Tell us everything about Jane,” Chara said. Treasure waggled her tongue.\n“It’s not like that.” Ricci frowned. “She’s a friend.”\n“Good,” they chorused, and collapsed back onto the netting, giggling.\n“I’ve been meaning to ask—why do you use that hand-held thing to talk to her, anyway?” Chara said. “I’ve never even seen one of those before.”\nRicci shook her head.\n“Come on, Ricci. There’s no privacy here,” Vula said. “You know that. Don’t go stiff on us.”\nRicci joined us in the netting before answering. When she picked a spot beside me, my pulse fluttered in my throat.\n“Jane’s a peer counselor.” She squeezed a sip from the bulb and grimaced at the taste. “The hand-held screen is one of her strategies. Having it around reminds me to keep working on my goals.”\n“Why do you need peer counseling?” asked Chara.\n“Because I . . . ” Ricci looked from face to face, big brown eyes serious. Everyone quieted down. “I was unhappy. Listen, I’ve been talking with some people from the other whale crews. They’ve been having problems for a while now, and it’s getting worse.”\nShe fired a stack of bookmarks into the middle of the room. Everyone began riffling through them, except me.\n“That’s too bad,” I said.\n“Don’t you want to know what’s going on, Doc?” asked Chara.\nI folded my arms and scowled in the general direction of the extruder.\n“No,” I said flatly. “I don’t give a shit about them.”\n“Well, you better,” Vula said. “Because if it’s happening to them, it could happen to us. Look.”\nShe fired a feed from a remote sensing drone into the middle of the room. A group of whales had gathered a hundred meters above a slushy depression between a pair of high ridges. They weren’t feeding, just drifting around aimlessly, dangerously close to each other. When they got close to each other, they unfurled their petals and brushed them along each other’s skin.\nAs we watched, two whales collided. Their bladders bubbled out like a crechie’s squeeze toy until it looked like they would burst. Seeing the two massive creatures collide like that was so upsetting, I actually reached into the feed and tried to push them apart. Embarrassing.\n“Come on Doc, tell us what’s happening,” said Vula.\n“I don’t know.” I tucked my hands into my armpits as if I was cold.\n“We should go help,” said Eddy. “At least we could assist with the evac if they need to bail.”\nI shook my head. “It could be dangerous.”\nEveryone laughed at that. People who aren’t comfortable with risk don’t roam the atmosphere.\n“It might be a disease,” I added, “We should stay as far away as we can. We don’t want to catch it.”\nTreasure pulled a face at me. “You’re getting old.”\nI grabbed my breather and goggles and bounded toward the hatch.\n“Come on Doc, take a guess,” Ricci said.\n“More observation would be required before I’d be comfortable advancing a theory,” I said stiffly. “I can only offer conjecture.”\n“Go ahead, conjecture away,” said Vula.\nI took a moment to collect myself, and then turned and addressed the crew with professorial gravity.\n“It’s possible the other crews haven’t been maintaining the interventions that ensure their whales don’t move into reproductive maturity.”\n“You’re saying the whales are horny?” said Bouche.\n“They look horny,” said Treasure.\n“They’re fascinated with each other,” said Vula.\nVula had put her finger on exactly the thing that was bothering me. Whales don’t congregate. They don’t interact socially. They certainly don’t mate.\n“I’d guess the applicable pseudoneural tissue has regenerated, perhaps incompletely, and their behavior is confused.”\nRicci gestured at the feed, where three whales collided, dragging their petals across each other’s bulging skin. “This isn’t going to happen to us?”\n“No, I said. “Definitely not. Don’t worry. Unlike the others, I’ve been keeping on top of the situation.”\n“But how can you be sure?” And then realization dawned over Ricci’s face. “You knew this was going to happen, didn’t you?”\n“Not exactly.”\nShe launched herself from the netting and bounced toward me. “Why didn’t you share the information? Keeping it secret is just cruel.”\nI backed toward the hatch. “It’s not my responsibility to save the others from their stupid mistakes.”\n“We need to tell them how to fix it. Maybe they can save themselves.”\n“Tell them whatever you want.” I excavated my private notes from lockdown, and fired them into the middle of the room. “I think their best option would be to abandon their whales and find new ones.”\n“That would take months,” Vula said. “Nineteen whales. More than two hundred people.”\n“Then they should start now.” I turned to leave.\n“Wait.” Ricci looked around at the crew. “We have to go help. Right?”\nI gripped the edge of the hatch. The electrostatic membrane licked at my fingertips.\n“Yeah, I want to go,” Bouche said. “I’d be surprised if you didn’t, Doc.”\n“I want to go,” said Treasure.\n“Me too,” Chara chimed in. Eddy and Eleanora both nodded.\nVula pulled down her goggles and launched herself out of the netting. “Whales fucking? What are we waiting for? I’ll start fabbing some media drones.”\nWith all seven of them eager for adventure, our quiet, comfortable little world didn’t stand a chance.\nWe’re not the only humans on the surface. Not quite. Near the south pole a gang of religious hermits live in a deep ice cave, making alcohol the old way using yeast-based fermentation. It’s no better than the extruded version, but some of the habs take pity on them so the hermits can fund their power and feedstock.\nEvery so often one of the hermits gives up and calls for evac. When that happens, the bored crew of a cargo ship zips down to rescue them. Those same ships bring us supplies and new crew. They also shuttle adventurers and researchers around the planet, but mostly they sit idle, tethered halfway up the beanstalk.\nThe ships are beautiful—sleek, fast, and elegant. As for us, when we need to change our position, it’s not quite so efficient. Or fast.\nWhen Ricci found me in the rumpus room, I’d already fabbed my gloves and face mask, and I was watching the last few centimeters of a thick pair of protective coveralls chug through the output.\n“I told the other crews you’d be happy to take a look at the regenerated tissue and recommend a solution, but they refused,” she said. “They don’t like you, do they?”\nI yanked the coveralls out of the extruder.\n“No, and I don’t like them either.” I stalked to the hatch.\n“Can I tag along, Doc?” she asked.\n“You’re lucky I don’t pack you into a body bag and tag you for evac.”\n“I’m really sorry, Doc. I should have asked you before offering your help. When I get an idea in my head, tend to just run with it.”\nShe was all smiles and dimples, with her goggles on her forehead pushing her hair up in spikes and her breather swinging around her neck. A person who looks like that can get away with anything.\n“This is your idea,” I said. “Only fair you get your hands dirty.”\nI fabbed her a set of protective clothing and we helped each other suit up. We took a quick detour to slather appetite suppressant gel on the appropriate hormonal bundle, and then waddled up the long dorsal sinus, arms out for balance. The sinus walls clicked and the long cavity bent around us, but soon the appetite suppressant took hold and we were nearly stationary, dozing gently in the clouds.\nOn either side towered the main float bladders—clear multi-chambered organs rippling with rainbows across their honeycomb-patterned surfaces. Feeder organs pulsed between the bladder walls. The feeders are dark pink at the base, but the color fades as they branch into sprawling networks of tubules reaching through the skin, grasping hydrogen and channeling it into the bladders.\nAt the head of the dorsal sinus, a tall, slot-shaped orifice give us access to the neuronal cavity. I shrugged my equipment bag off my shoulder, and showed Ricci how to secure her face mask over her breather, and climbed in.\nWith the masks on, to talk we had to ping each other. I was still a bit angry so no chit-chat, business only. I handed her the laser scalpel.\nCut right here. I sliced the blade of my gloved hand vertically down the milky surface of the protective tissue. See these scars? I pointed at the gray metallic stripes on either side of the imaginary line I’d drawn. Stay away from them. Just cut straight in between.\nRicci backed away a few steps. I don’t think I’m qualified to do this.\nYou’ve been qualified to draw a line since you were a crechie. When she began to protest again, I cut her off. This was your idea, remember?\nHer hands shook, but the line was straight enough. The pouch deflated, draping over the skeleton of the carbon fiber struts I’d installed way back in the beginning. I pulled Ricci inside and closed the incision behind us with squirts of temporary adhesive. The wound wept drops of fluid that rapidly boiled off, leaving a sticky pink sap-like crust across the iridescent interior surface.\nIs this the whale’s brain? Ricci asked.\nI ignored the question. Ricci knew it was the brain—she’d been studying my notes, after all. She was just trying to smooth my feathers by giving me a chance to show my expertise.\nNot every brain looks like a brain. Yours and mine look like they should be floating in the primordial ocean depths—that’s where we came from, after all. The organ in front of us came from the clouds—a tower of spun glass floss threaded through and through with wispy, feather-like strands that branched and re-branched into iridescent fractals. My mobility control leads were made of copper nanofiber embedded in color-coded silicon filaments: red, green, blue, yellow, purple, orange, and black—a ragged, dull rainbow piercing the delicate depths of an alien brain.\nRicci repeated her question.\nDon’t ask dumb questions, Ricci.\nShe put her hands up in a gesture of surrender and backed away. Not far—no room inside the pouch to shuffle back more than one step.\nThe best I can say is it’s brain-like. I snapped the leads into my fist-sized control interface. The neurons are neuron-like. Is it the whole brain? Is the entire seat of cognition here? I can’t tell because there’s not much cognition to measure. Maybe more than a bacterium, but far less than an insect.\nHow do you measure cognition? Ricci asked.\nControlled experiments, but how do you run experiments on animals this large? All I can tell you is that most people who study these creatures lose interest fast. But here’s a better measure: After more than ten years, a whale has never surprised me.\nBefore today, you mean.\nManeuvering takes a little practice. We use a thumb-operated clicker to fire tiny electrical impulses through the leads and achieve a vague form of directional control. Yes, it’s a basic system. We could replace it with something more elegant but it operates even if we lose power. The control it provides isn’t exactly roll, pitch, and yaw, but it’s effective enough. The margin for error is large. There’s not much to hit.\nNavigation is easy, too. Satellites ping our position a thousand times a second and the data can be accessed in several different navigational aids, all available in our dashboards.\nBut though it’s all fairly easy, it’s not quick. My anger didn’t last long. Not in such close quarters, especially just a few hours after realizing I was in love with her. It was hardly a romantic scene, both of us swathed head-to-toe in protective clothing, passing a navigation controller back and forth as we waggled slowly toward our destination.\nIn between bouts of navigation, I began telling Ricci everything I knew about the organ in front of us: A brain dump about brains, inside a brain. Ha.\nShe was interested; I was flattered by her interest. Age-old story. I treated her to all my theories, prejudices, and opinions, not just about regenerating pseudoneuronal tissue and my methods for culling it, but the entire scientific research apparatus down belowground, the social dynamics of hab I grew up in, and the philosophical underpinnings of the research exploration proposal we used to float our first forays out here.\nThank goodness Ricci was wearing a mask. She was probably yawning so wide I could have checked her tonsils.\nHere. I handed her the control box. You drive the rest of the way.\nWe were aiming for the equator, where the strong, steady winds have carved a smooth canyon bisecting the ice right down to the planet’s iron core. When we need to travel a long distance, riding that wind is the fastest route.\nRicci clicked a directional adjustment, and our heading swung a few degrees back toward the equator.\nWhat does the whale perceive when we do this? Ricci waggled the thumb of her glove above the joystick. When it changes direction, are we luring it or scaring it away?\nServed me right for telling her not to ask simple questions.\nI don’t really know, I admitted.\nMaybe it makes them think other whales are around. What if they want to be together, just like people, but before now they didn’t know how. Maybe you’ve been teaching them.\nMy eyebrows climbed. I’d never considered how we might be influencing whale behavior, aside from the changes we make for our own benefit.\nThat’s an interesting theory, Ricci. Definitely worth looking into.\nWouldn’t it be terrible to be always alone?\nI’d always considered myself a loner. But in that moment, I honestly couldn’t remember why.\nOnce we’re in the equatorial stream, we ride the wind until we get into the right general area. Then we wipe off the appetite suppressant, and hunger sends us straight into the arms of the nearest electrical storm.\nThe urge to feed is a powerful motivator for most organisms. Mama chases all the algae she can find, and gobbles it double-time. For us on the inside, it’s like an old-style history doc. Everyone stays strapped in their hammocks and rides out the weather as we pitch around on the high seas.\nI always enjoy the feeding frenzy; it gets the blood flowing.\nI’d just settled to enjoy the wild ride when Ricci pinged me.\nTwo crews tried surgical interventions on the regenerated tissue. Let me know what you think, okay? Maybe now we can convince them to let you help.\nThe message was accompanied by bookmarks to live feeds from the supply ships.The first feed showed a whale wedging itself backward into a crevasse, its petals waving back and forth as it wiggled deeper into the canyon-like crack in the ice.\nThe other feed showed a whale scraping its main valve along a serrated ridge of ice. Its oval body stretched and flexed, its bladders bulged. Its petals curled inward then snapped into rigid extension as the force of its body crashed down on the ice’s knife edge.\nInside both whales, tiny specks bounced through the sinuses. I could only imagine what the crew was doing—what I would do in that situation. If they wanted to live, they had to leave. Fast.\nA chill slipped under my skin. My fault. If those whales died, if those crews died, I was to blame. Me alone. Not the two crews. They were obviously desperate enough to try anything. I should have contacted them myself, and offered whatever false apologies would get them to accept my help.\nBut chances are it wouldn’t have changed the outcome, except they would have had me to blame. Another entry in my list of crimes.\nFrost spread across my flesh and raised goosebumps. I tugged on my hammock’s buckles to make sure they were secure against the constant pitching and heaving, dialed up the temperature, and snuggled deeper into my quilt. I fired up my simulation model and wandered through towering mountains of pseudoneural tissue, pondering the problem, delving deeper and deeper through chains of crystallized tissue until they danced behind my eyelids. Swirling, stacking, combining, and recombining . . .\nI was nearly asleep when I heard Ricci’s voice.\n“Hey, Doc, can we talk?”\nI thought I was dreaming. But no, she was right outside my hammock, gripping the tethers and getting knocked off her feet with every jolt and flex. Her goggled and masked face was lit by a mad flurry of light from the bolts coruscating in every direction just beyond the skin.\n“Are you nuts?” I yanked open the hammock seal. “Get in here.”\nShe plunged through the electrostatic barrier and rolled to the far side of my bed. When she came up, her hair stood on end with static electricity.\n“Whoa.” She swiped off her goggles and breather, stuffed them in one of the hammock pouches, then flattened the dark nimbus of her hair with her palms and grinned. “It’s wild out there.”\nI pulled my quilt up to my chin and scowled. “That was stupid.”\n“Yeah, I know but you didn’t ping me back. This is an important situation, right? Life or death.”\nI sighed. “If you want to rescue people, there are vocations for that.”\n“Don’t we have a duty to help people when we can?”\n“Some people don’t want to be helped. They just want to be left alone.”\n“Like you?”\n“Nothing you’re doing is helping me, Ricci.”\n“Okay, okay. But if we can figure out a way to help, that’s good too. Better than good. Everyone wins.”\nLying there in my hammock, facing Ricci sprawled at the opposite end and taking up more than half of the space, I finally figured out what kind of person she was.\n“You’re a meddler, Ricci. A busybody. You were wasted in the sciences. You should have studied social dynamics and targeted a career in one-on-one social work.”\nShe laughed.\n“Listen.” I held out my hand, palm up. She took it right away, didn’t hesitate. Her hand was warm. Almost feverish. “If you want to stay in the crew, you have to relax. Okay? We can’t have emergencies every week. None of us are here for that.”\nShe squeezed my hand and nodded.\n“A little excitement is fine, once in a while,” I continued. “Obviously this is an extraordinary situation. But if you keep looking for adventure, we’ll shunt you back to Jane without a second thought.”\nShe twisted the grip into a handshake and gave me two formal pumps. Then she reached for the hammock seal. She would have climbed out into the maelstrom if I hadn’t stopped her.\n“You can’t do that,” I yelled. “No wandering around when we’re in a feeding frenzy. You’ll get killed. Kill us too, if you go through the wrong bladder wall.”\nShe smiled then, like she didn’t believe me, like it was just some excuse to keep her in my hammock. And when she settled back down, it wasn’t at the opposite end. She snuggled in right beside me, companionable as anything, or even more.\n“Don’t you get lonely, Doc?” she asked.\n“Sometimes,” I admitted. “Not much.”\nOur hammocks are roomy, but Ricci didn’t give me much space, and though the tethers absorb movement, we were still jostling against each other.\n“Because you don’t need anybody or anything.” Her voice in my ear, soft as a caress.\n“Something like that.”\n“Maybe, eventually, you’ll change your mind about that.”\nWhat happened next wasn’t my idea. I was long out of practice, but Ricci had my full and enthusiastic cooperation.\nDown belowground, I was a surgeon, and a good one. My specialty was splicing neurons in the lateral geniculate nucleus. My skills were in high demand. So high, in fact, that I had a massive support team.\nI’m not talking about a part-time admin or social facilitator. Anyone can have those. I had an entire cadre of people fully dedicated to making sure that if I spent most of my time working and sleeping, what little time remained would be optimized to support physical, emotional, and intellectual health. All my needs were plotted and graphed. People had meetings to argue, for example, over what type of sex best maintained my healthiest emotional state, and once that was decided, they’d argue over the best way to offer that opportunity to me.\nThat’s just an example. I’m only guessing. They kept the administrative muddle under veil. Day-to-day, I only had contact with a few of my staff, and usually I was too busy with my own work to think about theirs. But for a lot of people, I was a billable-hours bonanza.\nBut despite all their hard work, despite the hedonics modeling, best-practice scenarios, and time-tested decision trees, I burned out.\nIt wasn’t their fault. It was mine. I was, and remain, only human.\nI could have just reduced my surgery time. I could have switched to teaching or coaching other surgeons. But no. Some people approach life like it’s an all-or-nothing game. That’s me. I couldn’t be all, so I decided to become nothing.\nUntil Ricci came along, that is.\nWhen the storm ended, the two of us had to face a gauntlet of salacious grins and saucy comments. I didn’t blush, or at least not much. Ricci had put the spark of life in a part of me that had been dark for far too long. I was proud to have her in my crew, in my hammock, in my life.\nThe whole hab gave us a hard time. The joke that gave them the biggest fits, and made even Vula cling helplessly to the rumpus room netting as she convulsed with laughter, involved the two of us calling for evac and setting up a crèche in the most socially conservative hab down belowground. Something about imagining us in swathed in religious habits and swarming with crechies tweaked everyone’s funny bones.\nRicci weathered the ridicule better than me. I left to fill the water kegs, and by the time I returned, the hilarity had worn itself out.\nThe eight of us lounged in the rumpus room, the netting gently swaying to and fro as we drifted in the bright directional light of the aquapause. Water spilled off the skin and threw dappled shadows across the room. Vula had launched the media drones and we’d all settled down to watch the feeds.\nMore than once I caught myself brainlessly staring at Ricci, but I kept my goggles on so nobody noticed. I hope.\nTwo hundred kilometers to the northwest and far below us, the seventeen remaining whales congregated in the swirling winds above a dome-shaped mesa that calved monstrous sheets of ice down its massive flanks. A dark electrical storm massed on the horizon, with all its promise of rich concentrations of algae, but the whales didn’t move toward it, just kept circulating and converging, plucking at each other’s skin.\nThree hundred kilometers west lay the abandoned corpses of two whales, their deflated bladders draped over warped sinus skeletons half-buried in slush.\nOur media drones got there too late to trap the whales’ death throes, and I was glad. But Vula and Bouche trapped great visuals of the rescue, showing the valiant supply ship crews swooping in to pluck brightly colored body bags out of the air. Maybe the crews put a little more of a spin on their maneuvering than they needed to, but who could blame them? They rarely got a job worth bragging about.\nOne of Bouche’s media broker friends put the rescue feeds out to market. They started getting good play right away. Bouche fired the media licensing statement into the middle of the room. The numbers glowed green and flickered as they climbed.\n“Look at these fees,” she said. “This will underwrite our power consumption for a couple years.”\n“That’s great, Bouchie,” I murmured, and flicked the statement out of my visual field.\nNight was coming, and it presented a hard deadline. If the whales didn’t move before dark, they’d all die.\nRicci moved closer to me in the netting and rested her cheek on my shoulder. I turned my head and touched my lips to her temple, just for a moment. I was deep in my brain simulation, working on the problem. But I kept an eye on the feeds. When the whales collided, I held my breath. As the bladders stretched and budged, I cringed, certain they’d reach their elastic limit and we would see a whale pop, its massive sinuses rupture, its skin tear away and its body plunge to splatter on the icy surface below. But they didn’t. They bounced off each other in slow motion and resumed their aimless circulation.\nHours passed. Eddy got up, extruded a meal, and passed the containers around the netting. Chara and Treasure slipped out of the room. Vula was only half-present—she was working in her studio, sculpting maquettes of popped bladders and painfully twisted corpses.\nEddy yawned. “How long can these whales live without feeding?”\nI forced a stream of breath through my lips, fluttering the fringe of my bangs. “I don’t know. Indefinitely, maybe, if the crews can figure out a way to provide nutrition internally.”\n“If they keep their whales fed, maybe they’ll just keep stumbling around, crashing into each other.” Vula’s voice was slurred, her eyes unfocused as she juggled multiple streams.\n“I’m more worried about nightfall, actually,” I said.\nEver since we’d dragged ourselves out of my hammock, Ricci had been trying to pry information from emergency response up the beanstalk, from the supply ship crews who were circling the site, and from the whale crews. They were getting increasingly frantic as time clicked by, and keeping us informed wasn’t high on their list of priorities.\nI rested my palm on the inside of Ricci’s knee. “Are the other crews talking to you yet?”\nShe sat up straight and gave me a pained smile. “A little. I wasn’t getting anywhere, but Jane’s been giving me some tips.”\nThat woke everyone up. Even Vula snapped right out of her creative fugue.\n“Is Jane helping us?” Chara asked, and when Ricci nodded she demanded, “Why are you keeping her to yourself?”\nRicci shrugged. “Jane doesn’t know anything about whales.”\n“If she’s been helping you maybe she can help us too,” said Eddy.\n“Yeah, come on Ricci, stop hogging Jane.” Bouche raked her fingers through her hair, sculpting it into artful tufts. “I want to know what she thinks of all this.”\n“All right,” Ricci said. “I’ll ask her.”\nA few moments later she fired Jane’s feed into the room and adjusted the perspective so her friend seemed to be sitting in the middle of the room. She wore a baggy black tunic and trousers, and her hair was gathered into a ponytail that draped over the back of her chair. The pinnas of her ears were perforated in a delicate lace pattern.\nTreasure and Chara came barreling down the access sinus and plunged through the hatch. They hopped over to their usual spot in the netting and settled in. Jane waved at them.\n“We’re making you an honorary crew member,” Eddy told Jane. “Ricci has to share you with us. We all get equal Jane time.”\n“I didn’t agree to that,” said Ricci.\n“Fight over me later, when everyone’s safe.” Jane said. “I don’t understand why the other crews are delaying evacuation. Who would risk dying when they can just leave?”\nEveryone laughed.\n“This cadre self-selects for extremists.” Eddy rotated her finger over her head, encompassing all of us in the gesture. “People like us would rather die than back down.”\n“I guess you’re not alone in that,” said Jane. “Every hab has plenty of stubborn people.”\n“But unlike them, we built everything we have,” I said. “That makes it much harder to give up.”\n“Looks like someone finally made a decision, though.” Ricci maximized the main feed. Jane wheeled around to join us at the netting.\nGlowing dots tracked tiny specks across the wide mesa, pursued by flashing trails of locational data. Vula’s media drones zoomed in, showing a succession of brightly colored, hard-shell body bags shunting though the main valves. Sleet built up along their edges, quickly hardening to a solid coating of ice.\n“Quitters,” Treasure murmured under her breath.\nJane looked shocked.\n“If you think you know what you’d do in their place, you’re wrong,” I said. “Nobody knows.”\n“I’d stay,” Treasure said. “I’ll never leave Mama.”\nChara grinned. “Me too. We’ll die together if we had to.”\nBouche pointed at the two of them. “If we ever have to evac, you two are going last.”\nJane’s expression of shock widened, then she gathered herself into a detached and professional calm.\nRicci squeezed my hand. “The supply ships want to shuttle some of the evacuees to us instead of taking them all the way to the beanstalk. How many can we carry?”\nI checked the mass budget and made a few quick calculations. “About twenty. More if we dump mass.” I raised my voice. “Let’s pitch and ditch everything we can. If it’s not enough we can think about culling a little water and feedstock. Is everyone okay with that?”\nTo my surprise, nobody argued. I’d rarely seen the crew move so fast, but with Jane around everyone wanted to look like a hero.\nLife has rarely felt as sunny as it did that day.\nWatching the others abandon their whales was deeply satisfying. It’s not often in life you can count your victories, but each of those candy-colored, human-sized pods was a score for me and a big, glaring zero for my old, unlamented colleagues. I’d outlasted them.\nNot only that, but I had a new lover, a mostly-harmonious crew of friends, and the freedom to go anywhere and do anything I liked, as long as it could be done from within the creature I called home.\nBut mostly, I loved having an important job to do.\nI checked our location to make sure we were far enough away that if the other whales began to drift, they wouldn’t wander into the debris stream. Then we paired into work teams, pulled redundant equipment, ferried it to the main valve, and jettisoned it.\nI kept a tight eye on the mass budget, watched for tissue stress around the valve, and made strict calls on what to chuck and what to keep.\nHygiene and maintenance bots were sacrosanct. Toilets and hygiene stations, too. Safety equipment, netting, hammocks—all essential. But each of us had fifty kilos of personal effects. I ditched mine first. Clothes, jewelry, mementos, a few pieces of art—some of it real artisan work but not worth a human life. Vula tossed a dozen little sculptures, all gifts from friends and admirers. Eddy was glad to have an excuse to throw out the guitar she’d never learned to play. Treasure had a box of ancient hand-painted dinnerware inherited from her crèche; absolutely irreplaceable, but they went too. Chara threw out her devotional shrine. It was gold and took up most of her mass allowance, but we could fab another.\nWe even tossed the orang bot. We all liked the furry thing, but it was heavy. Bouche stripped out its proprietary motor modules and tossed the shell. We’d fab another, eventually.\nIf we’d had time for second thoughts, maybe the decisions would have been more difficult. Or maybe not. People were watching, and we knew it. Having an audience helped us cooperate.\nIt wasn’t just Jane we were trying to impress. Bouche’s media output was gathering a lot of followers. We weren’t just trapping the drama anymore, we were part of the story.\nBouche monitored our followship, both the raw access stats and the digested analysis from the PR firm she’d engaged to boost the feed’s profile. When the first supply ship backed up to our valve and we began pulling body bags inside, Bouche whooped. Our numbers had just gone atmospheric.\nWe were a clown show, though. Eight of us crowded in the isthmus sinus, shuttling body bags, everyone bouncing around madly and getting in each other’s way. Jane helped sort us out by monitoring the overhead cameras and doing crowd control. Me, I tried not to be an obstruction while making load-balancing decisions. Though we’d never taken on so much weight at once, I didn’t anticipate any problems. But I only looked at strict mathematical tolerances. I’m not an engineer; I didn’t consider the knock-on effects of the sudden mass shift.\nIn the end, we took on thirty-eight body bags. We were still distributing them throughout the sinuses when Ricci reported the rescue was over.\nThat’s it. The cargo ships have forty-five body bags. They’re making the run to the beanstalk now.\nIs that all? If the ships are full, we could prune some feedstock.\nEveryone else is staying. They’re still betting their whales will move.\nWhen the last body bag was secured so it wouldn’t pitch through a bladder, I might have noticed we were drifting toward the mesa. But I was too busy making sure the new cargo was secure and accounted for.\nI pinged each unit, loaded their signatures into the maintenance dashboard, mapped their locations, checked the data in the mass budget, created a new dashboard for monitoring the new cargo’s power consumption, consumables, and useful life. Finally, I cross-checked our manifest against the records the supply ships had given us.\nThat was when I realized we were carrying two members of my original crew.\nWhen Ricci found me, I was pacing the dorsal sinus, up and down, arguing with myself. Mostly silently.\n“If you’re having some kind of emotional crisis, I’m sure Jane would love to help,” she said.\nI spun on my heel and stomped away, bouncing off the walls.\nShe yelled after me. “Not me though. I don’t actually care about your emotional problems.”\nI bounced off a wall once more and stopped, both hands gripping its clear ridged surface.\n“No?” I asked. “Why don’t you care?”\n“Because I’m too self-involved.”\nI laughed. Ricci reached out and ruffled her fingers through the short hair on the back of my neck. Her touch sent an electric jolt through my nerves.\n“Maybe that’s why we get along so well,” she said softly. “We’re a lot alike.”\nKissing while wearing goggles and a breather is awkward and unsatisfying. I pulled her close and pressed my palms to the soft pad of flesh at the base of her spine. I held her until she got restless, then she took my hand and led me to the rumpus room.\nBouche lounged in the netting, eyes closed.\n“Bouchie is giving a media interview,” Ricci whispered. “An agent is booking her appearances and negotiating fees. If we get enough, we can upgrade the extruder and subscribe to a new recipe bank.”\nI pulled a bulb out of the extruder. “She’ll be hero of the hab.”\n“You could wake them up, you know.”\n“Wake up who?” I asked, and took a deep swig of sweet caffeine.\n“Your old buddies. In the body bags. Wake them up. Have it out.”\nI managed to swallow without choking. “No, I don’t think so.”\n“Maybe they’ll apologize.”\nI laughed, a little too hard, a little too long, and only stopped when Ricci began to look offended.\n“We can’t wake them,” I said. “Where would they sleep until we got to the beanstalk?”\n“They can have my hammock.” She sidled close. “I’ll bunk with you.”\nWe kissed then, and properly. Thoroughly. Until I met Ricci, I’d been a shrunken bladder; nobody knew my possible dimensions. Ricci filled me up. I expanded, large enough to contain whole universes.\n“No. They’re old news.” I kissed her again and ran my finger along the edge of her jaw. “It was another life. They don’t matter anymore.”\nStrange thing was, saying those words made it true. All I cared about was Ricci, and all I could see was the glowing possibility of a future together, rising over a broad horizon.\nTwilight began to move over us. We only had a little time to spare before we recalled the media drones, wiped off the appetite suppressant, and left the other crews to freeze in the dark.\nWe gathered in the rumpus room, all watching the same feed. Whales circulated above the mesa. Slanting sunlight cast deep orange reflections across their skins, their windward surfaces creamy with blowing snow. Inside, dark spots bounced around the sinuses. If I held my breath, I could almost hear their words, follow their arguments. When I bit my lip, I tasted their tears.\n“More than a hundred people,” Jane said. “I still don’t understand why they’d decide to commit suicide. A few maybe, but not so many.”\n“Some will evac before it’s too late.” Vula shrugged. “And as for the rest, it’s their own decision. I can’t say I would do anything different. And I hope I never find out.”\nI shivered. “Agreed.”\n“It doesn’t make sense,” Jane said. “Someone must be exercising duress.”\n“Nobody forces anyone to do anything out here, any more than they do down belowground,” said Treasure.\n“Yeah,” said Chara. “We’re not crechies, Jane. We do what we want.”\nJane sputtered, trying to apologize.\n“It’s okay,” Eddy told her. “We’re all upset. None of us really understand.”\n“The whales still might move,” said Bouche. “They can spend a little time in the dark, right Doc?”\nI set a timer with a generous margin for error and fired it into the middle of the room. “Eight minutes, then we have to leave. The other whales will have a little more than thirty minutes before they freeze at full dark. Then their bladders burst.”\nChara and Treasure pulled themselves out of the netting.\n“We’re not watching this,” Chara said. “If you want to hang overhead and root for them to evac, go ahead.”\nWe all waved goodnight. The two of them stumped away to their hammock, and silence settled over the rumpus room. Just the whoosh and murmur of the bladders, and the faint skiff of wind over the skin. A few early stars winked through the clouds. They seemed compassionate, somehow. Understanding. Looking at those bright pinpoints, I understood how on ancient Earth, people might use the stars to conjure gods.\nI put my arm around Ricci’s shoulders and drew her close. She let me hold her for two minutes, no more, and then she pulled away.\n“I can’t watch this either,” she said. “I have to do something.”\n“I know.” I drew her hand back just for a moment and planted a kiss on the palm. “It’s hard.”\nVula nodded, and Jane, too. Eddy and Bouche both got up and hugged her. Eleanora kept her head down, hiding her tears. The electrostatic membrane crackled as Ricci left.\n“Do you know some of the people down there, Doc?” asked Jane.\n“Not anymore,” I said. “Not for a long time.”\nWe fell quiet again, watching the numbers on the countdown. Ricci had left her shadow beside me. I felt her cold absence; something missing that should be whole. I could have spied on her, see where she’d gone, but no. She deserved her privacy.\nThe first little quake shuddering through the sinuses told me exactly where she was.\nI checked our location, blinked, and then checked it again. We were right over the mesa, above the other whales, all seventeen of them. Wind, bad luck, or instinct had had brought us there—but did it matter? Ricci—her location mattered. She was in the caudal stump, with the waste pellets, and the secondary valve.\nNo. Ricci, no. I slapped my breather on and launched myself out of the rumpus room, running aft as fast as I could. Don’t do that. Stop.\nI lost my footing and bounced hard. You might hit them. You might . . .\nKill them.\nWhen I got to the caudal stump, Ricci was just clicking the last pellet through the valve. If we’d dumped them during the pitch and ditch, none of it would have happened. But dry waste is light. We’d accumulated ten pellets, only five kilograms, so I hadn’t bothered with them.\nBut a half-kilo pellet falling from a height can do a lot of damage.\nI fired the feed into the middle of the sinus. One whale was thrashing on the slushy mesa surface, half-obscured by the concussive debris. Two more were falling, twisting in agony, their bladders tattered and flapping. Another three would have escaped damage, but they circulated into the path of the oncoming pellets, each one burst in turn, as if a giant hand had reached down and squeezed the life out of them.\nRicci was in my arms, then. Both of us quaking, falling to our knees. Holding each other and squeezing hard, as if we could break each other’s bones with the force of our own mistakes.\nSix whales. Twenty-two people. All dead.\nThe other eleven whales scattered. One fled east and plunged through the twilight band into night. Its skin and bladders froze and burst, and its sinus skeleton shattered on the jagged ice. Its crew had been one of the most stubborn—none had evacuated. They all died. Ten people.\nIn total, thirty-two died because Ricci made an unwise decision.\nThe remaining ten whales re-congregated over a slushy depression near the beanstalk. Ricci had bought the surviving crews a few more hours, so they tried a solution along the lines Ricci had discovered. Ice climbers use drones with controlled explosive capabilities to stabilize their climbing routes. They tried a test; it worked—the whales fled again, but in the wrong direction and re-congregated close to the leading edge of night.\nIn the end, the others evacuated. All seventy got in their body bags and called for evac.\nBy strict accounting, Ricci’s actions led to a positive outcome. I remind her of that whenever I can. She says it doesn’t matter—we don’t play math games with human lives. Dead is dead, and nothing will change that.\nAnd she’s right, because the moment she dumped those pellets, Ricci became the most notorious murderer our planet has ever known.\nThe other habs insist we hand her over to a conflict resolution panel. They’ve sent negotiators, diplomats—they’ve even sent Jane—but we won’t give her up. To them, that proves we’re dangerous. Criminals. Outlaws.\nBut we live in the heart of the matter, and we see it a little differently.\nRicci did nothing wrong. It was a desperate situation and she made a desperate call. Any one of us might have done the same thing, if we’d been smart enough to think of it.\nWe’re a solid band of outlaws, now. Vula, Treasure, Chara, Eddy, Bouche, Eleanora, Ricci, and me. We refuse to play nice with the other habs. They could cut off our feedstock, power, and data, but we’re betting they won’t. If they did, our blood would be on their hands.\nSo none of us are going anywhere. Why would we leave? The whole planet is ours, with unlimited horizons.\nKelly Robson's short fiction has appeared in Clarkesworld, Tor.com, Asimov's Science Fiction, and multiple year's best anthologies. Her book \"Gods, Monsters and the Lucky Peach\" will be published this March from Tor.com Publishing. In 2017, she was a finalist for the 2017 John W. Campbell Award for Best New Writer. Her novella \"Waters of Versailles\" won the 2016 Aurora Award and was a finalist for both the Nebula and World Fantasy Awards. She lives in Toronto with her wife, fellow SF writer A.M. Dellamonica.", "source": "https://clarkesworldmagazine.com/robson_05_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: We Who Live in the Heart by Kelly Robson"}