{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "BDPEJaDT6dwytPdWDSMsUwS5WTM=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Drama Hobbits, Mosquitoes, and Other Negotiations: A Conversation with Cory Doctorow  Cory Doctorow has a pretty straight-forward job. All he has to do is, as he says, \"keep up with new technological developments\" and write prose that makes his readers want to live life as though it were, to borrow from Dennis Lee and Alasdair Gray, the first days of a new and better world. To that end, Doctorow writes with a clear-eye, a biting wit, and a relentless intolerance for social injustice.  A Canadian-born son of teacher-activists, Doctorow is journalist, blogger, speculative fiction writer, and activist. He's also very much an idealist.  \"When I was five they told me I was going to march at my aunt's wedding,\" Doctorow said. \"They said, 'Cory, do you know how to march?' And I said, 'Of course I do!' I mimicked carrying a placard and walking back and forth shouting, 'Not the church and not the state, women must control their fate!' Idealism has been in my make up for a very long time.\"  In addition to co-editing the website Boing Boing, Doctorow has written for such publications as The New York Times, Publisher's Weekly, Wired, and the Guardian. His novels have all been released by Tor, HarperCollins UK, and electronically under the Creative Commons License. They include, Down and Out in the Magic Kingdom, Eastern Standard Tribe, Someone Comes to Town, Someone Leaves Town, and Makers. He's also written two novels for young adults, Little Brother and For the Win.  His other books include the short fiction collections, A Place So Foreign and Eight More, Overclocked: Stories of the Future Present and With a Little Help, and non-fiction, The Complete Idiot's Guide to Publishing Science Fiction and Content: Selected Essays on Technology, Creativity, Copyright, and the Future of the Future. He has won the John W. Campbell Award for Best New Writer, the Locus Award for Best First Novel, The Electronic Frontier Foundation Pioneer Award, the Sunburst Award, and the Prometheus Award, and has been nominated for the Hugo, Nebula, and British Science Fiction Awards.  Last year, Doctorow's quest for a better world took on a new urgency when he became a new parent. He and I spoke while he was touring for his recent novel, For the Win, and our conversation covers topics such as video games, parenting, collective negotiation, and, of course, writing.   How's the tour going?  Tours are great. They're very hard work in that you don't get enough sleep and you're very busy, but fundamentally what you're busy doing is going to places where large groups of people tell you how much they like your books. There are much worse things you could do. I miss my family and I wish I could get more sleep, but in the grand scheme of things [touring] is just not a hardship.  Have there been any strange moments?  There've been a couple pretty weird ones. I've had two funny misunderstandings. A friend of mine was interviewing me for the Guardian over Skype at six in the morning in San Francisco. It was later in the day for her, obviously, and luckily she's a good friend. I forgot the camera was on and answered the phone naked. I'd been up since five but I hadn't gotten dressed yet.  The other funny bit was when a guy came to my signing in Austin and I said, \"What would you like in your book,\" and he said, \"Drama Hobbit.\" I said, \"Drama Hobbit?\" And he said, \"Yeah,\" so I drew him the most dramatic Hobbit I could. I'm not much of a drawer and I said, \"There you go!\" And he said, \"No, no, draw Muhammad.\" Well, nobody knows what he looks like...  Do you ever lose track of where you are and what you're doing?  A couple of times. For all my blithe and macho bluster about how easy a tour is, not sleeping is actually really hard as any new parent will tell you. [Lack of sleep] makes it hard for your brain to work. You don't make long term memories when you don't sleep. This is why parents have second kids, because they literally can't remember how hard the first kid was. [Without sleep], you get disoriented. Several times on this tour I've woken up in a dark hotel room and not remembered which city I was in. I tried to feel my way in the dark to a bathroom that was in a totally different place. Luckily, I found the bathroom or that would have been another, even more embarrassing story about the tour. Has being a parent changed your writing life much—what you write about, when or how you write?  It's changed a little bit about how I write. Working for EFF, the Electronic Frontier Foundation, and having a really, really busy and demanding job, meant that I had to cleanse myself of any urge to be ceremonial when I wrote—to be sure that the universe was all in alignment before I could put my fingers on the keyboard or to have the right music or a cigarette (back when I was a smoker) or whatever. It meant that the only way I could conceivably be a writer was if I wrote whenever there was a minute. The secret to being a writer when you have a baby is: whenever the baby is asleep you write. When the kid's asleep, you do stuff, whether that stuff is relaxing or cleaning the house or whatever that's your moment to do it because you really can't do it when the kid is awake. That's also the secret to being a successful parent. At least for the first kid. I don't know how people with two kids do it. So [parenthood] made me even more disciplined about just writing when the moment presents itself. In terms of subjects, I find myself coming back more to Dennis Lee's aphorism, \"Work as though you lived in the early days of a better nation,\" which Alasdair Gray quoted and which is engraved over the doors of the Scottish Parliament. [My] fiction has an element of didacticism and idealism in it and I find myself thinking about how this might inspire my readers to \"work as though it were the first days of a better nation\" or a better world that my daughter can inherit. Has being a parent given you license—though that's probably not the right word—to be more outwardly idealistic? [Laughing] You know what? I've been pretty idealistic all my life. My mom was a pro-choice feminist activist and in the first photo of me that ever appeared in the newspaper I was being held aloft by Doctor Henry Morgentaler who'd just received the Order of Canada. [He is] the doctor famous for bringing legal abortions to Canada and he was forever being arrested before abortions were legal. [The picture was taken] at a fundraiser for him at a restaurant in Toronto. I was about four, wearing a spiffy tartan suit. [Idealism] has been in my blood forever. Both of your parents were teachers and activists. Did you ever go through a period of rebellion against their worldview?  It's funny. We have this notion, probably from watching sitcoms like Family Ties, that the opposite of an activist is a conservative. But that's not the opposite of an activist. The opposite of an activist is a civilian. It's someone who actually just doesn't care about politics. To go back to Family Ties, the person who is most in opposition to the parents wasn't the Michael J. Fox character—I can't believe I'm doing this with Family Ties—it was the sister, the one who was a beauty queen. She had no firmly held beliefs of any kind on any social issue. That really is the exact opposite of being a political person.  The opposite of love is not hate, it's indifference. Love and hate are at least on the same axis. They are both firmly held beliefs. They just happen to be polar opposite firmly held beliefs. But on that one criteria—is this belief strongly held?—they're identical.  I've had and have quibbles with my parents' political beliefs. I'm skeptical, for example, of the centralist urge of Marxism and I think that Marxism and Keynesianism and other market ideologies are built on worlds in which they really couldn't conceive that goods that were scarce might become less scarce by demand. Like the Napster economy where the more people there are who want a song the more copies there are that appear all over the internet and the less scarce it becomes. This is the reverse of all our traditional economic thinking in which things that people want a lot of, the supply of it dwindles.  As you've been traveling across the States, have you run into much resistance to your advocacy of unions in For the Win?  The only thing that really exercises parents, teachers, and school boards is sex and particularly gay sex, which I've yet to write, but which I must do someday just for the sheer pleasure of attracting that malicious approbation.  I wrote a book, Little Brother, for young people, which is essentially a manual for over-throwing the state. And the only thing that I've ever had a complaint about from an authority figure was that the kids sassed their elders, drank beer, and that a 17-year-old and an 18-year-old, both of whom are deeply in love and in a committed relationship, put on a condom, wriggle their eyebrows at each other, and the chapter ends. The next chapter strongly implies that they've just lost their virginity to each other. The message from authority figures seems to be, by all means tell them how to overthrown the state if you must, but you must never imply that 17 and 18-year-olds have sex—let alone safe sex.  There are plenty of excesses in the trade union movement. I would be the first to admit that the trade union movement has done some bad and dumb things in its history. People whose job it is to solve a problem often end up being people whose job it is to preserve the problem, so they can go on solving it. But collective negotiation is an unalloyed good. Groups of people who can get together and negotiate collectively in their interests are what make the world go 'round.  If you shop at Costco, you're doing collective negotiation. You and your neighbors have joined, essentially, a co-op that buys goods in bulk in order to command better prices. That's what collective negotiation is. If you've ever gotten a group rate for a bunch of friends or for your wedding party at the local hotel, that's collective negotiation. It's a bunch of people who realize that together they have more power than they would've had individually. I've yet to have any critic of the labor movement explain to me how it is that workers are supposed to balance their power and their employer's power, apart from gathering together and negotiating as a group. It seems pretty obvious to me that a single worker who goes to her employer and says, \"I feel like the way that you work me is unfair and I've got these suppurating wounds from work without adequate protective gear. I think that you should take some of your profits and divert it to safety equipment\"—why wouldn't that worker just be shown the door if it wasn't for either regulations that rose in the wake of the trade union movement or from the trade unions themselves. So, I think, there are lots of things the trade union movement has gotten wrong over the years and continues to get wrong, but I do think the trade union movement is pretty necessary.  What is it about workers organizing that threatens people?  One of the great tricks of the ruling elite in America is to convince every poor person that he is a rich person in waiting. There are a lot of workers who, when they think about their interests, think, \"Well, eventually I'm going to own a factory and when that happens I want to get a better deal out of my work force and I won't be able to do that if there are trade unions around.\"  There has been a very successful movement convincing people that unions do more harm than good. Or that the need for unions is past. Anyone who's ever enjoyed a weekend off, an eight hour day, a forty hour week, safety equipment at the office, or the pleasure of having children who aren't mangled by industrial machinery has the unions to thank for it. [Unions] can be cumbersome sometimes. Certainly I've chaffed at a science fiction convention when, for example, we wanted to plug in another microphone and we couldn't do it because there was a union rule. We probably need some regress of that. And there are unions that have been captured by organized crime over the years. But the excesses of capital and corporations are numerous as well and you sound like a radical loony when you call for their abolition. Nevertheless, it seems pretty obvious to me that companies have done all kinds of crazy and terrible things, all over the world, all the time.  Does your being Canadian give you a clearer few of all this? Does it help you see through the \"poor person in waiting\" idea?  There are lots of Americans who don't feel that way. I don't think it's unique to Canadians. And Canadians have elected four consecutive conservative governments. So we certainly don't have a monopoly on progressive thought.  Canadians do have a small advantage, at the best of times, understanding American society because we're close to it but not inside of it. It's the same advantage that the unpopular kid has in becoming an anthropologist of the schoolyard. He's there, in the thick of it, but he's not a part of it. Its cherished illusions pass him by. That's why there are so many Canadian comedians and writers who are so well liked in America.  Speaking of schools and schoolyards, I recently taught in a high school that required all students to have a laptop. I was continually surprised by the growing antagonism and hostility toward computers and computer games from other teachers and parents. Elsewhere you've said—and I'm paraphrasing—that with technology fluency comes from play, experimentation, and failure. That suggests that computers and other technologies are ideally suited for the classroom.  In some ways it's not new. There's a wonderful Tom Standish article in Wired Magazine some years ago about the moral panic over games which is a retrospective look at other moral panics. The first one he was able to identify was over the waltz and the negative effect the waltz would have on America's young people's morals. It would distract them from more serious and important things and so on. You can almost trade the word \"game\" for \"waltz.\"  The other media that have been villainized in America include the novel, which was going to be the corrupting downfall of young ladies, jazz (of course), rock and roll (doubly, of course), movies, comics, science fiction. We burned comics by the mountain full after Seduction of the Innocent [by Fredric Wertham] was published [in 1954].  In some ways it's not video games, it's whatever it is that young people are doing that is not immediately accessible to their elders. Video games, of course, have the double whammy of not only being a medium whose virtues may not be immediately accessible to their elders but also a medium that provides for a kids-only conversational space that elders can't effectively wire-tap or control. It's a place where kids can actually talk to each other.  When you play a World of Warcraft mission that requires that you gather up 50 or 60 other people and go make war on some imaginary monster for four hours together— that's the second game you play. The first game you play is the old game of \"how do you convince 50 or 60 people to come and hang out with you for several hours.\" That's a game we've been playing since we got neocortices and it's probably the most satisfying game our brains know about.  Is it somehow less of a human interaction if we do it through a machine? Is there less communication, less developing of empathy, more hiding behind a screen name? These seem to be many of the concerns floating about.  There's another example of selective amnesia, right? Of causality going in the wrong direction. The reason kids don't go outside is because we prohibit them from all public spaces. If they play video games more avidly than they might've a generation ago, it's partly due to the fact that we've replaced parks with malls that don't allow kids to hang out in them.  In England, we have this thing called the \"Mosquito.\" Do you know about the Mosquito? It's a sound generator that creates a tone that you can't hear when you get older. It's incredibly annoying. It's used to keep young people from congregating. It's a one-two punch. On the one hand, you fear young people in groups and their delinquency and, on the other hand, you fear for young people in groups and the notional stalking pedophile who will come and snatch them up. We've essentially prevented young people from going anywhere. Video games present a really important escape valve from adult scrutiny and restrictions on mobility.  This is an extremely convenient way to think about video games after fifteen years of listening to fear mongers tell you that you must never let your children out of your sight. To then say, \"My kid never goes out of doors is because he plays too many games because I've prohibited him from doing so.\" I think we do have an intuition that bubble-wrapping our kids and chaining them to the front yard is pretty bad for them, but at the same time we've been told over and over again that failing to do so makes you a bad parent because of all the stalkery pedophiles out there then you're kind of caught as a parent between a rock and a hard place.  In terms of whether or not games constitute a real form of communication... mediated communication is real communication. We've had that question for a long time. There were people who thought the interstate highway system would destroy community because real conversation was talking to people who lived close to you. It wasn't conversations with random drifters who came in and out of town. You couldn't have a meaningful conversation unless you were having it with someone who shared your frame of reference and who was talking about stuff that mattered to you.  Neil Postman wrote a pretty good book about this called Amusing Ourselves to Death. He pointed out Thoreau saying we're so anxious to complete the telegraph between Atlanta and Boston, I think it was, but it may be that Atlanta and Boston have nothing to say to one another. We're so eager to complete the trans-Atlantic telegraph line, but it may be that the first thing that crosses that line and enters the broad, flapping American ear is that Princess Anne has the whooping cough.  People have been saying the communications that are sui generis to new media are trivial and illegitimate or less real for as long as we've had new media. Maybe this is part of the aphorism my friend Jim Griffon likes, which I think maybe Douglas Adams originated, which is, [something to the effect of], Everything invented before you were twenty has been there forever. Everything invented before you were thirty is the most revolutionary technology ever, and anything invented after that should be banned.  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nDrama Hobbits, Mosquitoes, and Other Negotiations: A Conversation with Cory Doctorow\nCory Doctorow has a pretty straight-forward job. All he has to do is, as he says, \"keep up with new technological developments\" and write prose that makes his readers want to live life as though it were, to borrow from Dennis Lee and Alasdair Gray, the first days of a new and better world. To that end, Doctorow writes with a clear-eye, a biting wit, and a relentless intolerance for social injustice.\nA Canadian-born son of teacher-activists, Doctorow is journalist, blogger, speculative fiction writer, and activist. He's also very much an idealist.\n\"When I was five they told me I was going to march at my aunt's wedding,\" Doctorow said. \"They said, 'Cory, do you know how to march?' And I said, 'Of course I do!' I mimicked carrying a placard and walking back and forth shouting, 'Not the church and not the state, women must control their fate!' Idealism has been in my make up for a very long time.\"\nIn addition to co-editing the website Boing Boing, Doctorow has written for such publications as The New York Times, Publisher's Weekly, Wired, and the Guardian. His novels have all been released by Tor, HarperCollins UK, and electronically under the Creative Commons License. They include, Down and Out in the Magic Kingdom, Eastern Standard Tribe, Someone Comes to Town, Someone Leaves Town, and Makers. He's also written two novels for young adults, Little Brother and For the Win.\nHis other books include the short fiction collections, A Place So Foreign and Eight More, Overclocked: Stories of the Future Present and With a Little Help, and non-fiction, The Complete Idiot's Guide to Publishing Science Fiction and Content: Selected Essays on Technology, Creativity, Copyright, and the Future of the Future. He has won the John W. Campbell Award for Best New Writer, the Locus Award for Best First Novel, The Electronic Frontier Foundation Pioneer Award, the Sunburst Award, and the Prometheus Award, and has been nominated for the Hugo, Nebula, and British Science Fiction Awards.\nLast year, Doctorow's quest for a better world took on a new urgency when he became a new parent. He and I spoke while he was touring for his recent novel, For the Win, and our conversation covers topics such as video games, parenting, collective negotiation, and, of course, writing.\nHow's the tour going?\nTours are great. They're very hard work in that you don't get enough sleep and you're very busy, but fundamentally what you're busy doing is going to places where large groups of people tell you how much they like your books. There are much worse things you could do. I miss my family and I wish I could get more sleep, but in the grand scheme of things [touring] is just not a hardship.\nHave there been any strange moments?\nThere've been a couple pretty weird ones. I've had two funny misunderstandings. A friend of mine was interviewing me for the Guardian over Skype at six in the morning in San Francisco. It was later in the day for her, obviously, and luckily she's a good friend. I forgot the camera was on and answered the phone naked. I'd been up since five but I hadn't gotten dressed yet.\nThe other funny bit was when a guy came to my signing in Austin and I said, \"What would you like in your book,\" and he said, \"Drama Hobbit.\" I said, \"Drama Hobbit?\" And he said, \"Yeah,\" so I drew him the most dramatic Hobbit I could. I'm not much of a drawer and I said, \"There you go!\" And he said, \"No, no, draw Muhammad.\" Well, nobody knows what he looks like...\nDo you ever lose track of where you are and what you're doing?\nA couple of times. For all my blithe and macho bluster about how easy a tour is, not sleeping is actually really hard as any new parent will tell you. [Lack of sleep] makes it hard for your brain to work. You don't make long term memories when you don't sleep. This is why parents have second kids, because they literally can't remember how hard the first kid was.[Without sleep], you get disoriented. Several times on this tour I've woken up in a dark hotel room and not remembered which city I was in. I tried to feel my way in the dark to a bathroom that was in a totally different place. Luckily, I found the bathroom or that would have been another, even more embarrassing story about the tour.\nHas being a parent changed your writing life much—what you write about, when or how you write?\nIt's changed a little bit about how I write. Working for EFF, the Electronic Frontier Foundation, and having a really, really busy and demanding job, meant that I had to cleanse myself of any urge to be ceremonial when I wrote—to be sure that the universe was all in alignment before I could put my fingers on the keyboard or to have the right music or a cigarette (back when I was a smoker) or whatever. It meant that the only way I could conceivably be a writer was if I wrote whenever there was a minute. The secret to being a writer when you have a baby is: whenever the baby is asleep you write. When the kid's asleep, you do stuff, whether that stuff is relaxing or cleaning the house or whatever that's your moment to do it because you really can't do it when the kid is awake. That's also the secret to being a successful parent. At least for the first kid. I don't know how people with two kids do it. So [parenthood] made me even more disciplined about just writing when the moment presents itself.In terms of subjects, I find myself coming back more to Dennis Lee's aphorism, \"Work as though you lived in the early days of a better nation,\" which Alasdair Gray quoted and which is engraved over the doors of the Scottish Parliament. [My] fiction has an element of didacticism and idealism in it and I find myself thinking about how this might inspire my readers to \"work as though it were the first days of a better nation\" or a better world that my daughter can inherit.\nHas being a parent given you license—though that's probably not the right word—to be more outwardly idealistic?[Laughing] You know what? I've been pretty idealistic all my life. My mom was a pro-choice feminist activist and in the first photo of me that ever appeared in the newspaper I was being held aloft by Doctor Henry Morgentaler who'd just received the Order of Canada. [He is] the doctor famous for bringing legal abortions to Canada and he was forever being arrested before abortions were legal. [The picture was taken] at a fundraiser for him at a restaurant in Toronto. I was about four, wearing a spiffy tartan suit. [Idealism] has been in my blood forever.\nBoth of your parents were teachers and activists. Did you ever go through a period of rebellion against their worldview?\nIt's funny. We have this notion, probably from watching sitcoms like Family Ties, that the opposite of an activist is a conservative. But that's not the opposite of an activist. The opposite of an activist is a civilian. It's someone who actually just doesn't care about politics. To go back to Family Ties, the person who is most in opposition to the parents wasn't the Michael J. Fox character—I can't believe I'm doing this with Family Ties—it was the sister, the one who was a beauty queen. She had no firmly held beliefs of any kind on any social issue. That really is the exact opposite of being a political person.\nThe opposite of love is not hate, it's indifference. Love and hate are at least on the same axis. They are both firmly held beliefs. They just happen to be polar opposite firmly held beliefs. But on that one criteria—is this belief strongly held?—they're identical.\nI've had and have quibbles with my parents' political beliefs. I'm skeptical, for example, of the centralist urge of Marxism and I think that Marxism and Keynesianism and other market ideologies are built on worlds in which they really couldn't conceive that goods that were scarce might become less scarce by demand. Like the Napster economy where the more people there are who want a song the more copies there are that appear all over the internet and the less scarce it becomes. This is the reverse of all our traditional economic thinking in which things that people want a lot of, the supply of it dwindles.\nAs you've been traveling across the States, have you run into much resistance to your advocacy of unions in For the Win?\nThe only thing that really exercises parents, teachers, and school boards is sex and particularly gay sex, which I've yet to write, but which I must do someday just for the sheer pleasure of attracting that malicious approbation.\nI wrote a book, Little Brother, for young people, which is essentially a manual for over-throwing the state. And the only thing that I've ever had a complaint about from an authority figure was that the kids sassed their elders, drank beer, and that a 17-year-old and an 18-year-old, both of whom are deeply in love and in a committed relationship, put on a condom, wriggle their eyebrows at each other, and the chapter ends. The next chapter strongly implies that they've just lost their virginity to each other. The message from authority figures seems to be, by all means tell them how to overthrown the state if you must, but you must never imply that 17 and 18-year-olds have sex—let alone safe sex.\nThere are plenty of excesses in the trade union movement. I would be the first to admit that the trade union movement has done some bad and dumb things in its history. People whose job it is to solve a problem often end up being people whose job it is to preserve the problem, so they can go on solving it. But collective negotiation is an unalloyed good. Groups of people who can get together and negotiate collectively in their interests are what make the world go 'round.\nIf you shop at Costco, you're doing collective negotiation. You and your neighbors have joined, essentially, a co-op that buys goods in bulk in order to command better prices. That's what collective negotiation is. If you've ever gotten a group rate for a bunch of friends or for your wedding party at the local hotel, that's collective negotiation. It's a bunch of people who realize that together they have more power than they would've had individually. I've yet to have any critic of the labor movement explain to me how it is that workers are supposed to balance their power and their employer's power, apart from gathering together and negotiating as a group. It seems pretty obvious to me that a single worker who goes to her employer and says, \"I feel like the way that you work me is unfair and I've got these suppurating wounds from work without adequate protective gear. I think that you should take some of your profits and divert it to safety equipment\"—why wouldn't that worker just be shown the door if it wasn't for either regulations that rose in the wake of the trade union movement or from the trade unions themselves. So, I think, there are lots of things the trade union movement has gotten wrong over the years and continues to get wrong, but I do think the trade union movement is pretty necessary.\nWhat is it about workers organizing that threatens people?\nOne of the great tricks of the ruling elite in America is to convince every poor person that he is a rich person in waiting. There are a lot of workers who, when they think about their interests, think, \"Well, eventually I'm going to own a factory and when that happens I want to get a better deal out of my work force and I won't be able to do that if there are trade unions around.\"\nThere has been a very successful movement convincing people that unions do more harm than good. Or that the need for unions is past. Anyone who's ever enjoyed a weekend off, an eight hour day, a forty hour week, safety equipment at the office, or the pleasure of having children who aren't mangled by industrial machinery has the unions to thank for it. [Unions] can be cumbersome sometimes. Certainly I've chaffed at a science fiction convention when, for example, we wanted to plug in another microphone and we couldn't do it because there was a union rule. We probably need some regress of that. And there are unions that have been captured by organized crime over the years. But the excesses of capital and corporations are numerous as well and you sound like a radical loony when you call for their abolition. Nevertheless, it seems pretty obvious to me that companies have done all kinds of crazy and terrible things, all over the world, all the time.\nDoes your being Canadian give you a clearer few of all this? Does it help you see through the \"poor person in waiting\" idea?\nThere are lots of Americans who don't feel that way. I don't think it's unique to Canadians. And Canadians have elected four consecutive conservative governments. So we certainly don't have a monopoly on progressive thought.\nCanadians do have a small advantage, at the best of times, understanding American society because we're close to it but not inside of it. It's the same advantage that the unpopular kid has in becoming an anthropologist of the schoolyard. He's there, in the thick of it, but he's not a part of it. Its cherished illusions pass him by. That's why there are so many Canadian comedians and writers who are so well liked in America.\nSpeaking of schools and schoolyards, I recently taught in a high school that required all students to have a laptop. I was continually surprised by the growing antagonism and hostility toward computers and computer games from other teachers and parents. Elsewhere you've said—and I'm paraphrasing—that with technology fluency comes from play, experimentation, and failure. That suggests that computers and other technologies are ideally suited for the classroom.\nIn some ways it's not new. There's a wonderful Tom Standish article in Wired Magazine some years ago about the moral panic over games which is a retrospective look at other moral panics. The first one he was able to identify was over the waltz and the negative effect the waltz would have on America's young people's morals. It would distract them from more serious and important things and so on. You can almost trade the word \"game\" for \"waltz.\"\nThe other media that have been villainized in America include the novel, which was going to be the corrupting downfall of young ladies, jazz (of course), rock and roll (doubly, of course), movies, comics, science fiction. We burned comics by the mountain full after Seduction of the Innocent [by Fredric Wertham] was published [in 1954].\nIn some ways it's not video games, it's whatever it is that young people are doing that is not immediately accessible to their elders. Video games, of course, have the double whammy of not only being a medium whose virtues may not be immediately accessible to their elders but also a medium that provides for a kids-only conversational space that elders can't effectively wire-tap or control. It's a place where kids can actually talk to each other.\nWhen you play a World of Warcraft mission that requires that you gather up 50 or 60 other people and go make war on some imaginary monster for four hours together— that's the second game you play. The first game you play is the old game of \"how do you convince 50 or 60 people to come and hang out with you for several hours.\" That's a game we've been playing since we got neocortices and it's probably the most satisfying game our brains know about.\nIs it somehow less of a human interaction if we do it through a machine? Is there less communication, less developing of empathy, more hiding behind a screen name? These seem to be many of the concerns floating about.\nThere's another example of selective amnesia, right? Of causality going in the wrong direction. The reason kids don't go outside is because we prohibit them from all public spaces. If they play video games more avidly than they might've a generation ago, it's partly due to the fact that we've replaced parks with malls that don't allow kids to hang out in them.\nIn England, we have this thing called the \"Mosquito.\" Do you know about the Mosquito? It's a sound generator that creates a tone that you can't hear when you get older. It's incredibly annoying. It's used to keep young people from congregating. It's a one-two punch. On the one hand, you fear young people in groups and their delinquency and, on the other hand, you fear for young people in groups and the notional stalking pedophile who will come and snatch them up. We've essentially prevented young people from going anywhere. Video games present a really important escape valve from adult scrutiny and restrictions on mobility.\nThis is an extremely convenient way to think about video games after fifteen years of listening to fear mongers tell you that you must never let your children out of your sight. To then say, \"My kid never goes out of doors is because he plays too many games because I've prohibited him from doing so.\" I think we do have an intuition that bubble-wrapping our kids and chaining them to the front yard is pretty bad for them, but at the same time we've been told over and over again that failing to do so makes you a bad parent because of all the stalkery pedophiles out there then you're kind of caught as a parent between a rock and a hard place.\nIn terms of whether or not games constitute a real form of communication... mediated communication is real communication. We've had that question for a long time. There were people who thought the interstate highway system would destroy community because real conversation was talking to people who lived close to you. It wasn't conversations with random drifters who came in and out of town. You couldn't have a meaningful conversation unless you were having it with someone who shared your frame of reference and who was talking about stuff that mattered to you.\nNeil Postman wrote a pretty good book about this called Amusing Ourselves to Death. He pointed out Thoreau saying we're so anxious to complete the telegraph between Atlanta and Boston, I think it was, but it may be that Atlanta and Boston have nothing to say to one another. We're so eager to complete the trans-Atlantic telegraph line, but it may be that the first thing that crosses that line and enters the broad, flapping American ear is that Princess Anne has the whooping cough.\nPeople have been saying the communications that are sui generis to new media are trivial and illegitimate or less real for as long as we've had new media. Maybe this is part of the aphorism my friend Jim Griffon likes, which I think maybe Douglas Adams originated, which is, [something to the effect of], Everything invented before you were twenty has been there forever. Everything invented before you were thirty is the most revolutionary technology ever, and anything invented after that should be banned.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/doctorow_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Drama Hobbits, Mosquitoes, and Other Negotiations: A Conversation with Cory Doctorow by Jeremy L. C. Jones"}