{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "GW90IjG2xO85QGGRoYiXC6PW1ZE=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Living Raw and Out Loud: A Conversation with Rebecca Roanhorse  Before you ever heard of her, Rebecca Roanhorse was already on her way to glory. In 2018, she showed up in Pittsburgh for the Annual Nebula Awards Conference, nominated for her first publication: “Welcome to Your Authentic Indian Experience™” (Apex Magazine 8/17). In front of a crowd of professional authors and publishers, almost all of whom were strangers to her, she won the award for Best Short Story. During that same conference she revealed to me that she’d already signed three separate book deals with two different publishers, for multiple books.  Roanhorse was born in Conway, AR and grew up in Fort Worth, TX. She earned a BA in Religious Studies from Yale University and an MA in Theology from Union Theological Seminary, and then a JD from the University of New Mexico School of Law, specializing in Federal Indian Law. She attended the VONA/Voices workshop in 2015.  Her debut novel, Trail of Lightning, came out with Saga Press in 2018, beginning The Sixth World series. Star Wars: Resistance Reborn was published in 2019 with Del Rey. In 2020 her middle grade novel, Race to the Sun, came out from Disney-Hyperion imprint Rick Riordan Presents. Writing for both adults and younger audiences, she has also published a number of well-regarded short stories, and is a Hugo, Nebula, Astounding, and Locus Award winner.  Roanhorse lives in Northern New Mexico with her husband, daughter, and pup. Black Sun begins series Between Earth and Sky and is due from Saga Press in October 2020.   Your new novel, Black Sun, is the first in the Between Earth and the Sky series, and is inspired by a number of pre-Colombian cultures. Trail of Lightning and The Sixth World series taps into Navajo lore. What were some of the key similarities and differences in terms of the research for these two projects?  The Sixth World series is a near-future Urban Fantasy so my research was pretty much lived experience from my day-to-day life on the Navajo Nation. I was writing about people and places I knew intimately. Black Sun, on the other hand, is a big sprawling epic fantasy inspired primarily by historical cultures. It required a lot of research on everything from archeoastronomy to indigenous ways of open water navigation, but even with all that research, it’s still a fantastical enterprise. There are giant beasts and blood magic and mythical creatures come to life, but the roots are different.  The world of Black Sun is inspired by pre-Colombian Americas and the world of The Sixth World is a postapocalyptic vision. Is it trickier to write the Black Sun world in certain ways, or more freeing?  A little bit of both. My goal with The Sixth World was to portray contemporary (and future) Navajo culture as accurately as I could in order to correct a lot of the stereotypes I saw in the way Natives are portrayed in popular culture, and genre in particular. Similarly, I also wanted to portray pre-Columbian cultures with some of the same grandeur and sophistication that they possessed but that they rarely get credit for, but I did not hold back on mingling cultural aspects with things I wholly made up. I took a lot more liberties and indulged my imagination a lot more in Black Sun.  Are there important ways that this book changed from when you first started writing and plotting?  I wrote an entire 95k+ draft of what became Black Sun and turned it in to my editor, Joe Monti, the week of Boskone 2018. I was eager to hear what he had to say when we met up at the Con, and his feedback was something along the lines of the story was good, not great. I was so annoyed I went back and rewrote the whole story, saving only some of the bare-bones worldbuilding and a few names and ideas. It became a wholly different novel, and thank god, because Joe was right. The first version was mediocre. The final version is objectively much better.  We often talk about science fiction literature as being a conversation, and stories and books are often written as a response to something that came before. Is Black Sun in conversation with particular works, is it building on something that came before, or is it unlike things readers have seen in some ways?  Black Sun is certainly in conversation with the epics that have come before. I grew up on Jordan and Eddings and, in college, Martin and Erikson were faves. I consciously tried to set aside the conventions and setting of the European-inspired epic while still giving readers what they want to see in high fantasy.  Additionally, Black Sun was my chance to portray people who look like me as something beyond orcs, laconic horse people, or the enslaved. I wanted to celebrate the various cultures of the Indigenous Americas by embracing their architecture, science, diversity of cultures and worldview, and then going fantastical with it. I dislike how marginalized authors are so rarely allowed to be fantastical, to have limitless imaginations and to break boundaries. I recently saw a review complaining that Black Sun did not meet the reader’s understanding of one of the historical cultures it draws from, and I wanted to shake that reviewer and point to the giant corvids and mermaids in the story and ask if they failed to notice the book was fantasy. I don’t think white writers have to deal with that expectation.  I really enjoy your characters and I feel like your character work is strong. How do you go about developing characters so that they are interesting, different, but plausible?  I remember reading a tweet from Kameron Hurley who said something along the lines of not wanting to write the same female character every time, and that made me strive to consciously try to write very different characters from the ones in my previous series. (I know other authors say they write the same five characters over and over and no one notices, and that’s fine, too. Whatever works.) I really try to be conscious of how different people are, and how differently they think and act and what different things drive them. And I try to pull that into my characters. That’s not to say that most characters don’t have aspects of myself in them, some more than others, but their construction is a thoughtful process. After they come alive on the page, so to speak, they often take on a life of their own if I’ve done a good job, but their foundations are deliberation.  What is horror for you, as opposed to dark fantasy? And do you feel like there are some elements in your books, particularly in Black Sun, which take the narrative to a horror sensibility?  I don’t differentiate between genres while I’m writing. I mix science fiction and fantasy, and there’s definitely elements of horror in my writing, including Black Sun, but that, unlike my character work, is not a conscious choice. That’s just my brain doing its thing. Often, I’m looking for the visceral, the gut punch. I want my work to be immersive, and when you’re immersed fully, it’s frightening. People are frightening. That’s just the truth.  People have lauded your worldbuilding in the new book. What makes good worldbuilding; how do you infuse a world with detail while keeping it interesting and not overwhelming the story?  I start with character and build out. I don’t make a world and then fit characters into it, and I don’t do big bibles full of details or anything. I create as much world as the character needs to feel real and to come alive, and then maybe a bit more to make the world feel likewise real and alive. And I try to be judicious about what makes it onto the page. Worldbuilding is not an indulgence, it’s a necessity. I keep it necessary.  You have books and short stories marketed to different age groups. Are there important differences in your approach to writing or narrative when you compose short fiction for younger audiences; or when you wrote Race to the Sun?  I think everyone should write for children, especially middle grade, at least once. It really teaches you how to write more completely. We forget that adults come to novels with a lifetime of experience that they then use to navigate a narrative. They can fill in narrative blanks or catch nuance that kids just can’t. Also, adults are much more willing to forgive lapses in plot and give you the benefit of the doubt. Kids call you on your bullshit. You can’t be a lazy storyteller and write for children.  In Black Sun, right at the outset, there’s this aspect of Serapio’s identity as an individual who is caught between cultures and between parents. Knowing a bit about who you are, this struck me as very personal. Do you feel a closeness to Serapio? Are there other important ways in which you relate to him?  Oh yes. My birth father is Black, and my birth mother is Native, and I am adopted, so I’m a bit obsessed with identity and where people fit in, or more interestingly, where they don’t fit in. Serapio and his journey are close to my heart. He struggles with his destiny, as all the characters do. But unlike others, he is willing to subvert his personal desires for a higher calling, even if the calling is one that is questionable and that may end badly for him. He does some terrible things in the story in the name of a people who don’t even know him, and frankly, may not want him, at great cost. There’s a quiet desperation to his character when it comes to human connection, but he’s also arguably the most powerful character in the story, a world-shaker. I love that contradiction.  I loved the line “Teek with a temper” and the book creates this immediate sense of a strong, stubborn, defiant woman in Xiala—perhaps even rowdy. Do you relate to her? What do you like most about this character?  Definitely rowdy! I’m channeling some of my twenties through Xiala but the difference is that she is unapologetically herself. I was never that confident. Unfortunately, that “self” is a mess. She’s living day-to-day, hour-to-hour, with very little thought for the future and being driven by the demons of her past. But she’s a generally good person whose only great harms are directed at herself. I think she’s the most relatable character in the story.  How does your connection to Serapio and the other characters in Black Sun, as well as to the overall story, compare to your connection to Maggie Hoskie, the protagonist from your Sixth World series, as well as to that story?  There are aspects of me in all my characters. I think that’s pretty common for authors. Some are more immediately accessible, some only blossom to recognition as you write. I joke that writing Maggie Hoskie was cheaper than therapy, and there’s a lot of truth to that. That character is my most emotional vulnerable self, everything lived raw and out loud, heart on your sleeve. Writing her was extremely cathartic. Serapio, for example, is a much more philosophical and introspective character. They both want desperately to be loved and to belong, and neither quite understand the power they possess, but Serapio is much closer to that realization than Maggie is. Maggie rejects her calling, Serapio embraces his. Xiala probably thinks having a calling is for suckers and would happily toast to that.  The concept around Teek as being people who become commodities, literally taken apart for the benefit of other people, strikes me as a powerful metaphor. Was it just a cool concept or is there a deliberate meaning behind this idea?  It is very much deliberate. There’s a line in the book where Xiala says something like, “They hate people like us until they need us,” referring to her and Serapio. And throughout the series they will both have to wrestle with how people want to use them verses their own desires. It’s a much more complicated question than it may look at first blush. To be useful, even as a commodity, is to be wanted, and for someone who has been so severely rejected, it is a consideration. There is power in sacrifice, but that power doesn’t come cleanly or easily.  What else would you like people to know about Black Sun, beyond the blurbs and the reviews?  I’ve talked a lot about character (thanks for the great questions), and that’s probably what is most important to me. This story is about people. People trying to find their way home, whatever that means to them. But the journey is not always successful. Sometimes home isn’t what you thought it would be, sometimes home doesn’t want you, sometimes home doesn’t even recognize you as one of the family. And then what do you do? Do you raze it all? Do you keep searching? Do you build your own family, or do you mold yourself into a more pleasing shape in hopes of acceptance? And at what cost? These are the kinds of human questions I’m exploring behind all the worldbuilding and magic and intrigue. I hope people see that, too.  What was the most challenging thing about writing this book?  I pushed through a lot of fear and doubt to write this book. Not only because I trunked the “good but not great” draft, but because of the kinds of characters I chose to write. Serapio has a disability, Xiala is pansexual, there is a third gender that uses modified neopronouns in the story. And, of course, this is a world inspired by non-European paradigms. It was everything I wanted to write, but it felt risky. It felt like I had to take a chance of people not liking it, or, worse to me, getting the representation wrong, but it would be worth the risk it if I got it right.  What’s next, what’s coming up for you, or what are you working on that you can tell readers about?  Most things I can’t talk about, but I can say my Hugo and Nebula award-winning short story “Welcome to Your Authentic Indian Experience ™” has been optioned by Amazon Studios, as have a number of other projects. I also have an original TV project in development that I hope to announce soon, and by the time you read this, I’ll be part of a writer’s room on a very cool new science fiction TV series. In addition, I have a one-shot with Marvel Comics coming in November in their Indigenous Voices issue where I wrote a story for the character Echo with Weshoyot Alvitre doing interior art and David W. Mack creating a beautiful variant cover. And, of course, the second book in the Between Earth and Sky series will be out in 2021. My plate is very full and I couldn’t be more grateful. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nLiving Raw and Out Loud: A Conversation with Rebecca Roanhorse\nBefore you ever heard of her, Rebecca Roanhorse was already on her way to glory. In 2018, she showed up in Pittsburgh for the Annual Nebula Awards Conference, nominated for her first publication: “Welcome to Your Authentic Indian Experience™” (Apex Magazine 8/17). In front of a crowd of professional authors and publishers, almost all of whom were strangers to her, she won the award for Best Short Story. During that same conference she revealed to me that she’d already signed three separate book deals with two different publishers, for multiple books.\nRoanhorse was born in Conway, AR and grew up in Fort Worth, TX. She earned a BA in Religious Studies from Yale University and an MA in Theology from Union Theological Seminary, and then a JD from the University of New Mexico School of Law, specializing in Federal Indian Law. She attended the VONA/Voices workshop in 2015.\nHer debut novel, Trail of Lightning, came out with Saga Press in 2018, beginning The Sixth World series. Star Wars: Resistance Reborn was published in 2019 with Del Rey. In 2020 her middle grade novel, Race to the Sun, came out from Disney-Hyperion imprint Rick Riordan Presents. Writing for both adults and younger audiences, she has also published a number of well-regarded short stories, and is a Hugo, Nebula, Astounding, and Locus Award winner.\nRoanhorse lives in Northern New Mexico with her husband, daughter, and pup. Black Sun begins series Between Earth and Sky and is due from Saga Press in October 2020.\nYour new novel, Black Sun, is the first in the Between Earth and the Sky series, and is inspired by a number of pre-Colombian cultures. Trail of Lightning and The Sixth World series taps into Navajo lore. What were some of the key similarities and differences in terms of the research for these two projects?\nThe Sixth World series is a near-future Urban Fantasy so my research was pretty much lived experience from my day-to-day life on the Navajo Nation. I was writing about people and places I knew intimately. Black Sun, on the other hand, is a big sprawling epic fantasy inspired primarily by historical cultures. It required a lot of research on everything from archeoastronomy to indigenous ways of open water navigation, but even with all that research, it’s still a fantastical enterprise. There are giant beasts and blood magic and mythical creatures come to life, but the roots are different.\nThe world of Black Sun is inspired by pre-Colombian Americas and the world of The Sixth World is a postapocalyptic vision. Is it trickier to write the Black Sun world in certain ways, or more freeing?\nA little bit of both. My goal with The Sixth World was to portray contemporary (and future) Navajo culture as accurately as I could in order to correct a lot of the stereotypes I saw in the way Natives are portrayed in popular culture, and genre in particular. Similarly, I also wanted to portray pre-Columbian cultures with some of the same grandeur and sophistication that they possessed but that they rarely get credit for, but I did not hold back on mingling cultural aspects with things I wholly made up. I took a lot more liberties and indulged my imagination a lot more in Black Sun.\nAre there important ways that this book changed from when you first started writing and plotting?\nI wrote an entire 95k+ draft of what became Black Sun and turned it in to my editor, Joe Monti, the week of Boskone 2018. I was eager to hear what he had to say when we met up at the Con, and his feedback was something along the lines of the story was good, not great. I was so annoyed I went back and rewrote the whole story, saving only some of the bare-bones worldbuilding and a few names and ideas. It became a wholly different novel, and thank god, because Joe was right. The first version was mediocre. The final version is objectively much better.\nWe often talk about science fiction literature as being a conversation, and stories and books are often written as a response to something that came before. Is Black Sun in conversation with particular works, is it building on something that came before, or is it unlike things readers have seen in some ways?\nBlack Sun is certainly in conversation with the epics that have come before. I grew up on Jordan and Eddings and, in college, Martin and Erikson were faves. I consciously tried to set aside the conventions and setting of the European-inspired epic while still giving readers what they want to see in high fantasy.\nAdditionally, Black Sun was my chance to portray people who look like me as something beyond orcs, laconic horse people, or the enslaved. I wanted to celebrate the various cultures of the Indigenous Americas by embracing their architecture, science, diversity of cultures and worldview, and then going fantastical with it. I dislike how marginalized authors are so rarely allowed to be fantastical, to have limitless imaginations and to break boundaries. I recently saw a review complaining that Black Sun did not meet the reader’s understanding of one of the historical cultures it draws from, and I wanted to shake that reviewer and point to the giant corvids and mermaids in the story and ask if they failed to notice the book was fantasy. I don’t think white writers have to deal with that expectation.\nI really enjoy your characters and I feel like your character work is strong. How do you go about developing characters so that they are interesting, different, but plausible?\nI remember reading a tweet from Kameron Hurley who said something along the lines of not wanting to write the same female character every time, and that made me strive to consciously try to write very different characters from the ones in my previous series. (I know other authors say they write the same five characters over and over and no one notices, and that’s fine, too. Whatever works.) I really try to be conscious of how different people are, and how differently they think and act and what different things drive them. And I try to pull that into my characters. That’s not to say that most characters don’t have aspects of myself in them, some more than others, but their construction is a thoughtful process. After they come alive on the page, so to speak, they often take on a life of their own if I’ve done a good job, but their foundations are deliberation.\nWhat is horror for you, as opposed to dark fantasy? And do you feel like there are some elements in your books, particularly in Black Sun, which take the narrative to a horror sensibility?\nI don’t differentiate between genres while I’m writing. I mix science fiction and fantasy, and there’s definitely elements of horror in my writing, including Black Sun, but that, unlike my character work, is not a conscious choice. That’s just my brain doing its thing. Often, I’m looking for the visceral, the gut punch. I want my work to be immersive, and when you’re immersed fully, it’s frightening. People are frightening. That’s just the truth.\nPeople have lauded your worldbuilding in the new book. What makes good worldbuilding; how do you infuse a world with detail while keeping it interesting and not overwhelming the story?\nI start with character and build out. I don’t make a world and then fit characters into it, and I don’t do big bibles full of details or anything. I create as much world as the character needs to feel real and to come alive, and then maybe a bit more to make the world feel likewise real and alive. And I try to be judicious about what makes it onto the page. Worldbuilding is not an indulgence, it’s a necessity. I keep it necessary.\nYou have books and short stories marketed to different age groups. Are there important differences in your approach to writing or narrative when you compose short fiction for younger audiences; or when you wrote Race to the Sun?\nI think everyone should write for children, especially middle grade, at least once. It really teaches you how to write more completely. We forget that adults come to novels with a lifetime of experience that they then use to navigate a narrative. They can fill in narrative blanks or catch nuance that kids just can’t. Also, adults are much more willing to forgive lapses in plot and give you the benefit of the doubt. Kids call you on your bullshit. You can’t be a lazy storyteller and write for children.\nIn Black Sun, right at the outset, there’s this aspect of Serapio’s identity as an individual who is caught between cultures and between parents. Knowing a bit about who you are, this struck me as very personal. Do you feel a closeness to Serapio? Are there other important ways in which you relate to him?\nOh yes. My birth father is Black, and my birth mother is Native, and I am adopted, so I’m a bit obsessed with identity and where people fit in, or more interestingly, where they don’t fit in. Serapio and his journey are close to my heart. He struggles with his destiny, as all the characters do. But unlike others, he is willing to subvert his personal desires for a higher calling, even if the calling is one that is questionable and that may end badly for him. He does some terrible things in the story in the name of a people who don’t even know him, and frankly, may not want him, at great cost. There’s a quiet desperation to his character when it comes to human connection, but he’s also arguably the most powerful character in the story, a world-shaker. I love that contradiction.\nI loved the line “Teek with a temper” and the book creates this immediate sense of a strong, stubborn, defiant woman in Xiala—perhaps even rowdy. Do you relate to her? What do you like most about this character?\nDefinitely rowdy! I’m channeling some of my twenties through Xiala but the difference is that she is unapologetically herself. I was never that confident. Unfortunately, that “self” is a mess. She’s living day-to-day, hour-to-hour, with very little thought for the future and being driven by the demons of her past. But she’s a generally good person whose only great harms are directed at herself. I think she’s the most relatable character in the story.\nHow does your connection to Serapio and the other characters in Black Sun, as well as to the overall story, compare to your connection to Maggie Hoskie, the protagonist from your Sixth World series, as well as to that story?\nThere are aspects of me in all my characters. I think that’s pretty common for authors. Some are more immediately accessible, some only blossom to recognition as you write. I joke that writing Maggie Hoskie was cheaper than therapy, and there’s a lot of truth to that. That character is my most emotional vulnerable self, everything lived raw and out loud, heart on your sleeve. Writing her was extremely cathartic. Serapio, for example, is a much more philosophical and introspective character. They both want desperately to be loved and to belong, and neither quite understand the power they possess, but Serapio is much closer to that realization than Maggie is. Maggie rejects her calling, Serapio embraces his. Xiala probably thinks having a calling is for suckers and would happily toast to that.\nThe concept around Teek as being people who become commodities, literally taken apart for the benefit of other people, strikes me as a powerful metaphor. Was it just a cool concept or is there a deliberate meaning behind this idea?\nIt is very much deliberate. There’s a line in the book where Xiala says something like, “They hate people like us until they need us,” referring to her and Serapio. And throughout the series they will both have to wrestle with how people want to use them verses their own desires. It’s a much more complicated question than it may look at first blush. To be useful, even as a commodity, is to be wanted, and for someone who has been so severely rejected, it is a consideration. There is power in sacrifice, but that power doesn’t come cleanly or easily.\nWhat else would you like people to know about Black Sun, beyond the blurbs and the reviews?\nI’ve talked a lot about character (thanks for the great questions), and that’s probably what is most important to me. This story is about people. People trying to find their way home, whatever that means to them. But the journey is not always successful. Sometimes home isn’t what you thought it would be, sometimes home doesn’t want you, sometimes home doesn’t even recognize you as one of the family. And then what do you do? Do you raze it all? Do you keep searching? Do you build your own family, or do you mold yourself into a more pleasing shape in hopes of acceptance? And at what cost? These are the kinds of human questions I’m exploring behind all the worldbuilding and magic and intrigue. I hope people see that, too.\nWhat was the most challenging thing about writing this book?\nI pushed through a lot of fear and doubt to write this book. Not only because I trunked the “good but not great” draft, but because of the kinds of characters I chose to write. Serapio has a disability, Xiala is pansexual, there is a third gender that uses modified neopronouns in the story. And, of course, this is a world inspired by non-European paradigms. It was everything I wanted to write, but it felt risky. It felt like I had to take a chance of people not liking it, or, worse to me, getting the representation wrong, but it would be worth the risk it if I got it right.\nWhat’s next, what’s coming up for you, or what are you working on that you can tell readers about?\nMost things I can’t talk about, but I can say my Hugo and Nebula award-winning short story “Welcome to Your Authentic Indian Experience ™” has been optioned by Amazon Studios, as have a number of other projects. I also have an original TV project in development that I hope to announce soon, and by the time you read this, I’ll be part of a writer’s room on a very cool new science fiction TV series. In addition, I have a one-shot with Marvel Comics coming in November in their Indigenous Voices issue where I wrote a story for the character Echo with Weshoyot Alvitre doing interior art and David W. Mack creating a beautiful variant cover. And, of course, the second book in the Between Earth and Sky series will be out in 2021. My plate is very full and I couldn’t be more grateful.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/roanhorse_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Living Raw and Out Loud: A Conversation with Rebecca Roanhorse by Arley Sorg"}