{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tobias S Buckell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "bz/j8oUCDTCkLLj0PzLYOWXMCxg=", "id": null, "license": null, "comments": "", "raw_text": "8420 words, novelette  Placa del Fuego  Tiago would normally have taken his cut of the picked pockets and stopped right here at the Seaside Plaza. On the very edge, past the vendors on the cobblestone sea walk, Tiago would sit with his legs over the rocky sea wall and look out over the harbor.  Today he only detoured through the plaza to throw the crowd in between him and the woman chasing him.  He’d gotten a brief glimpse of her before the running started: tall, dark eyes, dark skin, dark leather jacket and microfibre pants, careful dreadlocks pulled back into a pony tail.  She was fast in the crowd. She wasn’t dodging around legs, using the ebb and flow of the masses to see open routes like Tiago. No, people who got in her way were just . . . thrown out of the way.  Too strong. She was some sort of soldier, Tiago thought, refocusing ahead.  He might have gotten himself into a bit of a situation.  Slipping onto the seawall path, he sprinted harder, deciding that she was covering the gap in the crowd. To his right the harbor was filled with ships and their cargo, anchored and waiting for a spot to clear on the docks. One of them was throwing out a parasail, the windfoil bucking in the inconsistent harbor wind, but then filling out, rising up into the air hundreds of feet overhead, and then some.  The ship began to pick its way out of the harbor, headed between the tall forest of wind turbines at the harbor’s edge: a dangerous move to unleash a windfoil in the harbor, but suddenly Tiago noticed other ships unfurling sails in haste. A cloud of brightly colored parafoils leapt to the harbor sky like butterflies swarming from a shaken limb.  This was worrying enough that Tiago slowed, somewhat, and looked to his left. The warehouses, three and four stories tall, dominated the first row of buildings. But behind them, climbing tenaciously up the side of the mountain, homes and houses colorfully dotted the slopes.  A large, dark mass of gray haze topped the rocky crest and slowly fell down toward the harbor like a heavy cloud.  “Oh shit.” Tiago stopped. People in the Plaza were turning too, and murmuring started to spread. They stood up from picnics or meals and the edges of the crowd were already leaving.  The woman smacked into Tiago and grabbed his upper arm.  “Take your damn money,” Tiago shouted. I don’t want it. I’m sorry. Just let me go.”  She looked puzzled as he shoved the paper money into the pockets of her jacket. He may have even given her more than he’d stolen, he wasn’t sure.  “What’s . . . “  Tiago pointed up the mountain. “It’s going to rain.”  She looked over the buildings and let him go. “I forgot.”  Forgot? There were two things on the island to remember: stay out of the rain, and avoid the Doacq’s attention by staying inside at night.  He bolted. The last thing he saw was the armada of harbor ships, parafoils all full overhead, pulling their hulls up onto their hydrofoil skids as they all scattered to get well clear of the island.  Then the sirens began to wail all throughout Placa del Fuego, alerting its citizens to the descending danger.  From the open sweep of the docks and seawall of the harbor, Tiago headed into the heart of Harbortown. He could breathe easier seeing overhangs above him, and walls he could put his back to.  People hurried about with carbon-fiber or steel umbrellas. Some had already gotten into their hazmat gear.  The klaxons wailed in the background, constantly blearing out their call for all to find shelter. Shops slammed thick windows shut and bolted them, while people yanked tables and chairs and billboards inside. Customers packed in, shoulder to shoulder.  No self respecting shop would let Tiago inside: he was an urchin. His clothes were ripped and melted, his face dirty, and he ran on bare feet.  They’d toss him out on his ass faster than he could get inside.  A faint stinging mist started to fill the air. Tiago squinted and slowed down. The unfamiliar would run faster, but then they’d inhale more. He cupped his hands over his mouth, a piece of flannel in between his fingers to filter the air. He looked down at the cobblestoned street to protect his eyes.  His calloused, flattened feet knew the street. Knew how many steps it would take to reach the alley, knew how many times he’d have to pull himself up on the old pipe running outside to get up onto the roof, and how many more steps across the concrete to get to his niche.  It was a spot between two old storage buildings a few streets back from the waterfront, almost near the Xeno-town enclave. One of them had a large, reinforced concrete gutter along its edge, and when the second building had been built right along side, wall to wall, had left a sheltered ledge the length of the building.  You wouldn’t know it to look at it. Twenty street kids had taken bricks and concrete and built a wall along the overhang, blending it into the architecture. It was behind this that Tiago had his very own room.  To get to it, he stepped out over the edge of the building, and behind the wall.  Safe.  His skin stung from contact with the mist, but he could sit in the entryway along the corridor leading down to the seven foot by four foot concrete cubicles they called home, and watch the rain.  It was a floating, frothy jelly, spit out from the trees on the island into the air, that slowly floated down. In most cases it just slowly burned at whatever it landed on, like some sort of an acid.  But after that, all it took was a spark for it to ignite.  In the distance the harbor pumps thrummed to life. All over the city the engineers were fighting back the rain with a mist of their own, taken from the harbor water to coat and rinse the harbor.  Usually being on this side of the mountain protected them. But sometimes the wind changed. Sometimes the fire forests were unusually active.  Either way, you didn’t want to be outside. The burns and scars on the children huddled around the openings of their sanctuary testified to that.  The steady rain continued, sizzling as it hit the ground outside.  Tiago relaxed in the quiet among his neighbors as the city fought the rain. He could worry about explaining to Kay why he was coming back with no money from the morning’s work later, as much as that scared him. For now, he was just happy to be out of the rain.  He just about leapt out of skin as the wall next to him crumpled and the woman who’d been chasing him shoved her way through and crouched in front of him.  “Hello,” she said. “We still have business to finish.”  Tiago jumped up to run and the other kids moved back away from him.  But where could he go with the rain coming down so hard?  He looked back at his pursuer. The rain had eaten away at the skin on her forearms, exposing silvery metal underneath. Metal pistons snicked as she flexed her fingers.  A cyborg. Here on Placa del Fuego.  Impossible.  There was no advanced machinery on Placa del Fuego. It all failed on the island, until one reached three miles offshore. In Harbortown the sailors said scientists from other worlds clustered aboard large ships near the wormholes, monitoring what islanders called the deadzone and they called ‘an unexplained continuous EMP event.’ They claimed the epicenter was somewhere deep under the crust of the planet, right under Placa del Fuego.  The wormholes that lead from the ocean around Placa del Fuego to the oceans of other worlds light years away were anchored in the water just on the edge of the deadzone, and the scientists were there to order the wormholes moved as the deadzone expanded slightly each month.  One street rumor said that one of the alien races had buried a device under the island, intending to use it as a cover for a last stand during the human war for independence. Some said it was the Doacq that bought the deadzone with it.  It didn’t matter what or who caused it. The end effect was that the town used pneumatic tubes to send messages. Ox-men from Okur pulled rickshaws around, or people used the compressed air powered trolley cars. Everything ran on compressed air: the town’s reservoirs were filled by the myriad wind turbines that festooned the harbor entrance and the exposed ridges of the mountain.  But because of the deadzone, this woman shouldn’t have been here, Tiago thought. She shouldn’t even work. But in the cramped darkness of his room the cyborg woman squatted on Tiago’s hand-carved wooden stool.  As Tiago turned on a bright white LED lamp she counted off a lot more money than he’d stolen, or given back to her. Bill after bill after bill. A massive fistful. A month’s takings.  It hovered between them.  “Before you tagged me and made the pick,” she said, “you seemed to know your way around the harbor. I need someone like you.”  Tiago took a deep breath. He wasn’t sure if he needed someone like her.  She was trouble.  The hesitation must have been obvious to her. She smiled. “I’ll double what you want.”  What was the alternative? Tiago took the money. He’d be a fool not to.  “What are you looking to do?” he asked.  “I need to find the person at the top of the underground. Who sees all and knows all.” The cyborg shifted, and the stool creaked. Tiago grimaced. It was made of imported wood, and it was his most precious possession. “I’m looking for Kay.”  “Kay?” Tiago feigned confusion.  “You know who I’m talking about,” the woman smiled.  He did. He wasn’t very good at lying straight-faced. He swallowed nervously. “What do you need from her?”  “I need Kay’s help.” Tiago waited for more, and the cyborg continued. “To find my grandfather. How do I find this person?”  “You don’t find Kay,” Tiago said. He folded the money away into the depths of his ragged clothes. “She finds you. Go find yourself a nice room along the waterfront somewhere. Kay will show up now that someone knows you’re trying to find her. That’s how it works.”  “Word on the street.” The woman leaned forward and held out her hand. A card rested in her palm. “I’ll pay you the other half when I meet Kay. Come find me tomorrow at noon.”  Tiago took the card. An address had been scribbled onto it. “What is your name, then?”  “Nashara.”  Nashara. A cyborg called Nashara. The Nashara? Was he really talking to a living, breathing legend?  Tiago’s hands shook.  She was a lot more than just trouble.  He’d gotten himself in way, way deep into something.  Nashara, left, walking out in to the sizzling rain like it was no more than an inconvenience.  It was only a moment before Tiago’s neighbors parted and the tiny figure of Kay walked out. Her grey eyes took in the broken brick with a flick before she turned to face him. Her hair was cut just short of her ears, almost boyish. She was shorter than Tiago, something that always surprised him. In his own mind she stood much taller. “I’ll have it repaired,” she said calmly, flicking her head at the destruction.  Kay’s fixing the damage would obligate them to her.  But no one said anything. Refusing it would be an even bigger problem.  They might come to beat him up tonight, Tiago thought. If they weren’t too scared.  “You were here the whole time?” Tiago asked, his voice cracking slightly with fear.  Kay ignored his surprise. “That was a Nashara. Here on the island. I wonder how she’s able to work here?” Ox-men: two large slabs of hairy muscle, large eyes and flat noses, squeezed into the passageway behind her, stooping over to fit. They regarded Tiago with dull, incurious eyes.  “I don’t know . . . ” Tiago muttered.  Kay unpacked a Kevlar poncho and pulled it carefully on. She buckled on a gas mask. Behind her, the two Ox-men did the same.  In a muffled voice she told Tiago, “Do you know how expensive it would be to shield someone like her, a cyborg, to be able to function in the deadzone? That must be what she’s done. It means she has access to . . . incredible resources.” She paused thoughtfully, thinking about that. Then she continued. “I have preparations to make before I’ll meet her. Keep your appointment. I’ll send someone for you both.”  She stepped out into the rain, and the Ox-men followed her. The three of them disappeared over the side of the building in the haze, and Tiago turned around to face the boys trying to hide in the shadows.  He could tell by the fear on their faces that they would not be bothering him.  They were far, far too scared of Kay.  So was he.  Nashara sat at a table outside a seawall restaurant, surveying the Plaza over a cup of tea. A few small fires had broken out the night before where jellied rain had landed on canopies or abandoned stalls. But considering the strength of last night’s storm, it wasn’t too bad, Tiago thought. He’d certainly seen worse.  His new benefactor motioned Tiago to sit with her.  “It’s odd,” she muttered as he sat. “All this stone, brick, slate. Leather for clothes. No wood, no fabrics. Hardly any trees, not even scrub. Grim.”  Tiago looked down at his patched clothes. She was surprisingly ignorant about the island if she was the real Nashara. The real Nashara had cloned her own mind to infect alien starships in the fight for human independence. The real Nashara was a founder of the Xenowealth. The real Nashara was a force of nature. That Nashara, it seemed to Tiago, would, at least know about stuff here on the island. “Rich people have them,” he said. “In those glass houses.”  “Greenhouses?”  Tiago shrugged. “Sure.”  Sometimes, in the quieter moments, looking out over the harbor, he’d wondered what the places were like out over the horizon, and through the wormhole the ships sailed through to get to the oceans of other worlds, and through wormholes in those oceans to even more. Other worlds where things were made, and then transported here. Where people like Nashara came from.  But it was useless to daydream too much about where the ships went. Because they weren’t taking Tiago along with them. No matter how much he wished for it whenever he sat on the sea wall.  Nashara set her tiny wooden cup down and stood up. “I think Kay will be receiving us now.”  Tiago turned around, and the two Ox-men he’d seen last night had silently, amazingly for their bulk, walked up right behind him.  They didn’t have to say anything, they turned around and began to walk away. Nashara followed.  And that, he thought, was the end of that.  Only it wasn’t.  Up at the end of Onyx street, down the stairs cut into the side of the road and in the basement of an old house tunneled into a rock outcropping at the very edge of town, was one of Kay’s many lairs.  He’d been summoned there, two days later.  Amber late-afternoon light pierced the dusty windows, and a menagerie of Placa del Fuego’s shadowy denizens milled about. There were more Ox-men, some Runners, and even a few simple-minded Servants. Lots of grubby kids like Tiago, many of them faces he recognized from Elizan’s crew crowded in, as well as others from all over the rest of the city. They were Kay’s crew, now, all of them. She owned the Waterfront and the Back Ring, and was almost done finishing up controlling the Harbor.  If it was criminal, and happened in Placa del Fuego, Kay wanted to run it.  It had been different, last year. Last year Tiago worked for Elizan; a high strung old man who would leap at a chance to whip anyone who’d held back the take.  A tough life: Tiago still had misshapen broken bones to prove it, but it beat trying to live outside alone. Something he’d learned quickly enough.  Placa del Fuego had no heart for the homeless.  When Kay appeared on the streets in the Back Ring, rain-burned and tired, she’d been ignored. For the first week. The second week she’d figured out the command structure of one of the drug cartels and executed the commander with a sliver of knapped flint.  Within days the cartel danced to her tune.  Rumors said she came from Okur, where the birdlike alien Nesaru had established a colony. Under the Bacigalupi Doctrine, anticipating the lack of fuel and the collapse of the interstellar travel after the war for independence, the Nesaru had bred humans into a variety of forms to serve them. Nesaru engineered, bred, and reshaped human Ox-men and Runners had fled Okur to Placa del Fuego. So had Kay.  She was something else, Okur refugees said. Something designed to control the modified human slaves under the Nesaru’s thumb. She could read your thoughts by the slightest change in your posture, a twitch in a facial muscle. She emitted pheromones to calm you, convince you, and used her body to control your personal space.  You were a computer, waiting to be programmed. She was your taskmaster. A perfect, bred, engineered, manipulator of humankind.  “Tiago,” Kay said, beckoning him closer. “Nashara and I have quite a job for you.”  Nashara stepped out from behind a thick stone pillar. “There will be considerably more money in it for you.”  Kay put a protective arm around Tiago. “I really need your help with this, Tiago.”  He stiffened slightly as she moved in closer, creating a tiny world between just the three of them. “What do you need?” he asked, hesitant.  “You keep a low profile, Tiago. Back of the crowd. You don’t try to cheat me of my cut. You wouldn’t even dare think of it.”  Tiago nodded. Don’t get noticed. Don’t cross dangerous people like Kay unless you could run. Melt into the background. These were core life principles of his. It was why he made a good pickpocket. There was even a mid-sized bounty available for his capture.  “More importantly, you’ve been in the Dekkan Holding Center,” Nashara said. In the distant background the sound of rain alarms drifted through the streets. A night storm. The worst kind.  A cold chill gripped Tiago. “You want me to go back to The Center?” Images of the dark warrens flitted back to the front of his mind.  “Not as such.” Kay pointed a Kevlar poncho and gas mask hanging by the door. “Suit up.”  They walked through the slowly darkening streets, the rain hissing against their protective gear. Nashara wore goggles and a long leather fisherman’s coat that seemed impervious to the rain, Kay the same outfit as Tiago.  Their footsteps clicked against cobblestone as Kay led them through sidealleys and tiny backstreets so cramped they had to move through them single file.  No one else was out.  Tiago stopped a tremble in his hands at the thought of being out at night.  Several times they came to dead ends, where small locked doors stopped Kay’s progress. But a few knocks in a pattern and they would open, and the trio would tromp through someone’s front room, leaving sizzling drops of rain behind.  There was no hurry, and Tiago gauged that they’d moved across the entire city over the last two hours.  Kay finally stopped and removed her gas mask in the quiet foyer of a restaurant, eerie in its empty state, though the tables were all set and ready: waiting for the morning crowd. She looked right at Tiago as he removed his mask. He burned his fingers on the wet straps as she said, “I’m turning you over to the warden of the DHC for the bounty. The driver of the prison wagon has been paid to suggest stopping to pick you up.”  He felt numb. Outside, Tiago saw through the windows, the rain had fallen to a drizzle. The gaslight streetlamps flickered shadows as the wind flicked their flames this way and that.  “So you do want me back in the hellhole,” he said, the misery leaking out into his voice.  Kay pulled out a packet of photos and spread them with a flourish across a nearby table like a card dealer. “No. You’ll get picked up, but there’s someone inside the wagon that Nashara wants.”  Tiago frowned. Kay was helping Nashara why? He couldn’t quite put together what was happening here.  Kay leaned close. She was doing it, creating that little bubble of space that seemed to exist just between the two of them. It was some sort of talent, almost magical. “Don’t try to figure it out, Tiago. Just take a look at the pictures of the crew of the Zephyr III. One of them will be in the wagon. We need your help.”  He looked up and out of the bay windows. He wondered how far he could get if just ran. He had some money, maybe he could stowaway on a boat.  How long could he evade Kay?  Not very long.  She gently grabbed his jaw to point his gaze back down at the table. She’d read his thoughts via his body language. “There’s no running, Tiago. Not now.”  He swallowed and committed the faces before him to memory, something other than fear building as she put a hand on his back to steady him.  “I’ll be there as well,” Nashara said from by the door. She’d opened her coat up, and underneath Tiago saw more guns lining the inside than he’d even known a single person could carry. She was a walking arsenal. You rarely saw any guns on the island, too expensive, even for criminals.  “So why don’t you just break into the wagon and get the person you want?” Tiago asked.  “Don’t want to tip my hand until we know we have the person we want. Otherwise, if we go in too early guns blazing on the wrong wagon, our guy could get hidden further, or put under tougher security. So you’re our scout, Tiago. When you give us the go ahead, we move in to recover both of you.”  “And if the person isn’t there, I get beaten, interrogated, and locked up.”  “We will get you out quickly if that happens, we can bribe a few judges, and Nashara is ready to pay you well,” Kay said. She was pulling on her poncho. Before she snapped on the bug-like gasmask, she continued. “I have to go meet the wagon. I’ll be back shortly.”  This was his moment to bolt.  Nashara picked up the pictures of the crew. “Three weeks ago. You remember anything strange happening?”  Tiago stopped thinking about other lives and worlds. “There was a fight. At night. All over the town. Whoever it was burst through walls, fell through roofs. Ripped up road. No one saw much of it. We just saw the damage . . . “  “It was my grandfather: Pepper was on his way back with information about a new threat to the Xenowealth worlds. He disappeared here, last seen getting aboard the Zephyr III. But the Zephyr was destroyed in a limited yield nuclear blast event nowhere near any of the wormholes out, but a hundred miles north of here in the polar ocean.  “Word is that one survivor from the Zephyr III came back. You’re going to help me acquire him. I came with a ship, it’s pretty heavily armed up: the Streuner. Pepper didn’t have backup, I’m not making the same mistake. Once we’re on the ship, it’s a run for the wormhole, back into the heart of the Xenowealth, for debriefing.”  Acquire him. There was a strange turn of a word, Tiago thought. She was a kindred soul to Kay. Someone who wove the fate of everyone around them.  He was just a pickpocket. It was all he ever really aspired to. His own quiet moments on the seawall, a safe, dry place to sleep. Good food.  Now he was caught up in something that involved the fates of the connected worlds.  “What does Kay get out of it?” Tiago asked, treading into areas which he knew he shouldn’t be poking his nose.  Nashara tapped the inside of her coat, and the guns jiggled. “Force multipliers.”  “You know what she’ll do with all that?”  Nashara nodded, her dreadlocks shaking as she did so. “She plans to run the island.”  “She will.”  “Maybe. But only if she stops depending brazenly on those modifcations the Nesaru bred into her.” She smiled at Tiago’s shock that she knew about that rumor. “You’re an open book to her. And she holds your strings. But only when she’s standing in front of you. She has to learn other ways to get people to do her bidding, and her teachers have been the underbelly of Harbortown. To be a great leader requires more, it requires people to trust you just as much when you’re not standing right in front of them. That takes something else. Besides, what she has: it’s not that special a talent.”  “Do you have it?”  “Yes. Different technology, not biological, but same result. But Tiago, free will’s a bitch. Kay can only manipulate. Underneath, we still move our own lives forward. You understand? We fought the entire war over that, back when the Satrapy ruled everything. Before human independence.”  Only someone as powerful as she was, Tiago thought, could believe that about free will.  He chose not to say that.  But then, she could probably see him thinking that anyway.  “Here.” Nashara pressed a small sliver of metal into his palm. “Jam that under the target’s skin, it’ll tag him for me and let us know to come get you both.”  “Okay.” He’d have to keep this out of the cops’ hands. Easy enough. He’d snuck small items around the heavy security of The Center.  Outside the loud hiss of a compressed air powered wagon drew closer, and then it stopped. Nashara pulled a large pistol out and aimed it cheerfully at Tiago’s head. “Time to turn you in, Tiago.”  Tiago had sworn many oaths to never end back up in one of these wagons. Yet here he was again. It was near midnight as they jerked into motion with a belch. Tiago looked around. Unfamiliar, bruised, battered faces regarded him.  For a moment he panicked, not seeing any of the faces from the pictures Kay had shown him. He imagined getting locked away in the sweaty man-made caverns underneath Harbor Town.  Then he saw the youngest face in the wagon and recognized it from the photos he’d been shown of the crew of the Zephyr III. It was just a boy. A boy who was younger than Tiago.  Could he drag him into the net Kay and Nashara had cast?  Yes. The boy was already caught up in the mess from being on the same boat as Nashara’s grandfather.  Tiago stood up, tripped, caught himself, and then sat down near the locked rear door.  The boy hadn’t even felt the pinprick of Nashara’s tiny device.  Tiago waited, tensed, for something, anything, to happen.  The wagon rolled on, turning a corner, headlights revealing ten Ox-men blocking the road with spike strips. The wheels of the wagon exploded as they were shredded, and it rattled to a halt on the rims as prisoners in back were thrown against each other.  Nashara landed on the ground outside. She must have leapt off the top of a building nearby, Tiago realized, as pulverized cobblestone leapt into the air from her impact.  She ripped the door open, shattering the lock, and reached in to pull the boy out. Tiago jumped out next to them.  Three Ox-men ran into the alleyway, eyes wide with fear. “Doacq,” one shouted in a low rumble.  Nashara looked down the road. “Tiago, what the hell is that?”  Tiago didn’t need to glance a second time. “Oh shit. Shit! The Doacq. We need to get out of here. Now!”  The seven foot tall, hooded figure moved with unnatural quickness down the street. Tiago caught a glimpse, in the flicker of gaslamp, of two large, catlike eyes under the cowl and a slit-like nose.  But it was the mouth that he noticed most. It yawned, the jaw dislocating and stretching like a snake’s: a two foot gaping chase of darkness.  The Doacq whipped across the street, slamming into an Ox-man. The jaw dropped even lower, and the Doacq rose taller, somehow, and then the gaping maw descended on the Ox-man.  Hundreds of pounds of rippling, engineered, brute strength disappeared, and the Doacq turned to face the wagon.  “That’s a damn wormhole in its mouth,” Nashara said, awe in her voice. Then she grabbed the side of the wagon and grunted. “And it’s generating an EMP field . . . “  The Doacq flowed forward, the robe rippling in the slight wind. The massive jaw gaped wider and wider as it got closer. It seemed all maw to Tiago, mesmerized by the black nothingness opening up, propelled by the creature’s feet.  Nashara pulled out a large shotgun, and the deafening discharge filled the tiny stone canyon of street and houses. The Doacq twitched to face the incoming shot . . . and swallowed it all without any change in its approach.  “Son of a bitch,” she said, and then leapt forward. The Doacq, ducked and grabbed her, redirecting the energy of the jump to throw her in the side of a house.  Nashara staggered back to her feet in the middle a mess of rubble.  Tiago grabbed the boy and looked around for a place to hide. One of the nearest doors opened, and whip-lean shape of a Runner beckoned at him to get inside.  He needed no encouraging. He ran for the door.  Three explosions shook the street, and Tiago saw with a glance back that Nashara had flicked grenades at the Doacq. It swallowed several, but couldn’t be in more than one place at the same time.  Another grenade exploded to its side, and the Doacq faltered. Shreds of its cloak and flesh splattered on the ground and an animal-like shriek of pain filled the streets.  The Doacq was not supernatural, Tiago thought, dazed. It could be harmed. He paused at the doorway. Maybe Nashara could face it down.  But then the Doacq spotted him, and turned for the building, completely ignoring Nashara.  An Ox-man yanked Tiago into the house and barred the door shut. “This way,” the Ox-man grumbled, and shoved the two boys forward through the house.  A trapdoor underneath a table led them under the house, into a hidden basement lit by a single bulb.  “Through here,” said a Runner, appearing out of the dark. The shadows made his ribs, visible under a thin shirt, look even more pronounced than normal.  There was heavy, thick steel door a pair of Ox-men had opened. As they passed through that, they groaned shut, and then dropped to the ground as something was kicked out from underneath them. The smell or rank sewage took the breath away from Tiago, and he switched to breathing only out of his mouth.  In the distance, and explosion of brick and screaming startled Tiago. The Doacq must have gotten into the house. With Nashara in pursuit.  They were standing inside a tunnel, lit glancingly by the Runner’s flashlight. The center of the tunnel had a wide trench in it, currently dry.  It revealed Kay waiting with a pair of Ox-men armed with RPGs. They aimed the weapons at the thick door behind Tiago.  “So this is our quarry,” Kay said, turning on a small penlight to check the boy. “Your name is June, right?”  The shellshocked, beaten boy nodded.  “Can you speak, June?”  “Yes.” It was a faint whisper, unsure of itself. But it was the most June had done since this had all started, other than let Tiago drag him around to safety.  “Well June, this is Tiago, and we have to move quickly before the Doacq comes after us. It likes characters like us. It finds us interesting.”  Kay led them down the gentle slope of the tunnel at a brisk pace to a junction, where the sound of running water filled the air, and the stench increased.  Five Ox-men stood in a trench full of dirty water holding onto a small metal boat with an electric engine on the back.  Something boomed in the distance, echoing through the sewer tunnels, as they clambered in.  Kay smiled. “That should slow the Doacq down.” She waved her hand at the Ox-men and they let go. She gunned the engine up to a brisk whine as the boat shot clear, bouncing off the sides of the trench.  Tiago had a moment to absorb everything now. He turned to Kay. “All this preparation. You knew the Doacq was coming? How?”  “He always comes when there’s this much activity,” Kay said. “And he’s difficult to stop. I thought maybe he was allergic to the sun, but he shrugged off the ultraviolet and full spectrum lamps I installed on his favorite haunts. Since then, it’s gotten harder and harder to hunt. I can’t even get a good picture of it, cameras fail around it.”  Tiago felt like he was looking at a different person. “How can you know so much about the Doacq?” Most of the town didn’t even talk about it, they whispered about it and avoided the night. When people disappeared, you didn’t dwell on it. You knocked on wood that you would never be the one to turn a corner, and see the Doacq standing there.  “You hunt the Doacq?” Tiago asked.  She heard the stunned disbelief in his voice and turned on him. “It’s an alien. It’s not some supernatural creature, Tiago. It’s like the Nesaru, just more powerful. We don’t know where it comes from, but just like the other aliens, it plays on human land as if it owns it. It thinks it rules us, but it doesn’t!”  There was a hatred in her face, naked for the two boys to see. She’d let her control slip. “I will destroy it. And then I will take the island. And after that, I will make the Nesaru leave, and the Gahe, and the other stinking aliens that have kept us under their thumb flock through here. Pepper may have failed to kill the Doacq for me, Nashara may fail yet, but I won’t.”  She turned down another tunnel as Tiago bent over and grabbed his knees. This was insane. They were up against the Doacq?  “You did good, Tiago,” Kay said, her face under control again. “You got her to chase you, despite the rain incident. You got her to invest in you, to want to protect you, just enough that instead of grabbing June and running back to her ship, she decided to tackle the Doacq. It was perfect. You have a place among my lieutenants, a place on this island, Tiago. You did well.”  He didn’t feel like it.  Things had gotten complicated quickly. He hadn’t intended the mark to be a living legend.  He certainly hadn’t expected to be involved in the betrayal of a living legend.  Tiago shivered.  Kay had a safe house set up for them. It took getting out of the sewers and back onto the streets, through the alleys and people’s homes again. By the time they got inside, Tiago couldn’t tell where in Harbor Town he was. They’d doubled back, and around, and it was so late it was now probably officially early. His eyes were scratchy, his movements felt like they were delayed by a half second.  “Don’t worry,” Kay told him as she took their protective gear. “You’ll be safe here. There are people for the Doacq to catch. He’ll eventually slow down, turn his attention elsewhere. It’s all planned.”  It didn’t make Tiago feel any better. He caught the eyes of June, and the other boy certainly didn’t look reassured either.  But Kay caught that. And she spent time with them until they were mollified, and relaxed. There were Ox-men guarding the house, equipped with heavy machine guns, and escape routes everywhere.  A tall man came in with cold water and sandwiches. Somehow getting something in his stomach took the edge of Tiago’s fears.  Maybe it was just having something to do.  “There is more I have to do,” Kay said. “The caches of arms Nashara promised me need swept up and stored in secure locations. And eventually, I need to see who won.”  She left the room, five foot figure flanked by a pair Ox-men.  June stopped eating. “Do you trust her?” He asked.  Tiago looked up and wanted to say he did, but the words caught in his mouth. “I don’t know. She’s dangerous to cross.”  June gestured at his face. “As dangerous as this?”  “Yes.”  “Then I don’t want to have anything to do with her,” he said. “I’ve had enough.”  The boy looked exhausted.  “I’m sorry,” Tiago muttered. “I’m very sorry. I thought you would be going with Nashara.”  “The woman?”  “She’s looking for someone called Pepper. She says he’s her grandfather. She thinks you know . . . “  “They all do.” June looked down at the remains of his sandwich. “He was okay. I liked him. He paid us in gold to get him out of here, but there were ships waiting for us between the wormholes out and the island.  “He fought them off, and then when he realized we were in danger, jumped into the ocean and sank. Didn’t stop them from sinking the Zephyr III anyway. They killed everyone but me. Dragged me out of the ocean and took me back, forced me to tell them everything he did, or said.”  Tiago wrapped his arms around himself and leaned forward.  The Doacq was hunting them. Nashara may not even be alive, a victim to Kay’s machinations, just like Pepper.  And what was he? If she could throw their lives away so easily, what chance did he have of living if he moved closer into Kay’s world?  He thought of the contact, the compulsion he had to do what she wanted. It came from her voice, her posture, the way she could read him. And it wasn’t real.  With her out of the room, he could struggle away, couldn’t he? All that was left was his fear. Fear of consequences.  Fear that she would track him down for betraying her.  “She has a ship, an armed ship, she said, waiting for her. It’s called . . . the Strainer, or something like that,” Tiago said in a tumble of words. And then he said something he never would have, had he been doing this for Kay. “If you want, we can try to run for it.”  June didn’t even pause to think about it. “Yes. I’d run with you.”  “I could be trying to trick you,” Tiago said.  “I don’t care. I’ll take the chance. I don’t want to be trapped here, I don’t want to get eaten by the Doacq.”  Tiago found himself nodding with June.  “We leave the moment we see morning,” Tiago said.  “So you can spot rain?” It’d be suicidal to try and move through the city without any rain gear. And if he couldn’t see the rain coming, he wouldn’t know to hide from it.  “Yes. Do you have any family?”  June shook his head. “No. They’re dead now.”  Tiago did not follow that up with more questions. He didn’t want to know.  The Ox-men guarding them checked on them randomly. The moment the door closed, the early sun lighting a band of orange up over the rooftops, Tiago broke the locked windows open. There were other skills he’d picked up in addition to picking pockets.  June started to climb down the side, but Tiago shook his head. “Go up, to the roof. They’ll expect us on the street.” The Runners and Ox-men would fan out down there, hunting them.  Rooftop to rooftop would keep them out of sight for longer.  Once up there, Tiago oriented himself. They were closer to the docks than he’d dared hope.  They stuck to the roofs, clambering awkwardly up drain spouts and slipping on tiles. But they made it to the edge of the plaza after an exhausting hour.  The docks ran out from the seawall, long piers of concrete stacked with unloaded goods and Ox-men hauling carts back and forth.  It wasn’t until they’d walked through the crowds of the plaza, and then up onto the seawall, that Tiago relaxed a little. The Ox-men guarding them would have called the alarm by now, phoned Kay, and the entire town might be crawling with people hunting for them, but they’d at least gotten to the docks.  Tiago stopped a dock worker in greasy coveralls overseeing the unloading of a ship docked almost by the seawall. “We’re looking for a ship called Strainer, have you seen it?”  The man frowned. “Streuner? It’s over there.”  Tiago looked. It was a gun-metal gray boat with a large green flag with a black and yellow X on it.  June yanked Tiago around to face the plaza behind them. The hooded figure of the Doacq stood at the far side, people scattering away from it.  “I don’t think it . . . ” Tiago started to say, as the Doacq looked over the top of the crowd right at them, and began to move toward them. “Shit.”  “But it doesn’t come out in the day,” June said, his voice breaking with fear.  Kay had said it seemed to choose the night. That her lights replicating daylight hadn’t harmed it. He shouldn’t have been surprised. But he was. From across the plaza Tiago could see the unnaturally long jaw dislocated and drop, down past the alien’s chest, down almost to its feet. Anything that stood in the way disappeared into it: scared people, tables, chairs. It swallowed them all.  Tiago and June turned and sprinted for the dock leading to Streuner. An act of faith that they could protect them, really, but what else could they do?  They shoved people aside as they ran the slow curve, ignoring the curses aimed in their direction.  When they turned onto the dock and sprinted, Tiago looked over at the seawall. The Doacq barreled along it.  He realized he was screaming as he ran. Dockworkers were turning to look, and then jumping into the water as they realized it was the Doacq.  It gained on them. They had half the dock before they could reach the Streuner, and the Doacq was coming up the dock, may three hundred feet behind them.  Tiago knew he shouldn’t look over his shoulder, it slowed him down, but he couldn’t help it.  The dark pit of its maw was so wide and inescapable, ready to swallow them, the pier, and anything else.  As to where people ended up when it got them, only those swallowed knew, and they’d never come back to talk.  Tiago realized he was about to find out. He wasn’t going to make it to the end of the dock, where the Streuner waited. Maybe even if they made it, they’d still be swallowed up.  Maybe it could eat the whole boat.  He glanced back over his shoulder, and as he did so, a loud boom came from the end of the dock. Something large whipped past his head, and the Doacq staggered and fell.  Its mouth dipped, hitting the concrete of the dock and swallowing a scoop of it, concrete chipping around the edges of its mouth.  Another boom stopped it as it struggled up to its feet again.  Tiago redoubled his run, as did June. He ran so hard it felt like his joints would pop, his brain would be jarred free of his skull, and his lungs would burst into flames.  As they moved clear, the booms turned into an all-out barrage. Continuous thunder rolled from the ship, bursting out from large guns that had rolled out of emplacements all over the ship.  His eardrums stopped trying to understand the deafening sound as the entire section of the dock under the Doacq disappeared.  The Doacq had picked the wrong ship to run at.  Two dark-skinned crewmen, just like Nashara, held out their hands at the top of the plank leading on to the deck. Tiago sprinted into them, knocking them over and collapsing, panting, amazed to still be alive.  “Cast off!” Someone yelled, and the plank was tossed free. From his viewpoint on the deck, Tiago saw a tiny rocket shoot up several hundred feet into the sky, dragging a length of parafoil with it.  The foil expanded, filled with air, and the ship began to move.  A pair of feet in familiar boots stopped in front of Tiago’s face. He looked up. It was Nashara. She moved slowly, with a slight limp, and wore a patch over one eye. Her hair had been burned off, and one arm was in a sling.  She kneeled and grabbed his hand and said something, but he couldn’t hear it through the ringing in his ears because the guns still hadn’t stopped: Streuner shivered constantly as it continued firing on the Doacq as they moved away from the dock. Slowly, at first, but then the ship built a bow wave as it sped up.  A few minutes later the entire ship slowly struggled up onto the hydrofoils underneath its hull, and it popped free of the resistance of pushing against water.  They sped away from the docks, the deck tilting alarmingly as the Streuner turned hard toward the open sea.  The alien Doacq was falling further away from Tiago with each minute. So was Kay.  June was still in a room being checked over for injuries, but Tiago was allowed to wander around inside the ship. There were crew cabins, a kitchen, storage rooms, a common sitting area.  Nashara sat there, playing with a small piece of paper. She kept folding it until she had turned it into a tiny flower.  “She sent me to pick your pocket,” Tiago confessed, standing at the table. He’d expected the boat to sway more than it did, but the foils kept it almost rock steady. “It was a trap from the beginning. And I’m sorry.”  She looked up at him with one eye, and Tiago flinched. What would he do to someone who’d cost him an eye? What would someone as powerful as Kay do?  “I knew it was a trap,” Nashara said. “What I wasn’t expecting was the Doacq.”  “You?” He found that hard to believe, knowing the things Nashara had seen and participated in.  Nashara shook her head. “It’s a massive universe, Tiago, with many participants. The Doacq’s an important force, and I’m not sure what it’s up to. We need to find Pepper, if we can, if he’s still alive. If June can help. Maybe together we can find some answers, find out if the Doacq is a threat to us. But Tiago, I’m just tiny player on the edge of some large events. I don’t know half of everything. The universe is not tidy. You don’t always get quick answers.”  It was a sentiment that Tiago felt a kinship to. She felt just like him. Navigating her way through all this just as best she could.  But then that raised his suspicions.  “Are you saying that just to make me feel better?” He asked. “Do you rule me know, like Kay?”  If she had the same talents, why not?  “I mean, if I’m your pawn, you seem calmer than Kay,” he continued. “She isn’t just someone organizing street kids, protection setups, scams. Not anymore. Now she’s just using us up like our lives don’t even mean anything.”  Outside the ship slowed, hydrofoils sinking deeper into the water until the hull hit water.  Nashara crushed the little paper bird into a wad. “Sometimes we become the thing we’re fighting hardest against,” she said thoughtfully. “And Kay is fighting hard against an unimaginable past on Okur. I was there, once. I’ve seen what she came from. I don’t think she will stop fighting it for quite a while.”  Tiago thought about Placa del Fuego, caught between the forces of Kay and the Doacq, and wondered if the island would survive the both of them. “She said she’d rule the island.”  “And maybe more, no doubt,” Nashara said. Then something strange happened, a fluttering sensation in the deepest pit of Tiago’s stomach that left him suddenly dizzy. Nashara stood up and grabbed his shoulder. “Come, Tiago, I want to show you something.”  She led him out onto the rear deck of the ship, which was dominated by the black nothingness of a wormhole.  Tiago gasped. He’d never seen one this close, towering over his head. Large enough for a whole ship to pass through and that had once floated above a world. Spaceships had once passed through it before being deorbited.  And now him.  The sky overhead was covered by a dark, orange cloud in outer space, whisps of it streaming off toward the horizon. And cutting the sky in half: a silver twinkling band. The Belt of Arkand. He’d heard it mentioned by sailors, and here he stood looking at it with his own eyes.  “You asked if I made you do this,” Nashara said. “But this was your own choice. I didn’t make you do it. This is your new life now.”  But was it the right choice?  He looked around at the strange sea they plowed through, and saw another wormhole far ahead in the distance, propped on floats and bobbing on the surface of the green ocean. That wormhole led to yet another ocean, and more worlds.  More possibilities.  Maybe not the right choice. Only time would tell that. But it was certainly his choice, he knew, leaving all those years of sitting on the sea wall and dreaming behind for a chance just like this. Called \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.  His Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"  He currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs.", "text": "8420 words, novelette\nPlaca del Fuego\nTiago would normally have taken his cut of the picked pockets and stopped right here at the Seaside Plaza. On the very edge, past the vendors on the cobblestone sea walk, Tiago would sit with his legs over the rocky sea wall and look out over the harbor.\nToday he only detoured through the plaza to throw the crowd in between him and the woman chasing him.\nHe’d gotten a brief glimpse of her before the running started: tall, dark eyes, dark skin, dark leather jacket and microfibre pants, careful dreadlocks pulled back into a pony tail.\nShe was fast in the crowd. She wasn’t dodging around legs, using the ebb and flow of the masses to see open routes like Tiago. No, people who got in her way were just . . . thrown out of the way.\nToo strong. She was some sort of soldier, Tiago thought, refocusing ahead.\nHe might have gotten himself into a bit of a situation.\nSlipping onto the seawall path, he sprinted harder, deciding that she was covering the gap in the crowd. To his right the harbor was filled with ships and their cargo, anchored and waiting for a spot to clear on the docks. One of them was throwing out a parasail, the windfoil bucking in the inconsistent harbor wind, but then filling out, rising up into the air hundreds of feet overhead, and then some.\nThe ship began to pick its way out of the harbor, headed between the tall forest of wind turbines at the harbor’s edge: a dangerous move to unleash a windfoil in the harbor, but suddenly Tiago noticed other ships unfurling sails in haste. A cloud of brightly colored parafoils leapt to the harbor sky like butterflies swarming from a shaken limb.\nThis was worrying enough that Tiago slowed, somewhat, and looked to his left. The warehouses, three and four stories tall, dominated the first row of buildings. But behind them, climbing tenaciously up the side of the mountain, homes and houses colorfully dotted the slopes.\nA large, dark mass of gray haze topped the rocky crest and slowly fell down toward the harbor like a heavy cloud.\n“Oh shit.” Tiago stopped. People in the Plaza were turning too, and murmuring started to spread. They stood up from picnics or meals and the edges of the crowd were already leaving.\nThe woman smacked into Tiago and grabbed his upper arm.\n“Take your damn money,” Tiago shouted. I don’t want it. I’m sorry. Just let me go.”\nShe looked puzzled as he shoved the paper money into the pockets of her jacket. He may have even given her more than he’d stolen, he wasn’t sure.\n“What’s . . . “\nTiago pointed up the mountain. “It’s going to rain.”\nShe looked over the buildings and let him go. “I forgot.”\nForgot? There were two things on the island to remember: stay out of the rain, and avoid the Doacq’s attention by staying inside at night.\nHe bolted. The last thing he saw was the armada of harbor ships, parafoils all full overhead, pulling their hulls up onto their hydrofoil skids as they all scattered to get well clear of the island.\nThen the sirens began to wail all throughout Placa del Fuego, alerting its citizens to the descending danger.\nFrom the open sweep of the docks and seawall of the harbor, Tiago headed into the heart of Harbortown. He could breathe easier seeing overhangs above him, and walls he could put his back to.\nPeople hurried about with carbon-fiber or steel umbrellas. Some had already gotten into their hazmat gear.\nThe klaxons wailed in the background, constantly blearing out their call for all to find shelter. Shops slammed thick windows shut and bolted them, while people yanked tables and chairs and billboards inside. Customers packed in, shoulder to shoulder.\nNo self respecting shop would let Tiago inside: he was an urchin. His clothes were ripped and melted, his face dirty, and he ran on bare feet.\nThey’d toss him out on his ass faster than he could get inside.\nA faint stinging mist started to fill the air. Tiago squinted and slowed down. The unfamiliar would run faster, but then they’d inhale more. He cupped his hands over his mouth, a piece of flannel in between his fingers to filter the air. He looked down at the cobblestoned street to protect his eyes.\nHis calloused, flattened feet knew the street. Knew how many steps it would take to reach the alley, knew how many times he’d have to pull himself up on the old pipe running outside to get up onto the roof, and how many more steps across the concrete to get to his niche.\nIt was a spot between two old storage buildings a few streets back from the waterfront, almost near the Xeno-town enclave. One of them had a large, reinforced concrete gutter along its edge, and when the second building had been built right along side, wall to wall, had left a sheltered ledge the length of the building.\nYou wouldn’t know it to look at it. Twenty street kids had taken bricks and concrete and built a wall along the overhang, blending it into the architecture. It was behind this that Tiago had his very own room.\nTo get to it, he stepped out over the edge of the building, and behind the wall.\nSafe.\nHis skin stung from contact with the mist, but he could sit in the entryway along the corridor leading down to the seven foot by four foot concrete cubicles they called home, and watch the rain.\nIt was a floating, frothy jelly, spit out from the trees on the island into the air, that slowly floated down. In most cases it just slowly burned at whatever it landed on, like some sort of an acid.\nBut after that, all it took was a spark for it to ignite.\nIn the distance the harbor pumps thrummed to life. All over the city the engineers were fighting back the rain with a mist of their own, taken from the harbor water to coat and rinse the harbor.\nUsually being on this side of the mountain protected them. But sometimes the wind changed. Sometimes the fire forests were unusually active.\nEither way, you didn’t want to be outside. The burns and scars on the children huddled around the openings of their sanctuary testified to that.\nThe steady rain continued, sizzling as it hit the ground outside.\nTiago relaxed in the quiet among his neighbors as the city fought the rain. He could worry about explaining to Kay why he was coming back with no money from the morning’s work later, as much as that scared him. For now, he was just happy to be out of the rain.\nHe just about leapt out of skin as the wall next to him crumpled and the woman who’d been chasing him shoved her way through and crouched in front of him.\n“Hello,” she said. “We still have business to finish.”\nTiago jumped up to run and the other kids moved back away from him.\nBut where could he go with the rain coming down so hard?\nHe looked back at his pursuer. The rain had eaten away at the skin on her forearms, exposing silvery metal underneath. Metal pistons snicked as she flexed her fingers.\nA cyborg. Here on Placa del Fuego.\nImpossible.\nThere was no advanced machinery on Placa del Fuego. It all failed on the island, until one reached three miles offshore. In Harbortown the sailors said scientists from other worlds clustered aboard large ships near the wormholes, monitoring what islanders called the deadzone and they called ‘an unexplained continuous EMP event.’ They claimed the epicenter was somewhere deep under the crust of the planet, right under Placa del Fuego.\nThe wormholes that lead from the ocean around Placa del Fuego to the oceans of other worlds light years away were anchored in the water just on the edge of the deadzone, and the scientists were there to order the wormholes moved as the deadzone expanded slightly each month.\nOne street rumor said that one of the alien races had buried a device under the island, intending to use it as a cover for a last stand during the human war for independence. Some said it was the Doacq that bought the deadzone with it.\nIt didn’t matter what or who caused it. The end effect was that the town used pneumatic tubes to send messages. Ox-men from Okur pulled rickshaws around, or people used the compressed air powered trolley cars. Everything ran on compressed air: the town’s reservoirs were filled by the myriad wind turbines that festooned the harbor entrance and the exposed ridges of the mountain.\nBut because of the deadzone, this woman shouldn’t have been here, Tiago thought. She shouldn’t even work. But in the cramped darkness of his room the cyborg woman squatted on Tiago’s hand-carved wooden stool.\nAs Tiago turned on a bright white LED lamp she counted off a lot more money than he’d stolen, or given back to her. Bill after bill after bill. A massive fistful. A month’s takings.\nIt hovered between them.\n“Before you tagged me and made the pick,” she said, “you seemed to know your way around the harbor. I need someone like you.”\nTiago took a deep breath. He wasn’t sure if he needed someone like her.\nShe was trouble.\nThe hesitation must have been obvious to her. She smiled. “I’ll double what you want.”\nWhat was the alternative? Tiago took the money. He’d be a fool not to.\n“What are you looking to do?” he asked.\n“I need to find the person at the top of the underground. Who sees all and knows all.” The cyborg shifted, and the stool creaked. Tiago grimaced. It was made of imported wood, and it was his most precious possession. “I’m looking for Kay.”\n“Kay?” Tiago feigned confusion.\n“You know who I’m talking about,” the woman smiled.\nHe did. He wasn’t very good at lying straight-faced. He swallowed nervously. “What do you need from her?”\n“I need Kay’s help.” Tiago waited for more, and the cyborg continued. “To find my grandfather. How do I find this person?”\n“You don’t find Kay,” Tiago said. He folded the money away into the depths of his ragged clothes. “She finds you. Go find yourself a nice room along the waterfront somewhere. Kay will show up now that someone knows you’re trying to find her. That’s how it works.”\n“Word on the street.” The woman leaned forward and held out her hand. A card rested in her palm. “I’ll pay you the other half when I meet Kay. Come find me tomorrow at noon.”\nTiago took the card. An address had been scribbled onto it. “What is your name, then?”\n“Nashara.”\nNashara. A cyborg called Nashara. The Nashara? Was he really talking to a living, breathing legend?\nTiago’s hands shook.\nShe was a lot more than just trouble.\nHe’d gotten himself in way, way deep into something.\nNashara, left, walking out in to the sizzling rain like it was no more than an inconvenience.\nIt was only a moment before Tiago’s neighbors parted and the tiny figure of Kay walked out. Her grey eyes took in the broken brick with a flick before she turned to face him. Her hair was cut just short of her ears, almost boyish. She was shorter than Tiago, something that always surprised him. In his own mind she stood much taller. “I’ll have it repaired,” she said calmly, flicking her head at the destruction.\nKay’s fixing the damage would obligate them to her.\nBut no one said anything. Refusing it would be an even bigger problem.\nThey might come to beat him up tonight, Tiago thought. If they weren’t too scared.\n“You were here the whole time?” Tiago asked, his voice cracking slightly with fear.\nKay ignored his surprise. “That was a Nashara. Here on the island. I wonder how she’s able to work here?” Ox-men: two large slabs of hairy muscle, large eyes and flat noses, squeezed into the passageway behind her, stooping over to fit. They regarded Tiago with dull, incurious eyes.\n“I don’t know . . . ” Tiago muttered.\nKay unpacked a Kevlar poncho and pulled it carefully on. She buckled on a gas mask. Behind her, the two Ox-men did the same.\nIn a muffled voice she told Tiago, “Do you know how expensive it would be to shield someone like her, a cyborg, to be able to function in the deadzone? That must be what she’s done. It means she has access to . . . incredible resources.” She paused thoughtfully, thinking about that. Then she continued. “I have preparations to make before I’ll meet her. Keep your appointment. I’ll send someone for you both.”\nShe stepped out into the rain, and the Ox-men followed her. The three of them disappeared over the side of the building in the haze, and Tiago turned around to face the boys trying to hide in the shadows.\nHe could tell by the fear on their faces that they would not be bothering him.\nThey were far, far too scared of Kay.\nSo was he.\nNashara sat at a table outside a seawall restaurant, surveying the Plaza over a cup of tea. A few small fires had broken out the night before where jellied rain had landed on canopies or abandoned stalls. But considering the strength of last night’s storm, it wasn’t too bad, Tiago thought. He’d certainly seen worse.\nHis new benefactor motioned Tiago to sit with her.\n“It’s odd,” she muttered as he sat. “All this stone, brick, slate. Leather for clothes. No wood, no fabrics. Hardly any trees, not even scrub. Grim.”\nTiago looked down at his patched clothes. She was surprisingly ignorant about the island if she was the real Nashara. The real Nashara had cloned her own mind to infect alien starships in the fight for human independence. The real Nashara was a founder of the Xenowealth. The real Nashara was a force of nature. That Nashara, it seemed to Tiago, would, at least know about stuff here on the island. “Rich people have them,” he said. “In those glass houses.”\n“Greenhouses?”\nTiago shrugged. “Sure.”\nSometimes, in the quieter moments, looking out over the harbor, he’d wondered what the places were like out over the horizon, and through the wormhole the ships sailed through to get to the oceans of other worlds, and through wormholes in those oceans to even more. Other worlds where things were made, and then transported here. Where people like Nashara came from.\nBut it was useless to daydream too much about where the ships went. Because they weren’t taking Tiago along with them. No matter how much he wished for it whenever he sat on the sea wall.\nNashara set her tiny wooden cup down and stood up. “I think Kay will be receiving us now.”\nTiago turned around, and the two Ox-men he’d seen last night had silently, amazingly for their bulk, walked up right behind him.\nThey didn’t have to say anything, they turned around and began to walk away. Nashara followed.\nAnd that, he thought, was the end of that.\nOnly it wasn’t.\nUp at the end of Onyx street, down the stairs cut into the side of the road and in the basement of an old house tunneled into a rock outcropping at the very edge of town, was one of Kay’s many lairs.\nHe’d been summoned there, two days later.\nAmber late-afternoon light pierced the dusty windows, and a menagerie of Placa del Fuego’s shadowy denizens milled about. There were more Ox-men, some Runners, and even a few simple-minded Servants. Lots of grubby kids like Tiago, many of them faces he recognized from Elizan’s crew crowded in, as well as others from all over the rest of the city. They were Kay’s crew, now, all of them. She owned the Waterfront and the Back Ring, and was almost done finishing up controlling the Harbor.\nIf it was criminal, and happened in Placa del Fuego, Kay wanted to run it.\nIt had been different, last year. Last year Tiago worked for Elizan; a high strung old man who would leap at a chance to whip anyone who’d held back the take.\nA tough life: Tiago still had misshapen broken bones to prove it, but it beat trying to live outside alone. Something he’d learned quickly enough.\nPlaca del Fuego had no heart for the homeless.\nWhen Kay appeared on the streets in the Back Ring, rain-burned and tired, she’d been ignored. For the first week. The second week she’d figured out the command structure of one of the drug cartels and executed the commander with a sliver of knapped flint.\nWithin days the cartel danced to her tune.\nRumors said she came from Okur, where the birdlike alien Nesaru had established a colony. Under the Bacigalupi Doctrine, anticipating the lack of fuel and the collapse of the interstellar travel after the war for independence, the Nesaru had bred humans into a variety of forms to serve them. Nesaru engineered, bred, and reshaped human Ox-men and Runners had fled Okur to Placa del Fuego. So had Kay.\nShe was something else, Okur refugees said. Something designed to control the modified human slaves under the Nesaru’s thumb. She could read your thoughts by the slightest change in your posture, a twitch in a facial muscle. She emitted pheromones to calm you, convince you, and used her body to control your personal space.\nYou were a computer, waiting to be programmed. She was your taskmaster. A perfect, bred, engineered, manipulator of humankind.\n“Tiago,” Kay said, beckoning him closer. “Nashara and I have quite a job for you.”\nNashara stepped out from behind a thick stone pillar. “There will be considerably more money in it for you.”\nKay put a protective arm around Tiago. “I really need your help with this, Tiago.”\nHe stiffened slightly as she moved in closer, creating a tiny world between just the three of them. “What do you need?” he asked, hesitant.\n“You keep a low profile, Tiago. Back of the crowd. You don’t try to cheat me of my cut. You wouldn’t even dare think of it.”\nTiago nodded. Don’t get noticed. Don’t cross dangerous people like Kay unless you could run. Melt into the background. These were core life principles of his. It was why he made a good pickpocket. There was even a mid-sized bounty available for his capture.\n“More importantly, you’ve been in the Dekkan Holding Center,” Nashara said. In the distant background the sound of rain alarms drifted through the streets. A night storm. The worst kind.\nA cold chill gripped Tiago. “You want me to go back to The Center?” Images of the dark warrens flitted back to the front of his mind.\n“Not as such.” Kay pointed a Kevlar poncho and gas mask hanging by the door. “Suit up.”\nThey walked through the slowly darkening streets, the rain hissing against their protective gear. Nashara wore goggles and a long leather fisherman’s coat that seemed impervious to the rain, Kay the same outfit as Tiago.\nTheir footsteps clicked against cobblestone as Kay led them through sidealleys and tiny backstreets so cramped they had to move through them single file.\nNo one else was out.\nTiago stopped a tremble in his hands at the thought of being out at night.\nSeveral times they came to dead ends, where small locked doors stopped Kay’s progress. But a few knocks in a pattern and they would open, and the trio would tromp through someone’s front room, leaving sizzling drops of rain behind.\nThere was no hurry, and Tiago gauged that they’d moved across the entire city over the last two hours.\nKay finally stopped and removed her gas mask in the quiet foyer of a restaurant, eerie in its empty state, though the tables were all set and ready: waiting for the morning crowd. She looked right at Tiago as he removed his mask. He burned his fingers on the wet straps as she said, “I’m turning you over to the warden of the DHC for the bounty. The driver of the prison wagon has been paid to suggest stopping to pick you up.”\nHe felt numb. Outside, Tiago saw through the windows, the rain had fallen to a drizzle. The gaslight streetlamps flickered shadows as the wind flicked their flames this way and that.\n“So you do want me back in the hellhole,” he said, the misery leaking out into his voice.\nKay pulled out a packet of photos and spread them with a flourish across a nearby table like a card dealer. “No. You’ll get picked up, but there’s someone inside the wagon that Nashara wants.”\nTiago frowned. Kay was helping Nashara why? He couldn’t quite put together what was happening here.\nKay leaned close. She was doing it, creating that little bubble of space that seemed to exist just between the two of them. It was some sort of talent, almost magical. “Don’t try to figure it out, Tiago. Just take a look at the pictures of the crew of the Zephyr III. One of them will be in the wagon. We need your help.”\nHe looked up and out of the bay windows. He wondered how far he could get if just ran. He had some money, maybe he could stowaway on a boat.\nHow long could he evade Kay?\nNot very long.\nShe gently grabbed his jaw to point his gaze back down at the table. She’d read his thoughts via his body language. “There’s no running, Tiago. Not now.”\nHe swallowed and committed the faces before him to memory, something other than fear building as she put a hand on his back to steady him.\n“I’ll be there as well,” Nashara said from by the door. She’d opened her coat up, and underneath Tiago saw more guns lining the inside than he’d even known a single person could carry. She was a walking arsenal. You rarely saw any guns on the island, too expensive, even for criminals.\n“So why don’t you just break into the wagon and get the person you want?” Tiago asked.\n“Don’t want to tip my hand until we know we have the person we want. Otherwise, if we go in too early guns blazing on the wrong wagon, our guy could get hidden further, or put under tougher security. So you’re our scout, Tiago. When you give us the go ahead, we move in to recover both of you.”\n“And if the person isn’t there, I get beaten, interrogated, and locked up.”\n“We will get you out quickly if that happens, we can bribe a few judges, and Nashara is ready to pay you well,” Kay said. She was pulling on her poncho. Before she snapped on the bug-like gasmask, she continued. “I have to go meet the wagon. I’ll be back shortly.”\nThis was his moment to bolt.\nNashara picked up the pictures of the crew. “Three weeks ago. You remember anything strange happening?”\nTiago stopped thinking about other lives and worlds. “There was a fight. At night. All over the town. Whoever it was burst through walls, fell through roofs. Ripped up road. No one saw much of it. We just saw the damage . . . “\n“It was my grandfather: Pepper was on his way back with information about a new threat to the Xenowealth worlds. He disappeared here, last seen getting aboard the Zephyr III. But the Zephyr was destroyed in a limited yield nuclear blast event nowhere near any of the wormholes out, but a hundred miles north of here in the polar ocean.\n“Word is that one survivor from the Zephyr III came back. You’re going to help me acquire him. I came with a ship, it’s pretty heavily armed up: the Streuner. Pepper didn’t have backup, I’m not making the same mistake. Once we’re on the ship, it’s a run for the wormhole, back into the heart of the Xenowealth, for debriefing.”\nAcquire him. There was a strange turn of a word, Tiago thought. She was a kindred soul to Kay. Someone who wove the fate of everyone around them.\nHe was just a pickpocket. It was all he ever really aspired to. His own quiet moments on the seawall, a safe, dry place to sleep. Good food.\nNow he was caught up in something that involved the fates of the connected worlds.\n“What does Kay get out of it?” Tiago asked, treading into areas which he knew he shouldn’t be poking his nose.\nNashara tapped the inside of her coat, and the guns jiggled. “Force multipliers.”\n“You know what she’ll do with all that?”\nNashara nodded, her dreadlocks shaking as she did so. “She plans to run the island.”\n“She will.”\n“Maybe. But only if she stops depending brazenly on those modifcations the Nesaru bred into her.” She smiled at Tiago’s shock that she knew about that rumor. “You’re an open book to her. And she holds your strings. But only when she’s standing in front of you. She has to learn other ways to get people to do her bidding, and her teachers have been the underbelly of Harbortown. To be a great leader requires more, it requires people to trust you just as much when you’re not standing right in front of them. That takes something else. Besides, what she has: it’s not that special a talent.”\n“Do you have it?”\n“Yes. Different technology, not biological, but same result. But Tiago, free will’s a bitch. Kay can only manipulate. Underneath, we still move our own lives forward. You understand? We fought the entire war over that, back when the Satrapy ruled everything. Before human independence.”\nOnly someone as powerful as she was, Tiago thought, could believe that about free will.\nHe chose not to say that.\nBut then, she could probably see him thinking that anyway.\n“Here.” Nashara pressed a small sliver of metal into his palm. “Jam that under the target’s skin, it’ll tag him for me and let us know to come get you both.”\n“Okay.” He’d have to keep this out of the cops’ hands. Easy enough. He’d snuck small items around the heavy security of The Center.\nOutside the loud hiss of a compressed air powered wagon drew closer, and then it stopped. Nashara pulled a large pistol out and aimed it cheerfully at Tiago’s head. “Time to turn you in, Tiago.”\nTiago had sworn many oaths to never end back up in one of these wagons. Yet here he was again. It was near midnight as they jerked into motion with a belch. Tiago looked around. Unfamiliar, bruised, battered faces regarded him.\nFor a moment he panicked, not seeing any of the faces from the pictures Kay had shown him. He imagined getting locked away in the sweaty man-made caverns underneath Harbor Town.\nThen he saw the youngest face in the wagon and recognized it from the photos he’d been shown of the crew of the Zephyr III. It was just a boy. A boy who was younger than Tiago.\nCould he drag him into the net Kay and Nashara had cast?\nYes. The boy was already caught up in the mess from being on the same boat as Nashara’s grandfather.\nTiago stood up, tripped, caught himself, and then sat down near the locked rear door.\nThe boy hadn’t even felt the pinprick of Nashara’s tiny device.\nTiago waited, tensed, for something, anything, to happen.\nThe wagon rolled on, turning a corner, headlights revealing ten Ox-men blocking the road with spike strips. The wheels of the wagon exploded as they were shredded, and it rattled to a halt on the rims as prisoners in back were thrown against each other.\nNashara landed on the ground outside. She must have leapt off the top of a building nearby, Tiago realized, as pulverized cobblestone leapt into the air from her impact.\nShe ripped the door open, shattering the lock, and reached in to pull the boy out. Tiago jumped out next to them.\nThree Ox-men ran into the alleyway, eyes wide with fear. “Doacq,” one shouted in a low rumble.\nNashara looked down the road. “Tiago, what the hell is that?”\nTiago didn’t need to glance a second time. “Oh shit. Shit! The Doacq. We need to get out of here. Now!”\nThe seven foot tall, hooded figure moved with unnatural quickness down the street. Tiago caught a glimpse, in the flicker of gaslamp, of two large, catlike eyes under the cowl and a slit-like nose.\nBut it was the mouth that he noticed most. It yawned, the jaw dislocating and stretching like a snake’s: a two foot gaping chase of darkness.\nThe Doacq whipped across the street, slamming into an Ox-man. The jaw dropped even lower, and the Doacq rose taller, somehow, and then the gaping maw descended on the Ox-man.\nHundreds of pounds of rippling, engineered, brute strength disappeared, and the Doacq turned to face the wagon.\n“That’s a damn wormhole in its mouth,” Nashara said, awe in her voice. Then she grabbed the side of the wagon and grunted. “And it’s generating an EMP field . . . “\nThe Doacq flowed forward, the robe rippling in the slight wind. The massive jaw gaped wider and wider as it got closer. It seemed all maw to Tiago, mesmerized by the black nothingness opening up, propelled by the creature’s feet.\nNashara pulled out a large shotgun, and the deafening discharge filled the tiny stone canyon of street and houses. The Doacq twitched to face the incoming shot . . . and swallowed it all without any change in its approach.\n“Son of a bitch,” she said, and then leapt forward. The Doacq, ducked and grabbed her, redirecting the energy of the jump to throw her in the side of a house.\nNashara staggered back to her feet in the middle a mess of rubble.\nTiago grabbed the boy and looked around for a place to hide. One of the nearest doors opened, and whip-lean shape of a Runner beckoned at him to get inside.\nHe needed no encouraging. He ran for the door.\nThree explosions shook the street, and Tiago saw with a glance back that Nashara had flicked grenades at the Doacq. It swallowed several, but couldn’t be in more than one place at the same time.\nAnother grenade exploded to its side, and the Doacq faltered. Shreds of its cloak and flesh splattered on the ground and an animal-like shriek of pain filled the streets.\nThe Doacq was not supernatural, Tiago thought, dazed. It could be harmed. He paused at the doorway. Maybe Nashara could face it down.\nBut then the Doacq spotted him, and turned for the building, completely ignoring Nashara.\nAn Ox-man yanked Tiago into the house and barred the door shut. “This way,” the Ox-man grumbled, and shoved the two boys forward through the house.\nA trapdoor underneath a table led them under the house, into a hidden basement lit by a single bulb.\n“Through here,” said a Runner, appearing out of the dark. The shadows made his ribs, visible under a thin shirt, look even more pronounced than normal.\nThere was heavy, thick steel door a pair of Ox-men had opened. As they passed through that, they groaned shut, and then dropped to the ground as something was kicked out from underneath them. The smell or rank sewage took the breath away from Tiago, and he switched to breathing only out of his mouth.\nIn the distance, and explosion of brick and screaming startled Tiago. The Doacq must have gotten into the house. With Nashara in pursuit.\nThey were standing inside a tunnel, lit glancingly by the Runner’s flashlight. The center of the tunnel had a wide trench in it, currently dry.\nIt revealed Kay waiting with a pair of Ox-men armed with RPGs. They aimed the weapons at the thick door behind Tiago.\n“So this is our quarry,” Kay said, turning on a small penlight to check the boy. “Your name is June, right?”\nThe shellshocked, beaten boy nodded.\n“Can you speak, June?”\n“Yes.” It was a faint whisper, unsure of itself. But it was the most June had done since this had all started, other than let Tiago drag him around to safety.\n“Well June, this is Tiago, and we have to move quickly before the Doacq comes after us. It likes characters like us. It finds us interesting.”\nKay led them down the gentle slope of the tunnel at a brisk pace to a junction, where the sound of running water filled the air, and the stench increased.\nFive Ox-men stood in a trench full of dirty water holding onto a small metal boat with an electric engine on the back.\nSomething boomed in the distance, echoing through the sewer tunnels, as they clambered in.\nKay smiled. “That should slow the Doacq down.” She waved her hand at the Ox-men and they let go. She gunned the engine up to a brisk whine as the boat shot clear, bouncing off the sides of the trench.\nTiago had a moment to absorb everything now. He turned to Kay. “All this preparation. You knew the Doacq was coming? How?”\n“He always comes when there’s this much activity,” Kay said. “And he’s difficult to stop. I thought maybe he was allergic to the sun, but he shrugged off the ultraviolet and full spectrum lamps I installed on his favorite haunts. Since then, it’s gotten harder and harder to hunt. I can’t even get a good picture of it, cameras fail around it.”\nTiago felt like he was looking at a different person. “How can you know so much about the Doacq?” Most of the town didn’t even talk about it, they whispered about it and avoided the night. When people disappeared, you didn’t dwell on it. You knocked on wood that you would never be the one to turn a corner, and see the Doacq standing there.\n“You hunt the Doacq?” Tiago asked.\nShe heard the stunned disbelief in his voice and turned on him. “It’s an alien. It’s not some supernatural creature, Tiago. It’s like the Nesaru, just more powerful. We don’t know where it comes from, but just like the other aliens, it plays on human land as if it owns it. It thinks it rules us, but it doesn’t!”\nThere was a hatred in her face, naked for the two boys to see. She’d let her control slip. “I will destroy it. And then I will take the island. And after that, I will make the Nesaru leave, and the Gahe, and the other stinking aliens that have kept us under their thumb flock through here. Pepper may have failed to kill the Doacq for me, Nashara may fail yet, but I won’t.”\nShe turned down another tunnel as Tiago bent over and grabbed his knees. This was insane. They were up against the Doacq?\n“You did good, Tiago,” Kay said, her face under control again. “You got her to chase you, despite the rain incident. You got her to invest in you, to want to protect you, just enough that instead of grabbing June and running back to her ship, she decided to tackle the Doacq. It was perfect. You have a place among my lieutenants, a place on this island, Tiago. You did well.”\nHe didn’t feel like it.\nThings had gotten complicated quickly. He hadn’t intended the mark to be a living legend.\nHe certainly hadn’t expected to be involved in the betrayal of a living legend.\nTiago shivered.\nKay had a safe house set up for them. It took getting out of the sewers and back onto the streets, through the alleys and people’s homes again. By the time they got inside, Tiago couldn’t tell where in Harbor Town he was. They’d doubled back, and around, and it was so late it was now probably officially early. His eyes were scratchy, his movements felt like they were delayed by a half second.\n“Don’t worry,” Kay told him as she took their protective gear. “You’ll be safe here. There are people for the Doacq to catch. He’ll eventually slow down, turn his attention elsewhere. It’s all planned.”\nIt didn’t make Tiago feel any better. He caught the eyes of June, and the other boy certainly didn’t look reassured either.\nBut Kay caught that. And she spent time with them until they were mollified, and relaxed. There were Ox-men guarding the house, equipped with heavy machine guns, and escape routes everywhere.\nA tall man came in with cold water and sandwiches. Somehow getting something in his stomach took the edge of Tiago’s fears.\nMaybe it was just having something to do.\n“There is more I have to do,” Kay said. “The caches of arms Nashara promised me need swept up and stored in secure locations. And eventually, I need to see who won.”\nShe left the room, five foot figure flanked by a pair Ox-men.\nJune stopped eating. “Do you trust her?” He asked.\nTiago looked up and wanted to say he did, but the words caught in his mouth. “I don’t know. She’s dangerous to cross.”\nJune gestured at his face. “As dangerous as this?”\n“Yes.”\n“Then I don’t want to have anything to do with her,” he said. “I’ve had enough.”\nThe boy looked exhausted.\n“I’m sorry,” Tiago muttered. “I’m very sorry. I thought you would be going with Nashara.”\n“The woman?”\n“She’s looking for someone called Pepper. She says he’s her grandfather. She thinks you know . . . “\n“They all do.” June looked down at the remains of his sandwich. “He was okay. I liked him. He paid us in gold to get him out of here, but there were ships waiting for us between the wormholes out and the island.\n“He fought them off, and then when he realized we were in danger, jumped into the ocean and sank. Didn’t stop them from sinking the Zephyr III anyway. They killed everyone but me. Dragged me out of the ocean and took me back, forced me to tell them everything he did, or said.”\nTiago wrapped his arms around himself and leaned forward.\nThe Doacq was hunting them. Nashara may not even be alive, a victim to Kay’s machinations, just like Pepper.\nAnd what was he? If she could throw their lives away so easily, what chance did he have of living if he moved closer into Kay’s world?\nHe thought of the contact, the compulsion he had to do what she wanted. It came from her voice, her posture, the way she could read him. And it wasn’t real.\nWith her out of the room, he could struggle away, couldn’t he? All that was left was his fear. Fear of consequences.\nFear that she would track him down for betraying her.\n“She has a ship, an armed ship, she said, waiting for her. It’s called . . . the Strainer, or something like that,” Tiago said in a tumble of words. And then he said something he never would have, had he been doing this for Kay. “If you want, we can try to run for it.”\nJune didn’t even pause to think about it. “Yes. I’d run with you.”\n“I could be trying to trick you,” Tiago said.\n“I don’t care. I’ll take the chance. I don’t want to be trapped here, I don’t want to get eaten by the Doacq.”\nTiago found himself nodding with June.\n“We leave the moment we see morning,” Tiago said.\n“So you can spot rain?” It’d be suicidal to try and move through the city without any rain gear. And if he couldn’t see the rain coming, he wouldn’t know to hide from it.\n“Yes. Do you have any family?”\nJune shook his head. “No. They’re dead now.”\nTiago did not follow that up with more questions. He didn’t want to know.\nThe Ox-men guarding them checked on them randomly. The moment the door closed, the early sun lighting a band of orange up over the rooftops, Tiago broke the locked windows open. There were other skills he’d picked up in addition to picking pockets.\nJune started to climb down the side, but Tiago shook his head. “Go up, to the roof. They’ll expect us on the street.” The Runners and Ox-men would fan out down there, hunting them.\nRooftop to rooftop would keep them out of sight for longer.\nOnce up there, Tiago oriented himself. They were closer to the docks than he’d dared hope.\nThey stuck to the roofs, clambering awkwardly up drain spouts and slipping on tiles. But they made it to the edge of the plaza after an exhausting hour.\nThe docks ran out from the seawall, long piers of concrete stacked with unloaded goods and Ox-men hauling carts back and forth.\nIt wasn’t until they’d walked through the crowds of the plaza, and then up onto the seawall, that Tiago relaxed a little. The Ox-men guarding them would have called the alarm by now, phoned Kay, and the entire town might be crawling with people hunting for them, but they’d at least gotten to the docks.\nTiago stopped a dock worker in greasy coveralls overseeing the unloading of a ship docked almost by the seawall. “We’re looking for a ship called Strainer, have you seen it?”\nThe man frowned. “Streuner? It’s over there.”\nTiago looked. It was a gun-metal gray boat with a large green flag with a black and yellow X on it.\nJune yanked Tiago around to face the plaza behind them. The hooded figure of the Doacq stood at the far side, people scattering away from it.\n“I don’t think it . . . ” Tiago started to say, as the Doacq looked over the top of the crowd right at them, and began to move toward them. “Shit.”\n“But it doesn’t come out in the day,” June said, his voice breaking with fear.\nKay had said it seemed to choose the night. That her lights replicating daylight hadn’t harmed it. He shouldn’t have been surprised. But he was. From across the plaza Tiago could see the unnaturally long jaw dislocated and drop, down past the alien’s chest, down almost to its feet. Anything that stood in the way disappeared into it: scared people, tables, chairs. It swallowed them all.\nTiago and June turned and sprinted for the dock leading to Streuner. An act of faith that they could protect them, really, but what else could they do?\nThey shoved people aside as they ran the slow curve, ignoring the curses aimed in their direction.\nWhen they turned onto the dock and sprinted, Tiago looked over at the seawall. The Doacq barreled along it.\nHe realized he was screaming as he ran. Dockworkers were turning to look, and then jumping into the water as they realized it was the Doacq.\nIt gained on them. They had half the dock before they could reach the Streuner, and the Doacq was coming up the dock, may three hundred feet behind them.\nTiago knew he shouldn’t look over his shoulder, it slowed him down, but he couldn’t help it.\nThe dark pit of its maw was so wide and inescapable, ready to swallow them, the pier, and anything else.\nAs to where people ended up when it got them, only those swallowed knew, and they’d never come back to talk.\nTiago realized he was about to find out. He wasn’t going to make it to the end of the dock, where the Streuner waited. Maybe even if they made it, they’d still be swallowed up.\nMaybe it could eat the whole boat.\nHe glanced back over his shoulder, and as he did so, a loud boom came from the end of the dock. Something large whipped past his head, and the Doacq staggered and fell.\nIts mouth dipped, hitting the concrete of the dock and swallowing a scoop of it, concrete chipping around the edges of its mouth.\nAnother boom stopped it as it struggled up to its feet again.\nTiago redoubled his run, as did June. He ran so hard it felt like his joints would pop, his brain would be jarred free of his skull, and his lungs would burst into flames.\nAs they moved clear, the booms turned into an all-out barrage. Continuous thunder rolled from the ship, bursting out from large guns that had rolled out of emplacements all over the ship.\nHis eardrums stopped trying to understand the deafening sound as the entire section of the dock under the Doacq disappeared.\nThe Doacq had picked the wrong ship to run at.\nTwo dark-skinned crewmen, just like Nashara, held out their hands at the top of the plank leading on to the deck. Tiago sprinted into them, knocking them over and collapsing, panting, amazed to still be alive.\n“Cast off!” Someone yelled, and the plank was tossed free. From his viewpoint on the deck, Tiago saw a tiny rocket shoot up several hundred feet into the sky, dragging a length of parafoil with it.\nThe foil expanded, filled with air, and the ship began to move.\nA pair of feet in familiar boots stopped in front of Tiago’s face. He looked up. It was Nashara. She moved slowly, with a slight limp, and wore a patch over one eye. Her hair had been burned off, and one arm was in a sling.\nShe kneeled and grabbed his hand and said something, but he couldn’t hear it through the ringing in his ears because the guns still hadn’t stopped: Streuner shivered constantly as it continued firing on the Doacq as they moved away from the dock. Slowly, at first, but then the ship built a bow wave as it sped up.\nA few minutes later the entire ship slowly struggled up onto the hydrofoils underneath its hull, and it popped free of the resistance of pushing against water.\nThey sped away from the docks, the deck tilting alarmingly as the Streuner turned hard toward the open sea.\nThe alien Doacq was falling further away from Tiago with each minute. So was Kay.\nJune was still in a room being checked over for injuries, but Tiago was allowed to wander around inside the ship. There were crew cabins, a kitchen, storage rooms, a common sitting area.\nNashara sat there, playing with a small piece of paper. She kept folding it until she had turned it into a tiny flower.\n“She sent me to pick your pocket,” Tiago confessed, standing at the table. He’d expected the boat to sway more than it did, but the foils kept it almost rock steady. “It was a trap from the beginning. And I’m sorry.”\nShe looked up at him with one eye, and Tiago flinched. What would he do to someone who’d cost him an eye? What would someone as powerful as Kay do?\n“I knew it was a trap,” Nashara said. “What I wasn’t expecting was the Doacq.”\n“You?” He found that hard to believe, knowing the things Nashara had seen and participated in.\nNashara shook her head. “It’s a massive universe, Tiago, with many participants. The Doacq’s an important force, and I’m not sure what it’s up to. We need to find Pepper, if we can, if he’s still alive. If June can help. Maybe together we can find some answers, find out if the Doacq is a threat to us. But Tiago, I’m just tiny player on the edge of some large events. I don’t know half of everything. The universe is not tidy. You don’t always get quick answers.”\nIt was a sentiment that Tiago felt a kinship to. She felt just like him. Navigating her way through all this just as best she could.\nBut then that raised his suspicions.\n“Are you saying that just to make me feel better?” He asked. “Do you rule me know, like Kay?”\nIf she had the same talents, why not?\n“I mean, if I’m your pawn, you seem calmer than Kay,” he continued. “She isn’t just someone organizing street kids, protection setups, scams. Not anymore. Now she’s just using us up like our lives don’t even mean anything.”\nOutside the ship slowed, hydrofoils sinking deeper into the water until the hull hit water.\nNashara crushed the little paper bird into a wad. “Sometimes we become the thing we’re fighting hardest against,” she said thoughtfully. “And Kay is fighting hard against an unimaginable past on Okur. I was there, once. I’ve seen what she came from. I don’t think she will stop fighting it for quite a while.”\nTiago thought about Placa del Fuego, caught between the forces of Kay and the Doacq, and wondered if the island would survive the both of them. “She said she’d rule the island.”\n“And maybe more, no doubt,” Nashara said. Then something strange happened, a fluttering sensation in the deepest pit of Tiago’s stomach that left him suddenly dizzy. Nashara stood up and grabbed his shoulder. “Come, Tiago, I want to show you something.”\nShe led him out onto the rear deck of the ship, which was dominated by the black nothingness of a wormhole.\nTiago gasped. He’d never seen one this close, towering over his head. Large enough for a whole ship to pass through and that had once floated above a world. Spaceships had once passed through it before being deorbited.\nAnd now him.\nThe sky overhead was covered by a dark, orange cloud in outer space, whisps of it streaming off toward the horizon. And cutting the sky in half: a silver twinkling band. The Belt of Arkand. He’d heard it mentioned by sailors, and here he stood looking at it with his own eyes.\n“You asked if I made you do this,” Nashara said. “But this was your own choice. I didn’t make you do it. This is your new life now.”\nBut was it the right choice?\nHe looked around at the strange sea they plowed through, and saw another wormhole far ahead in the distance, propped on floats and bobbing on the surface of the green ocean. That wormhole led to yet another ocean, and more worlds.\nMore possibilities.\nMaybe not the right choice. Only time would tell that. But it was certainly his choice, he knew, leaving all those years of sitting on the sea wall and dreaming behind for a chance just like this.\nCalled \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.\nHis Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"\nHe currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs.", "source": "https://clarkesworldmagazine.com/buckell_07_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Placa del Fuego by Tobias S. Buckell"}