{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Desirina Boskovich", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Br9thKnvY9LYfahMfI+KL/O4MsU=", "id": null, "license": null, "comments": "", "raw_text": "Select Year 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 PURCHASE THIS ISSUE: Amazon Kindle B&N EPUB Weightless EPUB/MOBI ISSUE 28 – January 2009 FICTION Celadon by Desirina Boskovich AUDIO EDITION read by Kate Baker Teaching Bigfoot to Read by Geoffrey W. Cole NON-FICTION Anthologists Discuss Their Craft by Jeremy L. C. Jones The Mauna Kea Experience by David L. Clements COVER ART Evil Snowman by Serj Iulian ISSUE 29 – February 2009 The Second Gift Given by Ken Scholes AUDIO EDITION read by Mike Allen The Jisei of Mark VIII by Berrien C. Henderson An Interview with Jeff VanderMeer by Neddal Ayad The Most Important Genre Novel You'll Never Read by Robert N. Lee Change the Hugos? Yes You Can! by Cheryl Morgan 2008 Reader's Poll by Neil Clarke Signs of Life by Geoff Trebs ISSUE 30 – March 2009 Herding Vegetable Sheep by Ekaterina Sedia The Loyalty of Birds by Rachel Sobel An Interview with Tobias Buckell Remake Love, Not War by Daniel M. Kimmel 2008 Reader's Poll Results The Wish by Harout Demirchyan ISSUE 31 – April 2009 Rolling Steel: A Pre-Apocalyptic Love Story by Jay Lake and Shannon Page AUDIO EDITION read by Shaun Farrel and Mur Lafferty The Dying World by Lavie Tidhar From Dead Gods to Guys in Lizard Costumes: Six Questions for James Morrow by Jason S. Ridler Where's My Flying Car? The Future of Personal Aviation by Joyce Frohn Torturing Poor Mushroom by Blaz Porenta ISSUE 32 – May 2009 From the Lost Diary of TreeFrog7 by Nnedi Okorafor The Devonshire Arms by Alex Dally MacFarlane What if it All Goes Wrong? A Conversation with Robert V. S. Redick Models and Clay and Plaster, Oh My! Creating the Cover Art for Tides From The New Worlds by Brian Dow Take Flight by Adam Chowles ISSUE 33 – June 2009 Walking with a Ghost by Nick Mamatas The Giving Heart by Corie Ralston The Story Is All: Ten Fiction Editors Talk Shop Who Were the Celts? by Dr Kari Maund Short Fiction: One Year Later Handbark Academy by Alexander Nanitchkov ISSUE 34 – July 2009 Placa del Fuego by Tobias S. Buckell On the Lot and In the Air by Lisa L Hannett Dirty Hands and Invisible Words: Speculative Fiction Book Editors Speak Out, Part 1 of 2 Doing Crappy Things to Good Characters: A Conversation with Jim C. Hines Helping Hands: Fairylands, Boneshops and More Sea Monster by Jason Ng ISSUE 35 – August 2009 The Radiant Car Thy Sparrows Drew by Catherynne M. Valente AUDIO EDITION read by Catherynne M. Valente Advection by Genevieve Valentine Long Before They Were Read: Speculative Fiction Book Editors Speak Out, Part 2 of 2 The Minimal and Finely Focused Fantasy of Ian C. Esslemont Eternal Lives on Hard-Drives? by Brian Trent Don't Be Afraid by Kim Kyoung Hwan ISSUE 36 – September 2009 White Charles by Sarah Monette Non-Zero Probabilities by N.K. Jemisin All Of These Worlds Are Yours by Paul McAuley Mammals Underfoot! An Interview with Emerging Writers by Jeff VanderMeer September Contest : Free Books from Pyr and Wyrm Repairshop by Andreas Rocha ISSUE 37 – October 2009 Spar by Kij Johnson Of Melei, of Ulthar by Gord Sellar Keeping Ahead of the Fear: A Conversation with Ken Scholes Forevermore: The Iconic Poe of the 21st Century by G.A. Buchholz OH SHIT by Sean Donaldson ISSUE 38 – November 2009 The Mermaids Singing Each to Each by Cat Rambo Brief Candle by Jason K. Chapman The Fantastic Spectrum of Elizabeth Hand Modern Genetics in the World of Fiction by Roger Moraga Brain Tower by Kazuhiko Nakamura ISSUE 39 – December 2009 Night, in Dark Perfection by Richard Parks The Grandmother-Granddaughter Conspiracy by Marissa Lingen If It Scares You, Write It: A Conversation with Nnedi Okorafor Bartitsu: The Martial Art for the Steampunk Set The Remains Which Live by Keisuke Asaba Browse By Fiction Audio Fiction Articles Interviews Editorials Awards & Recognition Authors & Artists Random Story Random Podcast Follow Us On SUBSCRIBE AT Amazon.com Apple Newsstand B&N Nook Newsstand Google Play Patreon ClarkesworldCitizens Weightless Books ISSN 1937-7843 · Clarkesworld Magazine © 2006-2022 Wyrm Publishing. Robot illustration by Serj Iulian.", "text": "Select Year\n2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022\nPURCHASE THIS ISSUE:\nAmazon Kindle\nB&N EPUB\nWeightless EPUB/MOBI\nISSUE 28 – January 2009\nFICTION\nCeladon\nby Desirina Boskovich\nAUDIO EDITION read by Kate Baker\nTeaching Bigfoot to Read\nby Geoffrey W. Cole\nNON-FICTION\nAnthologists Discuss Their Craft\nby Jeremy L. C. Jones\nThe Mauna Kea Experience\nby David L. Clements\nCOVER ART\nEvil Snowman\nby Serj Iulian\nISSUE 29 – February 2009\nThe Second Gift Given\nby Ken Scholes\nAUDIO EDITION read by Mike Allen\nThe Jisei of Mark VIII\nby Berrien C. Henderson\nAn Interview with Jeff VanderMeer\nby Neddal Ayad\nThe Most Important Genre Novel You'll Never Read\nby Robert N. Lee\nChange the Hugos? Yes You Can!\nby Cheryl Morgan\n2008 Reader's Poll\nby Neil Clarke\nSigns of Life\nby Geoff Trebs\nISSUE 30 – March 2009\nHerding Vegetable Sheep\nby Ekaterina Sedia\nThe Loyalty of Birds\nby Rachel Sobel\nAn Interview with Tobias Buckell\nRemake Love, Not War\nby Daniel M. Kimmel\n2008 Reader's Poll Results\nThe Wish\nby Harout Demirchyan\nISSUE 31 – April 2009\nRolling Steel: A Pre-Apocalyptic Love Story\nby Jay Lake and Shannon Page\nAUDIO EDITION read by Shaun Farrel and Mur Lafferty\nThe Dying World\nby Lavie Tidhar\nFrom Dead Gods to Guys in Lizard Costumes: Six Questions for James Morrow\nby Jason S. Ridler\nWhere's My Flying Car? The Future of Personal Aviation\nby Joyce Frohn\nTorturing Poor Mushroom\nby Blaz Porenta\nISSUE 32 – May 2009\nFrom the Lost Diary of TreeFrog7\nby Nnedi Okorafor\nThe Devonshire Arms\nby Alex Dally MacFarlane\nWhat if it All Goes Wrong? A Conversation with Robert V. S. Redick\nModels and Clay and Plaster, Oh My! Creating the Cover Art for Tides From The New Worlds\nby Brian Dow\nTake Flight\nby Adam Chowles\nISSUE 33 – June 2009\nWalking with a Ghost\nby Nick Mamatas\nThe Giving Heart\nby Corie Ralston\nThe Story Is All: Ten Fiction Editors Talk Shop\nWho Were the Celts?\nby Dr Kari Maund\nShort Fiction: One Year Later\nHandbark Academy\nby Alexander Nanitchkov\nISSUE 34 – July 2009\nPlaca del Fuego\nby Tobias S. Buckell\nOn the Lot and In the Air\nby Lisa L Hannett\nDirty Hands and Invisible Words: Speculative Fiction Book Editors Speak Out, Part 1 of 2\nDoing Crappy Things to Good Characters: A Conversation with Jim C. Hines\nHelping Hands: Fairylands, Boneshops and More\nSea Monster\nby Jason Ng\nISSUE 35 – August 2009\nThe Radiant Car Thy Sparrows Drew\nby Catherynne M. Valente\nAUDIO EDITION read by Catherynne M. Valente\nAdvection\nby Genevieve Valentine\nLong Before They Were Read: Speculative Fiction Book Editors Speak Out, Part 2 of 2\nThe Minimal and Finely Focused Fantasy of Ian C. Esslemont\nEternal Lives on Hard-Drives?\nby Brian Trent\nDon't Be Afraid\nby Kim Kyoung Hwan\nISSUE 36 – September 2009\nWhite Charles\nby Sarah Monette\nNon-Zero Probabilities\nby N.K. Jemisin\nAll Of These Worlds Are Yours\nby Paul McAuley\nMammals Underfoot! An Interview with Emerging Writers\nby Jeff VanderMeer\nSeptember Contest : Free Books from Pyr and Wyrm\nRepairshop\nby Andreas Rocha\nISSUE 37 – October 2009\nSpar\nby Kij Johnson\nOf Melei, of Ulthar\nby Gord Sellar\nKeeping Ahead of the Fear: A Conversation with Ken Scholes\nForevermore: The Iconic Poe of the 21st Century\nby G.A. Buchholz\nOH SHIT\nby Sean Donaldson\nISSUE 38 – November 2009\nThe Mermaids Singing Each to Each\nby Cat Rambo\nBrief Candle\nby Jason K. Chapman\nThe Fantastic Spectrum of Elizabeth Hand\nModern Genetics in the World of Fiction\nby Roger Moraga\nBrain Tower\nby Kazuhiko Nakamura\nISSUE 39 – December 2009\nNight, in Dark Perfection\nby Richard Parks\nThe Grandmother-Granddaughter Conspiracy\nby Marissa Lingen\nIf It Scares You, Write It: A Conversation with Nnedi Okorafor\nBartitsu: The Martial Art for the Steampunk Set\nThe Remains Which Live\nby Keisuke Asaba\nBrowse By\nFiction\nAudio Fiction\nArticles\nInterviews\nEditorials\nAwards & Recognition\nAuthors & Artists\nRandom Story\nRandom Podcast\nFollow Us On\nSUBSCRIBE AT\nAmazon.com\nApple Newsstand\nB&N Nook Newsstand\nGoogle Play\nPatreon\nClarkesworldCitizens\nWeightless Books\nISSN 1937-7843 · Clarkesworld Magazine © 2006-2022 Wyrm Publishing. Robot illustration by Serj Iulian.", "source": "https://clarkesworldmagazine.com/prior/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: 2009 Back Issues"}