{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tobias S Buckell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "DnxoTB3rS0ycHaZjbDgnZIF8vQY=", "id": null, "license": null, "comments": "", "raw_text": "Interview  An Interview with Catherynne M. Valente  Catherynne Valente was born in Seattle and spent time up and down the West Coast of the U.S. while growing up, and then struck out for Japan where she spent a great deal of time before coming to reside in Ohio. Catherynne’s story is not dissimilar from my own, living abroad before moving to Ohio, so I was intrigued not too long ago to have gotten to read the first book in her Orphan’s Tales fantasy series.  It turns out Catherynne has a reputation for sensuous, rich sentences, and even richer structure in her writing. Not surprisingly, Catherynne was nominated for the World Fantasy Award for her work, and ended up winning the Tiptree. I’ve had my own suspicions about the impact and inspiration for her amazing work, so it was a treat to get a chance to interview her.   I have to say your book The Orphan’s Tales: In The Night Garden is an amazing work. I never thought I’d be handing a book to friends that I would describe as a ’mix between 101 Arabian Nights and a Russian nesting doll.’ How challenging was this complex structure to write and what inspired you to use it?  Well, you nailed the inspiration right there: about five years ago I read a new translation of Arabian Nights and was struck by the structure, how interesting and unique it was, and it seemed so natural to take it to the next level, to close the frame and link all the tales within it together. I wanted to create one gigantic folkloric system, and at the same time to touch the core of so many fairy tales: a simple story about a lost little girl.  It is and extraordinarily difficult structure to work with. It requires a great deal of fact-checking—how are these five timelines jiving together? Do they all make sense, is the causality intact? I could have saved myself a lot of time just writing A to Z, but I don’t think I could have told this story that way. To me, it works because of the structure, and is impossible without it. Without the other tales, any one tale on its own falls down, or at least becomes less, becomes thinner.  I never kept any notes or outlines, nor did I diagram the structure. I kept it all in my head. That tends to be how I work in general, somewhat messily, organically, but when I look back on the whole process, it makes me happy that I did it that way. It feels like in some small measure I echoed the work of oral storytellers—I kept it all inside, and told it from memory, full of kennings and epithets and tricks both flashy and subtle, and in the end, it all fit together, and the stories ended just as the fire went out.  One of the most amazing things about The Orphan’s Tales is that your books really veer away from the typical European, post-Tolkein fantasy, and yet they don’t turn their back on the mythic, the great storytelling, and feel of legend. Why are these such important qualities for you, and where do you feel your work stands in the greater map of Fantasy?  Let me begin by saying that I love Tolkien—I was an enormous LOTR-geek when I was in high school, and I think his work is amazing.  And the funny thing is, I love it so much I don’t feel the smallest need to rewrite it. How could I possibly equal what JRR did? I mean, the man wrote the dictionary. I dropped out of my MA program. There isn’t much comparison to be made.  But folklore, myth, these belong to everyone. They are important to me because I love the world in a mad, sloppy, passionate way. It’s my fandom, all of it, Maori and Greek and American and Japanese and Aztec and Serbian and Palestinian and the back porch and the corner cafe. We, as humans, tell stories compulsively, like an addiction, like a divine commandment, and I want to hear them, all of them. I always have. I am a fantasy writer because I love the world and I want there to be more of it. I want there to be so much more than meets the eye. I want every story ever told to be true. If there is any moral core to the books I’ve written, it’s that: every story is true. Every single one.  As for my little push-pin in the map of fantasy, I don’t have the first idea. That’s what we have graduate students for, right? I missed the New Weird, both New Waves, and all the canon -punks. I’m too young for any of the cool movements to take my applications. I like thinking of myself as a postmodern fabulist, but that’s pretty fancy and I think technically that’s another club that sparked and flamed and got bored with the title long before I came along. I’m Post, I suppose. Post-postmodern, post-Tolkien, post-Rowling, post-New, post-punk, post-graduate, post-tech bubble, post-distribution network, post-classical, post-golden age, post-9/11, post-20th century, post-everything. Until someone says being post-everything is so passe.  The Post Office. Something like that.  As a follow up, I was recently at a convention where you mentioned to an audience that you thought your rich sentence style was going to change in upcoming novels as you grew into experimenting with some new approaches. Can you talk more about your upcoming transition?  It’s been a slow and steady one, I think easily chartable through my books. I’ll never stop writing rich and imagistic books, that’s who I am and I could probably change the number of my limbs before I could change that. But I already wrote The Labyrinth, and The Book of Dreams. I don’t need to write those books again. When I started out, in the ancient world of 2004, I was writing mainly confessional books cloaked in fantasy and dense language. I ran out of things I needed to purge. Now, I want to tell other stories, in other ways. I want to evolve as a writer, I want to level up, as the kids say. I’m fascinated by structure and by the combination of language and genre, and what each has to say about the other. I don’t think there’s a single one of my upcoming books that doesn’t comment internally on the conventions of realism and genre literature. I can’t imagine not trying to mess about with structure in some way. But I want to find a balance between lushness and precision, and that what I’m questing after at this point.  I’ve been thinking a lot lately about how to remain a writer until I fall down and die. And if there’s any answer to how to do that, I think it has to be constant evolution. I have to stay interested in my own work, and keep writing books I find it difficult to write, or what’s the point? I don’t find it remotely difficult to write stream-of-consciousness surrealist extravaganzas anymore. Time to run face-first into the wall of trying something new, or I might as well quit and start working at the actual post office.  You’ve written a lot of poetry, and even published some books of it. How do you feel the poetry builds synergy with your writing?  I started with poetry. I didn’t even try to write fiction until I was something like 21, and only then because a professor made me. I tried a novel at 23, and that was The Labyrinth, which some might argue isn’t a novel but a prose-poem, anyway. Poetry is the root of whatever style I have—I still want to make every word count, to make every phrase carry the weight of the whole. Sometimes I’m better at that than others.  I find, sadly, that I write less and less poetry as I write more prose. In part that’s because I get paid a lot more for poetic prose than poetic poetry, and in part it’s because while the SF poetry scene is pretty bustling, the fantasy poetry folks still struggle for respect and attention. And in part it’s for no reason I can tell, and I just trust these things come and go in waves. I don’t find that poetry turns into novels the way short stories do, but they move and evolve on a parallel line with my novels, and what I learn about language and feeling as a poet is automatically transferred to the novelist-brain, no customs officials, no waiting. The synergy moves one way these days, I find novel-lessons don’t transfer well, they make my poems too wordy and expositional.  I think my newest collection, A Guide to Folktales in Fragile Dialects, will be the last for awhile.  I’ve seen that you spent time in Japan. Can you talk about how this traveling has impacted your writing?  Oh, boy. First, I suppose, it gave me time to write. My ex-husband was out of the country for 19 of the 25 months we spent there, and I was alone, without friends or family or any real human contact. That made me a little crazy, but it also got the books done.  The mythology of Japan will always be with me—the Shinto faith, the syncretic culture, the jungle right up close to the urban sprawl. Some part of me will always be there, always looking for fox-statues in the forest, watching the jellyfish suck at the sides of boats in the harbor. I will never stop being fascinated by it, and processing what it means in relation to me and my work and my internal landscape. It was a hermitage, and I learned all the things good hermits are supposed to learn: how to be alone, how to quiet demons, how to sweep the halls and keep the wolves at the door.  But now you’re living in Ohio. How’s that for an adjustment? And do you think it has impacted your work?  Ohio is a mythic landscape, too! The American Midwest is literally PLANET MARS for a girl like me, raised on the West Coast. I bet you know exactly what I mean. You ain’t from around here neither, Toby. The colors on the leaves, the snow in the winter, the viciously huge icicles, the Waffle Houses, the cornfields, the beige food! I find it fascinating here, and being adjacent to a Great Lake is wonderful. There are islands there that are completely deserted, and water that goes past the horizon. There is a strange wizardly grace to Ohio, I swear it. And when I leave, like Japan, it will stay with me, all its myth and folklore and endless fields.  I think it has made me look more closely at America as a source of fantasy, as a source of myth. It has made me look at plain things differently and taught me that every place longs to have wonderful things written about it. Even Cleveland, Ohio.  I think I’ll probably give every place I live a giant hug in the form of a book. I can’t help it. They ask so nicely.  Like a lot of writers you’ve been leveraging the internet to build your readership and you’re certainly one of them. You have a well-read LiveJournal, and have mentioned that you owe your career to this tool in some ways. How did that work?  Well, I had a blog back on Diaryland since about 2000. I used it for writing practice for years and predictably, no one cared much. I sat in my corner of the internet and played with my ball. After awhile it gained a bit of a following, but nothing we wouldn’t laugh at in today’s blogosphere. But when I moved to Japan, I was pretty intensely lonely, and figured I’d get on Livejournal and see if I could make a couple of friends—it snowballed and by the time I had any kind of book contract I had a sizable readership, and it’s grown since then, as have my books, and they very much feed off of each other now. Most of the things in my life were provided by Mother Internet: my partner, my home, my job, my friends, even some of the food in my pantry and art on my walls. I didn’t ever have a mercenary plan to sell books, I just wanted to reach out and find something genuine in the ether.  It turns out, if you send away for a life, the internet will send you one. It doesn’t even cost anything.  Who are some of the writers that have really had an impact on your writing?  Sylvia Plath, Lorca, Diane Wakoski, Anna Ahkmatova are all huge influences in poetry, which is, as referenced, the beast who made my brain. In fiction there is Anais Nin, Henry Miller, Clarice Lispector, Milorad Pavic, Italo Calvino, Jeanette Winterson, John Crowley, Jeff Vandermeer, Theodora Goss, Borges, Lewis Carroll, Sonya Taaffe, Paul Verhelst, and Dylan Thomas (Under Milk Wood was an enormous formative influence.)  I did my undergraduate degree in classics, so I have to point out that reading endless pages of ancient Greek was probably not helpful to ever writing like a normal kid.  When you write, what kind of schedule do you keep? Any rituals or methods you use to get into the right headspace?  I am ashamed. I must confess that when I need to get a novel done, I go to Starbucks, where they do not have free wireless, and I work from 9-6 every day until it is done. It isn’t sexy. It’s not a garret. Old men stare at my chest and baristas make jokes about how much World of Warcraft I must be playing. But it gets it done.  I basically require a hard deadline to function at all. I am a fundamentally lazy person who is so determined to get things done that I’ve built workarounds into my psyche so that I can appear not-lazy. It’s a long and stupid process, but the books get written. On deadline. They get turned in at midnight like a student slipping a paper under a professor’s door, but I’ve never missed one. The key is fear and shame, I find. Fear you won’t get to keep being a writer if you don’t put out, and shame at being anything less than punk rock. It works. Somehow.  I wish I had rituals. I keep thinking I should invent some. But mostly I sit down and write until someone says I have to eat. Lather, rinse, repeat. Called \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.  His Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"  He currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs.", "text": "Interview\nAn Interview with Catherynne M. Valente\nCatherynne Valente was born in Seattle and spent time up and down the West Coast of the U.S. while growing up, and then struck out for Japan where she spent a great deal of time before coming to reside in Ohio. Catherynne’s story is not dissimilar from my own, living abroad before moving to Ohio, so I was intrigued not too long ago to have gotten to read the first book in her Orphan’s Tales fantasy series.\nIt turns out Catherynne has a reputation for sensuous, rich sentences, and even richer structure in her writing. Not surprisingly, Catherynne was nominated for the World Fantasy Award for her work, and ended up winning the Tiptree. I’ve had my own suspicions about the impact and inspiration for her amazing work, so it was a treat to get a chance to interview her.\nI have to say your book The Orphan’s Tales: In The Night Garden is an amazing work. I never thought I’d be handing a book to friends that I would describe as a ’mix between 101 Arabian Nights and a Russian nesting doll.’ How challenging was this complex structure to write and what inspired you to use it?\nWell, you nailed the inspiration right there: about five years ago I read a new translation of Arabian Nights and was struck by the structure, how interesting and unique it was, and it seemed so natural to take it to the next level, to close the frame and link all the tales within it together. I wanted to create one gigantic folkloric system, and at the same time to touch the core of so many fairy tales: a simple story about a lost little girl.\nIt is and extraordinarily difficult structure to work with. It requires a great deal of fact-checking—how are these five timelines jiving together? Do they all make sense, is the causality intact? I could have saved myself a lot of time just writing A to Z, but I don’t think I could have told this story that way. To me, it works because of the structure, and is impossible without it. Without the other tales, any one tale on its own falls down, or at least becomes less, becomes thinner.\nI never kept any notes or outlines, nor did I diagram the structure. I kept it all in my head. That tends to be how I work in general, somewhat messily, organically, but when I look back on the whole process, it makes me happy that I did it that way. It feels like in some small measure I echoed the work of oral storytellers—I kept it all inside, and told it from memory, full of kennings and epithets and tricks both flashy and subtle, and in the end, it all fit together, and the stories ended just as the fire went out.\nOne of the most amazing things about The Orphan’s Tales is that your books really veer away from the typical European, post-Tolkein fantasy, and yet they don’t turn their back on the mythic, the great storytelling, and feel of legend. Why are these such important qualities for you, and where do you feel your work stands in the greater map of Fantasy?\nLet me begin by saying that I love Tolkien—I was an enormous LOTR-geek when I was in high school, and I think his work is amazing.\nAnd the funny thing is, I love it so much I don’t feel the smallest need to rewrite it. How could I possibly equal what JRR did? I mean, the man wrote the dictionary. I dropped out of my MA program. There isn’t much comparison to be made.\nBut folklore, myth, these belong to everyone. They are important to me because I love the world in a mad, sloppy, passionate way. It’s my fandom, all of it, Maori and Greek and American and Japanese and Aztec and Serbian and Palestinian and the back porch and the corner cafe. We, as humans, tell stories compulsively, like an addiction, like a divine commandment, and I want to hear them, all of them. I always have. I am a fantasy writer because I love the world and I want there to be more of it. I want there to be so much more than meets the eye. I want every story ever told to be true. If there is any moral core to the books I’ve written, it’s that: every story is true. Every single one.\nAs for my little push-pin in the map of fantasy, I don’t have the first idea. That’s what we have graduate students for, right? I missed the New Weird, both New Waves, and all the canon -punks. I’m too young for any of the cool movements to take my applications. I like thinking of myself as a postmodern fabulist, but that’s pretty fancy and I think technically that’s another club that sparked and flamed and got bored with the title long before I came along. I’m Post, I suppose. Post-postmodern, post-Tolkien, post-Rowling, post-New, post-punk, post-graduate, post-tech bubble, post-distribution network, post-classical, post-golden age, post-9/11, post-20th century, post-everything. Until someone says being post-everything is so passe.\nThe Post Office. Something like that.\nAs a follow up, I was recently at a convention where you mentioned to an audience that you thought your rich sentence style was going to change in upcoming novels as you grew into experimenting with some new approaches. Can you talk more about your upcoming transition?\nIt’s been a slow and steady one, I think easily chartable through my books. I’ll never stop writing rich and imagistic books, that’s who I am and I could probably change the number of my limbs before I could change that. But I already wrote The Labyrinth, and The Book of Dreams. I don’t need to write those books again. When I started out, in the ancient world of 2004, I was writing mainly confessional books cloaked in fantasy and dense language. I ran out of things I needed to purge. Now, I want to tell other stories, in other ways. I want to evolve as a writer, I want to level up, as the kids say. I’m fascinated by structure and by the combination of language and genre, and what each has to say about the other. I don’t think there’s a single one of my upcoming books that doesn’t comment internally on the conventions of realism and genre literature. I can’t imagine not trying to mess about with structure in some way. But I want to find a balance between lushness and precision, and that what I’m questing after at this point.\nI’ve been thinking a lot lately about how to remain a writer until I fall down and die. And if there’s any answer to how to do that, I think it has to be constant evolution. I have to stay interested in my own work, and keep writing books I find it difficult to write, or what’s the point? I don’t find it remotely difficult to write stream-of-consciousness surrealist extravaganzas anymore. Time to run face-first into the wall of trying something new, or I might as well quit and start working at the actual post office.\nYou’ve written a lot of poetry, and even published some books of it. How do you feel the poetry builds synergy with your writing?\nI started with poetry. I didn’t even try to write fiction until I was something like 21, and only then because a professor made me. I tried a novel at 23, and that was The Labyrinth, which some might argue isn’t a novel but a prose-poem, anyway. Poetry is the root of whatever style I have—I still want to make every word count, to make every phrase carry the weight of the whole. Sometimes I’m better at that than others.\nI find, sadly, that I write less and less poetry as I write more prose. In part that’s because I get paid a lot more for poetic prose than poetic poetry, and in part it’s because while the SF poetry scene is pretty bustling, the fantasy poetry folks still struggle for respect and attention. And in part it’s for no reason I can tell, and I just trust these things come and go in waves. I don’t find that poetry turns into novels the way short stories do, but they move and evolve on a parallel line with my novels, and what I learn about language and feeling as a poet is automatically transferred to the novelist-brain, no customs officials, no waiting. The synergy moves one way these days, I find novel-lessons don’t transfer well, they make my poems too wordy and expositional.\nI think my newest collection, A Guide to Folktales in Fragile Dialects, will be the last for awhile.\nI’ve seen that you spent time in Japan. Can you talk about how this traveling has impacted your writing?\nOh, boy. First, I suppose, it gave me time to write. My ex-husband was out of the country for 19 of the 25 months we spent there, and I was alone, without friends or family or any real human contact. That made me a little crazy, but it also got the books done.\nThe mythology of Japan will always be with me—the Shinto faith, the syncretic culture, the jungle right up close to the urban sprawl. Some part of me will always be there, always looking for fox-statues in the forest, watching the jellyfish suck at the sides of boats in the harbor. I will never stop being fascinated by it, and processing what it means in relation to me and my work and my internal landscape. It was a hermitage, and I learned all the things good hermits are supposed to learn: how to be alone, how to quiet demons, how to sweep the halls and keep the wolves at the door.\nBut now you’re living in Ohio. How’s that for an adjustment? And do you think it has impacted your work?\nOhio is a mythic landscape, too! The American Midwest is literally PLANET MARS for a girl like me, raised on the West Coast. I bet you know exactly what I mean. You ain’t from around here neither, Toby. The colors on the leaves, the snow in the winter, the viciously huge icicles, the Waffle Houses, the cornfields, the beige food! I find it fascinating here, and being adjacent to a Great Lake is wonderful. There are islands there that are completely deserted, and water that goes past the horizon. There is a strange wizardly grace to Ohio, I swear it. And when I leave, like Japan, it will stay with me, all its myth and folklore and endless fields.\nI think it has made me look more closely at America as a source of fantasy, as a source of myth. It has made me look at plain things differently and taught me that every place longs to have wonderful things written about it. Even Cleveland, Ohio.\nI think I’ll probably give every place I live a giant hug in the form of a book. I can’t help it. They ask so nicely.\nLike a lot of writers you’ve been leveraging the internet to build your readership and you’re certainly one of them. You have a well-read LiveJournal, and have mentioned that you owe your career to this tool in some ways. How did that work?\nWell, I had a blog back on Diaryland since about 2000. I used it for writing practice for years and predictably, no one cared much. I sat in my corner of the internet and played with my ball. After awhile it gained a bit of a following, but nothing we wouldn’t laugh at in today’s blogosphere. But when I moved to Japan, I was pretty intensely lonely, and figured I’d get on Livejournal and see if I could make a couple of friends—it snowballed and by the time I had any kind of book contract I had a sizable readership, and it’s grown since then, as have my books, and they very much feed off of each other now. Most of the things in my life were provided by Mother Internet: my partner, my home, my job, my friends, even some of the food in my pantry and art on my walls. I didn’t ever have a mercenary plan to sell books, I just wanted to reach out and find something genuine in the ether.\nIt turns out, if you send away for a life, the internet will send you one. It doesn’t even cost anything.\nWho are some of the writers that have really had an impact on your writing?\nSylvia Plath, Lorca, Diane Wakoski, Anna Ahkmatova are all huge influences in poetry, which is, as referenced, the beast who made my brain. In fiction there is Anais Nin, Henry Miller, Clarice Lispector, Milorad Pavic, Italo Calvino, Jeanette Winterson, John Crowley, Jeff Vandermeer, Theodora Goss, Borges, Lewis Carroll, Sonya Taaffe, Paul Verhelst, and Dylan Thomas (Under Milk Wood was an enormous formative influence.)\nI did my undergraduate degree in classics, so I have to point out that reading endless pages of ancient Greek was probably not helpful to ever writing like a normal kid.\nWhen you write, what kind of schedule do you keep? Any rituals or methods you use to get into the right headspace?\nI am ashamed. I must confess that when I need to get a novel done, I go to Starbucks, where they do not have free wireless, and I work from 9-6 every day until it is done. It isn’t sexy. It’s not a garret. Old men stare at my chest and baristas make jokes about how much World of Warcraft I must be playing. But it gets it done.\nI basically require a hard deadline to function at all. I am a fundamentally lazy person who is so determined to get things done that I’ve built workarounds into my psyche so that I can appear not-lazy. It’s a long and stupid process, but the books get written. On deadline. They get turned in at midnight like a student slipping a paper under a professor’s door, but I’ve never missed one. The key is fear and shame, I find. Fear you won’t get to keep being a writer if you don’t put out, and shame at being anything less than punk rock. It works. Somehow.\nI wish I had rituals. I keep thinking I should invent some. But mostly I sit down and write until someone says I have to eat. Lather, rinse, repeat.\nCalled \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.\nHis Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"\nHe currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs.", "source": "https://clarkesworldmagazine.com/valente_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Interview with Catherynne M. Valente by Tobias S. Buckell"}