{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Mike Resnick; Lezli Robyn", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "DgcngMbmWTKVJgoaKCJaFPlOC6g=", "id": null, "license": null, "comments": "", "raw_text": "4000 words, short story  Idle Roomer  The room was on the second floor of the dilapidated old building, overlooking what had once been a garden and now was a concrete parking slab filled with cracks and potholes. It had a narrow bed next to a small nightstand with a cheap lamp and an old, battered desk by the single window. A rickety wooden chair, a phone, an ancient dresser, a tarnished floor lamp, and a small closet completed its uninspired furnishings.  And, thought Maria, Mr. Valapoli has lived here for sixteen months. How could anyone live in this cheerless place for sixteen days, let alone months?  Maria surveyed the room from the door. She’d been cleaning this room five days a week for sixteen months, and she’d still never laid eyes on him. His bed was always made, the top of his desk always barren. The only way she knew he actually existed was the nightstand, which had a different library book almost every morning, and the bathroom, which held a dozen bottles of pills that were replaced with new bottles from time to time.  Oh—and the statuette on the top of the dresser. She didn’t quite understand what it was. Sometimes she thought it might be a woman, holding her arms out to the viewer. Other times she wondered how she could have been so mistaken, for clearly it was a small animal with large trusting eyes, possibly something from the deepest jungles of Africa. Once she even thought it was a twisted tree. Maria shook her head; she would never understand modern art.  She would never understand Mr. Valapoli either. Every day she plugged the phone into the jack, and yet the next morning the end of the cord always lay on the floor. She checked the dial tone; it was functioning. Why did the man pay for a phone if he had no use for it?  She never liked Sherlock Holmes much, but she thought it might be interesting to work at being the Miss Marple of housemaids and see what she could deduce about the mysterious roomer. He had to have a beard, because there was no shaving equipment, manual or electric, in the bathroom. Yet she never found any hairs, from his head or his chin, on the bed or the floor. He was probably color blind, for there was nothing blue, or purple, or violet in the drawers, no shirts of those tones in his closet. When she thought of it, she couldn’t even remember a blue cover on any of his books.  She swept the floor, which hadn’t seen a carpet or even a rug in perhaps half a century, went through the motions of dusting the desk and dresser and nightstand though as always they were as clean as if they’d been on display in a store.  Every other tenant was a transient. Even those who were down on their luck never stayed more than a week. And here was this poor man spending sixteen months of his life here. No matter what misfortunate had befallen him, he didn’t deserve this. No one did.  Her heart went out to him, and on an impulse, she took a piece of paper out of her pocket and left a note on his desk:  Don’t give up hope, Mr. Valapoli. People do care. I care.  —Maria  She thought about the poor man all day. It was only when she was on her way home that she realized that he would have no idea who she was.  Maria’s hand hovered just above the doorknob, hesitant and expectant. Last night she agonized over whether she should have left the note. Surely it wasn’t wrong to let another person know that she felt for the predicament she saw him in? But then again, he could be a proud man who might see her sympathy as pity.  She shook her head, dispelling uneasy thoughts as she coaxed the creaking door to open. No, the note was well-meant and surely Mr. Valapoli would understand that.  At first glance the room appeared the same as always. As she absentmindedly plugged the phone cord into the jack again, the statuette caught her eye. Now it seemed to mildly resemble a curious owl, the eyes tracking her everywhere she went in the room.  You’re being ridiculous, Maria Saviari, she reprimanded herself. Next you’ll be jumping at shadows.  She continued cleaning the room, pausing only to pick up her daily tip from atop the immaculately-made bed. As she placed the dollar bill in the pocket of her apron, her keen eyes noticed something different on the nightstand. This time there were two books upon it instead of the usual lone library book. Curious, she moved around to the nightstand, automatically smoothing the bedspread as she went.  Wondering fingers traced the cover of the second book, resplendent with its rich burgundy leather and gold foil embossed title: A Meeting of Minds. Gingerly she picked it up—ostensibly to dust underneath it, but actually to look more closely at the cover—when she noticed a piece of paper lying beneath the book.  “For Maria” appeared in a childlike scrawl—it was as if the writer had trouble forming the letters into legible shapes. Suddenly she realized that the book she now held in her hands was actually for her. It was his reply to her note.  Curious, she carefully opened it, the musty smell reaching her nostrils as she leafed through the first few pages. She stopped at the title page to discover more words written by the same hand as the note, but other than her name and a touchingly clear “Thank you” at the bottom of the inscription, the rest of the words were composed in a language she didn’t recognize. She stared at it. Somehow the words looked neither awkward nor badly scrawled; rather, they seemed to possess some indefinable cogency and even beauty.  How do I reply without knowing what the inscription in the book means? The phone started ringing, breaking her train of thought. She jumped, startled, and for the briefest instant it seemed to her that the statuette jumped as well. Get ahold of yourself, Maria, she thought; it’s only a gift. No need to be so jumpy, or to feel guilty because you’re looking through it, After all, he wants you to.  Aware that she still had six rooms to clean before the end of her shift, she reluctantly placed the book in her apron pocket and continued working, the feather duster making short work of an already clean dresser and desk.  On an impulse she went back to the bed and replaced the tip there before she left. It felt wrong to take it now that they’d exchanged communication and she’d accepted his gift, and she hoped he’d see it as the small gesture of friendship it was.  As she finally closed the door behind her, the phone began ringing once again, as if impatient to be answered. Maybe Mr. Valapoli had some friends after all, she thought as she pushed her cleaning cart into the next cheerless hotel room, one hand unconsciously checking to make sure that the book was still safe in her pocket.  Maria watched tenderly as her grandmother leafed through the book, smiling when she saw her bring it close to her face, shut her eyes and breathe in the scent of the leather binding. Golden light filtered in through the window, dancing on the last auburn strands to be found in almost snow-white hair, the years of hard work and laughter defined on her face by the late afternoon sun.  “Smells expensive” was her first comment as she glanced up to look squarely at her granddaughter.  “I very much doubt that.” Maria smiled. “It’s a gift from someone staying at the boarding house.” She reached over and turned the pages until she came to the inscription. “This is what I came here to ask you about. What language do you suppose this is?”  “My dear,” said her grandmother, “this wilted English Rose might have married a Sicilian but that does not make me an expert in other people’s languages. However,” she continued, as one finger traced the letters softly, “it’s definitely not a romance language, and I don’t think it looks Oriental. In fact, it doesn’t look similar to anything I’ve encountered before. Those elegant pictographs are quite distinctive.” She looked up sharply. “Who did you say gave this to you?”  “I didn’t say. This book is from a man I’ve told you about previously Grandma; Mr. Valapoli, the one that’s had the misfortune to stay in the boarding house for the last 16 months.”  “Is it normal practice for guests to give you inscribed gifts?”  Maria sighed. “No, it’s not, but . . . ”  “Let me guess: You want to help him.” She closed the book quietly, setting it down on the table in front of her. “You can’t help every lost soul you come across Maria—no, don’t interrupt me.” She reached out and placed a hand on her granddaughter’s cheek, gently brushing an errant ebony lock back as she did so. “You have too generous a heart; it makes it all that much easier for someone to break it.” Abruptly she stood up, her hand shaking as it moved to pick up her walking stick. “And if you don’t leave now it will be dark by the time you get home. Besides, you can’t keep a frail old lady up past her bedtime,” she intoned, the twinkle in her eyes still bright despite darkness falling outside.  Replacing the book in her uniform pocket, Maria laughed softly, and arose to kiss her grandmother on the forehead. “You are eighty-eight years young and definitely not frail of mind. Thank you for your advice, Grandma.”  “If it’s my advice you want, I’d take that gift of yours to the university tomorrow before you work. There’s bound to be someone there with enough degrees to translate it.”  Seemingly endless rows of books towered over Maria as she made her way to the back of the university library, feeling more insignificant with every step she made. As her fingertips ran feather-light along the spines of the books, she looked up at the ornately-carved bookshelves in awe. Every dust-filmed tome seemed to hold a wealth of knowledge, representing privilege to her uneducated eyes.  An officious library clerk had told her that she’d find the man she was looking for with his class at the back of the library. She suddenly spotted him at a circular table already surrounded by students, one of whom was draped nonchalantly over a huge padded chair at the side of the table. He appeared exactly the way she thought a professor should look: peppered black hair, a neatly-trimmed silver beard, and glasses perched low on a nose that he buried deeper into a book the closer she got to him.  “Professor Albright, may I have a moment of your time?” she asked politely, her eyes focused on the top of his head.  “Certainly,” came the aloof yet slightly amused reply from the direction of the armchair. “In fact, you can have several.”  She started in surprise, turning to stare at the man now confidently vacating the chair. This young man is a Professor of Linguistics? She knew appearances could be deceptive and she’d seen all types come and go at the boarding house, but this man with his surf-blond hair and cornflower blue eyes was not what she was prepared to meet.  Professor Albright addressed the older man firmly. “Mr. Tripoldi, the class, if you please.” Without waiting for a response he strode over to the partially-secluded corner of the library, Maria scurrying in his wake.  “How can I be of service to you?” he inquired, eyebrows raised as he turned to look at her. “I really only do have a few minutes to spare you, so please be concise.”  “I’ve come across a language I cannot identify,” she said. “It’s an inscription in a book I’ve been given.” She began rummaging through her work bag, wishing now that she’d thought to put the book on top of her change of clothes.  “Why don’t you simply ask the person who gave you this inscribed gift?” he asked, staring at her with mild annoyance.  “I could. Or”—Maria matched his stare—“I can politely ask a leading academic on dead languages his expert opinion rather than hurt a considerate friend’s feelings by asking what it means.”  Surprise and a hint of respect flickered briefly across Albright’s face before he once again adopted a mask of detached boredom. “You could indeed.”  She held out the book to him, feeling suddenly more comfortable when his eyes left hers and refocused on the leather binding of her gift. “The inscription is on the third page,” she explained, “and it’s . . . ”  The book was all but snatched out of her grasp, the Professor unable hide his excitement over what now lay in his hands. “It couldn’t be . . . could it?” The Professor opened the book to the copyright page, and began reading intently, then turned the page again. Suddenly there was a sharp intake of breath. “Do you realize what you have here?” he exclaimed, not waiting for an answer. “This is a numbered first edition! Do you know how rare it is? It must have cost a fortune!”  Maria was confused. “What does that mean?” Surely Mr. Valapoli didn’t have the money to buy her a rare and valuable book—not if he had to live in a boarding house.  The Professor sighed suddenly, calming himself by sheer force of will. “It means that before this book was desecrated by an inscription, it was one damned expensive book for your friend to buy. It’s worth a lot less now though—it’s no longer in its original condition.”  While she tried to assimilate all this startling information, Albright leafed through the pages to find the inscription. Suddenly he looked as surprised as Maria felt.  He started pacing up and down with the book, an intent look in his eyes, his brow furrowed, his veneer of smug superiority completely vanished. Suddenly he looked up. “This is not any spoken language—and I can tell you that this is not a dead language either.” He paused, squinting excitedly at the page again. “In fact, this appears to be an extinct language. It’s certainly alien to anything I’ve ever encountered. The structure is . . . let me put it this way: I’ll bet a week’s pay that not one word of this can be translated into English, and if it was a dead language I’d be able to do so, or at least see how to attack it.” The book snapped shut as if to emphasize his point. “I’m afraid I can’t help you.”  Maria was dumbfounded. She gave Albright permission to photocopy the inscription before leaving for work, filled with more questions than before. Money was clearly not a problem if Mr. Valapoli could buy and inscribe this book regardless of its worth, simply because it made the gift more personal.  So why was the man living in that rundown boarding house if he could afford better? She didn’t know then, and she still had no idea when she finally went back to work.  Just as she was about to reconnect his phone line yet again, Maria paused and decided instead to roll the cord up neatly into a bundle and place it beside the handset on the desk. She might not understand what Mr. Valapoli had against receiving calls, but after receiving such a present it was time that she started heeding his wishes.  Having finished dusting the desk and nightstand, she moved over to clean the dresser, and her gaze fell upon the statuette. It looked different again today. The change was subtle as always, but she thought she could almost discern the vague shape of an elephant, the trunk curving gently around the base, serene and contemplative. Even the color had subtly changed to match that of a pachyderm.  Mr. Valapoli was such a tidy tenant that she rarely had to use more than a feather duster to keep any surfaces clean. However, she couldn’t remember the last time she had actually picked up the statuette to clean it properly, or indeed if she ever had. Possibly the greyish tone was simply the result of accumulated dirt.  Maria reached out to pick it up. The instant her fingers came in contact with it she felt some kind of joining, something she had never experienced before. She blinked very rapidly as she was suddenly overwhelmed by a sensation of otherness.  Suddenly a montage of images appeared, not before her eyes, but inside her mind—but they were like no images she had ever seen, or even imagined before. She saw three moons racing across a coal-black sky, their trajectory reflected in the murky waters of a silent ocean, and a sense of tranquility swept over her. Pastoral pictures followed, not of anything she had ever seen, but lovely nonetheless.  And then she felt an air of foreboding, of dread, and the images, blurred beyond recognition, turned blue, became larger and bolder without taking any discernable shapes, and seemed to be converging on her.  She screamed, just once, and pulled her hand back—and the instant she did so, all the images, all the emotions, vanished, and she was alone in the room, her forgotten feather-duster still clutched in her left hand. She held up her right hand and studied it, as if it was no longer part of her, as if it had somehow betrayed her. There were no marks on it, no burns or bruises, and she knew instinctively that it wasn’t the hand that had taken her out of the here and now, it was the contact.  And now she turned her attention to the object that she had been in contact with. The statuette looked harmless enough, a peaceful, tranquil, not-quite-elephant, not-quite-anything. Had she imagined it? And if so, what exactly had she imagined?  She extended a forefinger and reached out to touch it lightly, then drew back before she made contact. Four more times she tried to work up the courage, and then, finally, her finger gingerly touched the statuette.  An image appeared in her mind, not of too many moons or flowers that didn’t exist or oppressive blue somethings, but rather of a bookstore. A not-quite-human hand was thumbing through the pages of a book. Her book.  This time statuette didn’t hold her against her will. She withdrew her hand, stood back, stared at it once again, and waited for her heart to stop pounding so hard against her chest.  If I’m not imagining this, what does it mean? And what have I stumbled into?  Evening and midnight came and went, and she still didn’t know. She barely slept, and made up her mind to finally confront Mr. Valapoli and get some answers. She knew he was always gone when she arrived at nine o’clock, so she showed up at six thirty, just as dawn was breaking.  Probably he’s asleep, she thought, staring at his door. I’ll just wait for some sound of movement.  She leaned against the wall for five uneasy minutes, then stood erect. This was too important to wait. She had to get some answers now.  She knocked at the door. No response. She turned the knob and gingerly tried to open it. It was locked. She knew that using her master key was against regulations, probably against the law, but she didn’t hesitate. A moment later she was inside the room.  Mr. Valapoli wasn’t there. The bed hadn’t been slept in. She looked in the closet to see if he’d packed and left. It was filled with his clothes.  Was it all an hallucination? There was only one way to find out. She walked over to the statuette, summoning her courage to touch it again. It had changed again, no longer vaguely elephantine, no shape that she could identify . . . but she could identify an emotion, its every line seemed to project: fear.  It couldn’t be afraid of her. All she wanted were answers. What could be scaring it?  And suddenly, instinctively, she knew. It was the blue, shapeless things she had sensed yesterday. They were not part of her life, or even her world—and that meant that the fear was Mr. Valapoli’s.  She laid her hand on the statuette without hesitation now. Images, blue and garbled, flooded her mind, and she seemed to hear voices inside her head, not human voices, not speaking any language she had ever heard, but somehow she understood what they were saying.  A voice that sounded blue (how was that possible?) was saying, “You hid well. But now you must come back with us.”  And a gentle voice, a voice she instinctively knew was Mr. Valapoli’s, a very tired, very weary voice said, “It’s a big galaxy, and this is such a small world. How did you find me?”  “We have our methods,” said the blue voice. “Will you come peacefully or must we use force?”  “These are decent beings, these people. They are without malice. Do them no harm, and I’ll come back with you,” said the tired voice.  “I do not envy you when we get home,” said the blue voice.  Maria withdrew her hand. They were going to take him away, back to something awful! She raced to the window to see if they were in the yard. There was a hint of something large and blue beneath a tree, but she couldn’t make it out.  “No!” she yelled, turning and preparing to run to the door.  And the statuette, suddenly more human—or at least humanoid in shape—raised a hand as if to tell her to stop.  She froze, shocked, and the gentle voice spoke inside her head.  “It’s all right, Maria.”  She stared at the statuette, and its expression seemed to soften. Finally, after another minute, it lowered its hand.  “Thank you for caring.”  She walked to the window, and the blue shape was gone, and somehow she knew Mr. Valapoli was gone too. Forever.  Sunlight streamed in through the single window of the bedroom, bathing the statuette in warm golden light as it sat on the dresser, the focal point of the small, uncluttered room.  Still half asleep, Maria stretched languorously, thinking of all she had experienced over past few weeks. Ever since Mr. Valapoli left and she had brought the statuette home, it felt like it truly belonged with her, and she liked to imagine that the statuette itself felt comfortable on her dresser.  Its shape had continued to change. Each morning she would wake up to see the magic that had been wrought overnight, and each day it became somehow less alien in its form and more distinct in its features, softening into the image of a man, with eyes as kind as Mr. Valapoli’s voice had been gentle.  She no longer questioned how the statuette could change. She knew. Every time she touched it she could sense him. The connection was very faint, and growing fainter with each passing day, but she took comfort in the fact that it was there.  Until the morning she touched it and didn’t feel anything but the cold contours of the statuette itself. Not sure of what was happening, she reached out to make contact with it again, but before she could, her eyes widened in wonder as she realized she was witnessing its very last change, her unseen friend’s final parting gift to her, the one that let her know he also cherished their strange connection.  There upon the statuette’s face was a smile, and in her mind she clearly heard the echo of Mr. Valapoli’s voice for the last time.  “Thank you for caring, Maria.” Mike Resnick is the winner of 5 Hugos and numerous other major awards in the USA, France, Japan, Spain, Croatia, and Poland, and is, according to Locus, the all-time leading award winner, living or dead, for short fiction. He is the author of more than 50 novels, 200 short stories, 14 collections, and two screenplays, and the editor of more than 50 anthologies. His work has been translated into 22 languages.  Lezli Robyn is a science fiction and fantasy writer who lives on southern-east coast of Australia. A fan of the field since she was old enough to read, she travelled to America for her first Worldcon in Denver and had the privilege of meeting authors she had grown up reading. Since going to Denver she's made her first two solo sales as a professional writer. She's also sold two stories in collaboration with Mike Resnick with an assignment for a third to be written together. As both a fan and a writer she looks forward to spending her future exploring the fictional worlds she creates with her words; she hopes her readers will enjoy them as well.", "text": "4000 words, short story\nIdle Roomer\nThe room was on the second floor of the dilapidated old building, overlooking what had once been a garden and now was a concrete parking slab filled with cracks and potholes. It had a narrow bed next to a small nightstand with a cheap lamp and an old, battered desk by the single window. A rickety wooden chair, a phone, an ancient dresser, a tarnished floor lamp, and a small closet completed its uninspired furnishings.\nAnd, thought Maria, Mr. Valapoli has lived here for sixteen months. How could anyone live in this cheerless place for sixteen days, let alone months?\nMaria surveyed the room from the door. She’d been cleaning this room five days a week for sixteen months, and she’d still never laid eyes on him. His bed was always made, the top of his desk always barren. The only way she knew he actually existed was the nightstand, which had a different library book almost every morning, and the bathroom, which held a dozen bottles of pills that were replaced with new bottles from time to time.\nOh—and the statuette on the top of the dresser. She didn’t quite understand what it was. Sometimes she thought it might be a woman, holding her arms out to the viewer. Other times she wondered how she could have been so mistaken, for clearly it was a small animal with large trusting eyes, possibly something from the deepest jungles of Africa. Once she even thought it was a twisted tree. Maria shook her head; she would never understand modern art.\nShe would never understand Mr. Valapoli either. Every day she plugged the phone into the jack, and yet the next morning the end of the cord always lay on the floor. She checked the dial tone; it was functioning. Why did the man pay for a phone if he had no use for it?\nShe never liked Sherlock Holmes much, but she thought it might be interesting to work at being the Miss Marple of housemaids and see what she could deduce about the mysterious roomer. He had to have a beard, because there was no shaving equipment, manual or electric, in the bathroom. Yet she never found any hairs, from his head or his chin, on the bed or the floor. He was probably color blind, for there was nothing blue, or purple, or violet in the drawers, no shirts of those tones in his closet. When she thought of it, she couldn’t even remember a blue cover on any of his books.\nShe swept the floor, which hadn’t seen a carpet or even a rug in perhaps half a century, went through the motions of dusting the desk and dresser and nightstand though as always they were as clean as if they’d been on display in a store.\nEvery other tenant was a transient. Even those who were down on their luck never stayed more than a week. And here was this poor man spending sixteen months of his life here. No matter what misfortunate had befallen him, he didn’t deserve this. No one did.\nHer heart went out to him, and on an impulse, she took a piece of paper out of her pocket and left a note on his desk:\nDon’t give up hope, Mr. Valapoli. People do care. I care.\n—Maria\nShe thought about the poor man all day. It was only when she was on her way home that she realized that he would have no idea who she was.\nMaria’s hand hovered just above the doorknob, hesitant and expectant. Last night she agonized over whether she should have left the note. Surely it wasn’t wrong to let another person know that she felt for the predicament she saw him in? But then again, he could be a proud man who might see her sympathy as pity.\nShe shook her head, dispelling uneasy thoughts as she coaxed the creaking door to open. No, the note was well-meant and surely Mr. Valapoli would understand that.\nAt first glance the room appeared the same as always. As she absentmindedly plugged the phone cord into the jack again, the statuette caught her eye. Now it seemed to mildly resemble a curious owl, the eyes tracking her everywhere she went in the room.\nYou’re being ridiculous, Maria Saviari, she reprimanded herself. Next you’ll be jumping at shadows.\nShe continued cleaning the room, pausing only to pick up her daily tip from atop the immaculately-made bed. As she placed the dollar bill in the pocket of her apron, her keen eyes noticed something different on the nightstand. This time there were two books upon it instead of the usual lone library book. Curious, she moved around to the nightstand, automatically smoothing the bedspread as she went.\nWondering fingers traced the cover of the second book, resplendent with its rich burgundy leather and gold foil embossed title: A Meeting of Minds. Gingerly she picked it up—ostensibly to dust underneath it, but actually to look more closely at the cover—when she noticed a piece of paper lying beneath the book.\n“For Maria” appeared in a childlike scrawl—it was as if the writer had trouble forming the letters into legible shapes. Suddenly she realized that the book she now held in her hands was actually for her. It was his reply to her note.\nCurious, she carefully opened it, the musty smell reaching her nostrils as she leafed through the first few pages. She stopped at the title page to discover more words written by the same hand as the note, but other than her name and a touchingly clear “Thank you” at the bottom of the inscription, the rest of the words were composed in a language she didn’t recognize. She stared at it. Somehow the words looked neither awkward nor badly scrawled; rather, they seemed to possess some indefinable cogency and even beauty.\nHow do I reply without knowing what the inscription in the book means? The phone started ringing, breaking her train of thought. She jumped, startled, and for the briefest instant it seemed to her that the statuette jumped as well. Get ahold of yourself, Maria, she thought; it’s only a gift. No need to be so jumpy, or to feel guilty because you’re looking through it, After all, he wants you to.\nAware that she still had six rooms to clean before the end of her shift, she reluctantly placed the book in her apron pocket and continued working, the feather duster making short work of an already clean dresser and desk.\nOn an impulse she went back to the bed and replaced the tip there before she left. It felt wrong to take it now that they’d exchanged communication and she’d accepted his gift, and she hoped he’d see it as the small gesture of friendship it was.\nAs she finally closed the door behind her, the phone began ringing once again, as if impatient to be answered. Maybe Mr. Valapoli had some friends after all, she thought as she pushed her cleaning cart into the next cheerless hotel room, one hand unconsciously checking to make sure that the book was still safe in her pocket.\nMaria watched tenderly as her grandmother leafed through the book, smiling when she saw her bring it close to her face, shut her eyes and breathe in the scent of the leather binding. Golden light filtered in through the window, dancing on the last auburn strands to be found in almost snow-white hair, the years of hard work and laughter defined on her face by the late afternoon sun.\n“Smells expensive” was her first comment as she glanced up to look squarely at her granddaughter.\n“I very much doubt that.” Maria smiled. “It’s a gift from someone staying at the boarding house.” She reached over and turned the pages until she came to the inscription. “This is what I came here to ask you about. What language do you suppose this is?”\n“My dear,” said her grandmother, “this wilted English Rose might have married a Sicilian but that does not make me an expert in other people’s languages. However,” she continued, as one finger traced the letters softly, “it’s definitely not a romance language, and I don’t think it looks Oriental. In fact, it doesn’t look similar to anything I’ve encountered before. Those elegant pictographs are quite distinctive.” She looked up sharply. “Who did you say gave this to you?”\n“I didn’t say. This book is from a man I’ve told you about previously Grandma; Mr. Valapoli, the one that’s had the misfortune to stay in the boarding house for the last 16 months.”\n“Is it normal practice for guests to give you inscribed gifts?”\nMaria sighed. “No, it’s not, but . . . ”\n“Let me guess: You want to help him.” She closed the book quietly, setting it down on the table in front of her. “You can’t help every lost soul you come across Maria—no, don’t interrupt me.” She reached out and placed a hand on her granddaughter’s cheek, gently brushing an errant ebony lock back as she did so. “You have too generous a heart; it makes it all that much easier for someone to break it.” Abruptly she stood up, her hand shaking as it moved to pick up her walking stick. “And if you don’t leave now it will be dark by the time you get home. Besides, you can’t keep a frail old lady up past her bedtime,” she intoned, the twinkle in her eyes still bright despite darkness falling outside.\nReplacing the book in her uniform pocket, Maria laughed softly, and arose to kiss her grandmother on the forehead. “You are eighty-eight years young and definitely not frail of mind. Thank you for your advice, Grandma.”\n“If it’s my advice you want, I’d take that gift of yours to the university tomorrow before you work. There’s bound to be someone there with enough degrees to translate it.”\nSeemingly endless rows of books towered over Maria as she made her way to the back of the university library, feeling more insignificant with every step she made. As her fingertips ran feather-light along the spines of the books, she looked up at the ornately-carved bookshelves in awe. Every dust-filmed tome seemed to hold a wealth of knowledge, representing privilege to her uneducated eyes.\nAn officious library clerk had told her that she’d find the man she was looking for with his class at the back of the library. She suddenly spotted him at a circular table already surrounded by students, one of whom was draped nonchalantly over a huge padded chair at the side of the table. He appeared exactly the way she thought a professor should look: peppered black hair, a neatly-trimmed silver beard, and glasses perched low on a nose that he buried deeper into a book the closer she got to him.\n“Professor Albright, may I have a moment of your time?” she asked politely, her eyes focused on the top of his head.\n“Certainly,” came the aloof yet slightly amused reply from the direction of the armchair. “In fact, you can have several.”\nShe started in surprise, turning to stare at the man now confidently vacating the chair. This young man is a Professor of Linguistics? She knew appearances could be deceptive and she’d seen all types come and go at the boarding house, but this man with his surf-blond hair and cornflower blue eyes was not what she was prepared to meet.\nProfessor Albright addressed the older man firmly. “Mr. Tripoldi, the class, if you please.” Without waiting for a response he strode over to the partially-secluded corner of the library, Maria scurrying in his wake.\n“How can I be of service to you?” he inquired, eyebrows raised as he turned to look at her. “I really only do have a few minutes to spare you, so please be concise.”\n“I’ve come across a language I cannot identify,” she said. “It’s an inscription in a book I’ve been given.” She began rummaging through her work bag, wishing now that she’d thought to put the book on top of her change of clothes.\n“Why don’t you simply ask the person who gave you this inscribed gift?” he asked, staring at her with mild annoyance.\n“I could. Or”—Maria matched his stare—“I can politely ask a leading academic on dead languages his expert opinion rather than hurt a considerate friend’s feelings by asking what it means.”\nSurprise and a hint of respect flickered briefly across Albright’s face before he once again adopted a mask of detached boredom. “You could indeed.”\nShe held out the book to him, feeling suddenly more comfortable when his eyes left hers and refocused on the leather binding of her gift. “The inscription is on the third page,” she explained, “and it’s . . . ”\nThe book was all but snatched out of her grasp, the Professor unable hide his excitement over what now lay in his hands. “It couldn’t be . . . could it?” The Professor opened the book to the copyright page, and began reading intently, then turned the page again. Suddenly there was a sharp intake of breath. “Do you realize what you have here?” he exclaimed, not waiting for an answer. “This is a numbered first edition! Do you know how rare it is? It must have cost a fortune!”\nMaria was confused. “What does that mean?” Surely Mr. Valapoli didn’t have the money to buy her a rare and valuable book—not if he had to live in a boarding house.\nThe Professor sighed suddenly, calming himself by sheer force of will. “It means that before this book was desecrated by an inscription, it was one damned expensive book for your friend to buy. It’s worth a lot less now though—it’s no longer in its original condition.”\nWhile she tried to assimilate all this startling information, Albright leafed through the pages to find the inscription. Suddenly he looked as surprised as Maria felt.\nHe started pacing up and down with the book, an intent look in his eyes, his brow furrowed, his veneer of smug superiority completely vanished. Suddenly he looked up. “This is not any spoken language—and I can tell you that this is not a dead language either.” He paused, squinting excitedly at the page again. “In fact, this appears to be an extinct language. It’s certainly alien to anything I’ve ever encountered. The structure is . . . let me put it this way: I’ll bet a week’s pay that not one word of this can be translated into English, and if it was a dead language I’d be able to do so, or at least see how to attack it.” The book snapped shut as if to emphasize his point. “I’m afraid I can’t help you.”\nMaria was dumbfounded. She gave Albright permission to photocopy the inscription before leaving for work, filled with more questions than before. Money was clearly not a problem if Mr. Valapoli could buy and inscribe this book regardless of its worth, simply because it made the gift more personal.\nSo why was the man living in that rundown boarding house if he could afford better? She didn’t know then, and she still had no idea when she finally went back to work.\nJust as she was about to reconnect his phone line yet again, Maria paused and decided instead to roll the cord up neatly into a bundle and place it beside the handset on the desk. She might not understand what Mr. Valapoli had against receiving calls, but after receiving such a present it was time that she started heeding his wishes.\nHaving finished dusting the desk and nightstand, she moved over to clean the dresser, and her gaze fell upon the statuette. It looked different again today. The change was subtle as always, but she thought she could almost discern the vague shape of an elephant, the trunk curving gently around the base, serene and contemplative. Even the color had subtly changed to match that of a pachyderm.\nMr. Valapoli was such a tidy tenant that she rarely had to use more than a feather duster to keep any surfaces clean. However, she couldn’t remember the last time she had actually picked up the statuette to clean it properly, or indeed if she ever had. Possibly the greyish tone was simply the result of accumulated dirt.\nMaria reached out to pick it up. The instant her fingers came in contact with it she felt some kind of joining, something she had never experienced before. She blinked very rapidly as she was suddenly overwhelmed by a sensation of otherness.\nSuddenly a montage of images appeared, not before her eyes, but inside her mind—but they were like no images she had ever seen, or even imagined before. She saw three moons racing across a coal-black sky, their trajectory reflected in the murky waters of a silent ocean, and a sense of tranquility swept over her. Pastoral pictures followed, not of anything she had ever seen, but lovely nonetheless.\nAnd then she felt an air of foreboding, of dread, and the images, blurred beyond recognition, turned blue, became larger and bolder without taking any discernable shapes, and seemed to be converging on her.\nShe screamed, just once, and pulled her hand back—and the instant she did so, all the images, all the emotions, vanished, and she was alone in the room, her forgotten feather-duster still clutched in her left hand. She held up her right hand and studied it, as if it was no longer part of her, as if it had somehow betrayed her. There were no marks on it, no burns or bruises, and she knew instinctively that it wasn’t the hand that had taken her out of the here and now, it was the contact.\nAnd now she turned her attention to the object that she had been in contact with. The statuette looked harmless enough, a peaceful, tranquil, not-quite-elephant, not-quite-anything. Had she imagined it? And if so, what exactly had she imagined?\nShe extended a forefinger and reached out to touch it lightly, then drew back before she made contact. Four more times she tried to work up the courage, and then, finally, her finger gingerly touched the statuette.\nAn image appeared in her mind, not of too many moons or flowers that didn’t exist or oppressive blue somethings, but rather of a bookstore. A not-quite-human hand was thumbing through the pages of a book. Her book.\nThis time statuette didn’t hold her against her will. She withdrew her hand, stood back, stared at it once again, and waited for her heart to stop pounding so hard against her chest.\nIf I’m not imagining this, what does it mean? And what have I stumbled into?\nEvening and midnight came and went, and she still didn’t know. She barely slept, and made up her mind to finally confront Mr. Valapoli and get some answers. She knew he was always gone when she arrived at nine o’clock, so she showed up at six thirty, just as dawn was breaking.\nProbably he’s asleep, she thought, staring at his door. I’ll just wait for some sound of movement.\nShe leaned against the wall for five uneasy minutes, then stood erect. This was too important to wait. She had to get some answers now.\nShe knocked at the door. No response. She turned the knob and gingerly tried to open it. It was locked. She knew that using her master key was against regulations, probably against the law, but she didn’t hesitate. A moment later she was inside the room.\nMr. Valapoli wasn’t there. The bed hadn’t been slept in. She looked in the closet to see if he’d packed and left. It was filled with his clothes.\nWas it all an hallucination? There was only one way to find out. She walked over to the statuette, summoning her courage to touch it again. It had changed again, no longer vaguely elephantine, no shape that she could identify . . . but she could identify an emotion, its every line seemed to project: fear.\nIt couldn’t be afraid of her. All she wanted were answers. What could be scaring it?\nAnd suddenly, instinctively, she knew. It was the blue, shapeless things she had sensed yesterday. They were not part of her life, or even her world—and that meant that the fear was Mr. Valapoli’s.\nShe laid her hand on the statuette without hesitation now. Images, blue and garbled, flooded her mind, and she seemed to hear voices inside her head, not human voices, not speaking any language she had ever heard, but somehow she understood what they were saying.\nA voice that sounded blue (how was that possible?) was saying, “You hid well. But now you must come back with us.”\nAnd a gentle voice, a voice she instinctively knew was Mr. Valapoli’s, a very tired, very weary voice said, “It’s a big galaxy, and this is such a small world. How did you find me?”\n“We have our methods,” said the blue voice. “Will you come peacefully or must we use force?”\n“These are decent beings, these people. They are without malice. Do them no harm, and I’ll come back with you,” said the tired voice.\n“I do not envy you when we get home,” said the blue voice.\nMaria withdrew her hand. They were going to take him away, back to something awful! She raced to the window to see if they were in the yard. There was a hint of something large and blue beneath a tree, but she couldn’t make it out.\n“No!” she yelled, turning and preparing to run to the door.\nAnd the statuette, suddenly more human—or at least humanoid in shape—raised a hand as if to tell her to stop.\nShe froze, shocked, and the gentle voice spoke inside her head.\n“It’s all right, Maria.”\nShe stared at the statuette, and its expression seemed to soften. Finally, after another minute, it lowered its hand.\n“Thank you for caring.”\nShe walked to the window, and the blue shape was gone, and somehow she knew Mr. Valapoli was gone too. Forever.\nSunlight streamed in through the single window of the bedroom, bathing the statuette in warm golden light as it sat on the dresser, the focal point of the small, uncluttered room.\nStill half asleep, Maria stretched languorously, thinking of all she had experienced over past few weeks. Ever since Mr. Valapoli left and she had brought the statuette home, it felt like it truly belonged with her, and she liked to imagine that the statuette itself felt comfortable on her dresser.\nIts shape had continued to change. Each morning she would wake up to see the magic that had been wrought overnight, and each day it became somehow less alien in its form and more distinct in its features, softening into the image of a man, with eyes as kind as Mr. Valapoli’s voice had been gentle.\nShe no longer questioned how the statuette could change. She knew. Every time she touched it she could sense him. The connection was very faint, and growing fainter with each passing day, but she took comfort in the fact that it was there.\nUntil the morning she touched it and didn’t feel anything but the cold contours of the statuette itself. Not sure of what was happening, she reached out to make contact with it again, but before she could, her eyes widened in wonder as she realized she was witnessing its very last change, her unseen friend’s final parting gift to her, the one that let her know he also cherished their strange connection.\nThere upon the statuette’s face was a smile, and in her mind she clearly heard the echo of Mr. Valapoli’s voice for the last time.\n“Thank you for caring, Maria.”\nMike Resnick is the winner of 5 Hugos and numerous other major awards in the USA, France, Japan, Spain, Croatia, and Poland, and is, according to Locus, the all-time leading award winner, living or dead, for short fiction. He is the author of more than 50 novels, 200 short stories, 14 collections, and two screenplays, and the editor of more than 50 anthologies. His work has been translated into 22 languages.\nLezli Robyn is a science fiction and fantasy writer who lives on southern-east coast of Australia. A fan of the field since she was old enough to read, she travelled to America for her first Worldcon in Denver and had the privilege of meeting authors she had grown up reading. Since going to Denver she's made her first two solo sales as a professional writer. She's also sold two stories in collaboration with Mike Resnick with an assignment for a third to be written together. As both a fan and a writer she looks forward to spending her future exploring the fictional worlds she creates with her words; she hopes her readers will enjoy them as well.", "source": "https://clarkesworldmagazine.com/resnick_11_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Idle Roomer by Mike Resnick and Lezli Robyn"}