{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "JDhSmZBX/7POp8csiNPQGK53LHQ=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Celebrating the Diversity of Chinese Culture: A Conversation with Xueting Christine Ni  Xueting Christine Ni was born in Guangzhou and spent most of her childhood there, but moved around a lot as a child, experiencing many regions and cultural dynamics in China. “I’ve lived in the old town with its very close alleyways, in meandering tenements, as well as in modern gated apartment complexes.” Her father worked in exports and was often away, and her mother was career-driven, so Xueting was mainly raised by family, friends, and the community. She moved to the UK in 1993. “Whether I’m flying to Guangzhou, or to London, they both feel like coming home, but also tinged with the sadness when leaving.”  Coming from a family of businesspeople, Xueting fought to follow a path focused on literature. “I guess my dilemma was that of many diaspora Chinese and East Asians, who are simply expected to go into IT, finance, sciences, or at least something sensible, like the professions.” She earned a BA in English at Queen Mary’s University of London, then moved to Beijing to study Chinese literature. “I didn’t want to restrict myself to single topics, and I really felt like half my education was going to be in experiencing local life and seeing China’s diversity. So, I sort of stepped away from those places that were set up for students from the West, found a flat in the Haidian District, and ended up cobbling together a postgrad medley at Minzu University (Central University of Nationalities), where I could look at the cornerstones and classics, but also literature and film, cultural studies. It gave me a chance to really get a sense of how China sees itself, and how those views are changing. How they celebrate their diversity inside, but still present this single face of China outside.”  For over a decade, Xueting has worked in publishing as her day job, doing everything from assisting a literary agent, to contracts and legal, and finally, settling in production. “Any time I found myself between contracts, I’d just pick up what I could, like tutoring a teenager in Chinese and piano, probably the weirdest job was picking parts for jet planes for an electronics company.” For just as long, she has also been doing translation work, functioning as an interpreter, and promoting Chinese culture in her own time. Her translations cover a spectrum of material, such as best-selling manhua Vision of the Other Side by Lin Yu-Chin; prose, poetry, and art collection Endless by Professor Sherman Lin; indie music documentary “China Underground” by John Yingling; Chinese science fiction by Tang Fei; and more. She has also spent years writing nonfiction, including pieces for the BBC, the Guangdong Academy of Fine Arts, and From Kuan Yin to Chairman Mao: The Essential Guide to Chinese Deities (Weiser Books), as well as giving talks and tours.  Xueting currently lives in the suburbs of London with her partner and their cats, all of whom are learning Chinese. Besides literature, she is passionate about film, food, and music of many kinds. “I find myself increasingly reading for my education, both research and understanding how the world is changing around me. Nowadays, I often dream of just reading for pleasure. My TBR pile is rather a large and ominous creature.”   How did you get into genre fiction and science fiction in particular? What were some of the first science fiction books or stories that spoke to you, and why?  I came to genre fiction relatively late. As a kid in China, I was given children’s science books rather than science fiction, but there was a copy of Alexander Belyaev’s Professor Dowell’s Head on the bookshelf at home, which I dipped into. I was probably too young for it, but it left an impression.  Even after we emigrated to the UK, I was still raised as the “good Chinese child” and given a steady diet of literary classics, so I guess my first science fiction stories were the ones that were canon enough to wind up on my English Literature degree’s syllabus. Mary Shelley, R. L. Stevenson, Orwell, and Huxley. Frankenstein, along with Dr. Jekyll and Mr. Hyde, really stood out for me. They combined science, horror, as well as humanist and sociological debate, all delivered in the elegant and sophisticated vehicle of the Victorian novel.  University also introduced me to all kinds of people. Goths, queer kids, anime nerds . . . and that’s when I came into contact with more pop culture stuff, especially the genre fiction that I’ve loved ever since. I started working my way forward from “the classics.” The unfettered imagination and lyricism of Bradbury; the charming robot stories of Asimov; the incredible worlds and intensity of P. K. D., whose influences went beyond Western cultures. I came to love the work of John Wyndham, who to me, is the quintessential British science fiction writer, he’s very insightful with an understated grace and economy to his work. I’m very aware that this list is predominantly old, male, and white, but these were the most readily available and visible works during my youth. At the moment, I’m having an amazing time catching up on the works by writers of color like myself and especially female writers.  In one of your blog posts you mention that horror is one of your favorite genres. What is it that horror and science fiction do that non-genre fiction doesn’t?  Ghost stories always seemed to be around. I grew up with adaptations of Pu Songling’s collection. He was a scholar from the 17th/18th century, and his work still inspires authors around the world today.  I’ve always been interested in what societies fear, or are afraid to face, and these elements absolutely feed into horror fiction. There’s been a slow shift in China from the supernatural to body and social horror, and I think that says a lot about how the society is developing, but both horror and science fiction are these unfettered spaces for creative imagining. As someone who used to be immersed in realist and contemporary classics, I’m awed by how many more tools science fiction and horror give you to work with, and the freedom to create your own. It enables the writer to explore themes in a more intense, heightened way.  To me the boundaries between genre, non-genre, “literary,” and “popular” fiction aren’t so clear cut, or that important. There are well written works in any style and genre that should be celebrated.  What are some of the most important differences between newer Chinese science fiction (from the past few years) and older or classic Chinese science fiction?  The big difference? The people who write them. During China’s first “golden age” of science fiction, writers were charged with “the education of the general public” through their stories, which meant that the authors tended to be professors and teachers, portraying technological utopias. From the 1980s onward, there’s been a diversification from the collective social experience, and writers of the last few decades are exploring a lot of different subjects, such as body modification, space exploration, enhanced and artificial intelligence, the use and misuse of technology, ecological concerns . . . kehuan (Chinese for science fiction) has progressed from a linear development to an explosion of activity. We are now also seeing more writers emerging from diverse backgrounds and experiences. In terms of elements like style, narrative form, and point of view, the genre has become a lot more dynamic.  Do you have favorite science fiction, fantasy, or horror writers whose work still hasn’t been translated into English, authors that Western audiences may not even know about?  Lots. Science fiction is an area that China is very much focusing on right now, with lots of recognition of it as a thing in its own right, and there’s more of a concerted effort to bring works out to the wider world. Not so much other genres . . . yet. I’ve been looking into China’s flourishing genre fiction output, and this century, it’s really taken off. The rise of digital publishing has meant that a lot more fantastic writers have been able to get themselves read, and with increased competition and growing readerships spurring writers on, the improvement of quality has been quite something. This has led to a plethora of new genres too, such as daomu (tomb raiding), danmei (Chinese BL), qihuan (fantasy that combines Western and Eastern elements). Ten years ago, hardly any of these writers would have been known in the West, so it’s very pleasing that at least some of the more recent ones, people over here have at least heard of, or seen adapted on TV and film. Sorry to be vague, I’m in discussions with various people about future projects at the moment.  How did the Sinopticon project come about, how did it develop, and what were the biggest challenges to making it happen?  I actually first worked on translations about fifteen years ago. I am a literary translator, but also a geek, and I saw huge and important cultural content coming out in storytelling forms such as manhua (graphic novels), contemporary fiction, and genre fiction. At the time, most of the translators in the UK were Western academics, and there was a baked-in belief that non-Western translators somehow could not do quite as thorough a job of localization. There were certain limited perspectives through which the media and Anglophone publishers were willing to see China. If the book wasn’t about the hardships of recent Chinese history or the majesty of ancient wonders, they just weren’t that interested.  Publishers and literary agents at the time could probably just about accept a translator who was ethnically Chinese, as long as they had been born and raised in an Anglophone country. But being a Chinese immigrant who’d spent a childhood in China and the rest of my life in the UK, someone who wanted to translate Chinese works into English without even having a master’s or PhD in oriental studies . . . well, they didn’t quite know what to make of me.  So, I was left seeing these huge, important cultural touchstones hurtling past, unregarded, unable to gain any attention for these amazing projects. It was infuriating, but I continued to write about China, and its culture, and build up the recognition for my writing and knowledge, as well as my lectures and talks on Chinese film, music, and yes, its popular literature, ‘til I gained enough momentum that opportunities arose.  Sinopticon had been bubbling in my head for years, having browsed through excellent sci-fi magazines on the newsstand during my trips to China, and being very aware that the people in the UK had absolutely no idea this stuff even existed. When Worldcon came to London in 2014, I was able to attend thanks to a group called Con or Bust, who lobby for convention tickets to help young people of color, who may otherwise not be able to access the circuit. There, I had some serendipitous meetings with Chinese SF writers, and even ended up helping out on the China bid stand, along with my editor. After that, I read more kehuan online, delivered a lecture on it, and had another fortuitous meeting with people from Rebellion, who I managed to get enthusiastic about the project. It’s only taken me about ten years to get someone to listen to me.  Did the book turn out pretty much how you’d initially envisioned it? Or are there important differences between initial concept and final product?  Once I actually got the project green-lit, there was the issue of story selection. There are few channels for translators from outside China to connect with authors, and traversing platforms like Weibo isn’t quite as simple as dropping someone a DM on Twitter. Luckily, I had already met Regina Kanyu Wang, who introduced me to Storycom, and that was an excellent bridge. They have been very helpful in getting me in touch with, not only the authors registered with them, but other writers I’d had my eye on. Between that, my trips to China, and sifting through works on the Internet, I had to work quite quickly to pin down not just a handful of excellent stories, but ones that would work together to help represent the range of styles and subject matter present in contemporary Chinese science fiction.  You could say I felt limited by time (publishing schedule) and space (word limit). I wanted to bring in the wider context. So, for this first anthology, I wanted to present some older writers who started to publish at the very beginning of the current kehuan revival, as well as stories which had only just been published in China. There were more writers I wanted to include, and more still I heard about and read during the book’s production process. I think I’m always going to feel I haven’t looked through enough works, or included a broad enough range, partly because those channels of exchange are still limited, but also because Chinese SF publishing has been rapidly expanding, with stories published not only in print and magazines, but online, on both literary platforms and social media. At the end of the day, it was more important to focus on the quality of the translation and editing, and on putting the thirteen works together so that Anglophone readers would have another portal into kehuan in English, to enjoy and hopefully, fire their desire to read more.  I had envisioned working with one particular Chinese illustrator, whom I had worked with before, but due to timing, he was unavailable. I’m exceptionally glad he’s that in demand, and I do think that the artist we ended up using has turned out some fantastic cover art. Another thing I’m really pleased with is the story guides I’ve written to go with each story. My editor suggested that since the collection spans the past thirty years, and comes from such a different science fiction tradition, that I should put some context to them. I loved the idea, as the bulk of what I do is nonfiction cultural and sociocultural writing. However, I didn’t want to influence the reader’s view of the story before they discovered it for themselves, so we put the guides at the end of each work. I was inspired by my second edition of Octavia E. Butler’s Kindred and Other Stories. One of the objectives I went in to Sinopticon with was to help platform women kehuan authors, who are notoriously underrepresented in China. I was worried that if I chose a wholly female lineup, it would feel like a marginalized space, so I worked toward having an even split, just mainly looking at stories based on content and compatibility, and I’d ended up with women’s voices in over half of the works, as well as a wonderful foreword by another female writer.  Are there elements that tie these stories together? Were there specific things you were looking for in your selection process? Or could this be seen as something of a “Best Of” anthology?  There weren’t really any criteria beyond “Are the authors Chinese? Are they writing what could be called science fiction? Do I think it is well written and enjoyable?” I’m an eclectic reader, so a wide range appeals to me, and I loved how broad the subject matters I found were, from time travel, genetic modification, and historical trauma, to political segregation, artificial intelligence, and space exploration. All those things are pretty common in SF, but the way they were employed to explore art, terrorism, even burial rites . . . made for an interesting selection. I’m not sure I could claim it’s a Best Of” anthology, but definitely an “Exceptionally Fine Collection From.” As I’ve said, the amount of new content turning up daily . . . I wanted to capture at least a snapshot of how this vibrant writing scene is tackling a society headed into the future with its foot on the accelerator.  Due to my own experiences, I always want to give voice to the marginalized, so some of the writers included are perhaps ones that haven’t received a lot of recognition in English, whilst I also needed to tempt in some of the more well-known names, to get people to pick the book up in the first place.  However, having now gone through this process once, and being better acquainted with the Chinese SF industry, I can be a lot more hands on in digging out the rough gems and bringing them to the world when the appropriate opportunities arise.  Were there stories that you really liked, but that didn’t end up in the anthology?  There certainly were. I had really wanted to feature a piece by Xia Jia, but whilst I was building this collection, she was making her own selection for A Summer Beyond Your Reach. However, I’m delighted to have her involvement in another part of this book. There were also works from Han Song and Hao Jingfang, which were made up of multiple parts, which I absolutely fell in love with on first reading. I think they would have been amazing and really fun to translate. However, they were far too long for an anthology, and whilst I could have included single sections from them, it just didn’t feel right. Of course, there were authors like Chi Hui, Qi Yue, and others, whom I’ve had a chance to explore more since the manuscript was handed in, and I clasped my head thinking “OH! Why didn’t I try to include these stories!” but I don’t think I could have included everyone I wanted without the book turning into a multivolume monstrosity.  If someone will read only one story to see if the book is for them, which story would you tell them to read—and why?  That’s a very difficult question, and I’m not sure a fair one! They are all such different stories, and so not really comparable. I do have my personal favorites, but I’d say just pick a story whose title you like and go for it.  Science fiction can challenge readers in different ways. Which story in the anthology challenges the reader the most?  Several stories in the collection are definitely challenging, in different ways, and I do discuss this in my notes. “The Absolution Experiment” confronts difficult subjects, such as terrorism and the nature of justice, while “The Tide of Moon City” makes us think about the impact on everyday lives by geopolitical separatist disputes; and “The Return of Adam” challenges Confucianism as a paradigm of being Chinese. “Rendezvous: 1937” is not at all a comfortable read, but it’s important to think about, and remember, that period of history. The atrocities which were inflicted on China haven’t been covered as much as they need to be, and I feel that more people need to be made aware and to understand it.  A fair amount of Western science fiction gets translated for Chinese language markets. Do some of the stories in Sinopticon stand in conversation with Western, Chinese, or other science fictional narratives in important ways?  Modern China is a very outward looking place. Whether it’s indie music or literature, creators take influences from around the world. A lot of the older generations have grown up reading classic Anglophone science fiction, which I get a feeling of in the tone of their works. One of the reasons I instantly found an affinity with the last story of the collection, is that it reminded me of the whimsy, humor, and wit of British science fiction, like as Douglas Adams and Doctor Who, both of which I am a huge fan of. The more literal translation of the work’s title is “The Bookshop at the End of the Universe,” and there are a few elements in it which are totally a love letter to the Hitchhiker’s cycle. I didn’t think the wibbly-wobbly quirkiness and humor in these works would translate well into other cultures, but it seems that the Doctor Who fandom in China is so large that the BBC ended up commissioning some great official art for the China merch, and one of the things that the zhai, or geeky circles, are talking about at the moment is a range of figurines inspired by Frankie and Benjy mouse, the pan dimensional beings who turned up in the first Hitchhiker’s series.  After some consideration and discussion with the author, we decided to give it a different title rather than a direct translation—“Starship: Library,” was closer to the essence of the story. Whilst it has a lot of callbacks to that sort of . . . post-Python British sci-fi humor, it retains its roots in Chinese culture, reinterpreting one of Chinese mythology’s neglected goddesses as the world’s savior.  A lot of the younger writers like A Que, have, like fans around the world, honed their skills in fan fiction, but where that conversation goes is the interesting part. His story, set in a zombie pandemic, has lots of little conversations with Max Brooks’ World War Z, especially in its film version. The zombie, or sangshi story is a quite recent genre in China (not to be confused with hopping jiangshi, which are China’s traditional undead monsters), and has grown completely out of exposure to Western zombie fiction. A Que does some very interesting things with the sangshi in his work, while at the same time breaking the fourth wall and engaging in dialogue with the common tropes of Hollywood cinema. It’s a very good example of Chinese storytelling’s ability to mix humor, action, and tragedy, not just on the same page, but often in the same paragraph.  On your website, you talk about “seeking out works by new emerging voices, that may be passed over by more conservative news agencies and publishers.” Who are some of the new and emerging voices that excite you most, and why?  I’ve spoken a little bit about this in answer to the question about how Sinopticon came about. Now that I’m in a better position to highlight them, I am at least able to write about them, so they don’t completely pass global audiences by. What I’m excited about most are the net novelists who are creating works, in hundreds of new genres, the freedom it’s giving female writers to venture into previously male-dominated literary realms and create female-orientated writing . . . I would love to be able to translate some of these authors, or write about them more, but a lot of it depends on whether Anglophone publishers and platforms are willing to see potential in these diverse works, the importance for translators of color to represent their own heritage and be prepared to provide adequate resources to enable the work.  In your Publishers Weekly interview, you talk a bit about gatekeeping in the world of translation publishing, and a belief that non-Western translators would not do as good a job as Western translators. What are the best ways for editors and publishers to break this cycle, especially given that many editors may not speak the original languages of the work(s) in question?  I think there needs to be a huge, top-down, and institutional change of attitudes in the Anglophone publishing world. To be less Western-centric, to recognize that it’s important for translators of color, of whatever ethnicity, to be able to work on titles from their own cultural heritage. It’s their right, and not an optional approach or magnanimous decision, to allow them to be part of presenting that culture to the world. I don’t mean, at all, that translators can’t work on texts from other cultures. In fact, the whole point of translating is to help people discover works beyond their own traditions. But there’s no excuse, when translating a writer whose work focuses on the culture or history of their ethnic origin, or when commissioning an opera or play that draws heavily from a non-Western culture, to not recruit at least some translators, actors, or consultants that represent that diversity, because there’s “none good enough.” Often the talent they need is not visible because the pool from which the selection is made pre-excludes them.  I believe, especially when dealing with monumental works from a literary tradition other than their own, Western translators might just need to show some humility, step back, and acknowledge that, brilliant as they may be, it’s not really appropriate for them to be the umpteenth white person turning out yet another version of this work, and maybe someone whose heritage it is could bring more to the piece. There is often this backlash from the white establishment who complain about discrimination, which can act as this awful silencer, but if you are trying to be heard, sometimes it’s not ‘til you’re screaming that you can’t be ignored. But in truth, if you want a wider, more diverse scope of writing, you don’t just need more writers and translators of color, you need more commissioning editors, department heads, and executives of color.  Is there anything else you’d really like readers to know about Sinopticon, the authors and their stories, or yourself and your work?  I’ve always said, if you want to find out more about a nation’s fears and dreams, read their science fiction. Lots of social issues have emerged over the last couple of decades of China’s development, for instance, innovative high-tech solutions to these are part of the preoccupations of Chinese authors today. The book isn’t just about these ideas, it sheds light on the current state of China, its people, and society. It’s interesting to ponder on the fate of those who die in space, and how they are memorialized, but . . . it’s a little sadder to think about what happens when a migrant worker dies on the other side of a vast country like China from their hometown. It’s interesting to think about the informational arms race of enhanced intelligence, but a little close to the bone when you are considering what extra classes, societies, and nutritional supplements you need to impose on your child to prepare them for an exceptionally competitive job market in the future. Whilst a lot of the themes explored are universal, I think there is definitely an element of Sinopticon which is about translating China.  Are you working on more projects like this one? What else do you have coming up that readers should know about?  Give me a break please! I’ve lived and breathed this book for the past two years, and have finally got it ready to go to press. I have plenty of ideas for both fiction collections, nonfiction writings, and I have an essay on new Chinese fiction platforms in the Tordotcom collection The Way Spring Arrives, which will be out in March next year, but I think I want to take a little bit of time to reconnect with friends and family before I go back into the cocoon for my next book. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nCelebrating the Diversity of Chinese Culture: A Conversation with Xueting Christine Ni\nXueting Christine Ni was born in Guangzhou and spent most of her childhood there, but moved around a lot as a child, experiencing many regions and cultural dynamics in China. “I’ve lived in the old town with its very close alleyways, in meandering tenements, as well as in modern gated apartment complexes.” Her father worked in exports and was often away, and her mother was career-driven, so Xueting was mainly raised by family, friends, and the community. She moved to the UK in 1993. “Whether I’m flying to Guangzhou, or to London, they both feel like coming home, but also tinged with the sadness when leaving.”\nComing from a family of businesspeople, Xueting fought to follow a path focused on literature. “I guess my dilemma was that of many diaspora Chinese and East Asians, who are simply expected to go into IT, finance, sciences, or at least something sensible, like the professions.” She earned a BA in English at Queen Mary’s University of London, then moved to Beijing to study Chinese literature. “I didn’t want to restrict myself to single topics, and I really felt like half my education was going to be in experiencing local life and seeing China’s diversity. So, I sort of stepped away from those places that were set up for students from the West, found a flat in the Haidian District, and ended up cobbling together a postgrad medley at Minzu University (Central University of Nationalities), where I could look at the cornerstones and classics, but also literature and film, cultural studies. It gave me a chance to really get a sense of how China sees itself, and how those views are changing. How they celebrate their diversity inside, but still present this single face of China outside.”\nFor over a decade, Xueting has worked in publishing as her day job, doing everything from assisting a literary agent, to contracts and legal, and finally, settling in production. “Any time I found myself between contracts, I’d just pick up what I could, like tutoring a teenager in Chinese and piano, probably the weirdest job was picking parts for jet planes for an electronics company.” For just as long, she has also been doing translation work, functioning as an interpreter, and promoting Chinese culture in her own time. Her translations cover a spectrum of material, such as best-selling manhua Vision of the Other Side by Lin Yu-Chin; prose, poetry, and art collection Endless by Professor Sherman Lin; indie music documentary “China Underground” by John Yingling; Chinese science fiction by Tang Fei; and more. She has also spent years writing nonfiction, including pieces for the BBC, the Guangdong Academy of Fine Arts, and From Kuan Yin to Chairman Mao: The Essential Guide to Chinese Deities (Weiser Books), as well as giving talks and tours.\nXueting currently lives in the suburbs of London with her partner and their cats, all of whom are learning Chinese. Besides literature, she is passionate about film, food, and music of many kinds. “I find myself increasingly reading for my education, both research and understanding how the world is changing around me. Nowadays, I often dream of just reading for pleasure. My TBR pile is rather a large and ominous creature.”\nHow did you get into genre fiction and science fiction in particular? What were some of the first science fiction books or stories that spoke to you, and why?\nI came to genre fiction relatively late. As a kid in China, I was given children’s science books rather than science fiction, but there was a copy of Alexander Belyaev’s Professor Dowell’s Head on the bookshelf at home, which I dipped into. I was probably too young for it, but it left an impression.\nEven after we emigrated to the UK, I was still raised as the “good Chinese child” and given a steady diet of literary classics, so I guess my first science fiction stories were the ones that were canon enough to wind up on my English Literature degree’s syllabus. Mary Shelley, R. L. Stevenson, Orwell, and Huxley. Frankenstein, along with Dr. Jekyll and Mr. Hyde, really stood out for me. They combined science, horror, as well as humanist and sociological debate, all delivered in the elegant and sophisticated vehicle of the Victorian novel.\nUniversity also introduced me to all kinds of people. Goths, queer kids, anime nerds . . . and that’s when I came into contact with more pop culture stuff, especially the genre fiction that I’ve loved ever since. I started working my way forward from “the classics.” The unfettered imagination and lyricism of Bradbury; the charming robot stories of Asimov; the incredible worlds and intensity of P. K. D., whose influences went beyond Western cultures. I came to love the work of John Wyndham, who to me, is the quintessential British science fiction writer, he’s very insightful with an understated grace and economy to his work. I’m very aware that this list is predominantly old, male, and white, but these were the most readily available and visible works during my youth. At the moment, I’m having an amazing time catching up on the works by writers of color like myself and especially female writers.\nIn one of your blog posts you mention that horror is one of your favorite genres. What is it that horror and science fiction do that non-genre fiction doesn’t?\nGhost stories always seemed to be around. I grew up with adaptations of Pu Songling’s collection. He was a scholar from the 17th/18th century, and his work still inspires authors around the world today.\nI’ve always been interested in what societies fear, or are afraid to face, and these elements absolutely feed into horror fiction. There’s been a slow shift in China from the supernatural to body and social horror, and I think that says a lot about how the society is developing, but both horror and science fiction are these unfettered spaces for creative imagining. As someone who used to be immersed in realist and contemporary classics, I’m awed by how many more tools science fiction and horror give you to work with, and the freedom to create your own. It enables the writer to explore themes in a more intense, heightened way.\nTo me the boundaries between genre, non-genre, “literary,” and “popular” fiction aren’t so clear cut, or that important. There are well written works in any style and genre that should be celebrated.\nWhat are some of the most important differences between newer Chinese science fiction (from the past few years) and older or classic Chinese science fiction?\nThe big difference? The people who write them. During China’s first “golden age” of science fiction, writers were charged with “the education of the general public” through their stories, which meant that the authors tended to be professors and teachers, portraying technological utopias. From the 1980s onward, there’s been a diversification from the collective social experience, and writers of the last few decades are exploring a lot of different subjects, such as body modification, space exploration, enhanced and artificial intelligence, the use and misuse of technology, ecological concerns . . . kehuan (Chinese for science fiction) has progressed from a linear development to an explosion of activity. We are now also seeing more writers emerging from diverse backgrounds and experiences. In terms of elements like style, narrative form, and point of view, the genre has become a lot more dynamic.\nDo you have favorite science fiction, fantasy, or horror writers whose work still hasn’t been translated into English, authors that Western audiences may not even know about?\nLots. Science fiction is an area that China is very much focusing on right now, with lots of recognition of it as a thing in its own right, and there’s more of a concerted effort to bring works out to the wider world. Not so much other genres . . . yet. I’ve been looking into China’s flourishing genre fiction output, and this century, it’s really taken off. The rise of digital publishing has meant that a lot more fantastic writers have been able to get themselves read, and with increased competition and growing readerships spurring writers on, the improvement of quality has been quite something. This has led to a plethora of new genres too, such as daomu (tomb raiding), danmei (Chinese BL), qihuan (fantasy that combines Western and Eastern elements). Ten years ago, hardly any of these writers would have been known in the West, so it’s very pleasing that at least some of the more recent ones, people over here have at least heard of, or seen adapted on TV and film. Sorry to be vague, I’m in discussions with various people about future projects at the moment.\nHow did the Sinopticon project come about, how did it develop, and what were the biggest challenges to making it happen?\nI actually first worked on translations about fifteen years ago. I am a literary translator, but also a geek, and I saw huge and important cultural content coming out in storytelling forms such as manhua (graphic novels), contemporary fiction, and genre fiction. At the time, most of the translators in the UK were Western academics, and there was a baked-in belief that non-Western translators somehow could not do quite as thorough a job of localization. There were certain limited perspectives through which the media and Anglophone publishers were willing to see China. If the book wasn’t about the hardships of recent Chinese history or the majesty of ancient wonders, they just weren’t that interested.\nPublishers and literary agents at the time could probably just about accept a translator who was ethnically Chinese, as long as they had been born and raised in an Anglophone country. But being a Chinese immigrant who’d spent a childhood in China and the rest of my life in the UK, someone who wanted to translate Chinese works into English without even having a master’s or PhD in oriental studies . . . well, they didn’t quite know what to make of me.\nSo, I was left seeing these huge, important cultural touchstones hurtling past, unregarded, unable to gain any attention for these amazing projects. It was infuriating, but I continued to write about China, and its culture, and build up the recognition for my writing and knowledge, as well as my lectures and talks on Chinese film, music, and yes, its popular literature, ‘til I gained enough momentum that opportunities arose.\nSinopticon had been bubbling in my head for years, having browsed through excellent sci-fi magazines on the newsstand during my trips to China, and being very aware that the people in the UK had absolutely no idea this stuff even existed. When Worldcon came to London in 2014, I was able to attend thanks to a group called Con or Bust, who lobby for convention tickets to help young people of color, who may otherwise not be able to access the circuit. There, I had some serendipitous meetings with Chinese SF writers, and even ended up helping out on the China bid stand, along with my editor. After that, I read more kehuan online, delivered a lecture on it, and had another fortuitous meeting with people from Rebellion, who I managed to get enthusiastic about the project. It’s only taken me about ten years to get someone to listen to me.\nDid the book turn out pretty much how you’d initially envisioned it? Or are there important differences between initial concept and final product?\nOnce I actually got the project green-lit, there was the issue of story selection. There are few channels for translators from outside China to connect with authors, and traversing platforms like Weibo isn’t quite as simple as dropping someone a DM on Twitter. Luckily, I had already met Regina Kanyu Wang, who introduced me to Storycom, and that was an excellent bridge. They have been very helpful in getting me in touch with, not only the authors registered with them, but other writers I’d had my eye on. Between that, my trips to China, and sifting through works on the Internet, I had to work quite quickly to pin down not just a handful of excellent stories, but ones that would work together to help represent the range of styles and subject matter present in contemporary Chinese science fiction.\nYou could say I felt limited by time (publishing schedule) and space (word limit). I wanted to bring in the wider context. So, for this first anthology, I wanted to present some older writers who started to publish at the very beginning of the current kehuan revival, as well as stories which had only just been published in China. There were more writers I wanted to include, and more still I heard about and read during the book’s production process. I think I’m always going to feel I haven’t looked through enough works, or included a broad enough range, partly because those channels of exchange are still limited, but also because Chinese SF publishing has been rapidly expanding, with stories published not only in print and magazines, but online, on both literary platforms and social media. At the end of the day, it was more important to focus on the quality of the translation and editing, and on putting the thirteen works together so that Anglophone readers would have another portal into kehuan in English, to enjoy and hopefully, fire their desire to read more.\nI had envisioned working with one particular Chinese illustrator, whom I had worked with before, but due to timing, he was unavailable. I’m exceptionally glad he’s that in demand, and I do think that the artist we ended up using has turned out some fantastic cover art. Another thing I’m really pleased with is the story guides I’ve written to go with each story. My editor suggested that since the collection spans the past thirty years, and comes from such a different science fiction tradition, that I should put some context to them. I loved the idea, as the bulk of what I do is nonfiction cultural and sociocultural writing. However, I didn’t want to influence the reader’s view of the story before they discovered it for themselves, so we put the guides at the end of each work. I was inspired by my second edition of Octavia E. Butler’s Kindred and Other Stories. One of the objectives I went in to Sinopticon with was to help platform women kehuan authors, who are notoriously underrepresented in China. I was worried that if I chose a wholly female lineup, it would feel like a marginalized space, so I worked toward having an even split, just mainly looking at stories based on content and compatibility, and I’d ended up with women’s voices in over half of the works, as well as a wonderful foreword by another female writer.\nAre there elements that tie these stories together? Were there specific things you were looking for in your selection process? Or could this be seen as something of a “Best Of” anthology?\nThere weren’t really any criteria beyond “Are the authors Chinese? Are they writing what could be called science fiction? Do I think it is well written and enjoyable?” I’m an eclectic reader, so a wide range appeals to me, and I loved how broad the subject matters I found were, from time travel, genetic modification, and historical trauma, to political segregation, artificial intelligence, and space exploration. All those things are pretty common in SF, but the way they were employed to explore art, terrorism, even burial rites . . . made for an interesting selection. I’m not sure I could claim it’s a Best Of” anthology, but definitely an “Exceptionally Fine Collection From.” As I’ve said, the amount of new content turning up daily . . . I wanted to capture at least a snapshot of how this vibrant writing scene is tackling a society headed into the future with its foot on the accelerator.\nDue to my own experiences, I always want to give voice to the marginalized, so some of the writers included are perhaps ones that haven’t received a lot of recognition in English, whilst I also needed to tempt in some of the more well-known names, to get people to pick the book up in the first place.\nHowever, having now gone through this process once, and being better acquainted with the Chinese SF industry, I can be a lot more hands on in digging out the rough gems and bringing them to the world when the appropriate opportunities arise.\nWere there stories that you really liked, but that didn’t end up in the anthology?\nThere certainly were. I had really wanted to feature a piece by Xia Jia, but whilst I was building this collection, she was making her own selection for A Summer Beyond Your Reach. However, I’m delighted to have her involvement in another part of this book. There were also works from Han Song and Hao Jingfang, which were made up of multiple parts, which I absolutely fell in love with on first reading. I think they would have been amazing and really fun to translate. However, they were far too long for an anthology, and whilst I could have included single sections from them, it just didn’t feel right. Of course, there were authors like Chi Hui, Qi Yue, and others, whom I’ve had a chance to explore more since the manuscript was handed in, and I clasped my head thinking “OH! Why didn’t I try to include these stories!” but I don’t think I could have included everyone I wanted without the book turning into a multivolume monstrosity.\nIf someone will read only one story to see if the book is for them, which story would you tell them to read—and why?\nThat’s a very difficult question, and I’m not sure a fair one! They are all such different stories, and so not really comparable. I do have my personal favorites, but I’d say just pick a story whose title you like and go for it.\nScience fiction can challenge readers in different ways. Which story in the anthology challenges the reader the most?\nSeveral stories in the collection are definitely challenging, in different ways, and I do discuss this in my notes. “The Absolution Experiment” confronts difficult subjects, such as terrorism and the nature of justice, while “The Tide of Moon City” makes us think about the impact on everyday lives by geopolitical separatist disputes; and “The Return of Adam” challenges Confucianism as a paradigm of being Chinese. “Rendezvous: 1937” is not at all a comfortable read, but it’s important to think about, and remember, that period of history. The atrocities which were inflicted on China haven’t been covered as much as they need to be, and I feel that more people need to be made aware and to understand it.\nA fair amount of Western science fiction gets translated for Chinese language markets. Do some of the stories in Sinopticon stand in conversation with Western, Chinese, or other science fictional narratives in important ways?\nModern China is a very outward looking place. Whether it’s indie music or literature, creators take influences from around the world. A lot of the older generations have grown up reading classic Anglophone science fiction, which I get a feeling of in the tone of their works. One of the reasons I instantly found an affinity with the last story of the collection, is that it reminded me of the whimsy, humor, and wit of British science fiction, like as Douglas Adams and Doctor Who, both of which I am a huge fan of. The more literal translation of the work’s title is “The Bookshop at the End of the Universe,” and there are a few elements in it which are totally a love letter to the Hitchhiker’s cycle. I didn’t think the wibbly-wobbly quirkiness and humor in these works would translate well into other cultures, but it seems that the Doctor Who fandom in China is so large that the BBC ended up commissioning some great official art for the China merch, and one of the things that the zhai, or geeky circles, are talking about at the moment is a range of figurines inspired by Frankie and Benjy mouse, the pan dimensional beings who turned up in the first Hitchhiker’s series.\nAfter some consideration and discussion with the author, we decided to give it a different title rather than a direct translation—“Starship: Library,” was closer to the essence of the story. Whilst it has a lot of callbacks to that sort of . . . post-Python British sci-fi humor, it retains its roots in Chinese culture, reinterpreting one of Chinese mythology’s neglected goddesses as the world’s savior.\nA lot of the younger writers like A Que, have, like fans around the world, honed their skills in fan fiction, but where that conversation goes is the interesting part. His story, set in a zombie pandemic, has lots of little conversations with Max Brooks’ World War Z, especially in its film version. The zombie, or sangshi story is a quite recent genre in China (not to be confused with hopping jiangshi, which are China’s traditional undead monsters), and has grown completely out of exposure to Western zombie fiction. A Que does some very interesting things with the sangshi in his work, while at the same time breaking the fourth wall and engaging in dialogue with the common tropes of Hollywood cinema. It’s a very good example of Chinese storytelling’s ability to mix humor, action, and tragedy, not just on the same page, but often in the same paragraph.\nOn your website, you talk about “seeking out works by new emerging voices, that may be passed over by more conservative news agencies and publishers.” Who are some of the new and emerging voices that excite you most, and why?\nI’ve spoken a little bit about this in answer to the question about how Sinopticon came about. Now that I’m in a better position to highlight them, I am at least able to write about them, so they don’t completely pass global audiences by. What I’m excited about most are the net novelists who are creating works, in hundreds of new genres, the freedom it’s giving female writers to venture into previously male-dominated literary realms and create female-orientated writing . . . I would love to be able to translate some of these authors, or write about them more, but a lot of it depends on whether Anglophone publishers and platforms are willing to see potential in these diverse works, the importance for translators of color to represent their own heritage and be prepared to provide adequate resources to enable the work.\nIn your Publishers Weekly interview, you talk a bit about gatekeeping in the world of translation publishing, and a belief that non-Western translators would not do as good a job as Western translators. What are the best ways for editors and publishers to break this cycle, especially given that many editors may not speak the original languages of the work(s) in question?\nI think there needs to be a huge, top-down, and institutional change of attitudes in the Anglophone publishing world. To be less Western-centric, to recognize that it’s important for translators of color, of whatever ethnicity, to be able to work on titles from their own cultural heritage. It’s their right, and not an optional approach or magnanimous decision, to allow them to be part of presenting that culture to the world. I don’t mean, at all, that translators can’t work on texts from other cultures. In fact, the whole point of translating is to help people discover works beyond their own traditions. But there’s no excuse, when translating a writer whose work focuses on the culture or history of their ethnic origin, or when commissioning an opera or play that draws heavily from a non-Western culture, to not recruit at least some translators, actors, or consultants that represent that diversity, because there’s “none good enough.” Often the talent they need is not visible because the pool from which the selection is made pre-excludes them.\nI believe, especially when dealing with monumental works from a literary tradition other than their own, Western translators might just need to show some humility, step back, and acknowledge that, brilliant as they may be, it’s not really appropriate for them to be the umpteenth white person turning out yet another version of this work, and maybe someone whose heritage it is could bring more to the piece. There is often this backlash from the white establishment who complain about discrimination, which can act as this awful silencer, but if you are trying to be heard, sometimes it’s not ‘til you’re screaming that you can’t be ignored. But in truth, if you want a wider, more diverse scope of writing, you don’t just need more writers and translators of color, you need more commissioning editors, department heads, and executives of color.\nIs there anything else you’d really like readers to know about Sinopticon, the authors and their stories, or yourself and your work?\nI’ve always said, if you want to find out more about a nation’s fears and dreams, read their science fiction. Lots of social issues have emerged over the last couple of decades of China’s development, for instance, innovative high-tech solutions to these are part of the preoccupations of Chinese authors today. The book isn’t just about these ideas, it sheds light on the current state of China, its people, and society. It’s interesting to ponder on the fate of those who die in space, and how they are memorialized, but . . . it’s a little sadder to think about what happens when a migrant worker dies on the other side of a vast country like China from their hometown. It’s interesting to think about the informational arms race of enhanced intelligence, but a little close to the bone when you are considering what extra classes, societies, and nutritional supplements you need to impose on your child to prepare them for an exceptionally competitive job market in the future. Whilst a lot of the themes explored are universal, I think there is definitely an element of Sinopticon which is about translating China.\nAre you working on more projects like this one? What else do you have coming up that readers should know about?\nGive me a break please! I’ve lived and breathed this book for the past two years, and have finally got it ready to go to press. I have plenty of ideas for both fiction collections, nonfiction writings, and I have an essay on new Chinese fiction platforms in the Tordotcom collection The Way Spring Arrives, which will be out in March next year, but I think I want to take a little bit of time to reconnect with friends and family before I go back into the cocoon for my next book.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/ni_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Celebrating the Diversity of Chinese Culture: A Conversation with Xueting Christine Ni by Arley Sorg"}