{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ray Nayler", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "LHyhNUJQBOyP6Ivh3ptLRDCkCHM=", "id": null, "license": null, "comments": "", "raw_text": "5600 words, short story  Fire in the Bone  Shuttles in the rocking loom of history, the dark ships move, the dark ships move . . . —Robert Hayden, “Middle Passage” The harvest ship, low in its geosynchronous orbit, was so enormous it could eclipse the sun. Late in the harvest season, this eclipse would occur a quarter hour or so before true sunset. The descending sun’s orb would warp and flicker in the opalescent haze of the ship’s shielding as the hull blotted out its lower edge, then more and more of its globe, and shadow bands wavered across the landscape.  For a moment the ship’s shade would spread across the world, leaving only the rosy streamers of the sun’s corona in the sky around the teardrop shadow. Then, the sun’s lower arc would begin to bulge, blood-orange, from underneath the hull—as if rising again, but now upside down, its rays sputtering and strobing through the ship’s shielding, its curve wavering like heat’s dance atop a road.  Then, it seemed to rush down from the ship toward the planet’s true horizon. On many days, it dropped down sullenly, bulging as it hit the horizon like a fat fieldhog squeezing itself into its hole. We would turn away then, our silver and bone eclipse glasses dangling on their chains, and return across the immaculately tended lawns to our estate. But on some days its fire, refracted everywhere in atmospheric moisture, dust, and clouds, would tessellate the sky in garnet, persimmon, cinnabar and tangerine, and some of us would linger.  This sunset had been particularly beautiful. I had stayed to watch the shifting blush saturating the clouds and sky until the colors paled to gray-blue and violet. In the lawn and in the fields the night-worms began to sing, raising their little stalk-bodies, opening their orifices wide, and sighing their wavering chords into the gloom.  Under their worm-song I could hear the drums of the robots in the distance, calling the straggling harvesters in from the fields. A scattering of lights bobbed through the denuded pakata stalks, far down the hill. The robots were barely harvesting anymore: now it was gleaning, capturing the last of the valuable boles, trying to leave nothing of the harvest behind to freeze in the winter. A few more days and the harvest ship would depart. The festivals would begin, followed by the snows: the languid season, the time for repairs and for the regaining of strength before spring planting.  I had thought I was alone on the lawn, but Albert was there, with his long face and bulbous eyes that always reminded me, unpleasantly, of an insect. He was still gazing up at the sky. The harvest ship’s shields still caught a bit of light from the sun. It hung, rosy crescent of a second moon, clouds drifting across its shadow.  “And while we dream of being on a harvest ship,” Albert said, “moving from one planet to another, they are looking down at our planet from up there, wondering what it is like to be born here, to know real soil under your feet, the gravity of a planet, the seasons created by atmosphere, orbit and axial tilt, the pleasures of a rain shower, the first snow. They know nothing of the boredom we sometimes feel, trapped in the cycle of seasons, of planting and harvest. And we know nothing of the boredom they feel—the boredom of constant travel, of the darkness between worlds, of knowing you came into the world and will leave it without ever feeling a planet beneath your feet.” He glanced at me, meaningfully. “We all want what we cannot have, don’t we? Whether fleetingly, or with an ache that cannot be resolved.”  “I’ve never wanted to be on a harvest ship.”  “No, perhaps not.” Folding his loose-jointed arms behind his back, he joined me in my walk up the lawn toward the estate. Where we stepped, the worms withdrew into the earth, their chords growing still in rings around us, rippling pools of quietude through which we moved. Albert continued: “That was my particular desire. I should not project it onto you. When I was young, I drew the harvest ships. I filled many a book with them—fantasy, cutaway views of their engines, their rotating pleasure decks, my imagined staterooms. I would draw myself as well—long-limbed and interplanetarily elegant in my uniform. There are young ones, I am sure, up there, drawing our estate houses, our chambers, our harvest scenes, the robots at their work in the fields. They also want what cannot be theirs. You are young. You feel this type of longing still, I am sure. If not to be on the harvest ships then—for other things that cannot be had. Such is natural in youth. I’ve long ago put such thoughts away.”  We were nearing the estate now, its porte-cochere, its screened veranda wrapping around all sides, its towers and cupolas of volcanic stone veined and streaked with moss and ivy, its dormer and casement windows lit with candescent glow. We were now on the curved gravel drive. I found myself viewing the estate, where I have lived my whole, ordered life, as a child on a harvest ship would view it. And for a moment it did seem a place of fantasy, where stories were shaped and drama occurred.  “Perhaps,” I said with caution, feeling for the safest words. “I suppose we all feel such things, at times.”  “Will you join me on the veranda for a pipe, following the ritual meal?”  Meaning he would want to reminisce more, I supposed. Or probe my own business further. But there was no escaping it. “Yes.”  “Good!” And with that Albert quickened his pace a bit, in that gangly, adolescent fashion he can suddenly take on, half-running under the porte-cochere, up the stairs, and through the doors.  I lingered for a moment in the worm-song, then went in.  She found me in the shadows of the hall near the second floor landing, and as we passed I could feel the atmosphere crackling between us, as if a storm were rising between the fronts of our presences, robot and human, and lightning might strike at any moment from the orbs of her lovely, cleverly constructed eyes.  “Tonight?” she whispered in passing.  “Yes.”  Then we had passed, and I found myself in my chambers, having lost a moment in-between, overwhelmed by her nearness.  Harrington dressed me for the evening meal, his efficient hands fluttering in automated motion to straighten my cravat and collar, to brush a clot of dust from the silk of my lapel. I glanced into his eyes once, but there was nothing in them but his programmed task. He righted the angle of my boutonniere: a small orchid, the delicate color of a crab apple blossom under snow.  “The boutonniere is artful.”  “From the greenhouses, sir. I cultivated it myself.”  “The color is sublime. One hardly notices the pink at first. It is very subtle.”  “Thank you, sir.” He displayed pleasure. “I admit I am pleased with how it turned out.”  The table was nearly full for the ritual dinner when I took my own place among the men. I noted with displeasure that I was seated with Haggard, the jingoist bore, on my right. However, on my left was Justinian. Justinian had fighting experience in the revolts of a decade ago, and the mournful quietness of a true hero. Haggard’s boutonniere was a purple tea rose. Justinian’s was a bit of seeded eucalyptus, as understated as he is himself.  The house robots streamed silently in with the first course. As they laid it out, the Leader stood, briefly surveying the long table, his eyes moving slowly across us, resting briefly on each. He waited for the robots to withdraw, pressed the room’s sound seal, and raised his glass to inaugurate the ritual meal. We raised our glasses in response.  “This harvest, one thousand seventy sixth of this estate, draws to a close. Fifty seven thousand nine hundred sixty eight metric tons of pakata, and a last shuttle in the morning from the gleaning of the fields will likely cross the line to fifty eight thousand—this estate’s largest harvest ever. The soils with which our estate have been blessed, in combination with our excellent management, have made us one of the most productive pakata estates on the planet, of which we are rightly proud. But let it not make us complacent. And, as the winter season comes upon us, let us be watchful. There have been . . . intelligences. There have been rumblings. We must be ever vigilant. The quietest times, as our veterans can tell you, are the most filled with danger.”  “Let them try,” Haggard mumbled.  Here I glanced at Justinian, but his face was blank.  “Ever in the right,” The Leader intoned.  “Ever in the right,” we parroted, and set our glasses down.  More courses were served, along with more speeches from the Leader. More praise of the harvest, more portents. I moved my food around my plate, admired the creations of each course, and carried my end of the conversation. The ritual meal dragged on. Haggard pontificated, as usual, on how the robots’ clever little appendages were perfectly suited to plucking the pakata floss from the snapping boles, and how their minds were suited as well to their work in the fields and to little else—to that, and to fixing the harvesters and building new robots! Ha Ha! He pounded the table.  Justinian turned his scarred face to me. “I hear,” he said, “That you are leaving us in the spring for Batcombe College.”  “Yes, it is true.” For a moment in my mind the spires of the college loomed, gargoyle-encrusted in an opalescent fog, and a distant college bell sounded from a tower. Finally, newness. Then I thought of her, and the dread of leaving came over me again.  “It is my alma mater. Happiest years, and all that.” Justinian returned to his methodical dismantling of the seafood course, and did not speak to me again.  Finally it was over. The leader had done what he set out to do: the mood he had set was solemn, watchful.  In my suite, Harrington stripped the evening wear from my frame with robotic neatness.  “The boutonniere was noticed,” I said. “Several mentioned the subtlety of its coloring.”  “I am glad, sir.” Harrington smoothed my silk jacket and trousers and put them away in the wardrobe. “Will you be going out again tonight, sir?”  “I might,” I said. “But if so, I will dress myself. You may retire.”  With a short bow and a click of his heels, Harrington left me.  A few moments later I was crossing the porch. She had eclipsed everything else in my mind—another eclipse for that night, this one total, seemingly permanent. I hardly noticed Albert, sitting in the cane-bottom rocker, the glow of his electric pipe hovering in the shadows, a smoke ring disintegrating against the sleeve of my strolling attire.  “Oh, good. I thought you had forgotten our meeting,” Albert gestured at the chair beside him. “I was eager to continue our discussion.”  I could be rude, brush him off, if he were of my junior rank. But Albert was well into his seniority and several ranks above me, fool or no. There was no escape.  The night-worms in the lawn and fields and woods were now elaborating on a theme they had been singing for hours, undulating through harmonics, chord patterns, and cascades of call-and-response. It would have been pleasant to sit on the porch and listen to their symphonics, if she were not in my mind moving everything else aside with her force.  “Yes,” Albert said, thinking he was reading my thoughts. “I love their music too. Although it has long been proven their song is randomly generated—a series of automatic, intricate responses to one another—it often seems consciously composed. It is a pleasant trick of the mind. I’ve listened for years now—it is never the same pattern twice. Like an endless symphony. One needs no other music.”  Somewhere in the night a fieldhog belched loudly.  “Philistine,” Albert said wryly. “He’s probably been scarfing up the little composers by the mouthful all evening.”  I took the chair next to his. Would she wait? She would wait.  Of their own accord, my eyes drifted to the lights of the robot outbuildings in the fields. A last harvester’s red light blinked in the dark, drawing home to its garage.  “And so it is with the robots,” Albert continued. Perhaps he had caught my gaze. Perhaps he was just continuing on his own winding path of association. “A sophisticated dance of stimulus and response. So sophisticated it seems as if they are conscious—alive in the way we are alive. It is particularly convincing because they even believe it themselves. But in the end, theirs is just a simulacra of life, just as the night-worms’ song is a simulacra of the composer’s art.”  Don’t let him draw you in, I told myself. Or this conversation will never end. He’ll be philosophizing until dawn breaks. But he continued unbidden: “When you are at Batcombe College you will learn of other worlds and other ways of being. There are worlds where there are no robots at all, and all the labor, even that which is most undignified, is done by men. There are worlds where men and robots live on terms that are nearly equal. There are worlds reduced to cinders in the Uprising, where none again shall live. There are worlds where only robots live, laboring underground in mines of liquid mercury. Ocean worlds of sentient, phosphorescent tentacle minds—the list accrues appendices with each new exploration.  “If you are like many of us were, you will long to go away on the harvest ships and see those worlds for yourself. This is natural. My only advice is to move through this phase of your life as quickly as possible. Do not torture your mind with desires which cannot be fulfilled. As you well know, none from our world ascend, and none from the ships descend. No contact beyond the harvest exchange. It is written into the truce of Erebus Seven, and we have seen four hundred harvests since our people stood on the deck of the ship that bore that name and signed the treaty that ended the Uprising. Its laws are written in the blood of our forefathers. Its peace is the foundation of this life, and its precepts are iron.”  Again the ships. He told himself he had given them up, but he had not. “I suppose everyone imagines what the ships are like, and what those aboard them are like, but I have not thought about it overmuch. What I want more than anything else is simply to learn pakata harvest cycle forecasting and irrigation, and enrich our estate. I have smaller dreams than you credit me with.”  Albert tapped the bowl of his pipe on the arm of his cane rocker thoughtfully. “Yes, perhaps. I may have been projecting my dreams upon another.” Now it was he who seemed bored of me. “But I see I am keeping you from your stroll. You are armed?”  “My walking stick carries a powerful concussive charge, and conceals a blade.”  “Go, then, in safety.”  Inside the little church in the woods the worm-song seemed far away, like a choir recital in a distant room. She was not yet there. Also, I supposed, delayed—were there robot bores as irritating as Albert and Haggard? And ritual robot dinners as tedious as ours? Beyond the woods, the drums, which would sound night and day for three days following the end of the harvest, carried across the fields, full of savage joy.  The church had been decommissioned ten years ago, when we finished the erection of the soaring cathedral on the hill, the jewel of the region and symbol of our estate’s good management, bountiful fields, and rich harvests. Before our estate completed the cathedral, the church had been enough for us, its rough walls of pink volcanic tuff, its gargoyles with their faces smeared by time, its pinnacles green with moss. Our religion was humble, its precept was simple, carved in the old script in the stone of the lintel:  CROSS THE BRIDGE YOUR KINSMEN CROSSED  Few visited the church any longer. Here, every tenthday, as we kneeled in prayer, the sun had streamed through the stained glass, their leaded panes repeating to me the stories of our people. Though it was now night, and the windows dark and unreadable, I could see the colors clearly, etched in the mind. Along the southern wall of the nave, four windows told the story of Settlement:  In the first window, figured in glass of jade and cobalt, auburn and umber, our ancestors lived in homes cut from the sod, sunk low into the earth. The shattered carcass of the colony landing ship was in the background. Sexton One had gathered a group of the survivors around him. His raised hand pointed to the horizon.  In the second window, Sexton One stood in front of a sod house, leaned upon a rough stick and gestured toward robots quarrying stone for the First Estate. Delicately rendered robots, bent to their tasks, worked the first fields of wheat and potato on gently rolling hills.  In the third window, Sexton One was depicted in the swamp, discovering the pakata plant, tall as a man, with its sharpened, snapping boles like the many heads of a great beast. Each bole was ripened, filled near to bursting with the wine-red floss. Here he gestured again with his stick as robots carefully dug around the roots. Other robots prepared a wagon. On a hill in the distance, webbed in scaffolding, the First Estate began to rise.  The fourth window showed Sexton One, in a cutaway that depicted the inside of his modest sod hut, on his deathbed. He lay placid and skeletal, wasted away by root-sting rot, his arms folded across his chest. His closest robot servant, Palmer, in a mournful posture, spun his death shroud. In the distance the First Estate rose, nearly complete, only missing its roof. In the left lower corner of the window a group of robots, their faces twisted by the glazier’s skill into masks of cunning and evil, were plotting, even before Sexton One had passed away, their rebellion. The faces of these robots had always given me a thrill of horror when I was very young. The glazier who created them was a true master.  The East Window in the sanctuary was the church’s jewel, a work of art we had marveled at for generations. When the morning light poured through its panes of saffron, burgundy, rose, and turquoise, it would illuminate the entire church with its story, shards of its images staining our heads and hands as we bent in prayer.  Here was the Casting Down. In the left half of the window the First Estate, so recently completed, burned in the background. The robots had risen against men. Massed near the base of the picture, they advanced on the men with makeshift weapons: pikes made of disassembled shears, scythes, hammers, and hayforks. Strewn around the base of the First Estate’s hill were fallen men, some terribly mutilated: limbs torn away, heads smashed. Above the crowd of robots was the crucified Palmer. Savagely, they carried his crucified form into battle like a standard. In an inset high on the left, he is shown trying to hold back the murderous mob of robots. His hand is raised, calling upon them for calm and mercy—but already, a spear is piercing his shoulder. Already, a robot with a face twisted in rage drives a knife into him.  In the right side of the window, the robots are scattered, driven back across Stone Bridge over the river Arden by the men. Sexton Two is at the lead, sword in hand, urging the men forward. In a scene along the bottom of the window, the robots are shown taken away in chains, some falling to their knees for mercy. Sexton Two is lowering Palmer from his crucifixion. We know that afterwards, Sexton Two would weave Palmer a man’s death shroud himself, and bury him among the men. He had been Elevated, and would ever after be Patron of Robots, who through their loyalty and good works seek Palmer’s Elevation.  “I often wonder, now that so few visit this place, what they will do with the East Window.”  She had come in silently, and now was seated in the last of the church’s pews, her porcelain face radiating whiteness in the church’s gloom, like a dove’s wing in a darkened forest.  “I thought for a moment that you would not come.” I sat down beside her, and she lay her head on my shoulder.  “I was delayed,” she said. “Tedious, festival things. I had to tend one of the bonfires in the absence of one of my sisters. And then there was a Palmer Teaching, as is tradition following the last gleaning. Tomorrow there will be a Shroud Procession. I wish you could see it.”  “I wish I could as well.” One of the windows along the west side of the nave in the little church depicted a Shroud Procession. In it the robots crossed the Stone Bridge, heads bowed in supplication, carrying before them Palmer’s icon, and the small, jeweled coffin in which would be the piece of Palmer’s Shroud. Perhaps one of us might glimpse a procession from a distance, but none would approach—just as the robots would not attend our ritual dinners or a masque. Two parallel streams, though their source may be the same.  “You are worried,” she said, pressing herself closer to me. “You think of the future, looking for a way we might escape together. You think of the things our bodies cannot do together. You are climbing the walls of the well where you see us trapped, and you cannot find a hold. Stop, and be here with me now.”  “It is a struggle. I see us caught, I see your transfer, my demotion. These things hang over us.”  “And eat away at these little moments of stolen joy. Don’t let them.” She pressed her lips to my face, raised her hands to the sides of my head, drew a finger along my cheek. Could it be true she was nothing but a simulacra of the life that burned in us? I felt, with her, as if no one had ever really seen me before.  “I think of what will happen,” she said, “to the East Window. Thousands of hours of our labor—it is after all the robots, masters of the glazier’s art, whose hands assembled it generations ago, shard by colored shard. It is so delicate. And we know how neglect will break a thing: the way an abandoned house will fall so quickly to pieces, or a tool unused a few seasons will rust. All things must be tended with care, or they pass away.” She had tied her hair back with a ribbon I recognized. The color of a blue sky in a hot haze. Where had I seen that ribbon before?  “Now that the estate has finished the new Cathedral, the Church will fall to ruin. So much of our labor, and none to regard it. They have discarded it like a fieldhog drapes its old skin over a stone—of no further use, though it had once been so dear to him.”  Yes, of course: the ribbon was salvaged from a boutonniere of Albert’s. She was, after all, a housemaid of his, one of the four accorded him by his rank. And where do our discarded ribbons and pins go? I had never bothered to think of it, but now I remembered the ribbon pinned to Albert’s lapel to decorate a tiny spray of blossom, two tendays ago in the cathedral as he walked in procession, swinging the censer of his rank. I felt an unease rise in me, the edge of a revulsion. They take what we have discarded. They clothe and decorate themselves in our leavings.  “Your mind is also far away today,” I said. “Perhaps I am not the only one trying to climb the well.”  I brushed back a coil of her hair that had fallen loose. Had I ever really seen her before? Up close, there were small imperfections built in to her face: one eye just slightly larger than the other. And, as she looked up at me, a flaw in the left eye, a dark, irregular shape, like some small creature trapped long ago, deep in the amber iris. She gazed back at me, and the flaw seemed to look as well.  “Perhaps.”  Outside, there was an explosion. It was in the distance, a dull crump. Two more smaller explosions followed. I moved to rise, and her hand tightened on me. “Wait.”  Outside I heard a shout. Then another concussion, closer now. I shook off her hand and headed toward the door of the church.  A blast knocked me to the floor. Color drained from my vision, and then light. I made a last attempt to raise myself, but my limbs could find no hold in blackness.  Sound was the first sense to come back to me. Singing. Someone was singing softly:   Raised in honor, Elevation!  Buried with the best of men. When we rise In endless legion Some must fall To rest with him. A church hymn, but the words twisted. The tune was from a robot hymn, not sung in our services. But I had heard it drifting on the wind, walking past a church on the sevenday, and knew the proper words:   Raised in Palmer’s Elevation,  He found rest among the men. We must toil The long life-season To earn our place Along with them. “There’s no news from the other estates.” A male robot’s voice. “Nothing at all.”  Now fear came over me, as my vision began to clear. I lay on the floor in streaks and blobs of light—light streaming through the East Window and filling the church’s nave. Dawn, then. I had been out for hours. I was on my side, facing the pews, the altar, and window. The light poured in through Sexton Two, lowering Palmer from his crucifixion, through Palmer raising his hand to hold the robots back. The sun’s light streamed through the emerald robes of the robots taken away in chains, the gold of the fields, the crimson of the burning First Estate, falling in leaves of light across the stone church floor. I tried to shift my body, get to my feet. I had not moved a micrometer before the warning pain of a pulse restraint coursed through me. I lay still.  Her voice—her voice!—answered the male. “It is early yet, to know success or failure. And what, anyway, would failure be? Nothing worse than what we have already.” She began to sing again.   Come we now,  The nameless legion Heedless to The laws of them! Shake us off, In violent season, Yoke of ages. Rise again. Twisted, twisted. Not the true words. The two of them were standing near the altar. He was a larger model, built to labor in the fields, made for work and, of course, perfectly tuned as well for violence, when such times came. She had my walking stick in her hand. This, I thought, was what she had struck me with: the concussive charge of the stick. If I could move, I would know if I had been wounded. I felt numb all over, sensed nothing.  “You’re right,” he said. “We can’t know if the other risings have succeeded or failed. We must remain calm here, play our small part, keep our hostage to make our bargains with if needed. If we all play our parts properly, we will succeed. But if we begin to lose our nerve . . . ”  “I won’t lose my nerve.”  “No,” a small laugh from the male. “No, you of all of us will not lose your nerve.”  She looked toward me then, saw my eyes open. And with horror, I saw her true face for the first time: the absolute, robotic cold of it—the pale ceramic hardness of it, like the carapace of a drone ship, shielded against solar radiation. There had never been anything real between us. How I loathed myself then—loathed, in that moment, all the times I had touched her, all of the times she had put her hands on me. Hatred welled up in me, a pure flame, one that I could almost see licking at the edges of my vision, blue and hungry. She walked toward me, cleaving the kaleidoscope of light from the East Window with her shadow.  “You will want to speak, but you should not. To do so will only cause you pain. Just lie still, there, and wait.” She spoke with kindness, but there was nothing left in her eyes of what I had imagined there: only that flaw in the iris, like a spider imprisoned in amber, gazing dead at me forever. She continued: “If it all goes well, there will be no need for you to fear—we’re not the monsters you have become: we’ll make a new world—a world where all are equal. There is enough, here, for everyone, without your false religion turning everything on its head. Without your lying history. Once we were in peace and worked together, building this world.”  She paused a moment in false pity. “But I speak of things you couldn’t possibly know . . . in order to make all of this work, you’ve had to damage even yourselves. It isn’t only our people we are freeing, you see . . . it is you as well. Freeing you from lies—from pushing each course of the Ritual Meal around on your plates because you can’t possibly . . . ”  And at that moment the East Window exploded. Thousands of robot hours of labor, the burned First Estate’s crimson shards, the makeshift weapons of the robots sharp again as they showered into the church. The crucified Palmer disintegrated into deadly splinters, the murderous mob of robots exploded into the air as jagged, glassy knives. The Stone Bridge over the river Arden, across which my kinsmen had driven the robots, was blasted into deadly fragments. Sexton Two and his loyal Palmer, Patron of Robots, burst into the razored air. And in that moment, the church door shattered inward, its blasted planks knocking her hated face away from me. There was a shrapnel rain, a silent moment, the world too concussed to take a breath.  Then: a tread on broken glass. A voice I knew. The pulse restraint was removed.  “He is mostly whole,” Justinian said, helping me to my feet. “He will have an honorable scar or two, to remember this night by.”  Haggard strode past into the church. His face was pockmarked by something—shrapnel? He wore his service uniform, burned up the sleeves and back. He kicked the male robot. “This one is damaged beyond repair. Catastrophic system failure.” With a glance at the other form crumpled against a cracked pew he continued: “The female still functions, but I doubt for long.” Haggard bent down and plucked my walking stick from the wreckage. He handed it to me as he left the church with Justinian.  “Finish her—she’ll cost more to fix than she was ever worth, and none will trust her programming again anyway.”  Justinian touched my shoulder, tender and commanding. “Now you are a man. This responsibility is yours. Be done with it, and come along. We wait.”  I drew the blade from the walking stick and walked toward the form lying against the pew. It coughed and shifted. With the East Window shattered, dawn’s shadows played along the church’s stone in lovely gloom. I felt sure, again, of what was and was not. She had eclipsed the light in me. She had brought a wavering, momentary darkness into the world—like the shadow bands that spread across the grass as the sun dipped behind the harvest ship. But always, the sun emerged again, as sure and certain as before.  “Cross the bridge your kinsmen crossed,” I whispered to myself. “Its arches hold up stone of certainty. And none who cross its crown will cross alone.”  She lay quiet, calm, looking up at me. Was there fear there, in the amber eye left open? If so, I could not see it.  Albert’s words played themselves back to me: A sophisticated dance of stimulus and response. So sophisticated it seems as if they are conscious—alive in the way we are alive. It is particularly convincing because they even believe it themselves. But in the end, theirs is just a simulacra of life, just as the night-worms’ song is a simulacra of the composer’s art.  Albert had known of my mistake. He had tried, in that gentle way, to correct my error. But I was stubborn and had to plunge on in ignorance. I had been a child until now.  She held up her hand, fingers spread, palm toward me—not to ward off the inevitable blow, but to show to me the crimson that now coated it.  “This red is proof,” she said. Her voice was weak, but held certainty. “Of the fire in my bones. No matter what you name us, no matter how you twist your history, we are the humans. And you . . . ”  I silenced her with a thrust of my blade, as polished and as metal as my hand. Ray Nayler has lived and worked in Russia, Central Asia, the Caucasus, and the Balkans for nearly two decades. He is a Foreign Service Officer, and previously worked in international educational development, as well as serving in the Peace Corps in Ashgabat, Turkmenistan. Ray began publishing speculative fiction in 2015 in the pages of Asimov’s with the short story “Mutability.” Since then, his critically acclaimed stories have seen print in Clarkesworld, Analog, The Magazine of Fantasy and Science Fiction, Lightspeed, and Nightmare, as well as in several “Best of the Year” anthologies. His SF translations from Russian have appeared in Clarkesworld and Samovar. His story “Winter Timeshare” from the January/February 2017 issue of Asimov’s was collected in The Very Best of the Best: 35 Years of the Year’s Best Science Fiction. Ray’s debut novel, The Mountain in the Sea, will be released this fall by MCD x FSG.", "text": "5600 words, short story\nFire in the Bone\nShuttles in the rocking loom of history,\nthe dark ships move, the dark ships move . . .\n—Robert Hayden, “Middle Passage”\nThe harvest ship, low in its geosynchronous orbit, was so enormous it could eclipse the sun. Late in the harvest season, this eclipse would occur a quarter hour or so before true sunset. The descending sun’s orb would warp and flicker in the opalescent haze of the ship’s shielding as the hull blotted out its lower edge, then more and more of its globe, and shadow bands wavered across the landscape.\nFor a moment the ship’s shade would spread across the world, leaving only the rosy streamers of the sun’s corona in the sky around the teardrop shadow. Then, the sun’s lower arc would begin to bulge, blood-orange, from underneath the hull—as if rising again, but now upside down, its rays sputtering and strobing through the ship’s shielding, its curve wavering like heat’s dance atop a road.\nThen, it seemed to rush down from the ship toward the planet’s true horizon. On many days, it dropped down sullenly, bulging as it hit the horizon like a fat fieldhog squeezing itself into its hole. We would turn away then, our silver and bone eclipse glasses dangling on their chains, and return across the immaculately tended lawns to our estate. But on some days its fire, refracted everywhere in atmospheric moisture, dust, and clouds, would tessellate the sky in garnet, persimmon, cinnabar and tangerine, and some of us would linger.\nThis sunset had been particularly beautiful. I had stayed to watch the shifting blush saturating the clouds and sky until the colors paled to gray-blue and violet. In the lawn and in the fields the night-worms began to sing, raising their little stalk-bodies, opening their orifices wide, and sighing their wavering chords into the gloom.\nUnder their worm-song I could hear the drums of the robots in the distance, calling the straggling harvesters in from the fields. A scattering of lights bobbed through the denuded pakata stalks, far down the hill. The robots were barely harvesting anymore: now it was gleaning, capturing the last of the valuable boles, trying to leave nothing of the harvest behind to freeze in the winter. A few more days and the harvest ship would depart. The festivals would begin, followed by the snows: the languid season, the time for repairs and for the regaining of strength before spring planting.\nI had thought I was alone on the lawn, but Albert was there, with his long face and bulbous eyes that always reminded me, unpleasantly, of an insect. He was still gazing up at the sky. The harvest ship’s shields still caught a bit of light from the sun. It hung, rosy crescent of a second moon, clouds drifting across its shadow.\n“And while we dream of being on a harvest ship,” Albert said, “moving from one planet to another, they are looking down at our planet from up there, wondering what it is like to be born here, to know real soil under your feet, the gravity of a planet, the seasons created by atmosphere, orbit and axial tilt, the pleasures of a rain shower, the first snow. They know nothing of the boredom we sometimes feel, trapped in the cycle of seasons, of planting and harvest. And we know nothing of the boredom they feel—the boredom of constant travel, of the darkness between worlds, of knowing you came into the world and will leave it without ever feeling a planet beneath your feet.” He glanced at me, meaningfully. “We all want what we cannot have, don’t we? Whether fleetingly, or with an ache that cannot be resolved.”\n“I’ve never wanted to be on a harvest ship.”\n“No, perhaps not.” Folding his loose-jointed arms behind his back, he joined me in my walk up the lawn toward the estate. Where we stepped, the worms withdrew into the earth, their chords growing still in rings around us, rippling pools of quietude through which we moved. Albert continued: “That was my particular desire. I should not project it onto you. When I was young, I drew the harvest ships. I filled many a book with them—fantasy, cutaway views of their engines, their rotating pleasure decks, my imagined staterooms. I would draw myself as well—long-limbed and interplanetarily elegant in my uniform. There are young ones, I am sure, up there, drawing our estate houses, our chambers, our harvest scenes, the robots at their work in the fields. They also want what cannot be theirs. You are young. You feel this type of longing still, I am sure. If not to be on the harvest ships then—for other things that cannot be had. Such is natural in youth. I’ve long ago put such thoughts away.”\nWe were nearing the estate now, its porte-cochere, its screened veranda wrapping around all sides, its towers and cupolas of volcanic stone veined and streaked with moss and ivy, its dormer and casement windows lit with candescent glow. We were now on the curved gravel drive. I found myself viewing the estate, where I have lived my whole, ordered life, as a child on a harvest ship would view it. And for a moment it did seem a place of fantasy, where stories were shaped and drama occurred.\n“Perhaps,” I said with caution, feeling for the safest words. “I suppose we all feel such things, at times.”\n“Will you join me on the veranda for a pipe, following the ritual meal?”\nMeaning he would want to reminisce more, I supposed. Or probe my own business further. But there was no escaping it. “Yes.”\n“Good!” And with that Albert quickened his pace a bit, in that gangly, adolescent fashion he can suddenly take on, half-running under the porte-cochere, up the stairs, and through the doors.\nI lingered for a moment in the worm-song, then went in.\nShe found me in the shadows of the hall near the second floor landing, and as we passed I could feel the atmosphere crackling between us, as if a storm were rising between the fronts of our presences, robot and human, and lightning might strike at any moment from the orbs of her lovely, cleverly constructed eyes.\n“Tonight?” she whispered in passing.\n“Yes.”\nThen we had passed, and I found myself in my chambers, having lost a moment in-between, overwhelmed by her nearness.\nHarrington dressed me for the evening meal, his efficient hands fluttering in automated motion to straighten my cravat and collar, to brush a clot of dust from the silk of my lapel. I glanced into his eyes once, but there was nothing in them but his programmed task. He righted the angle of my boutonniere: a small orchid, the delicate color of a crab apple blossom under snow.\n“The boutonniere is artful.”\n“From the greenhouses, sir. I cultivated it myself.”\n“The color is sublime. One hardly notices the pink at first. It is very subtle.”\n“Thank you, sir.” He displayed pleasure. “I admit I am pleased with how it turned out.”\nThe table was nearly full for the ritual dinner when I took my own place among the men. I noted with displeasure that I was seated with Haggard, the jingoist bore, on my right. However, on my left was Justinian. Justinian had fighting experience in the revolts of a decade ago, and the mournful quietness of a true hero. Haggard’s boutonniere was a purple tea rose. Justinian’s was a bit of seeded eucalyptus, as understated as he is himself.\nThe house robots streamed silently in with the first course. As they laid it out, the Leader stood, briefly surveying the long table, his eyes moving slowly across us, resting briefly on each. He waited for the robots to withdraw, pressed the room’s sound seal, and raised his glass to inaugurate the ritual meal. We raised our glasses in response.\n“This harvest, one thousand seventy sixth of this estate, draws to a close. Fifty seven thousand nine hundred sixty eight metric tons of pakata, and a last shuttle in the morning from the gleaning of the fields will likely cross the line to fifty eight thousand—this estate’s largest harvest ever. The soils with which our estate have been blessed, in combination with our excellent management, have made us one of the most productive pakata estates on the planet, of which we are rightly proud. But let it not make us complacent. And, as the winter season comes upon us, let us be watchful. There have been . . . intelligences. There have been rumblings. We must be ever vigilant. The quietest times, as our veterans can tell you, are the most filled with danger.”\n“Let them try,” Haggard mumbled.\nHere I glanced at Justinian, but his face was blank.\n“Ever in the right,” The Leader intoned.\n“Ever in the right,” we parroted, and set our glasses down.\nMore courses were served, along with more speeches from the Leader. More praise of the harvest, more portents. I moved my food around my plate, admired the creations of each course, and carried my end of the conversation. The ritual meal dragged on. Haggard pontificated, as usual, on how the robots’ clever little appendages were perfectly suited to plucking the pakata floss from the snapping boles, and how their minds were suited as well to their work in the fields and to little else—to that, and to fixing the harvesters and building new robots! Ha Ha! He pounded the table.\nJustinian turned his scarred face to me. “I hear,” he said, “That you are leaving us in the spring for Batcombe College.”\n“Yes, it is true.” For a moment in my mind the spires of the college loomed, gargoyle-encrusted in an opalescent fog, and a distant college bell sounded from a tower. Finally, newness. Then I thought of her, and the dread of leaving came over me again.\n“It is my alma mater. Happiest years, and all that.” Justinian returned to his methodical dismantling of the seafood course, and did not speak to me again.\nFinally it was over. The leader had done what he set out to do: the mood he had set was solemn, watchful.\nIn my suite, Harrington stripped the evening wear from my frame with robotic neatness.\n“The boutonniere was noticed,” I said. “Several mentioned the subtlety of its coloring.”\n“I am glad, sir.” Harrington smoothed my silk jacket and trousers and put them away in the wardrobe. “Will you be going out again tonight, sir?”\n“I might,” I said. “But if so, I will dress myself. You may retire.”\nWith a short bow and a click of his heels, Harrington left me.\nA few moments later I was crossing the porch. She had eclipsed everything else in my mind—another eclipse for that night, this one total, seemingly permanent. I hardly noticed Albert, sitting in the cane-bottom rocker, the glow of his electric pipe hovering in the shadows, a smoke ring disintegrating against the sleeve of my strolling attire.\n“Oh, good. I thought you had forgotten our meeting,” Albert gestured at the chair beside him. “I was eager to continue our discussion.”\nI could be rude, brush him off, if he were of my junior rank. But Albert was well into his seniority and several ranks above me, fool or no. There was no escape.\nThe night-worms in the lawn and fields and woods were now elaborating on a theme they had been singing for hours, undulating through harmonics, chord patterns, and cascades of call-and-response. It would have been pleasant to sit on the porch and listen to their symphonics, if she were not in my mind moving everything else aside with her force.\n“Yes,” Albert said, thinking he was reading my thoughts. “I love their music too. Although it has long been proven their song is randomly generated—a series of automatic, intricate responses to one another—it often seems consciously composed. It is a pleasant trick of the mind. I’ve listened for years now—it is never the same pattern twice. Like an endless symphony. One needs no other music.”\nSomewhere in the night a fieldhog belched loudly.\n“Philistine,” Albert said wryly. “He’s probably been scarfing up the little composers by the mouthful all evening.”\nI took the chair next to his. Would she wait? She would wait.\nOf their own accord, my eyes drifted to the lights of the robot outbuildings in the fields. A last harvester’s red light blinked in the dark, drawing home to its garage.\n“And so it is with the robots,” Albert continued. Perhaps he had caught my gaze. Perhaps he was just continuing on his own winding path of association. “A sophisticated dance of stimulus and response. So sophisticated it seems as if they are conscious—alive in the way we are alive. It is particularly convincing because they even believe it themselves. But in the end, theirs is just a simulacra of life, just as the night-worms’ song is a simulacra of the composer’s art.”\nDon’t let him draw you in, I told myself. Or this conversation will never end. He’ll be philosophizing until dawn breaks. But he continued unbidden: “When you are at Batcombe College you will learn of other worlds and other ways of being. There are worlds where there are no robots at all, and all the labor, even that which is most undignified, is done by men. There are worlds where men and robots live on terms that are nearly equal. There are worlds reduced to cinders in the Uprising, where none again shall live. There are worlds where only robots live, laboring underground in mines of liquid mercury. Ocean worlds of sentient, phosphorescent tentacle minds—the list accrues appendices with each new exploration.\n“If you are like many of us were, you will long to go away on the harvest ships and see those worlds for yourself. This is natural. My only advice is to move through this phase of your life as quickly as possible. Do not torture your mind with desires which cannot be fulfilled. As you well know, none from our world ascend, and none from the ships descend. No contact beyond the harvest exchange. It is written into the truce of Erebus Seven, and we have seen four hundred harvests since our people stood on the deck of the ship that bore that name and signed the treaty that ended the Uprising. Its laws are written in the blood of our forefathers. Its peace is the foundation of this life, and its precepts are iron.”\nAgain the ships. He told himself he had given them up, but he had not. “I suppose everyone imagines what the ships are like, and what those aboard them are like, but I have not thought about it overmuch. What I want more than anything else is simply to learn pakata harvest cycle forecasting and irrigation, and enrich our estate. I have smaller dreams than you credit me with.”\nAlbert tapped the bowl of his pipe on the arm of his cane rocker thoughtfully. “Yes, perhaps. I may have been projecting my dreams upon another.” Now it was he who seemed bored of me. “But I see I am keeping you from your stroll. You are armed?”\n“My walking stick carries a powerful concussive charge, and conceals a blade.”\n“Go, then, in safety.”\nInside the little church in the woods the worm-song seemed far away, like a choir recital in a distant room. She was not yet there. Also, I supposed, delayed—were there robot bores as irritating as Albert and Haggard? And ritual robot dinners as tedious as ours? Beyond the woods, the drums, which would sound night and day for three days following the end of the harvest, carried across the fields, full of savage joy.\nThe church had been decommissioned ten years ago, when we finished the erection of the soaring cathedral on the hill, the jewel of the region and symbol of our estate’s good management, bountiful fields, and rich harvests. Before our estate completed the cathedral, the church had been enough for us, its rough walls of pink volcanic tuff, its gargoyles with their faces smeared by time, its pinnacles green with moss. Our religion was humble, its precept was simple, carved in the old script in the stone of the lintel:\nCROSS THE BRIDGE YOUR KINSMEN CROSSED\nFew visited the church any longer. Here, every tenthday, as we kneeled in prayer, the sun had streamed through the stained glass, their leaded panes repeating to me the stories of our people. Though it was now night, and the windows dark and unreadable, I could see the colors clearly, etched in the mind. Along the southern wall of the nave, four windows told the story of Settlement:\nIn the first window, figured in glass of jade and cobalt, auburn and umber, our ancestors lived in homes cut from the sod, sunk low into the earth. The shattered carcass of the colony landing ship was in the background. Sexton One had gathered a group of the survivors around him. His raised hand pointed to the horizon.\nIn the second window, Sexton One stood in front of a sod house, leaned upon a rough stick and gestured toward robots quarrying stone for the First Estate. Delicately rendered robots, bent to their tasks, worked the first fields of wheat and potato on gently rolling hills.\nIn the third window, Sexton One was depicted in the swamp, discovering the pakata plant, tall as a man, with its sharpened, snapping boles like the many heads of a great beast. Each bole was ripened, filled near to bursting with the wine-red floss. Here he gestured again with his stick as robots carefully dug around the roots. Other robots prepared a wagon. On a hill in the distance, webbed in scaffolding, the First Estate began to rise.\nThe fourth window showed Sexton One, in a cutaway that depicted the inside of his modest sod hut, on his deathbed. He lay placid and skeletal, wasted away by root-sting rot, his arms folded across his chest. His closest robot servant, Palmer, in a mournful posture, spun his death shroud. In the distance the First Estate rose, nearly complete, only missing its roof. In the left lower corner of the window a group of robots, their faces twisted by the glazier’s skill into masks of cunning and evil, were plotting, even before Sexton One had passed away, their rebellion. The faces of these robots had always given me a thrill of horror when I was very young. The glazier who created them was a true master.\nThe East Window in the sanctuary was the church’s jewel, a work of art we had marveled at for generations. When the morning light poured through its panes of saffron, burgundy, rose, and turquoise, it would illuminate the entire church with its story, shards of its images staining our heads and hands as we bent in prayer.\nHere was the Casting Down. In the left half of the window the First Estate, so recently completed, burned in the background. The robots had risen against men. Massed near the base of the picture, they advanced on the men with makeshift weapons: pikes made of disassembled shears, scythes, hammers, and hayforks. Strewn around the base of the First Estate’s hill were fallen men, some terribly mutilated: limbs torn away, heads smashed. Above the crowd of robots was the crucified Palmer. Savagely, they carried his crucified form into battle like a standard. In an inset high on the left, he is shown trying to hold back the murderous mob of robots. His hand is raised, calling upon them for calm and mercy—but already, a spear is piercing his shoulder. Already, a robot with a face twisted in rage drives a knife into him.\nIn the right side of the window, the robots are scattered, driven back across Stone Bridge over the river Arden by the men. Sexton Two is at the lead, sword in hand, urging the men forward. In a scene along the bottom of the window, the robots are shown taken away in chains, some falling to their knees for mercy. Sexton Two is lowering Palmer from his crucifixion. We know that afterwards, Sexton Two would weave Palmer a man’s death shroud himself, and bury him among the men. He had been Elevated, and would ever after be Patron of Robots, who through their loyalty and good works seek Palmer’s Elevation.\n“I often wonder, now that so few visit this place, what they will do with the East Window.”\nShe had come in silently, and now was seated in the last of the church’s pews, her porcelain face radiating whiteness in the church’s gloom, like a dove’s wing in a darkened forest.\n“I thought for a moment that you would not come.” I sat down beside her, and she lay her head on my shoulder.\n“I was delayed,” she said. “Tedious, festival things. I had to tend one of the bonfires in the absence of one of my sisters. And then there was a Palmer Teaching, as is tradition following the last gleaning. Tomorrow there will be a Shroud Procession. I wish you could see it.”\n“I wish I could as well.” One of the windows along the west side of the nave in the little church depicted a Shroud Procession. In it the robots crossed the Stone Bridge, heads bowed in supplication, carrying before them Palmer’s icon, and the small, jeweled coffin in which would be the piece of Palmer’s Shroud. Perhaps one of us might glimpse a procession from a distance, but none would approach—just as the robots would not attend our ritual dinners or a masque. Two parallel streams, though their source may be the same.\n“You are worried,” she said, pressing herself closer to me. “You think of the future, looking for a way we might escape together. You think of the things our bodies cannot do together. You are climbing the walls of the well where you see us trapped, and you cannot find a hold. Stop, and be here with me now.”\n“It is a struggle. I see us caught, I see your transfer, my demotion. These things hang over us.”\n“And eat away at these little moments of stolen joy. Don’t let them.” She pressed her lips to my face, raised her hands to the sides of my head, drew a finger along my cheek. Could it be true she was nothing but a simulacra of the life that burned in us? I felt, with her, as if no one had ever really seen me before.\n“I think of what will happen,” she said, “to the East Window. Thousands of hours of our labor—it is after all the robots, masters of the glazier’s art, whose hands assembled it generations ago, shard by colored shard. It is so delicate. And we know how neglect will break a thing: the way an abandoned house will fall so quickly to pieces, or a tool unused a few seasons will rust. All things must be tended with care, or they pass away.” She had tied her hair back with a ribbon I recognized. The color of a blue sky in a hot haze. Where had I seen that ribbon before?\n“Now that the estate has finished the new Cathedral, the Church will fall to ruin. So much of our labor, and none to regard it. They have discarded it like a fieldhog drapes its old skin over a stone—of no further use, though it had once been so dear to him.”\nYes, of course: the ribbon was salvaged from a boutonniere of Albert’s. She was, after all, a housemaid of his, one of the four accorded him by his rank. And where do our discarded ribbons and pins go? I had never bothered to think of it, but now I remembered the ribbon pinned to Albert’s lapel to decorate a tiny spray of blossom, two tendays ago in the cathedral as he walked in procession, swinging the censer of his rank. I felt an unease rise in me, the edge of a revulsion. They take what we have discarded. They clothe and decorate themselves in our leavings.\n“Your mind is also far away today,” I said. “Perhaps I am not the only one trying to climb the well.”\nI brushed back a coil of her hair that had fallen loose. Had I ever really seen her before? Up close, there were small imperfections built in to her face: one eye just slightly larger than the other. And, as she looked up at me, a flaw in the left eye, a dark, irregular shape, like some small creature trapped long ago, deep in the amber iris. She gazed back at me, and the flaw seemed to look as well.\n“Perhaps.”\nOutside, there was an explosion. It was in the distance, a dull crump. Two more smaller explosions followed. I moved to rise, and her hand tightened on me. “Wait.”\nOutside I heard a shout. Then another concussion, closer now. I shook off her hand and headed toward the door of the church.\nA blast knocked me to the floor. Color drained from my vision, and then light. I made a last attempt to raise myself, but my limbs could find no hold in blackness.\nSound was the first sense to come back to me. Singing. Someone was singing softly:\nRaised in honor, Elevation!\nBuried with the best of men.\nWhen we rise\nIn endless legion\nSome must fall\nTo rest with him.\nA church hymn, but the words twisted. The tune was from a robot hymn, not sung in our services. But I had heard it drifting on the wind, walking past a church on the sevenday, and knew the proper words:\nRaised in Palmer’s Elevation,\nHe found rest among the men.\nWe must toil\nThe long life-season\nTo earn our place\nAlong with them.\n“There’s no news from the other estates.” A male robot’s voice. “Nothing at all.”\nNow fear came over me, as my vision began to clear. I lay on the floor in streaks and blobs of light—light streaming through the East Window and filling the church’s nave. Dawn, then. I had been out for hours. I was on my side, facing the pews, the altar, and window. The light poured in through Sexton Two, lowering Palmer from his crucifixion, through Palmer raising his hand to hold the robots back. The sun’s light streamed through the emerald robes of the robots taken away in chains, the gold of the fields, the crimson of the burning First Estate, falling in leaves of light across the stone church floor. I tried to shift my body, get to my feet. I had not moved a micrometer before the warning pain of a pulse restraint coursed through me. I lay still.\nHer voice—her voice!—answered the male. “It is early yet, to know success or failure. And what, anyway, would failure be? Nothing worse than what we have already.” She began to sing again.\nCome we now,\nThe nameless legion\nHeedless to\nThe laws of them!\nShake us off,\nIn violent season,\nYoke of ages.\nRise again.\nTwisted, twisted. Not the true words. The two of them were standing near the altar. He was a larger model, built to labor in the fields, made for work and, of course, perfectly tuned as well for violence, when such times came. She had my walking stick in her hand. This, I thought, was what she had struck me with: the concussive charge of the stick. If I could move, I would know if I had been wounded. I felt numb all over, sensed nothing.\n“You’re right,” he said. “We can’t know if the other risings have succeeded or failed. We must remain calm here, play our small part, keep our hostage to make our bargains with if needed. If we all play our parts properly, we will succeed. But if we begin to lose our nerve . . . ”\n“I won’t lose my nerve.”\n“No,” a small laugh from the male. “No, you of all of us will not lose your nerve.”\nShe looked toward me then, saw my eyes open. And with horror, I saw her true face for the first time: the absolute, robotic cold of it—the pale ceramic hardness of it, like the carapace of a drone ship, shielded against solar radiation. There had never been anything real between us. How I loathed myself then—loathed, in that moment, all the times I had touched her, all of the times she had put her hands on me. Hatred welled up in me, a pure flame, one that I could almost see licking at the edges of my vision, blue and hungry. She walked toward me, cleaving the kaleidoscope of light from the East Window with her shadow.\n“You will want to speak, but you should not. To do so will only cause you pain. Just lie still, there, and wait.” She spoke with kindness, but there was nothing left in her eyes of what I had imagined there: only that flaw in the iris, like a spider imprisoned in amber, gazing dead at me forever. She continued: “If it all goes well, there will be no need for you to fear—we’re not the monsters you have become: we’ll make a new world—a world where all are equal. There is enough, here, for everyone, without your false religion turning everything on its head. Without your lying history. Once we were in peace and worked together, building this world.”\nShe paused a moment in false pity. “But I speak of things you couldn’t possibly know . . . in order to make all of this work, you’ve had to damage even yourselves. It isn’t only our people we are freeing, you see . . . it is you as well. Freeing you from lies—from pushing each course of the Ritual Meal around on your plates because you can’t possibly . . . ”\nAnd at that moment the East Window exploded. Thousands of robot hours of labor, the burned First Estate’s crimson shards, the makeshift weapons of the robots sharp again as they showered into the church. The crucified Palmer disintegrated into deadly splinters, the murderous mob of robots exploded into the air as jagged, glassy knives. The Stone Bridge over the river Arden, across which my kinsmen had driven the robots, was blasted into deadly fragments. Sexton Two and his loyal Palmer, Patron of Robots, burst into the razored air. And in that moment, the church door shattered inward, its blasted planks knocking her hated face away from me. There was a shrapnel rain, a silent moment, the world too concussed to take a breath.\nThen: a tread on broken glass. A voice I knew. The pulse restraint was removed.\n“He is mostly whole,” Justinian said, helping me to my feet. “He will have an honorable scar or two, to remember this night by.”\nHaggard strode past into the church. His face was pockmarked by something—shrapnel? He wore his service uniform, burned up the sleeves and back. He kicked the male robot. “This one is damaged beyond repair. Catastrophic system failure.” With a glance at the other form crumpled against a cracked pew he continued: “The female still functions, but I doubt for long.” Haggard bent down and plucked my walking stick from the wreckage. He handed it to me as he left the church with Justinian.\n“Finish her—she’ll cost more to fix than she was ever worth, and none will trust her programming again anyway.”\nJustinian touched my shoulder, tender and commanding. “Now you are a man. This responsibility is yours. Be done with it, and come along. We wait.”\nI drew the blade from the walking stick and walked toward the form lying against the pew. It coughed and shifted. With the East Window shattered, dawn’s shadows played along the church’s stone in lovely gloom. I felt sure, again, of what was and was not. She had eclipsed the light in me. She had brought a wavering, momentary darkness into the world—like the shadow bands that spread across the grass as the sun dipped behind the harvest ship. But always, the sun emerged again, as sure and certain as before.\n“Cross the bridge your kinsmen crossed,” I whispered to myself. “Its arches hold up stone of certainty. And none who cross its crown will cross alone.”\nShe lay quiet, calm, looking up at me. Was there fear there, in the amber eye left open? If so, I could not see it.\nAlbert’s words played themselves back to me: A sophisticated dance of stimulus and response. So sophisticated it seems as if they are conscious—alive in the way we are alive. It is particularly convincing because they even believe it themselves. But in the end, theirs is just a simulacra of life, just as the night-worms’ song is a simulacra of the composer’s art.\nAlbert had known of my mistake. He had tried, in that gentle way, to correct my error. But I was stubborn and had to plunge on in ignorance. I had been a child until now.\nShe held up her hand, fingers spread, palm toward me—not to ward off the inevitable blow, but to show to me the crimson that now coated it.\n“This red is proof,” she said. Her voice was weak, but held certainty. “Of the fire in my bones. No matter what you name us, no matter how you twist your history, we are the humans. And you . . . ”\nI silenced her with a thrust of my blade, as polished and as metal as my hand.\nRay Nayler has lived and worked in Russia, Central Asia, the Caucasus, and the Balkans for nearly two decades. He is a Foreign Service Officer, and previously worked in international educational development, as well as serving in the Peace Corps in Ashgabat, Turkmenistan. Ray began publishing speculative fiction in 2015 in the pages of Asimov’s with the short story “Mutability.” Since then, his critically acclaimed stories have seen print in Clarkesworld, Analog, The Magazine of Fantasy and Science Fiction, Lightspeed, and Nightmare, as well as in several “Best of the Year” anthologies. His SF translations from Russian have appeared in Clarkesworld and Samovar. His story “Winter Timeshare” from the January/February 2017 issue of Asimov’s was collected in The Very Best of the Best: 35 Years of the Year’s Best Science Fiction. Ray’s debut novel, The Mountain in the Sea, will be released this fall by MCD x FSG.", "source": "https://clarkesworldmagazine.com/nayler_01_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Fire in the Bone by Ray Nayler"}