{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Brian Ames", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "SYROqUtq8aX+koXJlv3sJRMSkDA=", "id": null, "license": null, "comments": "", "raw_text": "990 words, short story  Debris Ensuing from a Supervortex  SD is back, guiding Blake to another memory. There is a grin on SD’s lips. Blake’s medicine smiles as wide as a black-green sky spinning over a storm. But this is a good good good thing, this bird’s mouth that feeds its young his recollections back one by one. The worms of foundation laid upon Blake’s tongue.  Imagine that you are he. You live in a world you have forgotten. Every day people and places assume familiarity with you, but you aren’t having it. A female person called “Ginger,” for example, expresses some tenderness toward you. You fail to remember. You are taken through a place whose walls and angles are wholly foreign. People who populate it seem to know where they are, but you don’t.  What Blake once knew flew away on a violent night wind.  Put yourself into the date that happened. Search for a clue. Find out why Blake’s forgotten more than you’ve ever learned. Discover who this SD character is. Linger in a whorl of his fingerprint, suckle at the dugs of his DNA, worry through the pattern of his loss. Then you’ll know. Then you can help him, too, as SD does, or tries to do.  The night Blake’s roof came off began as most did, with his return from work. The night his walls were sucked skyward featured a light supper of spinach salad, grilled tilapia wrapped in a tortilla with hot sauce, yellow peppers and onions, a cold beer. The night his furniture, wall hangings, stove, carpet, washer and dryer, hot water heater, books, autographed baseball collection, weight set, lamps, blender, alarm clock, refrigerator, rake and broom, toothbrush, candy dish, Johnny Cash record albums, commemorative program for the 1987 World Series, nose-hair trimmer, fireplace flew five ways off into space had him situated in a nest of undisturbed progression of positive trajectory, on an unmolested life path suddenly fucked by chance.  All of those things suctioned into vortex. All that mattered nabbed by an F4 funnel thief. A spinning highwayman of random act stole his possessions. And in his possessions, the fundamentals of his memory.  The news channels had made their seductive promise of dangerous weather. The sky had darkened and thrown its cloud-to-ground lightning. Thunder pealed urgently, proximately. A supercell, crushing air into heat, warped heaven. Windchimes on Blake’s porch toned merrily, anomalously. Rain gathered then dropped.  As everyone living in flyover country knows as well as the palms of their own hands, a supercell thunderstorm takes the name mesocyclone when the National Weather Service, using Doppler radar, detects cyclonically rotating air. A tornadic vortex signature appears on the radar image as an area within the storm with changing wind directions of high periodicity. A tornado warning goes out to those in the path. Sirens go like mad. The lost-sheep television bleats.  F4: 207-260 mph on the Fujita Scale. Devastating damage: Houses and other small structures can be razed entirely; automobiles are propelled through the air. Memories are sucked into the supervortex. Blown bookpages explode into flames.  Blake’s failure to appreciate his evolving emergency results from his fascination with bright lights, shiny things. Lightning is smack to him. Watching it strike is akin to filling a vein. Mainline this energy. Let these synapses crackle with delicious dopamine fulminations. Hope for a bolt out of the blue.  But too late—Blake’s ears pop like pistol shots as pressure plummets. Through the torn membranes of his eardrums: the runaway locomotive roar, shingles tearing away, rafters splintering, wallboard cracking, electrical wiring hissing free from its stays, copper pipe shrieking apart, glass bursting into spray, the vast universe-filling rise of everything and all.  The loss, and then the quiet as the sky opens into calm, brilliant blue.  Blake peers over the lip of the bathtub. His mind is a rubblescape like that which unfolds before him. He can scarcely blink as his stares out from his sanctuary. He remembers that this is a tub, that water will drain from a tub in a certain coriolis direction depending on whether the observer is in the Northern or Southern hemisphere. But as memories go, that’s about it. Sooner or later, emergency workers show up looking for the dead and living. There is question—even today—as to which camp Blake is in.  But SD will help Blake find his memories, yes? Though Blake’s possessions are strewn across three counties, SD will guide him to them—and the recollections dwelling in each found object—over the course of several months. A broken picture frame discovered in a field near St. Paul puts Blake in mind of a man who was his father. A fragment of crystal at a crossroads near Blackjack makes him remember a college date that went unexpectedly well. There is the spare Michelin tire half submerged in Peruque Creek—Blake remembers being promoted at his firm.  “Have I shown you this?” SD asks, and Blake sees the weather-soaked, bloated pages of a collection of short stories by Jeffery Deaver. Blake smiles. He had a daughter—or was it a niece?—once.  But SD must exact a price, too. His services don’t come free. Blake’s memory finder, the redeemer of his mind, must also bring back those bitternesses, those aches, those turn-aways we’d rather all forget.  For Blake was a dog-kicker. A yellow-piss-soaked sycophant in the hierarchy of his corporation. A liar, cheat, thief. An apostate. A black-hearted cynic. A denier of culpability. A finger-pointer. A mocker of principles and a hater of fellows.  All of these things, too, must and will come back. SD will reveal them as Blake’s lost things are found.  We can all judge whether he would have been better off dead, blown upward into the vortex. But only SD can help him navigate.  Self diagnoser. Sad doppelganger. Sin doll. Systolic diastolicist. Simulacrum demon. Sharp-tongued dagger. Sainted dalliance. Stained dumpling. Shattering destroyer. So-called doorway. Sabertoothed dancer. Skull donkey. Sabotage dilettante. Spiritual desperado. Sagging dopefiend. Sex-crazed deathmonger. Suck dream. Surely damned.  Shit Disturber. Brian Ames writes from St. Charles County, Missouri. He is the author of the novel Salt Lick (Pocol Press, 2007) and three short-fiction collections: Smoke Follows Beauty (Pocol Press, 2002), Head Full of Traffic (Pocol Press, 2004) and Eighty-Sixed (Word Riot Press, 2004). His fourth collection, As Many Hands as God, is forthcoming from Pocol Press in 2008.", "text": "990 words, short story\nDebris Ensuing from a Supervortex\nSD is back, guiding Blake to another memory. There is a grin on SD’s lips. Blake’s medicine smiles as wide as a black-green sky spinning over a storm. But this is a good good good thing, this bird’s mouth that feeds its young his recollections back one by one. The worms of foundation laid upon Blake’s tongue.\nImagine that you are he. You live in a world you have forgotten. Every day people and places assume familiarity with you, but you aren’t having it. A female person called “Ginger,” for example, expresses some tenderness toward you. You fail to remember. You are taken through a place whose walls and angles are wholly foreign. People who populate it seem to know where they are, but you don’t.\nWhat Blake once knew flew away on a violent night wind.\nPut yourself into the date that happened. Search for a clue. Find out why Blake’s forgotten more than you’ve ever learned. Discover who this SD character is. Linger in a whorl of his fingerprint, suckle at the dugs of his DNA, worry through the pattern of his loss. Then you’ll know. Then you can help him, too, as SD does, or tries to do.\nThe night Blake’s roof came off began as most did, with his return from work. The night his walls were sucked skyward featured a light supper of spinach salad, grilled tilapia wrapped in a tortilla with hot sauce, yellow peppers and onions, a cold beer. The night his furniture, wall hangings, stove, carpet, washer and dryer, hot water heater, books, autographed baseball collection, weight set, lamps, blender, alarm clock, refrigerator, rake and broom, toothbrush, candy dish, Johnny Cash record albums, commemorative program for the 1987 World Series, nose-hair trimmer, fireplace flew five ways off into space had him situated in a nest of undisturbed progression of positive trajectory, on an unmolested life path suddenly fucked by chance.\nAll of those things suctioned into vortex. All that mattered nabbed by an F4 funnel thief. A spinning highwayman of random act stole his possessions. And in his possessions, the fundamentals of his memory.\nThe news channels had made their seductive promise of dangerous weather. The sky had darkened and thrown its cloud-to-ground lightning. Thunder pealed urgently, proximately. A supercell, crushing air into heat, warped heaven. Windchimes on Blake’s porch toned merrily, anomalously. Rain gathered then dropped.\nAs everyone living in flyover country knows as well as the palms of their own hands, a supercell thunderstorm takes the name mesocyclone when the National Weather Service, using Doppler radar, detects cyclonically rotating air. A tornadic vortex signature appears on the radar image as an area within the storm with changing wind directions of high periodicity. A tornado warning goes out to those in the path. Sirens go like mad. The lost-sheep television bleats.\nF4: 207-260 mph on the Fujita Scale. Devastating damage: Houses and other small structures can be razed entirely; automobiles are propelled through the air. Memories are sucked into the supervortex. Blown bookpages explode into flames.\nBlake’s failure to appreciate his evolving emergency results from his fascination with bright lights, shiny things. Lightning is smack to him. Watching it strike is akin to filling a vein. Mainline this energy. Let these synapses crackle with delicious dopamine fulminations. Hope for a bolt out of the blue.\nBut too late—Blake’s ears pop like pistol shots as pressure plummets. Through the torn membranes of his eardrums: the runaway locomotive roar, shingles tearing away, rafters splintering, wallboard cracking, electrical wiring hissing free from its stays, copper pipe shrieking apart, glass bursting into spray, the vast universe-filling rise of everything and all.\nThe loss, and then the quiet as the sky opens into calm, brilliant blue.\nBlake peers over the lip of the bathtub. His mind is a rubblescape like that which unfolds before him. He can scarcely blink as his stares out from his sanctuary. He remembers that this is a tub, that water will drain from a tub in a certain coriolis direction depending on whether the observer is in the Northern or Southern hemisphere. But as memories go, that’s about it. Sooner or later, emergency workers show up looking for the dead and living. There is question—even today—as to which camp Blake is in.\nBut SD will help Blake find his memories, yes? Though Blake’s possessions are strewn across three counties, SD will guide him to them—and the recollections dwelling in each found object—over the course of several months. A broken picture frame discovered in a field near St. Paul puts Blake in mind of a man who was his father. A fragment of crystal at a crossroads near Blackjack makes him remember a college date that went unexpectedly well. There is the spare Michelin tire half submerged in Peruque Creek—Blake remembers being promoted at his firm.\n“Have I shown you this?” SD asks, and Blake sees the weather-soaked, bloated pages of a collection of short stories by Jeffery Deaver. Blake smiles. He had a daughter—or was it a niece?—once.\nBut SD must exact a price, too. His services don’t come free. Blake’s memory finder, the redeemer of his mind, must also bring back those bitternesses, those aches, those turn-aways we’d rather all forget.\nFor Blake was a dog-kicker. A yellow-piss-soaked sycophant in the hierarchy of his corporation. A liar, cheat, thief. An apostate. A black-hearted cynic. A denier of culpability. A finger-pointer. A mocker of principles and a hater of fellows.\nAll of these things, too, must and will come back. SD will reveal them as Blake’s lost things are found.\nWe can all judge whether he would have been better off dead, blown upward into the vortex. But only SD can help him navigate.\nSelf diagnoser. Sad doppelganger. Sin doll. Systolic diastolicist. Simulacrum demon. Sharp-tongued dagger. Sainted dalliance. Stained dumpling. Shattering destroyer. So-called doorway. Sabertoothed dancer. Skull donkey. Sabotage dilettante. Spiritual desperado. Sagging dopefiend. Sex-crazed deathmonger. Suck dream. Surely damned.\nShit Disturber.\nBrian Ames writes from St. Charles County, Missouri. He is the author of the novel Salt Lick (Pocol Press, 2007) and three short-fiction collections: Smoke Follows Beauty (Pocol Press, 2002), Head Full of Traffic (Pocol Press, 2004) and Eighty-Sixed (Word Riot Press, 2004). His fourth collection, As Many Hands as God, is forthcoming from Pocol Press in 2008.", "source": "https://clarkesworldmagazine.com/ames_01_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Debris Ensuing from a Supervortex by Brian Ames"}