{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Fiona Moore", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "1DExhDtmgmOwE6AKz3HbpwOZuow=", "id": null, "license": null, "comments": "", "raw_text": "3620 words, short story  The Lori  The problem with sentient battle tanks is their drivers.  Realizing this after (unfortunately not before) the Battle of Kuching, the military quietly shifted their AI strategies toward botnets and other nonsocial intelligents that can take down the utilities and welfare systems of entire regions without worrying too much about the consequences. Sentient battle tanks quietly joined ornithopters and weather control in the listicles of the thirty strangest technological propositions of the past two centuries. And that, for most people, was the end of it.  Except for Corporal Atticus Cooper, the driver of Kursk 118-200.  Cooper grew up liking any kind of story involving magic swords or horses or dragons that choose brave heroes and take them on adventures. He went through a long phase of secretly pretending he was Elric of Melniboné. He had owned a Staffordshire terrier, or something that looked like one anyway.  But after a few weeks he had carefully packed up the dog’s food, encouraged the dog into her crate, put both dog and food into his father’s pickup and driven to the local shelter, leaving her there with no explanation.  At the age of eighteen he’d done something similar, enlisting and putting as many miles between himself and the place where he grew up as possible. He signed up as a driver, because he liked machines, and because it was a necessary job that was fun and interesting, but not likely to get him killed.  He’d tried to improve himself and do better than what was expected of him. But his lovers never stayed long, and usually described him as “obsessive.” He never managed to form close friendships with his squad mates either, for all that he would buy them rounds, go out of his way to do favors for any one of them that he so much as thought needed a helping hand. Cooper didn’t seem to care.  All of which added up to the sort of profile that gets people recruited as drivers for the battle tank program.  But, as Clausewitz or Sun Tzu or one of the other writers that the sort of people who develop battle tank programs are fond of selectively quoting said, no plan survives contact with the enemy.  And when Cooper woke up in a hospital in Manila, six weeks after the Battle of Kuching, the first thing on his mind was finding Kursk.  Cooper managed to curb his first impulse, to check himself out of the hospital immediately. Mostly because it turned out comas don’t work like they do in the movies, and he had to learn to walk properly again. But he put the enforced recovery time to good use, finding out what had happened to Kursk.  By an immense stroke of luck, Kursk was on the missing list. So, he hadn’t been destroyed at Kuching, nor had he, like most of the survivors, been quietly retired, his processor removed and consciousness transferred to storage until someone figured out what to do with them. A further stroke of luck was that the authorities were not looking for any of the small number of missing tanks. A lack of resources, perhaps, or a desire to sweep the whole thing under the rug.  Nobody seemed to be in too much of a hurry to get Cooper back either.  Making a few educated guesses—he was Kursk’s driver, and nobody knew Kursk better—Cooper began checking maps of the area around Kuching, and, through local news services, looking for any items that might be a sighting of a lone battle tank. He traced a path in-country, heading southeast from the city into territory that looked, on the map, to be mostly filled with palm oil plantations, national parks, farms, kampungs, and just plain jungle. As to what was going on: the UN forces had all left and the civil war had been officially declared over, but that statement was disputed by both the local terrorists/activists/revolutionaries/freedom fighters, and the owners and workers for the agribusiness conglomerates who were still their main targets.  Which, Cooper decided, was another good reason to go there.  Cooper ended his period as a cooperative patient in the hospital and officially went out to have two further weeks of medical leave before rejoining his unit, which had been shipped off to Louisiana. That meant it would be at least three weeks, and probably a lot longer, before someone considered him AWOL.  He caught a commercial flight to Brunei, and then persuaded an NCO in the RMAF to put him on a plane to Kuching (commercial flights suspended, of course, except those to do with the agribusinesses). Might have been safer to take a boat along the coast, but would have definitely taken longer, and Cooper didn’t want to risk losing track of Kursk.  Not after that last heartbreaking moment of consciousness, fire all around him, orders screaming in his ear to abort mission and abandon the tank. Gritting his teeth and ploughing forward, over the crunch of flesh and bone, because no way he was going to leave Kursk. Not ever.  Once on the ground, Cooper activated long-neglected skills. He hitched rides in-country with the trucks carrying laborers and managers out to the plantations (though not with the occasional military vehicles, where he might get asked hard questions) or hiked along the road. He camped out in the jungle or accepted hospitality in kampungs, sleeping in storage huts in exchange for money or labor.  His linguistic abilities were limited at first, but they got better with practice, and he also discovered that he would get the answers he wanted if he just asked if they’d seen the Lori.  For the people of Sarawak, thanks to a long period of British colonial activity, a lori is what Cooper would normally have called a truck. Kursk didn’t look much like one. But then, he didn’t look much like a conventional tank either: needing only a single human operator and being intended for use in unconventional, principally urban, combat situations, he was small, little enough to fit in a goods elevator or trundle down a narrow alley, and roughly trapezoidal. Someone who’d never seen a sentient battle tank before might not realize what he was, and, even if they did, might not have the vocabulary to cover it. So, for lack of a better word, Kursk was the Lori.  And the Lori, Cooper discovered, was a legend. He might be glimpsed between the trees, or the crunch of tracks over dead twigs might be heard. More rarely, there were stories: Of children and teenagers saved from kidnap or assault by a tank bursting from the trees at the right moment, of a baby saved from drowning after falling into a rice paddy. Of a farmer’s pigs being driven off into the forest for some unknown reason, the whole community turning out to find them in a cheerfully grumbling mob.  Then there were the other ones.  Huts burned to the waterline, the exits guarded so the inhabitants couldn’t get out. A group of plantation workers who’d come over from New Guinea, attacked and slaughtered on the road before they reached their destination. Random disappearances of managers, agribusiness developers, tax collectors: the people who’d told Cooper that one hadn’t been entirely able to resist a grim joke about that last category of victim.  Cooper didn’t judge.  Kursk’s basic impulse was to protect his friends against his enemies. So, Cooper thought as he sheltered in the back of a rattling sentient truck that was stoically ploughing through the rain, Kursk needed him. Needed someone to show him the right people to protect, and the right ones to attack.  The magic sword always needs a guy to wield it.  Cooper felt his world settle into a kind of balance.  “I’m coming to join you, Kursk,” he said aloud. Him and Kursk, the knight and his steed. Living in a hut on the edge of town, waiting to be called into action when danger threatened. Or traveling. Living off the land, going where they were needed.  Then everything would be all right between them.  “I’ll make it up to you for what happened,” he said. “We’re a team. We’ll be okay.”  Cooper got off the truck when it slowed at a plantation checkpoint, hiked down the road to the nearest kampung. Chickens and pigs scattering, old ladies carrying bundles of firewood, a group of teenagers looking up from the motorbike they were disassembling. Cooper greeted them in his imperfect Malay, got taken by a volunteer—a boy-band-handsome kid with full lips and long dark lashes, Cooper bet he was popular—to the religious building. Which turned out to be a church, of the evangelical variety, where the preacher spoke better English than Cooper’s Malay.  Yes, he could stay the night in exchange for fixing the church’s sound system. Yes, there was also curry to be had, courtesy of the handsome kid’s family. The Lori?  Why did he want to know about the Lori?  Cooper rolled with it. No reason, just an interest in local folklore. He’d heard a lot of stories wandering through the area, wondered if there were some here. Tried hard to project an image of being a half-crazed foreign mythology junkie looking for weird legends to put in a book or something.  The villagers settled down and began talking instead about crops and weather and the agribusiness conglomerate’s failure to deliver on their promise that the palm oil plantation would boost the local economy. After a brief muttered aside about how non-Christians would believe any old nonsense, the preacher also dropped the subject of the Lori and joined in.  That evening, after Cooper had ostentatiously turned in for the night, he snuck out of the church building and crept to the edge of town, under cover of darkness. Settled down under a tree with big roots to wait.  He was prepared to do that for a few nights, if necessary, but either he struck lucky, or the tank knew something he didn’t.  After a couple of hours of dozing among the roots, he woke and sprang into a crouch, hearing the noise of the caterpillar tracks on the vegetation, seeing a dim square shape against the rising moon.  “Kursk,” he half-laughed, half-sobbed, overwhelmed with emotions he couldn’t name. “Kursk, boy. It’s me, Coop.”  He ran toward the shape, his hands finding the rough, dented bodywork, caressing the pattern of rivets and bolts, moved upward, found the hatch, wrestled with it briefly. The lock still recognized his palm-print.  With a triumphant yell, he fell inside, closed the door, swearing and shouting in delight as the familiar jolting motion in the padded operator seat engaged him. Like those training runs, bouncing along rough terrain, firing on targets in movie-set fake city streets, seeing his score racking up at the bottom of the monitor.  They were a team again. They were like the Magnificent Seven, the Lori and the Lori’s driver, and . . .  The tank stopped, like a dog scenting the wind.  Cooper held his breath, waiting to see where Kursk went.  The tank started forward again, heading for the road to the plantation.  After a minute, the logic resolved. On the monitors, Cooper could make out a small group of figures, their heads muffled in scarves, carrying something awkward. Turning up the gain on the night vision suggested the scarves were red and black—the colors of the anti-capitalist faction—and, while he couldn’t make out what they were carrying, his money was on an IED.  “Way to go, Kursk,” Cooper said, as the tank bore down on the group.  And then, drove on past it.  “What the hell?”  But Kursk wasn’t listening. He was picking up speed, rumbling into the plantation. Cooper fiddled with the monitor settings.  Kursk was signaling to him that this was the enemy, that Cooper needed to fire the guns.  With horror, Cooper realized what the target was. A group of people: from their clean clothes, ethnic mix, and the sentient jeep idling nearby, Cooper guessed they were researchers or expat managers. They were doing something with the trees, rigging up monitors, breaking branches, cutting saplings.  Kursk burst in on them with a roar, still signaling to his driver to fire.  The team scattered, leaping into the jeep or dashing into the undergrowth.  Kursk pursued the jeep for a while, then gave up. Trundled slowly along the roadside at patrolling pace.  Cooper processed the incident.  Finally, he said, “I think we need to talk about what’s an enemy.”  Maybe the tank was defending the village. If that were true, foreign R&D teams might seem like a threat. It was overcompensation, but within parameters.  Cooper could work with that.  “How ’bout we go back for those Reds, then?”  He wasn’t sure if the tank was going in the right direction, but he was willing to trust him. Kursk might have got a little confused about his mission, but he was a good tank.  Kursk stopped, that scenting-processing routine clearly in action again. He made a decision, trundled into the jungle.  Cooper checked the guns. Not much left. He wondered how difficult it would be to find, or make, or commission, proper ammo. Still, Kursk seemed to be getting on OK without it. The rush of battle was coming back to him, the thrill of anticipating the clash. Primordial memories of hunting trips, stalking deer in the scrubby forests with a cousin or two. But Kursk was better. Stronger. Someone he could trust.  The Reds wouldn’t stand a chance.  Kursk found his target and began a sudden downward run, putting his lights on full, the servos and the crunch of the treads and the shrieks of wildlife combining to a Wagner roar. And in the bright lights, on the monitor, Cooper could see—  An old lady.  A thin, wiry old lady, with a long blue-black braid, staring up frightened from the small fire she’d kindled.  Cooper shouted at Kursk, slammed the control board, yelled at him to stop. Pounded the hatch.  Kursk wasn’t listening.  The lady was a surprisingly fast runner, but Kursk didn’t have to go around obstacles.  At the very last minute, Cooper managed to hit the manual.  Felt a lurch as the tank hit the root system of a tree.  The tank stopped.  Cooper wrenched the hatch open, tumbled out, gasping. Saw the flicker of the long black braid receding.  Kursk was backing off.  “Oh, no you don’t, you bastard,” Cooper said. He ran after the tank, pulled at the open hatch, swung in. Switched the controls to manual. “We’re going after the Reds.”  The tank groaned in protest, tried to retake control, but Cooper held firm. “You picked up some weird notions out here,” he said. “That’s why you have a driver. To keep you straight. We’re a team.” He upshifted, hard.  Unwillingly, and still keeping a servo-straining tension on the brakes, the tank chugged out along the roadside, back to where they’d last seen the Reds.  Cooper switched to the heat-seeking vision, tracked into the jungle.  “There’s the sons of bitches,” he said. Kursk began to speed up, clearly getting back into it now.  “Attaboy!” Cooper cheered. “Go on, get them!”  The tank’s lights came on as it crashed, roaring, on the clearing where the muffled figures were gathered, training a flashlight on the awkwardly sized thing they’d been carrying.  Cooper heard shouts in indistinct Malay, saw them beginning to run.  “No, you don’t,” he said, taking control of the guns and firing. Kursk, meanwhile, was running down the others, twisting and turning with his surprising agility in the trees.  In the end there was nothing but smoke and twisted bodies, and Kursk’s blazing lights, and the hum of his engine.  Cooper wrestled with the hatch again, flung it open, pushed himself out into the clearing. Staggered a bit.  “We did it, boy,” he said to Kursk. “We got ’em.”  He went over to look at the IED. Pulled back the smoking, singed burlap.  An electric motorcycle engine.  Blinking, he pulled it all off. It was still an engine.  Backing up, his heel connected with a limp body. Mechanically, he made himself turn, look at it closely. Wound back the scarf.  Saw the face of a teenage boy. Impossibly handsome in a boy-band way, strong chin and full, parted lips, dark lashes resting on his cheek as if he was sleeping.  The boy who’d taken him to the church that afternoon.  Cooper looked at the scarf. Realized it wasn’t a revolutionary one. Wasn’t even red and black; just a faded brown-on-brown pattern.  He didn’t know what made him think it was terrorists.  Made himself look at the other bodies, torn up with gunfire.  “Kids,” he muttered. “Just kids. Working late on a project.”  He staggered back to Kursk, dropped back in, and closed the hatch. “Get us out of here,” he muttered.  The tank turned, went slowly crunching through the trees. Cooper watched the display with half an eye, slumped in the chair. Feeling sick, sick like he hadn’t done since . . .  . . . since Kuching.  It had all gone according to plan. Kursk rolling forward, Cooper working the monitor and the guns. The lead tank tripped an IED, or possibly an actual mine, not that it really mattered, and they kept going.  And then, something hit the third tank in the line.  Lucky shot, certainly; some kind of mortar fire. Enough to blow out the guns, the driver, and most of the hardware, leaving a burning shell.  Cooper was only briefly aware of it, though, because Kursk surged into battle, picking up speed, signaling at him to use the guns. Numb, Cooper did.  Before he saw the UN flashes on the arms of the soldiers falling in front of them . . .  He pulled his hands off the triggers, hammered at the dash. Shouted at Kursk to stop. Then let go, breathed, checked the monitor, swung it around.  Saw the tanks on the advance, rolling over everyone. Rebel, government forces, UN forces.  Voices in his ear. Urging the drivers to regain control. Stop them before they got to HQ, or something just as bad. Reports of tanks attacking a supply chain, an ambulance, a rebel sniper nest.  Heard the other drivers, the surviving ones anyway, trying to report, to regain order.  Heard his own voice, begging Kursk to stop.  Cooper hit the manual, wrestled for control. Heard the voices in his ear screaming at him to abort mission and abandon tank, but no way he was going to leave Kursk.  He finally gained control, turned the tank, drove him protesting toward a green space, a small park or highway reservation or something, just a small stand of decorative palm trees and some tall grasses.  And then a sound lanced through his earphones, a tone, rising, all-encompassing, filling his head, he struggled to fight against it and remain conscious, but—  Sitting against the tank in the cool of the night, looking up at the stars and the faint glow from the agribusiness on the horizon, Cooper remembered.  “Trees,” he said. “That’s what you’re defending. It’s the trees.”  Cooper found himself thinking of all the angry articles about how the army was just there to protect the multinational agribusinesses and the palm plantations.  “Guess that’s true, hey Lori?” He glanced up at the impassive metal body.  “Maybe from your perspective, there’s not much difference between one big organic thing and another one?”  It occurred to him that he didn’t really know how the Lori thought. How he saw the world.  He wondered what would happen if he just let the Lori run free, driverless, in the jungle. More glimpses of the strange vehicle through the trees. More legends about bandits thwarted, children saved from drowning.  Huts burned to the ground. Plantation workers slaughtered.  The Lori didn’t seem to want to go anywhere right now, seemed content to just idle there with Cooper.  Cooper sat listening to the rustles and chirps of the jungle, the occasional distant sound of machinery, hiss of wheels from the road. Watching the sky get lighter.  Remembering the dogs back home. Angry, conflicted animals, with hair-trigger tempers. Beaten, punished, hurt, and yet, with that ingrown canine loyalty, unable to leave the person doing the hurting.  He’d loved his dog.  Loved her enough to give her up, if it meant she didn’t go down that same road, trusting his father despite all he did.  Then his thoughts drifted to the village. Stayed there for a long while.  Finally, Cooper got up. Opened the hatch again. Got out his driver’s utilitool, popped the screwdriver, and got to work.  Although he knew battle tanks had defensive measures they could take against this, nothing happened.  At some point, the engine shut down.  Cooper reemerged from the hatch just as the sun was approaching its zenith. He rummaged in his backpack, found a clean cloth bag. Normally, in autonomous vehicles, the intelligence is distributed throughout the processing systems, but whoever designed battle tanks was expecting them to run through body-shells pretty quickly.  Cooper walked up the road, walking toward the plantation. He’d seen an automated parcel receive-and-drop point not far from the vehicular access gate.  He chose a locker at random, put the bag with the processor in. Closed the locker.  Thought about saying something, but that seemed too much like a funeral, so he didn’t.  But he made a wish, for the Lori.  Cooper stood for a few minutes more. Trying hard to fix that moment in his mind, the yellow of the locker doors, the shafts of light through the leaves, the hum of animal life, the heat in the air.  Then Cooper turned and began his long walk back to the village. Fiona Moore is a London-based writer and academic whose first novel, Driving Ambition, is available from Bundoran Press. Her short fiction and poetry have appeared in Asimov's, Interzone, and Mad Scientist Journal, with reprints in Forever Magazine and Best of British SF; her story \"Jolene\" was shortlisted for the 2019 BSFA Award. She has co-written three stage and four audio plays and a number of guidebooks to cult TV series, as well as non-fiction articles for numerous print and online SF publications.", "text": "3620 words, short story\nThe Lori\nThe problem with sentient battle tanks is their drivers.\nRealizing this after (unfortunately not before) the Battle of Kuching, the military quietly shifted their AI strategies toward botnets and other nonsocial intelligents that can take down the utilities and welfare systems of entire regions without worrying too much about the consequences. Sentient battle tanks quietly joined ornithopters and weather control in the listicles of the thirty strangest technological propositions of the past two centuries. And that, for most people, was the end of it.\nExcept for Corporal Atticus Cooper, the driver of Kursk 118-200.\nCooper grew up liking any kind of story involving magic swords or horses or dragons that choose brave heroes and take them on adventures. He went through a long phase of secretly pretending he was Elric of Melniboné. He had owned a Staffordshire terrier, or something that looked like one anyway.\nBut after a few weeks he had carefully packed up the dog’s food, encouraged the dog into her crate, put both dog and food into his father’s pickup and driven to the local shelter, leaving her there with no explanation.\nAt the age of eighteen he’d done something similar, enlisting and putting as many miles between himself and the place where he grew up as possible. He signed up as a driver, because he liked machines, and because it was a necessary job that was fun and interesting, but not likely to get him killed.\nHe’d tried to improve himself and do better than what was expected of him. But his lovers never stayed long, and usually described him as “obsessive.” He never managed to form close friendships with his squad mates either, for all that he would buy them rounds, go out of his way to do favors for any one of them that he so much as thought needed a helping hand. Cooper didn’t seem to care.\nAll of which added up to the sort of profile that gets people recruited as drivers for the battle tank program.\nBut, as Clausewitz or Sun Tzu or one of the other writers that the sort of people who develop battle tank programs are fond of selectively quoting said, no plan survives contact with the enemy.\nAnd when Cooper woke up in a hospital in Manila, six weeks after the Battle of Kuching, the first thing on his mind was finding Kursk.\nCooper managed to curb his first impulse, to check himself out of the hospital immediately. Mostly because it turned out comas don’t work like they do in the movies, and he had to learn to walk properly again. But he put the enforced recovery time to good use, finding out what had happened to Kursk.\nBy an immense stroke of luck, Kursk was on the missing list. So, he hadn’t been destroyed at Kuching, nor had he, like most of the survivors, been quietly retired, his processor removed and consciousness transferred to storage until someone figured out what to do with them. A further stroke of luck was that the authorities were not looking for any of the small number of missing tanks. A lack of resources, perhaps, or a desire to sweep the whole thing under the rug.\nNobody seemed to be in too much of a hurry to get Cooper back either.\nMaking a few educated guesses—he was Kursk’s driver, and nobody knew Kursk better—Cooper began checking maps of the area around Kuching, and, through local news services, looking for any items that might be a sighting of a lone battle tank. He traced a path in-country, heading southeast from the city into territory that looked, on the map, to be mostly filled with palm oil plantations, national parks, farms, kampungs, and just plain jungle. As to what was going on: the UN forces had all left and the civil war had been officially declared over, but that statement was disputed by both the local terrorists/activists/revolutionaries/freedom fighters, and the owners and workers for the agribusiness conglomerates who were still their main targets.\nWhich, Cooper decided, was another good reason to go there.\nCooper ended his period as a cooperative patient in the hospital and officially went out to have two further weeks of medical leave before rejoining his unit, which had been shipped off to Louisiana. That meant it would be at least three weeks, and probably a lot longer, before someone considered him AWOL.\nHe caught a commercial flight to Brunei, and then persuaded an NCO in the RMAF to put him on a plane to Kuching (commercial flights suspended, of course, except those to do with the agribusinesses). Might have been safer to take a boat along the coast, but would have definitely taken longer, and Cooper didn’t want to risk losing track of Kursk.\nNot after that last heartbreaking moment of consciousness, fire all around him, orders screaming in his ear to abort mission and abandon the tank. Gritting his teeth and ploughing forward, over the crunch of flesh and bone, because no way he was going to leave Kursk. Not ever.\nOnce on the ground, Cooper activated long-neglected skills. He hitched rides in-country with the trucks carrying laborers and managers out to the plantations (though not with the occasional military vehicles, where he might get asked hard questions) or hiked along the road. He camped out in the jungle or accepted hospitality in kampungs, sleeping in storage huts in exchange for money or labor.\nHis linguistic abilities were limited at first, but they got better with practice, and he also discovered that he would get the answers he wanted if he just asked if they’d seen the Lori.\nFor the people of Sarawak, thanks to a long period of British colonial activity, a lori is what Cooper would normally have called a truck. Kursk didn’t look much like one. But then, he didn’t look much like a conventional tank either: needing only a single human operator and being intended for use in unconventional, principally urban, combat situations, he was small, little enough to fit in a goods elevator or trundle down a narrow alley, and roughly trapezoidal. Someone who’d never seen a sentient battle tank before might not realize what he was, and, even if they did, might not have the vocabulary to cover it. So, for lack of a better word, Kursk was the Lori.\nAnd the Lori, Cooper discovered, was a legend. He might be glimpsed between the trees, or the crunch of tracks over dead twigs might be heard. More rarely, there were stories: Of children and teenagers saved from kidnap or assault by a tank bursting from the trees at the right moment, of a baby saved from drowning after falling into a rice paddy. Of a farmer’s pigs being driven off into the forest for some unknown reason, the whole community turning out to find them in a cheerfully grumbling mob.\nThen there were the other ones.\nHuts burned to the waterline, the exits guarded so the inhabitants couldn’t get out. A group of plantation workers who’d come over from New Guinea, attacked and slaughtered on the road before they reached their destination. Random disappearances of managers, agribusiness developers, tax collectors: the people who’d told Cooper that one hadn’t been entirely able to resist a grim joke about that last category of victim.\nCooper didn’t judge.\nKursk’s basic impulse was to protect his friends against his enemies. So, Cooper thought as he sheltered in the back of a rattling sentient truck that was stoically ploughing through the rain, Kursk needed him. Needed someone to show him the right people to protect, and the right ones to attack.\nThe magic sword always needs a guy to wield it.\nCooper felt his world settle into a kind of balance.\n“I’m coming to join you, Kursk,” he said aloud. Him and Kursk, the knight and his steed. Living in a hut on the edge of town, waiting to be called into action when danger threatened. Or traveling. Living off the land, going where they were needed.\nThen everything would be all right between them.\n“I’ll make it up to you for what happened,” he said. “We’re a team. We’ll be okay.”\nCooper got off the truck when it slowed at a plantation checkpoint, hiked down the road to the nearest kampung. Chickens and pigs scattering, old ladies carrying bundles of firewood, a group of teenagers looking up from the motorbike they were disassembling. Cooper greeted them in his imperfect Malay, got taken by a volunteer—a boy-band-handsome kid with full lips and long dark lashes, Cooper bet he was popular—to the religious building. Which turned out to be a church, of the evangelical variety, where the preacher spoke better English than Cooper’s Malay.\nYes, he could stay the night in exchange for fixing the church’s sound system. Yes, there was also curry to be had, courtesy of the handsome kid’s family. The Lori?\nWhy did he want to know about the Lori?\nCooper rolled with it. No reason, just an interest in local folklore. He’d heard a lot of stories wandering through the area, wondered if there were some here. Tried hard to project an image of being a half-crazed foreign mythology junkie looking for weird legends to put in a book or something.\nThe villagers settled down and began talking instead about crops and weather and the agribusiness conglomerate’s failure to deliver on their promise that the palm oil plantation would boost the local economy. After a brief muttered aside about how non-Christians would believe any old nonsense, the preacher also dropped the subject of the Lori and joined in.\nThat evening, after Cooper had ostentatiously turned in for the night, he snuck out of the church building and crept to the edge of town, under cover of darkness. Settled down under a tree with big roots to wait.\nHe was prepared to do that for a few nights, if necessary, but either he struck lucky, or the tank knew something he didn’t.\nAfter a couple of hours of dozing among the roots, he woke and sprang into a crouch, hearing the noise of the caterpillar tracks on the vegetation, seeing a dim square shape against the rising moon.\n“Kursk,” he half-laughed, half-sobbed, overwhelmed with emotions he couldn’t name. “Kursk, boy. It’s me, Coop.”\nHe ran toward the shape, his hands finding the rough, dented bodywork, caressing the pattern of rivets and bolts, moved upward, found the hatch, wrestled with it briefly. The lock still recognized his palm-print.\nWith a triumphant yell, he fell inside, closed the door, swearing and shouting in delight as the familiar jolting motion in the padded operator seat engaged him. Like those training runs, bouncing along rough terrain, firing on targets in movie-set fake city streets, seeing his score racking up at the bottom of the monitor.\nThey were a team again. They were like the Magnificent Seven, the Lori and the Lori’s driver, and . . .\nThe tank stopped, like a dog scenting the wind.\nCooper held his breath, waiting to see where Kursk went.\nThe tank started forward again, heading for the road to the plantation.\nAfter a minute, the logic resolved. On the monitors, Cooper could make out a small group of figures, their heads muffled in scarves, carrying something awkward. Turning up the gain on the night vision suggested the scarves were red and black—the colors of the anti-capitalist faction—and, while he couldn’t make out what they were carrying, his money was on an IED.\n“Way to go, Kursk,” Cooper said, as the tank bore down on the group.\nAnd then, drove on past it.\n“What the hell?”\nBut Kursk wasn’t listening. He was picking up speed, rumbling into the plantation. Cooper fiddled with the monitor settings.\nKursk was signaling to him that this was the enemy, that Cooper needed to fire the guns.\nWith horror, Cooper realized what the target was. A group of people: from their clean clothes, ethnic mix, and the sentient jeep idling nearby, Cooper guessed they were researchers or expat managers. They were doing something with the trees, rigging up monitors, breaking branches, cutting saplings.\nKursk burst in on them with a roar, still signaling to his driver to fire.\nThe team scattered, leaping into the jeep or dashing into the undergrowth.\nKursk pursued the jeep for a while, then gave up. Trundled slowly along the roadside at patrolling pace.\nCooper processed the incident.\nFinally, he said, “I think we need to talk about what’s an enemy.”\nMaybe the tank was defending the village. If that were true, foreign R&D teams might seem like a threat. It was overcompensation, but within parameters.\nCooper could work with that.\n“How ’bout we go back for those Reds, then?”\nHe wasn’t sure if the tank was going in the right direction, but he was willing to trust him. Kursk might have got a little confused about his mission, but he was a good tank.\nKursk stopped, that scenting-processing routine clearly in action again. He made a decision, trundled into the jungle.\nCooper checked the guns. Not much left. He wondered how difficult it would be to find, or make, or commission, proper ammo. Still, Kursk seemed to be getting on OK without it. The rush of battle was coming back to him, the thrill of anticipating the clash. Primordial memories of hunting trips, stalking deer in the scrubby forests with a cousin or two. But Kursk was better. Stronger. Someone he could trust.\nThe Reds wouldn’t stand a chance.\nKursk found his target and began a sudden downward run, putting his lights on full, the servos and the crunch of the treads and the shrieks of wildlife combining to a Wagner roar. And in the bright lights, on the monitor, Cooper could see—\nAn old lady.\nA thin, wiry old lady, with a long blue-black braid, staring up frightened from the small fire she’d kindled.\nCooper shouted at Kursk, slammed the control board, yelled at him to stop. Pounded the hatch.\nKursk wasn’t listening.\nThe lady was a surprisingly fast runner, but Kursk didn’t have to go around obstacles.\nAt the very last minute, Cooper managed to hit the manual.\nFelt a lurch as the tank hit the root system of a tree.\nThe tank stopped.\nCooper wrenched the hatch open, tumbled out, gasping. Saw the flicker of the long black braid receding.\nKursk was backing off.\n“Oh, no you don’t, you bastard,” Cooper said. He ran after the tank, pulled at the open hatch, swung in. Switched the controls to manual. “We’re going after the Reds.”\nThe tank groaned in protest, tried to retake control, but Cooper held firm. “You picked up some weird notions out here,” he said. “That’s why you have a driver. To keep you straight. We’re a team.” He upshifted, hard.\nUnwillingly, and still keeping a servo-straining tension on the brakes, the tank chugged out along the roadside, back to where they’d last seen the Reds.\nCooper switched to the heat-seeking vision, tracked into the jungle.\n“There’s the sons of bitches,” he said. Kursk began to speed up, clearly getting back into it now.\n“Attaboy!” Cooper cheered. “Go on, get them!”\nThe tank’s lights came on as it crashed, roaring, on the clearing where the muffled figures were gathered, training a flashlight on the awkwardly sized thing they’d been carrying.\nCooper heard shouts in indistinct Malay, saw them beginning to run.\n“No, you don’t,” he said, taking control of the guns and firing. Kursk, meanwhile, was running down the others, twisting and turning with his surprising agility in the trees.\nIn the end there was nothing but smoke and twisted bodies, and Kursk’s blazing lights, and the hum of his engine.\nCooper wrestled with the hatch again, flung it open, pushed himself out into the clearing. Staggered a bit.\n“We did it, boy,” he said to Kursk. “We got ’em.”\nHe went over to look at the IED. Pulled back the smoking, singed burlap.\nAn electric motorcycle engine.\nBlinking, he pulled it all off. It was still an engine.\nBacking up, his heel connected with a limp body. Mechanically, he made himself turn, look at it closely. Wound back the scarf.\nSaw the face of a teenage boy. Impossibly handsome in a boy-band way, strong chin and full, parted lips, dark lashes resting on his cheek as if he was sleeping.\nThe boy who’d taken him to the church that afternoon.\nCooper looked at the scarf. Realized it wasn’t a revolutionary one. Wasn’t even red and black; just a faded brown-on-brown pattern.\nHe didn’t know what made him think it was terrorists.\nMade himself look at the other bodies, torn up with gunfire.\n“Kids,” he muttered. “Just kids. Working late on a project.”\nHe staggered back to Kursk, dropped back in, and closed the hatch. “Get us out of here,” he muttered.\nThe tank turned, went slowly crunching through the trees. Cooper watched the display with half an eye, slumped in the chair. Feeling sick, sick like he hadn’t done since . . .\n. . . since Kuching.\nIt had all gone according to plan. Kursk rolling forward, Cooper working the monitor and the guns. The lead tank tripped an IED, or possibly an actual mine, not that it really mattered, and they kept going.\nAnd then, something hit the third tank in the line.\nLucky shot, certainly; some kind of mortar fire. Enough to blow out the guns, the driver, and most of the hardware, leaving a burning shell.\nCooper was only briefly aware of it, though, because Kursk surged into battle, picking up speed, signaling at him to use the guns. Numb, Cooper did.\nBefore he saw the UN flashes on the arms of the soldiers falling in front of them . . .\nHe pulled his hands off the triggers, hammered at the dash. Shouted at Kursk to stop. Then let go, breathed, checked the monitor, swung it around.\nSaw the tanks on the advance, rolling over everyone. Rebel, government forces, UN forces.\nVoices in his ear. Urging the drivers to regain control. Stop them before they got to HQ, or something just as bad. Reports of tanks attacking a supply chain, an ambulance, a rebel sniper nest.\nHeard the other drivers, the surviving ones anyway, trying to report, to regain order.\nHeard his own voice, begging Kursk to stop.\nCooper hit the manual, wrestled for control. Heard the voices in his ear screaming at him to abort mission and abandon tank, but no way he was going to leave Kursk.\nHe finally gained control, turned the tank, drove him protesting toward a green space, a small park or highway reservation or something, just a small stand of decorative palm trees and some tall grasses.\nAnd then a sound lanced through his earphones, a tone, rising, all-encompassing, filling his head, he struggled to fight against it and remain conscious, but—\nSitting against the tank in the cool of the night, looking up at the stars and the faint glow from the agribusiness on the horizon, Cooper remembered.\n“Trees,” he said. “That’s what you’re defending. It’s the trees.”\nCooper found himself thinking of all the angry articles about how the army was just there to protect the multinational agribusinesses and the palm plantations.\n“Guess that’s true, hey Lori?” He glanced up at the impassive metal body.\n“Maybe from your perspective, there’s not much difference between one big organic thing and another one?”\nIt occurred to him that he didn’t really know how the Lori thought. How he saw the world.\nHe wondered what would happen if he just let the Lori run free, driverless, in the jungle. More glimpses of the strange vehicle through the trees. More legends about bandits thwarted, children saved from drowning.\nHuts burned to the ground. Plantation workers slaughtered.\nThe Lori didn’t seem to want to go anywhere right now, seemed content to just idle there with Cooper.\nCooper sat listening to the rustles and chirps of the jungle, the occasional distant sound of machinery, hiss of wheels from the road. Watching the sky get lighter.\nRemembering the dogs back home. Angry, conflicted animals, with hair-trigger tempers. Beaten, punished, hurt, and yet, with that ingrown canine loyalty, unable to leave the person doing the hurting.\nHe’d loved his dog.\nLoved her enough to give her up, if it meant she didn’t go down that same road, trusting his father despite all he did.\nThen his thoughts drifted to the village. Stayed there for a long while.\nFinally, Cooper got up. Opened the hatch again. Got out his driver’s utilitool, popped the screwdriver, and got to work.\nAlthough he knew battle tanks had defensive measures they could take against this, nothing happened.\nAt some point, the engine shut down.\nCooper reemerged from the hatch just as the sun was approaching its zenith. He rummaged in his backpack, found a clean cloth bag. Normally, in autonomous vehicles, the intelligence is distributed throughout the processing systems, but whoever designed battle tanks was expecting them to run through body-shells pretty quickly.\nCooper walked up the road, walking toward the plantation. He’d seen an automated parcel receive-and-drop point not far from the vehicular access gate.\nHe chose a locker at random, put the bag with the processor in. Closed the locker.\nThought about saying something, but that seemed too much like a funeral, so he didn’t.\nBut he made a wish, for the Lori.\nCooper stood for a few minutes more. Trying hard to fix that moment in his mind, the yellow of the locker doors, the shafts of light through the leaves, the hum of animal life, the heat in the air.\nThen Cooper turned and began his long walk back to the village.\nFiona Moore is a London-based writer and academic whose first novel, Driving Ambition, is available from Bundoran Press. Her short fiction and poetry have appeared in Asimov's, Interzone, and Mad Scientist Journal, with reprints in Forever Magazine and Best of British SF; her story \"Jolene\" was shortlisted for the 2019 BSFA Award. She has co-written three stage and four audio plays and a number of guidebooks to cult TV series, as well as non-fiction articles for numerous print and online SF publications.", "source": "https://clarkesworldmagazine.com/moore_08_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Lori by Fiona Moore"}