{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Mark Cole", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "SZOeM/hTG7e2553ApGO3qHMqdkU=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  The Great Leap Sideways: SF and Social Media  Science Fiction isn’t always about the big things.  Nor does it get it right all the time.  Consider the first SF visions of the internet: for William Gibson and the other pioneer Cyberpunks, the online world was home to a chosen few—the corporate elite on one hand, the radical fringe of cowboys and hackers on the other.  But it didn’t work out that way.  Instead it became something far more democratic, a vast virtual space filled with countless millions of users who had no idea how their computer worked or how to create new programming for it. Far from the secret data caches Johnny Mnemonic carried, most of that traffic is entertainment, commerce and even idle chatter. The gleaming city on a hill that was cyberspace had become sprawling suburban subdivisions within a generation. Perhaps the measure of how prosaic it has all become is that it is now possible to talk or write about social media without the once obligatory references to SF.  Not that SF has exactly ignored social media. Once it became a major force in our modern world, SF writers got busy extrapolating it into their future worlds. William Gibson’s Pattern Recognition (2005) came out only a year after Facebook launched (although parts of it are already badly out of date!). You can even find its precursors as far back as 1909, in E.M Forster’s “When The Machine Stops,” in which everyone lives in his own little hexagonal box in a monstrous hive. They can chat with their friends or carry out their day to day activities without ever leaving their cubicle—one character even delivers a speech to her club from within her room.  However, no one guessed just how popular sharing the private details of our lives with the world would be, or how eager people would be to make virtual friends online. Reality had left SF in the dust. Social media burst into the consciousness of SF at about the same time it seized the attention of the rest of the world. And, curiously, it is one of the few realms in the world of SF which movies began exploring at the same time—or even before—the print media did.  One of the earliest appearances came in legendary anime director Mamoru Oshii’s live action film, Avalon (2001). Set in a rundown future, Avalon is an illegal MMORPG (massively multiplayer online roleplaying game) and one of the few ways to escape the harsh realities of the world. The greatest players, like the film’s protagonist, Ash, can actually make a living playing Avalon. The idea seemed strange at the time, but now many MMORPGs tie their currencies to real dollars. A select few Second Life players earn over one million dollars a year.  VR games have appeared in a lot of SF movies—and yet very few of them offer anything like a convincing cinematic portrayal of a computer game. The gameplay in movies like Existenz and Nirvana makes little sense and hardly seems playable—let alone like the work of a master designer. Avalon, however, seems reasonably plausible, with its “Boss” characters, lag time, character stats and game economics, where players must earn points to buy their equipment. Part of Avalon’s authenticity stems from all the hours that Oshii spent playing Wizardry during his bouts of unemployment in the eighties.  In 2009, Mamoru Oshii returned to the world of Avalon in a new film, Assault Girls, although it explores little new territory.  MMORPGs were one of the earlier forms of social media: while its predecessors go all the way back to the Seventies, the first true MMORPG, Meridian 59, appeared in 1996, only a year after the NSFNET lifted the restrictions that had previously prevented their development.  Video games have remained a constant source of inspiration for movie makers since Tron, although few of them have soared to the heights of lunacy reached by Mark Neveldine and Brian Taylor’s Gamer. The directors first made their mark with Crank, an absurd, non-stop action film that feels as hopped up on meth and adrenalin as its lead character: Gamer gives no indication that they ever intend to slow down to let the audience catch its collective breath. This of course makes it even more of a surprise to find a movie that is crammed full of intriguing SF ideas, centering on a frightening—and particularly perverse—new form of social media.  Billionaire inventor Ken Castle (Michael C. Hall) created a self-replicating nanite which, when injected into someone’s brain stem, allows someone else to control all his motor functions. Using this technology, he created a game called “Society,” in which online players can take control of a real person within a real environment. There, they interact with real people controlled by other unseen players. While it resembles William Gibson’s idea of “meat puppets,” Neveldine/Taylor have taken that idea and carried it to new and even creepier heights. In one deliberately disgusting scene, we see a guy putting his moves on a beautiful woman avatar, unaware that she is being controlled by a fat and enormously grotesque man.  The avatars within “Society” are all paid actors (if that’s the right word). However, this is not true of Castle’s other hit game, “Slayers:” its human avatars shoot at each other with real weapons, and when hit, they really die. While all the players are “volunteers,” Castle recruits them from death row, promising them their freedom if they survive thirty games. These death matches are then televised, so the millions who cannot afford to control one of the slayers can also enjoy the game.  “Kable” (Gerald Butler) is the most popular player in the game, the only one so far to survive twenty-seven games, and an odds-on favorite to actually win his freedom. However, Castle does not want Kable freed, so he brings a ringer into a game, a vicious psychopath who does not have a controller. This gives him a tremendous edge over the other avatars, as he is not affected by computer “lag” or the reflexes of his controller.  While many reviewers argue they stole this plot from Rollerball (a more apt comparison might be Peter Watkin’s Punishment Park), Castle is not so much worried about the political or societal repercussions should anyone survive the game, as he is about what Kable will do if he gets free. “Kable,” whose real name is John Tillman, was one of the first nanite test subjects—and under their control, Castle forced Tillman to kill his best friend. In the end, Tillman gets the upper hand by planting a suggestion in Castle’s mind by far more traditional means.  Ultimately, much of Gamer is absurd and improbable. Yet its imagined world still feels uncomfortably real: perhaps it is because the horrible people in it are all too recognizable—and perhaps because it is closer to the real online world than we care to admit.  “Society” bears more than a passing resemblance to Second Life, although what happens in the “adult” zones of Second Life may actually be far more perverse than anything in Gamer.  Ironically, Second Life succeeded because it rejected one of the mainstays of cyberpunk: when Phillip Rosedale started Linden labs in 1999, he tried to develop “the rig”—a massive VR suit with twin shoulder-mounted monitors. However, by 2002 he had discarded the VR hardware and launched his 3-D Linden World as a PC application (it became Second Life later that year).  Most SF attempts to portray the social media of the future end up resembling Second Life, perhaps because it offers not traditional game play, but a virtual world that the user can shape and restructure as he pleases, a vast array of 3-D chat rooms and even a virtual economy, tied to the real one. Many of these features can be found in other social media—particularly in the MMORPGs, but when one watches a movie like the French thriller, Black Heaven, one has no trouble recognizing the fictional “Black Hole” as a darker and creepier version of Second Life.  Reviewers routinely describe Black Heaven (2010) as an SF film and yet its status as SF is far from clear. The CG sequences depicting the world inside the game “Black Hole” are both strikingly beautiful and highly detailed. They exceed our current videogame capabilities—but not by much. Perhaps it might be more accurate to describe it as a crime thriller in the vein of French Auteur Claude Chabrol.  When young lovers Gaspard and Marion attempt to find the owner of a lost cell phone, it leads them to an attempted double suicide by a couple who apparently met online but had never actually met in person. Only the girl, Audrey, survives.  Gaspard meets her again a few days later and finds himself becoming more and obsessed with her—and with her mysterious tattoo. She invites him to meet her in “Black Hole.”  Players start out naked and have to find a job to buy clothes, which Gaspard does by selling balloons on the street for another player. He discovers that Audrey’s tattoo marks her as a slave of the exclusive nightclub in the heart of the virtual city. There, he finds “Sam,” a mysterious blindfolded singer with Audrey’s tattoo.  Nothing in the world of Black Hole is what it seems, however, and the mysterious “Sam” slowly drags Gaspard deeper and deeper into her deadly illusion.  Like Chabrol, director Gilles Marchand seems obsessed with the question of human evil. It flourishes in the anonymity of Black Hole’s virtual world in ways that mirror real world stories about online predators. Black Heaven may not be SF, but it understands far too well the ways the darker side of our nature misuses our new technologies.  Not all portrayals of social media are quite as dark, however.  A large part of Mamoru Hosada’s incredible anime, Summer Wars (2009) takes place within Oz, a 3-D online environment which might best be described as the internet 2.0. Not only does it offer a place to meet other people, to buy and sell, or play games—but business, government offices and utilities all do business through Oz.  Summer Wars is at once an entertaining family film and a masterful work of SF. Its vision of Oz seems a real possibility, firmly rooted in the current realities of the World Wide Web. Oz is parti-colored, stunningly modern in design, and yet inviting, a world we would all love to explore. But in the end, it is tradition and the warrior way that turns the tide against a reckless test of a new weapon.  Most of these films came out between 2009 and 2010, at roughly the same time that the mainstream media finally took notice of social media. Ben Mezrich’s account of the founding of Facebook, The Accidental Billionaires came out in 2009, followed a year later by movie based loosely on it, The Social Network.  SF took notice of social media at about the same time, with the release of Vernor Vinge’s Rainbow’s End in 2007, and Daniel Suarez’s Daemon in 2009. Ernest Cline even sold Ready Player One (2011) to Hollywood before it was published. A panel at the 2011 SXSW conference boldly declared that Social Media was science fiction, although most of what the panelists discussed sounded very much like what SF writers have said about computers for years, with a lot of the discussion revolving around our becoming mere neurons in an online hive mind.  Perhaps the furthest extrapolation of the idea to date appears in Hannu Rajaniemi’s The Quantum Thief (2012): in a radically transformed society on Mars, everyone’s thoughts are permanently linked to the collective consciousness, and some people have developed new organs to isolate themselves from it.  Ultimately, Social Media remains a somewhat uncomfortable fit for SF: the whole notion of SF brings to mind far more heroic visions of the future, built on some wild-eyed extrapolation from the current speculations in advanced physics. Instead, we find the real world pioneers of the new media tossing out some of the most beloved predictions of the old future.  And yet the new ways in which we entertain ourselves could radically change our world, whether they end up as the underpinnings of our future society, as a safety valve for a decaying future, as a way to deal with convicted criminals—or as yet another place where human evil can flourish. In the end, it is the social changes a new technology brings with it that have the greatest effect on us—and these often reflect our own needs and interests far more than they do the technology. More than any other technology ever devised, the online world reflects not just the machines running it, but the patterns of our minds.  It is quite possible that the next new development in that online world will carry us even further from our expectations, in which real life will take us places no SF writer has yet to visit.  Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction.", "text": "Non-Fiction\nThe Great Leap Sideways: SF and Social Media\nScience Fiction isn’t always about the big things.\nNor does it get it right all the time.\nConsider the first SF visions of the internet: for William Gibson and the other pioneer Cyberpunks, the online world was home to a chosen few—the corporate elite on one hand, the radical fringe of cowboys and hackers on the other.\nBut it didn’t work out that way.\nInstead it became something far more democratic, a vast virtual space filled with countless millions of users who had no idea how their computer worked or how to create new programming for it. Far from the secret data caches Johnny Mnemonic carried, most of that traffic is entertainment, commerce and even idle chatter. The gleaming city on a hill that was cyberspace had become sprawling suburban subdivisions within a generation. Perhaps the measure of how prosaic it has all become is that it is now possible to talk or write about social media without the once obligatory references to SF.\nNot that SF has exactly ignored social media. Once it became a major force in our modern world, SF writers got busy extrapolating it into their future worlds. William Gibson’s Pattern Recognition (2005) came out only a year after Facebook launched (although parts of it are already badly out of date!). You can even find its precursors as far back as 1909, in E.M Forster’s “When The Machine Stops,” in which everyone lives in his own little hexagonal box in a monstrous hive. They can chat with their friends or carry out their day to day activities without ever leaving their cubicle—one character even delivers a speech to her club from within her room.\nHowever, no one guessed just how popular sharing the private details of our lives with the world would be, or how eager people would be to make virtual friends online. Reality had left SF in the dust. Social media burst into the consciousness of SF at about the same time it seized the attention of the rest of the world. And, curiously, it is one of the few realms in the world of SF which movies began exploring at the same time—or even before—the print media did.\nOne of the earliest appearances came in legendary anime director Mamoru Oshii’s live action film, Avalon (2001). Set in a rundown future, Avalon is an illegal MMORPG (massively multiplayer online roleplaying game) and one of the few ways to escape the harsh realities of the world. The greatest players, like the film’s protagonist, Ash, can actually make a living playing Avalon. The idea seemed strange at the time, but now many MMORPGs tie their currencies to real dollars. A select few Second Life players earn over one million dollars a year.\nVR games have appeared in a lot of SF movies—and yet very few of them offer anything like a convincing cinematic portrayal of a computer game. The gameplay in movies like Existenz and Nirvana makes little sense and hardly seems playable—let alone like the work of a master designer. Avalon, however, seems reasonably plausible, with its “Boss” characters, lag time, character stats and game economics, where players must earn points to buy their equipment. Part of Avalon’s authenticity stems from all the hours that Oshii spent playing Wizardry during his bouts of unemployment in the eighties.\nIn 2009, Mamoru Oshii returned to the world of Avalon in a new film, Assault Girls, although it explores little new territory.\nMMORPGs were one of the earlier forms of social media: while its predecessors go all the way back to the Seventies, the first true MMORPG, Meridian 59, appeared in 1996, only a year after the NSFNET lifted the restrictions that had previously prevented their development.\nVideo games have remained a constant source of inspiration for movie makers since Tron, although few of them have soared to the heights of lunacy reached by Mark Neveldine and Brian Taylor’s Gamer. The directors first made their mark with Crank, an absurd, non-stop action film that feels as hopped up on meth and adrenalin as its lead character: Gamer gives no indication that they ever intend to slow down to let the audience catch its collective breath. This of course makes it even more of a surprise to find a movie that is crammed full of intriguing SF ideas, centering on a frightening—and particularly perverse—new form of social media.\nBillionaire inventor Ken Castle (Michael C. Hall) created a self-replicating nanite which, when injected into someone’s brain stem, allows someone else to control all his motor functions. Using this technology, he created a game called “Society,” in which online players can take control of a real person within a real environment. There, they interact with real people controlled by other unseen players. While it resembles William Gibson’s idea of “meat puppets,” Neveldine/Taylor have taken that idea and carried it to new and even creepier heights. In one deliberately disgusting scene, we see a guy putting his moves on a beautiful woman avatar, unaware that she is being controlled by a fat and enormously grotesque man.\nThe avatars within “Society” are all paid actors (if that’s the right word). However, this is not true of Castle’s other hit game, “Slayers:” its human avatars shoot at each other with real weapons, and when hit, they really die. While all the players are “volunteers,” Castle recruits them from death row, promising them their freedom if they survive thirty games. These death matches are then televised, so the millions who cannot afford to control one of the slayers can also enjoy the game.\n“Kable” (Gerald Butler) is the most popular player in the game, the only one so far to survive twenty-seven games, and an odds-on favorite to actually win his freedom. However, Castle does not want Kable freed, so he brings a ringer into a game, a vicious psychopath who does not have a controller. This gives him a tremendous edge over the other avatars, as he is not affected by computer “lag” or the reflexes of his controller.\nWhile many reviewers argue they stole this plot from Rollerball (a more apt comparison might be Peter Watkin’s Punishment Park), Castle is not so much worried about the political or societal repercussions should anyone survive the game, as he is about what Kable will do if he gets free. “Kable,” whose real name is John Tillman, was one of the first nanite test subjects—and under their control, Castle forced Tillman to kill his best friend. In the end, Tillman gets the upper hand by planting a suggestion in Castle’s mind by far more traditional means.\nUltimately, much of Gamer is absurd and improbable. Yet its imagined world still feels uncomfortably real: perhaps it is because the horrible people in it are all too recognizable—and perhaps because it is closer to the real online world than we care to admit.\n“Society” bears more than a passing resemblance to Second Life, although what happens in the “adult” zones of Second Life may actually be far more perverse than anything in Gamer.\nIronically, Second Life succeeded because it rejected one of the mainstays of cyberpunk: when Phillip Rosedale started Linden labs in 1999, he tried to develop “the rig”—a massive VR suit with twin shoulder-mounted monitors. However, by 2002 he had discarded the VR hardware and launched his 3-D Linden World as a PC application (it became Second Life later that year).\nMost SF attempts to portray the social media of the future end up resembling Second Life, perhaps because it offers not traditional game play, but a virtual world that the user can shape and restructure as he pleases, a vast array of 3-D chat rooms and even a virtual economy, tied to the real one. Many of these features can be found in other social media—particularly in the MMORPGs, but when one watches a movie like the French thriller, Black Heaven, one has no trouble recognizing the fictional “Black Hole” as a darker and creepier version of Second Life.\nReviewers routinely describe Black Heaven (2010) as an SF film and yet its status as SF is far from clear. The CG sequences depicting the world inside the game “Black Hole” are both strikingly beautiful and highly detailed. They exceed our current videogame capabilities—but not by much. Perhaps it might be more accurate to describe it as a crime thriller in the vein of French Auteur Claude Chabrol.\nWhen young lovers Gaspard and Marion attempt to find the owner of a lost cell phone, it leads them to an attempted double suicide by a couple who apparently met online but had never actually met in person. Only the girl, Audrey, survives.\nGaspard meets her again a few days later and finds himself becoming more and obsessed with her—and with her mysterious tattoo. She invites him to meet her in “Black Hole.”\nPlayers start out naked and have to find a job to buy clothes, which Gaspard does by selling balloons on the street for another player. He discovers that Audrey’s tattoo marks her as a slave of the exclusive nightclub in the heart of the virtual city. There, he finds “Sam,” a mysterious blindfolded singer with Audrey’s tattoo.\nNothing in the world of Black Hole is what it seems, however, and the mysterious “Sam” slowly drags Gaspard deeper and deeper into her deadly illusion.\nLike Chabrol, director Gilles Marchand seems obsessed with the question of human evil. It flourishes in the anonymity of Black Hole’s virtual world in ways that mirror real world stories about online predators. Black Heaven may not be SF, but it understands far too well the ways the darker side of our nature misuses our new technologies.\nNot all portrayals of social media are quite as dark, however.\nA large part of Mamoru Hosada’s incredible anime, Summer Wars (2009) takes place within Oz, a 3-D online environment which might best be described as the internet 2.0. Not only does it offer a place to meet other people, to buy and sell, or play games—but business, government offices and utilities all do business through Oz.\nSummer Wars is at once an entertaining family film and a masterful work of SF. Its vision of Oz seems a real possibility, firmly rooted in the current realities of the World Wide Web. Oz is parti-colored, stunningly modern in design, and yet inviting, a world we would all love to explore. But in the end, it is tradition and the warrior way that turns the tide against a reckless test of a new weapon.\nMost of these films came out between 2009 and 2010, at roughly the same time that the mainstream media finally took notice of social media. Ben Mezrich’s account of the founding of Facebook, The Accidental Billionaires came out in 2009, followed a year later by movie based loosely on it, The Social Network.\nSF took notice of social media at about the same time, with the release of Vernor Vinge’s Rainbow’s End in 2007, and Daniel Suarez’s Daemon in 2009. Ernest Cline even sold Ready Player One (2011) to Hollywood before it was published. A panel at the 2011 SXSW conference boldly declared that Social Media was science fiction, although most of what the panelists discussed sounded very much like what SF writers have said about computers for years, with a lot of the discussion revolving around our becoming mere neurons in an online hive mind.\nPerhaps the furthest extrapolation of the idea to date appears in Hannu Rajaniemi’s The Quantum Thief (2012): in a radically transformed society on Mars, everyone’s thoughts are permanently linked to the collective consciousness, and some people have developed new organs to isolate themselves from it.\nUltimately, Social Media remains a somewhat uncomfortable fit for SF: the whole notion of SF brings to mind far more heroic visions of the future, built on some wild-eyed extrapolation from the current speculations in advanced physics. Instead, we find the real world pioneers of the new media tossing out some of the most beloved predictions of the old future.\nAnd yet the new ways in which we entertain ourselves could radically change our world, whether they end up as the underpinnings of our future society, as a safety valve for a decaying future, as a way to deal with convicted criminals—or as yet another place where human evil can flourish. In the end, it is the social changes a new technology brings with it that have the greatest effect on us—and these often reflect our own needs and interests far more than they do the technology. More than any other technology ever devised, the online world reflects not just the machines running it, but the patterns of our minds.\nIt is quite possible that the next new development in that online world will carry us even further from our expectations, in which real life will take us places no SF writer has yet to visit.\nMark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction.", "source": "https://clarkesworldmagazine.com/cole_02_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Great Leap Sideways: SF and Social Media by Mark Cole"}