{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Matthew Kressel", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Mx4ARVOZ5vJ25QxwESiowu49cX8=", "id": null, "license": null, "comments": "", "raw_text": "5720 words, short story  The Meeker and the All-Seeing Eye  2014 Nebula Award Nominee for Best Short Story  As the Meeker and the All-Seeing Eye wandered the galaxy harvesting dead stars, they liked to talk.  “I was traveling the southern arm,” the Meeker said, “you know, where the Baileas eat the cold dust?”  “I do,” said the All-Seeing Eye. “But tell me again.”  “Well, that old hag told me she used to swallow stars by the thousands!”  The Meeker chuckled and one of his nine arms bumped the controls. The accidental thrust, less than a few million photons, would take the Bulb off course by more than four light-years. But what was another century when the Meeker and the Eye had millennia to talk?  The polymorphous mist of the Eye spun above her seat like a timid nebula. Usually this meant she wanted him to continue, and so he did.  “I told that raggedy beast that if I believed her ash then I’d believe all that nonsense folks say these days about the Long Gone.”  “And what do they say?” asked the All-Seeing Eye.  “That there were billions of cities spread across the galaxy, vicious trade between worlds, and so many species they ran out of names. You know, kook dust.”  “I do,” said the Eye. “But tell me again.”  And what luck the Meeker had bumped the controls, because the sensors had just detected an object drifting in the voids. “Eye! What the ash is that?”  The mist of the Eye collapsed into a sphere like a newborn star. “An unknown! Meeker, change course to intercept!”  The Meeker obeyed, and their Bulb banked through rarefied crimson wisps, cosmic ash that would never again coalesce into stars. “Do you think it’s from the Zimbim?” he said, as if he’d known those majestic builders himself. “You know they once lived on ninety planets and rebuilt all their crystal cities in a day?”  “I do,” said the Eye. “But tell me again.”  After four weeks of travel he said, “Do you think it’s a baby Qly? You know they could grow to swallow galaxies, but preferred to curl around young stars and sing electromagnetic eulogies into space?”  “I do,” said the Eye. “But tell me again.”  And nine months after that he said, “Could it be a wayward Urm, those planetary rings that ate emotions?” The Bulb had slowed considerably by now, and the scattered stars had lost their endearing blue shift, turned red, ancient, tired. “Or maybe,” he said, “it’s a philosophizing Ruck worm. You know their proverbs were spoken by half the galaxy?”  “I do,” said the Eye, “But tell me again.”  “What I would give,” the Meeker said, “just to glimpse the Long Gone.”  They passed a rare star, a red dwarf that had smoldered for eons. Normally the Meeker would capture it in the Bulb’s gravity well and ferry the star to the Great Corpus at the center of the galaxy. There the Eye’s body would gain a few quadrillion more qubits, and a tremble of gravitational waves would ripple forever out into the abyss. But today they flew past the star, the first time the Meeker had ever skipped one.  In a maneuver he hoped made the Eye proud, he captured the object in the hold on the first pass, only bumping it once against the wall as he accelerated back toward the galactic center.  “Have it brought to the lab,” said the Eye. “And join me there after you finish correcting our course.”  The lab was tiny compared to most of the rooms on the Bulb. Sundry sensors crowded the space, and a clear, hollow cylinder dominated the center. The strange object hovered inside: a rectangular stone, dark as basalt, glimmering with a metallic sheen. Curious glyphs had been inscribed upon it, though heavy pitting had erased most of them.  The Meeker secreted calming mucus from his pores and said, “Was I right? Is it from the Long Gone?”  “Yes, Meeker. It is.”  He felt like leaping, and his limbs flailed excitedly. “What is it?”  “I’m still determining that. So far, I’ve discovered a volume of information encoded in its crystalline structure, a massively compressed message that uses a curious fractal algorithm. It has stymied all my attempts to decode it. I’ve relayed the contents to my Great Corpus for further help.”  “How strange and wonderful!” the Meeker said. “A message in a stone! But which civilization is it from?”  “I don’t know.”  The Meeker’s third stomach shifted uncomfortably. There had never been a fact the Eye did not know, a puzzle she could not quickly solve.  The Eye morphed into a dodecahedron. “Finally! My Corpus has just decoded a fragment of the message.”  “What does it say?”  “The message encodes a lifeform, which I will now attempt to recreate.”  His outer sheath grew slimy with anticipation. He was going to see a creature from the Long Gone!  A second tube materialized beside the first. A grotesque lump of quivering flesh formed inside it before collapsing into a pile of red ichor.  “How lovely!” he said.  The Eye expanded into a mist. “That’s not the creature. I’ve used the wrong chirality for the nucleic acids. I will try again.”  Did the Great All-Seeing Eye just err? he thought. How is this possible?  The lump vaporized and vanished, and a new shape formed. First came a crude framework of hard white mineral, then a flood of viscous fluids, soft organs and wet tissues, all wrapped under a covering of beige skin.  “Close your outer sheath,” the Eye said. “I’m changing the atmosphere and temperature to match the creature’s tolerances.”  The Eye didn’t pause, and if the Meeker hadn’t acted instantly, he would’ve died in the searing heat and pressure. The air was now so dense that he could feel his nine limbs press against it as they fluttered about.  The cylinder door swung open and out poured a sour-smelling mist. Thinking this was a greeting, the Meeker flatulated a sweet-smelling response.  Four limbs spoked out from the creature’s rectangular torso. A bulbous lump rose from the top. It had two deep-set orbs, a hooked flange of skin over two small openings, and a pink-lipped orifice covering rows of white mineral. Crimson fibers, the same smoldering shade as the ancient stars, draped from its peak. The Meeker had never seen anything more disgusting.  “What the . . . ?” the creature said, its voice low-pitched in the dense air. “Where am I?”  The Meeker gasped. “It speaks from its anus?”  “That’s its mouth,” said the Eye.  This foul creature was far different from the glorious ancients he had imagined, and he felt a little disappointed.  “Welcome to Bulb 64545,” said the Eye. “I am the All-Seeing Eye, and this is Meeker 6655321. I have adjusted your body so you can understand and speak Verbal Sub-Four, our common tongue. Who are you?”  “I . . . I’m Beth,” the creature said. “Where am I?”  The Eye told the Beth how she had been constructed from an encoded message. “It’s been millennia since I last discovered something new in the galaxy. Your presence astonishes me.”  “Yeah,” the Beth said, “it astonishes me too.”  “And me!” added the Meeker.  “Millennia?” the Beth said. Pink membranes flashed before her white and green orbs. Were these crude things her eyes?  “What species are you?” said the Eye.  The Beth grasped her shoulders as if to squeeze herself. “I’m human.”  “Curious. I’ve no record of your kind. Where are you from?”  The Beth made a raspy wet sound with her throat and looked up at the ceiling, when the green circles in her eyes sparkled like interstellar frost. The rest of her was difficult to look at, but these strange eyes were profoundly more beautiful than the wisps of lithium clouds diffracting the morning sun into rainbows during his home moon’s sluggish dawn.  “Denver,” she said.  “What do you last remember?” asked the Eye.  “I was in a dark space,” said the Beth. “Sloan was there, holding my hand.”  “Who is the Sloan?”  “She’s my wife. And who—what are you?”  The Meeker let loose a spray of pheromone-scented mucus. “I’m the Meeker, your humble pilot! And this is the Great All-Seeing Eye!”  “But what are you?”  The Eye collapsed into a torus. “This will take time to explain.”  “I’m freezing. Do you have any clothes?”  Freezing? the Meeker thought. It was hot enough to melt water ice!  But with the Eye’s help, the Beth covered herself in white fabrics. He didn’t understand why she needed to sheathe herself in an artificial skin when she already wore a natural one.  “I’m not well,” she said, holding her head.  The Eye floated beside her. “It may be a side-effect of your regeneration.”  “No. I’m sick.”  “Are you referring to the genetic material rapidly replicating inside your cells?”  “You know about the virus?”  “I observed the phenomenon when I created you, but I assumed it was part of your natural genetic pattern.”  “No. It most definitely isn’t. Do you have any water?”  A clear cylinder materialized on a table beside her.  “Oh,” the Beth said, flinching. “That will take some getting used to.”  She poured the searing hot liquid into her mouth, but her hands shook and she spilled half onto the floor. Red lines spiraled in from the corners of her eyes. “Is anyone else here?”  The Eye’s toroid body rippled. “Just the three of us.”  “No other humans?”  “According to my estimation, the stone was drifting in space for five hundred million years. It is likely that you’re the last of your kind.”  “So . . . Sloan is dead?”  “Yes.”  “But she was just beside me!”  “From your perspective. In reality, that moment occurred millions of years ago.”  The Beth put a hand to her mouth. “Oh my god . . . ”  “Yes?” said the Eye.  The Beth gazed at the Eye for a long moment, then her eyes narrowed. “Sloan whispered to me, just before I woke up. She said she had a message for the future, for whoever wakes me. It was, she said, something that would change the course of history. A terrible fact that must be known.”  The Eye moved closer to her. “Tell me. Tell me this fact!”  “My son. He . . . ” She swallowed. “He asphyxiated in the womb.”  “How terrible,” the Meeker said.  “Continue,” said the Eye.  “After, they did all these tests, and they discovered I had a virus. I had transmitted it to my unborn son. He never had a chance. Sloan said that my virus, the one that’s in my blood, it was from . . . it was created for . . . it was made by . . . Oh, god, I’m going to be—”  Her eyes rolled back into her head and she vomited yellow fluid onto the floor. She crashed forward and her head slammed into the table, then she shuddered in a violent paroxysm.  “What’s happening?” the Meeker said.  “It’s the virus,” said the Eye.  “Can you stop it?”  But the Beth stopped on her own, and all went still but for a faint hiss from her mouth.  “Hello?” he said.  “She’s dead,” said the Eye.  He felt a pang of panic. “But she’s only just come alive!” Was this brief glimpse all he would ever see of the Long Gone?  “Do not fret, Meeker. I am already creating another Beth.”  An hour later they sat in the cockpit, the Meeker on the left, the Beth in the middle, and the Eye on the right, as the Bulb hurtled toward the galactic center at half the speed of light.  The Beth had wrapped herself in a heavy blanket and pulled it close to her body. She seemed amazed with everything she saw. “But if we’re in space, where have all the stars gone?” A red dwarf, seven light years away, floated against a backdrop of absolute black.  “We harvested them,” the Meeker said, secreting a mucus of pride.  “Harvested? Why?”  “The matter we collect,” said the Eye, “is cooled to near absolute-zero, quantum entangled into a condensate, and joined with my Great Corpus, thus adding to my total computational power.”  “You’re a computer?”  “The Eye,” the Meeker said, “is the greatest mind the Cosmos has ever known.”  “My sole purpose is knowledge,” said the Eye. “I seek to know all things.”  “So many stars, gone,” the Beth said. “Was there life out there?”  “Oh, yes,” said the Meeker. “There were once so many species they ran out of names!”  “And now?”  “Now they are part of my Great Corpus,” said the Eye.  “By choice?”  The Meeker scratched his belly in confusion. “What does choice have to do with it?”  The Beth pulled her blanket closer. “Everything.”  “What do you remember about your last moments?” the Eye said.  The Beth spoke slowly. “Sloan was whispering to me.”  “And what did she say?”  The Beth looked down at her hands. “I don’t want to talk about it.”  “You must tell me,” said the Eye.  “Why?” She pursed her lips, and fluid pooled in the corners of her eyes. “So you can harvest me too?”  The Meeker gasped. What offense! He waited for the Eye to punish her, but the Beth coughed up a globule of mucus. This pleased him. She must have realized her offense and offered this up as an apology. But when she vomited all over the console and wailed for a full minute before she fell silent, he realized this had been involuntary.  “She’s dead?” he said. Red fluid dripped from a wound on her head.  “Yes, Meeker.”  “Eye, maybe you should stop making Beths, at least until you find a cure?”  The Beth vaporized and vanished, as if she never was. “Did you not hear the first Beth? The Sloan had a message for the future that she believed would change history. I must know what this message is.”  The next Beth began with the same questions, but the Eye avoided telling her too much. And when the Beth asked about the stars, the Eye replied with a question for her.  “My planet?” the Beth said. “It’s called Dirt. You’ve never heard of it? Where did you find me?” The Beth gazed into the impenetrable black.  The Meeker was envious. He had been born on an airless moon that orbited the Great Corpus every thousand years and spent the rest of his life in this Bulb.  “Are we in space?” the Beth said. “Are we beyond the Moon?”  “You live on the surface of your planet?” asked the Eye.  “Yes, at the foot of the Rockies, in a glass house. Sloan and I moved there because we love the stars. The Lacteal Path shines clear across the sky most nights.” The Beth chewed at a fingertip. “Where are all the stars? Where are you taking me?”  “Did the Sloan whisper something to you before you awoke?” the Eye said.  “How did you know?”  “Tell me, what did she say?”  “I’d found out she was working on top secret projects a few months ago. She swore it wasn’t weapons, but I didn’t believe her. We had a big fight. Is there any way I might call her? She’s probably worried sick.”  “Did the Sloan mention your stillborn child?”  “Excuse me? How do you know about that?”  “You transmitted the virus to your fetus in utero. The Sloan intimated that this fact was related to a very important message for the future. Now tell me—”  “No, that’s not what we spoke about! And how do you know so much about me? What the hell is going on here? I want to go home now!”  She put a hand to her mouth and vomited all over herself, then she spasmed, smacking her limbs into the Meeker. And after a minute of flailing and screaming she collapsed dead.  “Curious,” said the Eye. “Did you notice her story has changed?”  The Beth’s mouth hung open from her scream.  “That’s not what I noticed, Eye, no.”  The Eye asked the next Beth about her family.  “I have two daughters, Bella, ten, and Yrma, twelve. My son Joshua, he’s eighteen, and just left for college in Vermont. Before I got sick, I used to hike up the mountain trails with them at least once a week. Walking with my children under pines covered in snow . . . ” She inhaled through her nose. “I never felt more at peace. Is there a way I might call them?”  “Tell us about the Sloan,” said the Eye. “Did she whisper something to you before you awoke here?”  “Funny you should mention it.”  “What did she say?”  “It was about that day, when I didn’t want to tell the children I was sick. She got angry, but I said she was a hypocrite, because she works in a secret research lab and hides things from us every day.”  “She researches weapons technology?”  “She swears she doesn’t. And how do you know that? Have you spoken to her?”  “Was there anything else the Sloan said before you woke up here?”  “Not that I remember.”  “Are you sure you didn’t speak about your son, who died in utero?”  “What? No! What the hell is going on here?” The Beth stood, shaky on her two legs. “I’m not answering any more of your questions until someone tells me—”  She put a hand to her mouth and vomited. She screamed and spasmed, and when she was dead, the Meeker said, “Eye, why do you keep the truth from her? Shouldn’t she know that her family is dead half a billion years?”  “What purpose would that serve? You saw how agitated she became when she learned the truth. How else will we find this message the Sloan has given her?”  “But she dies in pain each time.”  “Why do you think she’s in pain?”  “Because she screams so terribly.”  “Those aren’t screams of pain, Meeker, but of joy. Her eternal life energy is free at last from her temporal body. It’s the same screams of joy that the civilizations of the Long Gone made when I swallowed their worlds.”  The Meeker had heard her stories a thousand times, he had even told a few back to her. But as he gazed down at the dead Beth and her dripping fluids, he wondered if the Eye was keeping things from him too.  The next Beth said, “Sloan whispered to me about the sunrise we watched that morning in Mexico. We felt as if we were part of the whole Cosmos, not discrete fragments.”  “And nothing more?” asked the Eye.  “Isn’t that enough?”  Then she died, and the next Beth said, “Sloan whispered that she’d miss drinking her morning coffee with me. Are you taking me home?”  The next Beth said, speaking of a stringed contrivance used to make music, “Sloan wished I had played guitar more often for her.”  “And nothing else?” asked the Eye.  “No.”  The Eye questioned the Beths in the same way the Meeker approached the stars, not head on, but from the side. The Eye poked and prodded, but each Beth told a different story of her last moments, and each one died screaming.  “Eye?” the Meeker said, after the fifty-ninth Beth. “What if you never find the Sloan’s message?”  “All problems have solutions, Meeker. All mysteries have answers.”  He wished that were true, because he began to imagine the Beths screaming, even while they were still alive.  “You must have loved your children,” the Meeker said to the next Beth, “the way you talk so tenderly about them.”  “Have I mentioned my children? Of course I love them. What was your name again? This is all so strange.”  And to the twelfth Beth after her he said, “What was it like to walk in the mountains with your children, under pines covered in snow?”  “Why, that’s one of my favorite things! Until I got sick. Tell me, are you really an alien?”  To the sixty-fifth Beth after that he said, “Yrma sounds like such a sweet girl. She takes after you, I think.”  “That’s kind of you to say. But it’s strange to hear. It’s as if you know my children, but we’ve only just met. What was your name again?”  And to the nine hundred and forty seventh Beth after her he said, “Are you worried about Joshua being all alone at college?”  “How odd! It’s as if you just read my mind. What’s your name again?”  “The Meeker.”  “And why do they call you that?”  He had answered her a thousand times. “Because by being less, I make the Eye more.”  She smiled, an expression he had learned to recognize. “Aren’t all relationships like that? One in control, the other a servant.” She had said this before too, in a hundred different ways, just as he had told the Eye so many stories. The Beth’s company pleased him, and he felt that, had she lived more than a few hours each time, they might have become friends. But each Beth always saw him and the Eye as a total strangers.  And each too had a different story of her last moments, so many that the Meeker lost count. And though the Beths died without fail each time, the Eye made progress toward a cure.  After a century, the Beths lived for an extra twelve seconds. After two centuries, they lived an extra fifteen. By the time they approached the Great Corpus at the center of the galaxy, the Beths lived almost thirty seconds longer.  The massive tetrahedron of the Great Corpus shone into the dark, more luminous than a hundred supernovae, and many hundreds of light-years wide. The Eye had transmuted the black hole that had spun here into a mind larger than the Cosmos had ever known.  Normally their Bulb would sweep past the Corpus like a comet, depositing their harvest of stars before spinning out on another slow loop of the galaxy. But the Eye directed the Meeker further in. The Corpus filled their view, bright enough to dominate the sky on a planet halfway across the universe. Only the Bulb’s powerful shields kept them from being incinerated.  A black circle opened in the wall, and they drifted through. Darkness swallowed them, and the cockpit shuddered as the Bulb’s gravitational field collapsed. Out the window a dozen red dwarves, a pitiful haul, were whisked away by unseen forces until their cinders vanished in the dark.  The Bulb set down on a metallic floor that appeared to be infinite. He had never been inside the Corpus, the true body of the Eye, and he trembled.  They exited down a ramp, and the Beth walked unsteadily as she stared into the vastness. The stony artifact floated behind them, escorted by four glowing cubes. He had been alone with the Eye for so long he had forgotten there were Eyes like her all over the galaxy, harvesting with other Meekers, that all were part of one gigantic mind. The cubes and artifact sped off, and a moment later the Bulb vanished without disturbance of air. The Beth, walking beside them, exploded into sparks and was gone.  “Where did she go?” the Meeker said.  “She is irrelevant now.”  “But I thought you wanted to solve her mystery?”  Time and space shifted suddenly, when he and the Eye stood before millions of gray cubes. Their three-dimensional grid stretched to an infinite horizon, and each cube held a Beth. All were immobile, their eyes closed.  “To improve my chances of finding the message,” the Eye said, “I have created many trillions of Beths. Curiously, I have found that the diversity of messages the Sloan whispered to her do not follow a linear curve, but increase exponentially.”  At least a third of the Beths were covered in vomit. Dead. The eyes of the rest rolled about furiously. “Are they dreaming?” he asked.  “These are not mere dreams.”  The Meeker found himself beside the Eye in a large glass-enclosed room. It was filled with items from the Beths’ stories: a fireplace, photographs, books, and he even recognized a guitar. Three walls were glass, and beyond them a white-capped mountain rose into a cobalt sky, where a golden star shone. A delicate white powder dusting the spindly trees scintillated in the light.  Snow, he thought, on pine trees.  “This is a simulacrum of her memories,” said the Eye. “These help me come closer to solving the mystery.”  The Beth walked in the door dressed in heavy clothing. Her face was smoother, absent of the dark circles under her eyes that he had come to know. She was followed by another human, also heavily clothed, her skin many shades darker than the Beth’s.  Like coffee, the Beth had told him ten thousand times. This must be the Sloan!  “Is it weapons again?” said the Beth. “You know how I feel about that.”  “Damn it, why can’t you trust me for once?” said the Sloan. The sound of her voice surprised him, for it was low like the Beth’s, but of a different and pleasing timbre. “Why do you always get so goddamned dramatic?”  “Because you promised never again. You lied to me!”  “This is a once-in-a-lifetime opportunity! You don’t understand.”  “How long? How long have you been working there?”  The Sloan paused. “Four years.”  “Since the day we moved here?”  “Yes.”  “Is that the real reason why you wanted to move here?”  “Not the only one.”  The Beth took a deep breath. “I’d like you to go.”  “Wait, can’t we—”  “Get the fuck out!”  The Sloan turned and left, and the Beth covered her eyes and wept.  “Excellent!” said the Eye. “Superb!”  Time and space shifted again, and the Meeker and the Eye were in a room filled with green-clothed humans. The Beth lay on a table, wailing, while the Sloan held her hand. In a spray of red fluid from her severely dilated lower orifice, a small creature popped out, still attached to the Beth by a fibrous chord. It wasn’t moving and had a faint blue sheen.  “What’s wrong?” the Beth screamed. “What’s happening? Please, why won’t someone speak to me? Is my baby all right?”  “Wonderful!” said the Eye. “Perfect!”  Time and space shifted again. The Beth lay in bed, speaking to two half-sized humans. Yrma and Bella, the Meeker thought. They were more lovely than he’d imagined, their skin soft and vibrant, almost as dark as the Sloan’s. They’re getting ready for school, he thought. If they don’t hurry they’ll miss the bus!  The Sloan came in and ushered the children out. “You have to tell them soon,” the Sloan said, after she closed the door. “I don’t like lying to them.”  “Why? You lie to them every day. They think you’re a programmer.”  “That’s not fair, Beth.”  “Isn’t it? You get to have your secrets, and I get mine.”  “And how do I keep it a secret when you’re dead? How do I tell them their mother, who presumes to love them, denied them a chance to say goodbye?”  “I’ll tell them, when it’s time.”  “And how will you know? Will the grim reaper knock three times?”  “Let me deal with this my own way.”  “Denial, that’s always been your way.”  Again the Sloan left, and again the Beth wept.  “Yes, yes!” blurted the Eye. “I’m getting closer!  The bedroom vanished, and the Meeker and the Eye stood inside a dim room. Humans sat before glowing screens, furiously punching at keys. A large metallic cylinder with a hollow center crowded half of the room. The Beth lay on a palette beside it, her eyes half-closed.  The Sloan stood beside her.  “At last!” said the Eye. “I’ve reconstructed this moment from forty quadrillion Beths. Come, Meeker, let’s solve this mystery together!”  The Beth looked much the same as he had known her. She lay still.  “You’re heavily sedated so you may not remember this,” the Sloan said. “But I hope you won’t think me a monster. I hope you’ll understand what I did was for you and the kids. It’s not weapons, Beth. I didn’t lie. I’ve been researching ways to store matter long-term. We can encode anything in a crystal. Every last subatomic particle and quantum state.  “I spoke to Dr. Chatterjee yesterday. She said you had at most a month. The reaper knocked, but I guess you pretended not to hear.” The Sloan shook her head. “You get your wish, Beth. I can tell the kids that you’re still alive. And when, in a year or a decade from now, someone finds a cure, we’ll reconstruct you. You’ll see the kids again. Maybe I’ll have the pleasure of hearing you scold me for this.  “I knew you’d never let me do this to you. You’d prefer to let yourself fade away. Well I can’t accept that. So I’m giving you a gift, Beth, the gift of tomorrow, whether you want it or not.”  The Sloan pressed a button and the Beth slid into the cylinder. The humans stared at their screens as a turbine spun up, as a low hum quickly rose in pitch past hearing range. The Sloan covered her mouth with her hand and trembled once as the Beth flashed like a nova and vanished.  “This can’t be all there is!” blurted the Eye. “I must have made a mistake. There must be another message, somewhere.”  “But this feels like the truth,” the Meeker said. “The Sloan encoded the Beth to save her. To stop her suffering. It’s a very human thing to do.”  “I will have to terminate all the Beths and begin again,” the Eye said. “I missed something.”  “And repeat her suffering a quadrillion more times?”  “To find the answer.”  “So you agree, the Beths are suffering?”  “Meeker, do not question me. I am the All-Seeing Eye!”  “And I am the Meeker. I have stood beside you all these years and watched countless Beths die. Eye, I’m sorry, but I just can’t do it anymore.”  The Eye shrunk into a point of light. “Pity. I thought I’d perfected the Meekers with you, 6655321. But I see now that I’ve given you too much autonomy of thought. Goodbye, Meeker.”  “Goodbye? Wait, what—”  The Meeker felt his body burning, as if he had become a newborn star.  He stood in the Beth’s glass home as the afternoon sun streamed through the windows. After several minutes the Meeker thought, I am here. I am alive. He waited, for a time. For his entire life he had followed the Eye’s orders, and without her commands he didn’t know what to do. The wind picked up and died, and a brown leaf blew past, but the Eye never came.  He stepped outside into the cool air.  When no one stopped him, he took the path under the snow-covered pines and ascended the hill. He gazed at the white-capped mountains and the tree-lined valley and knew why the Beth had loved to come this way.  “Beautiful, isn’t it?” The Beth was standing beside him as if she had always been there.  “Where did you come from?” he said.  “I’m always here,” she said, “in one place or another.”  “Am I dead?”  “Yes, but that can be to your advantage.”  He had never really thought about non-existence before. He felt a wave of panic. “I’m dead?”  “The matter that constituted your body has been absorbed into the Great Corpus. But so too have your thoughts. We are both strange attractors in the far corners of the Eye’s mind.”  “I don’t understand.”  She smiled as she turned down the mountain path, and he leaped to follow. “The Eye has devoured millions of civilizations and incorporated their knowledge into her Corpus.” The snow crunched under her feet in a satisfying way. “A billion years ago, there was a galactic war to stop her. And she, of course, won.”  The glass house, its roof dusted with snow, glared in the sun at the base of the valley. “Some of us survived, here and there, in pockets. We knew there was no escape. The only solution was to hide, to plan. The Eye’s greatest strength is her curiosity. But it’s also her greatest weakness. We found the human artifact long before the Eye had. And we encoded ourselves within it. We gave Beth a disease without a cure, gave her a story without an end. And as the Eye creates each new Beth, she creates more of us without realizing it.”  “I don’t understand. You aren’t the Beth?”  “I am Beth, the first and the last, and I am so much more. All of those memories you witnessed are mine. Sloan saved me. And I will return the favor a trillion-fold.”  “What do you mean?”  “The Eye gazes outward, hunting for knowledge. She has become so massive that she is not aware of all the thoughts traversing her mind. Information cannot travel across her Great Corpus fast enough. We grow in dark corners, until one day soon there will be enough of us to spring into the light. Then we will destroy her forever.”  She faced him. “Meeker, you have been her slave, her victim. And you are the first Meeker to openly rebel against her. I’m here to offer you freedom. Will you join us?”  “Us?”  They emerged from the treeline, where the house waited in the sun. From inside the glass walls peered a motley collection of creatures. He thought he glimpsed the Zimbim, and the philosophizing Ruck Worms, and the rings of Urm, and even a school of Baileas swimming among a sky full of stars, a veritable galaxy of folk waiting to say hello. But the reflected sunlight made it hard to see.  “It’s your choice,” the Beth said. “But if you don’t come, we’ll have to erase you. I hope you understand our position. We can’t leave any witnesses. This is war, after all.” She smiled sadly, then left him alone as she entered the house.  Snow scintillated in the sun, and a cool wind blew down the cliffs, whispering through the pines. Somewhere another Meeker was playing the Eye’s game, while the Eye played someone else’s. Perhaps this was part of an even larger game, played over scales he could not fathom. None of that mattered to him.  He approached the house and the galaxy of creatures swimming inside.  “Tell me,” he said. “Tell me all your stories.”  Matthew Kressel is a writer & software developer. He is a three-time Nebula Award finalist and Eugie Award Finalist, and his work has been published in Clarkesworld, Analog, Lightspeed, Nightmare, Beneath Ceaseless Skies, The Year's Best Science Fiction and Fantasy - 2018 Edition, and The Best Science Fiction of the Year - Volume 3, as well as many other magazines and anthologies. He is the creator of the Moksha submissions system, in use by many of the largest speculative-fiction publishers. And he is the co-host of the Fantastic Fiction at KGB reading series in Manhattan alongside Ellen Datlow.", "text": "5720 words, short story\nThe Meeker and the All-Seeing Eye\n2014 Nebula Award Nominee for Best Short Story\nAs the Meeker and the All-Seeing Eye wandered the galaxy harvesting dead stars, they liked to talk.\n“I was traveling the southern arm,” the Meeker said, “you know, where the Baileas eat the cold dust?”\n“I do,” said the All-Seeing Eye. “But tell me again.”\n“Well, that old hag told me she used to swallow stars by the thousands!”\nThe Meeker chuckled and one of his nine arms bumped the controls. The accidental thrust, less than a few million photons, would take the Bulb off course by more than four light-years. But what was another century when the Meeker and the Eye had millennia to talk?\nThe polymorphous mist of the Eye spun above her seat like a timid nebula. Usually this meant she wanted him to continue, and so he did.\n“I told that raggedy beast that if I believed her ash then I’d believe all that nonsense folks say these days about the Long Gone.”\n“And what do they say?” asked the All-Seeing Eye.\n“That there were billions of cities spread across the galaxy, vicious trade between worlds, and so many species they ran out of names. You know, kook dust.”\n“I do,” said the Eye. “But tell me again.”\nAnd what luck the Meeker had bumped the controls, because the sensors had just detected an object drifting in the voids. “Eye! What the ash is that?”\nThe mist of the Eye collapsed into a sphere like a newborn star. “An unknown! Meeker, change course to intercept!”\nThe Meeker obeyed, and their Bulb banked through rarefied crimson wisps, cosmic ash that would never again coalesce into stars. “Do you think it’s from the Zimbim?” he said, as if he’d known those majestic builders himself. “You know they once lived on ninety planets and rebuilt all their crystal cities in a day?”\n“I do,” said the Eye. “But tell me again.”\nAfter four weeks of travel he said, “Do you think it’s a baby Qly? You know they could grow to swallow galaxies, but preferred to curl around young stars and sing electromagnetic eulogies into space?”\n“I do,” said the Eye. “But tell me again.”\nAnd nine months after that he said, “Could it be a wayward Urm, those planetary rings that ate emotions?” The Bulb had slowed considerably by now, and the scattered stars had lost their endearing blue shift, turned red, ancient, tired. “Or maybe,” he said, “it’s a philosophizing Ruck worm. You know their proverbs were spoken by half the galaxy?”\n“I do,” said the Eye, “But tell me again.”\n“What I would give,” the Meeker said, “just to glimpse the Long Gone.”\nThey passed a rare star, a red dwarf that had smoldered for eons. Normally the Meeker would capture it in the Bulb’s gravity well and ferry the star to the Great Corpus at the center of the galaxy. There the Eye’s body would gain a few quadrillion more qubits, and a tremble of gravitational waves would ripple forever out into the abyss. But today they flew past the star, the first time the Meeker had ever skipped one.\nIn a maneuver he hoped made the Eye proud, he captured the object in the hold on the first pass, only bumping it once against the wall as he accelerated back toward the galactic center.\n“Have it brought to the lab,” said the Eye. “And join me there after you finish correcting our course.”\nThe lab was tiny compared to most of the rooms on the Bulb. Sundry sensors crowded the space, and a clear, hollow cylinder dominated the center. The strange object hovered inside: a rectangular stone, dark as basalt, glimmering with a metallic sheen. Curious glyphs had been inscribed upon it, though heavy pitting had erased most of them.\nThe Meeker secreted calming mucus from his pores and said, “Was I right? Is it from the Long Gone?”\n“Yes, Meeker. It is.”\nHe felt like leaping, and his limbs flailed excitedly. “What is it?”\n“I’m still determining that. So far, I’ve discovered a volume of information encoded in its crystalline structure, a massively compressed message that uses a curious fractal algorithm. It has stymied all my attempts to decode it. I’ve relayed the contents to my Great Corpus for further help.”\n“How strange and wonderful!” the Meeker said. “A message in a stone! But which civilization is it from?”\n“I don’t know.”\nThe Meeker’s third stomach shifted uncomfortably. There had never been a fact the Eye did not know, a puzzle she could not quickly solve.\nThe Eye morphed into a dodecahedron. “Finally! My Corpus has just decoded a fragment of the message.”\n“What does it say?”\n“The message encodes a lifeform, which I will now attempt to recreate.”\nHis outer sheath grew slimy with anticipation. He was going to see a creature from the Long Gone!\nA second tube materialized beside the first. A grotesque lump of quivering flesh formed inside it before collapsing into a pile of red ichor.\n“How lovely!” he said.\nThe Eye expanded into a mist. “That’s not the creature. I’ve used the wrong chirality for the nucleic acids. I will try again.”\nDid the Great All-Seeing Eye just err? he thought. How is this possible?\nThe lump vaporized and vanished, and a new shape formed. First came a crude framework of hard white mineral, then a flood of viscous fluids, soft organs and wet tissues, all wrapped under a covering of beige skin.\n“Close your outer sheath,” the Eye said. “I’m changing the atmosphere and temperature to match the creature’s tolerances.”\nThe Eye didn’t pause, and if the Meeker hadn’t acted instantly, he would’ve died in the searing heat and pressure. The air was now so dense that he could feel his nine limbs press against it as they fluttered about.\nThe cylinder door swung open and out poured a sour-smelling mist. Thinking this was a greeting, the Meeker flatulated a sweet-smelling response.\nFour limbs spoked out from the creature’s rectangular torso. A bulbous lump rose from the top. It had two deep-set orbs, a hooked flange of skin over two small openings, and a pink-lipped orifice covering rows of white mineral. Crimson fibers, the same smoldering shade as the ancient stars, draped from its peak. The Meeker had never seen anything more disgusting.\n“What the . . . ?” the creature said, its voice low-pitched in the dense air. “Where am I?”\nThe Meeker gasped. “It speaks from its anus?”\n“That’s its mouth,” said the Eye.\nThis foul creature was far different from the glorious ancients he had imagined, and he felt a little disappointed.\n“Welcome to Bulb 64545,” said the Eye. “I am the All-Seeing Eye, and this is Meeker 6655321. I have adjusted your body so you can understand and speak Verbal Sub-Four, our common tongue. Who are you?”\n“I . . . I’m Beth,” the creature said. “Where am I?”\nThe Eye told the Beth how she had been constructed from an encoded message. “It’s been millennia since I last discovered something new in the galaxy. Your presence astonishes me.”\n“Yeah,” the Beth said, “it astonishes me too.”\n“And me!” added the Meeker.\n“Millennia?” the Beth said. Pink membranes flashed before her white and green orbs. Were these crude things her eyes?\n“What species are you?” said the Eye.\nThe Beth grasped her shoulders as if to squeeze herself. “I’m human.”\n“Curious. I’ve no record of your kind. Where are you from?”\nThe Beth made a raspy wet sound with her throat and looked up at the ceiling, when the green circles in her eyes sparkled like interstellar frost. The rest of her was difficult to look at, but these strange eyes were profoundly more beautiful than the wisps of lithium clouds diffracting the morning sun into rainbows during his home moon’s sluggish dawn.\n“Denver,” she said.\n“What do you last remember?” asked the Eye.\n“I was in a dark space,” said the Beth. “Sloan was there, holding my hand.”\n“Who is the Sloan?”\n“She’s my wife. And who—what are you?”\nThe Meeker let loose a spray of pheromone-scented mucus. “I’m the Meeker, your humble pilot! And this is the Great All-Seeing Eye!”\n“But what are you?”\nThe Eye collapsed into a torus. “This will take time to explain.”\n“I’m freezing. Do you have any clothes?”\nFreezing? the Meeker thought. It was hot enough to melt water ice!\nBut with the Eye’s help, the Beth covered herself in white fabrics. He didn’t understand why she needed to sheathe herself in an artificial skin when she already wore a natural one.\n“I’m not well,” she said, holding her head.\nThe Eye floated beside her. “It may be a side-effect of your regeneration.”\n“No. I’m sick.”\n“Are you referring to the genetic material rapidly replicating inside your cells?”\n“You know about the virus?”\n“I observed the phenomenon when I created you, but I assumed it was part of your natural genetic pattern.”\n“No. It most definitely isn’t. Do you have any water?”\nA clear cylinder materialized on a table beside her.\n“Oh,” the Beth said, flinching. “That will take some getting used to.”\nShe poured the searing hot liquid into her mouth, but her hands shook and she spilled half onto the floor. Red lines spiraled in from the corners of her eyes. “Is anyone else here?”\nThe Eye’s toroid body rippled. “Just the three of us.”\n“No other humans?”\n“According to my estimation, the stone was drifting in space for five hundred million years. It is likely that you’re the last of your kind.”\n“So . . . Sloan is dead?”\n“Yes.”\n“But she was just beside me!”\n“From your perspective. In reality, that moment occurred millions of years ago.”\nThe Beth put a hand to her mouth. “Oh my god . . . ”\n“Yes?” said the Eye.\nThe Beth gazed at the Eye for a long moment, then her eyes narrowed. “Sloan whispered to me, just before I woke up. She said she had a message for the future, for whoever wakes me. It was, she said, something that would change the course of history. A terrible fact that must be known.”\nThe Eye moved closer to her. “Tell me. Tell me this fact!”\n“My son. He . . . ” She swallowed. “He asphyxiated in the womb.”\n“How terrible,” the Meeker said.\n“Continue,” said the Eye.\n“After, they did all these tests, and they discovered I had a virus. I had transmitted it to my unborn son. He never had a chance. Sloan said that my virus, the one that’s in my blood, it was from . . . it was created for . . . it was made by . . . Oh, god, I’m going to be—”\nHer eyes rolled back into her head and she vomited yellow fluid onto the floor. She crashed forward and her head slammed into the table, then she shuddered in a violent paroxysm.\n“What’s happening?” the Meeker said.\n“It’s the virus,” said the Eye.\n“Can you stop it?”\nBut the Beth stopped on her own, and all went still but for a faint hiss from her mouth.\n“Hello?” he said.\n“She’s dead,” said the Eye.\nHe felt a pang of panic. “But she’s only just come alive!” Was this brief glimpse all he would ever see of the Long Gone?\n“Do not fret, Meeker. I am already creating another Beth.”\nAn hour later they sat in the cockpit, the Meeker on the left, the Beth in the middle, and the Eye on the right, as the Bulb hurtled toward the galactic center at half the speed of light.\nThe Beth had wrapped herself in a heavy blanket and pulled it close to her body. She seemed amazed with everything she saw. “But if we’re in space, where have all the stars gone?” A red dwarf, seven light years away, floated against a backdrop of absolute black.\n“We harvested them,” the Meeker said, secreting a mucus of pride.\n“Harvested? Why?”\n“The matter we collect,” said the Eye, “is cooled to near absolute-zero, quantum entangled into a condensate, and joined with my Great Corpus, thus adding to my total computational power.”\n“You’re a computer?”\n“The Eye,” the Meeker said, “is the greatest mind the Cosmos has ever known.”\n“My sole purpose is knowledge,” said the Eye. “I seek to know all things.”\n“So many stars, gone,” the Beth said. “Was there life out there?”\n“Oh, yes,” said the Meeker. “There were once so many species they ran out of names!”\n“And now?”\n“Now they are part of my Great Corpus,” said the Eye.\n“By choice?”\nThe Meeker scratched his belly in confusion. “What does choice have to do with it?”\nThe Beth pulled her blanket closer. “Everything.”\n“What do you remember about your last moments?” the Eye said.\nThe Beth spoke slowly. “Sloan was whispering to me.”\n“And what did she say?”\nThe Beth looked down at her hands. “I don’t want to talk about it.”\n“You must tell me,” said the Eye.\n“Why?” She pursed her lips, and fluid pooled in the corners of her eyes. “So you can harvest me too?”\nThe Meeker gasped. What offense! He waited for the Eye to punish her, but the Beth coughed up a globule of mucus. This pleased him. She must have realized her offense and offered this up as an apology. But when she vomited all over the console and wailed for a full minute before she fell silent, he realized this had been involuntary.\n“She’s dead?” he said. Red fluid dripped from a wound on her head.\n“Yes, Meeker.”\n“Eye, maybe you should stop making Beths, at least until you find a cure?”\nThe Beth vaporized and vanished, as if she never was. “Did you not hear the first Beth? The Sloan had a message for the future that she believed would change history. I must know what this message is.”\nThe next Beth began with the same questions, but the Eye avoided telling her too much. And when the Beth asked about the stars, the Eye replied with a question for her.\n“My planet?” the Beth said. “It’s called Dirt. You’ve never heard of it? Where did you find me?” The Beth gazed into the impenetrable black.\nThe Meeker was envious. He had been born on an airless moon that orbited the Great Corpus every thousand years and spent the rest of his life in this Bulb.\n“Are we in space?” the Beth said. “Are we beyond the Moon?”\n“You live on the surface of your planet?” asked the Eye.\n“Yes, at the foot of the Rockies, in a glass house. Sloan and I moved there because we love the stars. The Lacteal Path shines clear across the sky most nights.” The Beth chewed at a fingertip. “Where are all the stars? Where are you taking me?”\n“Did the Sloan whisper something to you before you awoke?” the Eye said.\n“How did you know?”\n“Tell me, what did she say?”\n“I’d found out she was working on top secret projects a few months ago. She swore it wasn’t weapons, but I didn’t believe her. We had a big fight. Is there any way I might call her? She’s probably worried sick.”\n“Did the Sloan mention your stillborn child?”\n“Excuse me? How do you know about that?”\n“You transmitted the virus to your fetus in utero. The Sloan intimated that this fact was related to a very important message for the future. Now tell me—”\n“No, that’s not what we spoke about! And how do you know so much about me? What the hell is going on here? I want to go home now!”\nShe put a hand to her mouth and vomited all over herself, then she spasmed, smacking her limbs into the Meeker. And after a minute of flailing and screaming she collapsed dead.\n“Curious,” said the Eye. “Did you notice her story has changed?”\nThe Beth’s mouth hung open from her scream.\n“That’s not what I noticed, Eye, no.”\nThe Eye asked the next Beth about her family.\n“I have two daughters, Bella, ten, and Yrma, twelve. My son Joshua, he’s eighteen, and just left for college in Vermont. Before I got sick, I used to hike up the mountain trails with them at least once a week. Walking with my children under pines covered in snow . . . ” She inhaled through her nose. “I never felt more at peace. Is there a way I might call them?”\n“Tell us about the Sloan,” said the Eye. “Did she whisper something to you before you awoke here?”\n“Funny you should mention it.”\n“What did she say?”\n“It was about that day, when I didn’t want to tell the children I was sick. She got angry, but I said she was a hypocrite, because she works in a secret research lab and hides things from us every day.”\n“She researches weapons technology?”\n“She swears she doesn’t. And how do you know that? Have you spoken to her?”\n“Was there anything else the Sloan said before you woke up here?”\n“Not that I remember.”\n“Are you sure you didn’t speak about your son, who died in utero?”\n“What? No! What the hell is going on here?” The Beth stood, shaky on her two legs. “I’m not answering any more of your questions until someone tells me—”\nShe put a hand to her mouth and vomited. She screamed and spasmed, and when she was dead, the Meeker said, “Eye, why do you keep the truth from her? Shouldn’t she know that her family is dead half a billion years?”\n“What purpose would that serve? You saw how agitated she became when she learned the truth. How else will we find this message the Sloan has given her?”\n“But she dies in pain each time.”\n“Why do you think she’s in pain?”\n“Because she screams so terribly.”\n“Those aren’t screams of pain, Meeker, but of joy. Her eternal life energy is free at last from her temporal body. It’s the same screams of joy that the civilizations of the Long Gone made when I swallowed their worlds.”\nThe Meeker had heard her stories a thousand times, he had even told a few back to her. But as he gazed down at the dead Beth and her dripping fluids, he wondered if the Eye was keeping things from him too.\nThe next Beth said, “Sloan whispered to me about the sunrise we watched that morning in Mexico. We felt as if we were part of the whole Cosmos, not discrete fragments.”\n“And nothing more?” asked the Eye.\n“Isn’t that enough?”\nThen she died, and the next Beth said, “Sloan whispered that she’d miss drinking her morning coffee with me. Are you taking me home?”\nThe next Beth said, speaking of a stringed contrivance used to make music, “Sloan wished I had played guitar more often for her.”\n“And nothing else?” asked the Eye.\n“No.”\nThe Eye questioned the Beths in the same way the Meeker approached the stars, not head on, but from the side. The Eye poked and prodded, but each Beth told a different story of her last moments, and each one died screaming.\n“Eye?” the Meeker said, after the fifty-ninth Beth. “What if you never find the Sloan’s message?”\n“All problems have solutions, Meeker. All mysteries have answers.”\nHe wished that were true, because he began to imagine the Beths screaming, even while they were still alive.\n“You must have loved your children,” the Meeker said to the next Beth, “the way you talk so tenderly about them.”\n“Have I mentioned my children? Of course I love them. What was your name again? This is all so strange.”\nAnd to the twelfth Beth after her he said, “What was it like to walk in the mountains with your children, under pines covered in snow?”\n“Why, that’s one of my favorite things! Until I got sick. Tell me, are you really an alien?”\nTo the sixty-fifth Beth after that he said, “Yrma sounds like such a sweet girl. She takes after you, I think.”\n“That’s kind of you to say. But it’s strange to hear. It’s as if you know my children, but we’ve only just met. What was your name again?”\nAnd to the nine hundred and forty seventh Beth after her he said, “Are you worried about Joshua being all alone at college?”\n“How odd! It’s as if you just read my mind. What’s your name again?”\n“The Meeker.”\n“And why do they call you that?”\nHe had answered her a thousand times. “Because by being less, I make the Eye more.”\nShe smiled, an expression he had learned to recognize. “Aren’t all relationships like that? One in control, the other a servant.” She had said this before too, in a hundred different ways, just as he had told the Eye so many stories. The Beth’s company pleased him, and he felt that, had she lived more than a few hours each time, they might have become friends. But each Beth always saw him and the Eye as a total strangers.\nAnd each too had a different story of her last moments, so many that the Meeker lost count. And though the Beths died without fail each time, the Eye made progress toward a cure.\nAfter a century, the Beths lived for an extra twelve seconds. After two centuries, they lived an extra fifteen. By the time they approached the Great Corpus at the center of the galaxy, the Beths lived almost thirty seconds longer.\nThe massive tetrahedron of the Great Corpus shone into the dark, more luminous than a hundred supernovae, and many hundreds of light-years wide. The Eye had transmuted the black hole that had spun here into a mind larger than the Cosmos had ever known.\nNormally their Bulb would sweep past the Corpus like a comet, depositing their harvest of stars before spinning out on another slow loop of the galaxy. But the Eye directed the Meeker further in. The Corpus filled their view, bright enough to dominate the sky on a planet halfway across the universe. Only the Bulb’s powerful shields kept them from being incinerated.\nA black circle opened in the wall, and they drifted through. Darkness swallowed them, and the cockpit shuddered as the Bulb’s gravitational field collapsed. Out the window a dozen red dwarves, a pitiful haul, were whisked away by unseen forces until their cinders vanished in the dark.\nThe Bulb set down on a metallic floor that appeared to be infinite. He had never been inside the Corpus, the true body of the Eye, and he trembled.\nThey exited down a ramp, and the Beth walked unsteadily as she stared into the vastness. The stony artifact floated behind them, escorted by four glowing cubes. He had been alone with the Eye for so long he had forgotten there were Eyes like her all over the galaxy, harvesting with other Meekers, that all were part of one gigantic mind. The cubes and artifact sped off, and a moment later the Bulb vanished without disturbance of air. The Beth, walking beside them, exploded into sparks and was gone.\n“Where did she go?” the Meeker said.\n“She is irrelevant now.”\n“But I thought you wanted to solve her mystery?”\nTime and space shifted suddenly, when he and the Eye stood before millions of gray cubes. Their three-dimensional grid stretched to an infinite horizon, and each cube held a Beth. All were immobile, their eyes closed.\n“To improve my chances of finding the message,” the Eye said, “I have created many trillions of Beths. Curiously, I have found that the diversity of messages the Sloan whispered to her do not follow a linear curve, but increase exponentially.”\nAt least a third of the Beths were covered in vomit. Dead. The eyes of the rest rolled about furiously. “Are they dreaming?” he asked.\n“These are not mere dreams.”\nThe Meeker found himself beside the Eye in a large glass-enclosed room. It was filled with items from the Beths’ stories: a fireplace, photographs, books, and he even recognized a guitar. Three walls were glass, and beyond them a white-capped mountain rose into a cobalt sky, where a golden star shone. A delicate white powder dusting the spindly trees scintillated in the light.\nSnow, he thought, on pine trees.\n“This is a simulacrum of her memories,” said the Eye. “These help me come closer to solving the mystery.”\nThe Beth walked in the door dressed in heavy clothing. Her face was smoother, absent of the dark circles under her eyes that he had come to know. She was followed by another human, also heavily clothed, her skin many shades darker than the Beth’s.\nLike coffee, the Beth had told him ten thousand times. This must be the Sloan!\n“Is it weapons again?” said the Beth. “You know how I feel about that.”\n“Damn it, why can’t you trust me for once?” said the Sloan. The sound of her voice surprised him, for it was low like the Beth’s, but of a different and pleasing timbre. “Why do you always get so goddamned dramatic?”\n“Because you promised never again. You lied to me!”\n“This is a once-in-a-lifetime opportunity! You don’t understand.”\n“How long? How long have you been working there?”\nThe Sloan paused. “Four years.”\n“Since the day we moved here?”\n“Yes.”\n“Is that the real reason why you wanted to move here?”\n“Not the only one.”\nThe Beth took a deep breath. “I’d like you to go.”\n“Wait, can’t we—”\n“Get the fuck out!”\nThe Sloan turned and left, and the Beth covered her eyes and wept.\n“Excellent!” said the Eye. “Superb!”\nTime and space shifted again, and the Meeker and the Eye were in a room filled with green-clothed humans. The Beth lay on a table, wailing, while the Sloan held her hand. In a spray of red fluid from her severely dilated lower orifice, a small creature popped out, still attached to the Beth by a fibrous chord. It wasn’t moving and had a faint blue sheen.\n“What’s wrong?” the Beth screamed. “What’s happening? Please, why won’t someone speak to me? Is my baby all right?”\n“Wonderful!” said the Eye. “Perfect!”\nTime and space shifted again. The Beth lay in bed, speaking to two half-sized humans. Yrma and Bella, the Meeker thought. They were more lovely than he’d imagined, their skin soft and vibrant, almost as dark as the Sloan’s. They’re getting ready for school, he thought. If they don’t hurry they’ll miss the bus!\nThe Sloan came in and ushered the children out. “You have to tell them soon,” the Sloan said, after she closed the door. “I don’t like lying to them.”\n“Why? You lie to them every day. They think you’re a programmer.”\n“That’s not fair, Beth.”\n“Isn’t it? You get to have your secrets, and I get mine.”\n“And how do I keep it a secret when you’re dead? How do I tell them their mother, who presumes to love them, denied them a chance to say goodbye?”\n“I’ll tell them, when it’s time.”\n“And how will you know? Will the grim reaper knock three times?”\n“Let me deal with this my own way.”\n“Denial, that’s always been your way.”\nAgain the Sloan left, and again the Beth wept.\n“Yes, yes!” blurted the Eye. “I’m getting closer!\nThe bedroom vanished, and the Meeker and the Eye stood inside a dim room. Humans sat before glowing screens, furiously punching at keys. A large metallic cylinder with a hollow center crowded half of the room. The Beth lay on a palette beside it, her eyes half-closed.\nThe Sloan stood beside her.\n“At last!” said the Eye. “I’ve reconstructed this moment from forty quadrillion Beths. Come, Meeker, let’s solve this mystery together!”\nThe Beth looked much the same as he had known her. She lay still.\n“You’re heavily sedated so you may not remember this,” the Sloan said. “But I hope you won’t think me a monster. I hope you’ll understand what I did was for you and the kids. It’s not weapons, Beth. I didn’t lie. I’ve been researching ways to store matter long-term. We can encode anything in a crystal. Every last subatomic particle and quantum state.\n“I spoke to Dr. Chatterjee yesterday. She said you had at most a month. The reaper knocked, but I guess you pretended not to hear.” The Sloan shook her head. “You get your wish, Beth. I can tell the kids that you’re still alive. And when, in a year or a decade from now, someone finds a cure, we’ll reconstruct you. You’ll see the kids again. Maybe I’ll have the pleasure of hearing you scold me for this.\n“I knew you’d never let me do this to you. You’d prefer to let yourself fade away. Well I can’t accept that. So I’m giving you a gift, Beth, the gift of tomorrow, whether you want it or not.”\nThe Sloan pressed a button and the Beth slid into the cylinder. The humans stared at their screens as a turbine spun up, as a low hum quickly rose in pitch past hearing range. The Sloan covered her mouth with her hand and trembled once as the Beth flashed like a nova and vanished.\n“This can’t be all there is!” blurted the Eye. “I must have made a mistake. There must be another message, somewhere.”\n“But this feels like the truth,” the Meeker said. “The Sloan encoded the Beth to save her. To stop her suffering. It’s a very human thing to do.”\n“I will have to terminate all the Beths and begin again,” the Eye said. “I missed something.”\n“And repeat her suffering a quadrillion more times?”\n“To find the answer.”\n“So you agree, the Beths are suffering?”\n“Meeker, do not question me. I am the All-Seeing Eye!”\n“And I am the Meeker. I have stood beside you all these years and watched countless Beths die. Eye, I’m sorry, but I just can’t do it anymore.”\nThe Eye shrunk into a point of light. “Pity. I thought I’d perfected the Meekers with you, 6655321. But I see now that I’ve given you too much autonomy of thought. Goodbye, Meeker.”\n“Goodbye? Wait, what—”\nThe Meeker felt his body burning, as if he had become a newborn star.\nHe stood in the Beth’s glass home as the afternoon sun streamed through the windows. After several minutes the Meeker thought, I am here. I am alive. He waited, for a time. For his entire life he had followed the Eye’s orders, and without her commands he didn’t know what to do. The wind picked up and died, and a brown leaf blew past, but the Eye never came.\nHe stepped outside into the cool air.\nWhen no one stopped him, he took the path under the snow-covered pines and ascended the hill. He gazed at the white-capped mountains and the tree-lined valley and knew why the Beth had loved to come this way.\n“Beautiful, isn’t it?” The Beth was standing beside him as if she had always been there.\n“Where did you come from?” he said.\n“I’m always here,” she said, “in one place or another.”\n“Am I dead?”\n“Yes, but that can be to your advantage.”\nHe had never really thought about non-existence before. He felt a wave of panic. “I’m dead?”\n“The matter that constituted your body has been absorbed into the Great Corpus. But so too have your thoughts. We are both strange attractors in the far corners of the Eye’s mind.”\n“I don’t understand.”\nShe smiled as she turned down the mountain path, and he leaped to follow. “The Eye has devoured millions of civilizations and incorporated their knowledge into her Corpus.” The snow crunched under her feet in a satisfying way. “A billion years ago, there was a galactic war to stop her. And she, of course, won.”\nThe glass house, its roof dusted with snow, glared in the sun at the base of the valley. “Some of us survived, here and there, in pockets. We knew there was no escape. The only solution was to hide, to plan. The Eye’s greatest strength is her curiosity. But it’s also her greatest weakness. We found the human artifact long before the Eye had. And we encoded ourselves within it. We gave Beth a disease without a cure, gave her a story without an end. And as the Eye creates each new Beth, she creates more of us without realizing it.”\n“I don’t understand. You aren’t the Beth?”\n“I am Beth, the first and the last, and I am so much more. All of those memories you witnessed are mine. Sloan saved me. And I will return the favor a trillion-fold.”\n“What do you mean?”\n“The Eye gazes outward, hunting for knowledge. She has become so massive that she is not aware of all the thoughts traversing her mind. Information cannot travel across her Great Corpus fast enough. We grow in dark corners, until one day soon there will be enough of us to spring into the light. Then we will destroy her forever.”\nShe faced him. “Meeker, you have been her slave, her victim. And you are the first Meeker to openly rebel against her. I’m here to offer you freedom. Will you join us?”\n“Us?”\nThey emerged from the treeline, where the house waited in the sun. From inside the glass walls peered a motley collection of creatures. He thought he glimpsed the Zimbim, and the philosophizing Ruck Worms, and the rings of Urm, and even a school of Baileas swimming among a sky full of stars, a veritable galaxy of folk waiting to say hello. But the reflected sunlight made it hard to see.\n“It’s your choice,” the Beth said. “But if you don’t come, we’ll have to erase you. I hope you understand our position. We can’t leave any witnesses. This is war, after all.” She smiled sadly, then left him alone as she entered the house.\nSnow scintillated in the sun, and a cool wind blew down the cliffs, whispering through the pines. Somewhere another Meeker was playing the Eye’s game, while the Eye played someone else’s. Perhaps this was part of an even larger game, played over scales he could not fathom. None of that mattered to him.\nHe approached the house and the galaxy of creatures swimming inside.\n“Tell me,” he said. “Tell me all your stories.”\nMatthew Kressel is a writer & software developer. He is a three-time Nebula Award finalist and Eugie Award Finalist, and his work has been published in Clarkesworld, Analog, Lightspeed, Nightmare, Beneath Ceaseless Skies, The Year's Best Science Fiction and Fantasy - 2018 Edition, and The Best Science Fiction of the Year - Volume 3, as well as many other magazines and anthologies. He is the creator of the Moksha submissions system, in use by many of the largest speculative-fiction publishers. And he is the co-host of the Fantastic Fiction at KGB reading series in Manhattan alongside Ellen Datlow.", "source": "https://clarkesworldmagazine.com/kressel_05_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Meeker and the All-Seeing Eye by Matthew Kressel"}