{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Meghan Feldman", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "+fpwJlxHl3ZIw8PAkQtE7FplOhY=", "id": null, "license": null, "comments": "", "raw_text": "5430 words, short story  Beneath the Earth Where the Nymphs Sleep  Rana supposed she should feel flattered that the Council of Ages chose her to outlive all the gene techs who called the Enclave home. Some brainless techs would feel grateful. Especially if they had half-hacked implants and a price on their head like she did. But Rana had no intention of being trapped again, so she dismissed the Council’s summons with a twitch of her fingers. She couldn’t focus with the notification floating across the comm-implants in her eyes. With her mind stretched across the thousands of minuscule nano-bees that flitted across the landscape, any distraction would ruin her delicate equilibrium.  The bots moved from field to field in clouds of silver, ebbing and flowing beyond the Enclave’s walls. Rana nudged them along when they lingered; they wouldn’t be truly autonomous anytime soon. Normally her headaches didn’t start until she had been syncing with the swarm for hours, but her head was already aching after only one. And the Council’s incessant messages only made it worse. Rana commanded the bots to return. As they streamed back into their silvery hives along the outskirts of the Enclave, she pulled herself out of the tenuous trance that allowed her to sync with the swarm. She unstuck the control interface’s microneedles from her temples, and her self came flooding back all at once. A flash of pain burst behind her eyes. Just a few more days. Then the storms would flood the valley, and all the boroughs would be locked down for months. That’s when she’d leave. No one would be able to track her in those conditions, not even EdiTech with their drones that roamed the interborough plains. And by the time the storms passed, Rana would be long gone.  As the sun neared the horizon, it dipped the clouds in gold and sent bright ripples gilding the tops of the photobioreactors strewn across the landscape. They glowed green and red and brown, each filled with one of the algae strains designed specifically for biofuel, wastewater filtration, or to be bound into polymers. The Enclave was almost beautiful, but in the right light, so was EdiTech.  Invisible in the shadows, Rana slipped through the maze of hills that made up the Enclave. Looming overhead, bridges spiderwebbed between buildings and traced dark silhouettes against the deepening sky. She remembered the night she and Josalin had tried to escape EdiTech’s debts. They had crept through the compound, Josie clutching the key card she had stolen off of a distracted guard. They had just made it out of the compound when—pain spiked in the back of Rana’s head, and she forced away the memory with gritted teeth.  Now was not the time to wallow. She was going to leave the Enclave and never think about EdiTech again. She’d just reject the Council’s summons and give Elzibek her thanks. The Councilwoman had treated her injuries and bypassed the EdiTech lockouts and tracking controls in her implants, letting her heal in peace. She had given Rana her functionality back. Elzibek deserved a goodbye, at the very least.  Darkness cloaked the rise of the crypt hall where the husks of fallen satellite habitats twisted into the Council’s mausoleum. At the crest of the hill, a faint glow spilled out from the garden behind the hall. Rana followed its beckoning flicker.  Instar Elzibek crouched in the garden, her face hidden by her long gray hair that spilled over her shoulder. If the rumors were true, Elzibek’s hair had been white for so long that no one nor their grandparents remembered its original color. Another person reclined on the ground beside her, and a small brazier next to them sent glowing motes up to meet the heavens.  “Rana?” Elzibek turned as she approached. Hundreds of years had left their mark across her face. “I didn’t think you’d show up.”  “I didn’t think so either.” Rana hoped her voice sounded polite; conversation didn’t come easy after years of EdiTech’s isolation. A small part of her didn’t care.  Elzibek nodded and patted the ground next to her. “Sit.” She turned back to the reclining figure. His breath came in ragged gasps, thin like wisps of smoke, and dirt stained his Council robes. As Rana crept around him to sit on the opposite side of the fire, she studied his face. Surely she had seen him before. The Enclave was one of the smallest boroughs, and she was the only stranger in it.  “Is he alright?” He had the not-quite-alive look of someone decades deep into an EdiTech indenture.  “He needs some work, doesn’t he?” Elzibek muttered. With gentle fingers, she pushed up his sleeve. Beneath his robe, chitinous skin cracked under the slightest touch. “He just wanted one last look.” The man’s eyes stared up at the stars with all the luster of a fogged mirror.  “What’s wrong with him?”  “Instar Alizar’s gene mods are failing.” Rana looked closer at him; Alizar hadn’t looked that bad a week ago. Elzibek passed a mortar and pestle over the fire to Rana. Chunks of red ochre nestled in the bottom. “Make yourself useful.”  “Is he going to die?” Rana asked as she crushed the rocks into dust, grateful that Elzibek hadn’t asked why she was ignoring the Council’s messages.  “We’ll put Alizar back in chthonostasis and let the mod repair what it can, but it might not be enough. He may never reemerge. But even so, he won’t be dead.” Elzibek reached into a jar in front of her and scooped out a thick red paste with her fingers. The heavy smell of dirt and metal clogged Rana’s nose as Elzibek painted red streaks onto Alizar’s damaged skin.  “I thought the cicadidae mod kept you from dying.” That’s what all the gene techs had told Rana when her nomination went public, their eyes glittering with jealousy.  “Even perfect mods break down eventually. All Instars on the Council are born of the same batch of mods. When someone’s mods start failing, it’s a sign for all of us. We need more Instars. We need fresh blood.” Elzibek applied the paste around Alizar’s neck and temples, and it glistened in the firelight.  Rana shivered. Though she had only ever seen Elzibek and Alizar, she had been in the Enclave long enough to know that the Council of Ages had more than two Instars, but it had been decades since anyone had seen the others. She imagined herself in the crypts where the others slept, down in the gritty darkness with dirt pressing down on her nose and mouth and being unable to move or scream or take a breath. It’d be no different from EdiTech and everything she had sacrificed so much to escape from.  But EdiTech was behind her, and the Enclave had nothing to offer her. No one here could change what she’d done in order to escape; no one could absolve her of that. She gripped the pestle in her fist and avoided Elzibek’s gaze across the fire. Elzibek wouldn’t understand. And Rana didn’t want her to.  A man trudged up the hill. As he approached the fire, his features sharpened; Kevrik worked in the gene labs and often bothered Rana for help analyzing the mods they got from EdiTech for their algae. He knelt next to Elzibek.  “The techs have called a summit about the latest mods from EdiTech. None of the other boroughs got the mods we did, even though we all use the same algae strains. They’d like to hear from you before they make their decision.”  “Now?” Elzibek asked. “Surely this can wait until tomorrow?”  Kevrik shook his head. “Noon tomorrow’s the payment deadline for the mods. We’re already barely keeping up with the Enclave’s resource demand as it is. If we forgo these mods and our strains run into issues, then we’ll have to wait months for EdiTech to release a new batch of mods. It could take years for us to recover.”  “That’s assuming EdiTech’s mods are going to help the strains at all,” Rana muttered under her breath.  “We’ve never gotten a mod this different before.” Kevrik said, ignoring her.  “And there’s nothing our techs can do to reverse engineer it, to figure out what it does?” Elzibek asked.  “No. Our hardware isn’t good enough. We’ve been at it for weeks.” Kevrik’s eyes slid to Rana. “I don’t suppose you—”  “No.” She took a steadying breath. “No, I’ve already told you before. I can’t do anything without EdiTech’s gene interface.” And even if the Enclave did have a sophisticated gene interface like EdiTech’s, Rana wouldn’t have anything more to do with engineering gene mods. At EdiTech, she had spent her waking hours plugged into their massive supercomputer network, and it had used her mind and everyone else’s to churn through new gene variations. Her memories had slipped away with the hours until she remembered nothing before EdiTech except Josie. They had taken everything from her and left her drowning in fog.  Kevrik’s eyes narrowed. “Fine. Elzibek, EdiTech said they’d be sending a representative tomorrow to encourage negotiations.”  “Then I will be there to hear what they have to say.”  Kevrik nodded, but remained crouching next to Elzibek, fidgeting.  “Yes?” Elzibek fixed him with her piercing stare.  “If you had wanted an Instar who would devote their life to protecting the interests of the Enclave, there were plenty of other options,” Kevrik said.  Rana’s head snapped toward him. “Like I wanted them to—”  Elzibek held up a hand. “The Council always has its reasons, and the safety of the Enclave is always our first concern. We would not choose someone who would do our people harm.”  “But you would choose an outsider who doesn’t even want this responsibility? I know what my choice would be,” Kevrik said. “Do you know what I could accomplish with an extra few hundred years? We could have a colony—colonies—of pollinators. Real ones, not the bots. Resilient and efficient algae strains that wouldn’t require gene updates from EdiTech to meet the Enclave’s demands. Infrastructure powered by the flood cycles. We could be truly self-sufficient.”  “You could do all that watching your wife outlive you and die?” Rana asked, her voice low. “Watching your daughters grow old, start their own families, and die? You could save the Enclave and live with all that death following you?” Josie’s face flashed before Rana’s eyes, and her scream echoed in her ears.  “If it would help them too, then yes.”  “Then maybe the Council should choose you.”  “The Council has chosen Rana.” Elzibek said. “If she declines, they will choose another. Kevrik, I will join the summit shortly.”  Kevrik shook his head and stalked back into the gloom.  The fire dimmed to a ruby glow before either of the women spoke again.  “Why did the Council choose me?” Rana finally whispered. If the Council of Ages deemed her worthy, then maybe she could ignore the guilt that ached at the back of her skull. The mortar and pestle lay forgotten in her lap, the stone cup dusted with red.  Elzibek rubbed her finger against her lip as she thought, smearing it with the ochre. “You know EdiTech in ways the Enclave does not; your insight and experience would be invaluable for our survival.”  “You want to use me as a weapon against EdiTech.” The idea of being bound to EdiTech in such a permanent way made Rana’s stomach twist in knots.  Elzibek ignored her. “We rely on EdiTech for the algae mods that sustain our borough. We cannot produce these ourselves. And for decades, EdiTech—and their president in particular—has made it clear that they want access to our cicadidae mod. You can see how this puts us in a precarious situation.”  “Anvar Caladon wants the mod? Does he know about the side effects?” Rana asked, eying Alizar.  “He thinks he can improve it in ways we can’t. He wants the power with none of the sacrifice.” Elzibek turned to Rana, her eyes as bright and piercing as the fire between them. “What do you want, Rana?”  Rana leaned back and tipped her head toward the night sky. It glittered with stars, ships, and habs the size of small cities drifting in orbit. If she could just get there, she’d be out of EdiTech’s reach. People could disappear among the stars. She’d never have to think about Josalin again.  “I guess—” She almost admitted everything. How she had gotten the two of them tangled up with EdiTech. And how her plan to untangle them had gotten Josie killed. The words quavered at the tip of her tongue, ready to leap out of her mouth and condemn her. But Elzibek could not know the whole truth. Elzibek could not absolve her of what she’d done, and Rana would not let her try. The Enclave wanted her for itself, and she would not let it sink its claws into her. “I just want to be safe.” It wasn’t a total lie, but she knew she’d never be truly safe.  Elzibek’s eyes lingered on the horizon where the EdiTech facility glowed like the setting sun. “We all want to be safe. Even Caladon in his fortress.”  Rana laughed bitterly. “He’s nothing like the rest of us.”  “Alizar and I and the rest of the Instars are nothing like everyone else,” Elzibek said. “If you accept the mod, you won’t be either.”  Rana’s curiosity got the best of her. “What’s it like?”  “It changes you, just like any mod. You don’t notice the effects for a while, but eventually you see people change around yourself, faster than you’re changing. You blink and those people are gone, replaced by new faces. And after many years, many decades, you start to notice that your own mods aren’t as fresh as they once were.” Elzibek wasn’t looking at Rana anymore; she stared into the fire and the flames burned in her eyes. “The mod is a dam holding back time. And eventually time starts leaking through the cracks.”  “What made you do it?” Maybe Elzibek really was as selfless as she pretended to be. Or perhaps she was running from something too.  Elzibek turned her attention back to Alizar. “When I was seven, the storms came weeks earlier than the forecasts predicted. They hit hard and fast, and within a day, they had wiped the Enclave out to the plains. My family was gone.” Elzibek scrubbed her red hands on her threadbare cloak, and her voice faltered. “Everyone rebuilt. I begged them to move the Enclave out of the valley, but they said the Enclave had always been here, and here it would stay. And look around, Rana. We’re still in this valley. People carried on with their lives, but how could I? I asked to join the Council. I am the reason the Enclave has been rebuilt to withstand the storms. I am the reason the Enclave thrives even as the floods worsen. But my family is still gone. And so it is my burden to remember the past. My family was a sacrifice—the catalyst for transformation. I was a sacrifice of a different sort. We all make sacrifices, Rana.”  Rana knew plenty about sacrifice. She didn’t want any more. EdiTech had smothered her in a silk cocoon, and she would not stay in the Enclave and let them transform her into a different sort of unnatural creature. Just a few more days, and then the storms would come. And if she were lucky, the rain would wash away the Enclave and all of EdiTech with it.  Rana started awake when a blue mote lit up the corner of her vision—a comms message. Hopefully it was the Council rescinding their offer.  “Anvar Caladon is coming for you tomorrow.”  The message sent a shock through her body. No sender listed. Her implants didn’t even seem to recognize the sender’s system. It couldn’t be real.  She closed her eyes, focusing fully on the message. Calling up all accessible metadata, she melted into the message’s code, just like syncing with her swarm.  A string of data twisted in front of her, and she latched on, following it until she arrived at the sender’s identification code.  “Rana, run.”  Rana’s heart fluttered. It was impossible—  “Josalin?” Rana whispered. “Josie?” It couldn’t be her sister. She sent a pulse through the line to the sender, just a questioning ping.  “Delivery error: recipient not found,” flashed across her vision. Rana searched through the metadata again, but the sender and the messages were gone. Her heart hammered in her chest.  It couldn’t be Josalin. She’d seen the flash that had knocked her to the ground. No one got up after those pulses.  But Rana had seen the sender’s ID code. Josie’s genes were stitched into that ID and only death would render it inactive. EdiTech had gotten her sister, and now Anvar Caladon was coming to the Enclave to get her too.  Rana made it to the hive console just after midnight. She couldn’t leave the Enclave if the messages were genuine. She had to find Josie.  Settling down at the main console, Rana fitted the hive interface to her temples. When she opened her eyes, the swarm opened theirs. With a mental nudge, the bots burst into life with whirring wings and swirled out into the Enclave.  She sent the nano-bees out across the valley in waves and kept a handful buzzing around her head. If a convoy came from EdiTech to the Enclave, she would see it.  The dark landscape sped past as the swarm dispersed. Soon, the sleek, curving form of the EdiTech facility filled her vision a hundred times as her bots approached the compound. Her pulse raced. There, just outside the walls, she had lost Josalin. But maybe Josie wasn’t lost forever.  As Rana monitored the valley through the other nano-bees in her swarm, she noticed an armored EdiTech vehicle headed toward the Enclave. It would be there by morning. If she left the Enclave now, she could disappear before the convoy arrived.  But she couldn’t leave Josie. Not again. Rana drew close the cluster of bots around her head until she could feel their needle-sharp appendages pricking her scalp. Closer still she drew them, until their feelers found the remnants of the EdiTech implants still woven through her flesh. There were hardly any cracks in EdiTech’s façade. But Rana had thousands of bots and all night to look. Her swarm buried deeper—into the facility and into herself—as she searched for Josie’s signal.  A fine mist of bots swirled through EdiTech all night. Accessing an air handler here, sneaking under doors there. Her head throbbed, but she pushed the bots farther, searching for anything left of the signal she remembered.  There.  As the sun stretched over the horizon, the bots detected Josie—not from smell, and not from the message signature, but from something that was both and neither at the same time—just ahead.  Her swarm raged.  Rana tore the hive interface from her face. Her mind buzzed with anger and the nano-bees that still clung to her old implants.  Josie had been there all along.  The daylight burned her eyes, but she could still see through her swarm even with the interface removed. She could still guide them.  She had abandoned Josie.  Rana strode through the Enclave, half-seeing, half-sensing through her swarm, while the bots deep inside EdiTech surged forward to find her sister. At the west gate, the EdiTech convoy had parked just outside the borough. Guards flanked the vans.  Anvar Caladon stood at the Enclave’s walls. With his dark hair slicked back to a sheen and his clothes fitting him perfectly—tailored for him alone with no signs of mends or tears—Anvar Caladon looked like he had stepped out of the ads that flooded the refugee comm channels. Deep in an argument with Kevrik and Elzibek, he hadn’t seen Rana yet.  “Enough, Caladon.” Kevrik’s harsh voice broke through the buzzing that echoed in Rana’s ears. “We’ve made our decision.”  “Are you sure? The other boroughs know your Instar mods are failing. The Enclave’s prestige is slipping through your fingers. Don’t you want me to fix it? Don’t you want to truly live forever, like gods?”  “We are not gods, Caladon.” Elzibek joined Kevrik at the gate.  “But we could be. With the minds I could apply to the mod, it’d be perfect in no time.”  Rana knew the minds he was talking about. She had been one of those minds. And Josie was still one of those minds, if not something even worse.  Rana pushed past Kevrik and Elzibek and spoke as recognition crystallized across Caladon’s face. “I know about Josalin.”  Caladon’s eyes darted from the rips in Rana’s clothes to the silver bots that circled her head and lingered on the tufts of hair that Elzibek had hacked short to get at her implants. He smiled. “Ah, the other reason for my visit. Instar Elzibek, it seems you are harboring a known criminal.”  Elzibek barely glanced at Rana before she spoke. “She isn’t a criminal by our laws.”  “No? She is by EdiTech’s. Don’t you remember, Rana? A life for a life?”  “I didn’t kill anyone,” Rana said.  “Not the way EdiTech sees it. Our gene mods are life. It’s not a technicality to us. And you thought you could destroy a whole batch of them, years of work—”  “—your mods are dirty—”  “—and then abscond with EdiTech property—”  “—Josalin,” Rana shouted, squeezing her eyes shut tight. “Her name is Josalin. She wasn’t your property.”  “Enough of her was.”  Rana sent the swarm forward toward Josie. Except—something was wrong. Josie wasn’t here. There was nothing here. The swarm explored the space deep within EdiTech’s walls, their thrumming building into a roar. They weren’t in a room; they were in a locker full of wires and bloodied tubes. It smelled of flesh. Searching for Josie’s signal, Rana commanded the bots deeper into her skull, maximizing their connection with her implants.  But there was nothing else.  All that was left of Josalin sat there before her swarming eyes, an unrecognizable knot of metal and oozing tissue, blinking, and stuck with wires.  This couldn’t be right. Rana couldn’t make sense of it, not with her head aching and her mind split among all her swarm’s silvery minds. The swarm around her head whirled in a frenzy.  Josie had been dead, then alive, and now something else. Rana was powerless to re-form her or make her whole again. EdiTech had done this to her. And Rana couldn’t undo it, but she could end it.  “I know what you did to her. I found her.” Trembling, Rana sent her bots tearing through the space in a buzzing cloud of silver and gore. The cold, hard taste of metal filled her mouth as blood oozed from her scalp and smeared with her tears. She sank to her knees.  Josie was gone.  Caladon’s eyes darted, dismissing a notification. Then they glinted, hard and cold like a knife. “There was once EdiTech in you, too.” He crouched in front of Rana and, in an instant, grasped her skull between his hands. Bots trapped beneath his fingers wriggled as they wormed deeper into her implants, sending lances of pain through her head. “Perhaps we should crack you open and see how much is left.”  The buzzing grew to deafening levels, drowning out Elzibek’s and Kevrik’s shouts as the EdiTech guards closed in around them. Images from the nano-bees ghosted atop the Enclave—herself surrounded by her swarm, Josalin dead again and again, Anvar Caladon looming in front of her.  Rana took a breath, pulling the air deep into her lungs and holding it there. She wished she could stay like this—forever on the precipice, never jumping.  Hidden between moments.  Safe.  Caladon had told her she’d be safe if she stayed at EdiTech. If she ran, they would find her. She would end up like Josie. He had told her with a smile that bared all his teeth that she could stay at EdiTech even after everything she had done. They’d halve her debt. His teeth had gleamed like ivory in the moonlight, and his fingers, red with Josie’s blood, had reached toward her. EdiTech would help her. EdiTech was family. Bile rose in her throat.  Rana squeezed her eyes shut and exhaled. Though her head ached to the point she thought it would split, she sank into her swarm once more and threw them toward Caladon. The bots danced as they covered him from crown to shoulders, humming and vibrating and stinging in a single mass. As he howled and clawed at them, Rana staggered to her feet. Adrenaline pounded through her veins, and her hands left bloody smears on the earth.  “You showed Josie no mercy.”  She stopped. Wondered if this was the right thing to do. Anguish flooded all parts of her fractured mind, even the parts inside the silver bots that attacked Caladon as if it would make a difference. As if it would bring Josie back.  But the smallest part of Rana, the part left inside her head when the rest of her fled to the swarm, knew that it wouldn’t.  “Anvar Caladon, I will show you mercy. A life for a life. My debt is repaid.”  She couldn’t have done that a month ago. She couldn’t do it again. She wasn’t sure if she could live with her choice at all.  The nano-bees retreated to swirl around her head in lazy orbits, leaving Caladon gasping for breath. Under the morning sun, her swarm glinted like stars.  Rana followed Elzibek down the stone steps that spiraled into the earth beneath the crypt hall. A cool, damp breeze fluttered up as they descended, and in the dim light from Elzibek’s lantern, the stairs could have gone down forever. A dull pain throbbed in her head, and her stomach churned with nausea.  Josie was gone.  The steps opened into a cave with walls pocked like honeycomb. Some cells were filled, and others gaped with hungry maws. Red handprints reached out of the cells and climbed to the ceiling. Elzibek guided Rana onto a bench that ran along the wall. She removed a small canister from her pocket, and when she opened it, Rana recognized the smell.  “Don’t move.” Her voice had lost its usual sternness. Elzibek dipped her fingers into the canister and daubed the red paste along Rana’s temples where her wounds had clotted and scabbed. Warmth spread across her scalp.  Rana ached. She couldn’t leave the Enclave. EdiTech would never let her escape across the plains, no matter how high the floods rose. After what she had done, Caladon would snatch her up if she so much as stretched a finger outside the Enclave’s protective walls. She had nowhere to run. And it didn’t matter. Home had died with her memories and again with Josalin. She would never be home again. Josie was gone. And still Elzibek only worried about the cicadidae mod.  “Why did you bring me here?”  “To help you.”  “You think this is going to help me? You think this is going to bring my sister back or keep me safe from EdiTech?” Rana’s voice echoed in the cave, shouting back at her.  “No.” Elzibek looked away from Rana. The lantern splashed gold in the creases that bloomed across her face. She gestured at an empty cell on the opposite wall. “When my gene mods falter, this is where they’ll pack me into the dirt and let the mycelium keep me alive until my mods stabilize. If I’m lucky.”  The red paste’s earthy smell wafted down from Rana’s forehead, and she shivered. “Caladon really thinks being a god is worth this?”  “Those with power have always wanted to become gods no matter the cost. They forget that a god’s duty is to serve. Caladon will never understand that. We are nothing more than hostages from the past, representing the interests of those who have yet to come.”  “And you think the mod is worth all this too?”  “The earth has given us the mod as it is. We have changed her,” Elzibek said as she closed the canister and tucked it away. “And so we must change in return.”  Rana swallowed against the lump in her throat. Josie whispered in her ear, telling her to run. Josie’s voice always had sounded just like hers. “I want to leave. I—I don’t want this.”  “It’s not something that you should want,” Elzibek said, shaking her head. “To accept this mod is to give up yourself. To become something no longer—” she paused. Rolled a strand of gray hair between her fingertips. “—human.” Her whisper echoed in the cavern. “But everything changes. Stone transforms. Even the true void stretches and yields with time. To be stagnant is to be unnatural. Sacrifice is transformation, and transformation is life. Come,” Elzibek said, leading Rana from the crypt.  They continued down the stone steps in silence, deeper and deeper, until the stairs opened into a cavern. Twisting formations covered the walls and reached down toward Rana from above. In front of them, a pool, inky and flat, yawned into the distance past the reaches of Elzibek’s lamp.  “This is why the Enclave remains in the valley,” Elzibek whispered. She flicked off her lamp and darkness swallowed the cavern. As Rana’s eyes adjusted, the dark yielded to pinpricks of silver that wandered on the pool’s surface. An Elzibek-shaped shadow knelt at the pool, and a gentle ripple sent the glimmers dancing. The shadow stood.  “You’ll own nothing. Have no family. You won’t rule. You won’t be a hero.” Elzibek approached Rana and pressed a cold vial into her hand. “We are at the mercy of those who live and die faster than the briefest flash of lightning. If you do not act in their best interest, they will bury you and never dig you up.” Elzibek was invisible in the darkness, but sorrow dripped from every word. “You will live with the consequences of your choices for centuries. With the blame. The guilt. But this is how we transcend. This is how we transform. This is what the cicadidae mod can offer you.”  Rana couldn’t speak. She couldn’t live like that. She already had too much guilt inside raging like a blinding storm.  “Take it, or do not. It is your choice. It did not bring my family back, and it will not bring your sister back. But sacrifice can bring purpose. It can bring relief. But like all true sacrifices, it cannot be undone.”  Rana pocketed the vial and followed Elzibek out of the cavern. They climbed up and up and out of the earth. The vial tapped at Rana with every step.  The setting sun painted the horizon pink, and clouds threaded the sky like gossamer. Rana sat at the hive console at the edge of the Enclave, facing out toward the plains with the lights of EdiTech at her back. Her head throbbed even though her swarm slept soundly in their hives. Frogs called out to the rains, sensing them just beyond the curve of the horizon. Rana wormed her fingers into the dirt.  She’d never be free of her guilt. Even if she slogged to the neighboring borough through months of the heaviest storms. Even if she lost herself in a hab thousands of miles beyond EdiTech’s reach. She turned the vial end over end. The guilt would seep into her bones and haunt her for the rest of her life. Exhaustion settled over her like shroud, and a sob scratched its way out of her throat.  Maybe Elzibek was right, and the mod would bring relief. Rana had already sacrificed so much, but she could endure one more. A sacrifice to atone for all she’d done. One final sacrifice to fill the void that Josie’s absence left in her chest.  She’d sleep down in her crypt, breathing the dirt, while the heavens wheeled around her. She’d face Anvar Caladon again and again. It wouldn’t matter how deep he buried her. She’d claw her way out of the earth and challenge him as long as he lived.  For hundreds of years.  Elzibek would get the weapon she wanted after all.  Rana lifted the vial’s cap to reveal the injector and placed the thin, silvery needle against her skin.  She let it sting. Meghan Feldman grew up in rural southern Maryland. After studying Physics and Astronomy in Washington state, she moved to Texas to work for a NASA contractor. In her free time, she can be found dabbling in watercolor, playing violin, and bouldering. Meghan has been previously published in Analog.", "text": "5430 words, short story\nBeneath the Earth Where the Nymphs Sleep\nRana supposed she should feel flattered that the Council of Ages chose her to outlive all the gene techs who called the Enclave home. Some brainless techs would feel grateful. Especially if they had half-hacked implants and a price on their head like she did. But Rana had no intention of being trapped again, so she dismissed the Council’s summons with a twitch of her fingers. She couldn’t focus with the notification floating across the comm-implants in her eyes. With her mind stretched across the thousands of minuscule nano-bees that flitted across the landscape, any distraction would ruin her delicate equilibrium.\nThe bots moved from field to field in clouds of silver, ebbing and flowing beyond the Enclave’s walls. Rana nudged them along when they lingered; they wouldn’t be truly autonomous anytime soon. Normally her headaches didn’t start until she had been syncing with the swarm for hours, but her head was already aching after only one. And the Council’s incessant messages only made it worse. Rana commanded the bots to return. As they streamed back into their silvery hives along the outskirts of the Enclave, she pulled herself out of the tenuous trance that allowed her to sync with the swarm. She unstuck the control interface’s microneedles from her temples, and her self came flooding back all at once. A flash of pain burst behind her eyes. Just a few more days. Then the storms would flood the valley, and all the boroughs would be locked down for months. That’s when she’d leave. No one would be able to track her in those conditions, not even EdiTech with their drones that roamed the interborough plains. And by the time the storms passed, Rana would be long gone.\nAs the sun neared the horizon, it dipped the clouds in gold and sent bright ripples gilding the tops of the photobioreactors strewn across the landscape. They glowed green and red and brown, each filled with one of the algae strains designed specifically for biofuel, wastewater filtration, or to be bound into polymers. The Enclave was almost beautiful, but in the right light, so was EdiTech.\nInvisible in the shadows, Rana slipped through the maze of hills that made up the Enclave. Looming overhead, bridges spiderwebbed between buildings and traced dark silhouettes against the deepening sky. She remembered the night she and Josalin had tried to escape EdiTech’s debts. They had crept through the compound, Josie clutching the key card she had stolen off of a distracted guard. They had just made it out of the compound when—pain spiked in the back of Rana’s head, and she forced away the memory with gritted teeth.\nNow was not the time to wallow. She was going to leave the Enclave and never think about EdiTech again. She’d just reject the Council’s summons and give Elzibek her thanks. The Councilwoman had treated her injuries and bypassed the EdiTech lockouts and tracking controls in her implants, letting her heal in peace. She had given Rana her functionality back. Elzibek deserved a goodbye, at the very least.\nDarkness cloaked the rise of the crypt hall where the husks of fallen satellite habitats twisted into the Council’s mausoleum. At the crest of the hill, a faint glow spilled out from the garden behind the hall. Rana followed its beckoning flicker.\nInstar Elzibek crouched in the garden, her face hidden by her long gray hair that spilled over her shoulder. If the rumors were true, Elzibek’s hair had been white for so long that no one nor their grandparents remembered its original color. Another person reclined on the ground beside her, and a small brazier next to them sent glowing motes up to meet the heavens.\n“Rana?” Elzibek turned as she approached. Hundreds of years had left their mark across her face. “I didn’t think you’d show up.”\n“I didn’t think so either.” Rana hoped her voice sounded polite; conversation didn’t come easy after years of EdiTech’s isolation. A small part of her didn’t care.\nElzibek nodded and patted the ground next to her. “Sit.” She turned back to the reclining figure. His breath came in ragged gasps, thin like wisps of smoke, and dirt stained his Council robes. As Rana crept around him to sit on the opposite side of the fire, she studied his face. Surely she had seen him before. The Enclave was one of the smallest boroughs, and she was the only stranger in it.\n“Is he alright?” He had the not-quite-alive look of someone decades deep into an EdiTech indenture.\n“He needs some work, doesn’t he?” Elzibek muttered. With gentle fingers, she pushed up his sleeve. Beneath his robe, chitinous skin cracked under the slightest touch. “He just wanted one last look.” The man’s eyes stared up at the stars with all the luster of a fogged mirror.\n“What’s wrong with him?”\n“Instar Alizar’s gene mods are failing.” Rana looked closer at him; Alizar hadn’t looked that bad a week ago. Elzibek passed a mortar and pestle over the fire to Rana. Chunks of red ochre nestled in the bottom. “Make yourself useful.”\n“Is he going to die?” Rana asked as she crushed the rocks into dust, grateful that Elzibek hadn’t asked why she was ignoring the Council’s messages.\n“We’ll put Alizar back in chthonostasis and let the mod repair what it can, but it might not be enough. He may never reemerge. But even so, he won’t be dead.” Elzibek reached into a jar in front of her and scooped out a thick red paste with her fingers. The heavy smell of dirt and metal clogged Rana’s nose as Elzibek painted red streaks onto Alizar’s damaged skin.\n“I thought the cicadidae mod kept you from dying.” That’s what all the gene techs had told Rana when her nomination went public, their eyes glittering with jealousy.\n“Even perfect mods break down eventually. All Instars on the Council are born of the same batch of mods. When someone’s mods start failing, it’s a sign for all of us. We need more Instars. We need fresh blood.” Elzibek applied the paste around Alizar’s neck and temples, and it glistened in the firelight.\nRana shivered. Though she had only ever seen Elzibek and Alizar, she had been in the Enclave long enough to know that the Council of Ages had more than two Instars, but it had been decades since anyone had seen the others. She imagined herself in the crypts where the others slept, down in the gritty darkness with dirt pressing down on her nose and mouth and being unable to move or scream or take a breath. It’d be no different from EdiTech and everything she had sacrificed so much to escape from.\nBut EdiTech was behind her, and the Enclave had nothing to offer her. No one here could change what she’d done in order to escape; no one could absolve her of that. She gripped the pestle in her fist and avoided Elzibek’s gaze across the fire. Elzibek wouldn’t understand. And Rana didn’t want her to.\nA man trudged up the hill. As he approached the fire, his features sharpened; Kevrik worked in the gene labs and often bothered Rana for help analyzing the mods they got from EdiTech for their algae. He knelt next to Elzibek.\n“The techs have called a summit about the latest mods from EdiTech. None of the other boroughs got the mods we did, even though we all use the same algae strains. They’d like to hear from you before they make their decision.”\n“Now?” Elzibek asked. “Surely this can wait until tomorrow?”\nKevrik shook his head. “Noon tomorrow’s the payment deadline for the mods. We’re already barely keeping up with the Enclave’s resource demand as it is. If we forgo these mods and our strains run into issues, then we’ll have to wait months for EdiTech to release a new batch of mods. It could take years for us to recover.”\n“That’s assuming EdiTech’s mods are going to help the strains at all,” Rana muttered under her breath.\n“We’ve never gotten a mod this different before.” Kevrik said, ignoring her.\n“And there’s nothing our techs can do to reverse engineer it, to figure out what it does?” Elzibek asked.\n“No. Our hardware isn’t good enough. We’ve been at it for weeks.” Kevrik’s eyes slid to Rana. “I don’t suppose you—”\n“No.” She took a steadying breath. “No, I’ve already told you before. I can’t do anything without EdiTech’s gene interface.” And even if the Enclave did have a sophisticated gene interface like EdiTech’s, Rana wouldn’t have anything more to do with engineering gene mods. At EdiTech, she had spent her waking hours plugged into their massive supercomputer network, and it had used her mind and everyone else’s to churn through new gene variations. Her memories had slipped away with the hours until she remembered nothing before EdiTech except Josie. They had taken everything from her and left her drowning in fog.\nKevrik’s eyes narrowed. “Fine. Elzibek, EdiTech said they’d be sending a representative tomorrow to encourage negotiations.”\n“Then I will be there to hear what they have to say.”\nKevrik nodded, but remained crouching next to Elzibek, fidgeting.\n“Yes?” Elzibek fixed him with her piercing stare.\n“If you had wanted an Instar who would devote their life to protecting the interests of the Enclave, there were plenty of other options,” Kevrik said.\nRana’s head snapped toward him. “Like I wanted them to—”\nElzibek held up a hand. “The Council always has its reasons, and the safety of the Enclave is always our first concern. We would not choose someone who would do our people harm.”\n“But you would choose an outsider who doesn’t even want this responsibility? I know what my choice would be,” Kevrik said. “Do you know what I could accomplish with an extra few hundred years? We could have a colony—colonies—of pollinators. Real ones, not the bots. Resilient and efficient algae strains that wouldn’t require gene updates from EdiTech to meet the Enclave’s demands. Infrastructure powered by the flood cycles. We could be truly self-sufficient.”\n“You could do all that watching your wife outlive you and die?” Rana asked, her voice low. “Watching your daughters grow old, start their own families, and die? You could save the Enclave and live with all that death following you?” Josie’s face flashed before Rana’s eyes, and her scream echoed in her ears.\n“If it would help them too, then yes.”\n“Then maybe the Council should choose you.”\n“The Council has chosen Rana.” Elzibek said. “If she declines, they will choose another. Kevrik, I will join the summit shortly.”\nKevrik shook his head and stalked back into the gloom.\nThe fire dimmed to a ruby glow before either of the women spoke again.\n“Why did the Council choose me?” Rana finally whispered. If the Council of Ages deemed her worthy, then maybe she could ignore the guilt that ached at the back of her skull. The mortar and pestle lay forgotten in her lap, the stone cup dusted with red.\nElzibek rubbed her finger against her lip as she thought, smearing it with the ochre. “You know EdiTech in ways the Enclave does not; your insight and experience would be invaluable for our survival.”\n“You want to use me as a weapon against EdiTech.” The idea of being bound to EdiTech in such a permanent way made Rana’s stomach twist in knots.\nElzibek ignored her. “We rely on EdiTech for the algae mods that sustain our borough. We cannot produce these ourselves. And for decades, EdiTech—and their president in particular—has made it clear that they want access to our cicadidae mod. You can see how this puts us in a precarious situation.”\n“Anvar Caladon wants the mod? Does he know about the side effects?” Rana asked, eying Alizar.\n“He thinks he can improve it in ways we can’t. He wants the power with none of the sacrifice.” Elzibek turned to Rana, her eyes as bright and piercing as the fire between them. “What do you want, Rana?”\nRana leaned back and tipped her head toward the night sky. It glittered with stars, ships, and habs the size of small cities drifting in orbit. If she could just get there, she’d be out of EdiTech’s reach. People could disappear among the stars. She’d never have to think about Josalin again.\n“I guess—” She almost admitted everything. How she had gotten the two of them tangled up with EdiTech. And how her plan to untangle them had gotten Josie killed. The words quavered at the tip of her tongue, ready to leap out of her mouth and condemn her. But Elzibek could not know the whole truth. Elzibek could not absolve her of what she’d done, and Rana would not let her try. The Enclave wanted her for itself, and she would not let it sink its claws into her. “I just want to be safe.” It wasn’t a total lie, but she knew she’d never be truly safe.\nElzibek’s eyes lingered on the horizon where the EdiTech facility glowed like the setting sun. “We all want to be safe. Even Caladon in his fortress.”\nRana laughed bitterly. “He’s nothing like the rest of us.”\n“Alizar and I and the rest of the Instars are nothing like everyone else,” Elzibek said. “If you accept the mod, you won’t be either.”\nRana’s curiosity got the best of her. “What’s it like?”\n“It changes you, just like any mod. You don’t notice the effects for a while, but eventually you see people change around yourself, faster than you’re changing. You blink and those people are gone, replaced by new faces. And after many years, many decades, you start to notice that your own mods aren’t as fresh as they once were.” Elzibek wasn’t looking at Rana anymore; she stared into the fire and the flames burned in her eyes. “The mod is a dam holding back time. And eventually time starts leaking through the cracks.”\n“What made you do it?” Maybe Elzibek really was as selfless as she pretended to be. Or perhaps she was running from something too.\nElzibek turned her attention back to Alizar. “When I was seven, the storms came weeks earlier than the forecasts predicted. They hit hard and fast, and within a day, they had wiped the Enclave out to the plains. My family was gone.” Elzibek scrubbed her red hands on her threadbare cloak, and her voice faltered. “Everyone rebuilt. I begged them to move the Enclave out of the valley, but they said the Enclave had always been here, and here it would stay. And look around, Rana. We’re still in this valley. People carried on with their lives, but how could I? I asked to join the Council. I am the reason the Enclave has been rebuilt to withstand the storms. I am the reason the Enclave thrives even as the floods worsen. But my family is still gone. And so it is my burden to remember the past. My family was a sacrifice—the catalyst for transformation. I was a sacrifice of a different sort. We all make sacrifices, Rana.”\nRana knew plenty about sacrifice. She didn’t want any more. EdiTech had smothered her in a silk cocoon, and she would not stay in the Enclave and let them transform her into a different sort of unnatural creature. Just a few more days, and then the storms would come. And if she were lucky, the rain would wash away the Enclave and all of EdiTech with it.\nRana started awake when a blue mote lit up the corner of her vision—a comms message. Hopefully it was the Council rescinding their offer.\n“Anvar Caladon is coming for you tomorrow.”\nThe message sent a shock through her body. No sender listed. Her implants didn’t even seem to recognize the sender’s system. It couldn’t be real.\nShe closed her eyes, focusing fully on the message. Calling up all accessible metadata, she melted into the message’s code, just like syncing with her swarm.\nA string of data twisted in front of her, and she latched on, following it until she arrived at the sender’s identification code.\n“Rana, run.”\nRana’s heart fluttered. It was impossible—\n“Josalin?” Rana whispered. “Josie?” It couldn’t be her sister. She sent a pulse through the line to the sender, just a questioning ping.\n“Delivery error: recipient not found,” flashed across her vision. Rana searched through the metadata again, but the sender and the messages were gone. Her heart hammered in her chest.\nIt couldn’t be Josalin. She’d seen the flash that had knocked her to the ground. No one got up after those pulses.\nBut Rana had seen the sender’s ID code. Josie’s genes were stitched into that ID and only death would render it inactive. EdiTech had gotten her sister, and now Anvar Caladon was coming to the Enclave to get her too.\nRana made it to the hive console just after midnight. She couldn’t leave the Enclave if the messages were genuine. She had to find Josie.\nSettling down at the main console, Rana fitted the hive interface to her temples. When she opened her eyes, the swarm opened theirs. With a mental nudge, the bots burst into life with whirring wings and swirled out into the Enclave.\nShe sent the nano-bees out across the valley in waves and kept a handful buzzing around her head. If a convoy came from EdiTech to the Enclave, she would see it.\nThe dark landscape sped past as the swarm dispersed. Soon, the sleek, curving form of the EdiTech facility filled her vision a hundred times as her bots approached the compound. Her pulse raced. There, just outside the walls, she had lost Josalin. But maybe Josie wasn’t lost forever.\nAs Rana monitored the valley through the other nano-bees in her swarm, she noticed an armored EdiTech vehicle headed toward the Enclave. It would be there by morning. If she left the Enclave now, she could disappear before the convoy arrived.\nBut she couldn’t leave Josie. Not again. Rana drew close the cluster of bots around her head until she could feel their needle-sharp appendages pricking her scalp. Closer still she drew them, until their feelers found the remnants of the EdiTech implants still woven through her flesh. There were hardly any cracks in EdiTech’s façade. But Rana had thousands of bots and all night to look. Her swarm buried deeper—into the facility and into herself—as she searched for Josie’s signal.\nA fine mist of bots swirled through EdiTech all night. Accessing an air handler here, sneaking under doors there. Her head throbbed, but she pushed the bots farther, searching for anything left of the signal she remembered.\nThere.\nAs the sun stretched over the horizon, the bots detected Josie—not from smell, and not from the message signature, but from something that was both and neither at the same time—just ahead.\nHer swarm raged.\nRana tore the hive interface from her face. Her mind buzzed with anger and the nano-bees that still clung to her old implants.\nJosie had been there all along.\nThe daylight burned her eyes, but she could still see through her swarm even with the interface removed. She could still guide them.\nShe had abandoned Josie.\nRana strode through the Enclave, half-seeing, half-sensing through her swarm, while the bots deep inside EdiTech surged forward to find her sister. At the west gate, the EdiTech convoy had parked just outside the borough. Guards flanked the vans.\nAnvar Caladon stood at the Enclave’s walls. With his dark hair slicked back to a sheen and his clothes fitting him perfectly—tailored for him alone with no signs of mends or tears—Anvar Caladon looked like he had stepped out of the ads that flooded the refugee comm channels. Deep in an argument with Kevrik and Elzibek, he hadn’t seen Rana yet.\n“Enough, Caladon.” Kevrik’s harsh voice broke through the buzzing that echoed in Rana’s ears. “We’ve made our decision.”\n“Are you sure? The other boroughs know your Instar mods are failing. The Enclave’s prestige is slipping through your fingers. Don’t you want me to fix it? Don’t you want to truly live forever, like gods?”\n“We are not gods, Caladon.” Elzibek joined Kevrik at the gate.\n“But we could be. With the minds I could apply to the mod, it’d be perfect in no time.”\nRana knew the minds he was talking about. She had been one of those minds. And Josie was still one of those minds, if not something even worse.\nRana pushed past Kevrik and Elzibek and spoke as recognition crystallized across Caladon’s face. “I know about Josalin.”\nCaladon’s eyes darted from the rips in Rana’s clothes to the silver bots that circled her head and lingered on the tufts of hair that Elzibek had hacked short to get at her implants. He smiled. “Ah, the other reason for my visit. Instar Elzibek, it seems you are harboring a known criminal.”\nElzibek barely glanced at Rana before she spoke. “She isn’t a criminal by our laws.”\n“No? She is by EdiTech’s. Don’t you remember, Rana? A life for a life?”\n“I didn’t kill anyone,” Rana said.\n“Not the way EdiTech sees it. Our gene mods are life. It’s not a technicality to us. And you thought you could destroy a whole batch of them, years of work—”\n“—your mods are dirty—”\n“—and then abscond with EdiTech property—”\n“—Josalin,” Rana shouted, squeezing her eyes shut tight. “Her name is Josalin. She wasn’t your property.”\n“Enough of her was.”\nRana sent the swarm forward toward Josie. Except—something was wrong. Josie wasn’t here. There was nothing here. The swarm explored the space deep within EdiTech’s walls, their thrumming building into a roar. They weren’t in a room; they were in a locker full of wires and bloodied tubes. It smelled of flesh. Searching for Josie’s signal, Rana commanded the bots deeper into her skull, maximizing their connection with her implants.\nBut there was nothing else.\nAll that was left of Josalin sat there before her swarming eyes, an unrecognizable knot of metal and oozing tissue, blinking, and stuck with wires.\nThis couldn’t be right. Rana couldn’t make sense of it, not with her head aching and her mind split among all her swarm’s silvery minds. The swarm around her head whirled in a frenzy.\nJosie had been dead, then alive, and now something else. Rana was powerless to re-form her or make her whole again. EdiTech had done this to her. And Rana couldn’t undo it, but she could end it.\n“I know what you did to her. I found her.” Trembling, Rana sent her bots tearing through the space in a buzzing cloud of silver and gore. The cold, hard taste of metal filled her mouth as blood oozed from her scalp and smeared with her tears. She sank to her knees.\nJosie was gone.\nCaladon’s eyes darted, dismissing a notification. Then they glinted, hard and cold like a knife. “There was once EdiTech in you, too.” He crouched in front of Rana and, in an instant, grasped her skull between his hands. Bots trapped beneath his fingers wriggled as they wormed deeper into her implants, sending lances of pain through her head. “Perhaps we should crack you open and see how much is left.”\nThe buzzing grew to deafening levels, drowning out Elzibek’s and Kevrik’s shouts as the EdiTech guards closed in around them. Images from the nano-bees ghosted atop the Enclave—herself surrounded by her swarm, Josalin dead again and again, Anvar Caladon looming in front of her.\nRana took a breath, pulling the air deep into her lungs and holding it there. She wished she could stay like this—forever on the precipice, never jumping.\nHidden between moments.\nSafe.\nCaladon had told her she’d be safe if she stayed at EdiTech. If she ran, they would find her. She would end up like Josie. He had told her with a smile that bared all his teeth that she could stay at EdiTech even after everything she had done. They’d halve her debt. His teeth had gleamed like ivory in the moonlight, and his fingers, red with Josie’s blood, had reached toward her. EdiTech would help her. EdiTech was family. Bile rose in her throat.\nRana squeezed her eyes shut and exhaled. Though her head ached to the point she thought it would split, she sank into her swarm once more and threw them toward Caladon. The bots danced as they covered him from crown to shoulders, humming and vibrating and stinging in a single mass. As he howled and clawed at them, Rana staggered to her feet. Adrenaline pounded through her veins, and her hands left bloody smears on the earth.\n“You showed Josie no mercy.”\nShe stopped. Wondered if this was the right thing to do. Anguish flooded all parts of her fractured mind, even the parts inside the silver bots that attacked Caladon as if it would make a difference. As if it would bring Josie back.\nBut the smallest part of Rana, the part left inside her head when the rest of her fled to the swarm, knew that it wouldn’t.\n“Anvar Caladon, I will show you mercy. A life for a life. My debt is repaid.”\nShe couldn’t have done that a month ago. She couldn’t do it again. She wasn’t sure if she could live with her choice at all.\nThe nano-bees retreated to swirl around her head in lazy orbits, leaving Caladon gasping for breath. Under the morning sun, her swarm glinted like stars.\nRana followed Elzibek down the stone steps that spiraled into the earth beneath the crypt hall. A cool, damp breeze fluttered up as they descended, and in the dim light from Elzibek’s lantern, the stairs could have gone down forever. A dull pain throbbed in her head, and her stomach churned with nausea.\nJosie was gone.\nThe steps opened into a cave with walls pocked like honeycomb. Some cells were filled, and others gaped with hungry maws. Red handprints reached out of the cells and climbed to the ceiling. Elzibek guided Rana onto a bench that ran along the wall. She removed a small canister from her pocket, and when she opened it, Rana recognized the smell.\n“Don’t move.” Her voice had lost its usual sternness. Elzibek dipped her fingers into the canister and daubed the red paste along Rana’s temples where her wounds had clotted and scabbed. Warmth spread across her scalp.\nRana ached. She couldn’t leave the Enclave. EdiTech would never let her escape across the plains, no matter how high the floods rose. After what she had done, Caladon would snatch her up if she so much as stretched a finger outside the Enclave’s protective walls. She had nowhere to run. And it didn’t matter. Home had died with her memories and again with Josalin. She would never be home again. Josie was gone. And still Elzibek only worried about the cicadidae mod.\n“Why did you bring me here?”\n“To help you.”\n“You think this is going to help me? You think this is going to bring my sister back or keep me safe from EdiTech?” Rana’s voice echoed in the cave, shouting back at her.\n“No.” Elzibek looked away from Rana. The lantern splashed gold in the creases that bloomed across her face. She gestured at an empty cell on the opposite wall. “When my gene mods falter, this is where they’ll pack me into the dirt and let the mycelium keep me alive until my mods stabilize. If I’m lucky.”\nThe red paste’s earthy smell wafted down from Rana’s forehead, and she shivered. “Caladon really thinks being a god is worth this?”\n“Those with power have always wanted to become gods no matter the cost. They forget that a god’s duty is to serve. Caladon will never understand that. We are nothing more than hostages from the past, representing the interests of those who have yet to come.”\n“And you think the mod is worth all this too?”\n“The earth has given us the mod as it is. We have changed her,” Elzibek said as she closed the canister and tucked it away. “And so we must change in return.”\nRana swallowed against the lump in her throat. Josie whispered in her ear, telling her to run. Josie’s voice always had sounded just like hers. “I want to leave. I—I don’t want this.”\n“It’s not something that you should want,” Elzibek said, shaking her head. “To accept this mod is to give up yourself. To become something no longer—” she paused. Rolled a strand of gray hair between her fingertips. “—human.” Her whisper echoed in the cavern. “But everything changes. Stone transforms. Even the true void stretches and yields with time. To be stagnant is to be unnatural. Sacrifice is transformation, and transformation is life. Come,” Elzibek said, leading Rana from the crypt.\nThey continued down the stone steps in silence, deeper and deeper, until the stairs opened into a cavern. Twisting formations covered the walls and reached down toward Rana from above. In front of them, a pool, inky and flat, yawned into the distance past the reaches of Elzibek’s lamp.\n“This is why the Enclave remains in the valley,” Elzibek whispered. She flicked off her lamp and darkness swallowed the cavern. As Rana’s eyes adjusted, the dark yielded to pinpricks of silver that wandered on the pool’s surface. An Elzibek-shaped shadow knelt at the pool, and a gentle ripple sent the glimmers dancing. The shadow stood.\n“You’ll own nothing. Have no family. You won’t rule. You won’t be a hero.” Elzibek approached Rana and pressed a cold vial into her hand. “We are at the mercy of those who live and die faster than the briefest flash of lightning. If you do not act in their best interest, they will bury you and never dig you up.” Elzibek was invisible in the darkness, but sorrow dripped from every word. “You will live with the consequences of your choices for centuries. With the blame. The guilt. But this is how we transcend. This is how we transform. This is what the cicadidae mod can offer you.”\nRana couldn’t speak. She couldn’t live like that. She already had too much guilt inside raging like a blinding storm.\n“Take it, or do not. It is your choice. It did not bring my family back, and it will not bring your sister back. But sacrifice can bring purpose. It can bring relief. But like all true sacrifices, it cannot be undone.”\nRana pocketed the vial and followed Elzibek out of the cavern. They climbed up and up and out of the earth. The vial tapped at Rana with every step.\nThe setting sun painted the horizon pink, and clouds threaded the sky like gossamer. Rana sat at the hive console at the edge of the Enclave, facing out toward the plains with the lights of EdiTech at her back. Her head throbbed even though her swarm slept soundly in their hives. Frogs called out to the rains, sensing them just beyond the curve of the horizon. Rana wormed her fingers into the dirt.\nShe’d never be free of her guilt. Even if she slogged to the neighboring borough through months of the heaviest storms. Even if she lost herself in a hab thousands of miles beyond EdiTech’s reach. She turned the vial end over end. The guilt would seep into her bones and haunt her for the rest of her life. Exhaustion settled over her like shroud, and a sob scratched its way out of her throat.\nMaybe Elzibek was right, and the mod would bring relief. Rana had already sacrificed so much, but she could endure one more. A sacrifice to atone for all she’d done. One final sacrifice to fill the void that Josie’s absence left in her chest.\nShe’d sleep down in her crypt, breathing the dirt, while the heavens wheeled around her. She’d face Anvar Caladon again and again. It wouldn’t matter how deep he buried her. She’d claw her way out of the earth and challenge him as long as he lived.\nFor hundreds of years.\nElzibek would get the weapon she wanted after all.\nRana lifted the vial’s cap to reveal the injector and placed the thin, silvery needle against her skin.\nShe let it sting.\nMeghan Feldman grew up in rural southern Maryland. After studying Physics and Astronomy in Washington state, she moved to Texas to work for a NASA contractor. In her free time, she can be found dabbling in watercolor, playing violin, and bouldering. Meghan has been previously published in Analog.", "source": "https://clarkesworldmagazine.com/feldman_12_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Beneath the Earth Where the Nymphs Sleep by Meghan Feldman"}