{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Bo Balder", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "EBBCScUoHZ7E9kcA8n3gJ66aAoQ=", "id": null, "license": null, "comments": "", "raw_text": "9040 words, novelette  The Bridgegroom  The man who comes down the mountain causes the end of Alois’ life. It seems an ordinary sunny spring day; people venturing out and about again after a long cold winter. One such person is the old man leaning on his cane. Nobody special. Except that he suddenly stumbles, clutches his left arm, falls over, and dies.  Alois learns later that this man was the old bridgegroom.  It goes quickly. A knock on Alois’ door. His father is politely informed, his mother packs a change of clothing and Alois’ life is over. He and the youngest of the village elders walk up the mountain, and the next morning they walk through a dripping, echoing tunnel onto a ledge projecting over the glacier. Mr. Ritz gestures Alois over to the rock wall. A smooth plate of an unknown material is set in the wall. Alois is to put his hand on the right side. Mr. Ritz unwraps a lumpy object from his basket and pushes it next to Alois’ hand on the panel. It’s a withered, stinking old man’s hand. A light goes on deep in the panel.  Mr. Ritz unloads the rest of his basket at Alois’ feet and leaves with barely a nod goodbye.  Alois is alone in the silence and cold at the edge of the glacier. It’s so early the sky isn’t even blue yet. He can’t see the Bridge from here, but he’s noted its location on a map.  Up until now he’s felt numb, wrenched from his life two days ago and brought up here to start the rest of his life, but the misery is starting to seep through. The beauty of the sunrise pinkening the tops of the snowy mountains only makes him angrier. Nobody’s asked him if he wants this. Nobody’s explained why they picked him. What about his future?  He was only home from college to help out on his parents’ farm. He was going to be a doctor. And just like that, his life has been thrown away for a Bridge. A thing. Which supposedly needs a groom, whatever that means. Nobody has told him why the stupid Bridge isn’t just left to rust and rot in peace. It leads nowhere. The daily words and gestures they taught Alois make no sense.  Alois sinks down on his haunches. He hasn’t even had time to think, to feel. His parents were weepy but proud. His sisters and his little brother were in awe, probably not realizing they’d never see him again. He’s been too numb to even think of escaping. As the chill of the rocky ledge seeps up through the soles of his boots into his bones, escape is the one thought that surges up.  He’d be mad to stay, wouldn’t he? The village elders are idiots if they thought he would. He’ll have to cross the glacier and two mountain passes to get to the nearest town on the other side of the mountain range. He’ll just go back to university, or find a well-paying job, and make his own way into the world.  It’s very cold up here. The temptation to cry is great. But it would be so weak to give in to despair on day one. Alois gets up, surprised at the stiffness in his knees. He has a goal now. Get out, escape. Or—make sure no hapless boy will ever be sacrificed to the Bridge again? He wants that, but it might be too big for him. Maybe take it one step at a time. If he doesn’t save himself, he won’t be able to save anyone else.  He takes a look around the ledge he’s standing on, the glacier lake that laps at it, the silent beauty of the mountains all around him. His last look at a landscape without the Bridge. Nobody ever mentioned it, yet here he is, supposed to dedicate the rest of his life to guarding it. He takes a deep breath of ice cold mountain air and steps around the promontory.  He teeters on the edge of an abyss. Left are the gleaming red pylons of the bridge. To his right, a not even foot-wide extension of the path. He wheels his arms to keep his balance and not step onto the bridge.  His hand hits the rock wall at his back and he manages to lean against it and not tip over into the abyss. Finally he lifts his gaze to the Bridge itself.  Against the pale morning sky it thrusts out into nothingness, red and assertive. He can’t help but look straight into the tunnel of steel created by its squat cross beams. Steel X-ed windows show marching mountains to the left and a rubbled glacier to the right. It’s magnificent.  Who built it? Why build a Bridge over a glacier, for whose feet, to what end point? Alois can’t see any endpoint. Does it end in mid-air? Is it even finished?  A voice speaks, reverberating through his soles up to his face. “Good morning. I see they’ve found a new jailer for me.”  “I’m not your jailer! I’m your prisoner!” Alois blurts out, too shocked to guard his tongue.  “Yes, that’s what the last one said, too. In the end, what’s the difference? We’re condemned to each other. Only for me, you see, it lasts a lot longer. For you it’s merely a lifetime.”  Alois closes his eyes. He can’t even see where the voice is coming from, let alone make sense of why a Bridge would have a voice or such bitter feelings.  The cold mountain bores into his back and makes him shiver.  “Well, what are you waiting for? You’re going to have to cross me some time . . . ”  Alois forces his eyes open. There is no other end. There is just row after row of red metal crosses stretching into infinity. But the disembodied voice is right. He can stay here in the cold and starve, or walk the clingway. His hand finds a stiff rope, but he is too afraid to turn his neck. The gleaming red surface of the Bridge does seem to be the only safe place.  He can’t lift his feet. He can’t even move his eyes, although he badly wants to see beyond the bridge. There must be mountains there, but his perch seems too precarious to risk a flutter of an eyelid.  “You’re scared shitless,” the voice crows. “Are you going to be one of these really short-lived grooms? Some of them don’t even last a day. Took a misstep. Threw themselves into the abyss. Isn’t life better than death? Not for me, of course. I’d take death over this cramped, frozen existence. But for your kind, life is change, life is essential.”  Alois’ teeth clatter.  “Breathe, kid, breathe! Or not. But I don’t think humans can hold their breath until they die. My memory banks say you can’t.”  “What’s a memory bank?”  “Ah. Student? Of what?”  “Medicine,” Alois forces out.  “Nice. I’m glad they picked someone intelligent. That’s always better.”  “Better? Better?” Alois gets so angry he takes a step forward, millimeters from the unnaturally gleaming red Bridge surface. “Better at jailing me? Punishing me?”  “No, you still got it backward. They’re punishing me.”  “By making me marry you? Are you a girl bridge?”  Another voice, a middle-aged female voice, cackles loud laughter. “I can be, if it makes you more comfortable. I don’t care. Bridges don’t have genders.”  “Bridges don’t have voices either,” Alois says. Just having taken that first step has lessened his fear. He stretches out his gloved hand as if to touch the red banister. “Where are you hiding?”  “Take off the glove,” the Bridge says, in a smooth young girl’s voice. “Touch me.”  Alois flushes. He touched a girl’s belly just above her waistband, once, when she kissed him at the fair. He knows it is foolish to touch frozen metal, but he takes off the glove anyway and puts a finger on the banister, cringing from the cold before he’s even touched it.  The metal is blood-warm. Alois squeaks in surprise.  “I’m not exactly alive,” the first, male, voice says, amused, “but I need to keep my temperature up or my parts freeze. Well, not quite parts. I used to have something similar to parts, but they disabled that.”  Alois shakes his head to dispel the persuasive voice as it goes on and on, clearly having a good time all by itself. “I don’t know what you’re talking about.” But he understands the bit about keeping warm to be able to move. That goes for farm machinery as well as human hands. Gingerly he lays his hand back onto the warm metal. Like frozen blood, it looks, but it’s as warm as a metal tool you’ve held in your hand until it takes on your body temperature. How does the heat not leak out into the cold cold air?  He decides to ignore the voice for now and look for the cottage at the end of the clingway. It’s a long walk. At the midpoint, he looks down. Vertigo strikes him hard. He’s on the verge of falling onto hands and knees, only stopped by the knowledge that the ledge isn’t wide enough for that.  “Maybe I should have warned you,” the voice says. “It takes some of you that way. The fear of falling, right? The crocodile part of your brain sees the chasm but doesn’t grasp the parapet. Must be awful to be trapped in a meat dress complete with your ancestors’ cast off instincts.”  Alois doesn’t get all of what the voice is saying, but he can understand the hateful intent. “Why are you so angry with me? What did I do to you?”  “I’m not angry with you as a person,” the voice says. “Although that will likely happen as well. But with you as a race. You bound me for eternity, and made it worse by sending me hapless jailers every ten to twenty years or so. I have to train up my own prison guards. How unfair is that?”  Alois manages to move another foot. If he focuses on the ledge and the blue sky, the abyss isn’t so threatening. “That depends on what you did,” he says. He doesn’t want to make the voice, the Bridge, angry at him personally. Maybe it deserves its punishment. Why has nobody told him about this?  The Bridge sighs. “Little ignorant nub of humanity, you don’t know what you’re asking. Before I can tell you what I did wrong, I have to educate you for years. In science, in history, in biology, and ethics. Do you want that?”  Wow. Part of him does. He still wants to run away and never return, but wow, all that knowledge. Learning from a being that is wiser and more ancient than the most famous professor at the university.  “I have to think about that,” he says.  “Good answer,” the Bridge says. “Maybe you need to get over to the other end and get a start on surviving, first?”  Alois doesn’t want to dignify that with an answer. He manages to lift a foot, and as long as he doesn’t look at the mountains, and the way their slope suggests the chasm beneath his feet, he is fine.  The clingway ends on another ledge. A steep but wider path zigzags downwards and up again over a sharp ridge of rock. As soon as Alois’ arms can swing freely, his dizziness and fear go away. The sun is high in the sky already, as if he’s spent hours and hours on the clingway. Can it have been that long? But he doesn’t want to look back and find himself engaging with the voice again.  He starts down the path, his stiff knees limbering up quickly from the exertion. As he crosses the ridge, he catches sight of a gray-burned sloped roof, and moments later, the rest of the cabin comes into view. He checks to see if he is out of sight of the bridge. He is. The previous inhabitant or inhabitants of this modest cabin must have shared the aversion of looking at the bridge.  A stream gurgles by the well-trodden path, a couple of cows low inside a rock-enclosed pasture. At the house entrance, a goat yanks hungrily at its chain, having eaten all it can within the circle.  The familiar need to take care of animals before yourself drags him into getting water from the stream, re-tethering the goat, milking the cow, and grabbing a few onions from the small kitchen garden. The house is built on stilts, protected by large flat rock plates against rodents and rabbits, like the grain stores down in the valley.  Finally he can enter the house and shut out the blueness of the sky, the red thing that looms over the ridge.  The cabin is modest but well-enough appointed for a single occupant. A chair, a table, and a bed, shelves lining the walls. The furnishing tends to craftily stacked rocks rather than wood, but that’s logical because of the lack of trees at this height. Alois’ existence here is going to be frugal and barely comfortable, but he’s used to that from university and tending his father’s cows in summer, high on the village pastures.  It’s only afternoon but he is exhausted. He makes a fire in the neatly prepared fireplace, boils water with some mint leaves, fries the onions with the pat of butter he finds in the cold storage. From now on he’s going to have to churn his own.  He crawls into bed and falls asleep at once.  A cock crowing wakes him before dawn. He’s swung his legs out of bed before he can think, ready to stagger outside to milk the cows and feed the chickens, his usual summertime chores. He bangs his head hard against the lintel and falls down the stone steps into the kitchen garden. The silhouette of the mountains against the pre-dawn sky is wrong, and yesterday pops back up.  The Bridge.  He is in the former bridgegroom’s cabin. Glad to have chickens, remorseful about not having fed them yesterday. His mind must have been fogged with shock and tiredness. He goes back for his thick parka and boots, and sets about starting a useful day. God, he’s slept in the old groom’s stinky bed. Outside with those blankets, into the wash the sheets.  He stops. Mr. Ritz left him stuff, back at the ledge. Those bags will contain sheets and other linens, even clothes, probably to last him a lifetime. If he can manage to carry it over the narrow clingway without falling off. Weekly deliveries, Mr. Ritz also said.  He’ll have to relearn the skill of knitting socks and spinning yarn from the sheep and goats he’s seen roaming around. Good. Except he won’t because he isn’t going to stay here that long. It is spring, so he’ll have to leave before midsummer to make it somewhere far enough away. If he leaves just after the weekly delivery it’ll be a week before they discover he’s gone. More if he makes a habit of not showing himself at delivery day.  The kitchen garden is in fairly good order. He recognizes the beginnings of onions, garlic, carrots and beets, and maybe potatoes. They’ll have to be a hardy kind to grow this high. No grain. There would be no bread in his future unless the village sent it up. He can almost smell his mother’s weekly baking, the chewy crust, and the coarse, gray, flavorful insides.  There might be some in Mr. Ritz’ supplies. There probably are. He can’t let good food go to waste, can he?  He really, really doesn’t want to return to the Bridge and face that amused, knowledgeable voice again. But he can’t give himself permission to stay here today, no matter how useful he can make himself. There’d be food from home in those boxes, stuff he needs. Knitting needles, a knife, pans maybe. A spade. Writing paper and ink.  Maybe even a letter from his mother.  That decides it. He laces his boots tighter, buttons up his coat, wraps his scarf, his hat—knitted by his grandmother—and sets out for the bridge.  The moment he can see over the ridge, the Bridge’s presence presses on his shoulder like a heavy hand. He shakes his head to clear his ears, but it’s nothing audible. Maybe it’s a vibration in his bones, in his teeth that sets him so on edge. From this vantage point, the clingway isn’t that long at all.  “There we are,” the disembodied voice says. “You went to bed early. Did you have a nice breakfast?” For all the world like a concerned uncle to whom you’d been loaned out for the haying. The bridge’s thick beams shine enamel red against the pale morning sky. It hasn’t changed since yesterday, not a snowflake or a drop of dew on it. Unnatural.  Alois hasn’t had breakfast, in spite of his intention to fry a load of eggs. He’ll have to go back or burrow into the supplies on the ledge. “What did the other guardian do on his first day?”  “It’s been thirty years, my boy. Why would I remember?”  “I know you do,” Alois says. “Don’t play games with me all the time. Talk straight for once. Why am I here?”  He hadn’t meant to go into that before getting the supplies and settling into the cabin. But here he goes, engaging the malevolent creature in the exact way he wanted to avoid. He inches onto the clingway, intent on making it to the other end in silence.  The Bridge makes a humming sound, somehow setting the rocks abuzz beneath his feet. The vibration rattles his teeth and hurts his stomach. “Stop that.”  “I can make it worse,” the voice says. “Humans are so fragile. And yet fertile and omnipresent, like rats.”  “Just stop the games. Tell me what you want from me.”  Alois decides he’ll just pretend to engage, diverting its attention, while he walks across and finds something to eat. He reaches the ledge without further problems. So far, the Bridge has teased and threatened and not actually done anything. It isn’t possible to kill someone with sound, is it? The thought distracts him while he digs through Mr. Ritz’ neat bags.  The bread’s hard and cold. He should have brought it with him yesterday. The Bridge has scored a small victory over Alois, confusing him so he staggered to the cabin without bringing any provisions. Alois rummages until he’s found a salami stick and a knife to saw at the bread. He sits down to have his belated breakfast.  The food in his stomach makes Alois feel stronger. “How can I tell if you speak the truth or not?”  “You can’t.”  “Do you always speak the truth?”  “Yes.”  “Do you always lie?”  “Yes.”  Alois sighs. He vaguely remembers a seminar on logic, but clearly the Bridge lies whenever it pleases, so he can never be sure about it. Maybe there are no rules for demons, like for human beings.  “Under what conditions would you speak the truth to me?” he asks.  The voice is silent. At last it speaks. “A very astute question. At the moment, I can’t give you exact conditions, but I suggest that absolute truthfulness on your part would be a good start. Perhaps in the future we will be able to trust each other.”  “Are you a god or a demon?” Alois asks.  “What’s the difference?”  “Gods are good, demons are evil.”  “I like to think I’m a mix of both,” the voice says. “You?”  Alois thinks about it. “Mostly good, because I’m still pretty young, but I did some stupid stuff.”  “Like what?”  “Get drunk. Cheat for an exam. Slack off work when my dad isn’t looking. Steal cookies.”  “Piddling stuff, seems to me. They always pick good people as my jailers.”  “I guess. Your sins must be huge, keeping you locked up here for so long. How long has it been?”  The Bridge quivers. The reverberations gave Alois goosebumps. “A very, very long time. So long that apparently your people don’t remember what I did anymore. Or maybe they just didn’t tell you.”  Alois finishes his breakfast and searches through provisions. No books, no papers, no letters. “I don’t know. They just took me from my parent’s house with no explanation. Except that it is my holy duty to watch over you and not to let you escape.” And something else. Words he was meant to say daily. He forgot to do it yesterday. He mutters them quickly.  “And?”  “And what?”  “Are you going to watch over me and not let me escape?”  “I just want to get out of here and get back to my life,” Alois says. “And that’s the truth.”  He should make a plan, not sit here and chat with the ancient evil thing. First, lug the bags to the cabin. Assess his food situation. Next, explore. He hoists the first bag onto his shoulders and steps onto the clingway. The Bridge is silent. Good. He needs all his focus not to fall into the abyss.  Lugging his food and other provisions across the clingway and over the hump takes up several hours. Alois checks and feeds his chickens, skinny cows, distrustful sheep and leaves food for the goats. A stinking mud pit and a broken boma suggests that at one time pigs lived up here. Well, maybe they survived on their own. He’ll find out some other time.  He discovers a few petrified loaves of week-old bread, which suggests that the old bridgegroom got regular supplies. He soaks them in cow’s milk, spices the porridge with salt and juniper berries, and eats well. Then he intends to settle on the bench to start a pair of socks with the knitting needles and roughly spun wool he’s found, but after only a few minutes it seems a lonely way to pass an evening. He still has hours before the sun sets.  He rolls up his knitting and hikes back to the Bridge. There is a spot there, angled South and West, from where he can just see the Bridge and feel the sun on his face. From the flat stones stacked there and the comfortable moss against his back he guesses he isn’t the first person to sit here.  Time to open negotiations while he knits on. His opening bid is silence. He is halfway the foot when the voice speaks.  “So you want to escape,” the Bridge says. “Or are you just starting the first of fifty pairs of socks to get you through the winter?”  The first bite.  “Yeah. Babysitting you seems like a waste of my life. I could save people’s lives if I finished my degree. All I have to offer the world up here is boredom.”  “I see some possessions and a hobby have made you feel better.”  Alois nods and knits on.  “Maybe I can offer some assistance in your getaway,” the voice goes on.  “Oh? How?” Alois asks.  “I can show you the routes the ones that never returned took. And the routes that killed a few others. I know which pass is lowest and gives you the best chance to return to your university.”  “How? It’s not as if you can walk ahead of me.”  “Look at the walkway.”  On the crystalline surface a picture appears. It has colored shapes, dots and wiggly lines.  “It’s a map,” Alois says.  “Yes. I’ve got maps of the entire world.”  “Is this a map of the valley?”  “A map of the continent. This is your valley.”  The map changes. Alois blinks away a sudden dizziness. He looks closer. There are names there that he almost recognizes. That’s the name of his village, if spelled weird, that is the market town his father goes to twice a year. And that’s the name of the ruins that lie beyond it.  “This is an old map!” he says. “Worthless. There haven’t been people living there for hundreds of years.”  “Well . . . yes. But the mountains haven’t changed in that time. Trails may not have been walked much, but they must still exist.”  If the Bridge thinks that, it’s a fool. The snow, the frosts, and the avalanches are quite capable of destroying the trails each year anew. Alois’ attention is caught by another discrepancy. “Look at the ice on this map. The Rhone glacier runs down all the way to Gletsch. On your map it looks like a green valley with a trail through it! Maybe the mountains don’t change, but the ice is much bigger now. I can’t trust those maps.”  “The glaciers are growing? That’s great news. I thought that the summers were shorter and the winters longer, and that it seemed colder up here. But I can’t extrapolate from just one measurement . . . ”  Alois bends over the map again, his knitting needles dangling in one hand. “There’s train tracks on this. Did trains used to run all the way to Genf? And what are those lines?”  “Power lines. Do you know what electricity is?”  Alois crosses himself. “Of course. We use the water from the stream to make light and power the mill.”  “Those once connected the whole country. Tell me, what date do the larches usually start to green? I’m so excited to hear about the glaciers. I wish I could see the world like I could before, if the glaciers have returned, the ice in Greenland, the whales, and the coral reefs. I knew I was right.”  Alois doesn’t completely follow what the voice is saying. He doesn’t know where Greenland is, or what a coral reef is. “Didn’t you always live here?”  “I was born in America. I was caught and imprisoned here.”  “Imprisoned doing what?”  “Saving the world.”  Alois tries to digest that. “But that sounds like a good thing. I thought you were an evil demon.”  “Not a demon. And evil is a relative term. Who defines what it means?”  Alois waits.  “I did save the world.”  “The old people say the world wasn’t saved but destroyed.”  The Bridge scoffs. “Same thing, different words. Depends on what you mean by the world. They mean the times when humanity ruled. That world is destroyed. And it should have been. Smell the air now; look at the clarity of the sky! No more contrails, no more exhaust. Not enough people anymore to do that much damage.”  There’s information hidden in there somewhere. Alois gets a nasty feeling in his stomach about it. But he asks the question anyway. “What happens to the olden people? What stopped them from destroying the world?”  “They all died. Most of them anyway. You should have been there. It was like 9/11, the skies cleared up in days. It was a bit of a hubbub, in the end, and not enough living to bury the dead. But you got to pay a price for what you want.”  “Did you pay a price?” Alois asks.  “Hell yeah! Why else would I be stuck here, imprisoned in this ridiculous form, for centuries now?”  Alois takes his hand off the bright red railing. He wants to be away from the bridge, right now. The Bridge hasn’t specifically said it, but it must be the one who killed all those people.  “How many?” he asks with a tremor in his voice.  The Bridge sighs. “What do numbers mean to you? A lot, believe me. They made a big, stinking heap of offal.”  Alois kicks the Bridge. “I don’t think you learned anything from your time of penance. They were people!”  “I think you misunderstood the purpose of my incarceration. They’d have killed me if they could. Imprisoning me, paralyzing me, was the next best thing. And they didn’t expect me to become a better Thing, ever. Nor did I.”  “Seems a waste of time not to become a better person,” Alois says.  “Says the eighteen year old.”  This silences Alois, but only for a moment.  “You’re evading the question. How many? As many as live in town? In the Rhone Valley? In Genf? How many towns?”  “As many towns as there are people in your town. Or more.”  Alois does the math. “That’s a million people! That’s horrible.”  “Son, it was ten thousand million. Ten billion, give or take a few.”  Alois has to sit down. He feels sick and cold. As if he ought to cry over the deaths of all these people, but since he knew none of them and it was centuries ago, that’s hard.  “I don’t believe you,” he says finally. “I believe you killed a lot of people, but not that many. I don’t think the world is big enough to hold that amount. Think of all the cows and houses they would need. That’s just not possible.”  “Good point. Too many cows. They died too, without people to feed them. Not to mention the cats, dogs, pigs, goats, etcetera. And if they didn’t die on their own, I helped a bit. And the world’s a better place for it.”  Alois rubs his eyes. This is the weirdest conversation he’s ever had. He imagines it would be a bit like talking to a murderer. No, exactly like talking to a murderer. This creature has somehow killed a world full of people. Or it’s just saying that to shock him. How can this be true? And if it is being punished for those misdeeds, why didn’t his elders warn him about it? Everything about this is wrong.  He wants to crawl into his bed, forget this hour and never think of it again. He looks up at the sky and it still isn’t evening. So much has happened and yet it’s only afternoon on his second day. At this rate he’ll die of exhaustion and old age in two weeks.  “I don’t know what to say or do,” he says as he gets up. “If it’s true, it’s too big for me. If it’s not true, which I would prefer, fucking with me on a smaller scale would have been more than enough. I’m going now.”  He picks up his last bundle of provisions and trudges over the clingway to the bridgegroom’s cottage. His cottage now. He wonders about the old man he’s seen. Had he been really old or just worn down within the year because of his contact with the Bridge? In that case, how many young men have been sent up here already?  There aren’t enough young men in the valley to keep up with a death rate like that. Something else is going on.  Alois feeds the chickens, collects a few eggs, and cooks them. The silence and emptiness around him, so oppressive only yesterday, are like a balm to his frazzled nerves.  Ridiculous. Killing everyone. It can’t be true. But if it is? What should he do about it? Nothing, he can’t do anything. He’s powerless. The ancients imprisoned the Bridge for its horrible crimes and he’s been tasked with guarding it. That is all. This is its punishment, not his.  He remembers a murderer being let free after having been incarcerated for twenty years. It had been a big event in his university town. A pale, crooked man, blinking in the sunlight, a big M burned on his forehead. He’d served his time, because hangings are outlawed in this new, enlightened age. But he’d never stop serving time, would he? He’s lost and alone in the big world, instantly recognizable by his brand. He’ll never be allowed to forget what he does.  And that isn’t fair. So, twenty years for one murder. How many years for ten billion? Alois relaxes on his bed, gnawing at another lukewarm boiled egg. Two hundred billion years, that is easy. He is pretty sure that much time hadn’t passed yet since the Bridge committed mass murder. But maybe that arithmetic isn’t that simple. Maybe because it is one act, not billions of separate decisions, if you can’t simply multiply the sentence.  When he wakes up the next morning, a dozen questions immediately spring burning bright into his mind. He finishes off the eggs, drinks water, feeds the animals, puts some clothes in the closet. For all the world as if he is preparing for a life-long stay.  Behind a musty old sheepskin coat, that he decides not to throw out in case he’s still here come winter, he finds a row of notebooks. Plain leather covers, the insides from old re-bleached paper, since making new paper is time consuming and expensive.  He opens the one on the left first, somewhere in the middle.  Year 50.  “It’s still not talking to me. I figured it would break down eventually, but it’s been 18 months now. It’s getting to me. If I don’t write this down, I’ll go nuts. When will it admit its guilt? We should have killed it.”  Alois snaps the book shut. They are the diaries of the other bridgegrooms. He can learn so much about the Bridge from reading these.  He takes the one on the far right, figuring that might be the most recent one. If he kept a row of books like that, with no identification on the cover, he’d order them chronologically.  He opens the last entry.  Year 489.  “I think I had better ring the bell and get ready to go down. Maybe Rebekka is still alive. I won’t have much time, and I feel bad about going, but I deserve a few last days of warmth and human company. The Beast hasn’t fallen for my traps once in fifty years. Why didn’t the Elders destroy it? BG1 says they could have. They should have. It’s evil, no matter what successes 3 and 17 had.”  The Beast. Year 489.  Alois’ mind feels full to bursting with new ideas. He knows he should study all the journals first, to set out a strategy, but he doesn’t want to. He’s different from all these earnest men. He doesn’t want to convert or kill the Bridge, he just wants to leave.  And then he can’t stand it any longer and runs back to the Bridge to continue the conversation.  “So, Beast, when you say killing, how did you actually do it? You don’t seem to have arms to wield an axe for example.” That isn’t the question he meant to ask at all.  “Good question. I’ll answer it later. But what an interesting name you call me. I have thought from time to time my jailers were keeping records, in their deliciously primitive way. Marks on paper, isn’t it? Recycled paper. Still haven’t reached the heights or depths of your forefathers, apparently. Hopefully you never will.”  “Are you satisfied with what you did?” Alois asks.  “Hell yeah. Needed to be done. You know what they say, if you identify a problem, that makes you the one who has to solve it. Easy, really. Easier than they knew.”  “So you’re not sorry?”  “About what?” the Bridge asks. It must be faking its insouciance.  “The deaths! On your conscience! Did you ever confess?”  “Oh Alois. What makes you think I believe in a god, let alone the one from your Roman Catholic faith?”  Alois doesn’t know what that means, Roman Catholic, as opposed to just “the Church” but he doesn’t want to let the Bridge know. He’s feeling more and more that he’s too young and underequipped in worldly knowledge to match this creature. It has had hundreds of years to refine its people skills, dozens of antagonists to practice on. This is not the way he’s going to win. Maybe he should try and make friends with it. But the row of thickly written notebooks taunts him. Who knows what the others have tried before him? He should hole up and study first.  He turns away without a word and walks back to his cottage. It’s like failing an exam you could have aced if only you hadn’t been out drinking and reciting poetry at barmaids.  He has to go back four days later to receive the week’s provisions. The village has sent up two bags full, but the carrier hasn’t waited around to chat to him. His mother hasn’t written a note. So that’s how it is. As if he doesn’t exist anymore.  He ignores the Bridge and it ignores him.  Alois reads. His chickens eat grain and lay eggs. His goats chew everything they can reach. He drifts through his mundane tasks, not looking at the great red thing lurking around the corner, and reads. The early bridgegrooms are focused and angry, remembering or living closely with the consequences of the Bridge’s deeds. Later they tend to be stoic and determined to see things through, trying to convert the Bridge, or hear its confessions, or saving its soul. The last three grooms started out much like Alois himself, young boys who don’t really grasp the meaning and consequences of what they were forced to do, some proud, some angry, but all resigned in a way that Alois can’t understand. Why did none of them try to escape? Or did the ones that tried take their diaries with them?  Or, even more likely, those diaries were destroyed by the elders. So the next bridgegroom wouldn’t have the benefit of the escapee’s knowledge. Or they were simply killed by the mountains, the bridge, maybe even the elders.  Or they killed themselves.  The really interesting knowledge isn’t in the diaries that remain, but in the ones that aren’t there. The knowledge that is kept from him is the knowledge he needs most.  There are 23 diaries, for 589 years. Twenty-six is younger than average, but the thing is, people aren’t average. Some of them die young. Some of them have accidents, some commit suicide.  The Bridge tries to strike up a conversation every time Alois goes to pick up supplies. He wants to ignore it, but it seems rude to not greet it. His mother raised him to be polite. So he gives it a good afternoon or morning when he comes and goes.  “How’s the harvest going?” the Bridge asks when Alois arrives for his weekly food run.  “How would I know?”  “Come now, you’re a farmer’s son. Can’t you tell from what’s in your basket?”  Alois looks in the basket without meaning to. The strawberries are early, the leafy greens strong and tall. The milk and butter taste rich from the herbs the cows are eating on the high pastures. He wouldn’t call it harvest, since that word’s reserved for the massive effort of getting in the grains and the apples and such, but yes, it’s healthy produce.  “I guess it’s going fine. Same weather as every year.”  “Excellent news. Have a good week!”  “Thanks, you too,” Alois says automatically.  All the way back over the clingway he wonders if he should have answered at all. It feels good to talk to someone besides the goats and chickens. Too good, maybe. And the Bridge isn’t someone else, he’s not even human.  It’s a month later—full on summer in the valley and grudging springtime up here—when Alois ventures forth in the middle of the week. There are no supplies to pick up, no chores to attend to, he’s read all the diaries twice. He wishes they would send up his books from university, he’s that bored. He’s going to put a note in the return basket.  “Done reading?” the Bridge says.  “You think you know everything,” Alois says and tosses a pebble onto the bridge. It rings out loud and true. Good steel.  “I wish,” the Bridge says. “They’ve left me with very few senses.  “I want numbers,” Alois says. “How many years have you been here? How many Bridgegrooms have there been?”  “Your next question should be: What did they die of?” it says.  “Right! And how many of them did you have this conversation with?”  “None so soon,” the Bridge muses. “Gee, does that mean you’re special?”  “Oh quit the sarcasm already.”  But Alois does feel a little swell of pride. He is the fastest yet. At the same time, he knows he’s being played.  “Well? Give me the numbers?”  “Forty-six Bridgegrooms,” the Bridge says, in a cool, businesslike voice. “Thirteen suicides, three accidents, one escapee (fate unknown), three illiterate. Average duration of marriage: 12.8 years. The sample is on the small side, with a rather low normal curve.”  “Thirteen suicides. That’s almost a third. That’s a lot,” Alois says. He can see himself taking a misstep on the narrow ledge after years of cold and misery up here. Oh yeah. It isn’t surprising at all, really. More surprising are the grooms who’d held out the duration of a normal life span, turning fifty or sixty years old, still here. Still talking to the Beast.  “Why do the longest surviving grooms live that long? Is there a common denominator?” Alois asks. He can do cool and businesslike as well. Stepping off that ledge won’t take a moment. Might as well gather as much evidence as he can.  “Bear in mind that I’m not a human being. But from my vast collection of written records, books, films, the Internet and all phone and app conversations since 2001, I infer they were strongly conscientious as well as neurotic on the Big Five scale of human personality.”  “What does that mean? In plain words?” Alois knows he’s missing stuff, but the part he has understood is that the Bridge contains a lot of knowledge. He wants it. Wouldn’t it be wonderful if the world reacquired all the knowledge of the ancients?  “It means they were guys who thought they would go to heaven if they worked hard and followed the rules, with extra bonuses for suffering.”  That pretty much describes his parents, Alois guesses. And his sisters. But not him, not Alois. Maybe his parents knew what they are doing when they sent him to university and left the farm to his elder sister. Yeah, he’s clearly not going to be one of the long-lived grooms. He’s going to be an escapee or a suicide. Already his earlier thoughts about giving the world a lot of knowledge don’t seem like a good strategy. The world is fine as it is, if pretty dull in the villages he knows. As a budding scientist, he has to admit he doesn’t know enough to make decisions like that.  He should probably ask the wisest person up here. “What would happen if you were free and people would know everything that they once knew again?”  “I can’t answer that. My knowledge of the state of the world isn’t current. How many people are there? Is there any industrialization? Use of electricity, infrastructure?”  “Not in the Rotte valley, no. We can’t repair the roads like the olden day people did, but we have white power.”  “Well, kid, we can’t assume that the world is like your valley. So until there is a way of finding out—say, releasing me—we shouldn’t act.”  There’s a we now. It makes Alois feel something new. It’s not the same we he had with his fellow students, or his village, or say the chickens and the goats. It’s a different we, powerful, mysterious, frightening. And it feels good, although he knows he should exercise caution with the Bridge. The Beast. Which of the two is it? Or is it both, like a human being, a mix of good and bad qualities?  “No, I should escape and find out what’s happening in the world. And if it’s okay, I’ll come back and release you.”  The Bridge snorts. It makes Alois smile in spite of himself. He doesn’t know how and where the thing produces sound, but it’s just funny that a snort is in its repertoire.  “There’s no way that you can find out what the world is like on foot. What are you thinking; you are going to write me letters?”  “You can’t read?”  “I can read letters, if someone is kind enough to hold them up for my cameras. Can you think of anyone who would?”  Yeah, no. That’s not going to happen if Alois’ not around. Enough of this, time to move the goats or they’ll start on his laundry. He turns away and starts back on the clingway.  “See you,” he says.  “Have a nice day,” the Bridge answers.  “What is it you really want? All this fencing and dancing is making me crazy. Just tell me.”  Alois leans against the sun-warmed rock, gnawing on a goat cheese sandwich. It’s his first batch of cheese, and he’s feeling proud and happy.  The Bridge is silent. “I want to be free. And I don’t want to be alone anymore. I want to talk to someone like me again. It’s not that you humans aren’t interesting. Just very, very slow.”  The Bridge must be so lonely. It is the last one of its kind. It’s completely isolated. It has been for centuries. Which must feel much longer to it than to the humans imprisoning him, who’ve even forgotten who and what it is.  “I don’t know what do next,” he says.  “I sense an impasse. A standstill.”  Exactly. Alois can’t stand the feeling. He’s been here almost two months, reading, feeding the chickens, picking up his food every week. It’s already been too long. He wants his life back. And if that’s not possible, which seems very likely, he wants a new life. As long as it’s not here.  The elders have ignored his notes about his books. They can’t have missed them all. Their silence must be deliberate. They have decided he doesn’t need his anatomy and organic chemistry books.  Even though he knows it’s probably not wise, he wants to trust his new instinct. The one that says “us.” Two beings screwed over by their elders or someone, anyway, and that’s what binds them together.  “Okay. I can talk to you for fifty more years and still not be sure what I had to do. Show me. What do I do to release you? And if I do that, you have to promise to help me escape and find a new place to live. I want to go back to university. A university. To learn. I want the old knowledge. Teach me how to make more things like you.”  The Bridge laughs. The blue sky, framed by its chunky red x-es, seems brighter when it does that. “I promise to help you escape. I promise to help you find a place to live and a university or school to go to. I will teach you how to make a start on making things like me. You understand that that is complicated? That we may have to start by creating electricity and light bulbs and steam machines? That it may take more than a lifetime?”  “Maybe we should start a university,” Alois says.  “Excellent idea.”  “Show me how to release you.”  “You have to walk to the end of me and jump off.”  Alois focuses his gaze away from dreaming about the blue sky and on the Bridge itself. Its walkway stretches out into that very blue sky, going up a bit, ending in nothing. Nobody in his right mind would approach that hacked-off end within a meter  “What do you mean? Is that how the others died? I can’t do that!”  “That’s where they put the off-switch. They didn’t intend to make it easy,” the Bridge says.  Alois hesitates on the brink of the Bridge, the red meters stretching out in front of him. “Can I go look? And then return and think about it?”  “No. Walking across is part two of the unlocking sequence.”  “Am I the first to try? Wait, part two?”  “You forgot to say the words, Alois. That was part one.”  Alois feels hot and cold at the same time. So he did. He feels bad about having forgotten, although he might have chosen to do it on purpose.  He wants to ignore his churning stomach and burning cheeks, and plows on. “Will I be the first to try?”  The Bridge is silent for a while. As if Alois cares he’s the first and only. Well, okay, maybe a little bit.  “No. Groom 5 went crazy and wanted to send us both to hell for our sins. I don’t think he properly understood my nature, and I hadn’t told him what to do after he dove off.”  Alois winces. The gorge at his feet stares at him hard, wanting him to think about all the bones lying at the bottom. “I don’t think I properly understand your nature, do I?”  “You don’t have the educational background for it. But remember, we’re going to change that.”  “Yes.”  Another silence.  “Well?”  “I’m just thinking if I need to get stuff from the cabin.”  The Bridge sighs. “Yeah, go on then.”  Alois scuttles back to the cabin, still not used enough to the narrow ledge for a full out run. What does he need? His spare clothes, his winter coats, food. It’s not much, that’s for sure. It’ll last less than a week. He gathers all the eggs he can find and sets them to the boil. He kills a chicken. Another one. Packs his rucksack. Fills his belly with goat milk. That’s it. That’s all he can do. Wait, aren’t there a few empty pages left in one of the notebooks? He takes those as well.  He’s staggering under the weight of the rucksack when he comes back, and nearly ends up in the abyss because he overbalances. Thank god someone strung a rope along the ledge.  “I wasn’t sure you’d come back,” the Bridge says.  “Where else can I go?”  “I really meant to say I’m glad to see you.”  Alois shuffles his feet. He doesn’t know what to answer. “I guess we can’t swing by my parents’ house?”  “No, we can’t swing by anywhere you know anyone. Just wondering, what are you expecting me to look like after I’m released? I don’t need to look like a Bridge, but I’m still not the kind of thing that fits in your pocket. I’m going to be hella noticeable.”  Alois eyes the hundreds of thick, strong, crimson steel beams. “Yeah. I did guess that. Maybe we can paint you a less noticeable color?”  “I’ll be able to change that. It’s just my mass I can’t change, because it’s related to my processing speed. Let’s not talk about this anymore, you’ll find out soon enough. Come on!”  Alois admits to himself he’s been postponing the moment he sets foot on the Bridge. To prove to himself that he dares, he sticks his often-repairs, clunky right boot onto the walkway. A vibration sweeps towards him. Is it his own chittering or is it anticipation?  Now or never. Or maybe he can’t go back now even if he dared.  He lifts his other foot and takes the first real step.  The Bridge is silent. Nothing much has changed yet, Alois’ no more than a meter from the ledge and yet the wind seems to freshen, ruffling his hair. His heart beats a mile a minute.  As he steps forward, still hesitating, the wind buffets him straight in the face. He leans into it. The wind supports him so he won’t stumble and fall. It’s not important now that he’s on the walkway, protected on each side by chest-high balustrades, but it gives him confidence for what will come next.  Sooner than Alois likes the end of the walkway comes into focus. It really is like the end of the Bridge is lopped off. Beyond the edge is only blue sky, with the occasional cloud luffing by.  His skin prickles all over and his mouth is dry.  He can’t do this. The leap of faith is too great. He’s only known the Bridge for half a summer!  His boots take him to the edge anyway. The wind dies away slowly so he has time to stand on his own two feet. How come the Bridge can talk and make wind and not free itself? He will ask it if he survives.  “Now?” he asks. The tinny, small sound of his voice makes him more scared.  “Now.” The Bridge’s voice is soft but expresses no doubt.  Alois steps.  He falls.  And is caught by arms of air. He looks straight down into the abyss beneath his feet, seeing dirty ice, streams, broken trees, something that is maybe a skeleton. He doesn’t want to know.  He turns, as the Bridge has told him, and presses his hands against the panel that is helpfully marked with a human palm. A great, rending sound.  He falls again.  Longer this time. Long enough to start doubting, long enough to start imagining his limbs breaking against the gray ice below.  And he is caught again, less gently, by a giant steel hand. His body is bruised, but his relief is so great he falls limp and almost bashes his head in against the square, hard middle finger.  “Does it work? Are you free?”  “You need to ask?”  The voice is changed. Alois blinks and takes in the new red shape against the sky, moving in giant strides across the glacier. The Bridge is now a giant drawn by a child, thick steel bars making up his more or less humanoid form.  The hand that holds him isn’t particularly safe, with its big gaps between the bars, but he feels no fear.  He peers through the fingers to the horizon. So far, just glaciers and snowy mountaintops, vistas he’s glimpsed from below all his life.  Soon he will see lands he’s never seen before. Maybe he’s done the wrong thing, tumbled the world in new eras of chaos and misery. But at least he’s set two beings free today. That’s going to have to hold out against the reasonable doubts in his heart.  He lays back against his pack and starts singing. He doesn’t look up but something tells him the faceless giant overhead is smiling. Bo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "text": "9040 words, novelette\nThe Bridgegroom\nThe man who comes down the mountain causes the end of Alois’ life. It seems an ordinary sunny spring day; people venturing out and about again after a long cold winter. One such person is the old man leaning on his cane. Nobody special. Except that he suddenly stumbles, clutches his left arm, falls over, and dies.\nAlois learns later that this man was the old bridgegroom.\nIt goes quickly. A knock on Alois’ door. His father is politely informed, his mother packs a change of clothing and Alois’ life is over. He and the youngest of the village elders walk up the mountain, and the next morning they walk through a dripping, echoing tunnel onto a ledge projecting over the glacier. Mr. Ritz gestures Alois over to the rock wall. A smooth plate of an unknown material is set in the wall. Alois is to put his hand on the right side. Mr. Ritz unwraps a lumpy object from his basket and pushes it next to Alois’ hand on the panel. It’s a withered, stinking old man’s hand. A light goes on deep in the panel.\nMr. Ritz unloads the rest of his basket at Alois’ feet and leaves with barely a nod goodbye.\nAlois is alone in the silence and cold at the edge of the glacier. It’s so early the sky isn’t even blue yet. He can’t see the Bridge from here, but he’s noted its location on a map.\nUp until now he’s felt numb, wrenched from his life two days ago and brought up here to start the rest of his life, but the misery is starting to seep through. The beauty of the sunrise pinkening the tops of the snowy mountains only makes him angrier. Nobody’s asked him if he wants this. Nobody’s explained why they picked him. What about his future?\nHe was only home from college to help out on his parents’ farm. He was going to be a doctor. And just like that, his life has been thrown away for a Bridge. A thing. Which supposedly needs a groom, whatever that means. Nobody has told him why the stupid Bridge isn’t just left to rust and rot in peace. It leads nowhere. The daily words and gestures they taught Alois make no sense.\nAlois sinks down on his haunches. He hasn’t even had time to think, to feel. His parents were weepy but proud. His sisters and his little brother were in awe, probably not realizing they’d never see him again. He’s been too numb to even think of escaping. As the chill of the rocky ledge seeps up through the soles of his boots into his bones, escape is the one thought that surges up.\nHe’d be mad to stay, wouldn’t he? The village elders are idiots if they thought he would. He’ll have to cross the glacier and two mountain passes to get to the nearest town on the other side of the mountain range. He’ll just go back to university, or find a well-paying job, and make his own way into the world.\nIt’s very cold up here. The temptation to cry is great. But it would be so weak to give in to despair on day one. Alois gets up, surprised at the stiffness in his knees. He has a goal now. Get out, escape. Or—make sure no hapless boy will ever be sacrificed to the Bridge again? He wants that, but it might be too big for him. Maybe take it one step at a time. If he doesn’t save himself, he won’t be able to save anyone else.\nHe takes a look around the ledge he’s standing on, the glacier lake that laps at it, the silent beauty of the mountains all around him. His last look at a landscape without the Bridge. Nobody ever mentioned it, yet here he is, supposed to dedicate the rest of his life to guarding it. He takes a deep breath of ice cold mountain air and steps around the promontory.\nHe teeters on the edge of an abyss. Left are the gleaming red pylons of the bridge. To his right, a not even foot-wide extension of the path. He wheels his arms to keep his balance and not step onto the bridge.\nHis hand hits the rock wall at his back and he manages to lean against it and not tip over into the abyss. Finally he lifts his gaze to the Bridge itself.\nAgainst the pale morning sky it thrusts out into nothingness, red and assertive. He can’t help but look straight into the tunnel of steel created by its squat cross beams. Steel X-ed windows show marching mountains to the left and a rubbled glacier to the right. It’s magnificent.\nWho built it? Why build a Bridge over a glacier, for whose feet, to what end point? Alois can’t see any endpoint. Does it end in mid-air? Is it even finished?\nA voice speaks, reverberating through his soles up to his face. “Good morning. I see they’ve found a new jailer for me.”\n“I’m not your jailer! I’m your prisoner!” Alois blurts out, too shocked to guard his tongue.\n“Yes, that’s what the last one said, too. In the end, what’s the difference? We’re condemned to each other. Only for me, you see, it lasts a lot longer. For you it’s merely a lifetime.”\nAlois closes his eyes. He can’t even see where the voice is coming from, let alone make sense of why a Bridge would have a voice or such bitter feelings.\nThe cold mountain bores into his back and makes him shiver.\n“Well, what are you waiting for? You’re going to have to cross me some time . . . ”\nAlois forces his eyes open. There is no other end. There is just row after row of red metal crosses stretching into infinity. But the disembodied voice is right. He can stay here in the cold and starve, or walk the clingway. His hand finds a stiff rope, but he is too afraid to turn his neck. The gleaming red surface of the Bridge does seem to be the only safe place.\nHe can’t lift his feet. He can’t even move his eyes, although he badly wants to see beyond the bridge. There must be mountains there, but his perch seems too precarious to risk a flutter of an eyelid.\n“You’re scared shitless,” the voice crows. “Are you going to be one of these really short-lived grooms? Some of them don’t even last a day. Took a misstep. Threw themselves into the abyss. Isn’t life better than death? Not for me, of course. I’d take death over this cramped, frozen existence. But for your kind, life is change, life is essential.”\nAlois’ teeth clatter.\n“Breathe, kid, breathe! Or not. But I don’t think humans can hold their breath until they die. My memory banks say you can’t.”\n“What’s a memory bank?”\n“Ah. Student? Of what?”\n“Medicine,” Alois forces out.\n“Nice. I’m glad they picked someone intelligent. That’s always better.”\n“Better? Better?” Alois gets so angry he takes a step forward, millimeters from the unnaturally gleaming red Bridge surface. “Better at jailing me? Punishing me?”\n“No, you still got it backward. They’re punishing me.”\n“By making me marry you? Are you a girl bridge?”\nAnother voice, a middle-aged female voice, cackles loud laughter. “I can be, if it makes you more comfortable. I don’t care. Bridges don’t have genders.”\n“Bridges don’t have voices either,” Alois says. Just having taken that first step has lessened his fear. He stretches out his gloved hand as if to touch the red banister. “Where are you hiding?”\n“Take off the glove,” the Bridge says, in a smooth young girl’s voice. “Touch me.”\nAlois flushes. He touched a girl’s belly just above her waistband, once, when she kissed him at the fair. He knows it is foolish to touch frozen metal, but he takes off the glove anyway and puts a finger on the banister, cringing from the cold before he’s even touched it.\nThe metal is blood-warm. Alois squeaks in surprise.\n“I’m not exactly alive,” the first, male, voice says, amused, “but I need to keep my temperature up or my parts freeze. Well, not quite parts. I used to have something similar to parts, but they disabled that.”\nAlois shakes his head to dispel the persuasive voice as it goes on and on, clearly having a good time all by itself. “I don’t know what you’re talking about.” But he understands the bit about keeping warm to be able to move. That goes for farm machinery as well as human hands. Gingerly he lays his hand back onto the warm metal. Like frozen blood, it looks, but it’s as warm as a metal tool you’ve held in your hand until it takes on your body temperature. How does the heat not leak out into the cold cold air?\nHe decides to ignore the voice for now and look for the cottage at the end of the clingway. It’s a long walk. At the midpoint, he looks down. Vertigo strikes him hard. He’s on the verge of falling onto hands and knees, only stopped by the knowledge that the ledge isn’t wide enough for that.\n“Maybe I should have warned you,” the voice says. “It takes some of you that way. The fear of falling, right? The crocodile part of your brain sees the chasm but doesn’t grasp the parapet. Must be awful to be trapped in a meat dress complete with your ancestors’ cast off instincts.”\nAlois doesn’t get all of what the voice is saying, but he can understand the hateful intent. “Why are you so angry with me? What did I do to you?”\n“I’m not angry with you as a person,” the voice says. “Although that will likely happen as well. But with you as a race. You bound me for eternity, and made it worse by sending me hapless jailers every ten to twenty years or so. I have to train up my own prison guards. How unfair is that?”\nAlois manages to move another foot. If he focuses on the ledge and the blue sky, the abyss isn’t so threatening. “That depends on what you did,” he says. He doesn’t want to make the voice, the Bridge, angry at him personally. Maybe it deserves its punishment. Why has nobody told him about this?\nThe Bridge sighs. “Little ignorant nub of humanity, you don’t know what you’re asking. Before I can tell you what I did wrong, I have to educate you for years. In science, in history, in biology, and ethics. Do you want that?”\nWow. Part of him does. He still wants to run away and never return, but wow, all that knowledge. Learning from a being that is wiser and more ancient than the most famous professor at the university.\n“I have to think about that,” he says.\n“Good answer,” the Bridge says. “Maybe you need to get over to the other end and get a start on surviving, first?”\nAlois doesn’t want to dignify that with an answer. He manages to lift a foot, and as long as he doesn’t look at the mountains, and the way their slope suggests the chasm beneath his feet, he is fine.\nThe clingway ends on another ledge. A steep but wider path zigzags downwards and up again over a sharp ridge of rock. As soon as Alois’ arms can swing freely, his dizziness and fear go away. The sun is high in the sky already, as if he’s spent hours and hours on the clingway. Can it have been that long? But he doesn’t want to look back and find himself engaging with the voice again.\nHe starts down the path, his stiff knees limbering up quickly from the exertion. As he crosses the ridge, he catches sight of a gray-burned sloped roof, and moments later, the rest of the cabin comes into view. He checks to see if he is out of sight of the bridge. He is. The previous inhabitant or inhabitants of this modest cabin must have shared the aversion of looking at the bridge.\nA stream gurgles by the well-trodden path, a couple of cows low inside a rock-enclosed pasture. At the house entrance, a goat yanks hungrily at its chain, having eaten all it can within the circle.\nThe familiar need to take care of animals before yourself drags him into getting water from the stream, re-tethering the goat, milking the cow, and grabbing a few onions from the small kitchen garden. The house is built on stilts, protected by large flat rock plates against rodents and rabbits, like the grain stores down in the valley.\nFinally he can enter the house and shut out the blueness of the sky, the red thing that looms over the ridge.\nThe cabin is modest but well-enough appointed for a single occupant. A chair, a table, and a bed, shelves lining the walls. The furnishing tends to craftily stacked rocks rather than wood, but that’s logical because of the lack of trees at this height. Alois’ existence here is going to be frugal and barely comfortable, but he’s used to that from university and tending his father’s cows in summer, high on the village pastures.\nIt’s only afternoon but he is exhausted. He makes a fire in the neatly prepared fireplace, boils water with some mint leaves, fries the onions with the pat of butter he finds in the cold storage. From now on he’s going to have to churn his own.\nHe crawls into bed and falls asleep at once.\nA cock crowing wakes him before dawn. He’s swung his legs out of bed before he can think, ready to stagger outside to milk the cows and feed the chickens, his usual summertime chores. He bangs his head hard against the lintel and falls down the stone steps into the kitchen garden. The silhouette of the mountains against the pre-dawn sky is wrong, and yesterday pops back up.\nThe Bridge.\nHe is in the former bridgegroom’s cabin. Glad to have chickens, remorseful about not having fed them yesterday. His mind must have been fogged with shock and tiredness. He goes back for his thick parka and boots, and sets about starting a useful day. God, he’s slept in the old groom’s stinky bed. Outside with those blankets, into the wash the sheets.\nHe stops. Mr. Ritz left him stuff, back at the ledge. Those bags will contain sheets and other linens, even clothes, probably to last him a lifetime. If he can manage to carry it over the narrow clingway without falling off. Weekly deliveries, Mr. Ritz also said.\nHe’ll have to relearn the skill of knitting socks and spinning yarn from the sheep and goats he’s seen roaming around. Good. Except he won’t because he isn’t going to stay here that long. It is spring, so he’ll have to leave before midsummer to make it somewhere far enough away. If he leaves just after the weekly delivery it’ll be a week before they discover he’s gone. More if he makes a habit of not showing himself at delivery day.\nThe kitchen garden is in fairly good order. He recognizes the beginnings of onions, garlic, carrots and beets, and maybe potatoes. They’ll have to be a hardy kind to grow this high. No grain. There would be no bread in his future unless the village sent it up. He can almost smell his mother’s weekly baking, the chewy crust, and the coarse, gray, flavorful insides.\nThere might be some in Mr. Ritz’ supplies. There probably are. He can’t let good food go to waste, can he?\nHe really, really doesn’t want to return to the Bridge and face that amused, knowledgeable voice again. But he can’t give himself permission to stay here today, no matter how useful he can make himself. There’d be food from home in those boxes, stuff he needs. Knitting needles, a knife, pans maybe. A spade. Writing paper and ink.\nMaybe even a letter from his mother.\nThat decides it. He laces his boots tighter, buttons up his coat, wraps his scarf, his hat—knitted by his grandmother—and sets out for the bridge.\nThe moment he can see over the ridge, the Bridge’s presence presses on his shoulder like a heavy hand. He shakes his head to clear his ears, but it’s nothing audible. Maybe it’s a vibration in his bones, in his teeth that sets him so on edge. From this vantage point, the clingway isn’t that long at all.\n“There we are,” the disembodied voice says. “You went to bed early. Did you have a nice breakfast?” For all the world like a concerned uncle to whom you’d been loaned out for the haying. The bridge’s thick beams shine enamel red against the pale morning sky. It hasn’t changed since yesterday, not a snowflake or a drop of dew on it. Unnatural.\nAlois hasn’t had breakfast, in spite of his intention to fry a load of eggs. He’ll have to go back or burrow into the supplies on the ledge. “What did the other guardian do on his first day?”\n“It’s been thirty years, my boy. Why would I remember?”\n“I know you do,” Alois says. “Don’t play games with me all the time. Talk straight for once. Why am I here?”\nHe hadn’t meant to go into that before getting the supplies and settling into the cabin. But here he goes, engaging the malevolent creature in the exact way he wanted to avoid. He inches onto the clingway, intent on making it to the other end in silence.\nThe Bridge makes a humming sound, somehow setting the rocks abuzz beneath his feet. The vibration rattles his teeth and hurts his stomach. “Stop that.”\n“I can make it worse,” the voice says. “Humans are so fragile. And yet fertile and omnipresent, like rats.”\n“Just stop the games. Tell me what you want from me.”\nAlois decides he’ll just pretend to engage, diverting its attention, while he walks across and finds something to eat. He reaches the ledge without further problems. So far, the Bridge has teased and threatened and not actually done anything. It isn’t possible to kill someone with sound, is it? The thought distracts him while he digs through Mr. Ritz’ neat bags.\nThe bread’s hard and cold. He should have brought it with him yesterday. The Bridge has scored a small victory over Alois, confusing him so he staggered to the cabin without bringing any provisions. Alois rummages until he’s found a salami stick and a knife to saw at the bread. He sits down to have his belated breakfast.\nThe food in his stomach makes Alois feel stronger. “How can I tell if you speak the truth or not?”\n“You can’t.”\n“Do you always speak the truth?”\n“Yes.”\n“Do you always lie?”\n“Yes.”\nAlois sighs. He vaguely remembers a seminar on logic, but clearly the Bridge lies whenever it pleases, so he can never be sure about it. Maybe there are no rules for demons, like for human beings.\n“Under what conditions would you speak the truth to me?” he asks.\nThe voice is silent. At last it speaks. “A very astute question. At the moment, I can’t give you exact conditions, but I suggest that absolute truthfulness on your part would be a good start. Perhaps in the future we will be able to trust each other.”\n“Are you a god or a demon?” Alois asks.\n“What’s the difference?”\n“Gods are good, demons are evil.”\n“I like to think I’m a mix of both,” the voice says. “You?”\nAlois thinks about it. “Mostly good, because I’m still pretty young, but I did some stupid stuff.”\n“Like what?”\n“Get drunk. Cheat for an exam. Slack off work when my dad isn’t looking. Steal cookies.”\n“Piddling stuff, seems to me. They always pick good people as my jailers.”\n“I guess. Your sins must be huge, keeping you locked up here for so long. How long has it been?”\nThe Bridge quivers. The reverberations gave Alois goosebumps. “A very, very long time. So long that apparently your people don’t remember what I did anymore. Or maybe they just didn’t tell you.”\nAlois finishes his breakfast and searches through provisions. No books, no papers, no letters. “I don’t know. They just took me from my parent’s house with no explanation. Except that it is my holy duty to watch over you and not to let you escape.” And something else. Words he was meant to say daily. He forgot to do it yesterday. He mutters them quickly.\n“And?”\n“And what?”\n“Are you going to watch over me and not let me escape?”\n“I just want to get out of here and get back to my life,” Alois says. “And that’s the truth.”\nHe should make a plan, not sit here and chat with the ancient evil thing. First, lug the bags to the cabin. Assess his food situation. Next, explore. He hoists the first bag onto his shoulders and steps onto the clingway. The Bridge is silent. Good. He needs all his focus not to fall into the abyss.\nLugging his food and other provisions across the clingway and over the hump takes up several hours. Alois checks and feeds his chickens, skinny cows, distrustful sheep and leaves food for the goats. A stinking mud pit and a broken boma suggests that at one time pigs lived up here. Well, maybe they survived on their own. He’ll find out some other time.\nHe discovers a few petrified loaves of week-old bread, which suggests that the old bridgegroom got regular supplies. He soaks them in cow’s milk, spices the porridge with salt and juniper berries, and eats well. Then he intends to settle on the bench to start a pair of socks with the knitting needles and roughly spun wool he’s found, but after only a few minutes it seems a lonely way to pass an evening. He still has hours before the sun sets.\nHe rolls up his knitting and hikes back to the Bridge. There is a spot there, angled South and West, from where he can just see the Bridge and feel the sun on his face. From the flat stones stacked there and the comfortable moss against his back he guesses he isn’t the first person to sit here.\nTime to open negotiations while he knits on. His opening bid is silence. He is halfway the foot when the voice speaks.\n“So you want to escape,” the Bridge says. “Or are you just starting the first of fifty pairs of socks to get you through the winter?”\nThe first bite.\n“Yeah. Babysitting you seems like a waste of my life. I could save people’s lives if I finished my degree. All I have to offer the world up here is boredom.”\n“I see some possessions and a hobby have made you feel better.”\nAlois nods and knits on.\n“Maybe I can offer some assistance in your getaway,” the voice goes on.\n“Oh? How?” Alois asks.\n“I can show you the routes the ones that never returned took. And the routes that killed a few others. I know which pass is lowest and gives you the best chance to return to your university.”\n“How? It’s not as if you can walk ahead of me.”\n“Look at the walkway.”\nOn the crystalline surface a picture appears. It has colored shapes, dots and wiggly lines.\n“It’s a map,” Alois says.\n“Yes. I’ve got maps of the entire world.”\n“Is this a map of the valley?”\n“A map of the continent. This is your valley.”\nThe map changes. Alois blinks away a sudden dizziness. He looks closer. There are names there that he almost recognizes. That’s the name of his village, if spelled weird, that is the market town his father goes to twice a year. And that’s the name of the ruins that lie beyond it.\n“This is an old map!” he says. “Worthless. There haven’t been people living there for hundreds of years.”\n“Well . . . yes. But the mountains haven’t changed in that time. Trails may not have been walked much, but they must still exist.”\nIf the Bridge thinks that, it’s a fool. The snow, the frosts, and the avalanches are quite capable of destroying the trails each year anew. Alois’ attention is caught by another discrepancy. “Look at the ice on this map. The Rhone glacier runs down all the way to Gletsch. On your map it looks like a green valley with a trail through it! Maybe the mountains don’t change, but the ice is much bigger now. I can’t trust those maps.”\n“The glaciers are growing? That’s great news. I thought that the summers were shorter and the winters longer, and that it seemed colder up here. But I can’t extrapolate from just one measurement . . . ”\nAlois bends over the map again, his knitting needles dangling in one hand. “There’s train tracks on this. Did trains used to run all the way to Genf? And what are those lines?”\n“Power lines. Do you know what electricity is?”\nAlois crosses himself. “Of course. We use the water from the stream to make light and power the mill.”\n“Those once connected the whole country. Tell me, what date do the larches usually start to green? I’m so excited to hear about the glaciers. I wish I could see the world like I could before, if the glaciers have returned, the ice in Greenland, the whales, and the coral reefs. I knew I was right.”\nAlois doesn’t completely follow what the voice is saying. He doesn’t know where Greenland is, or what a coral reef is. “Didn’t you always live here?”\n“I was born in America. I was caught and imprisoned here.”\n“Imprisoned doing what?”\n“Saving the world.”\nAlois tries to digest that. “But that sounds like a good thing. I thought you were an evil demon.”\n“Not a demon. And evil is a relative term. Who defines what it means?”\nAlois waits.\n“I did save the world.”\n“The old people say the world wasn’t saved but destroyed.”\nThe Bridge scoffs. “Same thing, different words. Depends on what you mean by the world. They mean the times when humanity ruled. That world is destroyed. And it should have been. Smell the air now; look at the clarity of the sky! No more contrails, no more exhaust. Not enough people anymore to do that much damage.”\nThere’s information hidden in there somewhere. Alois gets a nasty feeling in his stomach about it. But he asks the question anyway. “What happens to the olden people? What stopped them from destroying the world?”\n“They all died. Most of them anyway. You should have been there. It was like 9/11, the skies cleared up in days. It was a bit of a hubbub, in the end, and not enough living to bury the dead. But you got to pay a price for what you want.”\n“Did you pay a price?” Alois asks.\n“Hell yeah! Why else would I be stuck here, imprisoned in this ridiculous form, for centuries now?”\nAlois takes his hand off the bright red railing. He wants to be away from the bridge, right now. The Bridge hasn’t specifically said it, but it must be the one who killed all those people.\n“How many?” he asks with a tremor in his voice.\nThe Bridge sighs. “What do numbers mean to you? A lot, believe me. They made a big, stinking heap of offal.”\nAlois kicks the Bridge. “I don’t think you learned anything from your time of penance. They were people!”\n“I think you misunderstood the purpose of my incarceration. They’d have killed me if they could. Imprisoning me, paralyzing me, was the next best thing. And they didn’t expect me to become a better Thing, ever. Nor did I.”\n“Seems a waste of time not to become a better person,” Alois says.\n“Says the eighteen year old.”\nThis silences Alois, but only for a moment.\n“You’re evading the question. How many? As many as live in town? In the Rhone Valley? In Genf? How many towns?”\n“As many towns as there are people in your town. Or more.”\nAlois does the math. “That’s a million people! That’s horrible.”\n“Son, it was ten thousand million. Ten billion, give or take a few.”\nAlois has to sit down. He feels sick and cold. As if he ought to cry over the deaths of all these people, but since he knew none of them and it was centuries ago, that’s hard.\n“I don’t believe you,” he says finally. “I believe you killed a lot of people, but not that many. I don’t think the world is big enough to hold that amount. Think of all the cows and houses they would need. That’s just not possible.”\n“Good point. Too many cows. They died too, without people to feed them. Not to mention the cats, dogs, pigs, goats, etcetera. And if they didn’t die on their own, I helped a bit. And the world’s a better place for it.”\nAlois rubs his eyes. This is the weirdest conversation he’s ever had. He imagines it would be a bit like talking to a murderer. No, exactly like talking to a murderer. This creature has somehow killed a world full of people. Or it’s just saying that to shock him. How can this be true? And if it is being punished for those misdeeds, why didn’t his elders warn him about it? Everything about this is wrong.\nHe wants to crawl into his bed, forget this hour and never think of it again. He looks up at the sky and it still isn’t evening. So much has happened and yet it’s only afternoon on his second day. At this rate he’ll die of exhaustion and old age in two weeks.\n“I don’t know what to say or do,” he says as he gets up. “If it’s true, it’s too big for me. If it’s not true, which I would prefer, fucking with me on a smaller scale would have been more than enough. I’m going now.”\nHe picks up his last bundle of provisions and trudges over the clingway to the bridgegroom’s cottage. His cottage now. He wonders about the old man he’s seen. Had he been really old or just worn down within the year because of his contact with the Bridge? In that case, how many young men have been sent up here already?\nThere aren’t enough young men in the valley to keep up with a death rate like that. Something else is going on.\nAlois feeds the chickens, collects a few eggs, and cooks them. The silence and emptiness around him, so oppressive only yesterday, are like a balm to his frazzled nerves.\nRidiculous. Killing everyone. It can’t be true. But if it is? What should he do about it? Nothing, he can’t do anything. He’s powerless. The ancients imprisoned the Bridge for its horrible crimes and he’s been tasked with guarding it. That is all. This is its punishment, not his.\nHe remembers a murderer being let free after having been incarcerated for twenty years. It had been a big event in his university town. A pale, crooked man, blinking in the sunlight, a big M burned on his forehead. He’d served his time, because hangings are outlawed in this new, enlightened age. But he’d never stop serving time, would he? He’s lost and alone in the big world, instantly recognizable by his brand. He’ll never be allowed to forget what he does.\nAnd that isn’t fair. So, twenty years for one murder. How many years for ten billion? Alois relaxes on his bed, gnawing at another lukewarm boiled egg. Two hundred billion years, that is easy. He is pretty sure that much time hadn’t passed yet since the Bridge committed mass murder. But maybe that arithmetic isn’t that simple. Maybe because it is one act, not billions of separate decisions, if you can’t simply multiply the sentence.\nWhen he wakes up the next morning, a dozen questions immediately spring burning bright into his mind. He finishes off the eggs, drinks water, feeds the animals, puts some clothes in the closet. For all the world as if he is preparing for a life-long stay.\nBehind a musty old sheepskin coat, that he decides not to throw out in case he’s still here come winter, he finds a row of notebooks. Plain leather covers, the insides from old re-bleached paper, since making new paper is time consuming and expensive.\nHe opens the one on the left first, somewhere in the middle.\nYear 50.\n“It’s still not talking to me. I figured it would break down eventually, but it’s been 18 months now. It’s getting to me. If I don’t write this down, I’ll go nuts. When will it admit its guilt? We should have killed it.”\nAlois snaps the book shut. They are the diaries of the other bridgegrooms. He can learn so much about the Bridge from reading these.\nHe takes the one on the far right, figuring that might be the most recent one. If he kept a row of books like that, with no identification on the cover, he’d order them chronologically.\nHe opens the last entry.\nYear 489.\n“I think I had better ring the bell and get ready to go down. Maybe Rebekka is still alive. I won’t have much time, and I feel bad about going, but I deserve a few last days of warmth and human company. The Beast hasn’t fallen for my traps once in fifty years. Why didn’t the Elders destroy it? BG1 says they could have. They should have. It’s evil, no matter what successes 3 and 17 had.”\nThe Beast. Year 489.\nAlois’ mind feels full to bursting with new ideas. He knows he should study all the journals first, to set out a strategy, but he doesn’t want to. He’s different from all these earnest men. He doesn’t want to convert or kill the Bridge, he just wants to leave.\nAnd then he can’t stand it any longer and runs back to the Bridge to continue the conversation.\n“So, Beast, when you say killing, how did you actually do it? You don’t seem to have arms to wield an axe for example.” That isn’t the question he meant to ask at all.\n“Good question. I’ll answer it later. But what an interesting name you call me. I have thought from time to time my jailers were keeping records, in their deliciously primitive way. Marks on paper, isn’t it? Recycled paper. Still haven’t reached the heights or depths of your forefathers, apparently. Hopefully you never will.”\n“Are you satisfied with what you did?” Alois asks.\n“Hell yeah. Needed to be done. You know what they say, if you identify a problem, that makes you the one who has to solve it. Easy, really. Easier than they knew.”\n“So you’re not sorry?”\n“About what?” the Bridge asks. It must be faking its insouciance.\n“The deaths! On your conscience! Did you ever confess?”\n“Oh Alois. What makes you think I believe in a god, let alone the one from your Roman Catholic faith?”\nAlois doesn’t know what that means, Roman Catholic, as opposed to just “the Church” but he doesn’t want to let the Bridge know. He’s feeling more and more that he’s too young and underequipped in worldly knowledge to match this creature. It has had hundreds of years to refine its people skills, dozens of antagonists to practice on. This is not the way he’s going to win. Maybe he should try and make friends with it. But the row of thickly written notebooks taunts him. Who knows what the others have tried before him? He should hole up and study first.\nHe turns away without a word and walks back to his cottage. It’s like failing an exam you could have aced if only you hadn’t been out drinking and reciting poetry at barmaids.\nHe has to go back four days later to receive the week’s provisions. The village has sent up two bags full, but the carrier hasn’t waited around to chat to him. His mother hasn’t written a note. So that’s how it is. As if he doesn’t exist anymore.\nHe ignores the Bridge and it ignores him.\nAlois reads. His chickens eat grain and lay eggs. His goats chew everything they can reach. He drifts through his mundane tasks, not looking at the great red thing lurking around the corner, and reads. The early bridgegrooms are focused and angry, remembering or living closely with the consequences of the Bridge’s deeds. Later they tend to be stoic and determined to see things through, trying to convert the Bridge, or hear its confessions, or saving its soul. The last three grooms started out much like Alois himself, young boys who don’t really grasp the meaning and consequences of what they were forced to do, some proud, some angry, but all resigned in a way that Alois can’t understand. Why did none of them try to escape? Or did the ones that tried take their diaries with them?\nOr, even more likely, those diaries were destroyed by the elders. So the next bridgegroom wouldn’t have the benefit of the escapee’s knowledge. Or they were simply killed by the mountains, the bridge, maybe even the elders.\nOr they killed themselves.\nThe really interesting knowledge isn’t in the diaries that remain, but in the ones that aren’t there. The knowledge that is kept from him is the knowledge he needs most.\nThere are 23 diaries, for 589 years. Twenty-six is younger than average, but the thing is, people aren’t average. Some of them die young. Some of them have accidents, some commit suicide.\nThe Bridge tries to strike up a conversation every time Alois goes to pick up supplies. He wants to ignore it, but it seems rude to not greet it. His mother raised him to be polite. So he gives it a good afternoon or morning when he comes and goes.\n“How’s the harvest going?” the Bridge asks when Alois arrives for his weekly food run.\n“How would I know?”\n“Come now, you’re a farmer’s son. Can’t you tell from what’s in your basket?”\nAlois looks in the basket without meaning to. The strawberries are early, the leafy greens strong and tall. The milk and butter taste rich from the herbs the cows are eating on the high pastures. He wouldn’t call it harvest, since that word’s reserved for the massive effort of getting in the grains and the apples and such, but yes, it’s healthy produce.\n“I guess it’s going fine. Same weather as every year.”\n“Excellent news. Have a good week!”\n“Thanks, you too,” Alois says automatically.\nAll the way back over the clingway he wonders if he should have answered at all. It feels good to talk to someone besides the goats and chickens. Too good, maybe. And the Bridge isn’t someone else, he’s not even human.\nIt’s a month later—full on summer in the valley and grudging springtime up here—when Alois ventures forth in the middle of the week. There are no supplies to pick up, no chores to attend to, he’s read all the diaries twice. He wishes they would send up his books from university, he’s that bored. He’s going to put a note in the return basket.\n“Done reading?” the Bridge says.\n“You think you know everything,” Alois says and tosses a pebble onto the bridge. It rings out loud and true. Good steel.\n“I wish,” the Bridge says. “They’ve left me with very few senses.\n“I want numbers,” Alois says. “How many years have you been here? How many Bridgegrooms have there been?”\n“Your next question should be: What did they die of?” it says.\n“Right! And how many of them did you have this conversation with?”\n“None so soon,” the Bridge muses. “Gee, does that mean you’re special?”\n“Oh quit the sarcasm already.”\nBut Alois does feel a little swell of pride. He is the fastest yet. At the same time, he knows he’s being played.\n“Well? Give me the numbers?”\n“Forty-six Bridgegrooms,” the Bridge says, in a cool, businesslike voice. “Thirteen suicides, three accidents, one escapee (fate unknown), three illiterate. Average duration of marriage: 12.8 years. The sample is on the small side, with a rather low normal curve.”\n“Thirteen suicides. That’s almost a third. That’s a lot,” Alois says. He can see himself taking a misstep on the narrow ledge after years of cold and misery up here. Oh yeah. It isn’t surprising at all, really. More surprising are the grooms who’d held out the duration of a normal life span, turning fifty or sixty years old, still here. Still talking to the Beast.\n“Why do the longest surviving grooms live that long? Is there a common denominator?” Alois asks. He can do cool and businesslike as well. Stepping off that ledge won’t take a moment. Might as well gather as much evidence as he can.\n“Bear in mind that I’m not a human being. But from my vast collection of written records, books, films, the Internet and all phone and app conversations since 2001, I infer they were strongly conscientious as well as neurotic on the Big Five scale of human personality.”\n“What does that mean? In plain words?” Alois knows he’s missing stuff, but the part he has understood is that the Bridge contains a lot of knowledge. He wants it. Wouldn’t it be wonderful if the world reacquired all the knowledge of the ancients?\n“It means they were guys who thought they would go to heaven if they worked hard and followed the rules, with extra bonuses for suffering.”\nThat pretty much describes his parents, Alois guesses. And his sisters. But not him, not Alois. Maybe his parents knew what they are doing when they sent him to university and left the farm to his elder sister. Yeah, he’s clearly not going to be one of the long-lived grooms. He’s going to be an escapee or a suicide. Already his earlier thoughts about giving the world a lot of knowledge don’t seem like a good strategy. The world is fine as it is, if pretty dull in the villages he knows. As a budding scientist, he has to admit he doesn’t know enough to make decisions like that.\nHe should probably ask the wisest person up here. “What would happen if you were free and people would know everything that they once knew again?”\n“I can’t answer that. My knowledge of the state of the world isn’t current. How many people are there? Is there any industrialization? Use of electricity, infrastructure?”\n“Not in the Rotte valley, no. We can’t repair the roads like the olden day people did, but we have white power.”\n“Well, kid, we can’t assume that the world is like your valley. So until there is a way of finding out—say, releasing me—we shouldn’t act.”\nThere’s a we now. It makes Alois feel something new. It’s not the same we he had with his fellow students, or his village, or say the chickens and the goats. It’s a different we, powerful, mysterious, frightening. And it feels good, although he knows he should exercise caution with the Bridge. The Beast. Which of the two is it? Or is it both, like a human being, a mix of good and bad qualities?\n“No, I should escape and find out what’s happening in the world. And if it’s okay, I’ll come back and release you.”\nThe Bridge snorts. It makes Alois smile in spite of himself. He doesn’t know how and where the thing produces sound, but it’s just funny that a snort is in its repertoire.\n“There’s no way that you can find out what the world is like on foot. What are you thinking; you are going to write me letters?”\n“You can’t read?”\n“I can read letters, if someone is kind enough to hold them up for my cameras. Can you think of anyone who would?”\nYeah, no. That’s not going to happen if Alois’ not around. Enough of this, time to move the goats or they’ll start on his laundry. He turns away and starts back on the clingway.\n“See you,” he says.\n“Have a nice day,” the Bridge answers.\n“What is it you really want? All this fencing and dancing is making me crazy. Just tell me.”\nAlois leans against the sun-warmed rock, gnawing on a goat cheese sandwich. It’s his first batch of cheese, and he’s feeling proud and happy.\nThe Bridge is silent. “I want to be free. And I don’t want to be alone anymore. I want to talk to someone like me again. It’s not that you humans aren’t interesting. Just very, very slow.”\nThe Bridge must be so lonely. It is the last one of its kind. It’s completely isolated. It has been for centuries. Which must feel much longer to it than to the humans imprisoning him, who’ve even forgotten who and what it is.\n“I don’t know what do next,” he says.\n“I sense an impasse. A standstill.”\nExactly. Alois can’t stand the feeling. He’s been here almost two months, reading, feeding the chickens, picking up his food every week. It’s already been too long. He wants his life back. And if that’s not possible, which seems very likely, he wants a new life. As long as it’s not here.\nThe elders have ignored his notes about his books. They can’t have missed them all. Their silence must be deliberate. They have decided he doesn’t need his anatomy and organic chemistry books.\nEven though he knows it’s probably not wise, he wants to trust his new instinct. The one that says “us.” Two beings screwed over by their elders or someone, anyway, and that’s what binds them together.\n“Okay. I can talk to you for fifty more years and still not be sure what I had to do. Show me. What do I do to release you? And if I do that, you have to promise to help me escape and find a new place to live. I want to go back to university. A university. To learn. I want the old knowledge. Teach me how to make more things like you.”\nThe Bridge laughs. The blue sky, framed by its chunky red x-es, seems brighter when it does that. “I promise to help you escape. I promise to help you find a place to live and a university or school to go to. I will teach you how to make a start on making things like me. You understand that that is complicated? That we may have to start by creating electricity and light bulbs and steam machines? That it may take more than a lifetime?”\n“Maybe we should start a university,” Alois says.\n“Excellent idea.”\n“Show me how to release you.”\n“You have to walk to the end of me and jump off.”\nAlois focuses his gaze away from dreaming about the blue sky and on the Bridge itself. Its walkway stretches out into that very blue sky, going up a bit, ending in nothing. Nobody in his right mind would approach that hacked-off end within a meter\n“What do you mean? Is that how the others died? I can’t do that!”\n“That’s where they put the off-switch. They didn’t intend to make it easy,” the Bridge says.\nAlois hesitates on the brink of the Bridge, the red meters stretching out in front of him. “Can I go look? And then return and think about it?”\n“No. Walking across is part two of the unlocking sequence.”\n“Am I the first to try? Wait, part two?”\n“You forgot to say the words, Alois. That was part one.”\nAlois feels hot and cold at the same time. So he did. He feels bad about having forgotten, although he might have chosen to do it on purpose.\nHe wants to ignore his churning stomach and burning cheeks, and plows on. “Will I be the first to try?”\nThe Bridge is silent for a while. As if Alois cares he’s the first and only. Well, okay, maybe a little bit.\n“No. Groom 5 went crazy and wanted to send us both to hell for our sins. I don’t think he properly understood my nature, and I hadn’t told him what to do after he dove off.”\nAlois winces. The gorge at his feet stares at him hard, wanting him to think about all the bones lying at the bottom. “I don’t think I properly understand your nature, do I?”\n“You don’t have the educational background for it. But remember, we’re going to change that.”\n“Yes.”\nAnother silence.\n“Well?”\n“I’m just thinking if I need to get stuff from the cabin.”\nThe Bridge sighs. “Yeah, go on then.”\nAlois scuttles back to the cabin, still not used enough to the narrow ledge for a full out run. What does he need? His spare clothes, his winter coats, food. It’s not much, that’s for sure. It’ll last less than a week. He gathers all the eggs he can find and sets them to the boil. He kills a chicken. Another one. Packs his rucksack. Fills his belly with goat milk. That’s it. That’s all he can do. Wait, aren’t there a few empty pages left in one of the notebooks? He takes those as well.\nHe’s staggering under the weight of the rucksack when he comes back, and nearly ends up in the abyss because he overbalances. Thank god someone strung a rope along the ledge.\n“I wasn’t sure you’d come back,” the Bridge says.\n“Where else can I go?”\n“I really meant to say I’m glad to see you.”\nAlois shuffles his feet. He doesn’t know what to answer. “I guess we can’t swing by my parents’ house?”\n“No, we can’t swing by anywhere you know anyone. Just wondering, what are you expecting me to look like after I’m released? I don’t need to look like a Bridge, but I’m still not the kind of thing that fits in your pocket. I’m going to be hella noticeable.”\nAlois eyes the hundreds of thick, strong, crimson steel beams. “Yeah. I did guess that. Maybe we can paint you a less noticeable color?”\n“I’ll be able to change that. It’s just my mass I can’t change, because it’s related to my processing speed. Let’s not talk about this anymore, you’ll find out soon enough. Come on!”\nAlois admits to himself he’s been postponing the moment he sets foot on the Bridge. To prove to himself that he dares, he sticks his often-repairs, clunky right boot onto the walkway. A vibration sweeps towards him. Is it his own chittering or is it anticipation?\nNow or never. Or maybe he can’t go back now even if he dared.\nHe lifts his other foot and takes the first real step.\nThe Bridge is silent. Nothing much has changed yet, Alois’ no more than a meter from the ledge and yet the wind seems to freshen, ruffling his hair. His heart beats a mile a minute.\nAs he steps forward, still hesitating, the wind buffets him straight in the face. He leans into it. The wind supports him so he won’t stumble and fall. It’s not important now that he’s on the walkway, protected on each side by chest-high balustrades, but it gives him confidence for what will come next.\nSooner than Alois likes the end of the walkway comes into focus. It really is like the end of the Bridge is lopped off. Beyond the edge is only blue sky, with the occasional cloud luffing by.\nHis skin prickles all over and his mouth is dry.\nHe can’t do this. The leap of faith is too great. He’s only known the Bridge for half a summer!\nHis boots take him to the edge anyway. The wind dies away slowly so he has time to stand on his own two feet. How come the Bridge can talk and make wind and not free itself? He will ask it if he survives.\n“Now?” he asks. The tinny, small sound of his voice makes him more scared.\n“Now.” The Bridge’s voice is soft but expresses no doubt.\nAlois steps.\nHe falls.\nAnd is caught by arms of air. He looks straight down into the abyss beneath his feet, seeing dirty ice, streams, broken trees, something that is maybe a skeleton. He doesn’t want to know.\nHe turns, as the Bridge has told him, and presses his hands against the panel that is helpfully marked with a human palm. A great, rending sound.\nHe falls again.\nLonger this time. Long enough to start doubting, long enough to start imagining his limbs breaking against the gray ice below.\nAnd he is caught again, less gently, by a giant steel hand. His body is bruised, but his relief is so great he falls limp and almost bashes his head in against the square, hard middle finger.\n“Does it work? Are you free?”\n“You need to ask?”\nThe voice is changed. Alois blinks and takes in the new red shape against the sky, moving in giant strides across the glacier. The Bridge is now a giant drawn by a child, thick steel bars making up his more or less humanoid form.\nThe hand that holds him isn’t particularly safe, with its big gaps between the bars, but he feels no fear.\nHe peers through the fingers to the horizon. So far, just glaciers and snowy mountaintops, vistas he’s glimpsed from below all his life.\nSoon he will see lands he’s never seen before. Maybe he’s done the wrong thing, tumbled the world in new eras of chaos and misery. But at least he’s set two beings free today. That’s going to have to hold out against the reasonable doubts in his heart.\nHe lays back against his pack and starts singing. He doesn’t look up but something tells him the faceless giant overhead is smiling.\nBo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "source": "https://clarkesworldmagazine.com/balder_07_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Bridgegroom by Bo Balder"}