{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Mark Cole", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "TIasVYQpFLr6JxHdP67adFpGMfA=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  “Fans Are Slans”: A Study in Campbellian Influence  In September of 1959, Jason Howley walked into the Golden Casino in Reno, Nevada, carrying a small, black, plastic box. Within a matter of minutes, he’d won over three hundred thousand dollars. When the device was opened up by investigators, they found nothing in it but a plastic lens, two silver contacts, white paint, and a series of diagrams drawn in black ink.  Regular readers of Astounding Science Fiction recognized it immediately when they read “David Gordon” (Randall Garrett)’s story, “ . . . Or Your Money Back”: it was a version of the Hieronymus Machine, a “psionic amplifier” promoted by Astounding’s editor, John W. Campbell.  And by the end of Randall’s story, we’d harnessed the power of this empty plastic box to take us on our first trip to Mars.  It is a curious contradiction: we think of SF as a genre solidly grounded in physical reality, and yet we keep running into aliens with incredible mental powers—or secret agents with invisible psionic “arms,” or whole corps full of telepaths, or people capable of teleporting, or even future societies where the elite indulge in intricate telepathic cocktail chatter.  Nor are these encounters mere evolutionary throwbacks, leftover from the genre’s earliest days in pulpwood magazines. They didn’t creep into modern SF through some forgotten unlocked door, but instead grew and developed along with it, in the work of some of the finest SF writers of the Golden Age.  One thing more than anything else ushered psychic powers into the mainstream of SF: the influence of one of the genre’s greatest editors, in the pages of one of the most distinguished SF magazines of the Golden Age.  The influence of John W. Campbell and his work in Astounding.  Campbell was one of the most remarkable figures of the Golden Age of Science Fiction: an accomplished SF writer (under his own name and as Donald A. Stuart), he abandoned his writing career when he took over Astounding Science Fiction in October of 1937.  His vision of what good SF should be transformed the genre and established much of what we take for granted in SF today: Campbell insisted that his authors create stories with strong characters, good writing, and sound science. The stable of new writers he discovered and trained included Isaac Asimov, A.E. Van Vogt, Robert Heinlein, and Theodore Sturgeon.  Not that his editing was without its eccentricities. Campbell loved to challenge his authors, deliberately taking positions he didn’t actually believe in just to get them to rethink their own ideas. He loved stories based on the Socratic approach to learning. He loved stories about a certain kind of take-charge Earthling, usually military men, where in the end we usually triumph because of some natural advantage we have over the aliens (a notion Ray Bradbury lampoons nicely in his 1949 short story “The Concrete Mixer”).  And then there is his interest in psionics.  Campbell himself invented the term, combining “electronics” with “psi.” As electronics had harnessed previously unknown powers of electricity, “psionics” would eventually yield a reliable technological method of doing the same with the powers of the mind.  Underlying his interest in psionics was a belief in the evolution of the human mind, leading ultimately to mental powers. This belief would lead Campbell to publish L. Ron Hubbard’s first essay on dianetics, with its promise of self-willed mental evolution (although he was quick to drop it once Hubbard turned it into a religion) and he publicly announced his desire to publish articles about the mind based on direct experimentation.  All of this sounds very familiar. Countless SF stories have had this same evolutionary rationale at their hearts. Somehow one thinks of Slan, A.E. Van Vogt’s novel about telepathic evolved superhumans (Slans), which first appeared in Astounding. Shortly after it appeared, SF fans adopted the slogan “fans are slans,” believing that their (perceived) greater intelligence and imagination than other readers was a sign that they were more evolved.  Today, of course, while research into such mental powers continues, parapsychology has failed to find conclusive evidence of its existence—let alone the ability to power space ships. It is widely seen as a dubious pseudoscience plagued by claims of fraud.  But what we forget from our comfortable perspective in the twenty-first century is just how different things looked back then, when Joseph B. Rhine and others made their first claims that they had proven the existence of telepathy.  Rhine first got interested in psychical research in 1922, when he attended a lecture by Sir Arthur Conan Doyle, the legendary creator of Sherlock Holmes—and a convert to Spiritualism. Doyle triumphantly declared to his audience that we now had scientific proof of communication with the dead. “This mere possibility was the most exhilarating thought I had had in years.” Rhine wrote many years later.  Doyle was by no means alone in his beliefs. Perhaps the most embarrassing aspect of the Nineteenth Century Spiritualism craze was the remarkable number of scientists among its most enthusiastic supporters. Sir Oliver Lodge, for example, perhaps the most important British scientist of his age, is now primarily remembered for his Spiritualist beliefs. The attraction was obvious: Spiritualism promised supposedly empirical proof about questions normally regarded as religious. Why debate about the nature of the afterlife when we can ask our late Uncle Ned what the weather is like there?  Rhine realized that the best way to determine whether anyone could talk with the dead lay in first determining whether some form of extra-sensory communication was in fact possible. When he joined the psychology department at Duke University in 1927, he began his first attempts to test ESP under laboratory conditions. By 1935, his work had proved so successful that he founded the Duke Parapsychology Laboratory.  And in 1931, a young pulp writer named John W. Campbell arrived at Duke University to finish his Bachelor of Science in physics.  According to The Routledge Companion to Science Fiction, Campbell actually volunteered to participate in Rhine’s experiments. Certainly, his exposure to Rhine’s work impressed him enormously. Even before he took over as editor at Astounding, his stories reflected his interest in Rhine’s work. His final published story, “Who Goes There?” actually refers to Rhine and Duke University by name.  It isn’t hard to see why Rhine’s work impressed him: instead of sitting around in the dark, waiting for some unpredictable and unexpected manifestation with nothing but the most limited means of studying it, the search for the paranormal could now take place within a laboratory setting. What’s more, thanks to Rhine’s use of card-guessing and statistical analysis—the results would be fully quantifiable.  And quantifiability is the distinguishing mark of the physical sciences.  What’s more, Rhine quickly found a number of subjects who displayed what appeared to be impressive psi abilities. When he published the results of his work in a book, New Frontiers of the Mind (1937)—the same year Campbell took over Astounding—he announced that he had found conclusive, scientific proof for the existence of ESP.  It wasn’t long before other scientists started questioning Rhine’s work. No other lab ever duplicated his successes and Rhine was forced to revise his methodologies over and over again to prevent fraud. They also criticized the lack of transparency behind these changes, as Rhine never revealed what prompted any of them. Nor did he identify any past subjects he’d caught cheating on the tests (and persistent rumors suggest that these may have included his most successful early subject, Hubert Pearce). But his work still appeared to be quite convincing long after Rhine published his first book.  But Campbell’s belief in psionics went further than any of Rhine’s claims. In a rather curious 1952 letter to Eric Frank Russell about Charles Fort (the author of a series of books that collected accounts of bizarre events and supernatural powers) he claimed that he had, through two years of hard worked achieved what he described as “the basic understanding of what the psionic functions are, and how they work.”  Criticizing Fort for failing to couch his work in scientific language and then insulting the scientists for not listening to him, Campbell noted that Fort “was too stinking lazy” to do the hard work needed to integrate his data into an intelligible framework. He refused to make the same mistake himself, but had introduced psionics into Astounding because he now felt he had achieved the theoretical understanding of such phenomena he needed.  But he wasn’t about to reveal this understanding until he could “ . . . demonstrate the phenomena myself, and communicate the exact nature of the mechanisms involved, with demonstrations of each step . . . ”  It is hard to know what to make of these claims, or his insistence that he knew “the general concept of teleportation, levitation, and a few other spontaneous psi phenomena—also telekinesis, etc. In addition, I know the general basic laws which can permit precognition, and an absolute barrier of pure force that will block passage of any force now known to physical science,” although some of his comments suggest that this was a purely intellectual effort on his part, cobbled together from bits and pieces of data, and some of it from Fort’s work.  While it comes as little surprise that Campbell recommended that his authors search Fort’s books for possible story ideas, Astounding actually serialized Fort’s, Lo! five years before Campbell’s arrival. Long before Campbell’s recommendation a great many authors of SF and Weird Fantasy had read and admired Fort—and then borrowed many of his ideas.  However, it is curious to note that Fort adopted a wry, humorous tone in his books and never took his claims as seriously as his followers have.  Perhaps the oddest of Campbell’s psionics claims involved a device known as the Hieronymus Machine.  Invented in 1949, Dr. Thomas Galen Hieronymus’ machine supposedly measured a mysterious emanation from all matter that he called “eloptic energy.” While not electromagnetic in nature, it had qualities of both light and electricity. His detector, however, required a human operator to make any observations, as the only output was a tingling sensation, or slight feeling of “stickiness” transmitted to a rubber touch pad.  It is interesting to note that these claims closely resemble those made in 1903 by Prosper-René Blondlot for what he called “N rays.” He and his colleagues made hundreds of detailed observations of N rays, using a dim, luminous screen as a detector.  Supposedly, its brightness increased in the presence of the mysterious rays, although this was later proved to be an entirely subjective phenomenon. Carl Reichenbach and Anton Mesmer both claimed to have discovered similar forces, although, again, based on subjective observations Reichenbach himself was not one of those few who could see the Odic aura, which he claimed existed around our bodies!  Campbell rejected the idea that the Hieronymus’ Machine was a mere electronic device. Instead, he believed that it worked through the user’s psionic energies and that the electronics were, in fact, unnecessary. All that was required was a copy of the Machine’s wiring diagram.  Supposedly, the conductive properties of ink were enough to make the “Symbolic Hieronymus Machine” work. Dr. Hieronymus himself was more than skeptical of Campbell’s ideas, and particularly objected to his insistence that the machine was a “magical” device.  Once again, Campbell used Astounding to promote his ideas and the Machine shows up in many of the stories he published—including the device in Randall Garrett’s story, “ . . . Or Your Money Back.” Garrett himself seemed comfortable with the idea: after all, his most famous series was set in a world which had codified the laws of “magic” (i.e., mental powers), leading to not an industrial revolution but a magical one.  But one does have to wonder what Campbell’s readers thought of the Machine.  Eventually, Campbell drove away many of his best-known authors. This was partly because of his often-abrasive personality and outrageous opinions (not all of which he actually believed), and partly because of his interest in such dubious and pseudoscientific ideas as psionics, dianetics, dowsing, and the Dean Drive (which could supposedly create reactionless thrust).  Psychic powers no longer have as firm a place in SF as they once had, although they are too deeply embedded in the genre’s genome to ever be fully extirpated. After all, they go back not just to the work of H.G. Wells, but to the tangled mixture of superstition and science in Gothic horror. They still appear regularly in SF movies, television, comics, and young adult novels. They have even reappeared in space opera in Terry Pratchett and Steven Baxter’s Long Earth series, where the device that allows people to cross between alternate Earths is psionic in nature—and a few, more evolved people are capable of crossing by themselves. That harkens back to the Golden Age of SF, when Gully Foyle’s psi powers suddenly awakened, teleporting him to safety out of deep space.  Perhaps the interest in post-humanism and the singularity—and the mental evolution those theories promise—will bring psionics back to the mainstream again.  But then, if Roger Penrose is right about the limits of artificial intelligence, the singularity, too, may end up on the heap of discarded pseudosciences.  Beneath Campbell’s interest in these dubious claims lay his desire to publicize what he saw as breakthrough research that the scientific mainstream refused to take seriously.  Perhaps this may not sound particularly extraordinary today. After all, Thomas Kuhn first proposed his post-modern theory of scientific paradigms in 1962. Most people now accept the idea that science has progressed through a series of “paradigms,” where radical new ideas could only be accepted once the basic mindset of scientists changed (although no one seems to notice that Kuhn also believed that modern science had not arrived at a greater understanding of the truth, merely a different one). But at the time science was still seen as a heroic upward progress, with each new discovery taking us ineluctably to the next stage.  Theories that we now dismiss as pseudoscience—like the universal ether, or the vitalist forces animating living things, or the caloric theory of heat—often seemed plausible when first proposed. Usually, the label “pseudoscientific” reflects a failure to find a workable empirical method to study a theory: had Rhine’s early success remained unchallenged, even if it never uncovered anything more extravagant than a few people with limited ESP abilities, then Campbell would not look quite so foolish.  And he would surely take some comfort in the fact that NASA is still doing serious research into the Woodward Effect, a theoretical form of reactionless thrust that bears more than a little resemblance to Dean’s claims.  It is tempting to think that it can’t happen to us. After all, it is all too clear just how dubious the theories that snared John W. Campbell were. But the history of science is littered with the corpses of promising theories, and anyone who tries to use cutting edge ideas in SF may end up looking absurd.  Ultimately, regardless of what one might think of Campbell’s decision to drag his pet theories into Astounding, what really matters is that the stories he published were consistently entertaining.  And that is rare indeed.  Mark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction.", "text": "Non-Fiction\n“Fans Are Slans”: A Study in Campbellian Influence\nIn September of 1959, Jason Howley walked into the Golden Casino in Reno, Nevada, carrying a small, black, plastic box. Within a matter of minutes, he’d won over three hundred thousand dollars. When the device was opened up by investigators, they found nothing in it but a plastic lens, two silver contacts, white paint, and a series of diagrams drawn in black ink.\nRegular readers of Astounding Science Fiction recognized it immediately when they read “David Gordon” (Randall Garrett)’s story, “ . . . Or Your Money Back”: it was a version of the Hieronymus Machine, a “psionic amplifier” promoted by Astounding’s editor, John W. Campbell.\nAnd by the end of Randall’s story, we’d harnessed the power of this empty plastic box to take us on our first trip to Mars.\nIt is a curious contradiction: we think of SF as a genre solidly grounded in physical reality, and yet we keep running into aliens with incredible mental powers—or secret agents with invisible psionic “arms,” or whole corps full of telepaths, or people capable of teleporting, or even future societies where the elite indulge in intricate telepathic cocktail chatter.\nNor are these encounters mere evolutionary throwbacks, leftover from the genre’s earliest days in pulpwood magazines. They didn’t creep into modern SF through some forgotten unlocked door, but instead grew and developed along with it, in the work of some of the finest SF writers of the Golden Age.\nOne thing more than anything else ushered psychic powers into the mainstream of SF: the influence of one of the genre’s greatest editors, in the pages of one of the most distinguished SF magazines of the Golden Age.\nThe influence of John W. Campbell and his work in Astounding.\nCampbell was one of the most remarkable figures of the Golden Age of Science Fiction: an accomplished SF writer (under his own name and as Donald A. Stuart), he abandoned his writing career when he took over Astounding Science Fiction in October of 1937.\nHis vision of what good SF should be transformed the genre and established much of what we take for granted in SF today: Campbell insisted that his authors create stories with strong characters, good writing, and sound science. The stable of new writers he discovered and trained included Isaac Asimov, A.E. Van Vogt, Robert Heinlein, and Theodore Sturgeon.\nNot that his editing was without its eccentricities. Campbell loved to challenge his authors, deliberately taking positions he didn’t actually believe in just to get them to rethink their own ideas. He loved stories based on the Socratic approach to learning. He loved stories about a certain kind of take-charge Earthling, usually military men, where in the end we usually triumph because of some natural advantage we have over the aliens (a notion Ray Bradbury lampoons nicely in his 1949 short story “The Concrete Mixer”).\nAnd then there is his interest in psionics.\nCampbell himself invented the term, combining “electronics” with “psi.” As electronics had harnessed previously unknown powers of electricity, “psionics” would eventually yield a reliable technological method of doing the same with the powers of the mind.\nUnderlying his interest in psionics was a belief in the evolution of the human mind, leading ultimately to mental powers. This belief would lead Campbell to publish L. Ron Hubbard’s first essay on dianetics, with its promise of self-willed mental evolution (although he was quick to drop it once Hubbard turned it into a religion) and he publicly announced his desire to publish articles about the mind based on direct experimentation.\nAll of this sounds very familiar. Countless SF stories have had this same evolutionary rationale at their hearts. Somehow one thinks of Slan, A.E. Van Vogt’s novel about telepathic evolved superhumans (Slans), which first appeared in Astounding. Shortly after it appeared, SF fans adopted the slogan “fans are slans,” believing that their (perceived) greater intelligence and imagination than other readers was a sign that they were more evolved.\nToday, of course, while research into such mental powers continues, parapsychology has failed to find conclusive evidence of its existence—let alone the ability to power space ships. It is widely seen as a dubious pseudoscience plagued by claims of fraud.\nBut what we forget from our comfortable perspective in the twenty-first century is just how different things looked back then, when Joseph B. Rhine and others made their first claims that they had proven the existence of telepathy.\nRhine first got interested in psychical research in 1922, when he attended a lecture by Sir Arthur Conan Doyle, the legendary creator of Sherlock Holmes—and a convert to Spiritualism. Doyle triumphantly declared to his audience that we now had scientific proof of communication with the dead. “This mere possibility was the most exhilarating thought I had had in years.” Rhine wrote many years later.\nDoyle was by no means alone in his beliefs. Perhaps the most embarrassing aspect of the Nineteenth Century Spiritualism craze was the remarkable number of scientists among its most enthusiastic supporters. Sir Oliver Lodge, for example, perhaps the most important British scientist of his age, is now primarily remembered for his Spiritualist beliefs. The attraction was obvious: Spiritualism promised supposedly empirical proof about questions normally regarded as religious. Why debate about the nature of the afterlife when we can ask our late Uncle Ned what the weather is like there?\nRhine realized that the best way to determine whether anyone could talk with the dead lay in first determining whether some form of extra-sensory communication was in fact possible. When he joined the psychology department at Duke University in 1927, he began his first attempts to test ESP under laboratory conditions. By 1935, his work had proved so successful that he founded the Duke Parapsychology Laboratory.\nAnd in 1931, a young pulp writer named John W. Campbell arrived at Duke University to finish his Bachelor of Science in physics.\nAccording to The Routledge Companion to Science Fiction, Campbell actually volunteered to participate in Rhine’s experiments. Certainly, his exposure to Rhine’s work impressed him enormously. Even before he took over as editor at Astounding, his stories reflected his interest in Rhine’s work. His final published story, “Who Goes There?” actually refers to Rhine and Duke University by name.\nIt isn’t hard to see why Rhine’s work impressed him: instead of sitting around in the dark, waiting for some unpredictable and unexpected manifestation with nothing but the most limited means of studying it, the search for the paranormal could now take place within a laboratory setting. What’s more, thanks to Rhine’s use of card-guessing and statistical analysis—the results would be fully quantifiable.\nAnd quantifiability is the distinguishing mark of the physical sciences.\nWhat’s more, Rhine quickly found a number of subjects who displayed what appeared to be impressive psi abilities. When he published the results of his work in a book, New Frontiers of the Mind (1937)—the same year Campbell took over Astounding—he announced that he had found conclusive, scientific proof for the existence of ESP.\nIt wasn’t long before other scientists started questioning Rhine’s work. No other lab ever duplicated his successes and Rhine was forced to revise his methodologies over and over again to prevent fraud. They also criticized the lack of transparency behind these changes, as Rhine never revealed what prompted any of them. Nor did he identify any past subjects he’d caught cheating on the tests (and persistent rumors suggest that these may have included his most successful early subject, Hubert Pearce). But his work still appeared to be quite convincing long after Rhine published his first book.\nBut Campbell’s belief in psionics went further than any of Rhine’s claims. In a rather curious 1952 letter to Eric Frank Russell about Charles Fort (the author of a series of books that collected accounts of bizarre events and supernatural powers) he claimed that he had, through two years of hard worked achieved what he described as “the basic understanding of what the psionic functions are, and how they work.”\nCriticizing Fort for failing to couch his work in scientific language and then insulting the scientists for not listening to him, Campbell noted that Fort “was too stinking lazy” to do the hard work needed to integrate his data into an intelligible framework. He refused to make the same mistake himself, but had introduced psionics into Astounding because he now felt he had achieved the theoretical understanding of such phenomena he needed.\nBut he wasn’t about to reveal this understanding until he could “ . . . demonstrate the phenomena myself, and communicate the exact nature of the mechanisms involved, with demonstrations of each step . . . ”\nIt is hard to know what to make of these claims, or his insistence that he knew “the general concept of teleportation, levitation, and a few other spontaneous psi phenomena—also telekinesis, etc. In addition, I know the general basic laws which can permit precognition, and an absolute barrier of pure force that will block passage of any force now known to physical science,” although some of his comments suggest that this was a purely intellectual effort on his part, cobbled together from bits and pieces of data, and some of it from Fort’s work.\nWhile it comes as little surprise that Campbell recommended that his authors search Fort’s books for possible story ideas, Astounding actually serialized Fort’s, Lo! five years before Campbell’s arrival. Long before Campbell’s recommendation a great many authors of SF and Weird Fantasy had read and admired Fort—and then borrowed many of his ideas.\nHowever, it is curious to note that Fort adopted a wry, humorous tone in his books and never took his claims as seriously as his followers have.\nPerhaps the oddest of Campbell’s psionics claims involved a device known as the Hieronymus Machine.\nInvented in 1949, Dr. Thomas Galen Hieronymus’ machine supposedly measured a mysterious emanation from all matter that he called “eloptic energy.” While not electromagnetic in nature, it had qualities of both light and electricity. His detector, however, required a human operator to make any observations, as the only output was a tingling sensation, or slight feeling of “stickiness” transmitted to a rubber touch pad.\nIt is interesting to note that these claims closely resemble those made in 1903 by Prosper-René Blondlot for what he called “N rays.” He and his colleagues made hundreds of detailed observations of N rays, using a dim, luminous screen as a detector.\nSupposedly, its brightness increased in the presence of the mysterious rays, although this was later proved to be an entirely subjective phenomenon. Carl Reichenbach and Anton Mesmer both claimed to have discovered similar forces, although, again, based on subjective observations Reichenbach himself was not one of those few who could see the Odic aura, which he claimed existed around our bodies!\nCampbell rejected the idea that the Hieronymus’ Machine was a mere electronic device. Instead, he believed that it worked through the user’s psionic energies and that the electronics were, in fact, unnecessary. All that was required was a copy of the Machine’s wiring diagram.\nSupposedly, the conductive properties of ink were enough to make the “Symbolic Hieronymus Machine” work. Dr. Hieronymus himself was more than skeptical of Campbell’s ideas, and particularly objected to his insistence that the machine was a “magical” device.\nOnce again, Campbell used Astounding to promote his ideas and the Machine shows up in many of the stories he published—including the device in Randall Garrett’s story, “ . . . Or Your Money Back.” Garrett himself seemed comfortable with the idea: after all, his most famous series was set in a world which had codified the laws of “magic” (i.e., mental powers), leading to not an industrial revolution but a magical one.\nBut one does have to wonder what Campbell’s readers thought of the Machine.\nEventually, Campbell drove away many of his best-known authors. This was partly because of his often-abrasive personality and outrageous opinions (not all of which he actually believed), and partly because of his interest in such dubious and pseudoscientific ideas as psionics, dianetics, dowsing, and the Dean Drive (which could supposedly create reactionless thrust).\nPsychic powers no longer have as firm a place in SF as they once had, although they are too deeply embedded in the genre’s genome to ever be fully extirpated. After all, they go back not just to the work of H.G. Wells, but to the tangled mixture of superstition and science in Gothic horror. They still appear regularly in SF movies, television, comics, and young adult novels. They have even reappeared in space opera in Terry Pratchett and Steven Baxter’s Long Earth series, where the device that allows people to cross between alternate Earths is psionic in nature—and a few, more evolved people are capable of crossing by themselves. That harkens back to the Golden Age of SF, when Gully Foyle’s psi powers suddenly awakened, teleporting him to safety out of deep space.\nPerhaps the interest in post-humanism and the singularity—and the mental evolution those theories promise—will bring psionics back to the mainstream again.\nBut then, if Roger Penrose is right about the limits of artificial intelligence, the singularity, too, may end up on the heap of discarded pseudosciences.\nBeneath Campbell’s interest in these dubious claims lay his desire to publicize what he saw as breakthrough research that the scientific mainstream refused to take seriously.\nPerhaps this may not sound particularly extraordinary today. After all, Thomas Kuhn first proposed his post-modern theory of scientific paradigms in 1962. Most people now accept the idea that science has progressed through a series of “paradigms,” where radical new ideas could only be accepted once the basic mindset of scientists changed (although no one seems to notice that Kuhn also believed that modern science had not arrived at a greater understanding of the truth, merely a different one). But at the time science was still seen as a heroic upward progress, with each new discovery taking us ineluctably to the next stage.\nTheories that we now dismiss as pseudoscience—like the universal ether, or the vitalist forces animating living things, or the caloric theory of heat—often seemed plausible when first proposed. Usually, the label “pseudoscientific” reflects a failure to find a workable empirical method to study a theory: had Rhine’s early success remained unchallenged, even if it never uncovered anything more extravagant than a few people with limited ESP abilities, then Campbell would not look quite so foolish.\nAnd he would surely take some comfort in the fact that NASA is still doing serious research into the Woodward Effect, a theoretical form of reactionless thrust that bears more than a little resemblance to Dean’s claims.\nIt is tempting to think that it can’t happen to us. After all, it is all too clear just how dubious the theories that snared John W. Campbell were. But the history of science is littered with the corpses of promising theories, and anyone who tries to use cutting edge ideas in SF may end up looking absurd.\nUltimately, regardless of what one might think of Campbell’s decision to drag his pet theories into Astounding, what really matters is that the stories he published were consistently entertaining.\nAnd that is rare indeed.\nMark Cole hates writing bios. Despite many efforts he has never written one he likes, perhaps because there are many other things he'd rather be writing. He writes from Warren, Pennsylvania, where he has managed to avoid writing about himself for both newspaper and magazine articles. His musings on Science Fiction have appeared in Clarkesworld and at IROSF.com, while his most recent story, \"Let's Start from the Top...\" appeared in Daily Science Fiction.", "source": "https://clarkesworldmagazine.com/cole_08_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: “Fans Are Slans”: A Study in Campbellian Influence by Mark Cole"}