{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Natalia Theodoridou", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "VXz/UFwyhZYI7y/adE/puKKSw8U=", "id": null, "license": null, "comments": "", "raw_text": "3780 words, short story  The Eleven Holy Numbers of the Mechanical Soul  a=38. This is the first holy number.  Stand still. Still. In the water. Barely breathing, spear in hand. One with the hand.  A light brush against my right calf. The cold and glistening touch of human skin that is not human. Yet, it’s something. Now strike. Strike.  Theo had been standing in the sea for hours—his bright green jacket tied high around his waist, the water up to his crotch. Daylight was running out. The fish was just under the point of his spear when he caught a glimpse of a beast walking towards him. Animalis Primus. The water was already lapping at its first knees.  He struck, skewering the middle of the fish through and through. It was large and cumbersome—enough for a couple of days. It fought as he pulled it out of the water. He looked at it, its smooth skin, its pink, human-like flesh. These fish were the closest thing to a human being he’d seen since he crashed on Oceanus.  Theo’s vision blurred for a moment, and he almost lost his balance. The fish kept fighting, flapping against the spear.  It gasped for air.  He drove his knife through its head and started wading ashore.  Animalis Primus was taking slow, persistent steps into the water. Its stomach bottles were already starting to fill up, its feet were tangled in seaweed. Soon, it would drown.  Theo put the fish in the net on his back and sheathed his spear to free both his hands. He would need all of his strength to get the beast back on the beach. Its hollow skeleton was light when dry, but wet, and with the sea swelling at dusk—it could take them both down.  When he got close enough, Theo placed his hands against the hips of the advancing beast to stop its motion, then grabbed it firmly by its horizontal spine to start pushing it in the other direction. The beast moved, reluctantly at first, then faster as its second knees emerged from the water and met less resistance. Finally its feet gained traction against the sand, and soon Theo was lying on his back, panting, the fish on one side, the beast on the other, dripping on the beach and motionless. But he was losing the light. In a few moments, it would be night and he would have to find his way back in the dark.  He struggled to his feet and stood next to the beast.  “What were you doing, mate?” he asked it. “You would have drowned if I hadn’t caught you, you know that?”  He knelt by the beast’s stomach and examined the bottles. They were meant to store pressurized air—now they were full of water. Theo shook his head. “We need to empty all these, dry them. It will take some time.” He looked for the tubing that was supposed to steer the animal in the opposite direction when it came in contact with water. It was nowhere to be found.  “All right,” he said. “We’ll get you fixed soon. Now let’s go home for the night, ja?”  He threw the net and fish over his shoulder and started pushing Animalis Primus towards the fuselage.  b=41,5. This is the second holy number.  Every night, remember to count all the things that do not belong here. So you don’t forget. Come on, I’ll help you.  Humans don’t belong here. Remember how you couldn’t even eat the fish at first, because they reminded you too much of people, with their sleek skin, their soft, scaleless flesh? Not any more, though, ja? I told you, you would get over it. In time.  Animals don’t belong here, except the ones we make.  Insects.  Birds.  Trees. Never knew I could miss trees so much.  Remember how the fish gasped for air? Like I would. Like I am.  It will be light again in a few hours. Get some sleep, friend. Get some sleep.  The wind was strong in the morning. Theo emerged from the fuselage and tied his long gray hair with an elastic band. It was a good thing he’d tethered Animalis Primus to the craft the night before.  He rubbed his palms together over the dying fire. There was a new sore on the back of his right hand. He would have to clean it with some saltwater later. But there were more important things to do first.  He walked over to the compartment of the craft that he used as a storage room and pulled free some white tubing to replace the damaged beast’s water detector. He had to work fast. The days on Oceanus waited for no man.  About six hours later, the bottles in Animalis Primus were empty and dry, a new binary step counter and water detector installed. All he had to do now was test it.  Theo pushed the beast towards the water, its crab-like feet drawing helixes in the wet sand. He let the beast walk to the sea on its own. As soon as the detector touched the surf, Animalis Primus changed direction and walked away from the water.  Theo clapped. “There you go, mate!” he shouted. “There you go!”  The beast continued to walk, all clank and mechanical grace. As it passed by Theo, it stopped, as if hesitating.  Then, the wind blew, and the beast walked away.  Dusk again, and the winds grew stronger. Nine hours of day, nine hours of night. Life passed quickly on Oceanus.  Theo was sitting by the fire just outside the fuselage. He dined on the rest of the fish, wrapped in seaweed. Seaweed was good for him, good source of vitamin C, invaluable after what was left of the craft’s supplies ran out, a long time ago. He hated the taste, though.  He looked at the beasts, silhouetted against the night sky and the endless shore:  Animalis Acutus, walking sideways with its long nose pointed at the wind,  Animalis Agrestis, the wild, moving faster than all of them combined,  Animalis Caecus, the blind, named irrationally one night, in a bout of despair,  Animalis Echinatus, the spiny one, the tallest,  Animalis Elegans, the most beautiful yet, its long white wings undulating in the wind with a slight, silky whoosh,  and Animalis Primus, now about eight years old, by a clumsy calculation. The oldest one still alive.  Eight years was not bad. Eight years of living here were long enough to live.  c=39,3. This is the third holy number.  Now listen, these beasts, they are simple Jansen mechanisms with a five-bar linkage at their core. Mechanical linkages are what brought about the Industrial Revolution, ja? I remember reading about them in my Archaic Mechanics studies.  See, these animals are all legs, made of those electrical tubes we use to hide wires in. Each leg consists of a pair of kite-like constructions that are linked via a hip and a simple crank. Each kite is made up of a pentagon and a triangle, the apex of which is the beast’s foot. The movement is created by the relative lengths of the struts. That’s why the holy numbers are so important. They are what allows the beasts to walk. To live.  Each beast needs at least three pairs of legs to stand by itself, each leg with its very own rotary motion. All the hips and cranks are connected via a central rod. That’s the beast’s spine.  And then, of course, there are the wings. The wind moves the wings, and the beasts walk on their own.  They have wings, but don’t fool yourself into thinking they can fly, ja?  Wings are not all it takes to fly.  In the morning, Theo was so weak he could barely use the desalination pump to get a drink of water and wash his face. He munched on seaweed, filling up on nutrients, trying to ignore the taste. After all these years, he had still not gotten used to that taste. Like eating rot right off of the ocean bed.  The beasts were herding by the nearest sand dune today, mostly immobilized by the low wind. The sun shone overhead, grinding down Theo’s bones, the vast stretches of sand and kelp around him. The beach. His beach.  He had walked as far from the sea as he could, the first months on Oceanus. All he had found was another shore on the other side of this swath of land. All there was here was this beach. All there was, this ocean.  He poured some saltwater on the new wounds on his knees. The pain radiated upwards, like a wave taking over his body.  The winds suddenly grew stronger. There was the distant roar of thunder.  Theo let himself be filled by the sound of the sand shifting under the force of the wind, by the sound of the rising waves, by this ocean that was everything. The ocean filled him up, and the whole world fell away, and then Theo fell away and dissolved, and life was dismantled, and only the numbers were left.  a=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 . . .  At night, like every night, Theo sent messages to the stars. Sometimes he used the broken transmitter from the craft; others, he talked to them directly, face to face.  “Stars,” he said, “are you lonely? Are you there, stars?”  d=40,1. This is the fourth holy number.  You know, at first I thought this was a young planet. I thought that there was so little here because life was only just beginning. I could still study it, make all this worthwhile. But then, after a while, it became clear. The scarcity of lifeforms. The powdery sand, the absence of seashells, the traces of radiation, the shortage of fish. The fish, the improbable fish. It’s obvious, isn’t it? We are closer to an end than we are to a beginning. This ecosystem has died. We, here; well. We are just the aftermath.  Stars, are you there?  Day again, and a walk behind the craft to where his companions were buried. Theo untangled the kelp that had been caught on the three steel rods marking their graves, rearranged his red scarf around Tessa’s rod. Not red any more—bleached and worn thin from the wind and the sun and the rain.  “It was all for nothing, you know,” he said. “There is nothing to learn here. This place could never be a home for us.”  He heard a beast approaching steadily, its cranks turning, its feet landing rhythmically on the sand. It was Animalis Primus. A few more steps and it would tread all over the graves. Theo felt blood rush to his head. He started waving his hands, trying to shoo the beast, even though he knew better. The beast did not know grave. All it knew was water and not-water.  “Go away!” he screamed. “What do you want, you stupid piece of trash?” He ran towards the beast and pushed it away, trying to make it move in the opposite direction. He kicked loose one of its knees. Immediately, the beast stopped moving.  Theo knelt by the beast and hid his face in his palms. “I’m sorry,” he whispered. “I’m so sorry.”  A slight breeze later, the beast started to limp away from the graves, towards the rest of its herd.  Theo climbed to his feet and took a last look at his companions’ graves.  “We died for nothing,” he said, and walked away.  At night, Theo made his fire away from the craft. He lay down, with his back resting on a bed of dry kelp, and took in the night, the darkness, the clear sky.  He imagined birds flying overhead.  Remember birds?  e=55,8. This is the fifth holy number.  A few years ago the sea spit out the carcass of a bird. I think it was a bird. I pulled it out of the water, all bones and feathers and loose skin. I looked at it and looked at it, but I couldn’t understand it. Where had it come from? Was it a sign of some sort? Perhaps I was supposed to read it in some way? I pulled it apart using my hands, looked for the fleshy crank that used to animate it. I found nothing. I left it there on the sand. The next morning it was gone.  Did you imagine it?  Perhaps I imagined it. Or maybe this planet is full of carcasses, they just haven’t found me yet.  How do you know it was a bird?  Have you ever seen birds?  Are you sure?  Theo’s emaciated body ached as he pulled himself up from the cold sand. He shouldn’t sleep outside, he knew that much.  How much of this sand is made of bone?  Had the winds come during the night, he could have been buried under a dune in a matter of minutes. Animalis Elegans was swinging its wings in the soft breeze, walking past him, when a brilliant flash of light bloomed in the sky. A comet. It happened, sometimes.  Are you there? he thought.  Are you lonely?  f=39,4. This is the sixth holy number.  Animalis (Latin): that which has breath. From anima (Latin): breath. Also spirit, soul.  Breath is the wind that moves you; what does it matter if it fills your lungs of flesh or bottles? I have lungs of flesh, I have a stomach. What is a soul made of?  Do you have a soul? Do I?  The breath gives me voice. The fish is mute, the comet breathless; I haven’t heard any voice but my own in so long.  Are you there? Are you lonely?  When I was a little boy I saw a comet in the sky and thought: Wings are not enough to fly, but if you catch a comet with a bug net, well . . . Well, that might just do the trick.  Breath gives life. To live: the way I keep my face on, my voice in, my soul from spilling out.  Night already. Look, there is a light in the black above. It is a comet; see its long tail? Like a rose blooming in the sky.  If we catch it, maybe we can fly.  Tomorrow I think I’ll walk into the sea, swim as far as I can.  And then what?  Then, nothing. I let go.  Instead of walking into the sea, in the morning Theo started building a new animal. He put up a tent just outside the fuselage, using some leftover tarpaulin and steel rods from the craft. He gathered all his materials inside: tubes, wire, bottles, cable ties, remains of beasts that had drowned in the past, or ones which had been created with some fundamental flaw that never allowed them to live in the first place. Theo worked quickly but carefully, pausing every now and then to steady his trembling hands, to blink the blurriness away. New sores appeared on his chest, but he ignored them.  This one would live. Perhaps it would even fly.  The rest of the beasts gathered outside the makeshift tent, as if to witness the birth of their kin.  g=36,7. This is the seventh holy number.  Come here, friend. Sit. Get some rest. I can see your knees trembling, your hip ready to give, your feet digging into the mud. Soon you will die, if you stay this way.  I see you have a spine, friend.  I, too, have a spine.  Theo was out fishing when the clouds started to gather and the sea turned black. Storms were not rare on Oceanus, but this one looked angrier than usual. He shouldered his fishing gear and started treading water towards the shore. He passed Animalis Elegans, its wings undulating faster and faster, and Animalis Caecus, which seemed to pause to look at him through its mechanical blindness, its nose pointed at the sky.  Theo made sure the half-finished beast was resting as securely as possible under the tarpaulin, and withdrew in the fuselage for what was to come.  h=65,7. This is the eighth holy number.  Once, a long long time ago, there was a prophet in old Earth who asked: when we have cut down all the trees and scraped the galaxy clean of stars, what will be left to shelter us from the terrible, empty skies?  Theo watched from his safe spot behind the fuselage’s porthole as the beasts hammered their tails to the ground to defend their skeletons against the rising winds. Soon, everything outside was a blur of sand and rain. The craft was being battered from all sides; by the time the storm subsided, it would be half-buried in sand and kelp. And there was nothing to do but watch as the wind dislodged the rod that marked Tessa’s grave and the red scarf was blown away, soon nowhere to be seen. It disappeared into the sea as if it had never existed at all, as if it had only been a memory of a childish story from long-ago and far-away. There was nothing to do as the wind uprooted the tarpaulin tent and blew the new animal to pieces; nothing to do as Animalis Elegans was torn from the ground and dragged to the water, its silken wings crushed under the waves.  Theo walked over to the trapdoor, cracked it open to let in some air. The night, heavy and humid, stuck to his skin.  i=49. This is the ninth holy number.  The night is heavy and humid like the dreams I used to have as a boy. In my dream, I see I’m walking into the sea, only it’s not the sea any more, it’s tall grass, taller than any grass I’ve ever seen in any ecosystem, taller than me, taller than the beasts. I swim in the grass, and it grows even taller; it reaches my head and keeps growing towards the sky, or maybe it’s me getting smaller and smaller until all I can see is grass above and around me. I fall back, and the grass catches me, and it’s the sky catching me like I always knew it would.  The storm lasted two Oceanus days and two Oceanus nights. When the clouds parted and the winds moved deeper into the ocean, Theo finally emerged from the fuselage. Half the beach had turned into a mire. Animalis Elegans was nowhere in sight. Animalis Primus limped in the distance. The beach was strewn with parts; only three of the beasts had survived the storm.  “No point in mourning, ja?” Theo muttered, and got to work.  He gathered as many of the materials as had landed in the area around the craft, dismantled the remains of the new animal that would never be named.  He had laid everything on the tarpaulin to dry, when a glimpse of white caught his eye. He turned towards the expanse of sea that blended into mire, and squinted. At first he thought it was foam, but no; it was one of Elegans’s wings, a precious piece of white silk poking out of a murky-looking patch in the ground.  He knew better than to go retrieve it, but he went anyway.  j=50. This is the tenth holy number.  Listen, listen. It’s okay. Don’t fret. Take it in. The desolation, take it all in. Decomposition is a vital part of any ecosystem. It releases nutrients that can be reused, returns to the atmosphere what was only borrowed before. Without it, dead matter would accumulate and the world would be fragmented and dead, a wasteland of drowned parts and things with no knees, no spine, no wings.  Theo had his hands on the precious fabric, knee-deep in the muck, when he realized he was sinking, inch by inch, every time he moved. He tried to pull himself back out, but the next moment the sand was up to his thighs. He tried to kick his way out, to drag himself up, but his knees buckled, his muscles burned and he sank deeper and deeper with every breath he took.  This is it, then, he thought. Here we are, friend. Here we are.  He let out a breath, and it was almost like letting go.  k=61,9. This is the last holy number.  So here we are, friend: I, Homo Necans, the Man who Dies; you, ever a corpse. Beautiful, exquisite corpse. I lay my hands on you, caress your inanimate flawlessness. I dip my palms into you, what you once were. And then, there it is, so close and tangible I can almost reach it.  Here I am.  In your soul up to my knees.  The sand around Theo was drying in the sun. It was up to his navel now. Wouldn’t be long. The wind hissed against the kelp and sand, lulling him. His eyes closed and he dozed off, still holding on to the wing.  He was woken by the rattling sound of Animalis Primus limping towards him.  The beast approached, its feet distributing its weight so as to barely touch the unsteady sand.  “I made you fine, didn’t I?” Theo mused. “Just fine.”  Primus came to a halt next to Theo, and waited.  He looked up at the beast, squinting at the sun behind it. “What are you doing, old friend?” he asked.  The beast stood, as if waiting for him to reach out, to hold on.  Theo pulled a hand out of the sand and reached for the beast’s first knees. He was afraid he might trip the animal over, take them both down, but as soon as he got a firm grasp on its skeleton, Primus started walking against the wind, pulling Theo out of the sand.  He let go once he was safely away from the marsh. He collapsed on the powdery sand, trying to catch his breath, reel it back in, keep it from running out. Animalis Primus did not stop.  “Wait,” Theo whispered as he pulled himself half-way up from the ground, thousands of minuscule grains sticking to his damp cheek. The beast marched onwards, unresponsive. “Wait!” Theo shouted, with all the breath he had left. He almost passed out.  The wind changed direction. Theo rested his head back on the sand, spent, and watched as Animalis Primus walked away—all clank and mechanics and the vestige of something like breath.  Natalia Theodoridou is a media & cultural studies scholar, the winner of the 2018 World Fantasy Award for Short Fiction, and a Clarion West graduate (class of 2018). Natalia's stories have appeared in Strange Horizons, Uncanny, Beneath Ceaseless Skies, F&SF, Fireside, and elsewhere. Rent-a-Vice, a cyberpunk interactive noir published by Choice of Games, was a 2018 Nebula Award Finalist. For details, follow @natalia_theodor on Twitter.", "text": "3780 words, short story\nThe Eleven Holy Numbers of the Mechanical Soul\na=38. This is the first holy number.\nStand still. Still. In the water. Barely breathing, spear in hand. One with the hand.\nA light brush against my right calf. The cold and glistening touch of human skin that is not human. Yet, it’s something. Now strike. Strike.\nTheo had been standing in the sea for hours—his bright green jacket tied high around his waist, the water up to his crotch. Daylight was running out. The fish was just under the point of his spear when he caught a glimpse of a beast walking towards him. Animalis Primus. The water was already lapping at its first knees.\nHe struck, skewering the middle of the fish through and through. It was large and cumbersome—enough for a couple of days. It fought as he pulled it out of the water. He looked at it, its smooth skin, its pink, human-like flesh. These fish were the closest thing to a human being he’d seen since he crashed on Oceanus.\nTheo’s vision blurred for a moment, and he almost lost his balance. The fish kept fighting, flapping against the spear.\nIt gasped for air.\nHe drove his knife through its head and started wading ashore.\nAnimalis Primus was taking slow, persistent steps into the water. Its stomach bottles were already starting to fill up, its feet were tangled in seaweed. Soon, it would drown.\nTheo put the fish in the net on his back and sheathed his spear to free both his hands. He would need all of his strength to get the beast back on the beach. Its hollow skeleton was light when dry, but wet, and with the sea swelling at dusk—it could take them both down.\nWhen he got close enough, Theo placed his hands against the hips of the advancing beast to stop its motion, then grabbed it firmly by its horizontal spine to start pushing it in the other direction. The beast moved, reluctantly at first, then faster as its second knees emerged from the water and met less resistance. Finally its feet gained traction against the sand, and soon Theo was lying on his back, panting, the fish on one side, the beast on the other, dripping on the beach and motionless. But he was losing the light. In a few moments, it would be night and he would have to find his way back in the dark.\nHe struggled to his feet and stood next to the beast.\n“What were you doing, mate?” he asked it. “You would have drowned if I hadn’t caught you, you know that?”\nHe knelt by the beast’s stomach and examined the bottles. They were meant to store pressurized air—now they were full of water. Theo shook his head. “We need to empty all these, dry them. It will take some time.” He looked for the tubing that was supposed to steer the animal in the opposite direction when it came in contact with water. It was nowhere to be found.\n“All right,” he said. “We’ll get you fixed soon. Now let’s go home for the night, ja?”\nHe threw the net and fish over his shoulder and started pushing Animalis Primus towards the fuselage.\nb=41,5. This is the second holy number.\nEvery night, remember to count all the things that do not belong here. So you don’t forget. Come on, I’ll help you.\nHumans don’t belong here. Remember how you couldn’t even eat the fish at first, because they reminded you too much of people, with their sleek skin, their soft, scaleless flesh? Not any more, though, ja? I told you, you would get over it. In time.\nAnimals don’t belong here, except the ones we make.\nInsects.\nBirds.\nTrees. Never knew I could miss trees so much.\nRemember how the fish gasped for air? Like I would. Like I am.\nIt will be light again in a few hours. Get some sleep, friend. Get some sleep.\nThe wind was strong in the morning. Theo emerged from the fuselage and tied his long gray hair with an elastic band. It was a good thing he’d tethered Animalis Primus to the craft the night before.\nHe rubbed his palms together over the dying fire. There was a new sore on the back of his right hand. He would have to clean it with some saltwater later. But there were more important things to do first.\nHe walked over to the compartment of the craft that he used as a storage room and pulled free some white tubing to replace the damaged beast’s water detector. He had to work fast. The days on Oceanus waited for no man.\nAbout six hours later, the bottles in Animalis Primus were empty and dry, a new binary step counter and water detector installed. All he had to do now was test it.\nTheo pushed the beast towards the water, its crab-like feet drawing helixes in the wet sand. He let the beast walk to the sea on its own. As soon as the detector touched the surf, Animalis Primus changed direction and walked away from the water.\nTheo clapped. “There you go, mate!” he shouted. “There you go!”\nThe beast continued to walk, all clank and mechanical grace. As it passed by Theo, it stopped, as if hesitating.\nThen, the wind blew, and the beast walked away.\nDusk again, and the winds grew stronger. Nine hours of day, nine hours of night. Life passed quickly on Oceanus.\nTheo was sitting by the fire just outside the fuselage. He dined on the rest of the fish, wrapped in seaweed. Seaweed was good for him, good source of vitamin C, invaluable after what was left of the craft’s supplies ran out, a long time ago. He hated the taste, though.\nHe looked at the beasts, silhouetted against the night sky and the endless shore:\nAnimalis Acutus, walking sideways with its long nose pointed at the wind,\nAnimalis Agrestis, the wild, moving faster than all of them combined,\nAnimalis Caecus, the blind, named irrationally one night, in a bout of despair,\nAnimalis Echinatus, the spiny one, the tallest,\nAnimalis Elegans, the most beautiful yet, its long white wings undulating in the wind with a slight, silky whoosh,\nand Animalis Primus, now about eight years old, by a clumsy calculation. The oldest one still alive.\nEight years was not bad. Eight years of living here were long enough to live.\nc=39,3. This is the third holy number.\nNow listen, these beasts, they are simple Jansen mechanisms with a five-bar linkage at their core. Mechanical linkages are what brought about the Industrial Revolution, ja? I remember reading about them in my Archaic Mechanics studies.\nSee, these animals are all legs, made of those electrical tubes we use to hide wires in. Each leg consists of a pair of kite-like constructions that are linked via a hip and a simple crank. Each kite is made up of a pentagon and a triangle, the apex of which is the beast’s foot. The movement is created by the relative lengths of the struts. That’s why the holy numbers are so important. They are what allows the beasts to walk. To live.\nEach beast needs at least three pairs of legs to stand by itself, each leg with its very own rotary motion. All the hips and cranks are connected via a central rod. That’s the beast’s spine.\nAnd then, of course, there are the wings. The wind moves the wings, and the beasts walk on their own.\nThey have wings, but don’t fool yourself into thinking they can fly, ja?\nWings are not all it takes to fly.\nIn the morning, Theo was so weak he could barely use the desalination pump to get a drink of water and wash his face. He munched on seaweed, filling up on nutrients, trying to ignore the taste. After all these years, he had still not gotten used to that taste. Like eating rot right off of the ocean bed.\nThe beasts were herding by the nearest sand dune today, mostly immobilized by the low wind. The sun shone overhead, grinding down Theo’s bones, the vast stretches of sand and kelp around him. The beach. His beach.\nHe had walked as far from the sea as he could, the first months on Oceanus. All he had found was another shore on the other side of this swath of land. All there was here was this beach. All there was, this ocean.\nHe poured some saltwater on the new wounds on his knees. The pain radiated upwards, like a wave taking over his body.\nThe winds suddenly grew stronger. There was the distant roar of thunder.\nTheo let himself be filled by the sound of the sand shifting under the force of the wind, by the sound of the rising waves, by this ocean that was everything. The ocean filled him up, and the whole world fell away, and then Theo fell away and dissolved, and life was dismantled, and only the numbers were left.\na=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 f=39,4 g=36,7 h=65,7 i=49 j=50 k=61,9 a=38 b=41,5 c=39,3 d=40,1 e=55,8 . . .\nAt night, like every night, Theo sent messages to the stars. Sometimes he used the broken transmitter from the craft; others, he talked to them directly, face to face.\n“Stars,” he said, “are you lonely? Are you there, stars?”\nd=40,1. This is the fourth holy number.\nYou know, at first I thought this was a young planet. I thought that there was so little here because life was only just beginning. I could still study it, make all this worthwhile. But then, after a while, it became clear. The scarcity of lifeforms. The powdery sand, the absence of seashells, the traces of radiation, the shortage of fish. The fish, the improbable fish. It’s obvious, isn’t it? We are closer to an end than we are to a beginning. This ecosystem has died. We, here; well. We are just the aftermath.\nStars, are you there?\nDay again, and a walk behind the craft to where his companions were buried. Theo untangled the kelp that had been caught on the three steel rods marking their graves, rearranged his red scarf around Tessa’s rod. Not red any more—bleached and worn thin from the wind and the sun and the rain.\n“It was all for nothing, you know,” he said. “There is nothing to learn here. This place could never be a home for us.”\nHe heard a beast approaching steadily, its cranks turning, its feet landing rhythmically on the sand. It was Animalis Primus. A few more steps and it would tread all over the graves. Theo felt blood rush to his head. He started waving his hands, trying to shoo the beast, even though he knew better. The beast did not know grave. All it knew was water and not-water.\n“Go away!” he screamed. “What do you want, you stupid piece of trash?” He ran towards the beast and pushed it away, trying to make it move in the opposite direction. He kicked loose one of its knees. Immediately, the beast stopped moving.\nTheo knelt by the beast and hid his face in his palms. “I’m sorry,” he whispered. “I’m so sorry.”\nA slight breeze later, the beast started to limp away from the graves, towards the rest of its herd.\nTheo climbed to his feet and took a last look at his companions’ graves.\n“We died for nothing,” he said, and walked away.\nAt night, Theo made his fire away from the craft. He lay down, with his back resting on a bed of dry kelp, and took in the night, the darkness, the clear sky.\nHe imagined birds flying overhead.\nRemember birds?\ne=55,8. This is the fifth holy number.\nA few years ago the sea spit out the carcass of a bird. I think it was a bird. I pulled it out of the water, all bones and feathers and loose skin. I looked at it and looked at it, but I couldn’t understand it. Where had it come from? Was it a sign of some sort? Perhaps I was supposed to read it in some way? I pulled it apart using my hands, looked for the fleshy crank that used to animate it. I found nothing. I left it there on the sand. The next morning it was gone.\nDid you imagine it?\nPerhaps I imagined it. Or maybe this planet is full of carcasses, they just haven’t found me yet.\nHow do you know it was a bird?\nHave you ever seen birds?\nAre you sure?\nTheo’s emaciated body ached as he pulled himself up from the cold sand. He shouldn’t sleep outside, he knew that much.\nHow much of this sand is made of bone?\nHad the winds come during the night, he could have been buried under a dune in a matter of minutes. Animalis Elegans was swinging its wings in the soft breeze, walking past him, when a brilliant flash of light bloomed in the sky. A comet. It happened, sometimes.\nAre you there? he thought.\nAre you lonely?\nf=39,4. This is the sixth holy number.\nAnimalis (Latin): that which has breath. From anima (Latin): breath. Also spirit, soul.\nBreath is the wind that moves you; what does it matter if it fills your lungs of flesh or bottles? I have lungs of flesh, I have a stomach. What is a soul made of?\nDo you have a soul? Do I?\nThe breath gives me voice. The fish is mute, the comet breathless; I haven’t heard any voice but my own in so long.\nAre you there? Are you lonely?\nWhen I was a little boy I saw a comet in the sky and thought: Wings are not enough to fly, but if you catch a comet with a bug net, well . . . Well, that might just do the trick.\nBreath gives life. To live: the way I keep my face on, my voice in, my soul from spilling out.\nNight already. Look, there is a light in the black above. It is a comet; see its long tail? Like a rose blooming in the sky.\nIf we catch it, maybe we can fly.\nTomorrow I think I’ll walk into the sea, swim as far as I can.\nAnd then what?\nThen, nothing. I let go.\nInstead of walking into the sea, in the morning Theo started building a new animal. He put up a tent just outside the fuselage, using some leftover tarpaulin and steel rods from the craft. He gathered all his materials inside: tubes, wire, bottles, cable ties, remains of beasts that had drowned in the past, or ones which had been created with some fundamental flaw that never allowed them to live in the first place. Theo worked quickly but carefully, pausing every now and then to steady his trembling hands, to blink the blurriness away. New sores appeared on his chest, but he ignored them.\nThis one would live. Perhaps it would even fly.\nThe rest of the beasts gathered outside the makeshift tent, as if to witness the birth of their kin.\ng=36,7. This is the seventh holy number.\nCome here, friend. Sit. Get some rest. I can see your knees trembling, your hip ready to give, your feet digging into the mud. Soon you will die, if you stay this way.\nI see you have a spine, friend.\nI, too, have a spine.\nTheo was out fishing when the clouds started to gather and the sea turned black. Storms were not rare on Oceanus, but this one looked angrier than usual. He shouldered his fishing gear and started treading water towards the shore. He passed Animalis Elegans, its wings undulating faster and faster, and Animalis Caecus, which seemed to pause to look at him through its mechanical blindness, its nose pointed at the sky.\nTheo made sure the half-finished beast was resting as securely as possible under the tarpaulin, and withdrew in the fuselage for what was to come.\nh=65,7. This is the eighth holy number.\nOnce, a long long time ago, there was a prophet in old Earth who asked: when we have cut down all the trees and scraped the galaxy clean of stars, what will be left to shelter us from the terrible, empty skies?\nTheo watched from his safe spot behind the fuselage’s porthole as the beasts hammered their tails to the ground to defend their skeletons against the rising winds. Soon, everything outside was a blur of sand and rain. The craft was being battered from all sides; by the time the storm subsided, it would be half-buried in sand and kelp. And there was nothing to do but watch as the wind dislodged the rod that marked Tessa’s grave and the red scarf was blown away, soon nowhere to be seen. It disappeared into the sea as if it had never existed at all, as if it had only been a memory of a childish story from long-ago and far-away. There was nothing to do as the wind uprooted the tarpaulin tent and blew the new animal to pieces; nothing to do as Animalis Elegans was torn from the ground and dragged to the water, its silken wings crushed under the waves.\nTheo walked over to the trapdoor, cracked it open to let in some air. The night, heavy and humid, stuck to his skin.\ni=49. This is the ninth holy number.\nThe night is heavy and humid like the dreams I used to have as a boy. In my dream, I see I’m walking into the sea, only it’s not the sea any more, it’s tall grass, taller than any grass I’ve ever seen in any ecosystem, taller than me, taller than the beasts. I swim in the grass, and it grows even taller; it reaches my head and keeps growing towards the sky, or maybe it’s me getting smaller and smaller until all I can see is grass above and around me. I fall back, and the grass catches me, and it’s the sky catching me like I always knew it would.\nThe storm lasted two Oceanus days and two Oceanus nights. When the clouds parted and the winds moved deeper into the ocean, Theo finally emerged from the fuselage. Half the beach had turned into a mire. Animalis Elegans was nowhere in sight. Animalis Primus limped in the distance. The beach was strewn with parts; only three of the beasts had survived the storm.\n“No point in mourning, ja?” Theo muttered, and got to work.\nHe gathered as many of the materials as had landed in the area around the craft, dismantled the remains of the new animal that would never be named.\nHe had laid everything on the tarpaulin to dry, when a glimpse of white caught his eye. He turned towards the expanse of sea that blended into mire, and squinted. At first he thought it was foam, but no; it was one of Elegans’s wings, a precious piece of white silk poking out of a murky-looking patch in the ground.\nHe knew better than to go retrieve it, but he went anyway.\nj=50. This is the tenth holy number.\nListen, listen. It’s okay. Don’t fret. Take it in. The desolation, take it all in. Decomposition is a vital part of any ecosystem. It releases nutrients that can be reused, returns to the atmosphere what was only borrowed before. Without it, dead matter would accumulate and the world would be fragmented and dead, a wasteland of drowned parts and things with no knees, no spine, no wings.\nTheo had his hands on the precious fabric, knee-deep in the muck, when he realized he was sinking, inch by inch, every time he moved. He tried to pull himself back out, but the next moment the sand was up to his thighs. He tried to kick his way out, to drag himself up, but his knees buckled, his muscles burned and he sank deeper and deeper with every breath he took.\nThis is it, then, he thought. Here we are, friend. Here we are.\nHe let out a breath, and it was almost like letting go.\nk=61,9. This is the last holy number.\nSo here we are, friend: I, Homo Necans, the Man who Dies; you, ever a corpse. Beautiful, exquisite corpse. I lay my hands on you, caress your inanimate flawlessness. I dip my palms into you, what you once were. And then, there it is, so close and tangible I can almost reach it.\nHere I am.\nIn your soul up to my knees.\nThe sand around Theo was drying in the sun. It was up to his navel now. Wouldn’t be long. The wind hissed against the kelp and sand, lulling him. His eyes closed and he dozed off, still holding on to the wing.\nHe was woken by the rattling sound of Animalis Primus limping towards him.\nThe beast approached, its feet distributing its weight so as to barely touch the unsteady sand.\n“I made you fine, didn’t I?” Theo mused. “Just fine.”\nPrimus came to a halt next to Theo, and waited.\nHe looked up at the beast, squinting at the sun behind it. “What are you doing, old friend?” he asked.\nThe beast stood, as if waiting for him to reach out, to hold on.\nTheo pulled a hand out of the sand and reached for the beast’s first knees. He was afraid he might trip the animal over, take them both down, but as soon as he got a firm grasp on its skeleton, Primus started walking against the wind, pulling Theo out of the sand.\nHe let go once he was safely away from the marsh. He collapsed on the powdery sand, trying to catch his breath, reel it back in, keep it from running out. Animalis Primus did not stop.\n“Wait,” Theo whispered as he pulled himself half-way up from the ground, thousands of minuscule grains sticking to his damp cheek. The beast marched onwards, unresponsive. “Wait!” Theo shouted, with all the breath he had left. He almost passed out.\nThe wind changed direction. Theo rested his head back on the sand, spent, and watched as Animalis Primus walked away—all clank and mechanics and the vestige of something like breath.\nNatalia Theodoridou is a media & cultural studies scholar, the winner of the 2018 World Fantasy Award for Short Fiction, and a Clarion West graduate (class of 2018). Natalia's stories have appeared in Strange Horizons, Uncanny, Beneath Ceaseless Skies, F&SF, Fireside, and elsewhere. Rent-a-Vice, a cyberpunk interactive noir published by Choice of Games, was a 2018 Nebula Award Finalist. For details, follow @natalia_theodor on Twitter.", "source": "https://clarkesworldmagazine.com/theodoridou_02_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Eleven Holy Numbers of the Mechanical Soul by Natalia Theodoridou"}