{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Benjanun Sriduangkaew", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "yPpHXgWskCy7cG5Y0gfz1dOtKkY=", "id": null, "license": null, "comments": "", "raw_text": "3720 words, short story  Annex  On the eve of Samutthewi’s entry into the Costeya Hegemony, Esithu was sloughing off the shell of their birth-body. There would be speculation afterward what Esithu was born as—someone’s son, someone’s daughter? To that Esithu would always say, “I was born as I am now,” which became a stretch after Esithu obtained a second then a third body. A hardware upgrade, they liked to say. You can never have too many.  That was much later.  Esithu was a creature of solitude but, afflicted with being so new in a world so old, they found themselves craving company.  This close to the heels of conquest, sedition was a rife, busy game, and it drew Esithu as war drew soldiers. They came to it—or it came to them—in a little club on the outskirts of Vithansuthi, the city in which everything happened.  On the walls, flowers fought and devoured each other, mouth-tipped stamens tessellating in choral fury. Onstage a dancer moved in simpatico, mercury limbs shimmering silver, a body of animated liquid.  “It is said,” Esithu’s table companion began, a non-sequitur to follow a conversation they never started, “that the universe was sung into being by a divine androgyne.”  At that point Esithu was not yet acquainted with quantum theories, though even further along in life they would find said theories little more than superstition. Blunt, they asked, “Are you some sort of evangelist?”  The woman’s eyes glittered. Her sclera and irises were hidden behind compound lenses, all ruby facets. “Truth is always in need of evangelizing. Now more than ever, and I’m not talking about creation myths.”  “This is a bad climate for demagogues.”  “Indeed no; it’s never been better.”  “We lost, you realize.” Their government bent so quickly to surrender there’d hardly been casualties. Esithu had bet on that, and reaped a tidy profit against friends more patriotic.  “Our defeat is opportune. It is now that we can subvert them from within.”  Esithu snorted. Newly assimilated border planets subverted nothing except their own sense of self. Samutthewi would lap and swallow until it was as Hegemonic as the rest.  “But now is the time,” the woman insisted. “Not five years from now when we’ve grown comfortable; not ten years from now when we think back and say, ah, it used to be untidy and now that we’ve the Hegemony breathing on our neck everything is better—faster—more beautiful. Then it will be nearly impossible.”  They laughed in her face. “It is impossible now.”  A second dancer vaulted over the first, feet and fingers full of fire.  Esithu’s alterations were more comprehensive than most. A recasting of face to obtain a youthful blankness that allowed for no surety—at a glance or several—male or female. A removal of signatures that gave them identity and history. Their body grew a map of scars, each puckered indentation marking where a regulation implant used to be. Their subsequent bodies, though made fresh, bore much the same.  Cellular editing was as yet unrefined. Hormonal inhibitors were installed, excess skin sheared away, and much that was flesh was replaced by that which was not. It made them strong and incandescent. Blood that flowed faster and a heart that shouted louder. Esithu felt their pulse in their fingertips and their mouth, a new potency that informed their dreams with lightning jolts.  Perhaps this delirious power—the need for an outlet—brought them back to the club, on a night where ambient audio was generated by replicants reenacting war. The ceiling was a sky the color of rust, the floor cracked earth the hue of vertebrae, and two-dimensional combatants screamed while equally flat fighters rained down fire. No such war had been fought on Samutthewi soil for generations uncounted. It was anachronistic; it plucked at the gut. The volume was muted but the tempo could be felt marrow-deep. Patrons kept on edge, nervous energy that could be channeled.  A clever if obvious trick, and Esithu respected tricks that worked. When the woman returned they didn’t tell her to preach elsewhere, and she introduced herself as Lykesca.  “Sounds Costeya,” Esithu said.  She touched her lenses. They were animated today, amber twitching against green, flaring into tendrils that took the place of her hair. Beneath the undulating colors her skull gleamed metallic red. “Suoqua.”  “An agent provocateur then.” Of a sovereignty that’d just seceded from—and proven itself a match for—the Hegemony.  “Not a bit. I’m Samutthewi stock much like you, and would give a proof of phenotype if that meant anything, which you of all people would know it doesn’t.”  It did not. Attaining a look more Costeya had become the rage; life could be made just a little easier that way. Gendered characteristics aside, Estihu had made a point of retaining most of their original features. “Take off the lenses and the rest. I’m curious.”  “What does it matter what I look like? We aren’t going to kiss. My aesthetic appeal is beside the point. Here’s my genetic overview though, if you’re in want of authenticity.”  Esithu deleted the data packet unread. National origins did not dictate allegiance. Samutthewi tribalism went only so far in an age where it served one seldom, betrayed one often. “So?”  “You’re a theorist.”  “Anthropology. Not a real science, if you ask most.”  “You’ve an interest in particular ideologies. Very real, very significant.”  To an academic there existed no flattery more effective than the bait of relevancy, an opportunity to feel faintly important and matter. “I’ll be taking up cybernetics.”  “That is a drastic switch.”  “Cybernetics concerns the intersection and interaction of flesh and ideas. It’s a natural outgrowth.”  “And,” Lykesca said, “a literalization of your politics.”  Esithu clapped a brief, private applause. “Who talks like that? You must be either student or graduate, and fresh from school.”  Muscles in Lykesca’s face rippled beneath all the rioting lights. Her eyebrows she had shaven clean off. “It pleases you to condescend, but I won’t be put off. I’ve got boundless resources and an important project on the cusp of completion.”  “What is in it for me?”  “Monetary compensation. Vindication for your most passionate beliefs. At the very least I think you’ll find my ideas . . . intriguing.”  “Such as?”  “Upending how the Hegemony thinks.” Lykesca gestured at her head. “I’m looking to play a very long game.”  Lykesca, Esithu supposed, was a little mad. But she was good about one thing: her funds were near-limitless. Her project had begun thirty-six years ago, anticipating a spark of greed in the Hegemonic eye long before anyone thought them a threat to Samutthewi.  Esithu reevaluated her age. It was not easy; Lykesca never set aside her accoutrements. Chrome filaments webbed her skull, enclosing her forearms and wrists in the fashion favored by Costeya generals. “Are you military?” Esithu asked her, to get it out of the way.  “If I was I would be risking life and career both—and my family as well. Seven generations forward and backward executed. The Costeya army is unconditionally literal about oaths of loyalty.”  “Unless you’ve anonymized your past.”  Lykesca smiled with narrow lips that had been cosmeticized to resemble charred wood. “Why, but that is impossible. Let’s stay realistic, Professor.”  “I didn’t have tenure.”  “Isn’t it fun to be called that? Prestige, erudition, a steady income.” Lykesca strode ahead without looking over her shoulder, at a pace with the rhythm and look of a soldier’s march.  The facility wended deep, of such scope that it couldn’t have gone undetected for so long—but it had, if Lykesca was to be believed. Layers of disruptive plating canceled out signals; a second set of disruptors blanked out tectonic and heat scans. Trailblazing stealth tech: classified and beyond doubt restricted to military use. No sensor confirmed Lykesca’s identity that Esithu could see, but they doubted the gates stood open and welcome to anyone who came calling.  Behind the blast wall, the temperature plunged. Mainframes, limned in soft light, breathed like sleeping children. Glass capsules overhead shone with firefly bots wheeling in abstract patterns. There was a rhythm to them, and—on intuition—Esithu replayed the cannibal flowers’ chorus. One of the capsules matched exactly.  “Subliminal behavior modification?”  “That makes it sound more sinister than it is. I’m using the tunes as a conductive medium, that’s all; the important part is making them go viral.”  “Is this marketing gone wrong?”  Lykesca chortled. “Oh, no, though some companies have tried similar methods. Memetic dreams. Culinary transmission. You heard about that?”  “My grandparents probably did.” Esithu revised their estimate a second time. Provided she was born into fortune Lykesca might have started anti-aging therapy as early as adolescence. Some parents, especially zealous, initiated it as soon as their offspring reached toddlerhood. “What kind of scale are you talking about? For your endeavor.”  “A long game,” she said. “My objective is to safeguard Samutthewi.”  “Yes, and?”  “I want to alter the way humanity collects past, present, and in consequence the future. They’re already halfway there—all they need is a little nudge. How do you receive information, Professor? How do you know what is happening beyond Vithansuthi or across the far edges of the Hegemony?”  “From the net.”  “Just so. That’s how people perceive and learn. Data subsumes material reality. Suppose you glance at news about Thotsakan’s eel exports. Suppose it says that’s been disrupted for the foreseeable future. There’ll be feeds of what’s happening down there . . . laborer strike, a sudden infection that halved the eel harvest, and so on. But.” Lykesca snapped her fingers. “What if you can’t? What if in fact there’s nothing wrong with the eels or the harvesters, but everyone on Thotsakan and beyond believes there is?”  Esithu touched the edge of one mainframe. Icy enough to numb. “Hypothetically there are a number of solutions. You’re after a specific one.”  “First the data is altered; each farm’s cortices will report false. Easy, yes? Then the data would’ve to be proofed against doubt and fact-checking.”  They followed her reasoning. “The average individual already relies on grid updates for traffic routes, current events, disaster warnings.”  “One day you think the eels are sick and dying; the next sync you think the workers are on strike and agitating for better work conditions. Whatever the data you’re fed is taken as fact. A connection implanted at infancy. At the beginning it’ll be for instilling early behavior, better than any AI nurse. By the time they talk the babies are literate. By the time they are ten, the grid will be their sole channel with which to interact with the world. You will, I hope, turn the key.”  “This is either a tall order or a thought experiment so preposterous it’s beneath contempt.”  “Whatever you believe, I’d like your input.” Lykesca flashed her teeth. “No pressure. It’s only a universal revolution.”  It might well be that or it might not—Esithu engaged with Lykesca’s proposal for the sheer, seductive absurdity of it. They sought out aquariums in which to listen to whale-song, zoos in which to observe the migration patterns of volcano-cranes as triggered by eruption signals. They became intimately familiar with how vibrations affected the deaf, how changes in light affected the blind. They studied sounds infused with colors and scents, and the induction of synesthesia.  Esithu’s initial subjects were, of necessity, fictive. Virtual constructs, virtual lives. They created tribes that worshiped sequences of birdcall, nations that bound themselves to musical theory and waged war over tonal disputes. They tried an evolutionary approach: how humanity might have structured its mores, languages and cultures if it was created by a god who gave commandments in biophony and prophecies in randomly generated verses.  Simulation had limits. Esithu sent for live subjects, and Lykesca provided.  Volunteers, Esithu was reassured; hard-up dregs, Esithu could see. Homeless mostly, addicts to the last, and desperate—but then, Esithu did not require them healthy and the experiments were not audited by an ethics committee. It was disturbingly liberating—and efficient—to have a patron as amoral and wealthy as Lykesca. Progress reports became Esithu’s calendar.  They wove in and out of clubs and dance floors, hearing more of Lykesca’s music. Some of it was released under composers up-and-coming, others under stars long established with reach across most demographics. Some avant-garde and others conventional.  “Suppose you succeed,” they said to Lykesca over an olfactory sculpture, “what do you expect to happen?” They always met in museums or galleries, Lykesca’s preference and pretension.  “For the first decade, not much will change.” She had set aside her accessories, and without them her face was plain, a chameleon. As though her complexion had been selected to blend in anywhere, the planes of her cheekbones and jawline likewise. Family to all and none. “The speed of normatization will depend on Hegemonic encouragement.”  “And then?”  “Then we erase Samutthewi from all memory. Rub it out of existence. The best defense you can give a nation too weak to fight back.”  A replicant connoisseur stepped around them to inhale the sculpture. Its eyes, never meant to look human, lit up. Blue fire race down its shoulders. There’d been more of these lately, replicants produced to consume, focus-groups in the wild to emulate and predict purchasing trends. Lykesca scowled after it. They must have, in ways minor or major, disrupted her.  “How much of the music is yours?”  She glanced at Esithu sidelong; laughed. “Did you think this was for vanity? I’m not an artist—never have been. Almost everything else, but not that.”  “What have you gotten involved in?”  “Manufacturing, pharmaceuticals, agriculture. I believe in having a well-rounded set of interests and expertise. Makes one so much more interesting to talk to, don’t you agree?” She rubbed at the fuzzy growth of hair that was slowly encroaching on the shaven smoothness of her pate. “I came to give you a deadline.”  Esithu pulled up data on the replicant consumers. A great many had rejected Lykesca’s artists, and their patterns would be sieved for product forecasts. “No pressure, I thought?”  “A concrete date can be reinvigorating. It’s not unreasonable. In eighteen months I expect—let’s say a working prototype, a plan that can be put to action.”  “That isn’t reasonable.”  “But,” Lykesca breathed, “you’re a genius.”  Their mouth twitched. “That I may be, but I can’t make something out of nothing. Eighteen months. What’s escalated?”  “What hasn’t? The world escalates by the minute, and tomorrow’s always more histrionic than yesterday.”  Lykesca’s underground compound was raided.  Esithu did not hear it from her. It was a middling headline, rating barely more noise and flourish than a perfectly average murder involving defenestration at a porn shoot. A hidden lab, it was reported, with a dozen dead mainframes. Lykesca’s ensuing silence made it difficult to tell whether she had been caught with her guard down, or whether she’d sacrificed the facility to protect something dearer. She did not contact Esithu to clarify or instruct.  The flow of funds cut off, abruptly.  Just as well: Esithu did not want to be convicted as her accomplice. They scaled the project back to virtualization and absconded to Vithansuthi’s old city where body-mod artists gathered and lived as far as they could off the grid. It was novel to go to sleep in such quiet, where the walls and floorboards did not pulse one awake with network noise. The derelict tenements stood on six legs each, roofed with scarab tiles, each narrow window the dull amber of carapaces.  Esithu shared a floor with Yinshi, a woman who made songs out of religious chants, the shrieking of extinct predator birds, and stringed instruments: the old-fashioned sort. She played a hammered dulcimer and a balalaika, recording and sampling scraps of melody. The final products were rough, not altogether pleasant, but compelling.  “Could I commission a piece?”  Yinshi looked up from her nest of cables and metal shells. “I don’t come cheap.”  “I can pay.” It would take all of Lykesca’s remaining largesse, secreted away for contingencies. It would be well spent.  “What do you have in mind?”  “Something,” Esithu said, “for forgetting. Call it ‘Annex’ if you call it anything.”  The rest of it was simply slotting algorithms into place. A matter of using sound to energize the effects of popular recreational drugs, and then unleashing it on an audience already well and dosed. Esithu made it small: a shift to alter perception of tempo.  They slipped into one of Yinshi’s performances. The crowd danced two beats slower than they should, not quite matching what was being played. The second time Esithu activated the script, Yinshi’s entire audience paused their network streams by mid-song and resumed them three-fourths of the way through.  When they met Lykesca again she had a head full of hair, and limbs bristling with thorns.  “I like what you’ve been doing.”  They talked over wilted vegetable and slivers of synthetic meat. In the old city few had a functioning palate and most subsisted on liquid nutrients or tablets. Easier to digest, less interruption to addictives or ongoing modification processes. Esithu had started eating real food again as soon as the physiotherapy permitted.  “I’m hoping,” Esithu said, “those are not prison marks.”  Lykesca lifted a barbed hand; Esithu switched to an augmens overlay. A playback of Yinshi’s music, spiked with Esithu’s memetic injection. “I’ve been freer than a pirate ship, but if I’m going to return to the scene of crime I might as well not be recognized on sight.”  They didn’t ask if she’d covered her tracks otherwise. It seemed an insult. “I’ve been thinking that your ideas are defeatist.”  “Coming from a cynic like you, that honestly upsets me.”  “You build them around the thought that not only can we not fight back now, we never will be able to. Not in two generations, not in twenty. Not ever.”  Lykesca shook a head of razorish brambles. “It’s true that plenty can happen over as short a time as decades. But I’ve made projections, Esithu, and my plans aren’t going to change.”  “Even if I said I could trigger mass hallucination? Mass suicide?”  It was gratifying to see Lykesca recoil. “A little extreme,” she said, “and it won’t solve anything. The Hegemony doesn’t run on people. It’s planets. It’s inertia. Revenge on individuals—this general, that lawmaker—is meaningless.”  Esithu chewed on tasteless faux-chicken. “If you’d said yes, I might have turned you in.”  “Very amusing. When will you have it ready? I’ll compile it against mass suicide models, by the way.”  “What good fortune it is our sense of humor is so compatible. It’s ready any time you want it.”  Lykesca stood. “You’ll know when the time comes.”  A public address on an override channel to all Hegemonic citizens: they were now at war with the Suoqua Sovereignty, and to harbor a Suoqua was treason. Save those who'd ripped out network receptors from their lobes, who’d blinded and deafened themselves—save those, none would fail to receive the broadcast.  Yinshi’s piece beat just out of hearing, infiltrating the interstices between a call to arms, a demand for sacrifices. Esithu would find out only belatedly how Lykesca broke through the security filters to embed the song and its memetic payload.  It went undetected for some time; Esithu’s injection left no trace, caused no immediate effect. They celebrated with turmeric-yellowed rice, tender poultry steeped in spices, and drinks that didn’t taste like lukewarm acid. Yinshi ate with them in bemusement. Neither disclosed to her, quite, what had happened.  “I'm going to prove you wrong,” Esithu said when the last yellow grain had been savored and swallowed.  A little inebriated and having flirted—disastrously—with Yinshi, Lykesca licked a dash of sauce off her thumb. “What about?”  “Costeya will give up Samutthewi.”  She vented a roar of laughter. Yinshi, dozing by the door, twitched awake. “I'd say I wish you luck, but you'll need more than that. Immortality perhaps, and even then the universe will probably succumb to heat death first.”  “I intend to return Samutthewi to autonomy before the universe forgets it, forgets us. A couple centuries, at least. Not that it’ll moot your plan, but I just want to make a point.”  Lykesca spluttered liquor and amusement, then collected herself. “Then I can only say that I hope for the best, and may your ancestors watch over you.”  Esithu immersed themselves in cybernetics. They chased a greater consciousness, and a frame for it that could withstand time. They experimented on Yinshi, who wanted ears that could hear beyond the human range and fingers which could bifurcate to better manipulate strings. An extra arm.  A year of that and Esithu began to work on themselves, opening up veins and digestive tracts, excavating fat and epidermis.  In Hegemonic capitals it became difficult to live without a synchronized memory, and few rejected total integration into the grid. So long as the phenomenon was under control it served Costeya interests. On their part, Esithu retained their own memory in an indelible partition.  Lykesca was caught, eventually.  Like the raid, it happened in ignominious quiet. A data-terrorist and smuggler, Lykesca was called. There was a glimpse of her face, haggard and burned; she went to her execution tagged with a convict’s code, cremated without name or kin.  Twenty years after Lykesca’s execution, Samutthewi became a native and loyal constituent of the Hegemony. It always had been, just as Costeya had always been at war with Suoqua.  Twenty years after Lykesca’s execution, Esithu revised Yinshi’s music to tell a story. By then modifying data had become the exclusive province of Hegemonic agencies. But the backdoors stayed, and Esithu kept Lykesca’s access protocols.  Esithu gave Yinshi a change of name and origins out of courtesy, to sever her ties to a particular piece of music. “Annex” returned to circulation and a heroine slipped into the fabric of Costeya history.  A woman who shed and donned faces as easily as she changed names, who through tricks and transplants cheated death for a hundred lifetimes. A woman who traveled from world to world, promising unity under one name, an empire of peace whose borders knew no limits.  In the morning, flower-mouths in Vithansuthi sang a composition to honor Saint Lykesca, mother of Costeya.  Across Hegemonic planets the song was repeated, reverbing in uncounted millions of temples and churches. It preceded dawn prayers: Saint Lykesca ruled over worship of any thought or idol.  As she always would; as she always had. Benjanun Sriduangkaew writes love letters to strange cities, beautiful bugs, and the future. Her work has appeared in Tor.com, Beneath Ceaseless Skies, Phantasm Japan, The Dark, and year's bests. She has been shortlisted for the Campbell Award for Best New Writer and her debut novella Scale-Bright has been nominated for the British SF Association Award.", "text": "3720 words, short story\nAnnex\nOn the eve of Samutthewi’s entry into the Costeya Hegemony, Esithu was sloughing off the shell of their birth-body. There would be speculation afterward what Esithu was born as—someone’s son, someone’s daughter? To that Esithu would always say, “I was born as I am now,” which became a stretch after Esithu obtained a second then a third body. A hardware upgrade, they liked to say. You can never have too many.\nThat was much later.\nEsithu was a creature of solitude but, afflicted with being so new in a world so old, they found themselves craving company.\nThis close to the heels of conquest, sedition was a rife, busy game, and it drew Esithu as war drew soldiers. They came to it—or it came to them—in a little club on the outskirts of Vithansuthi, the city in which everything happened.\nOn the walls, flowers fought and devoured each other, mouth-tipped stamens tessellating in choral fury. Onstage a dancer moved in simpatico, mercury limbs shimmering silver, a body of animated liquid.\n“It is said,” Esithu’s table companion began, a non-sequitur to follow a conversation they never started, “that the universe was sung into being by a divine androgyne.”\nAt that point Esithu was not yet acquainted with quantum theories, though even further along in life they would find said theories little more than superstition. Blunt, they asked, “Are you some sort of evangelist?”\nThe woman’s eyes glittered. Her sclera and irises were hidden behind compound lenses, all ruby facets. “Truth is always in need of evangelizing. Now more than ever, and I’m not talking about creation myths.”\n“This is a bad climate for demagogues.”\n“Indeed no; it’s never been better.”\n“We lost, you realize.” Their government bent so quickly to surrender there’d hardly been casualties. Esithu had bet on that, and reaped a tidy profit against friends more patriotic.\n“Our defeat is opportune. It is now that we can subvert them from within.”\nEsithu snorted. Newly assimilated border planets subverted nothing except their own sense of self. Samutthewi would lap and swallow until it was as Hegemonic as the rest.\n“But now is the time,” the woman insisted. “Not five years from now when we’ve grown comfortable; not ten years from now when we think back and say, ah, it used to be untidy and now that we’ve the Hegemony breathing on our neck everything is better—faster—more beautiful. Then it will be nearly impossible.”\nThey laughed in her face. “It is impossible now.”\nA second dancer vaulted over the first, feet and fingers full of fire.\nEsithu’s alterations were more comprehensive than most. A recasting of face to obtain a youthful blankness that allowed for no surety—at a glance or several—male or female. A removal of signatures that gave them identity and history. Their body grew a map of scars, each puckered indentation marking where a regulation implant used to be. Their subsequent bodies, though made fresh, bore much the same.\nCellular editing was as yet unrefined. Hormonal inhibitors were installed, excess skin sheared away, and much that was flesh was replaced by that which was not. It made them strong and incandescent. Blood that flowed faster and a heart that shouted louder. Esithu felt their pulse in their fingertips and their mouth, a new potency that informed their dreams with lightning jolts.\nPerhaps this delirious power—the need for an outlet—brought them back to the club, on a night where ambient audio was generated by replicants reenacting war. The ceiling was a sky the color of rust, the floor cracked earth the hue of vertebrae, and two-dimensional combatants screamed while equally flat fighters rained down fire. No such war had been fought on Samutthewi soil for generations uncounted. It was anachronistic; it plucked at the gut. The volume was muted but the tempo could be felt marrow-deep. Patrons kept on edge, nervous energy that could be channeled.\nA clever if obvious trick, and Esithu respected tricks that worked. When the woman returned they didn’t tell her to preach elsewhere, and she introduced herself as Lykesca.\n“Sounds Costeya,” Esithu said.\nShe touched her lenses. They were animated today, amber twitching against green, flaring into tendrils that took the place of her hair. Beneath the undulating colors her skull gleamed metallic red. “Suoqua.”\n“An agent provocateur then.” Of a sovereignty that’d just seceded from—and proven itself a match for—the Hegemony.\n“Not a bit. I’m Samutthewi stock much like you, and would give a proof of phenotype if that meant anything, which you of all people would know it doesn’t.”\nIt did not. Attaining a look more Costeya had become the rage; life could be made just a little easier that way. Gendered characteristics aside, Estihu had made a point of retaining most of their original features. “Take off the lenses and the rest. I’m curious.”\n“What does it matter what I look like? We aren’t going to kiss. My aesthetic appeal is beside the point. Here’s my genetic overview though, if you’re in want of authenticity.”\nEsithu deleted the data packet unread. National origins did not dictate allegiance. Samutthewi tribalism went only so far in an age where it served one seldom, betrayed one often. “So?”\n“You’re a theorist.”\n“Anthropology. Not a real science, if you ask most.”\n“You’ve an interest in particular ideologies. Very real, very significant.”\nTo an academic there existed no flattery more effective than the bait of relevancy, an opportunity to feel faintly important and matter. “I’ll be taking up cybernetics.”\n“That is a drastic switch.”\n“Cybernetics concerns the intersection and interaction of flesh and ideas. It’s a natural outgrowth.”\n“And,” Lykesca said, “a literalization of your politics.”\nEsithu clapped a brief, private applause. “Who talks like that? You must be either student or graduate, and fresh from school.”\nMuscles in Lykesca’s face rippled beneath all the rioting lights. Her eyebrows she had shaven clean off. “It pleases you to condescend, but I won’t be put off. I’ve got boundless resources and an important project on the cusp of completion.”\n“What is in it for me?”\n“Monetary compensation. Vindication for your most passionate beliefs. At the very least I think you’ll find my ideas . . . intriguing.”\n“Such as?”\n“Upending how the Hegemony thinks.” Lykesca gestured at her head. “I’m looking to play a very long game.”\nLykesca, Esithu supposed, was a little mad. But she was good about one thing: her funds were near-limitless. Her project had begun thirty-six years ago, anticipating a spark of greed in the Hegemonic eye long before anyone thought them a threat to Samutthewi.\nEsithu reevaluated her age. It was not easy; Lykesca never set aside her accoutrements. Chrome filaments webbed her skull, enclosing her forearms and wrists in the fashion favored by Costeya generals. “Are you military?” Esithu asked her, to get it out of the way.\n“If I was I would be risking life and career both—and my family as well. Seven generations forward and backward executed. The Costeya army is unconditionally literal about oaths of loyalty.”\n“Unless you’ve anonymized your past.”\nLykesca smiled with narrow lips that had been cosmeticized to resemble charred wood. “Why, but that is impossible. Let’s stay realistic, Professor.”\n“I didn’t have tenure.”\n“Isn’t it fun to be called that? Prestige, erudition, a steady income.” Lykesca strode ahead without looking over her shoulder, at a pace with the rhythm and look of a soldier’s march.\nThe facility wended deep, of such scope that it couldn’t have gone undetected for so long—but it had, if Lykesca was to be believed. Layers of disruptive plating canceled out signals; a second set of disruptors blanked out tectonic and heat scans. Trailblazing stealth tech: classified and beyond doubt restricted to military use. No sensor confirmed Lykesca’s identity that Esithu could see, but they doubted the gates stood open and welcome to anyone who came calling.\nBehind the blast wall, the temperature plunged. Mainframes, limned in soft light, breathed like sleeping children. Glass capsules overhead shone with firefly bots wheeling in abstract patterns. There was a rhythm to them, and—on intuition—Esithu replayed the cannibal flowers’ chorus. One of the capsules matched exactly.\n“Subliminal behavior modification?”\n“That makes it sound more sinister than it is. I’m using the tunes as a conductive medium, that’s all; the important part is making them go viral.”\n“Is this marketing gone wrong?”\nLykesca chortled. “Oh, no, though some companies have tried similar methods. Memetic dreams. Culinary transmission. You heard about that?”\n“My grandparents probably did.” Esithu revised their estimate a second time. Provided she was born into fortune Lykesca might have started anti-aging therapy as early as adolescence. Some parents, especially zealous, initiated it as soon as their offspring reached toddlerhood. “What kind of scale are you talking about? For your endeavor.”\n“A long game,” she said. “My objective is to safeguard Samutthewi.”\n“Yes, and?”\n“I want to alter the way humanity collects past, present, and in consequence the future. They’re already halfway there—all they need is a little nudge. How do you receive information, Professor? How do you know what is happening beyond Vithansuthi or across the far edges of the Hegemony?”\n“From the net.”\n“Just so. That’s how people perceive and learn. Data subsumes material reality. Suppose you glance at news about Thotsakan’s eel exports. Suppose it says that’s been disrupted for the foreseeable future. There’ll be feeds of what’s happening down there . . . laborer strike, a sudden infection that halved the eel harvest, and so on. But.” Lykesca snapped her fingers. “What if you can’t? What if in fact there’s nothing wrong with the eels or the harvesters, but everyone on Thotsakan and beyond believes there is?”\nEsithu touched the edge of one mainframe. Icy enough to numb. “Hypothetically there are a number of solutions. You’re after a specific one.”\n“First the data is altered; each farm’s cortices will report false. Easy, yes? Then the data would’ve to be proofed against doubt and fact-checking.”\nThey followed her reasoning. “The average individual already relies on grid updates for traffic routes, current events, disaster warnings.”\n“One day you think the eels are sick and dying; the next sync you think the workers are on strike and agitating for better work conditions. Whatever the data you’re fed is taken as fact. A connection implanted at infancy. At the beginning it’ll be for instilling early behavior, better than any AI nurse. By the time they talk the babies are literate. By the time they are ten, the grid will be their sole channel with which to interact with the world. You will, I hope, turn the key.”\n“This is either a tall order or a thought experiment so preposterous it’s beneath contempt.”\n“Whatever you believe, I’d like your input.” Lykesca flashed her teeth. “No pressure. It’s only a universal revolution.”\nIt might well be that or it might not—Esithu engaged with Lykesca’s proposal for the sheer, seductive absurdity of it. They sought out aquariums in which to listen to whale-song, zoos in which to observe the migration patterns of volcano-cranes as triggered by eruption signals. They became intimately familiar with how vibrations affected the deaf, how changes in light affected the blind. They studied sounds infused with colors and scents, and the induction of synesthesia.\nEsithu’s initial subjects were, of necessity, fictive. Virtual constructs, virtual lives. They created tribes that worshiped sequences of birdcall, nations that bound themselves to musical theory and waged war over tonal disputes. They tried an evolutionary approach: how humanity might have structured its mores, languages and cultures if it was created by a god who gave commandments in biophony and prophecies in randomly generated verses.\nSimulation had limits. Esithu sent for live subjects, and Lykesca provided.\nVolunteers, Esithu was reassured; hard-up dregs, Esithu could see. Homeless mostly, addicts to the last, and desperate—but then, Esithu did not require them healthy and the experiments were not audited by an ethics committee. It was disturbingly liberating—and efficient—to have a patron as amoral and wealthy as Lykesca. Progress reports became Esithu’s calendar.\nThey wove in and out of clubs and dance floors, hearing more of Lykesca’s music. Some of it was released under composers up-and-coming, others under stars long established with reach across most demographics. Some avant-garde and others conventional.\n“Suppose you succeed,” they said to Lykesca over an olfactory sculpture, “what do you expect to happen?” They always met in museums or galleries, Lykesca’s preference and pretension.\n“For the first decade, not much will change.” She had set aside her accessories, and without them her face was plain, a chameleon. As though her complexion had been selected to blend in anywhere, the planes of her cheekbones and jawline likewise. Family to all and none. “The speed of normatization will depend on Hegemonic encouragement.”\n“And then?”\n“Then we erase Samutthewi from all memory. Rub it out of existence. The best defense you can give a nation too weak to fight back.”\nA replicant connoisseur stepped around them to inhale the sculpture. Its eyes, never meant to look human, lit up. Blue fire race down its shoulders. There’d been more of these lately, replicants produced to consume, focus-groups in the wild to emulate and predict purchasing trends. Lykesca scowled after it. They must have, in ways minor or major, disrupted her.\n“How much of the music is yours?”\nShe glanced at Esithu sidelong; laughed. “Did you think this was for vanity? I’m not an artist—never have been. Almost everything else, but not that.”\n“What have you gotten involved in?”\n“Manufacturing, pharmaceuticals, agriculture. I believe in having a well-rounded set of interests and expertise. Makes one so much more interesting to talk to, don’t you agree?” She rubbed at the fuzzy growth of hair that was slowly encroaching on the shaven smoothness of her pate. “I came to give you a deadline.”\nEsithu pulled up data on the replicant consumers. A great many had rejected Lykesca’s artists, and their patterns would be sieved for product forecasts. “No pressure, I thought?”\n“A concrete date can be reinvigorating. It’s not unreasonable. In eighteen months I expect—let’s say a working prototype, a plan that can be put to action.”\n“That isn’t reasonable.”\n“But,” Lykesca breathed, “you’re a genius.”\nTheir mouth twitched. “That I may be, but I can’t make something out of nothing. Eighteen months. What’s escalated?”\n“What hasn’t? The world escalates by the minute, and tomorrow’s always more histrionic than yesterday.”\nLykesca’s underground compound was raided.\nEsithu did not hear it from her. It was a middling headline, rating barely more noise and flourish than a perfectly average murder involving defenestration at a porn shoot. A hidden lab, it was reported, with a dozen dead mainframes. Lykesca’s ensuing silence made it difficult to tell whether she had been caught with her guard down, or whether she’d sacrificed the facility to protect something dearer. She did not contact Esithu to clarify or instruct.\nThe flow of funds cut off, abruptly.\nJust as well: Esithu did not want to be convicted as her accomplice. They scaled the project back to virtualization and absconded to Vithansuthi’s old city where body-mod artists gathered and lived as far as they could off the grid. It was novel to go to sleep in such quiet, where the walls and floorboards did not pulse one awake with network noise. The derelict tenements stood on six legs each, roofed with scarab tiles, each narrow window the dull amber of carapaces.\nEsithu shared a floor with Yinshi, a woman who made songs out of religious chants, the shrieking of extinct predator birds, and stringed instruments: the old-fashioned sort. She played a hammered dulcimer and a balalaika, recording and sampling scraps of melody. The final products were rough, not altogether pleasant, but compelling.\n“Could I commission a piece?”\nYinshi looked up from her nest of cables and metal shells. “I don’t come cheap.”\n“I can pay.” It would take all of Lykesca’s remaining largesse, secreted away for contingencies. It would be well spent.\n“What do you have in mind?”\n“Something,” Esithu said, “for forgetting. Call it ‘Annex’ if you call it anything.”\nThe rest of it was simply slotting algorithms into place. A matter of using sound to energize the effects of popular recreational drugs, and then unleashing it on an audience already well and dosed. Esithu made it small: a shift to alter perception of tempo.\nThey slipped into one of Yinshi’s performances. The crowd danced two beats slower than they should, not quite matching what was being played. The second time Esithu activated the script, Yinshi’s entire audience paused their network streams by mid-song and resumed them three-fourths of the way through.\nWhen they met Lykesca again she had a head full of hair, and limbs bristling with thorns.\n“I like what you’ve been doing.”\nThey talked over wilted vegetable and slivers of synthetic meat. In the old city few had a functioning palate and most subsisted on liquid nutrients or tablets. Easier to digest, less interruption to addictives or ongoing modification processes. Esithu had started eating real food again as soon as the physiotherapy permitted.\n“I’m hoping,” Esithu said, “those are not prison marks.”\nLykesca lifted a barbed hand; Esithu switched to an augmens overlay. A playback of Yinshi’s music, spiked with Esithu’s memetic injection. “I’ve been freer than a pirate ship, but if I’m going to return to the scene of crime I might as well not be recognized on sight.”\nThey didn’t ask if she’d covered her tracks otherwise. It seemed an insult. “I’ve been thinking that your ideas are defeatist.”\n“Coming from a cynic like you, that honestly upsets me.”\n“You build them around the thought that not only can we not fight back now, we never will be able to. Not in two generations, not in twenty. Not ever.”\nLykesca shook a head of razorish brambles. “It’s true that plenty can happen over as short a time as decades. But I’ve made projections, Esithu, and my plans aren’t going to change.”\n“Even if I said I could trigger mass hallucination? Mass suicide?”\nIt was gratifying to see Lykesca recoil. “A little extreme,” she said, “and it won’t solve anything. The Hegemony doesn’t run on people. It’s planets. It’s inertia. Revenge on individuals—this general, that lawmaker—is meaningless.”\nEsithu chewed on tasteless faux-chicken. “If you’d said yes, I might have turned you in.”\n“Very amusing. When will you have it ready? I’ll compile it against mass suicide models, by the way.”\n“What good fortune it is our sense of humor is so compatible. It’s ready any time you want it.”\nLykesca stood. “You’ll know when the time comes.”\nA public address on an override channel to all Hegemonic citizens: they were now at war with the Suoqua Sovereignty, and to harbor a Suoqua was treason. Save those who'd ripped out network receptors from their lobes, who’d blinded and deafened themselves—save those, none would fail to receive the broadcast.\nYinshi’s piece beat just out of hearing, infiltrating the interstices between a call to arms, a demand for sacrifices. Esithu would find out only belatedly how Lykesca broke through the security filters to embed the song and its memetic payload.\nIt went undetected for some time; Esithu’s injection left no trace, caused no immediate effect. They celebrated with turmeric-yellowed rice, tender poultry steeped in spices, and drinks that didn’t taste like lukewarm acid. Yinshi ate with them in bemusement. Neither disclosed to her, quite, what had happened.\n“I'm going to prove you wrong,” Esithu said when the last yellow grain had been savored and swallowed.\nA little inebriated and having flirted—disastrously—with Yinshi, Lykesca licked a dash of sauce off her thumb. “What about?”\n“Costeya will give up Samutthewi.”\nShe vented a roar of laughter. Yinshi, dozing by the door, twitched awake. “I'd say I wish you luck, but you'll need more than that. Immortality perhaps, and even then the universe will probably succumb to heat death first.”\n“I intend to return Samutthewi to autonomy before the universe forgets it, forgets us. A couple centuries, at least. Not that it’ll moot your plan, but I just want to make a point.”\nLykesca spluttered liquor and amusement, then collected herself. “Then I can only say that I hope for the best, and may your ancestors watch over you.”\nEsithu immersed themselves in cybernetics. They chased a greater consciousness, and a frame for it that could withstand time. They experimented on Yinshi, who wanted ears that could hear beyond the human range and fingers which could bifurcate to better manipulate strings. An extra arm.\nA year of that and Esithu began to work on themselves, opening up veins and digestive tracts, excavating fat and epidermis.\nIn Hegemonic capitals it became difficult to live without a synchronized memory, and few rejected total integration into the grid. So long as the phenomenon was under control it served Costeya interests. On their part, Esithu retained their own memory in an indelible partition.\nLykesca was caught, eventually.\nLike the raid, it happened in ignominious quiet. A data-terrorist and smuggler, Lykesca was called. There was a glimpse of her face, haggard and burned; she went to her execution tagged with a convict’s code, cremated without name or kin.\nTwenty years after Lykesca’s execution, Samutthewi became a native and loyal constituent of the Hegemony. It always had been, just as Costeya had always been at war with Suoqua.\nTwenty years after Lykesca’s execution, Esithu revised Yinshi’s music to tell a story. By then modifying data had become the exclusive province of Hegemonic agencies. But the backdoors stayed, and Esithu kept Lykesca’s access protocols.\nEsithu gave Yinshi a change of name and origins out of courtesy, to sever her ties to a particular piece of music. “Annex” returned to circulation and a heroine slipped into the fabric of Costeya history.\nA woman who shed and donned faces as easily as she changed names, who through tricks and transplants cheated death for a hundred lifetimes. A woman who traveled from world to world, promising unity under one name, an empire of peace whose borders knew no limits.\nIn the morning, flower-mouths in Vithansuthi sang a composition to honor Saint Lykesca, mother of Costeya.\nAcross Hegemonic planets the song was repeated, reverbing in uncounted millions of temples and churches. It preceded dawn prayers: Saint Lykesca ruled over worship of any thought or idol.\nAs she always would; as she always had.\nBenjanun Sriduangkaew writes love letters to strange cities, beautiful bugs, and the future. Her work has appeared in Tor.com, Beneath Ceaseless Skies, Phantasm Japan, The Dark, and year's bests. She has been shortlisted for the Campbell Award for Best New Writer and her debut novella Scale-Bright has been nominated for the British SF Association Award.", "source": "https://clarkesworldmagazine.com/sriduangkaew_04_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Annex by Benjanun Sriduangkaew"}