{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ray Nayler", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "aqMcfCLehml76mxD1XFTYMWqbCM=", "id": null, "license": null, "comments": "", "raw_text": "7680 words, novelette  Sarcophagus  2022 Finalist: Theodore A. Sturgeon Memorial Award  The causes of the disaster are these:  First: The estimations of this planet’s temperature were incorrect. The beacon should never have been placed. This planet is no more capable of supporting human life than our own polar wastelands.  Second: My companions are all dead. I do not know what happened for sure: Encoding errors in their uploads, possibly, or a malfunction that occurred during transmission, or a receiving fault here in the beacon. Whatever the cause, the result is the same: They never woke up. The beacon post-op will say more, but a preliminary diagnostic showed entire sections of their uploads missing, scrambled, or out of sequence. The material of their blanks was recycled back into the matter arranger.  Third: Many of the depots are lost, damaged, or unreachable. I found the first one thirteen kilometers from its original placement, three hundred meters down a crevasse. My scans indicated it was upside down, encased in ice. It had been trapped there for hundreds of years, already. It had become a part of the frozen mass of the glacier. There was no question of rappelling alone down into the crevasse and trying to free it: it was lost.  The next depot is thirty kilometers from here over the glacial surface. At an average daytime temperature of negative forty degrees Celsius, and an average nighttime temperature twenty degrees below that, I do not think I will survive the journey. But I have no choice except to attempt it.  This series of logs, this record of failure, should be accessed by my backup previous to its escape-transmission to the relay station and Earth. Do not put me in a new blank here. Do not kill me here again.  As a sidenote: When I next wake up, after the death of this stranded blank, I hope it is in a warm place, where a steaming bowl of noodles can be found nearby, and a cup of good coffee. Six centuries after my departure from Earth, I hope there are still such things as noodles and coffee.  A friend at the Institute once said, “If you think things are bad now, just wait: they will get worse.”  Gallows humor, of course. Things often get better. Seasons change, weather improves, time blunts the devastations of loss.  But not on this planet.  There is no liquid water on the surface here. But on the glacier, I can hear the flow of meltwater, down in the blue depths of the crevasses. And the glaciers are moving, shifting, the way our own glaciers move on Earth. What could be causing it?  What I saw yesterday might provide an answer.  I was resting on a nunatak, a mountain peak drowned in ice, when the glacier began to sing. The ice moaned in a bass that shuddered through the marrow of my bones. Half a kilometer away, a white plume appeared, surging up from the surface. Narrow at first, it thickened into a column. I could feel the shifting of the glacier’s mass around me, even through the stone. The column rose. A hundred meters. Two hundred. Three hundred. The lemon sky filled with a million stars of silver, winding down slow as snow. The suit analyzed them as they rained down on me. Water vapor, freezing and falling to the surface.  The glaciers’ motion is not from the melting of their ice from above: it is from below. Imagine an ice cube on a hot stove, sliding across its own substance as it dissolves. The glaciers are moving across thermal vents kilometers beneath the surface. The vents hollow out chimneys, galleries, unstable caves in the glacial interior. Once they breach the final crust of ice, a plume is the result—a geyser tunneled through ice instead of stone.  The plume rose into the sky for an hour. Then there was a rumble beneath the surface, a vibration fierce as any earthquake. The plume was cut off. The column began to dissipate—a chromatic cloud, a swarm of snow-stars. Though nothing changed on the glacier’s surface, I knew that underneath, the fan of passageways that had formed this temporary chimney had collapsed. An entire system of ice caverns—chambers the size of cathedrals, passages bored through blue-black strata of ice that may never have seen a sun, had ceased to exist. But the process would begin again. The heat from below would now carve new patterns through the glacial mass as the venting steam sought escape.  How many vents, out there? The nunatak now seemed not like a mountain peak, but a lifeboat. When I left it, I would swim out into a sea of holes. At any moment, a vent could open beneath me. Or the whole surface of the ice tear apart like paper. There would be no warning that would not come too late. And no companion roped to me to pull me back from the chasm.  The vent-cloud was a chromium trace in yellow air. Thirty kilometers to the nearest depot. If it was reachable. Across a surface rotten with crevasses. I was already dead.  That was the moment when I found life.  I was on one knee, watching that wisp of false stars die in the air. When I looked down, I saw them.  The wind must have blown them there, collected them over who knows how many rotations of this frozen world around its sun. They had drifted into the lee of a stone, where the windblown snow was carved into a bowl. Tiny, brittle, like the dry husks of dead autumn leaves in the spring.  I would have been happy to find just a leaf. But these were not leaves—they were the chitinous exoskeletons of tiny animals. I scanned and photographed them, trying to keep my hands steady. Then I reached into that brittle pile, gathering a glove full. Coils and spirals, the cups of empty joints along the insectile carapaces, a litter of separated limbs like the smallest twigs. I could hold two dozen of them in my palm, no two alike. Little grains of existence.  Was I the first to discover life beyond Earth? Perhaps. I couldn’t know: the other explorers were strewn across space-time, scattered across a score of beacon planets. Perhaps they, too, at this moment or fifty years ago or a hundred years from now, were holding life in their hands, or had held it, or would hold it.  Life. Or its trace, at least. The proof of it.  And no one to share that moment with.  I stood up.  And now for the bad news. I had been loitering on that glacial island, which perhaps one day will be marked as the first place in the universe humankind encountered evidence of life off our world, for a reason: my suit.  The causes of the disaster are these . . .  The suit was built to be the most efficient collector of energy possible. It was powered by a passive system of batteries recharged by light, motion, wind across its surface, friction—anything that could transfer energy into it. When charged, it would keep me warm, collect water from the atmosphere and store it for me, collect organic compounds and process them into some minimal supply of sustenance beyond what I could carry. All of those wonderful things. Its technology was centuries old, but still the best we had.  But its batteries weren’t charging fast enough. They were not able to stand up against the constant chill of this planet. They were failing faster than they could be charged.  I had begun to notice the cold more and more over the past few days, seeping into the suit. So, I had stopped on that oasis of stone to lay in the sun. Splayed out on the rock to get maximum exposure, I was also making rock angels, rubbing the surface of the suit against the stone to further power the batteries.  If there had been anyone to see me, it would have been quite a sight: Earth’s first explorer, lying on its back waggling its limbs on a rock. One more dying thing, about to leave its exoskeleton behind as a trace of its existence.  Fifty-one percent battery. It was forty-five percent when I started this a few hours ago. Okay, that was progress. And maybe I felt a little warmer. Maybe.  But yesterday the suit had started out at eighty-four percent, and by nightfall, even though I had been walking all day, and almost always in the sun, it had been eighty percent. In the morning it had been fifty-seven percent.  Thirty kilometers to the depot. If it was there. Or twenty kilometers back to the beacon, where there were other spare suits—spare because my companions were dead. And I would be dead soon enough. The other suits would have the same battery problem.  To the depot, then. In the depot there would be heat packs, ample food supplies, electrolytes, tools, and a shelter set: Unpowered, body-heat retaining sleep sacks, external wear. Low-tech lifesavers. Enough to keep me going for a while.  I stepped off my island.  I am being hunted. I am putting this record down in fragments, where I can. Important to get it on the record—but I also have to keep moving. One foot in front of the other is all that is left to me.  As I stepped off that little island of stone, I felt the glacier shift again. Another spout appeared, a kilometer away. It was larger than the first: a volcano of steam, thundering up into the atmosphere. Vibrations passed through my boots: the treachery of the glacier, rearranging itself under my feet. It was hard not to think of mystical things: Trolls, ice giants waking from their sleep. The glacier alive, malevolent, irritated by my presence on its skin.  For the first few kilometers or so, though, it was good going. The surface, covered with just a slight layer of snow, was relatively even, the sastrugi no more than calf-high, the ice beneath solid. At one point I was almost running. The pace helped keep me warm.  It wasn’t until midday that I hit the maze.  There must have been a massive steam collapse, years ago, under this part of the glacier. Or perhaps the pressure from its motion was pushing up against an obstacle, some ice-drowned reef of stone. The surface of the glacier had deformed and cracked, breaking up into blocks and slabs. Many of the slabs were ten or more meters high. Canted towers of ice, sapphire in their cores, stretching as far as I could see with the binoculars. A city of ice. No way around.  That was when I saw it. It was just for a moment. A second, perhaps? Two?  Enough time to send a lacework trident of terror through me, up every vein and artery to the base of my brain, where the old, old fears live. Tooth and claw in the dark. Death by drowning.  It must have been five kilometers away. It was visible so briefly; I could almost convince myself I had hallucinated it. How to describe it? The surface of it was pale. Smooth, fish belly pearl. It must have been three meters tall, at least—and nearly that wide. What Earth metaphor could encompass it? It was nothing like a bear, an ape, a wolf. If it had a face, I did not see it—but then, its outline, that awful plasticine, oily white against the white behind it, did not allow me to read its shape well.  Did it even have a head? It had four limbs and was standing on two of them. Or crouched over two of them. But were they feet? Legs? Its vague body undulated with malevolent power, writhing beneath its sickening skin.  And in the moment I fixed the binoculars on it, I knew it had seen me. It turned the upper part of itself in my direction. It seemed to fold deeper into itself, the way an animal will tense, growing smaller like a spring tightening, shrinking into its own core. It shuddered. Squirmed in its sallow sheath of skin.  Then it was gone, sliding down into the maze that I, too, would have to enter.  Perhaps, I thought, as I clambered down into the maze, it had not seen me after all. Five kilometers is a long way. I had been looking through a high-powered machine to make it out. Perhaps it had just looked in my direction and not seen me.  But the ancient brain and body, sharpened on the savannah, knew better. I knew it in my flesh, with primal certainty: I had been seen.  The maze was like a city of broken ice cathedrals, of shattered crystal spires fallen into roads that twisted back upon themselves and tangled in cul-de-sacs. The ice, refracting light countless times from one crystal to another, trapped everything red in the spectrum in another maze—the deeper maze of microscopic structure. Only blue escaped.  But so many blues! Sapphires dusted by fresh-fallen snow, cerulean tiger stripes etched against white, ancient inks of slabs forced up from the deep-time abyss of the glacial mass. Wind darted into the frozen city of ice every few moments. The spires sang and hissed. Wonder was mixed in me with fear—a strange alchemy.  Such a beautiful world—if only I had the time to explore it, rather than just dying on it.  The suit compass pointed my way to the depot, but I had to turn away from it again and again. Five kilometers in the maze would be ten, fifteen. I glance at the suit battery. Forty-eight percent. Forty-seven percent. And I would be in the shade, much of the time.  And it was in there with me.  “Nothing to be done,” I said out loud. “Concentrate on what you can control.”  One foot in front of the other. That’s what I could control. That’s all I could control, now.  I skirted a section where the ice had fallen away, a crevasse deeper than I could see, on an ice and snow bridge no wider than my boots. From an unimaginable depth came the thunder of water.  It was dark when I emerged from the maze. I unfolded the shovel from my pack and dug a hole. I could not travel at night across this landscape of crevasses. Monster or no monster, I would have to sleep.  Under the snow, it was warmer. I wriggled into my cocoon, pulled the pack in after me like a beetle blocking the entrance to its tunnel with a tiny stone. As if that would help.  Thirty-six percent. How long did I have? And did that number even matter, with that thing out there?  Fear or no fear, I was tired enough to sleep. And too tired to dream.  The three of us assigned to this planet knew it would be cold where we were going. The data indicated a planet not much warmer, at its best, than an Icelandic summer. A planet with long, brutal winters even near the equator. So, we passed around books about polar exploration. It was somewhere between serious research and an inside joke.  We traded stories over amber glasses of tea. The darkest moments from the books stood out most: Cherry-Gerrard’s teeth shattering from the cold of the Antarctic winter. Shackleton abandoning the icebound Endurance in desperation, forced to lead his crew over pack ice. Robert Falcon Scott penning his final missive to the public as he lay dying in his sleeping bag, just kilometers from a depot of food that could have saved him.  Why put these things in our heads? Maybe we thought only the ancients suffered, with their heavy equipment freezing to their skin, their unwieldy sleds dragging them down. Or maybe reading them was a sort of talisman: we dispelled their power by absorption.  A decent surface again, in the morning. Snow thicker, here—but dry, at least. Post-holing up to my knees the first half of the day, not looking at the battery percentage.  Twenty-four percent in the morning. Not a happy number to share breakfast with. But despite everything, I broke camp in a decent mood. I had slept well, then treated myself to a double-ration and one of the self-heating ersatz “coffee” packs—a caffeinated, chocolate-flavored sandiness an evil Institute developer had come up with. How about coffee, instead? Actual coffee? Why was that hard? This grainy sludge had waited for centuries to foul my taste buds. They had uploaded my entire human connectome, the neural map of my being, beamed its pattern in a laser three hundred lightyears across the void, and inserted it into another body, and they couldn’t manage a decent cup of coffee.  After several hours of trekking across that surface, I spotted another nunatak: a black dot on the horizon. I would aim for that. A resting spot. A place to spend a few hours in the sun, starfish myself out, recharge.  Then the dot was eclipsed. A whiteness passed across its surface for a second, clipping it from existence. I raised the binoculars.  There. Moving across the ice at twice the speed I could manage, at least. That old, perfect fear came again. The primitive brain’s alarm system. Run. Hide. Now.  Run where? Hide where?  It was on two feet now, but I still could not make out a head.  And again, it saw me. It turned its whole torso toward me, pausing for a second. Almost as if saying, “Yes—get a good look.”  But I couldn’t get a good look. Its outline was blurred, as if my brain refused to resolve it, could not quite make its shape stay firm against the snow behind it. White on white. An . . . undulation beneath the surface. Like a distortion, almost. Like the digital enhancement of the binoculars malfunctioning.  Then it moved on. Turned away and began to walk. As if pretending it had not seen me at all.  Drawing me on?  Was it even the same thing I had seen the day before? If so, it had not closed distance with me, though I was sure it could, if it chose to.  “Nothing to be done,” I said out loud. I’d never talked to myself on Earth, but I seemed determined to develop the habit before I froze to death, or was torn to pieces, and they bounced my brain back home.  Thirty-two percent. Motion had built a bit of a charge. So move.  The wind had blasted the landscape here into embankments and switchbacks of corrugated ice. Most, at least, were no higher than my waist. But between them the snow was a mass of hard, small snow crystals. Walking through it was like walking through sand. I could keep my direction, but it was a winding way, and slow going. Mostly I navigated by the black dot of the rock outcropping where I had told myself I would be able to rest. Beneath my feet I could feel a slight vibration. I imagined water thundering down under-ice cataracts, steam building up pressure, the glacier sliding across stone.  “And where,” I asked the glacier, “are you going?”  Thirty percent when I reached the island of stone, a waist-high rampart of protruding rock with a comet tail of moraine trailing it. Despite my motion, the battery was dropping in charge again. The top of the nunatak was a gray-black shelf, as flat as if it had been sheared off. In a hand-width channel grooved by ice and weather was another drift of exoskeletal traces. I ate my lunch and sorted through them. The largest was like a snake, almost—jointed, barbed in one direction to give it traction against the snow, sharp-prowed to allow it, probably, to dig down into softer surfaces. No longer than the pinky of my gloved hand, but the largest I had found. There were many smaller things, no two of them the same. Nothing, it seemed, that flew. Many creatures designed to tumble and drift.  Then, in the side of the groove, something opened and snapped shut again. I bent down. Against the dark surface of the stone it was just slightly darker, tucked into a hole. A kind of borer. It had closed a jointed lid over itself. I was still for a minute, and it opened again. Velvet inside, a dark red. The first red I had seen on this world. Flanged and grooved, like a filter-feeder on Earth. It extruded itself from its hole, expanding outward like a cactus blossom, dark as blood.  “Well, hello there.”  It clopped shut again.  I lay on my back and began rubbing myself on the stone, careful to move a few meters off so as not to disturb my new friend.  Fourteen kilometers to the depot. After an hour of friction and sun, the suit’s battery indicator climbed to thirty-six percent. Move? Or stay here, see how much of a charge I could build in the suit? I scanned the horizon with the binoculars again. In the direction of travel the ice undulated away in hummocks, blurred by ice fog.  Bad going. That decided it. Spend the rest of the day here, soak up the sun, dig in for the night at the foot of the stone rampart, where there was enough drifted snow to cave into.  The suit got up to fifty percent by evening, but not moving enough made the cold leach into me: a hint of worse to come. I dug in deep, slid down into my tunnel, pulled the pack over my head just like the little clam-thing clapping its lid tight.  Please don’t let it get me, I thought. Like a prayer a child makes, afraid of the shadow pooling out from underneath the bed. Please. Not that way.  But was there a good way, here?  Bad going tomorrow. Sleep. Good night, little clam.  The fall happened too fast for me to even attempt to stop it. I was between two hummocks of ice when the surface underneath my feet gave way. There had been no sign the glacier was rotten here. One moment, I was making midday progress through the strange, mounded landscape. The next, I was three meters beneath the surface, flat on my back, trying to catch my breath. The wind had been knocked out of me. When it came again, it was with a sob of pain.  I lay still, trying to take stock. Flexed one limb, then another. Nothing, it seemed, broken—but my right arm had been jammed, hard. I had trouble closing it in a good grip, and a numb streak of pain coursed down from shoulder to wrist.  I rolled onto my side and curled up fetal. I could still see dancing white points in my vision, flakes of bright blankness.  It took me five minutes to get to my knees. Take stock. The tips of my fingers were numb, then the feeling returned with a wash of pins and needles. My neck hurt as well, from whipping back and thudding against the ice, my neck muscles tensing up against the weight of the helmet.  I was on a shelf of ice, a three-meter step below the rotten surface that had given way. Beyond the shelf’s edge, there was an upward drift of ice fog: the cold exhalation, perhaps, of an ice geyser that had hollowed out this trap. How far down did it go? I crawled on my belly and looked. Far: an indigo throat, winding down until the light failed. I scooted backward away from it, managed to get to my feet, staying close to the sheer wall of ice. Okay: I would be sore, but I was okay. I looked up. A steep climb with my jammed right arm, but I could make it.  Then I saw it, over the edge.  The vagueness of it up close made me nauseous. This feeling cut even through the fear: The way its outline, the pallid greasy sheen of it would not resolve. This close, it should have been distinct, but it was not.  It made a sound at me. A sound that was like metal being crushed, digitized through a cracked speaker. And it was that nausea, I think, and a sharp shock that went through me when it made that sound, that made me throw the ice axe at it. An instinct. The tethered ice axe clacked off the surface of the cliff just below the thing, then came back down and almost struck my helmet, causing me to duck out of the way.  When I looked back up, it was gone.  Another fantastic choice before me: climb back up to the surface where that thing was waiting, or die here on this shelf of ice?  I listened a moment, not knowing what I was listening for, and then began to climb.  Twenty-three percent.  It was not there when I reached the top. But its tracks were: round depressions, without apparent toe or heel, as if an enormous spoon had been pressed into the surface of the snow. They led off in my direction of travel.  So now I was following it. Well, better than the other way round, I supposed.  The snow here was hard-packed, the saucerlike impressions of the thing’s limbs leaving almost no mark, then trailing off entirely as the surface hardened to ice. I checked the direction and distance of the depot beacon. It was in line with the glacier’s slow travel, ten kilometers away.  The sound that let me know the suit’s battery had dropped below twenty percent was the wash of a temple gong. It was designed, I supposed, so as not to startle or panic the suit’s wearer.  It sounded to me like the beginning of my own funeral.  “Where are you going?” I said it out loud. Who was I talking to? To the glacier, perhaps. To the thing that was circling me. To myself.  “Where are you going?”  It was the question I had asked myself, on my last night on Earth, in my room at the Institute’s connectome sequencing laboratory. The laboratory overlooked snow-covered fields, a railway yard where autolocomotives, the size of toys at this distance, shunted train cars into line. A few trees stood out in the desolation, a frail tangle of branches against the cold sky.  All of this was so tenuous—how could it last another hundred years, much less six hundred? There was so much risk ahead of me: technical failures that could scramble my upload, faults anywhere along that fragile beam of communication firing my neural connectome’s pattern into the void. There were nagging existential questions: Would that pattern really be me, awaking after three hundred years as if from a sleep, sheathed in my new blank? Or would I die the moment my body died here, and the person who awoke on that new world be someone else entirely—my simulacrum, but not my own self?  But none of that seemed as threatening as the idea, as I looked out at that desolate railway yard, silent behind the reinforced glass, laid out on white ground fragile and translucent as bone china, that none of this would be waiting for me when I returned. That the laser carrying my pattern would terminate at a dead receiver, on a planet that had rid itself of us.  The three hundred years it had taken me to travel here had been nothing. A closing of the eyes. A dream of color in darkness, no longer than a night’s sleep.  And in that span, everyone and everything I knew had been blown into the void. Lost to me. For nothing, if I died here.  Even if, somehow, the receivers of Earth still stood, it would no longer be my world.  As I neared the place where the glacier died, I could hear it calving. I could feel it: the sundering of ice, reverberating through its frozen mass, shuddering up my legs into my suit, as the face of the glacier fell away.  It was growing dark, now. The suit’s ten percent warning gong had sounded an hour ago. Calling the monks home to the temple. Calling them home. Five percent now—a proper alarm, a harsh blatt into the eardrums. Wake up! Appropriate, anyway, that I would die where the glacier died. Perhaps there would be a sea after all. The glacier must have some place to go.  Another rumble as the glacier split. And now I could see it, up ahead: could see a crack form, and then, with a massive boom, the face of the glacier falling away.  Cold was seeping into the suit as I scrambled up the moraine. Here was a hummock of boulder, ground to a knife-edge by the glacier’s slow teeth. The sun was fading, the sky shifting from yellow to emerald green. Several kilometers away, a steam column rose into the sky, lit saffron by sunset. The depot signal was beyond the calving face of the glacier. No way down that face. I had to get off of the ice. The only way was around, over the moraine edge, then down onto whatever surface . . .  As I came over the hill, I saw it.  Not a sea—a hole. A massive sinkhole, bigger than anything I knew of on Earth. A darkness into which, as I watched, a tower of ice from the face of the glacier toppled. From that dark mouth, a sound of shattering. And echoes, like the beating of a drum. The roar of water, deep beneath the hollow surface.  Around the hole a desolate beach had formed—a graveyard of gravel and boulders shoved for eons by the glacier’s mass. The stones were greasy black with moraine dust, strewn with shattered chunks of ancient ice that shone blue-black and sea-green in the dying light.  And there it was—the depot.  It was canted against a snag of stones, its impenetrable carboplast shell blacker than the rock around it, the meter-high pyramid topped by a slab of ice that had fallen against it, ice so dense and dark it looked like stone until I saw the bubbles inside—the time capsules of air trapped thousands of years before.  I almost did not hear the screech of the suit’s one percent alarm over the sound of my own teeth chattering. I pressed a glove to the panel, and the access port dilated open with only the slightest scrape to indicate how ancient it had become while waiting for my arrival.  Salvation.  I do not think, if I had the strength to move, that I would have made camp that night near that massive hole. Here, the sound of the ice was continuous, groaning and splitting. Every hour or so, ice rent away with a sound like the end of everything, tumbling into the breach. Three glaciers met here, crawling from different directions to die into this black aperture.  And there was the cairn.  I saw it just as I was closing the depot’s access panel. My prizes—solid rations, the shelter, the warmer—were stacked near the depot.  The cairn was hard to make out. I could have mistaken it for a natural formation. But at second glance it was clear: it was a made thing, its stones carefully selected and stacked into a waist-high mound.  The suit was cold, and getting colder, the battery dead. Now it was nothing more than clothing. A thick coat. Not enough to keep me alive for long. I needed to get the shelter up. I needed to get a warm ration in me, sleep on a formfoam mattress for the first time since I had left the beacon. Rest.  I needed to know what might be in that cairn.  Moving the stones helped keep me warm. And the adrenaline of discovery.  The corpse had been buried lying on its side, with its limbs curled up against its chest, like humans were often found in ancient burial sites. The body was not human, but it was so much like us: bipedal, with a symmetrical body plan, four-limbed. The head and face were—how does one describe such a thing? They were the product of a different path that had led to a similar evolutionary clearing. On another planet, there were beings who had walked in forests and savannahs so much like ours that you could have said, “that treelike thing is enough like a tree that I can use that word. That mushroom-like thing is enough like a mushroom that I will call it a mushroom. And this is close enough to grass, and that is analogous to a flower . . . ”  But none of them would be those things. Naming them the same thing doesn’t make them the same. And so it was with this being. This was not a human, though it was analogous to us. I could call the hands “hands” and the feet “feet,” but they were not the hands and feet we would recognize.  The body was clothed in the thinnest of coverings—a dark, semi-reflective sheath. No shoes, no gloves. It would not have been clothing to survive in: whatever they had worn against the cold of this place, that was gone.  I could see the wounds that had killed them: A chunk of metal, lodged in their chest. One of their arms severed, carefully placed here atop their body. There were other wounds. Impact damage. The emergency medical training I had taken on Earth allowed me to read the signs: A crash. And this being was so clearly not of this place. So clearly as incapable of surviving here as I was, that the truth of it hit me right away: this, too, was a traveler.  But from how long ago? And who laid them here to rest?  I was already cold, but I replaced the stones of the frozen cairn as carefully as I could before I began, with fingers that were already numb, to put up my shelter.  There was that sickly, blurred whiteness out there, stalking this place. Out there, in the night. There were towers of ice around me that seemed ready, at any moment, to crush my little tent into nothingness. But in my self-heating shelter, in the lantern-glow of a ration warmer, I raised my suit’s face mask for the first time since arriving on the planet and ate a solid ration. That seemed worth the threat of death itself.  When the wind hit, I was in the middle of a dream in which I had been sealed in ice. The blackest ice, but filled with bubbles that drifted through its solid core toward my mouth and nose, nourishing me. And in those bubbles were the scents of childhood, and home: The smell of snails in the ivy of the vacant lot next door, of a hot field of grass at the end of a summer’s day. The scent of brown sugar melting in tea. I could not smell them, in the dream, but as the bubbles gathered at my nostrils, and I breathed in that air, sealed for millennia, my mind was filled with the images the smells called up: The crumbling wall of green and the fragile-shelled bodies that had traced their cursive of filtrate on the leaves. The grass in a hot wind of sunset. And beyond, the black line of the trees, the café looking out over the sea.  The wind turned the tent upside down, picked it at least a meter up off the stones, and smashed it back down again. The suit’s padded helmet saved me from the worst of the impact, but as I struggled to free myself from the sleeping bag, the tent was turned over again. This time, my temple struck stone, and I lost consciousness.  I woke to find myself being dragged. My mask was still open. The tent? Where was the tent? My head was turned to the side, and I could see, through a screen of sleet, blocks of ice tumbling across the black stone. And there, at my feet, the blurred thing. It had one of my legs clamped in its upper limbs and was dragging me up onto the angle of moraine that marked the edge of the glacier. The cold, on my face, was terrible. I had thought, as the suit began to fail, that I understood what cold was. I did not. Already, my cheeks and nose were frostbitten. My eyes ached with cold. The ice crystals that lashed my face were wind-borne caltrops. I reached up and activated the face screen. It slid shut. Cracked. It was cracked. A thin haze of ice crystal powdered into it, falling on my open eye.  I clutched at a stone and hurled it at the thing clamped to my leg. The stone went wide, but the thing turned to me. Now, for the first time, I saw what should have been its face—and screamed.  There was nothing there at all. It was a blank white, slightly iridescent like a spill of fuel on water, blurred as if my eyes could not focus on it. Blurred like something held up too close to my face. Again, the thing made that metallic sound—a sound of things breaking, of things torn apart—barely audible over the terrible wind. Then it turned and picked me up, as if I weighed nothing at all, and began to climb up the loose stone of the moraine.  The cave was fifty meters or so up the slope. I had missed it on my descent because its entrance was obscured by a slab of ice—ice, I now saw, that had been moved there. I realized, as the thing hauled me into the cave, that I had been making a very strange sound myself—a high, whimpering noise as I struggled against being carried, pounding against its hard, smooth skin.  It lowered me down to the ground. And I would have bolted, if I were not so exhausted that dying seemed not to matter anymore. Instead, I just lay still. The thing lumbered off a few meters and sat down.  Every ache from my fall the day before was back, and twice as bad as it had been. My jammed joints screamed. I had been bleeding from the temple where my head struck the ground in the tent, but it appeared to have stopped. I could feel the blood drying in my hair on the side of my face. My head ached terribly, and all of the muscles in my neck.  The suit bleeped as it came online. Two percent battery charge. It must have found energy to absorb. Yes, in the tent. It had been warm. And—here! The temperature read plus five, in the cave. Plus five! A sauna, compared to the outside! There must be a thermal heat source. And yes, I noticed, the stone here was slightly wet, the humidity at eighty percent—warmed, likely, by the same heat source that was melting the glaciers from beneath.  It was agony, sitting up. My neck muscles would not support the weight of my head. I rolled onto my side, then pushed myself up on my left arm.  The thing shifted its bulk where it sat. Here, in the half-light of the cave, I looked closer at it.  And then I understood. It wasn’t a creature. It was an environmental suit I was looking at. It had no face because it was a face shield, closed. Its blurred outline was probably some kind of field effect. And inside, of course, would be the companion of the being who was carefully buried inside the cairn.  I raised my cracked face shield. The air in the cave, moist as the exhalation of my breath, was welcome on my face.  “For days, I thought you were going to kill me.”  The head of the thing turned. So massive: it must be an exoskeleton as well, almost a vehicle in itself. I bet it’s warm in there, I thought. Must be nice, not having to scramble around in some Institute-designed, malfunctioning piece of shit.  The being made that grinding sound again. I wondered if I sounded as offensive to it—and if my appearance caused the same sense of dread. I remembered the feeling that had come over me when I first saw it. It was still there, that feeling: Tooth and claw. Primeval fear. It had settled, slid down underneath my awareness now. But I could feel it there, ready to surface. The pollution of it almost seemed to emanate from the suit like a fog. Fear.  Now it seemed so obvious. How had I missed it? There was a slight seam, and a difference of shading, where the faceplate met the helmet. The faceplate was smoother than the rest of the surface.  “You can’t raise your faceplate? Can’t breathe this air?” I gestured at my own faceplate. “Maybe there’s an Institute on your world too, screwing everything up and sending your people to die on uninhabited planets you’ll never be able to colonize.”  Another burst of scraping sound. My suit blared out a one percent alarm. If it was failing to charge, even in this relative warmth, I was dead. It must have been damaged in the storm.  The suit went offline, zeroed out.  “I’m sorry about your friend,” I said. My voice was shaking. I really am going to die, I thought. I probably sounded like a flock of parrots squawking to the being in the suit. But I needed to talk. I had been alone so long.  But the body in the cairn . . . It was impossible to say how long it had been there, but it was desiccated by cold. It looked mummified. It must have been . . . God, how long must it have been?  “How long have you been here? Alone?” I held up a single finger. “How long have you been one?”  The pantomime the being made was clear, a massive arm arcing to the cave’s stone floor and slapping down onto it: since the crash.  “Me too,” I said, pointing at myself. “None of my friends made it. And I wish I could be better company to you—but I’m not going to make it either.” I pulled at the surface of my suit, made a gesture like breaking a twig. “It isn’t working. Even here, in this cave, I’m getting cold.” I rubbed my shoulders in a sign I hoped was universal. “And it won’t be able to make the food I need. It’s just a matter of time. I reached the depot—this one. At great cost and effort. But I won’t get much further. Thank you, though, for saving me from the storm. It’s good to at least be warmer. And I can keep you company for a while, right?”  Outside, the storm raged, tearing ice from the surface of the world, thrashing it against stone.  The suit lurched toward me. I scrambled backward. The faceplate stopped less than a meter from me. The massive limbs rose, made the same breaking gesture I had made. Then the being thumped a hand on my suit, made the gesture again.  I slapped my suit, made the same motion. “Yes. Broken.”  For a moment, they withdrew. Then they placed the mitt-like end of a limb against the side of my face. The limb was cold—as cold as the ambient air here. A gesture of fellow-feeling? Of sorrow? Or measurement by a contact instrument, tasting my chemical composition?  We stayed like that for at least a minute. Then more. I closed my eyes and thought of the world from the perspective of this being. Finding our depot, that black pyramid of carboplast. They must had known, seeing that artifact, that there had been another presence here. But nothing about the depot could have told them we had not left but had, rather, not yet come. That this was no sarcophagus, but a promise of our arrival.  Was I the first alien this species had discovered? Was this their first contact? For days, this being had circled me. They had been alone so long, and now wondered: Was I alike enough to them to communicate with? Was I someone it was possible to speak to? Or was I something deadly? Did I create the same feeling in them, of fear, that they created in me? The primitive stab of adrenaline, or whatever chemical powered their fight-or-flight responses?  The mitt withdrew. Then they backed up a body-length or so from me, and lay down on the ground.  And fell apart. The faceplate opened, and the whole front of the suit unraveled along a seam at its centerline, falling away to the sides. The helmet, too, split in half and dropped to the side.  Empty.  There was nothing in the suit at all, except a red inner surface, dark as oxblood, studded with receptors in its mesh. There was no being here. No lost, alien astronaut.  Finally, I truly understood. Stripping my own broken, useless suit from my body, I understood. Climbing inside, feeling the inner surface mold itself to my body—clumsily at first, tentative—and then more assured, more confident in the fit. That surface finding my surface, that warm inner membrane molding itself to my outer one. One skin finding another, shifting together until the fit was right. Closing slowly over me, accommodating to my body, the seal sliding upward to my throat. The helmet drew shut over my head, warm as hands cupping the sides of my face.  A diode-stream of golden script I cannot yet decipher cascaded down the side of the helmet’s display.  We stood up. We can stand. We can move, together.  It feels so good to be warm. Ray Nayler has lived and worked in Russia, Central Asia, the Caucasus, and the Balkans for nearly two decades. He is a Foreign Service Officer, and previously worked in international educational development, as well as serving in the Peace Corps in Ashgabat, Turkmenistan. Ray began publishing speculative fiction in 2015 in the pages of Asimov’s with the short story “Mutability.” Since then, his critically acclaimed stories have seen print in Clarkesworld, Analog, The Magazine of Fantasy and Science Fiction, Lightspeed, and Nightmare, as well as in several “Best of the Year” anthologies. His SF translations from Russian have appeared in Clarkesworld and Samovar. His story “Winter Timeshare” from the January/February 2017 issue of Asimov’s was collected in The Very Best of the Best: 35 Years of the Year’s Best Science Fiction. Ray’s debut novel, The Mountain in the Sea, will be released this fall by MCD x FSG.", "text": "7680 words, novelette\nSarcophagus\n2022 Finalist: Theodore A. Sturgeon Memorial Award\nThe causes of the disaster are these:\nFirst: The estimations of this planet’s temperature were incorrect. The beacon should never have been placed. This planet is no more capable of supporting human life than our own polar wastelands.\nSecond: My companions are all dead. I do not know what happened for sure: Encoding errors in their uploads, possibly, or a malfunction that occurred during transmission, or a receiving fault here in the beacon. Whatever the cause, the result is the same: They never woke up. The beacon post-op will say more, but a preliminary diagnostic showed entire sections of their uploads missing, scrambled, or out of sequence. The material of their blanks was recycled back into the matter arranger.\nThird: Many of the depots are lost, damaged, or unreachable. I found the first one thirteen kilometers from its original placement, three hundred meters down a crevasse. My scans indicated it was upside down, encased in ice. It had been trapped there for hundreds of years, already. It had become a part of the frozen mass of the glacier. There was no question of rappelling alone down into the crevasse and trying to free it: it was lost.\nThe next depot is thirty kilometers from here over the glacial surface. At an average daytime temperature of negative forty degrees Celsius, and an average nighttime temperature twenty degrees below that, I do not think I will survive the journey. But I have no choice except to attempt it.\nThis series of logs, this record of failure, should be accessed by my backup previous to its escape-transmission to the relay station and Earth. Do not put me in a new blank here. Do not kill me here again.\nAs a sidenote: When I next wake up, after the death of this stranded blank, I hope it is in a warm place, where a steaming bowl of noodles can be found nearby, and a cup of good coffee. Six centuries after my departure from Earth, I hope there are still such things as noodles and coffee.\nA friend at the Institute once said, “If you think things are bad now, just wait: they will get worse.”\nGallows humor, of course. Things often get better. Seasons change, weather improves, time blunts the devastations of loss.\nBut not on this planet.\nThere is no liquid water on the surface here. But on the glacier, I can hear the flow of meltwater, down in the blue depths of the crevasses. And the glaciers are moving, shifting, the way our own glaciers move on Earth. What could be causing it?\nWhat I saw yesterday might provide an answer.\nI was resting on a nunatak, a mountain peak drowned in ice, when the glacier began to sing. The ice moaned in a bass that shuddered through the marrow of my bones. Half a kilometer away, a white plume appeared, surging up from the surface. Narrow at first, it thickened into a column. I could feel the shifting of the glacier’s mass around me, even through the stone. The column rose. A hundred meters. Two hundred. Three hundred. The lemon sky filled with a million stars of silver, winding down slow as snow. The suit analyzed them as they rained down on me. Water vapor, freezing and falling to the surface.\nThe glaciers’ motion is not from the melting of their ice from above: it is from below. Imagine an ice cube on a hot stove, sliding across its own substance as it dissolves. The glaciers are moving across thermal vents kilometers beneath the surface. The vents hollow out chimneys, galleries, unstable caves in the glacial interior. Once they breach the final crust of ice, a plume is the result—a geyser tunneled through ice instead of stone.\nThe plume rose into the sky for an hour. Then there was a rumble beneath the surface, a vibration fierce as any earthquake. The plume was cut off. The column began to dissipate—a chromatic cloud, a swarm of snow-stars. Though nothing changed on the glacier’s surface, I knew that underneath, the fan of passageways that had formed this temporary chimney had collapsed. An entire system of ice caverns—chambers the size of cathedrals, passages bored through blue-black strata of ice that may never have seen a sun, had ceased to exist. But the process would begin again. The heat from below would now carve new patterns through the glacial mass as the venting steam sought escape.\nHow many vents, out there? The nunatak now seemed not like a mountain peak, but a lifeboat. When I left it, I would swim out into a sea of holes. At any moment, a vent could open beneath me. Or the whole surface of the ice tear apart like paper. There would be no warning that would not come too late. And no companion roped to me to pull me back from the chasm.\nThe vent-cloud was a chromium trace in yellow air. Thirty kilometers to the nearest depot. If it was reachable. Across a surface rotten with crevasses. I was already dead.\nThat was the moment when I found life.\nI was on one knee, watching that wisp of false stars die in the air. When I looked down, I saw them.\nThe wind must have blown them there, collected them over who knows how many rotations of this frozen world around its sun. They had drifted into the lee of a stone, where the windblown snow was carved into a bowl. Tiny, brittle, like the dry husks of dead autumn leaves in the spring.\nI would have been happy to find just a leaf. But these were not leaves—they were the chitinous exoskeletons of tiny animals. I scanned and photographed them, trying to keep my hands steady. Then I reached into that brittle pile, gathering a glove full. Coils and spirals, the cups of empty joints along the insectile carapaces, a litter of separated limbs like the smallest twigs. I could hold two dozen of them in my palm, no two alike. Little grains of existence.\nWas I the first to discover life beyond Earth? Perhaps. I couldn’t know: the other explorers were strewn across space-time, scattered across a score of beacon planets. Perhaps they, too, at this moment or fifty years ago or a hundred years from now, were holding life in their hands, or had held it, or would hold it.\nLife. Or its trace, at least. The proof of it.\nAnd no one to share that moment with.\nI stood up.\nAnd now for the bad news. I had been loitering on that glacial island, which perhaps one day will be marked as the first place in the universe humankind encountered evidence of life off our world, for a reason: my suit.\nThe causes of the disaster are these . . .\nThe suit was built to be the most efficient collector of energy possible. It was powered by a passive system of batteries recharged by light, motion, wind across its surface, friction—anything that could transfer energy into it. When charged, it would keep me warm, collect water from the atmosphere and store it for me, collect organic compounds and process them into some minimal supply of sustenance beyond what I could carry. All of those wonderful things. Its technology was centuries old, but still the best we had.\nBut its batteries weren’t charging fast enough. They were not able to stand up against the constant chill of this planet. They were failing faster than they could be charged.\nI had begun to notice the cold more and more over the past few days, seeping into the suit. So, I had stopped on that oasis of stone to lay in the sun. Splayed out on the rock to get maximum exposure, I was also making rock angels, rubbing the surface of the suit against the stone to further power the batteries.\nIf there had been anyone to see me, it would have been quite a sight: Earth’s first explorer, lying on its back waggling its limbs on a rock. One more dying thing, about to leave its exoskeleton behind as a trace of its existence.\nFifty-one percent battery. It was forty-five percent when I started this a few hours ago. Okay, that was progress. And maybe I felt a little warmer. Maybe.\nBut yesterday the suit had started out at eighty-four percent, and by nightfall, even though I had been walking all day, and almost always in the sun, it had been eighty percent. In the morning it had been fifty-seven percent.\nThirty kilometers to the depot. If it was there. Or twenty kilometers back to the beacon, where there were other spare suits—spare because my companions were dead. And I would be dead soon enough. The other suits would have the same battery problem.\nTo the depot, then. In the depot there would be heat packs, ample food supplies, electrolytes, tools, and a shelter set: Unpowered, body-heat retaining sleep sacks, external wear. Low-tech lifesavers. Enough to keep me going for a while.\nI stepped off my island.\nI am being hunted. I am putting this record down in fragments, where I can. Important to get it on the record—but I also have to keep moving. One foot in front of the other is all that is left to me.\nAs I stepped off that little island of stone, I felt the glacier shift again. Another spout appeared, a kilometer away. It was larger than the first: a volcano of steam, thundering up into the atmosphere. Vibrations passed through my boots: the treachery of the glacier, rearranging itself under my feet. It was hard not to think of mystical things: Trolls, ice giants waking from their sleep. The glacier alive, malevolent, irritated by my presence on its skin.\nFor the first few kilometers or so, though, it was good going. The surface, covered with just a slight layer of snow, was relatively even, the sastrugi no more than calf-high, the ice beneath solid. At one point I was almost running. The pace helped keep me warm.\nIt wasn’t until midday that I hit the maze.\nThere must have been a massive steam collapse, years ago, under this part of the glacier. Or perhaps the pressure from its motion was pushing up against an obstacle, some ice-drowned reef of stone. The surface of the glacier had deformed and cracked, breaking up into blocks and slabs. Many of the slabs were ten or more meters high. Canted towers of ice, sapphire in their cores, stretching as far as I could see with the binoculars. A city of ice. No way around.\nThat was when I saw it. It was just for a moment. A second, perhaps? Two?\nEnough time to send a lacework trident of terror through me, up every vein and artery to the base of my brain, where the old, old fears live. Tooth and claw in the dark. Death by drowning.\nIt must have been five kilometers away. It was visible so briefly; I could almost convince myself I had hallucinated it. How to describe it? The surface of it was pale. Smooth, fish belly pearl. It must have been three meters tall, at least—and nearly that wide. What Earth metaphor could encompass it? It was nothing like a bear, an ape, a wolf. If it had a face, I did not see it—but then, its outline, that awful plasticine, oily white against the white behind it, did not allow me to read its shape well.\nDid it even have a head? It had four limbs and was standing on two of them. Or crouched over two of them. But were they feet? Legs? Its vague body undulated with malevolent power, writhing beneath its sickening skin.\nAnd in the moment I fixed the binoculars on it, I knew it had seen me. It turned the upper part of itself in my direction. It seemed to fold deeper into itself, the way an animal will tense, growing smaller like a spring tightening, shrinking into its own core. It shuddered. Squirmed in its sallow sheath of skin.\nThen it was gone, sliding down into the maze that I, too, would have to enter.\nPerhaps, I thought, as I clambered down into the maze, it had not seen me after all. Five kilometers is a long way. I had been looking through a high-powered machine to make it out. Perhaps it had just looked in my direction and not seen me.\nBut the ancient brain and body, sharpened on the savannah, knew better. I knew it in my flesh, with primal certainty: I had been seen.\nThe maze was like a city of broken ice cathedrals, of shattered crystal spires fallen into roads that twisted back upon themselves and tangled in cul-de-sacs. The ice, refracting light countless times from one crystal to another, trapped everything red in the spectrum in another maze—the deeper maze of microscopic structure. Only blue escaped.\nBut so many blues! Sapphires dusted by fresh-fallen snow, cerulean tiger stripes etched against white, ancient inks of slabs forced up from the deep-time abyss of the glacial mass. Wind darted into the frozen city of ice every few moments. The spires sang and hissed. Wonder was mixed in me with fear—a strange alchemy.\nSuch a beautiful world—if only I had the time to explore it, rather than just dying on it.\nThe suit compass pointed my way to the depot, but I had to turn away from it again and again. Five kilometers in the maze would be ten, fifteen. I glance at the suit battery. Forty-eight percent. Forty-seven percent. And I would be in the shade, much of the time.\nAnd it was in there with me.\n“Nothing to be done,” I said out loud. “Concentrate on what you can control.”\nOne foot in front of the other. That’s what I could control. That’s all I could control, now.\nI skirted a section where the ice had fallen away, a crevasse deeper than I could see, on an ice and snow bridge no wider than my boots. From an unimaginable depth came the thunder of water.\nIt was dark when I emerged from the maze. I unfolded the shovel from my pack and dug a hole. I could not travel at night across this landscape of crevasses. Monster or no monster, I would have to sleep.\nUnder the snow, it was warmer. I wriggled into my cocoon, pulled the pack in after me like a beetle blocking the entrance to its tunnel with a tiny stone. As if that would help.\nThirty-six percent. How long did I have? And did that number even matter, with that thing out there?\nFear or no fear, I was tired enough to sleep. And too tired to dream.\nThe three of us assigned to this planet knew it would be cold where we were going. The data indicated a planet not much warmer, at its best, than an Icelandic summer. A planet with long, brutal winters even near the equator. So, we passed around books about polar exploration. It was somewhere between serious research and an inside joke.\nWe traded stories over amber glasses of tea. The darkest moments from the books stood out most: Cherry-Gerrard’s teeth shattering from the cold of the Antarctic winter. Shackleton abandoning the icebound Endurance in desperation, forced to lead his crew over pack ice. Robert Falcon Scott penning his final missive to the public as he lay dying in his sleeping bag, just kilometers from a depot of food that could have saved him.\nWhy put these things in our heads? Maybe we thought only the ancients suffered, with their heavy equipment freezing to their skin, their unwieldy sleds dragging them down. Or maybe reading them was a sort of talisman: we dispelled their power by absorption.\nA decent surface again, in the morning. Snow thicker, here—but dry, at least. Post-holing up to my knees the first half of the day, not looking at the battery percentage.\nTwenty-four percent in the morning. Not a happy number to share breakfast with. But despite everything, I broke camp in a decent mood. I had slept well, then treated myself to a double-ration and one of the self-heating ersatz “coffee” packs—a caffeinated, chocolate-flavored sandiness an evil Institute developer had come up with. How about coffee, instead? Actual coffee? Why was that hard? This grainy sludge had waited for centuries to foul my taste buds. They had uploaded my entire human connectome, the neural map of my being, beamed its pattern in a laser three hundred lightyears across the void, and inserted it into another body, and they couldn’t manage a decent cup of coffee.\nAfter several hours of trekking across that surface, I spotted another nunatak: a black dot on the horizon. I would aim for that. A resting spot. A place to spend a few hours in the sun, starfish myself out, recharge.\nThen the dot was eclipsed. A whiteness passed across its surface for a second, clipping it from existence. I raised the binoculars.\nThere. Moving across the ice at twice the speed I could manage, at least. That old, perfect fear came again. The primitive brain’s alarm system. Run. Hide. Now.\nRun where? Hide where?\nIt was on two feet now, but I still could not make out a head.\nAnd again, it saw me. It turned its whole torso toward me, pausing for a second. Almost as if saying, “Yes—get a good look.”\nBut I couldn’t get a good look. Its outline was blurred, as if my brain refused to resolve it, could not quite make its shape stay firm against the snow behind it. White on white. An . . . undulation beneath the surface. Like a distortion, almost. Like the digital enhancement of the binoculars malfunctioning.\nThen it moved on. Turned away and began to walk. As if pretending it had not seen me at all.\nDrawing me on?\nWas it even the same thing I had seen the day before? If so, it had not closed distance with me, though I was sure it could, if it chose to.\n“Nothing to be done,” I said out loud. I’d never talked to myself on Earth, but I seemed determined to develop the habit before I froze to death, or was torn to pieces, and they bounced my brain back home.\nThirty-two percent. Motion had built a bit of a charge. So move.\nThe wind had blasted the landscape here into embankments and switchbacks of corrugated ice. Most, at least, were no higher than my waist. But between them the snow was a mass of hard, small snow crystals. Walking through it was like walking through sand. I could keep my direction, but it was a winding way, and slow going. Mostly I navigated by the black dot of the rock outcropping where I had told myself I would be able to rest. Beneath my feet I could feel a slight vibration. I imagined water thundering down under-ice cataracts, steam building up pressure, the glacier sliding across stone.\n“And where,” I asked the glacier, “are you going?”\nThirty percent when I reached the island of stone, a waist-high rampart of protruding rock with a comet tail of moraine trailing it. Despite my motion, the battery was dropping in charge again. The top of the nunatak was a gray-black shelf, as flat as if it had been sheared off. In a hand-width channel grooved by ice and weather was another drift of exoskeletal traces. I ate my lunch and sorted through them. The largest was like a snake, almost—jointed, barbed in one direction to give it traction against the snow, sharp-prowed to allow it, probably, to dig down into softer surfaces. No longer than the pinky of my gloved hand, but the largest I had found. There were many smaller things, no two of them the same. Nothing, it seemed, that flew. Many creatures designed to tumble and drift.\nThen, in the side of the groove, something opened and snapped shut again. I bent down. Against the dark surface of the stone it was just slightly darker, tucked into a hole. A kind of borer. It had closed a jointed lid over itself. I was still for a minute, and it opened again. Velvet inside, a dark red. The first red I had seen on this world. Flanged and grooved, like a filter-feeder on Earth. It extruded itself from its hole, expanding outward like a cactus blossom, dark as blood.\n“Well, hello there.”\nIt clopped shut again.\nI lay on my back and began rubbing myself on the stone, careful to move a few meters off so as not to disturb my new friend.\nFourteen kilometers to the depot. After an hour of friction and sun, the suit’s battery indicator climbed to thirty-six percent. Move? Or stay here, see how much of a charge I could build in the suit? I scanned the horizon with the binoculars again. In the direction of travel the ice undulated away in hummocks, blurred by ice fog.\nBad going. That decided it. Spend the rest of the day here, soak up the sun, dig in for the night at the foot of the stone rampart, where there was enough drifted snow to cave into.\nThe suit got up to fifty percent by evening, but not moving enough made the cold leach into me: a hint of worse to come. I dug in deep, slid down into my tunnel, pulled the pack over my head just like the little clam-thing clapping its lid tight.\nPlease don’t let it get me, I thought. Like a prayer a child makes, afraid of the shadow pooling out from underneath the bed. Please. Not that way.\nBut was there a good way, here?\nBad going tomorrow. Sleep. Good night, little clam.\nThe fall happened too fast for me to even attempt to stop it. I was between two hummocks of ice when the surface underneath my feet gave way. There had been no sign the glacier was rotten here. One moment, I was making midday progress through the strange, mounded landscape. The next, I was three meters beneath the surface, flat on my back, trying to catch my breath. The wind had been knocked out of me. When it came again, it was with a sob of pain.\nI lay still, trying to take stock. Flexed one limb, then another. Nothing, it seemed, broken—but my right arm had been jammed, hard. I had trouble closing it in a good grip, and a numb streak of pain coursed down from shoulder to wrist.\nI rolled onto my side and curled up fetal. I could still see dancing white points in my vision, flakes of bright blankness.\nIt took me five minutes to get to my knees. Take stock. The tips of my fingers were numb, then the feeling returned with a wash of pins and needles. My neck hurt as well, from whipping back and thudding against the ice, my neck muscles tensing up against the weight of the helmet.\nI was on a shelf of ice, a three-meter step below the rotten surface that had given way. Beyond the shelf’s edge, there was an upward drift of ice fog: the cold exhalation, perhaps, of an ice geyser that had hollowed out this trap. How far down did it go? I crawled on my belly and looked. Far: an indigo throat, winding down until the light failed. I scooted backward away from it, managed to get to my feet, staying close to the sheer wall of ice. Okay: I would be sore, but I was okay. I looked up. A steep climb with my jammed right arm, but I could make it.\nThen I saw it, over the edge.\nThe vagueness of it up close made me nauseous. This feeling cut even through the fear: The way its outline, the pallid greasy sheen of it would not resolve. This close, it should have been distinct, but it was not.\nIt made a sound at me. A sound that was like metal being crushed, digitized through a cracked speaker. And it was that nausea, I think, and a sharp shock that went through me when it made that sound, that made me throw the ice axe at it. An instinct. The tethered ice axe clacked off the surface of the cliff just below the thing, then came back down and almost struck my helmet, causing me to duck out of the way.\nWhen I looked back up, it was gone.\nAnother fantastic choice before me: climb back up to the surface where that thing was waiting, or die here on this shelf of ice?\nI listened a moment, not knowing what I was listening for, and then began to climb.\nTwenty-three percent.\nIt was not there when I reached the top. But its tracks were: round depressions, without apparent toe or heel, as if an enormous spoon had been pressed into the surface of the snow. They led off in my direction of travel.\nSo now I was following it. Well, better than the other way round, I supposed.\nThe snow here was hard-packed, the saucerlike impressions of the thing’s limbs leaving almost no mark, then trailing off entirely as the surface hardened to ice. I checked the direction and distance of the depot beacon. It was in line with the glacier’s slow travel, ten kilometers away.\nThe sound that let me know the suit’s battery had dropped below twenty percent was the wash of a temple gong. It was designed, I supposed, so as not to startle or panic the suit’s wearer.\nIt sounded to me like the beginning of my own funeral.\n“Where are you going?” I said it out loud. Who was I talking to? To the glacier, perhaps. To the thing that was circling me. To myself.\n“Where are you going?”\nIt was the question I had asked myself, on my last night on Earth, in my room at the Institute’s connectome sequencing laboratory. The laboratory overlooked snow-covered fields, a railway yard where autolocomotives, the size of toys at this distance, shunted train cars into line. A few trees stood out in the desolation, a frail tangle of branches against the cold sky.\nAll of this was so tenuous—how could it last another hundred years, much less six hundred? There was so much risk ahead of me: technical failures that could scramble my upload, faults anywhere along that fragile beam of communication firing my neural connectome’s pattern into the void. There were nagging existential questions: Would that pattern really be me, awaking after three hundred years as if from a sleep, sheathed in my new blank? Or would I die the moment my body died here, and the person who awoke on that new world be someone else entirely—my simulacrum, but not my own self?\nBut none of that seemed as threatening as the idea, as I looked out at that desolate railway yard, silent behind the reinforced glass, laid out on white ground fragile and translucent as bone china, that none of this would be waiting for me when I returned. That the laser carrying my pattern would terminate at a dead receiver, on a planet that had rid itself of us.\nThe three hundred years it had taken me to travel here had been nothing. A closing of the eyes. A dream of color in darkness, no longer than a night’s sleep.\nAnd in that span, everyone and everything I knew had been blown into the void. Lost to me. For nothing, if I died here.\nEven if, somehow, the receivers of Earth still stood, it would no longer be my world.\nAs I neared the place where the glacier died, I could hear it calving. I could feel it: the sundering of ice, reverberating through its frozen mass, shuddering up my legs into my suit, as the face of the glacier fell away.\nIt was growing dark, now. The suit’s ten percent warning gong had sounded an hour ago. Calling the monks home to the temple. Calling them home. Five percent now—a proper alarm, a harsh blatt into the eardrums. Wake up! Appropriate, anyway, that I would die where the glacier died. Perhaps there would be a sea after all. The glacier must have some place to go.\nAnother rumble as the glacier split. And now I could see it, up ahead: could see a crack form, and then, with a massive boom, the face of the glacier falling away.\nCold was seeping into the suit as I scrambled up the moraine. Here was a hummock of boulder, ground to a knife-edge by the glacier’s slow teeth. The sun was fading, the sky shifting from yellow to emerald green. Several kilometers away, a steam column rose into the sky, lit saffron by sunset. The depot signal was beyond the calving face of the glacier. No way down that face. I had to get off of the ice. The only way was around, over the moraine edge, then down onto whatever surface . . .\nAs I came over the hill, I saw it.\nNot a sea—a hole. A massive sinkhole, bigger than anything I knew of on Earth. A darkness into which, as I watched, a tower of ice from the face of the glacier toppled. From that dark mouth, a sound of shattering. And echoes, like the beating of a drum. The roar of water, deep beneath the hollow surface.\nAround the hole a desolate beach had formed—a graveyard of gravel and boulders shoved for eons by the glacier’s mass. The stones were greasy black with moraine dust, strewn with shattered chunks of ancient ice that shone blue-black and sea-green in the dying light.\nAnd there it was—the depot.\nIt was canted against a snag of stones, its impenetrable carboplast shell blacker than the rock around it, the meter-high pyramid topped by a slab of ice that had fallen against it, ice so dense and dark it looked like stone until I saw the bubbles inside—the time capsules of air trapped thousands of years before.\nI almost did not hear the screech of the suit’s one percent alarm over the sound of my own teeth chattering. I pressed a glove to the panel, and the access port dilated open with only the slightest scrape to indicate how ancient it had become while waiting for my arrival.\nSalvation.\nI do not think, if I had the strength to move, that I would have made camp that night near that massive hole. Here, the sound of the ice was continuous, groaning and splitting. Every hour or so, ice rent away with a sound like the end of everything, tumbling into the breach. Three glaciers met here, crawling from different directions to die into this black aperture.\nAnd there was the cairn.\nI saw it just as I was closing the depot’s access panel. My prizes—solid rations, the shelter, the warmer—were stacked near the depot.\nThe cairn was hard to make out. I could have mistaken it for a natural formation. But at second glance it was clear: it was a made thing, its stones carefully selected and stacked into a waist-high mound.\nThe suit was cold, and getting colder, the battery dead. Now it was nothing more than clothing. A thick coat. Not enough to keep me alive for long. I needed to get the shelter up. I needed to get a warm ration in me, sleep on a formfoam mattress for the first time since I had left the beacon. Rest.\nI needed to know what might be in that cairn.\nMoving the stones helped keep me warm. And the adrenaline of discovery.\nThe corpse had been buried lying on its side, with its limbs curled up against its chest, like humans were often found in ancient burial sites. The body was not human, but it was so much like us: bipedal, with a symmetrical body plan, four-limbed. The head and face were—how does one describe such a thing? They were the product of a different path that had led to a similar evolutionary clearing. On another planet, there were beings who had walked in forests and savannahs so much like ours that you could have said, “that treelike thing is enough like a tree that I can use that word. That mushroom-like thing is enough like a mushroom that I will call it a mushroom. And this is close enough to grass, and that is analogous to a flower . . . ”\nBut none of them would be those things. Naming them the same thing doesn’t make them the same. And so it was with this being. This was not a human, though it was analogous to us. I could call the hands “hands” and the feet “feet,” but they were not the hands and feet we would recognize.\nThe body was clothed in the thinnest of coverings—a dark, semi-reflective sheath. No shoes, no gloves. It would not have been clothing to survive in: whatever they had worn against the cold of this place, that was gone.\nI could see the wounds that had killed them: A chunk of metal, lodged in their chest. One of their arms severed, carefully placed here atop their body. There were other wounds. Impact damage. The emergency medical training I had taken on Earth allowed me to read the signs: A crash. And this being was so clearly not of this place. So clearly as incapable of surviving here as I was, that the truth of it hit me right away: this, too, was a traveler.\nBut from how long ago? And who laid them here to rest?\nI was already cold, but I replaced the stones of the frozen cairn as carefully as I could before I began, with fingers that were already numb, to put up my shelter.\nThere was that sickly, blurred whiteness out there, stalking this place. Out there, in the night. There were towers of ice around me that seemed ready, at any moment, to crush my little tent into nothingness. But in my self-heating shelter, in the lantern-glow of a ration warmer, I raised my suit’s face mask for the first time since arriving on the planet and ate a solid ration. That seemed worth the threat of death itself.\nWhen the wind hit, I was in the middle of a dream in which I had been sealed in ice. The blackest ice, but filled with bubbles that drifted through its solid core toward my mouth and nose, nourishing me. And in those bubbles were the scents of childhood, and home: The smell of snails in the ivy of the vacant lot next door, of a hot field of grass at the end of a summer’s day. The scent of brown sugar melting in tea. I could not smell them, in the dream, but as the bubbles gathered at my nostrils, and I breathed in that air, sealed for millennia, my mind was filled with the images the smells called up: The crumbling wall of green and the fragile-shelled bodies that had traced their cursive of filtrate on the leaves. The grass in a hot wind of sunset. And beyond, the black line of the trees, the café looking out over the sea.\nThe wind turned the tent upside down, picked it at least a meter up off the stones, and smashed it back down again. The suit’s padded helmet saved me from the worst of the impact, but as I struggled to free myself from the sleeping bag, the tent was turned over again. This time, my temple struck stone, and I lost consciousness.\nI woke to find myself being dragged. My mask was still open. The tent? Where was the tent? My head was turned to the side, and I could see, through a screen of sleet, blocks of ice tumbling across the black stone. And there, at my feet, the blurred thing. It had one of my legs clamped in its upper limbs and was dragging me up onto the angle of moraine that marked the edge of the glacier. The cold, on my face, was terrible. I had thought, as the suit began to fail, that I understood what cold was. I did not. Already, my cheeks and nose were frostbitten. My eyes ached with cold. The ice crystals that lashed my face were wind-borne caltrops. I reached up and activated the face screen. It slid shut. Cracked. It was cracked. A thin haze of ice crystal powdered into it, falling on my open eye.\nI clutched at a stone and hurled it at the thing clamped to my leg. The stone went wide, but the thing turned to me. Now, for the first time, I saw what should have been its face—and screamed.\nThere was nothing there at all. It was a blank white, slightly iridescent like a spill of fuel on water, blurred as if my eyes could not focus on it. Blurred like something held up too close to my face. Again, the thing made that metallic sound—a sound of things breaking, of things torn apart—barely audible over the terrible wind. Then it turned and picked me up, as if I weighed nothing at all, and began to climb up the loose stone of the moraine.\nThe cave was fifty meters or so up the slope. I had missed it on my descent because its entrance was obscured by a slab of ice—ice, I now saw, that had been moved there. I realized, as the thing hauled me into the cave, that I had been making a very strange sound myself—a high, whimpering noise as I struggled against being carried, pounding against its hard, smooth skin.\nIt lowered me down to the ground. And I would have bolted, if I were not so exhausted that dying seemed not to matter anymore. Instead, I just lay still. The thing lumbered off a few meters and sat down.\nEvery ache from my fall the day before was back, and twice as bad as it had been. My jammed joints screamed. I had been bleeding from the temple where my head struck the ground in the tent, but it appeared to have stopped. I could feel the blood drying in my hair on the side of my face. My head ached terribly, and all of the muscles in my neck.\nThe suit bleeped as it came online. Two percent battery charge. It must have found energy to absorb. Yes, in the tent. It had been warm. And—here! The temperature read plus five, in the cave. Plus five! A sauna, compared to the outside! There must be a thermal heat source. And yes, I noticed, the stone here was slightly wet, the humidity at eighty percent—warmed, likely, by the same heat source that was melting the glaciers from beneath.\nIt was agony, sitting up. My neck muscles would not support the weight of my head. I rolled onto my side, then pushed myself up on my left arm.\nThe thing shifted its bulk where it sat. Here, in the half-light of the cave, I looked closer at it.\nAnd then I understood. It wasn’t a creature. It was an environmental suit I was looking at. It had no face because it was a face shield, closed. Its blurred outline was probably some kind of field effect. And inside, of course, would be the companion of the being who was carefully buried inside the cairn.\nI raised my cracked face shield. The air in the cave, moist as the exhalation of my breath, was welcome on my face.\n“For days, I thought you were going to kill me.”\nThe head of the thing turned. So massive: it must be an exoskeleton as well, almost a vehicle in itself. I bet it’s warm in there, I thought. Must be nice, not having to scramble around in some Institute-designed, malfunctioning piece of shit.\nThe being made that grinding sound again. I wondered if I sounded as offensive to it—and if my appearance caused the same sense of dread. I remembered the feeling that had come over me when I first saw it. It was still there, that feeling: Tooth and claw. Primeval fear. It had settled, slid down underneath my awareness now. But I could feel it there, ready to surface. The pollution of it almost seemed to emanate from the suit like a fog. Fear.\nNow it seemed so obvious. How had I missed it? There was a slight seam, and a difference of shading, where the faceplate met the helmet. The faceplate was smoother than the rest of the surface.\n“You can’t raise your faceplate? Can’t breathe this air?” I gestured at my own faceplate. “Maybe there’s an Institute on your world too, screwing everything up and sending your people to die on uninhabited planets you’ll never be able to colonize.”\nAnother burst of scraping sound. My suit blared out a one percent alarm. If it was failing to charge, even in this relative warmth, I was dead. It must have been damaged in the storm.\nThe suit went offline, zeroed out.\n“I’m sorry about your friend,” I said. My voice was shaking. I really am going to die, I thought. I probably sounded like a flock of parrots squawking to the being in the suit. But I needed to talk. I had been alone so long.\nBut the body in the cairn . . . It was impossible to say how long it had been there, but it was desiccated by cold. It looked mummified. It must have been . . . God, how long must it have been?\n“How long have you been here? Alone?” I held up a single finger. “How long have you been one?”\nThe pantomime the being made was clear, a massive arm arcing to the cave’s stone floor and slapping down onto it: since the crash.\n“Me too,” I said, pointing at myself. “None of my friends made it. And I wish I could be better company to you—but I’m not going to make it either.” I pulled at the surface of my suit, made a gesture like breaking a twig. “It isn’t working. Even here, in this cave, I’m getting cold.” I rubbed my shoulders in a sign I hoped was universal. “And it won’t be able to make the food I need. It’s just a matter of time. I reached the depot—this one. At great cost and effort. But I won’t get much further. Thank you, though, for saving me from the storm. It’s good to at least be warmer. And I can keep you company for a while, right?”\nOutside, the storm raged, tearing ice from the surface of the world, thrashing it against stone.\nThe suit lurched toward me. I scrambled backward. The faceplate stopped less than a meter from me. The massive limbs rose, made the same breaking gesture I had made. Then the being thumped a hand on my suit, made the gesture again.\nI slapped my suit, made the same motion. “Yes. Broken.”\nFor a moment, they withdrew. Then they placed the mitt-like end of a limb against the side of my face. The limb was cold—as cold as the ambient air here. A gesture of fellow-feeling? Of sorrow? Or measurement by a contact instrument, tasting my chemical composition?\nWe stayed like that for at least a minute. Then more. I closed my eyes and thought of the world from the perspective of this being. Finding our depot, that black pyramid of carboplast. They must had known, seeing that artifact, that there had been another presence here. But nothing about the depot could have told them we had not left but had, rather, not yet come. That this was no sarcophagus, but a promise of our arrival.\nWas I the first alien this species had discovered? Was this their first contact? For days, this being had circled me. They had been alone so long, and now wondered: Was I alike enough to them to communicate with? Was I someone it was possible to speak to? Or was I something deadly? Did I create the same feeling in them, of fear, that they created in me? The primitive stab of adrenaline, or whatever chemical powered their fight-or-flight responses?\nThe mitt withdrew. Then they backed up a body-length or so from me, and lay down on the ground.\nAnd fell apart. The faceplate opened, and the whole front of the suit unraveled along a seam at its centerline, falling away to the sides. The helmet, too, split in half and dropped to the side.\nEmpty.\nThere was nothing in the suit at all, except a red inner surface, dark as oxblood, studded with receptors in its mesh. There was no being here. No lost, alien astronaut.\nFinally, I truly understood. Stripping my own broken, useless suit from my body, I understood. Climbing inside, feeling the inner surface mold itself to my body—clumsily at first, tentative—and then more assured, more confident in the fit. That surface finding my surface, that warm inner membrane molding itself to my outer one. One skin finding another, shifting together until the fit was right. Closing slowly over me, accommodating to my body, the seal sliding upward to my throat. The helmet drew shut over my head, warm as hands cupping the sides of my face.\nA diode-stream of golden script I cannot yet decipher cascaded down the side of the helmet’s display.\nWe stood up. We can stand. We can move, together.\nIt feels so good to be warm.\nRay Nayler has lived and worked in Russia, Central Asia, the Caucasus, and the Balkans for nearly two decades. He is a Foreign Service Officer, and previously worked in international educational development, as well as serving in the Peace Corps in Ashgabat, Turkmenistan. Ray began publishing speculative fiction in 2015 in the pages of Asimov’s with the short story “Mutability.” Since then, his critically acclaimed stories have seen print in Clarkesworld, Analog, The Magazine of Fantasy and Science Fiction, Lightspeed, and Nightmare, as well as in several “Best of the Year” anthologies. His SF translations from Russian have appeared in Clarkesworld and Samovar. His story “Winter Timeshare” from the January/February 2017 issue of Asimov’s was collected in The Very Best of the Best: 35 Years of the Year’s Best Science Fiction. Ray’s debut novel, The Mountain in the Sea, will be released this fall by MCD x FSG.", "source": "https://clarkesworldmagazine.com/nayler_04_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Sarcophagus by Ray Nayler"}