{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Wang Yuan; Andy Dudak", "hostname": "clarkesworldmagazine.com", "date": "2020-06-16", "categories": "", "tags": "", "fingerprint": "s+9WkjOGnYRMJM+lqQo1l/o7vlw=", "id": null, "license": null, "comments": "", "raw_text": "9700 words, novelette  Other Stories  This story is sincerely dedicated to my Mother.  1  Tom called Adriana Honey-Bunny, and she called him Pumpkin.  A moment by a window. An orange California morning.  Tom snapped his fingers, the waiter understood and came and refilled his cup with fragrant coffee. The sun shone on their table and the street outside was crowded. Adriana didn’t know what kind of romance might transpire. The future was difficult to predict.  Tom talked to her about army life, who had the sweatiest feet in the platoon, a chemical weapons-grade stench; who was the best marksman, a regular deadeye; the guy who used a lighter to illuminate a stealthy, nocturnal letter-writing session and ended up igniting his army blanket.  And then Adriana saw it hovering outside the window: a drone, with a small flower basket hanging from it. It seemed to confirm its target with facial recognition, then dodged nimbly through the crowd, took advantage of the partially open door, and entered the restaurant. Adriana stared, wide-eyed, not daring to believe as the drone landed before her. Tom stood and took a sapphire blue box from the basket. Inside was a diamond ring, seemingly alive with accumulated power, awaiting deployment.  “Will you marry me?” Tom asked, getting down on one knee.  —Excerpt from Future War  1A  Lately I’ve been thinking of how you were at six or seven years old: howling every time you got a haircut, the unruly face freckles. In the early years of the Qing government, the imperial court compelled commoners of the former dynasty to shave their heads. People wept, wailed at Heaven, beat their heads on the ground, and wanted to die.  (If you had read that General Summary of World History I sent you, you would know this story happened in China, not India. This has nothing to do with Buddhism.)  Anyway, the ancient Chinese followed a mysterious ideology. They believed your body, and skin, and hair, all of you, was bestowed by your parents. To harm any of it was unfilial. And you abhorred haircuts more than them! This continued until your sophomore year in college, when you finally settled on your ideal hairstyle, a cut and color that caused me to fly into a rage. Everyone is agitated by trifles to some extent. You for instance have been more sensitive than most, since childhood. Don’t try to refute this, honey. No one knows you better than me, including yourself.  I am one of your two creators, after all.  When you were eight or nine—you couldn’t have been older, I remember buying a birthday cake around then, and the complementary candles weren’t yet double-digits—strange that I always recall these irrelevant details. Anyway, that day you took the school bus home. Your cheek was bruised, tears still glistening on your face. I was carefully following a dinner recipe, dicing carrots and onions, a dash of salt and pepper.  “What’s the matter honey?” I ran to you as fast as a middle-aged woman could.  “Mom . . . ” you began, then asked that question, the Big One, officially and for the first time.  I’d known it was coming sooner or later. Unavoidable, a game I was destined to lose. All I could do was be vigilant and wait for you to find a weakness and break through the defensive line.  “Where’s my dad anyway?”  I knew how to console a boy not yet ten years old. I had a methodology, easy and on hand, tried and tested, but in the end, you’d grow up. And I never thought of an answer to this question that seemed right. I could only procrastinate, delay, obfuscate, evade. This was my final and ultimate tactic.  Nowadays my time is limited.  The caregiver does her rounds after dinner. She gets my temperature from my healthcare ring, and my blood pressure and other parameters.  “Remember to drink a glass of Manuka honey water before bed,” she exhorts, “and for all that’s good and holy, don’t forget to use warm water, not boiling water.” She always makes a point of this, as if I’m suffering from Alzheimer’s rather than breast cancer.  After she leaves, Rothman in the neighboring bed observes: “Easy on the eyes, that little vixen.” He wistfully adds: “If I were twenty years younger . . . ”  He’s recovering from a stroke. Many in his condition become less articulate, but since his treatment he’s been quite loquacious. To be honest, I often think of applying for a room change, though much of the time his chatter is amusing. I’m a writer. Dialogue keeps me clearheaded and stimulated. Stimulated to write, just to be clear. People imagine writers to be well-spoken and glib, but I’m not much of a talker. I need someone to take the lead in conversation.  Moreover, and quite coincidentally, he has the same name as a supporting character in one of my novels.  “If I were twenty years younger,” I say, “you wouldn’t even notice her.”  “Your husband was a lucky man, obviously, but let’s face it . . . you’re old. And if he were still kicking around, he’d be ogling the Little Vixen, not you.”  “You don’t know what you’re talking about.”  I don’t bother elaborating because I’m pissed. A line from a novel once left a deep impression on me: “Time cannot remember, time can only forget.” But time doesn’t forget everything. Of this I’m sure. I’m not just weaving dazzling prose here—I mean it. It’s been a guiding principle throughout my life.  I decide to go out for a stroll. The hospital has a small park for patient R&R. When the weather’s good I like to putter about after dinner. Reckoning dusk will supply a breeze and a nice glow, I pick up my shawl, turn, and find you at the door.  I’m surprised at first. I know I should be moved, but I’m not. I don’t want to lie to you. Apart from our Great Matter, which I don’t yet know how to put into words, I wish to be totally forthcoming.  Why have you come?  1B  “Why have you come?”  You can’t know how much it hurts to hear you say that.  The surprise on your face stabs deep, and then comes the familiar guilt. How long has it been since I last visited? I even feel presumptuous, just showing up like this, but unfortunately, I couldn’t phone ahead of time.  Besides, I don’t think a son should need a reservation to visit his elderly mother.  I remember that from the time I consigned you to this facility, all the way to your death—about five years—I can count the number of times I visited on one hand. Less than once a year, on average. I hope you can forgive me. These years have been very important to me—vital in fact. If not for them, I wouldn’t be standing before you now.  “I came to see you,” I say.  “Just in time then. Come on a walk with me.” You drape that shawl over your shoulders, the one with the peony pattern, and take me by the hand. Your hand is emaciated and bony. I’m careful not to apply much force, gently harboring it in my palm. When did you start growing old? Why didn’t I notice? Is it the constant insomnia? The lack of appetite? Or did you wake up one morning and suddenly lose your last bit of patience for this horror-show world?  “Daisy doing okay?” You bring me to the little park, and we sit on a bench. There’s already a trace of autumn in the air. A few dead leaves adorn the bench. You pick one up and fiddle with it. It’s a Chinese Ash leaf, its vascular network clearly visible.  I think about your question.  Daisy should be on a business trip to China at the moment. I can’t recall which city, though I know she’s been there before. Everything I know of China comes from the news and from that hardcover you once gave me. Beijing, Shanghai, and Taiwan are often mentioned in the news. As for your book, all I remember is the Qing dynasty and something about braids or queues. So I tell it like it is: part of the reason for my visit is because of Daisy. To avoid her, really. She’ll be back from China soon, and she’ll put that unwelcome proposal to me, and we’ll have a big fight about it and trigger another six-month cold war. During that time, I’ll be on intimate terms with the cot at the laboratory. We’ll be together on Christmas day, and together we’ll quarrel. You’ll call, and I won’t be in the mood to answer. I’ll guess you called merely to ask how I am, and regardless of how I am, I would just give the polite answer: “I’m fine.” It would be you engaging in motherly self-deception, a psychological comfort; and me, as a son, attempting to conceal yet being exposed, a kind of self-hypnosis.  “Daisy’s a good girl,” you say, gaze locked on the dead leaf. I don’t know what’s so fascinating about a dead leaf. You should be looking at me. Look at me. Your son is back.  I know she’s a “good girl,” of course. I knew it long before you did, and better. In our university poetry club, I was keen on her the first time she recited:  “She walks in beauty like the night  Of cloudless climes and starry skies;”  We fell in love, went through breakups and reunions, and eventually got married. We enjoyed the same hobbies and points of view. We both hated nihilism and supported the Boston Red Sox. We reunited once at Fenway Park, the oldest venue in the league still in use, able to accommodate ten thousand people. She couldn’t believe it when I told her that. But she understood me. She got me—that’s the most important thing. When I told her my precondition for marriage, she didn’t immediately veto it, like my previous two girlfriends had. She said she’d think it over.  Half a month later she said: “Let’s get married.”  I was pleasantly surprised, and also doubtful. “Are you sure you can stick to the DINK lifestyle? It’s easy to say so, but maybe harder to put into practice.”  She kissed my forehead. “‘One shade more, one ray less, had half impaired the nameless grace’ . . . why not enjoy a romantic world of two?”  So yes, Daisy is a “good girl,” and a good wife, but now, unfortunately, she wants to be a good mother too.  “By the way . . . ” you say, suddenly breaking the silence. “I received an email from Bill yesterday. Guess what.”  “Bill?” For a moment I can’t recall who that is, but obviously I should know him. Dammit. Memory linkage dislocation. At the lab, we call this phenomenon “space-time fall early stage oscillative disorder.” It’s something like high-altitude de-acclimatization syndrome, or HADAS.  “Bill, my agent? Wears Tommy Bahama shirts all year ’round? Bald, eats like a bear and could probably wrestle one, meticulous in his work? You know fiction writing is all I’m good for. When it comes to contracts and copyrights, I’m hopeless, so thank God for Bill.”  Now I remember: the man who can eat three Big Macs as an appetizer. Uncle Bill.  “How is he?”  “Fine. He contacted a publishing house for me.”  “They finally want to publish your complete works?”  You laugh, your voice clear and bright. “I’m no Asimov, just lucky to have written two bestsellers. Publishing the complete works of a third-rate sci-fi author like me requires great courage and clever vision. Bill negotiated an autobiography for me, royalties and print run, both very impressive.”  An autobiography? But I don’t have this book. Could it be you never finished writing it? When I return I’ll have to investigate online.  “Not too shabby,” I say.  “I said no. My life’s story is already written into my fiction. Read my fiction and you can see my life.”  Ah, so that’s it.  The sky is slowly darkening. I’ve always had this strange feeling that spring and summer nights rise from the earth, while fall and winter nights descend from the sky. The park’s path lights come on.  You turn to look at me. With deep feeling you say: “How long has it been since you stopped reading my fiction?”  2  Nobody knows what happened.  The staff sergeant conveyed the sergeant major’s orders. The sergeant major relayed the captain’s orders. The captain passed on the lieutenant general’s orders:  Assemble.  The staff sergeant roused Tom and his roommate from deep sleep. Tom had been lost in a beautiful dream. Adriana had been pregnant. He’d been dreaming of this for years and pining for it day and night. It was his refuge.  The staff sergeant gripped a list of names. Roll-called soldiers fell out.  “Private Tom Richards!”  He stepped forward, hands still thrust behind his waist.  The chosen got on a military bus. Tom quietly speculated with the man seated beside him. No one really knew the purpose of this trip. Tom had never been selected for such mysterious field training in his three years of service. They theorized they were headed to the border to hunt cartel soldiers.  The bus stopped on an airport tarmac. The gruff staff sergeant herded them onto an aircraft, and Tom began to realize the situation was far more complicated than he’d imagined.  The plane landed three hours later. Tom had no idea where he was.  Stupefied, he found himself among myriad parked aircraft, and soldiers from various branches of the armed forces, all in formation. He spotted a man with a vividly scarred face. Kubrick’s Full Metal Jacket came to mind. Sure enough, a torrent of foul language spewed forth from the scarred face, mocking, ridiculing, sparing no one and no race.  “All you maggots listen up, because next time I choose to enlighten you I can’t guarantee you’ll still have your fucking ears!”  It wasn’t the least bit funny. No one so much as snorted.  “We’ve got ourselves a war!”  So that was it. Off to Afghanistan, the only war going at the moment—but Tom soon realized he was mistaken. When Scarface was through with his rant, they were packed into some kind of massive battleship, the biggest Tom had ever seen. In fact, he thought, perhaps it ought to be called a spaceship. They weren’t going to Afghanistan. They were going to Proxima Centauri b.  Of course, at that Time, Tom wasn’t familiar with Proxima Centauri b. He didn’t even know the Centaurus constellation.  He couldn’t decide if it was hilarious or not.  It was like he’d stumbled into a third-rate sci-fi novel, bound for the front lines, for a fight to the death with Bugs or Na’vi. It was four point three lightyears from Earth to Proxima Centauri b, Sol’s closest neighbor, yet at the ship’s speed this gulf was unfathomably long. Hibernation berths? Subspace jumps? The two familiar yet strange terms flashed through Tom’s mind. It was 2006. These pedestrian, tacky technologies from sci-fi novels were still fantasies in real life. This distracted Tom more than the enemy they were about to face. Of course, he missed his Honey Bunny more than ever. It occurred to Tom that they were perhaps, at this moment, the most separated lovers in the universe.  Absence makes the heart grow fonder.  Tom recalled the night he left, recalled Adriana wrapped around him, the aftermath, dripping with sweat, when she said to him: “Let’s have a baby, soldier. It can keep me company when you’re not around.”  —Excerpt from Future War  2A  I used to think getting old was a prolonged affair, but it’s actually a moment. Before that moment, you’re in your prime—afterward you’re withering away. I think of death as a remote thing, and when it comes, it catches people off guard.  Yes, I’m thinking of what happened to your father.  Everyone has their fatal weakness. You’ve always been a confident person, but afraid to make speeches, and I have my own foibles. I won’t even try to enumerate your father’s quirks. Now that I’m preparing to meet death, I can finally remember things with a calm heart.  We were in senior high school together, and superficially, you couldn’t have found two people more ill-suited to each other. Believe it or not, I debuted in The Magazine of Fantasy and Science Fiction in my sophomore year, a fantasy story, a wizard, and a dragon in an enchanted forest; whereas your father was a jock, a track-and-field-er. I never saw him sit still for more than a minute, apart from attending class. Upon graduation, he enlisted in the army, and I followed my businessman father to New Jersey. We later met at a party. He was taller and sturdier, and a more entertaining conversationalist. He had everyone rapt with his military stories, transfers, ribbons, and medals, among these tales a purple heart and how he got it.  I thought he’d long since forgotten me, but he said, “Anna, are you still writing?”  I was actually flattered—not to mention embarrassed—by his attention. In a limping manner I said, “Writing . . . well, basically, you could call me a freelancer these days?”  “Very cool! When I return to base, I can brag to all those uncultured grunts that one of my classmates is a bona fide author. Still writing fantasy?”  “Sci-fi nowadays.”  “Awesome.” It was blind and awkward flattery, since he probably couldn’t have told me the difference between fantasy and science fiction.  We traded emails and I soon got my first message from him. They’d joined forces with Mexican police in a cross-border operation against the cartels. His brother-in-arms, who had slept in the bunk above him, had been killed in action.  Your father had been standing just behind and to the left of him. He’d watched him go down. He described the hideous face of death, how it had been within reach at that moment. I didn’t know how to console him. I’d just turned twenty. I had only a literal, or literary, understanding of death. I sat at the computer all night mulling it over. That email was harder to draft and develop than any novel.  Seeing the sent notification, I suddenly realized I might fall in love with him.  Just last month my agent Bill asked if I’d be interested in writing an autobiography. I declined. It wasn’t that I didn’t want to write it—it was that I already had. If you ever start reading my fiction again, you will come to understand me. But I know that since senior high, you’ve avoided my fiction like unwelcome schoolwork.  Rothman comes in, seemingly in high spirits.  “Did your daughter come see you?” I say.  “No, I’ve given up on that, just like you’ve given up on your son.”  Fair enough.  Since you sent me to this nursing home, we’ve vanished from each other’s lives. I know you’re busy, of course. I haven’t experienced lab work, but many people like you have come to life beneath my pen. Workaholics on the tech frontier are science fiction’s eternal plug-and-play protagonists. So, I get it, in a sense. From a kind of “experienced” point of view, I understand, and I can forgive you. You’re making history. Compared with history, any individual’s feelings are trivial. I understand, and I can forgive, but I can’t help complaining. When you reach my age, you’ll understand I’m not just causing drama for drama’s sake.  When did it become unreasonable and dramatic to miss one’s child?  “I just went on a date,” Rothman says. “A movie with a certain someone. Guess who!” Unable to wait for my guess, he says, “The Little Vixen!”  “Gimmee a break. You’re sixty years old.”  “Yeah, sixty . . . half my life still ahead of me!”  “You’ve got to be older than her father.”  “If the day ever comes, he’ll be my father-in-law, and he can call me big bro.”  “Are you serious?”  “Worth a shot, and if I’m in the market for a partner, why not a young knockout?”  “Your daughter will be thrilled, I’m sure.”  “Sorry, but she has no right to veto my happiness. A once-a-year visitor doesn’t get to tell me what kind of woman I should pursue. I won’t allow it. Anyway, why not find a young hunk for yourself? Don’t tell me you haven’t thought about it. Look at which finger your ring’s on.”  “My son—”  “Doesn’t give a shit about you. How long has it been?”  And that’s when you enter, the sun on your face. “Talking about people behind their backs, Rothman? Not a good look.”  2B  Hangzhou.  Daisy went there on a business trip once. That peony shawl is a specialty local product she got you there. She bought two—the other embroidered with a phoenix—and let me choose. I chose the peony for you, thinking it more suited to your personality. When you unwrapped the gift, the gentle smile on your face proved I’d chosen right. I’ve always admired that in you but failed to inherit it: your completely open self-expression. People might think such frank emoting lacks subtlety and sophistication, but in my opinion it’s rare sincerity.  “Maybe you should take that opportunity Bill got for you.”  I sit with you in the nursing home cafeteria. This time I’ve chanced upon dinner. You ordered a pasta and salad. I went for chicken curry and whole wheat bread.  “What?”  “The autobiography.”  “How do you know about that?”  Oh, right: in your world, our meeting last month never happened.  “You told me on the phone. Remember?” A white lie. You nod suspiciously. In the end you have no choice but to take my word for it. Time is merciless, and it’s normal to forget things.  “I can’t seem to write these days,” you say. “How are you and Daisy?”  Not good.  She’ll be just back from Hangzhou. I’ll be driving her home from the airport, she’ll demand I pull over onto the freeway shoulder. She’ll crawl over from shotgun, kissing me, gasping for breath, saying she wants me so bad she can’t wait until we get home. Her teasing will get me going. My heart will race. We’ve never done it in the car before and the strange locale will be exciting. But I’ve always maintained a certain clearheadedness in these matters. I’m not one of those dating app fuckboys. I don’t keep a spare condom in the car. What kind of serious, decent person does that? If I want to continue enjoying this romantic interlude, I’ll have to get out and buy a condom.  And we’ll be on that hazardous high-speed freeway shoulder.  “Don’t go,” she’ll say. “I want you now.”  “But you could get pregnant.”  “Not likely.” Kissing my ear, she’ll say, “I’ve counted . . . this is the safe part of my cycle.”  “But we can reduce the probability to zero, so why take the risk?”  “I want you now.”  She’ll grow wilder as I calm down. Daisy rarely does this sort of thing. I mean, it will be quite spontaneous and bold for her. This won’t be her first return from a long business trip, and it won’t have been the longest. Something else will be going on. I’ll refuse the sex. I’ll ask her what it’s all about. She’ll light a cigarette and say:  “I want a child.”  “We’re fine,” I say.  I don’t want to disturb you with life’s exigencies. If I tell you I have a toothache, it will not relieve the pain. It’ll just worry you.  “Okay, what happened?” Just like Daisy won’t lie to me, I can’t lie to you; Daisy and I have lived together seven years, but I spent seventeen years with you, day and night.  “Come on honey,” you press. “What happened?”  I don’t know what to say. I couldn’t have imagined dealing with something like this. Technically speaking, I have no “experience” to draw on here.  The incident in question hasn’t occurred yet.  “Marriage crisis?” you conjecture. “Seven-year itch I’m guessing? Actually, from what friends have told me, cheating tends to come around year five or so. I’ll just say this . . . anyone can make a mistake, honey. But if you act in a timely manner to make amends, the marriage can be saved. I’m guessing the problem started at work. Was it one of those grad students at your lab?”  “Mom, where are you going with this? I’m your son.”  “And what does that have to do with you cheating?”  “It’s nothing to do with cheating, okay? She wants children.”  And I lay it all out for you. Maybe you’ll help me come up with a game plan. Even if you can’t, you’ll soon forget the whole thing. There’s nothing wrong with your memory, but you’ll forget. This visit will never have happened.  “Kids? Why? I mean, what happened?”  “I don’t know. She started making demands when she came back from China. At this point she’s a lot like you. You’re both experts in keeping secrets.”  But no matter what happens, DINK is the cornerstone of our marriage. Violate this premise and the structure of the marriage is endangered. Children are a variable, an unknown. We who conduct experiments hate variables and unknowns more than anything.  I watch you, waiting for your reply.  “Rothman pursuing the Little Vixen,” you say, clumsily changing the subject. “Who’d have thunk it?”  Seeing my blank look, you explain: “The Little Vixen is a nurse and caregiver here. Rothman gave her the nickname.”  “Who’s Rothman?”  Your expression changes. You want to say something but hesitate. We’re completely out of touch with each other’s lives. You don’t know much about my research, though I’ve wanted to tell you from the beginning. It would blow your mind, I know. You’ve written time travel sci-fi for so long, and now I’ve helped make it a reality—at the cost of visiting you more often, of course.  But who is this Rothman? Why is his pursuit of the Little Vixen so funny to you? You’ve obviously lost the urge to explain. You seem content to allow the rift between us to persist and expand.  I bow my head and finish the chicken nuggets wordlessly, then wipe the dish with the bread. You escort me to the door. We hug and kiss, like when I was a kid, the daily pre-bus-boarding routine.  I turn to go, but you stop me.  “What is it Mom?”  “Thanks for coming to see me, really.”  “I’ll come more often, for sure.”  You’ll forget this promise in the blink of an eye. You’ll return to that twilight I have yet to disturb, but I promise all the same. I’m like a stone tossed in the heart of a lake. You are the lake, and after a brief ripple, you’re as calm as ever.  3  It didn’t take so long. The spacecraft reached Proxima Centauri b in about half a year. Tom didn’t know at the time what their means of propulsion was. He was sure Scarface wouldn’t disclose the specific mechanism of flight. If Tom ventured to ask, the result must be punishment. The only question was would it be a ten nautical mile run or two hundred push-ups nonstop. By the distance units Scarface employed, Tom reckoned he’d been a Navy man.  They didn’t practice using exoskeletons or any sophisticated sci-fi weapons during their six-month journey. Every day it was just PT. Like they weren’t headed for battle with aliens. Like they were Earth’s delegation to some cosmic Olympics.  En route, Tom and his comrades prognosticated wildly. No matter what the enemy turned out to be, no matter what sort of teeth it bared, the men reckoned they were mentally prepared.  But when they finally saw the legion confronting them, they were stunned. The enemy was human. They had the same five senses and four limbs as Tom and his brethren.  Human.  The war started like this: a thousand soldiers on our side, a thousand on theirs. A month later (reckoned according to Earth Time) the side with more alive would win. There could be no simpler, more primitive war. It was to be a large-scale gang brawl, each side representing its respective civilization. The victor would have permanent and perpetual habitation rights on Earth.  —Excerpt from Future War  3A  Do you know what gives a mother the most satisfaction and pride? It’s simple. It is her child’s dependence upon her: the child coming home and calling out for Mom; the child unable to find something and calling out for Mom; the child not knowing what to do and calling out for Mom.  For me, it was your strident demands for a bedtime story. You soon tired of routine fairy tales. I’d say, “Long, long ago,” and you immediately knew a happy ending was coming. You begged me to read my own works aloud. You became a mad, obsessed fan, my number one fan, in fact. Every time I finished a story, you were my first reader.  As time passed you started pointing out style deficiencies, structural problems, unrefined metaphorical language. You put the nitpickiest industry editors to shame. Of course, that all stopped when you reached high school. You studied physics and chemistry, math, and biology, even cosmology and history. You were fascinated by formulae, axioms, experiments.  When I tried to read to you, you would say: “Come on, Mom. Really? It’s not scientific.”  “Is that so? But I’m a fiction writer, not a science popularizer.”  “And what about the ‘sci’ in sci-fi? I suggest you read some Carl Sagan or Arthur C. Clarke.”  “I appreciate your kind intentions, but I have my own selection criteria for what I read.”  You didn’t even try to argue with me. You just shrugged with a look of, “Suit yourself.”  Do you know what a mother most fears? Her child no longer needing her.  This really is the saddest theorem in the world, but there’s no avoiding it. You must grow, leave infancy behind, venture out of the nest, experience the cold and real world, navigate a complicated society. You must have your own life. You must create your own world, get married, be needed by another woman. Start a family and be a parent yourself. Oh, I almost forgot. You subscribe to the DINK lifestyle. Honey, I know the matter of your father still haunts you. That’s life. There are always fetters of one kind or another, like common accidents and diseases.  Seven years ago, when I learned that I was suffering from breast cancer, I didn’t panic. On the contrary, I was relieved. For many years I didn’t tell anyone.  I think of your father every night, his radiant beauty, his perseverance and bravery. I think of our high school years, how he charged around violently through life, his apparent dimness of wit. At the time I really thought he was dumb. The muscle-bound twit, the jock: the simplest words and most convenient definitions. But then I got to know him. I discovered, or uncovered, his gentle side. He liked motorcycles. He was afraid of dogs. Such a big lug, yet a Chihuahua could get him cowering behind me. When his fourth transfer came—he was a Marine Corps sergeant by then—we traveled the Pacific Coast Highway on his motorcycle. At one point he pulled over and we got off to take in the view. “I’m going to ask you to marry me,” he said. “Say yes and we’ll go to a church right now. Otherwise I’ll leave you here. Friendly reminder . . . it’s not easy to hitch a ride hereabouts.”  I smiled and extended my left hand. He got on one knee. Look, I admit it wasn’t too romantic. The salty sea breeze nearly gave me a cold. But at the time, I mean, as one of the two concerned parties, I felt like the world was spinning. I couldn’t imagine life getting any better.  I extend my left hand. The skin is loose, almost translucent in places. Because of my weight loss, I had to move my wedding ring from ring finger to index.  That’s why Rothman teases me, saying: “Don’t tell me you haven’t thought about it. Look at which finger your ring’s on.”  “My son—”  “Doesn’t give a shit about you. How long has it been?”  “He has his career.”  “And still has his mother. To be blunt, he still has decades to work. But how much longer will you live?”  “What do you mean by that? What do you know?”  “My Little Vixen told me your cancer cells have spread. You should’ve told us, or your son at least. I bet he knows nothing about it. Do you want the nursing home to inform him when it’s time to collect your body? Don’t get mad at me for saying these things. I know it’s ugly. Hey, my situation’s not much better. I’ve drafted my will. I may seem all full of vim and vigor, but I could die at any moment.” He taps his temple. “There’s a time bomb in here.”  “So you two really are an item?” I ask, hoping to lighten the mood. You know me. If I want to escape a situation, I just change the subject.  “Well, no. She rejected me. Said she’s not ready to settle just yet, but when she gets tired of the struggle, she might consider me. Hey, I’ll take it! At least I tried, you know? And by the way, don’t say I didn’t warn you . . . a ring on your index finger means you’re unmarried and looking.”  Rothman puts on his coat. I ask him where he’s going.  “To a bar,” he says.  Today is Christmas. The nursing home is decorated. How many Christmases have we spent apart? I really want to call you, so I do. You don’t pick up. I assume you’re busy with an experiment and will call back later, but you don’t. Like I’m harassing you. Like my call is a nuisance, not worthy of your attention.  I’m angry and sad again. I think of you constantly, but you never seem to think of me. Maybe Rothman is right. Maybe I should tell you.  My dear boy, your mother is dying.  3B  Last time I left, I promised to visit more often. But I broke that promise. Some problems have emerged with the experiment:  According to Novikov’s self-consistency principle, people can go back in time, but they cannot change history. A time traveler would be forced to act in such a way that a paradox couldn’t occur. Ultimately, our world is a final ending that has been revised countless times, like one of your novels endlessly reworked before publication. DINK is the cornerstone of my marriage, and this principle is the governing standard of time travel. In fact, all our experiments have cleaved to this principle. Crossing over isn’t as simple as you have it in your novels, or your favorite film About Time. To comply with Novikov’s self-consistency principle, time travel must observe numerous restrictions. First of all, it’s not a person that time travels, but a brain-state. I never traveled to the past—my present self reacted, on a quantum level, with myself at a certain point in the past. I think you must know about quantum entanglement, spooky action-at-a-distance. Even at opposite ends of the universe, one particle may affect the state of another. This happens almost instantaneously. The transmission speed of quantum entanglement is at least four orders of magnitude higher than c. It turns out such entanglement may transmit across time as well as space. When my present self establishes a connection with my past self, my mind or self enters that past body. This is equivalent to going back in time. Think of it this way: my present self takes the helm of my past self. I can manipulate that past self, do things, but I cannot exceed a certain threshold. If I do, the connection is broken, as governed by Novikov’s self-consistency principle.  Over the years, via countless experiments, we’ve assigned a value to the threshold that we call the Time Constant.  If a time traveler’s behavior exceeds the Time Constant, Novikov’s principle comes into play and interrupts the entanglement. For instance, if I contemplate going back and buying a winning lottery ticket, that’s just an idea. It doesn’t matter. But if I tried to do it, the action would be banned. It’s almost like blunt-force law enforcement from God. Then again, Arthur C. Clarke said a sufficiently advanced technology would be indistinguishable from magic. And all of this is just a drop in the bucket. There are many other parameters and restrictions. We can’t go back to the end of the Cretaceous and see why the dinosaurs perished. We can’t go back to ancient Egypt and see how the pyramids were built.  We can go back a year at most.  We call history that has already happened “original history.” It’s supposed to be immutable. Even if a pauper goes back a year and manages to buy a winning lottery ticket, he’ll still be poor after the connection terminates. We were always sure “original history” cannot be changed, but now there seem to be exceptions.  There is a threshold governing disconnection, but there is wiggle room.  We’re going to be busy again. We must delineate the numerical range of this newfound wiggle room. Maybe we can find a stable channel between past and future, something that would convey information at least. Imagine the tragedies we might prevent. If you knew you were going to die in a car accident in three months. If you knew a certain life choice led to rock bottom.  If I knew you were going to die in a year . . .  4  \r\n  A future energy crisis. Our high-tech descendants worried about living space. Lacking a wider perspective, forgoing a search for so-called Earth Twins, in their opinion the most suitable world for human existence is Earth itself, in the past. Their current Earth is ruined, but past Earth is a worthy goal. They travel to the past to compete with their ancestors (us) for Earth habitation rights.  They reach an agreement with representatives of past Earth. Each side selects one thousand fighters to compete at Proxima Centauri b. The winner gets sovereignty of Earth. If the interlopers from the future win, they will be quietly integrated into management of Earth. The general public won’t be aware of it. Future generations will have the tech to build spacecrafts. (Question: Could such high-tech future generations directly rule the past Earth? Need to find a balance. Logic. Self-consistency.)  Our male protagonist, Tom (Pumpkin), participates in this war. He survives the tragic conflict. The Earth government of the past finally wins. They return in triumph on their spaceship, but the ship crashes and everyone is killed. There is a conspiracy to keep this secret.  Tom’s body is found in the ocean, somewhat preserved by the cold seawater, and is then put into cryofreeze. (Under what circumstances? Can seawater be cold enough to preserve sperm and make it dormant? Option B, a glacier. How can this be achieved? Follow up with relevant research.) The body was only sent to Adriana the following year, to inform her that Tom was killed during the mission.  Adriana (neurosurgeon, a scene of her in action, performing surgery), when she gets Tom’s body, learns he froze to death, then was quickly found and refrigerated, giving her a crazy idea.  Rothman, the supporting male character, a surgeon, Adriana’s colleague, secretly has a crush on her.  —From Anna’s notes, some ideas for Future War.  Late at night.  Operating theater.  Rothman carefully washed his hands and arms with soap and put on rubber gloves. His assistant, Adriana, put the disinfectant and the container full of liquid on the stainless-steel table. The air smelled of disinfectant. The atmosphere was cold and solemn.  Rothman still couldn’t believe he’d agreed to this. He’d known that once he agreed, his doom was sealed. But if he refused—well, he didn’t know how to refuse Adriana.  “Can you do me a favor?” she had asked.  “Of course. Always happy to help.”  “I need to perform an operation.”  “A friend? I’ll arrange it ASAP.”  “Tonight.”  “Tonight? That’s impossible. The hospital . . . it can’t be scheduled. Even if I could find an operating theater, I’d need an assistant.”  “You won’t need an assistant.”  And now here they were. It was nuts.  Rothman sat next to the patient, preparing for the operation. As usual, he opened a panoramic view of the operation in his mind. He would cut the skin around the organ in question, peel it back until the outer layer could be seen. This organ would be gleaming, milky white, marbled with veins. Rothman would carefully cut off a piece of corpus cavernosum. He would put it in a test tube prepared in advance. Adriana would take it away. Technically speaking, there was no difficulty.  The difficulty was psychological.  The operation was slow and successful. Rothman had already started stitching up the wound, although this was superfluous. The patient remained motionless throughout. The room was silent. There was no beeping monitor, no intravenous machine. No one monitored the patient’s vital signs.  No painkillers were given to the patient.  “You won’t need an assistant,” Adriana had said, “because the patient is already dead.”  “Very funny.”  “It’s Tom.”  “What are you talking about?”  “I know it’s possible. His body has been kept cold. His sperm could still be alive. I need you to help me extract it.”  “Look, I’m a surgeon. I’ve had many strange requests, but if you think I’m giving a hand job to a dead man, you’re certifiable.”  “I’m serious. If you help me with this, I’ll marry you.”  Rothman had taken his time considering this. “I’ll help,” he’d finally said, “but I won’t marry you. Not like this.”  He was a surgeon. He knew that excising Tom from Adriana’s heart was an operation beyond his skill.  “I love you Pumpkin.”  “I love you Honey Bunny.”  —Excerpt from Future War  4A  I’ve finally decided to tell you. Forgive me for not knowing how to put it into direct words. It will be cleverly integrated into my fiction. If you read that, you’ll have the answer you’ve been seeking for so long.  Spinal and shoulder fractures nearly killed me, but I survived. Survival: good luck amid misfortune, but also misfortune amid good luck.  It was your father’s fifth transfer. He was being sent overseas for his outstanding service. We had been planning to have a child. No, that wasn’t you. You came later, after a few twists and turns. Your father and I decided to take a trip before he left, another motorcycle odyssey along the PCH. We seemed to be hurtling into the past. We were happy, excited. Life was beautiful. But on the way back, he lost control of the motorcycle.  We went over a cliff. I survived, your father died.  Some doctor friends told me that after death, a man’s sperm may remain viable.  After many setbacks, I finally found a doctor willing to perform sperm extraction on the deceased. I hired a hearse to transport your father’s body to a hospital in San Diego. I didn’t cry along the way. This wasn’t a show of fortitude. I had already forgotten my grief.  The operation was successful, and I had a glimmer of hope, like he wasn’t gone forever. I could keep a part of him alive. Your father was an excellent partner, an outstanding Marine, and I believe he would have been an amazing father.  Perhaps it is a power beyond biology (we sci-fi writers are superstitious, we believe in miracles). It’s like I can see my fast-approaching death. I’m not afraid. I made my peace with it long ago. I’ve been prepared since I got those test results, way back when. I was ready then, and I’m ready now. My most extravagant wish is to see you again before I die. But I can’t just summon you here. I’m not on my deathbed just yet, relying on a ventilator.  I bet myself that you’ll take the initiative to visit. Such thoughts support me these days. But I’m worried I’ll lose this bet. My luck has never been great.  Summer has come. The sunlight grows diligent and bright, and I’m withering away.  I get up from bed and it’s exercise, leaves me panting. Rothman is better. He’s preparing to leave the nursing home in the next few days.  “Old man,” I say, “I’ll miss you.”  “I’m not dead just yet.”  “I mean I’ll miss you after you go.”  “I haven’t left yet!”  “Soon enough anyway.”  “Want me to call your son for you? I mean, how long are you gonna wait before doing it yourself? You don’t have much time.”  “Gee, thanks for the well-wishing.”  “That’s our generation through and through, all of us about to die of pride.”  “He’ll come. He’s my son. I believe in him.”  I get in the wheelchair that’s been allocated to me for the last couple months. I roll myself out to the little garden-park. The Chinese Ash leaves grow luxuriantly. The decay of last winter gradually fades, giving way to a new, radiant aspect.  Enviable, really.  I’m still not used to the wheelchair. The caregiver told me to break on down slopes to curtail my speed, but I can’t recall where the break is. It seems her daily nagging isn’t useless after all. I should’ve paid more attention. Now I’m embarrassed and vexed by a mild slope, mild enough to be insignificant to a normally-abled person—a major obstacle in my life, like a medieval fortification.  “Need my help?” you say.  4B  This is the last time I’ll see you.  I guide your wheelchair down the slope, toward a sea of flowers glowing with life.  I’m sorry I haven’t visited lately. Determining that numerical range has been more complicated than we expected. We’ve been unable to clarify what sort of changes may affect the already-established future, and which will be insignificant. For instance, my assistant Jane didn’t buy the birthday gift her son asked for last year. We sent her back and she tried to rectify this. She returned to the present and sure enough the gift appeared, but not in her son’s bedroom. It was in the basement. So, “post-history” may overlay aspects of “original history.” Clearly this toy has been preserved in history, but it didn’t have much impact on the future. Her son had a favorite toy for a while, then tired of it. The toy changed nothing else.  I fervently hope I can leave you with something on this visit, but I don’t know how to discern the possibilities. I’ll just have to go with the flow, let things take their course.  In fact, I’m not doing much—just keeping you company. It’s quite low-key. From noon until evening, we reminisce: the first time I skipped class and the principal scolded me, you helping me write a love letter to my first crush, me as the guest of honor at one of your book launches.  Strange that I never realized just how colorful our past really was.  “Don’t you need to be getting back?” you say.  “No, I’m good. This is nice.”  “Wonderful,” you say, clasping my hand.  This is the last time I’ll see you.  At two a.m. you will pass out. You’ll be taken to the hospital and admitted to the ICU. The call notifying me will ring mercilessly the next morning. Daisy will answer. With a pained expression she’ll tell me: “It’s Anna.”  We’ll reconcile temporarily, rush to the hospital. I’ll run three red lights. When I pay the ticket the following month, I’ll think of you and weep, bitterly and helplessly, in the middle of the clerk’s office. People will think I’m crying over a thousand-buck fine. I won’t be able to explain my grief to a bunch of strangers. I’ll just stand there crying, thinking of how Daisy and I stood in the hospital corridor.  The doctor coming out and expressing his condolences.  I can return to the eve of your death, but I can’t change the fact of it.  “Will you read my books?”  “I do miss being your number-one fan.”  “It’s like when you were growing up. You had to throw yourself into another woman’s arms. But that’s okay, Daisy’s a good girl.”  This is as far as I can go with you.  When it’s time to say goodbye, you ask me to push you back inside. You take a book from your bedside table and hand it to me. “This is for you.”  It’s your novel Future War. You sent me a copy when it first came out. I shelved it with your other works left unread. I don’t tell you this, I just take the book.  “Mom, I love you.” I lean down and hug you, like when I was a kid, and you would lean down to hug me.  “I love you too,” you say.  “No, I mean it,” I say. “I’m not just going through the motions here.”  I can’t tell you everything that’s about to happen. The principle is limiting. Any behavior that might reveal time travel will trigger disconnection.  “I know,” you say, smiling.  I watch you fall asleep. There will be no more ripples in the lake of your life.  And now I’m home.  I haven’t been here for a while. The cold war between Daisy and I is ongoing. She will not budge from her position, and neither will I.  I find the book on the shelf. I wish this was the one from your bedside table, still wrapped in plastic like an unsealed thought, and not the one you mailed me back in the day, the one I ignored. I wipe the dust from the jacket.  I peruse it and find a Chinese Ash leaf pressed between pages. I’m stunned.  Some things and feelings are so secret, but their vitality is preserved across time, permeating history.  I sit down and start reading. I witness Tom’s death and Adriana’s subsequent choice. I’m struck, as if experiencing the accident myself. I knew through certain channels that my father died in a motorcycle accident, but I didn’t really know—not until now.  You never told me, worrying it would hurt me too much.  Something nags at me.  I get on my iPad and hastily search the keywords “China,” “Hangzhou,” “foreigners,” but of course come up wanting. I change “foreigner” to “American,” then “American beauty.” An apt description, after all, and a common headline ploy. Still nothing. Thinking of Daisy’s sudden one-eighty, I add the keyword “child.”  The first link reads: “Two-year-old child falls into deepest part of West Lake, is rescued by American beauty.”  I click on the link:  “The famous West Lake of Hangzhou was anything but tranquil yesterday afternoon. A brisk wind swept across the water, stirring up sizeable swells. According to data from the Hangzhou Meteorological Observatory, the temperature in Hangzhou was around 6°C from 2 p.m. to 3 p.m . . . ”  “ . . . Two-year-old Xianxian (pseudonym) came to West Lake with her mother to play. There is a railing near the ‘Three Pools Mirroring the Moon’ pagodas. She was climbing the railing and fell into the lake. A West Lake Cruise tour guide says the ‘Three Pools Mirroring the Moon’ area is the deepest in West Lake, with an average depth of nearly five meters . . . ”  “ . . . the mother cried out for help . . . ”  “ . . . no one offered a helping hand . . . ”  “ . . . the situation was critical . . . ”  “ . . . a beautiful foreign woman jumped in the water . . . ”  “ . . . about five minutes later, the guard on duty also jumped in, and the two joined forces. They got the little girl out of the water. She was soaked through, her long hair dripping, her small lips purple with cold . . . ”  “ . . . the foreign beauty gave the little girl first aid, attempting cardiac resuscitation and artificial respiration, but it was too late. A two-year-old flower withered while still budding. The foreign beauty is reportedly an American tourist and Chinese expert who studied Chinese history and culture. She cried during the interview, blaming herself for the child’s death.”  I sit on the sofa, dumbfounded.  It dawns on me what a bastard I really am. If someone who really loves you keeps a secret from you, it must be to spare you pain. How did I never understand this simple, self-evident truth? Why did it cost two human lives to make me see?  It gets dark, but I don’t turn on the lights. I don’t know how long it’s been. A century? I hear the door open, her heels clicking on the floor. The light comes on. Daisy stands there looking exhausted, then shocked to see me.  “You were just sitting here in the dark?”  I don’t know what to say.  “What’s wrong?”  I get up, walk over to her, hug her tight, and say, “Let’s have a baby!”  0  I think every author writes her own experiences and thoughts into her fiction, in some fashion. I’m no different. I write science fiction, but some characters are based on people I know, especially in this novel.  Science fiction as a genre of literature has always been event-oriented. In its development, and now more than ever, it relies on endless imagination to draw in readers, but in my new novel, I wanted to spark a particular discussion, a rather large kernel for the story: I wanted to explore the parent-child relationship. We’ve ignored this issue for a long time. It’s still a sci-fi novel, so I didn’t want to frame things in a sort of mundane present. Precisely because it’s sci-fi, I wanted to develop this issue more absolutely. That’s how the story came about. When it was finished, the reader I wanted most was my son. It contains the answers he’s been searching for, as well as some of my problems with him. I don’t quite know how he would react, but I know for sure he won’t read it. He’s a dyed-in-the-wool scientist. He sneers at the conjectures in my novels. I consider this my biggest failure as a science fiction writer, and a mother.  —Excerpt from the preface to Future War  0A  With a heavy expression, the doctor asked me: “Where is your family?”  “I came by myself.”  “We usually tell family members the results, so they can decide if you should be informed. I’m sorry, but the cancer has spread. But if you opt for chemotherapy—”  “If I don’t, how long do I have?”  “Anywhere from half a month to two years, maybe longer. There have been such cases. One patient who decided to forgo treatment lived ten years.”  “Thanks for the comforting words, and the truth.”  It was the coldest news I heard that summer.  I didn’t want to cause trouble for anyone, so naturally I didn’t tell you. I returned to the nursing home and lived as before, but the caregiver stumbled upon my news, somehow. I suppose she was bound to keep an eye on someone constantly fainting and having nosebleeds. She’s a nice person. I don’t know where she heard honey is effective against cancer, but she makes me drink a cup every night. By sheer luck, this cured the constipation that plagued me for years.  I hate summer. I hate humid air, moldy food, and sticky skin after a sweat. I hate the accident that happened on a hot summer day—but I don’t hate memories. Some things fix him forever in the folds of time.  0B  The experiment is a success.  We will make history, but we cannot change it.  What has passed will always bear its original aspect. I yearn to share this news with you, but you’re no longer with me. You often said science fiction filled your writing with possibilities. You loved absolute, extreme perspectives that made hot hotter and cold colder. I want you to know you successfully influenced your son. You made me a scientist. When you were writing time travel novels, I was making time travel a reality. From now on, people will have to debate whether the subject of time travel can still be considered science fiction.  The only thing that gives me a headache is Daisy. She must be upset about something, but like you, she won’t tell me what happened. I can’t have children. Absolutely not. People don’t understand, but you should sympathize. Life is so precarious, a gauntlet of disease and accident. What if something happened to me and I missed my child’s life, like my father missed mine? A unique sadness, that, a child’s sadness: no one understands it better than me. People think my fear irrational, but if they experienced what I have, they’d understand. Someone tells you something and it’s just a story. Only through personal experience can you truly understand. There is no so-called empathy in this world—not really.  I know the subtle sorrow of wanting to care for a parent who has already passed. I know what I’m talking about. When you were alive, I didn’t feel this way. When you were gone, it was too late. Regret was pointless. Like I said, it’s one thing to speak reasonably, quite another to practice what you preach.  But I’m lucky. Providence has given me the opportunity to make amends.  “Have you decided where to go?” Jane asks me.  I give the answer that was clear to me long before now: “Yes, I’m going to visit my mother.”  Author’s Note:  Writing this story, I emulated the structure of Ted Chiang’s “Division by Zero.” Anna and her husband’s storyline (including his identity, experience, and surgical details) was inspired by the article “Giving Birth After Death,” published on August 26, 2016 by the Science Squirrel Society website.    Originally published in Chinese in Tadpole Stave, June 16, 2020.  Translated and published in partnership with Storycom.  Wang Yuan has had nearly two million Chinese characters worth of fiction published, on platforms like Clarkesworld, Science Fiction World, Analog Science Fiction and Fact, Tadpole Stave, and elsewhere. He popularizes science in works such as Worlds Hidden in Science Fiction: The Book of N-Dimensional Space. His short stories are collected in the volume Painter of Stars.  Andy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles.", "text": "9700 words, novelette\nOther Stories\nThis story is sincerely dedicated to my Mother.\n1\nTom called Adriana Honey-Bunny, and she called him Pumpkin.\nA moment by a window. An orange California morning.\nTom snapped his fingers, the waiter understood and came and refilled his cup with fragrant coffee. The sun shone on their table and the street outside was crowded. Adriana didn’t know what kind of romance might transpire. The future was difficult to predict.\nTom talked to her about army life, who had the sweatiest feet in the platoon, a chemical weapons-grade stench; who was the best marksman, a regular deadeye; the guy who used a lighter to illuminate a stealthy, nocturnal letter-writing session and ended up igniting his army blanket.\nAnd then Adriana saw it hovering outside the window: a drone, with a small flower basket hanging from it. It seemed to confirm its target with facial recognition, then dodged nimbly through the crowd, took advantage of the partially open door, and entered the restaurant. Adriana stared, wide-eyed, not daring to believe as the drone landed before her. Tom stood and took a sapphire blue box from the basket. Inside was a diamond ring, seemingly alive with accumulated power, awaiting deployment.\n“Will you marry me?” Tom asked, getting down on one knee.\n—Excerpt from Future War\n1A\nLately I’ve been thinking of how you were at six or seven years old: howling every time you got a haircut, the unruly face freckles. In the early years of the Qing government, the imperial court compelled commoners of the former dynasty to shave their heads. People wept, wailed at Heaven, beat their heads on the ground, and wanted to die.\n(If you had read that General Summary of World History I sent you, you would know this story happened in China, not India. This has nothing to do with Buddhism.)\nAnyway, the ancient Chinese followed a mysterious ideology. They believed your body, and skin, and hair, all of you, was bestowed by your parents. To harm any of it was unfilial. And you abhorred haircuts more than them! This continued until your sophomore year in college, when you finally settled on your ideal hairstyle, a cut and color that caused me to fly into a rage. Everyone is agitated by trifles to some extent. You for instance have been more sensitive than most, since childhood. Don’t try to refute this, honey. No one knows you better than me, including yourself.\nI am one of your two creators, after all.\nWhen you were eight or nine—you couldn’t have been older, I remember buying a birthday cake around then, and the complementary candles weren’t yet double-digits—strange that I always recall these irrelevant details. Anyway, that day you took the school bus home. Your cheek was bruised, tears still glistening on your face. I was carefully following a dinner recipe, dicing carrots and onions, a dash of salt and pepper.\n“What’s the matter honey?” I ran to you as fast as a middle-aged woman could.\n“Mom . . . ” you began, then asked that question, the Big One, officially and for the first time.\nI’d known it was coming sooner or later. Unavoidable, a game I was destined to lose. All I could do was be vigilant and wait for you to find a weakness and break through the defensive line.\n“Where’s my dad anyway?”\nI knew how to console a boy not yet ten years old. I had a methodology, easy and on hand, tried and tested, but in the end, you’d grow up. And I never thought of an answer to this question that seemed right. I could only procrastinate, delay, obfuscate, evade. This was my final and ultimate tactic.\nNowadays my time is limited.\nThe caregiver does her rounds after dinner. She gets my temperature from my healthcare ring, and my blood pressure and other parameters.\n“Remember to drink a glass of Manuka honey water before bed,” she exhorts, “and for all that’s good and holy, don’t forget to use warm water, not boiling water.” She always makes a point of this, as if I’m suffering from Alzheimer’s rather than breast cancer.\nAfter she leaves, Rothman in the neighboring bed observes: “Easy on the eyes, that little vixen.” He wistfully adds: “If I were twenty years younger . . . ”\nHe’s recovering from a stroke. Many in his condition become less articulate, but since his treatment he’s been quite loquacious. To be honest, I often think of applying for a room change, though much of the time his chatter is amusing. I’m a writer. Dialogue keeps me clearheaded and stimulated. Stimulated to write, just to be clear. People imagine writers to be well-spoken and glib, but I’m not much of a talker. I need someone to take the lead in conversation.\nMoreover, and quite coincidentally, he has the same name as a supporting character in one of my novels.\n“If I were twenty years younger,” I say, “you wouldn’t even notice her.”\n“Your husband was a lucky man, obviously, but let’s face it . . . you’re old. And if he were still kicking around, he’d be ogling the Little Vixen, not you.”\n“You don’t know what you’re talking about.”\nI don’t bother elaborating because I’m pissed. A line from a novel once left a deep impression on me: “Time cannot remember, time can only forget.” But time doesn’t forget everything. Of this I’m sure. I’m not just weaving dazzling prose here—I mean it. It’s been a guiding principle throughout my life.\nI decide to go out for a stroll. The hospital has a small park for patient R&R. When the weather’s good I like to putter about after dinner. Reckoning dusk will supply a breeze and a nice glow, I pick up my shawl, turn, and find you at the door.\nI’m surprised at first. I know I should be moved, but I’m not. I don’t want to lie to you. Apart from our Great Matter, which I don’t yet know how to put into words, I wish to be totally forthcoming.\nWhy have you come?\n1B\n“Why have you come?”\nYou can’t know how much it hurts to hear you say that.\nThe surprise on your face stabs deep, and then comes the familiar guilt. How long has it been since I last visited? I even feel presumptuous, just showing up like this, but unfortunately, I couldn’t phone ahead of time.\nBesides, I don’t think a son should need a reservation to visit his elderly mother.\nI remember that from the time I consigned you to this facility, all the way to your death—about five years—I can count the number of times I visited on one hand. Less than once a year, on average. I hope you can forgive me. These years have been very important to me—vital in fact. If not for them, I wouldn’t be standing before you now.\n“I came to see you,” I say.\n“Just in time then. Come on a walk with me.” You drape that shawl over your shoulders, the one with the peony pattern, and take me by the hand. Your hand is emaciated and bony. I’m careful not to apply much force, gently harboring it in my palm. When did you start growing old? Why didn’t I notice? Is it the constant insomnia? The lack of appetite? Or did you wake up one morning and suddenly lose your last bit of patience for this horror-show world?\n“Daisy doing okay?” You bring me to the little park, and we sit on a bench. There’s already a trace of autumn in the air. A few dead leaves adorn the bench. You pick one up and fiddle with it. It’s a Chinese Ash leaf, its vascular network clearly visible.\nI think about your question.\nDaisy should be on a business trip to China at the moment. I can’t recall which city, though I know she’s been there before. Everything I know of China comes from the news and from that hardcover you once gave me. Beijing, Shanghai, and Taiwan are often mentioned in the news. As for your book, all I remember is the Qing dynasty and something about braids or queues. So I tell it like it is: part of the reason for my visit is because of Daisy. To avoid her, really. She’ll be back from China soon, and she’ll put that unwelcome proposal to me, and we’ll have a big fight about it and trigger another six-month cold war. During that time, I’ll be on intimate terms with the cot at the laboratory. We’ll be together on Christmas day, and together we’ll quarrel. You’ll call, and I won’t be in the mood to answer. I’ll guess you called merely to ask how I am, and regardless of how I am, I would just give the polite answer: “I’m fine.” It would be you engaging in motherly self-deception, a psychological comfort; and me, as a son, attempting to conceal yet being exposed, a kind of self-hypnosis.\n“Daisy’s a good girl,” you say, gaze locked on the dead leaf. I don’t know what’s so fascinating about a dead leaf. You should be looking at me. Look at me. Your son is back.\nI know she’s a “good girl,” of course. I knew it long before you did, and better. In our university poetry club, I was keen on her the first time she recited:\n“She walks in beauty like the night\nOf cloudless climes and starry skies;”\nWe fell in love, went through breakups and reunions, and eventually got married. We enjoyed the same hobbies and points of view. We both hated nihilism and supported the Boston Red Sox. We reunited once at Fenway Park, the oldest venue in the league still in use, able to accommodate ten thousand people. She couldn’t believe it when I told her that. But she understood me. She got me—that’s the most important thing. When I told her my precondition for marriage, she didn’t immediately veto it, like my previous two girlfriends had. She said she’d think it over.\nHalf a month later she said: “Let’s get married.”\nI was pleasantly surprised, and also doubtful. “Are you sure you can stick to the DINK lifestyle? It’s easy to say so, but maybe harder to put into practice.”\nShe kissed my forehead. “‘One shade more, one ray less, had half impaired the nameless grace’ . . . why not enjoy a romantic world of two?”\nSo yes, Daisy is a “good girl,” and a good wife, but now, unfortunately, she wants to be a good mother too.\n“By the way . . . ” you say, suddenly breaking the silence. “I received an email from Bill yesterday. Guess what.”\n“Bill?” For a moment I can’t recall who that is, but obviously I should know him. Dammit. Memory linkage dislocation. At the lab, we call this phenomenon “space-time fall early stage oscillative disorder.” It’s something like high-altitude de-acclimatization syndrome, or HADAS.\n“Bill, my agent? Wears Tommy Bahama shirts all year ’round? Bald, eats like a bear and could probably wrestle one, meticulous in his work? You know fiction writing is all I’m good for. When it comes to contracts and copyrights, I’m hopeless, so thank God for Bill.”\nNow I remember: the man who can eat three Big Macs as an appetizer. Uncle Bill.\n“How is he?”\n“Fine. He contacted a publishing house for me.”\n“They finally want to publish your complete works?”\nYou laugh, your voice clear and bright. “I’m no Asimov, just lucky to have written two bestsellers. Publishing the complete works of a third-rate sci-fi author like me requires great courage and clever vision. Bill negotiated an autobiography for me, royalties and print run, both very impressive.”\nAn autobiography? But I don’t have this book. Could it be you never finished writing it? When I return I’ll have to investigate online.\n“Not too shabby,” I say.\n“I said no. My life’s story is already written into my fiction. Read my fiction and you can see my life.”\nAh, so that’s it.\nThe sky is slowly darkening. I’ve always had this strange feeling that spring and summer nights rise from the earth, while fall and winter nights descend from the sky. The park’s path lights come on.\nYou turn to look at me. With deep feeling you say: “How long has it been since you stopped reading my fiction?”\n2\nNobody knows what happened.\nThe staff sergeant conveyed the sergeant major’s orders. The sergeant major relayed the captain’s orders. The captain passed on the lieutenant general’s orders:\nAssemble.\nThe staff sergeant roused Tom and his roommate from deep sleep. Tom had been lost in a beautiful dream. Adriana had been pregnant. He’d been dreaming of this for years and pining for it day and night. It was his refuge.\nThe staff sergeant gripped a list of names. Roll-called soldiers fell out.\n“Private Tom Richards!”\nHe stepped forward, hands still thrust behind his waist.\nThe chosen got on a military bus. Tom quietly speculated with the man seated beside him. No one really knew the purpose of this trip. Tom had never been selected for such mysterious field training in his three years of service. They theorized they were headed to the border to hunt cartel soldiers.\nThe bus stopped on an airport tarmac. The gruff staff sergeant herded them onto an aircraft, and Tom began to realize the situation was far more complicated than he’d imagined.\nThe plane landed three hours later. Tom had no idea where he was.\nStupefied, he found himself among myriad parked aircraft, and soldiers from various branches of the armed forces, all in formation. He spotted a man with a vividly scarred face. Kubrick’s Full Metal Jacket came to mind. Sure enough, a torrent of foul language spewed forth from the scarred face, mocking, ridiculing, sparing no one and no race.\n“All you maggots listen up, because next time I choose to enlighten you I can’t guarantee you’ll still have your fucking ears!”\nIt wasn’t the least bit funny. No one so much as snorted.\n“We’ve got ourselves a war!”\nSo that was it. Off to Afghanistan, the only war going at the moment—but Tom soon realized he was mistaken. When Scarface was through with his rant, they were packed into some kind of massive battleship, the biggest Tom had ever seen. In fact, he thought, perhaps it ought to be called a spaceship. They weren’t going to Afghanistan. They were going to Proxima Centauri b.\nOf course, at that Time, Tom wasn’t familiar with Proxima Centauri b. He didn’t even know the Centaurus constellation.\nHe couldn’t decide if it was hilarious or not.\nIt was like he’d stumbled into a third-rate sci-fi novel, bound for the front lines, for a fight to the death with Bugs or Na’vi. It was four point three lightyears from Earth to Proxima Centauri b, Sol’s closest neighbor, yet at the ship’s speed this gulf was unfathomably long. Hibernation berths? Subspace jumps? The two familiar yet strange terms flashed through Tom’s mind. It was 2006. These pedestrian, tacky technologies from sci-fi novels were still fantasies in real life. This distracted Tom more than the enemy they were about to face. Of course, he missed his Honey Bunny more than ever. It occurred to Tom that they were perhaps, at this moment, the most separated lovers in the universe.\nAbsence makes the heart grow fonder.\nTom recalled the night he left, recalled Adriana wrapped around him, the aftermath, dripping with sweat, when she said to him: “Let’s have a baby, soldier. It can keep me company when you’re not around.”\n—Excerpt from Future War\n2A\nI used to think getting old was a prolonged affair, but it’s actually a moment. Before that moment, you’re in your prime—afterward you’re withering away. I think of death as a remote thing, and when it comes, it catches people off guard.\nYes, I’m thinking of what happened to your father.\nEveryone has their fatal weakness. You’ve always been a confident person, but afraid to make speeches, and I have my own foibles. I won’t even try to enumerate your father’s quirks. Now that I’m preparing to meet death, I can finally remember things with a calm heart.\nWe were in senior high school together, and superficially, you couldn’t have found two people more ill-suited to each other. Believe it or not, I debuted in The Magazine of Fantasy and Science Fiction in my sophomore year, a fantasy story, a wizard, and a dragon in an enchanted forest; whereas your father was a jock, a track-and-field-er. I never saw him sit still for more than a minute, apart from attending class. Upon graduation, he enlisted in the army, and I followed my businessman father to New Jersey. We later met at a party. He was taller and sturdier, and a more entertaining conversationalist. He had everyone rapt with his military stories, transfers, ribbons, and medals, among these tales a purple heart and how he got it.\nI thought he’d long since forgotten me, but he said, “Anna, are you still writing?”\nI was actually flattered—not to mention embarrassed—by his attention. In a limping manner I said, “Writing . . . well, basically, you could call me a freelancer these days?”\n“Very cool! When I return to base, I can brag to all those uncultured grunts that one of my classmates is a bona fide author. Still writing fantasy?”\n“Sci-fi nowadays.”\n“Awesome.” It was blind and awkward flattery, since he probably couldn’t have told me the difference between fantasy and science fiction.\nWe traded emails and I soon got my first message from him. They’d joined forces with Mexican police in a cross-border operation against the cartels. His brother-in-arms, who had slept in the bunk above him, had been killed in action.\nYour father had been standing just behind and to the left of him. He’d watched him go down. He described the hideous face of death, how it had been within reach at that moment. I didn’t know how to console him. I’d just turned twenty. I had only a literal, or literary, understanding of death. I sat at the computer all night mulling it over. That email was harder to draft and develop than any novel.\nSeeing the sent notification, I suddenly realized I might fall in love with him.\nJust last month my agent Bill asked if I’d be interested in writing an autobiography. I declined. It wasn’t that I didn’t want to write it—it was that I already had. If you ever start reading my fiction again, you will come to understand me. But I know that since senior high, you’ve avoided my fiction like unwelcome schoolwork.\nRothman comes in, seemingly in high spirits.\n“Did your daughter come see you?” I say.\n“No, I’ve given up on that, just like you’ve given up on your son.”\nFair enough.\nSince you sent me to this nursing home, we’ve vanished from each other’s lives. I know you’re busy, of course. I haven’t experienced lab work, but many people like you have come to life beneath my pen. Workaholics on the tech frontier are science fiction’s eternal plug-and-play protagonists. So, I get it, in a sense. From a kind of “experienced” point of view, I understand, and I can forgive you. You’re making history. Compared with history, any individual’s feelings are trivial. I understand, and I can forgive, but I can’t help complaining. When you reach my age, you’ll understand I’m not just causing drama for drama’s sake.\nWhen did it become unreasonable and dramatic to miss one’s child?\n“I just went on a date,” Rothman says. “A movie with a certain someone. Guess who!” Unable to wait for my guess, he says, “The Little Vixen!”\n“Gimmee a break. You’re sixty years old.”\n“Yeah, sixty . . . half my life still ahead of me!”\n“You’ve got to be older than her father.”\n“If the day ever comes, he’ll be my father-in-law, and he can call me big bro.”\n“Are you serious?”\n“Worth a shot, and if I’m in the market for a partner, why not a young knockout?”\n“Your daughter will be thrilled, I’m sure.”\n“Sorry, but she has no right to veto my happiness. A once-a-year visitor doesn’t get to tell me what kind of woman I should pursue. I won’t allow it. Anyway, why not find a young hunk for yourself? Don’t tell me you haven’t thought about it. Look at which finger your ring’s on.”\n“My son—”\n“Doesn’t give a shit about you. How long has it been?”\nAnd that’s when you enter, the sun on your face. “Talking about people behind their backs, Rothman? Not a good look.”\n2B\nHangzhou.\nDaisy went there on a business trip once. That peony shawl is a specialty local product she got you there. She bought two—the other embroidered with a phoenix—and let me choose. I chose the peony for you, thinking it more suited to your personality. When you unwrapped the gift, the gentle smile on your face proved I’d chosen right. I’ve always admired that in you but failed to inherit it: your completely open self-expression. People might think such frank emoting lacks subtlety and sophistication, but in my opinion it’s rare sincerity.\n“Maybe you should take that opportunity Bill got for you.”\nI sit with you in the nursing home cafeteria. This time I’ve chanced upon dinner. You ordered a pasta and salad. I went for chicken curry and whole wheat bread.\n“What?”\n“The autobiography.”\n“How do you know about that?”\nOh, right: in your world, our meeting last month never happened.\n“You told me on the phone. Remember?” A white lie. You nod suspiciously. In the end you have no choice but to take my word for it. Time is merciless, and it’s normal to forget things.\n“I can’t seem to write these days,” you say. “How are you and Daisy?”\nNot good.\nShe’ll be just back from Hangzhou. I’ll be driving her home from the airport, she’ll demand I pull over onto the freeway shoulder. She’ll crawl over from shotgun, kissing me, gasping for breath, saying she wants me so bad she can’t wait until we get home. Her teasing will get me going. My heart will race. We’ve never done it in the car before and the strange locale will be exciting. But I’ve always maintained a certain clearheadedness in these matters. I’m not one of those dating app fuckboys. I don’t keep a spare condom in the car. What kind of serious, decent person does that? If I want to continue enjoying this romantic interlude, I’ll have to get out and buy a condom.\nAnd we’ll be on that hazardous high-speed freeway shoulder.\n“Don’t go,” she’ll say. “I want you now.”\n“But you could get pregnant.”\n“Not likely.” Kissing my ear, she’ll say, “I’ve counted . . . this is the safe part of my cycle.”\n“But we can reduce the probability to zero, so why take the risk?”\n“I want you now.”\nShe’ll grow wilder as I calm down. Daisy rarely does this sort of thing. I mean, it will be quite spontaneous and bold for her. This won’t be her first return from a long business trip, and it won’t have been the longest. Something else will be going on. I’ll refuse the sex. I’ll ask her what it’s all about. She’ll light a cigarette and say:\n“I want a child.”\n“We’re fine,” I say.\nI don’t want to disturb you with life’s exigencies. If I tell you I have a toothache, it will not relieve the pain. It’ll just worry you.\n“Okay, what happened?” Just like Daisy won’t lie to me, I can’t lie to you; Daisy and I have lived together seven years, but I spent seventeen years with you, day and night.\n“Come on honey,” you press. “What happened?”\nI don’t know what to say. I couldn’t have imagined dealing with something like this. Technically speaking, I have no “experience” to draw on here.\nThe incident in question hasn’t occurred yet.\n“Marriage crisis?” you conjecture. “Seven-year itch I’m guessing? Actually, from what friends have told me, cheating tends to come around year five or so. I’ll just say this . . . anyone can make a mistake, honey. But if you act in a timely manner to make amends, the marriage can be saved. I’m guessing the problem started at work. Was it one of those grad students at your lab?”\n“Mom, where are you going with this? I’m your son.”\n“And what does that have to do with you cheating?”\n“It’s nothing to do with cheating, okay? She wants children.”\nAnd I lay it all out for you. Maybe you’ll help me come up with a game plan. Even if you can’t, you’ll soon forget the whole thing. There’s nothing wrong with your memory, but you’ll forget. This visit will never have happened.\n“Kids? Why? I mean, what happened?”\n“I don’t know. She started making demands when she came back from China. At this point she’s a lot like you. You’re both experts in keeping secrets.”\nBut no matter what happens, DINK is the cornerstone of our marriage. Violate this premise and the structure of the marriage is endangered. Children are a variable, an unknown. We who conduct experiments hate variables and unknowns more than anything.\nI watch you, waiting for your reply.\n“Rothman pursuing the Little Vixen,” you say, clumsily changing the subject. “Who’d have thunk it?”\nSeeing my blank look, you explain: “The Little Vixen is a nurse and caregiver here. Rothman gave her the nickname.”\n“Who’s Rothman?”\nYour expression changes. You want to say something but hesitate. We’re completely out of touch with each other’s lives. You don’t know much about my research, though I’ve wanted to tell you from the beginning. It would blow your mind, I know. You’ve written time travel sci-fi for so long, and now I’ve helped make it a reality—at the cost of visiting you more often, of course.\nBut who is this Rothman? Why is his pursuit of the Little Vixen so funny to you? You’ve obviously lost the urge to explain. You seem content to allow the rift between us to persist and expand.\nI bow my head and finish the chicken nuggets wordlessly, then wipe the dish with the bread. You escort me to the door. We hug and kiss, like when I was a kid, the daily pre-bus-boarding routine.\nI turn to go, but you stop me.\n“What is it Mom?”\n“Thanks for coming to see me, really.”\n“I’ll come more often, for sure.”\nYou’ll forget this promise in the blink of an eye. You’ll return to that twilight I have yet to disturb, but I promise all the same. I’m like a stone tossed in the heart of a lake. You are the lake, and after a brief ripple, you’re as calm as ever.\n3\nIt didn’t take so long. The spacecraft reached Proxima Centauri b in about half a year. Tom didn’t know at the time what their means of propulsion was. He was sure Scarface wouldn’t disclose the specific mechanism of flight. If Tom ventured to ask, the result must be punishment. The only question was would it be a ten nautical mile run or two hundred push-ups nonstop. By the distance units Scarface employed, Tom reckoned he’d been a Navy man.\nThey didn’t practice using exoskeletons or any sophisticated sci-fi weapons during their six-month journey. Every day it was just PT. Like they weren’t headed for battle with aliens. Like they were Earth’s delegation to some cosmic Olympics.\nEn route, Tom and his comrades prognosticated wildly. No matter what the enemy turned out to be, no matter what sort of teeth it bared, the men reckoned they were mentally prepared.\nBut when they finally saw the legion confronting them, they were stunned. The enemy was human. They had the same five senses and four limbs as Tom and his brethren.\nHuman.\nThe war started like this: a thousand soldiers on our side, a thousand on theirs. A month later (reckoned according to Earth Time) the side with more alive would win. There could be no simpler, more primitive war. It was to be a large-scale gang brawl, each side representing its respective civilization. The victor would have permanent and perpetual habitation rights on Earth.\n—Excerpt from Future War\n3A\nDo you know what gives a mother the most satisfaction and pride? It’s simple. It is her child’s dependence upon her: the child coming home and calling out for Mom; the child unable to find something and calling out for Mom; the child not knowing what to do and calling out for Mom.\nFor me, it was your strident demands for a bedtime story. You soon tired of routine fairy tales. I’d say, “Long, long ago,” and you immediately knew a happy ending was coming. You begged me to read my own works aloud. You became a mad, obsessed fan, my number one fan, in fact. Every time I finished a story, you were my first reader.\nAs time passed you started pointing out style deficiencies, structural problems, unrefined metaphorical language. You put the nitpickiest industry editors to shame. Of course, that all stopped when you reached high school. You studied physics and chemistry, math, and biology, even cosmology and history. You were fascinated by formulae, axioms, experiments.\nWhen I tried to read to you, you would say: “Come on, Mom. Really? It’s not scientific.”\n“Is that so? But I’m a fiction writer, not a science popularizer.”\n“And what about the ‘sci’ in sci-fi? I suggest you read some Carl Sagan or Arthur C. Clarke.”\n“I appreciate your kind intentions, but I have my own selection criteria for what I read.”\nYou didn’t even try to argue with me. You just shrugged with a look of, “Suit yourself.”\nDo you know what a mother most fears? Her child no longer needing her.\nThis really is the saddest theorem in the world, but there’s no avoiding it. You must grow, leave infancy behind, venture out of the nest, experience the cold and real world, navigate a complicated society. You must have your own life. You must create your own world, get married, be needed by another woman. Start a family and be a parent yourself. Oh, I almost forgot. You subscribe to the DINK lifestyle. Honey, I know the matter of your father still haunts you. That’s life. There are always fetters of one kind or another, like common accidents and diseases.\nSeven years ago, when I learned that I was suffering from breast cancer, I didn’t panic. On the contrary, I was relieved. For many years I didn’t tell anyone.\nI think of your father every night, his radiant beauty, his perseverance and bravery. I think of our high school years, how he charged around violently through life, his apparent dimness of wit. At the time I really thought he was dumb. The muscle-bound twit, the jock: the simplest words and most convenient definitions. But then I got to know him. I discovered, or uncovered, his gentle side. He liked motorcycles. He was afraid of dogs. Such a big lug, yet a Chihuahua could get him cowering behind me. When his fourth transfer came—he was a Marine Corps sergeant by then—we traveled the Pacific Coast Highway on his motorcycle. At one point he pulled over and we got off to take in the view. “I’m going to ask you to marry me,” he said. “Say yes and we’ll go to a church right now. Otherwise I’ll leave you here. Friendly reminder . . . it’s not easy to hitch a ride hereabouts.”\nI smiled and extended my left hand. He got on one knee. Look, I admit it wasn’t too romantic. The salty sea breeze nearly gave me a cold. But at the time, I mean, as one of the two concerned parties, I felt like the world was spinning. I couldn’t imagine life getting any better.\nI extend my left hand. The skin is loose, almost translucent in places. Because of my weight loss, I had to move my wedding ring from ring finger to index.\nThat’s why Rothman teases me, saying: “Don’t tell me you haven’t thought about it. Look at which finger your ring’s on.”\n“My son—”\n“Doesn’t give a shit about you. How long has it been?”\n“He has his career.”\n“And still has his mother. To be blunt, he still has decades to work. But how much longer will you live?”\n“What do you mean by that? What do you know?”\n“My Little Vixen told me your cancer cells have spread. You should’ve told us, or your son at least. I bet he knows nothing about it. Do you want the nursing home to inform him when it’s time to collect your body? Don’t get mad at me for saying these things. I know it’s ugly. Hey, my situation’s not much better. I’ve drafted my will. I may seem all full of vim and vigor, but I could die at any moment.” He taps his temple. “There’s a time bomb in here.”\n“So you two really are an item?” I ask, hoping to lighten the mood. You know me. If I want to escape a situation, I just change the subject.\n“Well, no. She rejected me. Said she’s not ready to settle just yet, but when she gets tired of the struggle, she might consider me. Hey, I’ll take it! At least I tried, you know? And by the way, don’t say I didn’t warn you . . . a ring on your index finger means you’re unmarried and looking.”\nRothman puts on his coat. I ask him where he’s going.\n“To a bar,” he says.\nToday is Christmas. The nursing home is decorated. How many Christmases have we spent apart? I really want to call you, so I do. You don’t pick up. I assume you’re busy with an experiment and will call back later, but you don’t. Like I’m harassing you. Like my call is a nuisance, not worthy of your attention.\nI’m angry and sad again. I think of you constantly, but you never seem to think of me. Maybe Rothman is right. Maybe I should tell you.\nMy dear boy, your mother is dying.\n3B\nLast time I left, I promised to visit more often. But I broke that promise. Some problems have emerged with the experiment:\nAccording to Novikov’s self-consistency principle, people can go back in time, but they cannot change history. A time traveler would be forced to act in such a way that a paradox couldn’t occur. Ultimately, our world is a final ending that has been revised countless times, like one of your novels endlessly reworked before publication. DINK is the cornerstone of my marriage, and this principle is the governing standard of time travel. In fact, all our experiments have cleaved to this principle. Crossing over isn’t as simple as you have it in your novels, or your favorite film About Time. To comply with Novikov’s self-consistency principle, time travel must observe numerous restrictions. First of all, it’s not a person that time travels, but a brain-state. I never traveled to the past—my present self reacted, on a quantum level, with myself at a certain point in the past. I think you must know about quantum entanglement, spooky action-at-a-distance. Even at opposite ends of the universe, one particle may affect the state of another. This happens almost instantaneously. The transmission speed of quantum entanglement is at least four orders of magnitude higher than c. It turns out such entanglement may transmit across time as well as space. When my present self establishes a connection with my past self, my mind or self enters that past body. This is equivalent to going back in time. Think of it this way: my present self takes the helm of my past self. I can manipulate that past self, do things, but I cannot exceed a certain threshold. If I do, the connection is broken, as governed by Novikov’s self-consistency principle.\nOver the years, via countless experiments, we’ve assigned a value to the threshold that we call the Time Constant.\nIf a time traveler’s behavior exceeds the Time Constant, Novikov’s principle comes into play and interrupts the entanglement. For instance, if I contemplate going back and buying a winning lottery ticket, that’s just an idea. It doesn’t matter. But if I tried to do it, the action would be banned. It’s almost like blunt-force law enforcement from God. Then again, Arthur C. Clarke said a sufficiently advanced technology would be indistinguishable from magic. And all of this is just a drop in the bucket. There are many other parameters and restrictions. We can’t go back to the end of the Cretaceous and see why the dinosaurs perished. We can’t go back to ancient Egypt and see how the pyramids were built.\nWe can go back a year at most.\nWe call history that has already happened “original history.” It’s supposed to be immutable. Even if a pauper goes back a year and manages to buy a winning lottery ticket, he’ll still be poor after the connection terminates. We were always sure “original history” cannot be changed, but now there seem to be exceptions.\nThere is a threshold governing disconnection, but there is wiggle room.\nWe’re going to be busy again. We must delineate the numerical range of this newfound wiggle room. Maybe we can find a stable channel between past and future, something that would convey information at least. Imagine the tragedies we might prevent. If you knew you were going to die in a car accident in three months. If you knew a certain life choice led to rock bottom.\nIf I knew you were going to die in a year . . .\n4\n- A future energy crisis. Our high-tech descendants worried about living space. Lacking a wider perspective, forgoing a search for so-called Earth Twins, in their opinion the most suitable world for human existence is Earth itself, in the past. Their current Earth is ruined, but past Earth is a worthy goal. They travel to the past to compete with their ancestors (us) for Earth habitation rights.\n- They reach an agreement with representatives of past Earth. Each side selects one thousand fighters to compete at Proxima Centauri b. The winner gets sovereignty of Earth. If the interlopers from the future win, they will be quietly integrated into management of Earth. The general public won’t be aware of it. Future generations will have the tech to build spacecrafts. (Question: Could such high-tech future generations directly rule the past Earth? Need to find a balance. Logic. Self-consistency.)\n- Our male protagonist, Tom (Pumpkin), participates in this war. He survives the tragic conflict. The Earth government of the past finally wins. They return in triumph on their spaceship, but the ship crashes and everyone is killed. There is a conspiracy to keep this secret.\n- Tom’s body is found in the ocean, somewhat preserved by the cold seawater, and is then put into cryofreeze. (Under what circumstances? Can seawater be cold enough to preserve sperm and make it dormant? Option B, a glacier. How can this be achieved? Follow up with relevant research.) The body was only sent to Adriana the following year, to inform her that Tom was killed during the mission.\n- Adriana (neurosurgeon, a scene of her in action, performing surgery), when she gets Tom’s body, learns he froze to death, then was quickly found and refrigerated, giving her a crazy idea.\n- Rothman, the supporting male character, a surgeon, Adriana’s colleague, secretly has a crush on her.\n—From Anna’s notes, some ideas for Future War.\nLate at night.\nOperating theater.\nRothman carefully washed his hands and arms with soap and put on rubber gloves. His assistant, Adriana, put the disinfectant and the container full of liquid on the stainless-steel table. The air smelled of disinfectant. The atmosphere was cold and solemn.\nRothman still couldn’t believe he’d agreed to this. He’d known that once he agreed, his doom was sealed. But if he refused—well, he didn’t know how to refuse Adriana.\n“Can you do me a favor?” she had asked.\n“Of course. Always happy to help.”\n“I need to perform an operation.”\n“A friend? I’ll arrange it ASAP.”\n“Tonight.”\n“Tonight? That’s impossible. The hospital . . . it can’t be scheduled. Even if I could find an operating theater, I’d need an assistant.”\n“You won’t need an assistant.”\nAnd now here they were. It was nuts.\nRothman sat next to the patient, preparing for the operation. As usual, he opened a panoramic view of the operation in his mind. He would cut the skin around the organ in question, peel it back until the outer layer could be seen. This organ would be gleaming, milky white, marbled with veins. Rothman would carefully cut off a piece of corpus cavernosum. He would put it in a test tube prepared in advance. Adriana would take it away. Technically speaking, there was no difficulty.\nThe difficulty was psychological.\nThe operation was slow and successful. Rothman had already started stitching up the wound, although this was superfluous. The patient remained motionless throughout. The room was silent. There was no beeping monitor, no intravenous machine. No one monitored the patient’s vital signs.\nNo painkillers were given to the patient.\n“You won’t need an assistant,” Adriana had said, “because the patient is already dead.”\n“Very funny.”\n“It’s Tom.”\n“What are you talking about?”\n“I know it’s possible. His body has been kept cold. His sperm could still be alive. I need you to help me extract it.”\n“Look, I’m a surgeon. I’ve had many strange requests, but if you think I’m giving a hand job to a dead man, you’re certifiable.”\n“I’m serious. If you help me with this, I’ll marry you.”\nRothman had taken his time considering this. “I’ll help,” he’d finally said, “but I won’t marry you. Not like this.”\nHe was a surgeon. He knew that excising Tom from Adriana’s heart was an operation beyond his skill.\n“I love you Pumpkin.”\n“I love you Honey Bunny.”\n—Excerpt from Future War\n4A\nI’ve finally decided to tell you. Forgive me for not knowing how to put it into direct words. It will be cleverly integrated into my fiction. If you read that, you’ll have the answer you’ve been seeking for so long.\nSpinal and shoulder fractures nearly killed me, but I survived. Survival: good luck amid misfortune, but also misfortune amid good luck.\nIt was your father’s fifth transfer. He was being sent overseas for his outstanding service. We had been planning to have a child. No, that wasn’t you. You came later, after a few twists and turns. Your father and I decided to take a trip before he left, another motorcycle odyssey along the PCH. We seemed to be hurtling into the past. We were happy, excited. Life was beautiful. But on the way back, he lost control of the motorcycle.\nWe went over a cliff. I survived, your father died.\nSome doctor friends told me that after death, a man’s sperm may remain viable.\nAfter many setbacks, I finally found a doctor willing to perform sperm extraction on the deceased. I hired a hearse to transport your father’s body to a hospital in San Diego. I didn’t cry along the way. This wasn’t a show of fortitude. I had already forgotten my grief.\nThe operation was successful, and I had a glimmer of hope, like he wasn’t gone forever. I could keep a part of him alive. Your father was an excellent partner, an outstanding Marine, and I believe he would have been an amazing father.\nPerhaps it is a power beyond biology (we sci-fi writers are superstitious, we believe in miracles). It’s like I can see my fast-approaching death. I’m not afraid. I made my peace with it long ago. I’ve been prepared since I got those test results, way back when. I was ready then, and I’m ready now. My most extravagant wish is to see you again before I die. But I can’t just summon you here. I’m not on my deathbed just yet, relying on a ventilator.\nI bet myself that you’ll take the initiative to visit. Such thoughts support me these days. But I’m worried I’ll lose this bet. My luck has never been great.\nSummer has come. The sunlight grows diligent and bright, and I’m withering away.\nI get up from bed and it’s exercise, leaves me panting. Rothman is better. He’s preparing to leave the nursing home in the next few days.\n“Old man,” I say, “I’ll miss you.”\n“I’m not dead just yet.”\n“I mean I’ll miss you after you go.”\n“I haven’t left yet!”\n“Soon enough anyway.”\n“Want me to call your son for you? I mean, how long are you gonna wait before doing it yourself? You don’t have much time.”\n“Gee, thanks for the well-wishing.”\n“That’s our generation through and through, all of us about to die of pride.”\n“He’ll come. He’s my son. I believe in him.”\nI get in the wheelchair that’s been allocated to me for the last couple months. I roll myself out to the little garden-park. The Chinese Ash leaves grow luxuriantly. The decay of last winter gradually fades, giving way to a new, radiant aspect.\nEnviable, really.\nI’m still not used to the wheelchair. The caregiver told me to break on down slopes to curtail my speed, but I can’t recall where the break is. It seems her daily nagging isn’t useless after all. I should’ve paid more attention. Now I’m embarrassed and vexed by a mild slope, mild enough to be insignificant to a normally-abled person—a major obstacle in my life, like a medieval fortification.\n“Need my help?” you say.\n4B\nThis is the last time I’ll see you.\nI guide your wheelchair down the slope, toward a sea of flowers glowing with life.\nI’m sorry I haven’t visited lately. Determining that numerical range has been more complicated than we expected. We’ve been unable to clarify what sort of changes may affect the already-established future, and which will be insignificant. For instance, my assistant Jane didn’t buy the birthday gift her son asked for last year. We sent her back and she tried to rectify this. She returned to the present and sure enough the gift appeared, but not in her son’s bedroom. It was in the basement. So, “post-history” may overlay aspects of “original history.” Clearly this toy has been preserved in history, but it didn’t have much impact on the future. Her son had a favorite toy for a while, then tired of it. The toy changed nothing else.\nI fervently hope I can leave you with something on this visit, but I don’t know how to discern the possibilities. I’ll just have to go with the flow, let things take their course.\nIn fact, I’m not doing much—just keeping you company. It’s quite low-key. From noon until evening, we reminisce: the first time I skipped class and the principal scolded me, you helping me write a love letter to my first crush, me as the guest of honor at one of your book launches.\nStrange that I never realized just how colorful our past really was.\n“Don’t you need to be getting back?” you say.\n“No, I’m good. This is nice.”\n“Wonderful,” you say, clasping my hand.\nThis is the last time I’ll see you.\nAt two a.m. you will pass out. You’ll be taken to the hospital and admitted to the ICU. The call notifying me will ring mercilessly the next morning. Daisy will answer. With a pained expression she’ll tell me: “It’s Anna.”\nWe’ll reconcile temporarily, rush to the hospital. I’ll run three red lights. When I pay the ticket the following month, I’ll think of you and weep, bitterly and helplessly, in the middle of the clerk’s office. People will think I’m crying over a thousand-buck fine. I won’t be able to explain my grief to a bunch of strangers. I’ll just stand there crying, thinking of how Daisy and I stood in the hospital corridor.\nThe doctor coming out and expressing his condolences.\nI can return to the eve of your death, but I can’t change the fact of it.\n“Will you read my books?”\n“I do miss being your number-one fan.”\n“It’s like when you were growing up. You had to throw yourself into another woman’s arms. But that’s okay, Daisy’s a good girl.”\nThis is as far as I can go with you.\nWhen it’s time to say goodbye, you ask me to push you back inside. You take a book from your bedside table and hand it to me. “This is for you.”\nIt’s your novel Future War. You sent me a copy when it first came out. I shelved it with your other works left unread. I don’t tell you this, I just take the book.\n“Mom, I love you.” I lean down and hug you, like when I was a kid, and you would lean down to hug me.\n“I love you too,” you say.\n“No, I mean it,” I say. “I’m not just going through the motions here.”\nI can’t tell you everything that’s about to happen. The principle is limiting. Any behavior that might reveal time travel will trigger disconnection.\n“I know,” you say, smiling.\nI watch you fall asleep. There will be no more ripples in the lake of your life.\nAnd now I’m home.\nI haven’t been here for a while. The cold war between Daisy and I is ongoing. She will not budge from her position, and neither will I.\nI find the book on the shelf. I wish this was the one from your bedside table, still wrapped in plastic like an unsealed thought, and not the one you mailed me back in the day, the one I ignored. I wipe the dust from the jacket.\nI peruse it and find a Chinese Ash leaf pressed between pages. I’m stunned.\nSome things and feelings are so secret, but their vitality is preserved across time, permeating history.\nI sit down and start reading. I witness Tom’s death and Adriana’s subsequent choice. I’m struck, as if experiencing the accident myself. I knew through certain channels that my father died in a motorcycle accident, but I didn’t really know—not until now.\nYou never told me, worrying it would hurt me too much.\nSomething nags at me.\nI get on my iPad and hastily search the keywords “China,” “Hangzhou,” “foreigners,” but of course come up wanting. I change “foreigner” to “American,” then “American beauty.” An apt description, after all, and a common headline ploy. Still nothing. Thinking of Daisy’s sudden one-eighty, I add the keyword “child.”\nThe first link reads: “Two-year-old child falls into deepest part of West Lake, is rescued by American beauty.”\nI click on the link:\n“The famous West Lake of Hangzhou was anything but tranquil yesterday afternoon. A brisk wind swept across the water, stirring up sizeable swells. According to data from the Hangzhou Meteorological Observatory, the temperature in Hangzhou was around 6°C from 2 p.m. to 3 p.m . . . ”\n“ . . . Two-year-old Xianxian (pseudonym) came to West Lake with her mother to play. There is a railing near the ‘Three Pools Mirroring the Moon’ pagodas. She was climbing the railing and fell into the lake. A West Lake Cruise tour guide says the ‘Three Pools Mirroring the Moon’ area is the deepest in West Lake, with an average depth of nearly five meters . . . ”\n“ . . . the mother cried out for help . . . ”\n“ . . . no one offered a helping hand . . . ”\n“ . . . the situation was critical . . . ”\n“ . . . a beautiful foreign woman jumped in the water . . . ”\n“ . . . about five minutes later, the guard on duty also jumped in, and the two joined forces. They got the little girl out of the water. She was soaked through, her long hair dripping, her small lips purple with cold . . . ”\n“ . . . the foreign beauty gave the little girl first aid, attempting cardiac resuscitation and artificial respiration, but it was too late. A two-year-old flower withered while still budding. The foreign beauty is reportedly an American tourist and Chinese expert who studied Chinese history and culture. She cried during the interview, blaming herself for the child’s death.”\nI sit on the sofa, dumbfounded.\nIt dawns on me what a bastard I really am. If someone who really loves you keeps a secret from you, it must be to spare you pain. How did I never understand this simple, self-evident truth? Why did it cost two human lives to make me see?\nIt gets dark, but I don’t turn on the lights. I don’t know how long it’s been. A century? I hear the door open, her heels clicking on the floor. The light comes on. Daisy stands there looking exhausted, then shocked to see me.\n“You were just sitting here in the dark?”\nI don’t know what to say.\n“What’s wrong?”\nI get up, walk over to her, hug her tight, and say, “Let’s have a baby!”\n0\nI think every author writes her own experiences and thoughts into her fiction, in some fashion. I’m no different. I write science fiction, but some characters are based on people I know, especially in this novel.\nScience fiction as a genre of literature has always been event-oriented. In its development, and now more than ever, it relies on endless imagination to draw in readers, but in my new novel, I wanted to spark a particular discussion, a rather large kernel for the story: I wanted to explore the parent-child relationship. We’ve ignored this issue for a long time. It’s still a sci-fi novel, so I didn’t want to frame things in a sort of mundane present. Precisely because it’s sci-fi, I wanted to develop this issue more absolutely. That’s how the story came about. When it was finished, the reader I wanted most was my son. It contains the answers he’s been searching for, as well as some of my problems with him. I don’t quite know how he would react, but I know for sure he won’t read it. He’s a dyed-in-the-wool scientist. He sneers at the conjectures in my novels. I consider this my biggest failure as a science fiction writer, and a mother.\n—Excerpt from the preface to Future War\n0A\nWith a heavy expression, the doctor asked me: “Where is your family?”\n“I came by myself.”\n“We usually tell family members the results, so they can decide if you should be informed. I’m sorry, but the cancer has spread. But if you opt for chemotherapy—”\n“If I don’t, how long do I have?”\n“Anywhere from half a month to two years, maybe longer. There have been such cases. One patient who decided to forgo treatment lived ten years.”\n“Thanks for the comforting words, and the truth.”\nIt was the coldest news I heard that summer.\nI didn’t want to cause trouble for anyone, so naturally I didn’t tell you. I returned to the nursing home and lived as before, but the caregiver stumbled upon my news, somehow. I suppose she was bound to keep an eye on someone constantly fainting and having nosebleeds. She’s a nice person. I don’t know where she heard honey is effective against cancer, but she makes me drink a cup every night. By sheer luck, this cured the constipation that plagued me for years.\nI hate summer. I hate humid air, moldy food, and sticky skin after a sweat. I hate the accident that happened on a hot summer day—but I don’t hate memories. Some things fix him forever in the folds of time.\n0B\nThe experiment is a success.\nWe will make history, but we cannot change it.\nWhat has passed will always bear its original aspect. I yearn to share this news with you, but you’re no longer with me. You often said science fiction filled your writing with possibilities. You loved absolute, extreme perspectives that made hot hotter and cold colder. I want you to know you successfully influenced your son. You made me a scientist. When you were writing time travel novels, I was making time travel a reality. From now on, people will have to debate whether the subject of time travel can still be considered science fiction.\nThe only thing that gives me a headache is Daisy. She must be upset about something, but like you, she won’t tell me what happened. I can’t have children. Absolutely not. People don’t understand, but you should sympathize. Life is so precarious, a gauntlet of disease and accident. What if something happened to me and I missed my child’s life, like my father missed mine? A unique sadness, that, a child’s sadness: no one understands it better than me. People think my fear irrational, but if they experienced what I have, they’d understand. Someone tells you something and it’s just a story. Only through personal experience can you truly understand. There is no so-called empathy in this world—not really.\nI know the subtle sorrow of wanting to care for a parent who has already passed. I know what I’m talking about. When you were alive, I didn’t feel this way. When you were gone, it was too late. Regret was pointless. Like I said, it’s one thing to speak reasonably, quite another to practice what you preach.\nBut I’m lucky. Providence has given me the opportunity to make amends.\n“Have you decided where to go?” Jane asks me.\nI give the answer that was clear to me long before now: “Yes, I’m going to visit my mother.”\nAuthor’s Note:\nWriting this story, I emulated the structure of Ted Chiang’s “Division by Zero.” Anna and her husband’s storyline (including his identity, experience, and surgical details) was inspired by the article “Giving Birth After Death,” published on August 26, 2016 by the Science Squirrel Society website.\nOriginally published in Chinese in Tadpole Stave, June 16, 2020.\nTranslated and published in partnership with Storycom.\nWang Yuan has had nearly two million Chinese characters worth of fiction published, on platforms like Clarkesworld, Science Fiction World, Analog Science Fiction and Fact, Tadpole Stave, and elsewhere. He popularizes science in works such as Worlds Hidden in Science Fiction: The Book of N-Dimensional Space. His short stories are collected in the volume Painter of Stars.\nAndy Dudak is a writer and translator of science fiction. His original stories have appeared in Analog, Apex, Clarkesworld, Daily Science Fiction, Interzone, The Magazine of Fantasy and Science Fiction, Rich Horton’s Year’s Best, and elsewhere. He’s translated many stories for Clarkesworld, and a novel by Liu Cixin, among other things. In his spare time he likes to binge-watch peak television and eat Hui Muslim style cold sesame noodles.", "source": "https://clarkesworldmagazine.com/wang_12_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Other Stories by Wang Yuan, translated by Andy Dudak"}