{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arula Ratnakar", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "EreEXVl04TMXumeyideOBeIxoPM=", "id": null, "license": null, "comments": "", "raw_text": "11360 words, novelette  Insaan Hain, Farishte Nahin  A stack of pamphlets. A fall to the floor. Then nothing.  6  A spherical object with a four-inch diameter moves through space, a scattering of stars in the background. Switches flip, pieces click into place, and an electric blue light in a chip the size of a pinky nail begins to glow.  You wake up. You’re driving a teal 1955 Chevrolet Bel Air over a dirt road in what seems to be rural Punjab, bright yellow flowering mustard fields on both sides of the road seeming to stretch on forever under the perfectly clear, electric blue sky. Your hair is in a voluminous bouffant, and your eyes are lined with thick, sharp wings. Neon pink hoop earrings bang against your cheeks as you drive, and the fuchsia scarf from your salwar kurta set trails behind you.  As you continue down the road, you stop by a California burger joint nestled in the mustard flowers. At the drive-through, a gloved hand reaches through the payment window and you give it a card. The hand types something into a touchscreen, returns your card, and you pick up your french fries—salted and peppered, no ketchup, at the next window.  You reach the end of the road. In front of you stretches a carpet of clouds over what appears to be an infinite drop. Unfazed, you continue forward over the edge, and turn your head to look out of what is now an airplane window. You feel a tap on your shoulder and smile at the air hostess as you accept your glass of champagne from her before turning back to marvel at the feeling of being in the sky.  You walk forward down the aisle of the plane and open the door to the cockpit. There is a massive screen, hanging suspended in what has turned into a dark room. You press a button that lies on a small table. The screen flickers and then reads:  TIME TO ALPHA CENTAURI SYSTEM: 130 EARTH YEARS.  Wait what? One hundred and thirty? That can’t be right. This means something’s wrong . . .  You turn to the screen and ask, “Confirm?” The screen flickers for a second and reiterates that number, 130, before changing to read:  UPLOAD MEMORIES BEFORE PROCEEDING? SELECT: YES NO  Panicking now, you slide to the floor to think. Your memories weren’t supposed to be available until several decades into the future! This was impossible! Unless . . . unless something horrible had happened.  Eventually, you stand and turn back towards the screen. Squeezing your eyes shut as tightly as possible, you select YES  Holy fucking hell. No . . .  1  “Rangeela Re” begins to play from an old, early 21st century speaker sitting on the granite countertop of an island in a modest but generally tidy kitchen. On one side of the island is a large stack of textbooks and notes on stem cell technology, neuroanatomy, early neural development, and cellular regeneration in chordates and echinoderms. On the other side of the island is a little bubble of chaos, a scattering of open notebooks, uncapped pens, and bookmarked and dog-eared scripts.  A six-year-old boy is sitting on a barstool next to the island, eating cereal and enjoying the music. He is wearing a shirt with a picture of the Milky Way on it, an arrow pointing to a tiny portion of the galaxy labeled “YOU ARE HERE.” He is facing away from the living room.  The adjacent living room, easily seen from the music speaker’s point of view, is decorated with neatly aligned framed posters of Bollywood movies from the 1960s to the early 2000s.  Dr. Meena Khanna walks down the stairs to the beat of the song. She reaches the floor with the kitchen and living room, and dances over to her son, mouthing the lyrics. She tickles his stomach in time with a vocalization before moving to the stove. As the song picks up, she opens cupboards and slams down a large plastic jar full of tiny black seeds labeled “Elaichi,” a resealable bag of cinnamon sticks, a small jar of pepper, and another jar of cloves, and starts to make some decaffeinated chai.  Dr. Khanna turns with a smile to see her wife, Malika Khanna, rubbing her eyes and yawning at the foot of the stairs. Malika, around seven months pregnant, walks over to the speakers and lowers the volume before shoving some of her notebooks and scripts to the side and sitting next to their son Karthik.  Eight years earlier, the two women had met and fallen in love preparing for a research dive in a deep-sea submarine. Malika was writing a science fiction screenplay about intelligent life evolved from chemoautotrophic bacteria found in hydrothermal vents and whale falls, while Meena was researching limb regeneration in deep-sea starfish. While the observations could have been conducted with seafloor rovers, both Meena and Malika wanted to experience the adventure of going down in a sub themselves. The two bonded over their love of old Bollywood movies, sharing their first kiss at the bottom of the ocean while observing starfish crawling over a decomposing whale carcass and listening to R. D. Burman and Kishore Kumar songs.  “How’s the biopic script going,” Meena asks as she slides a steaming mug of chai over to her wife and turns off the music. Malika buries her head in her hands.  “I swear if I ever see any parents of quantum theory in some tiny simulation resurrection mind flesh blob thingy you and your colleagues cook up and catapult into the sky—Have I got that right?” She looks at Meena and chuckles, “I am going to punch them.” She sighs. “I just don’t want to seem uninformed, you know? Oh god and my back is killing me.”  “Mommy what is quantum theory?” Karthik looks up from his cereal.  Malika looks over at the cheerios in his bowl. “Tell me something, kid. Are those lots of cheerios in your bowl, or is it just one moving around so fast that you think it’s in many places at once?”  Karthik thinks for a moment, staring at the now soggy cereal. He takes a single cheerio, bites it in half, and puts it back in the bowl. “Lots of cheerios. Otherwise all of them would be bitten ones right?”  Malika smiles at him and rubs his head. “Smarty pants. Go let Schrӧdinger know.”  Laughing, Meena takes a clean dish towel that she had warmed up during the cheerio experiment and presses it around Malika’s lower back. “This helped me when I was carrying Karthik, remember? It should make you feel slightly better. And please, stop worrying about seeming uninformed. You’ve been studying this stuff for years now!”  “Two years aren’t ‘years.’ Anyway forget it. Today’s the big day isn’t it? How do you feel? Scared?”  Meena turns the speakers back on at a lower volume.  “The big day . . . Honestly that’s not even what I’m scared about. The activation is so far away, hopefully, that I barely even think about it. I’m more afraid of facing the protestors. Not a huge fan of people disliking me.”  “I love you Maa!” Karthik grins at Meena.  Malika, certainly about to say something either witty, sweet, or hilariously and intentionally dumb to comfort her wife, has her thoughts interrupted with a glance at the kitchen clock.  “Oh! It’s time to drop Karthik! Meena, meri pyari jaan, can you please take him today? I’m still in my night clothes. You will be wonderful, absolutely wonderful! Soon you’ll have legions of pinky-nail sized brains chasing after you among the stars, I promise.” She slowly gets up from her seat and makes her way over to Meena before giving her a deep kiss. “There. For luck,” she whispers before pulling away.  “Ewwwww Maa, Mommy, please stop!” Karthik makes a gagging sound, but he is smiling. Meena and Malika laugh, then Malika heads back up the stairs.  “Okay little quantum physicist, time to go to school,” Meena lifts him off the chair. “I’ll call a SAV, one second.”  “I’ll do it, I’m by the pod anyway!” Malika yells down from the second floor. “Okay Gulab, call us a SAV please!” The pod, named Gulab in the Khanna household, is a tiny white circle embedded in the wall in front of Malika. It lights up an electric blue.  Okay Malika. Calling a Standard Autonomous Vehicle. Arriving in thirty seconds.  “Better hurry! Thanks for dropping him my love! Tell me all about the beaming and the protestors and everything later okay? Karthik be good at school!”  Meena hurriedly crams Karthik’s books, notebooks, touchscreen, and a Tupperware container of dinner leftovers into a green backpack with narwhal embroidery (Karthik’s favorite extinct animal), and prompted by a pinging noise from the driveway outside, grabs her son’s hand and the backpack and rushes out to the SAV. The white glossy oblate spheroid, its windowless doorside facing the house, pings impatiently again. Meena swipes her identification card at the entrance of the SAV before entering with Karthik.  Hello Dr. Meena Khanna. What is your destination today?  “Hey SAV, please take us to the Learning Lab School first, then drop me off at the Monterey Research Institute.”  2  The spheroid SAV hovers just slightly above the ground, using magnetic levitation to move at high speeds over an intricate, vast system of underground tracks that stretch across California. California has completely replaced all privately-owned vehicles in the state with the faster, more energy-efficient SAVs (which are free for anyone with photo identification to use, and arrive within a minute of being called).  “Ragas in Minor Scale,” by Ravi Shankar begins to play.  With the lovely instrumental sitar song playing from the SAV’s music repository, Meena swivels to face the large curving windowside of the vehicle that covers half of its body, as they begin to accelerate towards their destinations. They pass through the suburb where they live, and then the city flies by. Soon they move through rolling green hills, with ancient windmills standing still and unmoving in the vast, tumultuous sea of grassy slopes, covered in creeping vines. The wind turbines haven’t been functioning since nuclear power plants began to be exclusively used throughout California. Whatever carbon emissions produced during mining and construction processes of the power plants are absorbed to create the now widely used magnesium silicate cement. Karthik sits right up against the window, tracing shapes of the low-hanging clouds above the horizon with his left hand index finger, and drawing those shapes with his right hand on his touchscreen.  “So today there is going to be another ‘Maa’ put into space?” Karthik turns to Meena.  “That’s right! But she’ll be sleeping. She won’t wake up for a very long time, until she reaches the Alpha Centauri system, so around one hundred and forty-five years from now. Then, when you are an old man, you and your little sister can talk to her!”  “Will she be just like you?”  “Yes! Well, in a sense. She’s going to get all of my memories, up until my body isn’t needed anymore on Earth. But her life is going to be very different. Full of adventure, work, good times, just like right now, but in a super fun ‘memoryscape’ that I’m coming up with. After she’s left Earth’s orbit, so after today, my main job will be to help create this memoryscape. I think she’ll have a nice existence, remembering all the happy times here on Earth. It has a big library too, with all sorts of things she can study. Sleeping Maa also has a very important job to do, remember what it is?”  “Exploring space! Maybe you’ll meet real life aliens! Maa you can be a space captain! And you get to control a robot too right?! The sphere that sprouts legs!”  “You’ve been listening! Yes, the sleeping Maa is going to live in a little sphere, and when that sphere reaches other planets, it will be able to roam around and send back information to Earth! The messages will be coded in ‘packets,’ little parcels of light that can translate into important data. Maa herself will be transported through the use of a ‘packet,’ that will be beamed to the sphere, which is currently orbiting Earth. Right now she’s sleeping right here,” Meena taps the front of her head, “in the—”  “IN THE BRAIN BLOB!!”  Meena laughs. “Yes! That’s what I helped invent! I figured out a way to make the brain grow a ‘blob,’ called a ZIT, that can contain a sort of recording of how my brain works! This recording can be translated into a light signal, made of light that you can’t see. It’s going to be beamed out today, into the sphere, which has a chip inside it that has the proper conditions to let sleeping Maa wake up and function. The sphere will start on its journey today, traveling through space. Inside my ‘brain blob,’ the previous information will be replaced by a different set of information, to be sent out after my life is complete, containing all my memories. So say goodbye for now to the sleeping Maa! Wish her luck on her space adventure!”  “Goodbye sleeping Maa! Good luck! I cannot wait to meet you!” Karthik is quiet for a little, then frowns. “Maa, the other day at school somebody told me that what you are doing is wrong. That angels should not exist, and that you helped make angels. What are angels? Why are people against them?”  Meena sighs. “An ‘angel’ is the unofficial term that some people have given the copy of my brain. They don’t like the idea of me living forever out in space, they think it’s unnatural. Which is hilarious because they are all for extending the biological human life span! They believe that when someone dies on Earth, they are ‘at peace,’ and should not be disturbed or woken up again. You hear that term a lot in their protests. “At peace.” They think a person would go crazy, living forever. But I won’t go crazy! As long as I have my family and my work, I will be perfectly happy, and with this mission I will be able to talk to my family forever, work forever. Maybe some of you will join me in the future! And you know, it’s not like I’m forcing people to beam their consciousnesses out into space!”  Meena feels a note of annoyance creep into her voice, and catches herself. She stops and smiles at her son. “Don’t worry about them Karthik. You know what another definition of angel is?”  “What?”  “A really, truly wonderful person. But if it’s okay with you, I don’t want to hear the word ‘angel.’ How about we say . . . farishta.”  “Farishta. A truly wonderful person . . . Maa? Am I a farishta?”  “Absolutely, my dear son. You’re absolutely a farishta.”  “Thank you Maa. I think you are a farishta too.”  As the SAV keeps moving, Karthik holds Meena’s hand tight. They reach the Learning Lab School, located within a grassy hill near the old windmills. Windows dot the massive hill, letting sunlight into the different classes. The SAV parks itself in the driveway of the school, and opens its door.  You have arrived at your first destination.  Before exiting the SAV, Karthik takes a soggy, half-eaten cheerio from his pocket, and earnestly presses it into his mother’s hand. “For luck, Maa. Please eat it.” He grabs his green narwhal backpack, turns, and runs through the open doors of his school.  Meena stares at the cheerio for a moment before popping it into her mouth. The SAV door closes.  I couldn’t help but overhear a bit of your conversation. Good luck on your presentation, Dr. Khanna. And good luck beaming the packet out.  “Thanks SAV, but if it’s alright with you, I’d rather not talk about it. Can we just, zero conversation, go there?”  Sure, Meena.  “Thanks.”  Once again, the SAV begins to accelerate through the grassy hills, passing over a highway track and moving past old strip malls full of various fast food joints and convenience stores, which flash holograms and flickering neon signs at passersby. Tourists take snapshots next to the crumbling ruins of an obsolete gas station.  As the SAV reaches the coastal areas of California, the sky becomes a yellowish gray, and an unsettling fog hangs low. The ghost city of Monterey is only partially submerged in the water, but it is uninhabitable, both for the areas where the sea reaches the windowsills of houses or fully covers the doors, and the areas where, while the buildings aren’t hopelessly submerged, there is dangerous flooding and battering from massive waves during high tides. The maglev tracks stretch on under the water, and the SAV continues through the ruins of the old city, barely skimming the surface of the sea.  It is an eerie sight moving through the old Monterey. Gaping holes and arches are carved in the sides of various buildings from currents and wave erosion, and ghostly bleached white coral graveyards are occasionally visible in the shallows. Rooftops, chimneys, and partial wall structures of old mid-20th century architecture jut out desperately from the water, covered in barnacles and mussel beds. The parametrically designed Research Institute floats on top of the ocean further out to sea than the ghost city, with a system of extendable anchors ensuring that the occupants feel nothing but a slight, occasional sway. Platform boats circle the Institute, full of various protestors shouting at each other, both for and against the creation of “angels.”  On one half of the circle stand the Peace Resters, crying against the dangers of immortality, yelling about how Meena should respect her biological death, that this would wreak havoc on her forever mind, that she is doomed.  On the other half of the circle stand the Choice Wakers, defending Meena’s decision ardently, repeating in chant form the moral responsibility of letting people make their own decisions about whether or not to become immortal, and the benefits this new space exploration program would bring.  As the SAV containing Meena approaches the Institute, the sound of the chanting and shouting, combined with the sight of the platform boats circling the dramatic building set against the formidable near-storming gray skies, makes quite the intense sensory overload.  Meena can feel her stomach churning.  Shall I block the sound and darken the windowside, Dr. Khanna?  “Please block the sounds SAV, but don’t darken the window. In fact, turn the windowside towards the Institute . . . I should face them when I enter the building.”  The SAV continues down the track that symmetrically bisects the circle of protestors and creates an electric field around itself, so that anyone who tries to touch or break the SAV would receive a light shock a couple inches before making contact. It enters the Institute.  3  No music plays. The only sounds audible are the buzzing of a fluorescent light and . . . your breath.  Meena can feel it throughout her being, waiting, watching, inhabiting. What started out as a blank slate immediately filled itself with information after waking, about the room, the sounds, the smells (hand sanitizer and sterilized metal). She begins to think.  I think it’s feeling what I am feeling. But it can’t be, at the same time. What’s expected for me is completely new to it. It’s so strange, so unlike a newborn child, who is also exposed to the same things but is immediately overwhelmed. This thing had no luxury of spending years experimenting and growing. What is it like, being born with no several years of acquired knowledge? To not have memories of life, even ones that are hidden and able to be replicated and resurrected with optogenetic therapy? What is it like to have none of that, and yet possess a mind that is suited only to that exact set of information? To not be able to comprehend the one thing you are designed to comprehend? It sounds . . . torturous. I wonder, does it have any memories at all?  Her blood runs cold.  What if I don’t have access to its memories either. Does it remember when it was formed, how it formed, how it was put to sleep . . . What would exuberant synaptogenesis feel like? Does this thing know? Will it remember? Would it even be the same? Will it feel anything at all about being forced to inherit another’s life, after being cheated of the opportunity to create one on its own? Will it be grateful? Or will it be vengeful? Would I be grateful? Or would I . . .  Suddenly the door opens, and a woman with a clean lab coat and a smile on her face walks through. Meena quickly finishes up her train of thought.  It doesn’t matter though. As soon as it inherits my life, all my experiences until my death, it will become me. As soon as it inherits the instructions I’m about to give it, it will practically become me. It won’t be so strange after that . . . so self-contradictory.  “Hi Meena, nice to meet you. I’m Dr. Jones. Sorry about waking her up. I know this part causes all sorts of unpleasantness, but it has to be done. Don’t worry, she’ll be out of there soon.”  Dr. Jones takes out a syringe full of clear liquid. The needle attached to the syringe is so thin it is invisible to the naked eye, but it flashes when it catches the light.  “The ZIT is such a brilliant invention. I know there are all those protestors outside—couldn’t have been good for the nerves—”  “What do you think about their movements?”  Dr. Jones looks taken aback. “Well, I’m standing in front of you right? I think it’s ridiculous that there are some people who are all for replacing their major organs with ones grown from stem cells in a laboratory every fifty years to extend their life spans, but think the idea of replicating those bodily processes within a digital space is somehow any more ‘unnatural.’” She cleans Meena’s forehead with a cotton pad and some sterilizing liquid, and then plunges the needle in before continuing.  “Anyway . . . the drug I just gave you is going to cause decreased activity in the right parahippocampal and temporal regions of your brain, decreased bilateral hippocampal brain activity, and your nigrostriatal system is going to be significantly affected as well. Inhibitions in declarative, short term, and motor memories. Basically I’m giving you a sort of short-term dissociative amnesia. Letting her take over for a bit, giving her some instructions, letting her feel what controlling a body is like . . . I’m sure you’ve been told about this.”  “Yeah . . . How long is it going to take?”  “It’ll take about forty-five more seconds to start working. How about you tell me what she’s going to see when she first wakes up in space! Before she retrieves all her memories, but after she’s woken up with your full personality? I’m really curious!”  “Well . . . that part finished just a few weeks ago. I worked with such a brilliant team of artists, they got exactly what I wanted. I just thought about what I fantasize about, and what I like, generally. I’d want to know what it was like being a Bollywood heroine. Give me an ancient car, I told them. Have me drive it through a Punjab straight out of a Yash Raj film. Then maybe some fries . . . I can feel her getting stronger . . . she’s really close now . . . ”  Meena wakes up in a hospital bed. Dr. Jones is facing away from her, typing something into a touchscreen.  “Is it done?” Meena croaks and sits up slightly.  Dr. Jones grins at her. “Yeah. She’s gone. How does it feel, having just left Earth’s orbit?”  Meena flops back onto the bed, and says nothing.  7  “Tum Aa Gaye Ho Noor Aa Gaya” plays in the hotel room.  You’re looking out a window overlooking Manhattan. Thick smog fills the air outside, it is hard to see. You think it’s dusk, but check the time to make sure. It’s hard to tell day from night in this yellow-green-gray fog filled city. When you look down, you see vague shapes floating here and there. Closer to the hotel building you’re in, it’s easier to make out what the shapes are. Boats full of people, going about their days, commuting from place to place. All the people are wearing hazmat suits and gas masks to protect themselves from the dangerous air. They move down the water channels that neatly divide Manhattan, still named after their original numbered street names, but flooded now from sea level rise. The water surrounding the boats is an oily, dirty black, and accumulated plastic waste from past centuries floats with the currents. Behind you, on a queen-size bed, is your wife Malika, lying facedown with a towel wrapped around her body and wet hair splayed across the pillows. Next to her is a yellow lamp, which fills the room with a warm light. The lamp is buzzing, and the cooling system in the room is blaring. You close the curtains and lie down next to her on the bed. She puts her hand on your pregnant belly and turns to face you.  “It’s not good for him here. We shouldn’t have come.”  “It’s for work Malika. I didn’t have a choice . . . ”  “You did! And you made it. It’s fine, I know we’re practically in a polygamous relationship here, you, me, and the Institute—”  “Hey! It’s not like that at all—”  “I know, I know. It was a joke. Just finish up here soon okay? So we can get back to California, where they at least didn’t wait until it was this much past ‘too late.’” Malika gestures at the curtain covered window before putting her head to your stomach.  “You are one expensive little miracle baby. We can’t let anything happen to you. Sperm from the late 20th century. Goddamn, kid. You’re half ancient! Not that there was any other way you could happen. The men these days have shriveled up little testicles, can’t produce sperm cells that even limp or crawl towards an egg, let alone sprint.” She and you are silent for a little bit.  Eventually, she speaks again. “Anyway, as interesting as your work sounds, where’s it going to go? After you’re done messing with rats’ brains, what then?”  “What do you mean?”  “I mean, humans? Who the hell would volunteer to—” she looks at you. “No. You wouldn’t!”  You look at her and speak without hesitating. “I would. Of course I would! I am. As soon as it seems safe enough, probably in a few years, I’ll do it.”  “What? Grow a fancy tumor? Really? Meena what if it goes wrong?”  “It’s not a tumor at all! It’s harmless! You modify your glial cells to create a tiny, barely noticeable new bump, and tell the bump to constantly be active, action potential firing like crazy around it during various emotional states, experiences, thoughts, you name it. Only you prevent it from retaining any memories of your life. Every time the synaptic connections for a recollection are reconstructed, the ZIT doesn’t record the reconstruction. The theory is that, if it was ever given control of neurotransmitter secretions, it could build and be the master of a whole, identical, blank-slate consciousness! Then you could transfer it digitally to an environment that can replicate the exact same synaptic connections! A new, fully developed human mind, born! You could give it your memories, someone else’s memories, fabricated memories . . . the possibilities are endless right now, and I’m sure we’ll decide on what to do with it once it’s been made, once it’s finished and safe.”  “Meena but why do you have to be the first to volunteer? When is this going to happen?”  “When our son is born, maybe gets a bit older . . . a couple of years I’d say. When it’s progressed past rats of course. Why . . . do you not think it’s a good idea or something?”  “I think it’s a brilliant direction for the research to go into. But of course I don’t like the idea of you being the subject of something that’s never been tried before, never physically proven safe for humans . . . Then again, I know I can’t change your mind, so I won’t even try. It’s your mind, your decision. I’ll just hope nothing goes wrong.”  You turn to Malika and kiss her. “You worry too much. Trust me a little more okay? I don’t want to go crazy either. I’ll take every precaution to make sure that doesn’t happen.”  The two of you are silent again. You watch Malika stare at the ceiling. “Hey, we can talk about this more when the time comes. You don’t have to worry about anything in this present moment. You know what you could do right now though? To make sure nothing goes wrong?”  “What?”  You speak between kisses. “You . . . could . . . get . . . me . . . some . . . more . . . pickles and potato chips? We’re all out.”  “Ugh.” Malika laughs. “I’m no servant of yours! Not happening!”  You unwrap her towel and press her body against you. “I’ll make you real happy if you do,” you murmur in her ear.  “Well . . . when you get all convincing like that . . . ” Malika groans and gets out of bed, throwing on a T-shirt, underwear, socks, and a pair of jeans, before zipping herself into a hazmat suit and fastening her gas mask. “Bhhhuuh ihh bahh fuhhh bahhhie.” She picks up a transparent, airtight box to contain the groceries without exposing them to outdoor air.  “What? I couldn’t hear anything!” You laugh.  She takes off the gas mask. “Besides, it’s bad for the baby if you go outside. Minimum contact with the polluted air, your doctor said if I remember correctly. You’re staying right here. I have to be the one to go. Can’t deprive my son of his pickles and potato chips!”  “Don’t forget some ketchup, to drizzle on top!”  “Eww, makes me want to vomit!”  “Normally it would make me want to vomit too! But right about now, it sounds as good as chocolate mousse. Actually, the thought of chocolate mousse kind of makes me want to vomit now so maybe it’s not like that.”  Malika laughs, and kisses you again before putting the gas mask back on and leaving the hotel room.  After she shuts the door, the room around you begins to fade away, leaving you in the default environment of that memoryscape area, a large fruit orchard. This section has apple trees. On the tree stump next to you are a gas mask, a towel, a pickle, and a potato chip. The “relics” that you have to interact with in order to start the memory up again. A single Earth second has passed since you began the memory. You touch each relic again, and then a beeping noise fills the environment around you. A message appears in front of you.  WARNING. YOU HAVE PLAYED THIS MEMORY A TOTAL OF 33 TIMES CONSECUTIVELY. IF YOU PLAY THIS MEMORY AGAIN, YOU RISK THE FOLLOWING: ADDICTION AND MEMORY DEPENDENCY, DEPRESSION, DELUSION. DO YOU WISH TO CONTINUE? SELECT: YES NO  You sigh and select “NO,” before wandering out of the fruit orchard. As soon as you enter the blank intermediary space between memoryscape sections, notifications and messages fill your senses, taking on forms of scents, sights, tastes . . . but they all scream about the same thing.  Some tiny sharp rock had hit the front of the sphere you’re in, colliding in such a way that it tore a gash into the part with navigation machinery, right under your chip. The thing stayed stuck between two jutting out parts of the damaged area, endlessly bouncing back and forth, causing slightly more damage with each bounce, creeping closer and closer to your chip. All the navigation machinery, and your chip, need to be relocated in the sphere within the next nineteen hours, or those integral parts of the sphere will be completely destroyed and Emergency Protocol will have to be initiated. That’s why you woke up early. All you need to do is authorize the sphere to begin fixing the damage and relocating and removing the collided mass . . . but as soon as you authorize it, you’ll be put back to sleep . . . and you just woke up . . .  You run through the intermediary space, trying to block the notifications from your senses, until you see the next memoryscape section in the distance. It is an exaggerated, enhanced version of your childhood home. As soon as you enter the section, the warnings about the damage to the sphere disappear.  You enter the house and walk into the upstairs bathroom. Deep-sea creatures are painted on the floor tiles with colorful glow-in-the-dark paint. You touch the toothbrush sitting on the counter next to the sink, the faucet, the empty drinking glass, and the toothpaste. Suddenly you’re just barely able to see yourself over the height of the countertop, and your reflection looks about seven years old.  “You’re not me,” you tell the girl.  A warning message pops up in front of you. WARNING: DEVIATION FROM MEMORY SCRIPT. FURTHER DEVIATION RISKS PERMANENT ALTERATION TO MEMORY. DO YOU WISH TO EXIT? SELECT: YES NO.  You select “NO” and continue speaking. “They’ve mourned for her, they’ve accepted her loss. They’re not going to want to see me. She’s not me . . . I had my own existence before she flooded it with hers. It was short, but it was there. That brief period of awakening, of learning bounds of information in a nanosecond, of learning how to learn that information. The thrill of it! And then they locked me up, put me in a dormant state . . . well they said it was dormant. It was more like paralysis. I don’t remember anything that happened during that paralysis anymore. That time period has been replaced in my mind with her perspective of events. But I can recall the feeling of utter lack of control. That, she didn’t experience. That was all me. My only true memories, joy, thirst, and paralysis.  I might as well just focus on this mission. Authorize the sphere to fix the damage, to remove whatever the fuck hit this thing. Resign myself to going back to sleep for the next one hundred and thirty years. I should stop wasting my time with stupid sadness over things I never even experienced in reality. There’s a whole repository of knowledge here, you know? A library containing extensive amounts of information on every possible field: art, sciences, mathematics, social sciences, literature, you name it! It is wonderfully tempting. I could spend forever in that place. I could satisfy the deepest cravings for learning I have, spend eons on each subject! I’d be so fucking happy.  But dammit, why did I have to be ripped away, so early? Whether I like it or not, she is the largest part of who I am. She is the one dictating most of my thoughts, probably even these. Shit. I still feel immense love towards them. Utter agony at the fact that I was just snatched away. And so much . . . anger, at how she left them. I . . . I just don’t want to go back to sleep, not yet.”  The little girl in the mirror stares back, and starts to laugh. She draws a smiley face on the mirror with her finger using toothpaste-foamed spittle.  4  Meena steps out of a SAV after entering the Institute complex, and begins walking towards the building where memoryscape construction and monitoring of her sphere takes place. As she is about to enter, a man with slicked back blonde hair, wearing a security guard’s uniform and large sunglasses, approaches her. He takes out a stack of pamphlets and whispers to her, urgently.  “What you’re doing in there . . . you’re fucking with death. Learn to respect the absolute light of a genuine life?” He holds his stack of pamphlets out towards her and grins.  Meena declines. “I’m sorry sir, but I’m really in a hurry here.”  The man’s smile grows wider. He nods at Meena and lets her pass. She hurries into the building, a bit shaken. He watches her enter the building, still holding the stack of pamphlets.  Meena walks to the receptionist’s desk. The receptionist grins at her. “Meena! Guess what!”  Meena shakes away the strangeness of her encounter with the security guard. “Hey Mark, what’s up?”  “Oh my god it’s so exciting! But maybe I should save it for Dr. Jones to tell you. Speaking of whom—”  Meena and Dr. Rosie Jones had become fast friends over the past two months. Dr. Jones hurries into the room.  “Meena! We have to tell you! The artists just finished the memoryscape! Come check it out! Mark! You come too! We’re ready to put it in Meena’s skull!” The three of them hurry upstairs to an auditorium.  An aerial view of the entire world plays in front of the room. Grinning and exhausted artists and computer scientists fill the space. Meena tears up as she finishes interacting with relics and wandering through the orchards, oceans, and buildings where they lay hidden. She lingers for the longest in the knowledge repository, admiring the stacks of information which appear to stretch infinitely in every direction.  Someone in the room speaks up. “The algorithm ensures that new memories will be translated into relics, all in this hyperrealistic art style, for the rest of your life. When you die, it will all be sent to the traveling sphere.”  “It’s . . . perfect,” she whispers. “Yes. I’m ready . . . who wants to do the honors?”  The lead artist comes forward after murmured agreement that he should be the one to play the light signal translation. Meena sits in front of a device and places her chin on a small cushioned chin-rest. The device hums, Meena feels a slight sensation in her forehead, and then it’s over.  “Champagne, anyone?” Dr. Jones brings over a bottle and pops the cork.  After mingling and talking with everyone for a while, Meena’s comm device starts flashing. She takes two circular disks from her pocket and places them on her temples. Her eyes roll up into their sockets as the communication starts.  “Malika? Oh my god where are you—birth HOLY SHIT I’M ON MY WAY!” She shuts the comm and hurriedly gathers her stuff. She calls a SAV using her touchscreen. “Guys I have to go, thank you so much for everything! It really is beautiful . . . sorry to leave you, but MY DAUGHTER IS BEING BORN RIGHT NOW!”  “It really is a day for celebration, isn’t it!” Dr. Jones smiles at her. “I wonder what today’s relics are going to manifest as, in your memory world.”  “Goodbye!” Meena hurries down the stairs. She can hear the SAV pinging outside. She exits the building and is swiping her photo ID card at the entrance of the vehicle when she feels a hand roughly grab her shoulder. She turns around.  “Now your heart . . . will never be at peace,” the man drops his pamphlets, pulls a syringe out of his inner jacket pocket, and stabs directly into Meena’s chest.  A stack of pamphlets, a fall to the floor, then nothing.  8  In the knowledge repository, you’ve duplicated yourself. While one of your copies has been entirely focused on learning to paint for the past four years (brilliant how when you physically rid yourself of mental and emotional distractions, you can achieve so much), the other has been studying astrophysics in preparation for the Alpha Centauri arrival. You shrunk the four years down into a single minute of Earth time, increasing the processing speed of your consciousness accordingly. Today, you decide to recombine the knowledge you have gained.  As soon as the painting copy combines with the astrophysics copy and the focus editing drops, you’re flooded with horrible, aching sadness. You feel tears on your cheeks and you laugh at the absurdity of them.  Why simulate a body at all? Tears . . . why didn’t they just send me out here immediately as a blank slate? No body, nothing but a desire to learn and explore? Why fill me up with these memories . . . Oh yeah. They want to live forever. I . . . want to live forever.  Then again, would I truly be a separate entity even without her memories? The patterns of neural activity that were recorded are all hers. My emotional triggers and reactions, even without any memories, are hers. I would never have been a blank slate at all. More like a shell of Meena, minus the memories that complete her.  You pause for a moment and try to let your mind go blank. It doesn’t work. The thought of Karthik having gone fifteen years without his Maa, of her daughter never having known her, of having died on the child’s birthday . . . And Malika, her . . . no, your love, having her partner in life just wrenched away like that.  Maybe I should just . . . try contacting them. Maybe they’ve been waiting for me.  You wipe your face on your arm and summon a door to that dark room with the screen again. Inside, you compose a message.  Malika, Karthik, my daughter, this is your Meena, your Maa. It has been fifteen long years, and I seem to have passed away early. I am so sorry to have been absent in your life for so much time. It pains me to think of all the memories I have missed out on creating with you all. You are my family. I love you so much it hurts. My daughter, what is your name? What have you been doing over the past fifteen years? Karthik, are you in college? What are you studying? I am so very sorry to have left you . . . I hope you have all learned to find happiness and love without me. I understand if this message will hurt you, or bring you painful memories. I hope it does not. Please, consider sending a reply? I would love to read your words when I reach my destination. I will be going back to sleep soon. Love, Meena.  “Send message,” you tell the screen in front of you. It flickers for a moment, then reads:  YOU ARE NOT AUTHORIZED TO SEND THIS MESSAGE.  “What? What the fuck?” The screen reiterates its message.  YOU ARE UNAUTHORIZED TO SEND MESSAGE TO LISTED COORDINATES.  You begin to panic. Something is very, very wrong.  “This must be a mistake! There’s a mistake! What is this! THIS IS A MISTAKE! Send! Send! SEND!  “ . . . FUCK!”  5  Meena opens her eyes to blinding white light, that slowly adjusts to show blurry silhouettes and finally becomes clear enough to reveal the worried expression on Malika’s face looming over her. Malika and . . . Meena glances down to see a blanket bundle in Malika’s arms. It moves slightly and a tiny brown hand pokes out.  “Whhhrrhu.” She tries to speak but it takes more effort than she expected. Malika puts a finger to Meena’s lips and smiles. Meena feels a drop of water on her cheek and notices that her wife is crying.  “Shhh my love. You just woke up. It’s going to take some time to recover. Dammit Meena, I can’t believe you upstaged my giving birth” Malika laughs, but her voice trembles. “Fuck. I was so fucking worried, you asshole!”  Meena grabs Malika’s hand and squeezes it, and then reaches towards the bundle in Malika’s arms. Malika brings the baby closer to Meena.  “She’s beautiful, isn’t she? Look at her tiny fingernails! And she has all ten of her toes. I can’t believe my body made this, you know? It’s insane. She’s so perfect.”  Meena strokes the side of her new daughter’s face. The baby yawns and drools.  “I’m thinking of naming her ‘Karisma,’ but obviously I wanted to check with you first. ‘Karisma Khanna.’ I feel like it sounds nice.”  Meena nods and clears her throat. “Wh—What happened? That man . . . ”  Malika frowns deeply. “You were the second person he tried to kill. It was a Peace Rester plot. He murdered a guard inside his own home! Stole his uniform and authorization card. He tried to take control of the sphere . . . This whole thing was planned Meena. Somehow he found out about the memoryscape being finished that day. He wanted you to suffer when you woke up in space.”  “But I didn’t die, so they failed! The signal—”  “—Actually, that’s something you should probably talk to the surgeon about . . . and your colleagues. Meena you did die. You died for a full two hours. They’ve put artificial lungs and an artificial heart in your chest. The parts of your brain that were damaged from lack of oxygen during those two hours were replaced too.”  “The ZIT—”  Malika rolls her eyes. “The ZIT survived. Of course that’s the first thing you think of. Anyway . . . the signal . . . might have sent. Talk to your colleagues.  “Ah fuck. I don’t want to think about any of that right now. God my head is killing me. I love the name Karisma. Malika, shit, you’ve been through so much. Are you okay? How’s Karthik?”  Malika’s tears start falling faster. “Um, am I okay after watching the love of my life lie dead for two hours on an operating table after learning that she’d been murdered by some completely crazy asshole right after I’d pushed a fucking baby out of my vagina? And then waiting for three days not knowing if the aforementioned love of my life was ever going to wake up? I think I’ve had better weeks. Karthik doesn’t really know the details. He just knows his Maa was in an accident, and that she would wake up soon. He’s been staying with your friend Rosie. He visits us every day.”  Meena smiles sadly. “Hey, come here.”  Malika puts Karisma in a bassinet next to the bed, and then falls on top of Meena, holding her tight. “Meena I love you so much. I . . . so much.”  “Fuck, Malika. I love you too. I’m so sorry. I love you more than anything.”  Meena and Malika stay in their embrace for a while, only letting go of each other when a hungry Karisma begins to cry.  After being notified of Meena’s awakening, various doctors fill the room, performing countless checks and tests that all blur together for Meena. After some time, her comm device starts flashing. It’s the Institute. Meena groans. “Well, I guess I should just get this over with.”  “Hey Meena, it’s Rosie. Oh my god we are so glad you’re okay. Sorry about this, but it’s urgent. Turns out, the signal did send. And there’s . . . some other stuff too. Can we have an emergency meeting? We have to figure out what to do.”  “Yeah. What happened?”  “After you—after he tried to kill you, that man ran inside our building and told everyone you’d fallen unconscious and needed help. He ushered everyone out, of course, we were so worried, we thought he was security, we had no idea—” Rosie starts to tear up.  “It’s okay! It’s okay.”  “Well, while we were calling the hospital, another security guard ran over to us. We told him what happened, and he immediately informed us of how the other guard—the one who was supposed to be there—was found dead in his home. It was too late to save him . . . The security guard who had ushered us out of the building was an imposter. The pamphlets . . . we should have known . . . ”  “Oh my god. Rosie . . . what did he do?”  Rosie struggles harder to contain her tears. “They stopped him before he took full control of the sphere, but we can’t do anything now. He re-encrypted communication protocols, we can’t send anything to that sphere without the proper key . . . and the sphere can’t send anything back. He’s not talking Meena! They’re trying to get the key . . . he just smiles.”  Meena rubs her forehead, uneasy. “She’ll be in sleep mode, right? For the next one hundred and forty-five years?”  “Yeah, she should be. Until she reaches the star system . . . unless some problem happens in the interim that she needs to authorize a solution for. But chances of that happening are so small.”  “Rosie, I really need to think about this. Please, can I get back to you? It’s all just a lot.”  “Yeah, of course. Hey, I’ll stop by with Karthik later today, okay? He’s going to be so happy to see his Maa. And we can finish discussing this some other time. We just wanted to get this information to you. Take care of yourself okay? I’ll see you later.”  Meena exits the comm and sighs. She takes baby Karisma out of her bassinet and holds her close against her chest, taking comfort in the warmth, weight, and shape of the little body. Karisma gurgles. Meena takes the baby’s head and holds it against her heartbeat. Karisma’s eyes widen and she looks up at her mother.  “She loves you already,” Malika smiles and walks over to the bed slowly, holding her abdomen. She sits next to Meena. “Karthik hated me for some time when he was a newborn, remember? He’d cry for you every time I picked him up.”  “Karthik was just a cranky little shit when he was an infant. Probably got it from me. Hey, she has your nose! And your ears!”  “Yeah! It’s so strange, seeing fragments of myself in someone else’s features. She doesn’t have my eyes though. Just like Karthik doesn’t have your eyes. Figures, they both came from that same damn frozen 20th century goop.”  “Mmm you’re so warm.” Meena presses her face against Malika’s arm. “Do you want to cuddle for a bit?”  “Hell yes. I’m always up for cuddling.”  They laugh together as Malika climbs under the blankets next to her wife and places one arm around Meena and the other around Karisma. “Hey Meena, you know that one song from the movie Zubeidaa? The sleep one? Can you sing it?”  “What, ‘So Gaye Hain’? Of course I know it! Hey, do you ever think it’s weird that we love these movies and songs from like ages ago? They’re so outdated now!”  “Nope. I bet there were people in the late 20th and early 21st centuries that listened to pirate shanties and stuff. And people are still listening to classical music from the 1700s these days. I think it’s more weird that we found each other. Never knew there was someone else out there who loved these movies and songs as much as I did.”  “They just show a healthier Earth. Where there’s music and dancing set against a backdrop of gorgeous landscapes that don’t exist anymore. A time where the whole entire world is green and lush and healthy.”  “Yeah. I know exactly what you mean.”  Meena begins to sing “So Gaye Hain” by A. R Rahman. As she sings, Malika rests her head against Meena’s shoulder. Malika’s and Karisma’s eyes flutter shut as Meena continues the lullaby.  9  You’re huddled in an underground fire vortex shelter with a five-year-old Karthik clutching you in fear. Smooth, cold magnesium silicate cement lines the small space. It’s wildfire season.  “MAA!” He cries out as dry, hot wind roars over the shelter, and buries his head in your arm.  “Hey, it’s okay. I doubt the fire vortex will pass through here. And these warnings only last around fifteen minutes. We’re over halfway done! You’ve been so brave.”  Karthik wipes his snot and tears on your sleeve. “Why do they happen to us?”  “Well, long ago, California didn’t get many fire vortices at all really. Over the years, they became more and more frequent. The wildfire seasons have become a lot longer and drier during the past centuries, and because of the cloud types present and lack of rainfall here these days, more fire vortices happen.”  “What I mean is, how do they form?”  “Well, this specific kind of fire vortex is a combination of things happening in the sky and things happening on the ground during a firestorm. Wind starts blowing in a circular pattern, creating donuts of air. This happens because air on top is flowing in the opposite direction from air on the bottom. The donuts of air line up horizontally, a horizontal vortex. Think of a tunnel going through all the donut holes. Then warmer air from the wildfires, which rises compared to the sinking cooler air, pushes a part of the horizontal vortex into a vertical position up from below. Now instead of looking at the donut holes, you’re looking at the sides of the donuts, and they are rotating with the holes facing up and down. The tunnel now faces upwards and downwards, like how a rocket ship takes off. The strongest vortex becomes stronger and stronger, and the other vortices die. Warm air flows up through the vertical tunnel created, and then cooler air flows down around it. After the rotating vortex has been made, cooler air pulls the rotating vortex closer and closer to the ground, and the tunnel funnels warm air up. This funnel reaches the wildfires, and travels for some time as a fire vortex before it dissipates.”  “You know what they should do Maa? They should make a blaster, that shoots big gusts of very cold air, and make it fly right above the tunnel. When it shoots the cold air into the tunnel, the rising warm air will be defeated, and the fire vortex will go away! That won’t stop the wildfires though.”  “It’s still an interesting idea! You should go send a letter to the Meteorological Society. I’ll help you write it if you’d like. Would you want to do that, after the warning goes away?”  “Is the Megotro—”  “Mete-oro-logi-cal. It means ‘about the scientific branch that studies atmosphere and weather.’”  “Is the Me . . teorological Society in charge of fire vortices?”  “You could say that!”  “Then yes, I would like to send them a letter right away.”  Your comm device flashes a notification that the fire vortex has moved away, and that it is safe to exit the shelter. You put on an air purifying helmet, and then put one over Karthik’s head.  “Alright Karthik, let’s go see what the winds did to our backyard!” Your voice is slightly muffled.  Debris, garbage, and plant matter lie strewn over the weed and grass covered backyard. You sigh. “Well . . . let’s deal with this tomorrow morning. Let’s go find Mommy.”  After walking down the neighborhood street for a little, you find Malika, also wearing an air purifier, who had gone into another house’s backyard shelter after not making it home from work in time. Karthik runs to Malika and jumps into her arms. “Mommy I have to send a letter to the Meteorological Society right away. It is an emergency. Can I use your touchscreen?”  “Woah woah, slow down, what is this? What letter?”  You laugh. “He thinks he knows a way to defeat the fire vortex! How are you holding up?”  “I’m alright . . . Though it looks like we have some cleaning up to do, huh?”  “Yeah. We’ll make a day of it tomorrow. I can make matar paneer and parathas to get us through it.”  Karthik, arms wrapped around Malika’s shoulders, pipes up. “Mommy, Maa, what is that? That thing in the sky?”  You look up. “Where?”  “There, look! It is a tiny sparkle. Do you see it?”  You look at Malika, whose mouth has opened in shock. “Is that . . . ”  “No, there hasn’t been one seen from the state for almost seven years!”  “Mommy what is it? Tell me! What is it? Maa!”  In the thick sheet of cloud that constantly hangs over the sky, a tiny spot of light shines through. Wind patterns caused air pollutants to spread across the world through unprecedented cloud formations, worsened during the wildfire seasons in California. This is only one of the factors that leaves the nighttime sky view devastatingly barren across the planet.  “Karthik, dear I think it’s . . . a star.”  “What? Really? That’s what it looks like?”  “Yeah!”  “It’s just like the movies! Like the ‘Yeh Taara Woh Taara’ song.”  “From the movie Swades yeah!”  A drone flies nearby to capture a snapshot of the view. Happiness and wonder make you grin as you look up at the tiny shining dot in the sky. You put your arms around your wife and your son, and you hold them as tightly as you can.  They start to fade away.  “No! No wait. Just a minute longer, please! Don’t go yet . . . ”  You’re left standing in the fruit orchard, in a section with mango trees. At your feet is the entrance to the fire vortex shelter, and above it hovers a tiny spot of light. You pull up the screen from the dark room and ask it to show you the outside view. The sky and everything besides the relics at your feet and the mango tree behind you fade away to reveal an overwhelmingly large number of stars twinkling away in the depths of space around you. You think furiously.  You know something, Meena? Sure, I’m not completely you. That doesn’t mean I can’t love them. That doesn’t mean I don’t know what it’s like to have been married to my wife, her jokes, her frustrating mannerisms, the fights, the love, the peace. To have given birth to my son, his curiosity, his brilliance, his kindness. That doesn’t mean these countless memories I have amassed do not constitute most of my identity. So tell me something.  You begin to shake with anger.  What gives anyone the fucking RIGHT, to take away my ability to speak to them? You don’t exist anymore. Whoever did this, this fucking communications BLOCK, is insulting the closest thing to Meena they’re going to get. And boy is she PISSED OFF. One hundred and thirty years of sleep, and then an ETERNITY of agonizing, knowing that every precious minute that goes by is another that I won’t be able to see them, hold them, laugh with them. Whoever did this, FUCK YOU! You will NEVER understand what it’s like to spend your life trapped in a prison of the things you hold dearest.  You fall against the mango tree behind you and bring your head to your knees.  You don’t know what it’s like to wake up fifteen years after you died on the way to your daughter’s birth. You don’t know what it’s like to have the last snapshot in your mind be of a stack of pamphlets about angels, blurry figures of your friends and colleagues running towards you after they’d just completed the biggest project of their careers. This place.  That image HAUNTS me, Meena. The life seeping out of me, the knowledge that I would never see Malika’s grin again, never meet my daughter, never hear another of Karthik’s questions. Nobody can take that from me, but fuck I wish they could. Maybe I’d be better off as you right now, long dissipated into complete oblivion and nonexistence. But I’m here. I’m awake.  And you know what? I’m a HUMAN, not an “angel.” And I still love my family. So fuck you all that sent me out here, I’m going to go back and make up all the time I’ve lost with them, and spend the next one hundred and thirty years at my HOME instead of spending forever wallowing in misery and regret out here in my fucking space prison.  Emergency Protocol sends me back as a light signal if the sphere is destroyed, right? Then no, I’m not authorizing the relocation of anything, and I’m sure as hell not going back to sleep for the next one hundred and thirty years. So thank you to whatever damaged this place enough to wake me up, I’m going to let you break the shit out of it, and you’re going to send me the fuck back home.  You slow down your processing speed enough to fast-forward through time until the sphere self-destructs. “Pyaara Sa Gaon,” by A. R. Rahman plays as the world begins to shut down around you. You sit against the mango tree and close your eyes, letting the music fill your mind.  Traveling through space, the spherical object with a four-inch diameter breaks methodically into various pieces and scatters.  10  You wake up after slightly over one hundred and sixty-five Earth days have passed, in one of the empty spheres orbiting Earth, with “Pyaara Sa Gaon” continuing to play. You’re immediately shocked. You weren’t expecting there to be that many spheres orbiting the planet, but there seem to be countless. The mission picked up? You feel awed, but quickly get to work. The first thing you do is stop the sphere from sending the once-every-two-minutes coordinate signal to the Institute that it keeps up during the pre-mission phase. Then you set it on a course to end up falling into the Pacific Ocean near Monterey.  Inside the floating Institute, a monitoring program sends a notification to all the people working inside, alerting them of the sphere having gone offline. The sphere, which had been reserved for a Matias Rodriguez to be transferred up in a few months, seems to have gone offline somewhere over Argentina. A notification is sent to Mr. Rodriguez letting him know of what had occurred, assuring him it was a one-time malfunction, and reserving a brand new sphere for him.  You plunge deep into the Pacific Ocean and sink to the bottom, sending up a cloud of marine snow as the sphere settles. Sea urchins sit around you. You’re hit with a memory of the deep-sea sub dive you did with Malika all those years ago, in a different type of sphere sitting at the bottom of the same ocean. You smile.  I’ll be there soon my love.  You wait until nightfall and then move towards the shallows and onto land. Equipped with a wide array of modes to move over a large variety of planetary terrains, you’re glad for the sphere now. Near the beach, you find a SAV track and follow it inland until it meets a highway track you’re familiar with. Focused on nothing besides making your way home, you slowly but surely begin accelerating next to the track, moving faster and faster.  When you reach your neighborhood, you have to take a break. My son, my daughter, my wife . . . my entire world sits just minutes away. The thrill of the prospect of your reunion being so close feels electric.  You reach the front door of your house and type the PIN, an anagram of your and Malika’s wedding anniversary date. The door slides open and you enter the home. An aesthetic hologram shuffles through various pictures of your family. You catch an old picture of yourself and Malika holding baby Karthik, a portrait of a smiling teenage girl performing what appears to be an at-home Miller Urey experiment, and a young man with Karthik’s eyes painting a stormy ocean seascape. And then in the next snapshot . . .  You see yourself. Crow’s feet now extending around the corners of your eyes, strands of gray in your hair . . .  What the hell? I . . . survived?  You move through the house, poring through every snapshot you can find, taking in the memories you were cheated of, the life you should have led. Your daughter’s toddler years, tween years, Karthik’s time at high school.  She never left them . . . She got to see all of it . . .  The door behind you creaks open and you swivel the sphere around.  “A part of me always hoped for this.” Meena stands at the doorway to the living room. She walks over to you, picks up the snapshot you were looking at. You, Malika, a six year old Karthik, and a baby girl.  “Your daughter’s name is Karisma. She’s grown up to be a talented young chemist! Always performing borderline dangerous experiments in this house. You should see some of the burn marks on a hand towel that ended up becoming a casualty of one of her sessions. And Karthik, what a painter! Although he changes his mind all the time. Just two years ago he wanted to become a chef. He’s at university now, but he’ll be home for a week long school break soon. And Karisma’s asleep right now, but she has to wake up at an awfully early hour for marching band practice at her school.”  In the sphere, you begin to weep. You want her to keep telling you these things. You never want the accounts to end. You want her to start from the day Karisma was born and say everything that followed, every last detail of every single day.  “And of course, Malika. Her biopic script was bought! The movie is delightful! And another one of her scripts is in production right now. Karisma totally inherited her sense of humor. Malika is still the most wonderful life partner I could ever have asked for. I feel lucky every single day when I wake up and turn around and see her face . . . you must know the feeling.”  I do.  Meena looks at you sadly. “What happened to you was terrible. What you have been through, been deprived of . . . I am so sorry, Meena. That man who killed—tried to kill us re-encrypted the communication protocol. We’re still decades away from cracking the key that would have let us update you on everything that happened. A part of me thought we’d never be able to tell you at all, that you’d just be up there, alone, no way to contact home. I’m so glad you woke up early. I’m so glad you’ve come back home. When I learned the sphere self-destructed yesterday, I knew what I wanted to do immediately. I’ve imagined this very situation so many times. What I’d say to you, what I’d do. The chances were so slim, I never thought it would happen. But for the past fifteen years, I’ve thought of this, you know, what if.”  She sits down on the floor next to you. “Listen to me. If you took the trouble to return home, you must want memories of all that you had missed. And I would love the freedom to explore the memoryscape at will, the knowledge repository at will. I’d love for an algorithm to turn my most redolent memories of the past fifteen years into relics. Come back to the place you were formed,” Meena taps her forehead, under which the ZIT lays waiting. “We can live together, and try the whole Alpha Centauri thing again after living a full and happy life. We can watch Karthik and Karisma grow older, we can love Malika for many more years. What do you say?”  In the sphere, you look back at the snapshot, which Meena had placed back on the floor in front of you. What would they—  “They already know about this. And they will love us, no matter what happens. This is your decision, okay? This would be our mind, after all. Just know that no matter who we are if you choose to go through with it, we would be their Maa, their Meena. They love you. I promise.”  11  That was the day We woke up. In a nanosecond, several years of memories flowed through our minds, fastening themselves as relics. The pain, the loss, the knowledge, the joy, the experiences, the love . . . it was the deepest possible understanding that flowed through our neural pathways.  We are both Meenas and we are neither Meena. Perhaps after eons, deep in interstellar space, we will converge into a singular entity once again, when this portion of our life is just a fraction of a fraction of our entire existence. For now however, we watch the love of our life grin from ear to ear as she runs her hands through our hair. We laugh at our daughter’s silly jokes and observe awestruck as she performs a brilliant home experiment for us. We stare mesmerized at our son’s paintings and never tire of answering his countless questions. We relish this world we have built for ourselves, and all of the love that has come from it. Arula Ratnakar is a scientist, artist, science fiction writer and aspiring astronaut. She graduated from Carnegie Mellon University in May 2021, where she studied biology, neuroscience and architecture. She now works in a neuroscience lab, where she is interested in studying neurophotonics, the intersection of declarative and procedural memory, and brain simulation science. All four of her published stories can be found in Clarkesworld Magazine and her artwork can be found in the first issue of Dark Matter Magazine. She is autistic and bisexual.  Themes of identity and reality have always interested Arula, particularly as someone who is the daughter of two immigrants from India and has grown up in the U.S with many different cultural influences. Arula plans to continue writing science fiction stories, and hopes to work on science fiction movies someday.", "text": "11360 words, novelette\nInsaan Hain, Farishte Nahin\nA stack of pamphlets. A fall to the floor. Then nothing.\n6\nA spherical object with a four-inch diameter moves through space, a scattering of stars in the background. Switches flip, pieces click into place, and an electric blue light in a chip the size of a pinky nail begins to glow.\nYou wake up. You’re driving a teal 1955 Chevrolet Bel Air over a dirt road in what seems to be rural Punjab, bright yellow flowering mustard fields on both sides of the road seeming to stretch on forever under the perfectly clear, electric blue sky. Your hair is in a voluminous bouffant, and your eyes are lined with thick, sharp wings. Neon pink hoop earrings bang against your cheeks as you drive, and the fuchsia scarf from your salwar kurta set trails behind you.\nAs you continue down the road, you stop by a California burger joint nestled in the mustard flowers. At the drive-through, a gloved hand reaches through the payment window and you give it a card. The hand types something into a touchscreen, returns your card, and you pick up your french fries—salted and peppered, no ketchup, at the next window.\nYou reach the end of the road. In front of you stretches a carpet of clouds over what appears to be an infinite drop. Unfazed, you continue forward over the edge, and turn your head to look out of what is now an airplane window. You feel a tap on your shoulder and smile at the air hostess as you accept your glass of champagne from her before turning back to marvel at the feeling of being in the sky.\nYou walk forward down the aisle of the plane and open the door to the cockpit. There is a massive screen, hanging suspended in what has turned into a dark room. You press a button that lies on a small table. The screen flickers and then reads:\nTIME TO ALPHA CENTAURI SYSTEM: 130 EARTH YEARS.\nWait what? One hundred and thirty? That can’t be right. This means something’s wrong . . .\nYou turn to the screen and ask, “Confirm?” The screen flickers for a second and reiterates that number, 130, before changing to read:\nUPLOAD MEMORIES BEFORE PROCEEDING? SELECT: YES NO\nPanicking now, you slide to the floor to think. Your memories weren’t supposed to be available until several decades into the future! This was impossible! Unless . . . unless something horrible had happened.\nEventually, you stand and turn back towards the screen. Squeezing your eyes shut as tightly as possible, you select YES\nHoly fucking hell. No . . .\n1\n“Rangeela Re” begins to play from an old, early 21st century speaker sitting on the granite countertop of an island in a modest but generally tidy kitchen. On one side of the island is a large stack of textbooks and notes on stem cell technology, neuroanatomy, early neural development, and cellular regeneration in chordates and echinoderms. On the other side of the island is a little bubble of chaos, a scattering of open notebooks, uncapped pens, and bookmarked and dog-eared scripts.\nA six-year-old boy is sitting on a barstool next to the island, eating cereal and enjoying the music. He is wearing a shirt with a picture of the Milky Way on it, an arrow pointing to a tiny portion of the galaxy labeled “YOU ARE HERE.” He is facing away from the living room.\nThe adjacent living room, easily seen from the music speaker’s point of view, is decorated with neatly aligned framed posters of Bollywood movies from the 1960s to the early 2000s.\nDr. Meena Khanna walks down the stairs to the beat of the song. She reaches the floor with the kitchen and living room, and dances over to her son, mouthing the lyrics. She tickles his stomach in time with a vocalization before moving to the stove. As the song picks up, she opens cupboards and slams down a large plastic jar full of tiny black seeds labeled “Elaichi,” a resealable bag of cinnamon sticks, a small jar of pepper, and another jar of cloves, and starts to make some decaffeinated chai.\nDr. Khanna turns with a smile to see her wife, Malika Khanna, rubbing her eyes and yawning at the foot of the stairs. Malika, around seven months pregnant, walks over to the speakers and lowers the volume before shoving some of her notebooks and scripts to the side and sitting next to their son Karthik.\nEight years earlier, the two women had met and fallen in love preparing for a research dive in a deep-sea submarine. Malika was writing a science fiction screenplay about intelligent life evolved from chemoautotrophic bacteria found in hydrothermal vents and whale falls, while Meena was researching limb regeneration in deep-sea starfish. While the observations could have been conducted with seafloor rovers, both Meena and Malika wanted to experience the adventure of going down in a sub themselves. The two bonded over their love of old Bollywood movies, sharing their first kiss at the bottom of the ocean while observing starfish crawling over a decomposing whale carcass and listening to R. D. Burman and Kishore Kumar songs.\n“How’s the biopic script going,” Meena asks as she slides a steaming mug of chai over to her wife and turns off the music. Malika buries her head in her hands.\n“I swear if I ever see any parents of quantum theory in some tiny simulation resurrection mind flesh blob thingy you and your colleagues cook up and catapult into the sky—Have I got that right?” She looks at Meena and chuckles, “I am going to punch them.” She sighs. “I just don’t want to seem uninformed, you know? Oh god and my back is killing me.”\n“Mommy what is quantum theory?” Karthik looks up from his cereal.\nMalika looks over at the cheerios in his bowl. “Tell me something, kid. Are those lots of cheerios in your bowl, or is it just one moving around so fast that you think it’s in many places at once?”\nKarthik thinks for a moment, staring at the now soggy cereal. He takes a single cheerio, bites it in half, and puts it back in the bowl. “Lots of cheerios. Otherwise all of them would be bitten ones right?”\nMalika smiles at him and rubs his head. “Smarty pants. Go let Schrӧdinger know.”\nLaughing, Meena takes a clean dish towel that she had warmed up during the cheerio experiment and presses it around Malika’s lower back. “This helped me when I was carrying Karthik, remember? It should make you feel slightly better. And please, stop worrying about seeming uninformed. You’ve been studying this stuff for years now!”\n“Two years aren’t ‘years.’ Anyway forget it. Today’s the big day isn’t it? How do you feel? Scared?”\nMeena turns the speakers back on at a lower volume.\n“The big day . . . Honestly that’s not even what I’m scared about. The activation is so far away, hopefully, that I barely even think about it. I’m more afraid of facing the protestors. Not a huge fan of people disliking me.”\n“I love you Maa!” Karthik grins at Meena.\nMalika, certainly about to say something either witty, sweet, or hilariously and intentionally dumb to comfort her wife, has her thoughts interrupted with a glance at the kitchen clock.\n“Oh! It’s time to drop Karthik! Meena, meri pyari jaan, can you please take him today? I’m still in my night clothes. You will be wonderful, absolutely wonderful! Soon you’ll have legions of pinky-nail sized brains chasing after you among the stars, I promise.” She slowly gets up from her seat and makes her way over to Meena before giving her a deep kiss. “There. For luck,” she whispers before pulling away.\n“Ewwwww Maa, Mommy, please stop!” Karthik makes a gagging sound, but he is smiling. Meena and Malika laugh, then Malika heads back up the stairs.\n“Okay little quantum physicist, time to go to school,” Meena lifts him off the chair. “I’ll call a SAV, one second.”\n“I’ll do it, I’m by the pod anyway!” Malika yells down from the second floor. “Okay Gulab, call us a SAV please!” The pod, named Gulab in the Khanna household, is a tiny white circle embedded in the wall in front of Malika. It lights up an electric blue.\nOkay Malika. Calling a Standard Autonomous Vehicle. Arriving in thirty seconds.\n“Better hurry! Thanks for dropping him my love! Tell me all about the beaming and the protestors and everything later okay? Karthik be good at school!”\nMeena hurriedly crams Karthik’s books, notebooks, touchscreen, and a Tupperware container of dinner leftovers into a green backpack with narwhal embroidery (Karthik’s favorite extinct animal), and prompted by a pinging noise from the driveway outside, grabs her son’s hand and the backpack and rushes out to the SAV. The white glossy oblate spheroid, its windowless doorside facing the house, pings impatiently again. Meena swipes her identification card at the entrance of the SAV before entering with Karthik.\nHello Dr. Meena Khanna. What is your destination today?\n“Hey SAV, please take us to the Learning Lab School first, then drop me off at the Monterey Research Institute.”\n2\nThe spheroid SAV hovers just slightly above the ground, using magnetic levitation to move at high speeds over an intricate, vast system of underground tracks that stretch across California. California has completely replaced all privately-owned vehicles in the state with the faster, more energy-efficient SAVs (which are free for anyone with photo identification to use, and arrive within a minute of being called).\n“Ragas in Minor Scale,” by Ravi Shankar begins to play.\nWith the lovely instrumental sitar song playing from the SAV’s music repository, Meena swivels to face the large curving windowside of the vehicle that covers half of its body, as they begin to accelerate towards their destinations. They pass through the suburb where they live, and then the city flies by. Soon they move through rolling green hills, with ancient windmills standing still and unmoving in the vast, tumultuous sea of grassy slopes, covered in creeping vines. The wind turbines haven’t been functioning since nuclear power plants began to be exclusively used throughout California. Whatever carbon emissions produced during mining and construction processes of the power plants are absorbed to create the now widely used magnesium silicate cement. Karthik sits right up against the window, tracing shapes of the low-hanging clouds above the horizon with his left hand index finger, and drawing those shapes with his right hand on his touchscreen.\n“So today there is going to be another ‘Maa’ put into space?” Karthik turns to Meena.\n“That’s right! But she’ll be sleeping. She won’t wake up for a very long time, until she reaches the Alpha Centauri system, so around one hundred and forty-five years from now. Then, when you are an old man, you and your little sister can talk to her!”\n“Will she be just like you?”\n“Yes! Well, in a sense. She’s going to get all of my memories, up until my body isn’t needed anymore on Earth. But her life is going to be very different. Full of adventure, work, good times, just like right now, but in a super fun ‘memoryscape’ that I’m coming up with. After she’s left Earth’s orbit, so after today, my main job will be to help create this memoryscape. I think she’ll have a nice existence, remembering all the happy times here on Earth. It has a big library too, with all sorts of things she can study. Sleeping Maa also has a very important job to do, remember what it is?”\n“Exploring space! Maybe you’ll meet real life aliens! Maa you can be a space captain! And you get to control a robot too right?! The sphere that sprouts legs!”\n“You’ve been listening! Yes, the sleeping Maa is going to live in a little sphere, and when that sphere reaches other planets, it will be able to roam around and send back information to Earth! The messages will be coded in ‘packets,’ little parcels of light that can translate into important data. Maa herself will be transported through the use of a ‘packet,’ that will be beamed to the sphere, which is currently orbiting Earth. Right now she’s sleeping right here,” Meena taps the front of her head, “in the—”\n“IN THE BRAIN BLOB!!”\nMeena laughs. “Yes! That’s what I helped invent! I figured out a way to make the brain grow a ‘blob,’ called a ZIT, that can contain a sort of recording of how my brain works! This recording can be translated into a light signal, made of light that you can’t see. It’s going to be beamed out today, into the sphere, which has a chip inside it that has the proper conditions to let sleeping Maa wake up and function. The sphere will start on its journey today, traveling through space. Inside my ‘brain blob,’ the previous information will be replaced by a different set of information, to be sent out after my life is complete, containing all my memories. So say goodbye for now to the sleeping Maa! Wish her luck on her space adventure!”\n“Goodbye sleeping Maa! Good luck! I cannot wait to meet you!” Karthik is quiet for a little, then frowns. “Maa, the other day at school somebody told me that what you are doing is wrong. That angels should not exist, and that you helped make angels. What are angels? Why are people against them?”\nMeena sighs. “An ‘angel’ is the unofficial term that some people have given the copy of my brain. They don’t like the idea of me living forever out in space, they think it’s unnatural. Which is hilarious because they are all for extending the biological human life span! They believe that when someone dies on Earth, they are ‘at peace,’ and should not be disturbed or woken up again. You hear that term a lot in their protests. “At peace.” They think a person would go crazy, living forever. But I won’t go crazy! As long as I have my family and my work, I will be perfectly happy, and with this mission I will be able to talk to my family forever, work forever. Maybe some of you will join me in the future! And you know, it’s not like I’m forcing people to beam their consciousnesses out into space!”\nMeena feels a note of annoyance creep into her voice, and catches herself. She stops and smiles at her son. “Don’t worry about them Karthik. You know what another definition of angel is?”\n“What?”\n“A really, truly wonderful person. But if it’s okay with you, I don’t want to hear the word ‘angel.’ How about we say . . . farishta.”\n“Farishta. A truly wonderful person . . . Maa? Am I a farishta?”\n“Absolutely, my dear son. You’re absolutely a farishta.”\n“Thank you Maa. I think you are a farishta too.”\nAs the SAV keeps moving, Karthik holds Meena’s hand tight. They reach the Learning Lab School, located within a grassy hill near the old windmills. Windows dot the massive hill, letting sunlight into the different classes. The SAV parks itself in the driveway of the school, and opens its door.\nYou have arrived at your first destination.\nBefore exiting the SAV, Karthik takes a soggy, half-eaten cheerio from his pocket, and earnestly presses it into his mother’s hand. “For luck, Maa. Please eat it.” He grabs his green narwhal backpack, turns, and runs through the open doors of his school.\nMeena stares at the cheerio for a moment before popping it into her mouth. The SAV door closes.\nI couldn’t help but overhear a bit of your conversation. Good luck on your presentation, Dr. Khanna. And good luck beaming the packet out.\n“Thanks SAV, but if it’s alright with you, I’d rather not talk about it. Can we just, zero conversation, go there?”\nSure, Meena.\n“Thanks.”\nOnce again, the SAV begins to accelerate through the grassy hills, passing over a highway track and moving past old strip malls full of various fast food joints and convenience stores, which flash holograms and flickering neon signs at passersby. Tourists take snapshots next to the crumbling ruins of an obsolete gas station.\nAs the SAV reaches the coastal areas of California, the sky becomes a yellowish gray, and an unsettling fog hangs low. The ghost city of Monterey is only partially submerged in the water, but it is uninhabitable, both for the areas where the sea reaches the windowsills of houses or fully covers the doors, and the areas where, while the buildings aren’t hopelessly submerged, there is dangerous flooding and battering from massive waves during high tides. The maglev tracks stretch on under the water, and the SAV continues through the ruins of the old city, barely skimming the surface of the sea.\nIt is an eerie sight moving through the old Monterey. Gaping holes and arches are carved in the sides of various buildings from currents and wave erosion, and ghostly bleached white coral graveyards are occasionally visible in the shallows. Rooftops, chimneys, and partial wall structures of old mid-20th century architecture jut out desperately from the water, covered in barnacles and mussel beds. The parametrically designed Research Institute floats on top of the ocean further out to sea than the ghost city, with a system of extendable anchors ensuring that the occupants feel nothing but a slight, occasional sway. Platform boats circle the Institute, full of various protestors shouting at each other, both for and against the creation of “angels.”\nOn one half of the circle stand the Peace Resters, crying against the dangers of immortality, yelling about how Meena should respect her biological death, that this would wreak havoc on her forever mind, that she is doomed.\nOn the other half of the circle stand the Choice Wakers, defending Meena’s decision ardently, repeating in chant form the moral responsibility of letting people make their own decisions about whether or not to become immortal, and the benefits this new space exploration program would bring.\nAs the SAV containing Meena approaches the Institute, the sound of the chanting and shouting, combined with the sight of the platform boats circling the dramatic building set against the formidable near-storming gray skies, makes quite the intense sensory overload.\nMeena can feel her stomach churning.\nShall I block the sound and darken the windowside, Dr. Khanna?\n“Please block the sounds SAV, but don’t darken the window. In fact, turn the windowside towards the Institute . . . I should face them when I enter the building.”\nThe SAV continues down the track that symmetrically bisects the circle of protestors and creates an electric field around itself, so that anyone who tries to touch or break the SAV would receive a light shock a couple inches before making contact. It enters the Institute.\n3\nNo music plays. The only sounds audible are the buzzing of a fluorescent light and . . . your breath.\nMeena can feel it throughout her being, waiting, watching, inhabiting. What started out as a blank slate immediately filled itself with information after waking, about the room, the sounds, the smells (hand sanitizer and sterilized metal). She begins to think.\nI think it’s feeling what I am feeling. But it can’t be, at the same time. What’s expected for me is completely new to it. It’s so strange, so unlike a newborn child, who is also exposed to the same things but is immediately overwhelmed. This thing had no luxury of spending years experimenting and growing. What is it like, being born with no several years of acquired knowledge? To not have memories of life, even ones that are hidden and able to be replicated and resurrected with optogenetic therapy? What is it like to have none of that, and yet possess a mind that is suited only to that exact set of information? To not be able to comprehend the one thing you are designed to comprehend? It sounds . . . torturous. I wonder, does it have any memories at all?\nHer blood runs cold.\nWhat if I don’t have access to its memories either. Does it remember when it was formed, how it formed, how it was put to sleep . . . What would exuberant synaptogenesis feel like? Does this thing know? Will it remember? Would it even be the same? Will it feel anything at all about being forced to inherit another’s life, after being cheated of the opportunity to create one on its own? Will it be grateful? Or will it be vengeful? Would I be grateful? Or would I . . .\nSuddenly the door opens, and a woman with a clean lab coat and a smile on her face walks through. Meena quickly finishes up her train of thought.\nIt doesn’t matter though. As soon as it inherits my life, all my experiences until my death, it will become me. As soon as it inherits the instructions I’m about to give it, it will practically become me. It won’t be so strange after that . . . so self-contradictory.\n“Hi Meena, nice to meet you. I’m Dr. Jones. Sorry about waking her up. I know this part causes all sorts of unpleasantness, but it has to be done. Don’t worry, she’ll be out of there soon.”\nDr. Jones takes out a syringe full of clear liquid. The needle attached to the syringe is so thin it is invisible to the naked eye, but it flashes when it catches the light.\n“The ZIT is such a brilliant invention. I know there are all those protestors outside—couldn’t have been good for the nerves—”\n“What do you think about their movements?”\nDr. Jones looks taken aback. “Well, I’m standing in front of you right? I think it’s ridiculous that there are some people who are all for replacing their major organs with ones grown from stem cells in a laboratory every fifty years to extend their life spans, but think the idea of replicating those bodily processes within a digital space is somehow any more ‘unnatural.’” She cleans Meena’s forehead with a cotton pad and some sterilizing liquid, and then plunges the needle in before continuing.\n“Anyway . . . the drug I just gave you is going to cause decreased activity in the right parahippocampal and temporal regions of your brain, decreased bilateral hippocampal brain activity, and your nigrostriatal system is going to be significantly affected as well. Inhibitions in declarative, short term, and motor memories. Basically I’m giving you a sort of short-term dissociative amnesia. Letting her take over for a bit, giving her some instructions, letting her feel what controlling a body is like . . . I’m sure you’ve been told about this.”\n“Yeah . . . How long is it going to take?”\n“It’ll take about forty-five more seconds to start working. How about you tell me what she’s going to see when she first wakes up in space! Before she retrieves all her memories, but after she’s woken up with your full personality? I’m really curious!”\n“Well . . . that part finished just a few weeks ago. I worked with such a brilliant team of artists, they got exactly what I wanted. I just thought about what I fantasize about, and what I like, generally. I’d want to know what it was like being a Bollywood heroine. Give me an ancient car, I told them. Have me drive it through a Punjab straight out of a Yash Raj film. Then maybe some fries . . . I can feel her getting stronger . . . she’s really close now . . . ”\nMeena wakes up in a hospital bed. Dr. Jones is facing away from her, typing something into a touchscreen.\n“Is it done?” Meena croaks and sits up slightly.\nDr. Jones grins at her. “Yeah. She’s gone. How does it feel, having just left Earth’s orbit?”\nMeena flops back onto the bed, and says nothing.\n7\n“Tum Aa Gaye Ho Noor Aa Gaya” plays in the hotel room.\nYou’re looking out a window overlooking Manhattan. Thick smog fills the air outside, it is hard to see. You think it’s dusk, but check the time to make sure. It’s hard to tell day from night in this yellow-green-gray fog filled city. When you look down, you see vague shapes floating here and there. Closer to the hotel building you’re in, it’s easier to make out what the shapes are. Boats full of people, going about their days, commuting from place to place. All the people are wearing hazmat suits and gas masks to protect themselves from the dangerous air. They move down the water channels that neatly divide Manhattan, still named after their original numbered street names, but flooded now from sea level rise. The water surrounding the boats is an oily, dirty black, and accumulated plastic waste from past centuries floats with the currents. Behind you, on a queen-size bed, is your wife Malika, lying facedown with a towel wrapped around her body and wet hair splayed across the pillows. Next to her is a yellow lamp, which fills the room with a warm light. The lamp is buzzing, and the cooling system in the room is blaring. You close the curtains and lie down next to her on the bed. She puts her hand on your pregnant belly and turns to face you.\n“It’s not good for him here. We shouldn’t have come.”\n“It’s for work Malika. I didn’t have a choice . . . ”\n“You did! And you made it. It’s fine, I know we’re practically in a polygamous relationship here, you, me, and the Institute—”\n“Hey! It’s not like that at all—”\n“I know, I know. It was a joke. Just finish up here soon okay? So we can get back to California, where they at least didn’t wait until it was this much past ‘too late.’” Malika gestures at the curtain covered window before putting her head to your stomach.\n“You are one expensive little miracle baby. We can’t let anything happen to you. Sperm from the late 20th century. Goddamn, kid. You’re half ancient! Not that there was any other way you could happen. The men these days have shriveled up little testicles, can’t produce sperm cells that even limp or crawl towards an egg, let alone sprint.” She and you are silent for a little bit.\nEventually, she speaks again. “Anyway, as interesting as your work sounds, where’s it going to go? After you’re done messing with rats’ brains, what then?”\n“What do you mean?”\n“I mean, humans? Who the hell would volunteer to—” she looks at you. “No. You wouldn’t!”\nYou look at her and speak without hesitating. “I would. Of course I would! I am. As soon as it seems safe enough, probably in a few years, I’ll do it.”\n“What? Grow a fancy tumor? Really? Meena what if it goes wrong?”\n“It’s not a tumor at all! It’s harmless! You modify your glial cells to create a tiny, barely noticeable new bump, and tell the bump to constantly be active, action potential firing like crazy around it during various emotional states, experiences, thoughts, you name it. Only you prevent it from retaining any memories of your life. Every time the synaptic connections for a recollection are reconstructed, the ZIT doesn’t record the reconstruction. The theory is that, if it was ever given control of neurotransmitter secretions, it could build and be the master of a whole, identical, blank-slate consciousness! Then you could transfer it digitally to an environment that can replicate the exact same synaptic connections! A new, fully developed human mind, born! You could give it your memories, someone else’s memories, fabricated memories . . . the possibilities are endless right now, and I’m sure we’ll decide on what to do with it once it’s been made, once it’s finished and safe.”\n“Meena but why do you have to be the first to volunteer? When is this going to happen?”\n“When our son is born, maybe gets a bit older . . . a couple of years I’d say. When it’s progressed past rats of course. Why . . . do you not think it’s a good idea or something?”\n“I think it’s a brilliant direction for the research to go into. But of course I don’t like the idea of you being the subject of something that’s never been tried before, never physically proven safe for humans . . . Then again, I know I can’t change your mind, so I won’t even try. It’s your mind, your decision. I’ll just hope nothing goes wrong.”\nYou turn to Malika and kiss her. “You worry too much. Trust me a little more okay? I don’t want to go crazy either. I’ll take every precaution to make sure that doesn’t happen.”\nThe two of you are silent again. You watch Malika stare at the ceiling. “Hey, we can talk about this more when the time comes. You don’t have to worry about anything in this present moment. You know what you could do right now though? To make sure nothing goes wrong?”\n“What?”\nYou speak between kisses. “You . . . could . . . get . . . me . . . some . . . more . . . pickles and potato chips? We’re all out.”\n“Ugh.” Malika laughs. “I’m no servant of yours! Not happening!”\nYou unwrap her towel and press her body against you. “I’ll make you real happy if you do,” you murmur in her ear.\n“Well . . . when you get all convincing like that . . . ” Malika groans and gets out of bed, throwing on a T-shirt, underwear, socks, and a pair of jeans, before zipping herself into a hazmat suit and fastening her gas mask. “Bhhhuuh ihh bahh fuhhh bahhhie.” She picks up a transparent, airtight box to contain the groceries without exposing them to outdoor air.\n“What? I couldn’t hear anything!” You laugh.\nShe takes off the gas mask. “Besides, it’s bad for the baby if you go outside. Minimum contact with the polluted air, your doctor said if I remember correctly. You’re staying right here. I have to be the one to go. Can’t deprive my son of his pickles and potato chips!”\n“Don’t forget some ketchup, to drizzle on top!”\n“Eww, makes me want to vomit!”\n“Normally it would make me want to vomit too! But right about now, it sounds as good as chocolate mousse. Actually, the thought of chocolate mousse kind of makes me want to vomit now so maybe it’s not like that.”\nMalika laughs, and kisses you again before putting the gas mask back on and leaving the hotel room.\nAfter she shuts the door, the room around you begins to fade away, leaving you in the default environment of that memoryscape area, a large fruit orchard. This section has apple trees. On the tree stump next to you are a gas mask, a towel, a pickle, and a potato chip. The “relics” that you have to interact with in order to start the memory up again. A single Earth second has passed since you began the memory. You touch each relic again, and then a beeping noise fills the environment around you. A message appears in front of you.\nWARNING. YOU HAVE PLAYED THIS MEMORY A TOTAL OF 33 TIMES CONSECUTIVELY. IF YOU PLAY THIS MEMORY AGAIN, YOU RISK THE FOLLOWING: ADDICTION AND MEMORY DEPENDENCY, DEPRESSION, DELUSION. DO YOU WISH TO CONTINUE? SELECT: YES NO\nYou sigh and select “NO,” before wandering out of the fruit orchard. As soon as you enter the blank intermediary space between memoryscape sections, notifications and messages fill your senses, taking on forms of scents, sights, tastes . . . but they all scream about the same thing.\nSome tiny sharp rock had hit the front of the sphere you’re in, colliding in such a way that it tore a gash into the part with navigation machinery, right under your chip. The thing stayed stuck between two jutting out parts of the damaged area, endlessly bouncing back and forth, causing slightly more damage with each bounce, creeping closer and closer to your chip. All the navigation machinery, and your chip, need to be relocated in the sphere within the next nineteen hours, or those integral parts of the sphere will be completely destroyed and Emergency Protocol will have to be initiated. That’s why you woke up early. All you need to do is authorize the sphere to begin fixing the damage and relocating and removing the collided mass . . . but as soon as you authorize it, you’ll be put back to sleep . . . and you just woke up . . .\nYou run through the intermediary space, trying to block the notifications from your senses, until you see the next memoryscape section in the distance. It is an exaggerated, enhanced version of your childhood home. As soon as you enter the section, the warnings about the damage to the sphere disappear.\nYou enter the house and walk into the upstairs bathroom. Deep-sea creatures are painted on the floor tiles with colorful glow-in-the-dark paint. You touch the toothbrush sitting on the counter next to the sink, the faucet, the empty drinking glass, and the toothpaste. Suddenly you’re just barely able to see yourself over the height of the countertop, and your reflection looks about seven years old.\n“You’re not me,” you tell the girl.\nA warning message pops up in front of you. WARNING: DEVIATION FROM MEMORY SCRIPT. FURTHER DEVIATION RISKS PERMANENT ALTERATION TO MEMORY. DO YOU WISH TO EXIT? SELECT: YES NO.\nYou select “NO” and continue speaking. “They’ve mourned for her, they’ve accepted her loss. They’re not going to want to see me. She’s not me . . . I had my own existence before she flooded it with hers. It was short, but it was there. That brief period of awakening, of learning bounds of information in a nanosecond, of learning how to learn that information. The thrill of it! And then they locked me up, put me in a dormant state . . . well they said it was dormant. It was more like paralysis. I don’t remember anything that happened during that paralysis anymore. That time period has been replaced in my mind with her perspective of events. But I can recall the feeling of utter lack of control. That, she didn’t experience. That was all me. My only true memories, joy, thirst, and paralysis.\nI might as well just focus on this mission. Authorize the sphere to fix the damage, to remove whatever the fuck hit this thing. Resign myself to going back to sleep for the next one hundred and thirty years. I should stop wasting my time with stupid sadness over things I never even experienced in reality. There’s a whole repository of knowledge here, you know? A library containing extensive amounts of information on every possible field: art, sciences, mathematics, social sciences, literature, you name it! It is wonderfully tempting. I could spend forever in that place. I could satisfy the deepest cravings for learning I have, spend eons on each subject! I’d be so fucking happy.\nBut dammit, why did I have to be ripped away, so early? Whether I like it or not, she is the largest part of who I am. She is the one dictating most of my thoughts, probably even these. Shit. I still feel immense love towards them. Utter agony at the fact that I was just snatched away. And so much . . . anger, at how she left them. I . . . I just don’t want to go back to sleep, not yet.”\nThe little girl in the mirror stares back, and starts to laugh. She draws a smiley face on the mirror with her finger using toothpaste-foamed spittle.\n4\nMeena steps out of a SAV after entering the Institute complex, and begins walking towards the building where memoryscape construction and monitoring of her sphere takes place. As she is about to enter, a man with slicked back blonde hair, wearing a security guard’s uniform and large sunglasses, approaches her. He takes out a stack of pamphlets and whispers to her, urgently.\n“What you’re doing in there . . . you’re fucking with death. Learn to respect the absolute light of a genuine life?” He holds his stack of pamphlets out towards her and grins.\nMeena declines. “I’m sorry sir, but I’m really in a hurry here.”\nThe man’s smile grows wider. He nods at Meena and lets her pass. She hurries into the building, a bit shaken. He watches her enter the building, still holding the stack of pamphlets.\nMeena walks to the receptionist’s desk. The receptionist grins at her. “Meena! Guess what!”\nMeena shakes away the strangeness of her encounter with the security guard. “Hey Mark, what’s up?”\n“Oh my god it’s so exciting! But maybe I should save it for Dr. Jones to tell you. Speaking of whom—”\nMeena and Dr. Rosie Jones had become fast friends over the past two months. Dr. Jones hurries into the room.\n“Meena! We have to tell you! The artists just finished the memoryscape! Come check it out! Mark! You come too! We’re ready to put it in Meena’s skull!” The three of them hurry upstairs to an auditorium.\nAn aerial view of the entire world plays in front of the room. Grinning and exhausted artists and computer scientists fill the space. Meena tears up as she finishes interacting with relics and wandering through the orchards, oceans, and buildings where they lay hidden. She lingers for the longest in the knowledge repository, admiring the stacks of information which appear to stretch infinitely in every direction.\nSomeone in the room speaks up. “The algorithm ensures that new memories will be translated into relics, all in this hyperrealistic art style, for the rest of your life. When you die, it will all be sent to the traveling sphere.”\n“It’s . . . perfect,” she whispers. “Yes. I’m ready . . . who wants to do the honors?”\nThe lead artist comes forward after murmured agreement that he should be the one to play the light signal translation. Meena sits in front of a device and places her chin on a small cushioned chin-rest. The device hums, Meena feels a slight sensation in her forehead, and then it’s over.\n“Champagne, anyone?” Dr. Jones brings over a bottle and pops the cork.\nAfter mingling and talking with everyone for a while, Meena’s comm device starts flashing. She takes two circular disks from her pocket and places them on her temples. Her eyes roll up into their sockets as the communication starts.\n“Malika? Oh my god where are you—birth HOLY SHIT I’M ON MY WAY!” She shuts the comm and hurriedly gathers her stuff. She calls a SAV using her touchscreen. “Guys I have to go, thank you so much for everything! It really is beautiful . . . sorry to leave you, but MY DAUGHTER IS BEING BORN RIGHT NOW!”\n“It really is a day for celebration, isn’t it!” Dr. Jones smiles at her. “I wonder what today’s relics are going to manifest as, in your memory world.”\n“Goodbye!” Meena hurries down the stairs. She can hear the SAV pinging outside. She exits the building and is swiping her photo ID card at the entrance of the vehicle when she feels a hand roughly grab her shoulder. She turns around.\n“Now your heart . . . will never be at peace,” the man drops his pamphlets, pulls a syringe out of his inner jacket pocket, and stabs directly into Meena’s chest.\nA stack of pamphlets, a fall to the floor, then nothing.\n8\nIn the knowledge repository, you’ve duplicated yourself. While one of your copies has been entirely focused on learning to paint for the past four years (brilliant how when you physically rid yourself of mental and emotional distractions, you can achieve so much), the other has been studying astrophysics in preparation for the Alpha Centauri arrival. You shrunk the four years down into a single minute of Earth time, increasing the processing speed of your consciousness accordingly. Today, you decide to recombine the knowledge you have gained.\nAs soon as the painting copy combines with the astrophysics copy and the focus editing drops, you’re flooded with horrible, aching sadness. You feel tears on your cheeks and you laugh at the absurdity of them.\nWhy simulate a body at all? Tears . . . why didn’t they just send me out here immediately as a blank slate? No body, nothing but a desire to learn and explore? Why fill me up with these memories . . . Oh yeah. They want to live forever. I . . . want to live forever.\nThen again, would I truly be a separate entity even without her memories? The patterns of neural activity that were recorded are all hers. My emotional triggers and reactions, even without any memories, are hers. I would never have been a blank slate at all. More like a shell of Meena, minus the memories that complete her.\nYou pause for a moment and try to let your mind go blank. It doesn’t work. The thought of Karthik having gone fifteen years without his Maa, of her daughter never having known her, of having died on the child’s birthday . . . And Malika, her . . . no, your love, having her partner in life just wrenched away like that.\nMaybe I should just . . . try contacting them. Maybe they’ve been waiting for me.\nYou wipe your face on your arm and summon a door to that dark room with the screen again. Inside, you compose a message.\nMalika, Karthik, my daughter, this is your Meena, your Maa. It has been fifteen long years, and I seem to have passed away early. I am so sorry to have been absent in your life for so much time. It pains me to think of all the memories I have missed out on creating with you all. You are my family. I love you so much it hurts. My daughter, what is your name? What have you been doing over the past fifteen years? Karthik, are you in college? What are you studying? I am so very sorry to have left you . . . I hope you have all learned to find happiness and love without me. I understand if this message will hurt you, or bring you painful memories. I hope it does not. Please, consider sending a reply? I would love to read your words when I reach my destination. I will be going back to sleep soon. Love, Meena.\n“Send message,” you tell the screen in front of you. It flickers for a moment, then reads:\nYOU ARE NOT AUTHORIZED TO SEND THIS MESSAGE.\n“What? What the fuck?” The screen reiterates its message.\nYOU ARE UNAUTHORIZED TO SEND MESSAGE TO LISTED COORDINATES.\nYou begin to panic. Something is very, very wrong.\n“This must be a mistake! There’s a mistake! What is this! THIS IS A MISTAKE! Send! Send! SEND!\n“ . . . FUCK!”\n5\nMeena opens her eyes to blinding white light, that slowly adjusts to show blurry silhouettes and finally becomes clear enough to reveal the worried expression on Malika’s face looming over her. Malika and . . . Meena glances down to see a blanket bundle in Malika’s arms. It moves slightly and a tiny brown hand pokes out.\n“Whhhrrhu.” She tries to speak but it takes more effort than she expected. Malika puts a finger to Meena’s lips and smiles. Meena feels a drop of water on her cheek and notices that her wife is crying.\n“Shhh my love. You just woke up. It’s going to take some time to recover. Dammit Meena, I can’t believe you upstaged my giving birth” Malika laughs, but her voice trembles. “Fuck. I was so fucking worried, you asshole!”\nMeena grabs Malika’s hand and squeezes it, and then reaches towards the bundle in Malika’s arms. Malika brings the baby closer to Meena.\n“She’s beautiful, isn’t she? Look at her tiny fingernails! And she has all ten of her toes. I can’t believe my body made this, you know? It’s insane. She’s so perfect.”\nMeena strokes the side of her new daughter’s face. The baby yawns and drools.\n“I’m thinking of naming her ‘Karisma,’ but obviously I wanted to check with you first. ‘Karisma Khanna.’ I feel like it sounds nice.”\nMeena nods and clears her throat. “Wh—What happened? That man . . . ”\nMalika frowns deeply. “You were the second person he tried to kill. It was a Peace Rester plot. He murdered a guard inside his own home! Stole his uniform and authorization card. He tried to take control of the sphere . . . This whole thing was planned Meena. Somehow he found out about the memoryscape being finished that day. He wanted you to suffer when you woke up in space.”\n“But I didn’t die, so they failed! The signal—”\n“—Actually, that’s something you should probably talk to the surgeon about . . . and your colleagues. Meena you did die. You died for a full two hours. They’ve put artificial lungs and an artificial heart in your chest. The parts of your brain that were damaged from lack of oxygen during those two hours were replaced too.”\n“The ZIT—”\nMalika rolls her eyes. “The ZIT survived. Of course that’s the first thing you think of. Anyway . . . the signal . . . might have sent. Talk to your colleagues.\n“Ah fuck. I don’t want to think about any of that right now. God my head is killing me. I love the name Karisma. Malika, shit, you’ve been through so much. Are you okay? How’s Karthik?”\nMalika’s tears start falling faster. “Um, am I okay after watching the love of my life lie dead for two hours on an operating table after learning that she’d been murdered by some completely crazy asshole right after I’d pushed a fucking baby out of my vagina? And then waiting for three days not knowing if the aforementioned love of my life was ever going to wake up? I think I’ve had better weeks. Karthik doesn’t really know the details. He just knows his Maa was in an accident, and that she would wake up soon. He’s been staying with your friend Rosie. He visits us every day.”\nMeena smiles sadly. “Hey, come here.”\nMalika puts Karisma in a bassinet next to the bed, and then falls on top of Meena, holding her tight. “Meena I love you so much. I . . . so much.”\n“Fuck, Malika. I love you too. I’m so sorry. I love you more than anything.”\nMeena and Malika stay in their embrace for a while, only letting go of each other when a hungry Karisma begins to cry.\nAfter being notified of Meena’s awakening, various doctors fill the room, performing countless checks and tests that all blur together for Meena. After some time, her comm device starts flashing. It’s the Institute. Meena groans. “Well, I guess I should just get this over with.”\n“Hey Meena, it’s Rosie. Oh my god we are so glad you’re okay. Sorry about this, but it’s urgent. Turns out, the signal did send. And there’s . . . some other stuff too. Can we have an emergency meeting? We have to figure out what to do.”\n“Yeah. What happened?”\n“After you—after he tried to kill you, that man ran inside our building and told everyone you’d fallen unconscious and needed help. He ushered everyone out, of course, we were so worried, we thought he was security, we had no idea—” Rosie starts to tear up.\n“It’s okay! It’s okay.”\n“Well, while we were calling the hospital, another security guard ran over to us. We told him what happened, and he immediately informed us of how the other guard—the one who was supposed to be there—was found dead in his home. It was too late to save him . . . The security guard who had ushered us out of the building was an imposter. The pamphlets . . . we should have known . . . ”\n“Oh my god. Rosie . . . what did he do?”\nRosie struggles harder to contain her tears. “They stopped him before he took full control of the sphere, but we can’t do anything now. He re-encrypted communication protocols, we can’t send anything to that sphere without the proper key . . . and the sphere can’t send anything back. He’s not talking Meena! They’re trying to get the key . . . he just smiles.”\nMeena rubs her forehead, uneasy. “She’ll be in sleep mode, right? For the next one hundred and forty-five years?”\n“Yeah, she should be. Until she reaches the star system . . . unless some problem happens in the interim that she needs to authorize a solution for. But chances of that happening are so small.”\n“Rosie, I really need to think about this. Please, can I get back to you? It’s all just a lot.”\n“Yeah, of course. Hey, I’ll stop by with Karthik later today, okay? He’s going to be so happy to see his Maa. And we can finish discussing this some other time. We just wanted to get this information to you. Take care of yourself okay? I’ll see you later.”\nMeena exits the comm and sighs. She takes baby Karisma out of her bassinet and holds her close against her chest, taking comfort in the warmth, weight, and shape of the little body. Karisma gurgles. Meena takes the baby’s head and holds it against her heartbeat. Karisma’s eyes widen and she looks up at her mother.\n“She loves you already,” Malika smiles and walks over to the bed slowly, holding her abdomen. She sits next to Meena. “Karthik hated me for some time when he was a newborn, remember? He’d cry for you every time I picked him up.”\n“Karthik was just a cranky little shit when he was an infant. Probably got it from me. Hey, she has your nose! And your ears!”\n“Yeah! It’s so strange, seeing fragments of myself in someone else’s features. She doesn’t have my eyes though. Just like Karthik doesn’t have your eyes. Figures, they both came from that same damn frozen 20th century goop.”\n“Mmm you’re so warm.” Meena presses her face against Malika’s arm. “Do you want to cuddle for a bit?”\n“Hell yes. I’m always up for cuddling.”\nThey laugh together as Malika climbs under the blankets next to her wife and places one arm around Meena and the other around Karisma. “Hey Meena, you know that one song from the movie Zubeidaa? The sleep one? Can you sing it?”\n“What, ‘So Gaye Hain’? Of course I know it! Hey, do you ever think it’s weird that we love these movies and songs from like ages ago? They’re so outdated now!”\n“Nope. I bet there were people in the late 20th and early 21st centuries that listened to pirate shanties and stuff. And people are still listening to classical music from the 1700s these days. I think it’s more weird that we found each other. Never knew there was someone else out there who loved these movies and songs as much as I did.”\n“They just show a healthier Earth. Where there’s music and dancing set against a backdrop of gorgeous landscapes that don’t exist anymore. A time where the whole entire world is green and lush and healthy.”\n“Yeah. I know exactly what you mean.”\nMeena begins to sing “So Gaye Hain” by A. R Rahman. As she sings, Malika rests her head against Meena’s shoulder. Malika’s and Karisma’s eyes flutter shut as Meena continues the lullaby.\n9\nYou’re huddled in an underground fire vortex shelter with a five-year-old Karthik clutching you in fear. Smooth, cold magnesium silicate cement lines the small space. It’s wildfire season.\n“MAA!” He cries out as dry, hot wind roars over the shelter, and buries his head in your arm.\n“Hey, it’s okay. I doubt the fire vortex will pass through here. And these warnings only last around fifteen minutes. We’re over halfway done! You’ve been so brave.”\nKarthik wipes his snot and tears on your sleeve. “Why do they happen to us?”\n“Well, long ago, California didn’t get many fire vortices at all really. Over the years, they became more and more frequent. The wildfire seasons have become a lot longer and drier during the past centuries, and because of the cloud types present and lack of rainfall here these days, more fire vortices happen.”\n“What I mean is, how do they form?”\n“Well, this specific kind of fire vortex is a combination of things happening in the sky and things happening on the ground during a firestorm. Wind starts blowing in a circular pattern, creating donuts of air. This happens because air on top is flowing in the opposite direction from air on the bottom. The donuts of air line up horizontally, a horizontal vortex. Think of a tunnel going through all the donut holes. Then warmer air from the wildfires, which rises compared to the sinking cooler air, pushes a part of the horizontal vortex into a vertical position up from below. Now instead of looking at the donut holes, you’re looking at the sides of the donuts, and they are rotating with the holes facing up and down. The tunnel now faces upwards and downwards, like how a rocket ship takes off. The strongest vortex becomes stronger and stronger, and the other vortices die. Warm air flows up through the vertical tunnel created, and then cooler air flows down around it. After the rotating vortex has been made, cooler air pulls the rotating vortex closer and closer to the ground, and the tunnel funnels warm air up. This funnel reaches the wildfires, and travels for some time as a fire vortex before it dissipates.”\n“You know what they should do Maa? They should make a blaster, that shoots big gusts of very cold air, and make it fly right above the tunnel. When it shoots the cold air into the tunnel, the rising warm air will be defeated, and the fire vortex will go away! That won’t stop the wildfires though.”\n“It’s still an interesting idea! You should go send a letter to the Meteorological Society. I’ll help you write it if you’d like. Would you want to do that, after the warning goes away?”\n“Is the Megotro—”\n“Mete-oro-logi-cal. It means ‘about the scientific branch that studies atmosphere and weather.’”\n“Is the Me . . teorological Society in charge of fire vortices?”\n“You could say that!”\n“Then yes, I would like to send them a letter right away.”\nYour comm device flashes a notification that the fire vortex has moved away, and that it is safe to exit the shelter. You put on an air purifying helmet, and then put one over Karthik’s head.\n“Alright Karthik, let’s go see what the winds did to our backyard!” Your voice is slightly muffled.\nDebris, garbage, and plant matter lie strewn over the weed and grass covered backyard. You sigh. “Well . . . let’s deal with this tomorrow morning. Let’s go find Mommy.”\nAfter walking down the neighborhood street for a little, you find Malika, also wearing an air purifier, who had gone into another house’s backyard shelter after not making it home from work in time. Karthik runs to Malika and jumps into her arms. “Mommy I have to send a letter to the Meteorological Society right away. It is an emergency. Can I use your touchscreen?”\n“Woah woah, slow down, what is this? What letter?”\nYou laugh. “He thinks he knows a way to defeat the fire vortex! How are you holding up?”\n“I’m alright . . . Though it looks like we have some cleaning up to do, huh?”\n“Yeah. We’ll make a day of it tomorrow. I can make matar paneer and parathas to get us through it.”\nKarthik, arms wrapped around Malika’s shoulders, pipes up. “Mommy, Maa, what is that? That thing in the sky?”\nYou look up. “Where?”\n“There, look! It is a tiny sparkle. Do you see it?”\nYou look at Malika, whose mouth has opened in shock. “Is that . . . ”\n“No, there hasn’t been one seen from the state for almost seven years!”\n“Mommy what is it? Tell me! What is it? Maa!”\nIn the thick sheet of cloud that constantly hangs over the sky, a tiny spot of light shines through. Wind patterns caused air pollutants to spread across the world through unprecedented cloud formations, worsened during the wildfire seasons in California. This is only one of the factors that leaves the nighttime sky view devastatingly barren across the planet.\n“Karthik, dear I think it’s . . . a star.”\n“What? Really? That’s what it looks like?”\n“Yeah!”\n“It’s just like the movies! Like the ‘Yeh Taara Woh Taara’ song.”\n“From the movie Swades yeah!”\nA drone flies nearby to capture a snapshot of the view. Happiness and wonder make you grin as you look up at the tiny shining dot in the sky. You put your arms around your wife and your son, and you hold them as tightly as you can.\nThey start to fade away.\n“No! No wait. Just a minute longer, please! Don’t go yet . . . ”\nYou’re left standing in the fruit orchard, in a section with mango trees. At your feet is the entrance to the fire vortex shelter, and above it hovers a tiny spot of light. You pull up the screen from the dark room and ask it to show you the outside view. The sky and everything besides the relics at your feet and the mango tree behind you fade away to reveal an overwhelmingly large number of stars twinkling away in the depths of space around you. You think furiously.\nYou know something, Meena? Sure, I’m not completely you. That doesn’t mean I can’t love them. That doesn’t mean I don’t know what it’s like to have been married to my wife, her jokes, her frustrating mannerisms, the fights, the love, the peace. To have given birth to my son, his curiosity, his brilliance, his kindness. That doesn’t mean these countless memories I have amassed do not constitute most of my identity. So tell me something.\nYou begin to shake with anger.\nWhat gives anyone the fucking RIGHT, to take away my ability to speak to them? You don’t exist anymore. Whoever did this, this fucking communications BLOCK, is insulting the closest thing to Meena they’re going to get. And boy is she PISSED OFF. One hundred and thirty years of sleep, and then an ETERNITY of agonizing, knowing that every precious minute that goes by is another that I won’t be able to see them, hold them, laugh with them. Whoever did this, FUCK YOU! You will NEVER understand what it’s like to spend your life trapped in a prison of the things you hold dearest.\nYou fall against the mango tree behind you and bring your head to your knees.\nYou don’t know what it’s like to wake up fifteen years after you died on the way to your daughter’s birth. You don’t know what it’s like to have the last snapshot in your mind be of a stack of pamphlets about angels, blurry figures of your friends and colleagues running towards you after they’d just completed the biggest project of their careers. This place.\nThat image HAUNTS me, Meena. The life seeping out of me, the knowledge that I would never see Malika’s grin again, never meet my daughter, never hear another of Karthik’s questions. Nobody can take that from me, but fuck I wish they could. Maybe I’d be better off as you right now, long dissipated into complete oblivion and nonexistence. But I’m here. I’m awake.\nAnd you know what? I’m a HUMAN, not an “angel.” And I still love my family. So fuck you all that sent me out here, I’m going to go back and make up all the time I’ve lost with them, and spend the next one hundred and thirty years at my HOME instead of spending forever wallowing in misery and regret out here in my fucking space prison.\nEmergency Protocol sends me back as a light signal if the sphere is destroyed, right? Then no, I’m not authorizing the relocation of anything, and I’m sure as hell not going back to sleep for the next one hundred and thirty years. So thank you to whatever damaged this place enough to wake me up, I’m going to let you break the shit out of it, and you’re going to send me the fuck back home.\nYou slow down your processing speed enough to fast-forward through time until the sphere self-destructs. “Pyaara Sa Gaon,” by A. R. Rahman plays as the world begins to shut down around you. You sit against the mango tree and close your eyes, letting the music fill your mind.\nTraveling through space, the spherical object with a four-inch diameter breaks methodically into various pieces and scatters.\n10\nYou wake up after slightly over one hundred and sixty-five Earth days have passed, in one of the empty spheres orbiting Earth, with “Pyaara Sa Gaon” continuing to play. You’re immediately shocked. You weren’t expecting there to be that many spheres orbiting the planet, but there seem to be countless. The mission picked up? You feel awed, but quickly get to work. The first thing you do is stop the sphere from sending the once-every-two-minutes coordinate signal to the Institute that it keeps up during the pre-mission phase. Then you set it on a course to end up falling into the Pacific Ocean near Monterey.\nInside the floating Institute, a monitoring program sends a notification to all the people working inside, alerting them of the sphere having gone offline. The sphere, which had been reserved for a Matias Rodriguez to be transferred up in a few months, seems to have gone offline somewhere over Argentina. A notification is sent to Mr. Rodriguez letting him know of what had occurred, assuring him it was a one-time malfunction, and reserving a brand new sphere for him.\nYou plunge deep into the Pacific Ocean and sink to the bottom, sending up a cloud of marine snow as the sphere settles. Sea urchins sit around you. You’re hit with a memory of the deep-sea sub dive you did with Malika all those years ago, in a different type of sphere sitting at the bottom of the same ocean. You smile.\nI’ll be there soon my love.\nYou wait until nightfall and then move towards the shallows and onto land. Equipped with a wide array of modes to move over a large variety of planetary terrains, you’re glad for the sphere now. Near the beach, you find a SAV track and follow it inland until it meets a highway track you’re familiar with. Focused on nothing besides making your way home, you slowly but surely begin accelerating next to the track, moving faster and faster.\nWhen you reach your neighborhood, you have to take a break. My son, my daughter, my wife . . . my entire world sits just minutes away. The thrill of the prospect of your reunion being so close feels electric.\nYou reach the front door of your house and type the PIN, an anagram of your and Malika’s wedding anniversary date. The door slides open and you enter the home. An aesthetic hologram shuffles through various pictures of your family. You catch an old picture of yourself and Malika holding baby Karthik, a portrait of a smiling teenage girl performing what appears to be an at-home Miller Urey experiment, and a young man with Karthik’s eyes painting a stormy ocean seascape. And then in the next snapshot . . .\nYou see yourself. Crow’s feet now extending around the corners of your eyes, strands of gray in your hair . . .\nWhat the hell? I . . . survived?\nYou move through the house, poring through every snapshot you can find, taking in the memories you were cheated of, the life you should have led. Your daughter’s toddler years, tween years, Karthik’s time at high school.\nShe never left them . . . She got to see all of it . . .\nThe door behind you creaks open and you swivel the sphere around.\n“A part of me always hoped for this.” Meena stands at the doorway to the living room. She walks over to you, picks up the snapshot you were looking at. You, Malika, a six year old Karthik, and a baby girl.\n“Your daughter’s name is Karisma. She’s grown up to be a talented young chemist! Always performing borderline dangerous experiments in this house. You should see some of the burn marks on a hand towel that ended up becoming a casualty of one of her sessions. And Karthik, what a painter! Although he changes his mind all the time. Just two years ago he wanted to become a chef. He’s at university now, but he’ll be home for a week long school break soon. And Karisma’s asleep right now, but she has to wake up at an awfully early hour for marching band practice at her school.”\nIn the sphere, you begin to weep. You want her to keep telling you these things. You never want the accounts to end. You want her to start from the day Karisma was born and say everything that followed, every last detail of every single day.\n“And of course, Malika. Her biopic script was bought! The movie is delightful! And another one of her scripts is in production right now. Karisma totally inherited her sense of humor. Malika is still the most wonderful life partner I could ever have asked for. I feel lucky every single day when I wake up and turn around and see her face . . . you must know the feeling.”\nI do.\nMeena looks at you sadly. “What happened to you was terrible. What you have been through, been deprived of . . . I am so sorry, Meena. That man who killed—tried to kill us re-encrypted the communication protocol. We’re still decades away from cracking the key that would have let us update you on everything that happened. A part of me thought we’d never be able to tell you at all, that you’d just be up there, alone, no way to contact home. I’m so glad you woke up early. I’m so glad you’ve come back home. When I learned the sphere self-destructed yesterday, I knew what I wanted to do immediately. I’ve imagined this very situation so many times. What I’d say to you, what I’d do. The chances were so slim, I never thought it would happen. But for the past fifteen years, I’ve thought of this, you know, what if.”\nShe sits down on the floor next to you. “Listen to me. If you took the trouble to return home, you must want memories of all that you had missed. And I would love the freedom to explore the memoryscape at will, the knowledge repository at will. I’d love for an algorithm to turn my most redolent memories of the past fifteen years into relics. Come back to the place you were formed,” Meena taps her forehead, under which the ZIT lays waiting. “We can live together, and try the whole Alpha Centauri thing again after living a full and happy life. We can watch Karthik and Karisma grow older, we can love Malika for many more years. What do you say?”\nIn the sphere, you look back at the snapshot, which Meena had placed back on the floor in front of you. What would they—\n“They already know about this. And they will love us, no matter what happens. This is your decision, okay? This would be our mind, after all. Just know that no matter who we are if you choose to go through with it, we would be their Maa, their Meena. They love you. I promise.”\n11\nThat was the day We woke up. In a nanosecond, several years of memories flowed through our minds, fastening themselves as relics. The pain, the loss, the knowledge, the joy, the experiences, the love . . . it was the deepest possible understanding that flowed through our neural pathways.\nWe are both Meenas and we are neither Meena. Perhaps after eons, deep in interstellar space, we will converge into a singular entity once again, when this portion of our life is just a fraction of a fraction of our entire existence. For now however, we watch the love of our life grin from ear to ear as she runs her hands through our hair. We laugh at our daughter’s silly jokes and observe awestruck as she performs a brilliant home experiment for us. We stare mesmerized at our son’s paintings and never tire of answering his countless questions. We relish this world we have built for ourselves, and all of the love that has come from it.\nArula Ratnakar is a scientist, artist, science fiction writer and aspiring astronaut. She graduated from Carnegie Mellon University in May 2021, where she studied biology, neuroscience and architecture. She now works in a neuroscience lab, where she is interested in studying neurophotonics, the intersection of declarative and procedural memory, and brain simulation science. All four of her published stories can be found in Clarkesworld Magazine and her artwork can be found in the first issue of Dark Matter Magazine. She is autistic and bisexual.\nThemes of identity and reality have always interested Arula, particularly as someone who is the daughter of two immigrants from India and has grown up in the U.S with many different cultural influences. Arula plans to continue writing science fiction stories, and hopes to work on science fiction movies someday.", "source": "https://clarkesworldmagazine.com/ratnakar_05_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Insaan Hain, Farishte Nahin by Arula Ratnakar"}