{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "E Catherine Tobler", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ctBblapbuU/egfL5ox/8CtJ3ZCs=", "id": null, "license": null, "comments": "", "raw_text": "4510 words, short story  Somewhere I Have Never Traveled (Third Sound Remix)  In the still of the night, there is the voice.  Am I awake?  It is not a voice as I know voices; it doesn’t speak in words, but in vibrations, audio frequencies penetrating the space which enfolds it (the siren, the woman trapped). It is the sound of a remembered heartbeat, muffled and moving through fluid, muscle, bone. There, it finds a new home, vibrates within this confine, and wakes me.  I am awake.  The station’s darkness is always warm, always faintly redolent with rubber, charcoal, ammonia. The air is clean, antiseptic despite the rust that streaks the station’s innermost walls, and tonight carries the sound—the voice that is not a voice. It reminds me of whale song, a distant rumble moving through the station as though the station were water; but the station is not water, nor is it submerged beneath any ocean. I unstrap myself from the sleep pocket and float to the nook’s window.  Jupiter, swollen. So orange against the black of space, so large as to almost occupy the entire window. Space is only a slim crescent along the planet’s brightening rim. I have worked on Galileo Station harvesting helium for twelve years, and the view never grows old; Jupiter never grows old with its ceaseless storms, new designs constantly wrought within its cloud layers. The red spot spun itself out in our sixth year, the storm succumbing to another that is the colors of Earth’s seas: teal and turquoise, indigo and lapis. Sometimes, when the sunlight angles across, the storm shines like a great opal, cracked with orange lightning.  But the voice, the sound. With my palms pressed flat to the window, I imagine I can feel the sound (the voice) rolling through the fused silica and borosilicate glass. The voice spills from the planet, from deep within its clouds, pushing itself out of roiling gasses, tunneling through thirty-one miles of cloud, through the station’s skeleton and into my own. If I close my eyes (and I do), the sound rattles my teeth, my tongue, and when it has gone (it always goes), I am left with my cheek pressed to the cold window, as if I meant to go out with it—as if it meant to take me. The voice (the sound) drains away, counterclockwise into Jupiter’s rage.  Come back, I want to say.  Am I awake?  There is no exact surface, three thousand miles straight down. In Jupiter’s orbit, hovering above its faint halo rings, station and planet have made one revolution around the distant sun; Saturn has sixteen more years for a full lap, so it seems we are running even with helium pods deployed and deploying. They plunge through the Jovian clouds to find the helium streaking the Jovian skies as rain, to gather and retrieve this precious gas for return to Earth.  The dance is silent. I used to think the harvesters looked like balloons being drawn along strings and everyone laughed because how clever, helium and balloons and aren’t you so old-fashioned. The pods rise along their guy lines, to vanish into the station’s belly and I rather think now that it’s not balloons at all, but the silent consumption by a leviathan, of a thing we should have never harvested. The siphoning of one world’s natural resources into another’s, another who depleted itself and will do so again.  A silent dance, but the station’s rumble still moves through me as pods rise along their guy lines, into Galileo’s belly, and I push myself into motion, shaking the voice from my skin as I slide into my coveralls, into my spatulae gloves that allow fast travel along the station’s walls, much like a gecko skimming glass. I work my way into the spinning levels of Galileo where gravity wraps me up and pulls me to the floor once more. The walls arc overhead here, vast and high, accommodating the harvesters after the debris of Jupiter, of space, has been sluiced from their ovoid hulls.  From the nearest pod, the voice thrums.  The pod doesn’t look unusual in any way. Its metallic hide shows the scars of space without a hint as to its precious cargo beyond the readouts of its panel; everything glows green, helium secure and ready for transfer. I picture it, sealed within yet still trying to escape. Subject to the station gravity when before it was Jupiter’s own mass stripping it from the clouds. Helium that doesn’t quite know what to do with itself after it finds its own level. Rippling waves, a tremor pushing from a liquid center, causing the contained helium to creep up the walls, seeking escape.  The voice again, and I move toward the pod, ungainly in my return to limited gravity. My gloves would allow me to ascend the pod, to crack open the nose cone and dive inside, to better hear what calls me. Like the whale song it calls to mind, I have to wonder how differently it would sound if I were submerged within the liquid helium. At just above absolute zero, the helium would freeze me; my skin would go white, cold, numb, and my hearing would no doubt be compromised, taken. And yet, the idea of allowing it to surround me, entomb me, is intoxicating. Clemens always said it’s not the booze that gets you drunk out here—mostly because there is no goddamn booze, because they always find and strip the goddamn stills—but it’s the ideas that inebriate us. It’s the mere notion that we’re six hundred million kilometers from Earth and still gloriously alive. It’s the—  “Vasquez?”  I’m half way up the pod when I hear my name, my gloved hands cradling the arced container the way I might a lover, a bottle of whiskey, a thing meant to get me drunk. I stare at the glowing green diagnostic panel and force myself to breathe. I become aware of the weight of my body, of the tension that runs in a line from neck to spine.  “Johns.”  I look over my shoulder. He’s so small down there, his coveralls a white blot against the darker metal floor. A dozen fresh pods slide into their berths behind him, great airships hissing and cascading with breath as they return to atmosphere. Johns tips his bearded face up, eyes on me. His tablet is lashed to his wrist, balanced in his hand, fingers poised to record the details of the day’s docks.  “That harvester have a problem?”  The panel still glows green at me, soft and steady and true. No problems at all, the helium perfectly content and consistent inside. Filled to the fill line. Waiting to be flushed and sent back out. The voice rises to fill the nose cone, rattling the scarred metal. It whispers my name and tries to pry its fingers along the unbreakable seal. I comfort myself with the idea that if the helium can’t get out, the voice can’t get out. Won’t get out. (The siren? A woman trapped?) Can Johns hear it? (Her. It’s her.)  “I thought it—” I glance over my shoulder and down. He waits and behind him more harvesters return to Galileo. “No, no problem.”  “Get down here and check these new returns, we haven’t got all day.”  But we do have all day—ten Jovian hours to harvest, cull, and strip from this world what our world yet needs. I carefully drop back down the side of the pod and the voice pleads for me to stay, to let it out. I want to ask Johns if he hears that, if he can feel it in his bones, but Johns is gone and it’s only the pods that hiss and await inspection, before I will drop them back into the atmosphere. Free fall into metal rain.  The biggest planets sound like thunder. Hammers beating anvils. When you listen to the radio emissions of Jupiter, of Saturn, one gets the expected. But when isolated, the rings are something far more delicate, dulcimers in the summer wind I remember from my childhood. It wasn’t always the depths of space, the hiss of gas-laden harvesters rising from planetary atmospheres; it was once tall and golden wheat fields bending in July’s hot breath.  Beneath the thunder of Jupiter, the voice.  It speaks like an ocean tossed by the thunder, moving like a thousand gallons of salted water over and through a naked body. My naked body. I haven’t been naked in months—years?—not even when Clemens joins me in the sleep pocket. That union isn’t sex so much as it’s the press of another body against your own. The knowledge of another’s weight in weightlessness. It’s waking in the middle of the Jovian night and knowing you aren’t alone.  But tonight, a hand rests against my bare thigh. It isn’t feminine or masculine this hand; it is simple warmth and weight, and the awareness I am not alone. But my thigh is not bare, so this hand, this weight, is beneath my coveralls; beneath the thin layer of thermals I always wear. My sleeping mind cannot untangle how this is so. My sleeping mind allows it, fashions the hand into Clemens who sounds like thunder sometimes, too, but Clemens is not here.  I lean into the hand and the voice fills my mind to overflowing. The tang of salt is sharp on the back of my tongue, as if I have swallowed an entire ocean, and when I open my eyes, it is not station darkness that greets me. It is not even Jupiter engorged beyond the window, for I am inside the clouds; I am not viewing the clouds from the station high above, but instead from below. I plunge through their ochre layers, past the point they go blue, past the point they go black. Lightning cracks, illuminating the space-hung opal, and there are only ever clouds. I see nothing else until the helium rain begins to fall.  Everywhere the helium rain splatters me, I burn. In truth, I freeze—but my skin sizzles with an illusion of heat. My senses overwhelmed, I don’t know which to believe. A droplet on my forehead, sliding down my nose, and over my lips. I don’t dare breathe, but still suck in a breath. I suck in the rain and my tongue turns to ice. I want to say no, but my tongue freezes against the roof of my mouth. My tongue sounds like airplanes—the sound of the bluest planets in the stars, a shriek against the sky visible only by the condensation it leaves behind. I quake awake, alone and breathless, floating free of the sleep pocket as the distant sun begins to spark through Jupiter’s clouds. My tongue goes silent.  Only in the last three months have I heard this voice, this sound I cannot pinpoint. It does not matter if I am awake or asleep, it comes. Before, it was quiet, as quiet as a station filled with a hundred other people might be. I passed every night perfectly still and quiet, and rose each Jovian morning as if I’d never slept so well, not even on Earth while harnessed in gravity. Now, I wake not knowing exactly where I am, some larger part of me still cloud-cradled and falling.  Galileo Station hums and I gecko my way to the bay with its ever-rising helium pods. I think if I focus on the pods, on the in and out of the entire operation, the voice will quiet. But as I move among the pods, the voice beckons. I cannot immediately tell which pod contains it; the pods, like a forest around me, all whispering with the notion of the coming storm. Thunder in the distance, lightning cracking unseen below. Balloons, they should have been like balloons these pods, but they are trees, and then shadows, and then monsters once confined to the pages of a book. Each one has me catching my breath and Kane and Dillon laugh at me.  Dillon tells me the bay is no monster-filled forest, but rather a cathedral in the stars, for can I not see the way the light of the distant sun pierces the far end of the room, as if thrown through a rose window. It challenges your faith to occupy this space, Dillon says, and I breathe, for it is so. When the bay is empty of all but the pods, I sing, my voice soaring as high as it might amid their vast heights. My song reaches for the rust that streams in tears down the highest walls, recalls my grandmother in her own church, though I’ve only ever heard such stories, never stood in that space and vibrated with the sound of her.  Another day, another hunt through the pods until I’ve found which pod contains the voice. It’s small today, the voice, small and whimpering. But when I find it, it sounds like the rush and whisper of Neptune, a wind-torn sigh across water. Making sure none can see, I ascend the pod. Past the diagnostic panel that tells me all is well, all is right, I climb to the nose cone and inhale. Gunpowder and hot metal, and beneath this scent, sugar. I am reminded of my grandmother’s churros, hot and crisp and sweet. I bend my nose to the pod, tip my cheek, and lick the metal. It should be cold, I should stick, but I glide.  The motion of the helium inside rocks through me. I envision it flooding up the side of the pod, toward and under my tongue pressing against the other side. It wants to fill this new cavity, my mouth, until it pools in my belly and tries to creep up the sides of even that container. The helium ripples, laughter barely contained, and I—  “Vasquez!”  The sharp sound of my name jolts me from the thought of this liquid laughter coiling in my belly and I stare down into Johns’s stormy eyes.  “Am I awake?”  “Get down. Right now.”  I descend slow, the way I imagine the pods themselves do on their long lines. I picture myself as a pod, full of things that wish they were elsewhere and will soon be, but this is not enough to calm the trembling in my body by the time I reach the floor. How easy to propel myself away, to use my gloves and move with the speed of a lizard through the pod forest, into the sleeping pocket that is the nearest thing I might call home. I do not flee.  Commander Call’s office is not what anyone would imagine. She prefers a distinct lack of gravity, so there is no desk, there are no chairs. Her predecessor occupied a space in the wheels of the station, but not Call. She likes to float and I wonder if maybe she has heard the voice, if maybe she would understand when I tell her why I licked the goddamn helium harvester, but the longer she drones on, I know that not even she would understand or take the time to try.  There is a voice, I want to say, and this voice gets inside me. It’s like . . . have you ever listened to space, I mean really listened, Call, because it’s like that. Space has a sound, and a scent, and a weight, despite its lack of gravity and this voice— You can listen to the stars, Call, the way they vibrate, and this sound, emerges unexpected. A steady line and then a hitch, the vibration of something previously unheard. A long call across a very cold and dark ocean and you’ve been in the dark so long, so fucking long, you move toward it because it’s sunlight, and warmth and the weight of someone else against you when you’ve been weightless so very long.  Call tells me about regulations. About the orderly fashion of Galileo Station, as if I am newly arrived, as if I haven’t been here twelve years. But maybe it’s those years, Call says; maybe the years have worn me down to nothing, and I need to go see the doctors first thing tomorrow. I need to let them poke and prod and they are the ones who will know, she says. They will know what is to be done.  “It’s not like they will send you home,” Clemens says as we burrow in the sleep pocket. He sounds like wind tonight, not thunder, and his arms come around me from behind. Our legs tangle.  It’s not like I did anything wrong, I want to say, but I stay quiet and allow myself to drift in his embrace. I close my eyes and will myself to sleep, but sleep never really comes.  The clouds haul me down. This time, I find I am sealed within a helium pod, its walls beaded with moisture that is not water, but neither does it burn me the way liquid helium would. The pod is the exact the length of my body and I stand, hands pressed to the forward curve, watching Jupiter swallow us. I cannot see the line we travel, perhaps it is not there; I can see only the endless clouds of this giant world. Jupiter’s thunder rattles the pod, rattles my teeth, and it is like biting down on soft metal as I wait for it to stop. It does not stop.  We fall forever, me in the pod. Outside, helium pours down, stripping neon from the clouds as it goes. The pod runs with luminous metal rain, the air never quite dark or bright as we slice through endless cloud layers. When the weight is enough—  oh god it can’t, it can’t, but it will  —the pod unfurls as designed.  Like a metal flower, the pod opens itself to the helium rain and, unobstructed, the helium pours in. I shriek and the sound flies up into the storm, carried three times as fast as it would through oxygen alone. It is the sound of sucking balloons, of terror, of help me, help me. Inch by horrifying inch, the helium rain floods the pod, and I think I should freeze—I should be long dead—but I do not freeze and am not dead.  Am I awake? I try to feel the warmth of arms around me, I try to hear Clemens breathing, but there is only my scream. I scream until my throat is raw, until my airplane-tongue is again frozen to the roof of my mouth. I consider leaping out, about geckoing up the line that umbilicals me to Galileo, but I cannot move and do not have my gloves. I lift my hands, umbrella against rain, but it does not cease.  In the lighting-wracked clouds, a sound (a voice). It comes slowly and from a great distance. I try to turn toward it, but it is all around and growing closer the deeper I descend. Am I awake? I push the question aside and stop trying to find Clemens in the helium rain. I breathe and force myself to calm. I breathe and force myself not to creep out of the container that holds me, but my body flutters in panicked waves.  The voice (the sound) deepens. It is the lowing of some great beast I have not seen and cannot name; it is the sound of cleaving ice into bottomless ocean dark. Even as I want it to continue, I want it over and done. I try to speak, but my mouth is frozen and I can only gape at the thing that emerges from Jupiter’s deepest, unseen storms.  The shape that solidifies in the clouds before me is not a mermaid. It is not a white whale, nor any other creature of Earth’s seas. It is neither masculine nor feminine, but only a weighted presence before me. The face, if it can be called that, is not beautiful, but astonishing; eyes of endless storm, a mouth that is an entire ocean. I long for this being to swallow me, so that I might know its depths, but it only stares, as curious of me as I am of it.  Am I awake?  Jupiter’s clouds coalesce before me, showing me a familiar shape—nearby sister Saturn, sunlight gilding her rings into a halo. After fifteen years spent in black winter, Titan pulls itself from Saturn’s cloak, aglow in organonitrogen haze. The giant moon stretches, a slivered orange horseshoe tonguing out a mouthful of darkness. Distant sunlight fingers through its clouds and glints off the hydrocarbon puddle of Punga Mare before the clouds close once more.  But within the clouded landscape emerging from winter’s dark, there shows a scar not unlike those upon the harvesters. A black ruin fragments Titan’s golden clouds, a mold pressed into wet clay. The clouds do not swallow this deformity, but move with care around its outer boundary, as if the scar is a physical thing possessing an edge not to be crossed.  “Vas.”  Sickbay surrounds me, white and uncomfortably sterile, the walls close and without windows. Even though I cannot see Jupiter, I feel it pressing upon us, a watchful eye. I am strapped into an observation bed, Clemens looking down at me. Dillon sits nearby, Johns pacing the hall. Clemens could not wake me, he says as his hand enfolds my own. I do not move within that slight touch, thoughts anchored upon the thing I saw in Titan’s clouds.  “You need to look,” I say. “You need to see.”  This is what I say; this is not what anyone hears. My voice is ragged from screaming and I make a feeble squeak. Clemens hands me a tablet and with shaky fingers, I scrawl the same words. I tell him about the clouds, the sound, about being in the pod and seeing— The ship. It was a ship on Titan, emerging. Life that doesn’t quite know what to do with itself after it finds its own level. Rippling waves, a tremor pushing from a liquid center, causing the contained life to creep up the walls, seeking escape.  Clemens reads the tablet and swipes a gentle hand across my short, bristled hair. His laugh is just as short, strangled, and I’m not sure if he can’t believe or believes so much that a long-last admission is terrifying. Clemens sees me back to my nook that night, and I hang uneasily at the window, watching Jupiter turn (listening for the voice), wondering at the scars that mark my hands, pale pink slashes criscrossing brown skin—as if my hands were once lifted to shield my face from helium rain.  A dark shape moving in and out of the clouds as if— As if it were alive.  Awake.  Awake after winter’s dark.  I do not sleep. I do not tether myself into the pocket, but float before Jupiter, waiting. And in time, the voice comes, bundles me into a descending pod, and waits in return, until I am close enough. I fall forever, for always, helium rain that should kill me instead now a comfort. I know the coldness against my skin. My hands grow new scars from its trespass, but I feel with each one that something inside me is emerging. Pushing itself out after a long winter dark. Creeping up the sides of this imperfectly sealed container.  The pod vibrates with the sound, the voice, and unfurls itself into the rain. The being in the clouds pushes itself closer, so close I can feel droplets of cloud against my marked cheeks. They are clouds of hydrogen, ammonia, and sweet water vapor. They should flood my lungs and strangle me, but—  A long call across a very cold and dark ocean and you’ve been in the dark so long.  I reach a scarred hand into the clouds and the clouds enfold me. They suckle at me as if to taste the droplets of blood welling from my wounds, to deconstruct and study them. A warm tongue, the weighted wetness surrounds me, swallows me. I float in a darkness that is not entirely dark, for spring is breaking, and there—there is the voice. It does not speak as I speak but together we create a kind of heterodyne, shifting voices into new ranges, churning them into something we can both understand.  They have slept and they are coming.  They have slept and they are waking.  No—we have slept and they are coming.  We heard you.  They heard me. My grandmother’s song.  I jolt into awareness within the bright cathedral space of Galileo’s bay, an open and empty harvester on the floor beside me. Blood and water mingle in shallow pools on the flooring, running from my scalp, my shoulders, and you’ve been in the dark so long, so fucking long, you move toward it because it’s sunlight, and warmth and the weight of someone else against you when you’ve been weightless so very long. I spread my fingers in the wet, staring.  I push myself up, but I am weak—so weak and how long was I—  Clemens is there, warm thunder, and Johns too, who has the sound of a very soft wind today, barely daring to breathe. They don’t look at me with anything resembling anger. It’s relief pure and simple that pours through them; Johns even laughs, gathers me into his arms and laughs, “Oh Christ where have you been?”  But they know, because the pod was planetside, they eventually tell me. The pod was submerged and they couldn’t recall it and I was missing. I was nowhere within Galileo Station.  And then—  “We saw one,” Clemens says.  On Ganymede, he tells me. Ganymede hanging stark and barren but for the black scar emerging from its head. If the scar possessed hands, Clemens saw it press those hands to the moon’s surface, so that something black and endless could pull itself from the water-ice womb of the cratered body. He said it moved like Titan from her saturnine shadow, but then that it was only shadows. It has to be, he whispers.  It isn’t.  Callisto Station confirms another scar upon its face, but there is no telling how long it has lain upon the star-spangled moon. The scar marks the edge of the Asgard crater as if it has always been there. And Titan? What of distant Titan? Huygens Station confirms Titan has at least one such mark. Said it was on Europa, too. Said the wet darkness was waking, pushing itself into the stars.  “Awake, not waking,” I say, and the sound (the voice) floods me—it is not airplanes or wind or any sound born of Earth; it is alien, dark and fathomless and unknowable, but still I know it, have made a language with it in the Jovian rain. It is curious. It is coming.  We have slept and they are coming. The voice in the night, the siren, the being no longer trapped. Pushing itself out after a long winter dark. Creeping up the sides of imperfectly sealed containers. A new red spot, cloud-cradled and rising.", "text": "4510 words, short story\nSomewhere I Have Never Traveled (Third Sound Remix)\nIn the still of the night, there is the voice.\nAm I awake?\nIt is not a voice as I know voices; it doesn’t speak in words, but in vibrations, audio frequencies penetrating the space which enfolds it (the siren, the woman trapped). It is the sound of a remembered heartbeat, muffled and moving through fluid, muscle, bone. There, it finds a new home, vibrates within this confine, and wakes me.\nI am awake.\nThe station’s darkness is always warm, always faintly redolent with rubber, charcoal, ammonia. The air is clean, antiseptic despite the rust that streaks the station’s innermost walls, and tonight carries the sound—the voice that is not a voice. It reminds me of whale song, a distant rumble moving through the station as though the station were water; but the station is not water, nor is it submerged beneath any ocean. I unstrap myself from the sleep pocket and float to the nook’s window.\nJupiter, swollen. So orange against the black of space, so large as to almost occupy the entire window. Space is only a slim crescent along the planet’s brightening rim. I have worked on Galileo Station harvesting helium for twelve years, and the view never grows old; Jupiter never grows old with its ceaseless storms, new designs constantly wrought within its cloud layers. The red spot spun itself out in our sixth year, the storm succumbing to another that is the colors of Earth’s seas: teal and turquoise, indigo and lapis. Sometimes, when the sunlight angles across, the storm shines like a great opal, cracked with orange lightning.\nBut the voice, the sound. With my palms pressed flat to the window, I imagine I can feel the sound (the voice) rolling through the fused silica and borosilicate glass. The voice spills from the planet, from deep within its clouds, pushing itself out of roiling gasses, tunneling through thirty-one miles of cloud, through the station’s skeleton and into my own. If I close my eyes (and I do), the sound rattles my teeth, my tongue, and when it has gone (it always goes), I am left with my cheek pressed to the cold window, as if I meant to go out with it—as if it meant to take me. The voice (the sound) drains away, counterclockwise into Jupiter’s rage.\nCome back, I want to say.\nAm I awake?\nThere is no exact surface, three thousand miles straight down. In Jupiter’s orbit, hovering above its faint halo rings, station and planet have made one revolution around the distant sun; Saturn has sixteen more years for a full lap, so it seems we are running even with helium pods deployed and deploying. They plunge through the Jovian clouds to find the helium streaking the Jovian skies as rain, to gather and retrieve this precious gas for return to Earth.\nThe dance is silent. I used to think the harvesters looked like balloons being drawn along strings and everyone laughed because how clever, helium and balloons and aren’t you so old-fashioned. The pods rise along their guy lines, to vanish into the station’s belly and I rather think now that it’s not balloons at all, but the silent consumption by a leviathan, of a thing we should have never harvested. The siphoning of one world’s natural resources into another’s, another who depleted itself and will do so again.\nA silent dance, but the station’s rumble still moves through me as pods rise along their guy lines, into Galileo’s belly, and I push myself into motion, shaking the voice from my skin as I slide into my coveralls, into my spatulae gloves that allow fast travel along the station’s walls, much like a gecko skimming glass. I work my way into the spinning levels of Galileo where gravity wraps me up and pulls me to the floor once more. The walls arc overhead here, vast and high, accommodating the harvesters after the debris of Jupiter, of space, has been sluiced from their ovoid hulls.\nFrom the nearest pod, the voice thrums.\nThe pod doesn’t look unusual in any way. Its metallic hide shows the scars of space without a hint as to its precious cargo beyond the readouts of its panel; everything glows green, helium secure and ready for transfer. I picture it, sealed within yet still trying to escape. Subject to the station gravity when before it was Jupiter’s own mass stripping it from the clouds. Helium that doesn’t quite know what to do with itself after it finds its own level. Rippling waves, a tremor pushing from a liquid center, causing the contained helium to creep up the walls, seeking escape.\nThe voice again, and I move toward the pod, ungainly in my return to limited gravity. My gloves would allow me to ascend the pod, to crack open the nose cone and dive inside, to better hear what calls me. Like the whale song it calls to mind, I have to wonder how differently it would sound if I were submerged within the liquid helium. At just above absolute zero, the helium would freeze me; my skin would go white, cold, numb, and my hearing would no doubt be compromised, taken. And yet, the idea of allowing it to surround me, entomb me, is intoxicating. Clemens always said it’s not the booze that gets you drunk out here—mostly because there is no goddamn booze, because they always find and strip the goddamn stills—but it’s the ideas that inebriate us. It’s the mere notion that we’re six hundred million kilometers from Earth and still gloriously alive. It’s the—\n“Vasquez?”\nI’m half way up the pod when I hear my name, my gloved hands cradling the arced container the way I might a lover, a bottle of whiskey, a thing meant to get me drunk. I stare at the glowing green diagnostic panel and force myself to breathe. I become aware of the weight of my body, of the tension that runs in a line from neck to spine.\n“Johns.”\nI look over my shoulder. He’s so small down there, his coveralls a white blot against the darker metal floor. A dozen fresh pods slide into their berths behind him, great airships hissing and cascading with breath as they return to atmosphere. Johns tips his bearded face up, eyes on me. His tablet is lashed to his wrist, balanced in his hand, fingers poised to record the details of the day’s docks.\n“That harvester have a problem?”\nThe panel still glows green at me, soft and steady and true. No problems at all, the helium perfectly content and consistent inside. Filled to the fill line. Waiting to be flushed and sent back out. The voice rises to fill the nose cone, rattling the scarred metal. It whispers my name and tries to pry its fingers along the unbreakable seal. I comfort myself with the idea that if the helium can’t get out, the voice can’t get out. Won’t get out. (The siren? A woman trapped?) Can Johns hear it? (Her. It’s her.)\n“I thought it—” I glance over my shoulder and down. He waits and behind him more harvesters return to Galileo. “No, no problem.”\n“Get down here and check these new returns, we haven’t got all day.”\nBut we do have all day—ten Jovian hours to harvest, cull, and strip from this world what our world yet needs. I carefully drop back down the side of the pod and the voice pleads for me to stay, to let it out. I want to ask Johns if he hears that, if he can feel it in his bones, but Johns is gone and it’s only the pods that hiss and await inspection, before I will drop them back into the atmosphere. Free fall into metal rain.\nThe biggest planets sound like thunder. Hammers beating anvils. When you listen to the radio emissions of Jupiter, of Saturn, one gets the expected. But when isolated, the rings are something far more delicate, dulcimers in the summer wind I remember from my childhood. It wasn’t always the depths of space, the hiss of gas-laden harvesters rising from planetary atmospheres; it was once tall and golden wheat fields bending in July’s hot breath.\nBeneath the thunder of Jupiter, the voice.\nIt speaks like an ocean tossed by the thunder, moving like a thousand gallons of salted water over and through a naked body. My naked body. I haven’t been naked in months—years?—not even when Clemens joins me in the sleep pocket. That union isn’t sex so much as it’s the press of another body against your own. The knowledge of another’s weight in weightlessness. It’s waking in the middle of the Jovian night and knowing you aren’t alone.\nBut tonight, a hand rests against my bare thigh. It isn’t feminine or masculine this hand; it is simple warmth and weight, and the awareness I am not alone. But my thigh is not bare, so this hand, this weight, is beneath my coveralls; beneath the thin layer of thermals I always wear. My sleeping mind cannot untangle how this is so. My sleeping mind allows it, fashions the hand into Clemens who sounds like thunder sometimes, too, but Clemens is not here.\nI lean into the hand and the voice fills my mind to overflowing. The tang of salt is sharp on the back of my tongue, as if I have swallowed an entire ocean, and when I open my eyes, it is not station darkness that greets me. It is not even Jupiter engorged beyond the window, for I am inside the clouds; I am not viewing the clouds from the station high above, but instead from below. I plunge through their ochre layers, past the point they go blue, past the point they go black. Lightning cracks, illuminating the space-hung opal, and there are only ever clouds. I see nothing else until the helium rain begins to fall.\nEverywhere the helium rain splatters me, I burn. In truth, I freeze—but my skin sizzles with an illusion of heat. My senses overwhelmed, I don’t know which to believe. A droplet on my forehead, sliding down my nose, and over my lips. I don’t dare breathe, but still suck in a breath. I suck in the rain and my tongue turns to ice. I want to say no, but my tongue freezes against the roof of my mouth. My tongue sounds like airplanes—the sound of the bluest planets in the stars, a shriek against the sky visible only by the condensation it leaves behind. I quake awake, alone and breathless, floating free of the sleep pocket as the distant sun begins to spark through Jupiter’s clouds. My tongue goes silent.\nOnly in the last three months have I heard this voice, this sound I cannot pinpoint. It does not matter if I am awake or asleep, it comes. Before, it was quiet, as quiet as a station filled with a hundred other people might be. I passed every night perfectly still and quiet, and rose each Jovian morning as if I’d never slept so well, not even on Earth while harnessed in gravity. Now, I wake not knowing exactly where I am, some larger part of me still cloud-cradled and falling.\nGalileo Station hums and I gecko my way to the bay with its ever-rising helium pods. I think if I focus on the pods, on the in and out of the entire operation, the voice will quiet. But as I move among the pods, the voice beckons. I cannot immediately tell which pod contains it; the pods, like a forest around me, all whispering with the notion of the coming storm. Thunder in the distance, lightning cracking unseen below. Balloons, they should have been like balloons these pods, but they are trees, and then shadows, and then monsters once confined to the pages of a book. Each one has me catching my breath and Kane and Dillon laugh at me.\nDillon tells me the bay is no monster-filled forest, but rather a cathedral in the stars, for can I not see the way the light of the distant sun pierces the far end of the room, as if thrown through a rose window. It challenges your faith to occupy this space, Dillon says, and I breathe, for it is so. When the bay is empty of all but the pods, I sing, my voice soaring as high as it might amid their vast heights. My song reaches for the rust that streams in tears down the highest walls, recalls my grandmother in her own church, though I’ve only ever heard such stories, never stood in that space and vibrated with the sound of her.\nAnother day, another hunt through the pods until I’ve found which pod contains the voice. It’s small today, the voice, small and whimpering. But when I find it, it sounds like the rush and whisper of Neptune, a wind-torn sigh across water. Making sure none can see, I ascend the pod. Past the diagnostic panel that tells me all is well, all is right, I climb to the nose cone and inhale. Gunpowder and hot metal, and beneath this scent, sugar. I am reminded of my grandmother’s churros, hot and crisp and sweet. I bend my nose to the pod, tip my cheek, and lick the metal. It should be cold, I should stick, but I glide.\nThe motion of the helium inside rocks through me. I envision it flooding up the side of the pod, toward and under my tongue pressing against the other side. It wants to fill this new cavity, my mouth, until it pools in my belly and tries to creep up the sides of even that container. The helium ripples, laughter barely contained, and I—\n“Vasquez!”\nThe sharp sound of my name jolts me from the thought of this liquid laughter coiling in my belly and I stare down into Johns’s stormy eyes.\n“Am I awake?”\n“Get down. Right now.”\nI descend slow, the way I imagine the pods themselves do on their long lines. I picture myself as a pod, full of things that wish they were elsewhere and will soon be, but this is not enough to calm the trembling in my body by the time I reach the floor. How easy to propel myself away, to use my gloves and move with the speed of a lizard through the pod forest, into the sleeping pocket that is the nearest thing I might call home. I do not flee.\nCommander Call’s office is not what anyone would imagine. She prefers a distinct lack of gravity, so there is no desk, there are no chairs. Her predecessor occupied a space in the wheels of the station, but not Call. She likes to float and I wonder if maybe she has heard the voice, if maybe she would understand when I tell her why I licked the goddamn helium harvester, but the longer she drones on, I know that not even she would understand or take the time to try.\nThere is a voice, I want to say, and this voice gets inside me. It’s like . . . have you ever listened to space, I mean really listened, Call, because it’s like that. Space has a sound, and a scent, and a weight, despite its lack of gravity and this voice— You can listen to the stars, Call, the way they vibrate, and this sound, emerges unexpected. A steady line and then a hitch, the vibration of something previously unheard. A long call across a very cold and dark ocean and you’ve been in the dark so long, so fucking long, you move toward it because it’s sunlight, and warmth and the weight of someone else against you when you’ve been weightless so very long.\nCall tells me about regulations. About the orderly fashion of Galileo Station, as if I am newly arrived, as if I haven’t been here twelve years. But maybe it’s those years, Call says; maybe the years have worn me down to nothing, and I need to go see the doctors first thing tomorrow. I need to let them poke and prod and they are the ones who will know, she says. They will know what is to be done.\n“It’s not like they will send you home,” Clemens says as we burrow in the sleep pocket. He sounds like wind tonight, not thunder, and his arms come around me from behind. Our legs tangle.\nIt’s not like I did anything wrong, I want to say, but I stay quiet and allow myself to drift in his embrace. I close my eyes and will myself to sleep, but sleep never really comes.\nThe clouds haul me down. This time, I find I am sealed within a helium pod, its walls beaded with moisture that is not water, but neither does it burn me the way liquid helium would. The pod is the exact the length of my body and I stand, hands pressed to the forward curve, watching Jupiter swallow us. I cannot see the line we travel, perhaps it is not there; I can see only the endless clouds of this giant world. Jupiter’s thunder rattles the pod, rattles my teeth, and it is like biting down on soft metal as I wait for it to stop. It does not stop.\nWe fall forever, me in the pod. Outside, helium pours down, stripping neon from the clouds as it goes. The pod runs with luminous metal rain, the air never quite dark or bright as we slice through endless cloud layers. When the weight is enough—\noh god it can’t, it can’t, but it will\n—the pod unfurls as designed.\nLike a metal flower, the pod opens itself to the helium rain and, unobstructed, the helium pours in. I shriek and the sound flies up into the storm, carried three times as fast as it would through oxygen alone. It is the sound of sucking balloons, of terror, of help me, help me. Inch by horrifying inch, the helium rain floods the pod, and I think I should freeze—I should be long dead—but I do not freeze and am not dead.\nAm I awake? I try to feel the warmth of arms around me, I try to hear Clemens breathing, but there is only my scream. I scream until my throat is raw, until my airplane-tongue is again frozen to the roof of my mouth. I consider leaping out, about geckoing up the line that umbilicals me to Galileo, but I cannot move and do not have my gloves. I lift my hands, umbrella against rain, but it does not cease.\nIn the lighting-wracked clouds, a sound (a voice). It comes slowly and from a great distance. I try to turn toward it, but it is all around and growing closer the deeper I descend. Am I awake? I push the question aside and stop trying to find Clemens in the helium rain. I breathe and force myself to calm. I breathe and force myself not to creep out of the container that holds me, but my body flutters in panicked waves.\nThe voice (the sound) deepens. It is the lowing of some great beast I have not seen and cannot name; it is the sound of cleaving ice into bottomless ocean dark. Even as I want it to continue, I want it over and done. I try to speak, but my mouth is frozen and I can only gape at the thing that emerges from Jupiter’s deepest, unseen storms.\nThe shape that solidifies in the clouds before me is not a mermaid. It is not a white whale, nor any other creature of Earth’s seas. It is neither masculine nor feminine, but only a weighted presence before me. The face, if it can be called that, is not beautiful, but astonishing; eyes of endless storm, a mouth that is an entire ocean. I long for this being to swallow me, so that I might know its depths, but it only stares, as curious of me as I am of it.\nAm I awake?\nJupiter’s clouds coalesce before me, showing me a familiar shape—nearby sister Saturn, sunlight gilding her rings into a halo. After fifteen years spent in black winter, Titan pulls itself from Saturn’s cloak, aglow in organonitrogen haze. The giant moon stretches, a slivered orange horseshoe tonguing out a mouthful of darkness. Distant sunlight fingers through its clouds and glints off the hydrocarbon puddle of Punga Mare before the clouds close once more.\nBut within the clouded landscape emerging from winter’s dark, there shows a scar not unlike those upon the harvesters. A black ruin fragments Titan’s golden clouds, a mold pressed into wet clay. The clouds do not swallow this deformity, but move with care around its outer boundary, as if the scar is a physical thing possessing an edge not to be crossed.\n“Vas.”\nSickbay surrounds me, white and uncomfortably sterile, the walls close and without windows. Even though I cannot see Jupiter, I feel it pressing upon us, a watchful eye. I am strapped into an observation bed, Clemens looking down at me. Dillon sits nearby, Johns pacing the hall. Clemens could not wake me, he says as his hand enfolds my own. I do not move within that slight touch, thoughts anchored upon the thing I saw in Titan’s clouds.\n“You need to look,” I say. “You need to see.”\nThis is what I say; this is not what anyone hears. My voice is ragged from screaming and I make a feeble squeak. Clemens hands me a tablet and with shaky fingers, I scrawl the same words. I tell him about the clouds, the sound, about being in the pod and seeing— The ship. It was a ship on Titan, emerging. Life that doesn’t quite know what to do with itself after it finds its own level. Rippling waves, a tremor pushing from a liquid center, causing the contained life to creep up the walls, seeking escape.\nClemens reads the tablet and swipes a gentle hand across my short, bristled hair. His laugh is just as short, strangled, and I’m not sure if he can’t believe or believes so much that a long-last admission is terrifying. Clemens sees me back to my nook that night, and I hang uneasily at the window, watching Jupiter turn (listening for the voice), wondering at the scars that mark my hands, pale pink slashes criscrossing brown skin—as if my hands were once lifted to shield my face from helium rain.\nA dark shape moving in and out of the clouds as if— As if it were alive.\nAwake.\nAwake after winter’s dark.\nI do not sleep. I do not tether myself into the pocket, but float before Jupiter, waiting. And in time, the voice comes, bundles me into a descending pod, and waits in return, until I am close enough. I fall forever, for always, helium rain that should kill me instead now a comfort. I know the coldness against my skin. My hands grow new scars from its trespass, but I feel with each one that something inside me is emerging. Pushing itself out after a long winter dark. Creeping up the sides of this imperfectly sealed container.\nThe pod vibrates with the sound, the voice, and unfurls itself into the rain. The being in the clouds pushes itself closer, so close I can feel droplets of cloud against my marked cheeks. They are clouds of hydrogen, ammonia, and sweet water vapor. They should flood my lungs and strangle me, but—\nA long call across a very cold and dark ocean and you’ve been in the dark so long.\nI reach a scarred hand into the clouds and the clouds enfold me. They suckle at me as if to taste the droplets of blood welling from my wounds, to deconstruct and study them. A warm tongue, the weighted wetness surrounds me, swallows me. I float in a darkness that is not entirely dark, for spring is breaking, and there—there is the voice. It does not speak as I speak but together we create a kind of heterodyne, shifting voices into new ranges, churning them into something we can both understand.\nThey have slept and they are coming.\nThey have slept and they are waking.\nNo—we have slept and they are coming.\nWe heard you.\nThey heard me. My grandmother’s song.\nI jolt into awareness within the bright cathedral space of Galileo’s bay, an open and empty harvester on the floor beside me. Blood and water mingle in shallow pools on the flooring, running from my scalp, my shoulders, and you’ve been in the dark so long, so fucking long, you move toward it because it’s sunlight, and warmth and the weight of someone else against you when you’ve been weightless so very long. I spread my fingers in the wet, staring.\nI push myself up, but I am weak—so weak and how long was I—\nClemens is there, warm thunder, and Johns too, who has the sound of a very soft wind today, barely daring to breathe. They don’t look at me with anything resembling anger. It’s relief pure and simple that pours through them; Johns even laughs, gathers me into his arms and laughs, “Oh Christ where have you been?”\nBut they know, because the pod was planetside, they eventually tell me. The pod was submerged and they couldn’t recall it and I was missing. I was nowhere within Galileo Station.\nAnd then—\n“We saw one,” Clemens says.\nOn Ganymede, he tells me. Ganymede hanging stark and barren but for the black scar emerging from its head. If the scar possessed hands, Clemens saw it press those hands to the moon’s surface, so that something black and endless could pull itself from the water-ice womb of the cratered body. He said it moved like Titan from her saturnine shadow, but then that it was only shadows. It has to be, he whispers.\nIt isn’t.\nCallisto Station confirms another scar upon its face, but there is no telling how long it has lain upon the star-spangled moon. The scar marks the edge of the Asgard crater as if it has always been there. And Titan? What of distant Titan? Huygens Station confirms Titan has at least one such mark. Said it was on Europa, too. Said the wet darkness was waking, pushing itself into the stars.\n“Awake, not waking,” I say, and the sound (the voice) floods me—it is not airplanes or wind or any sound born of Earth; it is alien, dark and fathomless and unknowable, but still I know it, have made a language with it in the Jovian rain. It is curious. It is coming.\nWe have slept and they are coming. The voice in the night, the siren, the being no longer trapped. Pushing itself out after a long winter dark. Creeping up the sides of imperfectly sealed containers. A new red spot, cloud-cradled and rising.", "source": "https://clarkesworldmagazine.com/tobler_06_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Somewhere I Have Never Traveled (Third Sound Remix) by E. Catherine Tobler"}