{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "6+56bBmBTQkn0KF/45w8nIBl4gY=", "id": null, "license": null, "comments": "", "raw_text": "Interview  The Heart of the Story: A Conversation with Scott H. Andrews  Scott H. Andrews has over a dozen electric guitars, half of which he built himself, including one he started building in 2007. But then he launched Beneath Ceaseless Skies in 2008.  Beneath Ceaseless Skies (BCS) is a nonprofit, SFWA-qualifying online magazine dedicated to publishing “literary adventure fantasy: fantasy set in secondary-world or historical paranormal settings, written with a literary focus on the characters.” Within a few years of launch, the magazine was receiving Hugo Awards nominations. In 2013, Andrews received the first of several World Fantasy Award nominations. Since then, the magazine has been a Hugo finalist in the Semiprozine category. In 2016, the magazine won a British Fantasy Award for Best Magazine/Periodical, and Andrews won the World Fantasy Special Award, Non-Professional in 2019. BCS stories have garnered a slew of accolades, including regular appearances on Locus Recommended Reading lists, landing on most major genre awards lists, and being reprinted in notable anthologies.  Andrews has a PhD in biophysical chemistry, which, he says, he only uses “when I see TV chefs getting protein chemistry wrong.” As a teen he was the ecology teacher at his summer camp, where he spent time catching rattlesnakes. Over the years he has identified as chemistry lecturer, musician, woodworker, and connoisseur of stouts. But clearly, his heart was in fiction. Before launching BCS, Andrews graduated from the Odyssey Writing Workshop in 2005. In 2006 his piece called, “A Brief Swell of Twilight” won the $1,000 Briar Cliff Review short story prize, and his short story, “Excision” came out in Weird Tales in 2007.  Andrews lives in Virginia with his wife, two cats, overflowing bookcases, and hundreds of beer bottles from all over the world. About that guitar? “It probably won’t get finished until whenever BCS ends.”   In your 2017 Locus Spotlight, you quoted Faulkner. Do you mostly read genre or is your reading habit fairly broad? Was Faulkner a homework assignment, or did you grow up reading a lot of different kinds of books?  I grew up reading a lot, nonfiction too, but the fiction was mostly cool stuff that caught my eye or that I picked up from friends, like Lord of the Rings, Dune, and Earthsea; a lot of spy raid novels like Alistair MacLean; all the James Bond novels; some Heinlein juveniles; some early Stephen King. My mom would take us to the library and turn us loose, which was great. My granddaddy had a bookshelf of Mike Shayne Mystery Magazine, which I would tear through during family visits; that was my exposure to pulp short fiction.  My literary background comes mostly from the exceptional English classes I had in high school. We read the usual things like Shakespeare and The Great Gatsby, but we also read Crime and Punishment, Madame Bovary, multiple Faulkner novels, All the King’s Men, A Portrait of the Artist as a Young Man, Kate Chopin, Tennessee Williams, Eugene O’Neill, Virginia Woolf, Austen, the Brontës, Dickens, Hardy, Forster, Camus, Kafka, Gogol, Ralph Ellison, Bobbie Ann Mason, and García Márquez. It was overwhelming at the time, reading a hundred pages of Dostoevsky on the school bus each afternoon, but later I realized what a transformative experience it had been. I can’t claim to remember it all or understand it, but it gave me a background that I draw on to this day.  My current reading is embarrassingly scant. I’m so swamped with BCS reading these days that I rarely read other stuff. I always try to read all of the award-finalist short fiction pieces every year, and I read on the cell phone when traveling, but of course I haven’t been traveling this year. Some short fiction writers whose work I find brilliant are K.J. Parker, Cat Valente, Paolo Bacigalupi, and Ted Chiang.  What were some of the most influential genre books you read growing up, and how did they impact you?  The most influential fantasy books I read growing up were Lord of the Rings and Raymond E. Feist’s early epic fantasy novels. I read the Earthsea novels too, but they didn’t hit me quite as much as the classic pseudo-northern European medieval fantasy did, maybe because I was interested in Earth history as a kid and I had lived in England for a year and seen northern European castles and ancient ruins up close. Feist’s novels were great epic fantasy page-turners, with fun characters and a world-jeopardizing plot that still had a personal level to it. Lord of the Rings impacted me with the sense of history in it; the sense of past ages of civilization, and the people who had lived them and the works they built and knowledge they kept, and the current nostalgia and wistfulness for those accomplishments—for better or for worse—that were now lost or fallen.  From your years of editing BCS, are there one or two stories that stand out as particularly important or special? Or which exemplify, more than most, what a BCS story is?  For me, core things that “a BCS story” has are an interesting fantasy world, a focus on the characters and their goals and hopes and aches and yearnings, and emotional resonance—something emotionally moving or profound. Two stories that stand out to me are “Laws of Night and Silk” by Seth Dickinson and “Geometries of Belonging” by R.B. Lemberg.  “Laws of Night and Silk” has an elegant and rich literary voice to it, which is a thing that really engages me when it’s done so well that it’s effortless to read, and the conceit of the magic system is that the societies in that world do a hideously cruel thing to their children in order to give them apocalyptic magical power. The protagonist must shepherd such a child in order to fight a war, and her bitter rival is shepherding her own child. It’s epic, fantastical, moving, and haunting.  “Geometries of Belonging” is set in R.B. Lemberg’s Birdverse fantasy world, the same world as multiple of their BCS stories and their new novella from Tachyon, The Four Profound Weaves. The world is deeply rich and developed, with societal structures and a magic system that literalize real-world issues and situations that are profoundly important to R.B., and their passion for those things comes through in the characters and their interactions within those societies.  The protagonist is a bereaved person in a complex relationship who is trying to help a person who’s on the margins of that society, and all that protagonist wants is to belong; to find their place in their complicated life and world. There’s a lot at stake for the other characters and the society, but what made me cry when I read it was the simple core humanity of a person who just wants to find a place to belong. Isn’t that what all of us want? That to me is great literary secondary-world fantasy: a lush and fascinating world that’s commenting on important ideas, inhabited by characters who are achingly human.  One of the things people expect or love about fantasy fiction is worldbuilding. Are there one or two stories that stand out in your mind specifically for their worldbuilding?  For me, the best fantasy worldbuilding is worlds that are cool and awe-inspiring but that are also integral the story; worlds that impact the culture and the characters uniquely. R.B. Lemberg’s Birdverse stories are a great example. Two others that stand out to me are “The Secret of Pogopolis” by Matthew Bey and “Woe and Other Remedies” by Michael Anthony Ashley.  The locale in “The Secret of Pogopolis” is a city that bounces up and down like a giant pogo stick, and this condition has a strong and unique effect on the society and the characters. When the city reaches apogee, characters go to the peak of the city and revel in the moment of weightlessness that only occurs when the city has stopped ascending and is about to descend. When the city approaches perigee, the residents retreat to their homes and brood on special padded sofas that protect them from the impact of the city’s descent halting. It’s a very cool concept, and it affects the society and the characters.  “Woe and Other Remedies” feels to me significantly about the moral bankruptcy of slavery. The nobility in this fantasy society are decadent and selfish and effete, in vivid and exaggerated ways that captivate on the page, but also create a cutting satire. The protagonist is a low-level noble who remains mostly sympathetic as he tries vainly to compete, following the dictates of his society, but only gradually do some catastrophic consequences make him start to realize the horror of what he and his society are doing. The worldbuilding is vivid and creative, but it also makes me squirm as the catastrophe escalates while this portion of the society remains oblivious to the consequences and to their own behavior that caused it.  You have a number of short stories out as well, as a writer, including “Excision” in Weird Tales and “The Halberdier, by Moonlight” in On Spec. You won the 2006 Fiction Award from The Briar Cliff Review—a $1,000 prize—for your short story “A Brief Swell of Twilight.” Do you still write? Has editing impacted or changed the way you write?  I really enjoyed all three of those stories. “Excision” was postwar medicine as a magic system, and “The Halberdier, by Moonlight” did a specific thing with POV shifts that I’ve never seen done elsewhere.  I haven’t written fiction in many years. My writing these days is mostly working up single-session D&D adventures, to be played in three to four hours, which is a lot like a one-act play or flash fiction—there’s a build-up and one major turn. I’m fascinated by the storytelling aspect of DMing a tabletop RPG. The players make decisions based on their characters’ motivation and personality, like characters in fiction, but those decisions affect or even determine the plot, and the DM has to respond to that on the fly and keep the plot unfolding, while also controlling the pacing in real time. It’s a different type of storytelling, but I find it fascinating and a lot of fun.  I think my editing might impact my writing if I were ever able to edit my own words like I’m able to edit other peoples’, but I was never able to see my own work in that way. If I get back to fiction writing someday, I’m curious to see if that will be the case.  Does being a fiction writer give you a different editorial perspective, does it change the way you do things as an editor?  I think being a writer, and a workshop graduate, and the fact that I was only a mid-level writer who never quite broke through, gives me deep insight into what it’s like to be a new or emerging writer submitting to magazines, through the slush pile; hoping to get passed up to the head editor, desperate for any comments, and not understanding why stories didn’t catch on. I was in exactly that situation myself, for years, and I was never able to break through it.  That experience as an emerging writer strongly affected the way I do things as an editor. BCS’s policy of giving personalized comments in every rejection was a direct result of my experiences submitting to pro-rate zines, getting lots of form rejections, and being stunned and confused that my stories weren’t working for them. Giving our personalized comments is a huge amount of work, especially for our slush readers—Kerstin Hall, Deirdre Quirk, Rachel Morris, and Beth Horn—but for us it’s worth it. We often see new or emerging writers whose successive submissions to BCS get closer and closer to what we’re looking for, and who ultimately do sell a story to us.  My experience as an emerging writer also drives me to work with new and emerging writers on rewrite requests or a revise and resubmit, for stories that may have a large problem in my opinion—like, the ending doesn’t work—but that otherwise have an interesting character or world and a strong emotional investment from the author. In my experience, not every new writer’s debut story is going to be perfect or brilliant, but many stories that are very good yet not brilliant still deserve to be published and read, and many writers who may be writing very good stories now are ready to learn from the editorial process and from having an early story of theirs published, and often that publication and experience seems to be a first step for them in developing their career; often the next stories such writers send us are a level better than their first one that we bought, and their cover letter has new credits of stories they’ve since sold to other zines.  In my opinion, our field needs venues that will publish very good stories by new writers, not only brilliant stories by existing writers, because doing that can help more of today’s very good writers develop into tomorrow’s brilliant writers and advance the whole field.  How do you feel about dark fantasy and horror? How do you differentiate between the two, and do you enjoy or publish things with that sort of darker edge?  I personally don’t read much pure horror, but I’m fine with dark fantasy or horror elements in fantasy. I think an easy and semantic distinction would be whether the setting is innately fantastical aside from the horror element.  I do enjoy a darker edge to fantasy when it’s not gratuitous; when it’s essential to the character or the plot, and when it has an emotional significance and an emotional effect on the characters. That sort of horror element for me can have great emotional punch, especially when it’s as horrifying to the characters as it is to the reader. I’ve published some rather horrifying or gory stories, by authors like Greg Kurzawa, Eljay Daly, Mike Allen, and Jesse Bullington, but I’ve published more stories where the fantasy horror feels to me more psychological, by Greg Kurzawa and Mike Allen again.  We see magazines come and go, both in print and digital, and there are those magazines that have been around for decades. You started BCS in 2008. What do you think are the most important factors for magazine survivability; how do you achieve those things?  I think the most important factor for magazine survivability is commitment. Any magazine is going to get deluged with submissions; I think an unflagging commitment to replying in a timely manner, treating all writers with respect no matter their level of experience, publishing on schedule, maintaining consistent quality—basically, being professional in everything the magazine does—is huge in magazine building and maintaining a reputation as a worthy and trusted venue.  I think for indie zines, having workable finances is key for survivability. The financial setup for each zine is different; I think it’s important to have a setup that works for your zine, that’s realistic, and that you have set up well enough in advance that the magazine will be financially stable for at least a year, so that you can use that first year to establish your editorial vision and professional reputation. Fundraising opportunities after that point, like subscriptions or crowdfunding, in my opinion hinge on the magazine having a consistent vision and clear professionalism, which makes readers want to pay money for ebooks or donate or become a crowdfunding backer.  In your 2015 interview with S. C. Flynn you said, “The openings that do hook me seem to have a spark of individuality to them.” Many publications go through massive slush piles and will reject stories on the first page; some editors used to even have a “red line of death.” Are there some fairly common reasons why stories don’t make it out of slush; what does it take to get out of slush at BCS, and what does it take to make the sale?  The most common reason why a story doesn’t make it out of the BCS slush, although this is a bit flip as an answer, is that the story isn’t a BCS story. The complexity underlying that flip answer comes from the question of just what is a BCS story. I and our slush readers, Kerstin, Deirdre, Rachel, and Beth, have a good idea of what is a BCS story, but sometimes writers don’t quite have a handle on that yet. For example, we don’t publish classic-style swords & sorcery or D&D-type fantasy, but we still get sent a lot of it. (Which is why I think that a crucial thing for submitting writers to do is read multiple issues of any magazine that you’re submitting to.)  What it takes to get out of the slush, in my opinion, is a story with voice and/or with heart. The “spark of individuality” I mentioned in that 2015 interview is to me about voice: a story or an author having a voice that feels interesting or unusual in some way, often a subjectivity in the voice. I see a lot of stories that have a very objective voice, which for me can feel like the sterile perspective of a camera or of a character who has no investment, or stories whose voice reads to me very similar to the generic or writerly prose I see in the work of aspiring writers, who’ve absorbed prose tics from the fiction that has influenced them, but haven’t yet developed their own voice.  And heart. For me as a fan of character-centered fiction, I need for a story to move me emotionally. It’s not enough for me for a story to have a sympathetic character in an interesting setting who has a motivation and overcomes obstacles as they pursue their goal; I also need to care. I need the story to make me feel something. If I don’t care or the story doesn’t make me feel something, that story might be mechanically perfect, but it’s not going to engage me.  It’s rare, in my experience, for submission stories to have heart or to move me, and for me, all those stories stand out. Heart or spark is a thing I think new or emerging writers don’t always consider as much as they should. I think that was one of my problems when I was an emerging writer—most of my stories didn’t have heart, and so it didn’t matter that they might have been well put together. I was focused on nuts and bolts like POV and motivation and conflict rather than digging deep for something moving and writing a story that could make the reader cry. My story “Excision” that you mentioned above, which was in Ann VanderMeer’s Weird Tales, I found out years later from Ann that she remembered where she was when she first read it, and it had made her cry. That for me is what a story needs to do in order to stand out and get published. Every submission to BCS that has made me cry, I have bought. 🙂  When I teach writing classes, like for the Odyssey Workshop, one of my mantras for students and new writers is to dig deep into your own emotional experiences and write something that will make the reader FEEL something. That to me is the key to fiction that will engage readers; that will stand out in the slush pile and get bought and published.  A well-known editor once told me that he felt editorship should last seven years, and that after seven years the editor burns out, they get stuck in their habits, and the work they run gets stale. Do you feel like this applies to you or BCS? Or do you feel like running a magazine is still an endeavor of passion, that it’s still a place of discovery and innovation?  I’ve heard that too, in a talk by Gordon Van Gelder; the shelf life he mentioned was ten years. I definitely think there’s a core of truth in that idea. The commitment of running a magazine, that I mentioned earlier, is huge and incessant and definitely has the risk of burning the editor out.  At the time I heard that point from Gordon, I was in year eight or so of BCS, and his point made me stop and think and consider ways I could deliberately try to avoid getting stuck in my editorial sensibilities or having the work in BCS get stale. To me, the work that ends up in a magazine is a product of what stories the writers are submitting, and that in my opinion gives the editor the opportunity or the resources to keep the work fresh.  But I deliberately started trying to stretch myself out of my regular zone and to open myself to approaches or sensibilities that I had been less open to thus far. I published some stories that weren’t quite as tightly secondary-world setting as any I had published before, and I broadened my sensibilities in some areas of voice and tone that I had previously been a bit more narrow about. Basically, expanding my parameters a bit for what a BCS story is. The readership embraced those stories the same as all the others, and I really enjoyed stretching myself and publishing those great stories, so I’m glad that I heard that idea about editor shelf life, and that it inspired to me to take those actions to prevent BCS getting stale.  At the same time, I do feel that running a magazine is an endeavor of passion, even if you have to take steps to make sure the passion stays strong. For me, there’s always passion in the glee and delight of discovering a gem in the slush, or getting a story by a writer who’s subbed before and this new story is a leveling-up from their previous work. Those for me are the moments as an editor that make me feel alive, and they make editing for me feel very much still a place of discovery. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nThe Heart of the Story: A Conversation with Scott H. Andrews\nScott H. Andrews has over a dozen electric guitars, half of which he built himself, including one he started building in 2007. But then he launched Beneath Ceaseless Skies in 2008.\nBeneath Ceaseless Skies (BCS) is a nonprofit, SFWA-qualifying online magazine dedicated to publishing “literary adventure fantasy: fantasy set in secondary-world or historical paranormal settings, written with a literary focus on the characters.” Within a few years of launch, the magazine was receiving Hugo Awards nominations. In 2013, Andrews received the first of several World Fantasy Award nominations. Since then, the magazine has been a Hugo finalist in the Semiprozine category. In 2016, the magazine won a British Fantasy Award for Best Magazine/Periodical, and Andrews won the World Fantasy Special Award, Non-Professional in 2019. BCS stories have garnered a slew of accolades, including regular appearances on Locus Recommended Reading lists, landing on most major genre awards lists, and being reprinted in notable anthologies.\nAndrews has a PhD in biophysical chemistry, which, he says, he only uses “when I see TV chefs getting protein chemistry wrong.” As a teen he was the ecology teacher at his summer camp, where he spent time catching rattlesnakes. Over the years he has identified as chemistry lecturer, musician, woodworker, and connoisseur of stouts. But clearly, his heart was in fiction. Before launching BCS, Andrews graduated from the Odyssey Writing Workshop in 2005. In 2006 his piece called, “A Brief Swell of Twilight” won the $1,000 Briar Cliff Review short story prize, and his short story, “Excision” came out in Weird Tales in 2007.\nAndrews lives in Virginia with his wife, two cats, overflowing bookcases, and hundreds of beer bottles from all over the world. About that guitar? “It probably won’t get finished until whenever BCS ends.”\nIn your 2017 Locus Spotlight, you quoted Faulkner. Do you mostly read genre or is your reading habit fairly broad? Was Faulkner a homework assignment, or did you grow up reading a lot of different kinds of books?\nI grew up reading a lot, nonfiction too, but the fiction was mostly cool stuff that caught my eye or that I picked up from friends, like Lord of the Rings, Dune, and Earthsea; a lot of spy raid novels like Alistair MacLean; all the James Bond novels; some Heinlein juveniles; some early Stephen King. My mom would take us to the library and turn us loose, which was great. My granddaddy had a bookshelf of Mike Shayne Mystery Magazine, which I would tear through during family visits; that was my exposure to pulp short fiction.\nMy literary background comes mostly from the exceptional English classes I had in high school. We read the usual things like Shakespeare and The Great Gatsby, but we also read Crime and Punishment, Madame Bovary, multiple Faulkner novels, All the King’s Men, A Portrait of the Artist as a Young Man, Kate Chopin, Tennessee Williams, Eugene O’Neill, Virginia Woolf, Austen, the Brontës, Dickens, Hardy, Forster, Camus, Kafka, Gogol, Ralph Ellison, Bobbie Ann Mason, and García Márquez. It was overwhelming at the time, reading a hundred pages of Dostoevsky on the school bus each afternoon, but later I realized what a transformative experience it had been. I can’t claim to remember it all or understand it, but it gave me a background that I draw on to this day.\nMy current reading is embarrassingly scant. I’m so swamped with BCS reading these days that I rarely read other stuff. I always try to read all of the award-finalist short fiction pieces every year, and I read on the cell phone when traveling, but of course I haven’t been traveling this year. Some short fiction writers whose work I find brilliant are K.J. Parker, Cat Valente, Paolo Bacigalupi, and Ted Chiang.\nWhat were some of the most influential genre books you read growing up, and how did they impact you?\nThe most influential fantasy books I read growing up were Lord of the Rings and Raymond E. Feist’s early epic fantasy novels. I read the Earthsea novels too, but they didn’t hit me quite as much as the classic pseudo-northern European medieval fantasy did, maybe because I was interested in Earth history as a kid and I had lived in England for a year and seen northern European castles and ancient ruins up close. Feist’s novels were great epic fantasy page-turners, with fun characters and a world-jeopardizing plot that still had a personal level to it. Lord of the Rings impacted me with the sense of history in it; the sense of past ages of civilization, and the people who had lived them and the works they built and knowledge they kept, and the current nostalgia and wistfulness for those accomplishments—for better or for worse—that were now lost or fallen.\nFrom your years of editing BCS, are there one or two stories that stand out as particularly important or special? Or which exemplify, more than most, what a BCS story is?\nFor me, core things that “a BCS story” has are an interesting fantasy world, a focus on the characters and their goals and hopes and aches and yearnings, and emotional resonance—something emotionally moving or profound. Two stories that stand out to me are “Laws of Night and Silk” by Seth Dickinson and “Geometries of Belonging” by R.B. Lemberg.\n“Laws of Night and Silk” has an elegant and rich literary voice to it, which is a thing that really engages me when it’s done so well that it’s effortless to read, and the conceit of the magic system is that the societies in that world do a hideously cruel thing to their children in order to give them apocalyptic magical power. The protagonist must shepherd such a child in order to fight a war, and her bitter rival is shepherding her own child. It’s epic, fantastical, moving, and haunting.\n“Geometries of Belonging” is set in R.B. Lemberg’s Birdverse fantasy world, the same world as multiple of their BCS stories and their new novella from Tachyon, The Four Profound Weaves. The world is deeply rich and developed, with societal structures and a magic system that literalize real-world issues and situations that are profoundly important to R.B., and their passion for those things comes through in the characters and their interactions within those societies.\nThe protagonist is a bereaved person in a complex relationship who is trying to help a person who’s on the margins of that society, and all that protagonist wants is to belong; to find their place in their complicated life and world. There’s a lot at stake for the other characters and the society, but what made me cry when I read it was the simple core humanity of a person who just wants to find a place to belong. Isn’t that what all of us want? That to me is great literary secondary-world fantasy: a lush and fascinating world that’s commenting on important ideas, inhabited by characters who are achingly human.\nOne of the things people expect or love about fantasy fiction is worldbuilding. Are there one or two stories that stand out in your mind specifically for their worldbuilding?\nFor me, the best fantasy worldbuilding is worlds that are cool and awe-inspiring but that are also integral the story; worlds that impact the culture and the characters uniquely. R.B. Lemberg’s Birdverse stories are a great example. Two others that stand out to me are “The Secret of Pogopolis” by Matthew Bey and “Woe and Other Remedies” by Michael Anthony Ashley.\nThe locale in “The Secret of Pogopolis” is a city that bounces up and down like a giant pogo stick, and this condition has a strong and unique effect on the society and the characters. When the city reaches apogee, characters go to the peak of the city and revel in the moment of weightlessness that only occurs when the city has stopped ascending and is about to descend. When the city approaches perigee, the residents retreat to their homes and brood on special padded sofas that protect them from the impact of the city’s descent halting. It’s a very cool concept, and it affects the society and the characters.\n“Woe and Other Remedies” feels to me significantly about the moral bankruptcy of slavery. The nobility in this fantasy society are decadent and selfish and effete, in vivid and exaggerated ways that captivate on the page, but also create a cutting satire. The protagonist is a low-level noble who remains mostly sympathetic as he tries vainly to compete, following the dictates of his society, but only gradually do some catastrophic consequences make him start to realize the horror of what he and his society are doing. The worldbuilding is vivid and creative, but it also makes me squirm as the catastrophe escalates while this portion of the society remains oblivious to the consequences and to their own behavior that caused it.\nYou have a number of short stories out as well, as a writer, including “Excision” in Weird Tales and “The Halberdier, by Moonlight” in On Spec. You won the 2006 Fiction Award from The Briar Cliff Review—a $1,000 prize—for your short story “A Brief Swell of Twilight.” Do you still write? Has editing impacted or changed the way you write?\nI really enjoyed all three of those stories. “Excision” was postwar medicine as a magic system, and “The Halberdier, by Moonlight” did a specific thing with POV shifts that I’ve never seen done elsewhere.\nI haven’t written fiction in many years. My writing these days is mostly working up single-session D&D adventures, to be played in three to four hours, which is a lot like a one-act play or flash fiction—there’s a build-up and one major turn. I’m fascinated by the storytelling aspect of DMing a tabletop RPG. The players make decisions based on their characters’ motivation and personality, like characters in fiction, but those decisions affect or even determine the plot, and the DM has to respond to that on the fly and keep the plot unfolding, while also controlling the pacing in real time. It’s a different type of storytelling, but I find it fascinating and a lot of fun.\nI think my editing might impact my writing if I were ever able to edit my own words like I’m able to edit other peoples’, but I was never able to see my own work in that way. If I get back to fiction writing someday, I’m curious to see if that will be the case.\nDoes being a fiction writer give you a different editorial perspective, does it change the way you do things as an editor?\nI think being a writer, and a workshop graduate, and the fact that I was only a mid-level writer who never quite broke through, gives me deep insight into what it’s like to be a new or emerging writer submitting to magazines, through the slush pile; hoping to get passed up to the head editor, desperate for any comments, and not understanding why stories didn’t catch on. I was in exactly that situation myself, for years, and I was never able to break through it.\nThat experience as an emerging writer strongly affected the way I do things as an editor. BCS’s policy of giving personalized comments in every rejection was a direct result of my experiences submitting to pro-rate zines, getting lots of form rejections, and being stunned and confused that my stories weren’t working for them. Giving our personalized comments is a huge amount of work, especially for our slush readers—Kerstin Hall, Deirdre Quirk, Rachel Morris, and Beth Horn—but for us it’s worth it. We often see new or emerging writers whose successive submissions to BCS get closer and closer to what we’re looking for, and who ultimately do sell a story to us.\nMy experience as an emerging writer also drives me to work with new and emerging writers on rewrite requests or a revise and resubmit, for stories that may have a large problem in my opinion—like, the ending doesn’t work—but that otherwise have an interesting character or world and a strong emotional investment from the author. In my experience, not every new writer’s debut story is going to be perfect or brilliant, but many stories that are very good yet not brilliant still deserve to be published and read, and many writers who may be writing very good stories now are ready to learn from the editorial process and from having an early story of theirs published, and often that publication and experience seems to be a first step for them in developing their career; often the next stories such writers send us are a level better than their first one that we bought, and their cover letter has new credits of stories they’ve since sold to other zines.\nIn my opinion, our field needs venues that will publish very good stories by new writers, not only brilliant stories by existing writers, because doing that can help more of today’s very good writers develop into tomorrow’s brilliant writers and advance the whole field.\nHow do you feel about dark fantasy and horror? How do you differentiate between the two, and do you enjoy or publish things with that sort of darker edge?\nI personally don’t read much pure horror, but I’m fine with dark fantasy or horror elements in fantasy. I think an easy and semantic distinction would be whether the setting is innately fantastical aside from the horror element.\nI do enjoy a darker edge to fantasy when it’s not gratuitous; when it’s essential to the character or the plot, and when it has an emotional significance and an emotional effect on the characters. That sort of horror element for me can have great emotional punch, especially when it’s as horrifying to the characters as it is to the reader. I’ve published some rather horrifying or gory stories, by authors like Greg Kurzawa, Eljay Daly, Mike Allen, and Jesse Bullington, but I’ve published more stories where the fantasy horror feels to me more psychological, by Greg Kurzawa and Mike Allen again.\nWe see magazines come and go, both in print and digital, and there are those magazines that have been around for decades. You started BCS in 2008. What do you think are the most important factors for magazine survivability; how do you achieve those things?\nI think the most important factor for magazine survivability is commitment. Any magazine is going to get deluged with submissions; I think an unflagging commitment to replying in a timely manner, treating all writers with respect no matter their level of experience, publishing on schedule, maintaining consistent quality—basically, being professional in everything the magazine does—is huge in magazine building and maintaining a reputation as a worthy and trusted venue.\nI think for indie zines, having workable finances is key for survivability. The financial setup for each zine is different; I think it’s important to have a setup that works for your zine, that’s realistic, and that you have set up well enough in advance that the magazine will be financially stable for at least a year, so that you can use that first year to establish your editorial vision and professional reputation. Fundraising opportunities after that point, like subscriptions or crowdfunding, in my opinion hinge on the magazine having a consistent vision and clear professionalism, which makes readers want to pay money for ebooks or donate or become a crowdfunding backer.\nIn your 2015 interview with S. C. Flynn you said, “The openings that do hook me seem to have a spark of individuality to them.” Many publications go through massive slush piles and will reject stories on the first page; some editors used to even have a “red line of death.” Are there some fairly common reasons why stories don’t make it out of slush; what does it take to get out of slush at BCS, and what does it take to make the sale?\nThe most common reason why a story doesn’t make it out of the BCS slush, although this is a bit flip as an answer, is that the story isn’t a BCS story. The complexity underlying that flip answer comes from the question of just what is a BCS story. I and our slush readers, Kerstin, Deirdre, Rachel, and Beth, have a good idea of what is a BCS story, but sometimes writers don’t quite have a handle on that yet. For example, we don’t publish classic-style swords & sorcery or D&D-type fantasy, but we still get sent a lot of it. (Which is why I think that a crucial thing for submitting writers to do is read multiple issues of any magazine that you’re submitting to.)\nWhat it takes to get out of the slush, in my opinion, is a story with voice and/or with heart. The “spark of individuality” I mentioned in that 2015 interview is to me about voice: a story or an author having a voice that feels interesting or unusual in some way, often a subjectivity in the voice. I see a lot of stories that have a very objective voice, which for me can feel like the sterile perspective of a camera or of a character who has no investment, or stories whose voice reads to me very similar to the generic or writerly prose I see in the work of aspiring writers, who’ve absorbed prose tics from the fiction that has influenced them, but haven’t yet developed their own voice.\nAnd heart. For me as a fan of character-centered fiction, I need for a story to move me emotionally. It’s not enough for me for a story to have a sympathetic character in an interesting setting who has a motivation and overcomes obstacles as they pursue their goal; I also need to care. I need the story to make me feel something. If I don’t care or the story doesn’t make me feel something, that story might be mechanically perfect, but it’s not going to engage me.\nIt’s rare, in my experience, for submission stories to have heart or to move me, and for me, all those stories stand out. Heart or spark is a thing I think new or emerging writers don’t always consider as much as they should. I think that was one of my problems when I was an emerging writer—most of my stories didn’t have heart, and so it didn’t matter that they might have been well put together. I was focused on nuts and bolts like POV and motivation and conflict rather than digging deep for something moving and writing a story that could make the reader cry. My story “Excision” that you mentioned above, which was in Ann VanderMeer’s Weird Tales, I found out years later from Ann that she remembered where she was when she first read it, and it had made her cry. That for me is what a story needs to do in order to stand out and get published. Every submission to BCS that has made me cry, I have bought. 🙂\nWhen I teach writing classes, like for the Odyssey Workshop, one of my mantras for students and new writers is to dig deep into your own emotional experiences and write something that will make the reader FEEL something. That to me is the key to fiction that will engage readers; that will stand out in the slush pile and get bought and published.\nA well-known editor once told me that he felt editorship should last seven years, and that after seven years the editor burns out, they get stuck in their habits, and the work they run gets stale. Do you feel like this applies to you or BCS? Or do you feel like running a magazine is still an endeavor of passion, that it’s still a place of discovery and innovation?\nI’ve heard that too, in a talk by Gordon Van Gelder; the shelf life he mentioned was ten years. I definitely think there’s a core of truth in that idea. The commitment of running a magazine, that I mentioned earlier, is huge and incessant and definitely has the risk of burning the editor out.\nAt the time I heard that point from Gordon, I was in year eight or so of BCS, and his point made me stop and think and consider ways I could deliberately try to avoid getting stuck in my editorial sensibilities or having the work in BCS get stale. To me, the work that ends up in a magazine is a product of what stories the writers are submitting, and that in my opinion gives the editor the opportunity or the resources to keep the work fresh.\nBut I deliberately started trying to stretch myself out of my regular zone and to open myself to approaches or sensibilities that I had been less open to thus far. I published some stories that weren’t quite as tightly secondary-world setting as any I had published before, and I broadened my sensibilities in some areas of voice and tone that I had previously been a bit more narrow about. Basically, expanding my parameters a bit for what a BCS story is. The readership embraced those stories the same as all the others, and I really enjoyed stretching myself and publishing those great stories, so I’m glad that I heard that idea about editor shelf life, and that it inspired to me to take those actions to prevent BCS getting stale.\nAt the same time, I do feel that running a magazine is an endeavor of passion, even if you have to take steps to make sure the passion stays strong. For me, there’s always passion in the glee and delight of discovering a gem in the slush, or getting a story by a writer who’s subbed before and this new story is a leveling-up from their previous work. Those for me are the moments as an editor that make me feel alive, and they make editing for me feel very much still a place of discovery.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/andrews_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Heart of the Story: A Conversation with Scott H. Andrews by Arley Sorg"}