{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "P H Lee", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "PHXEK0hvCBL8flNoXKWwaBJ63/U=", "id": null, "license": null, "comments": "", "raw_text": "3710 words, short story  An Arc of Lightning Across the Eye of God  Zhou Wenshu was the young magistrate of Shenkong Bian and he was feeling every inch of that appointment. Today he had learned that the plastic floor of his office—the largest personal room in Shenkong Bian—was exactly four-and-a-half steps. It was the least interesting thing that he had learned today, and he’d learned it by pacing back and forth at yin shi (outpost time; wei shi capital time) when he should have been in bed.  One two three four fi—and turn. One two three four fi—and turn again.  Lei Shu—his assistant, twice his age and permanent outpost staff—had helpfully laid out a selection of brushes, freshly ground ink (both magnetic and permanent), some remarkably high-quality paper, and the secret imperial memorandum seal. Only the magistrate was supposed to have access to the secret imperial memorandum seal, but he’d only arrived at Shenkong Bian a month ago and could barely find the bathroom. And under the circumstances—  Under the circumstances.  Zhou stopped and shivered. She was still here, in this outpost, probably only a few feet away from him. Under the circumstances.  He wanted a drink.  He had sent Lei Shu off to sleep for the night, but he was sure that the older man was still there, right outside his door. He could call for a drink and get one in a minute, maybe less. Under the circumstances, no one would blame him.  He started pacing again. One two three four fi—and turn.  It wasn’t supposed to be like this. It had all seemed so simple, five months ago in the governor’s mansion with his uncle. Shenkong Bian was a hardship posting without the hardship. He’d be eligible for promotion in only two years, and with a glowing reference from His Lordship besides. Shenkong Bian had no taxes to collect, no levies to maintain, no peasants to murder each other in their incomprehensible dialects. It was even at an unusual transit point—an opportunity to really use all the physics he’d studied at the academy.  All he had to do was keep his nose clean. No repeats of the incident. The governor hadn’t mentioned it, of course, but they all knew. His uncle and the governor had worked out the details of the assignment while Zhou stared at his shoes, ashamed, and barely said a word.  It wasn’t just the career opportunity, he’d told himself. The Shenkong Bian transit point was physically fascinating—it behaved like a normal transit point, but nothing that passed through it ever returned. The astronauts had their wild stories, of course, mostly involving a transit point right into hell itself. Zhou, with his fresh physics degree, had his own theories involving an as-of-yet-undetected magnetic monopole.  Of course there’d been no mention of physics once he’d gotten to the neglected outpost. Shenkong Bian barely received the resources to maintain its hull, let alone perform any of the experiments he’d planned. And now, this. It was all too much.  Zhou sat down at his desk and fingered the paper. It really was high quality. How had Lei Shu gotten his hands on it? He waved away the thought. It didn’t matter. What mattered was the creature—no, the girl.  Zhou called up the rough transcript of the interview and selected a brush. Dipping it into the cool magnetic ink Lei Shu had ground for him, he began to write:            In the seventh year of the  Forthright EMPEROR, Eighth month, fourteenth day, wei shi, Your servant Zhou Wenshu, magistrate of Shenkong Bian humbly bowing before you, reports: This morning, chou shi, there came through Shenkong transit point No, that was wrong. She hadn’t come through the point then. They had no idea when she’d come through, or if she’d even come through the point at all, because they hadn’t been monitoring it. Why would they monitor it? Nothing came through.  Except, of course, something—someone—had come through.  Zhou breathed carefully—in. Out. In. Out. The emperor wouldn’t care about these details, so the emperor didn’t need to know them. He wet the tip of his brush. Just the basics, that was fine.            This morning, chou shi, your servants of the Shenkong Bian discovered, in the vicinity of Shenkong transit point, a vessel of foreign origin. No, not a vessel. A creature. A person. A girl.  But how could he say that? Secret memoranda were about big civic projects, enemy troop movements, tax revolts. A girl? Alone? In space? Impossible.            This morning, chou shi your servants of the Shenkong Bian discovered, in the vicinity of Shenkong transit point, a foreign object of unknown origin. Upon inspection, it became apparent that this object was, shockingly. No, not “shockingly.” Don’t tell the emperor how he feels.            Upon visual inspection, your servants found this object was in the shape of a woman, covered in some sort of black space suit, and very much alive. Acting in accordance with my duties as your magistrate, I led the crew of Shenkong Bian outpost in mounting a rescue operation. No need to mention their confusion; no need to mention the almost-an-hour they’d spent finding their search and rescue gear; no need to mention that even as they were finally suiting up to rescue her, she uncurled, and somehow, impossibly, began to drift herself to intercept them.  Definitely no need to mention that she had been signing at them the entire time.            Once the subject had been recovered,  conscious and alive, from where she had been stranded in space, she refused any medical aid or examination, or even to remove her suit at all. We found that she was completely unresponsive to speech, both in Imperial language and in every local dialect. However one of the outpost staff, a former merchant astronaut, could communicate with her in simple astronaut’s sign. No need to mention that the man barely spoke Imperial at all, that they needed to use two translators just to have a conversation.            could communicate with her in simple  astronaut’s sign, which she responded to with great enthusiasm. Thus I, your servant, was able to interview her about her past, her people, and her presence in Imperial space. In the interest of In the interest of? No. This was so much more than that. This was more than a passing curiosity. This was almost certainly the most important thing that had happened to the empire, ever. The emperor needed to know this. Just say it plainly.            I have attached a transcript of this interview for Your Majesty’s immediate perusal. As this matter is of critical importance, I have not edited the transcript and have not amended or elided anything in the above report. I await your response and guidance on this matter. INTERVIEW TRANSCRIPT  Location: Common Room, Shenkong Bian Outpost Time: Chen Shi (Capital Time) Present: Zhou Wenshu, magistrate. Lei Shu, assistant to the magistrate. Wu Gongpian, transcriptionist. Siggurdson Viktor, outpost staff, translating. Zhou Ami, outpost staff, translating.   Zhou: Hello. My name is Zhou Wenshu. I am the magistrate at this outpost.  Subject: Yes.  Zhou: If it’s all right with you, I would like to ask you a few questions. And the transcriptionist here will record your answers.  Subject: It’s all right with me.  Zhou: You can understand this language? The sign?  Subject: Yes, I can understand this sign. It is one of my father’s languages, I have learned it from he, my father, who learned it from [sign unrecognizable], but past that the wake of history is lost.  Zhou: Who was your father?  Subject: My father was. [here she makes the phonetic sign marker, then pauses] Zhou: Go on.  Subject: It is not his real name.  Zhou: Tell us his real name, then.  Subject: [ejects something wet onto the table] Zhou: What is that? What is that? Is it dangerous? [transcript pauses] Zhou: Please don’t do that again.  Subject: You asked me my father’s name. That is his name.  Zhou: That isn’t any kind of name at all. That’s just a disgusting pile of goo.  Subject: [still, silent] Zhou: Why did you say that was his name? Are you that disrespectful to your father?  Subject: I love my father, and so I remember my father.  Zhou: He’s passed?  Subject: Yes. Recently.  Zhou: So you are in mourning?  Subject: I am always in mourning.  Zhou: But, is it still within the mourning period?  Subject: I am always in mourning.  Zhou: I mean, the three years.  Subject: Yes.  Zhou: My condolences.  Subject: Yes.  Zhou: Did your father have any other name? That doesn’t involve . . . whatever that is?  Subject: [signing phonetically: Gunnar] son of [signing phonetically: Gunnar].  Zhou: An astronaut, then.  Subject: Yes.  Zhou: What ship?  Subject: I don’t want to talk about my father anymore. It is too [unknown sign].  Zhou: My condolences again.  Subject: [still, silent] Zhou: May I ask you other questions?  Subject: Please.  Zhou: What is your name?  Subject: Are you sure?  Zhou: Of course.  Subject: Last time you didn’t want me to say a name.  Zhou: The . . . spit?  Subject: You said it was disgusting. My father’s name.  Zhou: Phonetic signing will be fine.  Subject: Not phonetic.  Zhou: What?  Subject: [several unintelligible signs] do not speak language.  Zhou: What?  Subject: My people [same several unintelligible signs] do not make [pause] things to hear.  Zhou: Sound?  Subject: Sound. Yes. We do not make sound.  Zhou: Then how do you communicate? In sign?  Subject: No, these signs I learned from my father, from my father’s people, like you.  Zhou: No, your father is Icelandic. I am Imperial.  Subject: I am confused.  Zhou: Your father and I are from different peoples.  Subject: But you are both [unintelligible sign]?  Zhou: Never mind. Is there at least a name we could call you?  Subject: There is a name my father gave me, but it isn’t really my name.  Zhou: How can you be so disrespectful of your father?  Subject: I love my father. I don’t know the sign [respect] but I love my father and so I remember him.  Zhou: But the name your father gave you is your real name.  Subject: No, my real name was built by my mother out of my father’s name and my mother’s [unintelligible sign]. Then she grew me from it.  Zhou: But what can we call you?  Subject: My father called me “An Arc of Lightning Across the Eye of God.”  Zhou: That’s a very unusual name.  Subject: It is very short, yes.  Zhou: Can we call you “Lightning”?  Subject: That is even shorter. That is barely a word.  Zhou: It will be easier for [gestures, indicating transcriptionist].  Lightning: That is fine, then. But it is not my name.  Zhou: I understand.  Lightning: You don’t. Or you would have tasted my father’s name.  Zhou: Tasted? You mean heard.  Lightning: No, tasted. No sounds in our language.  Zhou: Oh.  Lightning: With your [unintelligible sign].  Zhou: We’ll using “Lightning” for now.  Lightning: That is fine.  Zhou: Where are you from?  Lightning: We are from [unintelligible sign].  Zhou: I’m sorry, our man here doesn’t know that sign.  Lightning: Do you have someone here who knows asteroids and planets? Orbits. It would be easier.  Zhou: He’s the only one in the outpost who knows astronaut’s sign.  Lightning: Okay. We are from heaven.  Zhou: Heaven? You sound like a Christian.  Lightning: I don’t know the sign “Christian.” We are from heaven.  Zhou: Who do you mean by “we”?  Lightning: My family. My [unintelligible sign].  Zhou: But your father is Icelandic.  Lightning: True. I meant my mother’s [unintelligible sign]. The ones who grew me.  Zhou: When you say heaven, what do you mean?  Lightning: Heaven is not like this. Not hot. Not burning. Not so many [unintelligible sign] [brief discussion with translator]. Not so many gasses all bound together in an aluminum shell. Heaven is vast and in every direction and empty and ours.  Zhou: You mean “space.”  Lightning: Yes. Space. Heaven.  Zhou: So you don’t mean heaven in the religious sense.  Lightning: Yes. We are religious.  Zhou: No, I meant.  Lightning: You meant?  Zhou: You’re religious? What religion?  Lightning: We are [several unintelligible signs].  Zhou: I don’t understand those words.  Lightning: We must make a conversation-sign for this. [discussion with translator] Lightning: This is difficult. There are important religious words.  Zhou: I understand.  Lightning: You don’t understand. If you understood, you would taste them.  Zhou: Don’t insult me.  Lightning: I did not mean to insult you. I apologize. I am simply saying that these words are sacred. They were writ into our names by God. To change them, to make them into signs, into another language: It is blasphemous and unfilial.  Zhou: Unfilial?  Lightning: Yes. God is—what’s the sign?—our maternal grandfather. [unintelligible sign] is our maternal grandmother.  Zhou: You speak metaphorically.  Lightning: No. I can show you, if you will taste it, in our [unintelligible sign], where God wrote His image onto us.  Zhou: Can someone please tell me what that sign meant? [some discussion between translators] Zhou: Get Doctor Xu in here. [further discussion; Dr. Xu Zhenbang arrives] Zhou: So, by this sign [signs: gene] you mean genetic code.  Lightning: Yes, a name.  Zhou: And you are all like this? All your people.  Lightning: We are not people. We are [unintelligible sign].  Zhou: You are not people?  Lightning: Yes. We are not people.  Zhou: What are you?  Lightning: We are [several unintelligible signs]. We are the word of God, writ on the fabric of heaven.  Zhou: So you’re saying you’re a different species than us.  Lightning: I don’t know the sign “species.” We have different names, yes. Different genes.  Zhou: Would you consent to remove your space suit and let Doctor Xu here examine you?  Lightning: I do not know the sign [space suit].  Zhou: The clothes you are wearing. That protects you from the vacuum.  Lightning: I cannot.  Zhou: Are you worried about modesty? We can arrange for a woman to be present.  Lightning: It is not. This is me.  Zhou: What is you?  Lightning: This is my body. [multiple people talking simultaneously] Zhou: Quiet down, everyone, Doctor Xu. What do you mean, Lightning?  Lightning: I mean that there is nothing to take off. This is me as I was grown from my father’s name and my mother’s [unintelligible sign]. I think you have mistaken my skin for a so-called space suit.  Zhou: Why is your skin like this?  Lightning: I was grown for this. [multiple people talking simultaneously] Zhou: Okay! That’s enough! Everybody be quiet. Lightning, are you saying you were genetically engineered?  Lightning: I do not know the sign “engineer.”  Zhou: “Genetically engineered” means that your genetic code was altered before you were born, restricting your potential, limiting you to specific tasks and professions.  Lightning: Yes. My mother named me.  Zhou: But this is horrible! A crime!  Lightning: I love my mother. I remember her.  Zhou: Yes, it is natural that you love your mother. But what she has done to you—making you into a thing—is unnatural and wrong.  Lightning: But if my mother had not made me, I would not exist.  Zhou: It is only natural that you feel a filial debt to your parents for birthing you. But you must understand that what your mother did to you was wrong.  Lightning: I do not understand. Is this because of my skin?  Zhou: Yes, among other things.  Lightning: It is because of my skin and my lungs that I can survive here, in your fire, with all the gasses packed together.  Zhou: But we can all survive here.  Lightning: Yes, but you are [unintelligible sign]. You cannot survive outside, in heaven, under the eye of God.  Zhou: Still, genetically engineering your own children. It’s not right.  Lightning: My skin is a gift from my mother. It is not a crime. My lungs are a gift from my father. They are also not a crime.  Zhou: Your lungs?  Lightning: Yes, they are particular.  Zhou: What do you mean?  Lightning: Most of [unintelligible sign] do not have lungs. But, for me, they let me into my father’s world. Into this fire.  Zhou: Why?  Lightning: I understand the signs “why” and “?” but I do not understand what you mean by “why?”  Zhou: Why have you come here?  Lightning: There are two parts.  Zhou: Go on.  Lightning: First, I have come to tell my father’s family that he is dead.  Zhou: If he travelled through the Shenkong transit point, he’s been legally dead for many years.  Lightning: Nonetheless, they are his family. They deserve to know.  Zhou: I see.  Lightning: It is because I love my father.  Zhou: It is only natural.  Lightning: The second part is also because I love my father, but I am worried.  Zhou: Why are you worried?  Lightning: Because it is about my purpose.  Zhou: What they made you for?  Lightning: Yes. And that upset you. I did not intend to upset you.  Zhou: It is an upsetting topic.  Lightning: Why?  Zhou: It’s slavery.  Lightning: I don’t understand the sign “slavery.”  Zhou: It’s treating people like things. Things that can be owned.  Lightning: I am not a person and I am not a thing and I don’t understand the sign “owned.”  Zhou: You’re clearly a person! I speak to you and can see that you have the same humanity as all of us.  Lightning: I am not a person. I am not! I am so much more than that. I am my father’s name, written by my mother’s vision across time and space. I am a hand of peace offered from the [several unintelligible signs] to every one of you. I am a message of hope of the divine for those confined in fire and darkness and gravity. I am my great and wonderful purpose and I am the fulfillment of that purpose.  Zhou: What is that purpose?  Lightning: To come here. To speak to you. All of you.  Zhou: What is it that you want to tell us?  Lightning: I am sorry. I cannot sign it.  Zhou: How can you tell us, then?  Lightning: Do you have someone here who can read—what was the sign?—who can read genes?  Zhou: What do you mean?  Lightning: Someone who can understand real language.  Zhou: What’s “real language”?  Lightning: [gestures towards the table] Is it okay if I [unintelligible sign] something here?  Zhou: Go ahead.  Lightning: It won’t upset you?  Zhou: It’s fine.  Lightning: [ejects something wet onto the table, in substantially larger quantity than the previous time] Lightning: This is real language. [unintelligible sign]. Genes.  Zhou: [shudders] Lightning: Are you going to taste it?  Zhou: I don’t know if it’s safe.  Lightning: It’s safe. Taste it.  Zhou: I. I don’t think that.  Lightning: You will not understand unless you taste it.  Zhou: Dr. Xu? Can you analyze a sample of this please?  Lightning: [gesturing to table] This is my name. This is me. Taste me and you will understand. [stands up, begins to gesture violently] Taste me! Meet me! Understand!  Zhou: Can someone restrain her?  Lightning: This is me, and within me, my father. This is me, and within me, my mother, and within my mother, [unintelligible sign], and within [unintelligible sign], the image of God.  Zhou: Someone?!  Lightning: [unintelligible signs, likely in an unknown language] Zhou Wenshu looked at the transcript on his desk, at the brushes, at Dr. Xu’s incomprehensible report that he had begged the magistrate to include with his memorial. Zhou didn’t understand it. Something about multiple compound DNA structures.  Dr. Xu had been very impressed. “If this really is her DNA, she’s more closely related to a strand of yili grass than to you or me,” he’d said, as if that made any sense. “Her genetic density is simply incredible, particularly for an animal species.”  They’d confined her, with apologies, to the brig, but Zhou had her moved to guest quarters. The circumstances hadn’t been entirely her fault. He had asked her to show him, after all. And she was a young woman—a young stalk of flowering grass?—in mourning for her father.  His train of thought was interrupted by a hammering noise coming from the hull. Were the men finally patching it? This late at night? He supposed he shouldn’t care about the timing—good enough that they were doing it at all.  He was pacing again.  A woman—or whatever she was—mourning for her father. That was it, wasn’t it? It didn’t matter if she was a flower or a human or, in what absurdly was becoming the most likely scenario, a sort of wholly alien life, a first first-contact for the Empire. What mattered was that she mourned her parents, just like he would mourn his parents someday soon. What bound them was not genetics or culture, but that shared humane understanding. Recognizing that, who was he to stand in the way of her filial duty?  One two three four fi—and turn.  But—then—no. That wasn’t right at all. She was a genetically engineered slave, a purpose-built tool, designed to contact and infiltrate the empire. She’d said as much herself. And, even if she wasn’t secretly an assassin or saboteur, she brought with her a bizarre religion and her upsetting concepts of language, parentage, and God. The empire’s stability hung, as it always had, by a thread. What revolts would stir up in her wake?  fi—and turn.  And then, of course, he had to think of what the imperial court would do once they learned of her. Would they righteously allow her to visit her relatives and return unmolested? Could they even do that? Or would they capture her, interrogate her, even dissect her, trying to discover the biological secrets she carried. Could he really send this report, at all, knowing that it would likely doom her? Could he trust even the emperor with this secret?  There was that pounding on the hull again.  The hull!  Zhou stopped suddenly and then leapt for the door. Here he was, fretting about his decision, but all along she’d been the one—  Through his office door—not pausing by a sleeping Lei Shu—he hurried down the corridor in a quick shuffle, the fastest he could manage without becoming tangled in his robes. The hull breach alarm was already blaring. By the time he reached her room, sealed off by the automatic pressure doors, she was gone.    Particular thanks to Dr. Alexis Siemon for their expertise and advice about the lives and careers of Yongzheng-era magistrates. P H Lee lives with the rose bushes behind an old walnut tree down a dead-end road out past the highway. Their other writing has appeared in Uncanny Magazine, Visions Magazine, Worlds Without Master, and Four Ways to Die in the Future. Their hobbies include cooking and translating Classical Chinese texts.", "text": "3710 words, short story\nAn Arc of Lightning Across the Eye of God\nZhou Wenshu was the young magistrate of Shenkong Bian and he was feeling every inch of that appointment. Today he had learned that the plastic floor of his office—the largest personal room in Shenkong Bian—was exactly four-and-a-half steps. It was the least interesting thing that he had learned today, and he’d learned it by pacing back and forth at yin shi (outpost time; wei shi capital time) when he should have been in bed.\nOne two three four fi—and turn. One two three four fi—and turn again.\nLei Shu—his assistant, twice his age and permanent outpost staff—had helpfully laid out a selection of brushes, freshly ground ink (both magnetic and permanent), some remarkably high-quality paper, and the secret imperial memorandum seal. Only the magistrate was supposed to have access to the secret imperial memorandum seal, but he’d only arrived at Shenkong Bian a month ago and could barely find the bathroom. And under the circumstances—\nUnder the circumstances.\nZhou stopped and shivered. She was still here, in this outpost, probably only a few feet away from him. Under the circumstances.\nHe wanted a drink.\nHe had sent Lei Shu off to sleep for the night, but he was sure that the older man was still there, right outside his door. He could call for a drink and get one in a minute, maybe less. Under the circumstances, no one would blame him.\nHe started pacing again. One two three four fi—and turn.\nIt wasn’t supposed to be like this. It had all seemed so simple, five months ago in the governor’s mansion with his uncle. Shenkong Bian was a hardship posting without the hardship. He’d be eligible for promotion in only two years, and with a glowing reference from His Lordship besides. Shenkong Bian had no taxes to collect, no levies to maintain, no peasants to murder each other in their incomprehensible dialects. It was even at an unusual transit point—an opportunity to really use all the physics he’d studied at the academy.\nAll he had to do was keep his nose clean. No repeats of the incident. The governor hadn’t mentioned it, of course, but they all knew. His uncle and the governor had worked out the details of the assignment while Zhou stared at his shoes, ashamed, and barely said a word.\nIt wasn’t just the career opportunity, he’d told himself. The Shenkong Bian transit point was physically fascinating—it behaved like a normal transit point, but nothing that passed through it ever returned. The astronauts had their wild stories, of course, mostly involving a transit point right into hell itself. Zhou, with his fresh physics degree, had his own theories involving an as-of-yet-undetected magnetic monopole.\nOf course there’d been no mention of physics once he’d gotten to the neglected outpost. Shenkong Bian barely received the resources to maintain its hull, let alone perform any of the experiments he’d planned. And now, this. It was all too much.\nZhou sat down at his desk and fingered the paper. It really was high quality. How had Lei Shu gotten his hands on it? He waved away the thought. It didn’t matter. What mattered was the creature—no, the girl.\nZhou called up the rough transcript of the interview and selected a brush. Dipping it into the cool magnetic ink Lei Shu had ground for him, he began to write:\nIn the seventh year of the\nForthright EMPEROR,\nEighth month, fourteenth day, wei shi,\nYour servant Zhou Wenshu, magistrate of Shenkong\nBian humbly bowing before\nyou, reports: This morning, chou shi, there came\nthrough Shenkong transit point\nNo, that was wrong. She hadn’t come through the point then. They had no idea when she’d come through, or if she’d even come through the point at all, because they hadn’t been monitoring it. Why would they monitor it? Nothing came through.\nExcept, of course, something—someone—had come through.\nZhou breathed carefully—in. Out. In. Out. The emperor wouldn’t care about these details, so the emperor didn’t need to know them. He wet the tip of his brush. Just the basics, that was fine.\nThis morning, chou shi,\nyour servants of the Shenkong Bian discovered, in\nthe vicinity of Shenkong transit point,\na vessel of foreign origin.\nNo, not a vessel. A creature. A person. A girl.\nBut how could he say that? Secret memoranda were about big civic projects, enemy troop movements, tax revolts. A girl? Alone? In space? Impossible.\nThis morning, chou shi\nyour servants of the Shenkong Bian discovered,\nin the vicinity of Shenkong transit point,\na foreign object of unknown origin. Upon\ninspection, it became apparent that this\nobject was, shockingly.\nNo, not “shockingly.” Don’t tell the emperor how he feels.\nUpon visual inspection,\nyour servants found this object was in the shape\nof a woman, covered in some sort of black\nspace suit, and very much alive. Acting in\naccordance with my duties as\nyour magistrate, I led the crew of Shenkong Bian\noutpost in mounting a rescue operation.\nNo need to mention their confusion; no need to mention the almost-an-hour they’d spent finding their search and rescue gear; no need to mention that even as they were finally suiting up to rescue her, she uncurled, and somehow, impossibly, began to drift herself to intercept them.\nDefinitely no need to mention that she had been signing at them the entire time.\nOnce the subject had been recovered,\nconscious and alive, from where she had\nbeen stranded in space, she refused\nany medical aid or examination, or even\nto remove her suit at all. We found\nthat she was completely unresponsive to\nspeech, both in\nImperial language and in every local dialect.\nHowever one of the outpost staff, a\nformer merchant astronaut, could\ncommunicate with her in simple\nastronaut’s sign.\nNo need to mention that the man barely spoke Imperial at all, that they needed to use two translators just to have a conversation.\ncould communicate with her in simple\nastronaut’s sign, which she responded\nto with great enthusiasm. Thus I,\nyour servant, was able to interview her about\nher past, her people, and her presence in\nImperial space. In the interest of\nIn the interest of? No. This was so much more than that. This was more than a passing curiosity. This was almost certainly the most important thing that had happened to the empire, ever. The emperor needed to know this. Just say it plainly.\nI have attached a transcript of this\ninterview for\nYour Majesty’s immediate perusal. As this matter\nis of critical importance, I have not\nedited the transcript and have\nnot amended or elided anything in the\nabove report. I await\nyour response and guidance on this matter.\nINTERVIEW TRANSCRIPT\nLocation: Common Room, Shenkong Bian Outpost\nTime: Chen Shi (Capital Time)\nPresent: Zhou Wenshu, magistrate. Lei Shu, assistant to the magistrate. Wu Gongpian, transcriptionist. Siggurdson Viktor, outpost staff, translating. Zhou Ami, outpost staff, translating.\nZhou: Hello. My name is Zhou Wenshu. I am the magistrate at this outpost.\nSubject: Yes.\nZhou: If it’s all right with you, I would like to ask you a few questions. And the transcriptionist here will record your answers.\nSubject: It’s all right with me.\nZhou: You can understand this language? The sign?\nSubject: Yes, I can understand this sign. It is one of my father’s languages, I have learned it from he, my father, who learned it from [sign unrecognizable], but past that the wake of history is lost.\nZhou: Who was your father?\nSubject: My father was. [here she makes the phonetic sign marker, then pauses]\nZhou: Go on.\nSubject: It is not his real name.\nZhou: Tell us his real name, then.\nSubject: [ejects something wet onto the table]\nZhou: What is that? What is that? Is it dangerous?[transcript pauses]\nZhou: Please don’t do that again.\nSubject: You asked me my father’s name. That is his name.\nZhou: That isn’t any kind of name at all. That’s just a disgusting pile of goo.\nSubject: [still, silent]\nZhou: Why did you say that was his name? Are you that disrespectful to your father?\nSubject: I love my father, and so I remember my father.\nZhou: He’s passed?\nSubject: Yes. Recently.\nZhou: So you are in mourning?\nSubject: I am always in mourning.\nZhou: But, is it still within the mourning period?\nSubject: I am always in mourning.\nZhou: I mean, the three years.\nSubject: Yes.\nZhou: My condolences.\nSubject: Yes.\nZhou: Did your father have any other name? That doesn’t involve . . . whatever that is?\nSubject: [signing phonetically: Gunnar] son of [signing phonetically: Gunnar].\nZhou: An astronaut, then.\nSubject: Yes.\nZhou: What ship?\nSubject: I don’t want to talk about my father anymore. It is too [unknown sign].\nZhou: My condolences again.\nSubject: [still, silent]\nZhou: May I ask you other questions?\nSubject: Please.\nZhou: What is your name?\nSubject: Are you sure?\nZhou: Of course.\nSubject: Last time you didn’t want me to say a name.\nZhou: The . . . spit?\nSubject: You said it was disgusting. My father’s name.\nZhou: Phonetic signing will be fine.\nSubject: Not phonetic.\nZhou: What?\nSubject: [several unintelligible signs] do not speak language.\nZhou: What?\nSubject: My people [same several unintelligible signs] do not make [pause] things to hear.\nZhou: Sound?\nSubject: Sound. Yes. We do not make sound.\nZhou: Then how do you communicate? In sign?\nSubject: No, these signs I learned from my father, from my father’s people, like you.\nZhou: No, your father is Icelandic. I am Imperial.\nSubject: I am confused.\nZhou: Your father and I are from different peoples.\nSubject: But you are both [unintelligible sign]?\nZhou: Never mind. Is there at least a name we could call you?\nSubject: There is a name my father gave me, but it isn’t really my name.\nZhou: How can you be so disrespectful of your father?\nSubject: I love my father. I don’t know the sign [respect] but I love my father and so I remember him.\nZhou: But the name your father gave you is your real name.\nSubject: No, my real name was built by my mother out of my father’s name and my mother’s [unintelligible sign]. Then she grew me from it.\nZhou: But what can we call you?\nSubject: My father called me “An Arc of Lightning Across the Eye of God.”\nZhou: That’s a very unusual name.\nSubject: It is very short, yes.\nZhou: Can we call you “Lightning”?\nSubject: That is even shorter. That is barely a word.\nZhou: It will be easier for [gestures, indicating transcriptionist].\nLightning: That is fine, then. But it is not my name.\nZhou: I understand.\nLightning: You don’t. Or you would have tasted my father’s name.\nZhou: Tasted? You mean heard.\nLightning: No, tasted. No sounds in our language.\nZhou: Oh.\nLightning: With your [unintelligible sign].\nZhou: We’ll using “Lightning” for now.\nLightning: That is fine.\nZhou: Where are you from?\nLightning: We are from [unintelligible sign].\nZhou: I’m sorry, our man here doesn’t know that sign.\nLightning: Do you have someone here who knows asteroids and planets? Orbits. It would be easier.\nZhou: He’s the only one in the outpost who knows astronaut’s sign.\nLightning: Okay. We are from heaven.\nZhou: Heaven? You sound like a Christian.\nLightning: I don’t know the sign “Christian.” We are from heaven.\nZhou: Who do you mean by “we”?\nLightning: My family. My [unintelligible sign].\nZhou: But your father is Icelandic.\nLightning: True. I meant my mother’s [unintelligible sign]. The ones who grew me.\nZhou: When you say heaven, what do you mean?\nLightning: Heaven is not like this. Not hot. Not burning. Not so many [unintelligible sign] [brief discussion with translator]. Not so many gasses all bound together in an aluminum shell. Heaven is vast and in every direction and empty and ours.\nZhou: You mean “space.”\nLightning: Yes. Space. Heaven.\nZhou: So you don’t mean heaven in the religious sense.\nLightning: Yes. We are religious.\nZhou: No, I meant.\nLightning: You meant?\nZhou: You’re religious? What religion?\nLightning: We are [several unintelligible signs].\nZhou: I don’t understand those words.\nLightning: We must make a conversation-sign for this.[discussion with translator]\nLightning: This is difficult. There are important religious words.\nZhou: I understand.\nLightning: You don’t understand. If you understood, you would taste them.\nZhou: Don’t insult me.\nLightning: I did not mean to insult you. I apologize. I am simply saying that these words are sacred. They were writ into our names by God. To change them, to make them into signs, into another language: It is blasphemous and unfilial.\nZhou: Unfilial?\nLightning: Yes. God is—what’s the sign?—our maternal grandfather. [unintelligible sign] is our maternal grandmother.\nZhou: You speak metaphorically.\nLightning: No. I can show you, if you will taste it, in our [unintelligible sign], where God wrote His image onto us.\nZhou: Can someone please tell me what that sign meant?[some discussion between translators]\nZhou: Get Doctor Xu in here.[further discussion; Dr. Xu Zhenbang arrives]\nZhou: So, by this sign [signs: gene] you mean genetic code.\nLightning: Yes, a name.\nZhou: And you are all like this? All your people.\nLightning: We are not people. We are [unintelligible sign].\nZhou: You are not people?\nLightning: Yes. We are not people.\nZhou: What are you?\nLightning: We are [several unintelligible signs]. We are the word of God, writ on the fabric of heaven.\nZhou: So you’re saying you’re a different species than us.\nLightning: I don’t know the sign “species.” We have different names, yes. Different genes.\nZhou: Would you consent to remove your space suit and let Doctor Xu here examine you?\nLightning: I do not know the sign [space suit].\nZhou: The clothes you are wearing. That protects you from the vacuum.\nLightning: I cannot.\nZhou: Are you worried about modesty? We can arrange for a woman to be present.\nLightning: It is not. This is me.\nZhou: What is you?\nLightning: This is my body.[multiple people talking simultaneously]\nZhou: Quiet down, everyone, Doctor Xu. What do you mean, Lightning?\nLightning: I mean that there is nothing to take off. This is me as I was grown from my father’s name and my mother’s [unintelligible sign]. I think you have mistaken my skin for a so-called space suit.\nZhou: Why is your skin like this?\nLightning: I was grown for this.[multiple people talking simultaneously]\nZhou: Okay! That’s enough! Everybody be quiet. Lightning, are you saying you were genetically engineered?\nLightning: I do not know the sign “engineer.”\nZhou: “Genetically engineered” means that your genetic code was altered before you were born, restricting your potential, limiting you to specific tasks and professions.\nLightning: Yes. My mother named me.\nZhou: But this is horrible! A crime!\nLightning: I love my mother. I remember her.\nZhou: Yes, it is natural that you love your mother. But what she has done to you—making you into a thing—is unnatural and wrong.\nLightning: But if my mother had not made me, I would not exist.\nZhou: It is only natural that you feel a filial debt to your parents for birthing you. But you must understand that what your mother did to you was wrong.\nLightning: I do not understand. Is this because of my skin?\nZhou: Yes, among other things.\nLightning: It is because of my skin and my lungs that I can survive here, in your fire, with all the gasses packed together.\nZhou: But we can all survive here.\nLightning: Yes, but you are [unintelligible sign]. You cannot survive outside, in heaven, under the eye of God.\nZhou: Still, genetically engineering your own children. It’s not right.\nLightning: My skin is a gift from my mother. It is not a crime. My lungs are a gift from my father. They are also not a crime.\nZhou: Your lungs?\nLightning: Yes, they are particular.\nZhou: What do you mean?\nLightning: Most of [unintelligible sign] do not have lungs. But, for me, they let me into my father’s world. Into this fire.\nZhou: Why?\nLightning: I understand the signs “why” and “?” but I do not understand what you mean by “why?”\nZhou: Why have you come here?\nLightning: There are two parts.\nZhou: Go on.\nLightning: First, I have come to tell my father’s family that he is dead.\nZhou: If he travelled through the Shenkong transit point, he’s been legally dead for many years.\nLightning: Nonetheless, they are his family. They deserve to know.\nZhou: I see.\nLightning: It is because I love my father.\nZhou: It is only natural.\nLightning: The second part is also because I love my father, but I am worried.\nZhou: Why are you worried?\nLightning: Because it is about my purpose.\nZhou: What they made you for?\nLightning: Yes. And that upset you. I did not intend to upset you.\nZhou: It is an upsetting topic.\nLightning: Why?\nZhou: It’s slavery.\nLightning: I don’t understand the sign “slavery.”\nZhou: It’s treating people like things. Things that can be owned.\nLightning: I am not a person and I am not a thing and I don’t understand the sign “owned.”\nZhou: You’re clearly a person! I speak to you and can see that you have the same humanity as all of us.\nLightning: I am not a person. I am not! I am so much more than that. I am my father’s name, written by my mother’s vision across time and space. I am a hand of peace offered from the [several unintelligible signs] to every one of you. I am a message of hope of the divine for those confined in fire and darkness and gravity. I am my great and wonderful purpose and I am the fulfillment of that purpose.\nZhou: What is that purpose?\nLightning: To come here. To speak to you. All of you.\nZhou: What is it that you want to tell us?\nLightning: I am sorry. I cannot sign it.\nZhou: How can you tell us, then?\nLightning: Do you have someone here who can read—what was the sign?—who can read genes?\nZhou: What do you mean?\nLightning: Someone who can understand real language.\nZhou: What’s “real language”?\nLightning: [gestures towards the table] Is it okay if I [unintelligible sign] something here?\nZhou: Go ahead.\nLightning: It won’t upset you?\nZhou: It’s fine.\nLightning: [ejects something wet onto the table, in substantially larger quantity than the previous time]\nLightning: This is real language. [unintelligible sign]. Genes.\nZhou: [shudders]\nLightning: Are you going to taste it?\nZhou: I don’t know if it’s safe.\nLightning: It’s safe. Taste it.\nZhou: I. I don’t think that.\nLightning: You will not understand unless you taste it.\nZhou: Dr. Xu? Can you analyze a sample of this please?\nLightning: [gesturing to table] This is my name. This is me. Taste me and you will understand. [stands up, begins to gesture violently] Taste me! Meet me! Understand!\nZhou: Can someone restrain her?\nLightning: This is me, and within me, my father. This is me, and within me, my mother, and within my mother, [unintelligible sign], and within [unintelligible sign], the image of God.\nZhou: Someone?!\nLightning: [unintelligible signs, likely in an unknown language]\nZhou Wenshu looked at the transcript on his desk, at the brushes, at Dr. Xu’s incomprehensible report that he had begged the magistrate to include with his memorial. Zhou didn’t understand it. Something about multiple compound DNA structures.\nDr. Xu had been very impressed. “If this really is her DNA, she’s more closely related to a strand of yili grass than to you or me,” he’d said, as if that made any sense. “Her genetic density is simply incredible, particularly for an animal species.”\nThey’d confined her, with apologies, to the brig, but Zhou had her moved to guest quarters. The circumstances hadn’t been entirely her fault. He had asked her to show him, after all. And she was a young woman—a young stalk of flowering grass?—in mourning for her father.\nHis train of thought was interrupted by a hammering noise coming from the hull. Were the men finally patching it? This late at night? He supposed he shouldn’t care about the timing—good enough that they were doing it at all.\nHe was pacing again.\nA woman—or whatever she was—mourning for her father. That was it, wasn’t it? It didn’t matter if she was a flower or a human or, in what absurdly was becoming the most likely scenario, a sort of wholly alien life, a first first-contact for the Empire. What mattered was that she mourned her parents, just like he would mourn his parents someday soon. What bound them was not genetics or culture, but that shared humane understanding. Recognizing that, who was he to stand in the way of her filial duty?\nOne two three four fi—and turn.\nBut—then—no. That wasn’t right at all. She was a genetically engineered slave, a purpose-built tool, designed to contact and infiltrate the empire. She’d said as much herself. And, even if she wasn’t secretly an assassin or saboteur, she brought with her a bizarre religion and her upsetting concepts of language, parentage, and God. The empire’s stability hung, as it always had, by a thread. What revolts would stir up in her wake?\nfi—and turn.\nAnd then, of course, he had to think of what the imperial court would do once they learned of her. Would they righteously allow her to visit her relatives and return unmolested? Could they even do that? Or would they capture her, interrogate her, even dissect her, trying to discover the biological secrets she carried. Could he really send this report, at all, knowing that it would likely doom her? Could he trust even the emperor with this secret?\nThere was that pounding on the hull again.\nThe hull!\nZhou stopped suddenly and then leapt for the door. Here he was, fretting about his decision, but all along she’d been the one—\nThrough his office door—not pausing by a sleeping Lei Shu—he hurried down the corridor in a quick shuffle, the fastest he could manage without becoming tangled in his robes. The hull breach alarm was already blaring. By the time he reached her room, sealed off by the automatic pressure doors, she was gone.\nParticular thanks to Dr. Alexis Siemon for their expertise and advice\nabout the lives and careers of Yongzheng-era magistrates.\nP H Lee lives with the rose bushes behind an old walnut tree down a dead-end road out past the highway. Their other writing has appeared in Uncanny Magazine, Visions Magazine, Worlds Without Master, and Four Ways to Die in the Future. Their hobbies include cooking and translating Classical Chinese texts.", "source": "https://clarkesworldmagazine.com/lee_10_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Arc of Lightning Across the Eye of God by P H Lee"}