{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Joe R Lansdale", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "FhFBeYxhn4e/FyKd91vyuhAPj6g=", "id": null, "license": null, "comments": "", "raw_text": "9780 words, novelette, REPRINT  Soldierin'  They said if you went out West and joined up with the colored soldiers, they’d pay you in real Yankee dollars, thirteen of them a month, feed and clothe you, and it seemed like a right smart idea since I was wanted for a lynchin’. It wasn’t that I was invited to hold the rope or sing a little spiritual. I was the guest of honor on this one. They was plannin’ to stretch my neck like a goozle-wrung chicken at Sunday dinner.  Thing I’d done was nothin’ on purpose, but in a moment of eyeballin’ while walkin’ along the road on my way to cut some firewood for a nickel and a jar of jam, a white girl who was hangin’ out wash bent over and pressed some serious butt up against her gingham, and a white fella, her brother, seen me take a look, and that just crawled all up in his ass and died, and he couldn’t stand the stink.  Next thing I know, I’m wanted for being bold with a white girl, like maybe I’d broke into her yard and jammed my arm up her ass, but I hadn’t done nothin’ but what’s natural, which is glance at a nice butt when it was available to me.  Now, in the livin’ of my life, I’ve killed men and animals and made love to three Chinese women on the same night in the same bed and one of them with only one leg, and part of it wood, and I even ate some of a dead fella once when I was crossin’ the mountains, though I want to rush in here and make it clear I didn’t know him all that well, and we damn sure wasn’t kinfolks. Another thing I did was I won me a shootin’ contest up Colorady way against some pretty damn famous shooters, all white boys, but them’s different stories and not even akin to the one I want to tell, and I’d like to add, just like them other events, this time I’m talking about is as true as the sunset.  Pardon me. Now that I’ve gotten older, sometimes I find I start out to tell one story and end up tellin’ another. But to get back to the one I was talkin’ about . . . So, havin’ been invited to a lynchin’, I took my daddy’s horse and big ole loaded six-gun he kept wrapped up in an oilcloth from under the floorboards of our shack, and took off like someone had set my ass on fire. I rode that poor old horse till he was slap worn out. I had to stop over in a little place just outside of Nacogdoches and steal another one, not on account of I was a thief, but on account of I didn’t want to get caught by the posse and hung and maybe have my pecker cut off and stuck in my mouth. Oh. I also took a chicken. He’s no longer with me, of course, as I ate him out there on the trail.  Anyway, I left my horse for the fella I took the fresh horse and the chicken from, and I left him a busted pocket watch on top of the railing post, and then I rode out to West Texas. It took a long time for me to get there, and I had to stop and steal food and drink from creeks and make sure the horse got fed with corn I stole. After a few days, I figured I’d lost them that was after me, and I changed my name as I rode along. It had been Wiliford P. Thomas, the P not standing for a thing other than P. I chose the name Nat Wiliford for myself, and practiced on saying it while I rode along. When I said it, I wanted it to come out of my mouth like it wasn’t a lie.  Before I got to where I was goin’, I run up against this colored fella taking a dump in the bushes, wiping his ass on leaves. If I had been a desperado, I could have shot him out from over his pile and taken his horse, ’cause he was deeply involved in the event—so much, in fact, that I could see his eyes were crossed from where I rode up on a hill, and that was some distance.  I was glad I was downwind, and hated to interrupt, so I sat on my stolen horse until he was leaf wiping, and then I called out. “Hello, the shitter.”  He looked up and grinned at me, touched his rifle lying on the ground beside him, said, “You ain’t plannin’ on shootin’ me, are you?”  “No. I thought about stealin’ your horse, but it’s sway back and so ugly in the face it hurts my feelings.”  “Yeah, and it’s blind in one eye and has a knot on its back comes right through the saddle. When I left the plantation, I took that horse. Wasn’t much then, and it’s a lot less now.”  He stood up and fastened his pants and I seen then that he was a pretty big fellow, all decked out in fresh-looking overalls and a big black hat with a feather in it. He came walkin’ up the hill toward me, his wipin’ hand stuck out for a shake, but I politely passed, because I thought his fingers looked a little brown.  Anyway, we struck it up pretty good, and by nightfall we found a creek, and he washed his hands in the water with some soap from his saddlebag, which made me feel a mite better. We sat and had coffee and some of his biscuits. All I could offer was some conversation, and he had plenty to give back. His name was Cullen, but he kept referrin’ to himself as The Former House Nigger, as if it were a rank akin to general. He told a long story about how he got the feather for his hat, but it mostly just came down to he snuck up on a hawk sittin’ on a low limb and jerked it out of its tail.  “When my master went to war against them Yankees,” he said, “I went with him. I fought with him and wore me a butternut coat and pants, and I shot me at least a half dozen of them Yankees.”  “Are you leaking brains out of your gourd?” I said. “Them rebels was holdin’ us down.”  “I was a house nigger, and I grew up with Mr. Gerald, and I didn’t mind going to war with him. Me and him was friends. There was lots of us like that.”  “Y’all must have got dropped on your head when you was young’ns.”  “The Master and the older Master was all right.”  “’Cept they owned you,” I said.  “Maybe I was born to be owned. They always quoted somethin’ like that out of the Bible.”  “That ought to have been your clue, fella. My daddy always said that book has caused more misery than chains, an ill-tempered woman, and a nervous dog.”  “I loved Young Master like a brother, truth be known. He got shot in the war, right ’tween the eyes by a musket ball, killed him deader than a goddamn tree stump. I sopped up his blood in a piece of his shirt I cut off, mailed it back home with a note on what happened. When the war was over, I stayed around the plantation for a while, but everything come apart then, the old man and the old lady died, and I buried them out back of the place a good distance from the privy and uphill, I might add. That just left me and the Old Gentleman’s dog.  “The dog was as old as death and couldn’t eat so good, so I shot it, and went on out into what Young Master called The Big Wide World. Then, like you, I heard the guv’ment was signing up coloreds for its man’s army. I ain’t no good on my own. I figured the army was for me.”  “I don’t like being told nothin’ by nobody,” I said, “but I surely love to get paid.” I didn’t mention I also didn’t want to get killed by angry crackers and the army seemed like a good place to hide.  About three days later, we rode up on the place we was looking for. Fort McKavett, between the Colorady and the Pecos rivers. It was a sight, that fort. It was big and it didn’t look like nothin’ I’d ever seen before. Out front was colored fellas in army blue drilling on horseback, looking sharp in the sunlight, which there was plenty of. It was hot where I come from, sticky even, but you could find a tree to get under. Out here, all you could get under was your hat, or maybe some dark cloud sailing across the face of the sun, and that might last only as long as it takes a bird to fly over.  But there I was. Fort McKavett. Full of dreams and crotch itch from long riding, me and my new friend sat on our horses, lookin’ the fort over, watchin’ them horse soldiers drill, and it was prideful thing to see. We rode on down in that direction.  In the Commanding Officer’s quarters, me and The Former House Nigger stood before a big desk with a white man behind it, name of Colonel Hatch. He had a caterpillar mustache and big sweat circles like wet moons under his arms. His eyes were aimed on a fly sitting on some papers on his desk. Way he was watchin’ it, you’d have thought he was beading down on a hostile. He said, “So you boys want to sign up for the colored army. I figured that, you both being colored.”  He was a sharp one, this Hatch.  I said, “I’ve come to sign up and be a horse rider in the Ninth Cavalry.”  Hatch studied me for a moment, said, “Well, we got plenty of ridin’ niggers. What we need is walkin’ niggers for the goddamn infantry, and I can get you set in the right direction to hitch up with them.”  I figured anything that was referred to with goddamn in front of it wasn’t the place for me.  “I reckon ain’t a man here can ride better’n me,” I said, “and that would be even you, Colonel, and I’m sure you are one ridin’ sonofabitch, and I mean that in as fine a way as I can say it.”  Hatch raised an eyebrow. “That so?”  “Yes, sir. No brag, just fact. I can ride on a horse’s back, under his belly, make him lay down and make him jump, and at the end of the day, I take a likin’ to him, I can diddle that horse in the ass and make him enjoy it enough to brew my coffee and bring my slippers, provided I had any. That last part about the diddlin’ is just talkin’, but the first part is serious.”  “I figured as much,” Hatch said.  “I ain’t diddlin’ no horses,” The Former House Nigger said. “I can cook and lay out silverware. Mostly, as a Former House Nigger, I drove the buggy.”  At that moment, Hatch come down on that fly with his hand, and he got him too. He peeled it off his palm and flicked it on the floor. There was this colored soldier standing nearby, very stiff and alert, and he bent over, picked the fly up by a bent wing, threw it out the door and came back. Hatch wiped his palm on his pants leg. “Well,” he said, “let’s see how much of what you got is fact, and how much is wind.”  They had a corral nearby, and inside it, seeming to fill it up, was a big black horse that looked like he ate men and shitted out saddlebags made of their skin and bones. He put his eye right on me when I came out to the corral, and when I walked around on the other side, he spun around to keep a gander on me. Oh, he knew what I was about, all right.  Hatch took hold of one corner of his mustache and played with it, turned, and looked at me. “You ride that horse well as you say you can, I’ll take both of you into the cavalry, and The Former House Nigger can be our cook.”  “I said I could cook,” The Former House Nigger said. “Didn’t say I was any good.”  “Well,” Hatch said, “what we got now ain’t even cookin’. There’s just a couple fellas that boil water and put stuff in it. Mostly turnips.”  I climbed up on the railing, and by this time, four colored cavalry men had caught up the horse for me. That old black beast had knocked them left and right, and it took them a full twenty minutes to get a bridle and a saddle on him, and when they come off the field, so to speak, two was limpin’ like they had one foot in a ditch. One was holding his head where he had been kicked, and the other looked amazed he was alive. They had tied the mount next to the railin’, and he was hoppin’ up and down like a little girl with a jump rope, only a mite more vigorous.  “Go ahead and get on,” Hatch said.  Having bragged myself into a hole, I had no choice.  I wasn’t lyin’ when I said I was a horse rider. I was. I could buck them and make them go down on their bellies and roll on their sides, make them strut and do whatever, but this horse was as mean as homemade sin, and I could tell he had it in for me.  Soon as I was on him, he jerked his head and them reins snapped off the railing and I was clutchin’ at what was left of it. The sky came down on my head as that horse leaped. Ain’t no horse could leap like that, and soon me and him was trying to climb the clouds. I couldn’t tell earth from heaven, ’cause we bucked all over that goddamn lot, and ever time that horse come down, it jarred my bones from butt to skull. I come out of the saddle a few times, nearly went off the back of him, but I hung in there, tight as a tick on a dog’s nuts. Finally he jumped himself out and started to roll. He went down on one side, mashing my leg in the dirt, and rolled on over. Had that dirt in the corral not been tamped down and soft, giving with me, there wouldn’t been nothing left of me but a sack of blood and broken bones.  Finally the horse humped a couple of sad bucks and gave out, started to trot and snort. I leaned over close to his ear and said, “You call that buckin’?” He seemed to take offense at that, and run me straight to the corral and hit the rails there with his chest. I went sailin’ off his back and landed on top of some soldiers, scatterin’ them like quail.  Hatch come over and looked down on me, said, “Well, you ain’t smarter than the horse, but you can ride well enough. You and The Former House Nigger are in with the rest of the ridin’ niggers. Trainin’ starts in the morning.”  We drilled with the rest of the recruits up and down that lot, and finally outside and around the fort until we was looking pretty smart. The horse they give me was that black devil I had ridden. I named him Satan. He really wasn’t as bad as I first thought. He was worse, and you had to be at your best every time you got on him, ’cause deep down in his bones, he was always thinking about killing you, and if you didn’t watch it, he’d kind of act casual, like he was watching a cloud or somethin’, and quickly turn his head and take a nip out of your leg, if he could bend far enough to get to it.  Anyway, the months passed, and we drilled, and my buddy cooked, and though what he cooked wasn’t any good, it was better than nothin’. It was a good life as compared to being hung, and there was some real freedom to it and some respect. I wore my uniform proud, set my horse like I thought I was somethin’ special with a stick up its ass.  We mostly did a little patrollin’, and wasn’t much to it except ridin’ around lookin’ for wild Indians we never did see, collectin’ our thirteen dollars at the end of the month, which was just so much paper ’cause there wasn’t no place to spend it. And then, one mornin’, things changed, and wasn’t none of it for the better, except The Former House Nigger managed to cook a pretty good breakfast with perfect fat biscuits and eggs with the yolks not broke and some bacon that wasn’t burned and nobody got sick this time.  On that day, Hatch mostly rode around with us, ’cause at the bottom of it all, I reckon the government figured we was just a bunch of ignorant niggers who might at any moment have a watermelon relapse and take to gettin’ drunk and shootin’ each other and maybe trying to sing a spiritual while we diddled the horses, though I had sort of been responsible for spreadin’ the last part of that rumor on my first day at the fort. We was all itchin’ to show we had somethin’ to us that didn’t have nothin’ to do with no white fella ridin’ around in front of us, though I’ll say right up front, Hatch was a good soldier who led and didn’t follow, and he was polite too. I had seen him leave the circle of the fire to walk off in the dark to fart. You can’t say that about just anyone. Manners out on the frontier was rare.  You’ll hear from the army how we was all a crack team, but this wasn’t so, at least not when they was first sayin’ it. Most of the army at any time, bein’ they the ridin’ kind or the walkin’ kind, ain’t all that crack. Some of them fellas didn’t know a horse’s ass end from the front end, and this was pretty certain when you seen how they mounted, swinging into the stirrups, finding themselves looking at the horse’s tail instead of his ears. But in time everyone got better, though I’d like to toss in, without too much immodesty, that I was the best rider of the whole damn lot. Since he’d had a good bit of experience, The Former House Nigger was the second. Hell, he’d done been in war and all, so in ways, he had more experience than any of us, and he cut a fine figure on a horse, being tall and always alert, like he might have to bring somebody a plate of something or hold a coat.  Only action we’d seen was when one of the men, named Rutherford, got into it with Prickly Pear—I didn’t name him, that come from his mother—and they fought over a biscuit. While they was fightin’, Colonel Hatch come over and ate it, so it was a wasted bout.  But this time I’m tellin’ you about, we rode out lookin’ for Indians to scare, and not seein’ any, we quit lookin’ for what we couldn’t find, and come to a little place down by a creek where it was wooded and there was a shade from a whole bunch of trees that in that part of the country was thought of as being big, and in my part of the country would have been considered scrubby. I was glad when we stopped to water the horses and take a little time to just wait. Colonel Hatch, I think truth be told, was glad to get out of that sun much as the rest of us. I don’t know how he felt, being a white man and having to command a bunch of colored, but he didn’t seem bothered by it a’tall, and seemed proud of us and himself, which, of course, made us all feel mighty good.  So we waited out there on the creek, and Hatch, he come over to where me and The Former House Nigger were sitting by the water, and we jumped to attention, and he said, “There’s a patch of scrub oaks off the creek, scattering out there across the grass, and they ain’t growin’ worth a damn. Them’s gonna be your concern. I’m gonna take the rest of the troop out across the ground there, see if we can pick up some deer trails. I figure ain’t no one gonna mind if we pot a few and bring them back to camp. And besides, I’m bored. But we could use some firewood, and I was wantin’ you fellas to get them scrubs cut down and sawed up and ready to take back to the fort. Stack them in here amongst the trees, and I’ll send out some men with a wagon when we get back, and have that wood hauled back before it’s good and dark. I thought we could use some oak to smoke the meat I’m plannin’ on gettin’. That’s why I’m the goddamn colonel. Always thinkin’.”  “What if you don’t get no meat?” one of the men with us said.  “Then you did some work for nothin’, and I went huntin’ for nothin’. But, hell, I seen them deer with my binoculars no less than five minutes ago. Big fat deer, about a half dozen of them running along. They went over the hill. I’m gonna take the rest of the troops with me in case I run into hostiles, and because I don’t like to do no skinnin’ of dead deer myself.”  “I like to hunt,” I said.  “That’s some disappointin’ shit for you,” Colonel Hatch said. “I need you here. In fact, I put you in charge. You get bit by a snake and die, then, you, The Former House Nigger, take over. I’m also gonna put Rutherford, Bill, and Rice in your charge . . . some others. I’ll take the rest of them. You get that wood cut up, you start on back to the fort and we’ll send out a wagon.”  “What about Indians?” Rutherford, who was nearby, said.  “You seen any Indians since you been here?” Hatch said.  “No, sir.”  “Then there ain’t no Indians.”  “You ever see any?” Rutherford asked Hatch.  “Oh, hell yeah. Been attacked by them, and I’ve attacked them. There’s every kind of Indian you can imagine out here from time to time. Kiowa. Apache. Comanche. And there ain’t nothin’ they’d like better than to have your prickly black scalps on their belts, ’cause they find your hair funny. They think it’s like the buffalo. They call you buffalo soldiers on account of it.”  “I thought it was because they thought we was brave like the buffalo,” I said.  “That figures,” Hatch said. “You ain’t seen no action for nobody to have no opinion of you. But, we ain’t seen an Indian in ages, and ain’t seen no sign of them today. I’m startin’ to think they’ve done run out of this area. But, I’ve thought that before. And Indian, especially a Comanche or an Apache, they’re hard to get a handle on. They’ll get after somethin’ or someone like it matters more than anything in the world, and then they’ll wander off if a bird flies over and they make an omen of it.”  Leaving us with them mixed thoughts on Indians and buffalo, Hatch and the rest of the men rode off, left us standing in the shade, which wasn’t no bad place to be. First thing we did when they was out of sight was throw off our boots and get in the water. I finally just took all my clothes off and cleaned up pretty good with a bar of lye soap and got dressed. Then leaving the horses tied up in the trees near the creek, we took the mule and the equipment strapped on his back, carried our rifles, and went out to where them scrubs was. On the way, we cut down a couple of saplings and trimmed some limbs, and made us a kind of pull that we could fasten onto the mule. We figured we’d fill it up with wood and get the mule to drag it back to the creek, pile it, and have it ready for the wagon.  Rigged up, we went to work, taking turns with the saw, two other men working hacking off limbs, one man axing the trimmed wood up so it fit good enough to load. We talked while we worked, and Rutherford said, “Them Indians, some of them is as mean as snakes. They do all kind of things to folks. Cut their eyelids off, cook them over fires, cut off their nut sacks and such. They’re just awful.”  “Sounds like some Southerners I know,” I said.  “My master and his family was darn good to me,” The Former House Nigger said.  “They might have been good to you,” Rice said, pausing at the saw, “but that still don’t make you no horse, no piece of property. You a man been treated like a horse, and you too dumb to know it.”  The Former House Nigger bowed up like he was about to fight. I said, “Now, don’t do it. He’s just talkin’. I’m in charge here, and you two get into it, I’ll get it from Hatch, and I don’t want that, and won’t have it.”  Rice tilted his hat back. His face looked dark as coffee. “I’m gonna tell you true. When I was sixteen, I cut my master’s throat and raped his wife and run off to the North.”  “My God,” The Former House Nigger said. “That’s awful.”  “And I made the dog suck my dick,” Rice said.  “What?” The Former House Nigger said.  “He’s funnin’ you,” I said.  “That part about the master’s throat,” Rice said, “and runnin’ off to the North. I really did that. I would have raped his wife, but there wasn’t any time. His dog didn’t excite me none.”  “You are disgustin’,” The Former House Nigger said, pausing from his job of trimming limbs with a hatchet.  “Agreed,” I said.  Rice chuckled, and went back to sawin’ with Rutherford. He had his shirt off, and the muscles in his back bunched up like prairie dogs tunnelin’, and over them mounds was long, thick scars. I knew them scars. I had a few. They had been made with a whip.  Bill, who was stackin’ wood, said, “Them Indians. Ain’t no use hatin’ them. Hatin’ them for bein’ what they is, is like hatin’ a bush ’cause it’s got thorns on it. Hatin’ a snake ’cause it’ll bite you. They is what they is just like we is what we is.”  “And what is we?” The Former House Nigger said.  “Ain’t none of us human beings no ’count. The world is just one big mess of no ’counts, so there ain’t no use pickin’ one brand of man or woman over the other. Ain’t none of them worth a whistlin’ fart.”  “Ain’t had it so good, have you, Bill?” I asked.  “I was a slave.”  “We all was,” I said.  “Yeah, but I didn’t take it so good. Better’n Rutherford, but not so good. I was in the northern army, right there at the end when they started lettin’ colored in, and I killed and seen men killed. Ain’t none of my life experience give me much of a glow about folks of any kind. I even killed buffalo just for the tongues rich folks wanted to have. We left hides and meat in the fields to rot. That was to punish the Indians. Damned ole buffalo. Ain’t nothin’ dumber, and I shot them for dollars and their tongues. What kind of human beings does that?”  We worked for about another hour, and then, Dog Den—again, I didn’t name him—one of the other men Hatch left with us, said, “I think we got a problem.”  On the other side of the creek, there was a split in the trees, and you could see through them out into the plains, and you could see the hill Hatch had gone over some hours ago, and comin’ down it at a run was a white man. He was a good distance away, but it didn’t take no eagle eye to see that he was naked as a skinned rabbit, and runnin’ full out, and behind him, whoopin’ and having a good time, were Indians. Apache, to be right on the money, nearly as naked as the runnin’ man. Four of them was on horseback, and there was six of them I could see on foot runnin’ after him. My guess was they had done been at him and had set him loose to chase him like a deer for fun. I guess livin’ out on the plains like they did, with nothin’ but mesquite berries and what food they could kill, you had to have your fun where you could find it.  “They’re funnin’ him,” Rutherford said, figurin’ same as me.  We stood there lookin’ for a moment; then I remembered we was soldiers. I got my rifle and was about to bead down, when Rutherford said, “Hell, you can’t hit them from here, and neither can they shoot you. We’re out of range, and Indians ain’t no shots to count for.”  One of the runnin’ Apaches had spotted us, and he dropped to one knee and pointed his rifle at us, and when he did, Rutherford spread his arms wide, and said, “Go on, shoot, you heathen.”  The Apache fired.  Rutherford was wrong. He got it right on the top of the nose and fell over with his arms still spread. When he hit the ground, The Former House Nigger said, “I reckon they been practicin’.”  We was up on a hill, so we left the mule and run down to the creek where the horses was, and waded across the little water and laid out between the trees and took aim. We opened up and it sounded like a bunch of mule skinners crackin’ their whips. The air filled with smoke and there was some shots fired back at us. I looked up and seen the runnin’ man was makin’ right smart time, his hair and johnson flappin’ as he run. But then one of the horseback Apaches rode up on him, and with this heavy knotted-looking stick he was carrying, swung and clipped the white fella along the top of the head. I seen blood jump up and the man go down and I could hear the sound of the blow so well, I winced. The Apache let out a whoop and rode on past, right toward us. He stopped to beat his chest with his free hand, and when he did, I took a shot at him. I aimed for his chest, but I hit the horse square in the head and brought him down. At least I had the heathen on foot.  Now, you can say what you want about an Apache, but he is about the bravest thing there is short of a badger. This’n come runnin’ right at us, all of us firin’ away, and I figure he thought he had him some big magic, ’cause not a one of our shots hit him. It was like he come haint-like right through a wall of bullets. As he got closer, I could see he had some kind of mud paint on his chest and face, and he was whoopin’ and carryin’ on somethin’ horrible. And then he stepped in a hole and went down. Though he was still a goodly distance from us, I could hear his ankle snap like a yanked suspender. Without meaning to, we all went, “Oooooh.” It hurt us, it was so nasty soundin’.  That fall must have caused his magic to fly out of his ass, ’cause we all started firing at him, and this time he collected all our bullets, and was deader than a guv’ment promise before the smoke cleared.  This gave the rest of them Apache pause, and I’m sure, brave warriors or not, a few assholes puckered out there.  Them ridin’ Apaches stopped their horses and rode back until they was up on the hill, and the runnin’ Indians dropped to the ground and lay there. We popped off a few more shots, but didn’t hit nothin’, and then I remembered I was in charge. I said, “Hold your fire. Don’t waste your bullets.”  The Former House Nigger crawled over by me, said, “We showed them.”  “They ain’t showed yet,” I said. “Them’s Apache warriors. They ain’t known as slackers.”  “Maybe Colonel Hatch heard all the shootin’,” he said.  “They’ve had time to get a good distance away. They figured on us cuttin’ the wood and leavin’ it and goin’ back to the fort. So maybe they ain’t missin’ us yet and didn’t hear a thing.”  “Dang it,” The Former House Nigger said.  I thought we might just mount up and try to ride off. We had more horses than they did, but three of them ridin’ after us could still turn out bad. We had a pretty good place as we was, amongst the trees with water to drink. I decided best thing we could do was hold our position. Then that white man who had been clubbed in the head started moaning. That wasn’t enough, a couple of the braves come up out of the grass and ran at his spot. We fired at them, but them Spencer single shots didn’t reload as fast as them Indians could run. They come down in the tall grass where the white man had gone down, and we seen one of his legs jump up like a snake, and go back down, and the next moment came the screaming.  It went on and on. Rice crawled over to me and said, “I can’t stand it. I’m gonna go out there and get him.”  “No, you’re not,” I said. “I’ll do it.”  “Why you?” Rice said.  “’Cause I’m in charge.”  “I’m goin’ with you,” The Former House Nigger said.  “Naw, you ain’t,” I said. “I get rubbed out, you’re the one in charge. That’s what Colonel Hatch said. I get out there a ways, you open up on them other Apache, keep ’em busier than a bear with a hive of bees.”  “Hell, we can’t even see them, and the riders done gone on the other side of the hill.”  “Shoot where you think they ought to be, just don’t send a blue whistler up my ass.”  I laid my rifle on the ground, made sure my pistol was loaded, put it back in the holster, pulled my knife, stuck it in my teeth, and crawled to my left along the side of that creek till I come to tall grass, then I worked my way in. I tried to go slow as to make the grass seem to be moved by the wind, which had picked up considerable and was helpin’ my sneaky approach.  As I got closer to where the white man had gone down and the Apaches had gone after him, his yells grew somethin’ terrible. I was maybe two or three feet from him. I parted the grass to take a look, seen he was lying on his side, and his throat was cut, and he was dead as he was gonna get.  Just a little beyond him, the two Apache was lying in the grass, and one of them was yellin’ like he was the white man bein’ tortured, and I thought, Well, if that don’t beat all. I was right impressed.  Then the Apache saw me. They jumped up and come for me. I rose up quick, pulling the knife from my teeth. One of them hit me like a cannon ball, and away we went rollin’.  A shot popped off and the other Apache did a kind of dance, about four steps, and went down holdin’ his throat. Blood was flying out of him like it was a fresh-tapped spring. Me and the other buck rolled in the grass and he tried to shoot me with a pistol he was totin’, but only managed to singe my hair and give me a headache and make my left ear ring.  We rolled around like a couple of doodlebugs, and then I came up on top and stabbed at him. He caught my hand. I was holding his gun hand to the ground with my left, and he had hold of my knife hand.  “Jackass,” I said, like this might so wound him to the quick, he’d let go. He didn’t. We rolled over in the grass some more, and he got the pistol loose and put it to my head, but the cap and ball misfired, and all I got was burned some. I really called him names then. I jerked my legs up and wrapped them around his neck, yanked him down on his back, got on top of him and stabbed him in the groin and the belly, and still he wasn’t finished.  I put the knife in his throat, and he gave me a look of disappointment, like he’s just realized he’d left somethin’ cookin’ on the fire and ought to go get it; then he fell back.  I crawled over, rolled the white man on his back. They had cut his balls off and cut his stomach open and sliced his throat. He wasn’t gonna come around.  I made it back to the creek bank and was shot at only a few times by the Apache. My return trip was a mite brisker than the earlier one. I only got a little bit of burn from a bullet that grazed the butt of my trousers.  When I was back at the creek bank, I said, “Who made that shot on the Apache?”  “That would be me,” The Former House Nigger said.  “Listen here, I don’t want you callin’ yourself The Former House Nigger no more. I don’t want no one else callin’ you that. You’re a buffalo soldier, and a good’n. Rest of you men hear that?”  The men was strung out along the creek, but they heard me, and grunted at me.  “This here is Cullen. He ain’t nothing but Cullen or Private Cullen, or whatever his last name is. That’s what we call him. You hear that, Cullen? You’re a soldier, and a top soldier at that.”  “That’s good,” Cullen said, not so moved about the event as I was. “But, thing worryin’ me is the sun is goin’ down.”  “There’s another thing,” Bill said, crawlin’ over close to us. “There’s smoke over that hill. My guess is it ain’t no cookout.”  I figured the source of that smoke would be where our white fella had come from, and it would be what was left of whoever he was with or the remains of a wagon or some such. The horse-ridin’ Apache had gone back there either to finish them off and torture them with fire or to burn a wagon down. The Apache was regular little fire starters, and since they hadn’t been able to get to all of us, they was takin’ their misery out on what was within reach.  As that sun went down, I began to fret. I moved along the short line of our men and decided not to space them too much, but not bunch them up either. I put us about six feet apart and put a few at the rear as lookouts. Considerin’ there weren’t many of us, it was a short line, and them two in the back was an even shorter line. Hell, they wasn’t no line at all. They was a couple of dots.  The night crawled on. A big frog began to bleat near me. Crickets was sawin’ away. Upstairs, the black-as-sin heavens was lit up with stars and the half moon was way too bright.  Couple hours crawled on, and I went over to Cullen and told him to watch tight, ’cause I was goin’ down the line and check the rear, make sure no one was sleepin’ or pullin’ their johnsons. I left my rifle and unsnapped my revolver holster flap, and went to check.  Bill was fine, but when I come to Rice, he was facedown in the dirt. I grabbed him by the back of his collar and hoisted him up, and his head fell near off. His throat had been cut. I wheeled, snappin’ my revolver into my hand. Wasn’t nothin’ there.  A horrible feelin’ come over me. I went down the row. All them boys was dead. The Apache had been pickin’ ’em off one at a time, and doin’ it so careful like, the horses hadn’t even noticed.  I went to the rear and found that the two back there was fine. I said, “You fellas best come with me.”  We moved swiftly back to Cullen and Rice, and we hadn’t no more than gone a few paces, when a burst of fire cut the night. I saw an Apache shape grasp at his chest and fall back. Runnin’ over, we found Cullen holding his revolver, and Bill was up waving his rifle around. “Where are they? Where the hell are they?”  “They’re all around. They’ve done killed the rest of the men.” I said.  “Ghosts,” Bill said. “They’re ghosts.”  “What they are is sneaky,” I said. “It’s what them fellas do for a livin’.”  By now, I had what you might call some real goddamn misgivin’s, figured I had reckoned right on things. I thought we’d have been safer here, but them Apache had plumb snuck up on us, wiped out three men without so much as leavin’ a fart in the air. I said, “I think we better get on our horses and make a run for it.”  But when we went over to get the horses, Satan, soon as I untied him, bolted and took off through the wood and disappeared. “Now, that’s the shits,” I said.  “We’ll ride double,” Cullen said.  The boys was gettin’ their horses loose, and there was a whoop, and an Apache leapfrogged over the back of one of them horses and came down on his feet with one of our own hatchets in his hand. He stuck the blade of it deep in the head of a trooper, a fella whose name I don’t remember, being now in my advanced years, and not really havin’ known the fella that good in the first place. There was a scramble, like startled quail. There wasn’t no military drill about it. It was every sonofabitch for himself. Me and Cullen and Bill tore up the hill, ’cause that was the way we was facin’. We was out of the wooded area now, and the half moon was bright, and when I looked back, I could see an Apache coming up after us with a knife in his teeth. He was climbin’ that hill so fast, he was damn near runnin’ on all fours.  I dropped to one knee and aimed and made a good shot that sent him tumbling back down the rise. Horrible thing was, we could hear the other men in the woods down there gettin’ hacked and shot to pieces, screamin’ and a pleadin’, but we knew wasn’t no use in tryin’ to go back down there. We was outsmarted and outmanned and outfought.  Thing worked in our favor, was the poor old mule was still there wearing that makeshift harness and carry-along we had put him in, with the wood stacked on it. He had wandered a bit, but hadn’t left the area.  Bill cut the log rig loose, and cut the packing off the mule’s back; then he swung up on the beast and pulled Cullen up behind him, which showed a certain lack of respect for my leadership, which, frankly, was somethin’ I could agree with.  I took hold of the mule’s tail, and off we went, them ridin’, and me runnin’ behind holdin’ to my rifle with one hand, holdin’ on to the mule’s tail with the other, hopin’ he didn’t fart or shit or pause to kick. This was an old Indian trick, one we had learned in the cavalry. You can also run alongside, you got somethin’ to hang on to. Now, if the horse, or mule, decided to run full out, well, you was gonna end up with a mouth full of sod, but a rider and a horse and a fella hangin’, sort of lettin’ himself be pulled along at a solid speed, doin’ big strides, can make surprisin’ time and manage not to wear too bad if his legs are strong.  When I finally chanced a look over my shoulder, I seen the Apache were comin’, and not in any Sunday picnic stroll sort of way either. They was all on horseback. They had our horses to go with theirs. Except Satan. That bastard hadn’t let me ride, but he hadn’t let no one else ride either, so I gained a kind of respect for him.  A shot cut through the night air, and didn’t nothin’ happen right off, but then Bill eased off the mule like a candle meltin’. The shot had gone over Cullen’s shoulder and hit Bill in the back of the head. We didn’t stop to check his wounds. Cullen slid forward, takin’ the reins, slowed the mule a bit and stuck out his hand. I took it, and he helped me swing up behind him. There’s folks don’t know a mule can run right swift, it takes a mind to, but it can. They got a gait that shakes your guts, but they’re pretty good runners. And they got wind and they’re about three times smarter than a horse.  What they don’t got is spare legs for when they step in a chuckhole, and that’s what happened. It was quite a fall, and I had an idea then how that Apache had felt when his horse had gone out from under him. The fall chunked me and Cullen way off and out into the dirt, and it damn sure didn’t do the mule any good.  On the ground, the poor old mule kept tryin’ to get up, but couldn’t. He had fallen so that his back was to the Apache, and we was tossed out in the dirt, squirmin’. We crawled around so we was between his legs, and I shot him in the head with my pistol and we made a fort of him. On came them Apache. I took my rifle and laid it over the mule’s side and took me a careful bead, and down went one of them. I fired again, and another hit the dirt. Cullen scuttled out from behind the mule and got hold of his rifle where it had fallen, and crawled back. He fired off a couple of shots, but wasn’t as lucky as me. The Apache backed off, and at a distance they squatted down beside their horses and took pot shots at us.  The mule was still warm and he stunk. Bullets were splatterin’ into his body. None of them was comin’ through, but they was lettin’ out a lot of gas. Way I had it figured, them Indians would eventually surround us and we’d end up with our hair hangin’ on their wickiups by mornin’. Thinkin’ on this, I made an offer to shoot Cullen if it looked like we was gonna be overrun.  “Well, I’d rather shoot you then shoot myself,” he said.  “I guess that’s a deal, then,” I said.  It was a bright night and they could see us good, but we could see them good too. The land was flat there, and there wasn’t a whole lot of creepin’ up they could do without us noticin’, but they could still outflank us because they outnumbered us. There was more Apache now than we had seen in the daytime. They had reinforcements. It was like a gatherin’ of ants.  The Apache had run their horses all out, and now they was no water for them, so they cut the horse’s throats and lit a fire. After a while we could smell horse meat sizzlin’. The horses had been killed so that they made a ring of flesh they could hide behind, and the soft insides was a nice late supper.  “They ain’t got no respect for guv’ment property,” Cullen said.  I got out my knife and cut the mule’s throat, and he was still fresh enough blood flowed, and we put our mouths on the cut and sucked out all we could. It tasted better than I would have figured, and it made us feel a mite better too, but with there just bein’ the two of us, we didn’t bother to start a fire and cook our fort.  We could hear them over there laughin’ and a cuttin’ up, and I figure they had them some mescal, ’cause after a bit, they was actually singin’ a white man song, “Row, row, row you boat,” and we had to listen to that for a couple of hours.  “Goddamn missionaries,” I said.  After a bit, one of them climbed over a dead horse and took his breechcloth down and turned his ass to us and it winked dead-white in the moonlight, white as any Irishman’s ass. I got my rifle on him, but for some reason I couldn’t let the hammer down. It just didn’t seem right to shoot some drunk showin’ me his ass. He turned around and peed, kind of pushin’ his loins out, like he was doin’ a squaw, and laughed, and that was enough. I shot that sonofabitch. I was aimin’ for his pecker, but I think I got him in the belly. He fell over and a couple of Apache come out to get him. Cullen shot one of them, and the one was left jumped over the dead horses and disappeared behind them.  “Bad enough they’re gonna kill us,” Cullen said, “but they got to act nasty too.”  We laid there for a while. Cullen said, “Maybe we ought to pray for deliverance.”  “Pray in one hand, shit in the other, and see which one fills up first.”  “I guess I won’t pray,” he said. “Or shit. Least not at the moment. You remember, that’s how we met. I was—”  “I remember,” I said.  Well, we was waitin’ for them to surround us, but like Colonel Hatch said, you can never figure an Apache. We laid there all night, and nothin’ happen. I’m ashamed to say, I nodded off, and when I awoke it was good and daylight and hadn’t nobody cut our throats or taken our hair.  Cullen was sittin’ with his legs crossed, lookin’ in the direction of the Apache. I said, “Damn, Cullen. I’m sorry. I fell out.”  “I let you. They’re done gone.”  I sat up and looked. There was the horses, buzzards lightin’ on them, and there were a few of them big ole birds on the ground eyeballin’ our mule, and us. I shooed them, said, “I’ll be damn. They just packed up like a circus and left.”  “Yep. Ain’t no rhyme to it. They had us where they wanted us. Guess they figured they’d lost enough men over a couple of buffalo soldiers, or maybe they saw a bird like Colonel Hatch was talkin’ about, and he told them to take themselves home.”  “What I figure is they just too drunk to carry on, and woke up with hangovers and went somewhere cool and shaded to sleep it off.”  “Reckon so,” Cullen said. Then: “Hey, you mean what you said about me bein’ a top soldier and all?”  “You know it.”  “You ain’t a colonel or nothin’, but I appreciate it. Course, I don’t feel all that top right now.”  “We done all we could do. It was Hatch screwed the duck. He ought not have separated us from the troop like that.”  “Don’t reckon he’ll see it that way,” Cullen said.  “I figure not,” I said.  We cut off chunks of meat from the mule and made a little fire and filled our bellies, then we started walkin’. It was blazin’ hot, and still we walked. When nightfall come, I got nervous, thinkin’ them Apache might be comin’ back, and that in the long run they had just been funnin’ us. But they didn’t show, and we took turns sleepin’ on the hard plains.  Next mornin’ it was hot, and we started walkin’. My back hurt and my ass was draggin’ and my feet felt like someone had cut them off. I wished we had brought some of that mule meat with us. I was so hungry, I could see cornbread walkin’ on the ground. Just when I was startin’ to imagine pools of water and troops of soldiers dancin’ with each other, I seen somethin’ that was a little more substantial.  Satan.  I said to Cullen, “Do you see a big black horse?”  “You mean, Satan?”  “Yep.”  “I see him.”  “Did you see some dancin’ soldiers?”  “Nope.”  “Do you still see the horse?”  “Yep, and he looks strong and rested. I figure he found a water hole and some grass, the sonofabitch.”  Satan was trottin’ along, not lookin’ any worse for wear. He stopped when he seen us, and I tried to whistle to him, but my mouth was so dry, I might as well have been trying to whistle him up with my asshole.  I put my rifle down and started walkin’ toward him, holdin’ out my hand like I had a treat. I don’t think he fell for that, but he dropped his head and let me walk up on him. He wasn’t saddled, as we had taken all that off when we went to cut wood, but he still had his bridle and reins. I took hold of the bridle. I swung onto his back, and then he bucked. I went up and landed hard on the ground. My head was spinnin’, and the next thing I know, that evil bastard was nuzzlin’ me with his nose.  I got up and took the reins and led him over to where Cullen was leanin’ on his rifle. “Down deep,” he said, “I think he likes you.”  We rode Satan double back to the fort, and when we got there, a cheer went up. Colonel Hatch come out and shook our hands and even hugged us. “We found what was left of you boys this mornin’, and it wasn’t a pretty picture. They’re all missin’ eyes and balls sacks and such. We figured you two had gone under with the rest of them. Was staked out on the plains somewhere with ants in your eyes. We got vengeful and started trailin’ them Apache, and damn if we didn’t meet them comin’ back toward us, and there was a runnin’ fight took us in the direction of the Pecos. We killed one, but the rest of them got away. We just come ridin’ in a few minutes ahead of you.”  “You’d have come straight on,” Cullen said, “you’d have seen us. And we killed a lot more than one.”  “That’s good,” Hatch said, “and we want to hear your story and Nate’s soon as you get somethin’ to eat and drink. We might even let you have a swallow of whiskey. Course, Former House Nigger here will have to do the cookin’, ain’t none of us any good.”  “That there’s fine,” I said, “but, my compadre here, he ain’t The Former House Nigger. He’s Private Cullen.”  Colonel Hatch eyeballed me. “You don’t say?”  “Yes sir, I do, even if it hair lips the United States Army.”  “Hell,” Hatch said. “That alone is reason to say it.”  There ain’t much to tell now. We said how things was, and they did some investigatin’, and damn if we wasn’t put in for medals. We didn’t never get them, ’cause they was slow about given coloreds awards, and frankly, I didn’t think we deserved them, not with us breakin’ and runnin’ the way we did, like a bunch of little girls tryin’ to get in out of the rain, leavin’ them men behind. But we didn’t stress that part when we was tellin’ our story. It would have fouled it some, and I don’t think we had much choice other than what we did. We was as brave as men could be without gettin’ ourselves foolishly killed.  Still, we was put in for medals, and that was somethin’. In time, Cullen made the rank of Top Soldier. It wasn’t just me tellin’ him no more. It come true. He become a sergeant, and would have made a good one too, but he got roarin’ drunk and set fire to a dead pig and got his stripes taken and spent some time in the stockade. But that’s another story.  I liked the cavalry right smart myself, and stayed on there until my time run out and I was supposed to sign up again, and would have too, had it not been for them Chinese women I told you about at the first. But again, that ain’t this story. This is the one happened to me in the year of 1870, out there on them hot West Texas plains. I will add a side note. The army let me keep Satan when I was mustered out, and I grew to like him, and he was the best horse I ever had, and me and him became friends of a sort, until 1872, when I had to shoot him and feed him to a dog and a woman I liked better.    Originally published in Warriors edited by George R. R. Martin and Gardner Dozois. Prolific Texas writer Joe R. Lansdale has won the Edgar Award, the British Fantasy Award, the American Horror Award, the American Mystery Award, the International Crime Writer's Award, and six Bram Stoker Awards. Although perhaps best known for horror/thrillers such as The Nightrunners, Bubba Ho-Tep, The Bottoms, The God of the Razor, and The Drive-In, he also writes the popular Hap Collins and Leonard Pine mystery series--Savage Season, Mucho Mojo, The Two-Bear Mambo, Bad Chili, Rumble Tumble, Captains Outrageous, Devil's Road, and Hyenas--as well as Western novels such as Texas Night Rider and Blooddance, and totally unclassifiable cross-genre novels such as Zeppelins West, The Magic Wagon, and Flaming London. His other novels include Dead in The West, The Big Blow, Sunset and Sawdust, Acts of Love, Freezer Burn, Waltz of Shadows, The Drive-In 2: Not Just One of Them Sequels, Leather Maiden, Damaged by Choice, and Edge of Dark Water. He has also contributed novels to series such as Batman and Tarzan. His many short stories have been collected in By Bizarre Hands, Tight Little Stitches on a Dead Man's Back, The Shadows Kith and Kin, The Long Ones, Stories by Mama Lansdale's Youngest Boy, Bestsellers Guaranteed, On the Far Side of the Cadillac Desert with the Dead Folks, Electric Gumbo, Writer of the Purple Rage, Fist Full of Stories, Steppin' Out, Summer '68, Bumper Crop, The Good, the Bad and the Indifferent, Selected Stories by Joe R. Lansdale, For a Few Stories More, Mad Dog Summer: And Other Stories, The King and Other Stories, Deadman's Road, an omnibus, Flaming Zeppelins: The Adventures of Ned the Seal, Shadows West (with John L. Lansdale), Trapped in the Sunday Matinee and High Cotton: the Collected Stories of Joe R. Lansdale. As editor, he has produced the anthologies The Best of the West, Retro Pulp Tales, Son of Retro Pulp Tales, Razored Saddles (with Pat LoBrutto), Dark At Heart: All New Tales of Dark Suspense (with wife Karen Lansdale), The Horror Hall of Fame: The Stoker Winners, the Robert E. Howard tribute anthology, Cross Plains Universe (with Scott A. Cupp), Crucified Dreams, and The Urban Fantasy Anthology (edited with Peter S. Beagle). An anthology in tribute to Lansdale's work is Lords of the Razor. His most recent books are a new Hap and Leonard novel, Dead Aim, The Thicket, The Ape Man's Brother, and a big retrospective collection, Bleeding Shadows. He lives with his family in Nacogdoches, Texas.", "text": "9780 words, novelette, REPRINT\nSoldierin'\nThey said if you went out West and joined up with the colored soldiers, they’d pay you in real Yankee dollars, thirteen of them a month, feed and clothe you, and it seemed like a right smart idea since I was wanted for a lynchin’. It wasn’t that I was invited to hold the rope or sing a little spiritual. I was the guest of honor on this one. They was plannin’ to stretch my neck like a goozle-wrung chicken at Sunday dinner.\nThing I’d done was nothin’ on purpose, but in a moment of eyeballin’ while walkin’ along the road on my way to cut some firewood for a nickel and a jar of jam, a white girl who was hangin’ out wash bent over and pressed some serious butt up against her gingham, and a white fella, her brother, seen me take a look, and that just crawled all up in his ass and died, and he couldn’t stand the stink.\nNext thing I know, I’m wanted for being bold with a white girl, like maybe I’d broke into her yard and jammed my arm up her ass, but I hadn’t done nothin’ but what’s natural, which is glance at a nice butt when it was available to me.\nNow, in the livin’ of my life, I’ve killed men and animals and made love to three Chinese women on the same night in the same bed and one of them with only one leg, and part of it wood, and I even ate some of a dead fella once when I was crossin’ the mountains, though I want to rush in here and make it clear I didn’t know him all that well, and we damn sure wasn’t kinfolks. Another thing I did was I won me a shootin’ contest up Colorady way against some pretty damn famous shooters, all white boys, but them’s different stories and not even akin to the one I want to tell, and I’d like to add, just like them other events, this time I’m talking about is as true as the sunset.\nPardon me. Now that I’ve gotten older, sometimes I find I start out to tell one story and end up tellin’ another. But to get back to the one I was talkin’ about . . . So, havin’ been invited to a lynchin’, I took my daddy’s horse and big ole loaded six-gun he kept wrapped up in an oilcloth from under the floorboards of our shack, and took off like someone had set my ass on fire. I rode that poor old horse till he was slap worn out. I had to stop over in a little place just outside of Nacogdoches and steal another one, not on account of I was a thief, but on account of I didn’t want to get caught by the posse and hung and maybe have my pecker cut off and stuck in my mouth. Oh. I also took a chicken. He’s no longer with me, of course, as I ate him out there on the trail.\nAnyway, I left my horse for the fella I took the fresh horse and the chicken from, and I left him a busted pocket watch on top of the railing post, and then I rode out to West Texas. It took a long time for me to get there, and I had to stop and steal food and drink from creeks and make sure the horse got fed with corn I stole. After a few days, I figured I’d lost them that was after me, and I changed my name as I rode along. It had been Wiliford P. Thomas, the P not standing for a thing other than P. I chose the name Nat Wiliford for myself, and practiced on saying it while I rode along. When I said it, I wanted it to come out of my mouth like it wasn’t a lie.\nBefore I got to where I was goin’, I run up against this colored fella taking a dump in the bushes, wiping his ass on leaves. If I had been a desperado, I could have shot him out from over his pile and taken his horse, ’cause he was deeply involved in the event—so much, in fact, that I could see his eyes were crossed from where I rode up on a hill, and that was some distance.\nI was glad I was downwind, and hated to interrupt, so I sat on my stolen horse until he was leaf wiping, and then I called out. “Hello, the shitter.”\nHe looked up and grinned at me, touched his rifle lying on the ground beside him, said, “You ain’t plannin’ on shootin’ me, are you?”\n“No. I thought about stealin’ your horse, but it’s sway back and so ugly in the face it hurts my feelings.”\n“Yeah, and it’s blind in one eye and has a knot on its back comes right through the saddle. When I left the plantation, I took that horse. Wasn’t much then, and it’s a lot less now.”\nHe stood up and fastened his pants and I seen then that he was a pretty big fellow, all decked out in fresh-looking overalls and a big black hat with a feather in it. He came walkin’ up the hill toward me, his wipin’ hand stuck out for a shake, but I politely passed, because I thought his fingers looked a little brown.\nAnyway, we struck it up pretty good, and by nightfall we found a creek, and he washed his hands in the water with some soap from his saddlebag, which made me feel a mite better. We sat and had coffee and some of his biscuits. All I could offer was some conversation, and he had plenty to give back. His name was Cullen, but he kept referrin’ to himself as The Former House Nigger, as if it were a rank akin to general. He told a long story about how he got the feather for his hat, but it mostly just came down to he snuck up on a hawk sittin’ on a low limb and jerked it out of its tail.\n“When my master went to war against them Yankees,” he said, “I went with him. I fought with him and wore me a butternut coat and pants, and I shot me at least a half dozen of them Yankees.”\n“Are you leaking brains out of your gourd?” I said. “Them rebels was holdin’ us down.”\n“I was a house nigger, and I grew up with Mr. Gerald, and I didn’t mind going to war with him. Me and him was friends. There was lots of us like that.”\n“Y’all must have got dropped on your head when you was young’ns.”\n“The Master and the older Master was all right.”\n“’Cept they owned you,” I said.\n“Maybe I was born to be owned. They always quoted somethin’ like that out of the Bible.”\n“That ought to have been your clue, fella. My daddy always said that book has caused more misery than chains, an ill-tempered woman, and a nervous dog.”\n“I loved Young Master like a brother, truth be known. He got shot in the war, right ’tween the eyes by a musket ball, killed him deader than a goddamn tree stump. I sopped up his blood in a piece of his shirt I cut off, mailed it back home with a note on what happened. When the war was over, I stayed around the plantation for a while, but everything come apart then, the old man and the old lady died, and I buried them out back of the place a good distance from the privy and uphill, I might add. That just left me and the Old Gentleman’s dog.\n“The dog was as old as death and couldn’t eat so good, so I shot it, and went on out into what Young Master called The Big Wide World. Then, like you, I heard the guv’ment was signing up coloreds for its man’s army. I ain’t no good on my own. I figured the army was for me.”\n“I don’t like being told nothin’ by nobody,” I said, “but I surely love to get paid.” I didn’t mention I also didn’t want to get killed by angry crackers and the army seemed like a good place to hide.\nAbout three days later, we rode up on the place we was looking for. Fort McKavett, between the Colorady and the Pecos rivers. It was a sight, that fort. It was big and it didn’t look like nothin’ I’d ever seen before. Out front was colored fellas in army blue drilling on horseback, looking sharp in the sunlight, which there was plenty of. It was hot where I come from, sticky even, but you could find a tree to get under. Out here, all you could get under was your hat, or maybe some dark cloud sailing across the face of the sun, and that might last only as long as it takes a bird to fly over.\nBut there I was. Fort McKavett. Full of dreams and crotch itch from long riding, me and my new friend sat on our horses, lookin’ the fort over, watchin’ them horse soldiers drill, and it was prideful thing to see. We rode on down in that direction.\nIn the Commanding Officer’s quarters, me and The Former House Nigger stood before a big desk with a white man behind it, name of Colonel Hatch. He had a caterpillar mustache and big sweat circles like wet moons under his arms. His eyes were aimed on a fly sitting on some papers on his desk. Way he was watchin’ it, you’d have thought he was beading down on a hostile. He said, “So you boys want to sign up for the colored army. I figured that, you both being colored.”\nHe was a sharp one, this Hatch.\nI said, “I’ve come to sign up and be a horse rider in the Ninth Cavalry.”\nHatch studied me for a moment, said, “Well, we got plenty of ridin’ niggers. What we need is walkin’ niggers for the goddamn infantry, and I can get you set in the right direction to hitch up with them.”\nI figured anything that was referred to with goddamn in front of it wasn’t the place for me.\n“I reckon ain’t a man here can ride better’n me,” I said, “and that would be even you, Colonel, and I’m sure you are one ridin’ sonofabitch, and I mean that in as fine a way as I can say it.”\nHatch raised an eyebrow. “That so?”\n“Yes, sir. No brag, just fact. I can ride on a horse’s back, under his belly, make him lay down and make him jump, and at the end of the day, I take a likin’ to him, I can diddle that horse in the ass and make him enjoy it enough to brew my coffee and bring my slippers, provided I had any. That last part about the diddlin’ is just talkin’, but the first part is serious.”\n“I figured as much,” Hatch said.\n“I ain’t diddlin’ no horses,” The Former House Nigger said. “I can cook and lay out silverware. Mostly, as a Former House Nigger, I drove the buggy.”\nAt that moment, Hatch come down on that fly with his hand, and he got him too. He peeled it off his palm and flicked it on the floor. There was this colored soldier standing nearby, very stiff and alert, and he bent over, picked the fly up by a bent wing, threw it out the door and came back. Hatch wiped his palm on his pants leg. “Well,” he said, “let’s see how much of what you got is fact, and how much is wind.”\nThey had a corral nearby, and inside it, seeming to fill it up, was a big black horse that looked like he ate men and shitted out saddlebags made of their skin and bones. He put his eye right on me when I came out to the corral, and when I walked around on the other side, he spun around to keep a gander on me. Oh, he knew what I was about, all right.\nHatch took hold of one corner of his mustache and played with it, turned, and looked at me. “You ride that horse well as you say you can, I’ll take both of you into the cavalry, and The Former House Nigger can be our cook.”\n“I said I could cook,” The Former House Nigger said. “Didn’t say I was any good.”\n“Well,” Hatch said, “what we got now ain’t even cookin’. There’s just a couple fellas that boil water and put stuff in it. Mostly turnips.”\nI climbed up on the railing, and by this time, four colored cavalry men had caught up the horse for me. That old black beast had knocked them left and right, and it took them a full twenty minutes to get a bridle and a saddle on him, and when they come off the field, so to speak, two was limpin’ like they had one foot in a ditch. One was holding his head where he had been kicked, and the other looked amazed he was alive. They had tied the mount next to the railin’, and he was hoppin’ up and down like a little girl with a jump rope, only a mite more vigorous.\n“Go ahead and get on,” Hatch said.\nHaving bragged myself into a hole, I had no choice.\nI wasn’t lyin’ when I said I was a horse rider. I was. I could buck them and make them go down on their bellies and roll on their sides, make them strut and do whatever, but this horse was as mean as homemade sin, and I could tell he had it in for me.\nSoon as I was on him, he jerked his head and them reins snapped off the railing and I was clutchin’ at what was left of it. The sky came down on my head as that horse leaped. Ain’t no horse could leap like that, and soon me and him was trying to climb the clouds. I couldn’t tell earth from heaven, ’cause we bucked all over that goddamn lot, and ever time that horse come down, it jarred my bones from butt to skull. I come out of the saddle a few times, nearly went off the back of him, but I hung in there, tight as a tick on a dog’s nuts. Finally he jumped himself out and started to roll. He went down on one side, mashing my leg in the dirt, and rolled on over. Had that dirt in the corral not been tamped down and soft, giving with me, there wouldn’t been nothing left of me but a sack of blood and broken bones.\nFinally the horse humped a couple of sad bucks and gave out, started to trot and snort. I leaned over close to his ear and said, “You call that buckin’?” He seemed to take offense at that, and run me straight to the corral and hit the rails there with his chest. I went sailin’ off his back and landed on top of some soldiers, scatterin’ them like quail.\nHatch come over and looked down on me, said, “Well, you ain’t smarter than the horse, but you can ride well enough. You and The Former House Nigger are in with the rest of the ridin’ niggers. Trainin’ starts in the morning.”\nWe drilled with the rest of the recruits up and down that lot, and finally outside and around the fort until we was looking pretty smart. The horse they give me was that black devil I had ridden. I named him Satan. He really wasn’t as bad as I first thought. He was worse, and you had to be at your best every time you got on him, ’cause deep down in his bones, he was always thinking about killing you, and if you didn’t watch it, he’d kind of act casual, like he was watching a cloud or somethin’, and quickly turn his head and take a nip out of your leg, if he could bend far enough to get to it.\nAnyway, the months passed, and we drilled, and my buddy cooked, and though what he cooked wasn’t any good, it was better than nothin’. It was a good life as compared to being hung, and there was some real freedom to it and some respect. I wore my uniform proud, set my horse like I thought I was somethin’ special with a stick up its ass.\nWe mostly did a little patrollin’, and wasn’t much to it except ridin’ around lookin’ for wild Indians we never did see, collectin’ our thirteen dollars at the end of the month, which was just so much paper ’cause there wasn’t no place to spend it. And then, one mornin’, things changed, and wasn’t none of it for the better, except The Former House Nigger managed to cook a pretty good breakfast with perfect fat biscuits and eggs with the yolks not broke and some bacon that wasn’t burned and nobody got sick this time.\nOn that day, Hatch mostly rode around with us, ’cause at the bottom of it all, I reckon the government figured we was just a bunch of ignorant niggers who might at any moment have a watermelon relapse and take to gettin’ drunk and shootin’ each other and maybe trying to sing a spiritual while we diddled the horses, though I had sort of been responsible for spreadin’ the last part of that rumor on my first day at the fort. We was all itchin’ to show we had somethin’ to us that didn’t have nothin’ to do with no white fella ridin’ around in front of us, though I’ll say right up front, Hatch was a good soldier who led and didn’t follow, and he was polite too. I had seen him leave the circle of the fire to walk off in the dark to fart. You can’t say that about just anyone. Manners out on the frontier was rare.\nYou’ll hear from the army how we was all a crack team, but this wasn’t so, at least not when they was first sayin’ it. Most of the army at any time, bein’ they the ridin’ kind or the walkin’ kind, ain’t all that crack. Some of them fellas didn’t know a horse’s ass end from the front end, and this was pretty certain when you seen how they mounted, swinging into the stirrups, finding themselves looking at the horse’s tail instead of his ears. But in time everyone got better, though I’d like to toss in, without too much immodesty, that I was the best rider of the whole damn lot. Since he’d had a good bit of experience, The Former House Nigger was the second. Hell, he’d done been in war and all, so in ways, he had more experience than any of us, and he cut a fine figure on a horse, being tall and always alert, like he might have to bring somebody a plate of something or hold a coat.\nOnly action we’d seen was when one of the men, named Rutherford, got into it with Prickly Pear—I didn’t name him, that come from his mother—and they fought over a biscuit. While they was fightin’, Colonel Hatch come over and ate it, so it was a wasted bout.\nBut this time I’m tellin’ you about, we rode out lookin’ for Indians to scare, and not seein’ any, we quit lookin’ for what we couldn’t find, and come to a little place down by a creek where it was wooded and there was a shade from a whole bunch of trees that in that part of the country was thought of as being big, and in my part of the country would have been considered scrubby. I was glad when we stopped to water the horses and take a little time to just wait. Colonel Hatch, I think truth be told, was glad to get out of that sun much as the rest of us. I don’t know how he felt, being a white man and having to command a bunch of colored, but he didn’t seem bothered by it a’tall, and seemed proud of us and himself, which, of course, made us all feel mighty good.\nSo we waited out there on the creek, and Hatch, he come over to where me and The Former House Nigger were sitting by the water, and we jumped to attention, and he said, “There’s a patch of scrub oaks off the creek, scattering out there across the grass, and they ain’t growin’ worth a damn. Them’s gonna be your concern. I’m gonna take the rest of the troop out across the ground there, see if we can pick up some deer trails. I figure ain’t no one gonna mind if we pot a few and bring them back to camp. And besides, I’m bored. But we could use some firewood, and I was wantin’ you fellas to get them scrubs cut down and sawed up and ready to take back to the fort. Stack them in here amongst the trees, and I’ll send out some men with a wagon when we get back, and have that wood hauled back before it’s good and dark. I thought we could use some oak to smoke the meat I’m plannin’ on gettin’. That’s why I’m the goddamn colonel. Always thinkin’.”\n“What if you don’t get no meat?” one of the men with us said.\n“Then you did some work for nothin’, and I went huntin’ for nothin’. But, hell, I seen them deer with my binoculars no less than five minutes ago. Big fat deer, about a half dozen of them running along. They went over the hill. I’m gonna take the rest of the troops with me in case I run into hostiles, and because I don’t like to do no skinnin’ of dead deer myself.”\n“I like to hunt,” I said.\n“That’s some disappointin’ shit for you,” Colonel Hatch said. “I need you here. In fact, I put you in charge. You get bit by a snake and die, then, you, The Former House Nigger, take over. I’m also gonna put Rutherford, Bill, and Rice in your charge . . . some others. I’ll take the rest of them. You get that wood cut up, you start on back to the fort and we’ll send out a wagon.”\n“What about Indians?” Rutherford, who was nearby, said.\n“You seen any Indians since you been here?” Hatch said.\n“No, sir.”\n“Then there ain’t no Indians.”\n“You ever see any?” Rutherford asked Hatch.\n“Oh, hell yeah. Been attacked by them, and I’ve attacked them. There’s every kind of Indian you can imagine out here from time to time. Kiowa. Apache. Comanche. And there ain’t nothin’ they’d like better than to have your prickly black scalps on their belts, ’cause they find your hair funny. They think it’s like the buffalo. They call you buffalo soldiers on account of it.”\n“I thought it was because they thought we was brave like the buffalo,” I said.\n“That figures,” Hatch said. “You ain’t seen no action for nobody to have no opinion of you. But, we ain’t seen an Indian in ages, and ain’t seen no sign of them today. I’m startin’ to think they’ve done run out of this area. But, I’ve thought that before. And Indian, especially a Comanche or an Apache, they’re hard to get a handle on. They’ll get after somethin’ or someone like it matters more than anything in the world, and then they’ll wander off if a bird flies over and they make an omen of it.”\nLeaving us with them mixed thoughts on Indians and buffalo, Hatch and the rest of the men rode off, left us standing in the shade, which wasn’t no bad place to be. First thing we did when they was out of sight was throw off our boots and get in the water. I finally just took all my clothes off and cleaned up pretty good with a bar of lye soap and got dressed. Then leaving the horses tied up in the trees near the creek, we took the mule and the equipment strapped on his back, carried our rifles, and went out to where them scrubs was. On the way, we cut down a couple of saplings and trimmed some limbs, and made us a kind of pull that we could fasten onto the mule. We figured we’d fill it up with wood and get the mule to drag it back to the creek, pile it, and have it ready for the wagon.\nRigged up, we went to work, taking turns with the saw, two other men working hacking off limbs, one man axing the trimmed wood up so it fit good enough to load. We talked while we worked, and Rutherford said, “Them Indians, some of them is as mean as snakes. They do all kind of things to folks. Cut their eyelids off, cook them over fires, cut off their nut sacks and such. They’re just awful.”\n“Sounds like some Southerners I know,” I said.\n“My master and his family was darn good to me,” The Former House Nigger said.\n“They might have been good to you,” Rice said, pausing at the saw, “but that still don’t make you no horse, no piece of property. You a man been treated like a horse, and you too dumb to know it.”\nThe Former House Nigger bowed up like he was about to fight. I said, “Now, don’t do it. He’s just talkin’. I’m in charge here, and you two get into it, I’ll get it from Hatch, and I don’t want that, and won’t have it.”\nRice tilted his hat back. His face looked dark as coffee. “I’m gonna tell you true. When I was sixteen, I cut my master’s throat and raped his wife and run off to the North.”\n“My God,” The Former House Nigger said. “That’s awful.”\n“And I made the dog suck my dick,” Rice said.\n“What?” The Former House Nigger said.\n“He’s funnin’ you,” I said.\n“That part about the master’s throat,” Rice said, “and runnin’ off to the North. I really did that. I would have raped his wife, but there wasn’t any time. His dog didn’t excite me none.”\n“You are disgustin’,” The Former House Nigger said, pausing from his job of trimming limbs with a hatchet.\n“Agreed,” I said.\nRice chuckled, and went back to sawin’ with Rutherford. He had his shirt off, and the muscles in his back bunched up like prairie dogs tunnelin’, and over them mounds was long, thick scars. I knew them scars. I had a few. They had been made with a whip.\nBill, who was stackin’ wood, said, “Them Indians. Ain’t no use hatin’ them. Hatin’ them for bein’ what they is, is like hatin’ a bush ’cause it’s got thorns on it. Hatin’ a snake ’cause it’ll bite you. They is what they is just like we is what we is.”\n“And what is we?” The Former House Nigger said.\n“Ain’t none of us human beings no ’count. The world is just one big mess of no ’counts, so there ain’t no use pickin’ one brand of man or woman over the other. Ain’t none of them worth a whistlin’ fart.”\n“Ain’t had it so good, have you, Bill?” I asked.\n“I was a slave.”\n“We all was,” I said.\n“Yeah, but I didn’t take it so good. Better’n Rutherford, but not so good. I was in the northern army, right there at the end when they started lettin’ colored in, and I killed and seen men killed. Ain’t none of my life experience give me much of a glow about folks of any kind. I even killed buffalo just for the tongues rich folks wanted to have. We left hides and meat in the fields to rot. That was to punish the Indians. Damned ole buffalo. Ain’t nothin’ dumber, and I shot them for dollars and their tongues. What kind of human beings does that?”\nWe worked for about another hour, and then, Dog Den—again, I didn’t name him—one of the other men Hatch left with us, said, “I think we got a problem.”\nOn the other side of the creek, there was a split in the trees, and you could see through them out into the plains, and you could see the hill Hatch had gone over some hours ago, and comin’ down it at a run was a white man. He was a good distance away, but it didn’t take no eagle eye to see that he was naked as a skinned rabbit, and runnin’ full out, and behind him, whoopin’ and having a good time, were Indians. Apache, to be right on the money, nearly as naked as the runnin’ man. Four of them was on horseback, and there was six of them I could see on foot runnin’ after him. My guess was they had done been at him and had set him loose to chase him like a deer for fun. I guess livin’ out on the plains like they did, with nothin’ but mesquite berries and what food they could kill, you had to have your fun where you could find it.\n“They’re funnin’ him,” Rutherford said, figurin’ same as me.\nWe stood there lookin’ for a moment; then I remembered we was soldiers. I got my rifle and was about to bead down, when Rutherford said, “Hell, you can’t hit them from here, and neither can they shoot you. We’re out of range, and Indians ain’t no shots to count for.”\nOne of the runnin’ Apaches had spotted us, and he dropped to one knee and pointed his rifle at us, and when he did, Rutherford spread his arms wide, and said, “Go on, shoot, you heathen.”\nThe Apache fired.\nRutherford was wrong. He got it right on the top of the nose and fell over with his arms still spread. When he hit the ground, The Former House Nigger said, “I reckon they been practicin’.”\nWe was up on a hill, so we left the mule and run down to the creek where the horses was, and waded across the little water and laid out between the trees and took aim. We opened up and it sounded like a bunch of mule skinners crackin’ their whips. The air filled with smoke and there was some shots fired back at us. I looked up and seen the runnin’ man was makin’ right smart time, his hair and johnson flappin’ as he run. But then one of the horseback Apaches rode up on him, and with this heavy knotted-looking stick he was carrying, swung and clipped the white fella along the top of the head. I seen blood jump up and the man go down and I could hear the sound of the blow so well, I winced. The Apache let out a whoop and rode on past, right toward us. He stopped to beat his chest with his free hand, and when he did, I took a shot at him. I aimed for his chest, but I hit the horse square in the head and brought him down. At least I had the heathen on foot.\nNow, you can say what you want about an Apache, but he is about the bravest thing there is short of a badger. This’n come runnin’ right at us, all of us firin’ away, and I figure he thought he had him some big magic, ’cause not a one of our shots hit him. It was like he come haint-like right through a wall of bullets. As he got closer, I could see he had some kind of mud paint on his chest and face, and he was whoopin’ and carryin’ on somethin’ horrible. And then he stepped in a hole and went down. Though he was still a goodly distance from us, I could hear his ankle snap like a yanked suspender. Without meaning to, we all went, “Oooooh.” It hurt us, it was so nasty soundin’.\nThat fall must have caused his magic to fly out of his ass, ’cause we all started firing at him, and this time he collected all our bullets, and was deader than a guv’ment promise before the smoke cleared.\nThis gave the rest of them Apache pause, and I’m sure, brave warriors or not, a few assholes puckered out there.\nThem ridin’ Apaches stopped their horses and rode back until they was up on the hill, and the runnin’ Indians dropped to the ground and lay there. We popped off a few more shots, but didn’t hit nothin’, and then I remembered I was in charge. I said, “Hold your fire. Don’t waste your bullets.”\nThe Former House Nigger crawled over by me, said, “We showed them.”\n“They ain’t showed yet,” I said. “Them’s Apache warriors. They ain’t known as slackers.”\n“Maybe Colonel Hatch heard all the shootin’,” he said.\n“They’ve had time to get a good distance away. They figured on us cuttin’ the wood and leavin’ it and goin’ back to the fort. So maybe they ain’t missin’ us yet and didn’t hear a thing.”\n“Dang it,” The Former House Nigger said.\nI thought we might just mount up and try to ride off. We had more horses than they did, but three of them ridin’ after us could still turn out bad. We had a pretty good place as we was, amongst the trees with water to drink. I decided best thing we could do was hold our position. Then that white man who had been clubbed in the head started moaning. That wasn’t enough, a couple of the braves come up out of the grass and ran at his spot. We fired at them, but them Spencer single shots didn’t reload as fast as them Indians could run. They come down in the tall grass where the white man had gone down, and we seen one of his legs jump up like a snake, and go back down, and the next moment came the screaming.\nIt went on and on. Rice crawled over to me and said, “I can’t stand it. I’m gonna go out there and get him.”\n“No, you’re not,” I said. “I’ll do it.”\n“Why you?” Rice said.\n“’Cause I’m in charge.”\n“I’m goin’ with you,” The Former House Nigger said.\n“Naw, you ain’t,” I said. “I get rubbed out, you’re the one in charge. That’s what Colonel Hatch said. I get out there a ways, you open up on them other Apache, keep ’em busier than a bear with a hive of bees.”\n“Hell, we can’t even see them, and the riders done gone on the other side of the hill.”\n“Shoot where you think they ought to be, just don’t send a blue whistler up my ass.”\nI laid my rifle on the ground, made sure my pistol was loaded, put it back in the holster, pulled my knife, stuck it in my teeth, and crawled to my left along the side of that creek till I come to tall grass, then I worked my way in. I tried to go slow as to make the grass seem to be moved by the wind, which had picked up considerable and was helpin’ my sneaky approach.\nAs I got closer to where the white man had gone down and the Apaches had gone after him, his yells grew somethin’ terrible. I was maybe two or three feet from him. I parted the grass to take a look, seen he was lying on his side, and his throat was cut, and he was dead as he was gonna get.\nJust a little beyond him, the two Apache was lying in the grass, and one of them was yellin’ like he was the white man bein’ tortured, and I thought, Well, if that don’t beat all. I was right impressed.\nThen the Apache saw me. They jumped up and come for me. I rose up quick, pulling the knife from my teeth. One of them hit me like a cannon ball, and away we went rollin’.\nA shot popped off and the other Apache did a kind of dance, about four steps, and went down holdin’ his throat. Blood was flying out of him like it was a fresh-tapped spring. Me and the other buck rolled in the grass and he tried to shoot me with a pistol he was totin’, but only managed to singe my hair and give me a headache and make my left ear ring.\nWe rolled around like a couple of doodlebugs, and then I came up on top and stabbed at him. He caught my hand. I was holding his gun hand to the ground with my left, and he had hold of my knife hand.\n“Jackass,” I said, like this might so wound him to the quick, he’d let go. He didn’t. We rolled over in the grass some more, and he got the pistol loose and put it to my head, but the cap and ball misfired, and all I got was burned some. I really called him names then. I jerked my legs up and wrapped them around his neck, yanked him down on his back, got on top of him and stabbed him in the groin and the belly, and still he wasn’t finished.\nI put the knife in his throat, and he gave me a look of disappointment, like he’s just realized he’d left somethin’ cookin’ on the fire and ought to go get it; then he fell back.\nI crawled over, rolled the white man on his back. They had cut his balls off and cut his stomach open and sliced his throat. He wasn’t gonna come around.\nI made it back to the creek bank and was shot at only a few times by the Apache. My return trip was a mite brisker than the earlier one. I only got a little bit of burn from a bullet that grazed the butt of my trousers.\nWhen I was back at the creek bank, I said, “Who made that shot on the Apache?”\n“That would be me,” The Former House Nigger said.\n“Listen here, I don’t want you callin’ yourself The Former House Nigger no more. I don’t want no one else callin’ you that. You’re a buffalo soldier, and a good’n. Rest of you men hear that?”\nThe men was strung out along the creek, but they heard me, and grunted at me.\n“This here is Cullen. He ain’t nothing but Cullen or Private Cullen, or whatever his last name is. That’s what we call him. You hear that, Cullen? You’re a soldier, and a top soldier at that.”\n“That’s good,” Cullen said, not so moved about the event as I was. “But, thing worryin’ me is the sun is goin’ down.”\n“There’s another thing,” Bill said, crawlin’ over close to us. “There’s smoke over that hill. My guess is it ain’t no cookout.”\nI figured the source of that smoke would be where our white fella had come from, and it would be what was left of whoever he was with or the remains of a wagon or some such. The horse-ridin’ Apache had gone back there either to finish them off and torture them with fire or to burn a wagon down. The Apache was regular little fire starters, and since they hadn’t been able to get to all of us, they was takin’ their misery out on what was within reach.\nAs that sun went down, I began to fret. I moved along the short line of our men and decided not to space them too much, but not bunch them up either. I put us about six feet apart and put a few at the rear as lookouts. Considerin’ there weren’t many of us, it was a short line, and them two in the back was an even shorter line. Hell, they wasn’t no line at all. They was a couple of dots.\nThe night crawled on. A big frog began to bleat near me. Crickets was sawin’ away. Upstairs, the black-as-sin heavens was lit up with stars and the half moon was way too bright.\nCouple hours crawled on, and I went over to Cullen and told him to watch tight, ’cause I was goin’ down the line and check the rear, make sure no one was sleepin’ or pullin’ their johnsons. I left my rifle and unsnapped my revolver holster flap, and went to check.\nBill was fine, but when I come to Rice, he was facedown in the dirt. I grabbed him by the back of his collar and hoisted him up, and his head fell near off. His throat had been cut. I wheeled, snappin’ my revolver into my hand. Wasn’t nothin’ there.\nA horrible feelin’ come over me. I went down the row. All them boys was dead. The Apache had been pickin’ ’em off one at a time, and doin’ it so careful like, the horses hadn’t even noticed.\nI went to the rear and found that the two back there was fine. I said, “You fellas best come with me.”\nWe moved swiftly back to Cullen and Rice, and we hadn’t no more than gone a few paces, when a burst of fire cut the night. I saw an Apache shape grasp at his chest and fall back. Runnin’ over, we found Cullen holding his revolver, and Bill was up waving his rifle around. “Where are they? Where the hell are they?”\n“They’re all around. They’ve done killed the rest of the men.” I said.\n“Ghosts,” Bill said. “They’re ghosts.”\n“What they are is sneaky,” I said. “It’s what them fellas do for a livin’.”\nBy now, I had what you might call some real goddamn misgivin’s, figured I had reckoned right on things. I thought we’d have been safer here, but them Apache had plumb snuck up on us, wiped out three men without so much as leavin’ a fart in the air. I said, “I think we better get on our horses and make a run for it.”\nBut when we went over to get the horses, Satan, soon as I untied him, bolted and took off through the wood and disappeared. “Now, that’s the shits,” I said.\n“We’ll ride double,” Cullen said.\nThe boys was gettin’ their horses loose, and there was a whoop, and an Apache leapfrogged over the back of one of them horses and came down on his feet with one of our own hatchets in his hand. He stuck the blade of it deep in the head of a trooper, a fella whose name I don’t remember, being now in my advanced years, and not really havin’ known the fella that good in the first place. There was a scramble, like startled quail. There wasn’t no military drill about it. It was every sonofabitch for himself. Me and Cullen and Bill tore up the hill, ’cause that was the way we was facin’. We was out of the wooded area now, and the half moon was bright, and when I looked back, I could see an Apache coming up after us with a knife in his teeth. He was climbin’ that hill so fast, he was damn near runnin’ on all fours.\nI dropped to one knee and aimed and made a good shot that sent him tumbling back down the rise. Horrible thing was, we could hear the other men in the woods down there gettin’ hacked and shot to pieces, screamin’ and a pleadin’, but we knew wasn’t no use in tryin’ to go back down there. We was outsmarted and outmanned and outfought.\nThing worked in our favor, was the poor old mule was still there wearing that makeshift harness and carry-along we had put him in, with the wood stacked on it. He had wandered a bit, but hadn’t left the area.\nBill cut the log rig loose, and cut the packing off the mule’s back; then he swung up on the beast and pulled Cullen up behind him, which showed a certain lack of respect for my leadership, which, frankly, was somethin’ I could agree with.\nI took hold of the mule’s tail, and off we went, them ridin’, and me runnin’ behind holdin’ to my rifle with one hand, holdin’ on to the mule’s tail with the other, hopin’ he didn’t fart or shit or pause to kick. This was an old Indian trick, one we had learned in the cavalry. You can also run alongside, you got somethin’ to hang on to. Now, if the horse, or mule, decided to run full out, well, you was gonna end up with a mouth full of sod, but a rider and a horse and a fella hangin’, sort of lettin’ himself be pulled along at a solid speed, doin’ big strides, can make surprisin’ time and manage not to wear too bad if his legs are strong.\nWhen I finally chanced a look over my shoulder, I seen the Apache were comin’, and not in any Sunday picnic stroll sort of way either. They was all on horseback. They had our horses to go with theirs. Except Satan. That bastard hadn’t let me ride, but he hadn’t let no one else ride either, so I gained a kind of respect for him.\nA shot cut through the night air, and didn’t nothin’ happen right off, but then Bill eased off the mule like a candle meltin’. The shot had gone over Cullen’s shoulder and hit Bill in the back of the head. We didn’t stop to check his wounds. Cullen slid forward, takin’ the reins, slowed the mule a bit and stuck out his hand. I took it, and he helped me swing up behind him. There’s folks don’t know a mule can run right swift, it takes a mind to, but it can. They got a gait that shakes your guts, but they’re pretty good runners. And they got wind and they’re about three times smarter than a horse.\nWhat they don’t got is spare legs for when they step in a chuckhole, and that’s what happened. It was quite a fall, and I had an idea then how that Apache had felt when his horse had gone out from under him. The fall chunked me and Cullen way off and out into the dirt, and it damn sure didn’t do the mule any good.\nOn the ground, the poor old mule kept tryin’ to get up, but couldn’t. He had fallen so that his back was to the Apache, and we was tossed out in the dirt, squirmin’. We crawled around so we was between his legs, and I shot him in the head with my pistol and we made a fort of him. On came them Apache. I took my rifle and laid it over the mule’s side and took me a careful bead, and down went one of them. I fired again, and another hit the dirt. Cullen scuttled out from behind the mule and got hold of his rifle where it had fallen, and crawled back. He fired off a couple of shots, but wasn’t as lucky as me. The Apache backed off, and at a distance they squatted down beside their horses and took pot shots at us.\nThe mule was still warm and he stunk. Bullets were splatterin’ into his body. None of them was comin’ through, but they was lettin’ out a lot of gas. Way I had it figured, them Indians would eventually surround us and we’d end up with our hair hangin’ on their wickiups by mornin’. Thinkin’ on this, I made an offer to shoot Cullen if it looked like we was gonna be overrun.\n“Well, I’d rather shoot you then shoot myself,” he said.\n“I guess that’s a deal, then,” I said.\nIt was a bright night and they could see us good, but we could see them good too. The land was flat there, and there wasn’t a whole lot of creepin’ up they could do without us noticin’, but they could still outflank us because they outnumbered us. There was more Apache now than we had seen in the daytime. They had reinforcements. It was like a gatherin’ of ants.\nThe Apache had run their horses all out, and now they was no water for them, so they cut the horse’s throats and lit a fire. After a while we could smell horse meat sizzlin’. The horses had been killed so that they made a ring of flesh they could hide behind, and the soft insides was a nice late supper.\n“They ain’t got no respect for guv’ment property,” Cullen said.\nI got out my knife and cut the mule’s throat, and he was still fresh enough blood flowed, and we put our mouths on the cut and sucked out all we could. It tasted better than I would have figured, and it made us feel a mite better too, but with there just bein’ the two of us, we didn’t bother to start a fire and cook our fort.\nWe could hear them over there laughin’ and a cuttin’ up, and I figure they had them some mescal, ’cause after a bit, they was actually singin’ a white man song, “Row, row, row you boat,” and we had to listen to that for a couple of hours.\n“Goddamn missionaries,” I said.\nAfter a bit, one of them climbed over a dead horse and took his breechcloth down and turned his ass to us and it winked dead-white in the moonlight, white as any Irishman’s ass. I got my rifle on him, but for some reason I couldn’t let the hammer down. It just didn’t seem right to shoot some drunk showin’ me his ass. He turned around and peed, kind of pushin’ his loins out, like he was doin’ a squaw, and laughed, and that was enough. I shot that sonofabitch. I was aimin’ for his pecker, but I think I got him in the belly. He fell over and a couple of Apache come out to get him. Cullen shot one of them, and the one was left jumped over the dead horses and disappeared behind them.\n“Bad enough they’re gonna kill us,” Cullen said, “but they got to act nasty too.”\nWe laid there for a while. Cullen said, “Maybe we ought to pray for deliverance.”\n“Pray in one hand, shit in the other, and see which one fills up first.”\n“I guess I won’t pray,” he said. “Or shit. Least not at the moment. You remember, that’s how we met. I was—”\n“I remember,” I said.\nWell, we was waitin’ for them to surround us, but like Colonel Hatch said, you can never figure an Apache. We laid there all night, and nothin’ happen. I’m ashamed to say, I nodded off, and when I awoke it was good and daylight and hadn’t nobody cut our throats or taken our hair.\nCullen was sittin’ with his legs crossed, lookin’ in the direction of the Apache. I said, “Damn, Cullen. I’m sorry. I fell out.”\n“I let you. They’re done gone.”\nI sat up and looked. There was the horses, buzzards lightin’ on them, and there were a few of them big ole birds on the ground eyeballin’ our mule, and us. I shooed them, said, “I’ll be damn. They just packed up like a circus and left.”\n“Yep. Ain’t no rhyme to it. They had us where they wanted us. Guess they figured they’d lost enough men over a couple of buffalo soldiers, or maybe they saw a bird like Colonel Hatch was talkin’ about, and he told them to take themselves home.”\n“What I figure is they just too drunk to carry on, and woke up with hangovers and went somewhere cool and shaded to sleep it off.”\n“Reckon so,” Cullen said. Then: “Hey, you mean what you said about me bein’ a top soldier and all?”\n“You know it.”\n“You ain’t a colonel or nothin’, but I appreciate it. Course, I don’t feel all that top right now.”\n“We done all we could do. It was Hatch screwed the duck. He ought not have separated us from the troop like that.”\n“Don’t reckon he’ll see it that way,” Cullen said.\n“I figure not,” I said.\nWe cut off chunks of meat from the mule and made a little fire and filled our bellies, then we started walkin’. It was blazin’ hot, and still we walked. When nightfall come, I got nervous, thinkin’ them Apache might be comin’ back, and that in the long run they had just been funnin’ us. But they didn’t show, and we took turns sleepin’ on the hard plains.\nNext mornin’ it was hot, and we started walkin’. My back hurt and my ass was draggin’ and my feet felt like someone had cut them off. I wished we had brought some of that mule meat with us. I was so hungry, I could see cornbread walkin’ on the ground. Just when I was startin’ to imagine pools of water and troops of soldiers dancin’ with each other, I seen somethin’ that was a little more substantial.\nSatan.\nI said to Cullen, “Do you see a big black horse?”\n“You mean, Satan?”\n“Yep.”\n“I see him.”\n“Did you see some dancin’ soldiers?”\n“Nope.”\n“Do you still see the horse?”\n“Yep, and he looks strong and rested. I figure he found a water hole and some grass, the sonofabitch.”\nSatan was trottin’ along, not lookin’ any worse for wear. He stopped when he seen us, and I tried to whistle to him, but my mouth was so dry, I might as well have been trying to whistle him up with my asshole.\nI put my rifle down and started walkin’ toward him, holdin’ out my hand like I had a treat. I don’t think he fell for that, but he dropped his head and let me walk up on him. He wasn’t saddled, as we had taken all that off when we went to cut wood, but he still had his bridle and reins. I took hold of the bridle. I swung onto his back, and then he bucked. I went up and landed hard on the ground. My head was spinnin’, and the next thing I know, that evil bastard was nuzzlin’ me with his nose.\nI got up and took the reins and led him over to where Cullen was leanin’ on his rifle. “Down deep,” he said, “I think he likes you.”\nWe rode Satan double back to the fort, and when we got there, a cheer went up. Colonel Hatch come out and shook our hands and even hugged us. “We found what was left of you boys this mornin’, and it wasn’t a pretty picture. They’re all missin’ eyes and balls sacks and such. We figured you two had gone under with the rest of them. Was staked out on the plains somewhere with ants in your eyes. We got vengeful and started trailin’ them Apache, and damn if we didn’t meet them comin’ back toward us, and there was a runnin’ fight took us in the direction of the Pecos. We killed one, but the rest of them got away. We just come ridin’ in a few minutes ahead of you.”\n“You’d have come straight on,” Cullen said, “you’d have seen us. And we killed a lot more than one.”\n“That’s good,” Hatch said, “and we want to hear your story and Nate’s soon as you get somethin’ to eat and drink. We might even let you have a swallow of whiskey. Course, Former House Nigger here will have to do the cookin’, ain’t none of us any good.”\n“That there’s fine,” I said, “but, my compadre here, he ain’t The Former House Nigger. He’s Private Cullen.”\nColonel Hatch eyeballed me. “You don’t say?”\n“Yes sir, I do, even if it hair lips the United States Army.”\n“Hell,” Hatch said. “That alone is reason to say it.”\nThere ain’t much to tell now. We said how things was, and they did some investigatin’, and damn if we wasn’t put in for medals. We didn’t never get them, ’cause they was slow about given coloreds awards, and frankly, I didn’t think we deserved them, not with us breakin’ and runnin’ the way we did, like a bunch of little girls tryin’ to get in out of the rain, leavin’ them men behind. But we didn’t stress that part when we was tellin’ our story. It would have fouled it some, and I don’t think we had much choice other than what we did. We was as brave as men could be without gettin’ ourselves foolishly killed.\nStill, we was put in for medals, and that was somethin’. In time, Cullen made the rank of Top Soldier. It wasn’t just me tellin’ him no more. It come true. He become a sergeant, and would have made a good one too, but he got roarin’ drunk and set fire to a dead pig and got his stripes taken and spent some time in the stockade. But that’s another story.\nI liked the cavalry right smart myself, and stayed on there until my time run out and I was supposed to sign up again, and would have too, had it not been for them Chinese women I told you about at the first. But again, that ain’t this story. This is the one happened to me in the year of 1870, out there on them hot West Texas plains. I will add a side note. The army let me keep Satan when I was mustered out, and I grew to like him, and he was the best horse I ever had, and me and him became friends of a sort, until 1872, when I had to shoot him and feed him to a dog and a woman I liked better.\nOriginally published in Warriors edited by George R. R. Martin and Gardner Dozois.\nProlific Texas writer Joe R. Lansdale has won the Edgar Award, the British Fantasy Award, the American Horror Award, the American Mystery Award, the International Crime Writer's Award, and six Bram Stoker Awards. Although perhaps best known for horror/thrillers such as The Nightrunners, Bubba Ho-Tep, The Bottoms, The God of the Razor, and The Drive-In, he also writes the popular Hap Collins and Leonard Pine mystery series--Savage Season, Mucho Mojo, The Two-Bear Mambo, Bad Chili, Rumble Tumble, Captains Outrageous, Devil's Road, and Hyenas--as well as Western novels such as Texas Night Rider and Blooddance, and totally unclassifiable cross-genre novels such as Zeppelins West, The Magic Wagon, and Flaming London. His other novels include Dead in The West, The Big Blow, Sunset and Sawdust, Acts of Love, Freezer Burn, Waltz of Shadows, The Drive-In 2: Not Just One of Them Sequels, Leather Maiden, Damaged by Choice, and Edge of Dark Water. He has also contributed novels to series such as Batman and Tarzan. His many short stories have been collected in By Bizarre Hands, Tight Little Stitches on a Dead Man's Back, The Shadows Kith and Kin, The Long Ones, Stories by Mama Lansdale's Youngest Boy, Bestsellers Guaranteed, On the Far Side of the Cadillac Desert with the Dead Folks, Electric Gumbo, Writer of the Purple Rage, Fist Full of Stories, Steppin' Out, Summer '68, Bumper Crop, The Good, the Bad and the Indifferent, Selected Stories by Joe R. Lansdale, For a Few Stories More, Mad Dog Summer: And Other Stories, The King and Other Stories, Deadman's Road, an omnibus, Flaming Zeppelins: The Adventures of Ned the Seal, Shadows West (with John L. Lansdale), Trapped in the Sunday Matinee and High Cotton: the Collected Stories of Joe R. Lansdale. As editor, he has produced the anthologies The Best of the West, Retro Pulp Tales, Son of Retro Pulp Tales, Razored Saddles (with Pat LoBrutto), Dark At Heart: All New Tales of Dark Suspense (with wife Karen Lansdale), The Horror Hall of Fame: The Stoker Winners, the Robert E. Howard tribute anthology, Cross Plains Universe (with Scott A. Cupp), Crucified Dreams, and The Urban Fantasy Anthology (edited with Peter S. Beagle). An anthology in tribute to Lansdale's work is Lords of the Razor. His most recent books are a new Hap and Leonard novel, Dead Aim, The Thicket, The Ape Man's Brother, and a big retrospective collection, Bleeding Shadows. He lives with his family in Nacogdoches, Texas.", "source": "https://clarkesworldmagazine.com/lansdale_02_18_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Soldierin' by Joe R. Lansdale"}