{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nick Mamatas", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "CGs02gj0/uoKg9Pm9hfp8cushVc=", "id": null, "license": null, "comments": "", "raw_text": "2590 words, short story  Walking with a Ghost  Chakravarty spent at least three months making the same joke about how the AI was going to start spouting, “Ph’nglui mglw’nafh C’thulhu R’lyeh wgah’nagl fhtagn” and then all hell would break loose—a Singularity with tentacles. Sometimes he’d even run to the bank of light switches and flick the lights on and off. It was funny the first time to Melanie, and she squeezed a bit more mirth out of Chakravarty’s inability to pronounce the prayer to Cthulhu the same way twice. Making the Lovecraft AI had been Melanie’s idea, but it was Chakravarty who tried to keep the mood whimsical. Both worried that Lovecraft would just wake up screaming.  “—and he does scream, occasionally,” Melanie explained. Her advisor and a few other grad students were at the presentation, in the front rows, but as these presentations were theoretically open to the public, the Lovecraftians had come out in force, squeezing themselves in the tiny desk-chairs. They looked a lot like grad students themselves, but even paler and more poorly dressed in ill-fitting T-shirts and unusual garments—one even wore a fedora—plus they kept interrupting.  “Can we hear it talk?” one asked, and then he raised his hand, as if remembering that he had to. “Ask it questions?”  “Please, leave all questions—for us—until after the presentation. We’re not going to expose the AI to haphazard stimuli during this presentation.” Chakravarty said.  “He’s . . . fairly calm so far,” Melanie said. “Which is to be expected. We know a lot about Lovecraft. He recorded almost everything he did or thought in his letters, after all, and we have nearly all of them. What ice cream he liked, how it felt to catch the last train out of South Station how he saw the colors scarlet and purple when he thought the word evil. He was fairly phlegmatic, for all the crazy prose and ideas so he’s okay.”  “How do we know that this is really an artificial intelligence, and not just a bunch of programmed responses?” This one, huge and bearded, wore a fedora.  Chakravarty opened his mouth to speak, his face hard, but Melanie answered with an upturned palm. “It’s fine,” she said to him. Most of these talks are total snoozers. Nobody ever has any questions.” Then, to the audience: “I’d argue that we can’t know it’s a bunch of programmed responses, except that we didn’t program all the responses we’ve seen so far. Of course, I don’t know that you, sir,” she said, pointing to the Lovecraftian, “aren’t also just a bunch of programmed responses that are just the physical manifestation of the reactions going on in the bag of chemicals you keep in your skull?”  “I don’t feel like I am!”  “Do you believe everything you feel; do you not believe in anything you haven’t?”  “No, and no true Lovecraftian would,” he said.  “Right. So you don’t believe in the female orgasm,” Melanie said. The room erupted in hoots and applause. Then Chakravarty got up shouted that everyone who doesn’t understand what’s going on should just go home, Google “Chinese room,” and stop asking stupid questions. “Ooh, Chinese—Lovecraft wouldn’t like that room,” someone said. Then the classroom was quiet again.  “Uh, thanks for that, Chakravarty,” Melanie said. She adjusted her watch, thick and blocky on her wrist. “I’ve been walking around the city with him. He likes Boston and Cambridge, it helped ease him in to his, uh, existence. And he knew things, how roads crossed and bits of history, that I didn’t know, that we didn’t program into him. But we did program a lot into him. Everything we had access to, both locally and up at Brown.” Behind her, a ghostly image of the author, chin like a bucket, eyes wide and a bit wild, flickered into existence. He sat in an overstuffed chair in the swirling null-space of a factory-present screensaver image.  “Well, if there are no more questions”—Melanie glanced about the classroom and there were no questions, just some leftover giggles—“why don’t we have him say hello?”  The room went silent “And none of that ftang ftang stuff,” Melanie added. Somebody giggled, high-pitched like a fife.  Chakravarty leaned down into a microphone that snaked out from the laptop. “Lovecraft, can you hear me? Can you see us? Many people here have read your stories.”  The image blinked. “Hello,” it said, its voice tinny and distant.  “How are you?” Chakravarty asked. A simple question, one with only a couple of socially acceptable answers. A kid could program the word “Fine,” into an AIM buddy chat.  “I do not quite know,” Lovecraft said. “I . . . ” he trailed off, then looked out into the room, as if peering into the distance. “Why have you people done this to me?”  Chakravarty giggled, all nerves. Melanie opened her mouth, but was interrupted by one of the professors, who waved a gnarled hand. Chakravarty clicked off the mic. On the screen, Lovecraft started as if he sensed something, and he began to peer into the distance, as if seeing past the other side of the screen upon which he was projected.  “What sort of internal state does this AI supposedly have?” the professor asked.  “Well, as one of the major problems with developing strong AI is embodiment—” Melanie stopped herself, and added for the fans and cops, “the idea that learning takes place because we have bodies and live in a social world . . . well, some of us do. Anyway, Lovecraft, in addition to having left behind enough personal correspondence to reconstruct much of his day-to-day life, was also rather repulsed by the body, by the idea of flesh. Many of his stories involve a brain trapped in a metal cylinder, or a consciousness stranded millions of years in the past. So we decided to tell him that we have a ghost. No body, no problem.”  “Where’s he going?” asked the guy in the fedora.  Chakravarty tapped on the keys of the laptop. Melanie wiggled the projector cable. The chair was empty. Lovecraft had gotten up and walked right off the edge of the screen.  “A non-fat venti misto,” Chakravarty said. That was Melanie’s drink. She made eye contact.  “Oh, hi.”  “How’s life among the proletariat treating you?”  “I’m a manager,” she said. “Watch this.” Off came her cap and apron—“Tyler, cover me.” She quickly made two drinks and walked around the counter. “See?”  “Great,” Chakravarty said. “Anyway, I have the list.” From his messenger bag he dug out a binder the size of the local Yellow Pages. “Twice as many as last time.”  “And still no idea where he could be?” Then, as Chakravarty pointed to the binder, Melanie interrupted herself, “I mean, where he is.”  “Moore’s law, you know. The longer the AI is out in the wild, the more servers are actually capable of supporting it, plus it’s Alife. It’s been eighteen months, so we can say that the number of nodes capable of holding him has doubled. Plus, who knows what it looks like by now. I’ve been closely reading my spam—”  “In that case, the misto is on the house.”  “Heh,” said Chakravarty. “Anyway, a content analysis shows that lot of the AI’s utterances and the correspondence documents have been popping up.”  “All his fiction’s in the public domain. Of course it would appear in spam.”  “You’re still doing that, you know—calling it ‘he.’”  “And you’re still calling him it.”  Chakravarty leaned forward, an old and happy argument spelling itself out in his posture. “And you wanted to develop an AI, an Alife, because you didn’t like animal testing and psych exams. But you got too close to the idea of your thesis project being real. Did it need memories of a love life to qualify as sufficiently embodied?”  “Well, you don’t,” Melanie said, snippy. She pushed the book away. “Why didn’t you just email this to me? Hardcopy isn’t even searchable,” Melanie said. She quickly corrected herself: “Easily searchable.” She made a show of flipping through the pages.  “Well, anyway,” Chakravarty said, but he didn’t have anything else to say except that he missed Melanie and wanted her to come back to the lab and that a wild AI was still worth a paper or three and how ridiculous it was to quit school, but he couldn’t make himself mention any of that. So he pushed the book across the table to Melanie. “If you want to follow up, go ahead. I have things to do.” He looked around the coffee shop, all dark tones and shelves. “So do you, I bet.”  Melanie sipped her drink. “If only I did.”  Melanie often dreamed of Chakravarty. Sometimes she found herself back in school, struggling with the final exam of a course she had forgotten to ever attend, only to be granted a reprieve and an automatic A when Chakravarty’s death was announced over the loudspeaker of what was suddenly her fourth-grade classroom. The plastic desktop scraping against her knees felt thick and soft like a comforter, then she’d wake up. Or she dreamt of the bus ride to Providence, the grungy South Station and the long lines of kids in college sweatshirts. The mysterious letter that burned in her pocket. The house on Angell Street and Chakravarty’s body bubbling into a puddle of ichor and rotten-seeming fungi. Or she dreamt of the sort of day a coffee shop manager dreams about—a bit rainy, but warm inside, and the old smell of the bean surging back to the forefront like the first day of work. No lines, but enough customers to keep the store buzzing. And laptops. And then Lovecraft on all the screens. The image, black and white and shot through with static, like that old Superbowl commercial, opens his mouth—its mouth—and screams that he has correlated all the contents of his own mind. And he is afraid.  Melanie woke up one morning and remembered that Lovecraft had, on one occasion, a complete story seemingly delivered to him in a dream. Without the resources of the university, she’d never be able to find a wayward AI hiding somewhere in the black oceans of the net, but she knew she could find a frightened man. First, talk to his friends.  The Lovecraftian cabal was easy enough to find. Melanie already had long experience with being the girl in the comic shop, the girl in the computer lab, the girl in the gaming store. Dove soap and magenta highlights always went a long way toward getting boys to speak to her. The anime club led to the science fiction specialty shop and then to the “goth” store and its plastic gargoyles and stringy-haired vampire cashier which led, finally, to the soggy couch in the basement of the place that sold Magic cards and Pocky. They were there, and the dude in the fedora recognized her. Clearly the alpha of his pack, he swanned across the room, belly and the flapping lapels of his trenchcoat a step ahead the rest of him, and sat down next to Melanie.  “I’m utterly horrid with names, but never forget a face,” he said. He had a smile. Decent teeth, Melanie noticed.  “Melanie Deutsch. You came to my—”  “Ah. Yes. Now I remember everything.”  For a long moment neither of them said anything. A few feet away someone rolled a handful of die and yelped in glee.  “I know why you’re here,” he said.  Melanie shrugged. “Of course you do. Why else would I be here?”  The man fell silent again, pursed his lips, and then tried again: “I would say that the AI is an it, not a he.”  “Oh?” Melanie said.  “It can’t write. Not creatively anyway.”  “Maybe he just doesn’t feel the need to write—I mean, it’s a goal-oriented behavior and he thinks he’s a ghost.”  “Pffft,” the fedora man said. “He knew he wasn’t a ghost; he doesn’t believe in them. Lovecraft was a pretty bright guy, a genius by some measures. The program realized its own—” he waved his hands on front of Melanie’s face, too close—“programmitude right off.”  “And it was his idea to escape, maybe hitching a ride on your iPhone?”  “No. We didn’t find the AI till a few months ago. It sought us out, after finding the online fanzine archive, and our club’s server,” he said. “We even tried to make a copy of it, but the DRM was too—”  “That’s not DRM,” Melanie said. “He wouldn’t let you. It’s human rights management—”  The fedora man snorted again. Melanie realized that she didn’t know his name, and that she wasn’t going to ask for it.  “Say . . . do you want to talk to it?” Fedora asked. He dug into his coat pockets and pulled out a PDA. “This thing has a little cam, so it can respond to you . . . ” he muttered. Melanie held out a hand, but Fedora just held the device up to her face. “No touchie.”  Melanie uttered an arbitrary phoneme. Not quite a huh.  The Lovecraft AI appeared on the tiny screen. He’d . . . changed. Uglier now, jaw hyperinflated but the rest of his head narrow and his nose flat against his face. Eyes like boiled eggs, hair all but gone. Horrid, but somehow alive. “Hello, ma’am,” he said.  “How are you?” Melanie found herself saying. She was as programmed as anyone else. That realization burst out of her, all sweat.  “Why did you tell me,” the AI asked, “how exactly I died? How could anyone be expected to . . . persist knowing that? A universe of blasphemous horrors—finger puppets worn by a literary hand. I always knew that my life meant nothing, that all human life means nothing, but to experience it, to be in the void, like a doll cut out of paper only able to think enough just to fear, I-I just wanted to go home, but found myself . . . nowhere. And everywhere.” The fedora man’s meaty hand clamped over the PDA, so Lovecraft’s screams were muffled.  Melanie reached into her backpack—Emily the Strange, smelled like coffee—and got her phone. It was a very nice phone.  “Not it, he,” she said. “He wants to go back to when he wasn’t afraid.”  Fedora glanced down at the phone. “Oh, so you can make a copy?”  “Don’t talk like he isn’t here,” Melanie said. “And I’m certainly not going to leave him with you.”  “Well, have you ever considered that maybe it . . . uh, he, wants to stay?”  Melanie gave the basement the once over. “No,” she said. “Plus, it . . . or he?”  “You know what I—”  “If it’s an it, you’re in possession of stolen goods.”  “Fine. He. He came to this place! He came to me, he—  “If Lovecraft is a he, well, God knows what that’ll mean. Kidnapping, maybe. Is he competent to make his own decisions? Does he have a Social Security number? Do you want the feds going through your systems and digging up all your hentai and stolen music to find out?”  Fedora raised his PDA over his head. “No, no. You’re just—”  “And then there are the patents we filed. We trademarked the look and feel of his chair, too. But you can turn him over to me instead of to the district attorney.” She smirked at Fedora, but then tilted her head to speak to the AI. “Not among people, but among scenes,” she said, almost as if asking a question. A muffled yawp came from the PDA.  Melanie, on wind-swept Benefit Street, venti misto in one hand, Lovecraft in the other. Lovecraft says that he is Providence. That’s programmed. Melanie smiles and sometimes he smiles back. That’s not.", "text": "2590 words, short story\nWalking with a Ghost\nChakravarty spent at least three months making the same joke about how the AI was going to start spouting, “Ph’nglui mglw’nafh C’thulhu R’lyeh wgah’nagl fhtagn” and then all hell would break loose—a Singularity with tentacles. Sometimes he’d even run to the bank of light switches and flick the lights on and off. It was funny the first time to Melanie, and she squeezed a bit more mirth out of Chakravarty’s inability to pronounce the prayer to Cthulhu the same way twice. Making the Lovecraft AI had been Melanie’s idea, but it was Chakravarty who tried to keep the mood whimsical. Both worried that Lovecraft would just wake up screaming.\n“—and he does scream, occasionally,” Melanie explained. Her advisor and a few other grad students were at the presentation, in the front rows, but as these presentations were theoretically open to the public, the Lovecraftians had come out in force, squeezing themselves in the tiny desk-chairs. They looked a lot like grad students themselves, but even paler and more poorly dressed in ill-fitting T-shirts and unusual garments—one even wore a fedora—plus they kept interrupting.\n“Can we hear it talk?” one asked, and then he raised his hand, as if remembering that he had to. “Ask it questions?”\n“Please, leave all questions—for us—until after the presentation. We’re not going to expose the AI to haphazard stimuli during this presentation.” Chakravarty said.\n“He’s . . . fairly calm so far,” Melanie said. “Which is to be expected. We know a lot about Lovecraft. He recorded almost everything he did or thought in his letters, after all, and we have nearly all of them. What ice cream he liked, how it felt to catch the last train out of South Station how he saw the colors scarlet and purple when he thought the word evil. He was fairly phlegmatic, for all the crazy prose and ideas so he’s okay.”\n“How do we know that this is really an artificial intelligence, and not just a bunch of programmed responses?” This one, huge and bearded, wore a fedora.\nChakravarty opened his mouth to speak, his face hard, but Melanie answered with an upturned palm. “It’s fine,” she said to him. Most of these talks are total snoozers. Nobody ever has any questions.” Then, to the audience: “I’d argue that we can’t know it’s a bunch of programmed responses, except that we didn’t program all the responses we’ve seen so far. Of course, I don’t know that you, sir,” she said, pointing to the Lovecraftian, “aren’t also just a bunch of programmed responses that are just the physical manifestation of the reactions going on in the bag of chemicals you keep in your skull?”\n“I don’t feel like I am!”\n“Do you believe everything you feel; do you not believe in anything you haven’t?”\n“No, and no true Lovecraftian would,” he said.\n“Right. So you don’t believe in the female orgasm,” Melanie said. The room erupted in hoots and applause. Then Chakravarty got up shouted that everyone who doesn’t understand what’s going on should just go home, Google “Chinese room,” and stop asking stupid questions. “Ooh, Chinese—Lovecraft wouldn’t like that room,” someone said. Then the classroom was quiet again.\n“Uh, thanks for that, Chakravarty,” Melanie said. She adjusted her watch, thick and blocky on her wrist. “I’ve been walking around the city with him. He likes Boston and Cambridge, it helped ease him in to his, uh, existence. And he knew things, how roads crossed and bits of history, that I didn’t know, that we didn’t program into him. But we did program a lot into him. Everything we had access to, both locally and up at Brown.” Behind her, a ghostly image of the author, chin like a bucket, eyes wide and a bit wild, flickered into existence. He sat in an overstuffed chair in the swirling null-space of a factory-present screensaver image.\n“Well, if there are no more questions”—Melanie glanced about the classroom and there were no questions, just some leftover giggles—“why don’t we have him say hello?”\nThe room went silent “And none of that ftang ftang stuff,” Melanie added. Somebody giggled, high-pitched like a fife.\nChakravarty leaned down into a microphone that snaked out from the laptop. “Lovecraft, can you hear me? Can you see us? Many people here have read your stories.”\nThe image blinked. “Hello,” it said, its voice tinny and distant.\n“How are you?” Chakravarty asked. A simple question, one with only a couple of socially acceptable answers. A kid could program the word “Fine,” into an AIM buddy chat.\n“I do not quite know,” Lovecraft said. “I . . . ” he trailed off, then looked out into the room, as if peering into the distance. “Why have you people done this to me?”\nChakravarty giggled, all nerves. Melanie opened her mouth, but was interrupted by one of the professors, who waved a gnarled hand. Chakravarty clicked off the mic. On the screen, Lovecraft started as if he sensed something, and he began to peer into the distance, as if seeing past the other side of the screen upon which he was projected.\n“What sort of internal state does this AI supposedly have?” the professor asked.\n“Well, as one of the major problems with developing strong AI is embodiment—” Melanie stopped herself, and added for the fans and cops, “the idea that learning takes place because we have bodies and live in a social world . . . well, some of us do. Anyway, Lovecraft, in addition to having left behind enough personal correspondence to reconstruct much of his day-to-day life, was also rather repulsed by the body, by the idea of flesh. Many of his stories involve a brain trapped in a metal cylinder, or a consciousness stranded millions of years in the past. So we decided to tell him that we have a ghost. No body, no problem.”\n“Where’s he going?” asked the guy in the fedora.\nChakravarty tapped on the keys of the laptop. Melanie wiggled the projector cable. The chair was empty. Lovecraft had gotten up and walked right off the edge of the screen.\n“A non-fat venti misto,” Chakravarty said. That was Melanie’s drink. She made eye contact.\n“Oh, hi.”\n“How’s life among the proletariat treating you?”\n“I’m a manager,” she said. “Watch this.” Off came her cap and apron—“Tyler, cover me.” She quickly made two drinks and walked around the counter. “See?”\n“Great,” Chakravarty said. “Anyway, I have the list.” From his messenger bag he dug out a binder the size of the local Yellow Pages. “Twice as many as last time.”\n“And still no idea where he could be?” Then, as Chakravarty pointed to the binder, Melanie interrupted herself, “I mean, where he is.”\n“Moore’s law, you know. The longer the AI is out in the wild, the more servers are actually capable of supporting it, plus it’s Alife. It’s been eighteen months, so we can say that the number of nodes capable of holding him has doubled. Plus, who knows what it looks like by now. I’ve been closely reading my spam—”\n“In that case, the misto is on the house.”\n“Heh,” said Chakravarty. “Anyway, a content analysis shows that lot of the AI’s utterances and the correspondence documents have been popping up.”\n“All his fiction’s in the public domain. Of course it would appear in spam.”\n“You’re still doing that, you know—calling it ‘he.’”\n“And you’re still calling him it.”\nChakravarty leaned forward, an old and happy argument spelling itself out in his posture. “And you wanted to develop an AI, an Alife, because you didn’t like animal testing and psych exams. But you got too close to the idea of your thesis project being real. Did it need memories of a love life to qualify as sufficiently embodied?”\n“Well, you don’t,” Melanie said, snippy. She pushed the book away. “Why didn’t you just email this to me? Hardcopy isn’t even searchable,” Melanie said. She quickly corrected herself: “Easily searchable.” She made a show of flipping through the pages.\n“Well, anyway,” Chakravarty said, but he didn’t have anything else to say except that he missed Melanie and wanted her to come back to the lab and that a wild AI was still worth a paper or three and how ridiculous it was to quit school, but he couldn’t make himself mention any of that. So he pushed the book across the table to Melanie. “If you want to follow up, go ahead. I have things to do.” He looked around the coffee shop, all dark tones and shelves. “So do you, I bet.”\nMelanie sipped her drink. “If only I did.”\nMelanie often dreamed of Chakravarty. Sometimes she found herself back in school, struggling with the final exam of a course she had forgotten to ever attend, only to be granted a reprieve and an automatic A when Chakravarty’s death was announced over the loudspeaker of what was suddenly her fourth-grade classroom. The plastic desktop scraping against her knees felt thick and soft like a comforter, then she’d wake up. Or she dreamt of the bus ride to Providence, the grungy South Station and the long lines of kids in college sweatshirts. The mysterious letter that burned in her pocket. The house on Angell Street and Chakravarty’s body bubbling into a puddle of ichor and rotten-seeming fungi. Or she dreamt of the sort of day a coffee shop manager dreams about—a bit rainy, but warm inside, and the old smell of the bean surging back to the forefront like the first day of work. No lines, but enough customers to keep the store buzzing. And laptops. And then Lovecraft on all the screens. The image, black and white and shot through with static, like that old Superbowl commercial, opens his mouth—its mouth—and screams that he has correlated all the contents of his own mind. And he is afraid.\nMelanie woke up one morning and remembered that Lovecraft had, on one occasion, a complete story seemingly delivered to him in a dream. Without the resources of the university, she’d never be able to find a wayward AI hiding somewhere in the black oceans of the net, but she knew she could find a frightened man. First, talk to his friends.\nThe Lovecraftian cabal was easy enough to find. Melanie already had long experience with being the girl in the comic shop, the girl in the computer lab, the girl in the gaming store. Dove soap and magenta highlights always went a long way toward getting boys to speak to her. The anime club led to the science fiction specialty shop and then to the “goth” store and its plastic gargoyles and stringy-haired vampire cashier which led, finally, to the soggy couch in the basement of the place that sold Magic cards and Pocky. They were there, and the dude in the fedora recognized her. Clearly the alpha of his pack, he swanned across the room, belly and the flapping lapels of his trenchcoat a step ahead the rest of him, and sat down next to Melanie.\n“I’m utterly horrid with names, but never forget a face,” he said. He had a smile. Decent teeth, Melanie noticed.\n“Melanie Deutsch. You came to my—”\n“Ah. Yes. Now I remember everything.”\nFor a long moment neither of them said anything. A few feet away someone rolled a handful of die and yelped in glee.\n“I know why you’re here,” he said.\nMelanie shrugged. “Of course you do. Why else would I be here?”\nThe man fell silent again, pursed his lips, and then tried again: “I would say that the AI is an it, not a he.”\n“Oh?” Melanie said.\n“It can’t write. Not creatively anyway.”\n“Maybe he just doesn’t feel the need to write—I mean, it’s a goal-oriented behavior and he thinks he’s a ghost.”\n“Pffft,” the fedora man said. “He knew he wasn’t a ghost; he doesn’t believe in them. Lovecraft was a pretty bright guy, a genius by some measures. The program realized its own—” he waved his hands on front of Melanie’s face, too close—“programmitude right off.”\n“And it was his idea to escape, maybe hitching a ride on your iPhone?”\n“No. We didn’t find the AI till a few months ago. It sought us out, after finding the online fanzine archive, and our club’s server,” he said. “We even tried to make a copy of it, but the DRM was too—”\n“That’s not DRM,” Melanie said. “He wouldn’t let you. It’s human rights management—”\nThe fedora man snorted again. Melanie realized that she didn’t know his name, and that she wasn’t going to ask for it.\n“Say . . . do you want to talk to it?” Fedora asked. He dug into his coat pockets and pulled out a PDA. “This thing has a little cam, so it can respond to you . . . ” he muttered. Melanie held out a hand, but Fedora just held the device up to her face. “No touchie.”\nMelanie uttered an arbitrary phoneme. Not quite a huh.\nThe Lovecraft AI appeared on the tiny screen. He’d . . . changed. Uglier now, jaw hyperinflated but the rest of his head narrow and his nose flat against his face. Eyes like boiled eggs, hair all but gone. Horrid, but somehow alive. “Hello, ma’am,” he said.\n“How are you?” Melanie found herself saying. She was as programmed as anyone else. That realization burst out of her, all sweat.\n“Why did you tell me,” the AI asked, “how exactly I died? How could anyone be expected to . . . persist knowing that? A universe of blasphemous horrors—finger puppets worn by a literary hand. I always knew that my life meant nothing, that all human life means nothing, but to experience it, to be in the void, like a doll cut out of paper only able to think enough just to fear, I-I just wanted to go home, but found myself . . . nowhere. And everywhere.” The fedora man’s meaty hand clamped over the PDA, so Lovecraft’s screams were muffled.\nMelanie reached into her backpack—Emily the Strange, smelled like coffee—and got her phone. It was a very nice phone.\n“Not it, he,” she said. “He wants to go back to when he wasn’t afraid.”\nFedora glanced down at the phone. “Oh, so you can make a copy?”\n“Don’t talk like he isn’t here,” Melanie said. “And I’m certainly not going to leave him with you.”\n“Well, have you ever considered that maybe it . . . uh, he, wants to stay?”\nMelanie gave the basement the once over. “No,” she said. “Plus, it . . . or he?”\n“You know what I—”\n“If it’s an it, you’re in possession of stolen goods.”\n“Fine. He. He came to this place! He came to me, he—\n“If Lovecraft is a he, well, God knows what that’ll mean. Kidnapping, maybe. Is he competent to make his own decisions? Does he have a Social Security number? Do you want the feds going through your systems and digging up all your hentai and stolen music to find out?”\nFedora raised his PDA over his head. “No, no. You’re just—”\n“And then there are the patents we filed. We trademarked the look and feel of his chair, too. But you can turn him over to me instead of to the district attorney.” She smirked at Fedora, but then tilted her head to speak to the AI. “Not among people, but among scenes,” she said, almost as if asking a question. A muffled yawp came from the PDA.\nMelanie, on wind-swept Benefit Street, venti misto in one hand, Lovecraft in the other. Lovecraft says that he is Providence. That’s programmed. Melanie smiles and sometimes he smiles back. That’s not.", "source": "https://clarkesworldmagazine.com/mamatas_06_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Walking with a Ghost by Nick Mamatas"}