{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Pat Cadigan", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "v1uzpM10tOPZ6OKJtBdpV+iYGdQ=", "id": null, "license": null, "comments": "", "raw_text": "8060 words, novelette, REPRINT  Cody  “Common wisdom has it,” said LaDene from where she was stretched out on the queen-sized bed, “that anyone with a tattoo on their face goes crazy within five years.”  Cody paused in his examination of his jawline in the mirror over the desk to give her a look. “You see any tattoos on this example of manly beauty?”  “Can’t see the moon from here, either. Or the TV remote,” she added she sat up and looked around. Cody found it on the desk and tossed it to her. “Thanks. You know, carnies would call you a marked man.”  “Carnies?” He gave a short laugh. “Don’t tell me you threw over the bright lights of the midway to keep a low profile in budget accommodations.”  “Higher-end budget accommodations.” She put on the TV and began channel-surfing. “For the discerning yet financially savvy business traveler. Don’t you ever read the brochures?”  He made a polite noise that was could have been yes or no and was neither. The hotspot that had come up over two hours ago was still there, midway between his chin and the point of his jaw, and as far as he could tell, it hadn’t faded even a little. The medic had assured him there was nothing to worry about unless it started to spread and it hadn’t. It wouldn’t have bothered him except he hadn’t had a hotspot in years. Rookies got hotspots.  The sudden recurrence could have been down to any number of things, the medic had said, the mostly likely being the attack of hayfever he had suffered on arrival. But he’d never had hayfever in his life, he’d told the medic. He’d never been to Kansas City in late August, she’d replied, chuckling.  Technically, he still hadn’t. The airport was thirty miles north of the city and the car they’d sent had taken him to an industrial park about as far to the west on the Kansas side of the state line, which apparently ran right through the middle of town. The most he’d seen of Kansas City proper was a distant cluster of skyscrapers, briefly glimpsed through the tinted window as the driver negotiated a complicated interchange of highway ramps. After that it was generic highway scenery all the way to a generic suburban industrial park, full of angular, antiseptic office buildings surrounded by patches of green landscaped and manicured in extremis, some with a koi pond or a fountain. The access road meandered through it so much that Cody thought there had to be an extra mile of travel. Albeit a very pretty mile; perhaps it was so people coming and going could see at least in passing the flowers they didn’t have time to stop and smell. Cody could have done without it. By the time they’d reached their destination, he had actually begun to feel carsick.  “Yo!” A pillow hit him in the head, making him jump. “And I thought I was vain,” LaDene laughed. “Are you really that fascinating?”  “I was woolgathering,” he said as he threw the pillow back at her. “Thinking, in case you don’t know what that means.”  “I know what it means,” she said. “I also know you’ve got a hotspot. Unclench, honey, I’ve got one, too.” She lifted her shirt and pointed at her navel.  “Oh, very funny.”  “Oh, very for-real.” She was up off the bed and had his face in her hands before he could say anything. “Ah, got it, right there.” She patted his cheek and pulled up her shirt again, exposing her midriff. “Mine’s hotter. Feel.”  Her bellybutton was only inches away from his nose. Cody drew back and started to protest as she grabbed his hand and pressed it against her skin. His discomfort turned to surprise. “I sit corrected,” he said, extricating himself from her grip. “Yours is hotter.”  “Told you,” she said, plumping down on the bed to stretch out again. “It’s probably the ragweed and who knows what else in the air. Man, I hate KC this time of year.”  “You’ve been here before?”  “I’m from here.” She laughed at his surprised expression. “You couldn’t tell?”  “How could I? We just met.”  “I knew you weren’t from around here, soon as I saw you. No antihistamines.”  He chuckled a bit ruefully. “I thought I was dying of a head cold I caught on the plane.”  She started to channel-surf again, then changed her mind and shut the TV off. “If you get cold symptoms a lot when you fly, it’s probably an allergy.”  “Oh?” He gave a short skeptical laugh. “Is there a lot of ragweed on airplanes?”  She shrugged. “Lots of other stuff—mold, dust, newsprint. Somebody’s cheap cologne. Even expensive cologne.”  “Newsprint?”  “Believe it or leave it. You know how if something exists, there’s porn of it? Well, there’s also someone allergic to it.”  “Newsprint,” Cody said again, still skeptical.  “If I’m lyin’, I’m dyin’.” LaDene raised one hand solemnly, then let it fall. “Okay, that was fun. Now whaddaya wanna do?”  Cody leaned over and scooped the remote control up so he could turn the TV back on, mainly to forestall the possibility of her wanting to compare hotspots again. The screen lit up to show a dark-haired, olive-skinned woman speaking directly to the camera with an earnest sincerity that made his own brow furrow in sympathy.  “ . . . found flayed and burned in a midtown Kansas City, Missouri parking garage have now positively been identified as August Fiore, AKA Little Augie Flowers, fifty-one, and Coral Oh, twenty-nine, of Liberty, Missouri. Fiore went missing two weeks ago from an FBI safe house where he was being held pending the start of the trial of Carmine Nesparini on racketeering charges. The FBI has steadfastly refused to comment on allegations that Fiore was Nesparini’s personal ‘master key’ but sources close to the investigation say that Fiore’s cooperation would have given authorities an unprecedented level of access to mob records.  “Fiore’s attorneys refused to comment, except to say that they were unaware of any escape plans and had no knowledge of Fiore’s whereabouts. Whether Fiore left the safe house voluntarily may never be known. FBI technicians are still working on the sabotaged surveillance system but experts believe there is little chance they can salvage enough data to be useful.  “Coral Oh’s connection to Fiore still has not been established. Oh worked for the Kansas City Convention Bureau for fifteen years as an event coordinator, for the last three in a supervisory position. Co-workers described her as intelligent and well liked. She was last seen ten days ago in her office by two of her subordinates, who had been working late with her.”  The woman was suddenly replaced by a video of a very young man who looked as if he hadn’t slept for at least that long. The slightly wobbly graphic at the bottom of the screen said he was Akule Velasquez.”She told us to go home, she’d finish up,” he said in a husky voice to someone just off-camera to the left. “We’d’ve stayed but she was all—” he made small shooing gestures with both hands. “‘No, get outa here, I’ll finish, bring me some fancy coffee tomorrow.’ She was like that. I tried to stay anyway but she kept telling me no. I wish I hadn’t listened.”  The woman in the studio reappeared, looking more earnest and sincere than ever. “The mayor’s office issued a statement saying that this unfortunate and tragic incident should not overshadow the fact that criminal activity in the area has been steadily declining for the past twelve months thanks to new policing initiatives—”  LaDene snatched the remote out of his hand and turned off the TV. “Well, that wasn’t fun. Now what do you wanna do?”  “Hey, I was watching that.” Cody reached for the remote but she threw it across the room where it bounced off the wall and fell neatly into a small waste basket.  “She shoots, she scores! A three-pointer, the crowd goes wild!” LaDene made crowd noises as he stalked over to retrieve the control. The impact had knocked the batteries out and it took him two tries to put them back in properly. “Oh, come on. What do you wanna scare the shit out of yourself for?”  But the news had moved on; now a man was standing near the edge of an empty swimming pool, blinking in bright sunlight as he talked about levels of chlorine. “Oh, well.” Cody dropped the remote on the bed and sat down on the chair by desk again. “I wasn’t trying to scare myself.”  “Who were you trying to scare—me?”  “No. I just want to pay attention.”  “Set a news alert on your phone.” She was channel-surfing again. “It’s probably all bullshit anyway. ‘Little Augie Flowers,’ for God’s sake. Who goes around calling themselves ‘Little Augie Flowers’? For a minute there, I thought they were talking about some old Grand Theft Auto module. ‘Gay Tony Meets Little Augie Flowers, bullets will fly, heads will roll!’ Oh, hey, I love this!” she added, sitting up suddenly.  Cody barely had to look at the screen to know what it was. “I’ve seen it.” He rested an elbow on the desk and cupped his face in his hand. The hotspot was still there. “Several times.”  “So have I but I like to watch it whenever it’s on. That guy’s so cool.”  “He is?” If he didn’t leave the goddam hotspot alone, he told himself, it was never going to fade. He shifted so he was leaning the upper part of his cheek against his hand; as if it had a will of its own, his thumb slid down to feel his jawline. Annoyed with himself, he straightened up, grabbed the TV listings off the desk and paged through them without seeing anything.  “Okay, he’s all wrong and he probably knew it,” LaDene was saying. She punched the pillows behind her into a more supportive position for her lower back and casually folded her legs into a half-lotus, making Cody wince. “But so what? The whole movie’s wrong.”  “Well, it’s a pretty old movie,” he said, shrugging.  “Not that old. Not ancient.”  “No, but BCI didn’t even exist when this came out and people were still using floppy disks. This big.” He held his hands three feet apart. She gave him a look and he moved them so they were only a foot apart. “Okay, this big. TVs were dumb terminals and a cloud was a fluffy white thing in the sky. So the idea of people giving up memories to store data in their brains—”  LaDene waved one hand dismissively. “I was referring to the cell phones.”  He frowned. “What cell phones?”  “Exactly!” She laughed. “How the hell did they miss cell phones?”  As if on cue, there was a sound like a ray-gun in a scifi movie and the ring on her right hand lit up with tiny flashing lights. She cocked her head, listening, then bounced off the bed. “My ride’s here. See you around—” Her grin was sheepish.  “Cody,” he said.  “Right.” She paused, one eyebrow raised, the other down low, something Cody had never been able to manage no matter how hard he’d tried. “That’s really your name.”  “LaDene’s really yours?” he said evenly.  “I grew up in Tonganoxie, Kansas. Of course it’s really my name.”  The two statements seemed unrelated to him but he nodded anyway. She pulled her suitcase out of the closet, extended the handle and then paused again, one hand on the doorknob. “Where are you from?”  “I used to know but I rented that out for a database back-up.”  He heard her laughing all the way down the hall.  He ate alone in the dining room. The waitress gave him a table by a window that made the most of the hotel’s location atop a rocky promontory, so he could enjoy his chicken Caesar salad with a scenic view of three other hotels and the six-lane highway running between them.  While it may not have been classic postcard material, he had to admit the view was actually rather nice. Kansas wasn’t as flat as most people seemed to think, at least not in this locale. Here the landscape was gently rolling, punctuated by flat stretches usually occupied by malls or apartment complexes. In the distance, he could see the top of a mall that had to be the size of an airplane hangar and, not far from that, a crane surrounded by a framework suggesting future apartments or condos.  But it was the highway that drew his eye more than anything. He couldn’t remember the last time he had seen so many private cars. Well, the travel agent had told him this was one of the last bastions of the autonomous commuter. Cody couldn’t imagine what it was like to spend an hour or more of every weekday driving. He’d had a license himself once, but only briefly. After it had expired, he hadn’t bothered renewing it and didn’t miss it.  Perhaps if he were driving now, he’d be too busy to keep worrying at that stupid hotspot. Annoyed with himself, he pulled the complimentary library up on the table-top and checked out the local newspaper.  The waitress tried to talk him into dessert every time she refilled his iced tea. After his third glass, he swiped his keycard through the table-top reader, left an overly generous cash tip, and went back up to the room. It seemed a lot emptier now that LaDene was gone. Even the pillows she had piled against the headboard looked forlorn. He hadn’t been thrilled to find her there when he’d checked in. She had apologized profusely—some kind of travel-plan fiasco. Having been through a few of those himself, he was sympathetic. As it turned out, she’d been good company—better than he’d realized. His newly-recovered privacy felt lonely.  He stretched out in the place where she had been and put the TV on again. It was only one night, and as LaDene had pointed out, this was a higher-end budget hotel. The complimentary coffee service was a drip pot with pouches of a gourmet blend rather than merely a kettle and two envelopes of instant. The minibar was well stocked with a wide variety of refreshments and if all of it cost ten times what it would in a grocery store, at least the cans of mixed nuts were a bit larger than average.  And then there was the television. Twenty channels including sports and movies, not counting the on-demand you had to pay extra for. Most places didn’t offer half that. Maybe it was their way of compensating people like him, who were stuck there without a car.  Although that wasn’t quite true. A chat with the desk clerk had revealed that they were less than a mile away from what she referred to as a shopping village, which he quickly figured out was a clever euphemism for strip mall. It wasn’t much, she’d said in a politely cautioning tone meant to discourage any ideas of a foray on foot—a discount electronics outlet, a hardware store, an indoor playground, and three fast-food joints. Cody decided he could live without seeing it.  “Good choice,” the clerk had said approvingly. “Because you’d be taking your life in your hands—no sidewalks.”  “No sidewalks where?” he’d asked, puzzled.  “Between here and the shopping village.”  “Then where do people walk?”  “They don’t. People have to drive to get out here. They park, do whatever they came to do, then drive home again. I mean, you don’t walk on the interstate, either.”  Cody had been tempted to ask if she ever went for walks herself and if so, where, but decided against it. She was twenty-two at most, about to go from merely young and pretty to eye-catching as the last of her adolescent puppy-fat disappeared. She might have thought he was hitting on her and if he were honest, he might have had a hard time denying it.  He found a 24-hour news channel, turned the volume down to a murmur, and then used the remote to shut off the lights.  The next thing he knew, someone was sitting on his chest.  He could see nothing in the dark except a darker shadow looming over him, blocking out the flickering light from the television. He tried to yell but his mouth refused to open and he only made a sort of high-pitched grunt. Something pressed hard against his windpipe as whoever had him pinned bent over to speak close to his ear.  “You want to lie very still and not make a sound,” said a male voice, just above a whisper. “Then do exactly what I tell you. I don’t want to hurt you. I’m not here to hurt you. But I will if I have to.”  His heart was beating hard and fast, as if it were trying to pound its way out of his chest. The pressure on his windpipe eased but didn’t go away entirely. He swallowed, wincing.  As the man straightened up, Cody made out long graying hair, possibly tied back, and thick-framed glasses. “First, don’t try to open your mouth. You’re short-circuited and you’ll only give yourself a headache. Once I know you’re gonna behave yourself, I’ll consider letting you chew gum.”  He tried to make a conciliatory noise; the pressure on his windpipe increased again.  “I said, don’t make a sound.”  Cody sucked air through his nose, feeling himself jerk helplessly as his body fought to cough even though his mouth wouldn’t open. His throat clenched, knotted, and tried to turn itself inside out. Then all at once, his mouth did open, just long enough for him to let out a few explosive coughs before his jaw snapped shut again.  “Better?”  Cody nodded, breathing in hungrily through his nose.  “You understand now to do exactly what I say?”  He nodded again.  “After I let you up, you’re gonna change your clothes. Then you’ll be taken out of here in a wheelchair. You’re gonna sit quiet and stare at your lap. You’re not gonna look up. If anyone speaks to you, you’ll act like you didn’t hear anything. There’s a van waiting out front. You’ll be put into it, chair and all, and we’ll drive away.  “Now, it’s important you remember everything I just said and do exactly that because an associate of mine is having a chat with the night clerk. Nice older man, a grandfather, in fact. If, while we pass through the lobby, he should get the idea that you need help, my associate will hurt him, badly. Unlike me, my associate doesn’t mind hurting anyone. You don’t want to harm innocent bystanders, do you.”  Cody shook his head from side to side.  “Very good. Now, when I let you up, you’re going to strip naked and put on what I’ve brought for you.”  The man climbed off him and stood back. Cody moved more slowly as he slid over to the edge of the bed and began to unbutton his shirt with shaky fingers.  “A little faster, please,” the man said, staring at the television with his arms folded. Cody wanted to comply but he was so unsteady he was off-balance even sitting down. He shoved his trousers down, extricating his ankles one at a time, socks and all. Next to him was a small neat pile of clothing folded into squares. Trembling, he picked up the top item; it was a hospital gown.  “Ties in back,” the man said, casually matter of fact, as if he were remarking on the weather. He never looked away from the television.  Cody couldn’t have tied his shoelaces. He decided it didn’t matter; the second item was a bathrobe. He put it on sitting down, then pushed himself carefully to his feet.  The man turned from the television to give him an up-and-down. “I told you to strip naked. Lose the tidy-whiteys.”  Cody fell over on the bed in the rush to gets his shorts off. The man waited with a put-upon air till he was done, then took hold of his upper arm and pulled him up. Cody winced; his grip was unnaturally strong, well out of proportion for a slight, older man almost a head shorter than he was.  The man waiting in the hallway with the wheelchair was a lot taller and huskier, dressed in a dark blue coverall; there was a patch on his left breast pocket showing a picture of a first-aid kit and the words County EMS. He said nothing as Cody stumbled over the foot-rests and fell into the seat. The frame was lightweight and all the wheels were small. The gray-haired man bent over him and Cody saw he was wearing the same uniform.  “You remember what I told you,” he said and Cody noticed how little his rather pasty face moved, as if he’d Botoxed it into submission. And out here, up close and personal in much brighter light, the gray hair looked like a wig, ponytail and all. “Think of that poor man’s family. Whether he goes home when his shift is over is all down to you.” He stared into Cody’s eyes as if he expected to see some response there, then chuckled and patted his cheek. “And seriously, relax your jaw. I’m not kidding about the headache.” Cody started to rub the side of his face but the man caught his hand and put it firmly in his lap. “You don’t move till we’re out of here. Can you manage that or should I help you?”  Cody bowed his head.  “By George, I think he’s got it.”  Despite the carpeting, the ride was bumpy—the chair had a wobbly wheel, like every supermarket shopping cart Cody had ever used. But he stared fixedly at the slightly threadbare material covering his knees as they went down in the elevator. When they reached the lobby, he bowed his head a little more and squeezed his eyes shut, afraid they’d kill the desk clerk anyway. Having seen their faces, he’d be able to give a description to the police, which didn’t bode well for his survival.  Or for his own.  The thought was a cold electric shock running down his back as the automatic doors hummed open in front of him. He heard the desk clerk tell someone to have a good night and a woman responded I surely will, you too! in a cheerful, friendly tone.  Then he was outside, rattling toward a white van with the same County EMS painted on the open side door. A tall woman waited beside a wheelchair lift.  Cody had no idea how long they had been on the road before the gray-haired man reached over and touched something to a spot under his cheekbone near the hinge of his jaw. He was in the middle of a huge yawn almost before it registered on him that he could open his mouth again. The muscles on either side of his face felt overworked and sore, including some he had never actually known were there. He worked his jaw for a while, knowing the gray-haired man was watching him and trying not to care.  He was sitting in a fold-down seat on Cody’s right, facing backwards. The husky guy had anchored the wheelchair against a padded backstop and strapped him in before taking the seat on his left. The tall woman was up front, next to the driver. The woman who had been talking to the night clerk was behind him, along with at least one other person he had neither seen nor heard and who apparently wanted to keep it that way. Unbidden, the idea came to him that it was LaDene; he put it quickly out of his mind. Paranoia wasn’t going to help.  Cody rested his head against the backstop and closed his eyes, wondering if he actually could go to sleep. Under the circumstances, there wasn’t anything else he could do. But his mind was as alert as if he were in the middle of a busy day, which he supposed he was. Pretending to be asleep was a waste of time, thanks to the hospital gown; he figured they’d souped it up to where it could practically read his mood.  He opened his eyes and saw the gray-haired man watching him. Almost reflexively, he was overwhelmed by another huge yawn.  “You know the situation,” the gray-haired man said, when his yawn had passed.  Cody nodded. “And you know I don’t know anything.”  “You don’t have to,” the man said.  “I’m a courier,” Cody added. “Even if I wanted to, I couldn’t access anything—”  “We know,” the other man said, sounding short.  “—I have no knowledge of the quantity or nature of any data—”  “Yes, we’re aware—”  “—nor am I responsible if any attempts at access cause damage, in whole or in part, to that data or any hardware or software—”  “We already know that—” He was openly impatient now.  “—my safe return cannot not indemnify any party against criminal charges of kidnapping and false imprisonment,” Cody went on, trying not to enjoy the man’s irritation too much as he talked over him, “which are brought by the state and not by companies or individuals.” He said the last couple of words through another yawn. “Whew. Excuse me. I’m obligated by the terms of my employment to apprise you of those facts. I can also write it all down for you and sign it.”  The man on his left perked up. “Seriously? Like, if you don’t say all that, they’d fire you?” Cody nodded. The man thought it over for a second. “What if we all claimed you didn’t?”  “Shut up,” the gray-haired man said, raising his voice.  Cody pretended not to hear. “I’d tell them I did.”  “And they’d just believe you?”  “I’m level-four bonded,” Cody replied. “On the job, I’m permanently under oath. If I lie, it’s perjury.”  “Shut your face or I’ll shut it for you,” said the gray-haired man, triggering Cody’s urge to yawn again. The man waited till he was done, then added: “Anything else in the way of legal disclaimers? Health warnings? Household hints?”  Cody gave his head a quick shake and dropped his gaze to his lap. They traveled in silence for some unmeasured amount of time. Abruptly, the man on his left straightened up. “I just can’t get my head around anyone just taking this guy’s word about anything,” he blurted.  “When we get where we’re going, you can look it up on Wikipedia,” the gray-haired man said acidly. “Last warning—shut your mouth.”  Cody hardly dared to look up after that; whenever he did, the gray-haired man always seemed to be watching him. He stared into the darkness, listening to the thrum of the tires and air rushing past. No one said anything about a rest stop and he doubted there was any point in asking—the gray-haired guy would probably offer him a Coke bottle. He shifted in the chair and concentrated on making himself relax. He had said what he had to say; his best course of action now was to avoid further antagonizing the gray-haired man.  It was just starting to grow lighter outside when he finally dozed off.  He woke from an unpleasant dream of many hands grabbing at him to find the big man unstrapping the chair while the gray-haired man poked his shoulder, telling him over and over to wake up. Exhaustion overwhelmed him, weighed him down so that just getting his eyes open was a major effort and when he finally did, they wouldn’t stay open for longer than half a second. Then he was wheeled onto the lift and the humid heat that had not yet permeated the van’s still-cool interior hit him in the face and seemed to suck all the air from his lungs.  Groggy, almost gasping, he noticed the van was now green and brown, bearing the logo of a large national rental company. More unsettling was seeing that they were in a parking garage. The gray-haired man leaned over him, looking pastier and more impassive than ever. “This will be less unpleasant if we don’t have to force you. Not that it’s a party. But if I have to short your circuits, it’ll only be more of an ordeal.”  Cody wasn’t sure how to respond or even if he should.  “Good,” the man said and made a let’s-go gesture at the guy pushing his wheelchair.  The escort surrounding him blocked his view of everything that wasn’t straight ahead but he saw enough to know it was definitely underground and it was mostly empty. Which didn’t mean anything, he told himself. The country was lousy with underground parking garages, it was just a coincidence he’d seen that item on the news. LaDene had been right, he’d just been scaring himself. He wasn’t a mobster, he was a courier, just a goddam courier. People didn’t go around killing couriers. Nobody wanted that kind of trouble, the couriers’ union was too well connected and too powerful.  A car engine started suddenly and the sound made him jump. The gray-haired man didn’t even glance at him but the others moved in a little closer, hiding him from view. They stayed close, even after he heard the car pass, until they reached a bank of elevators. One was roped off with a sign that said it was out of service. The gray-haired man pressed the call button and twisted; it popped open on a hinge and he inserted a plain metal key.  The elevator doors opened and Cody caught a strong whiff of antiseptic mixed with something flowery. His stomach turned over as they rolled him into the car, facing the back so he couldn’t see what floor they were going to. There was no voice announcement or even a chime but he could make out a series of faint, airy thumps—possibly just the motor running after a long period of disuse but Cody counted them anyway, noting when the air quality changed from rainforest to refrigerated, and estimated they stopped on the fourteenth or fifteenth floor.  The place looked like a fancy clinic, right down to the immaculate receptionist at the immaculate, shiny white desk. The gray-haired man gave her a brisk wave as he strode past, walking very quickly now as he led the way through a maze of corridors to a room with a gurney and the machine they were going to use on him.  “Take your robe off and get comfortable,” the gray-haired man said, jerking a thumb at the gurney.  Cody obeyed, a bit surprised at how quickly everyone else had vanished, leaving him alone with the man. He held onto the robe, turning it sideways to use like a blanket. “You mind? I’m kinda cold.”  “Already?” The man was doing something with the machine; he gave a small, humorless laugh. “Maybe we should get you some mitts and booties.”  “You could turn down the air conditioning,” Cody said.  No answer. Three people in white uniforms came in with a cart. Cody settled down with a sigh of resignation and closed his eyes so he wouldn’t have to see the cannulas going in.  Setting up seemed to take forever, although as far as he could tell, the hardware was up to date and they were all competent enough. Whoever had put the cannulas in his arm and leg was genuinely talented; it had been almost painless. The blood-pressure cuff on his other arm was actually more uncomfortable. He didn’t know why they needed that anyway, when the hospital gown would tell them whatever they needed to know about his vitals. But he supposed under the circumstances they wanted both a belt and suspenders. They even made a business of verifying his blood type and his DNA before they finally began the process of filtering his blood.  Once they got going, he felt a little lightheaded, as always, and colder than usual. He curled up as much as he could, huddling under the robe. There was very little conversation, all too low for him to make out; no one spoke to him. Eventually, he dozed off, mostly from boredom, and woke to find a pair of woolly socks on his feet. He didn’t really feel any warmer but he was touched by the gesture all the same.  Just for something to do, he tried to guess who had done it, watching them surreptitiously as they moved around, checking read-outs from him, from the machine, from his blood. The black woman with shoulder-length braids looked like she could have been someone’s mother; if so, it was someone very young. Parents of young children were usually good for a kind deed. Or it might have been the Chinese guy who, like Cody, seemed to be in his late thirties.  He couldn’t decide about the older black woman. She checked his vitals more often than anyone else but that didn’t necessarily mean she was more concerned about his welfare. For all he knew, the socks had come from old Gray Ponytail himself. Hadn’t he mentioned something about booties before they’d even started? Or it was one of the other people he’d barely glimpsed, busily working with his blood somewhere behind him. Maybe between separating blood cells from plasma and pumping it back into him, someone had paused to think he might be cold.  It went on for hours. Cody dozed, woke, dozed again. His stomach growled and subsided as hunger pangs threatened to turn into queasiness. How much longer, he wondered, irritable with boredom and lack of food. If they didn’t call a halt soon, he was going to have some kind of major blood sugar episode.  Almost as if he’d caught something of Cody’s thoughts, the gray-haired man tapped him on the shoulder. “Are you supposed to eat something? Something in particular,” he added, a bit impatiently.  “Food,” Cody said, not caring how petulant he sounded.  “Not bread or sugar?”  “Just food. I don’t suppose you’ll give me any.”  “What if we tried insulin instead?” There was an edge in the man’s voice. In his peripheral vision, Cody saw the younger woman and the Chinese guy look up from a tablet they’d been studying together, obviously startled.  “Risky,” Cody said. “I’m not diabetic. But you knew that.”  The man gazed at him for some unmeasured period of time. He was worn out, tried and frustrated, Cody realized with a surge of spiteful joy; they all were but him most of all, because he was on the hook for whatever went wrong.  Abruptly, he blew out an exasperated breath and turned away. “We can’t keep him any longer. Shut it down, give him lunch, and let’s get him out of here.”  Lunch turned out to be a can of nutrient with a straw; Cody was too hungry to feel more than a vague, momentary disappointment. The gray-haired man sat and glared at him. Hoping Cody would give up the goods somehow at the last minute? Or just being a sore loser?  “How old are you?” the man asked suddenly.  Cody paused and wiped his mouth. Considering how long they’d run his blood, he must have known, and a lot more besides. “Thirty-seven. Why?”  “Don’t you think that’s a little old to be a decoy?”  “I’m a courier.” He went back to the drink.  “You’re a decoy. A zero. A nothing. Less than nothing.”  Cody had no response for that; he kept drinking.  “The one that sold you out, she was probably the real courier. Wasn’t she?”  “Who?” But even as he asked, he knew. Her name was on the tip of his tongue but he managed not to say it aloud.  “I’m right, aren’t I? You’re just—what? A day-laborer who doesn’t mind needles and won’t faint at the sight of blood? She’s carrying. LaVerne or LaRue, whatever her name is.”  Cody pressed his lips together briefly. Whether the guy was telling the truth or fishing for a keyword, it wouldn’t hurt not to give it to him. “Roughly ten percent of the population faints at the sight of blood,” he said chattily. “It’s a physical reaction, they can’t help it. Nothing to do with their character or anything.”  “Thank you for that piece of enlightenment.” Despite his obvious irritation, his face was more impassive than ever, not to mention pastier. Now there were small flakes of what looked like dry skin around the man’s hairline. The disguise was starting to break down, the wig parting company with the silicone mask. Everything probably should have been removed hours ago but the guy had kept nursing it along with touch-ups. Because he’d expected it would all by over by now, data extracted and delivered, payment collected and he’d be on his way to his next case, already forgetting what Cody looked like.  Instead he was sitting in a small, cold room with nothing to show for his effort but a spray-on about to peel off his face and nothing to look forward to except the displeasure of whoever he was working for, the loss of his fee, and a crew he had to pay anyway.  Cody finished the drink and set the empty can down beside him on the gurney. Well, that wasn’t fun. Whaddaya wanna do next?  It was the last thought he had for a while.  Sounds nudged him gradually toward awareness, until he understood the voices and various other noises were real, not lingering fragments of dreams, or dream-like flashes from lost hours, possibly days. Eyes still closed, he rolled over, turning his face away from the bright light overhead and smelled clean sheets, along with alcohol, powder, and cleanser. Hospital emergency room, he thought with cautious relief; there were worse places to wake up.  His memory was patchy but he knew the basics of what had happened. As soon as his captors had been sure they wouldn’t find anything in his blood, they no longer had to worry about contamination and dosed Cody’s so-called lunch. Pretty heavily, if the lead-balloon sensation in his head was any indication. Just by way of kicking his ass for having nothing of value.  Once the lunch had taken effect, they had dressed him up and dumped him someplace where he could sleepwalk indefinitely without attracting attention. Like, say, a large mall. Or a shopping village; one with a multi-screen cineplex. Cody wondered how long he had been aimlessly roaming before anyone noticed something odd about him. There were all kinds of stories. Everybody in the union knew one about a courier who had woken up to find she’d wandered into a house and spent five days with people who’d thought she was a long-lost relative. Cody suspected that one was apocryphal.  Two days later, he was in a DC-area suburb, although he wasn’t sure exactly which state. State-line ambiguity was getting to be a habit with him.  “How’d you like Oklahoma City?” asked the medic from where she sat at the lighting panel. She was a slightly plump woman with one brown eye and one blue eye; the difference was made more noticeable by the port wine stain covering that side of her face from hairline to the corner of her mouth.  “I only saw a parking garage, a clinic, and part of a hospital.” Cody finished undressing and stood with his back to the plain white wall. “Ready when you are.”  “Ah, you’ve done this before. I don’t even have to tell you to close your eyes and hold perfectly still.”  He took a breath and held it. Sometimes he imagined he could sense the UV light change as the scanning line traveled over his body. Years ago, when he had first become a courier, they’d showed him a video of himself being scanned. He’d thought he’d looked like a fantasy creature—one of Lewis Carroll’s fabulous monsters that had wandered out of the looking glass into a high-tech lab.  Blaschko’s Lines, a doctor had told him, years ago. Only visible under certain kinds of UV light.  He’d done research on his own, wondered about lesions or the possibility of waking up one morning to find himself permanently piebald. He would dream that the lines running up and down his arms and legs, traveling in waves on his torso, looping on his back, swirling all over his head would appear spontaneously and without warning in normal light; sometimes they were permanent. Other times, they’d flash on and off like a warning light.  He hadn’t had that kind of anxiety dream in a long time. They’d faded away with the hotspots. Maybe now they were both coming back.  “Done,” the medic called.  Relieved, Cody took a deep breath and stepped away from the wall to get dressed again. The medic asked his permission before she swabbed the inside of his cheek, and again before scraping a few skin cells from his lower back, his hip, and his knee. He was immensely grateful for the courtesy. It was always nice when someone treated a courier like a human being in a demanding profession rather than merely a meat-bag for data.  The guy who escorted him to his room for the night was was wearing the standard gopher attire—a multi-pocketed vest over plain t-shirt, jeans, and running shoes—but had a military bearing that he didn’t even try to hide. Cody wasn’t surprised to find someone waiting for him when he got there. It had been a while since the last sales pitch.  “We’re all very glad to have you back safe.” The woman in the swivel chair by the desk was dark-haired and dark-skinned and her voice had the faint but unmistakable lilt that Hindi speakers never lost completely. He had seen her before a few times, dressed as she was now in a black jacket and trousers, but only in passing. She was one of those people who gave the impression of being taller because of the way she carried herself. Not military-style like his friend now standing at obvious parade rest between himself and the door, just with authority. In charge. The touches of gray in her hair suggested she was older than he was, though he couldn’t have said how much—more than ten, less than thirty.  “I’m glad to be back,” he said, feeling a little awkward as he stood in front of her. She gestured for him to sit down on the bed, the only other furniture in the room, unless you counted the forty-inch screen in the wall.  “You automatically get a week of recuperation but we’ll sign off on two or even three.” She shrugged. “Or four.”  “Thank you.”  “This wasn’t the first time for you, was it.”  As if she didn’t know, he thought, careful to keep a straight face. Then he realized she was actually waiting for an answer. “No,” he said quickly. “It wasn’t.”  “I hope that it wasn’t especially bad for you.”  He shook his head. His memory was still quite spotty—his clearest recollection was of an older man with a ponytail and having to lie very still in a cold room while his blood was pumped out of his body and back in again. He also had the idea that there had been someone in the hotel room with him before he’d been kidnapped but that didn’t seem likely. Considering how heavily he’d been drugged, he was probably lucky he still remembered his childhood.  Unless I rented it out for a database. Another of those left-field thoughts that had been popping into his head for the last few days. They’d probably meant something once.  “ . . . sure you will be happy to know that your kidnappers came away with nothing,” the woman was saying, “thanks to your unique . . . ah, condition.”  He smiled a little. “I never thought of being a chimera as a condition like, oh, excessive perspiration. Or psoriasis.”  “It does make you uniquely suited for deep encryption. Even if your kidnappers had thought to use your DNA to activate your blood, they wouldn’t know you have more than one kind of DNA, much less that they needed to scan you under UV for the entire key.”  His kidnappers; the way she said it made it sound almost as if they belonged to him in some way. Or like they were his personal problem—his condition.  “Eventually, that’ll occur to someone. If someone else doesn’t sell it to them first,” he added. The memory of a woman’s name, LaRue or LaDene, and an old movie flickered in his brain and was gone.  “Such optimism.” She gave a short laugh. “The average merc can’t afford to rent a full sequencer, let alone personnel to run it who would be smart enough to figure out you had two kinds of DNA, or that they’d need both for decryption.” She gave another slightly heartier laugh. “Contrary to what you may have heard, the evil genius is mostly mythical. Nobody turns to crime because of their towering intellect.  “But that’s neither here nor there. We still want you to work solely for us. I know that someone has made you this offer before—a few times, yes? As an employee, you would be paid substantially more, along with bonuses for crisis situations—”  “‘Crisis situations?’ Is that anything like ‘hazardous duty’?”  She barely hesitated as she acknowledged his interruption. “Occupational benefits are also quite generous. Health coverage, vacation time, paternity leave—”  “Dental?”  Now she paused to give him a look. “And optical. Even a clothing allowance.”  He was tempted to comment on how she had used hers but decided not to get personal.  “We can also be very flexible in terms of your cover,” she went on. “Some sort of independent, low-key profession, like an accountant or a transcriber or—” she floundered suddenly and he could tell it wasn’t something that happened to her very often.  “Software engineer,” he suggested, then smiled sheepishly. “Kidding.”  “That could work, as long as it’s something nice and ordinary. Wedding albums, family albums, baby pictures, that sort of thing—”  “I really was kidding,” he said. “Software mystifies me.”  “You could even be semi-retired—”  “No.” He shook his head, apologetic but firm. “If I go to work for you, I’m no longer a courier. I’m a government employee in a highly sensitive area under military jurisdiction. Once I lose my union membership, all bets are off. All I have is you.”  “That’s quite a lot,” the woman said reprovingly. “You have no idea how much.”  Actually, I do, he thought at her, but if I’m flayed and hung up in a parking garage, I won’t care about the cover story. He shook his head again.  “If we take you into the fold, we can tell you more about what you’re doing. Don’t you want to know—”  “No.” It came out louder and more emphatic than he’d intended but he wasn’t sorry. “I don’t. You’ve got me this much. I agreed to cooperate because I don’t need to be in the fold to be an encryption key. I’ll keep the secret but I don’t want to be the secret.”  The woman shook her head. “Please. You went over that line a long time ago.”  “Not quite,” he insisted. “My body, yes. But not me.”  She stood up, stretching a little. “We’ll talk again. This government doesn’t give up that easily.”  “Oh?” He raised his eyebrows. “Which government is that, anyway?”  The question caught her off-guard and for a moment she stared at him, open mouthed. Then she threw back her head and laughed. “Oh, very good,” she said, as the man opened the door for her. “Very, very good.” She started to leave, then hesitated. “And that’s really your name: Cody.”  “Yeah. My name’s really Cody.” Something flickered in his memory again but it was gone before he could think about it. He lay down on the bed and found the remote under one of the pillows.  “Well, that was fun,” he said, to no one and to whatever bugs might be listening, and turned on the TV. “Now whaddaya wanna do?”    Originally published in TRSF: The Best New Science Fiction, edited by Stephen Cass. Pat Cadigan was born in Schenectady, New York, and now lives in London with her family. She made her first professional sale in 1980, and has subsequently come to be regarded as one of the best new writers of her generation. Her story \"Pretty Boy Crossover\" has appeared on several critic's lists as among the best science fiction stories of the 1980's, and her story \"Angel\" was a finalist for the Hugo Award, the Nebula Award, and the World Fantasy Award (one of the few stories ever to earn that rather unusual distinction). Her short fiction--which has appeared in most of the major markets, including Asimov's Science Fiction and The Magazine of Fantasy & Science Fiction--has been gathered in the collections Patterns and Dirty Work. Her first novel, Mindplayers, was released in 1987 to excellent critical response, and her second novel, Synners, released in 1991, won the Arthur C. Clarke Award as the year's best science-fiction novel, as did her third novel, Fools, making her the only writer ever to win the Clarke Award twice. Her other books include the novels Dervish Is Digital, Tea from an Empty Cup, and Reality Used to Be a Friend of Mine, and, as editor, the anthology The Ultimate Cyberpunk, as well as two making-of movie books and four media tie-in novels.", "text": "8060 words, novelette, REPRINT\nCody\n“Common wisdom has it,” said LaDene from where she was stretched out on the queen-sized bed, “that anyone with a tattoo on their face goes crazy within five years.”\nCody paused in his examination of his jawline in the mirror over the desk to give her a look. “You see any tattoos on this example of manly beauty?”\n“Can’t see the moon from here, either. Or the TV remote,” she added she sat up and looked around. Cody found it on the desk and tossed it to her. “Thanks. You know, carnies would call you a marked man.”\n“Carnies?” He gave a short laugh. “Don’t tell me you threw over the bright lights of the midway to keep a low profile in budget accommodations.”\n“Higher-end budget accommodations.” She put on the TV and began channel-surfing. “For the discerning yet financially savvy business traveler. Don’t you ever read the brochures?”\nHe made a polite noise that was could have been yes or no and was neither. The hotspot that had come up over two hours ago was still there, midway between his chin and the point of his jaw, and as far as he could tell, it hadn’t faded even a little. The medic had assured him there was nothing to worry about unless it started to spread and it hadn’t. It wouldn’t have bothered him except he hadn’t had a hotspot in years. Rookies got hotspots.\nThe sudden recurrence could have been down to any number of things, the medic had said, the mostly likely being the attack of hayfever he had suffered on arrival. But he’d never had hayfever in his life, he’d told the medic. He’d never been to Kansas City in late August, she’d replied, chuckling.\nTechnically, he still hadn’t. The airport was thirty miles north of the city and the car they’d sent had taken him to an industrial park about as far to the west on the Kansas side of the state line, which apparently ran right through the middle of town. The most he’d seen of Kansas City proper was a distant cluster of skyscrapers, briefly glimpsed through the tinted window as the driver negotiated a complicated interchange of highway ramps. After that it was generic highway scenery all the way to a generic suburban industrial park, full of angular, antiseptic office buildings surrounded by patches of green landscaped and manicured in extremis, some with a koi pond or a fountain. The access road meandered through it so much that Cody thought there had to be an extra mile of travel. Albeit a very pretty mile; perhaps it was so people coming and going could see at least in passing the flowers they didn’t have time to stop and smell. Cody could have done without it. By the time they’d reached their destination, he had actually begun to feel carsick.\n“Yo!” A pillow hit him in the head, making him jump. “And I thought I was vain,” LaDene laughed. “Are you really that fascinating?”\n“I was woolgathering,” he said as he threw the pillow back at her. “Thinking, in case you don’t know what that means.”\n“I know what it means,” she said. “I also know you’ve got a hotspot. Unclench, honey, I’ve got one, too.” She lifted her shirt and pointed at her navel.\n“Oh, very funny.”\n“Oh, very for-real.” She was up off the bed and had his face in her hands before he could say anything. “Ah, got it, right there.” She patted his cheek and pulled up her shirt again, exposing her midriff. “Mine’s hotter. Feel.”\nHer bellybutton was only inches away from his nose. Cody drew back and started to protest as she grabbed his hand and pressed it against her skin. His discomfort turned to surprise. “I sit corrected,” he said, extricating himself from her grip. “Yours is hotter.”\n“Told you,” she said, plumping down on the bed to stretch out again. “It’s probably the ragweed and who knows what else in the air. Man, I hate KC this time of year.”\n“You’ve been here before?”\n“I’m from here.” She laughed at his surprised expression. “You couldn’t tell?”\n“How could I? We just met.”\n“I knew you weren’t from around here, soon as I saw you. No antihistamines.”\nHe chuckled a bit ruefully. “I thought I was dying of a head cold I caught on the plane.”\nShe started to channel-surf again, then changed her mind and shut the TV off. “If you get cold symptoms a lot when you fly, it’s probably an allergy.”\n“Oh?” He gave a short skeptical laugh. “Is there a lot of ragweed on airplanes?”\nShe shrugged. “Lots of other stuff—mold, dust, newsprint. Somebody’s cheap cologne. Even expensive cologne.”\n“Newsprint?”\n“Believe it or leave it. You know how if something exists, there’s porn of it? Well, there’s also someone allergic to it.”\n“Newsprint,” Cody said again, still skeptical.\n“If I’m lyin’, I’m dyin’.” LaDene raised one hand solemnly, then let it fall. “Okay, that was fun. Now whaddaya wanna do?”\nCody leaned over and scooped the remote control up so he could turn the TV back on, mainly to forestall the possibility of her wanting to compare hotspots again. The screen lit up to show a dark-haired, olive-skinned woman speaking directly to the camera with an earnest sincerity that made his own brow furrow in sympathy.\n“ . . . found flayed and burned in a midtown Kansas City, Missouri parking garage have now positively been identified as August Fiore, AKA Little Augie Flowers, fifty-one, and Coral Oh, twenty-nine, of Liberty, Missouri. Fiore went missing two weeks ago from an FBI safe house where he was being held pending the start of the trial of Carmine Nesparini on racketeering charges. The FBI has steadfastly refused to comment on allegations that Fiore was Nesparini’s personal ‘master key’ but sources close to the investigation say that Fiore’s cooperation would have given authorities an unprecedented level of access to mob records.\n“Fiore’s attorneys refused to comment, except to say that they were unaware of any escape plans and had no knowledge of Fiore’s whereabouts. Whether Fiore left the safe house voluntarily may never be known. FBI technicians are still working on the sabotaged surveillance system but experts believe there is little chance they can salvage enough data to be useful.\n“Coral Oh’s connection to Fiore still has not been established. Oh worked for the Kansas City Convention Bureau for fifteen years as an event coordinator, for the last three in a supervisory position. Co-workers described her as intelligent and well liked. She was last seen ten days ago in her office by two of her subordinates, who had been working late with her.”\nThe woman was suddenly replaced by a video of a very young man who looked as if he hadn’t slept for at least that long. The slightly wobbly graphic at the bottom of the screen said he was Akule Velasquez.”She told us to go home, she’d finish up,” he said in a husky voice to someone just off-camera to the left. “We’d’ve stayed but she was all—” he made small shooing gestures with both hands. “‘No, get outa here, I’ll finish, bring me some fancy coffee tomorrow.’ She was like that. I tried to stay anyway but she kept telling me no. I wish I hadn’t listened.”\nThe woman in the studio reappeared, looking more earnest and sincere than ever. “The mayor’s office issued a statement saying that this unfortunate and tragic incident should not overshadow the fact that criminal activity in the area has been steadily declining for the past twelve months thanks to new policing initiatives—”\nLaDene snatched the remote out of his hand and turned off the TV. “Well, that wasn’t fun. Now what do you wanna do?”\n“Hey, I was watching that.” Cody reached for the remote but she threw it across the room where it bounced off the wall and fell neatly into a small waste basket.\n“She shoots, she scores! A three-pointer, the crowd goes wild!” LaDene made crowd noises as he stalked over to retrieve the control. The impact had knocked the batteries out and it took him two tries to put them back in properly. “Oh, come on. What do you wanna scare the shit out of yourself for?”\nBut the news had moved on; now a man was standing near the edge of an empty swimming pool, blinking in bright sunlight as he talked about levels of chlorine. “Oh, well.” Cody dropped the remote on the bed and sat down on the chair by desk again. “I wasn’t trying to scare myself.”\n“Who were you trying to scare—me?”\n“No. I just want to pay attention.”\n“Set a news alert on your phone.” She was channel-surfing again. “It’s probably all bullshit anyway. ‘Little Augie Flowers,’ for God’s sake. Who goes around calling themselves ‘Little Augie Flowers’? For a minute there, I thought they were talking about some old Grand Theft Auto module. ‘Gay Tony Meets Little Augie Flowers, bullets will fly, heads will roll!’ Oh, hey, I love this!” she added, sitting up suddenly.\nCody barely had to look at the screen to know what it was. “I’ve seen it.” He rested an elbow on the desk and cupped his face in his hand. The hotspot was still there. “Several times.”\n“So have I but I like to watch it whenever it’s on. That guy’s so cool.”\n“He is?” If he didn’t leave the goddam hotspot alone, he told himself, it was never going to fade. He shifted so he was leaning the upper part of his cheek against his hand; as if it had a will of its own, his thumb slid down to feel his jawline. Annoyed with himself, he straightened up, grabbed the TV listings off the desk and paged through them without seeing anything.\n“Okay, he’s all wrong and he probably knew it,” LaDene was saying. She punched the pillows behind her into a more supportive position for her lower back and casually folded her legs into a half-lotus, making Cody wince. “But so what? The whole movie’s wrong.”\n“Well, it’s a pretty old movie,” he said, shrugging.\n“Not that old. Not ancient.”\n“No, but BCI didn’t even exist when this came out and people were still using floppy disks. This big.” He held his hands three feet apart. She gave him a look and he moved them so they were only a foot apart. “Okay, this big. TVs were dumb terminals and a cloud was a fluffy white thing in the sky. So the idea of people giving up memories to store data in their brains—”\nLaDene waved one hand dismissively. “I was referring to the cell phones.”\nHe frowned. “What cell phones?”\n“Exactly!” She laughed. “How the hell did they miss cell phones?”\nAs if on cue, there was a sound like a ray-gun in a scifi movie and the ring on her right hand lit up with tiny flashing lights. She cocked her head, listening, then bounced off the bed. “My ride’s here. See you around—” Her grin was sheepish.\n“Cody,” he said.\n“Right.” She paused, one eyebrow raised, the other down low, something Cody had never been able to manage no matter how hard he’d tried. “That’s really your name.”\n“LaDene’s really yours?” he said evenly.\n“I grew up in Tonganoxie, Kansas. Of course it’s really my name.”\nThe two statements seemed unrelated to him but he nodded anyway. She pulled her suitcase out of the closet, extended the handle and then paused again, one hand on the doorknob. “Where are you from?”\n“I used to know but I rented that out for a database back-up.”\nHe heard her laughing all the way down the hall.\nHe ate alone in the dining room. The waitress gave him a table by a window that made the most of the hotel’s location atop a rocky promontory, so he could enjoy his chicken Caesar salad with a scenic view of three other hotels and the six-lane highway running between them.\nWhile it may not have been classic postcard material, he had to admit the view was actually rather nice. Kansas wasn’t as flat as most people seemed to think, at least not in this locale. Here the landscape was gently rolling, punctuated by flat stretches usually occupied by malls or apartment complexes. In the distance, he could see the top of a mall that had to be the size of an airplane hangar and, not far from that, a crane surrounded by a framework suggesting future apartments or condos.\nBut it was the highway that drew his eye more than anything. He couldn’t remember the last time he had seen so many private cars. Well, the travel agent had told him this was one of the last bastions of the autonomous commuter. Cody couldn’t imagine what it was like to spend an hour or more of every weekday driving. He’d had a license himself once, but only briefly. After it had expired, he hadn’t bothered renewing it and didn’t miss it.\nPerhaps if he were driving now, he’d be too busy to keep worrying at that stupid hotspot. Annoyed with himself, he pulled the complimentary library up on the table-top and checked out the local newspaper.\nThe waitress tried to talk him into dessert every time she refilled his iced tea. After his third glass, he swiped his keycard through the table-top reader, left an overly generous cash tip, and went back up to the room. It seemed a lot emptier now that LaDene was gone. Even the pillows she had piled against the headboard looked forlorn. He hadn’t been thrilled to find her there when he’d checked in. She had apologized profusely—some kind of travel-plan fiasco. Having been through a few of those himself, he was sympathetic. As it turned out, she’d been good company—better than he’d realized. His newly-recovered privacy felt lonely.\nHe stretched out in the place where she had been and put the TV on again. It was only one night, and as LaDene had pointed out, this was a higher-end budget hotel. The complimentary coffee service was a drip pot with pouches of a gourmet blend rather than merely a kettle and two envelopes of instant. The minibar was well stocked with a wide variety of refreshments and if all of it cost ten times what it would in a grocery store, at least the cans of mixed nuts were a bit larger than average.\nAnd then there was the television. Twenty channels including sports and movies, not counting the on-demand you had to pay extra for. Most places didn’t offer half that. Maybe it was their way of compensating people like him, who were stuck there without a car.\nAlthough that wasn’t quite true. A chat with the desk clerk had revealed that they were less than a mile away from what she referred to as a shopping village, which he quickly figured out was a clever euphemism for strip mall. It wasn’t much, she’d said in a politely cautioning tone meant to discourage any ideas of a foray on foot—a discount electronics outlet, a hardware store, an indoor playground, and three fast-food joints. Cody decided he could live without seeing it.\n“Good choice,” the clerk had said approvingly. “Because you’d be taking your life in your hands—no sidewalks.”\n“No sidewalks where?” he’d asked, puzzled.\n“Between here and the shopping village.”\n“Then where do people walk?”\n“They don’t. People have to drive to get out here. They park, do whatever they came to do, then drive home again. I mean, you don’t walk on the interstate, either.”\nCody had been tempted to ask if she ever went for walks herself and if so, where, but decided against it. She was twenty-two at most, about to go from merely young and pretty to eye-catching as the last of her adolescent puppy-fat disappeared. She might have thought he was hitting on her and if he were honest, he might have had a hard time denying it.\nHe found a 24-hour news channel, turned the volume down to a murmur, and then used the remote to shut off the lights.\nThe next thing he knew, someone was sitting on his chest.\nHe could see nothing in the dark except a darker shadow looming over him, blocking out the flickering light from the television. He tried to yell but his mouth refused to open and he only made a sort of high-pitched grunt. Something pressed hard against his windpipe as whoever had him pinned bent over to speak close to his ear.\n“You want to lie very still and not make a sound,” said a male voice, just above a whisper. “Then do exactly what I tell you. I don’t want to hurt you. I’m not here to hurt you. But I will if I have to.”\nHis heart was beating hard and fast, as if it were trying to pound its way out of his chest. The pressure on his windpipe eased but didn’t go away entirely. He swallowed, wincing.\nAs the man straightened up, Cody made out long graying hair, possibly tied back, and thick-framed glasses. “First, don’t try to open your mouth. You’re short-circuited and you’ll only give yourself a headache. Once I know you’re gonna behave yourself, I’ll consider letting you chew gum.”\nHe tried to make a conciliatory noise; the pressure on his windpipe increased again.\n“I said, don’t make a sound.”\nCody sucked air through his nose, feeling himself jerk helplessly as his body fought to cough even though his mouth wouldn’t open. His throat clenched, knotted, and tried to turn itself inside out. Then all at once, his mouth did open, just long enough for him to let out a few explosive coughs before his jaw snapped shut again.\n“Better?”\nCody nodded, breathing in hungrily through his nose.\n“You understand now to do exactly what I say?”\nHe nodded again.\n“After I let you up, you’re gonna change your clothes. Then you’ll be taken out of here in a wheelchair. You’re gonna sit quiet and stare at your lap. You’re not gonna look up. If anyone speaks to you, you’ll act like you didn’t hear anything. There’s a van waiting out front. You’ll be put into it, chair and all, and we’ll drive away.\n“Now, it’s important you remember everything I just said and do exactly that because an associate of mine is having a chat with the night clerk. Nice older man, a grandfather, in fact. If, while we pass through the lobby, he should get the idea that you need help, my associate will hurt him, badly. Unlike me, my associate doesn’t mind hurting anyone. You don’t want to harm innocent bystanders, do you.”\nCody shook his head from side to side.\n“Very good. Now, when I let you up, you’re going to strip naked and put on what I’ve brought for you.”\nThe man climbed off him and stood back. Cody moved more slowly as he slid over to the edge of the bed and began to unbutton his shirt with shaky fingers.\n“A little faster, please,” the man said, staring at the television with his arms folded. Cody wanted to comply but he was so unsteady he was off-balance even sitting down. He shoved his trousers down, extricating his ankles one at a time, socks and all. Next to him was a small neat pile of clothing folded into squares. Trembling, he picked up the top item; it was a hospital gown.\n“Ties in back,” the man said, casually matter of fact, as if he were remarking on the weather. He never looked away from the television.\nCody couldn’t have tied his shoelaces. He decided it didn’t matter; the second item was a bathrobe. He put it on sitting down, then pushed himself carefully to his feet.\nThe man turned from the television to give him an up-and-down. “I told you to strip naked. Lose the tidy-whiteys.”\nCody fell over on the bed in the rush to gets his shorts off. The man waited with a put-upon air till he was done, then took hold of his upper arm and pulled him up. Cody winced; his grip was unnaturally strong, well out of proportion for a slight, older man almost a head shorter than he was.\nThe man waiting in the hallway with the wheelchair was a lot taller and huskier, dressed in a dark blue coverall; there was a patch on his left breast pocket showing a picture of a first-aid kit and the words County EMS. He said nothing as Cody stumbled over the foot-rests and fell into the seat. The frame was lightweight and all the wheels were small. The gray-haired man bent over him and Cody saw he was wearing the same uniform.\n“You remember what I told you,” he said and Cody noticed how little his rather pasty face moved, as if he’d Botoxed it into submission. And out here, up close and personal in much brighter light, the gray hair looked like a wig, ponytail and all. “Think of that poor man’s family. Whether he goes home when his shift is over is all down to you.” He stared into Cody’s eyes as if he expected to see some response there, then chuckled and patted his cheek. “And seriously, relax your jaw. I’m not kidding about the headache.” Cody started to rub the side of his face but the man caught his hand and put it firmly in his lap. “You don’t move till we’re out of here. Can you manage that or should I help you?”\nCody bowed his head.\n“By George, I think he’s got it.”\nDespite the carpeting, the ride was bumpy—the chair had a wobbly wheel, like every supermarket shopping cart Cody had ever used. But he stared fixedly at the slightly threadbare material covering his knees as they went down in the elevator. When they reached the lobby, he bowed his head a little more and squeezed his eyes shut, afraid they’d kill the desk clerk anyway. Having seen their faces, he’d be able to give a description to the police, which didn’t bode well for his survival.\nOr for his own.\nThe thought was a cold electric shock running down his back as the automatic doors hummed open in front of him. He heard the desk clerk tell someone to have a good night and a woman responded I surely will, you too! in a cheerful, friendly tone.\nThen he was outside, rattling toward a white van with the same County EMS painted on the open side door. A tall woman waited beside a wheelchair lift.\nCody had no idea how long they had been on the road before the gray-haired man reached over and touched something to a spot under his cheekbone near the hinge of his jaw. He was in the middle of a huge yawn almost before it registered on him that he could open his mouth again. The muscles on either side of his face felt overworked and sore, including some he had never actually known were there. He worked his jaw for a while, knowing the gray-haired man was watching him and trying not to care.\nHe was sitting in a fold-down seat on Cody’s right, facing backwards. The husky guy had anchored the wheelchair against a padded backstop and strapped him in before taking the seat on his left. The tall woman was up front, next to the driver. The woman who had been talking to the night clerk was behind him, along with at least one other person he had neither seen nor heard and who apparently wanted to keep it that way. Unbidden, the idea came to him that it was LaDene; he put it quickly out of his mind. Paranoia wasn’t going to help.\nCody rested his head against the backstop and closed his eyes, wondering if he actually could go to sleep. Under the circumstances, there wasn’t anything else he could do. But his mind was as alert as if he were in the middle of a busy day, which he supposed he was. Pretending to be asleep was a waste of time, thanks to the hospital gown; he figured they’d souped it up to where it could practically read his mood.\nHe opened his eyes and saw the gray-haired man watching him. Almost reflexively, he was overwhelmed by another huge yawn.\n“You know the situation,” the gray-haired man said, when his yawn had passed.\nCody nodded. “And you know I don’t know anything.”\n“You don’t have to,” the man said.\n“I’m a courier,” Cody added. “Even if I wanted to, I couldn’t access anything—”\n“We know,” the other man said, sounding short.\n“—I have no knowledge of the quantity or nature of any data—”\n“Yes, we’re aware—”\n“—nor am I responsible if any attempts at access cause damage, in whole or in part, to that data or any hardware or software—”\n“We already know that—” He was openly impatient now.\n“—my safe return cannot not indemnify any party against criminal charges of kidnapping and false imprisonment,” Cody went on, trying not to enjoy the man’s irritation too much as he talked over him, “which are brought by the state and not by companies or individuals.” He said the last couple of words through another yawn. “Whew. Excuse me. I’m obligated by the terms of my employment to apprise you of those facts. I can also write it all down for you and sign it.”\nThe man on his left perked up. “Seriously? Like, if you don’t say all that, they’d fire you?” Cody nodded. The man thought it over for a second. “What if we all claimed you didn’t?”\n“Shut up,” the gray-haired man said, raising his voice.\nCody pretended not to hear. “I’d tell them I did.”\n“And they’d just believe you?”\n“I’m level-four bonded,” Cody replied. “On the job, I’m permanently under oath. If I lie, it’s perjury.”\n“Shut your face or I’ll shut it for you,” said the gray-haired man, triggering Cody’s urge to yawn again. The man waited till he was done, then added: “Anything else in the way of legal disclaimers? Health warnings? Household hints?”\nCody gave his head a quick shake and dropped his gaze to his lap. They traveled in silence for some unmeasured amount of time. Abruptly, the man on his left straightened up. “I just can’t get my head around anyone just taking this guy’s word about anything,” he blurted.\n“When we get where we’re going, you can look it up on Wikipedia,” the gray-haired man said acidly. “Last warning—shut your mouth.”\nCody hardly dared to look up after that; whenever he did, the gray-haired man always seemed to be watching him. He stared into the darkness, listening to the thrum of the tires and air rushing past. No one said anything about a rest stop and he doubted there was any point in asking—the gray-haired guy would probably offer him a Coke bottle. He shifted in the chair and concentrated on making himself relax. He had said what he had to say; his best course of action now was to avoid further antagonizing the gray-haired man.\nIt was just starting to grow lighter outside when he finally dozed off.\nHe woke from an unpleasant dream of many hands grabbing at him to find the big man unstrapping the chair while the gray-haired man poked his shoulder, telling him over and over to wake up. Exhaustion overwhelmed him, weighed him down so that just getting his eyes open was a major effort and when he finally did, they wouldn’t stay open for longer than half a second. Then he was wheeled onto the lift and the humid heat that had not yet permeated the van’s still-cool interior hit him in the face and seemed to suck all the air from his lungs.\nGroggy, almost gasping, he noticed the van was now green and brown, bearing the logo of a large national rental company. More unsettling was seeing that they were in a parking garage. The gray-haired man leaned over him, looking pastier and more impassive than ever. “This will be less unpleasant if we don’t have to force you. Not that it’s a party. But if I have to short your circuits, it’ll only be more of an ordeal.”\nCody wasn’t sure how to respond or even if he should.\n“Good,” the man said and made a let’s-go gesture at the guy pushing his wheelchair.\nThe escort surrounding him blocked his view of everything that wasn’t straight ahead but he saw enough to know it was definitely underground and it was mostly empty. Which didn’t mean anything, he told himself. The country was lousy with underground parking garages, it was just a coincidence he’d seen that item on the news. LaDene had been right, he’d just been scaring himself. He wasn’t a mobster, he was a courier, just a goddam courier. People didn’t go around killing couriers. Nobody wanted that kind of trouble, the couriers’ union was too well connected and too powerful.\nA car engine started suddenly and the sound made him jump. The gray-haired man didn’t even glance at him but the others moved in a little closer, hiding him from view. They stayed close, even after he heard the car pass, until they reached a bank of elevators. One was roped off with a sign that said it was out of service. The gray-haired man pressed the call button and twisted; it popped open on a hinge and he inserted a plain metal key.\nThe elevator doors opened and Cody caught a strong whiff of antiseptic mixed with something flowery. His stomach turned over as they rolled him into the car, facing the back so he couldn’t see what floor they were going to. There was no voice announcement or even a chime but he could make out a series of faint, airy thumps—possibly just the motor running after a long period of disuse but Cody counted them anyway, noting when the air quality changed from rainforest to refrigerated, and estimated they stopped on the fourteenth or fifteenth floor.\nThe place looked like a fancy clinic, right down to the immaculate receptionist at the immaculate, shiny white desk. The gray-haired man gave her a brisk wave as he strode past, walking very quickly now as he led the way through a maze of corridors to a room with a gurney and the machine they were going to use on him.\n“Take your robe off and get comfortable,” the gray-haired man said, jerking a thumb at the gurney.\nCody obeyed, a bit surprised at how quickly everyone else had vanished, leaving him alone with the man. He held onto the robe, turning it sideways to use like a blanket. “You mind? I’m kinda cold.”\n“Already?” The man was doing something with the machine; he gave a small, humorless laugh. “Maybe we should get you some mitts and booties.”\n“You could turn down the air conditioning,” Cody said.\nNo answer. Three people in white uniforms came in with a cart. Cody settled down with a sigh of resignation and closed his eyes so he wouldn’t have to see the cannulas going in.\nSetting up seemed to take forever, although as far as he could tell, the hardware was up to date and they were all competent enough. Whoever had put the cannulas in his arm and leg was genuinely talented; it had been almost painless. The blood-pressure cuff on his other arm was actually more uncomfortable. He didn’t know why they needed that anyway, when the hospital gown would tell them whatever they needed to know about his vitals. But he supposed under the circumstances they wanted both a belt and suspenders. They even made a business of verifying his blood type and his DNA before they finally began the process of filtering his blood.\nOnce they got going, he felt a little lightheaded, as always, and colder than usual. He curled up as much as he could, huddling under the robe. There was very little conversation, all too low for him to make out; no one spoke to him. Eventually, he dozed off, mostly from boredom, and woke to find a pair of woolly socks on his feet. He didn’t really feel any warmer but he was touched by the gesture all the same.\nJust for something to do, he tried to guess who had done it, watching them surreptitiously as they moved around, checking read-outs from him, from the machine, from his blood. The black woman with shoulder-length braids looked like she could have been someone’s mother; if so, it was someone very young. Parents of young children were usually good for a kind deed. Or it might have been the Chinese guy who, like Cody, seemed to be in his late thirties.\nHe couldn’t decide about the older black woman. She checked his vitals more often than anyone else but that didn’t necessarily mean she was more concerned about his welfare. For all he knew, the socks had come from old Gray Ponytail himself. Hadn’t he mentioned something about booties before they’d even started? Or it was one of the other people he’d barely glimpsed, busily working with his blood somewhere behind him. Maybe between separating blood cells from plasma and pumping it back into him, someone had paused to think he might be cold.\nIt went on for hours. Cody dozed, woke, dozed again. His stomach growled and subsided as hunger pangs threatened to turn into queasiness. How much longer, he wondered, irritable with boredom and lack of food. If they didn’t call a halt soon, he was going to have some kind of major blood sugar episode.\nAlmost as if he’d caught something of Cody’s thoughts, the gray-haired man tapped him on the shoulder. “Are you supposed to eat something? Something in particular,” he added, a bit impatiently.\n“Food,” Cody said, not caring how petulant he sounded.\n“Not bread or sugar?”\n“Just food. I don’t suppose you’ll give me any.”\n“What if we tried insulin instead?” There was an edge in the man’s voice. In his peripheral vision, Cody saw the younger woman and the Chinese guy look up from a tablet they’d been studying together, obviously startled.\n“Risky,” Cody said. “I’m not diabetic. But you knew that.”\nThe man gazed at him for some unmeasured period of time. He was worn out, tried and frustrated, Cody realized with a surge of spiteful joy; they all were but him most of all, because he was on the hook for whatever went wrong.\nAbruptly, he blew out an exasperated breath and turned away. “We can’t keep him any longer. Shut it down, give him lunch, and let’s get him out of here.”\nLunch turned out to be a can of nutrient with a straw; Cody was too hungry to feel more than a vague, momentary disappointment. The gray-haired man sat and glared at him. Hoping Cody would give up the goods somehow at the last minute? Or just being a sore loser?\n“How old are you?” the man asked suddenly.\nCody paused and wiped his mouth. Considering how long they’d run his blood, he must have known, and a lot more besides. “Thirty-seven. Why?”\n“Don’t you think that’s a little old to be a decoy?”\n“I’m a courier.” He went back to the drink.\n“You’re a decoy. A zero. A nothing. Less than nothing.”\nCody had no response for that; he kept drinking.\n“The one that sold you out, she was probably the real courier. Wasn’t she?”\n“Who?” But even as he asked, he knew. Her name was on the tip of his tongue but he managed not to say it aloud.\n“I’m right, aren’t I? You’re just—what? A day-laborer who doesn’t mind needles and won’t faint at the sight of blood? She’s carrying. LaVerne or LaRue, whatever her name is.”\nCody pressed his lips together briefly. Whether the guy was telling the truth or fishing for a keyword, it wouldn’t hurt not to give it to him. “Roughly ten percent of the population faints at the sight of blood,” he said chattily. “It’s a physical reaction, they can’t help it. Nothing to do with their character or anything.”\n“Thank you for that piece of enlightenment.” Despite his obvious irritation, his face was more impassive than ever, not to mention pastier. Now there were small flakes of what looked like dry skin around the man’s hairline. The disguise was starting to break down, the wig parting company with the silicone mask. Everything probably should have been removed hours ago but the guy had kept nursing it along with touch-ups. Because he’d expected it would all by over by now, data extracted and delivered, payment collected and he’d be on his way to his next case, already forgetting what Cody looked like.\nInstead he was sitting in a small, cold room with nothing to show for his effort but a spray-on about to peel off his face and nothing to look forward to except the displeasure of whoever he was working for, the loss of his fee, and a crew he had to pay anyway.\nCody finished the drink and set the empty can down beside him on the gurney. Well, that wasn’t fun. Whaddaya wanna do next?\nIt was the last thought he had for a while.\nSounds nudged him gradually toward awareness, until he understood the voices and various other noises were real, not lingering fragments of dreams, or dream-like flashes from lost hours, possibly days. Eyes still closed, he rolled over, turning his face away from the bright light overhead and smelled clean sheets, along with alcohol, powder, and cleanser. Hospital emergency room, he thought with cautious relief; there were worse places to wake up.\nHis memory was patchy but he knew the basics of what had happened. As soon as his captors had been sure they wouldn’t find anything in his blood, they no longer had to worry about contamination and dosed Cody’s so-called lunch. Pretty heavily, if the lead-balloon sensation in his head was any indication. Just by way of kicking his ass for having nothing of value.\nOnce the lunch had taken effect, they had dressed him up and dumped him someplace where he could sleepwalk indefinitely without attracting attention. Like, say, a large mall. Or a shopping village; one with a multi-screen cineplex. Cody wondered how long he had been aimlessly roaming before anyone noticed something odd about him. There were all kinds of stories. Everybody in the union knew one about a courier who had woken up to find she’d wandered into a house and spent five days with people who’d thought she was a long-lost relative. Cody suspected that one was apocryphal.\nTwo days later, he was in a DC-area suburb, although he wasn’t sure exactly which state. State-line ambiguity was getting to be a habit with him.\n“How’d you like Oklahoma City?” asked the medic from where she sat at the lighting panel. She was a slightly plump woman with one brown eye and one blue eye; the difference was made more noticeable by the port wine stain covering that side of her face from hairline to the corner of her mouth.\n“I only saw a parking garage, a clinic, and part of a hospital.” Cody finished undressing and stood with his back to the plain white wall. “Ready when you are.”\n“Ah, you’ve done this before. I don’t even have to tell you to close your eyes and hold perfectly still.”\nHe took a breath and held it. Sometimes he imagined he could sense the UV light change as the scanning line traveled over his body. Years ago, when he had first become a courier, they’d showed him a video of himself being scanned. He’d thought he’d looked like a fantasy creature—one of Lewis Carroll’s fabulous monsters that had wandered out of the looking glass into a high-tech lab.\nBlaschko’s Lines, a doctor had told him, years ago. Only visible under certain kinds of UV light.\nHe’d done research on his own, wondered about lesions or the possibility of waking up one morning to find himself permanently piebald. He would dream that the lines running up and down his arms and legs, traveling in waves on his torso, looping on his back, swirling all over his head would appear spontaneously and without warning in normal light; sometimes they were permanent. Other times, they’d flash on and off like a warning light.\nHe hadn’t had that kind of anxiety dream in a long time. They’d faded away with the hotspots. Maybe now they were both coming back.\n“Done,” the medic called.\nRelieved, Cody took a deep breath and stepped away from the wall to get dressed again. The medic asked his permission before she swabbed the inside of his cheek, and again before scraping a few skin cells from his lower back, his hip, and his knee. He was immensely grateful for the courtesy. It was always nice when someone treated a courier like a human being in a demanding profession rather than merely a meat-bag for data.\nThe guy who escorted him to his room for the night was was wearing the standard gopher attire—a multi-pocketed vest over plain t-shirt, jeans, and running shoes—but had a military bearing that he didn’t even try to hide. Cody wasn’t surprised to find someone waiting for him when he got there. It had been a while since the last sales pitch.\n“We’re all very glad to have you back safe.” The woman in the swivel chair by the desk was dark-haired and dark-skinned and her voice had the faint but unmistakable lilt that Hindi speakers never lost completely. He had seen her before a few times, dressed as she was now in a black jacket and trousers, but only in passing. She was one of those people who gave the impression of being taller because of the way she carried herself. Not military-style like his friend now standing at obvious parade rest between himself and the door, just with authority. In charge. The touches of gray in her hair suggested she was older than he was, though he couldn’t have said how much—more than ten, less than thirty.\n“I’m glad to be back,” he said, feeling a little awkward as he stood in front of her. She gestured for him to sit down on the bed, the only other furniture in the room, unless you counted the forty-inch screen in the wall.\n“You automatically get a week of recuperation but we’ll sign off on two or even three.” She shrugged. “Or four.”\n“Thank you.”\n“This wasn’t the first time for you, was it.”\nAs if she didn’t know, he thought, careful to keep a straight face. Then he realized she was actually waiting for an answer. “No,” he said quickly. “It wasn’t.”\n“I hope that it wasn’t especially bad for you.”\nHe shook his head. His memory was still quite spotty—his clearest recollection was of an older man with a ponytail and having to lie very still in a cold room while his blood was pumped out of his body and back in again. He also had the idea that there had been someone in the hotel room with him before he’d been kidnapped but that didn’t seem likely. Considering how heavily he’d been drugged, he was probably lucky he still remembered his childhood.\nUnless I rented it out for a database. Another of those left-field thoughts that had been popping into his head for the last few days. They’d probably meant something once.\n“ . . . sure you will be happy to know that your kidnappers came away with nothing,” the woman was saying, “thanks to your unique . . . ah, condition.”\nHe smiled a little. “I never thought of being a chimera as a condition like, oh, excessive perspiration. Or psoriasis.”\n“It does make you uniquely suited for deep encryption. Even if your kidnappers had thought to use your DNA to activate your blood, they wouldn’t know you have more than one kind of DNA, much less that they needed to scan you under UV for the entire key.”\nHis kidnappers; the way she said it made it sound almost as if they belonged to him in some way. Or like they were his personal problem—his condition.\n“Eventually, that’ll occur to someone. If someone else doesn’t sell it to them first,” he added. The memory of a woman’s name, LaRue or LaDene, and an old movie flickered in his brain and was gone.\n“Such optimism.” She gave a short laugh. “The average merc can’t afford to rent a full sequencer, let alone personnel to run it who would be smart enough to figure out you had two kinds of DNA, or that they’d need both for decryption.” She gave another slightly heartier laugh. “Contrary to what you may have heard, the evil genius is mostly mythical. Nobody turns to crime because of their towering intellect.\n“But that’s neither here nor there. We still want you to work solely for us. I know that someone has made you this offer before—a few times, yes? As an employee, you would be paid substantially more, along with bonuses for crisis situations—”\n“‘Crisis situations?’ Is that anything like ‘hazardous duty’?”\nShe barely hesitated as she acknowledged his interruption. “Occupational benefits are also quite generous. Health coverage, vacation time, paternity leave—”\n“Dental?”\nNow she paused to give him a look. “And optical. Even a clothing allowance.”\nHe was tempted to comment on how she had used hers but decided not to get personal.\n“We can also be very flexible in terms of your cover,” she went on. “Some sort of independent, low-key profession, like an accountant or a transcriber or—” she floundered suddenly and he could tell it wasn’t something that happened to her very often.\n“Software engineer,” he suggested, then smiled sheepishly. “Kidding.”\n“That could work, as long as it’s something nice and ordinary. Wedding albums, family albums, baby pictures, that sort of thing—”\n“I really was kidding,” he said. “Software mystifies me.”\n“You could even be semi-retired—”\n“No.” He shook his head, apologetic but firm. “If I go to work for you, I’m no longer a courier. I’m a government employee in a highly sensitive area under military jurisdiction. Once I lose my union membership, all bets are off. All I have is you.”\n“That’s quite a lot,” the woman said reprovingly. “You have no idea how much.”\nActually, I do, he thought at her, but if I’m flayed and hung up in a parking garage, I won’t care about the cover story. He shook his head again.\n“If we take you into the fold, we can tell you more about what you’re doing. Don’t you want to know—”\n“No.” It came out louder and more emphatic than he’d intended but he wasn’t sorry. “I don’t. You’ve got me this much. I agreed to cooperate because I don’t need to be in the fold to be an encryption key. I’ll keep the secret but I don’t want to be the secret.”\nThe woman shook her head. “Please. You went over that line a long time ago.”\n“Not quite,” he insisted. “My body, yes. But not me.”\nShe stood up, stretching a little. “We’ll talk again. This government doesn’t give up that easily.”\n“Oh?” He raised his eyebrows. “Which government is that, anyway?”\nThe question caught her off-guard and for a moment she stared at him, open mouthed. Then she threw back her head and laughed. “Oh, very good,” she said, as the man opened the door for her. “Very, very good.” She started to leave, then hesitated. “And that’s really your name: Cody.”\n“Yeah. My name’s really Cody.” Something flickered in his memory again but it was gone before he could think about it. He lay down on the bed and found the remote under one of the pillows.\n“Well, that was fun,” he said, to no one and to whatever bugs might be listening, and turned on the TV. “Now whaddaya wanna do?”\nOriginally published in TRSF: The Best New Science Fiction,\nedited by Stephen Cass.\nPat Cadigan was born in Schenectady, New York, and now lives in London with her family. She made her first professional sale in 1980, and has subsequently come to be regarded as one of the best new writers of her generation. Her story \"Pretty Boy Crossover\" has appeared on several critic's lists as among the best science fiction stories of the 1980's, and her story \"Angel\" was a finalist for the Hugo Award, the Nebula Award, and the World Fantasy Award (one of the few stories ever to earn that rather unusual distinction). Her short fiction--which has appeared in most of the major markets, including Asimov's Science\nFiction and The Magazine of Fantasy & Science Fiction--has been gathered in the collections Patterns and Dirty Work. Her first novel, Mindplayers, was released in 1987 to excellent critical response, and her second novel, Synners, released in 1991, won the Arthur C. Clarke Award as the year's best science-fiction novel, as did her third novel, Fools, making her the only writer ever to win the Clarke Award twice. Her other books include the novels Dervish Is Digital, Tea from an Empty Cup, and Reality Used to Be a Friend of Mine, and, as editor, the anthology The Ultimate Cyberpunk, as well as two making-of movie books and four media tie-in novels.", "source": "https://clarkesworldmagazine.com/cadigan_11_14_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Cody by Pat Cadigan"}