{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Dominica Phetteplace", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "86V6wlTDO35h5mu4AI2RotoU92A=", "id": null, "license": null, "comments": "", "raw_text": "1960 words, short story  We'll Always Have Two Versions of Pteros  1. Lily 1  Everything was going great until Barry announced one morning that he was in the wrong timestream.  “The wrong what?” He seemed sluggish. Disoriented. In need of coffee.  “I’m not supposed to be here.”  The wedding was in three months. There had been multiple disagreements about the dessert platters and the dance numbers. Small fights. Bickering, normal stuff. But there was something off about him today.  “Are you unwell?”  “I’m supposed to be somewhere else.”  “Where?” My therapist said that when I feel myself getting angry, I should try to be as curious as possible.  “On the starship Pteros.”  “But the Pteros is gone. All signs of it. You’re supposed to be dead and in space?”  He was silent. There was genuine pain in his eyes.  “Why . . . do you think you should be on the Pteros?” I asked, even though I knew why. It was survivor’s guilt. He knew many of the crew from Uni. His best friend Byrd had been on that ship.  After graduation, Barry had decided not to become an astronaut after all, but a ground-based aeronautical engineer.  “This is not my life.” And then he walked out the door.  He didn’t even take his briefcase with him.  2. Barry 2  It was Lily, but the wrong one. Perhaps, the other one was wrong too, and all it took was waking up on this side of the asteroid belt to figure that out.  Yesterday, I had been lost in space for more than a year. I thought I wanted to be rescued. It turns out I didn’t, especially not like this.  A simple internet search found that in this timeline/alternate universe/extended delusion, whatever it was, Byrd had gone in my place. Byrd, who could be rough and ineloquent, who was all heart. He was the operations officer. In this timeline, he was presumed dead. But that wasn’t right. We had somehow switched places and Byrd was the one trying to figure out how to get the Pteros back to Earth.  In this timeline/alternate universe/extended delusion, I was alive but felt dead. Yesterday I had been fine, aside from being lost in space. There are worse things than not knowing where you are. Like being certain you are not in the right timeline.  It had been a year since I last saw Lily and I no longer loved her. I needed to get back.  3. Marseille 1  If you put cognac in your coffee, it’s the perfect drink for 5:00 p.m. A little cream and perhaps a baguette. I call it breakfast, especially when paired with billiards. I need an unbothered hour to properly wake up, nine mornings out of ten I won’t even check my phone. It ruins my concentration.  “Marseille, is it you?” Even at a whisper, the voice was too loud. I dropped my cue, adding to the din.  “Who let you in? Wait, is it Barry?”  Barry. I had some genuine affection for him. We had lost touch and I had thought about going to Byrd’s memorial just to reconnect. Late in the day, I decided against.  And now here he was, bursting into my bar in Paris like a man newly released from prison. I was surprised by the strength of his embrace.  “I’m not supposed to be here,” he said.  “No, of course not,” I laughed. Barry had always been so straitlaced, and heterosexual besides that. His eyes were still dark, keen. They possessed the intensity of a man trying to solve a mystery.  “I need to get back.” He explained to me the pain of waking up on the wrong side of one’s timeline. It’s a high-class problem.  “I’m supposed to be on the Pteros.”  “Yes, me too!” I laughed. I had been dismissed from Uni for “ethics violations.” Depending on your definition of cheating, I had cheated on some exams. It was for the best, it allowed me to try out entrepreneurship. With some gambling winnings, I was able to start up Chez Gabriel.  “You’re drunk.”  “Don’t be rude.” I fired up my vape pen, daring him to complain. His puritanism was the thing I least liked about him. I ran a hand through my hair and found it greasy. I hadn’t showered today or yesterday. I kept forgetting to.  “Pteros isn’t gone, just lost. If I can get back on it, I can help it find its way home.”  “Something’s not adding up here.”  “This isn’t who I am. This isn’t my life.”  “What about Lily?”  “We broke up.”  At his best, Barry was curious and soulful. Brave. I understood that if he stayed where he was, however one defined “stayed” and “was,” he would become increasingly small-minded and rule-bound. And I confess, it helped that he was attractive. I had even remembered a brief period of flirtation before the friendship had begun in earnest.  And yes, I missed space too. Of course, I would help him. But I didn’t know how. I invited him to stay the night. He decided to go back to his place.  4. Mario  I wore my human suit clumsily. I thought an Italian accent would make me sound less strange. I was hungry and thirsty all the time, so I manifested a corner café out of space-time fabric. I wanted to spy on Barry, so I put the café on the bottom floor of his building.  He came in disoriented that first morning. I made him a cappuccino.  We’re not really supposed to meddle, but it happens. And you can’t usually go backward and undo what’s done, but sometimes you can.  “I forgot my apartment number,” he said to no one in particular.  So I told him. He didn’t seem at all surprised that I knew.  “I need to get back.” Then he broke down into tears.  So I peeled off my face, just for a second. Just to stop him from crying. Just so he would believe me. And I told him what happened. And then I told him how to make it right.  5. Marseille 2  Barry appeared at my door in the middle of the night.  “I just got back from the wrong timeline.”  And then he kissed me.  I had assumed he had dreamed of me. I asked him after. But he said no, it wasn’t that. He dreamed of another timeline. Only it wasn’t a dream, it had really happened.  “Do you remember Byrd? From Uni?”  “Sort of, not really.” But in the dark silence I thought about it some more. Blue polo shirt. Acoustic guitar. An average, alright guy, if I was thinking of the right person.  “In the other timeline, Byrd took my place on Pteros.”  “So in the other timeline, he’s in my bed?” I laughed at my own joke. Barry didn’t join in, and I felt bad.  “Are you sad to be back here?” I asked. A wormhole accident had put us three hundred lightyears away from home with only fifteen lightyears worth of fuel. We’d probably never make it back, and if we did, everyone we knew back on Earth would be dead.  “The other place . . . It didn’t feel real to me.”  “And this does?”  Instead of answering he kissed me again. The affair lasted four years. The friendship continued even after the sex stopped. It took six years, but we found an alternate fuel source and a shortcut home. We were back within a decade of our departure.  Once we returned to Earth, we were put in quarantine. Barry called his parents first thing and then Lily.  She was joyful. Tearful. Just so happy to hear from him. She had thought he was dead. She had given up hope. Despair had led her to a long chain of decisions. Now she was married to Byrd, who had become an engineer and not an astronaut after Uni. They were expecting their second child.  6. Lily 1  There are aliens everywhere on Earth, but they don’t always identify themselves as such, at least not right away.  My barista wore a name tag that said Mario, though he never answered to that name. He made the most delicious oat milk matcha lattes and drew incredible designs in their foam. Futuristic cityscapes with meteor showers and flying cars. It was only later that I realized he was drawing his home planet.  He congratulated me on my engagement the day after, even though I wore no ring.  “How did you know?” I thought: he’s a stalker, he’s in love with me. My heart raced and I scanned for the exits.  “The accident was my fault.”  “What accident?” I said, backing away.  “The one that brought the wrong Barry to this timeline.”  It had been two years since Barry abruptly walked out of my life. He had disappeared entirely. Enough time had passed that I still thought about what we used to be from time to time. But I had moved on. That’s what normal people did.  “How do I know you’re telling the truth?” I was standing in the doorway of the exit, ready to blow my rape whistle at any minute.  He shrugged.  “I want proof or I’m calling the police.” Barry had made fun of my tendency to turn to law and order in times of conflict, called me a Karen. Further proof we weren’t right for each other. I needed a man who understood that sometimes you have to go to the law. Sometimes there’s no other way.  Mario’s facial features rearranged themselves on his face in the manner of Picasso. Two eyes on one side, where his mouth was supposed to be. Then he righted himself. My cortisol levels were through the roof.  “Are you registered?” My least favorite thing in the world was undocumented aliens.  “I am. I just wanted to apologize about Barry. The whole thing was poorly handled. On my part.”  “Where did he go?”  “Back to his timeline.”  “How?”  “We were running an experiment. Ill-fated. We don’t know where he is, he probably doesn’t exist anymore. We thought if we could bring in another Barry, from another timeline, that could make it better, but it just made it worse.”  “You killed my Barry?” A homicide. I had a feeling this was beyond the purview of the SFPD. FBI? Space Force? I didn’t have those agencies on speed dial, I’d have to look them up.  “Probably. It was an accident.”  “You owe me.”  “I do,” he said.  Yet he never paid up. He disappeared. Space Force investigated my account, but came up with nothing. They seemed to think I was making the whole thing up. Barry’s disappearance was never solved.  The Pteros’ homecoming moved me. I wasn’t ready for it, but seeing the crew disembark brought tears to my eyes.  I went to the post-quarantine parade. Clubbed at the after-parties. When I got home, I saw that I had missed a call from Byrd. I called him right back. He was still up.  “I’m sorry about Barry.” He offered his condolences and I accepted. Later he came over to pay his respects. He didn’t start formally courting me until the next year. Every time something good happened I wondered if Mario had used alien magic to intervene on my behalf. A promotion. A rainbow. My engagement to Byrd. My first pregnancy had been difficult and at one point I shouted at the sky that if my girl came out healthy, we could call ourselves even.  She did. And so we are. I think. I’ll never know for sure, because in addition to all the blessings he may or may not have bestowed, he did me the favor of never showing any of his faces to me again. At least not in this timeline. Dominica Phetteplace writes fiction and poetry. Her work has appeared in Zyzzyva, Asimov's, Analog, F&SF, Lightspeed, Copper Nickel, Ecotone, Wigleaf, The Year's Best Science Fiction and Fantasy, and Best Microfiction 2019. Her honors include a Pushcart Prize, a Rona Jaffe Award, a Barbara Deming Award and fellowships from I-Park, Marble House Project, and the MacDowell Colony. She is a graduate of UC Berkeley and the Clarion West Writers Workshop.", "text": "1960 words, short story\nWe'll Always Have Two Versions of Pteros\n1. Lily 1\nEverything was going great until Barry announced one morning that he was in the wrong timestream.\n“The wrong what?” He seemed sluggish. Disoriented. In need of coffee.\n“I’m not supposed to be here.”\nThe wedding was in three months. There had been multiple disagreements about the dessert platters and the dance numbers. Small fights. Bickering, normal stuff. But there was something off about him today.\n“Are you unwell?”\n“I’m supposed to be somewhere else.”\n“Where?” My therapist said that when I feel myself getting angry, I should try to be as curious as possible.\n“On the starship Pteros.”\n“But the Pteros is gone. All signs of it. You’re supposed to be dead and in space?”\nHe was silent. There was genuine pain in his eyes.\n“Why . . . do you think you should be on the Pteros?” I asked, even though I knew why. It was survivor’s guilt. He knew many of the crew from Uni. His best friend Byrd had been on that ship.\nAfter graduation, Barry had decided not to become an astronaut after all, but a ground-based aeronautical engineer.\n“This is not my life.” And then he walked out the door.\nHe didn’t even take his briefcase with him.\n2. Barry 2\nIt was Lily, but the wrong one. Perhaps, the other one was wrong too, and all it took was waking up on this side of the asteroid belt to figure that out.\nYesterday, I had been lost in space for more than a year. I thought I wanted to be rescued. It turns out I didn’t, especially not like this.\nA simple internet search found that in this timeline/alternate universe/extended delusion, whatever it was, Byrd had gone in my place. Byrd, who could be rough and ineloquent, who was all heart. He was the operations officer. In this timeline, he was presumed dead. But that wasn’t right. We had somehow switched places and Byrd was the one trying to figure out how to get the Pteros back to Earth.\nIn this timeline/alternate universe/extended delusion, I was alive but felt dead. Yesterday I had been fine, aside from being lost in space. There are worse things than not knowing where you are. Like being certain you are not in the right timeline.\nIt had been a year since I last saw Lily and I no longer loved her. I needed to get back.\n3. Marseille 1\nIf you put cognac in your coffee, it’s the perfect drink for 5:00 p.m. A little cream and perhaps a baguette. I call it breakfast, especially when paired with billiards. I need an unbothered hour to properly wake up, nine mornings out of ten I won’t even check my phone. It ruins my concentration.\n“Marseille, is it you?” Even at a whisper, the voice was too loud. I dropped my cue, adding to the din.\n“Who let you in? Wait, is it Barry?”\nBarry. I had some genuine affection for him. We had lost touch and I had thought about going to Byrd’s memorial just to reconnect. Late in the day, I decided against.\nAnd now here he was, bursting into my bar in Paris like a man newly released from prison. I was surprised by the strength of his embrace.\n“I’m not supposed to be here,” he said.\n“No, of course not,” I laughed. Barry had always been so straitlaced, and heterosexual besides that. His eyes were still dark, keen. They possessed the intensity of a man trying to solve a mystery.\n“I need to get back.” He explained to me the pain of waking up on the wrong side of one’s timeline. It’s a high-class problem.\n“I’m supposed to be on the Pteros.”\n“Yes, me too!” I laughed. I had been dismissed from Uni for “ethics violations.” Depending on your definition of cheating, I had cheated on some exams. It was for the best, it allowed me to try out entrepreneurship. With some gambling winnings, I was able to start up Chez Gabriel.\n“You’re drunk.”\n“Don’t be rude.” I fired up my vape pen, daring him to complain. His puritanism was the thing I least liked about him. I ran a hand through my hair and found it greasy. I hadn’t showered today or yesterday. I kept forgetting to.\n“Pteros isn’t gone, just lost. If I can get back on it, I can help it find its way home.”\n“Something’s not adding up here.”\n“This isn’t who I am. This isn’t my life.”\n“What about Lily?”\n“We broke up.”\nAt his best, Barry was curious and soulful. Brave. I understood that if he stayed where he was, however one defined “stayed” and “was,” he would become increasingly small-minded and rule-bound. And I confess, it helped that he was attractive. I had even remembered a brief period of flirtation before the friendship had begun in earnest.\nAnd yes, I missed space too. Of course, I would help him. But I didn’t know how. I invited him to stay the night. He decided to go back to his place.\n4. Mario\nI wore my human suit clumsily. I thought an Italian accent would make me sound less strange. I was hungry and thirsty all the time, so I manifested a corner café out of space-time fabric. I wanted to spy on Barry, so I put the café on the bottom floor of his building.\nHe came in disoriented that first morning. I made him a cappuccino.\nWe’re not really supposed to meddle, but it happens. And you can’t usually go backward and undo what’s done, but sometimes you can.\n“I forgot my apartment number,” he said to no one in particular.\nSo I told him. He didn’t seem at all surprised that I knew.\n“I need to get back.” Then he broke down into tears.\nSo I peeled off my face, just for a second. Just to stop him from crying. Just so he would believe me. And I told him what happened. And then I told him how to make it right.\n5. Marseille 2\nBarry appeared at my door in the middle of the night.\n“I just got back from the wrong timeline.”\nAnd then he kissed me.\nI had assumed he had dreamed of me. I asked him after. But he said no, it wasn’t that. He dreamed of another timeline. Only it wasn’t a dream, it had really happened.\n“Do you remember Byrd? From Uni?”\n“Sort of, not really.” But in the dark silence I thought about it some more. Blue polo shirt. Acoustic guitar. An average, alright guy, if I was thinking of the right person.\n“In the other timeline, Byrd took my place on Pteros.”\n“So in the other timeline, he’s in my bed?” I laughed at my own joke. Barry didn’t join in, and I felt bad.\n“Are you sad to be back here?” I asked. A wormhole accident had put us three hundred lightyears away from home with only fifteen lightyears worth of fuel. We’d probably never make it back, and if we did, everyone we knew back on Earth would be dead.\n“The other place . . . It didn’t feel real to me.”\n“And this does?”\nInstead of answering he kissed me again. The affair lasted four years. The friendship continued even after the sex stopped. It took six years, but we found an alternate fuel source and a shortcut home. We were back within a decade of our departure.\nOnce we returned to Earth, we were put in quarantine. Barry called his parents first thing and then Lily.\nShe was joyful. Tearful. Just so happy to hear from him. She had thought he was dead. She had given up hope. Despair had led her to a long chain of decisions. Now she was married to Byrd, who had become an engineer and not an astronaut after Uni. They were expecting their second child.\n6. Lily 1\nThere are aliens everywhere on Earth, but they don’t always identify themselves as such, at least not right away.\nMy barista wore a name tag that said Mario, though he never answered to that name. He made the most delicious oat milk matcha lattes and drew incredible designs in their foam. Futuristic cityscapes with meteor showers and flying cars. It was only later that I realized he was drawing his home planet.\nHe congratulated me on my engagement the day after, even though I wore no ring.\n“How did you know?” I thought: he’s a stalker, he’s in love with me. My heart raced and I scanned for the exits.\n“The accident was my fault.”\n“What accident?” I said, backing away.\n“The one that brought the wrong Barry to this timeline.”\nIt had been two years since Barry abruptly walked out of my life. He had disappeared entirely. Enough time had passed that I still thought about what we used to be from time to time. But I had moved on. That’s what normal people did.\n“How do I know you’re telling the truth?” I was standing in the doorway of the exit, ready to blow my rape whistle at any minute.\nHe shrugged.\n“I want proof or I’m calling the police.” Barry had made fun of my tendency to turn to law and order in times of conflict, called me a Karen. Further proof we weren’t right for each other. I needed a man who understood that sometimes you have to go to the law. Sometimes there’s no other way.\nMario’s facial features rearranged themselves on his face in the manner of Picasso. Two eyes on one side, where his mouth was supposed to be. Then he righted himself. My cortisol levels were through the roof.\n“Are you registered?” My least favorite thing in the world was undocumented aliens.\n“I am. I just wanted to apologize about Barry. The whole thing was poorly handled. On my part.”\n“Where did he go?”\n“Back to his timeline.”\n“How?”\n“We were running an experiment. Ill-fated. We don’t know where he is, he probably doesn’t exist anymore. We thought if we could bring in another Barry, from another timeline, that could make it better, but it just made it worse.”\n“You killed my Barry?” A homicide. I had a feeling this was beyond the purview of the SFPD. FBI? Space Force? I didn’t have those agencies on speed dial, I’d have to look them up.\n“Probably. It was an accident.”\n“You owe me.”\n“I do,” he said.\nYet he never paid up. He disappeared. Space Force investigated my account, but came up with nothing. They seemed to think I was making the whole thing up. Barry’s disappearance was never solved.\nThe Pteros’ homecoming moved me. I wasn’t ready for it, but seeing the crew disembark brought tears to my eyes.\nI went to the post-quarantine parade. Clubbed at the after-parties. When I got home, I saw that I had missed a call from Byrd. I called him right back. He was still up.\n“I’m sorry about Barry.” He offered his condolences and I accepted. Later he came over to pay his respects. He didn’t start formally courting me until the next year. Every time something good happened I wondered if Mario had used alien magic to intervene on my behalf. A promotion. A rainbow. My engagement to Byrd. My first pregnancy had been difficult and at one point I shouted at the sky that if my girl came out healthy, we could call ourselves even.\nShe did. And so we are. I think. I’ll never know for sure, because in addition to all the blessings he may or may not have bestowed, he did me the favor of never showing any of his faces to me again. At least not in this timeline.\nDominica Phetteplace writes fiction and poetry. Her work has appeared in Zyzzyva, Asimov's, Analog, F&SF, Lightspeed, Copper Nickel, Ecotone, Wigleaf, The Year's Best Science Fiction and Fantasy, and Best Microfiction 2019. Her honors include a Pushcart Prize, a Rona Jaffe Award, a Barbara Deming Award and fellowships from I-Park, Marble House Project, and the MacDowell Colony. She is a graduate of UC Berkeley and the Clarion West Writers Workshop.", "source": "https://clarkesworldmagazine.com/phetteplace_02_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: We'll Always Have Two Versions of Pteros by Dominica Phetteplace"}