{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tomas Furby", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "yENmTsWgJ4e/SWjN3WDvJU5EhoY=", "id": null, "license": null, "comments": "", "raw_text": "4430 words, short story  The Scrapyard  Scrapyard’s lookin’ a little empty today. Stomp over to Matron sat on her throne and ask where Tommy is. Tommy’s dead, she says. Passed away in his sleep in the early hours. Terrible sorry.  She don’t sound all that sorry. The mech whines as I hop over to my spot at the chessboard. Needs a service. Oil’s dry and joints crunch rust. One sheered bolt away from fallin’ apart. Just like us derelicts. Outside the wind moves a squad of dry, crusty leaves round the yard. Storm’s howlin’ orders like a CO sweatin’ out last night’s drunk. My tinnitus starts playin’ up again, like distant laser-fire. Slap my ear a few times like that’ll help. Probably just look nuts. Ear defenders weren’t top of the QMC’s priorities back in the day. More concerned with guns and ammo I guess. Annoyin’ as hell though. The ringin’ and ringin’ and ringin’.  I fiddle with the queen and stare at my reflection in a cracked windowpane. When’d we get so goddamn gray? Deep crags crisscross my face like those dusty red canyons we used to fight in. Which ones are scars, which ones wrinkles? I can’t tell anymore. Can’t remember. There’s bags under my eyes like I’ve been on an all nighter with the rookies. Silver stubble scattered across saggin’ cheeks. Liver spots showin’ through thin wisps of hair. FUBAR. What happened to us? Well shit, guess we got old.  Tommy was one of the good ones. Ninth Battalion. Best of the best. We went way back, him and me. All the way to the beginnin’ I guess. Had the misfortune to be drinkin’ in the same dive bar in Brooklyn when the scrips came. Bagged and tagged us, threw us on a dropship, straight to boot camp in Boston. I was just a mechanic. Tommy was a gambler. His pa was somethin’ big in DC. Shouted that a lot on the ride over. Didn’t matter. Sarge put us both on our asses when we tried to leave. Conscription Act says you’re in the marines now kids. Get used to it. Only way you’re leavin’ is in a squad or a body bag. Makes me laugh now. Squad or a body bag. What a joker.  Our first mission was down south, Louisiana. Screevs had a hive in New Orleans. City’d been dead since the start of the war. It was a meat grinder. Total Charlie Foxtrot. Crawlin’ with the slimy bastards. You could see ’em from the dropship. Squirmin’ skitterin’ writhin’ mass. Like the ruins were alive. CO told us to take it back. Nothin’ else. Just take it back. The whole city, from the alien scourge. Ten kids greener than grass, barely knew one end of a rifle from the other. All newly strapped into these prototype armor suits. The original mech model, the ones that didn’t work quite right. Before they realized you had to weld the steel to bone and wire the computers in under the skin.  It was a Hail Mary strike. Command knew we were losin’ the war. They were desperate. Fate of humanity in their hands. We were just a gamble. Ten chips on double zero. Didn’t figure that out ’til later though. Remember jumpin’ out the ’copter deep behind enemy lines. Shakin’ so hard we rattled. Sure we were goin’ to win the war. There was this weird quiet moment hunkered down in an abandoned mall, rifles pointed at the exits, waitin’ for the bugs. We could hear ’em. The skitterin’ in the distance, gettin’ closer, louder. We all looked at each other and knew we were done. Then one of the boys, Red, said he needed a crap. The brains hadn’t figured that into the design. Guess I’m fightin’ with full pants, he said. We all laughed. F.t.a. was the last thing Red ever said. F.t.a.  By the time me and Tommy got outta the Big Easy, we needed new suits and one helluva bath. Shook up as hell, missin’ one or two limbs and more than a few friends. We failed our mission, but we took a slice out of the Screevs. Managed to blow the Waterford plant on the way out. Top brass weren’t exactly happy that we nuked half the state, but it did the job.  I barely listened to the debrief. All I could hear was Red sayin’ F.t.a. over and again. I wanted a burger. I wanted to sleep for a week. I never wanted to fight again. And Tommy, well, Tommy was the only mad kid still smilin’.  He always smiled. Even when the CO whipped him for drinkin’ on duty. Even when we were mustered out halfway through trainin’ in second year. Even when we stood on that frontline, starin’ down the throats of those crimson Screever caves, thinkin’ just maybe we were cannon fodder for bugs. Yeah, we went way back. Battle of Thursday Mine. Sackin’ of the Breeding Pits. The Final Battle. Tommy was a legend. Good chess player too. He smiled through every injury, every death, every bit of pain.  I asked him once, I said Tommy, how come you’re always smilin’. Kid just shrugged, smiled and said he liked to show the world his best face. Maybe one day, he said, the world’ll show me hers.  I miss him. I miss my friend.  Rust flakes off my bracer as I rub at it. Dust under fingertips. Reminds me of the mines. Grit got everywhere. Stained skin rust red. Blinded some. Woke up with your mouth so dry even lickin’ cave water seemed mighty fine. When we finally climbed out of hell some rookie at the front thought we were hostiles, shot us down. We’re good, but we ain’t invincible. Bullet pinged off Tommy’s mech and punched out the back of Critter’s skull. Poor Critter. Survived the Screevs and ate lead off some fresh meat’s itchy trigger finger. No KIA on his record. Just friendly fire. What a way to go.  Course we made sure that rookie never worked again: me, Tommy, and Earl. No one gets away with killin’ a marine. Got the guy drunk one night, took him round the back of the mess hall, broke both arms and legs.  Earl’s lights out in front of the TV this mornin’. Little bubble of drool blowin’ in one corner of his mouth. It’s ten thirty: first drugs of the day then. He hits the dope hard most days now. Saw things down in the deep he couldn’t unsee. Me too I guess, but some people get stuck on the—bloodsplatterfleshgrindcacklingredeyes—gory details. Poor Earl. Always talkin’ bout his missus on the long treks down tunnel into dark. He used to stroke his rifle like it was her, whisper sweet nothings to it, kiss it when we weren’t lookin’.  Yeah, in retrospect we should’ve known he was cracked.  His old lady dumped him here ten years ago. The Scrapyard: halfway between retirement home and weapons depot. Took the rest of us a little while to catch up, but we all ended up here eventually. Heroes of the Dawn. Best of the best, pride of the world, the tank soldiers. Superhumans, pumped full of the finest steroids and gene therapy money could buy and fused to ten tons of military exoskeleton. And look at us now.  I remember the suits sayin’ it was the only way to beat the Screevs. They had better reflexes than us, stronger bodies, carapace armor. They were better, faster, stronger, and they were winnin’ the war. It was a necessity, they said. And we didn’t argue. We were good soldiers. Good weapons. So we held still as they slid the needles in. Grinned red teeth at the bone saws and wires as they carved into us. Screamed our anger as they took us apart and put us back together.  And when the docs were done, we got back in the saddle and we killed Screevs. From one end of the States to the other. We scoured the invadin’ burrowin’ bastards from our cities, then we followed ’em down the holes they made in our Earth.  Gloria hops out onto the lawn, scatterin’ seed across the grass. A few o’ those damned black birds skitter down from the spider trees to peck at it. They sound like Screevs to me. Shadows lurk beneath the branches but I ignore ’em. Now’s not the time for that. Gloria flips her hair over one shoulder. Rub at my jaw to hide the smile. Our own Snow White. Giant of a woman, raven mane hidin’ that empty eye socket, clawscars down her face, hoppin’ round on that one leg her mech’s still got. Birds like her: land on her armor, all cawin’ for the grain in her hand. Smiles that crooked broken smile of hers and scatters the rest to the lawn. They take flight. She sings their song, flappin’ her huge metal arms. Pistons hiss with the wind. A ripped wire flails around behind her wildly. Still beautiful, even with white streaks through the black. Shame she always batted for the other team.  Gloria wasn’t our squadron. She was recon. The advance team sent down to map the Screevs’ tunnels and bring back intelligence for the final assault. Went down with a team of five. Only one to make it back, minus the leg and eye. Said it was a cheap price for the maps. Can’t help but agree. She won us the war. Day after she made it back, crawlin’ out of a sewer down near Manhattan, my squad was one of hundreds they mustered out. Thousands of mechs all down the rabbit hole in one coordinated attack to finally burn the Screevs out. We cauterized the putrid wound the aliens made in our Earth and pissed in the smokin’ hole that was left.  There are no more Screevs.  And just like that, the threat was gone. World was at peace. We won. And now we’re old. And unneeded. And the government won’t pay to fix the mechs anymore. So they put us here, where the only damage we can do is to ourselves. I’m too damn old to be angry ’bout it anymore. I’m just disappointed.  Dave’s doin’ pull-ups in the corner. Sounds like someone droppin’ a shippin’ container on a small dog over and over again. He grumbles gravel under boots down the long dark tunnel as he counts. Pretty sure he’s lyin’ ’bout the number. Even with the mech I can only hit fifty these days, and that’s with more than my fair share of arthritic pain. We’re the Hellraisers. Heroes of Earth. Defenders of Humanity. Scourge of the Screevs. We won the Deep Wars. Saved the world. But we’re still old. Still dyin’, decayin’. Just doin’ it quietly under steel armor, pistons, and wires. Everythin’ hurts, all the time. Where they melded bone and steel, flesh cankers and rots, rejectin’ implants. Arthritis spiders over joints tired from holdin’ up more weight than they were designed to. Electrics have glitched and sparked, makin’ us twitch and shiver. Enhanced optics are still good I guess—they straight replaced the pupils on most of us, so at least we don’t have to worry about cataracts. Silver linin’ to every cloud and all.  Naw, ain’t my body that’s the problem. Somethin’ skitters at the corner of my vision. Screev. Sure it was. I glance round slowly. Don’t wanna spook it. Earl watches me. Only shadows in the corner and a flicker of television light. I shake my head. Problem is, I’m reckonin’ Earl ain’t the only one losin’ it. He grins and bobs his head like he knows what I’m thinkin’. I give him the finger. He slowly, shakily, gives it back.  Last night was real bad. Docs had to restrain me again. Nightmares. We all have ’em. PTSD ain’t nothin’ to be shamed ’bout. We’re all vets here, and all vets dream about the dark. Deep Wars were bad. Made schleppin’ through the trenches in the old World Wars look like Hanukkah. Eatin’, sleepin’, shittin’ in the dark, never sure when the Screevs were gonna burrow up from under you. Twisted little monsters bent on eatin’ your eyeballs poppin’ up round every corner, all teeth and spikes and crimson glowin’ eyes. Naw, PTSD ain’t a problem on its own. But a human tank with PTSD havin’ a nightmare so real they want to kill it . . . Well now, that’s a problem.  I must’ve been here three days before the brains figured to build reinforced steel cages round the beds with magnetic clamps for wrists and ankles. Works most nights. Sometimes it doesn’t. Last night was one of those nights. I broke one arm free and splashed one of the orderlies. Kevin. Nice guy, sympathetic-like, always treated us with respect. He had a kid, showed me a holo. Jenny, he said. My angel. Was probably tryin’ to wake me. There’s a red stain on my wall where I introduced it to his face. Woke up with his neck in my hand. Terrible sorry.  Other side of the Scrapyard one of the fancy doctor types is pacin’ up and down. He’s on the phone. Looks real mad. Probably callin’ Command. Probably suggestin’, forcefully, that I’m decommissioned. Too dangerous, they’ll say. Alzheimer’s, they’ll say. Only a matter of time, they’ll say. Hope my boy’s still got the spine to stand up to ’em. Even if he hasn’t, I still got friends in high places. Still some got a bit of gratitude in ’em for all we did back in the day. I’m not done yet. No sir.  But I am kinda sleepy. Mech sounds like coverin’ fire as I heave my ancient ass out of the chair. Pops and crackles and the occasional minor explosion. Hopefully nothin’ vital. I shuffle on over to the comfy chairs—gel couches specially designed to take our weight. Sink into one with a groan and lean back. The footrest rises with a hydraulic hiss. Remember sittin’ in that tunnel just before the final push, hunkered down back-to-back with Tommy cleanin’ rifles. Remember swearin’ blind that if we won the war we’d get ourselves one of these goddamn chairs. Remember sayin’ all the death and dyin’ might be worth it for a decent night’s kip.  They ain’t all that . . .  Hisses in the dark.  Damn nice to wake up and not have a corpse in your hand. Even if you’re covered in sweat-slick steel and shakin’ bolts. You never thought about it down in the dark, not bein’ able to feel your own skin. It was a good thing. Wounds didn’t hurt anymore. No goin’ into shock for these marines. But over the years it’s bugged me more and more. There’s only one patch of skin, round my eyes, that still feels anythin’. I stroke it now, for comfort.  I glance out the window. There’s things movin’ under those trees again. Things I almost recognize from the worst days of the war. Stealth units, vat grown down in the darkest pits. Ninjas, we called ’em. A kind of Screev: black skin, black eyes, black claws. Silent, fluid, and completely fuckin’ invisible. You had to know where to look for ’em, what they smelled like, and even then they usually got you. Lucky there weren’t many. Phosphorus grenades. That was the thing. Wonder whether I’ve got any left in the old stash.  “Dad?”  Oh shit. Alec. They called Alec.  “Sonny boy!” I tap the button that raises the chair back up. It fizzles. Damned thing. Try to sit up on my own but the mech’s frozen on one side and my abs . . . Well, show me any ninety year old with abs. Even gene therapy and steroids only goes so far. Try again, swear, try again. Finally, flappin’ around like some kinda overturned bug, I rock to my feet. Alec stood, suited and booted, watchin’ me cough and splutter and heave as I lean on my knees.  “What?” I snap. “Never seen an old man before, dickhead?”  Alec just crosses his arms. Rookie doesn’t even know he’s born. World’s been at peace since before he was just a twinkle in my eye. Screevs are only a story to him. Used to love my stories. Used to think I was a hero. Now he’s a suit in a world that’s moved on. Somethin’ big in corporate. And I’m a daily goddamn embarrassment to him.  Public opinion’s a bitch. Once we were the saviors of Earth from the alien scourge. Now we’re war criminals, mass murderers, abominations. Protesters surround the Scrapyard holdin’ cute little white placards sayin’ “Thou shalt not kill,” “Screevs are friends,” and “Death to mechs.” I asked the docs for some live ammo so we could take potshots at ’em. They didn’t seem mighty amused by the concept. My shoulder aches where an alien chewed chunks out of it back in the ’02. Ungrateful bastards, all of ’em. Most of ’em never seen a bug. Wish I could introduce ’em to one. They’d change their tune quick enough.  There’s a glint in Alec’s eye I know too well. I love him, but he’s no marine. Not even close. Boy doesn’t understand and he’s too caught up in his stocks and swimmin’ pools to try. Been years since we were close. He always had my back as a kid. I was his hero father. That was real nice. But then a little less and a little less as the wave of public opinion turned. And now . . . Now I guess he’s here to decommission me.  “You killed a man.”  I sigh and the sigh turns into a hackin’ cough that says this old bucket of bolts spent too many years down a mine filled with toxic dust and chemical weapons. Rust taste of blood on my lips. Maybe a tumor’ll take me down before the docs can. That there might be the definition of irony. When I can breathe again I grin red teeth at Alec.  “I’ve killed lots of men, kid. Perks of the job.”  Alec’s chin wobbles. He probably thinks that twist of his lips is a casual sneer. To me he just looks like a ten year old scared to box with his old man cause he doesn’t want a punch on the jaw. I’m disappointed in my son. I examine that for a moment. Yes. I’m disappointed in him. What I could do if I was his age again, with everythin’ he’s got. Goddamn, guess the old are always jealous of the young. Alex shifts his weight and a lifetime of close scrapes makes me tense under my metal shell.  “Dad. You’re not well.” Tryin’ a different tack then. SSDD. We’ve had this conversation a few times over the years. Most of the mechs took voluntary decommissionin’ years ago, or were forced to when their rigs got real bad. Heroes who saved a planet, put down like dogs gone rabid. I will not go quietly into the night. ’Sides—my eyes flick to the side, out the window, under the trees where the ninjas lurk—I reckon they’ll need me again soon enough.  “Can it, bolo. I’m fine. See that?” I point over at Earl. “That’s not fuckin’ well. Don’t see anyone DCin’ him, do ya?” I take a step forward and he flinches. He flinches. Stop like that flinch was a ten-ton tank and there’s ammo comin’ down the barrel.  He’s scared of me.  Damn.  What would Dela think? Nothin’ good. I can almost see her lookin’ up at me with those doe eyes and sad mouth. How the hell did we come to this?  Slowly, palms out so the gray flesh shows not the steel knuckles, I reach out.  “I’m sorry, kid. You’re right. Maybe I am gettin’ old.” He lets me lay a hand soft-like on his shoulder, but he doesn’t meet my eye. Somethin’ flickers out in the dark again but I ignore it. Now’s not the time to puzzle out reality from dead neurons . . .  “How ’bout I see that shrink you’ve been bangin’ on about?” An olive branch. Please let him take it.  Alec glances over his shoulder at the Doc, who slowly shakes his head. Y’know that hurts more than ever. Thought I dragged him up right, even after his ma passed. Thought he was strong enough to make his own decisions, to back his family over all else. Seems I thought wrong.  “Too late for that, da.” Alec steps back. “You’re not safe anymore.” He frowns. “It’s too late,” he repeats, and turns to walk away. I’m already dead to him, then. Guess it ain’t so different from me and my pa. I’d done my ten, got my papers. Could’ve discharged honorably. But they offered me the new mech. A chance to fight the last fight. I signed up for the next tour. Left him alone and wasn’t there when the Screevs burrowed right up under him. He was old, weak, a nuisance, and a distraction. Remember lookin’ over my shoulder as I walked up into the transport. Little old man with dandelion hair flappin’ in the wind and cane clenched in both hands. He was so proud of me. Never complained. Never killed anyone in his sleep . . . Remember the CO givin’ us the news. New York sinkholed. Nothin’ left. No survivors. I should’ve been there.  Guess we all kill our dads in the end.  I go away for a while. It’s been happenin’ a bit lately. Any time things get too much. A skip in time, like someone cut the footage. Then you’re back and people have moved or the light’s changed. I was worried about it at first, but you get used to it.  “When?” I ask. Alec doesn’t answer cause he’s long gone but the Doc does.  “Tomorrow morning, seven-thirty.”  I nod, turn, glance at the clock.  18 hours then. 18 hours to figure out if I’m really mad, dyin’, startin’ that long slow slide into not bein’ me anymore. Or 18 hours to prove that war’s comin’. Again.  I stomp out to the garden. It’s gettin’ darker. Clouds comin’ in. Trees thrashin’ in the wind. Storm’s comin’. Would’ve been nice to see one more sunset. Life doesn’t always work out that way though. Wish I could say goodbye to Alec. Maybe he’ll be there tomorrow. Doubt it though. Things I should’ve said. Things I should’ve done. No time now. Guess this old man’ll just have to live with his regrets. For a little while longer at least.  Time to get to work. Optics boot up a little glitchy, dead pixels skitterin’ cross my eyes, but the HUD still just about works. It’s been a while. Tracking roams through the trees, searchin’ out any sign of life. It snags a few things—rodents mostly—nothin’ useful. Tech never was much good against ninjas. Cold blood. Radiation resistant skin. Some sort of pigment that reflects the light, like a goddamn chameleon. I stare into the shadows like the little bastards are just gonna jump out and tap dance for me. I am not losin’ it. I know I’m not. Know it deep down like I know my own name. I still know my own name. One of the orderlies yells down that dinner’s ready. I ignore him. Don’t eat much these days. And I ain’t got time for indigestion today. I’ve got to find ’em. These Screevs I’ve been seein’. I’ve got to prove they’re real. That the world still needs me to save it.  Unless it’s all a hallucination. Maybe I’m relivin’ the glory days. Maybe this is the top of that long slope down into the dark and there ain’t no comin’ back. Jesus, what a mindfuck.  But what then? Sit here, quiverin’, ’til they DC me in the mornin’. Could try tellin’ the docs. Could try callin’ a few old friends who still work for the Pentagon. Could end my days as a cracked old man shoutin’ conspiracy theories while they all laugh.  Alec’s right. It’s probably all in my head. I’m done. Should just go quietly, get ready for the docs to pull the plug. Top minds in the business spent the whole war searchin’ for the ninjas; they never managed it. Too much noise down in the tunnels, they said. Made ’em pretty much invisible to all sensors, and satellites were no use . . .  But we’re not down in the tunnels, are we. There’s no background rads and thick layers of mineral obscurin’ line of sight. And satellites . . . Well shit, maybe this old dog’s still got a few tricks left up his rusty steel sleeves. I open up my HIVE connection. Been a while, but I still got a few insurance policies littered round the ’net. Back doors no one ever closed. Retro channels that the babies in the Pentagon probably never even knew existed. Takes me all of ten minutes to hack into the Space Agency’s satellite network and reposition three of ’em over my location. Numbers scrawl behind my eyes as some clever bastard in an office somewhere in Washington starts tryin’ to boot me out. I ignore ’em. Don’t need it long. Just tune to infrared and radar, point as many eyes as possible at this area and search for . . .  Voi-fuckin’-la as the frogs say. Blackspots. I’ve got blackspots. A negative result, just as good as a positive . . . Fifteen targets pop up. Holes in the forest. They don’t move, like they know I’m watchin’ but ain’t sure what to do next. They’re there though. They’re goddamn there.  The Screevs are back.  Satellites boot me out, but the mech’s got the code now. The AI knows how to track ’em. And if the mech can track ’em, they’re real. If they’re real, I’m not cracked. And if I’m not cracked, ain’t no way in hell I’m goin’ quietly. I got unfinished business to attend to. I glance back at Gloria, still feedin’ the birds. Think we all got some scores to settle.  To hell with Alec. To hell with the docs. To hell with my old, broken body. I wave at Gloria and sign out a debrief in the rec room in five. Durin’ the war I was one of an army of supersoldiers. The first, sure, but still one in thousands. We fought the bloodiest war in history against an enemy we didn’t understand and couldn’t stop. Now there’s just me, Dave, Gloria. Just the three of us—four if we can get Earl out of his valium coma long enough. Four old soldiers against a returnin’ evil. I grin.  It’s time to get the band back together. Tomas Furby is a writer of odd fictions, strange stories, and weird worlds (including this one). His work has appeared in publications by Pill Hill Press, Static Movement, Short-Story.Me, Gold Dust, Aurora Wolf, and the British Fantasy Society. In 2018, he was the winner of the Exeter Writers Short Story Competition, and was long-listed for both the James White Award and Bedford International Writing Competition. He lives in the south west of England surrounded by books and scifi paraphernalia. You can find him on Twitter at @TomasFurby.", "text": "4430 words, short story\nThe Scrapyard\nScrapyard’s lookin’ a little empty today. Stomp over to Matron sat on her throne and ask where Tommy is. Tommy’s dead, she says. Passed away in his sleep in the early hours. Terrible sorry.\nShe don’t sound all that sorry. The mech whines as I hop over to my spot at the chessboard. Needs a service. Oil’s dry and joints crunch rust. One sheered bolt away from fallin’ apart. Just like us derelicts. Outside the wind moves a squad of dry, crusty leaves round the yard. Storm’s howlin’ orders like a CO sweatin’ out last night’s drunk. My tinnitus starts playin’ up again, like distant laser-fire. Slap my ear a few times like that’ll help. Probably just look nuts. Ear defenders weren’t top of the QMC’s priorities back in the day. More concerned with guns and ammo I guess. Annoyin’ as hell though. The ringin’ and ringin’ and ringin’.\nI fiddle with the queen and stare at my reflection in a cracked windowpane. When’d we get so goddamn gray? Deep crags crisscross my face like those dusty red canyons we used to fight in. Which ones are scars, which ones wrinkles? I can’t tell anymore. Can’t remember. There’s bags under my eyes like I’ve been on an all nighter with the rookies. Silver stubble scattered across saggin’ cheeks. Liver spots showin’ through thin wisps of hair. FUBAR. What happened to us? Well shit, guess we got old.\nTommy was one of the good ones. Ninth Battalion. Best of the best. We went way back, him and me. All the way to the beginnin’ I guess. Had the misfortune to be drinkin’ in the same dive bar in Brooklyn when the scrips came. Bagged and tagged us, threw us on a dropship, straight to boot camp in Boston. I was just a mechanic. Tommy was a gambler. His pa was somethin’ big in DC. Shouted that a lot on the ride over. Didn’t matter. Sarge put us both on our asses when we tried to leave. Conscription Act says you’re in the marines now kids. Get used to it. Only way you’re leavin’ is in a squad or a body bag. Makes me laugh now. Squad or a body bag. What a joker.\nOur first mission was down south, Louisiana. Screevs had a hive in New Orleans. City’d been dead since the start of the war. It was a meat grinder. Total Charlie Foxtrot. Crawlin’ with the slimy bastards. You could see ’em from the dropship. Squirmin’ skitterin’ writhin’ mass. Like the ruins were alive. CO told us to take it back. Nothin’ else. Just take it back. The whole city, from the alien scourge. Ten kids greener than grass, barely knew one end of a rifle from the other. All newly strapped into these prototype armor suits. The original mech model, the ones that didn’t work quite right. Before they realized you had to weld the steel to bone and wire the computers in under the skin.\nIt was a Hail Mary strike. Command knew we were losin’ the war. They were desperate. Fate of humanity in their hands. We were just a gamble. Ten chips on double zero. Didn’t figure that out ’til later though. Remember jumpin’ out the ’copter deep behind enemy lines. Shakin’ so hard we rattled. Sure we were goin’ to win the war. There was this weird quiet moment hunkered down in an abandoned mall, rifles pointed at the exits, waitin’ for the bugs. We could hear ’em. The skitterin’ in the distance, gettin’ closer, louder. We all looked at each other and knew we were done. Then one of the boys, Red, said he needed a crap. The brains hadn’t figured that into the design. Guess I’m fightin’ with full pants, he said. We all laughed. F.t.a. was the last thing Red ever said. F.t.a.\nBy the time me and Tommy got outta the Big Easy, we needed new suits and one helluva bath. Shook up as hell, missin’ one or two limbs and more than a few friends. We failed our mission, but we took a slice out of the Screevs. Managed to blow the Waterford plant on the way out. Top brass weren’t exactly happy that we nuked half the state, but it did the job.\nI barely listened to the debrief. All I could hear was Red sayin’ F.t.a. over and again. I wanted a burger. I wanted to sleep for a week. I never wanted to fight again. And Tommy, well, Tommy was the only mad kid still smilin’.\nHe always smiled. Even when the CO whipped him for drinkin’ on duty. Even when we were mustered out halfway through trainin’ in second year. Even when we stood on that frontline, starin’ down the throats of those crimson Screever caves, thinkin’ just maybe we were cannon fodder for bugs. Yeah, we went way back. Battle of Thursday Mine. Sackin’ of the Breeding Pits. The Final Battle. Tommy was a legend. Good chess player too. He smiled through every injury, every death, every bit of pain.\nI asked him once, I said Tommy, how come you’re always smilin’. Kid just shrugged, smiled and said he liked to show the world his best face. Maybe one day, he said, the world’ll show me hers.\nI miss him. I miss my friend.\nRust flakes off my bracer as I rub at it. Dust under fingertips. Reminds me of the mines. Grit got everywhere. Stained skin rust red. Blinded some. Woke up with your mouth so dry even lickin’ cave water seemed mighty fine. When we finally climbed out of hell some rookie at the front thought we were hostiles, shot us down. We’re good, but we ain’t invincible. Bullet pinged off Tommy’s mech and punched out the back of Critter’s skull. Poor Critter. Survived the Screevs and ate lead off some fresh meat’s itchy trigger finger. No KIA on his record. Just friendly fire. What a way to go.\nCourse we made sure that rookie never worked again: me, Tommy, and Earl. No one gets away with killin’ a marine. Got the guy drunk one night, took him round the back of the mess hall, broke both arms and legs.\nEarl’s lights out in front of the TV this mornin’. Little bubble of drool blowin’ in one corner of his mouth. It’s ten thirty: first drugs of the day then. He hits the dope hard most days now. Saw things down in the deep he couldn’t unsee. Me too I guess, but some people get stuck on the—bloodsplatterfleshgrindcacklingredeyes—gory details. Poor Earl. Always talkin’ bout his missus on the long treks down tunnel into dark. He used to stroke his rifle like it was her, whisper sweet nothings to it, kiss it when we weren’t lookin’.\nYeah, in retrospect we should’ve known he was cracked.\nHis old lady dumped him here ten years ago. The Scrapyard: halfway between retirement home and weapons depot. Took the rest of us a little while to catch up, but we all ended up here eventually. Heroes of the Dawn. Best of the best, pride of the world, the tank soldiers. Superhumans, pumped full of the finest steroids and gene therapy money could buy and fused to ten tons of military exoskeleton. And look at us now.\nI remember the suits sayin’ it was the only way to beat the Screevs. They had better reflexes than us, stronger bodies, carapace armor. They were better, faster, stronger, and they were winnin’ the war. It was a necessity, they said. And we didn’t argue. We were good soldiers. Good weapons. So we held still as they slid the needles in. Grinned red teeth at the bone saws and wires as they carved into us. Screamed our anger as they took us apart and put us back together.\nAnd when the docs were done, we got back in the saddle and we killed Screevs. From one end of the States to the other. We scoured the invadin’ burrowin’ bastards from our cities, then we followed ’em down the holes they made in our Earth.\nGloria hops out onto the lawn, scatterin’ seed across the grass. A few o’ those damned black birds skitter down from the spider trees to peck at it. They sound like Screevs to me. Shadows lurk beneath the branches but I ignore ’em. Now’s not the time for that. Gloria flips her hair over one shoulder. Rub at my jaw to hide the smile. Our own Snow White. Giant of a woman, raven mane hidin’ that empty eye socket, clawscars down her face, hoppin’ round on that one leg her mech’s still got. Birds like her: land on her armor, all cawin’ for the grain in her hand. Smiles that crooked broken smile of hers and scatters the rest to the lawn. They take flight. She sings their song, flappin’ her huge metal arms. Pistons hiss with the wind. A ripped wire flails around behind her wildly. Still beautiful, even with white streaks through the black. Shame she always batted for the other team.\nGloria wasn’t our squadron. She was recon. The advance team sent down to map the Screevs’ tunnels and bring back intelligence for the final assault. Went down with a team of five. Only one to make it back, minus the leg and eye. Said it was a cheap price for the maps. Can’t help but agree. She won us the war. Day after she made it back, crawlin’ out of a sewer down near Manhattan, my squad was one of hundreds they mustered out. Thousands of mechs all down the rabbit hole in one coordinated attack to finally burn the Screevs out. We cauterized the putrid wound the aliens made in our Earth and pissed in the smokin’ hole that was left.\nThere are no more Screevs.\nAnd just like that, the threat was gone. World was at peace. We won. And now we’re old. And unneeded. And the government won’t pay to fix the mechs anymore. So they put us here, where the only damage we can do is to ourselves. I’m too damn old to be angry ’bout it anymore. I’m just disappointed.\nDave’s doin’ pull-ups in the corner. Sounds like someone droppin’ a shippin’ container on a small dog over and over again. He grumbles gravel under boots down the long dark tunnel as he counts. Pretty sure he’s lyin’ ’bout the number. Even with the mech I can only hit fifty these days, and that’s with more than my fair share of arthritic pain. We’re the Hellraisers. Heroes of Earth. Defenders of Humanity. Scourge of the Screevs. We won the Deep Wars. Saved the world. But we’re still old. Still dyin’, decayin’. Just doin’ it quietly under steel armor, pistons, and wires. Everythin’ hurts, all the time. Where they melded bone and steel, flesh cankers and rots, rejectin’ implants. Arthritis spiders over joints tired from holdin’ up more weight than they were designed to. Electrics have glitched and sparked, makin’ us twitch and shiver. Enhanced optics are still good I guess—they straight replaced the pupils on most of us, so at least we don’t have to worry about cataracts. Silver linin’ to every cloud and all.\nNaw, ain’t my body that’s the problem. Somethin’ skitters at the corner of my vision. Screev. Sure it was. I glance round slowly. Don’t wanna spook it. Earl watches me. Only shadows in the corner and a flicker of television light. I shake my head. Problem is, I’m reckonin’ Earl ain’t the only one losin’ it. He grins and bobs his head like he knows what I’m thinkin’. I give him the finger. He slowly, shakily, gives it back.\nLast night was real bad. Docs had to restrain me again. Nightmares. We all have ’em. PTSD ain’t nothin’ to be shamed ’bout. We’re all vets here, and all vets dream about the dark. Deep Wars were bad. Made schleppin’ through the trenches in the old World Wars look like Hanukkah. Eatin’, sleepin’, shittin’ in the dark, never sure when the Screevs were gonna burrow up from under you. Twisted little monsters bent on eatin’ your eyeballs poppin’ up round every corner, all teeth and spikes and crimson glowin’ eyes. Naw, PTSD ain’t a problem on its own. But a human tank with PTSD havin’ a nightmare so real they want to kill it . . . Well now, that’s a problem.\nI must’ve been here three days before the brains figured to build reinforced steel cages round the beds with magnetic clamps for wrists and ankles. Works most nights. Sometimes it doesn’t. Last night was one of those nights. I broke one arm free and splashed one of the orderlies. Kevin. Nice guy, sympathetic-like, always treated us with respect. He had a kid, showed me a holo. Jenny, he said. My angel. Was probably tryin’ to wake me. There’s a red stain on my wall where I introduced it to his face. Woke up with his neck in my hand. Terrible sorry.\nOther side of the Scrapyard one of the fancy doctor types is pacin’ up and down. He’s on the phone. Looks real mad. Probably callin’ Command. Probably suggestin’, forcefully, that I’m decommissioned. Too dangerous, they’ll say. Alzheimer’s, they’ll say. Only a matter of time, they’ll say. Hope my boy’s still got the spine to stand up to ’em. Even if he hasn’t, I still got friends in high places. Still some got a bit of gratitude in ’em for all we did back in the day. I’m not done yet. No sir.\nBut I am kinda sleepy. Mech sounds like coverin’ fire as I heave my ancient ass out of the chair. Pops and crackles and the occasional minor explosion. Hopefully nothin’ vital. I shuffle on over to the comfy chairs—gel couches specially designed to take our weight. Sink into one with a groan and lean back. The footrest rises with a hydraulic hiss. Remember sittin’ in that tunnel just before the final push, hunkered down back-to-back with Tommy cleanin’ rifles. Remember swearin’ blind that if we won the war we’d get ourselves one of these goddamn chairs. Remember sayin’ all the death and dyin’ might be worth it for a decent night’s kip.\nThey ain’t all that . . .\nHisses in the dark.\nDamn nice to wake up and not have a corpse in your hand. Even if you’re covered in sweat-slick steel and shakin’ bolts. You never thought about it down in the dark, not bein’ able to feel your own skin. It was a good thing. Wounds didn’t hurt anymore. No goin’ into shock for these marines. But over the years it’s bugged me more and more. There’s only one patch of skin, round my eyes, that still feels anythin’. I stroke it now, for comfort.\nI glance out the window. There’s things movin’ under those trees again. Things I almost recognize from the worst days of the war. Stealth units, vat grown down in the darkest pits. Ninjas, we called ’em. A kind of Screev: black skin, black eyes, black claws. Silent, fluid, and completely fuckin’ invisible. You had to know where to look for ’em, what they smelled like, and even then they usually got you. Lucky there weren’t many. Phosphorus grenades. That was the thing. Wonder whether I’ve got any left in the old stash.\n“Dad?”\nOh shit. Alec. They called Alec.\n“Sonny boy!” I tap the button that raises the chair back up. It fizzles. Damned thing. Try to sit up on my own but the mech’s frozen on one side and my abs . . . Well, show me any ninety year old with abs. Even gene therapy and steroids only goes so far. Try again, swear, try again. Finally, flappin’ around like some kinda overturned bug, I rock to my feet. Alec stood, suited and booted, watchin’ me cough and splutter and heave as I lean on my knees.\n“What?” I snap. “Never seen an old man before, dickhead?”\nAlec just crosses his arms. Rookie doesn’t even know he’s born. World’s been at peace since before he was just a twinkle in my eye. Screevs are only a story to him. Used to love my stories. Used to think I was a hero. Now he’s a suit in a world that’s moved on. Somethin’ big in corporate. And I’m a daily goddamn embarrassment to him.\nPublic opinion’s a bitch. Once we were the saviors of Earth from the alien scourge. Now we’re war criminals, mass murderers, abominations. Protesters surround the Scrapyard holdin’ cute little white placards sayin’ “Thou shalt not kill,” “Screevs are friends,” and “Death to mechs.” I asked the docs for some live ammo so we could take potshots at ’em. They didn’t seem mighty amused by the concept. My shoulder aches where an alien chewed chunks out of it back in the ’02. Ungrateful bastards, all of ’em. Most of ’em never seen a bug. Wish I could introduce ’em to one. They’d change their tune quick enough.\nThere’s a glint in Alec’s eye I know too well. I love him, but he’s no marine. Not even close. Boy doesn’t understand and he’s too caught up in his stocks and swimmin’ pools to try. Been years since we were close. He always had my back as a kid. I was his hero father. That was real nice. But then a little less and a little less as the wave of public opinion turned. And now . . . Now I guess he’s here to decommission me.\n“You killed a man.”\nI sigh and the sigh turns into a hackin’ cough that says this old bucket of bolts spent too many years down a mine filled with toxic dust and chemical weapons. Rust taste of blood on my lips. Maybe a tumor’ll take me down before the docs can. That there might be the definition of irony. When I can breathe again I grin red teeth at Alec.\n“I’ve killed lots of men, kid. Perks of the job.”\nAlec’s chin wobbles. He probably thinks that twist of his lips is a casual sneer. To me he just looks like a ten year old scared to box with his old man cause he doesn’t want a punch on the jaw. I’m disappointed in my son. I examine that for a moment. Yes. I’m disappointed in him. What I could do if I was his age again, with everythin’ he’s got. Goddamn, guess the old are always jealous of the young. Alex shifts his weight and a lifetime of close scrapes makes me tense under my metal shell.\n“Dad. You’re not well.” Tryin’ a different tack then. SSDD. We’ve had this conversation a few times over the years. Most of the mechs took voluntary decommissionin’ years ago, or were forced to when their rigs got real bad. Heroes who saved a planet, put down like dogs gone rabid. I will not go quietly into the night. ’Sides—my eyes flick to the side, out the window, under the trees where the ninjas lurk—I reckon they’ll need me again soon enough.\n“Can it, bolo. I’m fine. See that?” I point over at Earl. “That’s not fuckin’ well. Don’t see anyone DCin’ him, do ya?” I take a step forward and he flinches. He flinches. Stop like that flinch was a ten-ton tank and there’s ammo comin’ down the barrel.\nHe’s scared of me.\nDamn.\nWhat would Dela think? Nothin’ good. I can almost see her lookin’ up at me with those doe eyes and sad mouth. How the hell did we come to this?\nSlowly, palms out so the gray flesh shows not the steel knuckles, I reach out.\n“I’m sorry, kid. You’re right. Maybe I am gettin’ old.” He lets me lay a hand soft-like on his shoulder, but he doesn’t meet my eye. Somethin’ flickers out in the dark again but I ignore it. Now’s not the time to puzzle out reality from dead neurons . . .\n“How ’bout I see that shrink you’ve been bangin’ on about?” An olive branch. Please let him take it.\nAlec glances over his shoulder at the Doc, who slowly shakes his head. Y’know that hurts more than ever. Thought I dragged him up right, even after his ma passed. Thought he was strong enough to make his own decisions, to back his family over all else. Seems I thought wrong.\n“Too late for that, da.” Alec steps back. “You’re not safe anymore.” He frowns. “It’s too late,” he repeats, and turns to walk away. I’m already dead to him, then. Guess it ain’t so different from me and my pa. I’d done my ten, got my papers. Could’ve discharged honorably. But they offered me the new mech. A chance to fight the last fight. I signed up for the next tour. Left him alone and wasn’t there when the Screevs burrowed right up under him. He was old, weak, a nuisance, and a distraction. Remember lookin’ over my shoulder as I walked up into the transport. Little old man with dandelion hair flappin’ in the wind and cane clenched in both hands. He was so proud of me. Never complained. Never killed anyone in his sleep . . . Remember the CO givin’ us the news. New York sinkholed. Nothin’ left. No survivors. I should’ve been there.\nGuess we all kill our dads in the end.\nI go away for a while. It’s been happenin’ a bit lately. Any time things get too much. A skip in time, like someone cut the footage. Then you’re back and people have moved or the light’s changed. I was worried about it at first, but you get used to it.\n“When?” I ask. Alec doesn’t answer cause he’s long gone but the Doc does.\n“Tomorrow morning, seven-thirty.”\nI nod, turn, glance at the clock.\n18 hours then. 18 hours to figure out if I’m really mad, dyin’, startin’ that long slow slide into not bein’ me anymore. Or 18 hours to prove that war’s comin’. Again.\nI stomp out to the garden. It’s gettin’ darker. Clouds comin’ in. Trees thrashin’ in the wind. Storm’s comin’. Would’ve been nice to see one more sunset. Life doesn’t always work out that way though. Wish I could say goodbye to Alec. Maybe he’ll be there tomorrow. Doubt it though. Things I should’ve said. Things I should’ve done. No time now. Guess this old man’ll just have to live with his regrets. For a little while longer at least.\nTime to get to work. Optics boot up a little glitchy, dead pixels skitterin’ cross my eyes, but the HUD still just about works. It’s been a while. Tracking roams through the trees, searchin’ out any sign of life. It snags a few things—rodents mostly—nothin’ useful. Tech never was much good against ninjas. Cold blood. Radiation resistant skin. Some sort of pigment that reflects the light, like a goddamn chameleon. I stare into the shadows like the little bastards are just gonna jump out and tap dance for me. I am not losin’ it. I know I’m not. Know it deep down like I know my own name. I still know my own name. One of the orderlies yells down that dinner’s ready. I ignore him. Don’t eat much these days. And I ain’t got time for indigestion today. I’ve got to find ’em. These Screevs I’ve been seein’. I’ve got to prove they’re real. That the world still needs me to save it.\nUnless it’s all a hallucination. Maybe I’m relivin’ the glory days. Maybe this is the top of that long slope down into the dark and there ain’t no comin’ back. Jesus, what a mindfuck.\nBut what then? Sit here, quiverin’, ’til they DC me in the mornin’. Could try tellin’ the docs. Could try callin’ a few old friends who still work for the Pentagon. Could end my days as a cracked old man shoutin’ conspiracy theories while they all laugh.\nAlec’s right. It’s probably all in my head. I’m done. Should just go quietly, get ready for the docs to pull the plug. Top minds in the business spent the whole war searchin’ for the ninjas; they never managed it. Too much noise down in the tunnels, they said. Made ’em pretty much invisible to all sensors, and satellites were no use . . .\nBut we’re not down in the tunnels, are we. There’s no background rads and thick layers of mineral obscurin’ line of sight. And satellites . . . Well shit, maybe this old dog’s still got a few tricks left up his rusty steel sleeves. I open up my HIVE connection. Been a while, but I still got a few insurance policies littered round the ’net. Back doors no one ever closed. Retro channels that the babies in the Pentagon probably never even knew existed. Takes me all of ten minutes to hack into the Space Agency’s satellite network and reposition three of ’em over my location. Numbers scrawl behind my eyes as some clever bastard in an office somewhere in Washington starts tryin’ to boot me out. I ignore ’em. Don’t need it long. Just tune to infrared and radar, point as many eyes as possible at this area and search for . . .\nVoi-fuckin’-la as the frogs say. Blackspots. I’ve got blackspots. A negative result, just as good as a positive . . . Fifteen targets pop up. Holes in the forest. They don’t move, like they know I’m watchin’ but ain’t sure what to do next. They’re there though. They’re goddamn there.\nThe Screevs are back.\nSatellites boot me out, but the mech’s got the code now. The AI knows how to track ’em. And if the mech can track ’em, they’re real. If they’re real, I’m not cracked. And if I’m not cracked, ain’t no way in hell I’m goin’ quietly. I got unfinished business to attend to. I glance back at Gloria, still feedin’ the birds. Think we all got some scores to settle.\nTo hell with Alec. To hell with the docs. To hell with my old, broken body. I wave at Gloria and sign out a debrief in the rec room in five. Durin’ the war I was one of an army of supersoldiers. The first, sure, but still one in thousands. We fought the bloodiest war in history against an enemy we didn’t understand and couldn’t stop. Now there’s just me, Dave, Gloria. Just the three of us—four if we can get Earl out of his valium coma long enough. Four old soldiers against a returnin’ evil. I grin.\nIt’s time to get the band back together.\nTomas Furby is a writer of odd fictions, strange stories, and weird worlds (including this one). His work has appeared in publications by Pill Hill Press, Static Movement, Short-Story.Me, Gold Dust, Aurora Wolf, and the British Fantasy Society. In 2018, he was the winner of the Exeter Writers Short Story Competition, and was long-listed for both the James White Award and Bedford International Writing Competition. He lives in the south west of England surrounded by books and scifi paraphernalia. You can find him on Twitter at @TomasFurby.", "source": "https://clarkesworldmagazine.com/furby_10_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Scrapyard by Tomas Furby"}