{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Choyeop Kim; Joungmin Lee Comfort", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "p2f/lJZyi4vWibOpsOvB/Gxnc8M=", "id": null, "license": null, "comments": "", "raw_text": "8900 words, novelette  Symbiosis Theory  Ludmila Markov had memories of a place she’d never been.  It was unclear when those memories established themselves inside her. The memoir of one of her teachers at the orphanage where she’d spent her early years contained the following recollection: “Somewhere around five years of age, she began saying that she’d come from ‘that place.’ We didn’t think much of it, since pretend play and talking about imaginary things are common behaviors among normally-developing children. However, Ludmila seemed somewhat obsessed with her make-believe world. Whenever any of us playfully challenged its existence, she became very upset. As a result, an unspoken rule developed regarding Ludmila, that one ought to just go ahead and play along with her. As long as we did that, there was never any problem. We just all figured that she’d outgrow her fantasy soon enough.”  Defying their expectations, however, Ludmila never did. Her notion of the place persisted into adulthood, and remained with her throughout the rest of her life.  From an early age, Ludmila’s remarkable artistic gifts set her apart. According to the teachers at the orphanage, she began producing intricate drawings of her dream-drenched world as soon as she was able to hold a crayon. Lamentably, these early pieces ended up getting tossed out when she left the orphanage later on, having been considered little more than the elaborate doodles of a talented child.  Still, in that orphanage—where the need for bread and crackers far outweighed the need for crayons—little Ludmila spent more time daydreaming than drawing. It wasn’t until the age of ten that she was discovered through a youth talent project sponsored by a multinational corporation, which swiftly whisked her out of the orphanage to a renowned academy in London. From that day on, she would never again go hungry or sleep in a roach-infested room.  Shortly after her move to the academy, Ludmila began exhibiting paintings of “the place.” Her first solo exhibition, which was held at a small gallery rented for the purpose of showcasing work by the academy’s students, was something of an introduction to the general landscape of this “place.” From the opening day, the collection made waves, with many of the gallery’s unsuspecting visitors finding themselves moved to tears while peering at the canvases. Inquiries about the creative spirit behind these works poured in.  Her proud instructors at the academy all wanted to know as well: “How did you conceive such a world?” Granted, there was still plenty of room for improvement when it came to their young protégé’s technique; but her landscapes never failed to enthrall, and the strokes of her brush upon the canvas showed nary a hint of faltering or hesitation.  Ludmila’s vision of “the place” seemed to have been etched deep into her consciousness as it continued to exert a supreme influence on her life. It was a place that appeared at once utterly real and completely imaginary, and she devoted her life to painting it. Each painting formed a discrete fragment of its landscape; yet taken as a whole, her oeuvre constructed an impossibly detailed and vivid sense of the spellbinding place that so clearly inhabited her mind.  Journalists never stopped asking her, “What do you call this place, Ludmila?” But her response, as well as the flustered and somewhat apologetic look on her face, were always the same: “There is a name for it, in my head, but it’s as if I can’t say it out loud.”  She did try, at one point. With each valiant attempt, she produced a string of unintelligible sounds so alien that they seemed to have come from another dimension. Efforts to break it down into perceptible units proved futile in the end, and so “the place” simply came to be called “the planet.”  A fictitious planet with a name that couldn’t be articulated. That its name didn’t render itself to spoken language only added to the planet’s phantasmic allure. Over time, people began to call it Ludmila’s Planet, conferring upon it the dignity of distinction through its eponym. It ultimately seemed to matter little whether or not such a place existed in the real world: the force of the beloved artist’s eternal yearning for it was all that mattered.  In many of her early pieces, Ludmila’s Planet is rendered in a more or less abstract style. Themes of swirling blue and purple present it as a home to multitudes of creatures, some with stable forms, and others with fluidly shifting ones. Much of the planet’s surface is covered by an ocean teeming with drifting bioluminescent amoebas, to which the planet owes its peculiar blue glow. More complex organisms form their own distinct ecosystems that fill the planet’s land, sea, and air. The days are short and the nights, long. The sun, with its daily rise and fall, fills the sky with breathtaking hues.  Her depictions of the planet grew more detailed as Ludmila entered adulthood. It was also at this point that she began converting her paintings into digital data. Before long, she had digitized the planet’s major attributes and characteristics in scrupulous detail. The drive and focus with which she constructed its flora and fauna seemed akin to that of a scientist working engaged in fieldwork.  It was only a matter of time before Ludmila plunged headlong into what was then the still-fledgling world of simulation art. Her revolutionary new endeavor mesmerized the public and critics alike, with the latter proclaiming that she’d brought much needed substance into a field oversaturated with technology and shallow technique.  Her response to these accolades was as consistent as ever: “The planet is. I’m just a skilled technician recreating what I see.”  People had fallen in love with Ludmila’s Planet. Through her art, which by then could be experienced in every corner of the globe, the planet had come to take on the status of a real thing. Their adoration for the subject of her art went beyond passive admiration: it inspired films and plays based on reinterpretations of Ludmila’s original works, and even as art of all lineages continued to be treated like mere consumer goods by the masses, her work enjoyed the rare exception of boring itself into people’s hearts and influencing their minds.  One of the most notable characteristics of her work was the complete lack of any traceable national or ethnic aesthetic. This might have been attributable to her nomadic life: her early childhood in Moscow, her adolescence in London, and the many different neighborhoods around the world she called home in the years that followed. Whatever the case, her depictions of the planet never evoked a single location that could have existed on Earth, but in fact, a place that seemed to exist all on its own, in a completely different universe.  And yet, her planet series stirred in viewers a curious sense of nostalgia. Gazing at Ludmila’s paintings, people would find themselves suddenly besieged by an inexplicable longing—a kind of grief for the utter goneness of something they might have once known a long time ago. Then, moved by this ineffable emotion, they would often become teary-eyed. Regarding this phenomenon, critics liked to say that, because the planet series depicted a world that didn’t exist in real life; paradoxically, it spoke to a world that uniquely occupied each of us inside.  There is a lesser known, nonetheless extraordinary series by Ludmila published only after her death. Entitled Never Leave Me, this series departs from the vivid and highly detailed imagery that characterized her signature style. In fact, each of the highly abstract pieces in the series broods with the potent emotionality of infinite sorrow that seems determined to devastate the viewers, in what could only be described as a plea of desperation.  For whatever reason, Ludmila had chosen not to promote the series: it was only after her death that dozens of pieces bearing this title were discovered in her attic. Scholars have argued that the series was a surrogate to the artist’s yearning for a lover, but Ludmila’s private life remains so poorly documented as to render any speculation or theory impotent in the absence of conclusive evidence.  By the time of her death, Ludmila had placed all her work in the public domain, in order to allow its use by anyone. Soon, simulation games based on her planet series began surging onto the market. For many people seeking refuge from the chaos of everyday life, wandering through simulations of Ludmila’s planet became a widely popular form of leisure. An unreachable world though it may otherwise have been, people had come to consider Ludmila’s Planet their own utopia, a legacy of the beloved artist which would forever live in their imagination.  Then the planet was discovered.  A space probe exploring deep space transmitted data back to Earth one day. It included images of a small planet with an unusual orbit, located in a distant multi-stellar system. Analysis of the data suggested the possibility of life on the unknown planet. Regrettably, its astronomical distance from Earth and the limits of technology at the time prohibited verification of this possibility within a reasonable time frame. Nevertheless, the discovery caused one typically sleepy observatory to erupt like a batted hive.  For days on end, the observatory buzzed with talk of the planet. Barring the potential of faulty transmission, the implications of the data were too exciting. Indeed, the most that Earth’s deep space exploration program had produced thus far had been nothing more than the same old vague possibility of life on alien planets, but never any data as clear and forthright as this.  Further analysis revealed that the planet’s atmosphere was an exquisite mix of ammonia and methane, two gases that were easily broken down by the UV light of one of the nearby stars. Upon this insight took shape the dominant hypothesis, which was that the planet’s atmospheric composition necessitated the presence of carbon-based life on its surface. When scientists converted the probe-measured electromagnetic spectrum into visible rays, the whole planet was suddenly lit in an anodyne blue glow, making it look very much like . . . another Earth. Or perhaps a fantastical twin that might have existed in a parallel universe somewhere.  “Doesn’t it remind you of Ludmila’s Planet?” said one technician, looking up from his boxed lunch.  “What? No way . . . ” another balked, incredulous.  “I mean, think about it. Precise and detailed measurements of her planet are preserved in simulations, which scientists have already used to verify the probability of its existence in real life. The data we received the other day . . . it’s consistent with the data we have for Ludmila’s Planet. Are you really trying to tell me that’s a complete coincidence?”  At this, others at the table set down their forks.  The staff at the observatory lay sleepless that night. It was true: the newly discovered planet’s observable data lent a new reality to Ludmila’s Planet, as the simulations she’d left behind predicted with perfect accuracy the world’s volume, mass, orbital period, diameter, and average surface temperature.  Could it indeed be Ludmila’s Planet? If so, how on earth could she have known about it?  With astonishing swiftness, another stunning fact was discovered the following day: the planet, it turned out, had long ago gone up in flames when its parent star had flared up. The data they’d received had been collected mere moments before its explosion.  The technician who had initially confirmed the content of the transmission stood before the assembly of reporters and journalists, triggering a blitz of questions and camera flashes.  “We’re looking at a planet that has been gone for a time now,” he said. “That is, Ludmila’s Planet, which once existed in a distant galaxy.”  But how could it be? Had Ludmila possessed some magical power that had allowed her to see into the distant past, if not the future? Was that even a viable theory in this day and age? Could everything instead just be an enormous coincidence? But then, what were the chances that an imaginary planet, flawlessly conceived though it had been by a massively gifted artist, was virtually identical to one later discovered in real life far off across the universe?  Everyone hungered for the truth, but the one person who held the key had already departed from the Earth.  As news of the staggering discovery zipped around the globe, the midnight oil was burning bright near the lakeshore in Seoul’s Gwangjin District, at the Brainwave Research Institute.  It was two in the morning, but the building was bustling with weary employees making a last-ditch effort to meet the deadline, their collective anxiety spilling out into every hallway. In the staff lounge where the TV was on to fill the silence, breaking news of Ludmila’s Planet was airing to the rapt attention of no one.  Seated at a corner table was Senior Researcher Soobin Yoon, still glaring at the same piece of document that she’d been clutching for a good hour. Her eyes felt ready to tumble out from their sockets. The progress review meeting was fast approaching, and she needed a modicum of cooperation from a machine that wouldn’t stop spewing wacky results. She shuddered at the thought of the subtle eye rolls and other signs of annoyance that she’d have to weather in the conference room. Was there anyone who wouldn’t be annoyed to hear that, “Life is overwhelming,” or “I miss my colleagues,” were the sort of thoughts that had been detected occurring inside the heads of two-month-old infants?  “It was working fine just a month ago,” she sighed, addressing Hannah at the next table.  “But the subjects were kittens then,” Hannah said, taking a break from her stack of documents. “These human infants are inscrutable.”  “Kittens, infants . . . They cry when they’re hungry, sleepy, or scared. It’s all the same,” Soobin retorted.  Giggling at this, Hannah said, “Who knows? Kittens may be more philosophical than human infants.”  Maybe so. But the pressing issue for them now was decoding the cries of the infants. Accurately.  The Brain-Machine Interface Team was studying thought-to-speech interface technology, which captured neural activation patterns using monomolecular imaging technology and then converted them into speech. Conversely, speech could be reverse engineered to the original neural patterns—or thoughts—that had generated it, though the latter was still very much a work in progress.  Humanity’s attempt to understand the brain had a long history, as did their desire to read another’s thoughts. Thus each breakthrough in neuroscience that had failed to deliver mind-reading technology nonetheless stoked embers of this longing in people’s minds. It was to this longing that the Brainwave Research Institute owed its continued, robust funding since its establishment at the dawn of the 21st century. Much had been gained in the cutting edge of neural decoding over the years, but it was the emergence of advanced imaging technology that hurried the research forward by finally allowing high-resolution recording of the smallest changes in a subject’s neural activity. Prior to this advancement, the interface technology had stalled out at a rudimentary level, success being correctly inferring whether a subject had been shown a picture of a scenic landscape or a food item based on their brain MRI readouts.  The paradigm-shifting breakthrough had come two years prior in the form of a monomolecular neural scanning technology, which made it possible to analyze brain activities at the level of the neuron. Promptly adopting this new imaging technology, the research team had achieved significant success over the intervening years. The new challenge now was to reverse-match speech to thoughts—or inner speech—yet to be processed into perceptible output. It was a task requiring a massive scanner, and mere minutes of speech took multiple days of tedious processing and analysis, but the technology’s unlimited potential kept everyone going.  In the preliminary study, which had involved the analysis of pet dogs’ and cats’ assorted vocalizations, the interface proved extremely effective, matching the animal subjects’ vocal expressions to corresponding desires with an accuracy rate of ninety-five percent. The canine subjects in the study wagged their tails with contentment when petted or given chew-toys according to their bark analysis. Before long, the technology’s commercial applications targeting mammals were green-lighted. Wealthy pet owners flooded the institute with phone calls pleading for an opportunity to have one final “conversation” with their dying pets. Unfortunately, such technology was still a long way off. If the research continued to make steady progress, however, a universal translator would be well within the realm of the feasible.  The research team then swiftly embarked on a new project involving human subjects. If the interface proved as effective for humans as it already had for other mammals, the obvious implications for those who lacked speech or motor function—not to mention language researchers mystified by some linguistic puzzle in an obscure language—were nothing short of incredible.  There was a great deal of hope and optimism during the initial data collection stage. It was true that the complexity of human thoughts and speech was expected to pose a challenge far greater than that posed by the previous animal study. As it were, the interface was still only capable of simple text output inferred from neural readouts, as opposed to, say, real-time transcription of a full-fledged conversation. But even so, there was the fact that its remarkable accuracy rate consistently measured at over eighty percent. Thus, it was implicitly understood by everyone that improving the system’s capacity for linguistic complexity was the next hurdle, though it seemed unlikely in the extreme that this challenge could threaten to derail the research itself.  Indeed, another success followed when a pattern model was completed based on neural data collected from the adult subjects. The team then swiftly moved on to human infants. The trill of hope and excitement was undeniable in the voice of everyone who discussed it. Deciphering infant cries, even just approximately, would be a game changer for new parents and those currently toiling in the field of robot-assisted childcare research. The interface was bound to become an indispensable infant-care tool the world over—except that this time, the research ran into a brick wall right out of the gate.  Hannah, who had been in charge of the first round of analysis, entered the conference room with a data chip in hand. The mood in the room was buoyant with the hopeful anticipation of her colleagues.  “The results are . . . very strange. They’re not the kind of thoughts we’d think infants are capable of thinking,” she said. Then, heaving a big sigh, she projected the results onto the screen.  The entire room fell silent. According to the interface, the infants had cooed and cried about the following:  “How can we imbue a greater sense of morality in them?”  “How are you all doing in there?”  “No. This is our home now.”  Everyone gaped at the screen, dumbstruck. The analysis was a complete mess.  “It looks like data corruption,” Soobin said flatly.  It only made sense to question the purity of data, considering how the imaging system worked. At the current stage of innovation, decoding accuracy was still highly subject to the noise level in the input data, after all. Noise, environmental or otherwise, had a way of making its way into data no matter how vigilant the monitoring, which frequently resulted in a frustrating amount of time spent on filtering it out. In fact, the team had already run into a similar problem during the adult trials. It wasn’t a stretch to imagine that the data collected from infants would be more muddled, since their brains were still learning how to formulate a thought, let alone vocalize it.  Around 14 months of age, the average human baby begins to absorb basic vocabulary with a striking efficiency, and is able to follow simple commands. From infancy to adolescence, a person’s cognitive development and linguistic development follow the same general trajectory, which is to say, one’s thought development is critically dependent on one’s language comprehension and vice versa. Hence, logic dictates that an infant’s thoughts cannot greatly surpass the level of his current language comprehension.  “So it has to be noise,” Soobin repeated, “If the data were clean, we’d be seeing I’m hungry, I’m uncomfortable . . . that type of output. And not even in fully formed sentences. Simple registration of pain and other sensations is what we should be seeing here.”  “That’s what I thought, too.” Hannah nodded in agreement. And then she ventured, “But noisy data alone can’t explain everything. Look at this analysis of older children just beginning to speak. Their speech and neural patterns are all over the place, too. ‘Mama, I want that’ was matched to ‘I long to feel connected to the world’ . . . ? How do we explain it?”  “Hmm . . . Could it be because children’s neural activation patterns are so completely distinct from those of adults?” Soobin wondered.  “Possibly,” Hannah said, her face darkening as she added, “And if that’s the case, then we’ll have to start it all over again.”  At that, the air in the conference room hung heavy with a sense of foreboding.  Thankfully, a problem identified was, usually, a problem half-solved. Soobin and Hannah set about sorting the collected thought-speech data by age group. Next, they separated the data of subjects whose language had yet to emerge. The effort drastically reduced the amount of available data, so a full day had to be spent on the phone while begging every cooperative agency for additional material. It was a chore they could do without, but surely it was more agreeable than accepting the results at hand and announcing to the world that babies babbled madly to themselves.  They’d placed a great deal of hope on the effort, but the results that came back were nonetheless demoralizing. It turned out that the infants’ brainwave patterns were far more intricate than they’d had imagined, suddenly making it seem trivial by comparison to scrutinize the adults’. In fact, the other team, which had continued with the adult study, was enjoying smooth sailing. Having already mapped onto the interface the large database of neural patterns collected from adults with no speech or language difficulties, they were currently working on teasing out speech from the brainwaves of adult subjects who’d lost the ability to speak for various reasons. In sad contrast, Soobin’s team was still troubleshooting for the initial findings that indicated infants engaged in philosophical musings. No matter how many times they duplicated the entire process, though, the results remained consistently baffling.  “These babies . . . ”  Clutching at her head in frustration, Soobin plopped down on the sofa.  “ . . . complicated, deep little philosophers, they are,” Hannah said.  Had they underestimated the challenge? Could it be that the mysteries of the human brain were simply too complex for them to unravel? Soobin was at a loss, completely.  Sensing that she was left with no other recourse, Soobin began talking with Hannah about the fate of the project, and whether a course correction was necessary to save it. Despite everyone’s efforts, the problem of the philosophical babies seemed insoluble. In the end, it was determined that the project should be redesigned at the next progress meeting. Enthusiasm dwindled, and the project began petering out when an unexpected development diverted it from its course once again.  “Soobin, could you take a look at this?” Hannah said, presenting her with a stack of analysis results she’d printed out. Her lips pressed together, she looked oddly intent. Taking the stack from Hannah, Soobin began scanning the pages, before clapping it shut within a minute. This couldn’t be right. She couldn’t take seriously what her eyes had just told her. It felt like she was reading a tabloid.  “What’s this? What is it supposed to mean?” she accused.  “It’s supposed to mean what it means. These are the results of the infant babble analysis,” Hannah said, “Do you remember that day? Ludmila’s Planet had just been discovered. The data captured on that day are all like this.”  Soobin remembered, of course. It was on that day the two had first begun to debate the viability of the infant project. While she’d continued fussing over the puzzling results, Hannah had begun a new analysis with the remaining data, the staggering results of which were contained in the printout that Soobin now clutched in her hands.  “What on earth . . . ” Soobin stared at the strings of letters.  “This is where we’d all begun.”  “I miss our planet.”  “Ludmila!”  “Ludmila!”  “Ludmila!”  “Ludmila painted the place exactly as it was.”  “I miss it!”  As Soobin stood there with her mouth open, Hannah emphasized how many times she’d already verified the results.  “I couldn’t believe it myself, which is why it took me a little while to share it with you. Every infant was occupied by these thoughts that day.”  With that, she produced an additional report containing the analysis results of reams of data she’d personally pored over, which had been initially rejected by the team for being corrupt and unusable. Working on the assumption that the data was, in truth, free of noise, Hannah had isolated the units of meaning that emerged repeatedly. The resulting chart at hand incorporated the infant thought-speech model that had been scrapped for being an utter failure. Once again, the analysis had found that some bizarre conversations were taking place inside the heads of these infants. These conversations, not to be outdone by the notion itself in their oddity, appeared to be thoughtful and, at times, lively exchanges between multiple voices in the brain.  “You OK? I just heard a racket.”  “No worries. Mr. clumsy just knocked over a chair, that’s all.”  “I bet his eyes were glued to the screen.”  “Are you already dreaming of the sea?”  “Oh, I’d love to end up in the sea someday.”  “This data right here? It’s from one infant, from the same time frame—as you can see,” Hannah pointed out. “It’s as if multiple beings coexist inside the infant’s brain. Please, stop looking at me like that and hear me out,” she urged, turning the page for Soobin. “I extracted the interpretations that showed up repeatedly and then sorted them out. And I took care of the post-analysis, in case you’re wondering. Look.”  It was true. There were multiple participants in these conversations, all of whom were speaking with the tenderness and devotion of a caregiver. They talked about morality. They talked about life. They talked as though they were co-parents, every one of them nurturing and looking out for the infant. These results all but pointed to a conclusion that Soobin herself would be hard-pressed to accept. Stunned speechless, she listened to what Hannah still had to say.  “Something’s present inside their brains,” Hannah concluded. “Something not human. These occurrences can’t be explained without introducing an external entity.”  “It must have been noise in the data,” replied Soobin in a tight voice.  “Noise can’t account for it. The conversations are persistently and deeply coherent. How likely is it that noise interruptions turned into discussions of morality, ethics, altruism, and all that? Isn’t that more absurd to imagine?” Hannah persisted.  “But . . . How? The data had come from thousands of infants, each one an individual. And you’re saying that, inside each of those little heads resides some force that acts like a parent?”  “If not, then how do you explain what you see?”  Given her radical-leaning perspective on many subjects, it wouldn’t be the first time Hannah had offended others’ sensibilities. Still, when it came to that, this current argument was her best effort so far.  “All I’m saying is . . . ” Soobin began, only to realize she had nothing to follow it up with. Composing herself for a few moments, she said, “A foreign presence inside the infants’ brains? Some intelligent entities that aren’t human?”  “It’s the only plausible explanation,” Hannah replied.  Soobin decided to spare the team Hannah’s lunacy for now. Speculations of some force occupying the infant brain . . . Of course, such an idea didn’t stand a chance. And yet, when she finally decided to give her colleague’s argument due consideration in all its absurdity, intriguing patterns began to leap out at her in a way that they hadn’t just a few hours earlier. For one, she could now see that, among babies and toddlers on the verge of speech, there was a complete lack of congruence between the measured neural patterns and their outward expressions—specifically, the infants’ cries, babblings, and simple utterances. When fed through the interface, the neural patterns of these very young subjects consistently produced highly sophisticated and intellectual speech output, which could only be understood as exchanges between multiple mature voices inside the brain. It was just as Hannah had said.  Soobin and Hannah began referring to the voices as “them.” They discussed feelings and thoughts, love, and empathy. They clearly seemed to want to teach the infants something.  Moving on to young children, the two scientists reorganized the large amount of speech data they’d collected, sorting them by age. Were there distinct conversations taking place beneath all the “mommy,” “daddy,” “I want that,” and so on? Their analysis showed a mix of the children’s surface communications and the conversations among them. Curiously, these two-tiered conversations seemed to vanish at around age seven, following years of gradual retreat that began at approximately three years of age, with some variation between individuals. It was as though the internal voices gradually withdrew until the child became fully communicative, at which point they seemed to bow out completely.  These notions kept Soobin up at night. Even now, she and Hannah had kept the theory to themselves. Day in and day out, she labored through additional data in search of a clue that might help reveal their identity. Colleagues who’d noticed the pair beginning to look increasingly sapped and haggard expressed concern by gently reminding them that “it was what it was”, or that it was the nature of science to progress through trial and error, and so forth.  Yet even as she persevered, Soobin didn’t completely rule out the possibility that everything might still turn out to be a massive decoding error. Still, the more data she analyzed, the clearer it became that there was only one possibly true conclusion: the analyses were accurate, and inside the infant brain, they existed.  But where did they come from? How did they settle in the brain? And why do they leave when they leave? What was the tangible proof of their presence? And then, one day while reclining on the sofa in the back of the staff lounge, it struck her.  “The box children!” she blurted out loud. This jolted Hannah, who had been nodding off nearby, into wakefulness.  “ . . . What?”  “A few years ago, there was an experiment conducted to see if human touch was absolutely necessary for normal infants development. Do you remember?”  Hannah’s eyes began to widen as if slowly registering something.  “Of course . . . yeah, the experiment with infant-care robots . . . ”  “Their data may be useful to us.”  “How?”  The so-called “box children experiment” had been conceived to test the efficacy of infant-care robots. In the experiment, infant subjects had been kept isolated from the outside world for the duration of the study, to be raised in the lab solely by caregiver robots. All other variables had been kept constant. Some researchers had speculated that the babies’ experience shouldn’t be too different from an extended tenure inside a giant incubator. After all, the ethics committee had given the research project its stamp of approval, which was supposed to have reassured everyone that no infant’s well-being was going to be compromised in any way. Still, this approval did little to mute the concerns surrounding its design. When the findings were finally published, the project once more attracted harsh international criticism.  “It was such a huge mess,” Soobin sighed.  “I remember.” Hannah nodded gravely. “By the end of the experiment, the subjects were found to act purely on instinct, their growth in the affective domain having been completely stunted over the course of the experiment. It was a big relief to hear that many were successfully rehabilitated and socialized later on, after the experiment finished.”  “The experiment should never have gotten approved,” Soobin said, her gaze fixed on the empty air before her. “On the other hand, I still have some unanswered questions about it,” she continued, turning to Hannah. “Caregiver robots are designed to deliver optimal stimulation. Why does a simple lack of flesh and blood affect the infants’ socioemotional development so profoundly? I have to wonder if there’s more to what the finding seems to suggest. If anything, we, humans, are imperfect caregivers given to personal moods and circumstances. So . . . maybe there’s some connection with whatever caused the robot-reared infants to fail to thrive . . . ”  What if they gained entry into the infant brain at some point after birth, in the way of parasites and microbes—as opposed to in utero? Like viruses, they could be lurking in the air, or otherwise widespread throughout the environment. Even so, there had to be a specific point of access for them. What if the box children had never gotten the chance to be exposed to them because they’d been locked up inside the lab? Hannah shot up from her chair.  “There must be recordings. We need to analyze their cries,” she said.  It took no effort at all to find relevant video files online, each trailing an endless comment section crammed with condemnations and disapproval of what the viewers considered a cruel and morally detestable experiment.  “How dare you leave these babies alone with robots, you monsters!”  “Babies NEED a warm and caring HUMAN touch! You’re raising androids devoid of humanity!”  However, the question of whether or not the caregivers had been human might ultimately have been of little consequence. That is, if one could allow the possibility that they were the ones outfitting human infants with their humanity, and that, perhaps, what we’d considered our innermost human qualities ultimately originated from outside of us.  Soobin felt ready to turn her gaze outward for proof. She began to enter the audio data extracted from the videos into the interface. To the naked ears, the infants’ cries were indistinguishable from the cries of other babies. But their presence or absence amongst the box infants would soon be verified by the output of the interface, which would, in turn, disprove or validate the hypothesis that the crucial factor determining humans’ socioemotional development was them. Had they been absent among the box infants, as the two suspected, the interface would display only the infants’ requests, minus the veiled conversations attributed to them.  The software commenced its analysis. There was nothing for Soobin and Hannah to do but wait for the results to load up. The first round of analysis produced units of meaning that remained too abstract and incoherent to make sense of. With a trembling hand, Hannah initiated the final decoding process, whereupon the algorithm began arranging the discrete units into sentences. Soon after, the final results appeared on the screen. The cries and coos of the box babies in the videos had apparently been concerned with the following thoughts:  “I’m hungry.”  “I’m sleepy.”  “I’m scared.”  Soobin and Hannah turned to each other, unsure of how to feel about this. Should they rejoice in their victory? Or should they be aghast at the overwhelming implications?  Indeed, what had been fired by the synapses inside the heads of the box babies couldn’t properly be called thoughts. They were intense needs driven by pure instinct, which in fact was what anyone would have expected of such young babies. Mere days old, and having been kept in the laboratory since birth, these babies had yet to be exposed to them. Thus, their brains had generated only the neural patterns associated with typical infantile desires tailored for survival—the kind of neural patterns Soobin and Hannah had also previously expected to find in all babies who had yet to acquire speech, and thus, had yet to begin contemplating life and the world.  But Soobin knew now what the absence of those neural patterns must have meant for these newborns isolated in the lab. It meant that they would miss the milestones their peers out in the world would soon begin to meet, one after the next.  Let us indulge in a truly bizarre supposition: imagine that, unbeknownst to us, an extraterrestrial species has existed in symbiosis with humanity for millennia. After all, parasitic bacterium had to enter cells before beginning their permanent symbiosis with the host cells, all the while evolving into mitochondria containing its own DNA. In truth, this sort of arrangement is commonplace in nature, where organisms from two different species often live in a close, dependent relationship. Humans, for one, share a symbiotic relationship with a myriad of microbes living inside of us. We don’t consider them invaders. They are already an inalienable part of us.  But what if one of our partners in symbiosis was not native to the planet Earth? What if it had hailed from another planet, tens of thousands of years ago? What if it had settled into our brains to rule over our childhoods and infect us with its ethics? What if the unique qualities we’ve forever believed separated our species from all other beasts of the world were, in fact, not quite so intrinsically human?  “So . . . the traits we’ve prided ourselves for possessing all along are actually alien traits?” the team leader observed as Soobin finished presenting the theory. Among the rest of the team’s members, responses varied. Some gaped at the results, while others rejected the theory point-blank.  “It’s too unorthodox! Nobody would take it seriously,” someone remarked.  “I’m still having a hard time believing it myself,” Hannah conceded, “But how can we deny the data?”  Meanwhile, Soobin was itching with the desire to probe further into the infant brain. If it was true that they had taken up residence in there, shouldn’t we be able to observe them somehow? What might they be composed of? Shouldn’t there be something—anything—that we could measure? Of course, it was unlikely that she would get the chance to satisfy these queries any time soon. Probing the brain of a live subject raised significant ethical issues. Plus, blindly poking around in brain tissue in search of a speculative life-form whose material properties they knew nothing of wasn’t likely to result in any groundbreaking discovery. Most saliently, if they so readily rendered themselves to human inspection in the manner of parasitic organisms, then wouldn’t medicine have already discovered them long ago?  “I’d be shocked if we could observe them. If they had a physical basis we could detect, they would have been discovered ages ago, sometime during the long history of anatomical science,” said the team leader, voiding any half-hope that might have lingered. He was right, Soobin knew, and she nodded in resignation. Still, she would have stared at a sample all day long, if one had been made available for her inspection.  There was no shortage of other queries to mull over yet. Symbiotic coexistence didn’t always involve a mutually beneficial relationship. In some cases, one party benefited while the other was unaffected, and in others, one party actively harmed its partner for a unilateral gain. What was the nature of our symbiosis with them? What did this enigmatic species gain from operating inside a developing human brain? Might they be a carbon-based life-form, like humans were? What could they reap from presumably inculcating ethics and altruism in humans? And why had they chosen us, among all the species of the world?  “I happen to think that they’re space refugees who found a new home in our planet,” Hannah said. Despite the raised eyebrows of her colleagues, she continued, “They repeatedly refer to Ludmila’s Planet as ‘home,’ and we know for a fact it went up in flames a long time ago . . . ”  Ludmila’s Planet. A planet conceived and described in impossible detail by the eponymous artist. The idea that it could have been their home in some ancient eon might just be the clue leading to the truth of their being.  If these beings were so advanced as to manipulate the human species, it stood to reason they ought to have been able to predict their planet’s demise and evacuate in time. After that, while wandering about in space in search of a new home, they had arrived on planet Earth one day . . . and the rest was history.  “Their conversations clearly suggest exquisite intelligence,” said Soobin. “So much so that I have to wonder if a great deal of intricacy isn’t getting lost in translation due to the limitations of our own language. They’re likely a far superior species to humans, or that’s what I think. But then again, they seem entirely reliant on human neural networks. Could it be that they are a species that requires a host in order to actualize their intellect? That might explain why they chose the human species. For all its mystery, the human brain is known to be the most efficient on the planet, and if they’d discovered us tens of thousands of years ago, it is conceivable that the symbiosis triggered the birth of civilizations and the whole cascade of human evolution. Even if it hadn’t been their original intention to enlighten us, their intelligence could have been transferred to us over the long course of symbiosis.”  The room had fallen silent. If the symbiosis was truly as old as human history, there must be ample evidence outside the walls of the lab. In fact, there might be evidence everywhere, hiding in plain sight across human civilization, Soobin supposed.  “What if we ask them directly?” someone suggested.  The same thought had crossed Soobin’s mind, and probably the minds of a few others in the room as well. However, the prospect of actually doing so was dismal. The current research involved children. It was one thing to analyze the raw data collected from children going about their business in their natural environment, but a whole different proposition to attempt to connect with an enigmatic presence supposedly inhabiting their brains. It was anyone’s guess what sort of reward or punishment an attempt like that might provoke, and there was no guarantee that the gesture wouldn’t be perceived as hostile. In fact, how likely was it that they would welcome our sudden interrogation following millennia of unauthorized inhabitation inside of us? Any rash attempt risked inviting irrevocable harm.  “Following that line of thought . . . are we sure that they’ve actually left our brains?” someone asked, apparently bothered by a similar concern.  In the end, this risky proposal was rejected, and Soobin devised a new plan. If they had hailed from Ludmila’s Planet, then exposing them to paintings and simulations of their long-lost home should elicit some very particular responses. The danger it posed to the hosts was zero, as evidenced by the fact that no infants exposed to the breaking news on that day had been harmed by it. If anything, the data to be generated in this experiment ought to help illuminate the mysteries of these beings.  “It’s as we’ve predicted. The level of neural activity it triggered is . . . off the charts. We can barely keep up with the data stream.”  It was just as Hannah had suggested: when exposed to footage of Ludmila’s Planet, the infants ceased all fidgeting and fussing, their eyes silently tracking the moving landscape in rapt attention. Inside their brains, however, they seemed to be erupting with excitement, in a storm of discussion so lively, complex, and dense with information that its analysis became an unprecedented challenge. There was no doubt they were intimately connected to the Planet.  The question was whether or not to publish these findings yet.  “If we don’t, someone else will. We’re not the only ones pursuing a universal decoder. It’s extremely unlikely that other researchers won’t test it on infants, if they haven’t already,” Hannah said, “Even if people are appalled by the idea that extraterrestrials take up residence in infant brains, I don’t see how the knowledge would change anything anyway. Would it even be possible for us to suddenly evict them?”  “It wouldn’t do us any good,” Soobin said. Looking around the room, she continued, “I’m not alone in thinking that we’re the ones who should be begging them to stay, am I? Without them, we’d lose everything that we’ve forever believed made humanity unique!”  “Hmm . . . but how strong is our ego, as a species?”  Someone raised an important point, then. “Perhaps it’s hard for us to stomach the idea because we view ourselves as completely distinct from them? Would it make a difference if we found, in adult brains, some remaining vestige of their presence carried forward from childhood?”  If they’d left their fingerprints all over a child’s development while living inside her developing brain, her mature brain might still possess some evidence of the fact. Still, no neural patterns suggestive of them had been observed in an adult brain so far.  “This is just a hunch,” the team leader chimed in, “But they seem quite reluctant to leave the host at childhood’s end. Phrases like, ‘It’s difficult, but the time has come for us to leave,’ have come up more than a few times.”  “Yes, I know,” Soobin concurred. Then, pointing to the chart she’d been looking at, she continued, “Plus, I can’t stop thinking about the timing of their departure. Clearly, seven years of age bears some significance, given that’s when they seem to leave us for good. The data’s consistent. Only children seven years or younger exhibit neural patterns indicating their presence. After that, there’s nothing.”  For it was at the age of seven that, according to the chart, intercranial conversations disappeared completely. It was at this point that children’s neural signals and speech came to mirror each other perfectly, just as with adults. This suggested that they stayed inside human brains from infancy to early childhood before packing up shortly after the seventh birthday.  “I’m wondering if we could connect this to childhood amnesia. Very few of us are able to recall much of what happened during our formative years,” said Hannah. “The established theory holds that rapid development of the hippocampus around this age is responsible for the phenomenon—that a high rate of neurogenesis in the hippocampus somehow destabilizes the existing long-term memory.”  This much was true: by the time a child reaches the age of seven, most of his or her memories of earlier years, autobiographical memories in particular, have faded. Few adults, if any, remember events occurring between infancy and early childhood. Those who claim to are, in fact, most likely to be relying on false memories formed on the basis of what they heard about the event from others.  “But a little while ago, I read an interesting report in a neuroscience journal that disputed this theory,” Hannah continued. “Apparently, some researchers used the newest imaging technology to peer into the brains of kids around the time when childhood amnesia kicks in. What they discovered was that the rate of their neurological development and the degree of amnesia experienced didn’t track at all. There was zero statistical significance.”  Someone looked up the paper online and shared it to the room’s screen.  “The authors vaguely argued for an external cause, though they sounded pretty puzzled themselves. It’s surely a controversial finding that triggered a stream of papers disputing it. But if it’s true that childhood amnesia isn’t caused by rapid neurodevelopment, and that it can actually be attributed to an external factor . . . then what’s the external factor? What is it that’s taking away our memories? I have to wonder . . . ”  “It’s them,” Soobin chipped in. “They take it away with them when they leave us.”  In terms of their theory, what was most unexpected of all was Ludmila’s role.  She was the only human being who had retained any memory of them beyond early childhood. After all, she had only begun working on her planet series in earnest as an adolescent. This fact seems to suggest they might have remained within her and continued influencing her personality. That the planet had never ceased to be the subject of her art, and that she had been able to furnish exact and scientific detail regarding the planet (including its mass, volume, and so forth) seem to indicate two distinct possibilities: that she had been permitted to continue listening in on their conversations, or that their collective memory had been transferred to her in its entirety when, or if, they left her.  “Perhaps they stayed with each and every human being on Earth, but only Ludmila was let in on the truth of their origin?”  Investigation into Ludmila’s life unearthed nothing but the well-established fact that it had been a lonely one; in stark contrast to her colossal fame as an artist, precious little was known about her as a person.  “She had been an exceptionally creative child. And as creative children often are, she, too, must have been a sensitive soul inclined to introspection—which may have caused her to become aware of their presence early on. They might have taken special care of her, seeing that she really was alone in the world.”  Thus, in the end, it turned out that Ludmila had never once lied about her work after all. From the very beginning of her career as an artist, she had simply transferred to canvas the landscape they’d held up before her, inside her brain. Her mind eventually came to contain the entire planet as they remembered it, far beyond just the fragments of its landscape. In every practical sense, she had visited the planet—through them, with whom she’d shared a brain all her life.  “Ludmila’s memories of the planet may have been enhanced through the act of painting it,” Soobin said. “Motor memory may have boosted her episodic memory of the planet and vice versa, as the two types of memory are distinct, but not entirely separate.”  “Given how they abscond with childhood memories when they take their leave of the host, they seem extremely cautious about revealing themselves to humanity. But then, why risk exposure by encouraging her to recreate the planet through her work?”  “Well, their conversations make it clear that their planet is incredibly dear to them,” Soobin said. “I mean, whose home isn’t?”  To that explanation, nobody offered any objection.  Alien refugees, still mourning the loss of a homeworld that had been pulverized into cosmic dust eons ago . . . perhaps they just wanted for someone in their adoptive planet to carry its memory, even if all the rest lived in blissful ignorance. And they had found that person in Ludmila, who, with her capable hands, was able to resurrect it back to life in all its beauty.  A planet that had existed tens of thousands of years ago.  The team arrived at the ultimate question. What was it that caused people to obsess over Ludmila’s world, a place about which they themselves knew nothing? What was it about her world that moved everyone to tears—why such unexpected melancholy and longing for a place they had never even seen before? Of all the countless simulated worlds created during human history, why was it that Ludmila’s Planet alone had managed to leave such a powerful impression in the minds of people worldwide?  “Because each of us has served as a host to them before,” Hannah said.  And there lies the proof of this proposed symbiosis, Soobin thought to herself. A wholly amorphous memory, flickering at the edge of our consciousness, without ever vanishing completely. It was our vague yearning for those who had shaped us into who we are.  What people yearned for through Ludmila’s mesmerizing work was not the planet itself, but its former inhabitants who had once cared for them.  “That other series. Do you all remember? There’s another series by her,” Soobin said.  “Never Leave Me. It’s not as widely known, but just as beautiful, if you ask me.”  “Yes. That’s the one.”  It occurred to Soobin that the series, which remained largely indecipherable, might hold the key to Ludmila’s veiled interior.  “Perhaps it was Ludmila’s plea?”  “Plea?”  “Ludmila had become aware of their presence, and . . . ”  Without warning, a wave of emotion crashed over Soobin in that moment.  “It was her plea to them. Its title, and the infinite tenderness, sorrow, and loneliness that it stirs in people . . . Ludmila had lived her life in perpetual solitude. Their companionship must’ve meant everything to her: they were her only friends, family, and colleagues.”  She had been begging them not to leave her. Not to take away from her their world and its splendor. Please, oh, please, to stay with her forever.  “So they stayed,” Hannah mumbled to herself. Her voice was the only sound in the room, where every occupant was presently picturing the same place in their minds: that planet, awash in its mystical blue glow. Ludmila’s Planet. The ancient home of the unknowable beings, our partners in symbiosis for all these tens of thousands of years. In that moment, Soobin found herself seized by a wholly unexpected sense of grace. It felt somehow like a longing . . . for someone she’d never met before.    Originally published in Korean in Crossroads, January 2019.  Published with the support of Literature Translation Institute of Korea (LTI Korea). Choyeop Kim is an award-winning Korean science fiction author with a background in biochemistry. She enjoys converting intangible ideas, such as memory, emotion, minds, and relations into tangible items. She wants to write about the abstract components of life in a specifically scientific language while discovering new questions in the process.", "text": "8900 words, novelette\nSymbiosis Theory\nLudmila Markov had memories of a place she’d never been.\nIt was unclear when those memories established themselves inside her. The memoir of one of her teachers at the orphanage where she’d spent her early years contained the following recollection: “Somewhere around five years of age, she began saying that she’d come from ‘that place.’ We didn’t think much of it, since pretend play and talking about imaginary things are common behaviors among normally-developing children. However, Ludmila seemed somewhat obsessed with her make-believe world. Whenever any of us playfully challenged its existence, she became very upset. As a result, an unspoken rule developed regarding Ludmila, that one ought to just go ahead and play along with her. As long as we did that, there was never any problem. We just all figured that she’d outgrow her fantasy soon enough.”\nDefying their expectations, however, Ludmila never did. Her notion of the place persisted into adulthood, and remained with her throughout the rest of her life.\nFrom an early age, Ludmila’s remarkable artistic gifts set her apart. According to the teachers at the orphanage, she began producing intricate drawings of her dream-drenched world as soon as she was able to hold a crayon. Lamentably, these early pieces ended up getting tossed out when she left the orphanage later on, having been considered little more than the elaborate doodles of a talented child.\nStill, in that orphanage—where the need for bread and crackers far outweighed the need for crayons—little Ludmila spent more time daydreaming than drawing. It wasn’t until the age of ten that she was discovered through a youth talent project sponsored by a multinational corporation, which swiftly whisked her out of the orphanage to a renowned academy in London. From that day on, she would never again go hungry or sleep in a roach-infested room.\nShortly after her move to the academy, Ludmila began exhibiting paintings of “the place.” Her first solo exhibition, which was held at a small gallery rented for the purpose of showcasing work by the academy’s students, was something of an introduction to the general landscape of this “place.” From the opening day, the collection made waves, with many of the gallery’s unsuspecting visitors finding themselves moved to tears while peering at the canvases. Inquiries about the creative spirit behind these works poured in.\nHer proud instructors at the academy all wanted to know as well: “How did you conceive such a world?” Granted, there was still plenty of room for improvement when it came to their young protégé’s technique; but her landscapes never failed to enthrall, and the strokes of her brush upon the canvas showed nary a hint of faltering or hesitation.\nLudmila’s vision of “the place” seemed to have been etched deep into her consciousness as it continued to exert a supreme influence on her life. It was a place that appeared at once utterly real and completely imaginary, and she devoted her life to painting it. Each painting formed a discrete fragment of its landscape; yet taken as a whole, her oeuvre constructed an impossibly detailed and vivid sense of the spellbinding place that so clearly inhabited her mind.\nJournalists never stopped asking her, “What do you call this place, Ludmila?” But her response, as well as the flustered and somewhat apologetic look on her face, were always the same: “There is a name for it, in my head, but it’s as if I can’t say it out loud.”\nShe did try, at one point. With each valiant attempt, she produced a string of unintelligible sounds so alien that they seemed to have come from another dimension. Efforts to break it down into perceptible units proved futile in the end, and so “the place” simply came to be called “the planet.”\nA fictitious planet with a name that couldn’t be articulated. That its name didn’t render itself to spoken language only added to the planet’s phantasmic allure. Over time, people began to call it Ludmila’s Planet, conferring upon it the dignity of distinction through its eponym. It ultimately seemed to matter little whether or not such a place existed in the real world: the force of the beloved artist’s eternal yearning for it was all that mattered.\nIn many of her early pieces, Ludmila’s Planet is rendered in a more or less abstract style. Themes of swirling blue and purple present it as a home to multitudes of creatures, some with stable forms, and others with fluidly shifting ones. Much of the planet’s surface is covered by an ocean teeming with drifting bioluminescent amoebas, to which the planet owes its peculiar blue glow. More complex organisms form their own distinct ecosystems that fill the planet’s land, sea, and air. The days are short and the nights, long. The sun, with its daily rise and fall, fills the sky with breathtaking hues.\nHer depictions of the planet grew more detailed as Ludmila entered adulthood. It was also at this point that she began converting her paintings into digital data. Before long, she had digitized the planet’s major attributes and characteristics in scrupulous detail. The drive and focus with which she constructed its flora and fauna seemed akin to that of a scientist working engaged in fieldwork.\nIt was only a matter of time before Ludmila plunged headlong into what was then the still-fledgling world of simulation art. Her revolutionary new endeavor mesmerized the public and critics alike, with the latter proclaiming that she’d brought much needed substance into a field oversaturated with technology and shallow technique.\nHer response to these accolades was as consistent as ever: “The planet is. I’m just a skilled technician recreating what I see.”\nPeople had fallen in love with Ludmila’s Planet. Through her art, which by then could be experienced in every corner of the globe, the planet had come to take on the status of a real thing. Their adoration for the subject of her art went beyond passive admiration: it inspired films and plays based on reinterpretations of Ludmila’s original works, and even as art of all lineages continued to be treated like mere consumer goods by the masses, her work enjoyed the rare exception of boring itself into people’s hearts and influencing their minds.\nOne of the most notable characteristics of her work was the complete lack of any traceable national or ethnic aesthetic. This might have been attributable to her nomadic life: her early childhood in Moscow, her adolescence in London, and the many different neighborhoods around the world she called home in the years that followed. Whatever the case, her depictions of the planet never evoked a single location that could have existed on Earth, but in fact, a place that seemed to exist all on its own, in a completely different universe.\nAnd yet, her planet series stirred in viewers a curious sense of nostalgia. Gazing at Ludmila’s paintings, people would find themselves suddenly besieged by an inexplicable longing—a kind of grief for the utter goneness of something they might have once known a long time ago. Then, moved by this ineffable emotion, they would often become teary-eyed. Regarding this phenomenon, critics liked to say that, because the planet series depicted a world that didn’t exist in real life; paradoxically, it spoke to a world that uniquely occupied each of us inside.\nThere is a lesser known, nonetheless extraordinary series by Ludmila published only after her death. Entitled Never Leave Me, this series departs from the vivid and highly detailed imagery that characterized her signature style. In fact, each of the highly abstract pieces in the series broods with the potent emotionality of infinite sorrow that seems determined to devastate the viewers, in what could only be described as a plea of desperation.\nFor whatever reason, Ludmila had chosen not to promote the series: it was only after her death that dozens of pieces bearing this title were discovered in her attic. Scholars have argued that the series was a surrogate to the artist’s yearning for a lover, but Ludmila’s private life remains so poorly documented as to render any speculation or theory impotent in the absence of conclusive evidence.\nBy the time of her death, Ludmila had placed all her work in the public domain, in order to allow its use by anyone. Soon, simulation games based on her planet series began surging onto the market. For many people seeking refuge from the chaos of everyday life, wandering through simulations of Ludmila’s planet became a widely popular form of leisure. An unreachable world though it may otherwise have been, people had come to consider Ludmila’s Planet their own utopia, a legacy of the beloved artist which would forever live in their imagination.\nThen the planet was discovered.\nA space probe exploring deep space transmitted data back to Earth one day. It included images of a small planet with an unusual orbit, located in a distant multi-stellar system. Analysis of the data suggested the possibility of life on the unknown planet. Regrettably, its astronomical distance from Earth and the limits of technology at the time prohibited verification of this possibility within a reasonable time frame. Nevertheless, the discovery caused one typically sleepy observatory to erupt like a batted hive.\nFor days on end, the observatory buzzed with talk of the planet. Barring the potential of faulty transmission, the implications of the data were too exciting. Indeed, the most that Earth’s deep space exploration program had produced thus far had been nothing more than the same old vague possibility of life on alien planets, but never any data as clear and forthright as this.\nFurther analysis revealed that the planet’s atmosphere was an exquisite mix of ammonia and methane, two gases that were easily broken down by the UV light of one of the nearby stars. Upon this insight took shape the dominant hypothesis, which was that the planet’s atmospheric composition necessitated the presence of carbon-based life on its surface. When scientists converted the probe-measured electromagnetic spectrum into visible rays, the whole planet was suddenly lit in an anodyne blue glow, making it look very much like . . . another Earth. Or perhaps a fantastical twin that might have existed in a parallel universe somewhere.\n“Doesn’t it remind you of Ludmila’s Planet?” said one technician, looking up from his boxed lunch.\n“What? No way . . . ” another balked, incredulous.\n“I mean, think about it. Precise and detailed measurements of her planet are preserved in simulations, which scientists have already used to verify the probability of its existence in real life. The data we received the other day . . . it’s consistent with the data we have for Ludmila’s Planet. Are you really trying to tell me that’s a complete coincidence?”\nAt this, others at the table set down their forks.\nThe staff at the observatory lay sleepless that night. It was true: the newly discovered planet’s observable data lent a new reality to Ludmila’s Planet, as the simulations she’d left behind predicted with perfect accuracy the world’s volume, mass, orbital period, diameter, and average surface temperature.\nCould it indeed be Ludmila’s Planet? If so, how on earth could she have known about it?\nWith astonishing swiftness, another stunning fact was discovered the following day: the planet, it turned out, had long ago gone up in flames when its parent star had flared up. The data they’d received had been collected mere moments before its explosion.\nThe technician who had initially confirmed the content of the transmission stood before the assembly of reporters and journalists, triggering a blitz of questions and camera flashes.\n“We’re looking at a planet that has been gone for a time now,” he said. “That is, Ludmila’s Planet, which once existed in a distant galaxy.”\nBut how could it be? Had Ludmila possessed some magical power that had allowed her to see into the distant past, if not the future? Was that even a viable theory in this day and age? Could everything instead just be an enormous coincidence? But then, what were the chances that an imaginary planet, flawlessly conceived though it had been by a massively gifted artist, was virtually identical to one later discovered in real life far off across the universe?\nEveryone hungered for the truth, but the one person who held the key had already departed from the Earth.\nAs news of the staggering discovery zipped around the globe, the midnight oil was burning bright near the lakeshore in Seoul’s Gwangjin District, at the Brainwave Research Institute.\nIt was two in the morning, but the building was bustling with weary employees making a last-ditch effort to meet the deadline, their collective anxiety spilling out into every hallway. In the staff lounge where the TV was on to fill the silence, breaking news of Ludmila’s Planet was airing to the rapt attention of no one.\nSeated at a corner table was Senior Researcher Soobin Yoon, still glaring at the same piece of document that she’d been clutching for a good hour. Her eyes felt ready to tumble out from their sockets. The progress review meeting was fast approaching, and she needed a modicum of cooperation from a machine that wouldn’t stop spewing wacky results. She shuddered at the thought of the subtle eye rolls and other signs of annoyance that she’d have to weather in the conference room. Was there anyone who wouldn’t be annoyed to hear that, “Life is overwhelming,” or “I miss my colleagues,” were the sort of thoughts that had been detected occurring inside the heads of two-month-old infants?\n“It was working fine just a month ago,” she sighed, addressing Hannah at the next table.\n“But the subjects were kittens then,” Hannah said, taking a break from her stack of documents. “These human infants are inscrutable.”\n“Kittens, infants . . . They cry when they’re hungry, sleepy, or scared. It’s all the same,” Soobin retorted.\nGiggling at this, Hannah said, “Who knows? Kittens may be more philosophical than human infants.”\nMaybe so. But the pressing issue for them now was decoding the cries of the infants. Accurately.\nThe Brain-Machine Interface Team was studying thought-to-speech interface technology, which captured neural activation patterns using monomolecular imaging technology and then converted them into speech. Conversely, speech could be reverse engineered to the original neural patterns—or thoughts—that had generated it, though the latter was still very much a work in progress.\nHumanity’s attempt to understand the brain had a long history, as did their desire to read another’s thoughts. Thus each breakthrough in neuroscience that had failed to deliver mind-reading technology nonetheless stoked embers of this longing in people’s minds. It was to this longing that the Brainwave Research Institute owed its continued, robust funding since its establishment at the dawn of the 21st century. Much had been gained in the cutting edge of neural decoding over the years, but it was the emergence of advanced imaging technology that hurried the research forward by finally allowing high-resolution recording of the smallest changes in a subject’s neural activity. Prior to this advancement, the interface technology had stalled out at a rudimentary level, success being correctly inferring whether a subject had been shown a picture of a scenic landscape or a food item based on their brain MRI readouts.\nThe paradigm-shifting breakthrough had come two years prior in the form of a monomolecular neural scanning technology, which made it possible to analyze brain activities at the level of the neuron. Promptly adopting this new imaging technology, the research team had achieved significant success over the intervening years. The new challenge now was to reverse-match speech to thoughts—or inner speech—yet to be processed into perceptible output. It was a task requiring a massive scanner, and mere minutes of speech took multiple days of tedious processing and analysis, but the technology’s unlimited potential kept everyone going.\nIn the preliminary study, which had involved the analysis of pet dogs’ and cats’ assorted vocalizations, the interface proved extremely effective, matching the animal subjects’ vocal expressions to corresponding desires with an accuracy rate of ninety-five percent. The canine subjects in the study wagged their tails with contentment when petted or given chew-toys according to their bark analysis. Before long, the technology’s commercial applications targeting mammals were green-lighted. Wealthy pet owners flooded the institute with phone calls pleading for an opportunity to have one final “conversation” with their dying pets. Unfortunately, such technology was still a long way off. If the research continued to make steady progress, however, a universal translator would be well within the realm of the feasible.\nThe research team then swiftly embarked on a new project involving human subjects. If the interface proved as effective for humans as it already had for other mammals, the obvious implications for those who lacked speech or motor function—not to mention language researchers mystified by some linguistic puzzle in an obscure language—were nothing short of incredible.\nThere was a great deal of hope and optimism during the initial data collection stage. It was true that the complexity of human thoughts and speech was expected to pose a challenge far greater than that posed by the previous animal study. As it were, the interface was still only capable of simple text output inferred from neural readouts, as opposed to, say, real-time transcription of a full-fledged conversation. But even so, there was the fact that its remarkable accuracy rate consistently measured at over eighty percent. Thus, it was implicitly understood by everyone that improving the system’s capacity for linguistic complexity was the next hurdle, though it seemed unlikely in the extreme that this challenge could threaten to derail the research itself.\nIndeed, another success followed when a pattern model was completed based on neural data collected from the adult subjects. The team then swiftly moved on to human infants. The trill of hope and excitement was undeniable in the voice of everyone who discussed it. Deciphering infant cries, even just approximately, would be a game changer for new parents and those currently toiling in the field of robot-assisted childcare research. The interface was bound to become an indispensable infant-care tool the world over—except that this time, the research ran into a brick wall right out of the gate.\nHannah, who had been in charge of the first round of analysis, entered the conference room with a data chip in hand. The mood in the room was buoyant with the hopeful anticipation of her colleagues.\n“The results are . . . very strange. They’re not the kind of thoughts we’d think infants are capable of thinking,” she said. Then, heaving a big sigh, she projected the results onto the screen.\nThe entire room fell silent. According to the interface, the infants had cooed and cried about the following:\n“How can we imbue a greater sense of morality in them?”\n“How are you all doing in there?”\n“No. This is our home now.”\nEveryone gaped at the screen, dumbstruck. The analysis was a complete mess.\n“It looks like data corruption,” Soobin said flatly.\nIt only made sense to question the purity of data, considering how the imaging system worked. At the current stage of innovation, decoding accuracy was still highly subject to the noise level in the input data, after all. Noise, environmental or otherwise, had a way of making its way into data no matter how vigilant the monitoring, which frequently resulted in a frustrating amount of time spent on filtering it out. In fact, the team had already run into a similar problem during the adult trials. It wasn’t a stretch to imagine that the data collected from infants would be more muddled, since their brains were still learning how to formulate a thought, let alone vocalize it.\nAround 14 months of age, the average human baby begins to absorb basic vocabulary with a striking efficiency, and is able to follow simple commands. From infancy to adolescence, a person’s cognitive development and linguistic development follow the same general trajectory, which is to say, one’s thought development is critically dependent on one’s language comprehension and vice versa. Hence, logic dictates that an infant’s thoughts cannot greatly surpass the level of his current language comprehension.\n“So it has to be noise,” Soobin repeated, “If the data were clean, we’d be seeing I’m hungry, I’m uncomfortable . . . that type of output. And not even in fully formed sentences. Simple registration of pain and other sensations is what we should be seeing here.”\n“That’s what I thought, too.” Hannah nodded in agreement. And then she ventured, “But noisy data alone can’t explain everything. Look at this analysis of older children just beginning to speak. Their speech and neural patterns are all over the place, too. ‘Mama, I want that’ was matched to ‘I long to feel connected to the world’ . . . ? How do we explain it?”\n“Hmm . . . Could it be because children’s neural activation patterns are so completely distinct from those of adults?” Soobin wondered.\n“Possibly,” Hannah said, her face darkening as she added, “And if that’s the case, then we’ll have to start it all over again.”\nAt that, the air in the conference room hung heavy with a sense of foreboding.\nThankfully, a problem identified was, usually, a problem half-solved. Soobin and Hannah set about sorting the collected thought-speech data by age group. Next, they separated the data of subjects whose language had yet to emerge. The effort drastically reduced the amount of available data, so a full day had to be spent on the phone while begging every cooperative agency for additional material. It was a chore they could do without, but surely it was more agreeable than accepting the results at hand and announcing to the world that babies babbled madly to themselves.\nThey’d placed a great deal of hope on the effort, but the results that came back were nonetheless demoralizing. It turned out that the infants’ brainwave patterns were far more intricate than they’d had imagined, suddenly making it seem trivial by comparison to scrutinize the adults’. In fact, the other team, which had continued with the adult study, was enjoying smooth sailing. Having already mapped onto the interface the large database of neural patterns collected from adults with no speech or language difficulties, they were currently working on teasing out speech from the brainwaves of adult subjects who’d lost the ability to speak for various reasons. In sad contrast, Soobin’s team was still troubleshooting for the initial findings that indicated infants engaged in philosophical musings. No matter how many times they duplicated the entire process, though, the results remained consistently baffling.\n“These babies . . . ”\nClutching at her head in frustration, Soobin plopped down on the sofa.\n“ . . . complicated, deep little philosophers, they are,” Hannah said.\nHad they underestimated the challenge? Could it be that the mysteries of the human brain were simply too complex for them to unravel? Soobin was at a loss, completely.\nSensing that she was left with no other recourse, Soobin began talking with Hannah about the fate of the project, and whether a course correction was necessary to save it. Despite everyone’s efforts, the problem of the philosophical babies seemed insoluble. In the end, it was determined that the project should be redesigned at the next progress meeting. Enthusiasm dwindled, and the project began petering out when an unexpected development diverted it from its course once again.\n“Soobin, could you take a look at this?” Hannah said, presenting her with a stack of analysis results she’d printed out. Her lips pressed together, she looked oddly intent. Taking the stack from Hannah, Soobin began scanning the pages, before clapping it shut within a minute. This couldn’t be right. She couldn’t take seriously what her eyes had just told her. It felt like she was reading a tabloid.\n“What’s this? What is it supposed to mean?” she accused.\n“It’s supposed to mean what it means. These are the results of the infant babble analysis,” Hannah said, “Do you remember that day? Ludmila’s Planet had just been discovered. The data captured on that day are all like this.”\nSoobin remembered, of course. It was on that day the two had first begun to debate the viability of the infant project. While she’d continued fussing over the puzzling results, Hannah had begun a new analysis with the remaining data, the staggering results of which were contained in the printout that Soobin now clutched in her hands.\n“What on earth . . . ” Soobin stared at the strings of letters.\n“This is where we’d all begun.”\n“I miss our planet.”\n“Ludmila!”\n“Ludmila!”\n“Ludmila!”\n“Ludmila painted the place exactly as it was.”\n“I miss it!”\nAs Soobin stood there with her mouth open, Hannah emphasized how many times she’d already verified the results.\n“I couldn’t believe it myself, which is why it took me a little while to share it with you. Every infant was occupied by these thoughts that day.”\nWith that, she produced an additional report containing the analysis results of reams of data she’d personally pored over, which had been initially rejected by the team for being corrupt and unusable. Working on the assumption that the data was, in truth, free of noise, Hannah had isolated the units of meaning that emerged repeatedly. The resulting chart at hand incorporated the infant thought-speech model that had been scrapped for being an utter failure. Once again, the analysis had found that some bizarre conversations were taking place inside the heads of these infants. These conversations, not to be outdone by the notion itself in their oddity, appeared to be thoughtful and, at times, lively exchanges between multiple voices in the brain.\n“You OK? I just heard a racket.”\n“No worries. Mr. clumsy just knocked over a chair, that’s all.”\n“I bet his eyes were glued to the screen.”\n“Are you already dreaming of the sea?”\n“Oh, I’d love to end up in the sea someday.”\n“This data right here? It’s from one infant, from the same time frame—as you can see,” Hannah pointed out. “It’s as if multiple beings coexist inside the infant’s brain. Please, stop looking at me like that and hear me out,” she urged, turning the page for Soobin. “I extracted the interpretations that showed up repeatedly and then sorted them out. And I took care of the post-analysis, in case you’re wondering. Look.”\nIt was true. There were multiple participants in these conversations, all of whom were speaking with the tenderness and devotion of a caregiver. They talked about morality. They talked about life. They talked as though they were co-parents, every one of them nurturing and looking out for the infant. These results all but pointed to a conclusion that Soobin herself would be hard-pressed to accept. Stunned speechless, she listened to what Hannah still had to say.\n“Something’s present inside their brains,” Hannah concluded. “Something not human. These occurrences can’t be explained without introducing an external entity.”\n“It must have been noise in the data,” replied Soobin in a tight voice.\n“Noise can’t account for it. The conversations are persistently and deeply coherent. How likely is it that noise interruptions turned into discussions of morality, ethics, altruism, and all that? Isn’t that more absurd to imagine?” Hannah persisted.\n“But . . . How? The data had come from thousands of infants, each one an individual. And you’re saying that, inside each of those little heads resides some force that acts like a parent?”\n“If not, then how do you explain what you see?”\nGiven her radical-leaning perspective on many subjects, it wouldn’t be the first time Hannah had offended others’ sensibilities. Still, when it came to that, this current argument was her best effort so far.\n“All I’m saying is . . . ” Soobin began, only to realize she had nothing to follow it up with. Composing herself for a few moments, she said, “A foreign presence inside the infants’ brains? Some intelligent entities that aren’t human?”\n“It’s the only plausible explanation,” Hannah replied.\nSoobin decided to spare the team Hannah’s lunacy for now. Speculations of some force occupying the infant brain . . . Of course, such an idea didn’t stand a chance. And yet, when she finally decided to give her colleague’s argument due consideration in all its absurdity, intriguing patterns began to leap out at her in a way that they hadn’t just a few hours earlier. For one, she could now see that, among babies and toddlers on the verge of speech, there was a complete lack of congruence between the measured neural patterns and their outward expressions—specifically, the infants’ cries, babblings, and simple utterances. When fed through the interface, the neural patterns of these very young subjects consistently produced highly sophisticated and intellectual speech output, which could only be understood as exchanges between multiple mature voices inside the brain. It was just as Hannah had said.\nSoobin and Hannah began referring to the voices as “them.” They discussed feelings and thoughts, love, and empathy. They clearly seemed to want to teach the infants something.\nMoving on to young children, the two scientists reorganized the large amount of speech data they’d collected, sorting them by age. Were there distinct conversations taking place beneath all the “mommy,” “daddy,” “I want that,” and so on? Their analysis showed a mix of the children’s surface communications and the conversations among them. Curiously, these two-tiered conversations seemed to vanish at around age seven, following years of gradual retreat that began at approximately three years of age, with some variation between individuals. It was as though the internal voices gradually withdrew until the child became fully communicative, at which point they seemed to bow out completely.\nThese notions kept Soobin up at night. Even now, she and Hannah had kept the theory to themselves. Day in and day out, she labored through additional data in search of a clue that might help reveal their identity. Colleagues who’d noticed the pair beginning to look increasingly sapped and haggard expressed concern by gently reminding them that “it was what it was”, or that it was the nature of science to progress through trial and error, and so forth.\nYet even as she persevered, Soobin didn’t completely rule out the possibility that everything might still turn out to be a massive decoding error. Still, the more data she analyzed, the clearer it became that there was only one possibly true conclusion: the analyses were accurate, and inside the infant brain, they existed.\nBut where did they come from? How did they settle in the brain? And why do they leave when they leave? What was the tangible proof of their presence? And then, one day while reclining on the sofa in the back of the staff lounge, it struck her.\n“The box children!” she blurted out loud. This jolted Hannah, who had been nodding off nearby, into wakefulness.\n“ . . . What?”\n“A few years ago, there was an experiment conducted to see if human touch was absolutely necessary for normal infants development. Do you remember?”\nHannah’s eyes began to widen as if slowly registering something.\n“Of course . . . yeah, the experiment with infant-care robots . . . ”\n“Their data may be useful to us.”\n“How?”\nThe so-called “box children experiment” had been conceived to test the efficacy of infant-care robots. In the experiment, infant subjects had been kept isolated from the outside world for the duration of the study, to be raised in the lab solely by caregiver robots. All other variables had been kept constant. Some researchers had speculated that the babies’ experience shouldn’t be too different from an extended tenure inside a giant incubator. After all, the ethics committee had given the research project its stamp of approval, which was supposed to have reassured everyone that no infant’s well-being was going to be compromised in any way. Still, this approval did little to mute the concerns surrounding its design. When the findings were finally published, the project once more attracted harsh international criticism.\n“It was such a huge mess,” Soobin sighed.\n“I remember.” Hannah nodded gravely. “By the end of the experiment, the subjects were found to act purely on instinct, their growth in the affective domain having been completely stunted over the course of the experiment. It was a big relief to hear that many were successfully rehabilitated and socialized later on, after the experiment finished.”\n“The experiment should never have gotten approved,” Soobin said, her gaze fixed on the empty air before her. “On the other hand, I still have some unanswered questions about it,” she continued, turning to Hannah. “Caregiver robots are designed to deliver optimal stimulation. Why does a simple lack of flesh and blood affect the infants’ socioemotional development so profoundly? I have to wonder if there’s more to what the finding seems to suggest. If anything, we, humans, are imperfect caregivers given to personal moods and circumstances. So . . . maybe there’s some connection with whatever caused the robot-reared infants to fail to thrive . . . ”\nWhat if they gained entry into the infant brain at some point after birth, in the way of parasites and microbes—as opposed to in utero? Like viruses, they could be lurking in the air, or otherwise widespread throughout the environment. Even so, there had to be a specific point of access for them. What if the box children had never gotten the chance to be exposed to them because they’d been locked up inside the lab? Hannah shot up from her chair.\n“There must be recordings. We need to analyze their cries,” she said.\nIt took no effort at all to find relevant video files online, each trailing an endless comment section crammed with condemnations and disapproval of what the viewers considered a cruel and morally detestable experiment.\n“How dare you leave these babies alone with robots, you monsters!”\n“Babies NEED a warm and caring HUMAN touch! You’re raising androids devoid of humanity!”\nHowever, the question of whether or not the caregivers had been human might ultimately have been of little consequence. That is, if one could allow the possibility that they were the ones outfitting human infants with their humanity, and that, perhaps, what we’d considered our innermost human qualities ultimately originated from outside of us.\nSoobin felt ready to turn her gaze outward for proof. She began to enter the audio data extracted from the videos into the interface. To the naked ears, the infants’ cries were indistinguishable from the cries of other babies. But their presence or absence amongst the box infants would soon be verified by the output of the interface, which would, in turn, disprove or validate the hypothesis that the crucial factor determining humans’ socioemotional development was them. Had they been absent among the box infants, as the two suspected, the interface would display only the infants’ requests, minus the veiled conversations attributed to them.\nThe software commenced its analysis. There was nothing for Soobin and Hannah to do but wait for the results to load up. The first round of analysis produced units of meaning that remained too abstract and incoherent to make sense of. With a trembling hand, Hannah initiated the final decoding process, whereupon the algorithm began arranging the discrete units into sentences. Soon after, the final results appeared on the screen. The cries and coos of the box babies in the videos had apparently been concerned with the following thoughts:\n“I’m hungry.”\n“I’m sleepy.”\n“I’m scared.”\nSoobin and Hannah turned to each other, unsure of how to feel about this. Should they rejoice in their victory? Or should they be aghast at the overwhelming implications?\nIndeed, what had been fired by the synapses inside the heads of the box babies couldn’t properly be called thoughts. They were intense needs driven by pure instinct, which in fact was what anyone would have expected of such young babies. Mere days old, and having been kept in the laboratory since birth, these babies had yet to be exposed to them. Thus, their brains had generated only the neural patterns associated with typical infantile desires tailored for survival—the kind of neural patterns Soobin and Hannah had also previously expected to find in all babies who had yet to acquire speech, and thus, had yet to begin contemplating life and the world.\nBut Soobin knew now what the absence of those neural patterns must have meant for these newborns isolated in the lab. It meant that they would miss the milestones their peers out in the world would soon begin to meet, one after the next.\nLet us indulge in a truly bizarre supposition: imagine that, unbeknownst to us, an extraterrestrial species has existed in symbiosis with humanity for millennia. After all, parasitic bacterium had to enter cells before beginning their permanent symbiosis with the host cells, all the while evolving into mitochondria containing its own DNA. In truth, this sort of arrangement is commonplace in nature, where organisms from two different species often live in a close, dependent relationship. Humans, for one, share a symbiotic relationship with a myriad of microbes living inside of us. We don’t consider them invaders. They are already an inalienable part of us.\nBut what if one of our partners in symbiosis was not native to the planet Earth? What if it had hailed from another planet, tens of thousands of years ago? What if it had settled into our brains to rule over our childhoods and infect us with its ethics? What if the unique qualities we’ve forever believed separated our species from all other beasts of the world were, in fact, not quite so intrinsically human?\n“So . . . the traits we’ve prided ourselves for possessing all along are actually alien traits?” the team leader observed as Soobin finished presenting the theory. Among the rest of the team’s members, responses varied. Some gaped at the results, while others rejected the theory point-blank.\n“It’s too unorthodox! Nobody would take it seriously,” someone remarked.\n“I’m still having a hard time believing it myself,” Hannah conceded, “But how can we deny the data?”\nMeanwhile, Soobin was itching with the desire to probe further into the infant brain. If it was true that they had taken up residence in there, shouldn’t we be able to observe them somehow? What might they be composed of? Shouldn’t there be something—anything—that we could measure? Of course, it was unlikely that she would get the chance to satisfy these queries any time soon. Probing the brain of a live subject raised significant ethical issues. Plus, blindly poking around in brain tissue in search of a speculative life-form whose material properties they knew nothing of wasn’t likely to result in any groundbreaking discovery. Most saliently, if they so readily rendered themselves to human inspection in the manner of parasitic organisms, then wouldn’t medicine have already discovered them long ago?\n“I’d be shocked if we could observe them. If they had a physical basis we could detect, they would have been discovered ages ago, sometime during the long history of anatomical science,” said the team leader, voiding any half-hope that might have lingered. He was right, Soobin knew, and she nodded in resignation. Still, she would have stared at a sample all day long, if one had been made available for her inspection.\nThere was no shortage of other queries to mull over yet. Symbiotic coexistence didn’t always involve a mutually beneficial relationship. In some cases, one party benefited while the other was unaffected, and in others, one party actively harmed its partner for a unilateral gain. What was the nature of our symbiosis with them? What did this enigmatic species gain from operating inside a developing human brain? Might they be a carbon-based life-form, like humans were? What could they reap from presumably inculcating ethics and altruism in humans? And why had they chosen us, among all the species of the world?\n“I happen to think that they’re space refugees who found a new home in our planet,” Hannah said. Despite the raised eyebrows of her colleagues, she continued, “They repeatedly refer to Ludmila’s Planet as ‘home,’ and we know for a fact it went up in flames a long time ago . . . ”\nLudmila’s Planet. A planet conceived and described in impossible detail by the eponymous artist. The idea that it could have been their home in some ancient eon might just be the clue leading to the truth of their being.\nIf these beings were so advanced as to manipulate the human species, it stood to reason they ought to have been able to predict their planet’s demise and evacuate in time. After that, while wandering about in space in search of a new home, they had arrived on planet Earth one day . . . and the rest was history.\n“Their conversations clearly suggest exquisite intelligence,” said Soobin. “So much so that I have to wonder if a great deal of intricacy isn’t getting lost in translation due to the limitations of our own language. They’re likely a far superior species to humans, or that’s what I think. But then again, they seem entirely reliant on human neural networks. Could it be that they are a species that requires a host in order to actualize their intellect? That might explain why they chose the human species. For all its mystery, the human brain is known to be the most efficient on the planet, and if they’d discovered us tens of thousands of years ago, it is conceivable that the symbiosis triggered the birth of civilizations and the whole cascade of human evolution. Even if it hadn’t been their original intention to enlighten us, their intelligence could have been transferred to us over the long course of symbiosis.”\nThe room had fallen silent. If the symbiosis was truly as old as human history, there must be ample evidence outside the walls of the lab. In fact, there might be evidence everywhere, hiding in plain sight across human civilization, Soobin supposed.\n“What if we ask them directly?” someone suggested.\nThe same thought had crossed Soobin’s mind, and probably the minds of a few others in the room as well. However, the prospect of actually doing so was dismal. The current research involved children. It was one thing to analyze the raw data collected from children going about their business in their natural environment, but a whole different proposition to attempt to connect with an enigmatic presence supposedly inhabiting their brains. It was anyone’s guess what sort of reward or punishment an attempt like that might provoke, and there was no guarantee that the gesture wouldn’t be perceived as hostile. In fact, how likely was it that they would welcome our sudden interrogation following millennia of unauthorized inhabitation inside of us? Any rash attempt risked inviting irrevocable harm.\n“Following that line of thought . . . are we sure that they’ve actually left our brains?” someone asked, apparently bothered by a similar concern.\nIn the end, this risky proposal was rejected, and Soobin devised a new plan. If they had hailed from Ludmila’s Planet, then exposing them to paintings and simulations of their long-lost home should elicit some very particular responses. The danger it posed to the hosts was zero, as evidenced by the fact that no infants exposed to the breaking news on that day had been harmed by it. If anything, the data to be generated in this experiment ought to help illuminate the mysteries of these beings.\n“It’s as we’ve predicted. The level of neural activity it triggered is . . . off the charts. We can barely keep up with the data stream.”\nIt was just as Hannah had suggested: when exposed to footage of Ludmila’s Planet, the infants ceased all fidgeting and fussing, their eyes silently tracking the moving landscape in rapt attention. Inside their brains, however, they seemed to be erupting with excitement, in a storm of discussion so lively, complex, and dense with information that its analysis became an unprecedented challenge. There was no doubt they were intimately connected to the Planet.\nThe question was whether or not to publish these findings yet.\n“If we don’t, someone else will. We’re not the only ones pursuing a universal decoder. It’s extremely unlikely that other researchers won’t test it on infants, if they haven’t already,” Hannah said, “Even if people are appalled by the idea that extraterrestrials take up residence in infant brains, I don’t see how the knowledge would change anything anyway. Would it even be possible for us to suddenly evict them?”\n“It wouldn’t do us any good,” Soobin said. Looking around the room, she continued, “I’m not alone in thinking that we’re the ones who should be begging them to stay, am I? Without them, we’d lose everything that we’ve forever believed made humanity unique!”\n“Hmm . . . but how strong is our ego, as a species?”\nSomeone raised an important point, then. “Perhaps it’s hard for us to stomach the idea because we view ourselves as completely distinct from them? Would it make a difference if we found, in adult brains, some remaining vestige of their presence carried forward from childhood?”\nIf they’d left their fingerprints all over a child’s development while living inside her developing brain, her mature brain might still possess some evidence of the fact. Still, no neural patterns suggestive of them had been observed in an adult brain so far.\n“This is just a hunch,” the team leader chimed in, “But they seem quite reluctant to leave the host at childhood’s end. Phrases like, ‘It’s difficult, but the time has come for us to leave,’ have come up more than a few times.”\n“Yes, I know,” Soobin concurred. Then, pointing to the chart she’d been looking at, she continued, “Plus, I can’t stop thinking about the timing of their departure. Clearly, seven years of age bears some significance, given that’s when they seem to leave us for good. The data’s consistent. Only children seven years or younger exhibit neural patterns indicating their presence. After that, there’s nothing.”\nFor it was at the age of seven that, according to the chart, intercranial conversations disappeared completely. It was at this point that children’s neural signals and speech came to mirror each other perfectly, just as with adults. This suggested that they stayed inside human brains from infancy to early childhood before packing up shortly after the seventh birthday.\n“I’m wondering if we could connect this to childhood amnesia. Very few of us are able to recall much of what happened during our formative years,” said Hannah. “The established theory holds that rapid development of the hippocampus around this age is responsible for the phenomenon—that a high rate of neurogenesis in the hippocampus somehow destabilizes the existing long-term memory.”\nThis much was true: by the time a child reaches the age of seven, most of his or her memories of earlier years, autobiographical memories in particular, have faded. Few adults, if any, remember events occurring between infancy and early childhood. Those who claim to are, in fact, most likely to be relying on false memories formed on the basis of what they heard about the event from others.\n“But a little while ago, I read an interesting report in a neuroscience journal that disputed this theory,” Hannah continued. “Apparently, some researchers used the newest imaging technology to peer into the brains of kids around the time when childhood amnesia kicks in. What they discovered was that the rate of their neurological development and the degree of amnesia experienced didn’t track at all. There was zero statistical significance.”\nSomeone looked up the paper online and shared it to the room’s screen.\n“The authors vaguely argued for an external cause, though they sounded pretty puzzled themselves. It’s surely a controversial finding that triggered a stream of papers disputing it. But if it’s true that childhood amnesia isn’t caused by rapid neurodevelopment, and that it can actually be attributed to an external factor . . . then what’s the external factor? What is it that’s taking away our memories? I have to wonder . . . ”\n“It’s them,” Soobin chipped in. “They take it away with them when they leave us.”\nIn terms of their theory, what was most unexpected of all was Ludmila’s role.\nShe was the only human being who had retained any memory of them beyond early childhood. After all, she had only begun working on her planet series in earnest as an adolescent. This fact seems to suggest they might have remained within her and continued influencing her personality. That the planet had never ceased to be the subject of her art, and that she had been able to furnish exact and scientific detail regarding the planet (including its mass, volume, and so forth) seem to indicate two distinct possibilities: that she had been permitted to continue listening in on their conversations, or that their collective memory had been transferred to her in its entirety when, or if, they left her.\n“Perhaps they stayed with each and every human being on Earth, but only Ludmila was let in on the truth of their origin?”\nInvestigation into Ludmila’s life unearthed nothing but the well-established fact that it had been a lonely one; in stark contrast to her colossal fame as an artist, precious little was known about her as a person.\n“She had been an exceptionally creative child. And as creative children often are, she, too, must have been a sensitive soul inclined to introspection—which may have caused her to become aware of their presence early on. They might have taken special care of her, seeing that she really was alone in the world.”\nThus, in the end, it turned out that Ludmila had never once lied about her work after all. From the very beginning of her career as an artist, she had simply transferred to canvas the landscape they’d held up before her, inside her brain. Her mind eventually came to contain the entire planet as they remembered it, far beyond just the fragments of its landscape. In every practical sense, she had visited the planet—through them, with whom she’d shared a brain all her life.\n“Ludmila’s memories of the planet may have been enhanced through the act of painting it,” Soobin said. “Motor memory may have boosted her episodic memory of the planet and vice versa, as the two types of memory are distinct, but not entirely separate.”\n“Given how they abscond with childhood memories when they take their leave of the host, they seem extremely cautious about revealing themselves to humanity. But then, why risk exposure by encouraging her to recreate the planet through her work?”\n“Well, their conversations make it clear that their planet is incredibly dear to them,” Soobin said. “I mean, whose home isn’t?”\nTo that explanation, nobody offered any objection.\nAlien refugees, still mourning the loss of a homeworld that had been pulverized into cosmic dust eons ago . . . perhaps they just wanted for someone in their adoptive planet to carry its memory, even if all the rest lived in blissful ignorance. And they had found that person in Ludmila, who, with her capable hands, was able to resurrect it back to life in all its beauty.\nA planet that had existed tens of thousands of years ago.\nThe team arrived at the ultimate question. What was it that caused people to obsess over Ludmila’s world, a place about which they themselves knew nothing? What was it about her world that moved everyone to tears—why such unexpected melancholy and longing for a place they had never even seen before? Of all the countless simulated worlds created during human history, why was it that Ludmila’s Planet alone had managed to leave such a powerful impression in the minds of people worldwide?\n“Because each of us has served as a host to them before,” Hannah said.\nAnd there lies the proof of this proposed symbiosis, Soobin thought to herself. A wholly amorphous memory, flickering at the edge of our consciousness, without ever vanishing completely. It was our vague yearning for those who had shaped us into who we are.\nWhat people yearned for through Ludmila’s mesmerizing work was not the planet itself, but its former inhabitants who had once cared for them.\n“That other series. Do you all remember? There’s another series by her,” Soobin said.\n“Never Leave Me. It’s not as widely known, but just as beautiful, if you ask me.”\n“Yes. That’s the one.”\nIt occurred to Soobin that the series, which remained largely indecipherable, might hold the key to Ludmila’s veiled interior.\n“Perhaps it was Ludmila’s plea?”\n“Plea?”\n“Ludmila had become aware of their presence, and . . . ”\nWithout warning, a wave of emotion crashed over Soobin in that moment.\n“It was her plea to them. Its title, and the infinite tenderness, sorrow, and loneliness that it stirs in people . . . Ludmila had lived her life in perpetual solitude. Their companionship must’ve meant everything to her: they were her only friends, family, and colleagues.”\nShe had been begging them not to leave her. Not to take away from her their world and its splendor. Please, oh, please, to stay with her forever.\n“So they stayed,” Hannah mumbled to herself. Her voice was the only sound in the room, where every occupant was presently picturing the same place in their minds: that planet, awash in its mystical blue glow. Ludmila’s Planet. The ancient home of the unknowable beings, our partners in symbiosis for all these tens of thousands of years. In that moment, Soobin found herself seized by a wholly unexpected sense of grace. It felt somehow like a longing . . . for someone she’d never met before.\nOriginally published in Korean in Crossroads, January 2019.\nPublished with the support of Literature Translation Institute of Korea (LTI Korea).\nChoyeop Kim is an award-winning Korean science fiction author with a background in biochemistry. She enjoys converting intangible ideas, such as memory, emotion, minds, and relations into tangible items. She wants to write about the abstract components of life in a specifically scientific language while discovering new questions in the process.", "source": "https://clarkesworldmagazine.com/choyeop_12_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Symbiosis Theory by Choyeop Kim, translated by Joungmin Lee Comfort"}