{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ts+gNBwfJihOhOJ/XBYGVoovID8=", "id": null, "license": null, "comments": "", "raw_text": "Interview  A Hellhole of Our Own Making: A Conversation with Brian Herbert & Kevin J. Anderson  Brian Herbert and Kevin J. Anderson have been writing together since the late 1990s. They've both had active solo careers in addition to their Dune collaborations.  Brian Herbert is the author of such novels as Sidney's Comet, Prisoners of Arionn, and Sudanna Sudanna. He points to his Timeweb Chronicle novels as a landmark in his solo career.  \"Each time I begin a solo novel I think I am subconsciously trying to write a landmark work, a piece of fiction that is about important political, religious, or environmental issues, where the stakes are big and my characters are faced with daunting challenges,\" said Herbert. \"The three Timeweb novels cover a very large canvas, and the stakes are immense: our entire galaxy is faced with an ecological crisis of massive proportions, and the very fabric of existence is disintegrating. This series goes beyond the idea of environmental issues being confined to one planet, and extends them into the far reaches of space.\"  Herbert has also written a book about the Merchant Marine and a biography of his father, Frank Herbert, the creator of the Dune universe.  Kevin J. Anderson is the author of more than thirty science fiction, fantasy, and media tie-in novels. In addition to creator owned settings, he's contributed to the Star War Expanded Universe, the X-Files, Forgotten Realms (forthcoming), and DC Comics universes. He points to his sweeping Saga of the Seven Suns as a landmarks.  \"The Saga of Seven Suns is a seven-volume epic that pulls together everything I love about the science fiction genre,\" said Anderson. \"[It's] a sprawling saga that, really and truly, takes seven big novels to tell.\"  The Key to Creation, the third novel in Anderson's epic Terra Incognita series comes out this summer.  After eleven books set in the Dune universe (with the twelfth on the way), Brian Herbert and Kevin J. Anderson \"felt ready to branch out into a universe of our own making.\"  In many ways, they are three writers: Brian Herbert, Kevin J. Anderson, and Herbert/Anderson. Below, they answer together and individually, offering another layer of insight into their collaborative and creative process.   What do you enjoy about writing? What do you not enjoy?  The creative part, the development of the story, the worlds, the characters. We love to brainstorm our stories, see how the plot-pieces fit together, and then write the first drafts. That's the real stimulating part. By the tenth draft, though, and proofreading the typeset pages, our imaginations are ready to move on to something else!  What do you admire about each other's work?  We enjoy having the same vision, building universes together, telling grand stories that take the two of us to explore thoroughly. Brian has a strong background in philosophy and comparative religions, which adds depth to the Dune novels, as well as Hellhole. Kevin has a science background, and a great track record in world-building and action sequences. We're both very good at plotting.  How you divide up the work when collaborating?  We get together for several intensive days of brainstorming and plotting, where we work out the characters and storylines, face to face. After we hammer out the detailed outline, chapter by chapter, side by side, we then decide which chapters, plotlines, and characters we each want to write. Then we go off to our separate corners and write the first drafts of the chapters.  After we've written our own chapters and all the files are compiled into a complete manuscript. All the chapters come together like pieces of a puzzle. One of us does an edit straight through, from start to finish, then transfers it to the other, who then goes over the manuscript from start to finish. The manuscript goes back and forth 7-14 times, as long as it takes to get it polished to our satisfaction.  How has your understanding of the novel form—and perhaps the genre—changed since your first efforts?  We've grown more ambitious, building more intricate storylines with an even larger cast of characters. It's quite an intricate dance to control a giant story with dozens of main characters, a choreography of many players and settings to tell a genuine epic.  What, ultimately, is Hellhole about?  At its core, this is a pioneer story, based on the expansion of the American West, when desperate and optimistic people of all stripes struck out into rugged, inhospitable terrain to find a new home for themselves. In Hellhole, a group of new \"habitable\" worlds are opened for settlement, for those who want to get far away from a repressive and corrupt galactic government. Not all of the new colony worlds are garden spots . . . and the planet called Hallholme (\"Hellhole\") is at the bottom of the list. It's run by an exiled but extremely competent deposed general, whose rebellion failed, but he does manage to keep the lights on and the water running.  What came first with Hellhole?  The initial idea was of colonists trying to settle a planet that was still suffering the aftereffects of an extinction-event asteroid impact, such as what wiped out the dinosaurs and 95% of the species on Earth. Such a planet would be a clean slate ... but not a very pleasant place to be. We wanted to set a story there. Then the character of General Adolphus took over the story and guided our plotting from there. We also had a unique idea about how to deal with a lost, ruined alien civilization. Everything came together, and the major ideas sparked off of one another.  Why a hellhole? Why not, say, a paradise or utopia?  \"The colonists all traveled to a beautiful, pleasant place and lived happily ever after.\" Not a very exciting novel!  What part of Hellhole would you like to visit? What part would you least like to visit?  The slickwater pools with echoes of the alien civilization seem the most fascinating, and we can see why desperate colonists would find them tempting. As for bad places, Hellhole has so many of them! Maybe the least desirable spot would be the center of the original impact crater.  What makes General Adolphus tick?  In many novels, Adolphus would be cast as the villain, an ambitious Napoleon-esque general who's been overthrown. But he's the sort of determined, capable character who can actually keep a colony alive under the most difficult circumstances. When you see what he's gone through, you can definitely sympathize with him.  And how about Diadem Michella?  Diadem Michella, the queen of the galactic empire, is a very sweet old lady, like everyone's grandmother or favorite schoolteacher — and she's the most vile and corrupt leader imaginable. Quite a contrast to General Adolphus.  What's next for the series?  Hellhole is a trilogy, and we have the major events mapped out — beginning, middle, and end — before we started writing the first novel. On the 13-city Hellhole tour, we spent a lot of time plotting Hellhole #2, which is our next project, now that we've finished The Sisterhood of Dune.  And what's next for each of you?  Herbert: I recently completed a solo novel that is very original and high-concept. One literary professional whose opinion I value highly told me that the story is packed with ideas, and makes him think of some of the most imaginative works in science fiction and fantasy. It is a thought-provoking novel, and I hope my readers enjoy it.  Anderson: The third novel in my Terra Incognita fantasy trilogy, The Key to Creation, comes out in July, and I am starting work on three more novels set in the Seven Suns universe.  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nA Hellhole of Our Own Making: A Conversation with Brian Herbert & Kevin J. Anderson\nBrian Herbert and Kevin J. Anderson have been writing together since the late 1990s. They've both had active solo careers in addition to their Dune collaborations.\nBrian Herbert is the author of such novels as Sidney's Comet, Prisoners of Arionn, and Sudanna Sudanna. He points to his Timeweb Chronicle novels as a landmark in his solo career.\n\"Each time I begin a solo novel I think I am subconsciously trying to write a landmark work, a piece of fiction that is about important political, religious, or environmental issues, where the stakes are big and my characters are faced with daunting challenges,\" said Herbert. \"The three Timeweb novels cover a very large canvas, and the stakes are immense: our entire galaxy is faced with an ecological crisis of massive proportions, and the very fabric of existence is disintegrating. This series goes beyond the idea of environmental issues being confined to one planet, and extends them into the far reaches of space.\"\nHerbert has also written a book about the Merchant Marine and a biography of his father, Frank Herbert, the creator of the Dune universe.\nKevin J. Anderson is the author of more than thirty science fiction, fantasy, and media tie-in novels. In addition to creator owned settings, he's contributed to the Star War Expanded Universe, the X-Files, Forgotten Realms (forthcoming), and DC Comics universes. He points to his sweeping Saga of the Seven Suns as a landmarks.\n\"The Saga of Seven Suns is a seven-volume epic that pulls together everything I love about the science fiction genre,\" said Anderson. \"[It's] a sprawling saga that, really and truly, takes seven big novels to tell.\"\nThe Key to Creation, the third novel in Anderson's epic Terra Incognita series comes out this summer.\nAfter eleven books set in the Dune universe (with the twelfth on the way), Brian Herbert and Kevin J. Anderson \"felt ready to branch out into a universe of our own making.\"\nIn many ways, they are three writers: Brian Herbert, Kevin J. Anderson, and Herbert/Anderson. Below, they answer together and individually, offering another layer of insight into their collaborative and creative process.\nWhat do you enjoy about writing? What do you not enjoy?\nThe creative part, the development of the story, the worlds, the characters. We love to brainstorm our stories, see how the plot-pieces fit together, and then write the first drafts. That's the real stimulating part. By the tenth draft, though, and proofreading the typeset pages, our imaginations are ready to move on to something else!\nWhat do you admire about each other's work?\nWe enjoy having the same vision, building universes together, telling grand stories that take the two of us to explore thoroughly. Brian has a strong background in philosophy and comparative religions, which adds depth to the Dune novels, as well as Hellhole. Kevin has a science background, and a great track record in world-building and action sequences. We're both very good at plotting.\nHow you divide up the work when collaborating?\nWe get together for several intensive days of brainstorming and plotting, where we work out the characters and storylines, face to face. After we hammer out the detailed outline, chapter by chapter, side by side, we then decide which chapters, plotlines, and characters we each want to write. Then we go off to our separate corners and write the first drafts of the chapters.\nAfter we've written our own chapters and all the files are compiled into a complete manuscript. All the chapters come together like pieces of a puzzle. One of us does an edit straight through, from start to finish, then transfers it to the other, who then goes over the manuscript from start to finish. The manuscript goes back and forth 7-14 times, as long as it takes to get it polished to our satisfaction.\nHow has your understanding of the novel form—and perhaps the genre—changed since your first efforts?\nWe've grown more ambitious, building more intricate storylines with an even larger cast of characters. It's quite an intricate dance to control a giant story with dozens of main characters, a choreography of many players and settings to tell a genuine epic.\nWhat, ultimately, is Hellhole about?\nAt its core, this is a pioneer story, based on the expansion of the American West, when desperate and optimistic people of all stripes struck out into rugged, inhospitable terrain to find a new home for themselves. In Hellhole, a group of new \"habitable\" worlds are opened for settlement, for those who want to get far away from a repressive and corrupt galactic government. Not all of the new colony worlds are garden spots . . . and the planet called Hallholme (\"Hellhole\") is at the bottom of the list. It's run by an exiled but extremely competent deposed general, whose rebellion failed, but he does manage to keep the lights on and the water running.\nWhat came first with Hellhole?\nThe initial idea was of colonists trying to settle a planet that was still suffering the aftereffects of an extinction-event asteroid impact, such as what wiped out the dinosaurs and 95% of the species on Earth. Such a planet would be a clean slate ... but not a very pleasant place to be. We wanted to set a story there. Then the character of General Adolphus took over the story and guided our plotting from there. We also had a unique idea about how to deal with a lost, ruined alien civilization. Everything came together, and the major ideas sparked off of one another.\nWhy a hellhole? Why not, say, a paradise or utopia?\n\"The colonists all traveled to a beautiful, pleasant place and lived happily ever after.\" Not a very exciting novel!\nWhat part of Hellhole would you like to visit? What part would you least like to visit?\nThe slickwater pools with echoes of the alien civilization seem the most fascinating, and we can see why desperate colonists would find them tempting. As for bad places, Hellhole has so many of them! Maybe the least desirable spot would be the center of the original impact crater.\nWhat makes General Adolphus tick?\nIn many novels, Adolphus would be cast as the villain, an ambitious Napoleon-esque general who's been overthrown. But he's the sort of determined, capable character who can actually keep a colony alive under the most difficult circumstances. When you see what he's gone through, you can definitely sympathize with him.\nAnd how about Diadem Michella?\nDiadem Michella, the queen of the galactic empire, is a very sweet old lady, like everyone's grandmother or favorite schoolteacher — and she's the most vile and corrupt leader imaginable. Quite a contrast to General Adolphus.\nWhat's next for the series?\nHellhole is a trilogy, and we have the major events mapped out — beginning, middle, and end — before we started writing the first novel. On the 13-city Hellhole tour, we spent a lot of time plotting Hellhole #2, which is our next project, now that we've finished The Sisterhood of Dune.\nAnd what's next for each of you?\nHerbert: I recently completed a solo novel that is very original and high-concept. One literary professional whose opinion I value highly told me that the story is packed with ideas, and makes him think of some of the most imaginative works in science fiction and fantasy. It is a thought-provoking novel, and I hope my readers enjoy it.\nAnderson: The third novel in my Terra Incognita fantasy trilogy, The Key to Creation, comes out in July, and I am starting work on three more novels set in the Seven Suns universe.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/herbert_anderson_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Hellhole of Our Own Making: A Conversation with Brian Herbert & Kevin J. Anderson by Jeremy L. C. Jones"}