{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Berrien C Henderson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "P5hE7gVm6PgfjTRkL5Tx8sM6bU0=", "id": null, "license": null, "comments": "", "raw_text": "4300 words, short story  Let Baser Things Devise  1: Pierre  Before Clockwork Corp.’s space ape project heads managed to uplift the chimpanzee, he was simply known as No. 157. Some anonymous lab assistant nicknamed him Pierre, and the moniker stuck. After Pierre survived the rigors of testing and training, his world went dark for a time once the Neuroscience Division got their needles and scalpels and computer-brain interfaces onto and into him.  He was a child again. A sponge. Malleable. He had dreams and remembered them—the great ape facility from which he‘d come, the jungle before that. A troop. He had flirted with moonlight and squinted against sunshine while his troop loped through the undergrowth and scampered up the trees and foraged amid the generous loam where he groomed and was groomed. Various Shes were there in limbo, too, between dream and memory. Pierre’s mind reached out, clutching at phantoms from a blurry past and running into the long now—all of it oozing and hrmmm-ing like fluorescent lights with faulty ballasts. He weighed his new life amid antiseptic halls, an institution’s sterility and scientists’ data points and vagaries of conditioning against the harsher realities of death, quick in its smiting, in the tropics and faces framed with their own intelligence. He yearned for a place absent this new awareness—signals of higher and greater thoughts like thunder at the hem of distant mountains.  Inside a year, he learned to speak with his newly acquired vocal cords—3D bio-printed wonders of Clockwork Corp.’s NuFlesh(tm) proprietary systems—and, thus, No. 157 became the first uplifted articulate chimpanzee.  And he was going to the moon.  2: Comped  Pierre received the ping of a incoming message on his way out the door. He had a mandatory conditioning session and made to ignore the message to queue up later, then fell short of his initial plans.  Bureau of Personhood.  He caught himself wanting to oohoohooh in anxiety and excitement but tamped down those impulses. Some quirks hadn’t quite ironed out since uplift, and his human handlers and colleagues overlooked much, thank goodness.  “This is Pierre.”  A woman’s face greeted him with a sliver of a smile that bespoke scores of such practiced smiles daily and the beginnings of crow’s feet at the edges of her eyes. Pierre wondered what kind of punishment the poor liaison had done to deserve shuffling files and contacting various hominids and none too few uplifted canines (a recent development) along with some advanced NuEmote(tm) Model Mark robots. Still, he was glad she had contacted him.  “Pierre, I have good news.”  Finally.  “I’ve sent you a message with a printable, watermarked certificate of personhood.”  “Thank you, Sarah, for all your help.”  “Thank the lawyers at Clockwork Corp.,” she said. “They saw the handwriting on the wall. You had the virtue of many legal precedents on your side.”  “I”—the words sometimes wouldn’t come—“appreciate your taking time to-oohooh face-contact me.”  The practiced smile widened, and he saw the glimmers of a few teeth. “Why, thank you kindly, Pierre.”  “At least I’m not working basic municipal services,” he said. The majority of uplifted apes ended up employed in recycling facilities or treatment plants unless, of course, one was part of an R&D department for the largest corporation in the world and a handy PR football tossed around in the mining claims wars raging on the moon.  “Well, there’s that,” she said. “You realize how fortunate you are.”  “Yes.” And he felt immediately unlucky to be condescended to. Or complimented. He still had trouble navigating social mores. “Thank you.”  “Have a good day, Pierre.”  “You, too-ooh, Sarah.”  As her image faded, Pierre stared at the screen and considered his newfound reality.  Personhood.  The company wanted a poster child for the new wave of lunar exploration. All he had to do was make a loathsome trip to Human Resources and request an addendum to his work contract for this upcoming expedition. The concept of money didn’t escape him, but he had little use for it. He banked a pittance for little things like sodas. Sodas he loved.  The ideas grew. Humans talked with anticipation about taking vacations, and he wanted vacation time, which was not a component of his old contract. No more day passes into the city. No more permission requests for visits to museums or . . . or . . .  The possibilities unfurled in his mind, and Pierre smiled.  3: Human Resources  “Well, this is a first,” said the HR rep. “Wonder if the company ought to consider changing the name of the department now?”  Pierre didn’t laugh during the man’s pregnant pause. “New territory.”  “In more ways than one. First, congratulations on your official personhood status. You’ve come a long way, Pierre.”  “Hmmmm.”  A flash of jungle memory stung him: sunlight lancing the canopy and the screams of another chimpanzee caught in a great cat’s jaws. He could expect a headache—the single and sometimes debilitating side effect of the CBI gear in his head.  “You still have a week before launch. It takes three days to process a contract addendum request. I can message you.”  “Do you see any reason it might be denied?”  “No more than any other request.”  “Ooh.”  “What’s that?”  “I mean, ‘Oh.’ ”  They shuffled through several documents that required e-signatures, eye-stamps, and DNA proofs as Pierre did his best to maneuver the platitudes of small talk.  “Is this what they meant by signing in blood?”  The fat man chuckled. “I suppose so.” He offered his hand to Pierre, who hesitated, then shook. A rarity. All of his physical reinforcement and interactions had consisted of claps on the shoulder and good-natured squeezes of the upper arm—even one high five. Very few handshakes. His hand met the clammy palmflesh of the fat man, who seemed quite appreciative.  When Pierre excused himself, he left with the distinct impression that the fat man was lonely despite dealing with other humans on a daily basis. Alone in a troop. Pierre was stung again as he walked the fluorescent-lit halls to the Fitness and Conditioning wing, signed out, and trained outside. A hard workout in the obstacle course would boost his endorphins and help him fight the headache. He hated the humans’ pain relievers while understanding their necessity.  A bright yellow sun bathed him. A great eye whose warmth slithered down through a noisy canopy. Pierre allowed himself thoughts of trees and courting and earth and night-nesting, and the daydream became a nightmare Klaxon calling out his buried limbic fears of being hunted. Captured.  FLEE!  He scaled trunks and brachiated vines and limbs, missed one and plummeted to earth. He became a caged thing in a preserve; the trees were not the same—constructs for primates to climb and maintain their facade of health and activity. A group of handlers seized him and parleyed him to an alien, antiseptic landscape full of hooting and yowling.  The real nightmare, the waking one, happened when he fell asleep and woke to the reality of his uplifting and a flood of information, a cascade of new schema expanding exponentially—the synaptic flood churning and frothing in his mind from the cerebral implant. He understood the cries of the other animals the way an adult understands a child’s cries—a mixture of sympathy tinged with the patina of intellectual distance.  The memory remained, still blunted by time and his uplifting—a photo fading from color to monochrome or perhaps spackled brightly, overexposed and portions blotted out.  He needed to get away.  4: Tsuki  The susurration of servos and hissing of actuators alerted Pierre as he finished his gymnastics and, planning to warm down with yoga, dropped to the ground.  The Model Mark II lunar-bot approached him in hexapod form, and Pierre couldn’t help thinking of a gigantic arachnid, some mutant lurking and emerging from the shadows of the thick foliage of once-home, ready to snatch baby chimps from the troop. Still, Pierre’s edginess softened when he saw Tsuki.  “Good afternoon, Pierre. News travels fast.”  “Of?”  “Your having been granted personhood. How does that make you feel?”  Tendrils of the headache coiled around his brain. “I put in for a vacation after we revised the contract.”  “A reward. I see.” She skittered alongside him and used one of her four arms to retrieve his water bottle and hand it to him.  “Thank you, Tsuki. It still seems a mere formality.”  “While conferring you wider latitude of rights and privileges.”  “Today would have been the same regardless.”  “A rather cynical view, if perhaps a valid observation.”  His head echoed with the ghost-strains of the headache. A ripple from the back of his neck straight-lined from the CBI’s scar and to his eyes.  “If you say so-ooh.”  “Would you care to run through a mission simulation with me in the Augmentation Array?”  “Hold on a moment.” Pierre retrieved his wafer tablet, which buzzed slightly, and he queued up his meager bank account. It had already been flagged for a deposit. “Huh. They actually did it.”  “ ‘They’?”  “The company. Given today’s news, I’ve received dividends on shares retroactively for the duration of my employment. Good faith call on their part.”  “That was charitable if manipulative.”  “At least I have more money to put toward that vacation.”  “And sodas.”  Pierre smiled. “Good idea. Care to join me for a cafeteria pit stop?”  “Gladly.”  5: “Apollo’s Death (and Perhaps a Resurrection)”  REUTERS OP-ED Byron Pettigrew The Apollo program ended in 1975 with the catastrophic failure of the Apollo 20 mission. Col. William “Memphis” Cato and geologist Dr. Angela Phelps had the unfortunate encounter with Mr. Murphy in the form of a cascade of failures. A dying retro-thruster. On the same side as the thruster—since the module came down harder—a leg collapsed. Other than the rough landing (and thankfully the LRV suffered no damage), Cato and Phelps had every reason to believe they could return to the orbiter. They could do what the stalwart trio of Apollo 13 did. Or the crew of Apollo 19.  Only, they couldn’t, especially not when, after five hours of work, a baseball-sized meteor ripped through the top of the lunar module. The duo awaited the inevitable.  NASA held its memorial with the rest of the nation. The Cato and Phelps families held their respective memorials while Mission Control decided to close the Apollo program with this disaster and move on.  There is no better time to return to the moon than the fiftieth anniversary of the mission. Consider the time and tide of change: The joint venture featuring a Russian multistage rocket along with a United States orbiter and a Japanese lunar module that could only be capped with Clockwork Corp.’s lunar-bot, a Tsuki Model 2, and Pierre the Uplifted Chimp (so labeled by at least one children’s book spinning out of the affair).  There have been the predictable protests about using uplifted animals, but because of a corporate law loophole along with legal precedents set in prior years for uplifted dogs and cats (and one gecko), Pierre would not be the first ape in space, but he would be the first uplifted ape to walk on the moon. Other such chimpanzees see this as quite a boon to their quest for equality.  That Pierre volunteered for the flight has been lost on some of the more vocal and otherwise well-intentioned anti-upli—.  ::SKIP AD SURVEY? CONTINUE TO REMAINDER OF ARTICLE?::  6: Fly Me to the Moon  “Now that we are up here, I am farther removed from being a political football and poster child for a handful of advocacy groups,” said Pierre. He swiveled his chair after he deleted a dozen invitations to speak from organizations.  “An interesting idiom,” replied a section of the wall. Tsuki had slaved herself to the orbiter’s computer system. The Clockwork Corp. lunar-bot had all-terrain capacity like her forebears, but the TLRV possessed additional mimetic qualities beta-tested in Earth’s most inhospitable climates. Her maiden voyage was at hand with this mining mission. Even if something happened to the main computer, she could manage the rest. Designed for versatility, she was a good tool to have on board. “At least you are not configured into the hull’s interior.”  “But, Tsuki, you’re saving space,” said Pierre. “So very ergonomic. Efficient.”  The pilot chuckled. “Never thought I’d be flying to the moon with a chimp and a robot, much less myself. Or hearing unintended puns.”  “It was intended,” said Pierre.  “Might I suggest some practice? It’s a long enough ride.”  “So, the UN and the North American Directorate finally opened up some lunar territory for mining,” said the pilot. “And I get to ferry a robot and a sapient ape.”  “More accurately, exploratory missions,” said Tsuki.  “And furthering the accuracy, uplifted,” said Pierre.  “Touché.”  “Indeed,” said Tsuki.  7: Mare Serenitatis  Almost three full months into the rotation, and Pierre could taste his vacation amid the mapping and spectrography. He had to admit that the stillness and the gliding and jumping freedom of a low-gravity environment excited him, and farther out on their digs, he imagined Tsuki did her fair share of indulging his ooh-ooh-ooh’s of joy. If he played golf, he would’ve driven plenty of golf balls as far across the Sea of Serenity as possible.  But all such thoughts faded fast as he stared at a lunar lander.  “Tsuki, I need you at my location,” said Pierre.  Her voice, tinny through his helmet’s speakers, replied, “Are you all right, Pierre?”  “Yes. No. I’ve found something—ooh-ooh—somethings, to be precise.”  “ETA in seven minutes.”  “Roger that.”  He hop-drifted several more meters, and his concern grew.  Ooh-ooh-ooh.  Nearby lay an older model emergency habitat.  Pierre stared down from the ridge upon the swath of Mare Serenitatis, but closer were two bodies in spacesuits. He bounded down to them; they lay facing each other. Their desiccated faces grinned and yawned at each other from across the decades, and Pierre knew enough of history to realize that today’s mining spectrometer experiments were rendered moot.  “Pierre?”  Tsuki had retracted her trundles into her back and skittered down to him on her hex-legs.  “We’ve found a fifty-years-dead pair of astronauts, Tsuki.”  “Company protocol dictates immediate contact and securing of the site,” said the ’bot.  “Already done that. Col. William Cato and Dr. Angela Phelps, it looks as if you two are finally going home,” said Pierre.  All these years and frozen in such a tableau.  “We should follow our exact path in back out, Pierre, so as not to disturb further the site.”  “You know they’ll want to examine every millimeter and—Get a look.”  He pointed at words written in the soil near Tsuki’s legs.  “ . . . let baser things devise / To die in dust, . . . ” Tsuki said. “Interesting final words.”  Pierre figured there would be some closure for the descendants and the few aging members from that bygone era.  He had no inkling Tsuki possessed among a multitude of photos the one that would be voted Photo of the Year. It was here, now, etched in the linotype of his uplifted mind: Pierre’s crouching at the quote with one of Col. Cato’s hands at the words in the lunar soil and another hand stretched back toward Dr. Phelps.  In his mind, only the curious tableau of a pair of bodies facing each other and space-gloved hands in a fifty-year clutch would remain.  8: Interstitium  Robot and Uplifted Chimp Discover Lost Apollo 20 Astronauts  —AP—A fifty-year mystery unfolded on the moon recently when a pair of Clockwork Corp. employees on a routine mining mission on the Sea of Serenity stumbled upon the remains of Col. Cato and Dr. Phelps. The families have prepared for a host of press conferences . . .  9: From Clockwork Corp.  Pierre Admin RE: Recovery/Phelps-Cato Cc: Tsuki Pierre,  We have attached the link for the coffins’ schematics. The Board decided to aid both the current space administration and the Phelps and Cato families. It is a powerful reminder of the human cost of lunar exploration—of space travel itself.  Once you have fabricated their coffins, transfer the bodies for transport to Camelot Base for pickup. Know that you and Tsuki have played a fundamental role in helping a pair of families find their lost loved ones.  Thank you for your professionalism in helping us handle the matter and for being a credit to the corporation.  With much appreciation,  The Board  10: Little Cupids  “What do you extrapolate given the writing we found?” said Tsuki.  “The allusion sounds familiar,” said Pierre.  She sent him the full text. He pored over it while the 3D printer whirred through its matrix.  “Based on biographical and scholarly cross-referencing, including its inclusion in the Amoretti sequence, it may be less a note to us than simply a coda for themselves.”  “A testament.”  “Or testimony, if you will.”  Whoever had considered Cato and Phelps being more than colleagues were, most of them, lost to time.  Pierre said, “I have to finish the coffins.”  “Do you wish to be left alone, Pierre?”  “Yes. No. Sorry, Tsuki. I’m indecisive. Surely you have other tasks that would better suit you this evening.”  The ’bot offered a wave of a four-fingered hand and trundled away. As the automatic door slid shut with a hiss, she looked at Pierre, who didn’t notice her for his busy-ness.  Pierre’s mind toiled while his hands engaged the mundanity of work. For a moment he looked at his hands as though they belonged to someone else, and his head became balloon-drifty as if he were in the midst of an out-of-body experience. He felt a pang for the trees and the games. Her. All of the Shes. A twinge of regret—no—loss insinuated itself through Pierre’s heart like a tree viper.  Finishing the coffins was lonely work, he thought, glancing periodically at the door.  11: LXXV  After helping send the bodies back to Earth, Pierre couldn’t bring himself to sleep it off, so he wandered the lonely halls of Camelot Base. He passed only a handful of humans—mere platitudes they offered each other—and a few ’bots and droids and found himself wanting to ping Tsuki for her company, but she had plenty of spectrography to analyze. And would she really need to indulge Pierre his melancholy at sending the corpses of Cato and Phelps on their way?  He entered the biosphere with its crisp temperate zone. Pierre inhaled the green and earthiness and moistness but resented the underlying counterfeit to it all. In his mind he was a mere hop, skip, and jump away from the awful steel and stone and polymer playrooms at the research facility. At just over a decade old, the trees could have stood more than limited growth, but at least it was a stand of trees, and trees he could enjoy. He fought the urge to snap off an armload of limbs and go ahead and nest for the night.  Sitting under one of the dwarf pines, Pierre queued up a reading list on his tablet. The screen cast its glow on Pierre’s face as his eyelids drooped. Words tunneled through his mind, then tried to string themselves along entangled metrical feet—looping in his alpha-state brain:  SONNET LXXV.  One day I wrote her name vpon the strand, but came the waues and washèd it away: agayne I wrote it with a second hand, but came the tyde, and made my paynes his pray. Vayne man, sayd she, that doest in vaine assay, a mortall thing so to immortalize. for I my selue shall lyke to this decay, and eek my name bee wyped out lykewize. Not so, (quod I) let baser things deuize, to dy in dust, but you shall liue by fame: my verse your vertues rare shall eternize, and in the heuens wryte your glorious name. Where whenas death shall all the world subdew, our loue shall liue, and later life renew. As he slept that night, Pierre cooed and reached up for elusive dream-limbs. When his arm tired and plopped down, his hand twitched, index finger dancing just above the floor and inscribing ghost words on the patterned tiles.  12: Banter  Pierre woke and startled himself: arm outstretched and clutching the air and the dream receding fast. He jumped at the whirr-buzz-shush of Tsuki’s servos and hissing actuators as she trundled into the room.  “You sounded . . . distressed.”  He zipped into his worksuit and stifled a yawn. “Just talking in my sleep.”  “More accurately, intoning with grunts and hoots,” she said.  He put on his boots. “Ooh.”  “Would you like to be left alone?”  “Not really. Please join me while I eat?”  “Yes. We could play holo-chess.”  “That would be nice.”  A short trip down the hall brought them into the mess. A few humans ambled around—as always, congenial yet aloof. Everyone was here to do a job, and no one seemed interested in befriending a knuckle-walking novelty like Pierre.  He ate but didn’t care. It was welcome stimulation to play chess and took his mind off work and dead astronauts.  “Based on our current timeline,” said Tsuki, “we may return Earthside in a week. A day early, in fact.”  “Has it already been so long?”  “Eleven weeks, approximately. The apropos idiom is, I believe, ‘give or take.’ ”  “You’re learning.”  “Cross-referencing and extrapolating linguistic scenarios.”  “Conversing, Tsuki.”  “Pierre?”  “Yes?”  “Checkmate.”  “Well—ooh—shit.”  The ’bot said, “A crude if somewhat apropos remark.”  “It fits. Come on. Let’s go to work.”  “I have been working while you slept.”  “Infer, please.”  “Ah. Your use of first-person plural indicates an implied continuance of company.”  “Exactly, Tsuki. So long as it’s not another game of chess.”  Pierre could’ve sworn he heard hollow laughter from the ’bot. A most endearing trait on her part.  13: Departure  They went through their departure checklist and reached the Camelot Base launchpad. A sleek Clockwork Corp. courier hunkered on the pad. The pilot waved at them from behind his window, held up a wrist, and tapped it impatiently.  Pierre shook his head and glide-hopped ahead of Tsuki. They each kicked up plumes of lunar dust.  It was about time!  A goferit ’bot already waited on Pierre with his gear. He was so glad he’d pre-processed out.  “Well, Tsuki, it was good working with you.”  “The sentiment is mutual, Pierre.”  He sent the goferit ’bot aboard the ship.  “Don’t work too hard.”  “I have plenty of missions and data to continue analyzing.”  “Stay in touch.”  “Of course.”  Pierre left Tsuki behind on the moon and shrinking amid Camelot Base in the wake of the courier’s blast off. Out of his window, he thought he saw the ’bot waving good-bye.  After a while Pierre allowed himself the luxury of relaxing. Poring over spectrum analyses had left him fuzzy-headed and drained on top of the endemic mundanity and tedium.  Plus, Cato and Phelps.  Existing somewhere between a robot and a human left him even more drained—a murky middle state. The courier sped through the long emptiness between the moon and Earth. Pierre had his first dreamless sleep in a long time. He had no headache, especially when he received the ping from headquarters.  RE: LEAVE APPROVAL noreply.confirmation CLICK RECEIPT ACKNOWLEDGEMENT LINK. INSERT CODE TH@SGR8 FOR FINALIZATION 14: Coda: Pan trogolodytes of Guinea  Waves broke and hush-shushed ashore. Pierre listened to the waves’ lulling susurration and found himself mesmerized even as the waves spoke louder for the incoming tide. Far behind him the jungle unspooled its teeming glossolalia of birdcalls and growls, grunts and hoots. Creatures dying. Mating. Hunger. Nature wanted propagation—its children’s perpetuation.  Pierre wrote his name and another in the sand.  The moon crept out and blued the world as the tide reached Pierre, and he didn’t begrudge its work upon the names in the sand. He massaged his neck and skull, then wished to have another hand to clutch.  Far down the beach a lioness and two cubs ventured out, and Pierre watched them with a twofold sense of flighty self-preservation and bemusement—the potential threat not lost on his old self nor the new one once the lioness probed the air and yawed her head in his direction. After a moment she and the cubs retreated to the luxuriant green treeline.  He needed to move, so he set his tablet to BUSY and shed his clothes, those faulty constructs that indulged society yet shamed Pierre himself.  He approached the shadow-swathed jungle.  With his toes he kneaded the loam. He sprang up to catch hold of and swing upon the nearest limb. As he clambered higher, thoughts of Tsuki and Cato and Phelps accompanied him—the need for troop and family and consortships.  Swinging, bounding, clambering now.  It had been too long since he had experienced the thrill of tempting Earth’s gravity and cheating its constancy with each grab of a limb. Dark shapes bounded through the trees and brush, and Pierre kept both pace and distance. There was shame at his own scent they would no doubt catch if not already—too much blend of civilization and cleansing and humanity.  Paths opened before him. Night drew on while the moon cast her dapple-down light through the canopy. This was another kind of freefall, another kind of release. Before long, he was spent, so Pierre busied himself, snapping off branches and weaving them for his night’s nesting, and his hands seemed for a moment—just a moment—to belong to some other chimpanzee.  Back on the beach the tide had long since taken the names even as night and exhaustion claimed Pierre and engrafted him among its humid folds. The sea shushed and grated its rhythms through the jungle.  He hugged himself amid a tangle of dreams and sought her name and whispered it as his arm lolled and hand twitched. Pierre clutched only the tropical night while the drift of moonlight played against his open palm and weaved itself through his fingers.  “Ooh-ooh-ooh.”  Berrien C. Henderson lives in the deepest, darkest wilds of southeast Georgia. He teaches high school Literature and Composition with a Southern accent. Berrien's writing has appeared in such diverse venues as The Journal of Asian Martial Arts, The Doctor T.J. Eckleburg Review, The Dead Mule School of Southern literature, Abyss & Apex, Kaleidotrope, and Bloody Knuckles: The MMAnthology. His mini-collection of Southern magical realism, Old Souls and the Grammar of Their Wanderings, is available from Papaveria Press. He is a fiction editor at Farrago's Wainscot. In his not-so-copious free time, Berrien practices martial arts.", "text": "4300 words, short story\nLet Baser Things Devise\n1: Pierre\nBefore Clockwork Corp.’s space ape project heads managed to uplift the chimpanzee, he was simply known as No. 157. Some anonymous lab assistant nicknamed him Pierre, and the moniker stuck. After Pierre survived the rigors of testing and training, his world went dark for a time once the Neuroscience Division got their needles and scalpels and computer-brain interfaces onto and into him.\nHe was a child again. A sponge. Malleable. He had dreams and remembered them—the great ape facility from which he‘d come, the jungle before that. A troop. He had flirted with moonlight and squinted against sunshine while his troop loped through the undergrowth and scampered up the trees and foraged amid the generous loam where he groomed and was groomed. Various Shes were there in limbo, too, between dream and memory. Pierre’s mind reached out, clutching at phantoms from a blurry past and running into the long now—all of it oozing and hrmmm-ing like fluorescent lights with faulty ballasts. He weighed his new life amid antiseptic halls, an institution’s sterility and scientists’ data points and vagaries of conditioning against the harsher realities of death, quick in its smiting, in the tropics and faces framed with their own intelligence. He yearned for a place absent this new awareness—signals of higher and greater thoughts like thunder at the hem of distant mountains.\nInside a year, he learned to speak with his newly acquired vocal cords—3D bio-printed wonders of Clockwork Corp.’s NuFlesh(tm) proprietary systems—and, thus, No. 157 became the first uplifted articulate chimpanzee.\nAnd he was going to the moon.\n2: Comped\nPierre received the ping of a incoming message on his way out the door. He had a mandatory conditioning session and made to ignore the message to queue up later, then fell short of his initial plans.\nBureau of Personhood.\nHe caught himself wanting to oohoohooh in anxiety and excitement but tamped down those impulses. Some quirks hadn’t quite ironed out since uplift, and his human handlers and colleagues overlooked much, thank goodness.\n“This is Pierre.”\nA woman’s face greeted him with a sliver of a smile that bespoke scores of such practiced smiles daily and the beginnings of crow’s feet at the edges of her eyes. Pierre wondered what kind of punishment the poor liaison had done to deserve shuffling files and contacting various hominids and none too few uplifted canines (a recent development) along with some advanced NuEmote(tm) Model Mark robots. Still, he was glad she had contacted him.\n“Pierre, I have good news.”\nFinally.\n“I’ve sent you a message with a printable, watermarked certificate of personhood.”\n“Thank you, Sarah, for all your help.”\n“Thank the lawyers at Clockwork Corp.,” she said. “They saw the handwriting on the wall. You had the virtue of many legal precedents on your side.”\n“I”—the words sometimes wouldn’t come—“appreciate your taking time to-oohooh face-contact me.”\nThe practiced smile widened, and he saw the glimmers of a few teeth. “Why, thank you kindly, Pierre.”\n“At least I’m not working basic municipal services,” he said. The majority of uplifted apes ended up employed in recycling facilities or treatment plants unless, of course, one was part of an R&D department for the largest corporation in the world and a handy PR football tossed around in the mining claims wars raging on the moon.\n“Well, there’s that,” she said. “You realize how fortunate you are.”\n“Yes.” And he felt immediately unlucky to be condescended to. Or complimented. He still had trouble navigating social mores. “Thank you.”\n“Have a good day, Pierre.”\n“You, too-ooh, Sarah.”\nAs her image faded, Pierre stared at the screen and considered his newfound reality.\nPersonhood.\nThe company wanted a poster child for the new wave of lunar exploration. All he had to do was make a loathsome trip to Human Resources and request an addendum to his work contract for this upcoming expedition. The concept of money didn’t escape him, but he had little use for it. He banked a pittance for little things like sodas. Sodas he loved.\nThe ideas grew. Humans talked with anticipation about taking vacations, and he wanted vacation time, which was not a component of his old contract. No more day passes into the city. No more permission requests for visits to museums or . . . or . . .\nThe possibilities unfurled in his mind, and Pierre smiled.\n3: Human Resources\n“Well, this is a first,” said the HR rep. “Wonder if the company ought to consider changing the name of the department now?”\nPierre didn’t laugh during the man’s pregnant pause. “New territory.”\n“In more ways than one. First, congratulations on your official personhood status. You’ve come a long way, Pierre.”\n“Hmmmm.”\nA flash of jungle memory stung him: sunlight lancing the canopy and the screams of another chimpanzee caught in a great cat’s jaws. He could expect a headache—the single and sometimes debilitating side effect of the CBI gear in his head.\n“You still have a week before launch. It takes three days to process a contract addendum request. I can message you.”\n“Do you see any reason it might be denied?”\n“No more than any other request.”\n“Ooh.”\n“What’s that?”\n“I mean, ‘Oh.’ ”\nThey shuffled through several documents that required e-signatures, eye-stamps, and DNA proofs as Pierre did his best to maneuver the platitudes of small talk.\n“Is this what they meant by signing in blood?”\nThe fat man chuckled. “I suppose so.” He offered his hand to Pierre, who hesitated, then shook. A rarity. All of his physical reinforcement and interactions had consisted of claps on the shoulder and good-natured squeezes of the upper arm—even one high five. Very few handshakes. His hand met the clammy palmflesh of the fat man, who seemed quite appreciative.\nWhen Pierre excused himself, he left with the distinct impression that the fat man was lonely despite dealing with other humans on a daily basis. Alone in a troop. Pierre was stung again as he walked the fluorescent-lit halls to the Fitness and Conditioning wing, signed out, and trained outside. A hard workout in the obstacle course would boost his endorphins and help him fight the headache. He hated the humans’ pain relievers while understanding their necessity.\nA bright yellow sun bathed him. A great eye whose warmth slithered down through a noisy canopy. Pierre allowed himself thoughts of trees and courting and earth and night-nesting, and the daydream became a nightmare Klaxon calling out his buried limbic fears of being hunted. Captured.\nFLEE!\nHe scaled trunks and brachiated vines and limbs, missed one and plummeted to earth. He became a caged thing in a preserve; the trees were not the same—constructs for primates to climb and maintain their facade of health and activity. A group of handlers seized him and parleyed him to an alien, antiseptic landscape full of hooting and yowling.\nThe real nightmare, the waking one, happened when he fell asleep and woke to the reality of his uplifting and a flood of information, a cascade of new schema expanding exponentially—the synaptic flood churning and frothing in his mind from the cerebral implant. He understood the cries of the other animals the way an adult understands a child’s cries—a mixture of sympathy tinged with the patina of intellectual distance.\nThe memory remained, still blunted by time and his uplifting—a photo fading from color to monochrome or perhaps spackled brightly, overexposed and portions blotted out.\nHe needed to get away.\n4: Tsuki\nThe susurration of servos and hissing of actuators alerted Pierre as he finished his gymnastics and, planning to warm down with yoga, dropped to the ground.\nThe Model Mark II lunar-bot approached him in hexapod form, and Pierre couldn’t help thinking of a gigantic arachnid, some mutant lurking and emerging from the shadows of the thick foliage of once-home, ready to snatch baby chimps from the troop. Still, Pierre’s edginess softened when he saw Tsuki.\n“Good afternoon, Pierre. News travels fast.”\n“Of?”\n“Your having been granted personhood. How does that make you feel?”\nTendrils of the headache coiled around his brain. “I put in for a vacation after we revised the contract.”\n“A reward. I see.” She skittered alongside him and used one of her four arms to retrieve his water bottle and hand it to him.\n“Thank you, Tsuki. It still seems a mere formality.”\n“While conferring you wider latitude of rights and privileges.”\n“Today would have been the same regardless.”\n“A rather cynical view, if perhaps a valid observation.”\nHis head echoed with the ghost-strains of the headache. A ripple from the back of his neck straight-lined from the CBI’s scar and to his eyes.\n“If you say so-ooh.”\n“Would you care to run through a mission simulation with me in the Augmentation Array?”\n“Hold on a moment.” Pierre retrieved his wafer tablet, which buzzed slightly, and he queued up his meager bank account. It had already been flagged for a deposit. “Huh. They actually did it.”\n“ ‘They’?”\n“The company. Given today’s news, I’ve received dividends on shares retroactively for the duration of my employment. Good faith call on their part.”\n“That was charitable if manipulative.”\n“At least I have more money to put toward that vacation.”\n“And sodas.”\nPierre smiled. “Good idea. Care to join me for a cafeteria pit stop?”\n“Gladly.”\n5: “Apollo’s Death (and Perhaps a Resurrection)”\nREUTERS\nOP-ED\nByron Pettigrew\nThe Apollo program ended in 1975 with the catastrophic failure of the Apollo 20 mission. Col. William “Memphis” Cato and geologist Dr. Angela Phelps had the unfortunate encounter with Mr. Murphy in the form of a cascade of failures. A dying retro-thruster. On the same side as the thruster—since the module came down harder—a leg collapsed. Other than the rough landing (and thankfully the LRV suffered no damage), Cato and Phelps had every reason to believe they could return to the orbiter. They could do what the stalwart trio of Apollo 13 did. Or the crew of Apollo 19.\nOnly, they couldn’t, especially not when, after five hours of work, a baseball-sized meteor ripped through the top of the lunar module. The duo awaited the inevitable.\nNASA held its memorial with the rest of the nation. The Cato and Phelps families held their respective memorials while Mission Control decided to close the Apollo program with this disaster and move on.\nThere is no better time to return to the moon than the fiftieth anniversary of the mission. Consider the time and tide of change: The joint venture featuring a Russian multistage rocket along with a United States orbiter and a Japanese lunar module that could only be capped with Clockwork Corp.’s lunar-bot, a Tsuki Model 2, and Pierre the Uplifted Chimp (so labeled by at least one children’s book spinning out of the affair).\nThere have been the predictable protests about using uplifted animals, but because of a corporate law loophole along with legal precedents set in prior years for uplifted dogs and cats (and one gecko), Pierre would not be the first ape in space, but he would be the first uplifted ape to walk on the moon. Other such chimpanzees see this as quite a boon to their quest for equality.\nThat Pierre volunteered for the flight has been lost on some of the more vocal and otherwise well-intentioned anti-upli—.\n::SKIP AD SURVEY? CONTINUE TO REMAINDER OF ARTICLE?::\n6: Fly Me to the Moon\n“Now that we are up here, I am farther removed from being a political football and poster child for a handful of advocacy groups,” said Pierre. He swiveled his chair after he deleted a dozen invitations to speak from organizations.\n“An interesting idiom,” replied a section of the wall. Tsuki had slaved herself to the orbiter’s computer system. The Clockwork Corp. lunar-bot had all-terrain capacity like her forebears, but the TLRV possessed additional mimetic qualities beta-tested in Earth’s most inhospitable climates. Her maiden voyage was at hand with this mining mission. Even if something happened to the main computer, she could manage the rest. Designed for versatility, she was a good tool to have on board. “At least you are not configured into the hull’s interior.”\n“But, Tsuki, you’re saving space,” said Pierre. “So very ergonomic. Efficient.”\nThe pilot chuckled. “Never thought I’d be flying to the moon with a chimp and a robot, much less myself. Or hearing unintended puns.”\n“It was intended,” said Pierre.\n“Might I suggest some practice? It’s a long enough ride.”\n“So, the UN and the North American Directorate finally opened up some lunar territory for mining,” said the pilot. “And I get to ferry a robot and a sapient ape.”\n“More accurately, exploratory missions,” said Tsuki.\n“And furthering the accuracy, uplifted,” said Pierre.\n“Touché.”\n“Indeed,” said Tsuki.\n7: Mare Serenitatis\nAlmost three full months into the rotation, and Pierre could taste his vacation amid the mapping and spectrography. He had to admit that the stillness and the gliding and jumping freedom of a low-gravity environment excited him, and farther out on their digs, he imagined Tsuki did her fair share of indulging his ooh-ooh-ooh’s of joy. If he played golf, he would’ve driven plenty of golf balls as far across the Sea of Serenity as possible.\nBut all such thoughts faded fast as he stared at a lunar lander.\n“Tsuki, I need you at my location,” said Pierre.\nHer voice, tinny through his helmet’s speakers, replied, “Are you all right, Pierre?”\n“Yes. No. I’ve found something—ooh-ooh—somethings, to be precise.”\n“ETA in seven minutes.”\n“Roger that.”\nHe hop-drifted several more meters, and his concern grew.\nOoh-ooh-ooh.\nNearby lay an older model emergency habitat.\nPierre stared down from the ridge upon the swath of Mare Serenitatis, but closer were two bodies in spacesuits. He bounded down to them; they lay facing each other. Their desiccated faces grinned and yawned at each other from across the decades, and Pierre knew enough of history to realize that today’s mining spectrometer experiments were rendered moot.\n“Pierre?”\nTsuki had retracted her trundles into her back and skittered down to him on her hex-legs.\n“We’ve found a fifty-years-dead pair of astronauts, Tsuki.”\n“Company protocol dictates immediate contact and securing of the site,” said the ’bot.\n“Already done that. Col. William Cato and Dr. Angela Phelps, it looks as if you two are finally going home,” said Pierre.\nAll these years and frozen in such a tableau.\n“We should follow our exact path in back out, Pierre, so as not to disturb further the site.”\n“You know they’ll want to examine every millimeter and—Get a look.”\nHe pointed at words written in the soil near Tsuki’s legs.\n“ . . . let baser things devise / To die in dust, . . . ” Tsuki said. “Interesting final words.”\nPierre figured there would be some closure for the descendants and the few aging members from that bygone era.\nHe had no inkling Tsuki possessed among a multitude of photos the one that would be voted Photo of the Year. It was here, now, etched in the linotype of his uplifted mind: Pierre’s crouching at the quote with one of Col. Cato’s hands at the words in the lunar soil and another hand stretched back toward Dr. Phelps.\nIn his mind, only the curious tableau of a pair of bodies facing each other and space-gloved hands in a fifty-year clutch would remain.\n8: Interstitium\nRobot and Uplifted Chimp Discover Lost Apollo 20 Astronauts\n—AP—A fifty-year mystery unfolded on the moon recently when a pair of Clockwork Corp. employees on a routine mining mission on the Sea of Serenity stumbled upon the remains of Col. Cato and Dr. Phelps. The families have prepared for a host of press conferences . . .\n9: From Clockwork Corp.\nPierre\nAdmin\nRE: Recovery/Phelps-Cato\nCc: Tsuki\nPierre,\nWe have attached the link for the coffins’ schematics. The Board decided to aid both the current space administration and the Phelps and Cato families. It is a powerful reminder of the human cost of lunar exploration—of space travel itself.\nOnce you have fabricated their coffins, transfer the bodies for transport to Camelot Base for pickup. Know that you and Tsuki have played a fundamental role in helping a pair of families find their lost loved ones.\nThank you for your professionalism in helping us handle the matter and for being a credit to the corporation.\nWith much appreciation,\nThe Board\n10: Little Cupids\n“What do you extrapolate given the writing we found?” said Tsuki.\n“The allusion sounds familiar,” said Pierre.\nShe sent him the full text. He pored over it while the 3D printer whirred through its matrix.\n“Based on biographical and scholarly cross-referencing, including its inclusion in the Amoretti sequence, it may be less a note to us than simply a coda for themselves.”\n“A testament.”\n“Or testimony, if you will.”\nWhoever had considered Cato and Phelps being more than colleagues were, most of them, lost to time.\nPierre said, “I have to finish the coffins.”\n“Do you wish to be left alone, Pierre?”\n“Yes. No. Sorry, Tsuki. I’m indecisive. Surely you have other tasks that would better suit you this evening.”\nThe ’bot offered a wave of a four-fingered hand and trundled away. As the automatic door slid shut with a hiss, she looked at Pierre, who didn’t notice her for his busy-ness.\nPierre’s mind toiled while his hands engaged the mundanity of work. For a moment he looked at his hands as though they belonged to someone else, and his head became balloon-drifty as if he were in the midst of an out-of-body experience. He felt a pang for the trees and the games. Her. All of the Shes. A twinge of regret—no—loss insinuated itself through Pierre’s heart like a tree viper.\nFinishing the coffins was lonely work, he thought, glancing periodically at the door.\n11: LXXV\nAfter helping send the bodies back to Earth, Pierre couldn’t bring himself to sleep it off, so he wandered the lonely halls of Camelot Base. He passed only a handful of humans—mere platitudes they offered each other—and a few ’bots and droids and found himself wanting to ping Tsuki for her company, but she had plenty of spectrography to analyze. And would she really need to indulge Pierre his melancholy at sending the corpses of Cato and Phelps on their way?\nHe entered the biosphere with its crisp temperate zone. Pierre inhaled the green and earthiness and moistness but resented the underlying counterfeit to it all. In his mind he was a mere hop, skip, and jump away from the awful steel and stone and polymer playrooms at the research facility. At just over a decade old, the trees could have stood more than limited growth, but at least it was a stand of trees, and trees he could enjoy. He fought the urge to snap off an armload of limbs and go ahead and nest for the night.\nSitting under one of the dwarf pines, Pierre queued up a reading list on his tablet. The screen cast its glow on Pierre’s face as his eyelids drooped. Words tunneled through his mind, then tried to string themselves along entangled metrical feet—looping in his alpha-state brain:\nSONNET LXXV.\nOne day I wrote her name vpon the strand,\nbut came the waues and washèd it away:\nagayne I wrote it with a second hand,\nbut came the tyde, and made my paynes his pray.\nVayne man, sayd she, that doest in vaine assay,\na mortall thing so to immortalize.\nfor I my selue shall lyke to this decay,\nand eek my name bee wyped out lykewize.\nNot so, (quod I) let baser things deuize,\nto dy in dust, but you shall liue by fame:\nmy verse your vertues rare shall eternize,\nand in the heuens wryte your glorious name.\nWhere whenas death shall all the world subdew,\nour loue shall liue, and later life renew.\nAs he slept that night, Pierre cooed and reached up for elusive dream-limbs. When his arm tired and plopped down, his hand twitched, index finger dancing just above the floor and inscribing ghost words on the patterned tiles.\n12: Banter\nPierre woke and startled himself: arm outstretched and clutching the air and the dream receding fast. He jumped at the whirr-buzz-shush of Tsuki’s servos and hissing actuators as she trundled into the room.\n“You sounded . . . distressed.”\nHe zipped into his worksuit and stifled a yawn. “Just talking in my sleep.”\n“More accurately, intoning with grunts and hoots,” she said.\nHe put on his boots. “Ooh.”\n“Would you like to be left alone?”\n“Not really. Please join me while I eat?”\n“Yes. We could play holo-chess.”\n“That would be nice.”\nA short trip down the hall brought them into the mess. A few humans ambled around—as always, congenial yet aloof. Everyone was here to do a job, and no one seemed interested in befriending a knuckle-walking novelty like Pierre.\nHe ate but didn’t care. It was welcome stimulation to play chess and took his mind off work and dead astronauts.\n“Based on our current timeline,” said Tsuki, “we may return Earthside in a week. A day early, in fact.”\n“Has it already been so long?”\n“Eleven weeks, approximately. The apropos idiom is, I believe, ‘give or take.’ ”\n“You’re learning.”\n“Cross-referencing and extrapolating linguistic scenarios.”\n“Conversing, Tsuki.”\n“Pierre?”\n“Yes?”\n“Checkmate.”\n“Well—ooh—shit.”\nThe ’bot said, “A crude if somewhat apropos remark.”\n“It fits. Come on. Let’s go to work.”\n“I have been working while you slept.”\n“Infer, please.”\n“Ah. Your use of first-person plural indicates an implied continuance of company.”\n“Exactly, Tsuki. So long as it’s not another game of chess.”\nPierre could’ve sworn he heard hollow laughter from the ’bot. A most endearing trait on her part.\n13: Departure\nThey went through their departure checklist and reached the Camelot Base launchpad. A sleek Clockwork Corp. courier hunkered on the pad. The pilot waved at them from behind his window, held up a wrist, and tapped it impatiently.\nPierre shook his head and glide-hopped ahead of Tsuki. They each kicked up plumes of lunar dust.\nIt was about time!\nA goferit ’bot already waited on Pierre with his gear. He was so glad he’d pre-processed out.\n“Well, Tsuki, it was good working with you.”\n“The sentiment is mutual, Pierre.”\nHe sent the goferit ’bot aboard the ship.\n“Don’t work too hard.”\n“I have plenty of missions and data to continue analyzing.”\n“Stay in touch.”\n“Of course.”\nPierre left Tsuki behind on the moon and shrinking amid Camelot Base in the wake of the courier’s blast off. Out of his window, he thought he saw the ’bot waving good-bye.\nAfter a while Pierre allowed himself the luxury of relaxing. Poring over spectrum analyses had left him fuzzy-headed and drained on top of the endemic mundanity and tedium.\nPlus, Cato and Phelps.\nExisting somewhere between a robot and a human left him even more drained—a murky middle state. The courier sped through the long emptiness between the moon and Earth. Pierre had his first dreamless sleep in a long time. He had no headache, especially when he received the ping from headquarters.\nRE: LEAVE APPROVAL\nnoreply.confirmation\nCLICK RECEIPT ACKNOWLEDGEMENT LINK.\nINSERT CODE TH@SGR8 FOR FINALIZATION\n14: Coda: Pan trogolodytes of Guinea\nWaves broke and hush-shushed ashore. Pierre listened to the waves’ lulling susurration and found himself mesmerized even as the waves spoke louder for the incoming tide. Far behind him the jungle unspooled its teeming glossolalia of birdcalls and growls, grunts and hoots. Creatures dying. Mating. Hunger. Nature wanted propagation—its children’s perpetuation.\nPierre wrote his name and another in the sand.\nThe moon crept out and blued the world as the tide reached Pierre, and he didn’t begrudge its work upon the names in the sand. He massaged his neck and skull, then wished to have another hand to clutch.\nFar down the beach a lioness and two cubs ventured out, and Pierre watched them with a twofold sense of flighty self-preservation and bemusement—the potential threat not lost on his old self nor the new one once the lioness probed the air and yawed her head in his direction. After a moment she and the cubs retreated to the luxuriant green treeline.\nHe needed to move, so he set his tablet to BUSY and shed his clothes, those faulty constructs that indulged society yet shamed Pierre himself.\nHe approached the shadow-swathed jungle.\nWith his toes he kneaded the loam. He sprang up to catch hold of and swing upon the nearest limb. As he clambered higher, thoughts of Tsuki and Cato and Phelps accompanied him—the need for troop and family and consortships.\nSwinging, bounding, clambering now.\nIt had been too long since he had experienced the thrill of tempting Earth’s gravity and cheating its constancy with each grab of a limb. Dark shapes bounded through the trees and brush, and Pierre kept both pace and distance. There was shame at his own scent they would no doubt catch if not already—too much blend of civilization and cleansing and humanity.\nPaths opened before him. Night drew on while the moon cast her dapple-down light through the canopy. This was another kind of freefall, another kind of release. Before long, he was spent, so Pierre busied himself, snapping off branches and weaving them for his night’s nesting, and his hands seemed for a moment—just a moment—to belong to some other chimpanzee.\nBack on the beach the tide had long since taken the names even as night and exhaustion claimed Pierre and engrafted him among its humid folds. The sea shushed and grated its rhythms through the jungle.\nHe hugged himself amid a tangle of dreams and sought her name and whispered it as his arm lolled and hand twitched. Pierre clutched only the tropical night while the drift of moonlight played against his open palm and weaved itself through his fingers.\n“Ooh-ooh-ooh.”\nBerrien C. Henderson lives in the deepest, darkest wilds of southeast Georgia. He teaches high school Literature and Composition with a Southern accent. Berrien's writing has appeared in such diverse venues as The Journal of Asian Martial Arts, The Doctor T.J. Eckleburg Review, The Dead Mule School of Southern literature, Abyss & Apex, Kaleidotrope, and Bloody Knuckles: The MMAnthology. His mini-collection of Southern magical realism, Old Souls and the Grammar of Their Wanderings, is available from Papaveria Press. He is a fiction editor at Farrago's Wainscot. In his not-so-copious free time, Berrien practices martial arts.", "source": "https://clarkesworldmagazine.com/henderson_04_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Let Baser Things Devise by Berrien C. Henderson"}