{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Fei Dao; Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "XahjkVDop4nTTXkrUEMC2hhVf10=", "id": null, "license": null, "comments": "", "raw_text": "8050 words, novelette  The Robot Who Liked to Tell Tall Tales  Once upon a time there was a king. He was brave and clever and blessed with good luck. As you might expect, he ended up unifying the world, and even made plans to conquer the sun. Most remarkably, he did everything aboveboard and never lied. The people loved him and wanted to emulate his example. Let’s put it this way: there had never been a realm in the history of the universe so pure and good as his.  Unfortunately, he had a son who enjoyed lying. From childhood, the prince exaggerated and bragged, and his shameless whoppers made his parents blush with shame. The courtiers and ladies-in-waiting were so tickled by his tall tales that they wanted nothing more than to roll on the floor and howl with laughter, though courtly etiquette forced them to hold it in, and they all ended up with stomachaches. Unavoidably, his colorful yarns spread throughout the kingdom. At first, the common people tried to remain silent out of politeness, but eventually their bellies hurt so much that they had to laugh out loud. Everyone agreed that they had not heard such fantastic stories in ages.  The boy always said, “I’ve never fibbed in my life! You’ll know after you’re dead.”  The king gathered the most skilled doctors, the wisest philosophers, the most reputable priests, and the most elegant musicians, and charged them to cure, enlighten, redeem, and reform the little rapscallion. All these efforts came to naught.  The prince was the king’s only heir. Only a kingdom of liars would deserve such a braggart for their sovereign—the thought kept the king up at night. Eventually, he became bedridden from worry.  It was said that as the king lay dying, the young man, bless his heart, did not say anything outrageous. Tenderly, as he gazed at the old man, he declared, “Dear Father, don’t worry. In your stead, I will conquer something even more terrifying than the sun.”  And so the “Bullshit King” ascended to the throne, and the people’s lives descended into depravity.  To be sure, the kingdom didn’t fall into ruin, though the prevailing mood of order and trust was corrupted by a new sense of dissolution. Like snakes emerging after a long winter, frauds, cheats, rogues, and petty criminals—long absent from the realm—reappeared. Honest people could no longer sleep soundly at night. Fortunately, the old king had laid a solid foundation, and loyal ministers continued to do their best to help their new sovereign. Despite the changes, the Bullshit King managed to rule in peace for many years. Although things weren’t as stable as before, the kingdom didn’t collapse, either.  The young king continued to tell wild, unbelievable stories day after day. After more than a decade of this, even those who despised him had to admire his consistency. The people settled on a new consensus: our king is the greatest fibber in the world.  With the passage of time, the king gradually approached wisdom—let’s not exaggerate here; his progress was about a centimeter. The judgment of the people worried him.  “This is unacceptable,” he mused. “I can’t go to my grave with such a reputation.”  He decided that the solution was to find someone else who was even more of a liar than he was. Nobody ever remembered number two in any category.  The old king had built an army of robots. These machine soldiers, fearless and dependable, had done great service for the throne and pledged perpetual fealty to each successive king. After careful screening by scientists, one particular robot soldier was brought to the palace.  “Listen carefully,” the king ordered.  The robot strained to capture every buzz and hum in the air. It was unable to decode any useful information.  “The silence is terrifying, isn’t it?” The king shook his head helplessly. “I dare say that at this moment, all ears around the globe are perked up, waiting for me to amuse them with some tall tale. I bet you that my stories have done such a good job of curing indigestion that an extra ten thousand sacks of rice are being consumed each year. Sigh . . . What is the point of a life like mine? No one takes me seriously. I’d rather discuss the history of the patches of rust staining your torso, my most honored pile of scrap metal.”  The robot saluted him. “I am at your service, Your Majesty.”  “You know, I wasn’t born like this. One time, I remember going into the royal garden to play and dig for ants under an ancient tree. I dug deeper and deeper until I fell into a bottomless pit. It turned out to be an actual black hole! The black hole was filled with secrets: more than five moles of secrets gathered from members of nine trillion species spread over a million galaxies, secrets that the tellers felt compelled to share but were also terrified of sharing. Wow! What an experience! I climbed back out and wanted to discuss these secrets seriously, but everyone treated my stories as made-up tales. Once people made up their minds, it was simply impossible to convince them otherwise . . .  “Anyway, this is why I need you. I want you to leave behind the honesty that you obtained from my father. I want you to lie shamelessly, to exaggerate unabashedly, to fabricate castles in the air without remorse. You must become the teller of the tallest tales, an unprecedented master of bullshit. This is how I will be saved, and how you will achieve absolute freedom.”  And that was how the robot got his mission.  Fictioneering was a skill that could not be taught in a classroom, and the mechanical soldier had to go seek knowledge in the world. It left the palace and wandered the earth, gathering wisdom, gaining experience, associating itself with a variety of absurd acts, nurturing its soul in the company of delirious souls, feeding on the diseased ravings of lunatics, learning to tell breathtaking lies, spreading the seeds of chaos—until it also gained a measure of notoriety.  One day, the robot was trekking alone on a trail through the wilderness when the sky suddenly turned dark, and a thunderstorm drove it into a run-down rest stop. In the cramped and dark stone hut, three men were drinking around a small stove. In a corner, another drunken man lay asleep, his pale face hidden under the hood of a black cloak full of holes.  The drinking companions were glad to have a newcomer. They shifted around the stove to make room for the robot. After pouring a cup of strong liquor for the soldier, they continued their conversation.  “The two of you have indeed had some exciting adventures,” said a tall, slender man with eagle-like eyes. “However, I have to say that Death is the most terrifying opponent of them all.” The other nodded in agreement. “I’ve had multiple run-ins with Death, but I’ve always managed to escape. As a painter, I’m known for intricate, dazzling portraits of imaginary cities. Each time, Death was fascinated by my pictures. He would step into the scene, stroll through the streets and avenues, traverse the squares and alleyways, brush shoulders with inhabitants with blurred faces—before realizing that he had been trapped by my carefully-designed mazes and had been wandering up and down infinite staircases whose tops circled around to their bottoms.  “As Death isn’t without a sense of humor, he would tolerate my little jokes. We also have to admire his sense of duty. Since he’s more powerful than anything else in the world, ultimately he would find the exits to the mazes, though the delay would afford me the time to escape.”  He brandished a paintbrush. “This is how I’ve been able to get out of each invitation from Death, and now let’s drink to it.”  Everyone lifted their cup and toasted the brush. Even the black-cloaked drunkard asleep in the corner snored especially loudly in tribute.  The man dangling a pipe in his mouth spoke up next. “I’ve had the good fortune of observing some of your paintings. They’re truly admirable for their lofty taste and rigorous execution. I, on the other hand, do not take myself seriously at all. It’s true that people call me an author, and I’ve derived plenty of benefits and honors from the title, but I’ve never thought that anything I’ve written has any value. I don’t mean to offend, but I’ve always been of the opinion that the universe itself is worthless. We ourselves are insignificant, and all our actions mere absurdities. Art is no different.  “Instead of the pursuit of excellence that you engage in, because I don’t value what I do, I’m more interested in pure speed. When I write, the words simply spill out of me, a nice metaphor for the unrestrained outpouring of time that makes up a meaningless life. Despite this, others praise me as a giant of thought. Funny, isn’t it?  “In the race against Death, I think speed trumps everything else. All discussions about a soulful exchange between the writer and the reader are mere nonsense. The only goal for my writing is keeping up the pace.”  The pipe-smoking author took out a thick, beautifully bound hardcover book. “This object is as hard and strong as marble. I use it and other volumes like it to construct a staircase to heaven. As I finish each book, I lay it at the top, and another step is added. I build as I climb, and Death is always right behind me. As you well know, the aged gentleman has been running around for eons, and his legs are no longer as limber as before. Climbing a spiral staircase is hardly an easy task for him. So long as my pen-wielding wrist moves faster than his creaky legs, I can keep him at bay. It doesn’t require a lot of brainpower.”  “Do you intend to build your staircase all the way to the front door of the Creator then?” asked the painter.  “If such a door really exists, I’d love to kick it open to see what’s behind!” The writer laughed as everyone clinked cups and drained them. A sudden gust of wind swept large raindrops through the window. The drunkard in the corner turned over and pulled the black cape tighter about his body.  The third man who spoke was plump and smooth-chinned. Years of rich drink had filled out his belly like an overstuffed pillow. “Although your technique isn’t bad, I daresay that my response to Death is more thorough. Since everything is meaningless, I have decided to do nothing but drink. My considerable inheritance has all been transmuted into piss as I sought out the best vintages in the world. I can’t say for sure whether there’s a door behind which sits the Creator, but I can guarantee you that there is indeed an entrance to heaven located in this sublunary world.”  He raised his cup. “It’s right here! When Death comes for me, I never act shocked or unhappy. Instead, I invite him to have a drink. In vino amicitia, and there is no bond stronger between two beings than the duty of drinking companions. Despite his considerable powers, he cannot match my years of practice, and a few drinks later he is flat out on the table, snoring. By the time he wakes, I’m long gone from the scene. What do you think, my friends? Isn’t my method of escape so much easier and more fun to carry out?”  “Doesn’t he ever learn his lesson?” the painter asked. He took a sip and savored the wine.  “He has never turned me down when I asked. Sometimes I suspect that his visits aren’t timed to when I’m supposed to die, but just because he has a craving for my fine wine.”  “I imagine you must be able to outdrink anyone in the world. Otherwise your approach is far too risky.” The writer drained his cup.  “I don’t worry about that. So long as I’m drunk, why would I care even if he takes me away?” The connoisseur refilled everyone’s cup from a drinking gourd.  “Most honorable sirs, I’ve never heard such amazing tales,” said the robot soldier, who had been quietly listening this whole time. It was now the robot’s turn to tell a story. “Permit me to make an observation, however. Although each of you possesses a unique skill that has allowed you so far to thwart the greatest power in the universe, I think each of you remains driven by fear. You’re obsessed with how to overcome Death in your next match. This means that you can never be truly relaxed, and that’s no real freedom.”  The others, who had always had rather high opinions of themselves, simply smiled politely at this, though there was now a chill in the air. The storm outside the window had abated to a drizzle, and even the snores of the drunkard had lightened.  The robot continued. “Each time Death invites me, I go to the appointment happily. That’s right. I’m telling you that the fear of Death is completely unnecessary. He wants nothing more than to bring us to another country, where the scenery is beautiful in its own way. The living think that it’s impossible to return from that country; though that statement is not entirely wrong, it’s not the full truth either. I’ve been there many times already. Although the rules forbid me from returning, I’ve always managed to come back by dint of my wits.”  The other three sat stunned for a moment until they had fully processed the robot’s fantasy and burst into uproarious laughter. The painter guffawed so hard that he could hardly sit upright; the author shrieked and slapped the table; the wine connoisseur’s face was so contorted with mirth that his eyes had disappeared under folds of flesh. The drunkard in the corner impatiently turned over. The robot joined in the merriment until the laughter gradually died down from exhaustion.  The writer, one-quarter serious, said, “I think there’s a logical hurdle standing in the way of your story: if anyone were to return from death to life, that person would have not truly died. The very definition of death is that there is no way back to life.”  “Do allow me to disagree,” said the robot. “It’s illogical to assume in the first place that no one and nothing can leave the realm of Death. Obviously, Death himself can leave.” Seeing that the writer was about to object, the robot hurried on with its explanation. “First, since Death is the sovereign of all brought to that country, he himself must perforce belong there. At the same time, he always leaves there to come here to take us away. Accepting the truth of these premises, why should we assume that no one else can do the same? For example, one time, I was wandering over there . . . ”  He continued to spin outrageous tales that drove his audience mad. However, as the other three could not think of an effective rebuttal, they had to endure growing headaches as expressions of rage gradually replaced their smiles. Abruptly, the drunkard who had been lying in the corner under his black cape shuddered, and opened his eyes. The other three around the table jumped up in surprise.  “Damn you! Now look what you’ve done!”  Before the drunkard could get up, the three adventurers grabbed their bags and rushed out of the rest stop, disappearing over the muddy ground into the misty horizon.  The black-caped man got up and dusted himself off. As he straightened his clothes, his face took on a serious expression. The stare he directed at the robot was as cold as icicles.  The rain dissipated. Sunlight pierced what was left of the clouds, revealing three figures running toward the end of the rainbow.  “Now I know who you are,” said the man, “but I have more important business to take care of right this moment.” Just before he exited the room, he turned around. “If you’re hoping you’ll never see me again because you aren’t made from mortal flesh, you’d better think again. Seize the day. Seize everything you can get your hands on.”  And so the robot soldier finished every drop of wine that was left, even though it found the drink tasteless. It also took all the fish bones left on the plate with him and tossed them to a feral cat by the side of the road.  After that encounter, the robot lived an uneventful life for a while. By then, most people had heard that there was another bullshit artist who was almost as good as the king himself. To advance further in his career, the robot decided to seek adventures in new lands.  It joined a fleet led by a notorious explorer who wasn’t completely right in the head. The explorer believed that there was a massive black hole at the heart of the galaxy where magnificent lost treasures could be found. Even fragments of those treasures scattered at the edge of the black hole would be enough to make the expedition a success. But only halfway through the voyage, the fleet was destroyed by asteroid strikes. The shipwrecked robot was tossed into the infinite vacuum of space. Weightless, it nonetheless managed to sustain a good mood, and allowed itself to be pulled hither and yon by the chaotic gravity fields all around.  The universe was so grand that the robot had plenty of time to look around. Yet everything was so dark that other than the endless star field, it could see nothing. Only after drifting for hundreds or thousands of years would it encounter an occasional star system approaching through wisps of space dust. Some of the systems had three suns, and some suns had already shrunken into cold white dwarves. Sometimes it even encountered artificial entities like itself, drifting aimlessly like the wreckage of some space fleet. One time, a beautiful, rose-shaped nebula appeared straight ahead. The robot stared at it for about two million years, excited about the possibility of exploring that lovely sight. However, halfway there, the robot was seized by a momentary bout of greed and reached out for something that looked like a battery. The movement, unfortunately, shifted its course just enough that the rose nebula gradually disappeared from view. Only seventy million years later did the nebula reappear behind the robot.  And the “battery” turned out to be nothing more than an alien ashtray.  Drifting, drifting . . . was there no end to this aimless wandering? The robot grew sleepy. As it floated in and out of consciousness, it thought, “At least the ashtray will serve as proof. When I get back, I don’t need to make up anything. All I have to do is to tell the truth of what I experienced, and everyone will acknowledge me as the master of tall tales . . . but then again, if we’re talking about tall tales, why do I need proof?” Even in its confused state, it still remembered the final words from that black-caped drunkard, and it tightened its fist around that bit of flotsam that served as the sole trophy of its long odyssey.  The robot fell asleep and dreamed that an electric sheep rushed at it, its horns made of crimson lasers. The robot’s own legs, however, refused to obey its commands to flee. Terror heated all the robot’s circuits until, with a loud bang, the sheep slammed into it. The robot opened its eyes and found itself mired in a dirty pool of water.  The edges of the pool were as smooth and slippery as the walls of a well, and the scrambling robot could not get any purchase. Just as it thought it was going to drown, it grabbed on to something and felt itself being hauled out of the water and tossed through the air. After a dizzying flight, it found itself on the shore of a black river.  The sky glowed with a rainbow sheen, and all around were tall mountains. A cat wearing a cape squatted next to the robot, expressionlessly casting a fishing line back into the river.  “I’m sorry to bother you.” The robot bowed to the cat. “Where am I?”  The rolls of fat on Mr. Cat’s face betrayed no trace of kindness. The robot noticed a dangling cigarette under the quivering whiskers. It was a remarkable cigarette too, longer than all the cat’s whiskers added together. Moreover, the cigarette had been lit for a long time, as almost seven-tenths of it had turned to ash. Nonetheless, the crooked column of ash stubbornly remained attached as the lit tip marched toward the cat’s whiskers.  “Aha, it just happens that I have an ashtray!” said the robot. “Don’t stand on ceremony if you need it.” The robot respectfully presented its sole treasure to the smoking cat.  Mr. Cat turned to it, and a green light shone from its vertical pupils. Joy gradually softened his face. “Meooowww—”  And that was how they became friends.  It turned out that Mr. Cat had lost his ashtray, and as he didn’t want to litter the river’s shore, he had no choice but to remain squatting, moving as little as possible. It was fortunate for the robot to rescue him from such an awkward predicament. To express his gratitude, Mr. Cat agreed to grant the robot one favor.  “I just want to return home,” said the robot.  Mr. Cat frowned, explaining that it was impossible for anyone fallen into the black hole to leave. Everyone was supposed to report to the Castle sooner or later, so it was best for the robot to accept its fate. But the robot insisted that it had not yet accomplished its mission, and it would never be satisfied with staying here. Regardless of how slight the ray of hope, it was determined to seize it. Mr. Cat, touched by the machine’s dedication, sighed.  “All right, I’ll help you. Why don’t you seek out a picture-dodger who’s always smoking a pipe? I heard that he has successfully escaped Death multiple times.”  Having thanked Mr. Cat for the advice, the robot continued its journey. All the sights it saw along the way were strange beyond description. Following the course of the river, the robot came to a wasteland where two massive armies were engaged in a heated battle. The field was covered with broken limbs and corpses.  A patrol of three-dimensional barcode soldiers caught the robot and asked, “Whose side are you on?”  “My allegiance will always belong to His Majesty, the Glorious Bullshit King.”  Unsatisfied with this answer, the patrol threw the robot in jail as a spy. In the next cell sat a man smoking a pipe.  The robot explained who it was looking for, and the man nodded. “You’re looking at him! Since you’re a friend of Mr. Cat’s, I’ll help you—provided you agree to help me. As you know, most here go obediently to the Castle when summoned, since it will end their journeys and release them from their mortal troubles forever. A few troublemakers, however, will play hide-and-seek with Lord Death. To capture me, he painted strange picture after strange picture and placed me in the paintings, hoping to trap me in those carefully-designed-but-impossible-to-construct buildings. I’ve always managed to escape though. Still, he won’t give up. I’m hoping to find out just how many more pictures does he intend to paint, and how much longer will he torture me before he’s had enough.”  The robot stood up and held a fist over its chest, promising the picture-dodger an answer no matter how much work it required.  “Excellent.” The picture-dodger slid next to the robot and nimbly revealed a hidden trapdoor at its feet. “Go! Hurry!”  The trapdoor led to a tunnel that was like a long slide, from which the robot finally emerged by falling onto a pile of straw. Getting up, it found itself in a valley at the feet of snowcapped mountains. A clear, placid lake shone like a mirror, and a bearded man with bared shoulders and arms was splitting wood under a towering, ancient tree. As the man swung his ax with full concentration, a woodchip covered by sentence fragments spun through the air and fell at the robot’s feet.  The robot explained its mission to the woodchopper, who asked, “Why do you have to go home?”  “I’ve got to go back and tell some tall tales,” the robot answered honestly.  “That’s a pretty good reason,” said the man, grinning from ear to ear. “All right, I’ll help you—provided you agree to help me. I’m a poet under a curse. The curse was probably the result of my theft of the seed of language, from which I wrote magnificent poetry. My plan is that as long as the tree keeps on growing, I’ll be able to climb up and leave Death behind forever.” They both glanced up at the ancient tree, whose lush canopy of branches disappeared into the clouds. The trunk of the tree, however, was full of knots and burrs. A passing gust of wind brought down a shower of withered leaves. “This tree had once been full of life and glory, but now it has stopped growing due to some disease. I want to know: what has blighted its soul?”  The robot stood up and held a fist over its chest, promising the poet an answer no matter how much work it required.  Despite not trusting the robot fully, the poet stood up and recited:  “ . . . est semblable au prince des nuées Qui hante la tempête et se rit de l'archer . . . ”  As though heeding a summons, a massive albatross descended from the heavens and seized the robot with its claws. In a moment, the great bird had ascended above the snowcapped mountains and plunged into the thunderbolt-riven sea of clouds. The robot was feeling a bit tired from its long journey, and a lightning bolt struck it just then directly in the chest and recharged it with vim and vigor. The surprised albatross let go, and the robot tumbled from the sky and landed on a ship. The undulating dark sea reflected the brilliant dawn, and a plump man sat at the bow, drinking.  The robot wished him good health and explained its mission.  “You’re indeed kind,” said the man. “I’ll help you—provided you agree to help me. Every time Death comes for me, I become fearless as soon as I gulp down a bottle of my drink. He can’t do a thing to me when I’m in that inebriated state. But after the alcoholic haze leaves me, I again grow weak and terrified. I want to know if there’s some way for me to never sober up.”  The robot stood up and held a fist over its chest, promising the drinking man an answer no matter how much work it required.  The man, overjoyed, invited the robot to join him. The wine was truly exceptional as even the metal tongue could tell the taste was peerless—though it lacked the words to do the flavor justice. After a few rounds, even its always-sober electronic brain grew hazy. The wine was like a wonderful experience of annihilation itself. The robot seemed to see its drinking companion’s body puff up and expand . . . until he had turned into a giant. The robot saw itself sitting on the giant’s shoulder, and the once-boundless sea was nothing but a puddle at the giant’s feet. The giant grabbed the robot and tossed it with a long swing of his arm. The mechanical soldier tumbled through the air, zipping along at an incredible speed, until it fell into a volcanic crater.  Next to the boiling lava, a man sat deep in thought. The robot instantly sobered as it recognized the gloomy figure.  “A pleasure to meet again,” said the robot, bowing. “However, I still can’t go with you. In fact, I have to ask you to send me back, as I’m on a mission. I understand that you’re a gentleman who can be persuaded by reason. Would you hear me out?”  “What you ask for is impossible.”  “Let’s discuss it at least. Maybe I can help you in some way—”  “There is no problem that I can’t solve. I have no need of anyone’s aid.”  “I do beg your pardon. However, I think there are a few questions that perhaps even you can’t answer.”  “Ask away.”  “I know a picture-dodger who has always been able to escape from your maze-paintings. Do you know how he’s been able to accomplish this?”  “Although I can’t tell you the answer right now, I’m sure I’ll figure it out.”  “I’m curious . . . if he can always escape, why don’t you give up the hunt?”  “Without pictures, how can there be picture-dodgers?”  The robot, having experienced and seen so much of the world, was now able to think deeper. After churning the man’s words in and through and around its circuits, it decided that the logic was not unsound. So, it continued. “I have a friend who planted a language tree that had grown almost as tall as the sky itself. The tree has fallen prey to some infestation. Do you know the cause?”  “It’s possible that the tree is afraid of heights.”  It was so wonderful to speak with the truly wise! The robot’s mind had been opened even wider.  “One more question. I heard that inebriation causes people to feel brave and honest. Is there a drink that will intoxicate permanently? Why doesn’t the Creator allow the drunken to feel the same courage and confidence once they’re sober?”  “Aren’t the very things that intoxicate people also created by people?”  The answer basically confirmed the robot’s guess. It felt it had a good grasp of the situation.  “If you already know the answers to these questions,” said the robot, “why don’t you explain them to my friends?”  Death sighed. “Because they run away as soon as they see me, giving me no chance to explain . . . and also . . . ”  “I’m going to be so bold as to suggest that you probably enjoy the interminable hunt,” said the robot gingerly. Death probably doesn’t have any friends.  “All right,” said Death wistfully. “If you’re willing to take my answers to them, I’ll help you. It’s time to end these games.”  “You can count on me,” said the robot, holding a fist over its chest.  Death walked up to the robot and placed a hand against its back. One hard shove sent the robot into the boiling lava. But instead of being harmed, the robot sank through the lava, fell through the clouds, and landed back on the ship. The giant had shrunken back to his usual, plump form, and he was sitting at the stern of the ship, drinking by himself.  “Have you found the answer to my question?”  “It is said that wine does not make a man drunk; the man makes himself drunk. My friend, have you tried to see this world for what it is when you’re sober? Gaze at yourself; gaze at Death.”  The man was silent. He had never, in all his life and death, done this. “You’re right . . . ” He set down his cup and stared at the ship’s wake for a long while. His mind awakened as his gaze cleared. The roiling, savage black waves seemed to be a mirror for his soul. For a moment, his rotund body shivered, as though he wanted to take a step back, but he forced himself to stand his ground. Yes, he saw it all clearly; he understood all his duties and honors. He turned and went into the ship’s cabin. When he emerged, he was dressed in full armor.  “This is my gift to you,” the aged warrior said as he untied the drinking gourd from his belt and handed it to the robot. The wind howled and the waves rose higher. “He’s coming for me. I shall face him head on this time.”  As the raging waves heaved and dropped the ship, the robot was thrown overboard into the sea. The drinking gourd grew until it lifted the robot out of the water like a lifeboat. The robot looked back and saw that the old warrior in his rusty armor was standing on the tempest-drenched deck like a bronze statue, his sword at the ready.  Riding the drinking gourd, the robot drifted over the ocean until, somehow, he found himself in the lake surrounded by snow-capped mountains. The poet’s beard was now much longer, and he was trying to feed some Möbius grass to a clockwork horse.  “Do you have an answer for me?”  The robot uncapped the drinking gourd and poured a shot for the poet. “Drink up! You’ll be inspired after this. But you must decide that this is what you want.”  The poet hesitated for a moment. Why not? Isn’t this what I want? He drained the cup. The sweet nectar, distilled from the food of the gods, poured into the parched soil of his heart, nurturing it with hope, life, and youth until the seed of love germinated and grew into a towering vine that thrust into the heavens, proudly sporting layers of lush leaves. The poet, delighted, climbed up like a swinging gibbon, and soon disappeared from view.  The robot waited. As we all know, the robot was very patient.  And waited.  And waited.  Finally, the poet returned. He was covered in bruises and wounds, and twigs and leaves lay tangled in his beard and hair. His whole body trembled as he held up a single branch to show the robot.  The mechanical soldier wanted to ask whether the poet had climbed to the top of the tree and what he had seen there. Had he managed to lift the veil over the face of the world? Had he found eternity? It managed to hold its metal tongue, though, because it didn’t want to sadden the poet.  “Take this branch as a keepsake,” said the poet. Then he helped the robot mount the clockwork horse and began to wind up the mainspring. Creak, creak, the coils of the spring grew tighter; clack, clack, the horse pawed the ground. “Farewell, my friend! It’s time for you to go. We’ll see each other again when everything starts over. I shall now construct my own tomb, so remember to never look back, no matter what.”  The poet let go of the reins, and the clockwork horse galloped away, joy punctuating every step. The robot respected the poet’s wishes and didn’t look back. From behind came the fading sound of an ax biting into wood. Eventually, all it could hear was the sound of the howling wind.  The mechanical pair traversed the wilderness until they came to a ruined city. In a square surrounded by broken walls and fallen beams, a faithful crowd was in the process of crucifying an apostate. The robot dismounted from the horse and joined the watching throng.  The victim was tied to the crucifix, a familiar pipe dangling from the corner of his mouth. His gaze was tender, without pride or anger. As his eyes swept through the onlookers, they stopped on the robot. “Ah, there you are. Do you have anything to say to me?”  “You’re always on the run, unable to tarry in any world. In your heart of hearts, do you not yearn to be embedded in a picture? Perhaps you’re waiting for a perfect masterpiece worthy of being your home. Or perhaps you seek through your escapes to become the focus of everyone’s attention because it’s the blank space in a painting that draws our eyes. However, you’re thus doomed to be a formless shadow.”  “Aha, he is wise,” said the painter in an admiring tone. “He has pointed out the root of my unhappiness. I must repay him . . . All right, it’s time. I shall carry out my duty. Please, take my pipe and give it to him as a token of my gratitude. This is my last wish.”  A black-robed priest hesitated for a moment before approaching the man to take the pipe from his mouth. The priest then walked up to the robot, revealing his pale face. The robot accepted the pipe without a word.  The mob agitated, demanding blood. The headless executioner swung his hammer and drove long nails into the bones of the man on the crucifix. The clangs reverberated; rose-colored flesh and blood scattered through the air; the crowd shouted and screamed in a festive frenzy. The black-robed priest took out a sketchpad and began to draw. His slender, nimble fingers roamed over the page precisely, and the sketch of the victim showed an expression of sorrow and peace. All his suffering had come to an end.  The crowd approached the bleeding body to kiss it, and then scattered.  “Once again, only you and I are left.” The black-robed man’s gaze seemed sad.  “I’ve fulfilled my promises,” said the robot.  “All right, I’ll send you to the end; only there can you find the beginning. The rest is up to you.” The black-robed man flipped the sketchpad over and began to draw on the black side.  The robot had no doubt of Death’s honor. It waited patiently until its sight began to blur. The world faded, like a dying fire. All shapes and colors lost their reality, and then only silence remained.  The feeling reminded it of drifting in space, though even more pure and peaceful. The robot tried to turn around. There was nothing in its way, though it seemed to have fallen against something soft and curved. The robot’s presence and movements seemed to have no result other than turning itself into a deep depression in space. Or perhaps it was floating on a lake in which every slight movement resulted in endless ripples.  “Stop struggling,” said a voice out of the darkness. Had it spoken out of sympathy or impatience?  Always courteous, the robot stopped moving, pondering what to do next. The voice seemed familiar.  “Your Majesty?” it asked. It couldn’t be sure whether the voice belonged to the honest old king, or the shameless new king.  There was no answer.  After its eyes had had some time to adjust, the robot noticed a faint pixel that seemed to glow just a bit brighter than the background some distance away. If the robot hadn’t been so steadfast of will, it would never have noticed it. Still, now that the robot had a target to aim for, courage returned. It swam toward the pixel, and the fabric of space itself neither permitted the motion nor forbade it.  Slowly, the bright pixel got closer. It took an enormous amount of effort from the robot before the pixel got close enough to reveal itself as a bonfire that had almost gone out.  “I suggest you leave it alone,” said the voice from the darkness.  “I’m sorry, but I have to depart from here.” The robot never refused to converse with strangers. It believed that as long as it sincerely explained the situation, others would always show understanding and kindness.  “I know about your mission,” said the voice in the darkness. “Fidelity is praiseworthy, and if possible, I would pin a medal on you myself. However, the last spark is about to go out, and there won’t be anything to worry about anymore . . . ”  After some thought, the robot retrieved the branch that was the poet’s last gift and carefully poked it into the embers of the fire. The final wisp of flame poofed back to life like a dancing cobra and illuminated a spherical region of space. An old man wearing a crown emerged from the darkness, looking both like the young old king and the aged new king.  “Oh . . . ” His eyes squinted against the bright firelight. “I guess you really are determined. Why do you want to go home so much? Nowhere else will give you the eternal peace that you can find here.”  “I’ll never give up even if there’s only a single ray of hope.”  “That’s touching,” said the old man. “You are not acting just for yourself, and that’s admirable. All right, let me ask you a few questions. If your answers delight me, I’ll help you.”  “I shall answer truthfully!” The robot held a fist over its chest.  “When I was a young ruler, I thought solemn honesty was the pinnacle of virtue. I rewarded those who worked hard and tried to reform those who deviated from the straight path. My subjects were thus preserved from petty sins, and their hearts untroubled. However, it would be wrong to declare my kingdom back then as a heaven on earth. As I matured, I began to understand the frivolous and irresponsible better, and grew more lenient with the ridiculous and disrespectful. The people’s lives grew more relaxed and joyful, but moral corruption followed. As an unbiased observer, tell me, between the solemn and the absurd, which is more worthy of encouragement? Between the hero and the clown, who is more lovable?”  “Your Majesty, my view is that Fate has always loved to give birth to twins. Each person you named is their own twin.”  “Ha! What an interesting answer. I see you are possessed of more than a bunch of etched circuits.” The old man smiled.  “You’re right. Some water had gotten into my electronic brain,” said the robot, who was determined to tell the truth. “Strange negative electrons thus made their way into my mixed-up thoughts.”  “Now, for my second question. A human being is a bundle of contradictions. One can sacrifice oneself like an angel, but one can also devote one’s whole life to hurting others like a demon. Tell me, which is stronger: love or hate?”  “I have observed that all finite beings crave to cleave to something more lasting. This is the only way for us to become fearless, though it doesn’t matter what we pledge allegiance to.”  “Very good,” said the old man as he stroked his white beard. “I like you even more now. One last question, which you must think over carefully before answering. It’s very important.”  “I will make use of each and every calculation module in my body,” said the robot solemnly.  “Excellent. Then let me ask you: do you believe you can carry out your duty? If you return home, will you truly qualify as the unprecedented, peerless, one-and-only, unparalleled, unsurpassed, irreplaceable, unreproducible, history-defying, future-mocking master of bullshit?”  As the robot promised, it invoked 256 different verification routines and carried out 97,466,000,000,000,000 calculations. After exhausting nearly every ounce of energy, it answered, “Yes, Your Majesty.”  The old man nodded slowly. “We’re obviously in the middle of a very serious and solemn situation right here, so I won’t ask you to prove yourself with a few demonstration tales. Maybe you could tell me about your understanding of the art of bullshit, and I’ll then be able to assess whether your confidence is warranted.”  Having devoted almost its entire life to this career, the robot launched into its answer without delay. “I believe tall tales please both the teller and the listener. This is partly because the sharp glare of the truth can injure mortal senses and strike fear into the hearts of the common people. It’s thus necessary to disguise the truth in the form of ridiculous stories so that they may then seep into fragile and suspicious nerves. Even if these dull minds cannot extract the beneficial truth hidden therein, at least the blunted instrument would not injure them too much . . . ”  The old man’s frown, which had relaxed just a fraction, tightened again. He was not entirely satisfied.  The robot continued, “ . . . However, after many years of worldly experience, I think tall tales give pleasure simply from the imagination’s leap into the infinite. It’s no different from humanity’s desire to fly. The pleasure alone is reason enough; no other explanation is needed.”  A relieved smile crinkled the old man’s face. “That is a good answer.” He retrieved a sword-shaped pencil from a sleeve. “When I was in the mortal realm, I once wielded this to conquer the world and build my kingdom. Here, in the country of Death, I used it to erase light and trap everything in darkness. Now I pass it on to you with the hope that you’ll find a good use for it. Ah, there, the fire is about to go out. Everything is going to sleep.”  The branch added by the robot had turned to ash. Dull, thudding footsteps echoed not too far away.  “You don’t have much time,” said the old man, whose smile faded as the light dimmed.  “Would you come with me?” The robot held on to the pencil tightly.  “I’m a slave who belongs here for eternity. Go now. Remember, I help you not out of some deep plot or scheme, but simply a desire to see the look of defeat on his face. Even once would be enough for me.”  Only a few dying sparks remained among the ashes, just enough to illuminate the white beard, shaped like the curve of a smile. Then, nothing but darkness.  Without wasting a moment, the robot pulled out the pipe. Earlier, when it had rummaged around for the branch from the poet, it had discovered that the pipe was made from an eraser. Now it swept the pipe through the darkness, and an arc of light tore apart the primeval chaos. The noise of footsteps halted momentarily before redoubling as the unseen hunter rushed forward.  The robot erased with all its might until it managed to rub out a circle in the darkness, which was just big enough for it to crawl through—this had been computed earlier as the result of its 97,466,000,000,000,001st calculation. It fell through the hole onto muddy ground and immediately turned around to color in the hole with the pencil.  By the faint light from the hole, the robot could see the pale hand of Death reaching out of the portal between the worlds. Fortunately, the robot had already drawn an X across the hole, which barred the hand from coming through. The robot worked hard to color in the four quadrants. At first, the pencil strokes were rushed and uneven, and it was possible to hear Death’s sighs on the other side. Later, after reassuring itself that everything was all right, the robot patiently, meticulously, and evenly filled out every millimeter of space, ensuring that not even a single pixel would be left untouched. It colored until the pencil was just a stub too small to hold. After checking over everything to be sure the seal was tight, the robot relaxed and fell asleep.  By the time the boy woke up, he felt sore all over. All around him was muddy soil, and he found himself leaning against a thick tree root. The boy finally remembered that he had fallen into a deep pit in the ground. Overhead the shape of the sky was irregular, and a few people were leaning over the edge of the hole, looking down. The noise of more anxious people filled the air as they argued about how to rescue him.  Some bug was crawling over the back of his neck. Carefully, the boy caught it and gazed at its wriggling, tiny legs in his palm. His stomach rumbled with hunger. Everything was so new, so interesting, and he wanted a big meal to reward himself for everything he had been through this afternoon.  After filling his belly, the next order of business would be to regale his audience with his adventures. Even without any poetic license, he was sure that they had never heard such strange tales.  The adults always think they’re so wise and they know everything. They’d never take a kid’s words seriously. They’ll say I made it all up . . . But who cares! Someday they’ll know I’m telling the truth.  Well, it doesn’t matter if they call me a liar. As long as they enjoy my tales and laugh heartily, I’ll help them.    Originally published in Chinese in Zui Found, November 2014.    Translated and published in partnership with Storycom.   Jia Liyuan, born in 1983 in Chifeng, Inner Mongolia, China, received his Ph.D. in Literature from Tsinghua University, and served as a postdoctoral research fellow at Beijing Normal University. He is currently an Assistant Professor in the Department of Chinese Language and Literature at Tsinghua University. He has been published academically in journals such as Science Fiction Studies, Literary Review, and Chinese Literature Today. He also pursues his interest in writing science fiction under the penname Fei Dao. He is the author of short story collections Innocence and Its Fabrications (Chunzhen ji qi suo suzao de), The Storytelling Robot (Jiang gushi de jiqiren), Chinese Scifi Blockbusters (Zhongguo kehuan dapian), and The Long Journey to Death (Qusi de manman lütu). Works translated into English include “The Robot Who Liked to Tell Tall Tales,” “The Story-telling Robot,” “A Story of the End of the World,” and “The Demon’s Head.”  Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.", "text": "8050 words, novelette\nThe Robot Who Liked to Tell Tall Tales\nOnce upon a time there was a king. He was brave and clever and blessed with good luck. As you might expect, he ended up unifying the world, and even made plans to conquer the sun. Most remarkably, he did everything aboveboard and never lied. The people loved him and wanted to emulate his example. Let’s put it this way: there had never been a realm in the history of the universe so pure and good as his.\nUnfortunately, he had a son who enjoyed lying. From childhood, the prince exaggerated and bragged, and his shameless whoppers made his parents blush with shame. The courtiers and ladies-in-waiting were so tickled by his tall tales that they wanted nothing more than to roll on the floor and howl with laughter, though courtly etiquette forced them to hold it in, and they all ended up with stomachaches. Unavoidably, his colorful yarns spread throughout the kingdom. At first, the common people tried to remain silent out of politeness, but eventually their bellies hurt so much that they had to laugh out loud. Everyone agreed that they had not heard such fantastic stories in ages.\nThe boy always said, “I’ve never fibbed in my life! You’ll know after you’re dead.”\nThe king gathered the most skilled doctors, the wisest philosophers, the most reputable priests, and the most elegant musicians, and charged them to cure, enlighten, redeem, and reform the little rapscallion. All these efforts came to naught.\nThe prince was the king’s only heir. Only a kingdom of liars would deserve such a braggart for their sovereign—the thought kept the king up at night. Eventually, he became bedridden from worry.\nIt was said that as the king lay dying, the young man, bless his heart, did not say anything outrageous. Tenderly, as he gazed at the old man, he declared, “Dear Father, don’t worry. In your stead, I will conquer something even more terrifying than the sun.”\nAnd so the “Bullshit King” ascended to the throne, and the people’s lives descended into depravity.\nTo be sure, the kingdom didn’t fall into ruin, though the prevailing mood of order and trust was corrupted by a new sense of dissolution. Like snakes emerging after a long winter, frauds, cheats, rogues, and petty criminals—long absent from the realm—reappeared. Honest people could no longer sleep soundly at night. Fortunately, the old king had laid a solid foundation, and loyal ministers continued to do their best to help their new sovereign. Despite the changes, the Bullshit King managed to rule in peace for many years. Although things weren’t as stable as before, the kingdom didn’t collapse, either.\nThe young king continued to tell wild, unbelievable stories day after day. After more than a decade of this, even those who despised him had to admire his consistency. The people settled on a new consensus: our king is the greatest fibber in the world.\nWith the passage of time, the king gradually approached wisdom—let’s not exaggerate here; his progress was about a centimeter. The judgment of the people worried him.\n“This is unacceptable,” he mused. “I can’t go to my grave with such a reputation.”\nHe decided that the solution was to find someone else who was even more of a liar than he was. Nobody ever remembered number two in any category.\nThe old king had built an army of robots. These machine soldiers, fearless and dependable, had done great service for the throne and pledged perpetual fealty to each successive king. After careful screening by scientists, one particular robot soldier was brought to the palace.\n“Listen carefully,” the king ordered.\nThe robot strained to capture every buzz and hum in the air. It was unable to decode any useful information.\n“The silence is terrifying, isn’t it?” The king shook his head helplessly. “I dare say that at this moment, all ears around the globe are perked up, waiting for me to amuse them with some tall tale. I bet you that my stories have done such a good job of curing indigestion that an extra ten thousand sacks of rice are being consumed each year. Sigh . . . What is the point of a life like mine? No one takes me seriously. I’d rather discuss the history of the patches of rust staining your torso, my most honored pile of scrap metal.”\nThe robot saluted him. “I am at your service, Your Majesty.”\n“You know, I wasn’t born like this. One time, I remember going into the royal garden to play and dig for ants under an ancient tree. I dug deeper and deeper until I fell into a bottomless pit. It turned out to be an actual black hole! The black hole was filled with secrets: more than five moles of secrets gathered from members of nine trillion species spread over a million galaxies, secrets that the tellers felt compelled to share but were also terrified of sharing. Wow! What an experience! I climbed back out and wanted to discuss these secrets seriously, but everyone treated my stories as made-up tales. Once people made up their minds, it was simply impossible to convince them otherwise . . .\n“Anyway, this is why I need you. I want you to leave behind the honesty that you obtained from my father. I want you to lie shamelessly, to exaggerate unabashedly, to fabricate castles in the air without remorse. You must become the teller of the tallest tales, an unprecedented master of bullshit. This is how I will be saved, and how you will achieve absolute freedom.”\nAnd that was how the robot got his mission.\nFictioneering was a skill that could not be taught in a classroom, and the mechanical soldier had to go seek knowledge in the world. It left the palace and wandered the earth, gathering wisdom, gaining experience, associating itself with a variety of absurd acts, nurturing its soul in the company of delirious souls, feeding on the diseased ravings of lunatics, learning to tell breathtaking lies, spreading the seeds of chaos—until it also gained a measure of notoriety.\nOne day, the robot was trekking alone on a trail through the wilderness when the sky suddenly turned dark, and a thunderstorm drove it into a run-down rest stop. In the cramped and dark stone hut, three men were drinking around a small stove. In a corner, another drunken man lay asleep, his pale face hidden under the hood of a black cloak full of holes.\nThe drinking companions were glad to have a newcomer. They shifted around the stove to make room for the robot. After pouring a cup of strong liquor for the soldier, they continued their conversation.\n“The two of you have indeed had some exciting adventures,” said a tall, slender man with eagle-like eyes. “However, I have to say that Death is the most terrifying opponent of them all.” The other nodded in agreement. “I’ve had multiple run-ins with Death, but I’ve always managed to escape. As a painter, I’m known for intricate, dazzling portraits of imaginary cities. Each time, Death was fascinated by my pictures. He would step into the scene, stroll through the streets and avenues, traverse the squares and alleyways, brush shoulders with inhabitants with blurred faces—before realizing that he had been trapped by my carefully-designed mazes and had been wandering up and down infinite staircases whose tops circled around to their bottoms.\n“As Death isn’t without a sense of humor, he would tolerate my little jokes. We also have to admire his sense of duty. Since he’s more powerful than anything else in the world, ultimately he would find the exits to the mazes, though the delay would afford me the time to escape.”\nHe brandished a paintbrush. “This is how I’ve been able to get out of each invitation from Death, and now let’s drink to it.”\nEveryone lifted their cup and toasted the brush. Even the black-cloaked drunkard asleep in the corner snored especially loudly in tribute.\nThe man dangling a pipe in his mouth spoke up next. “I’ve had the good fortune of observing some of your paintings. They’re truly admirable for their lofty taste and rigorous execution. I, on the other hand, do not take myself seriously at all. It’s true that people call me an author, and I’ve derived plenty of benefits and honors from the title, but I’ve never thought that anything I’ve written has any value. I don’t mean to offend, but I’ve always been of the opinion that the universe itself is worthless. We ourselves are insignificant, and all our actions mere absurdities. Art is no different.\n“Instead of the pursuit of excellence that you engage in, because I don’t value what I do, I’m more interested in pure speed. When I write, the words simply spill out of me, a nice metaphor for the unrestrained outpouring of time that makes up a meaningless life. Despite this, others praise me as a giant of thought. Funny, isn’t it?\n“In the race against Death, I think speed trumps everything else. All discussions about a soulful exchange between the writer and the reader are mere nonsense. The only goal for my writing is keeping up the pace.”\nThe pipe-smoking author took out a thick, beautifully bound hardcover book. “This object is as hard and strong as marble. I use it and other volumes like it to construct a staircase to heaven. As I finish each book, I lay it at the top, and another step is added. I build as I climb, and Death is always right behind me. As you well know, the aged gentleman has been running around for eons, and his legs are no longer as limber as before. Climbing a spiral staircase is hardly an easy task for him. So long as my pen-wielding wrist moves faster than his creaky legs, I can keep him at bay. It doesn’t require a lot of brainpower.”\n“Do you intend to build your staircase all the way to the front door of the Creator then?” asked the painter.\n“If such a door really exists, I’d love to kick it open to see what’s behind!” The writer laughed as everyone clinked cups and drained them. A sudden gust of wind swept large raindrops through the window. The drunkard in the corner turned over and pulled the black cape tighter about his body.\nThe third man who spoke was plump and smooth-chinned. Years of rich drink had filled out his belly like an overstuffed pillow. “Although your technique isn’t bad, I daresay that my response to Death is more thorough. Since everything is meaningless, I have decided to do nothing but drink. My considerable inheritance has all been transmuted into piss as I sought out the best vintages in the world. I can’t say for sure whether there’s a door behind which sits the Creator, but I can guarantee you that there is indeed an entrance to heaven located in this sublunary world.”\nHe raised his cup. “It’s right here! When Death comes for me, I never act shocked or unhappy. Instead, I invite him to have a drink. In vino amicitia, and there is no bond stronger between two beings than the duty of drinking companions. Despite his considerable powers, he cannot match my years of practice, and a few drinks later he is flat out on the table, snoring. By the time he wakes, I’m long gone from the scene. What do you think, my friends? Isn’t my method of escape so much easier and more fun to carry out?”\n“Doesn’t he ever learn his lesson?” the painter asked. He took a sip and savored the wine.\n“He has never turned me down when I asked. Sometimes I suspect that his visits aren’t timed to when I’m supposed to die, but just because he has a craving for my fine wine.”\n“I imagine you must be able to outdrink anyone in the world. Otherwise your approach is far too risky.” The writer drained his cup.\n“I don’t worry about that. So long as I’m drunk, why would I care even if he takes me away?” The connoisseur refilled everyone’s cup from a drinking gourd.\n“Most honorable sirs, I’ve never heard such amazing tales,” said the robot soldier, who had been quietly listening this whole time. It was now the robot’s turn to tell a story. “Permit me to make an observation, however. Although each of you possesses a unique skill that has allowed you so far to thwart the greatest power in the universe, I think each of you remains driven by fear. You’re obsessed with how to overcome Death in your next match. This means that you can never be truly relaxed, and that’s no real freedom.”\nThe others, who had always had rather high opinions of themselves, simply smiled politely at this, though there was now a chill in the air. The storm outside the window had abated to a drizzle, and even the snores of the drunkard had lightened.\nThe robot continued. “Each time Death invites me, I go to the appointment happily. That’s right. I’m telling you that the fear of Death is completely unnecessary. He wants nothing more than to bring us to another country, where the scenery is beautiful in its own way. The living think that it’s impossible to return from that country; though that statement is not entirely wrong, it’s not the full truth either. I’ve been there many times already. Although the rules forbid me from returning, I’ve always managed to come back by dint of my wits.”\nThe other three sat stunned for a moment until they had fully processed the robot’s fantasy and burst into uproarious laughter. The painter guffawed so hard that he could hardly sit upright; the author shrieked and slapped the table; the wine connoisseur’s face was so contorted with mirth that his eyes had disappeared under folds of flesh. The drunkard in the corner impatiently turned over. The robot joined in the merriment until the laughter gradually died down from exhaustion.\nThe writer, one-quarter serious, said, “I think there’s a logical hurdle standing in the way of your story: if anyone were to return from death to life, that person would have not truly died. The very definition of death is that there is no way back to life.”\n“Do allow me to disagree,” said the robot. “It’s illogical to assume in the first place that no one and nothing can leave the realm of Death. Obviously, Death himself can leave.” Seeing that the writer was about to object, the robot hurried on with its explanation. “First, since Death is the sovereign of all brought to that country, he himself must perforce belong there. At the same time, he always leaves there to come here to take us away. Accepting the truth of these premises, why should we assume that no one else can do the same? For example, one time, I was wandering over there . . . ”\nHe continued to spin outrageous tales that drove his audience mad. However, as the other three could not think of an effective rebuttal, they had to endure growing headaches as expressions of rage gradually replaced their smiles. Abruptly, the drunkard who had been lying in the corner under his black cape shuddered, and opened his eyes. The other three around the table jumped up in surprise.\n“Damn you! Now look what you’ve done!”\nBefore the drunkard could get up, the three adventurers grabbed their bags and rushed out of the rest stop, disappearing over the muddy ground into the misty horizon.\nThe black-caped man got up and dusted himself off. As he straightened his clothes, his face took on a serious expression. The stare he directed at the robot was as cold as icicles.\nThe rain dissipated. Sunlight pierced what was left of the clouds, revealing three figures running toward the end of the rainbow.\n“Now I know who you are,” said the man, “but I have more important business to take care of right this moment.” Just before he exited the room, he turned around. “If you’re hoping you’ll never see me again because you aren’t made from mortal flesh, you’d better think again. Seize the day. Seize everything you can get your hands on.”\nAnd so the robot soldier finished every drop of wine that was left, even though it found the drink tasteless. It also took all the fish bones left on the plate with him and tossed them to a feral cat by the side of the road.\nAfter that encounter, the robot lived an uneventful life for a while. By then, most people had heard that there was another bullshit artist who was almost as good as the king himself. To advance further in his career, the robot decided to seek adventures in new lands.\nIt joined a fleet led by a notorious explorer who wasn’t completely right in the head. The explorer believed that there was a massive black hole at the heart of the galaxy where magnificent lost treasures could be found. Even fragments of those treasures scattered at the edge of the black hole would be enough to make the expedition a success. But only halfway through the voyage, the fleet was destroyed by asteroid strikes. The shipwrecked robot was tossed into the infinite vacuum of space. Weightless, it nonetheless managed to sustain a good mood, and allowed itself to be pulled hither and yon by the chaotic gravity fields all around.\nThe universe was so grand that the robot had plenty of time to look around. Yet everything was so dark that other than the endless star field, it could see nothing. Only after drifting for hundreds or thousands of years would it encounter an occasional star system approaching through wisps of space dust. Some of the systems had three suns, and some suns had already shrunken into cold white dwarves. Sometimes it even encountered artificial entities like itself, drifting aimlessly like the wreckage of some space fleet. One time, a beautiful, rose-shaped nebula appeared straight ahead. The robot stared at it for about two million years, excited about the possibility of exploring that lovely sight. However, halfway there, the robot was seized by a momentary bout of greed and reached out for something that looked like a battery. The movement, unfortunately, shifted its course just enough that the rose nebula gradually disappeared from view. Only seventy million years later did the nebula reappear behind the robot.\nAnd the “battery” turned out to be nothing more than an alien ashtray.\nDrifting, drifting . . . was there no end to this aimless wandering? The robot grew sleepy. As it floated in and out of consciousness, it thought, “At least the ashtray will serve as proof. When I get back, I don’t need to make up anything. All I have to do is to tell the truth of what I experienced, and everyone will acknowledge me as the master of tall tales . . . but then again, if we’re talking about tall tales, why do I need proof?” Even in its confused state, it still remembered the final words from that black-caped drunkard, and it tightened its fist around that bit of flotsam that served as the sole trophy of its long odyssey.\nThe robot fell asleep and dreamed that an electric sheep rushed at it, its horns made of crimson lasers. The robot’s own legs, however, refused to obey its commands to flee. Terror heated all the robot’s circuits until, with a loud bang, the sheep slammed into it. The robot opened its eyes and found itself mired in a dirty pool of water.\nThe edges of the pool were as smooth and slippery as the walls of a well, and the scrambling robot could not get any purchase. Just as it thought it was going to drown, it grabbed on to something and felt itself being hauled out of the water and tossed through the air. After a dizzying flight, it found itself on the shore of a black river.\nThe sky glowed with a rainbow sheen, and all around were tall mountains. A cat wearing a cape squatted next to the robot, expressionlessly casting a fishing line back into the river.\n“I’m sorry to bother you.” The robot bowed to the cat. “Where am I?”\nThe rolls of fat on Mr. Cat’s face betrayed no trace of kindness. The robot noticed a dangling cigarette under the quivering whiskers. It was a remarkable cigarette too, longer than all the cat’s whiskers added together. Moreover, the cigarette had been lit for a long time, as almost seven-tenths of it had turned to ash. Nonetheless, the crooked column of ash stubbornly remained attached as the lit tip marched toward the cat’s whiskers.\n“Aha, it just happens that I have an ashtray!” said the robot. “Don’t stand on ceremony if you need it.” The robot respectfully presented its sole treasure to the smoking cat.\nMr. Cat turned to it, and a green light shone from its vertical pupils. Joy gradually softened his face. “Meooowww—”\nAnd that was how they became friends.\nIt turned out that Mr. Cat had lost his ashtray, and as he didn’t want to litter the river’s shore, he had no choice but to remain squatting, moving as little as possible. It was fortunate for the robot to rescue him from such an awkward predicament. To express his gratitude, Mr. Cat agreed to grant the robot one favor.\n“I just want to return home,” said the robot.\nMr. Cat frowned, explaining that it was impossible for anyone fallen into the black hole to leave. Everyone was supposed to report to the Castle sooner or later, so it was best for the robot to accept its fate. But the robot insisted that it had not yet accomplished its mission, and it would never be satisfied with staying here. Regardless of how slight the ray of hope, it was determined to seize it. Mr. Cat, touched by the machine’s dedication, sighed.\n“All right, I’ll help you. Why don’t you seek out a picture-dodger who’s always smoking a pipe? I heard that he has successfully escaped Death multiple times.”\nHaving thanked Mr. Cat for the advice, the robot continued its journey. All the sights it saw along the way were strange beyond description. Following the course of the river, the robot came to a wasteland where two massive armies were engaged in a heated battle. The field was covered with broken limbs and corpses.\nA patrol of three-dimensional barcode soldiers caught the robot and asked, “Whose side are you on?”\n“My allegiance will always belong to His Majesty, the Glorious Bullshit King.”\nUnsatisfied with this answer, the patrol threw the robot in jail as a spy. In the next cell sat a man smoking a pipe.\nThe robot explained who it was looking for, and the man nodded. “You’re looking at him! Since you’re a friend of Mr. Cat’s, I’ll help you—provided you agree to help me. As you know, most here go obediently to the Castle when summoned, since it will end their journeys and release them from their mortal troubles forever. A few troublemakers, however, will play hide-and-seek with Lord Death. To capture me, he painted strange picture after strange picture and placed me in the paintings, hoping to trap me in those carefully-designed-but-impossible-to-construct buildings. I’ve always managed to escape though. Still, he won’t give up. I’m hoping to find out just how many more pictures does he intend to paint, and how much longer will he torture me before he’s had enough.”\nThe robot stood up and held a fist over its chest, promising the picture-dodger an answer no matter how much work it required.\n“Excellent.” The picture-dodger slid next to the robot and nimbly revealed a hidden trapdoor at its feet. “Go! Hurry!”\nThe trapdoor led to a tunnel that was like a long slide, from which the robot finally emerged by falling onto a pile of straw. Getting up, it found itself in a valley at the feet of snowcapped mountains. A clear, placid lake shone like a mirror, and a bearded man with bared shoulders and arms was splitting wood under a towering, ancient tree. As the man swung his ax with full concentration, a woodchip covered by sentence fragments spun through the air and fell at the robot’s feet.\nThe robot explained its mission to the woodchopper, who asked, “Why do you have to go home?”\n“I’ve got to go back and tell some tall tales,” the robot answered honestly.\n“That’s a pretty good reason,” said the man, grinning from ear to ear. “All right, I’ll help you—provided you agree to help me. I’m a poet under a curse. The curse was probably the result of my theft of the seed of language, from which I wrote magnificent poetry. My plan is that as long as the tree keeps on growing, I’ll be able to climb up and leave Death behind forever.” They both glanced up at the ancient tree, whose lush canopy of branches disappeared into the clouds. The trunk of the tree, however, was full of knots and burrs. A passing gust of wind brought down a shower of withered leaves. “This tree had once been full of life and glory, but now it has stopped growing due to some disease. I want to know: what has blighted its soul?”\nThe robot stood up and held a fist over its chest, promising the poet an answer no matter how much work it required.\nDespite not trusting the robot fully, the poet stood up and recited:\n“ . . . est semblable au prince des nuées Qui hante la tempête et se rit de l'archer . . . ”\nAs though heeding a summons, a massive albatross descended from the heavens and seized the robot with its claws. In a moment, the great bird had ascended above the snowcapped mountains and plunged into the thunderbolt-riven sea of clouds. The robot was feeling a bit tired from its long journey, and a lightning bolt struck it just then directly in the chest and recharged it with vim and vigor. The surprised albatross let go, and the robot tumbled from the sky and landed on a ship. The undulating dark sea reflected the brilliant dawn, and a plump man sat at the bow, drinking.\nThe robot wished him good health and explained its mission.\n“You’re indeed kind,” said the man. “I’ll help you—provided you agree to help me. Every time Death comes for me, I become fearless as soon as I gulp down a bottle of my drink. He can’t do a thing to me when I’m in that inebriated state. But after the alcoholic haze leaves me, I again grow weak and terrified. I want to know if there’s some way for me to never sober up.”\nThe robot stood up and held a fist over its chest, promising the drinking man an answer no matter how much work it required.\nThe man, overjoyed, invited the robot to join him. The wine was truly exceptional as even the metal tongue could tell the taste was peerless—though it lacked the words to do the flavor justice. After a few rounds, even its always-sober electronic brain grew hazy. The wine was like a wonderful experience of annihilation itself. The robot seemed to see its drinking companion’s body puff up and expand . . . until he had turned into a giant. The robot saw itself sitting on the giant’s shoulder, and the once-boundless sea was nothing but a puddle at the giant’s feet. The giant grabbed the robot and tossed it with a long swing of his arm. The mechanical soldier tumbled through the air, zipping along at an incredible speed, until it fell into a volcanic crater.\nNext to the boiling lava, a man sat deep in thought. The robot instantly sobered as it recognized the gloomy figure.\n“A pleasure to meet again,” said the robot, bowing. “However, I still can’t go with you. In fact, I have to ask you to send me back, as I’m on a mission. I understand that you’re a gentleman who can be persuaded by reason. Would you hear me out?”\n“What you ask for is impossible.”\n“Let’s discuss it at least. Maybe I can help you in some way—”\n“There is no problem that I can’t solve. I have no need of anyone’s aid.”\n“I do beg your pardon. However, I think there are a few questions that perhaps even you can’t answer.”\n“Ask away.”\n“I know a picture-dodger who has always been able to escape from your maze-paintings. Do you know how he’s been able to accomplish this?”\n“Although I can’t tell you the answer right now, I’m sure I’ll figure it out.”\n“I’m curious . . . if he can always escape, why don’t you give up the hunt?”\n“Without pictures, how can there be picture-dodgers?”\nThe robot, having experienced and seen so much of the world, was now able to think deeper. After churning the man’s words in and through and around its circuits, it decided that the logic was not unsound. So, it continued. “I have a friend who planted a language tree that had grown almost as tall as the sky itself. The tree has fallen prey to some infestation. Do you know the cause?”\n“It’s possible that the tree is afraid of heights.”\nIt was so wonderful to speak with the truly wise! The robot’s mind had been opened even wider.\n“One more question. I heard that inebriation causes people to feel brave and honest. Is there a drink that will intoxicate permanently? Why doesn’t the Creator allow the drunken to feel the same courage and confidence once they’re sober?”\n“Aren’t the very things that intoxicate people also created by people?”\nThe answer basically confirmed the robot’s guess. It felt it had a good grasp of the situation.\n“If you already know the answers to these questions,” said the robot, “why don’t you explain them to my friends?”\nDeath sighed. “Because they run away as soon as they see me, giving me no chance to explain . . . and also . . . ”\n“I’m going to be so bold as to suggest that you probably enjoy the interminable hunt,” said the robot gingerly. Death probably doesn’t have any friends.\n“All right,” said Death wistfully. “If you’re willing to take my answers to them, I’ll help you. It’s time to end these games.”\n“You can count on me,” said the robot, holding a fist over its chest.\nDeath walked up to the robot and placed a hand against its back. One hard shove sent the robot into the boiling lava. But instead of being harmed, the robot sank through the lava, fell through the clouds, and landed back on the ship. The giant had shrunken back to his usual, plump form, and he was sitting at the stern of the ship, drinking by himself.\n“Have you found the answer to my question?”\n“It is said that wine does not make a man drunk; the man makes himself drunk. My friend, have you tried to see this world for what it is when you’re sober? Gaze at yourself; gaze at Death.”\nThe man was silent. He had never, in all his life and death, done this. “You’re right . . . ” He set down his cup and stared at the ship’s wake for a long while. His mind awakened as his gaze cleared. The roiling, savage black waves seemed to be a mirror for his soul. For a moment, his rotund body shivered, as though he wanted to take a step back, but he forced himself to stand his ground. Yes, he saw it all clearly; he understood all his duties and honors. He turned and went into the ship’s cabin. When he emerged, he was dressed in full armor.\n“This is my gift to you,” the aged warrior said as he untied the drinking gourd from his belt and handed it to the robot. The wind howled and the waves rose higher. “He’s coming for me. I shall face him head on this time.”\nAs the raging waves heaved and dropped the ship, the robot was thrown overboard into the sea. The drinking gourd grew until it lifted the robot out of the water like a lifeboat. The robot looked back and saw that the old warrior in his rusty armor was standing on the tempest-drenched deck like a bronze statue, his sword at the ready.\nRiding the drinking gourd, the robot drifted over the ocean until, somehow, he found himself in the lake surrounded by snow-capped mountains. The poet’s beard was now much longer, and he was trying to feed some Möbius grass to a clockwork horse.\n“Do you have an answer for me?”\nThe robot uncapped the drinking gourd and poured a shot for the poet. “Drink up! You’ll be inspired after this. But you must decide that this is what you want.”\nThe poet hesitated for a moment. Why not? Isn’t this what I want? He drained the cup. The sweet nectar, distilled from the food of the gods, poured into the parched soil of his heart, nurturing it with hope, life, and youth until the seed of love germinated and grew into a towering vine that thrust into the heavens, proudly sporting layers of lush leaves. The poet, delighted, climbed up like a swinging gibbon, and soon disappeared from view.\nThe robot waited. As we all know, the robot was very patient.\nAnd waited.\nAnd waited.\nFinally, the poet returned. He was covered in bruises and wounds, and twigs and leaves lay tangled in his beard and hair. His whole body trembled as he held up a single branch to show the robot.\nThe mechanical soldier wanted to ask whether the poet had climbed to the top of the tree and what he had seen there. Had he managed to lift the veil over the face of the world? Had he found eternity? It managed to hold its metal tongue, though, because it didn’t want to sadden the poet.\n“Take this branch as a keepsake,” said the poet. Then he helped the robot mount the clockwork horse and began to wind up the mainspring. Creak, creak, the coils of the spring grew tighter; clack, clack, the horse pawed the ground. “Farewell, my friend! It’s time for you to go. We’ll see each other again when everything starts over. I shall now construct my own tomb, so remember to never look back, no matter what.”\nThe poet let go of the reins, and the clockwork horse galloped away, joy punctuating every step. The robot respected the poet’s wishes and didn’t look back. From behind came the fading sound of an ax biting into wood. Eventually, all it could hear was the sound of the howling wind.\nThe mechanical pair traversed the wilderness until they came to a ruined city. In a square surrounded by broken walls and fallen beams, a faithful crowd was in the process of crucifying an apostate. The robot dismounted from the horse and joined the watching throng.\nThe victim was tied to the crucifix, a familiar pipe dangling from the corner of his mouth. His gaze was tender, without pride or anger. As his eyes swept through the onlookers, they stopped on the robot. “Ah, there you are. Do you have anything to say to me?”\n“You’re always on the run, unable to tarry in any world. In your heart of hearts, do you not yearn to be embedded in a picture? Perhaps you’re waiting for a perfect masterpiece worthy of being your home. Or perhaps you seek through your escapes to become the focus of everyone’s attention because it’s the blank space in a painting that draws our eyes. However, you’re thus doomed to be a formless shadow.”\n“Aha, he is wise,” said the painter in an admiring tone. “He has pointed out the root of my unhappiness. I must repay him . . . All right, it’s time. I shall carry out my duty. Please, take my pipe and give it to him as a token of my gratitude. This is my last wish.”\nA black-robed priest hesitated for a moment before approaching the man to take the pipe from his mouth. The priest then walked up to the robot, revealing his pale face. The robot accepted the pipe without a word.\nThe mob agitated, demanding blood. The headless executioner swung his hammer and drove long nails into the bones of the man on the crucifix. The clangs reverberated; rose-colored flesh and blood scattered through the air; the crowd shouted and screamed in a festive frenzy. The black-robed priest took out a sketchpad and began to draw. His slender, nimble fingers roamed over the page precisely, and the sketch of the victim showed an expression of sorrow and peace. All his suffering had come to an end.\nThe crowd approached the bleeding body to kiss it, and then scattered.\n“Once again, only you and I are left.” The black-robed man’s gaze seemed sad.\n“I’ve fulfilled my promises,” said the robot.\n“All right, I’ll send you to the end; only there can you find the beginning. The rest is up to you.” The black-robed man flipped the sketchpad over and began to draw on the black side.\nThe robot had no doubt of Death’s honor. It waited patiently until its sight began to blur. The world faded, like a dying fire. All shapes and colors lost their reality, and then only silence remained.\nThe feeling reminded it of drifting in space, though even more pure and peaceful. The robot tried to turn around. There was nothing in its way, though it seemed to have fallen against something soft and curved. The robot’s presence and movements seemed to have no result other than turning itself into a deep depression in space. Or perhaps it was floating on a lake in which every slight movement resulted in endless ripples.\n“Stop struggling,” said a voice out of the darkness. Had it spoken out of sympathy or impatience?\nAlways courteous, the robot stopped moving, pondering what to do next. The voice seemed familiar.\n“Your Majesty?” it asked. It couldn’t be sure whether the voice belonged to the honest old king, or the shameless new king.\nThere was no answer.\nAfter its eyes had had some time to adjust, the robot noticed a faint pixel that seemed to glow just a bit brighter than the background some distance away. If the robot hadn’t been so steadfast of will, it would never have noticed it. Still, now that the robot had a target to aim for, courage returned. It swam toward the pixel, and the fabric of space itself neither permitted the motion nor forbade it.\nSlowly, the bright pixel got closer. It took an enormous amount of effort from the robot before the pixel got close enough to reveal itself as a bonfire that had almost gone out.\n“I suggest you leave it alone,” said the voice from the darkness.\n“I’m sorry, but I have to depart from here.” The robot never refused to converse with strangers. It believed that as long as it sincerely explained the situation, others would always show understanding and kindness.\n“I know about your mission,” said the voice in the darkness. “Fidelity is praiseworthy, and if possible, I would pin a medal on you myself. However, the last spark is about to go out, and there won’t be anything to worry about anymore . . . ”\nAfter some thought, the robot retrieved the branch that was the poet’s last gift and carefully poked it into the embers of the fire. The final wisp of flame poofed back to life like a dancing cobra and illuminated a spherical region of space. An old man wearing a crown emerged from the darkness, looking both like the young old king and the aged new king.\n“Oh . . . ” His eyes squinted against the bright firelight. “I guess you really are determined. Why do you want to go home so much? Nowhere else will give you the eternal peace that you can find here.”\n“I’ll never give up even if there’s only a single ray of hope.”\n“That’s touching,” said the old man. “You are not acting just for yourself, and that’s admirable. All right, let me ask you a few questions. If your answers delight me, I’ll help you.”\n“I shall answer truthfully!” The robot held a fist over its chest.\n“When I was a young ruler, I thought solemn honesty was the pinnacle of virtue. I rewarded those who worked hard and tried to reform those who deviated from the straight path. My subjects were thus preserved from petty sins, and their hearts untroubled. However, it would be wrong to declare my kingdom back then as a heaven on earth. As I matured, I began to understand the frivolous and irresponsible better, and grew more lenient with the ridiculous and disrespectful. The people’s lives grew more relaxed and joyful, but moral corruption followed. As an unbiased observer, tell me, between the solemn and the absurd, which is more worthy of encouragement? Between the hero and the clown, who is more lovable?”\n“Your Majesty, my view is that Fate has always loved to give birth to twins. Each person you named is their own twin.”\n“Ha! What an interesting answer. I see you are possessed of more than a bunch of etched circuits.” The old man smiled.\n“You’re right. Some water had gotten into my electronic brain,” said the robot, who was determined to tell the truth. “Strange negative electrons thus made their way into my mixed-up thoughts.”\n“Now, for my second question. A human being is a bundle of contradictions. One can sacrifice oneself like an angel, but one can also devote one’s whole life to hurting others like a demon. Tell me, which is stronger: love or hate?”\n“I have observed that all finite beings crave to cleave to something more lasting. This is the only way for us to become fearless, though it doesn’t matter what we pledge allegiance to.”\n“Very good,” said the old man as he stroked his white beard. “I like you even more now. One last question, which you must think over carefully before answering. It’s very important.”\n“I will make use of each and every calculation module in my body,” said the robot solemnly.\n“Excellent. Then let me ask you: do you believe you can carry out your duty? If you return home, will you truly qualify as the unprecedented, peerless, one-and-only, unparalleled, unsurpassed, irreplaceable, unreproducible, history-defying, future-mocking master of bullshit?”\nAs the robot promised, it invoked 256 different verification routines and carried out 97,466,000,000,000,000 calculations. After exhausting nearly every ounce of energy, it answered, “Yes, Your Majesty.”\nThe old man nodded slowly. “We’re obviously in the middle of a very serious and solemn situation right here, so I won’t ask you to prove yourself with a few demonstration tales. Maybe you could tell me about your understanding of the art of bullshit, and I’ll then be able to assess whether your confidence is warranted.”\nHaving devoted almost its entire life to this career, the robot launched into its answer without delay. “I believe tall tales please both the teller and the listener. This is partly because the sharp glare of the truth can injure mortal senses and strike fear into the hearts of the common people. It’s thus necessary to disguise the truth in the form of ridiculous stories so that they may then seep into fragile and suspicious nerves. Even if these dull minds cannot extract the beneficial truth hidden therein, at least the blunted instrument would not injure them too much . . . ”\nThe old man’s frown, which had relaxed just a fraction, tightened again. He was not entirely satisfied.\nThe robot continued, “ . . . However, after many years of worldly experience, I think tall tales give pleasure simply from the imagination’s leap into the infinite. It’s no different from humanity’s desire to fly. The pleasure alone is reason enough; no other explanation is needed.”\nA relieved smile crinkled the old man’s face. “That is a good answer.” He retrieved a sword-shaped pencil from a sleeve. “When I was in the mortal realm, I once wielded this to conquer the world and build my kingdom. Here, in the country of Death, I used it to erase light and trap everything in darkness. Now I pass it on to you with the hope that you’ll find a good use for it. Ah, there, the fire is about to go out. Everything is going to sleep.”\nThe branch added by the robot had turned to ash. Dull, thudding footsteps echoed not too far away.\n“You don’t have much time,” said the old man, whose smile faded as the light dimmed.\n“Would you come with me?” The robot held on to the pencil tightly.\n“I’m a slave who belongs here for eternity. Go now. Remember, I help you not out of some deep plot or scheme, but simply a desire to see the look of defeat on his face. Even once would be enough for me.”\nOnly a few dying sparks remained among the ashes, just enough to illuminate the white beard, shaped like the curve of a smile. Then, nothing but darkness.\nWithout wasting a moment, the robot pulled out the pipe. Earlier, when it had rummaged around for the branch from the poet, it had discovered that the pipe was made from an eraser. Now it swept the pipe through the darkness, and an arc of light tore apart the primeval chaos. The noise of footsteps halted momentarily before redoubling as the unseen hunter rushed forward.\nThe robot erased with all its might until it managed to rub out a circle in the darkness, which was just big enough for it to crawl through—this had been computed earlier as the result of its 97,466,000,000,000,001st calculation. It fell through the hole onto muddy ground and immediately turned around to color in the hole with the pencil.\nBy the faint light from the hole, the robot could see the pale hand of Death reaching out of the portal between the worlds. Fortunately, the robot had already drawn an X across the hole, which barred the hand from coming through. The robot worked hard to color in the four quadrants. At first, the pencil strokes were rushed and uneven, and it was possible to hear Death’s sighs on the other side. Later, after reassuring itself that everything was all right, the robot patiently, meticulously, and evenly filled out every millimeter of space, ensuring that not even a single pixel would be left untouched. It colored until the pencil was just a stub too small to hold. After checking over everything to be sure the seal was tight, the robot relaxed and fell asleep.\nBy the time the boy woke up, he felt sore all over. All around him was muddy soil, and he found himself leaning against a thick tree root. The boy finally remembered that he had fallen into a deep pit in the ground. Overhead the shape of the sky was irregular, and a few people were leaning over the edge of the hole, looking down. The noise of more anxious people filled the air as they argued about how to rescue him.\nSome bug was crawling over the back of his neck. Carefully, the boy caught it and gazed at its wriggling, tiny legs in his palm. His stomach rumbled with hunger. Everything was so new, so interesting, and he wanted a big meal to reward himself for everything he had been through this afternoon.\nAfter filling his belly, the next order of business would be to regale his audience with his adventures. Even without any poetic license, he was sure that they had never heard such strange tales.\nThe adults always think they’re so wise and they know everything. They’d never take a kid’s words seriously. They’ll say I made it all up . . . But who cares! Someday they’ll know I’m telling the truth.\nWell, it doesn’t matter if they call me a liar. As long as they enjoy my tales and laugh heartily, I’ll help them.\nOriginally published in Chinese in Zui Found, November 2014.\nTranslated and published in partnership with Storycom.\nJia Liyuan, born in 1983 in Chifeng, Inner Mongolia, China, received his Ph.D. in Literature from Tsinghua University, and served as a postdoctoral research fellow at Beijing Normal University. He is currently an Assistant Professor in the Department of Chinese Language and Literature at Tsinghua University. He has been published academically in journals such as Science Fiction Studies, Literary Review, and Chinese Literature Today. He also pursues his interest in writing science fiction under the penname Fei Dao. He is the author of short story collections Innocence and Its Fabrications (Chunzhen ji qi suo suzao de), The Storytelling Robot (Jiang gushi de jiqiren), Chinese Scifi Blockbusters (Zhongguo kehuan dapian), and The Long Journey to Death (Qusi de manman lütu). Works translated into English include “The Robot Who Liked to Tell Tall Tales,” “The Story-telling Robot,” “A Story of the End of the World,” and “The Demon’s Head.”\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.", "source": "https://clarkesworldmagazine.com/fei_04_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Robot Who Liked to Tell Tall Tales by Fei Dao, translated by Ken Liu"}