{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Yukimi Ogawa", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "BlxSi7PaKKGvIuWopZenz0E1ddI=", "id": null, "license": null, "comments": "", "raw_text": "8500 words, novelette  Grayer Than Lead, Heavier Than Snow  A chain of patterns, drawn on opaque glass in subtle colors, framed the front door of the Hotel, the most luxurious accommodation in this country. The huge chandelier above the main lobby sprinkled uneven light over the plush carpet that danced and made you feel slightly mesmerized. The carpet was a riot of colors, only if you had the eye for such things—all of them mingled perfectly so that to a casual eye it looked somewhere between gray and beige, a soothing tone that only left impressions of colors to your subconscious.  The ceiling was so high your neck might snap when your eyes trailed the cord above the chandelier. From the niches on the walls, indirect lights illuminated the whole place; some of them were flickery, some steady, the overall rhythm weaving an entirely different pattern that buzzed the air in the lobby and the lounge right beside it. And the lounge—there were peculiarly arranged flowers every few blocks of tables and chairs, and you could not help but stop to stare at those. Before you knew it you were escorted by the staff, winding over the floor in a pattern that made your legs absurdly weary, and by the time you reach your seat, you’d never want to lift your bottom once you sink onto one of those softest cushions. The tall wall at the back was covered with colored tiles, some of them even with holographic effects that worked on your neuro-system to slow the ingestion of caffeine and alcohol, so that you could maybe have just one more drink before leaving.  Every line, every curve, inviting folks into the comfort.  I might want to look over the whole lounge from the mezzanine, she thought, dreaming for just one sip of their extraordinarily expensive tea, until the moment she saw the displeased expression on the face of the person she would soon have to deal with.  She almost cowered away, but then forcibly braced herself. Maybe, maybe, this was the chance for their skills to come out there, for them to stop lurking in shadows as if they were worthless.  The other person stood up, most of her features typical of islanders, though she was oddly tall for a local. Her hair was very dark, a black that almost glistened, and other surfaces visible on her were all evenly spread with a pale, pale indigo. Too perfect: just enough to sate the curiosity of the foreign tourists who came to this island for the exoticism of the islanders’ skin, but not too explicit to steal spotlight from the human locals.  The city official android smiled her perfect smile, which had no warmth meant for the plain-skinned craftsperson. “Craftsperson Kiriko, glad you are here,” the half-human said, as she placed a sum of money that was worth two days’ meals for the craftsperson on the table, beside the apparently untouched cup of coffee. “Sorry to have to move you as soon as you have arrived, but let us go up to one of the rooms in the tower wing. I cannot discuss business with a colorless citizen here, obviously.” She looked around, as if emphasizing the point. “To see our guest, Doctor Planet.”  “Obviously,” was the only reply Kiriko offered as they both wound their way out of the lounge and climbed the stairs to the mezzanine, where they could take the lift up the tower wing.  “As we already communicated in the letter sent to you, Doctor Planet is having an issue with his health, and we . . . cannot talk to the clinic about this.” The ando pressed the button for one of the topmost floors.  Kiriko wanted to ask why, but also knew she was in no position to be asking whys. “What do you require of us?” she said instead, into the official’s back, eyeing the gold-gilded mirrors on the wall and the ceiling of the lift.  “Alleviate Doctor’s discomfort. He takes some . . . doses regularly. But the aftermath of the recent storm is keeping the next ferry away, and his supplies are running out.”  A bell tinged somewhere above, and the doors slid open. “What about the Aeros?” Kiriko asked, frowning. She knew the government used aircrafts in case of emergency, though they rarely carried people. They’d fly over, drop supplies, and then be gone without even touching down. The storm itself had gone a few days ago, and the winds weren’t that bad at the moment.  “For the same reason we cannot talk to the clinic, we cannot open the Aero line for this. Hope you understand.” From the way she said it, Kiriko knew this android—Mizuha, as the letter demanding the craftsperson’s presence had stated the attending official’s name was—didn’t care if Kiriko understood or not in the slightest. “Just until he gets his supplies. It is not that much to ask, is it?”  Kiriko knew her mentor at her pattern atelier hated talking to the andos, and he probably wasn’t alone. The andos were an open secret of the city, not because they weren’t fully human beings, but because they were manufactured, with their calculated colors and patterns, in this place where you must be born with special complexions to be considered colored or patterned, where everything created or tampered with by the hands of humans was regarded as lowly fake. In a city where coloring your nails or your eyelids was deemed illegal.  And that their general attitude toward humans was for some reason disdainful—even hostile in the case of colorless and patternless humans—only added to the discomfort of the human islanders. For Kiriko, it was easier, though; many colorful and patterned folks looked down upon people like her, those who had no special colors or patterns on their skin to entertain foreign tourists, and to Kiriko it was just another pack of people disrespecting her. To the colorful and patterned who didn’t have much experience with disrespect, the andos must have been almost unbearable.  “No, it is not,” Kiriko replied. “As long as you pay enough for the service.” That Mizuha looked younger than her helped her keep calm, even though how old the andos looked didn’t really matter.  They seemed to have finally arrived at their destination. Mizuha knocked on the door, and then there was a click. After a few words exchanged, they were invited into one of the most luxurious rooms of the most expensive hotel in this country.  And what was there to do, but to gasp, gape, and stare around?  The curtains, of a material that Kiriko had never seen! Was it woven with threads of all the colors existent and imaginable, one for each thread? And the window behind them—at a glance the glass was plain, the most transparent thing she had ever looked through, but no, oh no, there were lines etched onto the surface, shallow and deep, deep and shallow, twining and stretching to provide the best possible light filter for the scenery outside. And the lampshades. And the bed canopy. Furniture. If she strained her ears, she could hear the water running through the pipes under the floor; the way it sounded . . . maybe even the inside of the pipes were patterned, to play music that soothed your . . .  “Ms. Craftsperson,” Mizuha called, sighing. “Stop looking stupid and get to work.”  Flushing, Kiriko closed her mouth and swallowed. “Yes. Of course.”  Doctor Planet was seated on the long sofa, beside which Mizuha stood straight, very much likely looking down her nose at Kiriko on purpose. The man looked ill at ease on that fancy sofa, fidgeting with a pouch in his hands. An old man, very pale tan color, eyes the color of the sky just before snowfall. He muttered something quietly, as if . . . sulking. Mizuha said something in the official language in reply.  Kiriko swallowed again. “First—can we have a sample of the dose that he needs?” she asked the half-human.  “Of course.” Mizuha smiled. Doctor Planet made a weak sound when the attending ando gestured for the pouch in his hand, as if parting with the precious portion of the dose was too much for him. “Doctor Planet.” Mizuha repeated gently, plying the small pouch out of his hand and giving it to Kiriko.  “Thank you,” said the craftsperson as she took it. “Now, can you ask him if I can get sketches of patterns from his body parts?”  Mizuha’s smile vanished at an impossible speed. “I don’t know what you mean at all. He is a foreigner, he is not patterned, as you can well see. Oh, of course.” The half-human’s lips curved just a fraction at the corner. “I knew you colorless folks see the world differently than us. But not that differently.”  Kiriko let out a sound that was a perfect cross between a sigh and laughter. She hated this kind of dance, really, but a long time working in the city had trained her somewhat well. “You are quite right about that,” she said, over another sigh. “For the remedy to actually work on Doctor, we need to see the pattern woven by his blood flows, skin firmness, and the refractivity of elements over his parts and his body, and combinations thereof. We call these silent patterns, and everything—even you—have many of these all over. We will control the efficiency of this dose of his using these. Oh, of course.” She forced a smile on her face. “We see the world differently, this is what only the colorless, experienced craftspersons can do. It might be too much for you to understand?”  Mizuha’s lower lip stiffened, ever so slightly. Then she said, “Perhaps you might want to learn the official language, so that you wouldn’t have to rely on entities like us, on an occasion such as this.”  “Oh great, then we can do such business as this directly with the tourists, can’t we? I thought you officials deliberately took the opportunity away from us colorless laborers for learning the language, from the way things look?”  Mizuha glared at Kiriko. Even Doctor Planet seemed to realize something was wrong, and he said something to Mizuha, who replied with a reassuring smile. After a few more words exchanged, Doctor Planet nodded weakly.  “You’re asking too much, and you know that,” Mizuha said, her perfect mask back on. “This has got to be really, really good.”  “You lied,” Kiriko’s mentor said, without looking up from his drawing.  Kiriko groaned, thumping loudly down onto her favorite flat cushion. “I didn’t know what this ‘dose’ really was, so I had to collect every piece of information available, right? Our usual method may not work.”  The atelier’s dealings were mostly true to its name: putting out patterned textiles for furniture and small objects for decorations, to be used in restaurants and shops, and sometimes, rich houses. But when these two craftspersons added a few tricks to the patterns they used on these things, chairs looked more comfortable, commodities on shelves seemed more attractive, and food even tasted better under certain lampshades. They also applied the same principles on minor body discomforts—and it worked. Though not everybody believed in them.  But her mentor was right. If all they needed was to enhance the efficiency of the medication, they had a handful of generic patterns they could choose from. Customized patterns were required for more complex cases such as persistent allergic reactions with rare allergens, or maybe pregnant women. This time they could probably just pick out ready-made-patterned starch paper and tell Doctor Planet to take the remaining doses—cut down to halves or thirds or even less—wrapped in it.  Kiriko had wanted to say something, anything, that might have looked as though she was striking back. Even if there was no point in striking back at the colorful. “And I got enough time to see the interior of the Hotel’s room because of that!” She sighed at the memory. “Oh, anyway. Let’s just get working on this, sensei.”  Her mentor frowned, put his brush down, and finally looked up at her. “My dear apprentice.”  “What? What are you going to scold me for now?”  “Why are you so eager this time?”  She cocked her head. “I don’t know what you mean.”  “You do know what I mean. You’ve always been quite intimidated by the andos. When you had to work with them before, you kept procrastinating forever, until I actually had to scold you like your father or something.”  “You are my mentor, that’s your job.”  “I’m not that much older than you and it hurts my sensitive little heart when I have to do that.”  Under other circumstances Kiriko would have laughed, but now, she pulled another cushion out of a pile and hugged it. “You have been to the Hotel, haven’t you?”  “I have.”  “Then you must know.” She fidgeted with the tassel at a corner of the cushion. “That whole place. It was made by someone like us.”  Every color, every pattern used in the building had been very, very carefully calculated; not a single one stood out to distract the guests or the staff, not a single one jarred the view without blending with the structure of the building itself. And yet, every one of them served the purpose of the bigger picture, of making everyone there feel comfortable, making them want to come back. It couldn’t have been achieved by one craftsperson alone. There must have been a team of them. Which meant that there had been a time when even the colorless people like Kiriko herself or her mentor, those regarded worthless in this island where tourism was the only means for it to survive as a nation, had been respected, had more say on the way things worked.  Her mentor fell silent for a while. Then he said, “If you think things can be like that again . . . ”  “No,” she cut him short, unable to hear the entire sentence. “But still. I cannot stop thinking about it. We could . . . maybe make one tiny step, impress this one ando-san, if we keep trying and some younger persons do the same, and then maybe in one hundred years’ time . . . ”  Her mentor only smiled weakly in reply. That smile always made her heart contract—there was too much behind it. Then he picked up another brush. “Do your best with each project. That’s the only thing we can do. Right? I guess you don’t need my input for that kind of simple remedy anyway, do you?”  “I’ll look into the medication and then let you know.”  And then minutes later, it turned out that it was nothing like what they had expected.  “So basically, you tricked us into supporting a criminal,” said Kiriko, doing everything to not grind her teeth loud enough for others to hear.  Mizuha shrugged like a foreigner. “You think you’d have had a choice?”  “That’s just outright rude and inhumane,” Kiriko’s voice came out louder and shrill, no longer able to restrict herself.  Mizuha lazily looked around, and Kiriko winced; they were both seated on the stiff sofas near the reception of the National Archives building, which most of the city andos belonged to. Entities like Mizuha usually worked at this site and went out to attend foreign guests when needed, following orders from the city. Here, it was hard to tell humans from andos by looks, but Kiriko thought she could, anyway, by the way some of the people did nothing to hide their disdain toward the craftsperson.  Really—they should have guessed. It was not hard to guess. Of course, the city wouldn’t have involved a colorless craftsperson in a treatment of an ordinary health-related issue. But they’d wrongly assumed that it was more about Doctor, not the thing they had to actually touch.  There was no mistaking the crazy pattern that this “medication” wove under the atelier’s customized microscope, which not only enlarged the object but also helped the craftspersons’ eyes take apart elements to grasp the silent pattern they needed for the particular case. General medicines had a way of spreading out over regular waves of a pattern, which forced the pattern from an affected area to submerge and smooth out. But this . . . this thing seemed to send out lines that were so irregular that they felt regular in the end, incessant and persistent, every line holding the potential of striking others into irregularity.  Of course, she knew a narcotic when she saw it.  Mizuha snorted. “For whatever reason, we cannot afford to displease Doctor at the moment. We have already paid and will pay grand again once you turn over the remedy, Craftsperson. You took this job for the money, right?”  “No!” Kiriko forgot herself again. “We took it so you bigheaded city tengu might remember that we are not worthless!”  Mizuha blinked, and Kiriko winced again; Kiriko had had no intention of saying that. She felt heat surging up to her face. “You may not have noticed,” she said, trying to cover embarrassment, “but the Hotel was full of work by craftspersons like us. When I saw the interior of that place, I thought you knew how the city used to value our patterns. But obviously, I was mistaken.”  Kiriko grabbed a bundle out of her bag and slammed it on the table between them. To her surprise, Mizuha flinched.  “Take one ground moontime-primrose seed, with just a few grains of Doctor Planet’s dose, wrapped in one sheet of the patterned starch paper here.” She pressed her hand harder on the bundle when Mizuha reached out for it. “Apothecary-prepared moontime-primrose seed. One sheet at a time. Use water only. Alcohol or caffeine is strictly prohibited. Understand?”  After a few moments of eye-to-eye, silent fight, Mizuha seemed to concede and nodded. Kiriko withdrew her hand and Mizuha took the bundle. “How many?” Mizuha asked without opening it.  “Two weeks’ worth. Certainly the tides will clear by that time?”  “Let us hope,” Mizuha said as she stood and disappeared down the stairs without another glance spared for the craftsperson.  Kiriko wanted very much to forget about this incident, but it haunted her dreams. She’d helped a drug addict. On the third night she woke crying from a dream where she contorted every pattern on the surface of the world with mere touches; she looked up into the dim morning gray to find her mentor peering down at her. On the floor beside him, beside the mattress, there was a tray with a steaming pot of tea. “Sorry, did I wake you?” she sounded like sandpaper.  “Almost morning, anyway. Have a sip.”  She sat up and took the lukewarm cup from him. Fragrant and pungent at the same time, but the aftertaste was sweet. Something finer than the everyday green tea.  “It’s not your fault, in case you aren’t aware,” he said.  Kiriko groaned. “What is this?”  “A strong-green blend with moontime-primrose leaf.”  “Oh you sadistic idiot.”  Slowly the sun rose, its light seeping through their window, row by row of tiles of glass. The first row, six tiles with different sandblasted patterns, was gradually warming the two craftspersons with the blood-flow-improving effect. The second row would work more radically.  “When I moved to the city, when I came to this place and knew that I had been right about what potential these patterns held, and the people—calling me liar all my life in my old village—were wrong all along, I thought I might deserve some respect for the work I could do.” With a pang, she realized it had been more than ten years since. “I was young and stupid.”  “You’re still young, my dear apprentice. And at least your service this time gained a lot of money.”  “Can I buy some fancy inks?”  He thought about it. “Just one.”  “Two.”  “No way.”  “One for me, and one for you.”  “I’d prefer a brush in that case.”  They laughed and Kiriko got out of bed. The sun had reached the bottommost row, and the patterns down there simply enhanced the light so that there was no sleeping under it.  That afternoon saw an unexpected guest to the atelier. For a moment Kiriko didn’t recognize the person standing at their door, with their hair pinned and shoved into a cap, and a pair of glasses that made it difficult for her to see the pattern of their irises. But her mentor running up the stairs and shutting the door and locking it behind him was good enough a hint. She frowned as she spotted the pale indigo skin. “Mizuha-san?” she asked, still unsure.  The ando removed her cap and showed her dark, gorgeous hair. “I just wanted to talk to you.”  “Is everything all right with Doctor Planet?”  “It is. May I come in?”  Kiriko prepared tea as Mizuha climbed the raised floor of the atelier’s reception space. When she returned with a pot and tray of cups, Mizuha was seated at the low table in a neat kneeling position. It looked so unlike the ando that Kiriko laughed.  “What?”  “Nothing. Have our mediocre tea.”  Mizuha obliged. Then she said, “Actually, I was surprised that Doctor really loved your remedy. I didn’t think it would work that well.”  Kiriko groaned.  “What now?”  “It means we successfully helped an addict.”  Mizuha smiled, and for a moment, Kiriko wondered if she’d just seen the ando’s genuine smile for the first time. “Think of it this way: you helped the nation.”  “I always want to help people rather than the country.”  “Would you count me as part of your people?”  Kiriko looked up from her cup. She didn’t like looking straight into others’ eyes, as the patterns of irises always made her uneasy for some reason. But now, she couldn’t help it. “Yes,” after a moment she said, “if you count us, the colorless, as part of your people.”  To Kiriko’s surprise, Mizuha looked hurt at that. “I guess you’re right.” She sighed into her own cup. “Can you perhaps explain what you did with that starch paper? I’m curious.”  Kiriko tried to shrug, but she wasn’t good at that foreign gesture. “We combined the dose’s silent pattern and one of our remedy patterns for enhancing water and airflow, and thus created a new pattern and put that down on the starch paper. The seed of moontime-primrose has the property of strengthening the effect of a stimulant. The leaf doesn’t work that way, only the seed. The seed also somehow works on the ragged lines of the drug, making it easier for it to blend with the flow-inducing pattern.”  Kiriko wondered if Mizuha was following her and paused. The ando nodded.  “Okay. So when all the things mingle perfectly with one another, Doctor can feel the effect of the drug much better as it soars through his systems with water. Also moontime-primrose seeds are relatively less soluble, so their larger particles leave their traces along the way, smearing his systems with echoes of the concoction’s effect, making for a longer duration of the drug’s work on him. This is working well just because he’d had less of that thing lately due to its running out, the deficiency itself working as another stimulant. When he gets to have enough of the drug again, the remedy won’t give the same result.”  “Oh.”  Mizuha sipped her tea while the craftsperson waited for hers to cool down a little. The silence was awkward; one where you had but to wonder why you chose to be alone with the other being at all.  So when Mizuha spoke again, Kiriko jumped. “Can you make such things for any substance of choice?”  Kiriko put down her cup and held Mizuha’s eyes. “What are you saying?”  Mizuha seemed to be groping for words. Kiriko realized the ando’s perfect mask had been carefully made, not a default feature of the entities like her. Mizuha looked down into her tea. “I’m not asking you to help another drug addict,” she said. “But there are things that we cannot have enough of. Have you ever thought about that?”  “The luxury of colorful folks’ lives is beyond my imagination.” Kiriko tried her tea again—now wonderfully lukewarm. “That pattern will probably work for many things that are addictive . . . more or less. But there will be a lot of margin for . . . error, so to speak. So I would not recommend applying it for another use.” She frowned to herself. “No. I would prohibit that, as the issuer.”  Mizuha looked up at Kiriko with the slightest frown Kiriko had ever seen; she’d have missed it if she did not have the eye for the thin lines near Mizuha’s eyes. “Do you think you are in any position of telling us what not to do?”  “I am,” replied Kiriko as she grabbed a handful of rice cracker dices from a bowl. “This is my job and I know what I’m doing. You do take your own job seriously yourself, don’t you?”  “Yes. But we are built so. Literally. That is different.”  “Is it?” She popped a few crackers into her mouth.  “You can make yourself known for this,” Mizuha pushed on. “You might be able to raise your place in the society. You might even leave your name etched onto history.”  Kiriko chewed loudly. She thought about the Hotel—she couldn’t help it. The ando’s eyes seemed to see something deep inside Kiriko’s eyes. She swallowed, purposefully loud again. “Leave my name as a supporter of addicts? I don’t think so.”  “I said—”  Just then the phone rang. This time they both jumped. “Excuse me,” Kiriko said to the other woman and climbed down the floor to walk to the other side of the earthen corridor. The call was from one of the atelier’s dedicated patrons, a good friend of the craftspersons. Kiriko promised to get back to them, and they suggested dropping by. Kiriko hung up, laughing; when she turned and sobered, Mizuha was nowhere to be seen.  And her fingers got sweaty on the quilt of the receiver cover, as the feeling of something missing clouded her mind like a thin yet unsweepable fog.  “So?”  Kiriko looked up from under the workshop table, hugging her knees. “She stole it,” her voice came out quite wet.  “That . . . Mizuha-san?”  “Yes.”  “She stole what?”  “The bag of our industrial waste.”  Her mentor frowned. “I don’t see—” Then he shook his head a little. “Oh. You mean, the print panel waste.”  For most of their remedy patterns, they made wooden print panels so that they could reuse them many times. With many tailor-made patterns for each client, they used thick, waterproof paper that had been made by other craftspersons who specialized in the material. But for this one project, they knew that there would be no repeat orders, and they had to make the patterned starch paper for a very speedy turnaround, so they went with a softer resin material, which was easy to handle but quick to deteriorate. They’d never had to dispose of wooden and paper print panels before; Kiriko had cracked this soft panel into a few pieces this time and put them into a bag along with scrap cloth, broken brushes, and used towels. And that bag was gone after Mizuha had left.  Kiriko’s mentor sighed, knelt down, and then sat cross-legged on the floor. “They probably won’t be able to reproduce that pattern. Even if they do manage that, then they’ll have the pigment concoction to consider. Just photocopying it won’t work.”  “I know. What scares me though is . . . ”  “Now are you scared?”  Kiriko slapped his knee. “My concern is, she sounded so desperate. As if any tiny bit of help mattered, even from a colorless. Why would the ando-san need the amplifier pattern? What does she want to amplify?” She rubbed her face. “And they aren’t exactly human, so we don’t know what abilities they actually possess.”  Her mentor sighed again. “Even if they do, miraculously do, manage to replicate the pattern, get the exact concoction, apply that pattern quite the right way, and get the desired result, after all of those efforts, by then you don’t really count it your doing, your fault. They decided to go with whatever they needed.”  “But I dropped the seed of it all at their foot.”  “Doctor Planet dropped the seed, not you.”  Kiriko rested her forehead on her knees, covered her head with her arms. “Or maybe the government who decided to be so nice to foreigners.” Her voice came out muffled.  “That’s more like it, yes. Now come on, we have to discuss the updates on Hama-san’s pattern, he is complaining about new symptoms.”  “Okay.” Kiriko sniffed. “I’m sorry, sensei.”  “Stop being sorry, my dear apprentice, and get to work. Just as always.”  Soon the ferries and cargo ships started to crowd the island’s not-so-large port. Doctor Planet was probably gone, or at least, he wasn’t having trouble with his daily doses. As she hung the dyed cloths to dry in their small courtyard, Kiriko thought maybe she would never have to hear from Mizuha again. And for a long time, she didn’t.  That afternoon, the early-winter air was crisp and silvery. Kiriko hurried along the High Street near the port, bundles of delivery for a restaurant in her hands and in her backpack. She didn’t particularly enjoy walking along the tourist-crowded High Street—just as no colorless laborer usually did—and kept her eyes low, eager to get to the client’s place.  When she was almost past the park enclosing the port, something tugged her mind at the corner of her eye.  The park was crammed with colors and patterns—dancers welcoming incoming tourists, stalls selling last-minute souvenirs to departing ones. Kiriko looked around and sighed; perhaps too many colors and patterns jarring her tired brain. That happened sometimes. She shook her head and was ready to resume walking.  Then something, again. She turned sharply, the momentum making her whirl with the heavy bundles. But this time she caught it. At the end of the park, quietly overlooking the scene was a tall, pale figure—her expression weary on her young face. Mizuha. Kiriko strained her eyes at the ando.  Something seemed to buzz over Mizuha’s pale skin. Static cracks and holographic flashes here and there. A shiver ran through Kiriko; she had never seen anything like it. She had no idea what it was, but she was sure it was not good. Kiriko readjusted her bundles and backpack and trotted through the crowd.  “Mizuha-san,” she called, when she was close enough to the ando.  Mizuha blinked, as if she had been forcibly plucked out of a dream. “Miss Craftsperson,” Mizuha said, slowly and quietly. “Good day to you.”  “Mizuha-san, is this common with entities like you?”  “What is?”  Kiriko gestured vaguely at Mizuha. “These cracks. Buzzes. I . . . I think something in your systems isn’t working quite right. Do you feel okay?”  And then in front of the craftsperson’s eyes, Mizuha’s perfect mask crushed so suddenly, so fast. “Can you see it? None of our caregiver human workers seem to see this.”  Kiriko’s heart gave a painful thud. “Maybe not all human eyes can see such a thing. When did this start? Do you know how it started?”  “Not exactly when or what, but I have an idea. Look.” Mizuha reached out, trying to touch Kiriko’s arm, maybe, but stopped short as if remembering herself. “Can you perhaps meet me at the National Archives? After office hours?”  “Sure. If you tell me more about how it feels, perhaps I can bring around something that might help?”  Mizuha shook her head. “Not now. I’m sorry, I’m on duty right now. You don’t want to be caught occupying me.”  “I see. At six, then?”  “At six.”  Kiriko nodded and wanted to leave immediately, without a glance, just like the ando had done when they had met at the Archives last time. But she could not help peering over her shoulder. Mizuha’s mask was back in place, mostly, only her right eye twitched as she looked on after Kiriko, a crack appearing and then soon disappearing right beneath it.  The sky was beautiful at dusk as she left the atelier, but by the time she reached the National Archives building more than half of the colors were lost beyond the black of night. There were electric lamps around the building, and near one of them, Kiriko found Mizuha standing. The ando was not alone.  “This is Sakura,” Mizuha said, by way of greeting. “I guess I don’t have to explain why he is here.”  “No,” replied the craftsperson, wincing.  Like Mizuha, this Sakura person—who looked older than Mizuha or Kiriko, with pale, pale pink skin and gray hair and dark-purple eyes—was obviously suffering from the cracks and buzzes that ran along his skin. But it was worse on Sakura. There was always a part or two that twitched and shivered, and the flashes changed colors so rapidly that it made Kiriko dizzy, with innumerable squares and dots of many shades of pink. Kiriko counted about twenty, from the pale color of the whiter part of a cherry blossom, to the eye-piercing beni red. There were tears in Sakura’s eyes constantly, as if he himself could not bear the flashes.  Kiriko swallowed down her pity. “This has to do with the print panel you stole from us.”  Sakura looked down at his feet, but Mizuha held her eyes with the craftsperson. “We didn’t have many choices. Let me talk about the ones we did.”  There was an abandoned park a little away from the Archives. A bench, an elephant-shaped slide, and not much more. Mizuha suggested Kiriko use the bench, but the craftsperson was too restless to be seated and keep still. “So.” She pulled her shawl tighter about her. “You are all tasked with collecting colors?”  “Not all of us,” Mizuha said. “I am not. Sakura is. We all have a color receptor here,” she turned a little, held her hair away from her neck, and tapped her skin there. “Only the receptors on half of us are actually activated. The government archives those rare colors, you know, that have appeared on only a handful of people. It’s difficult to find those, naturally, so some of us take bits of colors from many islanders randomly and compare them with the records. We apply a kind of agent on an islander’s skin, take the colors that bleed out to the agent into our receptors. Then analyze the color and store the info in our facility. This is performed very quickly, with no pain inflicted on the islander, so they usually never even notice anything is happening. But when entities like us, ones with very pale dominant colors conduct this, sometimes we take too much, and strip the affected islander completely of the color in question.”  Kiriko had heard about the incidents, of course; no one was really sure when or how it had started, but there were cases where a colorful person’s color got gradually or suddenly replaced with a gray, a complete gray that was devoid of any tinge at all. In most cases, this graying-down or graying-out robbed the affected islander of their job, or a status in the society. No cause had been quite pinned down so far. It didn’t make Kiriko feel any good knowing the secret behind the most-feared disease of the nation.  “That makes me guess,” Kiriko said, shifting weight on her feet, “when a pale person like Sakura-san takes too much, that topples the balance of elements on the taker’s part, too. Your systems and fluids might not be entirely the same as ours, but how the flows and movements work, and how these affect the air and light around us, work a very similar way.”  “I suppose you are right. We wanted to stop Sakura from doing that. Drawing too much against his will, I mean. And I thought, maybe, your pattern could help us.”  Kiriko’s lips curved into a weak, exhausted smile. “Did it help?”  Mizuha echoed the smile. “No, it didn’t. I should have listened to you. I apologize.”  The craftsperson waved a dismissive hand. “So what exactly did you do?”  “In fact, we got your pattern quite right,” Mizuha said. Sakura quietly walked over to the slide and sat down on the elephant’s head, his back to the other two. “We replicated the pattern not just from what was carved on the material but by calculating the flexibility of the print panel material, the kind and the amount of substances that bled out into the ink out of the panel. Ink composition, too, of course. We were very, very careful. I know how much work you put into it; we cannot create such a thing, we do not have room for epiphany like that, but we can copy.”  Kiriko wondered if this was the closest Mizuha would get to a compliment. “Then what happened?”  “Sakura . . . ” Mizuha eyed the other ando. “Most of us are familiar with some kind of science and chemistry, to deal with human colors and the analyses for them. He is one of the best ones at that. And . . . ”  “He didn’t trust our judgement on the composition,” Kiriko finished the sentence for her.  “Right. And the amount of the ink and the moontime-primrose seed combined with it. I didn’t know that he had done that, and personally helped with transferring the pattern onto his receptor.”  Kiriko sighed. “And instead of preventing his drawing too much from the islander, it only made him not able to stop taking.”  Mizuha nodded. “Thankfully, he didn’t do his first experiment on a human—he did it on a flower. But even now, now that he is not even touching this particular flower, he is somehow still taking, he will keep taking until every flower of the same kind loses its color—the entire species. He cannot stop.”  “Okay. Not okay, but I see the situation with Sakura-san.” She massaged the bridge of her nose. “But what happened to you? Your receptor isn’t active, didn’t you say?”  Mizuha rubbed her upper arms with her hands, as if she was suddenly cold. “We weren’t aware of this, but . . . it looks like the wrong balance within one of us affects other entities like us.”  “You mean, like, this is contagious?”  “Contagious. Yes.” Mizuha nodded as if she finally found the right word. “I’m keeping Sakura away from others right now, telling them he is ill and confined to his cell. But the fact itself that he is not showing up is already having bad influences on them, and I cannot keep this secret forever. And I’m getting worse, too—spreading a little bit of these cracks to the ones closest to me.” She hugged herself tighter. “This must sound ridiculous to you. We half-machines acting like humans.”  Kiriko shook her head. “Flows, energies, elements can work the same way on you as on us, you are built to look just like us. Also—when we customize patterns by combining more than two existing patterns, no matter what the symptom of the particular patient is, there are a few patterns that always work for similar causes. Like, two specific patterns are always used for any patient with severe allergic reactions.” She frowned at herself, realizing she was derailing just a little. “I mean . . . what I’m saying here is, I have a feeling that, no matter how different each of you seems, you share certain parts in your configuration. Which makes it easier for something to affect all of you with one kind of malfunction.”  “You really do see the world differently, don’t you?” Mizuha cocked her head. “I’ve never thought of it that way.”  “Your caregiver humans never told you about that?”  “No. They don’t really give any care for us, in fact. Just some maintenance stuff from time to time. But even so they’ll probably find out something is wrong with Sakura before long, then they’ll look into his receptor. And then mine, too.”  “All right, then.” Kiriko puffed a thin cloud of her breath into the air, whose temperature had dropped in the last hour. “We need a pattern to revert the effect of the wrong pattern on Sakura-san, and also a pattern to prevent damage spreading over you all.”  “What? Is that possible?”  Kiriko tried to shrug, winced as her shoulder gave a strange jolt instead. “I’m sure we can come up with something.”  “Thank you. My pride kept me from asking for your help, I suppose. Until you came up to me and outright offered it. I apologize. For being what I am.”  Kiriko snorted. “Don’t be sorry for such a thing. You cannot help that. Be sorry for not acting sooner for your friend and only for that. Anyway.” She rolled up her sleeves. “Let’s get working.”  The receptor itself couldn’t be seen, as it was embedded under the skin. Mizuha mailed the blueprint of the part along with the leftover configuration of ink and seed to Kiriko, care of the atelier. At the park she had sketched a few patterns that seemed to indicate Sakura’s vulnerability to intense colors; she’d found similar tendencies from parts of Doctor Planet, who was an addict, and Sakura was addicted to the color, too, after all. Kiriko and her mentor made proper drawings of these patterns first, and then started discussing a new pattern that could offset the effect of the original one. Line by careful line they constructed a pattern that could bend the way the world ran over Sakura and his affected systems.  And then there was one more thing they had to do to this offset pattern. They now looked into each line again, added new ones that could change the way light traveled over the first line, to build a new pattern that would only offset the first offset pattern optically. When this optical pattern was a perfect shadow to the first offset pattern, an ordinary eye could detect neither of the two when they were placed one over the other precisely.  “So we use three layers of films here,” her mentor said, as he tapped his long fingers on a roll of thin, transparent film, which had come very, very expensive. “We attach a small piece of the layers of this film on Sakura’s neck, just over where his receptor is located—where, supposedly, everything started. On the inside of the first layer we print the offset pattern with the ink composition altered by Sakura, concocted with a medium to prevent it from drying too fast, so that the pattern will slowly seep over to the receptor. We place another layer of the film, with no pattern on it, and then cover the two layers with one more layer with the optical pattern on the outside. Theoretically speaking, the caregiver humans, or other andos, won’t be able to see something is written on Sakura’s neck.”  Kiriko nodded. “The most dangerous part would be when the ink on the offset pattern is completely drained. Someone with a very keen eye might be able to tell the optical pattern alone there, even though the medium left on the first layer would still work as shadow to the optical pattern more or less.”  “Make sure that happens when he is off duty. Adjust the amount of the medium according to his shift timetable.”  “Yes. The weather forecast, too, for the amount of moisture in the air—there’s going to be a hell of a lot of calculations to make.”  Kiriko handed the patterned films along with the instructions to Mizuha. The ando looked uncomfortable; as she held the bundle between her hands she said, “I told Sakura that he should be here, too. Say his thanks by himself. But . . . ”  “It’s okay.” Kiriko laughed. “Well, how predicable.”  Mizuha sighed. “I’ll make him pay.”  Kiriko laughed again. “You scare me.”  The ando put the bundle inside her coat. “Thank you. This is my thank you. Because I won’t have to lose a friend if this works.”  “I’m sure it works. If you follow instructions. If he follows.”  “I’ll make sure of that.” Mizuha shook her head, a smile playing at her lips. “But how can you be so certain that it will work? I mean, humans are subject to errors, always. And I can only guess what you do here leaves no room for errors.”  Kiriko cocked her head, smiling. “Funny . . . you’re right. I don’t even remember when I stopped worrying about such a thing—our pattern not working. Those my mentor and I build together. We still worry a lot about whether or not a client likes our work, though.” She shook her head a little, and then nodded. “I assure you that it will work. And also . . . ” She pulled another bundle from her backpack and passed it to Mizuha.  Mizuha looked at the craftsperson quizzically. “This is?”  “The blueprint of the color receptor that you provided—it wasn’t marked as Sakura-san’s. So we assumed that you share this same module—at least more or less.”  “You are correct to assume that. That part is one of the few that are identical from one another.”  “Good.” Kiriko nodded. “So we made a small emergency pattern that would work for you all.” She pointed at the bundle with her hand, urging the ando to open it. When Mizuha did, three small objects shaped like tiny wooden pillars came rolling out of a leather pouch. One end of each was carved with a simple pattern. “We usually customize patterns by combining conventional ones. These three patterns are what we believe would work on you if combined precisely. Do you see those tiny cuts on the other ends?” Mizuha nodded. “For ordinary clients we make a pattern with the three overlaid perfectly, but carving that combined thing onto this very hard material would have taken a long, long time. But we believe in your precision. Use the cuts as markers to inflict the stamp precisely at the same place over your receptor, in a very speedy manner. Then you can make the desired pattern on the skin right there. There are receptors there, after all—you won’t need an ink, just the touch of the pattern would be enough to soothe the roused edges of your neuro signals, to stop the fractal progress of the unwanted stimulation within you.”  Mizuha placed the stamps back into the pouch and put the pouch into her breast pocket. “Thank you. I don’t know how I can thank you enough.”  “Do me a favor, then, would you?”  “Anything.”  Kiriko let out a breath. “Thoroughly eliminate the info in your data attached to these patterns, specifically about who made them. We can’t tell how much your caregiver humans know of what you know, so we cannot risk leaving any trace, for the city to hunt us down in case something goes wrong. Don’t make the mistake that we made the other day—leaving a half-broken print panel like that, for you to easily take away.”  Kiriko had expected Mizuha would immediately say yes to that. Instead, silence fell on them like soft snow. When Mizuha spoke, Kiriko could hear lead on the ando’s tongue. “But I want to remember.”  The craftsperson blinked. “What do you want to remember?”  “You. That you helped us all. That you will help us all in the future, yet again, with these patterns. I don’t want to let go of it.” Mizuha shook her head. “But then . . . we cannot share the information that a colorless craftsperson can be trustworthy enough for that. That memory itself would throw off the balance of elements in us.”  Kiriko laughed. “See? You cannot keep my doings secret, one way or the other. Just discard it.”  “We cannot attach the data of a colorless laborer to the patterns. But maybe just your name?” Mizuha looked up and met Kiriko’s eyes. “Just as the brilliant person who came up with this solution. We don’t have to attach data about your being colorless. We’ll remember your name, we’ll always relish your name. Let us remember.”  The colorless craftsperson looked back at the ando, who was apparently young, so young, that her chest ached with protectiveness. But then heard herself saying, “It’s too dangerous . . . ”  “Then we will not attach your name to your patterns. Just your name? We’ll all store these memories in very separate places. And make a map for them when we need to turn to you again, so that our indifferent caregiver humans would never know to connect those.” Mizuha came a step closer. “I don’t want to let go. I’ll make sure those like Sakura understand the importance of your name. Please.”  Kiriko held a hand near Mizuha’s shoulder, as the ando closed another half step. “Not only is it dangerous. You don’t understand. I don’t want to be remembered like that. When I’m remembered, I want it to be as a colorless craftsperson, and my mentor must be there with me, too. Just my name attached to one single work is not the same as me being acknowledged.”  For a moment, Mizuha looked at Kiriko’s hand, as if she wanted to touch it with her own. But she didn’t. “I don’t understand,” she finally said.  “It’s okay.” Kiriko looked up, strained her eyes at the clouds. “Not any information on us. Can you do that?”  At the corner of her eye, Kiriko saw Mizuha nod after a second of hesitation. “Can I remember you?”  “It’s your memory. Do whatever you like with it.”  The air was filled with the hint of moisture—Kiriko could see it and smell it. But it wasn’t yet cold enough—it would be half-snow, half-rain when it fell, that heavy thing that made the ground smeary and ugly, and made people shiver to the core, colorful, colorless, andos all alike.  “And you forgot to collect cash even for the films?” Kiriko’s mentor said to his apprentice who had come back soaked and shaking.  “I’m sorry, sensei. I really am. I give up the new ink.”  “Oh of course. No ink of your choice for the rest of the fiscal year.”  She wrapped her blanket tighter around her and drank warm water from a cup with blood-circulation improving pattern drawn on the bottom. “But ink can be our asset, not just my fancy thing.”  He grinned. “It’s okay, we’ll add an asset to our balance sheet. I’m going to get that brush for me, anyway.”  Kiriko almost dropped her cup. “That’s not fair!”  “It doesn’t have to be. I’m the owner here.”  Kiriko groaned and covered herself entirely in the blanket, head to toe. Her mentor laughed and went away into their workshop. Taking another sip of the warm water, she wondered if there was a reason that no one knew the names of the craftspersons who had worked on the interior of the Hotel. Not the reason that came from the city, or any other colorful entities, but from the old craftspersons themselves.", "text": "8500 words, novelette\nGrayer Than Lead, Heavier Than Snow\nA chain of patterns, drawn on opaque glass in subtle colors, framed the front door of the Hotel, the most luxurious accommodation in this country. The huge chandelier above the main lobby sprinkled uneven light over the plush carpet that danced and made you feel slightly mesmerized. The carpet was a riot of colors, only if you had the eye for such things—all of them mingled perfectly so that to a casual eye it looked somewhere between gray and beige, a soothing tone that only left impressions of colors to your subconscious.\nThe ceiling was so high your neck might snap when your eyes trailed the cord above the chandelier. From the niches on the walls, indirect lights illuminated the whole place; some of them were flickery, some steady, the overall rhythm weaving an entirely different pattern that buzzed the air in the lobby and the lounge right beside it. And the lounge—there were peculiarly arranged flowers every few blocks of tables and chairs, and you could not help but stop to stare at those. Before you knew it you were escorted by the staff, winding over the floor in a pattern that made your legs absurdly weary, and by the time you reach your seat, you’d never want to lift your bottom once you sink onto one of those softest cushions. The tall wall at the back was covered with colored tiles, some of them even with holographic effects that worked on your neuro-system to slow the ingestion of caffeine and alcohol, so that you could maybe have just one more drink before leaving.\nEvery line, every curve, inviting folks into the comfort.\nI might want to look over the whole lounge from the mezzanine, she thought, dreaming for just one sip of their extraordinarily expensive tea, until the moment she saw the displeased expression on the face of the person she would soon have to deal with.\nShe almost cowered away, but then forcibly braced herself. Maybe, maybe, this was the chance for their skills to come out there, for them to stop lurking in shadows as if they were worthless.\nThe other person stood up, most of her features typical of islanders, though she was oddly tall for a local. Her hair was very dark, a black that almost glistened, and other surfaces visible on her were all evenly spread with a pale, pale indigo. Too perfect: just enough to sate the curiosity of the foreign tourists who came to this island for the exoticism of the islanders’ skin, but not too explicit to steal spotlight from the human locals.\nThe city official android smiled her perfect smile, which had no warmth meant for the plain-skinned craftsperson. “Craftsperson Kiriko, glad you are here,” the half-human said, as she placed a sum of money that was worth two days’ meals for the craftsperson on the table, beside the apparently untouched cup of coffee. “Sorry to have to move you as soon as you have arrived, but let us go up to one of the rooms in the tower wing. I cannot discuss business with a colorless citizen here, obviously.” She looked around, as if emphasizing the point. “To see our guest, Doctor Planet.”\n“Obviously,” was the only reply Kiriko offered as they both wound their way out of the lounge and climbed the stairs to the mezzanine, where they could take the lift up the tower wing.\n“As we already communicated in the letter sent to you, Doctor Planet is having an issue with his health, and we . . . cannot talk to the clinic about this.” The ando pressed the button for one of the topmost floors.\nKiriko wanted to ask why, but also knew she was in no position to be asking whys. “What do you require of us?” she said instead, into the official’s back, eyeing the gold-gilded mirrors on the wall and the ceiling of the lift.\n“Alleviate Doctor’s discomfort. He takes some . . . doses regularly. But the aftermath of the recent storm is keeping the next ferry away, and his supplies are running out.”\nA bell tinged somewhere above, and the doors slid open. “What about the Aeros?” Kiriko asked, frowning. She knew the government used aircrafts in case of emergency, though they rarely carried people. They’d fly over, drop supplies, and then be gone without even touching down. The storm itself had gone a few days ago, and the winds weren’t that bad at the moment.\n“For the same reason we cannot talk to the clinic, we cannot open the Aero line for this. Hope you understand.” From the way she said it, Kiriko knew this android—Mizuha, as the letter demanding the craftsperson’s presence had stated the attending official’s name was—didn’t care if Kiriko understood or not in the slightest. “Just until he gets his supplies. It is not that much to ask, is it?”\nKiriko knew her mentor at her pattern atelier hated talking to the andos, and he probably wasn’t alone. The andos were an open secret of the city, not because they weren’t fully human beings, but because they were manufactured, with their calculated colors and patterns, in this place where you must be born with special complexions to be considered colored or patterned, where everything created or tampered with by the hands of humans was regarded as lowly fake. In a city where coloring your nails or your eyelids was deemed illegal.\nAnd that their general attitude toward humans was for some reason disdainful—even hostile in the case of colorless and patternless humans—only added to the discomfort of the human islanders. For Kiriko, it was easier, though; many colorful and patterned folks looked down upon people like her, those who had no special colors or patterns on their skin to entertain foreign tourists, and to Kiriko it was just another pack of people disrespecting her. To the colorful and patterned who didn’t have much experience with disrespect, the andos must have been almost unbearable.\n“No, it is not,” Kiriko replied. “As long as you pay enough for the service.” That Mizuha looked younger than her helped her keep calm, even though how old the andos looked didn’t really matter.\nThey seemed to have finally arrived at their destination. Mizuha knocked on the door, and then there was a click. After a few words exchanged, they were invited into one of the most luxurious rooms of the most expensive hotel in this country.\nAnd what was there to do, but to gasp, gape, and stare around?\nThe curtains, of a material that Kiriko had never seen! Was it woven with threads of all the colors existent and imaginable, one for each thread? And the window behind them—at a glance the glass was plain, the most transparent thing she had ever looked through, but no, oh no, there were lines etched onto the surface, shallow and deep, deep and shallow, twining and stretching to provide the best possible light filter for the scenery outside. And the lampshades. And the bed canopy. Furniture. If she strained her ears, she could hear the water running through the pipes under the floor; the way it sounded . . . maybe even the inside of the pipes were patterned, to play music that soothed your . . .\n“Ms. Craftsperson,” Mizuha called, sighing. “Stop looking stupid and get to work.”\nFlushing, Kiriko closed her mouth and swallowed. “Yes. Of course.”\nDoctor Planet was seated on the long sofa, beside which Mizuha stood straight, very much likely looking down her nose at Kiriko on purpose. The man looked ill at ease on that fancy sofa, fidgeting with a pouch in his hands. An old man, very pale tan color, eyes the color of the sky just before snowfall. He muttered something quietly, as if . . . sulking. Mizuha said something in the official language in reply.\nKiriko swallowed again. “First—can we have a sample of the dose that he needs?” she asked the half-human.\n“Of course.” Mizuha smiled. Doctor Planet made a weak sound when the attending ando gestured for the pouch in his hand, as if parting with the precious portion of the dose was too much for him. “Doctor Planet.” Mizuha repeated gently, plying the small pouch out of his hand and giving it to Kiriko.\n“Thank you,” said the craftsperson as she took it. “Now, can you ask him if I can get sketches of patterns from his body parts?”\nMizuha’s smile vanished at an impossible speed. “I don’t know what you mean at all. He is a foreigner, he is not patterned, as you can well see. Oh, of course.” The half-human’s lips curved just a fraction at the corner. “I knew you colorless folks see the world differently than us. But not that differently.”\nKiriko let out a sound that was a perfect cross between a sigh and laughter. She hated this kind of dance, really, but a long time working in the city had trained her somewhat well. “You are quite right about that,” she said, over another sigh. “For the remedy to actually work on Doctor, we need to see the pattern woven by his blood flows, skin firmness, and the refractivity of elements over his parts and his body, and combinations thereof. We call these silent patterns, and everything—even you—have many of these all over. We will control the efficiency of this dose of his using these. Oh, of course.” She forced a smile on her face. “We see the world differently, this is what only the colorless, experienced craftspersons can do. It might be too much for you to understand?”\nMizuha’s lower lip stiffened, ever so slightly. Then she said, “Perhaps you might want to learn the official language, so that you wouldn’t have to rely on entities like us, on an occasion such as this.”\n“Oh great, then we can do such business as this directly with the tourists, can’t we? I thought you officials deliberately took the opportunity away from us colorless laborers for learning the language, from the way things look?”\nMizuha glared at Kiriko. Even Doctor Planet seemed to realize something was wrong, and he said something to Mizuha, who replied with a reassuring smile. After a few more words exchanged, Doctor Planet nodded weakly.\n“You’re asking too much, and you know that,” Mizuha said, her perfect mask back on. “This has got to be really, really good.”\n“You lied,” Kiriko’s mentor said, without looking up from his drawing.\nKiriko groaned, thumping loudly down onto her favorite flat cushion. “I didn’t know what this ‘dose’ really was, so I had to collect every piece of information available, right? Our usual method may not work.”\nThe atelier’s dealings were mostly true to its name: putting out patterned textiles for furniture and small objects for decorations, to be used in restaurants and shops, and sometimes, rich houses. But when these two craftspersons added a few tricks to the patterns they used on these things, chairs looked more comfortable, commodities on shelves seemed more attractive, and food even tasted better under certain lampshades. They also applied the same principles on minor body discomforts—and it worked. Though not everybody believed in them.\nBut her mentor was right. If all they needed was to enhance the efficiency of the medication, they had a handful of generic patterns they could choose from. Customized patterns were required for more complex cases such as persistent allergic reactions with rare allergens, or maybe pregnant women. This time they could probably just pick out ready-made-patterned starch paper and tell Doctor Planet to take the remaining doses—cut down to halves or thirds or even less—wrapped in it.\nKiriko had wanted to say something, anything, that might have looked as though she was striking back. Even if there was no point in striking back at the colorful. “And I got enough time to see the interior of the Hotel’s room because of that!” She sighed at the memory. “Oh, anyway. Let’s just get working on this, sensei.”\nHer mentor frowned, put his brush down, and finally looked up at her. “My dear apprentice.”\n“What? What are you going to scold me for now?”\n“Why are you so eager this time?”\nShe cocked her head. “I don’t know what you mean.”\n“You do know what I mean. You’ve always been quite intimidated by the andos. When you had to work with them before, you kept procrastinating forever, until I actually had to scold you like your father or something.”\n“You are my mentor, that’s your job.”\n“I’m not that much older than you and it hurts my sensitive little heart when I have to do that.”\nUnder other circumstances Kiriko would have laughed, but now, she pulled another cushion out of a pile and hugged it. “You have been to the Hotel, haven’t you?”\n“I have.”\n“Then you must know.” She fidgeted with the tassel at a corner of the cushion. “That whole place. It was made by someone like us.”\nEvery color, every pattern used in the building had been very, very carefully calculated; not a single one stood out to distract the guests or the staff, not a single one jarred the view without blending with the structure of the building itself. And yet, every one of them served the purpose of the bigger picture, of making everyone there feel comfortable, making them want to come back. It couldn’t have been achieved by one craftsperson alone. There must have been a team of them. Which meant that there had been a time when even the colorless people like Kiriko herself or her mentor, those regarded worthless in this island where tourism was the only means for it to survive as a nation, had been respected, had more say on the way things worked.\nHer mentor fell silent for a while. Then he said, “If you think things can be like that again . . . ”\n“No,” she cut him short, unable to hear the entire sentence. “But still. I cannot stop thinking about it. We could . . . maybe make one tiny step, impress this one ando-san, if we keep trying and some younger persons do the same, and then maybe in one hundred years’ time . . . ”\nHer mentor only smiled weakly in reply. That smile always made her heart contract—there was too much behind it. Then he picked up another brush. “Do your best with each project. That’s the only thing we can do. Right? I guess you don’t need my input for that kind of simple remedy anyway, do you?”\n“I’ll look into the medication and then let you know.”\nAnd then minutes later, it turned out that it was nothing like what they had expected.\n“So basically, you tricked us into supporting a criminal,” said Kiriko, doing everything to not grind her teeth loud enough for others to hear.\nMizuha shrugged like a foreigner. “You think you’d have had a choice?”\n“That’s just outright rude and inhumane,” Kiriko’s voice came out louder and shrill, no longer able to restrict herself.\nMizuha lazily looked around, and Kiriko winced; they were both seated on the stiff sofas near the reception of the National Archives building, which most of the city andos belonged to. Entities like Mizuha usually worked at this site and went out to attend foreign guests when needed, following orders from the city. Here, it was hard to tell humans from andos by looks, but Kiriko thought she could, anyway, by the way some of the people did nothing to hide their disdain toward the craftsperson.\nReally—they should have guessed. It was not hard to guess. Of course, the city wouldn’t have involved a colorless craftsperson in a treatment of an ordinary health-related issue. But they’d wrongly assumed that it was more about Doctor, not the thing they had to actually touch.\nThere was no mistaking the crazy pattern that this “medication” wove under the atelier’s customized microscope, which not only enlarged the object but also helped the craftspersons’ eyes take apart elements to grasp the silent pattern they needed for the particular case. General medicines had a way of spreading out over regular waves of a pattern, which forced the pattern from an affected area to submerge and smooth out. But this . . . this thing seemed to send out lines that were so irregular that they felt regular in the end, incessant and persistent, every line holding the potential of striking others into irregularity.\nOf course, she knew a narcotic when she saw it.\nMizuha snorted. “For whatever reason, we cannot afford to displease Doctor at the moment. We have already paid and will pay grand again once you turn over the remedy, Craftsperson. You took this job for the money, right?”\n“No!” Kiriko forgot herself again. “We took it so you bigheaded city tengu might remember that we are not worthless!”\nMizuha blinked, and Kiriko winced again; Kiriko had had no intention of saying that. She felt heat surging up to her face. “You may not have noticed,” she said, trying to cover embarrassment, “but the Hotel was full of work by craftspersons like us. When I saw the interior of that place, I thought you knew how the city used to value our patterns. But obviously, I was mistaken.”\nKiriko grabbed a bundle out of her bag and slammed it on the table between them. To her surprise, Mizuha flinched.\n“Take one ground moontime-primrose seed, with just a few grains of Doctor Planet’s dose, wrapped in one sheet of the patterned starch paper here.” She pressed her hand harder on the bundle when Mizuha reached out for it. “Apothecary-prepared moontime-primrose seed. One sheet at a time. Use water only. Alcohol or caffeine is strictly prohibited. Understand?”\nAfter a few moments of eye-to-eye, silent fight, Mizuha seemed to concede and nodded. Kiriko withdrew her hand and Mizuha took the bundle. “How many?” Mizuha asked without opening it.\n“Two weeks’ worth. Certainly the tides will clear by that time?”\n“Let us hope,” Mizuha said as she stood and disappeared down the stairs without another glance spared for the craftsperson.\nKiriko wanted very much to forget about this incident, but it haunted her dreams. She’d helped a drug addict. On the third night she woke crying from a dream where she contorted every pattern on the surface of the world with mere touches; she looked up into the dim morning gray to find her mentor peering down at her. On the floor beside him, beside the mattress, there was a tray with a steaming pot of tea. “Sorry, did I wake you?” she sounded like sandpaper.\n“Almost morning, anyway. Have a sip.”\nShe sat up and took the lukewarm cup from him. Fragrant and pungent at the same time, but the aftertaste was sweet. Something finer than the everyday green tea.\n“It’s not your fault, in case you aren’t aware,” he said.\nKiriko groaned. “What is this?”\n“A strong-green blend with moontime-primrose leaf.”\n“Oh you sadistic idiot.”\nSlowly the sun rose, its light seeping through their window, row by row of tiles of glass. The first row, six tiles with different sandblasted patterns, was gradually warming the two craftspersons with the blood-flow-improving effect. The second row would work more radically.\n“When I moved to the city, when I came to this place and knew that I had been right about what potential these patterns held, and the people—calling me liar all my life in my old village—were wrong all along, I thought I might deserve some respect for the work I could do.” With a pang, she realized it had been more than ten years since. “I was young and stupid.”\n“You’re still young, my dear apprentice. And at least your service this time gained a lot of money.”\n“Can I buy some fancy inks?”\nHe thought about it. “Just one.”\n“Two.”\n“No way.”\n“One for me, and one for you.”\n“I’d prefer a brush in that case.”\nThey laughed and Kiriko got out of bed. The sun had reached the bottommost row, and the patterns down there simply enhanced the light so that there was no sleeping under it.\nThat afternoon saw an unexpected guest to the atelier. For a moment Kiriko didn’t recognize the person standing at their door, with their hair pinned and shoved into a cap, and a pair of glasses that made it difficult for her to see the pattern of their irises. But her mentor running up the stairs and shutting the door and locking it behind him was good enough a hint. She frowned as she spotted the pale indigo skin. “Mizuha-san?” she asked, still unsure.\nThe ando removed her cap and showed her dark, gorgeous hair. “I just wanted to talk to you.”\n“Is everything all right with Doctor Planet?”\n“It is. May I come in?”\nKiriko prepared tea as Mizuha climbed the raised floor of the atelier’s reception space. When she returned with a pot and tray of cups, Mizuha was seated at the low table in a neat kneeling position. It looked so unlike the ando that Kiriko laughed.\n“What?”\n“Nothing. Have our mediocre tea.”\nMizuha obliged. Then she said, “Actually, I was surprised that Doctor really loved your remedy. I didn’t think it would work that well.”\nKiriko groaned.\n“What now?”\n“It means we successfully helped an addict.”\nMizuha smiled, and for a moment, Kiriko wondered if she’d just seen the ando’s genuine smile for the first time. “Think of it this way: you helped the nation.”\n“I always want to help people rather than the country.”\n“Would you count me as part of your people?”\nKiriko looked up from her cup. She didn’t like looking straight into others’ eyes, as the patterns of irises always made her uneasy for some reason. But now, she couldn’t help it. “Yes,” after a moment she said, “if you count us, the colorless, as part of your people.”\nTo Kiriko’s surprise, Mizuha looked hurt at that. “I guess you’re right.” She sighed into her own cup. “Can you perhaps explain what you did with that starch paper? I’m curious.”\nKiriko tried to shrug, but she wasn’t good at that foreign gesture. “We combined the dose’s silent pattern and one of our remedy patterns for enhancing water and airflow, and thus created a new pattern and put that down on the starch paper. The seed of moontime-primrose has the property of strengthening the effect of a stimulant. The leaf doesn’t work that way, only the seed. The seed also somehow works on the ragged lines of the drug, making it easier for it to blend with the flow-inducing pattern.”\nKiriko wondered if Mizuha was following her and paused. The ando nodded.\n“Okay. So when all the things mingle perfectly with one another, Doctor can feel the effect of the drug much better as it soars through his systems with water. Also moontime-primrose seeds are relatively less soluble, so their larger particles leave their traces along the way, smearing his systems with echoes of the concoction’s effect, making for a longer duration of the drug’s work on him. This is working well just because he’d had less of that thing lately due to its running out, the deficiency itself working as another stimulant. When he gets to have enough of the drug again, the remedy won’t give the same result.”\n“Oh.”\nMizuha sipped her tea while the craftsperson waited for hers to cool down a little. The silence was awkward; one where you had but to wonder why you chose to be alone with the other being at all.\nSo when Mizuha spoke again, Kiriko jumped. “Can you make such things for any substance of choice?”\nKiriko put down her cup and held Mizuha’s eyes. “What are you saying?”\nMizuha seemed to be groping for words. Kiriko realized the ando’s perfect mask had been carefully made, not a default feature of the entities like her. Mizuha looked down into her tea. “I’m not asking you to help another drug addict,” she said. “But there are things that we cannot have enough of. Have you ever thought about that?”\n“The luxury of colorful folks’ lives is beyond my imagination.” Kiriko tried her tea again—now wonderfully lukewarm. “That pattern will probably work for many things that are addictive . . . more or less. But there will be a lot of margin for . . . error, so to speak. So I would not recommend applying it for another use.” She frowned to herself. “No. I would prohibit that, as the issuer.”\nMizuha looked up at Kiriko with the slightest frown Kiriko had ever seen; she’d have missed it if she did not have the eye for the thin lines near Mizuha’s eyes. “Do you think you are in any position of telling us what not to do?”\n“I am,” replied Kiriko as she grabbed a handful of rice cracker dices from a bowl. “This is my job and I know what I’m doing. You do take your own job seriously yourself, don’t you?”\n“Yes. But we are built so. Literally. That is different.”\n“Is it?” She popped a few crackers into her mouth.\n“You can make yourself known for this,” Mizuha pushed on. “You might be able to raise your place in the society. You might even leave your name etched onto history.”\nKiriko chewed loudly. She thought about the Hotel—she couldn’t help it. The ando’s eyes seemed to see something deep inside Kiriko’s eyes. She swallowed, purposefully loud again. “Leave my name as a supporter of addicts? I don’t think so.”\n“I said—”\nJust then the phone rang. This time they both jumped. “Excuse me,” Kiriko said to the other woman and climbed down the floor to walk to the other side of the earthen corridor. The call was from one of the atelier’s dedicated patrons, a good friend of the craftspersons. Kiriko promised to get back to them, and they suggested dropping by. Kiriko hung up, laughing; when she turned and sobered, Mizuha was nowhere to be seen.\nAnd her fingers got sweaty on the quilt of the receiver cover, as the feeling of something missing clouded her mind like a thin yet unsweepable fog.\n“So?”\nKiriko looked up from under the workshop table, hugging her knees. “She stole it,” her voice came out quite wet.\n“That . . . Mizuha-san?”\n“Yes.”\n“She stole what?”\n“The bag of our industrial waste.”\nHer mentor frowned. “I don’t see—” Then he shook his head a little. “Oh. You mean, the print panel waste.”\nFor most of their remedy patterns, they made wooden print panels so that they could reuse them many times. With many tailor-made patterns for each client, they used thick, waterproof paper that had been made by other craftspersons who specialized in the material. But for this one project, they knew that there would be no repeat orders, and they had to make the patterned starch paper for a very speedy turnaround, so they went with a softer resin material, which was easy to handle but quick to deteriorate. They’d never had to dispose of wooden and paper print panels before; Kiriko had cracked this soft panel into a few pieces this time and put them into a bag along with scrap cloth, broken brushes, and used towels. And that bag was gone after Mizuha had left.\nKiriko’s mentor sighed, knelt down, and then sat cross-legged on the floor. “They probably won’t be able to reproduce that pattern. Even if they do manage that, then they’ll have the pigment concoction to consider. Just photocopying it won’t work.”\n“I know. What scares me though is . . . ”\n“Now are you scared?”\nKiriko slapped his knee. “My concern is, she sounded so desperate. As if any tiny bit of help mattered, even from a colorless. Why would the ando-san need the amplifier pattern? What does she want to amplify?” She rubbed her face. “And they aren’t exactly human, so we don’t know what abilities they actually possess.”\nHer mentor sighed again. “Even if they do, miraculously do, manage to replicate the pattern, get the exact concoction, apply that pattern quite the right way, and get the desired result, after all of those efforts, by then you don’t really count it your doing, your fault. They decided to go with whatever they needed.”\n“But I dropped the seed of it all at their foot.”\n“Doctor Planet dropped the seed, not you.”\nKiriko rested her forehead on her knees, covered her head with her arms. “Or maybe the government who decided to be so nice to foreigners.” Her voice came out muffled.\n“That’s more like it, yes. Now come on, we have to discuss the updates on Hama-san’s pattern, he is complaining about new symptoms.”\n“Okay.” Kiriko sniffed. “I’m sorry, sensei.”\n“Stop being sorry, my dear apprentice, and get to work. Just as always.”\nSoon the ferries and cargo ships started to crowd the island’s not-so-large port. Doctor Planet was probably gone, or at least, he wasn’t having trouble with his daily doses. As she hung the dyed cloths to dry in their small courtyard, Kiriko thought maybe she would never have to hear from Mizuha again. And for a long time, she didn’t.\nThat afternoon, the early-winter air was crisp and silvery. Kiriko hurried along the High Street near the port, bundles of delivery for a restaurant in her hands and in her backpack. She didn’t particularly enjoy walking along the tourist-crowded High Street—just as no colorless laborer usually did—and kept her eyes low, eager to get to the client’s place.\nWhen she was almost past the park enclosing the port, something tugged her mind at the corner of her eye.\nThe park was crammed with colors and patterns—dancers welcoming incoming tourists, stalls selling last-minute souvenirs to departing ones. Kiriko looked around and sighed; perhaps too many colors and patterns jarring her tired brain. That happened sometimes. She shook her head and was ready to resume walking.\nThen something, again. She turned sharply, the momentum making her whirl with the heavy bundles. But this time she caught it. At the end of the park, quietly overlooking the scene was a tall, pale figure—her expression weary on her young face. Mizuha. Kiriko strained her eyes at the ando.\nSomething seemed to buzz over Mizuha’s pale skin. Static cracks and holographic flashes here and there. A shiver ran through Kiriko; she had never seen anything like it. She had no idea what it was, but she was sure it was not good. Kiriko readjusted her bundles and backpack and trotted through the crowd.\n“Mizuha-san,” she called, when she was close enough to the ando.\nMizuha blinked, as if she had been forcibly plucked out of a dream. “Miss Craftsperson,” Mizuha said, slowly and quietly. “Good day to you.”\n“Mizuha-san, is this common with entities like you?”\n“What is?”\nKiriko gestured vaguely at Mizuha. “These cracks. Buzzes. I . . . I think something in your systems isn’t working quite right. Do you feel okay?”\nAnd then in front of the craftsperson’s eyes, Mizuha’s perfect mask crushed so suddenly, so fast. “Can you see it? None of our caregiver human workers seem to see this.”\nKiriko’s heart gave a painful thud. “Maybe not all human eyes can see such a thing. When did this start? Do you know how it started?”\n“Not exactly when or what, but I have an idea. Look.” Mizuha reached out, trying to touch Kiriko’s arm, maybe, but stopped short as if remembering herself. “Can you perhaps meet me at the National Archives? After office hours?”\n“Sure. If you tell me more about how it feels, perhaps I can bring around something that might help?”\nMizuha shook her head. “Not now. I’m sorry, I’m on duty right now. You don’t want to be caught occupying me.”\n“I see. At six, then?”\n“At six.”\nKiriko nodded and wanted to leave immediately, without a glance, just like the ando had done when they had met at the Archives last time. But she could not help peering over her shoulder. Mizuha’s mask was back in place, mostly, only her right eye twitched as she looked on after Kiriko, a crack appearing and then soon disappearing right beneath it.\nThe sky was beautiful at dusk as she left the atelier, but by the time she reached the National Archives building more than half of the colors were lost beyond the black of night. There were electric lamps around the building, and near one of them, Kiriko found Mizuha standing. The ando was not alone.\n“This is Sakura,” Mizuha said, by way of greeting. “I guess I don’t have to explain why he is here.”\n“No,” replied the craftsperson, wincing.\nLike Mizuha, this Sakura person—who looked older than Mizuha or Kiriko, with pale, pale pink skin and gray hair and dark-purple eyes—was obviously suffering from the cracks and buzzes that ran along his skin. But it was worse on Sakura. There was always a part or two that twitched and shivered, and the flashes changed colors so rapidly that it made Kiriko dizzy, with innumerable squares and dots of many shades of pink. Kiriko counted about twenty, from the pale color of the whiter part of a cherry blossom, to the eye-piercing beni red. There were tears in Sakura’s eyes constantly, as if he himself could not bear the flashes.\nKiriko swallowed down her pity. “This has to do with the print panel you stole from us.”\nSakura looked down at his feet, but Mizuha held her eyes with the craftsperson. “We didn’t have many choices. Let me talk about the ones we did.”\nThere was an abandoned park a little away from the Archives. A bench, an elephant-shaped slide, and not much more. Mizuha suggested Kiriko use the bench, but the craftsperson was too restless to be seated and keep still. “So.” She pulled her shawl tighter about her. “You are all tasked with collecting colors?”\n“Not all of us,” Mizuha said. “I am not. Sakura is. We all have a color receptor here,” she turned a little, held her hair away from her neck, and tapped her skin there. “Only the receptors on half of us are actually activated. The government archives those rare colors, you know, that have appeared on only a handful of people. It’s difficult to find those, naturally, so some of us take bits of colors from many islanders randomly and compare them with the records. We apply a kind of agent on an islander’s skin, take the colors that bleed out to the agent into our receptors. Then analyze the color and store the info in our facility. This is performed very quickly, with no pain inflicted on the islander, so they usually never even notice anything is happening. But when entities like us, ones with very pale dominant colors conduct this, sometimes we take too much, and strip the affected islander completely of the color in question.”\nKiriko had heard about the incidents, of course; no one was really sure when or how it had started, but there were cases where a colorful person’s color got gradually or suddenly replaced with a gray, a complete gray that was devoid of any tinge at all. In most cases, this graying-down or graying-out robbed the affected islander of their job, or a status in the society. No cause had been quite pinned down so far. It didn’t make Kiriko feel any good knowing the secret behind the most-feared disease of the nation.\n“That makes me guess,” Kiriko said, shifting weight on her feet, “when a pale person like Sakura-san takes too much, that topples the balance of elements on the taker’s part, too. Your systems and fluids might not be entirely the same as ours, but how the flows and movements work, and how these affect the air and light around us, work a very similar way.”\n“I suppose you are right. We wanted to stop Sakura from doing that. Drawing too much against his will, I mean. And I thought, maybe, your pattern could help us.”\nKiriko’s lips curved into a weak, exhausted smile. “Did it help?”\nMizuha echoed the smile. “No, it didn’t. I should have listened to you. I apologize.”\nThe craftsperson waved a dismissive hand. “So what exactly did you do?”\n“In fact, we got your pattern quite right,” Mizuha said. Sakura quietly walked over to the slide and sat down on the elephant’s head, his back to the other two. “We replicated the pattern not just from what was carved on the material but by calculating the flexibility of the print panel material, the kind and the amount of substances that bled out into the ink out of the panel. Ink composition, too, of course. We were very, very careful. I know how much work you put into it; we cannot create such a thing, we do not have room for epiphany like that, but we can copy.”\nKiriko wondered if this was the closest Mizuha would get to a compliment. “Then what happened?”\n“Sakura . . . ” Mizuha eyed the other ando. “Most of us are familiar with some kind of science and chemistry, to deal with human colors and the analyses for them. He is one of the best ones at that. And . . . ”\n“He didn’t trust our judgement on the composition,” Kiriko finished the sentence for her.\n“Right. And the amount of the ink and the moontime-primrose seed combined with it. I didn’t know that he had done that, and personally helped with transferring the pattern onto his receptor.”\nKiriko sighed. “And instead of preventing his drawing too much from the islander, it only made him not able to stop taking.”\nMizuha nodded. “Thankfully, he didn’t do his first experiment on a human—he did it on a flower. But even now, now that he is not even touching this particular flower, he is somehow still taking, he will keep taking until every flower of the same kind loses its color—the entire species. He cannot stop.”\n“Okay. Not okay, but I see the situation with Sakura-san.” She massaged the bridge of her nose. “But what happened to you? Your receptor isn’t active, didn’t you say?”\nMizuha rubbed her upper arms with her hands, as if she was suddenly cold. “We weren’t aware of this, but . . . it looks like the wrong balance within one of us affects other entities like us.”\n“You mean, like, this is contagious?”\n“Contagious. Yes.” Mizuha nodded as if she finally found the right word. “I’m keeping Sakura away from others right now, telling them he is ill and confined to his cell. But the fact itself that he is not showing up is already having bad influences on them, and I cannot keep this secret forever. And I’m getting worse, too—spreading a little bit of these cracks to the ones closest to me.” She hugged herself tighter. “This must sound ridiculous to you. We half-machines acting like humans.”\nKiriko shook her head. “Flows, energies, elements can work the same way on you as on us, you are built to look just like us. Also—when we customize patterns by combining more than two existing patterns, no matter what the symptom of the particular patient is, there are a few patterns that always work for similar causes. Like, two specific patterns are always used for any patient with severe allergic reactions.” She frowned at herself, realizing she was derailing just a little. “I mean . . . what I’m saying here is, I have a feeling that, no matter how different each of you seems, you share certain parts in your configuration. Which makes it easier for something to affect all of you with one kind of malfunction.”\n“You really do see the world differently, don’t you?” Mizuha cocked her head. “I’ve never thought of it that way.”\n“Your caregiver humans never told you about that?”\n“No. They don’t really give any care for us, in fact. Just some maintenance stuff from time to time. But even so they’ll probably find out something is wrong with Sakura before long, then they’ll look into his receptor. And then mine, too.”\n“All right, then.” Kiriko puffed a thin cloud of her breath into the air, whose temperature had dropped in the last hour. “We need a pattern to revert the effect of the wrong pattern on Sakura-san, and also a pattern to prevent damage spreading over you all.”\n“What? Is that possible?”\nKiriko tried to shrug, winced as her shoulder gave a strange jolt instead. “I’m sure we can come up with something.”\n“Thank you. My pride kept me from asking for your help, I suppose. Until you came up to me and outright offered it. I apologize. For being what I am.”\nKiriko snorted. “Don’t be sorry for such a thing. You cannot help that. Be sorry for not acting sooner for your friend and only for that. Anyway.” She rolled up her sleeves. “Let’s get working.”\nThe receptor itself couldn’t be seen, as it was embedded under the skin. Mizuha mailed the blueprint of the part along with the leftover configuration of ink and seed to Kiriko, care of the atelier. At the park she had sketched a few patterns that seemed to indicate Sakura’s vulnerability to intense colors; she’d found similar tendencies from parts of Doctor Planet, who was an addict, and Sakura was addicted to the color, too, after all. Kiriko and her mentor made proper drawings of these patterns first, and then started discussing a new pattern that could offset the effect of the original one. Line by careful line they constructed a pattern that could bend the way the world ran over Sakura and his affected systems.\nAnd then there was one more thing they had to do to this offset pattern. They now looked into each line again, added new ones that could change the way light traveled over the first line, to build a new pattern that would only offset the first offset pattern optically. When this optical pattern was a perfect shadow to the first offset pattern, an ordinary eye could detect neither of the two when they were placed one over the other precisely.\n“So we use three layers of films here,” her mentor said, as he tapped his long fingers on a roll of thin, transparent film, which had come very, very expensive. “We attach a small piece of the layers of this film on Sakura’s neck, just over where his receptor is located—where, supposedly, everything started. On the inside of the first layer we print the offset pattern with the ink composition altered by Sakura, concocted with a medium to prevent it from drying too fast, so that the pattern will slowly seep over to the receptor. We place another layer of the film, with no pattern on it, and then cover the two layers with one more layer with the optical pattern on the outside. Theoretically speaking, the caregiver humans, or other andos, won’t be able to see something is written on Sakura’s neck.”\nKiriko nodded. “The most dangerous part would be when the ink on the offset pattern is completely drained. Someone with a very keen eye might be able to tell the optical pattern alone there, even though the medium left on the first layer would still work as shadow to the optical pattern more or less.”\n“Make sure that happens when he is off duty. Adjust the amount of the medium according to his shift timetable.”\n“Yes. The weather forecast, too, for the amount of moisture in the air—there’s going to be a hell of a lot of calculations to make.”\nKiriko handed the patterned films along with the instructions to Mizuha. The ando looked uncomfortable; as she held the bundle between her hands she said, “I told Sakura that he should be here, too. Say his thanks by himself. But . . . ”\n“It’s okay.” Kiriko laughed. “Well, how predicable.”\nMizuha sighed. “I’ll make him pay.”\nKiriko laughed again. “You scare me.”\nThe ando put the bundle inside her coat. “Thank you. This is my thank you. Because I won’t have to lose a friend if this works.”\n“I’m sure it works. If you follow instructions. If he follows.”\n“I’ll make sure of that.” Mizuha shook her head, a smile playing at her lips. “But how can you be so certain that it will work? I mean, humans are subject to errors, always. And I can only guess what you do here leaves no room for errors.”\nKiriko cocked her head, smiling. “Funny . . . you’re right. I don’t even remember when I stopped worrying about such a thing—our pattern not working. Those my mentor and I build together. We still worry a lot about whether or not a client likes our work, though.” She shook her head a little, and then nodded. “I assure you that it will work. And also . . . ” She pulled another bundle from her backpack and passed it to Mizuha.\nMizuha looked at the craftsperson quizzically. “This is?”\n“The blueprint of the color receptor that you provided—it wasn’t marked as Sakura-san’s. So we assumed that you share this same module—at least more or less.”\n“You are correct to assume that. That part is one of the few that are identical from one another.”\n“Good.” Kiriko nodded. “So we made a small emergency pattern that would work for you all.” She pointed at the bundle with her hand, urging the ando to open it. When Mizuha did, three small objects shaped like tiny wooden pillars came rolling out of a leather pouch. One end of each was carved with a simple pattern. “We usually customize patterns by combining conventional ones. These three patterns are what we believe would work on you if combined precisely. Do you see those tiny cuts on the other ends?” Mizuha nodded. “For ordinary clients we make a pattern with the three overlaid perfectly, but carving that combined thing onto this very hard material would have taken a long, long time. But we believe in your precision. Use the cuts as markers to inflict the stamp precisely at the same place over your receptor, in a very speedy manner. Then you can make the desired pattern on the skin right there. There are receptors there, after all—you won’t need an ink, just the touch of the pattern would be enough to soothe the roused edges of your neuro signals, to stop the fractal progress of the unwanted stimulation within you.”\nMizuha placed the stamps back into the pouch and put the pouch into her breast pocket. “Thank you. I don’t know how I can thank you enough.”\n“Do me a favor, then, would you?”\n“Anything.”\nKiriko let out a breath. “Thoroughly eliminate the info in your data attached to these patterns, specifically about who made them. We can’t tell how much your caregiver humans know of what you know, so we cannot risk leaving any trace, for the city to hunt us down in case something goes wrong. Don’t make the mistake that we made the other day—leaving a half-broken print panel like that, for you to easily take away.”\nKiriko had expected Mizuha would immediately say yes to that. Instead, silence fell on them like soft snow. When Mizuha spoke, Kiriko could hear lead on the ando’s tongue. “But I want to remember.”\nThe craftsperson blinked. “What do you want to remember?”\n“You. That you helped us all. That you will help us all in the future, yet again, with these patterns. I don’t want to let go of it.” Mizuha shook her head. “But then . . . we cannot share the information that a colorless craftsperson can be trustworthy enough for that. That memory itself would throw off the balance of elements in us.”\nKiriko laughed. “See? You cannot keep my doings secret, one way or the other. Just discard it.”\n“We cannot attach the data of a colorless laborer to the patterns. But maybe just your name?” Mizuha looked up and met Kiriko’s eyes. “Just as the brilliant person who came up with this solution. We don’t have to attach data about your being colorless. We’ll remember your name, we’ll always relish your name. Let us remember.”\nThe colorless craftsperson looked back at the ando, who was apparently young, so young, that her chest ached with protectiveness. But then heard herself saying, “It’s too dangerous . . . ”\n“Then we will not attach your name to your patterns. Just your name? We’ll all store these memories in very separate places. And make a map for them when we need to turn to you again, so that our indifferent caregiver humans would never know to connect those.” Mizuha came a step closer. “I don’t want to let go. I’ll make sure those like Sakura understand the importance of your name. Please.”\nKiriko held a hand near Mizuha’s shoulder, as the ando closed another half step. “Not only is it dangerous. You don’t understand. I don’t want to be remembered like that. When I’m remembered, I want it to be as a colorless craftsperson, and my mentor must be there with me, too. Just my name attached to one single work is not the same as me being acknowledged.”\nFor a moment, Mizuha looked at Kiriko’s hand, as if she wanted to touch it with her own. But she didn’t. “I don’t understand,” she finally said.\n“It’s okay.” Kiriko looked up, strained her eyes at the clouds. “Not any information on us. Can you do that?”\nAt the corner of her eye, Kiriko saw Mizuha nod after a second of hesitation. “Can I remember you?”\n“It’s your memory. Do whatever you like with it.”\nThe air was filled with the hint of moisture—Kiriko could see it and smell it. But it wasn’t yet cold enough—it would be half-snow, half-rain when it fell, that heavy thing that made the ground smeary and ugly, and made people shiver to the core, colorful, colorless, andos all alike.\n“And you forgot to collect cash even for the films?” Kiriko’s mentor said to his apprentice who had come back soaked and shaking.\n“I’m sorry, sensei. I really am. I give up the new ink.”\n“Oh of course. No ink of your choice for the rest of the fiscal year.”\nShe wrapped her blanket tighter around her and drank warm water from a cup with blood-circulation improving pattern drawn on the bottom. “But ink can be our asset, not just my fancy thing.”\nHe grinned. “It’s okay, we’ll add an asset to our balance sheet. I’m going to get that brush for me, anyway.”\nKiriko almost dropped her cup. “That’s not fair!”\n“It doesn’t have to be. I’m the owner here.”\nKiriko groaned and covered herself entirely in the blanket, head to toe. Her mentor laughed and went away into their workshop. Taking another sip of the warm water, she wondered if there was a reason that no one knew the names of the craftspersons who had worked on the interior of the Hotel. Not the reason that came from the city, or any other colorful entities, but from the old craftspersons themselves.", "source": "https://clarkesworldmagazine.com/ogawa_03_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Grayer Than Lead, Heavier Than Snow by Yukimi Ogawa"}