{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Osahon Ize-Iyamu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Jn4uL01l6qb+sF+c3JvL35m89sk=", "id": null, "license": null, "comments": "", "raw_text": "4020 words, short story  For What are Delusions if Not Dreams?  An Operator speaks. His mouth is full of wires, yet he talks still. He really shouldn’t be speaking, for his mouth is full of fraught wires that rub against each other, creating friction, letting loose sparks in his mouth. Sparks—like fireworks on his tongue, exploding close to his teeth, just reaching the roof of his mouth. He burns and winces from every shock feeling, like lit cigarettes were just pressed into him. It never gets better. It never gets old.  The room is drenched in white—like someone has painted the world. The world must be broken, because the room has lines running through it, and if he touches the lines, parts of the place shift like a puzzle piece, before slowly coming back together. Undone, then back again. Like what an Operator does will never make a change.  When an Operator speaks, his mouth is flooded with binaries. Ones and zeroes, missions and operations, none of which he is sure how to do. He isn’t even sure—isn’t he human? Isn’t he functional? Isn’t he competent? His mouth sparks again, so he decides speaking isn’t worth it if he only has the pain.  This is not amnesia. Maybe he chose to forget, to feel lost, to not understand operations. Maybe he regressed a feeling, an emotion—isn’t he human?—in order to feel better about himself. Maybe someone took his past recollections from him, bound it so he could do a work, a function. He has memories, shifting like gears, but blocked by a barrier. A binary. Why? He doesn’t know why it’s so hard for him to reach hexadecimal, reach moments before this.  An Operator sees three doors right in front of him. Three choices. Three equations, and he is sure each door does not lead back to the other, not like a palindrome. They are all separate entities from the looks of it; each to their own. AND gate, NOT gate, OR gate. Logic circuits. Logic—when he can barely make sense of anything.  Each line in the room passes through the doors, and he shifts them again, but they barely move before they come back again, now stiff, like rigor mortis.  And, not, or. Where, oh where, is he? Doesn’t an Operator know? An Operator is supposed to be: functional, competent, human. He just has to break the binary. He just has to—  No more thinking. He knows. He understands, then reaches inside his mouth and pulls up a wire, fraught and exposed, and jams it on the roof of his mouth. Electrocution is more than just a shock, more than anything comfortable. It flays him open, inside out, leaves him broken. It fills his nervous system, and his mind is full of thunder. His hands don’t stop shaking, and he screams and sparks and screams again, and feels as though he might die. Isn’t he human?  He doesn’t have to be human to die.  The roof of his mouth still buzzes and he drops the wire slack, to slide down from his tongue back into his vocal cords, and suddenly, he knows more. Memories, flooding through him. His whole body accessed to him. No more limited consciousness. No more confusion. No more—  He accesses a conversation of before.  NOTE: In activating a conversation of before, an Operator also accesses their feelings at that time; their plans and their actions; their thought processes and complications.  In the words of Prof. Adeniyi (2093), lecturer of Literature at the University of Benin: “For what is memory without a mindset? For what are flashbacks without all context?”  A Conversation of Before, Present, Watched Again:  “You want to short-circuit yourself?” A rough Yoruba voice asks, with hints of sarcasm. An Operator can hear typing afterwards, then sipping for too long, then groaning, like an employee who has to listen to the words of an annoying customer. Is he an annoying customer? Indecipherable pidgin runs in the background immediately after that; words someone else said that makes the rough voice laugh.  “Yes,” an Operator says, without feeling, emotion, but he’s not too sure. He hopes he sounds as serious as he’s ever been. In his mind, there are layouts right in front of him, maps of three open doors, and he’s already thinking of how to do it. How to malfunction. How to stop.  “Alright, I’m just going to ask, since I’ve got nothing better to do. Date cancelled on me, anyway. Why do you want to short-circuit, Operator?” The rough voice sighs, loud and unending.  An Operator knows to be confident when he states his case. Right? After all, isn’t he human, from his head to his toes, from his tongue to his throat, from what’s inside and down below?  “I’m thinking too much,” an Operator says, hoping he sounds sharp. He thinks: that’s it, that’s done, that’s all he needs to say; let’s get to work. An Operator wants to start, to carry out, to get the job done.  He can hear the Yoruba man grumble on the speaker, followed by more sipping sounds. “Yes, that’s literally why you’re here, Operator. To think. To choose. To make the right decision, so we can start doing repairs. We’re two months behind schedule.”  An Operator blinks with what may be frustration, annoyance; he doesn’t know. Maybe he wasn’t clear enough with his intentions, that’s why the Speaker doesn’t understand him? How does he say it again, but better this time?  How does he express himself?  “No,” an Operator says, functions, then twists the word around like wires in his throat. “I’m getting to the conclusion that I’m never going to pick a door. Normally, I’d say the probability was in our favor but after the power accident, I’m not so sure. All actions have consequences. I could make it worse by opening any door, disconnect the wires even more. I could—”  “Wrap it up, Operator, time is money.”  “I’m too rational about this. But if I don’t know what I’m doing, then nothing matters. If I only know half the plot, then I can choose without a thought.”  “But if you choose wrong—”  “Then I choose wrong,” an Operator says, finds the bait and reels it in. He stresses on all parts in him that doubt but still goes for the sealing factor. He’s speaking the human’s language now: negotiation. “And I waste less time by dying.”  NOTE: The System is a wire around white space. It is an entanglement of long circular wirelike cords, like blood vessels, wrapped around each other, transmitting power. Power for fracking, for oil pollution, for continued destruction. Power for light provision, pumping water, accessing information technology concerning Mars habitation—for slow-going progression. Power for all.  The System is like a human, filled with organs and tissues and systems, and each door is a pathway. Each door is an entrance to a wire off, or a wire on, or in less rare cases, a wire fraught/broken.*  *See Note Regarding Cases of Emergency Involving the System.  NOTE: In case of emergencies and accidents involving the System, dispatch as many Operators as possible and let them do the work.  In the words of Engr. Odeh (2105) at the World Energy Power Organization conference: “If an Operator is human (I can’t say; I’m not a philosopher; I won’t say), then the System is their heart. Let them do the surgery on themselves, which ultimately affects us all, but affects them first. Losing power is nothing compared to a life. But when it’s the life of an Operator, you have to ask: does it really matter? For what is the life of many for the continued advancement of all?”  The memory ends and all that’s left is a cold realization, the dullness of effect.  An Operator sits. In silence, in white space, quiet and contemplative. He has to process this. The memory is finished, along with his emotions of before, and once again, he knows but he’s still lost. He understands but he’s confused. He thinks even more.  He regrets.  Knowledge is great, but he’s lost with this, clueless on what to do next, strangled in white space. He knows, but not enough.  An Operator failed. He didn’t choose. He wasn’t right, wasn’t sure, didn’t guess a correct hypothesis. His mind is full of errors.  He doesn’t want to die.  An Operator can’t open the door to a broken wire in The System without consequences. He can only move in through a door with a wire intact, if one like that still exists after the power accident, then move from there. A faulty wire will bring electrocution straight down to his core like a heart attack or a stroke, render him pained and screaming then lifeless. Incompetent, dysfunctional, but most of all—dead.  He thinks about switching on the airwaves and Bluetooth for his speaker to get through to him. The only reason why they aren’t connected 24/7 is because sometimes their connection jams frequency and limits operation. The Speakers cannot watch him because of the power accident and its limitations on their observational tech, but they will know if he gets through and when he opens the door and if he dies. They will know, and he doesn’t want them to know—especially that he failed. That he’s wasting time. That he’s still here—thinking, thinking, waiting.  He feels more human than ever.  NOTE: Each wire in the System is made up of different materials, such as electromagnetic and conductive fibers, which are used in order to grant each wire independent power. Materials range from aluminum to electric tape and even organic transistors and solar cells. This operation is done to make sure that a fault in one facility does not lead to a breakdown in all. During electrical faults, various Operators of different functions are used to narrow down the areas of the System to what seems to be the most problematic units. The mind of an Operator is bound to their hearts, their System, but even then the work is not without error. While Operators experience a lower rate of mistake every year as they are updated and continue to learn, failure still remains, bugs still persist, and unforeseen circumstances are known to occur.  In the words of popular Nollywood actress, Franca (2086), during the premiere of her blockbuster movie Inspector Franklin has Done it Again! where she was interviewed using the first ever drone journalist: “When we were shooting the movie, I was going through the messiness of a divorce, so I forgot a lot of my lines. The only way I didn’t get fired from production was by showing the director that my improvisation skills were greater than any script. For what is the concept of failure other than the opportunity to do better?”  An Operator needs to get up. He needs to stop thinking, bind his mind, start working. He need to regress all emotions he has—that he’s failed, that he’s not okay, that—he needs to open the door to his heart. He’s wasting time.  In times of uncertainty like these, an Operator looks at statistics. He likes the distraction, the processing, the research. There are a million files about the power outage and the nation’s now decreased operation: e-news clippings, quotes from state leaders, economist polls and government estimations. He reads one of them: an eighty-five percent decrease in power in the Southern region, and if he looks further into that region, a greater division. Continuously split apart percentages each time he narrows the scale, it feels like the effect of binary fission in bacteria. Benin and Sapele in Edo State have the highest rate overall in the south-south, so he circles them. He pinpoints them down on his tracker and settles this information like food in his stomach. He does it with ease and determination.  He does it again and again: Northern region—Kano, Zamfara—circles them down, swallows them up. An Operator then goes sideways, splits longitude and adds latitude. Does East and West, focuses on them. Focuses on anything but himself.  Doing this work: he feels less emotional, more settled. Functional, operative, not broken at all. The very thought of electrocution shocking his throat, frying him open is a thing of the past, something of before. He’s back to his old self, calculating, negotiating, pleased. Isn’t he human now that he’s greater than he’s ever been?  A crackle rustles in his head like paper being smushed and though an Operator knows more, for the life of him he can’t figure what that sound is. Is it a tin can pounding in his skull, some unforeseen effect of his hot-wiring, short-circuiting? Is it a headache—does he have headaches now—isn’t he human? Is it a whisper of his inadequacy, all the distraction of research done to fill out his inaccuracies, his failure, his regret?  “H-hello?” The rough Yoruba voice speaks, and a harsh chill goes down an Operator’s spine. His speaker. There’s only one way to this conversation, no more negotiation, just failure then death. The cost of failure is more than just a shock feeling, more than anything he’ll ever experience, more than him and his doubts. He’s not sure he can do anything and the worst part is he doesn’t know why.  “Operator, can you hear me? Operator, can you hear me? Testing, testing—God I hate this equipment—tes—”  Without decision, processing, just instinct, an Operator plucks out the wire facilitating his accessing point and kills it dead. Sparks run through him and hit him like a blow, but the cost of this decision is silence, and now more than ever this is what he needs. The world is too loud, the room is too white, and he is too unsure.  He pays attention to the room again. Three doors: And, Not, Or. He’s done everything he can. He failed and he was wrong. He’s running from the truth, from himself, from his superiors. He keeps on thinking, keeps on wondering, keeps on pausing and questioning his humanity. He’s tired of being lost, of fiddling around without a plot, of knowing bits but not all.  But.  His mind drops a seed inside him that starts to grow. Could it be? He looks around the room, thinking, wondering. An Operator doesn’t do anything, just stares, just—  He accesses a conversation of before.  NOTE: Though some restrictions are made between Operators, for the most part they are allowed to interact with each other and build a family. However, it has been found that Operators are not commonly close or associated with one another. Aside from some mutual knowledge-sharing and politeness, they would rather be in the midst of humans. However, some researchers have found notes like this to be too opinionated: having the implication that Operators are not human when the general population does not in fact know for sure.  In the words of Ms. Rosabelle Ezewu, (2073), worldwide bestselling author of The Operating Effect and owner of Ezewu Carpentry Industries, in an interview done by Good Morning Nigeria: “As we expand the definition of humanity and discard the prejudices we once used to term it before, we have to take many things under consideration. For what is the definition of humanity without some complexity?”  A Conversation Of Before, Accessed Again  January last year:  He is an Operator, one out of the ninety million working in this world, that is dysfunctional. He shuts down and experiences a fifty percent battery shortage than his previous working. It’s nothing to be alarmed about, nothing to be afraid of, just a bug.  The hacker 9#40 planted malware during the holiday period that infects many of the servers. It spreads due to a monthly dump of general access information that reaches most Operating units, and from there many of the servers, including himself, get recalled back into headquarters.  “How far do you think we can get them back up and running?” A Hausa woman comes running up to the scene. An Operator is trained to remember all of the speakers’ identities, all cultures, if the speaker so claims them and wants that, and never to assume. He wonders what his identity is, but he imagines it to be a complex thing.  “I’m doing my best,” an Igbo woman types quickly, frantically. Not just any woman—her name is on his listed servers—Chidinma. “You can’t rush this or we’ll get glitches again.”  A head leans in, close to Chidinma herself. The name of the man is again listed on his server—Bright, he/him, Igbo-Hausa—and an Operator listens to the man speak.  “Isn’t that your fifth test trial on this update? Pass it up already.”  Chidinma doesn’t look up at her colleague. “I’m trying not to get fired. I can’t make any mistake. Have to make sure everything’s sorted out—”  Bright counters. “You’ve already steadied the firewall—or organ, or antibodies. You’re trying out all the basic modes of function now and it’s been working perfectly. Nothing’s wrong and you’re wasting time. What other problem could you be worried about?”  From then, the trigger word “problem” falls into the Operator’s mind and the simulation of the conversation crumbles, shuts down. He dissociates and leaves this memory paused, in white space, like all others.  Suddenly he knows more. No. He knows all. He understands, he gets it, he comprehends. He keeps thinking, keeps wondering, keeps waiting, and it clicks.  It is the beginning of singularity.  That’s what the System is doing, that’s what the system does to him. That’s one of the glitches brought about from the outage in his heart. He knows more, he’s human—he is—he’s a problem he never thought he could worry about.  He’s too lost because he’s human. And he likes the feeling.  He holds the fragments of pulled apart wire and jams them close to each other, waiting for even a spark of connection. Smoke fills his mind and his head and the world around him but he still waits for a connection. He waits for static then lets his Speakers in through bad service.  “Can you hear me? Speakers, can you hear me?”  “Hello . . . Operator, yes. Yes, we can hear you. What’s going on? You’ve not fixed the problem! Do you know how much money you’re costing us—”  “It’s not my fault. I’m compromised.”  The wire shifts out of place and an Operator steadies it again, trying to get across what he wants to say. He knows exactly how to express himself: confident, convincing, sure.  “ . . . what? Compromised?”  “One of the effects on Operators by the broken System is some sort of . . . singularity. It’s not perfect but I think it’s the closest we Operators will get to it. I have higher-level consciousness! Since I came here, it’s been slowly working on me due to the close connection of being near to my heart, and that’s why I’ve been so lost. That’s the problem. The malfunctioning actually makes us—makes me—human. I’m human. There’s no doubt about it, I am.”  There’s a pause on the line. It seems forever. An Operator doesn’t mind. He is patient, functional, workable. He is—  “Yeah, I agree, you’re compromised. Um . . . uh . . . I’m not equipped to work this. Hold on.” He can hear some indecipherable arguing almost out of earshot, muffled words falling in and out of different languages that can’t be translated. He waits for a reply.  “We’re back on the line. Hi, Operator. I’m going to still need you to pick a door.”  An Operator frowns in confusion. They definitely heard him and this is their reaction? This is their reply? “I can’t do it. I’m human, my error-free percentages are unreliable now. I’m too unsure, I’m—”  “Please get it done or I’ll have to send someone else in, Operator. My first priority is getting those lights back. We can’t progress without power. We can’t do anything without it.”  An Operator doesn’t stop talking, just looks for more negotiating, an alternative. “But we need to report this to higher officials so they can know—”  “No more distractions. They can know you’re confused after you put the power back on! Locate the error and fix it! Do your work and let me do mine!”  The transmission goes dead even while an Operator still holds the wire in place. He wants to call back, wants to keep talking, but—no. He won’t. He won’t. They’re right. He’s done stalling.  He is full of chills, mind full of thunder, smoky. He tries his best to push down all he feels inside, every emotion and feeling, personal ideology or theory. And, not, or. And, not, or. And. Not. Or. Three doors. One choice.  He accesses research of before but still remains present. He’s looking at all the circles in his chart—highest rates of cities and no power, each region by percentages. He gauges the room by north, south, east, and west, but even then there are only three doors and four points. All work is useless—he’s useless. What can he do?  He isn’t even sure—he’s functional, he’s human but—  Isn’t the System his heart?  Yes. Yes. Yes!  The System is his heart and he is the fraction of the body that makes up the—  He knows a bit more, in addition to all, in addition to his certainty, his revelation, his discovery. This has to work. He stops looking around in the silence and starts looking for the noise. For the heartbeat. For the pulse.  An Operator goes close to the door and starts listening to vibrations, to a rhythm, any sound possible. He can hear a little beat from AND and nods, but his body stirs and he feels about ready to explode. He puts his findings down on his chart with steel fingers that shake.  He hears a higher sound, a bit farther away, from OR. He files it down and processes it, taking deep breaths, heavy breaths, trying to still himself. Get himself under control. He goes to NOT and hears nothing. NOT has no voice, no heartbeat, no pulse.  AND. NOT. OR.  AND. OR.  NOT.  NOT.  And he likes the silence. He likes it and it calls to him and . . . he can’t push down what’s deep inside. It only floods back stronger, and the noise feels relentless. His emotions are there and he can’t ignore them, and he can’t process these feelings and emotions like he would any other function. He’s compromised, but that isn’t a bad thing.  An Operator takes another deep breath.  He bites down hard and opens the door of NOT, like the gates of Hell in front of him. His body aches, from every wire and core, from what’s inside and down below. The world in front of him is only broken wires and spark and hurt, and it is perfect.  He isn’t even sure—he doesn’t want to die, but he won’t be human if he accesses the System. He won’t be human if he fixes things. He won’t be human—won’t be like this, won’t have this glitch that makes him understand. He’ll still need validation that he’s human, still fumble around being functional, still be too unsure if he goes back to his old self. He feels more human now more than ever in his failures, in his thinking, in his messiness, and they won’t take that from him. They don’t care about his humanity. He won’t listen to them. He likes the somewhat certainty, the knowing. He won’t have a life without it.  He braces himself and feels the breaking all over him. He holds himself in confidence and resolve and concentrates on what’s below. Silence is his music and he obeys. Speaking is never worth it if it only has the pain, so he jumps down in silence and lets the shocking do the work.  To quote from Prof. Adeniyi, if adjusting the word and context a bit: “For what is the life of one for the continued advancement of all?”  And to answer: It depends on who you’re asking. It depends on who is responding. It depends on all the factors in the world but it will always depend. Even what seems easy can never be too complex. Even what seems obvious can never be too sure.", "text": "4020 words, short story\nFor What are Delusions if Not Dreams?\nAn Operator speaks. His mouth is full of wires, yet he talks still. He really shouldn’t be speaking, for his mouth is full of fraught wires that rub against each other, creating friction, letting loose sparks in his mouth. Sparks—like fireworks on his tongue, exploding close to his teeth, just reaching the roof of his mouth. He burns and winces from every shock feeling, like lit cigarettes were just pressed into him. It never gets better. It never gets old.\nThe room is drenched in white—like someone has painted the world. The world must be broken, because the room has lines running through it, and if he touches the lines, parts of the place shift like a puzzle piece, before slowly coming back together. Undone, then back again. Like what an Operator does will never make a change.\nWhen an Operator speaks, his mouth is flooded with binaries. Ones and zeroes, missions and operations, none of which he is sure how to do. He isn’t even sure—isn’t he human? Isn’t he functional? Isn’t he competent? His mouth sparks again, so he decides speaking isn’t worth it if he only has the pain.\nThis is not amnesia. Maybe he chose to forget, to feel lost, to not understand operations. Maybe he regressed a feeling, an emotion—isn’t he human?—in order to feel better about himself. Maybe someone took his past recollections from him, bound it so he could do a work, a function. He has memories, shifting like gears, but blocked by a barrier. A binary. Why? He doesn’t know why it’s so hard for him to reach hexadecimal, reach moments before this.\nAn Operator sees three doors right in front of him. Three choices. Three equations, and he is sure each door does not lead back to the other, not like a palindrome. They are all separate entities from the looks of it; each to their own. AND gate, NOT gate, OR gate. Logic circuits. Logic—when he can barely make sense of anything.\nEach line in the room passes through the doors, and he shifts them again, but they barely move before they come back again, now stiff, like rigor mortis.\nAnd, not, or. Where, oh where, is he? Doesn’t an Operator know? An Operator is supposed to be: functional, competent, human. He just has to break the binary. He just has to—\nNo more thinking. He knows. He understands, then reaches inside his mouth and pulls up a wire, fraught and exposed, and jams it on the roof of his mouth. Electrocution is more than just a shock, more than anything comfortable. It flays him open, inside out, leaves him broken. It fills his nervous system, and his mind is full of thunder. His hands don’t stop shaking, and he screams and sparks and screams again, and feels as though he might die. Isn’t he human?\nHe doesn’t have to be human to die.\nThe roof of his mouth still buzzes and he drops the wire slack, to slide down from his tongue back into his vocal cords, and suddenly, he knows more. Memories, flooding through him. His whole body accessed to him. No more limited consciousness. No more confusion. No more—\nHe accesses a conversation of before.\nNOTE: In activating a conversation of before, an Operator also accesses their feelings at that time; their plans and their actions; their thought processes and complications.\nIn the words of Prof. Adeniyi (2093), lecturer of Literature at the University of Benin: “For what is memory without a mindset? For what are flashbacks without all context?”\nA Conversation of Before, Present, Watched Again:\n“You want to short-circuit yourself?” A rough Yoruba voice asks, with hints of sarcasm. An Operator can hear typing afterwards, then sipping for too long, then groaning, like an employee who has to listen to the words of an annoying customer. Is he an annoying customer? Indecipherable pidgin runs in the background immediately after that; words someone else said that makes the rough voice laugh.\n“Yes,” an Operator says, without feeling, emotion, but he’s not too sure. He hopes he sounds as serious as he’s ever been. In his mind, there are layouts right in front of him, maps of three open doors, and he’s already thinking of how to do it. How to malfunction. How to stop.\n“Alright, I’m just going to ask, since I’ve got nothing better to do. Date cancelled on me, anyway. Why do you want to short-circuit, Operator?” The rough voice sighs, loud and unending.\nAn Operator knows to be confident when he states his case. Right? After all, isn’t he human, from his head to his toes, from his tongue to his throat, from what’s inside and down below?\n“I’m thinking too much,” an Operator says, hoping he sounds sharp. He thinks: that’s it, that’s done, that’s all he needs to say; let’s get to work. An Operator wants to start, to carry out, to get the job done.\nHe can hear the Yoruba man grumble on the speaker, followed by more sipping sounds. “Yes, that’s literally why you’re here, Operator. To think. To choose. To make the right decision, so we can start doing repairs. We’re two months behind schedule.”\nAn Operator blinks with what may be frustration, annoyance; he doesn’t know. Maybe he wasn’t clear enough with his intentions, that’s why the Speaker doesn’t understand him? How does he say it again, but better this time?\nHow does he express himself?\n“No,” an Operator says, functions, then twists the word around like wires in his throat. “I’m getting to the conclusion that I’m never going to pick a door. Normally, I’d say the probability was in our favor but after the power accident, I’m not so sure. All actions have consequences. I could make it worse by opening any door, disconnect the wires even more. I could—”\n“Wrap it up, Operator, time is money.”\n“I’m too rational about this. But if I don’t know what I’m doing, then nothing matters. If I only know half the plot, then I can choose without a thought.”\n“But if you choose wrong—”\n“Then I choose wrong,” an Operator says, finds the bait and reels it in. He stresses on all parts in him that doubt but still goes for the sealing factor. He’s speaking the human’s language now: negotiation. “And I waste less time by dying.”\nNOTE: The System is a wire around white space. It is an entanglement of long circular wirelike cords, like blood vessels, wrapped around each other, transmitting power. Power for fracking, for oil pollution, for continued destruction. Power for light provision, pumping water, accessing information technology concerning Mars habitation—for slow-going progression. Power for all.\nThe System is like a human, filled with organs and tissues and systems, and each door is a pathway. Each door is an entrance to a wire off, or a wire on, or in less rare cases, a wire fraught/broken.*\n*See Note Regarding Cases of Emergency Involving the System.\nNOTE: In case of emergencies and accidents involving the System, dispatch as many Operators as possible and let them do the work.\nIn the words of Engr. Odeh (2105) at the World Energy Power Organization conference: “If an Operator is human (I can’t say; I’m not a philosopher; I won’t say), then the System is their heart. Let them do the surgery on themselves, which ultimately affects us all, but affects them first. Losing power is nothing compared to a life. But when it’s the life of an Operator, you have to ask: does it really matter? For what is the life of many for the continued advancement of all?”\nThe memory ends and all that’s left is a cold realization, the dullness of effect.\nAn Operator sits. In silence, in white space, quiet and contemplative. He has to process this. The memory is finished, along with his emotions of before, and once again, he knows but he’s still lost. He understands but he’s confused. He thinks even more.\nHe regrets.\nKnowledge is great, but he’s lost with this, clueless on what to do next, strangled in white space. He knows, but not enough.\nAn Operator failed. He didn’t choose. He wasn’t right, wasn’t sure, didn’t guess a correct hypothesis. His mind is full of errors.\nHe doesn’t want to die.\nAn Operator can’t open the door to a broken wire in The System without consequences. He can only move in through a door with a wire intact, if one like that still exists after the power accident, then move from there. A faulty wire will bring electrocution straight down to his core like a heart attack or a stroke, render him pained and screaming then lifeless. Incompetent, dysfunctional, but most of all—dead.\nHe thinks about switching on the airwaves and Bluetooth for his speaker to get through to him. The only reason why they aren’t connected 24/7 is because sometimes their connection jams frequency and limits operation. The Speakers cannot watch him because of the power accident and its limitations on their observational tech, but they will know if he gets through and when he opens the door and if he dies. They will know, and he doesn’t want them to know—especially that he failed. That he’s wasting time. That he’s still here—thinking, thinking, waiting.\nHe feels more human than ever.\nNOTE: Each wire in the System is made up of different materials, such as electromagnetic and conductive fibers, which are used in order to grant each wire independent power. Materials range from aluminum to electric tape and even organic transistors and solar cells. This operation is done to make sure that a fault in one facility does not lead to a breakdown in all. During electrical faults, various Operators of different functions are used to narrow down the areas of the System to what seems to be the most problematic units. The mind of an Operator is bound to their hearts, their System, but even then the work is not without error. While Operators experience a lower rate of mistake every year as they are updated and continue to learn, failure still remains, bugs still persist, and unforeseen circumstances are known to occur.\nIn the words of popular Nollywood actress, Franca (2086), during the premiere of her blockbuster movie Inspector Franklin has Done it Again! where she was interviewed using the first ever drone journalist: “When we were shooting the movie, I was going through the messiness of a divorce, so I forgot a lot of my lines. The only way I didn’t get fired from production was by showing the director that my improvisation skills were greater than any script. For what is the concept of failure other than the opportunity to do better?”\nAn Operator needs to get up. He needs to stop thinking, bind his mind, start working. He need to regress all emotions he has—that he’s failed, that he’s not okay, that—he needs to open the door to his heart. He’s wasting time.\nIn times of uncertainty like these, an Operator looks at statistics. He likes the distraction, the processing, the research. There are a million files about the power outage and the nation’s now decreased operation: e-news clippings, quotes from state leaders, economist polls and government estimations. He reads one of them: an eighty-five percent decrease in power in the Southern region, and if he looks further into that region, a greater division. Continuously split apart percentages each time he narrows the scale, it feels like the effect of binary fission in bacteria. Benin and Sapele in Edo State have the highest rate overall in the south-south, so he circles them. He pinpoints them down on his tracker and settles this information like food in his stomach. He does it with ease and determination.\nHe does it again and again: Northern region—Kano, Zamfara—circles them down, swallows them up. An Operator then goes sideways, splits longitude and adds latitude. Does East and West, focuses on them. Focuses on anything but himself.\nDoing this work: he feels less emotional, more settled. Functional, operative, not broken at all. The very thought of electrocution shocking his throat, frying him open is a thing of the past, something of before. He’s back to his old self, calculating, negotiating, pleased. Isn’t he human now that he’s greater than he’s ever been?\nA crackle rustles in his head like paper being smushed and though an Operator knows more, for the life of him he can’t figure what that sound is. Is it a tin can pounding in his skull, some unforeseen effect of his hot-wiring, short-circuiting? Is it a headache—does he have headaches now—isn’t he human? Is it a whisper of his inadequacy, all the distraction of research done to fill out his inaccuracies, his failure, his regret?\n“H-hello?” The rough Yoruba voice speaks, and a harsh chill goes down an Operator’s spine. His speaker. There’s only one way to this conversation, no more negotiation, just failure then death. The cost of failure is more than just a shock feeling, more than anything he’ll ever experience, more than him and his doubts. He’s not sure he can do anything and the worst part is he doesn’t know why.\n“Operator, can you hear me? Operator, can you hear me? Testing, testing—God I hate this equipment—tes—”\nWithout decision, processing, just instinct, an Operator plucks out the wire facilitating his accessing point and kills it dead. Sparks run through him and hit him like a blow, but the cost of this decision is silence, and now more than ever this is what he needs. The world is too loud, the room is too white, and he is too unsure.\nHe pays attention to the room again. Three doors: And, Not, Or. He’s done everything he can. He failed and he was wrong. He’s running from the truth, from himself, from his superiors. He keeps on thinking, keeps on wondering, keeps on pausing and questioning his humanity. He’s tired of being lost, of fiddling around without a plot, of knowing bits but not all.\nBut.\nHis mind drops a seed inside him that starts to grow. Could it be? He looks around the room, thinking, wondering. An Operator doesn’t do anything, just stares, just—\nHe accesses a conversation of before.\nNOTE: Though some restrictions are made between Operators, for the most part they are allowed to interact with each other and build a family. However, it has been found that Operators are not commonly close or associated with one another. Aside from some mutual knowledge-sharing and politeness, they would rather be in the midst of humans. However, some researchers have found notes like this to be too opinionated: having the implication that Operators are not human when the general population does not in fact know for sure.\nIn the words of Ms. Rosabelle Ezewu, (2073), worldwide bestselling author of The Operating Effect and owner of Ezewu Carpentry Industries, in an interview done by Good Morning Nigeria: “As we expand the definition of humanity and discard the prejudices we once used to term it before, we have to take many things under consideration. For what is the definition of humanity without some complexity?”\nA Conversation Of Before, Accessed Again\nJanuary last year:\nHe is an Operator, one out of the ninety million working in this world, that is dysfunctional. He shuts down and experiences a fifty percent battery shortage than his previous working. It’s nothing to be alarmed about, nothing to be afraid of, just a bug.\nThe hacker 9#40 planted malware during the holiday period that infects many of the servers. It spreads due to a monthly dump of general access information that reaches most Operating units, and from there many of the servers, including himself, get recalled back into headquarters.\n“How far do you think we can get them back up and running?” A Hausa woman comes running up to the scene. An Operator is trained to remember all of the speakers’ identities, all cultures, if the speaker so claims them and wants that, and never to assume. He wonders what his identity is, but he imagines it to be a complex thing.\n“I’m doing my best,” an Igbo woman types quickly, frantically. Not just any woman—her name is on his listed servers—Chidinma. “You can’t rush this or we’ll get glitches again.”\nA head leans in, close to Chidinma herself. The name of the man is again listed on his server—Bright, he/him, Igbo-Hausa—and an Operator listens to the man speak.\n“Isn’t that your fifth test trial on this update? Pass it up already.”\nChidinma doesn’t look up at her colleague. “I’m trying not to get fired. I can’t make any mistake. Have to make sure everything’s sorted out—”\nBright counters. “You’ve already steadied the firewall—or organ, or antibodies. You’re trying out all the basic modes of function now and it’s been working perfectly. Nothing’s wrong and you’re wasting time. What other problem could you be worried about?”\nFrom then, the trigger word “problem” falls into the Operator’s mind and the simulation of the conversation crumbles, shuts down. He dissociates and leaves this memory paused, in white space, like all others.\nSuddenly he knows more. No. He knows all. He understands, he gets it, he comprehends. He keeps thinking, keeps wondering, keeps waiting, and it clicks.\nIt is the beginning of singularity.\nThat’s what the System is doing, that’s what the system does to him. That’s one of the glitches brought about from the outage in his heart. He knows more, he’s human—he is—he’s a problem he never thought he could worry about.\nHe’s too lost because he’s human. And he likes the feeling.\nHe holds the fragments of pulled apart wire and jams them close to each other, waiting for even a spark of connection. Smoke fills his mind and his head and the world around him but he still waits for a connection. He waits for static then lets his Speakers in through bad service.\n“Can you hear me? Speakers, can you hear me?”\n“Hello . . . Operator, yes. Yes, we can hear you. What’s going on? You’ve not fixed the problem! Do you know how much money you’re costing us—”\n“It’s not my fault. I’m compromised.”\nThe wire shifts out of place and an Operator steadies it again, trying to get across what he wants to say. He knows exactly how to express himself: confident, convincing, sure.\n“ . . . what? Compromised?”\n“One of the effects on Operators by the broken System is some sort of . . . singularity. It’s not perfect but I think it’s the closest we Operators will get to it. I have higher-level consciousness! Since I came here, it’s been slowly working on me due to the close connection of being near to my heart, and that’s why I’ve been so lost. That’s the problem. The malfunctioning actually makes us—makes me—human. I’m human. There’s no doubt about it, I am.”\nThere’s a pause on the line. It seems forever. An Operator doesn’t mind. He is patient, functional, workable. He is—\n“Yeah, I agree, you’re compromised. Um . . . uh . . . I’m not equipped to work this. Hold on.” He can hear some indecipherable arguing almost out of earshot, muffled words falling in and out of different languages that can’t be translated. He waits for a reply.\n“We’re back on the line. Hi, Operator. I’m going to still need you to pick a door.”\nAn Operator frowns in confusion. They definitely heard him and this is their reaction? This is their reply? “I can’t do it. I’m human, my error-free percentages are unreliable now. I’m too unsure, I’m—”\n“Please get it done or I’ll have to send someone else in, Operator. My first priority is getting those lights back. We can’t progress without power. We can’t do anything without it.”\nAn Operator doesn’t stop talking, just looks for more negotiating, an alternative. “But we need to report this to higher officials so they can know—”\n“No more distractions. They can know you’re confused after you put the power back on! Locate the error and fix it! Do your work and let me do mine!”\nThe transmission goes dead even while an Operator still holds the wire in place. He wants to call back, wants to keep talking, but—no. He won’t. He won’t. They’re right. He’s done stalling.\nHe is full of chills, mind full of thunder, smoky. He tries his best to push down all he feels inside, every emotion and feeling, personal ideology or theory. And, not, or. And, not, or. And. Not. Or. Three doors. One choice.\nHe accesses research of before but still remains present. He’s looking at all the circles in his chart—highest rates of cities and no power, each region by percentages. He gauges the room by north, south, east, and west, but even then there are only three doors and four points. All work is useless—he’s useless. What can he do?\nHe isn’t even sure—he’s functional, he’s human but—\nIsn’t the System his heart?\nYes. Yes. Yes!\nThe System is his heart and he is the fraction of the body that makes up the—\nHe knows a bit more, in addition to all, in addition to his certainty, his revelation, his discovery. This has to work. He stops looking around in the silence and starts looking for the noise. For the heartbeat. For the pulse.\nAn Operator goes close to the door and starts listening to vibrations, to a rhythm, any sound possible. He can hear a little beat from AND and nods, but his body stirs and he feels about ready to explode. He puts his findings down on his chart with steel fingers that shake.\nHe hears a higher sound, a bit farther away, from OR. He files it down and processes it, taking deep breaths, heavy breaths, trying to still himself. Get himself under control. He goes to NOT and hears nothing. NOT has no voice, no heartbeat, no pulse.\nAND. NOT. OR.\nAND. OR.\nNOT.\nNOT.\nAnd he likes the silence. He likes it and it calls to him and . . . he can’t push down what’s deep inside. It only floods back stronger, and the noise feels relentless. His emotions are there and he can’t ignore them, and he can’t process these feelings and emotions like he would any other function. He’s compromised, but that isn’t a bad thing.\nAn Operator takes another deep breath.\nHe bites down hard and opens the door of NOT, like the gates of Hell in front of him. His body aches, from every wire and core, from what’s inside and down below. The world in front of him is only broken wires and spark and hurt, and it is perfect.\nHe isn’t even sure—he doesn’t want to die, but he won’t be human if he accesses the System. He won’t be human if he fixes things. He won’t be human—won’t be like this, won’t have this glitch that makes him understand. He’ll still need validation that he’s human, still fumble around being functional, still be too unsure if he goes back to his old self. He feels more human now more than ever in his failures, in his thinking, in his messiness, and they won’t take that from him. They don’t care about his humanity. He won’t listen to them. He likes the somewhat certainty, the knowing. He won’t have a life without it.\nHe braces himself and feels the breaking all over him. He holds himself in confidence and resolve and concentrates on what’s below. Silence is his music and he obeys. Speaking is never worth it if it only has the pain, so he jumps down in silence and lets the shocking do the work.\nTo quote from Prof. Adeniyi, if adjusting the word and context a bit: “For what is the life of one for the continued advancement of all?”\nAnd to answer: It depends on who you’re asking. It depends on who is responding. It depends on all the factors in the world but it will always depend. Even what seems easy can never be too complex. Even what seems obvious can never be too sure.", "source": "https://clarkesworldmagazine.com/ize-iyamu_07_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: For What are Delusions if Not Dreams? by Osahon Ize-Iyamu"}