{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jay Lake", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "4BkxTdS/hg61AzF4G/ewq2Sd8ao=", "id": null, "license": null, "comments": "", "raw_text": "6980 words, short story  An Exile of the Heart  What do you want, you little handgrips? I ain’t told you enough stories yet? There’s school enough in the comps and nets to make you all perfessers of some damned thing or another.  But yeah. You’re right. History’s a lie. Well, maybe not so much a lie as one or another person’s way of looking at the truth. Anybody tells you they ain’t got no agenda, they’re just bending the lines to look straight from their chair. Best advice I got is don’t believe nothing you ever get told.  But yeah, I’ll tell you this one story. It kind of accounts for all the rest, if you know what I mean. And if you don’t know what I mean, well, listen up. Maybe you will. Once I’m done.  Cleone Station was old. It rode the L1 point between Earth and Luna, millions of tons of refined regolith and boosted homeworld exotics hammered into a space station with sufficient power and majesty to control high orbit and the Earth-Luna trade. It spun as all stations must, maintaining sufficient semblance of gravity for human survival. Pregnancy, childbirth, healing and old age all required gee force. No amount of gengineering by the Biomistresses of the great stations could circumvent that inescapable evolutionary fact.  Trieste Maria Kaolung Delgado-Richter de Cleone, Heiress-Apparent of Cleone Station and sole child of her mother Stationmistress Grace, raced through the ten percent ring. She liked it down near the core where few people bothered to go. Her tutor Gouvernaile had been pestering her for an analysis of Marshall Kutuzov’s tactics at Borodino, and she simply wasn’t interested.  Exercising her fighting skills was a lot more fun than focusing on history. Her arms and legs had finally grown into themselves since she’d turned sixteen. Trieste could move for the sheer joy of the machine her body was becoming.  She’d set herself to racing along the eleven-hundred meter axis of Cleone in a sort of real-world obstacle course. Her route was circuitous enough to send her through most of the different structures the station’s engineering had to offer.  Gouvernaile straggled after her far behind. Years in low gravity had slowed him too much. Guilt briefly panged Trieste, then there was a confluence of cold air return ducts to dive between.  She tumbled out moments later in the blue zone near the vacuum-rated pressure doors of frame one hundred and forty. The main companionway was two meters wide and tall there, rated for equipment movement. Plenty of room of bounce and roll. Trieste checked her wrist strip and grinned—she was almost six seconds ahead of her best time for the route.  Someone grabbed her arm.  Trieste’s own momentum swung her in a short, sharp arc against the bulkhead. She slammed hard into the exposed metal. A big body pushed against her, breath hot against her ear.  “Think you’re cute, do you?”  Shocked, at first Trieste did not fight back. The idea that anyone on Cleone would touch her without permission was so far beyond comprehension—  Intruder!  A hand pushed upward between her body and the bulkhead, grabbing for her breast. Trieste had never been so glad for her small, boyish chest as at that moment.  “The old man won’t help you now,” growled her attacker.  Trieste found her training and jammed her right elbow into her attacker’s ribs. She pushed off with his pained recoil, kicking off from the bulkhead to bounce away from him. Her left hand bent at his fingers until his grip broke. He held on longer than she’d intended, and Trieste found herself in the middle of the wide corridor moving with agonizing slowness in the reduced gravity.  Then she got a good look at her attacker. Overmuscled and already going to fat, with the bristly hair of someone too long out of a pressure suit. Green eyes, flat face, dirty gold hair.  Recognition set it even here, badly out of context. It was her step-father.  “Philip?”  “Shouldn’t have seen my face, girlie,” he said, drawing a needle-gun. The weapon was essentially a tight-spread high velocity variant of the common flechette pistol. Still not powerful enough to punch through vacuum-rated bulkheads, it fired a narrow stream of needles at short distances that were excellent at punching through human bodies.  The weapon of a murderer. Or an assassin.  Her feet found the floor. The friction-textured surface gave Trieste purchase. She watched Philip’s eyes, not his weapon. The needler would fire where he was looking.  Philip was looking past her.  Trieste dropped and rolled toward him, pushing with the sinuous flex required for low-gee combat. She aimed for his knees—the weakest critical joint.  “Hold!” shouted Gouvernaile.  Her tutor might have been too damned old for a bodyguard, but he’d once commanded troops in open air down the gravity well. His voice carried even through her rage. She went flat, twisting until she could watch both directions along the companionway with only slight movements of her head.  Gouvernaile had his own flechette pistol braced in two hands and was advancing on Philip in a stable low-gee lope. “Weapon down, Consort,” her tutor said in a quieter version of that same commanding voice.  Trieste shifted her gaze. Philip was backing, bouncing too high with each step. The needler was in his hand but she could see fear in his eyes. “A mistake, Gouvernaile. Nothing more than a game gone wrong.”  She watched Philip’s face. That she didn’t try to meet Gouvernaile’s eye would tell the old man everything he needed to know.  “You cannot kill us both.” Gouvernaile sounded almost like he was tutoring right then, interested in how his student would work their way out of a particularly difficult problem. “But you cannot afford to have us carry this tale to the Stationmistress or the senior crew.”  “Keep your mouths shut, nothing’ll happen to either of you,” Philip answered. The quaver in his voice gave the lie to his words.  Then he turned and ran, still bouncing too high in the ten percent gravity. Trieste followed her step-father’s path until he vanished beyond the hatch at frame one forty-five.  “No troubles, I trust,” said Gouvernaile behind her.  “I wish to speak to my mother.”  “That might be wise.”  Trieste stood at attention in station ops up on the seventy percent ring. The Stationmistress and two of her senior crew stared back at Trieste while the dozen or so techs on duty kept their heads down and their ears open. Gouvernaile waited close by with his hand upon the worn butt of his flechette pistol.  “I will not hear you speak against your father so.” The Stationmistress’ voice was as cold as a cargo airlock. Grace had been a famous beauty in her youth, the toast of New York, Shanghai and Luna City before marrying into orbital royalty. Years in the partial-gee of spinning habitats had not aged her well. In the face of Trieste’s persistent emotional awkwardness and lack of interest in high culture, her mother’s hopes for a new era of social triumph had faded along with her beauty.  Trieste would rather have her fingers broken fighting in the low-gee dojo than attend any party ever thrown.  “My father is lost to us,” Trieste told her mother. “The man you married last year tried to lay his hands on me. When I refused him, he tried to kill me.”  “She speaks truly, Stationmistress,” echoed Gouvernaile.  Grace’s glare at the old man etched her words with acid. “I have not yet asked for the testimony of servants.” She returned her gaze to Trieste. “I rule here, daughter. Justice on Cleone belongs to me and me alone. That you should carry tales against the Consort Philip is a serious offense to my dignity.”  One her senior crew, Doctor Morgenthau, stirred uncomfortably.  “Assault upon the person of your heiress-apparent is a serious offense to your dignity. Mother.”  Grace’s eyes narrowed as she made a showy sigh. “You are at an impossible age. I herewith banish you from Cleone Station for a year and day. Perhaps your Uncle Marcus will grant you asylum on Truro Station.”  “I . . . ” Trieste had not imagined her life would come to this, so suddenly. Tears stung her eyes as she fought to keep them from her cheeks. She knelt on the deck. “Mother, I—”  Grace interrupted her. “And take your servant with you. He has outlived his usefulness here on Cleone.” The Stationmistress turned away from her daughter and drew her advisors into close conversation.  Trieste stayed kneeling, staring at the worn carpet until Gouvernaile tugged her elbow. “Come away with me now, mistress.”  “We’re staying locked down and out of trouble, damn it.” Gouvernaile glared at the security feeds floating in projected windows before his face. Trieste watched in turn with fond worry as the old man ran fingers through his thinning hair, then flicked away a status display from the insubstantial array. “Your mother will never forgive me,” her tutor-bodyguard continued.  Trieste stretched on the tiny bunk, knees bent to fit herself in. Her Uncle Marcus being the Truro Stationmaster, Trieste and Gouvernaile had their own cabin complete with the supreme luxury of not being required to split the living space with alternate-shift hotbunkers.  “Gouve, this isn’t right.” They had fled Cleone Station only to land in a greater security crisis. She practically quivered with frustration. “I’m certified for stationside and zero-gee combat. Holing up in this coffin waiting to see if Uncle Marcus’s security can trump Brigante’s is just nuts. We should be doing something.”  Gouvernaile recascaded his data windows. “What we should be doing is staying alive. Brigante has sent someone who can slip the security nets like a lunar ice-jumper at middark. That assassin is either wired from here to Hellas Basin, or they’re a God-damn psychic. You’re a lot more use as a live heir to Cleone’s Stationmistress than as a dead redshirt.”  An audible alarm chittered with a low fractal noise. “What’s—” Trieste began as the cabin lights flickered out. Their room became space-quiet, not even the click-wheeze of emergency blowers. “That’s torn it,” she whispered as she slipped out of the bunk. “I’m going to run this guy down.”  “Tri,” said Gouvernaile quietly. He sighed. “I can’t stop you from going out there. But be careful. This bastard’s invisible. Maybe in every sense of the word.”  “Mmm.” Working by feel, Trieste slid her combat knife from her ready bag, dialed it up to maximum sharpness, grabbed the crash bars by the cabin hatch and scrambled up the wall so she was at the top of the doorway. Muscles strained against Truro’s ought point eight gee pull as Trieste reached down and yanked the panic lever. The hatch groaned open to the hiss of the reserve pressure cylinder.  The corridor was as dark and silent as the cabin. Stealth lost in the noise of the opened hatch, Trieste dropped and spun so her body exited well above the level of an ordinary person’s stride. Nothing moved outside, no combat trip-sensors flashed.  She struck the opposite wall of the corridor, tucked into a roll, and found her footing three meters away from her own cabin. The darkness remained still as Trieste wished mightily for optic enhancements.  Was an invisible man any harder to hunt in the dark?  Trieste scuttled toward the bulkhead dividing this frame of Truro Station from the next frame spinward. She fetched up next to the sealed vacuum door. It must have closed with the power failure. Trieste popped open the control panel. The dim bioluminescence of the unpowered failsafe readouts indicated both pressure and power in the next frame.  Wrong way, she thought.  She turned, bouncing to the other side of the corridor as a faint breeze touched her cheek. Behind her, something rattled against the bulkhead like pebbles in a sample case. Flechettes, coming from up the corridor. In her current position she was good as dead, so she sprinted antispinward toward the shooter with her head tucked down and combat knife held forward—a meat-powered missile.  The next round of flechettes tore into Trieste’s left arm, shoulder and chest, enough to hurt like hell but not to stop her run. “Damn,” she hissed, a bad loss of control as her voice would give another aiming point. The invisible man had to be dead ahead in order to shoot just off-center to Trieste’s body in the narrow corridor. If the attacker had been offset to the left, the flechettes would have struck closer to Trieste’s center of mass. And the bastard had to be within the station’s curvature.  Imagining her opponent stepped to one side to avoid her plunging charge, Trieste swerved sharply to her own left, back across the corridor. Another flight of flechettes breezed past her face as the tip of her combat knife caught on something with a shower of blue sparks. A man-shaped figured flared blue in the darkness, limned in bright netting. Then the fight was close and personal.  Trieste pushed the knife, twisting the blade and turning her body to slam into the enemy’s right side. Long hours of training blended with sharp fear to produce her tactics. She desperately wanted to pin the flechette pistol against the assassin’s body. She had to keep the weapon from gutting her where she stood. As she slammed to the left, the combat knife snagged on something stiff, snapping the blade tip. Then Trieste found the smooth ceramic bell of the flechette muzzle at her throat.  The two of them paused like lovers just before climax. The enemy’s breath was hot on Trieste’s cheek, the muzzle chilly against her throat. Trieste in turn hugged her enemy with her left arm, knife in her right hand laid flat against the other’s chest. A few blue sparks erupted from the enemy’s wounded shoulder. An electronic suit, Trieste realized in a sudden burst of irrelevancy, stealthy to oblivious station sensors. She slid the broken knife upward toward the other’s throat.  “Trieste, exiled heiress of Cleone Station,” said the enemy in a quiet voice. He was male. “You are not my quarry.”  “Still you sought my life,” whispered Trieste. She continued to move the knife as slowly as she could.  “You exited your cabin into my fire zone. Now drop your knife and step away, and I will not kill you.”  “But you . . . ” Trieste began with a whine even as she arched her spine back as far as she could to bring her head away from the flechette muzzle. She grabbing at the enemy’s weapon with her wounded left hand while stabbing upward with the combat knife.  Flechettes rattled against the ceiling to ricochet along the corridor. The enemy groaned and slid down Trieste’s knife. His lifeblood poured across her arm. The corridor lights flickered back on to show a matching pool of blood leaking from the open hatch of the cabin where she had left Gouvernaile behind.  Trieste dropped her kill and leapt for her cabin. The sight of Gouvernaile’s shredded face and chest sucked the air from lungs. She stood balanced on the edge of that airless scream of grief and rage until it seemed her heart would burst.  I know there ain’t been no kissing yet, but listen up. You cop those flechettes infected Trieste with a virus slotted spot-on for her Uncle Marcus, right? Trieste’s genome was tight enough to her Uncle’s to crash her immune system but loose enough not to de-rez on the spot.  Marcus shut down that war between Truro and Brigante, bargaining hard for the right proper treatment for his niece. Along with a bunch of other concessions he had to give himself up to a marriage alliance to buy Trieste’s life back. You might reckon both sides wanted an excuse to stop killing each other. She was a good one.  Cleone’s heiress, she was packed up and shipped off to Brigante Station to meet their Biomistress—the only one who could undo what the virus had done. Trieste brought with her the corpse of Morholt the assassin in trade for Marcus’s new bride. The plan was for Trieste to escort the young woman back once she’d been recovered. A motivational thing, you might say. Such a trade, a moldy old assassin for an orbital princess.  Yep. Now we’re getting closer to the kiss.  Aixelle was a beauty by the standards of any age. She had hair to her waist—an obscene luxury in a place and time where everyone shaved their scalps to fit pressure suits. That hair was the color of sunlight to accent the dancing water of her eyes. Her long fingers had never borne a callus.  In addition to being Marcus’s betrothed, she was Biomistress of Brigante Station.  With her servants, Aixelle met Trieste’s shuttle as it docked at cradle seventeen-B in Brigante’s highest security zone. Trieste was debarked into the echoing cargo bay strapped to a zero-gee biocontainment gurney. She lay there and stared at the girdered ceiling, wondering how the Brigantes could afford the cubage. Behind her Morholt’s corpse trundled along in a cryogenic chamber. The assassin had been stripped of his electronic stealth suit but otherwise undisturbed in death, even to the sprayed blood frosted upon his neck and shoulder.  “Well,” Aixelle said as she leaned over Trieste, steadying herself with one hand on the rail of the gurney. Her long hair eclipsed the ceiling lights of cargo bay in billowing clouds of gold. Her stationsuit was closed high on her neck. “So you are the hero of Brigante Station, come to carry me home to Truro.”  Her mind fogged with drugs and bioengineered disease, Trieste struggled for words. “Marcus . . . Stationmaster . . . ” No one had warned her of this girl. Trieste’s heart was stricken by this woman’s beauty, jealous that Aixelle should be the province of another. Even her own beloved uncle.  Love should not be like this, she thought in a moment of clarity. It had come upon her as another plague.  Aixelle glanced away from Trieste toward Morholt’s cryochamber. “You voyage for life and for death. Let us see if we can repair you.”  It was, after all, Aixelle’s DNA sequencers that had brought Trieste to this weak stead in the first place.  The next time Trieste was sufficiently conscious to recognize the Biomistress, Aixelle walked into the single-bed isolation ward with a datapanel under one arm and a crooked smile on her face. She wore a loose robe suitable for the rotational-gee sections of Brigante Station. A dull pendant dangled from a silver chain to rest upon her chest. Her hair was pulled tight, woven with black ribbons of mourning for Morholt.  Aixelle was still the most beautiful woman Trieste had ever seen. She opened her mouth, struggling for words.  “It’s been almost a week,” Aixelle said before Trieste could find her voice. “Our tailored virophage has been effective, but reversing the immune damage is taking a while.”  Trieste struggled to remember that it was this woman’s work that had rendered her ill in the first place. The inner battle was lost in the glow of Aixelle’s smile. “And now . . . now I am whole once again,” Trieste said as she found her voice, “only to find my heart pierced anew.”  Aixelle thumbed her patient’s eyelid up, leaning in close to examine her handiwork. “Don’t be an idiot. I am betrothed to your uncle as part of the settlement between Brigante and Truro. A union of the Lagrange stations, to our mutual economic and social benefit.” She giggled, an unfolding of her stern character that Trieste found even further entrancing. “They’re already in a panic at Luna City.”  “As well they should be,” Trieste muttered, all too conscious of the Biomistress’s sweet breath playing on her neck and face. Gouvernaile, she told herself, remember Gouvernaile. Her lifelong companion’s heart had been shredded by the flechettes—a double weapon, murderous in their direct effect as well as infectious with the Biomistress’s virus.  The same virus that had almost killed her.  Aixelle stroked Trieste’s cheek. “Another few watches in here, then you can present your credentials to my father, Stationmaster Angevine. There will be some days of the obligatory cocktail parties and media events. After that you may plan our escape.”  Despite the blood that stood between them, Trieste’s heart was lost for good. She watched Aixelle leave the tiny clinic, taking all light and warmth with her.  Trieste had tugged an exam stool up next to her sickbed. Her gear bag was open as she sorted through what had been so hastily packed back on Station Truro. It was an odd lot: a holo of her dead father, two of Gouvernaile’s study plans on a datacube, portions of her fighting gear—including the damaged combat knife. She turned it in her hand, careful to keep the reprogrammable molecular matrix of the blade set to the default non-conductive steel.  The hatch hissed open. Aixelle stepped in. The Biomistress still kept her hair in mourning ribbons but had chosen to wear a brighter robe today. It only accented her beauty, which panged Trieste’s heart.  She smiled as Aixelle stepped forward to take the knife from her hands. Trieste let the other woman have it, knowing she was as safe as she might be in this place. A damaged knife would not be the instrument of Trieste’s death should Stationmaster Angevine decide to do away with her.  Aixelle turned the combat knife over in her hands. Some strange, complex expression flitted across her face. “Is this yours?” Her tone was casual but her voice trembled.  “Yes.” Trieste flooded with pride. “I earned it in advanced combat training when I was fourteen.”  “And did you break the tip? Or did someone break it for you?”  Oh no. Trieste’s heart sank toward cold oblivion. Still, she could be nothing but honest with this woman. “I broke it.”  Aixelle removed her pendant from her neck and matched the dull metal of ornament with the tip of Trieste’s knife. “I took this out of Morholt during our autopsy. He was like a brother to me. My great, good friend.”  Trieste caught Aixelle’s eye and stared into the wounded heart of her beloved. “I am sorry for your pain but I cannot regret your loss.” Her words were like the blow of another knife, another slaying of love. But Trieste could not spare them. “Your great, good friend killed my own greatest friend during his invasion of Truro Station. He would have killed me too, had I not fought well.”  The dancing water of Aixelle’s eyes froze to ice. She tapped the broken tip of the combat knife against Trieste’s neck, then pressed it until Trieste felt pain. Warm blood trickled down her chest. Aixelle held the pressure against her patient’s neck as Trieste waited unmoving to learn the Biomistress’s will. Out of love, Trieste refused to close her eyes.  “Perhaps you should rest until your return to Truro Station,” Aixelle finally said. Putting away her chain with the bloody metal shard, she dropped Trieste’s knife on the deck, a fine spray of blood fanning away from it. “There are many accidents for the unlucky and unwell here on Brigante Station.”  Listen up, you little datafreaks. Trieste and Aixelle aren’t no closer to kissing yet than when they first met. Trieste could be the greatest warrior of her age, and Aixelle’s got the beauty of an empress and all the powers of a Biomistress besides, but they’re acting like a couple of kids from the recycling yards. You think you’ve got crap to fight over? The life and death of thousands rested on these two.  Branwen, Aixelle’s lab manager, stitched up another special virus with the help of Aixelle’s mother, she who had been Biomistress before Aixelle. This little bug kicked off a series of endorphin cascades linked to a targeted pheromone signature present in someone else infected with the same vector. What you might call a love potion. Branwen wanted to make life easier for Aixelle in her marriage to Stationmaster Marcus. Let them come together for politics but live for love.  With families like this, who needs enemies?  They shipped for home in Stationmaster Angevine’s personal shuttle, the Adsiltia. Trieste had not seen Aixelle in two weeks. She was trapped between stomach-wrenching nerves and icy regret. For all her youth, Trieste was not yet accustomed to such wild vacillations of the heart. She was placed aboard in advance by Brigante Station Security, then sat alone in the passenger compartment until Aixelle arrived accompanied by Branwen and two more security troopers—the Biomistress’s personal guard as allotted by the betrothal contract.  Aixelle’s hair was loose again, waving free in the low gee of the shuttle. She wore a bodysuit of blue spidersilk, thin as air and twice as soft. She still wore the pendant made from the tip of Trieste’s combat knife. The troopers brought a small, heavy case with them. It was more than simple luggage.  “Biomistress Aixelle,” said Trieste with a tight nod.  “Citizen Trieste,” her beloved replied crisply, sweeping her hair over one shoulder to claim the crash couch farthest back from Trieste’s. Aixelle’s troopers secured their case at the back of the passenger cabin, then sat between Aixelle and Trieste. Branwen glanced at her mistress before she strapped in next to Trieste.  Trieste felt a pain in her heart as cold and hard as a vacuum leak.  Without announcement, the pilots undocked the shuttle for the forty-two hour transit from Brigante Station to Truro Station.  “She’s torn,” Branwen whispered after a few hours. The woman didn’t turn her head to look at Trieste.  The cabin was darkened for sleeping. Someone behind Trieste was using a holo—the blue glow flickered against the padded wall in front of her. She assumed it was Aixelle, as it was difficult to imagine either of the troopers going off into virtspace while Trieste herself was present in a confined area with them and their Biomistress.  Hope flared in Trieste’s heart. “We all face difficulties,” she told Branwen.  “There’s more here than meets the eye.”  Despite herself Trieste’s curiosity was piqued. She didn’t know if she was being baited, however, so she kept her own counsel. “When is there not?”  “The LaGrange Stationmasters plot against one another, but together they craft larger plots against Luna City and the groundside governments. Lately the affairs have turned yet again.”  This smacked of Gouvernaile’s lessons. “Like Greeks and Trojans, endlessly warring.”  Branwen was silent for while. Eventually, Trieste heard the faint smack of her lips parting as she spoke again. “Did you wonder what Morholt was doing on Truro Station?”  “Yes. Just before I killed him he said I was not his target. Yet he slew my tutor.”  “Cleone Station transferred technology to Truro Station. Your tutor was the carrier. Your trip into exile was cover. Morholt was after that tech on behalf of Brigante.”  “My step-mother tried to have me—” Trieste stopped.  Branwen’s laugh was soft. “She didn’t succeed, did she?”  Trieste thought furiously. Love and betrayal were the stuff of stories, not her life. When had it become so complicated? “Why tell me this now?”  “Mistakes are being made as we talk,” Branwen said. “Alliances shifting, both among the stations and with respect to larger players. You and Aixelle can perhaps see a clear course to the end. You are not so caught up in prior generations of cis-Lunar politics.” She took Trieste’s hand for a moment, then Trieste felt a prickle on her palm.  “Hey—” Trieste started to say, but Branwen covered her mouth with a hand.  “You will thank me for this,” the other woman said. She then unbuckled from her seat and moved back through the dark cabin. Trieste stared at her hand, touching the faint spot of fading pain where Branwen had infected her with . . . what?  Hope, perhaps.  Trieste awoke with a start, briefly disoriented and scrabbling for her weapons. She remembered where she was. Then she realized that Aixelle’s fingers enclosed hers. The cabin lights were still dimmed. The Biomistress leaned close to Trieste, her long hair brushing Trieste’s cheek and arm, her shadowed bluewater eyes gleaming like Luna’s darkside sky.  “Trieste,” Aixelle said softly, “I have wronged you.”  The warmth of Aixelle’s breath upon Trieste’s face, the cool pressure of her fingers, the soft brush of her hair, through all of these things Aixelle drew them together. It was if Trieste dove into the pools of her eyes, flew into the cloud of her hair, landed in the bays of her heart. She scarcely dared speak, for fear of shattering the moment, but she felt she must. “It is no matter, my lady.”  “There are pressures upon both our peoples.” One hand stroked Trieste’s face, tracing the line of her lips. “I let my own troubles lead me into harsh judgment.” Aixelle sighed. “No. Misjudgment.”  Trieste’s entire body coiled tight. Her breasts ached to be touched and her groin flooded with warmth. Beaded sweat caused her neck to itch. She was too close to her heart’s desire. “My lady Biomistress, you are betrothed to my uncle, Stationmaster Marcus.”  Aixelle leaned forward and they kissed. All thoughts of family and duty fled Trieste’s head like oxygen from a breached cylinder.  There was only Aixelle.  See, I told you there would be a kiss. What did it mean the first time you kissed someone? Did the fate of stations rest on your fidelity? Were you selling out your family and your home? Not to mention a hot tech transfer.  Did you ever think our whole existence was built on a single kiss? There’s more to it. But it was a kiss that started it all.  The wedding had been riotous. Stationmaster Marcus held it in maintenance bay “A”—the largest open cubage in Truro Station—under microgravity. Trieste stared as Marcus led Aixelle away through the crowds rotating around the happy couple in a constellation of intoxicated goodwill. Her angry jealously raised goose pimples on her arms as her knife hand shivered.  “Fear not, my lady,” whispered Branwen, approaching Trieste’s elbow through a cloud of confetti. “Your love will be upheld.”  “I thank you for the good will, Mistress Branwen,” said Trieste, “but that can never be.” She reached for what was right. “I cannot give loyal service to my uncle and my heart to my beloved in the same breath.”  Branwen’s lips brushed Trieste’s earlobe, breath hot in her ear. “We all wear masks, beloved.”  Startled, Trieste whirled. She knocked herself into a slow rotation from which Branwen steadied her. Or was it Branwen? Trieste studied the other woman’s face. The line of her cheekbones, the set of her chin, somehow it was all familiar. “Aixelle,” Trieste finally said, “ . . . but how?”  Her beloved smiled. Radiant glory piercing Trieste’s heart. “To a Biomistress many things are possible. Pheromones, the shift of muscles in response to pinpoint injections of toxins. Humans are easy to fool. Our little tricks do not work so well for machine recognition systems. But in the drunken dark, well, Stationmaster Marcus will find my Branwen much to his taste.”  “And what will I find?” Trieste asked.  “Catch me and see,” Aixelle laughed, kicking away to spin into a cloud of confetti.  Shouting, Trieste dove after her.  Days later they tumbled in orbit in a slice of time stolen from marriage and duty, crowded close together into one of Truro Station’s vacuum hoppers. Aixelle grinned up at Trieste from where she knelt before a series of linked titanium boxes. Electrostatic clingpads kept the Biomistress secured to the floor. A two-meter long pole bulgy with electronics lay beside the boxes. It all had the look of a prototype—taped-off electrical leads, data antennae soldered in odd places, ragged edges to the milling of the metal.  “What is that?” Trieste clung to her crash couch to keep herself from floating away in the microgravity.  “Watch and see.”  The little vacuum hoppers were used for exterior maintenance, chasing down lost loads—or spacewalkers. All in all, general duties that required limited duration excursions. Every eighty seconds with the period of their rotation the station glinted perhaps a hundred kilometers from them in the main viewport of the tiny pressurized cabin. Data ghosts across the viewport glazing charted distances, vectors, dynamically scaled energy budgets.  “I’m watching,” said Trieste, “but what am I seeing?”  “This.” Aixelle flipped a switch.  Suddenly they were in full gravity. Trieste was jammed against one side of the crash couch as if the vacuum hopper were pulling a tight turn. Aixelle slumped against the floor smiling.  “God in Orbit,” Trieste said, savoring the sensation. “Artificial gravity.”  “What Gouvernaile was working on. Along with some of Marcus’s people, in competition with Brigante’s teams.” Aixelle frowned. “What Morholt was sent to take before father and Marcus came to their senses and joined forces. I brought the last critical systems from Brigante Station’s own lines of research with me to the wedding. Bride gift.”  Of course, thought Trieste. The precious case the guards had carried. “The stations will control the solar system,” she said. Political strategies unfolded in her head like an inflating pressure suit. “Luna and the dirtside interests will be left behind forever if this can be delivered significantly ahead of their efforts. How close is the competitive research?”  Aixelle shrugged. “We’ve gotten it first. This is everything . . . a weapon, a mode of travel, freedom to have children and grow old in orbit without bone loss and muscle atrophy.”  Trieste gathered Aixelle into her arms, both of them leaning against the slightly out-of-true plane of artificial gravity. They shared a crushing kiss that sent shocks rippling down Trieste’s body. Fingers reaching for each other’s stationsuit closures, they bent to yet celebration of love and life.  Trieste woke to microgravity. She was loosely strapped into her crash couch. Aixelle must have turned off the generator. She scratched her head, then reached for her beloved while blinking sandy sleep away. Her hand found metal and plastic.  A pressure suit helmet.  “Aixelle?” Trieste coiled herself to spring into action.  Aixelle still slept, the vacuum hopper still tumbled, but there was a pressure suit helmet wedged between their seats.  “STATIONMASTER, TRURO” was stenciled above the faceplate.  It was Marcus’s helmet. Trieste’s uncle had been here. Found them. Discovered Aixelle’s betrayal.  How had that happened?  Trieste stabbed at the console until the little ship’s log came up. The Stationmaster’s personal vacuum hopper had docked on executive override, silencing all of Trieste’s alarms. The log didn’t say, but Trieste guessed Marcus had gassed their atmosphere, too. How else could she have slept through the docking?  Trieste glanced behind her. Aixelle’s artificial gravity units were still in place. Marcus had left them with all choices. All the betrayals lay in their hands. Trieste dug her knuckles into her eyes and wept a moment before turning to her own pressure suit racked by the airlock.  She could stay no more on Truro Station. Brigante was closed to her too, and Cleone as well. Trieste clipped a lock of Aixelle’s glorious hair and placed it next to her heart before sealing the pressure suit. She overrode the airlock alarms so that her beloved would sleep a little longer and left the secret of artificial gravity behind her. Trieste stepped out into an exile of the heart.  So what would you have done if you was her, spacebrain? Follow Trieste into vacuum? How much air you think that girl had on one little p-suit? Death by screw-up is more like it, to go for a long walk with short air.  You know the stories. The First Gravity War. The Second Gravity War. The Last Gravity War. What the Americans did to Cleone Station. What the other Stations did to Washington City in return. Where was Trieste in all this? Is she a hero in your bookstories?  Didn’t think so.  She got lucky, picked up by a ballistic hauler with a load of low-orbit wheat heading upward. Stupid git walked away from all the love and power in cis-Lunar space, changed her name to Diana and worked her way back to power in Luna City. Eventually she made general officer in their militia. She gamed the wars to make sure the Stations never lost too hard, and won when it counted. Even against her own side. She knew how to kick butt and take names, remember? Eventually Diana threw Luna City in with the Stations against Earth in The Last Gravity War. Then she married Prince Hektair of Luna City to seal the bargain.  Yeah, that Diana. Signed the Peace of Amsterdam on behalf of the Lunar governments, established the perpetual independence of trans-Lunar space. That would be us, kiddies, out here chasing rocks in the dark orbits between Mars and Jupiter, ice-diving around Saturn, all the other mischief our siblings and cousins get up to.  And it was all for a kiss. Trieste wouldn’t have gone into exile, undermined the Lunatics and defeated the Terrans if she’d just kept her lips off that girl Aixelle and stayed home on Truro Station like a good princess.  What happened to Diana after Amsterdam? Been doing research, ain’t you? Reached a dead end or twelve I expect. Just says she died, don’t it? There’s some stories don’t get written down, only passed from mouth to ear.  Listen up one more time, my pretty pets.  Diana, General-Governor of Luna City, greatest warrior of her age, was brought before her Prince-Consort Hektair in his bubble garden high up on the wall of Aristarchus Crater. He sat beneath the dome staring at the diamond stars, surrounded by the slow breathing of his plants. Quiet servants set the brakes on Diana’s gurney and withdrew. She stared at Hektair’s age-stubbled scalp through her oxygen mask and the needled haze of pain.  “Routine patrol,” he said to the vacuum-cold night outside. “Indeed?”  She could see the reflection of her Prince-Consort’s face on the glass, curved to a lengthy sadness. “Suppos’,” Diana slurred. “Earthis’ part’sans.”  “The wars are over now.” Hektair sighed. “Your allies’ gravity generators could put out the fire in the sun if need be. I understand it all now—why you betrayed Luna, why we switched sides, why millions died dirtside to make our point. Freedom for humankind to grow . . . outward.” He whirled from the window, tears gathering in his clouded brown eyes as his voice slurred to match hers in the roughness of his grief. “The only thing I don’t understand is why this happened to you. Now. When it’s all long over!”  Some things came in their own time. Some bullets were best stepped into instead of away from. She had become tired of living.  Diana’s hand crawled across her bandaged chest as if possessed of an intelligence of its own, seeking the spun-diamond locket she had worn since coming to Luna City six decades earlier. “ ‘stime,” she told her husband. I loved him, she told herself. Hektair had stood beside her through marriage and war, raised her sons and tended her hurts.  He loved her too. She knew that.  She pulled the spun-diamond locket out of the ruins of her pressure suit liner to thrust it at Hektair with a palsied hand. “Sh’can save me. Only her.”  Hektair took the locket from Diana, shaking with anger as his wife slipped into dreams of freefall and tumbling helmets and the voice of Stationmaster Marcus cautioning her of something upon which her life depended, if only she could make out exactly what he was saying.  An unmarked shuttle landed on the concrete pad of Executive Field—Diana’s private spaceport in the crowded heart of Aristarchus Crater. She floated, intubated and dying, within a column of warm saline solution in a tower room high above the crater floor. Her eyes were fixed on a virteo view of the landing pad. Silent med techs moved slowly about the room, exchanging worried glances.  Hektair swept in from the elevator. He was dressed in his most formal kilt and armored vest, as if to receive an Earthist delegation. He stood in front of Diana’s vat with his arms folded and stared at his wife as she watched the field below.  “Diana,” said Hektair. “You can hear me.”  She watched a boarding tube crawl out from a blast-hardened dome.  “Diana.” Her husband sighed. “Please look at me.”  He might have been weeping, but Diana concentrated on the landing field below.  Hektair tapped on the glass. “Stationmistress Aixelle would not come,” he whispered.  Diana closed her eyes. The monitors all flatlined.  “You’re dead, silly woman,” Aixelle whispered, drawing her long hair across the tender new skin of Diana’s face.  Diana opened her eyes. They were in a tiny cabin surrounded by machines, but all she saw was the waterblue eyes of Aixelle. “Am I?” she tried to say. She succeeded only in coughing dust and flecks of blood.  “Diana is dead,” Aixelle said, stroking her cheek. “Hektair will rule well enough in the General-Governor’s stead. As he was born to do. Trieste, on the other hand . . . well, her life is in balance. But not yet lost.”  “How?” Not ‘why,’ not after all the lost decades.  Aixelle laughed, the bells of her voice ringing through the years of Trieste’s memory. “All things are possible to one who is both a Biomistress and a Stationmistress.”  Where did they wind up? Who knows? Maybe a cometary orbit, to come back someday at our worst hour of need. Maybe a little ice mine on Europa where they finished out their days slurping algae soup and smiling toothlessly at each other.  Maybe Diana really was cremated like the bookstories say.  And maybe they’re just really old, living together out somewhere in the deep dark, teaching the lessons of history to kids who drop by to learn something.  Time to shove off now, helmet-head. I hear my wife calling.  The late Jay Lake was a highly talented and highly prolific writer who during his tragically short career seems to have managed to sell to nearly every market in the business, appearing with short work in Asimov's, Interzone, Tor.com, Clarkesworld, Strange Horizons, Aeon, Postscripts, Electric Velocipede, and many other markets, producing enough short fiction to fill five different collections: Greetings from Lake Wu, Green Grow the Rushes-Oh, American Sorrows, Dogs in the Moonlight, The Sky That Wraps, and, most recently, the posthumously released Last Plane from Heaven. Lake was also an acclaimed and prolific novelist, whose novels were Rocket Science, Trial of Flowers, Mainspring, Escapement, Green, Endurance, The Madness of Flowers, Pinon, and Kalimpura, as well as four chapbook novellas, Death of a Starship, The Baby Killers, The Specific Gravity of Grief, and Love in the Time of Metal and Flesh. He was the co-editor, with Deborah Layne, of the six-volume Polyphony anthology series, and also edited the anthologies All-Star Zeppelin Adventure Stories, with David Moles, Other Earths, with Nick Gevers, and Spicy Slipstream Stories, with Nick Mamatas. He won the John W. Campbell Award for Best New Writer in 2004. Lake died in 2014.", "text": "6980 words, short story\nAn Exile of the Heart\nWhat do you want, you little handgrips? I ain’t told you enough stories yet? There’s school enough in the comps and nets to make you all perfessers of some damned thing or another.\nBut yeah. You’re right. History’s a lie. Well, maybe not so much a lie as one or another person’s way of looking at the truth. Anybody tells you they ain’t got no agenda, they’re just bending the lines to look straight from their chair. Best advice I got is don’t believe nothing you ever get told.\nBut yeah, I’ll tell you this one story. It kind of accounts for all the rest, if you know what I mean. And if you don’t know what I mean, well, listen up. Maybe you will. Once I’m done.\nCleone Station was old. It rode the L1 point between Earth and Luna, millions of tons of refined regolith and boosted homeworld exotics hammered into a space station with sufficient power and majesty to control high orbit and the Earth-Luna trade. It spun as all stations must, maintaining sufficient semblance of gravity for human survival. Pregnancy, childbirth, healing and old age all required gee force. No amount of gengineering by the Biomistresses of the great stations could circumvent that inescapable evolutionary fact.\nTrieste Maria Kaolung Delgado-Richter de Cleone, Heiress-Apparent of Cleone Station and sole child of her mother Stationmistress Grace, raced through the ten percent ring. She liked it down near the core where few people bothered to go. Her tutor Gouvernaile had been pestering her for an analysis of Marshall Kutuzov’s tactics at Borodino, and she simply wasn’t interested.\nExercising her fighting skills was a lot more fun than focusing on history. Her arms and legs had finally grown into themselves since she’d turned sixteen. Trieste could move for the sheer joy of the machine her body was becoming.\nShe’d set herself to racing along the eleven-hundred meter axis of Cleone in a sort of real-world obstacle course. Her route was circuitous enough to send her through most of the different structures the station’s engineering had to offer.\nGouvernaile straggled after her far behind. Years in low gravity had slowed him too much. Guilt briefly panged Trieste, then there was a confluence of cold air return ducts to dive between.\nShe tumbled out moments later in the blue zone near the vacuum-rated pressure doors of frame one hundred and forty. The main companionway was two meters wide and tall there, rated for equipment movement. Plenty of room of bounce and roll. Trieste checked her wrist strip and grinned—she was almost six seconds ahead of her best time for the route.\nSomeone grabbed her arm.\nTrieste’s own momentum swung her in a short, sharp arc against the bulkhead. She slammed hard into the exposed metal. A big body pushed against her, breath hot against her ear.\n“Think you’re cute, do you?”\nShocked, at first Trieste did not fight back. The idea that anyone on Cleone would touch her without permission was so far beyond comprehension—\nIntruder!\nA hand pushed upward between her body and the bulkhead, grabbing for her breast. Trieste had never been so glad for her small, boyish chest as at that moment.\n“The old man won’t help you now,” growled her attacker.\nTrieste found her training and jammed her right elbow into her attacker’s ribs. She pushed off with his pained recoil, kicking off from the bulkhead to bounce away from him. Her left hand bent at his fingers until his grip broke. He held on longer than she’d intended, and Trieste found herself in the middle of the wide corridor moving with agonizing slowness in the reduced gravity.\nThen she got a good look at her attacker. Overmuscled and already going to fat, with the bristly hair of someone too long out of a pressure suit. Green eyes, flat face, dirty gold hair.\nRecognition set it even here, badly out of context. It was her step-father.\n“Philip?”\n“Shouldn’t have seen my face, girlie,” he said, drawing a needle-gun. The weapon was essentially a tight-spread high velocity variant of the common flechette pistol. Still not powerful enough to punch through vacuum-rated bulkheads, it fired a narrow stream of needles at short distances that were excellent at punching through human bodies.\nThe weapon of a murderer. Or an assassin.\nHer feet found the floor. The friction-textured surface gave Trieste purchase. She watched Philip’s eyes, not his weapon. The needler would fire where he was looking.\nPhilip was looking past her.\nTrieste dropped and rolled toward him, pushing with the sinuous flex required for low-gee combat. She aimed for his knees—the weakest critical joint.\n“Hold!” shouted Gouvernaile.\nHer tutor might have been too damned old for a bodyguard, but he’d once commanded troops in open air down the gravity well. His voice carried even through her rage. She went flat, twisting until she could watch both directions along the companionway with only slight movements of her head.\nGouvernaile had his own flechette pistol braced in two hands and was advancing on Philip in a stable low-gee lope. “Weapon down, Consort,” her tutor said in a quieter version of that same commanding voice.\nTrieste shifted her gaze. Philip was backing, bouncing too high with each step. The needler was in his hand but she could see fear in his eyes. “A mistake, Gouvernaile. Nothing more than a game gone wrong.”\nShe watched Philip’s face. That she didn’t try to meet Gouvernaile’s eye would tell the old man everything he needed to know.\n“You cannot kill us both.” Gouvernaile sounded almost like he was tutoring right then, interested in how his student would work their way out of a particularly difficult problem. “But you cannot afford to have us carry this tale to the Stationmistress or the senior crew.”\n“Keep your mouths shut, nothing’ll happen to either of you,” Philip answered. The quaver in his voice gave the lie to his words.\nThen he turned and ran, still bouncing too high in the ten percent gravity. Trieste followed her step-father’s path until he vanished beyond the hatch at frame one forty-five.\n“No troubles, I trust,” said Gouvernaile behind her.\n“I wish to speak to my mother.”\n“That might be wise.”\nTrieste stood at attention in station ops up on the seventy percent ring. The Stationmistress and two of her senior crew stared back at Trieste while the dozen or so techs on duty kept their heads down and their ears open. Gouvernaile waited close by with his hand upon the worn butt of his flechette pistol.\n“I will not hear you speak against your father so.” The Stationmistress’ voice was as cold as a cargo airlock. Grace had been a famous beauty in her youth, the toast of New York, Shanghai and Luna City before marrying into orbital royalty. Years in the partial-gee of spinning habitats had not aged her well. In the face of Trieste’s persistent emotional awkwardness and lack of interest in high culture, her mother’s hopes for a new era of social triumph had faded along with her beauty.\nTrieste would rather have her fingers broken fighting in the low-gee dojo than attend any party ever thrown.\n“My father is lost to us,” Trieste told her mother. “The man you married last year tried to lay his hands on me. When I refused him, he tried to kill me.”\n“She speaks truly, Stationmistress,” echoed Gouvernaile.\nGrace’s glare at the old man etched her words with acid. “I have not yet asked for the testimony of servants.” She returned her gaze to Trieste. “I rule here, daughter. Justice on Cleone belongs to me and me alone. That you should carry tales against the Consort Philip is a serious offense to my dignity.”\nOne her senior crew, Doctor Morgenthau, stirred uncomfortably.\n“Assault upon the person of your heiress-apparent is a serious offense to your dignity. Mother.”\nGrace’s eyes narrowed as she made a showy sigh. “You are at an impossible age. I herewith banish you from Cleone Station for a year and day. Perhaps your Uncle Marcus will grant you asylum on Truro Station.”\n“I . . . ” Trieste had not imagined her life would come to this, so suddenly. Tears stung her eyes as she fought to keep them from her cheeks. She knelt on the deck. “Mother, I—”\nGrace interrupted her. “And take your servant with you. He has outlived his usefulness here on Cleone.” The Stationmistress turned away from her daughter and drew her advisors into close conversation.\nTrieste stayed kneeling, staring at the worn carpet until Gouvernaile tugged her elbow. “Come away with me now, mistress.”\n“We’re staying locked down and out of trouble, damn it.” Gouvernaile glared at the security feeds floating in projected windows before his face. Trieste watched in turn with fond worry as the old man ran fingers through his thinning hair, then flicked away a status display from the insubstantial array. “Your mother will never forgive me,” her tutor-bodyguard continued.\nTrieste stretched on the tiny bunk, knees bent to fit herself in. Her Uncle Marcus being the Truro Stationmaster, Trieste and Gouvernaile had their own cabin complete with the supreme luxury of not being required to split the living space with alternate-shift hotbunkers.\n“Gouve, this isn’t right.” They had fled Cleone Station only to land in a greater security crisis. She practically quivered with frustration. “I’m certified for stationside and zero-gee combat. Holing up in this coffin waiting to see if Uncle Marcus’s security can trump Brigante’s is just nuts. We should be doing something.”\nGouvernaile recascaded his data windows. “What we should be doing is staying alive. Brigante has sent someone who can slip the security nets like a lunar ice-jumper at middark. That assassin is either wired from here to Hellas Basin, or they’re a God-damn psychic. You’re a lot more use as a live heir to Cleone’s Stationmistress than as a dead redshirt.”\nAn audible alarm chittered with a low fractal noise. “What’s—” Trieste began as the cabin lights flickered out. Their room became space-quiet, not even the click-wheeze of emergency blowers. “That’s torn it,” she whispered as she slipped out of the bunk. “I’m going to run this guy down.”\n“Tri,” said Gouvernaile quietly. He sighed. “I can’t stop you from going out there. But be careful. This bastard’s invisible. Maybe in every sense of the word.”\n“Mmm.” Working by feel, Trieste slid her combat knife from her ready bag, dialed it up to maximum sharpness, grabbed the crash bars by the cabin hatch and scrambled up the wall so she was at the top of the doorway. Muscles strained against Truro’s ought point eight gee pull as Trieste reached down and yanked the panic lever. The hatch groaned open to the hiss of the reserve pressure cylinder.\nThe corridor was as dark and silent as the cabin. Stealth lost in the noise of the opened hatch, Trieste dropped and spun so her body exited well above the level of an ordinary person’s stride. Nothing moved outside, no combat trip-sensors flashed.\nShe struck the opposite wall of the corridor, tucked into a roll, and found her footing three meters away from her own cabin. The darkness remained still as Trieste wished mightily for optic enhancements.\nWas an invisible man any harder to hunt in the dark?\nTrieste scuttled toward the bulkhead dividing this frame of Truro Station from the next frame spinward. She fetched up next to the sealed vacuum door. It must have closed with the power failure. Trieste popped open the control panel. The dim bioluminescence of the unpowered failsafe readouts indicated both pressure and power in the next frame.\nWrong way, she thought.\nShe turned, bouncing to the other side of the corridor as a faint breeze touched her cheek. Behind her, something rattled against the bulkhead like pebbles in a sample case. Flechettes, coming from up the corridor. In her current position she was good as dead, so she sprinted antispinward toward the shooter with her head tucked down and combat knife held forward—a meat-powered missile.\nThe next round of flechettes tore into Trieste’s left arm, shoulder and chest, enough to hurt like hell but not to stop her run. “Damn,” she hissed, a bad loss of control as her voice would give another aiming point. The invisible man had to be dead ahead in order to shoot just off-center to Trieste’s body in the narrow corridor. If the attacker had been offset to the left, the flechettes would have struck closer to Trieste’s center of mass. And the bastard had to be within the station’s curvature.\nImagining her opponent stepped to one side to avoid her plunging charge, Trieste swerved sharply to her own left, back across the corridor. Another flight of flechettes breezed past her face as the tip of her combat knife caught on something with a shower of blue sparks. A man-shaped figured flared blue in the darkness, limned in bright netting. Then the fight was close and personal.\nTrieste pushed the knife, twisting the blade and turning her body to slam into the enemy’s right side. Long hours of training blended with sharp fear to produce her tactics. She desperately wanted to pin the flechette pistol against the assassin’s body. She had to keep the weapon from gutting her where she stood. As she slammed to the left, the combat knife snagged on something stiff, snapping the blade tip. Then Trieste found the smooth ceramic bell of the flechette muzzle at her throat.\nThe two of them paused like lovers just before climax. The enemy’s breath was hot on Trieste’s cheek, the muzzle chilly against her throat. Trieste in turn hugged her enemy with her left arm, knife in her right hand laid flat against the other’s chest. A few blue sparks erupted from the enemy’s wounded shoulder. An electronic suit, Trieste realized in a sudden burst of irrelevancy, stealthy to oblivious station sensors. She slid the broken knife upward toward the other’s throat.\n“Trieste, exiled heiress of Cleone Station,” said the enemy in a quiet voice. He was male. “You are not my quarry.”\n“Still you sought my life,” whispered Trieste. She continued to move the knife as slowly as she could.\n“You exited your cabin into my fire zone. Now drop your knife and step away, and I will not kill you.”\n“But you . . . ” Trieste began with a whine even as she arched her spine back as far as she could to bring her head away from the flechette muzzle. She grabbing at the enemy’s weapon with her wounded left hand while stabbing upward with the combat knife.\nFlechettes rattled against the ceiling to ricochet along the corridor. The enemy groaned and slid down Trieste’s knife. His lifeblood poured across her arm. The corridor lights flickered back on to show a matching pool of blood leaking from the open hatch of the cabin where she had left Gouvernaile behind.\nTrieste dropped her kill and leapt for her cabin. The sight of Gouvernaile’s shredded face and chest sucked the air from lungs. She stood balanced on the edge of that airless scream of grief and rage until it seemed her heart would burst.\nI know there ain’t been no kissing yet, but listen up. You cop those flechettes infected Trieste with a virus slotted spot-on for her Uncle Marcus, right? Trieste’s genome was tight enough to her Uncle’s to crash her immune system but loose enough not to de-rez on the spot.\nMarcus shut down that war between Truro and Brigante, bargaining hard for the right proper treatment for his niece. Along with a bunch of other concessions he had to give himself up to a marriage alliance to buy Trieste’s life back. You might reckon both sides wanted an excuse to stop killing each other. She was a good one.\nCleone’s heiress, she was packed up and shipped off to Brigante Station to meet their Biomistress—the only one who could undo what the virus had done. Trieste brought with her the corpse of Morholt the assassin in trade for Marcus’s new bride. The plan was for Trieste to escort the young woman back once she’d been recovered. A motivational thing, you might say. Such a trade, a moldy old assassin for an orbital princess.\nYep. Now we’re getting closer to the kiss.\nAixelle was a beauty by the standards of any age. She had hair to her waist—an obscene luxury in a place and time where everyone shaved their scalps to fit pressure suits. That hair was the color of sunlight to accent the dancing water of her eyes. Her long fingers had never borne a callus.\nIn addition to being Marcus’s betrothed, she was Biomistress of Brigante Station.\nWith her servants, Aixelle met Trieste’s shuttle as it docked at cradle seventeen-B in Brigante’s highest security zone. Trieste was debarked into the echoing cargo bay strapped to a zero-gee biocontainment gurney. She lay there and stared at the girdered ceiling, wondering how the Brigantes could afford the cubage. Behind her Morholt’s corpse trundled along in a cryogenic chamber. The assassin had been stripped of his electronic stealth suit but otherwise undisturbed in death, even to the sprayed blood frosted upon his neck and shoulder.\n“Well,” Aixelle said as she leaned over Trieste, steadying herself with one hand on the rail of the gurney. Her long hair eclipsed the ceiling lights of cargo bay in billowing clouds of gold. Her stationsuit was closed high on her neck. “So you are the hero of Brigante Station, come to carry me home to Truro.”\nHer mind fogged with drugs and bioengineered disease, Trieste struggled for words. “Marcus . . . Stationmaster . . . ” No one had warned her of this girl. Trieste’s heart was stricken by this woman’s beauty, jealous that Aixelle should be the province of another. Even her own beloved uncle.\nLove should not be like this, she thought in a moment of clarity. It had come upon her as another plague.\nAixelle glanced away from Trieste toward Morholt’s cryochamber. “You voyage for life and for death. Let us see if we can repair you.”\nIt was, after all, Aixelle’s DNA sequencers that had brought Trieste to this weak stead in the first place.\nThe next time Trieste was sufficiently conscious to recognize the Biomistress, Aixelle walked into the single-bed isolation ward with a datapanel under one arm and a crooked smile on her face. She wore a loose robe suitable for the rotational-gee sections of Brigante Station. A dull pendant dangled from a silver chain to rest upon her chest. Her hair was pulled tight, woven with black ribbons of mourning for Morholt.\nAixelle was still the most beautiful woman Trieste had ever seen. She opened her mouth, struggling for words.\n“It’s been almost a week,” Aixelle said before Trieste could find her voice. “Our tailored virophage has been effective, but reversing the immune damage is taking a while.”\nTrieste struggled to remember that it was this woman’s work that had rendered her ill in the first place. The inner battle was lost in the glow of Aixelle’s smile. “And now . . . now I am whole once again,” Trieste said as she found her voice, “only to find my heart pierced anew.”\nAixelle thumbed her patient’s eyelid up, leaning in close to examine her handiwork. “Don’t be an idiot. I am betrothed to your uncle as part of the settlement between Brigante and Truro. A union of the Lagrange stations, to our mutual economic and social benefit.” She giggled, an unfolding of her stern character that Trieste found even further entrancing. “They’re already in a panic at Luna City.”\n“As well they should be,” Trieste muttered, all too conscious of the Biomistress’s sweet breath playing on her neck and face. Gouvernaile, she told herself, remember Gouvernaile. Her lifelong companion’s heart had been shredded by the flechettes—a double weapon, murderous in their direct effect as well as infectious with the Biomistress’s virus.\nThe same virus that had almost killed her.\nAixelle stroked Trieste’s cheek. “Another few watches in here, then you can present your credentials to my father, Stationmaster Angevine. There will be some days of the obligatory cocktail parties and media events. After that you may plan our escape.”\nDespite the blood that stood between them, Trieste’s heart was lost for good. She watched Aixelle leave the tiny clinic, taking all light and warmth with her.\nTrieste had tugged an exam stool up next to her sickbed. Her gear bag was open as she sorted through what had been so hastily packed back on Station Truro. It was an odd lot: a holo of her dead father, two of Gouvernaile’s study plans on a datacube, portions of her fighting gear—including the damaged combat knife. She turned it in her hand, careful to keep the reprogrammable molecular matrix of the blade set to the default non-conductive steel.\nThe hatch hissed open. Aixelle stepped in. The Biomistress still kept her hair in mourning ribbons but had chosen to wear a brighter robe today. It only accented her beauty, which panged Trieste’s heart.\nShe smiled as Aixelle stepped forward to take the knife from her hands. Trieste let the other woman have it, knowing she was as safe as she might be in this place. A damaged knife would not be the instrument of Trieste’s death should Stationmaster Angevine decide to do away with her.\nAixelle turned the combat knife over in her hands. Some strange, complex expression flitted across her face. “Is this yours?” Her tone was casual but her voice trembled.\n“Yes.” Trieste flooded with pride. “I earned it in advanced combat training when I was fourteen.”\n“And did you break the tip? Or did someone break it for you?”\nOh no. Trieste’s heart sank toward cold oblivion. Still, she could be nothing but honest with this woman. “I broke it.”\nAixelle removed her pendant from her neck and matched the dull metal of ornament with the tip of Trieste’s knife. “I took this out of Morholt during our autopsy. He was like a brother to me. My great, good friend.”\nTrieste caught Aixelle’s eye and stared into the wounded heart of her beloved. “I am sorry for your pain but I cannot regret your loss.” Her words were like the blow of another knife, another slaying of love. But Trieste could not spare them. “Your great, good friend killed my own greatest friend during his invasion of Truro Station. He would have killed me too, had I not fought well.”\nThe dancing water of Aixelle’s eyes froze to ice. She tapped the broken tip of the combat knife against Trieste’s neck, then pressed it until Trieste felt pain. Warm blood trickled down her chest. Aixelle held the pressure against her patient’s neck as Trieste waited unmoving to learn the Biomistress’s will. Out of love, Trieste refused to close her eyes.\n“Perhaps you should rest until your return to Truro Station,” Aixelle finally said. Putting away her chain with the bloody metal shard, she dropped Trieste’s knife on the deck, a fine spray of blood fanning away from it. “There are many accidents for the unlucky and unwell here on Brigante Station.”\nListen up, you little datafreaks. Trieste and Aixelle aren’t no closer to kissing yet than when they first met. Trieste could be the greatest warrior of her age, and Aixelle’s got the beauty of an empress and all the powers of a Biomistress besides, but they’re acting like a couple of kids from the recycling yards. You think you’ve got crap to fight over? The life and death of thousands rested on these two.\nBranwen, Aixelle’s lab manager, stitched up another special virus with the help of Aixelle’s mother, she who had been Biomistress before Aixelle. This little bug kicked off a series of endorphin cascades linked to a targeted pheromone signature present in someone else infected with the same vector. What you might call a love potion. Branwen wanted to make life easier for Aixelle in her marriage to Stationmaster Marcus. Let them come together for politics but live for love.\nWith families like this, who needs enemies?\nThey shipped for home in Stationmaster Angevine’s personal shuttle, the Adsiltia. Trieste had not seen Aixelle in two weeks. She was trapped between stomach-wrenching nerves and icy regret. For all her youth, Trieste was not yet accustomed to such wild vacillations of the heart. She was placed aboard in advance by Brigante Station Security, then sat alone in the passenger compartment until Aixelle arrived accompanied by Branwen and two more security troopers—the Biomistress’s personal guard as allotted by the betrothal contract.\nAixelle’s hair was loose again, waving free in the low gee of the shuttle. She wore a bodysuit of blue spidersilk, thin as air and twice as soft. She still wore the pendant made from the tip of Trieste’s combat knife. The troopers brought a small, heavy case with them. It was more than simple luggage.\n“Biomistress Aixelle,” said Trieste with a tight nod.\n“Citizen Trieste,” her beloved replied crisply, sweeping her hair over one shoulder to claim the crash couch farthest back from Trieste’s. Aixelle’s troopers secured their case at the back of the passenger cabin, then sat between Aixelle and Trieste. Branwen glanced at her mistress before she strapped in next to Trieste.\nTrieste felt a pain in her heart as cold and hard as a vacuum leak.\nWithout announcement, the pilots undocked the shuttle for the forty-two hour transit from Brigante Station to Truro Station.\n“She’s torn,” Branwen whispered after a few hours. The woman didn’t turn her head to look at Trieste.\nThe cabin was darkened for sleeping. Someone behind Trieste was using a holo—the blue glow flickered against the padded wall in front of her. She assumed it was Aixelle, as it was difficult to imagine either of the troopers going off into virtspace while Trieste herself was present in a confined area with them and their Biomistress.\nHope flared in Trieste’s heart. “We all face difficulties,” she told Branwen.\n“There’s more here than meets the eye.”\nDespite herself Trieste’s curiosity was piqued. She didn’t know if she was being baited, however, so she kept her own counsel. “When is there not?”\n“The LaGrange Stationmasters plot against one another, but together they craft larger plots against Luna City and the groundside governments. Lately the affairs have turned yet again.”\nThis smacked of Gouvernaile’s lessons. “Like Greeks and Trojans, endlessly warring.”\nBranwen was silent for while. Eventually, Trieste heard the faint smack of her lips parting as she spoke again. “Did you wonder what Morholt was doing on Truro Station?”\n“Yes. Just before I killed him he said I was not his target. Yet he slew my tutor.”\n“Cleone Station transferred technology to Truro Station. Your tutor was the carrier. Your trip into exile was cover. Morholt was after that tech on behalf of Brigante.”\n“My step-mother tried to have me—” Trieste stopped.\nBranwen’s laugh was soft. “She didn’t succeed, did she?”\nTrieste thought furiously. Love and betrayal were the stuff of stories, not her life. When had it become so complicated? “Why tell me this now?”\n“Mistakes are being made as we talk,” Branwen said. “Alliances shifting, both among the stations and with respect to larger players. You and Aixelle can perhaps see a clear course to the end. You are not so caught up in prior generations of cis-Lunar politics.” She took Trieste’s hand for a moment, then Trieste felt a prickle on her palm.\n“Hey—” Trieste started to say, but Branwen covered her mouth with a hand.\n“You will thank me for this,” the other woman said. She then unbuckled from her seat and moved back through the dark cabin. Trieste stared at her hand, touching the faint spot of fading pain where Branwen had infected her with . . . what?\nHope, perhaps.\nTrieste awoke with a start, briefly disoriented and scrabbling for her weapons. She remembered where she was. Then she realized that Aixelle’s fingers enclosed hers. The cabin lights were still dimmed. The Biomistress leaned close to Trieste, her long hair brushing Trieste’s cheek and arm, her shadowed bluewater eyes gleaming like Luna’s darkside sky.\n“Trieste,” Aixelle said softly, “I have wronged you.”\nThe warmth of Aixelle’s breath upon Trieste’s face, the cool pressure of her fingers, the soft brush of her hair, through all of these things Aixelle drew them together. It was if Trieste dove into the pools of her eyes, flew into the cloud of her hair, landed in the bays of her heart. She scarcely dared speak, for fear of shattering the moment, but she felt she must. “It is no matter, my lady.”\n“There are pressures upon both our peoples.” One hand stroked Trieste’s face, tracing the line of her lips. “I let my own troubles lead me into harsh judgment.” Aixelle sighed. “No. Misjudgment.”\nTrieste’s entire body coiled tight. Her breasts ached to be touched and her groin flooded with warmth. Beaded sweat caused her neck to itch. She was too close to her heart’s desire. “My lady Biomistress, you are betrothed to my uncle, Stationmaster Marcus.”\nAixelle leaned forward and they kissed. All thoughts of family and duty fled Trieste’s head like oxygen from a breached cylinder.\nThere was only Aixelle.\nSee, I told you there would be a kiss. What did it mean the first time you kissed someone? Did the fate of stations rest on your fidelity? Were you selling out your family and your home? Not to mention a hot tech transfer.\nDid you ever think our whole existence was built on a single kiss? There’s more to it. But it was a kiss that started it all.\nThe wedding had been riotous. Stationmaster Marcus held it in maintenance bay “A”—the largest open cubage in Truro Station—under microgravity. Trieste stared as Marcus led Aixelle away through the crowds rotating around the happy couple in a constellation of intoxicated goodwill. Her angry jealously raised goose pimples on her arms as her knife hand shivered.\n“Fear not, my lady,” whispered Branwen, approaching Trieste’s elbow through a cloud of confetti. “Your love will be upheld.”\n“I thank you for the good will, Mistress Branwen,” said Trieste, “but that can never be.” She reached for what was right. “I cannot give loyal service to my uncle and my heart to my beloved in the same breath.”\nBranwen’s lips brushed Trieste’s earlobe, breath hot in her ear. “We all wear masks, beloved.”\nStartled, Trieste whirled. She knocked herself into a slow rotation from which Branwen steadied her. Or was it Branwen? Trieste studied the other woman’s face. The line of her cheekbones, the set of her chin, somehow it was all familiar. “Aixelle,” Trieste finally said, “ . . . but how?”\nHer beloved smiled. Radiant glory piercing Trieste’s heart. “To a Biomistress many things are possible. Pheromones, the shift of muscles in response to pinpoint injections of toxins. Humans are easy to fool. Our little tricks do not work so well for machine recognition systems. But in the drunken dark, well, Stationmaster Marcus will find my Branwen much to his taste.”\n“And what will I find?” Trieste asked.\n“Catch me and see,” Aixelle laughed, kicking away to spin into a cloud of confetti.\nShouting, Trieste dove after her.\nDays later they tumbled in orbit in a slice of time stolen from marriage and duty, crowded close together into one of Truro Station’s vacuum hoppers. Aixelle grinned up at Trieste from where she knelt before a series of linked titanium boxes. Electrostatic clingpads kept the Biomistress secured to the floor. A two-meter long pole bulgy with electronics lay beside the boxes. It all had the look of a prototype—taped-off electrical leads, data antennae soldered in odd places, ragged edges to the milling of the metal.\n“What is that?” Trieste clung to her crash couch to keep herself from floating away in the microgravity.\n“Watch and see.”\nThe little vacuum hoppers were used for exterior maintenance, chasing down lost loads—or spacewalkers. All in all, general duties that required limited duration excursions. Every eighty seconds with the period of their rotation the station glinted perhaps a hundred kilometers from them in the main viewport of the tiny pressurized cabin. Data ghosts across the viewport glazing charted distances, vectors, dynamically scaled energy budgets.\n“I’m watching,” said Trieste, “but what am I seeing?”\n“This.” Aixelle flipped a switch.\nSuddenly they were in full gravity. Trieste was jammed against one side of the crash couch as if the vacuum hopper were pulling a tight turn. Aixelle slumped against the floor smiling.\n“God in Orbit,” Trieste said, savoring the sensation. “Artificial gravity.”\n“What Gouvernaile was working on. Along with some of Marcus’s people, in competition with Brigante’s teams.” Aixelle frowned. “What Morholt was sent to take before father and Marcus came to their senses and joined forces. I brought the last critical systems from Brigante Station’s own lines of research with me to the wedding. Bride gift.”\nOf course, thought Trieste. The precious case the guards had carried. “The stations will control the solar system,” she said. Political strategies unfolded in her head like an inflating pressure suit. “Luna and the dirtside interests will be left behind forever if this can be delivered significantly ahead of their efforts. How close is the competitive research?”\nAixelle shrugged. “We’ve gotten it first. This is everything . . . a weapon, a mode of travel, freedom to have children and grow old in orbit without bone loss and muscle atrophy.”\nTrieste gathered Aixelle into her arms, both of them leaning against the slightly out-of-true plane of artificial gravity. They shared a crushing kiss that sent shocks rippling down Trieste’s body. Fingers reaching for each other’s stationsuit closures, they bent to yet celebration of love and life.\nTrieste woke to microgravity. She was loosely strapped into her crash couch. Aixelle must have turned off the generator. She scratched her head, then reached for her beloved while blinking sandy sleep away. Her hand found metal and plastic.\nA pressure suit helmet.\n“Aixelle?” Trieste coiled herself to spring into action.\nAixelle still slept, the vacuum hopper still tumbled, but there was a pressure suit helmet wedged between their seats.\n“STATIONMASTER, TRURO” was stenciled above the faceplate.\nIt was Marcus’s helmet. Trieste’s uncle had been here. Found them. Discovered Aixelle’s betrayal.\nHow had that happened?\nTrieste stabbed at the console until the little ship’s log came up. The Stationmaster’s personal vacuum hopper had docked on executive override, silencing all of Trieste’s alarms. The log didn’t say, but Trieste guessed Marcus had gassed their atmosphere, too. How else could she have slept through the docking?\nTrieste glanced behind her. Aixelle’s artificial gravity units were still in place. Marcus had left them with all choices. All the betrayals lay in their hands. Trieste dug her knuckles into her eyes and wept a moment before turning to her own pressure suit racked by the airlock.\nShe could stay no more on Truro Station. Brigante was closed to her too, and Cleone as well. Trieste clipped a lock of Aixelle’s glorious hair and placed it next to her heart before sealing the pressure suit. She overrode the airlock alarms so that her beloved would sleep a little longer and left the secret of artificial gravity behind her. Trieste stepped out into an exile of the heart.\nSo what would you have done if you was her, spacebrain? Follow Trieste into vacuum? How much air you think that girl had on one little p-suit? Death by screw-up is more like it, to go for a long walk with short air.\nYou know the stories. The First Gravity War. The Second Gravity War. The Last Gravity War. What the Americans did to Cleone Station. What the other Stations did to Washington City in return. Where was Trieste in all this? Is she a hero in your bookstories?\nDidn’t think so.\nShe got lucky, picked up by a ballistic hauler with a load of low-orbit wheat heading upward. Stupid git walked away from all the love and power in cis-Lunar space, changed her name to Diana and worked her way back to power in Luna City. Eventually she made general officer in their militia. She gamed the wars to make sure the Stations never lost too hard, and won when it counted. Even against her own side. She knew how to kick butt and take names, remember? Eventually Diana threw Luna City in with the Stations against Earth in The Last Gravity War. Then she married Prince Hektair of Luna City to seal the bargain.\nYeah, that Diana. Signed the Peace of Amsterdam on behalf of the Lunar governments, established the perpetual independence of trans-Lunar space. That would be us, kiddies, out here chasing rocks in the dark orbits between Mars and Jupiter, ice-diving around Saturn, all the other mischief our siblings and cousins get up to.\nAnd it was all for a kiss. Trieste wouldn’t have gone into exile, undermined the Lunatics and defeated the Terrans if she’d just kept her lips off that girl Aixelle and stayed home on Truro Station like a good princess.\nWhat happened to Diana after Amsterdam? Been doing research, ain’t you? Reached a dead end or twelve I expect. Just says she died, don’t it? There’s some stories don’t get written down, only passed from mouth to ear.\nListen up one more time, my pretty pets.\nDiana, General-Governor of Luna City, greatest warrior of her age, was brought before her Prince-Consort Hektair in his bubble garden high up on the wall of Aristarchus Crater. He sat beneath the dome staring at the diamond stars, surrounded by the slow breathing of his plants. Quiet servants set the brakes on Diana’s gurney and withdrew. She stared at Hektair’s age-stubbled scalp through her oxygen mask and the needled haze of pain.\n“Routine patrol,” he said to the vacuum-cold night outside. “Indeed?”\nShe could see the reflection of her Prince-Consort’s face on the glass, curved to a lengthy sadness. “Suppos’,” Diana slurred. “Earthis’ part’sans.”\n“The wars are over now.” Hektair sighed. “Your allies’ gravity generators could put out the fire in the sun if need be. I understand it all now—why you betrayed Luna, why we switched sides, why millions died dirtside to make our point. Freedom for humankind to grow . . . outward.” He whirled from the window, tears gathering in his clouded brown eyes as his voice slurred to match hers in the roughness of his grief. “The only thing I don’t understand is why this happened to you. Now. When it’s all long over!”\nSome things came in their own time. Some bullets were best stepped into instead of away from. She had become tired of living.\nDiana’s hand crawled across her bandaged chest as if possessed of an intelligence of its own, seeking the spun-diamond locket she had worn since coming to Luna City six decades earlier. “ ‘stime,” she told her husband. I loved him, she told herself. Hektair had stood beside her through marriage and war, raised her sons and tended her hurts.\nHe loved her too. She knew that.\nShe pulled the spun-diamond locket out of the ruins of her pressure suit liner to thrust it at Hektair with a palsied hand. “Sh’can save me. Only her.”\nHektair took the locket from Diana, shaking with anger as his wife slipped into dreams of freefall and tumbling helmets and the voice of Stationmaster Marcus cautioning her of something upon which her life depended, if only she could make out exactly what he was saying.\nAn unmarked shuttle landed on the concrete pad of Executive Field—Diana’s private spaceport in the crowded heart of Aristarchus Crater. She floated, intubated and dying, within a column of warm saline solution in a tower room high above the crater floor. Her eyes were fixed on a virteo view of the landing pad. Silent med techs moved slowly about the room, exchanging worried glances.\nHektair swept in from the elevator. He was dressed in his most formal kilt and armored vest, as if to receive an Earthist delegation. He stood in front of Diana’s vat with his arms folded and stared at his wife as she watched the field below.\n“Diana,” said Hektair. “You can hear me.”\nShe watched a boarding tube crawl out from a blast-hardened dome.\n“Diana.” Her husband sighed. “Please look at me.”\nHe might have been weeping, but Diana concentrated on the landing field below.\nHektair tapped on the glass. “Stationmistress Aixelle would not come,” he whispered.\nDiana closed her eyes. The monitors all flatlined.\n“You’re dead, silly woman,” Aixelle whispered, drawing her long hair across the tender new skin of Diana’s face.\nDiana opened her eyes. They were in a tiny cabin surrounded by machines, but all she saw was the waterblue eyes of Aixelle. “Am I?” she tried to say. She succeeded only in coughing dust and flecks of blood.\n“Diana is dead,” Aixelle said, stroking her cheek. “Hektair will rule well enough in the General-Governor’s stead. As he was born to do. Trieste, on the other hand . . . well, her life is in balance. But not yet lost.”\n“How?” Not ‘why,’ not after all the lost decades.\nAixelle laughed, the bells of her voice ringing through the years of Trieste’s memory. “All things are possible to one who is both a Biomistress and a Stationmistress.”\nWhere did they wind up? Who knows? Maybe a cometary orbit, to come back someday at our worst hour of need. Maybe a little ice mine on Europa where they finished out their days slurping algae soup and smiling toothlessly at each other.\nMaybe Diana really was cremated like the bookstories say.\nAnd maybe they’re just really old, living together out somewhere in the deep dark, teaching the lessons of history to kids who drop by to learn something.\nTime to shove off now, helmet-head. I hear my wife calling.\nThe late Jay Lake was a highly talented and highly prolific writer who during his tragically short career seems to have managed to sell to nearly every market in the business, appearing with short work in Asimov's, Interzone, Tor.com, Clarkesworld, Strange Horizons, Aeon, Postscripts, Electric Velocipede, and many other markets, producing enough short fiction to fill five different collections: Greetings from Lake Wu, Green Grow the Rushes-Oh, American Sorrows, Dogs in the Moonlight, The Sky That Wraps, and, most recently, the posthumously released Last Plane from Heaven. Lake was also an acclaimed and prolific novelist, whose novels were Rocket Science, Trial of Flowers, Mainspring, Escapement, Green, Endurance, The Madness of Flowers, Pinon, and Kalimpura, as well as four chapbook novellas, Death of a Starship, The Baby Killers, The Specific Gravity of Grief, and Love in the Time of Metal and Flesh. He was the co-editor, with Deborah Layne, of the six-volume Polyphony anthology series, and also edited the anthologies All-Star Zeppelin Adventure Stories, with David Moles, Other Earths, with Nick Gevers, and Spicy Slipstream Stories, with Nick Mamatas. He won the John W. Campbell Award for Best New Writer in 2004. Lake died in 2014.", "source": "https://clarkesworldmagazine.com/lake_01_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: An Exile of the Heart by Jay Lake"}