{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Dawn Metcalf", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "aFpy7r4655UWuAGYRObgNjhXCrQ=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: YA is the New Black  *taps microphone* *winces at squealing feedback* *clears throat*  Hi. My name is Dawn Metcalf and I write YA. And, okay, I’ll admit it’s been a while since my age had any “-teen” suffix attached, but I love writing for teens because it asks the best question: what does it mean to be human?  All great stories, as far as I can tell, explore what it means to be human. Writing for underage humans is about their journey to become the kind of grown-up human they’d like to be instead of the screwed-up, nihilistic, know-it-all humans that run the world now. Tap into that exact moment when a parent, teacher, principal, boss or bully said, “That’s just the way it is because I said so” and savor that visceral, burning, righteous fury you felt when you knew that answer was so wrong! That’s the beating heart of YA.  I honestly thought I’d been writing science-fiction/fantasy, my favorite genre, for all those years that I’d been putting pen to paper and fingers to keys until one fateful day when someone official mentioned that my protagonist was in that magical “sweet spot” between the ages of twelve and eighteen and therefore, I could be writing YA. Who knew? So when agents and editors asked if I wrote YA, I said “Yes.” (Ghostbusters taught me something, after all!) I wrote YA because I said I wrote YA, ergo, I was a YA writer. End of story.  . . . and, possibly, career. Because it became painfully obvious after reading tons of YA literature that there’s a lot more to writing for teens than simply the age of your protagonist. Ask any kid. If you’ve ever had a kid, knew a kid or been a kid, you know that they are the first ones to smell B.S. and call you on it. You can’t talk down to them, you can’t pretend to know the lingo, you can’t be squeamish or pull punches and you can’t hope they’ll wait for the payoff and keep reading or give you the benefit of the doubt—you have to deliver the good, hard truths, the real emotions and no pandering “lessons” that belong in afterschool specials. In fact, they don’t even know what an afterschool special is anymore! Your youngest readers were born in 2003. (And by the way, they’re not “cell phones” or “smartphones,” they’re just “phones.”) I had to learn this the hard way by applying the tried-and-true method prized by many a writer: by making lots and lots of mistakes.  To be fair, back when I was a young adult, there was no such thing as “Young Adult” books, so I didn’t grok the subtleties until I was in the thick of things, the golden post-Hogwarts age of fantasy writing. Fortunately for me, I’d grown up with my nose in fairy tales so it was a logical step from Judy Blume, Katherine Patterson, Anne McCaffrey and Mercedes Lackey to William Gibson, Spider Robinson, Neal Stephenson, Joan D. Vinge, Connie Willis and Neil Gaiman. Now I was reading Holly Black, Laini Taylor, A.S. King, Steve Brezenoff, John Green, Libba Bray, Maggie Stiefvater and Brenna Yovanoff. Looking back at my shelves, most of my favorite characters were teens, so, okay, maybe I could write scifi-fantasy for teens.  But, as I mentioned, there’s a big difference between writing for teens and slapping the word “sixteen” on a character sheet. If you write a story where the main character—dare I say the “strong female protagonist?” No, I daren’t. ((shudder))—has the knowledge, power, talent and freedom to make their way in the big, cruel world, it’s not YA. If your characters have something to teach us, a lesson to be learned, it’s not YA. And if it’s a mash-up of Harry Potter-meets-Twilight, then trust me on this one, it is not YA.  YA is about having imposed limits, living under rules you didn’t invent and forced into systems outside your control; it’s about testing the boundaries, finding the chinks, discovering allies who think like you and enemies who don’t. It’s about throwing yourself kicking and screaming, at unfairness, and seeing who cares enough to kick back. It’s about learning who you are as opposed to who you’ve been told you ought to be. YA is the journey of becoming a human being.  Raised on a diet of aliens and elves, this concept wasn’t a giant leap. Wasn’t everyone in high school an alien (or alienated, or alienating)? Sci-fi writers were MADE for this!  As a long-time gamer geek, youth advocate and skiffy chick, I can tell you there’s plenty out there that drives me up the proverbial wall sans paddle, so when I’m fortunate enough to be surrounded by trusted goofballs and geeky intellects (a.k.a. my fellow writers, family and friends), I can trust-fall into that potent brew of random thoughts and rabid fandom, which sparks the kinds of conversations one might have at 3 a.m. while avoiding more productive things like writing and/or sleep. (In my experience, one can rarely have both.) Half-awake and fully charged, I can vent about all the tropes and triggers that make me bonkers, question the what-ifs, the why-nots and the what-hasn’t-yet-beens, poke at the status quo because the status is not quo, shaking loose all kinds of nutty, half-baked, chewy ideas from whence all good books (and chocolate chip cookies) are made.  It starts with the question “What if . . . ?” then spirals, stream-of-conscious-like out into the unknown. Pick your favorite subject to rant about and your favorite subject to geek out about. Now pull a Monty Python and get into an argument (not a contradiction). Note the push-and-pull, the absolute need to be heard, to win someone over, the want to understand and to be understood, the grinding frustration when you fail and the smug, glorious glee when you succeed. That’s the heat which fuels the fire and keeps the story burning, adding anger and passion and a pinch of righteous indignation that unifies all humans who have ever uttered the words, “It’s not fair!”  Here’s a blatantly self-serving example: my current series, the Twixt, spawned from the complaint, “Why oh why is it always the immortal male who falls in love with a sixteen-year-old human girl and then shows her the way to love?” GAH! I knew a lot of teen girls—heck, I was one myself!—and the whole trend felt off, tired and overdone. So I thought, why not flip it? Why couldn’t the girl know her own body and mind? Why couldn’t the immortal guy have a few “firsts” for a change? What if he’s immortal, but hasn’t got a clue? I loved characters like Peter Pan, Joe Black and Edward Scissorhands, powerful, boyish not-quite-humans who didn’t know the difference between a thimble and a kiss.  That single question about the not-so-quo birthed a dozen others that I got to answer. Eventually, these mental ramblings became Indelible Ink, Joy Malone, Monica Reid and Graus Claude along with an entire cast of characters living in two worlds kept apart by old, broken rules. The struggle to be together, to bend the rules, to change the world, became the basis of a YA story arc currently on its third installment.  *end plug*  So why write YA?  YA is the New Black and lots of authors have been making the leap, which makes some people nervous and others skeptics, but that doesn’t serve the genre. YA is very popular with teens, tweens and adults, which has a lot of experts scratching their heads trying to figure out why. The truth is it has nothing to do with the texting generation, the rise of online gaming or—heaven help us—the dumbing down of literature; it’s the simple fact that it’s familiar. It speaks to us. We were all there once.  We know how it feels to question authority, to fall in love, to be betrayed, to have a best friend be closer than family, to have our hearts broken and to feel utterly alone for the very first time. Adolescence is the great unifier because everyone knows what it’s like, and for those readers who don’t know or haven’t gotten there yet or only vaguely remember, it’s a friendly guide from a fictional someone who “gets it.”  Growing up may manifest differently across countries and cultures, generations and genders, but everyone on the planet knows what it’s like to feel alienated, to wonder who we really are and ask ourselves what it means to be human.  I did. And then I grew up. And now I write YA.  *wink* *grin* *mic drop*  Dawn Metcalf is the author of the Twixt series (Harlequin TEEN), which includes Indelible, Invisible and Insidious, due out July, 2015. She is an educator, advocate and amateur ninja living in northern Connecticut with her family and feline companion. If they had a sign, it would say: Confounding the Neighborhood Children Since 1999.", "text": "Non-Fiction\nAnother Word: YA is the New Black\n*taps microphone* *winces at squealing feedback* *clears throat*\nHi. My name is Dawn Metcalf and I write YA. And, okay, I’ll admit it’s been a while since my age had any “-teen” suffix attached, but I love writing for teens because it asks the best question: what does it mean to be human?\nAll great stories, as far as I can tell, explore what it means to be human. Writing for underage humans is about their journey to become the kind of grown-up human they’d like to be instead of the screwed-up, nihilistic, know-it-all humans that run the world now. Tap into that exact moment when a parent, teacher, principal, boss or bully said, “That’s just the way it is because I said so” and savor that visceral, burning, righteous fury you felt when you knew that answer was so wrong! That’s the beating heart of YA.\nI honestly thought I’d been writing science-fiction/fantasy, my favorite genre, for all those years that I’d been putting pen to paper and fingers to keys until one fateful day when someone official mentioned that my protagonist was in that magical “sweet spot” between the ages of twelve and eighteen and therefore, I could be writing YA. Who knew? So when agents and editors asked if I wrote YA, I said “Yes.” (Ghostbusters taught me something, after all!) I wrote YA because I said I wrote YA, ergo, I was a YA writer. End of story.\n. . . and, possibly, career. Because it became painfully obvious after reading tons of YA literature that there’s a lot more to writing for teens than simply the age of your protagonist. Ask any kid. If you’ve ever had a kid, knew a kid or been a kid, you know that they are the first ones to smell B.S. and call you on it. You can’t talk down to them, you can’t pretend to know the lingo, you can’t be squeamish or pull punches and you can’t hope they’ll wait for the payoff and keep reading or give you the benefit of the doubt—you have to deliver the good, hard truths, the real emotions and no pandering “lessons” that belong in afterschool specials. In fact, they don’t even know what an afterschool special is anymore! Your youngest readers were born in 2003. (And by the way, they’re not “cell phones” or “smartphones,” they’re just “phones.”) I had to learn this the hard way by applying the tried-and-true method prized by many a writer: by making lots and lots of mistakes.\nTo be fair, back when I was a young adult, there was no such thing as “Young Adult” books, so I didn’t grok the subtleties until I was in the thick of things, the golden post-Hogwarts age of fantasy writing. Fortunately for me, I’d grown up with my nose in fairy tales so it was a logical step from Judy Blume, Katherine Patterson, Anne McCaffrey and Mercedes Lackey to William Gibson, Spider Robinson, Neal Stephenson, Joan D. Vinge, Connie Willis and Neil Gaiman. Now I was reading Holly Black, Laini Taylor, A.S. King, Steve Brezenoff, John Green, Libba Bray, Maggie Stiefvater and Brenna Yovanoff. Looking back at my shelves, most of my favorite characters were teens, so, okay, maybe I could write scifi-fantasy for teens.\nBut, as I mentioned, there’s a big difference between writing for teens and slapping the word “sixteen” on a character sheet. If you write a story where the main character—dare I say the “strong female protagonist?” No, I daren’t. ((shudder))—has the knowledge, power, talent and freedom to make their way in the big, cruel world, it’s not YA. If your characters have something to teach us, a lesson to be learned, it’s not YA. And if it’s a mash-up of Harry Potter-meets-Twilight, then trust me on this one, it is not YA.\nYA is about having imposed limits, living under rules you didn’t invent and forced into systems outside your control; it’s about testing the boundaries, finding the chinks, discovering allies who think like you and enemies who don’t. It’s about throwing yourself kicking and screaming, at unfairness, and seeing who cares enough to kick back. It’s about learning who you are as opposed to who you’ve been told you ought to be. YA is the journey of becoming a human being.\nRaised on a diet of aliens and elves, this concept wasn’t a giant leap. Wasn’t everyone in high school an alien (or alienated, or alienating)? Sci-fi writers were MADE for this!\nAs a long-time gamer geek, youth advocate and skiffy chick, I can tell you there’s plenty out there that drives me up the proverbial wall sans paddle, so when I’m fortunate enough to be surrounded by trusted goofballs and geeky intellects (a.k.a. my fellow writers, family and friends), I can trust-fall into that potent brew of random thoughts and rabid fandom, which sparks the kinds of conversations one might have at 3 a.m. while avoiding more productive things like writing and/or sleep. (In my experience, one can rarely have both.) Half-awake and fully charged, I can vent about all the tropes and triggers that make me bonkers, question the what-ifs, the why-nots and the what-hasn’t-yet-beens, poke at the status quo because the status is not quo, shaking loose all kinds of nutty, half-baked, chewy ideas from whence all good books (and chocolate chip cookies) are made.\nIt starts with the question “What if . . . ?” then spirals, stream-of-conscious-like out into the unknown. Pick your favorite subject to rant about and your favorite subject to geek out about. Now pull a Monty Python and get into an argument (not a contradiction). Note the push-and-pull, the absolute need to be heard, to win someone over, the want to understand and to be understood, the grinding frustration when you fail and the smug, glorious glee when you succeed. That’s the heat which fuels the fire and keeps the story burning, adding anger and passion and a pinch of righteous indignation that unifies all humans who have ever uttered the words, “It’s not fair!”\nHere’s a blatantly self-serving example: my current series, the Twixt, spawned from the complaint, “Why oh why is it always the immortal male who falls in love with a sixteen-year-old human girl and then shows her the way to love?” GAH! I knew a lot of teen girls—heck, I was one myself!—and the whole trend felt off, tired and overdone. So I thought, why not flip it? Why couldn’t the girl know her own body and mind? Why couldn’t the immortal guy have a few “firsts” for a change? What if he’s immortal, but hasn’t got a clue? I loved characters like Peter Pan, Joe Black and Edward Scissorhands, powerful, boyish not-quite-humans who didn’t know the difference between a thimble and a kiss.\nThat single question about the not-so-quo birthed a dozen others that I got to answer. Eventually, these mental ramblings became Indelible Ink, Joy Malone, Monica Reid and Graus Claude along with an entire cast of characters living in two worlds kept apart by old, broken rules. The struggle to be together, to bend the rules, to change the world, became the basis of a YA story arc currently on its third installment.\n*end plug*\nSo why write YA?\nYA is the New Black and lots of authors have been making the leap, which makes some people nervous and others skeptics, but that doesn’t serve the genre. YA is very popular with teens, tweens and adults, which has a lot of experts scratching their heads trying to figure out why. The truth is it has nothing to do with the texting generation, the rise of online gaming or—heaven help us—the dumbing down of literature; it’s the simple fact that it’s familiar. It speaks to us. We were all there once.\nWe know how it feels to question authority, to fall in love, to be betrayed, to have a best friend be closer than family, to have our hearts broken and to feel utterly alone for the very first time. Adolescence is the great unifier because everyone knows what it’s like, and for those readers who don’t know or haven’t gotten there yet or only vaguely remember, it’s a friendly guide from a fictional someone who “gets it.”\nGrowing up may manifest differently across countries and cultures, generations and genders, but everyone on the planet knows what it’s like to feel alienated, to wonder who we really are and ask ourselves what it means to be human.\nI did. And then I grew up. And now I write YA.\n*wink* *grin* *mic drop*\nDawn Metcalf is the author of the Twixt series (Harlequin TEEN), which includes Indelible, Invisible and Insidious, due out July, 2015. She is an educator, advocate and amateur ninja living in northern Connecticut with her family and feline companion. If they had a sign, it would say: Confounding the Neighborhood Children Since 1999.", "source": "https://clarkesworldmagazine.com/another_word_02_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: YA is the New Black by Dawn Metcalf"}