{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "John Chu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "dMnWzJGmiSM0uXfJgzmXa7f4B9I=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: The Vaguely Picaresque Adventures of a New Writer  In 2012, a contingent of Chinese fans go to ChiCon 7. I think I may have chatted with all of them. The Three Body Problem, Liu Cixin’s hard SF trilogy comes up again and again. (Yes, the actual name of the trilogy is Remembrance of Earth’s Past but no one I talk to ever calls it that.) When I get home, I order it and start reading the first book. Like you do.  A few months later, Ken Liu makes a sly reference to it on Facebook and I’m all “Hey! Are you reading that book, too?” It’s not announced yet but Ken’s not just reading it, he’s translating it into English. It turns out that he’s looking for a beta reader who’s both a science fiction writer and someone who’s read the book and would I be interested. Well, of course.  Now, in this case, what beta reading means is not just reading then commenting on the translation. It’s cross-checking the translation against the original. In other words, translate the original then compare that translation with both Ken’s translation and the original text a few sentences at a time. What I end up doing is very much translation with occasional training wheels. For example, I take a pass on some of the wordplay and marvel at Ken’s invention instead. However, I also recreate some of Ken’s research. For example, to translate this book you need to know what songs the US military played to smoke Noriega out of the Apostolic Nunciature of the Holy See in Panama City. (By the way, no, there does not exist a John Chu translation of The Three Body Problem.)  At LonCon 3 in 2014, I will be on a translation panel. When I talk about this work, the translator to my left will look appalled at me and then ask why anyone would ever do this to himself. After all, it amounts to writing a translation that no one will ever read. I will counter that I learned a lot in the process. Cross-checking Ken’s work means questioning and understanding his every decision. For me, that experience was invaluable. Beta reading Ken’s work has been a master class in translation and I feel privileged for the opportunity. Of course, it’s also difficult and time-consuming. You only do this because you really want to. [Digression: As a side-effect, this makes me absurdly well-qualified to talk about Ken’s translation of The Three Body Problem. I think it’s terrific. It is highly readable and, faithful, but not too faithful. As Umberto Eco says, tradurre è tradire. A reasonable translation of that sentence may give short shrift to the music that makes that sentence so quotable (“To translate is to betray”) or present the meaning in way that’s far too obscure (“To translate is to traduce”). Time and time again, Ken steers deftly around the pitfalls. His translation gives you the sense of having read Liu Cixin even though you haven’t read his actual words. That’s really impressive. He does a similarly skillful job with the third book in the trilogy, Death’s End, which is also, in my opinion, the best book in the trilogy.] At LonestarCon 3 in 2013, I catch up with Meizi Wang, whom I don’t get to see nearly enough. She translates for a living, primarily from English and French into Chinese. While we’re waiting for a reading to start, we’re chatting about her translation work, her recent vacation to Taiwan and just stuff. Tang Fei joins the conversation. Tang and I actually met a little earlier that day but we haven’t been introduced yet, so Meizi introduces me to her, mentioning how I’d beta-read Ken’s translation. As it turns out, Tang is looking for a translator and would I be interested? Well, of course.  And that is how I got my first translation gig. As far as I can tell, I get it mostly because I was curious about everyone else and what they were doing.  Now, of course, this account skips some things.  I haven’t talked about the years I spent getting my Chinese to the point where reading a Liu Cixin novel for pleasure isn’t out of the question. As many, many people have pointed out, what the saying “Learning Chinese is a five-year lesson in humility” means is that after five years, your Chinese will still be awful but you will have learned humility. Now, as a heritage speaker, I have it easier than some. My grammar has always been relatively decent, for example. On the other hand, I’m still expanding my vocabulary.  I haven’t talked about translating blog posts for friends. Once, a friend of mine goes to the Bookworm Festival in Beijing. One of her interviews is written up as a blog post in Chinese and I translate it for her. Doing that raises some interesting questions about the nature of translation. The interview is actually conducted in their mutual second language, English. Rendering the interview back into English takes it back to its original language, but probably not their actual words. That blog post also quotes, in Chinese, a metaphor from one of her own blog posts, which is are in English. The back-translation of the quote is actually a slightly different metaphor than her own. Which better conveys the Chinese blog post, a back-translation of the quote or the actual quote itself.  Unexpected doors open. When I can walk through them without falling and slamming my face on the sill, it’s because my time doing what interested me has, as a side-effect, prepared me.  How “The Water That Falls on You from Nowhere” gets published is a mini-saga in and of itself. One of the reasons I send it out again and again is because it keeps getting these really encouraging rejections. This includes one rewrite request that doesn’t convert and the most effusive rejection I have ever gotten. It comes from Ann VanderMeer. At this point, she’s still at Weird Tales. Ann sees the story, in part, because I’m running out of markets and desperate and, in part, because she’s an amazing editor and I just want her to read it. Ann loves the story, rightly points out that it’s not a weird tale, and suggests some other venues. She also says, among other wonderful things, that if she were at the right venue, she’d snap it up.  Fast forward some months and Ann VanderMeer is announced as one of Tor.com’s new associate editors. The story is between slush piles and, of course, I haven’t forgotten about the most effusive rejection ever. I immediately wonder whether she has and whether Tor.com is the right venue. Bizarrely, I also wonder whether it’s ok for me to query and I lament that if only there were some pros nearby I could ask for advice. Keep in mind that when Tor.com makes this announcement, I am Chicon7. I can only plead temporary insanity. (To their credit, the pros I ask are all very kind to the newbie as they reassure me.)  What I don’t know at the time is that, meanwhile, Ann is wondering whether that John Chu story is still available.  And so, I am saved from myself. “The Water That Falls on You from Nowhere” ends up being either the first or second story she take for Tor.com. That is how I make my by third SFWA qualifying sale . . . which then goes on to win the Hugo for Best Short Story in 2014.  Talk about unexpected doors opening.  Of course, what I’ve skipped past are years of hard work improving my prose and, learning how to tell a story. What I haven’t talked about are the years of doing what interested me just for its own sake, which has turned out to be helpful.  When Ann takes “The Water That Falls on You from Nowhere” for Tor.com, she also gives me some advice. Good work is the fount from which good things flow. I think, ultimately, all anyone can do is get better at doing the things they love doing. Everything else, it either happens or doesn’t.  Or maybe, everything else, it both happens and doesn’t. There is a Buddhist notion of “Where does the story end?” The same story can be, for example, sad or happy depending on where we choose to stop telling it. Stories go on forever. How we classify them is an arbitrary effect of presentation. So, with Ann’s advice in mind, I’ll stop this story here. John Chu is a microprocessor architect by day, a writer, translator, and podcast narrator by night. His fiction has appeared or is forthcoming at Boston Review, Uncanny, Asimov's Science Fiction, and Tor.com among other venues. His translations have been published or is forthcoming at Clarkesworld, The Big Book of SF, and other venues. He has narrated for podcasts such as EscapePod, PodCastle, and Lightspeed. His story \"The Water That Falls on You from Nowhere\" won the 2014 Hugo Award for Best Short Story.", "text": "Non-Fiction\nAnother Word: The Vaguely Picaresque Adventures of a New Writer\nIn 2012, a contingent of Chinese fans go to ChiCon 7. I think I may have chatted with all of them. The Three Body Problem, Liu Cixin’s hard SF trilogy comes up again and again. (Yes, the actual name of the trilogy is Remembrance of Earth’s Past but no one I talk to ever calls it that.) When I get home, I order it and start reading the first book. Like you do.\nA few months later, Ken Liu makes a sly reference to it on Facebook and I’m all “Hey! Are you reading that book, too?” It’s not announced yet but Ken’s not just reading it, he’s translating it into English. It turns out that he’s looking for a beta reader who’s both a science fiction writer and someone who’s read the book and would I be interested. Well, of course.\nNow, in this case, what beta reading means is not just reading then commenting on the translation. It’s cross-checking the translation against the original. In other words, translate the original then compare that translation with both Ken’s translation and the original text a few sentences at a time. What I end up doing is very much translation with occasional training wheels. For example, I take a pass on some of the wordplay and marvel at Ken’s invention instead. However, I also recreate some of Ken’s research. For example, to translate this book you need to know what songs the US military played to smoke Noriega out of the Apostolic Nunciature of the Holy See in Panama City. (By the way, no, there does not exist a John Chu translation of The Three Body Problem.)\nAt LonCon 3 in 2014, I will be on a translation panel. When I talk about this work, the translator to my left will look appalled at me and then ask why anyone would ever do this to himself. After all, it amounts to writing a translation that no one will ever read. I will counter that I learned a lot in the process. Cross-checking Ken’s work means questioning and understanding his every decision. For me, that experience was invaluable. Beta reading Ken’s work has been a master class in translation and I feel privileged for the opportunity. Of course, it’s also difficult and time-consuming. You only do this because you really want to.[Digression: As a side-effect, this makes me absurdly well-qualified to talk about Ken’s translation of The Three Body Problem. I think it’s terrific. It is highly readable and, faithful, but not too faithful. As Umberto Eco says, tradurre è tradire. A reasonable translation of that sentence may give short shrift to the music that makes that sentence so quotable (“To translate is to betray”) or present the meaning in way that’s far too obscure (“To translate is to traduce”). Time and time again, Ken steers deftly around the pitfalls. His translation gives you the sense of having read Liu Cixin even though you haven’t read his actual words. That’s really impressive. He does a similarly skillful job with the third book in the trilogy, Death’s End, which is also, in my opinion, the best book in the trilogy.]\nAt LonestarCon 3 in 2013, I catch up with Meizi Wang, whom I don’t get to see nearly enough. She translates for a living, primarily from English and French into Chinese. While we’re waiting for a reading to start, we’re chatting about her translation work, her recent vacation to Taiwan and just stuff. Tang Fei joins the conversation. Tang and I actually met a little earlier that day but we haven’t been introduced yet, so Meizi introduces me to her, mentioning how I’d beta-read Ken’s translation. As it turns out, Tang is looking for a translator and would I be interested? Well, of course.\nAnd that is how I got my first translation gig. As far as I can tell, I get it mostly because I was curious about everyone else and what they were doing.\nNow, of course, this account skips some things.\nI haven’t talked about the years I spent getting my Chinese to the point where reading a Liu Cixin novel for pleasure isn’t out of the question. As many, many people have pointed out, what the saying “Learning Chinese is a five-year lesson in humility” means is that after five years, your Chinese will still be awful but you will have learned humility. Now, as a heritage speaker, I have it easier than some. My grammar has always been relatively decent, for example. On the other hand, I’m still expanding my vocabulary.\nI haven’t talked about translating blog posts for friends. Once, a friend of mine goes to the Bookworm Festival in Beijing. One of her interviews is written up as a blog post in Chinese and I translate it for her. Doing that raises some interesting questions about the nature of translation. The interview is actually conducted in their mutual second language, English. Rendering the interview back into English takes it back to its original language, but probably not their actual words. That blog post also quotes, in Chinese, a metaphor from one of her own blog posts, which is are in English. The back-translation of the quote is actually a slightly different metaphor than her own. Which better conveys the Chinese blog post, a back-translation of the quote or the actual quote itself.\nUnexpected doors open. When I can walk through them without falling and slamming my face on the sill, it’s because my time doing what interested me has, as a side-effect, prepared me.\nHow “The Water That Falls on You from Nowhere” gets published is a mini-saga in and of itself. One of the reasons I send it out again and again is because it keeps getting these really encouraging rejections. This includes one rewrite request that doesn’t convert and the most effusive rejection I have ever gotten. It comes from Ann VanderMeer. At this point, she’s still at Weird Tales. Ann sees the story, in part, because I’m running out of markets and desperate and, in part, because she’s an amazing editor and I just want her to read it. Ann loves the story, rightly points out that it’s not a weird tale, and suggests some other venues. She also says, among other wonderful things, that if she were at the right venue, she’d snap it up.\nFast forward some months and Ann VanderMeer is announced as one of Tor.com’s new associate editors. The story is between slush piles and, of course, I haven’t forgotten about the most effusive rejection ever. I immediately wonder whether she has and whether Tor.com is the right venue. Bizarrely, I also wonder whether it’s ok for me to query and I lament that if only there were some pros nearby I could ask for advice. Keep in mind that when Tor.com makes this announcement, I am Chicon7. I can only plead temporary insanity. (To their credit, the pros I ask are all very kind to the newbie as they reassure me.)\nWhat I don’t know at the time is that, meanwhile, Ann is wondering whether that John Chu story is still available.\nAnd so, I am saved from myself. “The Water That Falls on You from Nowhere” ends up being either the first or second story she take for Tor.com. That is how I make my by third SFWA qualifying sale . . . which then goes on to win the Hugo for Best Short Story in 2014.\nTalk about unexpected doors opening.\nOf course, what I’ve skipped past are years of hard work improving my prose and, learning how to tell a story. What I haven’t talked about are the years of doing what interested me just for its own sake, which has turned out to be helpful.\nWhen Ann takes “The Water That Falls on You from Nowhere” for Tor.com, she also gives me some advice. Good work is the fount from which good things flow. I think, ultimately, all anyone can do is get better at doing the things they love doing. Everything else, it either happens or doesn’t.\nOr maybe, everything else, it both happens and doesn’t. There is a Buddhist notion of “Where does the story end?” The same story can be, for example, sad or happy depending on where we choose to stop telling it. Stories go on forever. How we classify them is an arbitrary effect of presentation. So, with Ann’s advice in mind, I’ll stop this story here.\nJohn Chu is a microprocessor architect by day, a writer, translator, and podcast narrator by night. His fiction has appeared or is forthcoming at Boston Review, Uncanny, Asimov's Science Fiction, and Tor.com among other venues. His translations have been published or is forthcoming at Clarkesworld, The Big Book of SF, and other venues. He has narrated for podcasts such as EscapePod, PodCastle, and Lightspeed. His story \"The Water That Falls on You from Nowhere\" won the 2014 Hugo Award for Best Short Story.", "source": "https://clarkesworldmagazine.com/another_word_06_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: The Vaguely Picaresque Adventures of a New Writer by John Chu"}