{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Sara Saab", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "zeAOjGXqZbKMWOKnLQccTUSPWAM=", "id": null, "license": null, "comments": "", "raw_text": "7260 words, short story  Lapis  Florid Park  Szanna, do you remember this game from the twentieth century? Skip along the informational alleys of realspace, leap the archives inter-generationally. A descending white cascade of snow. #FFFFFF. Pixelated scrub. You’re a miniscule skier. Your motor control is dampened by four low-acuity arrow keys, by the graphics cards and CPU speeds of antiquity. You ski, swerve, ski down the glare of a screen, until a yeti emerges from an offscreen hideout to devour you.  Doesn’t everyone struggle to beat the impoverished algorithm earthed in a singular fatality? You know now, as they knew then, that death is absolute, though life may be manipulated, stretched between fingers like tree gum, thinner and thinner until translucent. You’d tell this to Nouri if he asked you again: to subvert death is an abomination. You missed your opportunity to say it long ago. You’re here to give yourself a second chance. Maybe give him a second chance.  In the distance, the habitat is color-saturated, washed in light. You stop a moment to look, breath fogging. The saturation has nothing to do with the late afternoon light and everything to do with the habitat’s shortfall of nanos. You’re trekking east through Florid Park, veering away from the half-mile-wide cusp of bioshacks on the horizon, navigating toward the Park Service outpost you are obliged by permit to check into by sundown.  Under your feet, small life crunches. You are cold. Your baselayer, nanoblocker, windproofing—none are Florid Park rated. It’s been hard walking since you entered by Lesha Gate, an unbroken afternoon of it. But the trekking is not the challenge. You have walked the parkland trails down to dirt. You’ve traveled the informational frontiers your whole adult life, mapping bonespace into realspace, stone and dirt and fabbing into archival infinities. You’ve got 880 hourcreds of rough terrain hiking to show for it, two royal trailwalking Nods, and if you cared enough about such things you could qualify as a walking guide to galactic-iso standards. You don’t.  The immortal who meets you at the outpost doesn’t greet you or give a name.  “Agent, Park Service,” is all she says.  “Szanna. On the Hectare Lab permit.” You push the permit to her in realspace.  It’s hard to tell for sure, but she seems to be waiting. She finally nods. She is uninterested in you, but you are very interested in her. You study her face. You note the long-growing ears, sculpted lobes, and aquiline nose indicative of immortality, the lack of folds around the smile packed tight as the patchy snow beneath her polydown-stuffed boots. She approves the permit and sends you maps of Florid Park, all its leafless copses and crops of boulders and snowy open fields. You remember the ancient game, Szanna. The game with the skier and yeti.  “And the assistant you registered?” asks the Agent. In realspace, she pushes you Maschou’s card.  “She couldn’t come.” The permit, which you worked a personal contact to obtain, didn’t extend to two. “But we should go,” you say. “I have three days to fill the whole habitat in.”  The Agent looks at you dully. You test out a smile.  “This map is the main distraction at a Lapis Colloquium in a few nights, according to the client brief,” you elaborate. “Hectare Lab builds these playable archives all the time. We find you can’t skimp on detail.”  “It’s a short walk there,” she says. She hefts a pack and does not offer to supplement your thin outerwear, your scant supplies. But neither does she challenge the rating of your blocker or prophylaxis. For that you’re grateful.  Szanna, you march behind the Agent and do not look too closely at the birds stark against the trees, at the evidence of nanofuzzing like static between their feathers. You do not want to know how the intelligent selection plays out, which colonized birds will live, and which succumb. Which of them are intended, and which mistakes.  You squint. In the distance, specks resolve into people moving near the edges of the habitat. And in realspace, you’re unlocking the Agent’s locale packet. It’s sparse, some waypoints, a main track, some habitat zoning. But if it were any less sparse, you wouldn’t be here with the mapping permit you’ve got.  In bonespace and realspace, you search for Nouri.  Do you remember this game from the twentieth century? They called it the Game of Life. Drab gray board, yellow tiles. Gray for death and yellow for life. Each round of gameplay would step forward a simulation of natural selection, proliferation, population decline. You imagine each yellow tile unpacking and spreading wings and taking to the treetops; you imagine Nouri a solitary blip in one corner, huddled in on himself.  And how many rounds does it take to flip Nouri’s tile to gray? The answer is too many rounds. As many as the grid endures.  Avicenna Park  There was a game you’d play with Nouri before you were grown. It was called The Immortals, and in the nonsense way of games it had nothing to do with life or death, but also everything to do with both. Once, with bare hands, the Nouri of your childhood scalloped a den inside a hedgebush on the border of Avicenna Park. The park beyond was golden and hazy with airborne sand. The royal desert, you two called it, because it was maintained by the private park service of the ruling family. (Somewhere inside, the foundations of Hectare Lab had just been poured, though that was nothing to you yet.) It was nearly nightfall and you were warm with chasing and falling, and with imagination. In you went, into the heart of the hedge-den, Nouri first, you squeezing in after. The prickly bush left lazy welts along your arms.  “We’re the immortals now,” said Nouri in the perfect quiet. He was forty-three days younger than you and you never let him forget it.  You began to skip through the realspace archives, looking for some suitably regal concerto to fill the silence.  “In their hideout, the immortals do not go to realspace,” Nouri chided.  You snapped back to bonespace. “What do they do?”  “They make life better,” he said, “for everyone.”  Nouri did not explain the practicalities of making life better. You remained there with him for hours, fighting cramp, disappeared from the world. You leaned back on your elbows and stomped your feet when they deadened. The sun began to set outside. The humidity was brimming with the scent of eidergraze sap. Nouri fell asleep against you. You didn’t wake him. Later you were reminded that the desertland of Avicenna Park was freezing at night, cold as an atmosphereless planet, as cold as you are now, aged thirty-nine, and mortal.  You did not leave bonespace until Nouri woke and led you back, shivering, into purple night.  “Next time, we’ll go all the way in,” he said, turning to face the Ghosh Gate of Avicenna Park.  You felt the cold then as a burning. Only your heart kept going through it.  Florid Park  You choose the first of the habitat’s structures to map, a bioshack on the outskirts of a domestic zone. With the Agent trailing you like this, the pestilents don’t come near. They are preparing meals, immersion meditating in ones and twos, fabbing clothing, quietly conversing. You squint downcast eyes, dazzled by the light—it’s like nothing you’ve experienced. All varietals of nano from the Upgrade onward are programmed to avoid the pestilence—you know this—but what shocks you is how different the world looks unfiltered. It scares you, makes the usual presence, somehow, loom.  You stop when the bioshack is within arm’s reach. The Agent is unceremonious. “Begin.”  To start a map from bonespace to realspace is as easy as forming a new thought.  You informationally lasso the bioshack, taking a rough model of it for your realspace map. Then, walking around it in bonespace, touching it with your hands, examining, you lance it, sampling informational layers, the textures and movable parts, the doors and windows and latches.  (This, to you, is a kind of freedom, is expansive. Is, perhaps, a variety of immortality.)  In moments, the outside of the bioshack is mapped in. You’ll do the interior later. You turn to the Agent, gesture toward the next structure, a water generator behind the grilling station where pestilents are gathered, stirring something thickly bubbling. A scent like molasses carries in waves with the breeze.  A few look up at you. Their hands slow. “They’re cooking homemade nanoblocker for their eyelids and nostrils,” says the Agent from behind you. Her voice comes from a great, unaffected distance. “They’re trying to lower the load in their cortical matter, and since their nanos conduit over mucous membranes—”  “I know,” you interrupt, gently.  When you see Nouri among the pestilents at the grilling station, you don’t recognize him at first, and you think your dazzled eyes are to blame. You would have sworn you’d know Nouri anywhere, any way. You know his face better than your own, even this changed face of an immortal-gone-wrong, the blanched-brown nanoburn patches up his neck and across his brow. He’s older, but not yet immortal-old, not so old that the elongated ears and nose have given him that vertical countenance.  You turn away before you know whether he’s seen you too, before his reaction betrays you. But your own face must be enough of a tell, because the Agent snaps, “I will supervise interactions.”  In realspace, you receive a line clipped from the permit agreement you didn’t bother to read. The Park Service’s data-chained signature is a golden plait in the corner.  “For your safety,” the Agent adds. Not for the safety of the pestilents. That ease of abandonment, from one immortal to a lesser other.  Out by the water generator, the wind slices. You begin to map. Szanna, you’re very cold. To your fingertips the world is gauze and extruded foam. You tamp down the urge to call Nouri’s name, to walk right up and tug him to your chest. Your prophylaxis is experimental, and Nouri must be teeming with pestilence. Still. If not for the Agent, you know what you would do.  Instead, you visualize a gauze-stuffed throat. Call it silent. And call it your own.  And then you build him a game.  You map in the water generator. There’s a condensation pole of four spires, a sectioned moat, a graduated filtering chamber. You map the spires into realspace, and in your own private instance of the map you add colored pennants. To each of the moats you add game pieces in the shapes of the finest lapis cuts: brilliantine, princess, convex, diamantine. To create movements of play, you add a truth-detector sensitive to tone of voice, a series of debate topics, a role of interlocutor and respondent controlled by a pair of badges. You declare the rules of the game: it’s a race to lower the pennants down the pole. The debate topics, you store in the filtering chamber, embossed on the bellies of golden fish: About immortality. About the flesh. About desire. About secrets.  Then you embed the prize: the package of code you and Maschou have been developing at Hectare Lab for the past five years. You tie it in a bow.  This is the game you design for Nouri, Szanna. You finish the official map of the water generator, closing it with your maker’s plait. And there, over your shoulder, is the Agent, pacing. Wherever she goes, the pestilents leave a wide berth.  If you could get Nouri to handshake with you, exchange cards, you could give him the game. And if you two could find somewhere to immersion meditate without arousing attention, you could play a round. And if he wanted to win, you could help him win.  When you look for Nouri this time, you’re subtle, the movement of your gaze a movement of clouds. And when you spot him again, he’s almost gone: heading out past the edges of the habitat in a group, in the grips of nanofever, driven by an imperative he can’t resist.  Later, as the day dims, the Agent shows you to your bioshack. You stab praying hands into the nanofat membrane, let yourself in. Two foam pallets, a wet corner, a bidet, and a clothes cycler. It smells of new fabbing layered over the burned milk of the nanofat.  You lie down without undressing. You drift off chanting: about immortality, about the flesh.  Florid Park  Do you remember this game from the twentieth century? Cast back. A game board is scattered with hidden mines. Concealed in the game board are clues. Heed the clues and you’ll know how many mines to look for. Sometimes, the game unravels for you, satisfying as a snarl of rope. Sometimes, your very first touch is doomed, a fate you are helpless to prevent.  Szanna, on the second day, you ask the Agent for a pestilent. You’re heading for the habitat’s hospital, a silo towering over the bioshacks. It’s the biggest structure you’ll need to map. “Can one of them help with the ladder?”  “If you like. You’re waivered; you’ve declared blocker and prophylaxis,” the Agent says. There’s no danger to her, after all, only to you. Florid Park is her home. Her nanos will of necessity be an impervious blend, made by Royal Warrant and restricted by Decree.  You scan intently for Nouri—the Agent sees this, thinks you’re scowling at the desolation.  “The Park Service thinks in centuries, not years,” she says. It’s the first time she’s volunteered information. “Florid Park will spawn fantastic ecosystems in the future. The mix of evergreen life and nano. The temperature range is perfect for spawns of modded bios. Low precipitation too.”  You run your hand over the door fob of the hospital. It’s defunct, undiscoverable in realspace. A manual lock has been installed below it.  The Agent says, “The pestilents are happy here. They could live here forever.”  “You mean, you’ll make sure they live here forever,” you say before you think.  The Agent’s eyes, when you meet them, are intrigued for the first time. “What is it you think we’re doing here?” she asks wryly. “The pestilence is as resourceful as it is corrupt. You hate immortals. Do you envy us? Resent the sureness of your death? Feel noble to have a beginning and an end? Or are you sorely tempted to live forever, but terrified of what you might become?  “Whatever it is you think—Florid Park’s nanome is a barrier. You might not trust the mechanisms that are protecting you. But the fact remains—they are protecting you.”  You point across the habitat. In the industrial zone, Nouri is scooping and sorting something into three different sacks. “I want him. The tall one.”  Avicenna Park  And here is a game which is not a game. You are young, Szanna, though older than the evening you spent nestled in the hedgebush. You’re old enough that the game in the hedgebush makes you blush, the thought of you tucked in, your joints and corners and angles, and Nouri right there.  This game is: you and Nouri and Maschou walk together from Partridge Perch to the small gazebo in the Pasture of Buffalo. The game which is not a game is that you do everything to avoid Nouri’s eyes, though sometimes his eyes seek yours, all of him craning over, his new adolescent frame long and undernourished and potent with hungry bones. Nanos have never yet touched his marrow.  “So would you?” he asks you both, looking from your face to Maschou’s. “Live forever?”  Immortality has only newly cut away from the banquet halls and ballrooms of the royals. The immortals are, for the first time, on the streets. Szanna, you’ve known from very first awareness that it will never be for you to cheat death. But you do not say this.  “If I was sure it was safe? If I was sure I’d still be me,” says Maschou, after solemn consideration.  “Well?” says Nouri, turning to you. He does something he’s never done before. He takes your hand. Your lungs quiver and the walking cadence of your breath stalls. You look at neither of your friends. Ahead of you, the small gazebo in the Pasture of Buffalo appears on the horizon, its decorative curlicue spearing the sky’s flank. Also on the horizon: a whole, full life yet to be settled on. This particular game, Szanna? Holds a thrill you’ve never felt.  “Maybe,” you stall. Your bluster seems an evident fake in your ears. “Would you?” you fire back.  “Have this forever?” says Nouri, spreading his arms. “I’d do anything.” And he cranes over, and smiles directly into your eyes.  Florid Park  You and Nouri handshake privately. In realspace, he blooms, immediately there. A negative space you’d scarred over since the expiry of his last handshake returns to presence.  In bonespace, he is aloof, even a little rude, ruder to you than to the Agent. He sneers at you, airgaps your bodies, which of course he’s obliged to do—the public health Decree. But he exaggerates, seems all too willing to keep his distance.  When you request it, he allows you to form a sensory chain, awkwardly scales the sandy rungs up to the hospital’s silo roof, runs his hands over and under panels and ports and receivers.  You think maybe it’s that he has forgotten. But then in realspace he tunnels to you, and blurts, “Szanna. It’s too late.”  You don’t ask what late means to an immortal.  By way of apology, you send him the game you made—with the water generator, the pennants, the fish.  “Maschou tried to be here too,” you say in realspace.  Nouri replies with that old deep-bass pulse, his version of an affirmative.  “This game looks fun,” he remarks after a while. “We should find a moment to play.”  In bonespace, he’s squatting on the roof of the hospital, gently lifting insulation foam, lancing down to the rusty layer below. You chain his informational feed into the realspace map, hungrily painting in the structure. It’s satisfying the way a long-awaited meal is satisfying.  “We’ll certainly play it,” you say. “We’ll need a bit of privacy to immerse.”  His affirmative pulse comes with a lilt at the end. In realspace, this is how Nouri grins.  “I’ve missed Maschou,” Nouri says. “But I think I’ve missed you more.”  Avicenna Park  There is a corner of the royal desert that feels to you like home.  The path is badly marked, the trees pristine and unmodified. The wind makes a racket of the branches and throws flights of dust into your eyes until they stream beige tears.  In this corner of Avicenna Park is Hectare Lab, commissioned twenty years ago under the Royal Family’s Realspace Charter, decommissioned ten in favor of centralized governance. Your work permit, long expired, unlocks the gate for you every morning. A miracle.  You meet Maschou there. Every day should be the day she does not come. To be children together, to happen to be selected under the same Decree, was one thing. But for her to come daily to a decommissioned Hectare Lab, to do what you ask, uncompensated and unenlightened? She helps with both the covert real work and the public front for it—the realspace maps that you sell to private sponsors, affording you both operational legitimacy and income. You expect Maschou to steal the pestilence cultures, the prophylaxis cocktails, the permits, or the thermal cycler, any one of which she could sell on the gray market for enough to live on for a year. Szanna, you would not fault her if she did. She is owed a lot. But she comes. And does not leave, and does not take. For five years, she has come.  It took you half of those years to tell Maschou why you were doing this. What Nouri’d done. Before that, what did she think? And when she understood, what did she think? You see the way she looks at you. And you think you know why she stays.  Florid Park  Hours later, in the middle of the night, when the Agent’s breathing beside you has slowed, you stretch your nanoblocker over your body, arrange the windproofing on top, stand, and urge yourself back to life. Szanna, you are so much more expectant than afraid. You emerge into freezing cold, into pitch dark. You navigate in realspace, using the rough habitat map. In bonespace, you are shivering so hard you’re amazed to be moving forward. You crouch-run the length of your domestic zone. When you find Nouri’s bioshack, you kneel, widen a space in the nanofat. Crawl inside, violently shaking, reckless and punch-drunk with proximity.  In a belated heartbeat, Szanna, it will occur to you that the Nouri you’ve found here is not the Nouri you once knew. This Nouri stirs on his pallet. You pull your blocker as far up your neck as it will go, take a step forward. Not for the first time, you doubt the prophylaxis that Maschou fabbed for you. Neither of you knew exactly what versions of the pestilence might be in Nouri’s colony. Your cocktail is educated guesswork.  “Can I touch you?” you ask from beyond the airgap. “I’m protected.” You sound so dangerously sure.  Finally, his muffled voice in bonespace. Beloved. “Szanna—”  He sinks into quiet and you are drawn by the silence, drawn bodily forward. You’re on your knees when you see the feathered mess he’s holding against his flared nostrils. He is streaked with avian blood and nanofuzz.  “A pre-Upgrade varietal?” you ask. “How’d it get into Florid Park?”  In realspace, his voice is steady. “Park Service calls this a closed system. The pestilence encircled by impervious varietals for miles.” He shifts minutely, creating an overhang of space on his pallet. “But no open-air quarantine could ever be fully tight. Not one enforced by aversion.”  Nouri scoots a little further, Szanna, ’til the space on the pallet is the width of your body. He does not disturb the placement of the dead bird he’s siphoning to diversify his colony. You know that inside of him, something is happening: first, the pestilence reprogramming the new arrivals until they too are the pestilence. Then, that formality dealt with, there’ll be round after round of selection. For more efficient algorithms, new imperatives, a faster colonization drive.  The goal of his colony is to keep Nouri alive forever. A side effect of this goal—swiftly traced to a bug in the orchestration routine of pre-Upgrade varietals, corrected in new varietals during the Upgrade, but never demonstrated to be patchable in an established colony—is making him sick.  “Remember the game I sent you?” you ask, and mark it for him in realspace. “Can you immerse here? With me? I need to show you something.”  “I don’t think I can right now,” says Nouri. “I’m too activated.” You note that he chooses that word, activated, over the other, aroused.  He sets the dead bird to one side and holds out a bloodied hand.  Maybe it’s his lucidity, the fact that he seems there, seems himself. Whatever it is: you let yourself fall. Your knees hit padded nanofat. You fill the space he’s left open for you, let his heat smother the trembling, and you pray that Maschou’s prophylaxis will hold, that the nanoblocker will be better than useless. Because otherwise you are defenseless, Szanna. Are, as you’ve always been.  Avicenna Park  Summer is your season. It turns Avicenna Park rouge and planetary. You return from six months of tutoring at the Royal Science Boarders’ House, a whirlwind of cramming and barely edible canteen meals and experiments failed and retried. This half-year, you’ve taken your first ever round of prophylaxis against the pestilence—and by broad spectrum, against immortality too. Adolescence and prophylaxis are all mixed up in your bones. Nanos are a fact of life now, and so is the mutability of death. Immortality slowly permeates your list of acquaintances, then friends, then distant relatives, dribbling down from the wildly wealthy to the lavishly well-to-do. So far, their gambles are paying off. You know of nobody with the pestilence, but lots of somebodies who won’t ever die.  You’re so tired your first night back from boarders’ that you elect to eat dinner pacing the long carpet in the dining room to keep from nodding off. You split gravied dumplings with a tine, plate balanced on your forearm, while your mother and sister catch you up on their news.  After updates on the weather, the gardening, and any local interest rumor your mother has found credible enough to share, this—“Nouri came by this morning.”  Wakefulness blossoms, brain stem up. “He hasn’t spoken to me in a while,” you say tentatively.  “He said that if you have time tomorrow, you ought to meet him out at Ghosh Gate. He said his day is free.”  Your ribs tighten like a belt, Szanna. His day is free spirals into a hundred lives that Nouri lives, here, where you both grew up, on the border of Avicenna Park. You know he refused his placement at boarders’ house, and also that he has been living with his mother and her younger children, his mother who stuns the neighborhood with her extravagances, her stone-sequined coats and deliveries of handcrafted furniture and her bloodline stake in at least one of Avicenna Park’s lapis mines.  Nouri, the eldest, the forgotten, but forty-three days younger than you, green plum of your heart. (He doesn’t know that. Can’t ever know that.) You meet him in the dripping croaking heat of dusk. He gives you a generous hug that tells how he hasn’t been worrying about this moment all day. The idea of you through his eyes gives you uneasy double vision.  You two enter Avicenna Park through Ghosh Gate. Nouri looks like he’s been sweating in the weather, something thick about his cheeks, his rise of color a desert sunset. His lips are wide and behind them his teeth sparkle. He’s grown up. The effect is intoxicating.  “It’s wonderful to see you,” he says in bonespace. “How has your year been?”  You tell him. About the time you ate an entire celebration cake on a dare and were so severely ill they had to nanoflush your guts in the infirmary. About the group of girls who were unkind because no one in your bloodline had ever received a Nod from the royal family (at this, Nouri rolls his eyes), about the boy you thought you secretly loved (Nouri, attentive, what happened?) but who turned out to be an emotional celibate on exchange from the Royal Priesthood, about the endless rounds of prophylaxis—the transient nanococktails teaching your bones and blood something of resistance—  “Prophylaxis? You?” says Nouri, stopping.  Around you, Avicenna Park is this peach-skin landscape. You’d forgotten the citrus and alkaline scent of the yellow dust, here. An ibis calls out, shrill and short, from one of the many streams burbling through the rocks.  “Yeah, me. I mean, me and everyone. We had no objectors.” You didn’t think this was controversial. “And . . . you?” You spit it out before you have time to be afraid of the answer.  Nouri laughs, now. “Not me.” He half-steps onto a jutting rock, bounds into a circle of dust, stamping two boot prints, and circles back. There’s always been something springy about how he carries his body. Still true, you note, now that he inhabits the body of a man.  “Honestly? I went somewhat the opposite way,” he smiles coyly, and he’s walking over, breathing a little hard, and you stop strolling, and he comes over, and you can smell his skin and see the row of fine hairs between his eyebrows. He licks his lips and you stop breathing. You have dreamed this more than once.  Then he does something you’ve never seen anyone do, only heard about. He furs his tongue against his front teeth, and sticks his tongue out flat as a pounded fillet, and you see them, his colony. Among the pink tendrils of his taste buds, a prismatic wave of metal.  “No,” you say. Because you never thought he’d—because the risk. Because the pestilence. The cerebellum deactivation, spinal fluid clots, loss of sense of smell, ocular colonization leading to visual artifacts, the dun pigmentation of the skin presenting with cyclical fevers and a progressive degradation of executive function . . .  “Do you want to live forever so badly that you’d risk eternity in a body that isn’t yours to control?” you whisper, heartbroken.  Nouri rakes his hair back. His eyes twinkle. “Small risk, big reward. And that makes it a good game,” he says.  Florid Park  The Agent walks you to the immersion theater—a bio-fabbed structure about four times the size of the domestic shacks. You’ve already mapped the outside; today she keys you in. In about half the seats, pestilents are in gecko pose or vertical repose, immersion meditating. The white noise in the background is barely audible. You think it’s supposed to be the sound of the padded drills in a lapis mine, but it might be wind in the leaves.  You’ve hidden last night’s realspace archives, obfuscated your conversation with Nouri, the long stretches afterward when neither of you said a thing—to your guilty conscience, just as telling—but when you ask the Agent for Nouri’s help again, she shakes her head no.  “Do it without help.”  You work, Szanna, your body replaying more than your realspace archives hold. Never before has bonespace felt this much richer than the world of information.  You’re thinking of the hours you spent as close to Nouri as the barrier of skin would allow. Szanna, there’s a tumult inside you. You wonder whether your touch was too intimate, the skin-to-skin interface too perfect, too slick, your prophylaxis too weak.  A note from Maschou snaps you back. “Permit extended.”  And a moment later, the Agent elaborates, “Your assistant sent her approval through. She arrives this afternoon.”  You meet the question in her statement head-on, and with complete honesty. “That’s lucky. I didn’t think she’d make it. We have a lot left to do, and not much time.”  So. Maschou managed to work her personal contacts too. Maschou’s always been resourceful. She could beat an immortal at a game of resourcefulness.  “Your assistant has asked for a walking guide. I will meet her at an outpost midway,” the Agent says testily.  She edges between you and the communal table you’re filling into your map, forcing your hands off the polished, fabbed wood. Every peaked bone in her face, every missing blemish, the oil slick of her nanocolony on the wet dipped crease of her lip, is suddenly yours to pore over. You can’t hide your fascination.  “I don’t trust you, Szanna from Hectare Lab, but I don’t care about you either. Immortality is yours to take or leave, the pestilence yours to risk. My duty is only to protect the parkland.” She hitches her pack, readying to leave. “As a kindness, I remind you to value your life. These unfortunates—” the Agent gestures at the pestilents meditating or communing in hushed tones “—are not in control of themselves. Any one of them could end your life without meaning to.”  She heads for the door. Pauses. “Death must seem a trifling thing to someone like you,” she says, “but even then. It is a trifling thing with no hope of return.”  Do you remember this game from the twentieth century? The armored tank will be protected at all costs. A brick wall surrounds it. A bevy of defenders trawl the game board, hunting intruders. You are an intruder. Your objective is to breach these defenses. Your objective is to eliminate every defender, restore normalcy. Your objective is not to be blown apart yourself.  Bahr Khalyy Openspace  Maschou and Nouri knew each other first. You piece together a mercantile family relation dating back to before your friends were born—Nouri’s mother trading rock lapis through a network that shipped off-world; Maschou’s family managing allowances for the tradership, specializing not in the operational side of this, but in the shadowy art of influence that generated a reliable stream of Royal Decrees and Nods.  “Let’s go somewhere else,” Nouri says, slowing as you approach Ghosh Gate.  You’re nine years old, just old enough to think of your life as a ribbon on which you are in motion, one with a beginning and an end.  Last week you’d asked Nouri if you were his best friend, and he said yes, but Maschou a close second. “But who is Maschou?” you asked.  “You don’t know her,” he’d sniped, and a foul-smelling flower blossomed inside your rib cage.  But today, you will know her. Nouri takes you to a dry lake bed called Bahr Khalyy. The kids never choose it over the royal desert, finding the barrenness here boring. But what Nouri shows you is that the openspace is rich in surprise: the eggs of amphibians pearl everything. Gnats cloud the air, iridescent in the beam of his blacklight torch.  He takes you to a hole in a hedge. “I told her to meet us here. Maschou!”  Here she comes tumbling out to the sound of snapping twigs: a girl big for her age, a sprig tangled in her fringe, and with a smile so unguarded that when she meets your eye it takes you momentarily aback. She sends her card in realspace; you’ve got a weird reflex to bounce it. But you don’t. You handshake. She sends a pulse of pleasure.  “How many hedges have you carved into hideouts anyway?” you ask Nouri, shy from the newness.  “You never know when you might need a place to lay low,” Nouri says, pulling you by the hand.  “An immortals’ court,” Maschou corrects him. She turns to you. Her smile is bold. “Check it out inside.”  “Wait,” says Nouri, blocking you with his body. It’s unfair that he’s stronger than you, though you’re the same height. “You have to swear to keep the secret. Hideouts only work if no one knows about them.”  “I promise,” you say. Maschou grins. The three of you Pact in realspace.  Florid Park  As soon as the Agent is gone, you go looking for Nouri.  Inside his bioshack, the air is settled. He’s not there. You emerge again into that glaring light. You check the grilling station. Behind the squat silo of the hospital, a group of pestilents chants in dissonant choir. No Nouri. You swing wide of them, head for the perimeter of the habitat, thinking you’ll go around once, scan for him.  You don’t need to go far. Nouri, there. At the back of a group heading for the tree line with that unmistakable cant of nanofever. You up your pace, catch up, and fall into step with him. Ahead of you, the pestilents walk briskly, favoring their forefeet, that well-documented cerebellum colonization, the overbalanced stride.  You consider your own feet, blistered and weather-burned despite your meticulously high-fastened boots. You consider the shape of your footfall. You think of Nouri’s body right against your own. Nanocolonization takes an instant or a year: it’s programmatic, not proliferative. You look around you. You fear the pestilents and fear yourself.  “I need to talk to you,” you say to Nouri, in realspace. “There isn’t much time.”  “Do you remember the first day of your life?” replies Nouri in bonespace, answering himself without giving you a chance: “Yes. The sun path was twenty-two degrees and four hours; the moons were both waning; the temperature was above average for the day. Rain misted in my hair. My mother was a celestial body.”  “Nouri,” you insist in realspace—you grasp his arm, and in the bravest motion of your life, tug him away from the group, into the dappled shadow of an outlying tree.  (You had no idea what strength to expect of this different Nouri, immortal-in-nanofever Nouri, but he’s so yielding, Szanna. So very like dough. His bones could be jelly.)  “Do you remember the second day of your life?” Nouri asks. “You immediately crawled. You immediately hid. The game began, the hourglass turned.”  “Look at me,” you say with sudden certainty. Your breath mists, swirls into his. His bottom lip is trembling. Nanoburns crawl in elaborate fractals into his hairline. “Take me there. Take me to the hideout.”`  Caesura  Szanna, do you remember this game you’d play? Every day, you’d swap one ugly thing for a beautiful one. You began in the world of information: every item you touched in realspace, you made better. You pored over every archival game from the twentieth century, enriching wikis. You built emulators to run primitive code, added secret levels, kinder enemies. You overlaid several archival layouts of early lapis mines to create fuller composites, added anecdotal waypoints to maps of off-world caravan routes.  Some days you looked to bonespace. You were not as miraculous as a colony of nanos, but you could make the world better in your small ways. You collected replicas of playing cards and game pieces. Printed textured maps on archival paper. Knitted gloves for the lapis miners. Every day you planted a seed. Most were informational, but some were organic. You ended up in your thoughts. You would clear out the ones that hurt, and give their scars several days to scab over. You’d come back from your rough terrain hikes reeking of your body, meet Maschou for mixed fry or dumplings in yellow broth. She held her nose, exiled you to the far side of the table. You went and did not protest. A feeling jabbed your mortal heart, a good feeling, metronomic. It said: beat until you can’t.  And some days, in the distance, beyond these vistas of your life, did you think you spied infinity?  Florid Park  Nouri takes you to a copse of trees gnarled with tendrils of fern. Nanofuzz sparkles on every patch of moss, every brush of kir, in every teardrop of tree gum.  “Is it safe for me here?” you ask in bonespace.  “Safe? Safe is a fallacy,” says Nouri, trudging ahead of you, breathing loudly, dripping fever sweat. You sense him trying to project sobriety, but everything about him is a giveaway. “No one is safe anywhere,” he adds. “Even immortality doesn’t mean safety.”  —In realspace, Maschou opens a tunnel, pings you a locator. She has entered Florid Park by the north gate. You ping a locator back—  “Remember, a Pact is a Pact,” says Nouri, and waves you toward a fern curtain hanging from the interlocking root system of a trio of kir trees, each tree immense, building-sized. “In here.”  The fern crackles with nanofuzz. You cover your eyes and nose, dive through it, bend and crawl, barely breathing.  And in a moment you emerge, Szanna.  What has Nouri built?  An immortals’ court.  Towering hall, bubbly nanofilms moving like animated stained glass on wounds in the tree trunks. Thrones of moss and rock. Intricate tapestries stitched from the delicate bones of birds. The light here is soft and the air rich with sap. Tiles embedded into the earth under your boots are scales from pine cones and scales of kir, dark brown and light, inlaid in hoof patterns around a central medallion.  It’s the work of a lifetime, Szanna. The project of a life that has many chapters left, even if it’s a life warped thin and translucent between two fingers.  You breathe a heavy breath. Your heartbeat is irregular. Gullible, fallible.  “Do you think this makes life better?” asks Nouri, looking around. Even refracted through his fever, the sincerity of his question bruises your heart.  “Immerse with me,” you say softly. It’s quiet here, and safe. You open a realspace tunnel, obfuscate your conversation stream, hide the both of you as well as you can.  In realspace you mark the game again. You flutter the pennants on the condensation poles, rock the gleaming game pieces in their moats. “Maschou and I. We designed this for you. You just answer the questions. If the prize is what you seek? Then the prize is yours.”  “You designed a whole game for me?” asks Nouri. “Why? How long did that take?”  “How long did this take?” you counter, evading, spinning around.  “Years,” he says in bonespace. “Years.”  He says it so sadly you almost forget how many years he has left.  Bahr Khalyy Openspace  The first game Nouri ever showed you from the twentieth century was the paper fortuneteller. He taught you how to make one from the flat papery leaf of the basalt tree growing by the creek in Bahr Khalyy. You were one day older than ten. He was forty-three days younger than you.  It remained your favorite game into adulthood. Out hiking, to distract yourself from cold or blisters, you ordered laser cuts of stiff silks and vegetable paper and oliosheet, dyed pastel colors. You made hundreds. Spelled enough fortunes to fill a royal almanac. One fortuneteller you encrusted with lapis pebbles Nouri’s mother had gifted you. They shone when the origami flared open. You held your fortuneteller pinched tight, a universe before inflation, and asked it about Nouri, about Maschou, about immortality. About every unlived year of your surprisingly persistent life. You picked numbers, picked colors. Picked death, picked life, picked death, picked life.  Florid Park  You open your eyes to Maschou’s face. You think, half-dreaming, that you are at boarders’, that Maschou is here to wake you so you don’t sleep through canteen again. You itch where your skin sticks hot to skin; you itch where pine cone scales have pressed wedges into your hip, into the small of your back. You untangle from an unconscious Nouri and the remnants of the coupled gecko pose you’d both been in, immersion meditating. Your body is sore.  “Szanna,” says Maschou. She reaches out an arm. You take it. Her grip is sure. Has always been.  “We don’t have long,” she says. “They’re looking for you both, but they’re looking out toward Lesha Gate. Let’s head east.”  Maschou pulls you up. Your legs are crowing pins and needles. You do not feel much like yourself. You turn to look at Nouri, twitching, nude, his chest rising heavily. You trace backwards from the last thing you remember, then push forward, analyzing the game you and Nouri just played. Your questions, his answers. About immortality. About the flesh. About desire. About secrets.  But you’re too startled, your placid mind suddenly stormy with fight or flight. You remember playing, but you can’t remember who won.  “Did it work?” you ask Maschou.  Her brow furrows. “Give it some time,” she says. “We’ll know eventually. So will he. Then maybe we can just ask him? Ask him plainly if he’s happy.”  She puts an arm around your shoulder, cloaks your body with Florid-Park-rated windproofing.  “He will live, one way or the other,” Maschou says.  “Thank you,” you say. Sensation begins to return to your limbs.  You cover your eyes and nose as you crawl out between the tree roots.  When you uncover your face, you look behind. The immortals’ court is an absence. A hollow, a heavy appearance. The calm sway of the disturbed fern, the gyring tinsel of its nanofuzz, is the only sign that some misguided someone—here, and everywhere—has been trying and failing to make life better.  You pick your way toward the east gate of Florid Park, Szanna, with Maschou at your side. Living or dying, mortal or not. Sara Saab was born in Beirut, Lebanon. She now lives in North London, where she has perfected her Resting London Face. Her current interests are croissants and emojis thereof, amassing poetry collections, and coming up with a plausible reason to live on a sleeper train. Sara's a 2015 graduate of the Clarion Writers' Workshop. You can find more of her on Twitter as @fortnightlysara.", "text": "7260 words, short story\nLapis\nFlorid Park\nSzanna, do you remember this game from the twentieth century? Skip along the informational alleys of realspace, leap the archives inter-generationally. A descending white cascade of snow. #FFFFFF. Pixelated scrub. You’re a miniscule skier. Your motor control is dampened by four low-acuity arrow keys, by the graphics cards and CPU speeds of antiquity. You ski, swerve, ski down the glare of a screen, until a yeti emerges from an offscreen hideout to devour you.\nDoesn’t everyone struggle to beat the impoverished algorithm earthed in a singular fatality? You know now, as they knew then, that death is absolute, though life may be manipulated, stretched between fingers like tree gum, thinner and thinner until translucent. You’d tell this to Nouri if he asked you again: to subvert death is an abomination. You missed your opportunity to say it long ago. You’re here to give yourself a second chance. Maybe give him a second chance.\nIn the distance, the habitat is color-saturated, washed in light. You stop a moment to look, breath fogging. The saturation has nothing to do with the late afternoon light and everything to do with the habitat’s shortfall of nanos. You’re trekking east through Florid Park, veering away from the half-mile-wide cusp of bioshacks on the horizon, navigating toward the Park Service outpost you are obliged by permit to check into by sundown.\nUnder your feet, small life crunches. You are cold. Your baselayer, nanoblocker, windproofing—none are Florid Park rated. It’s been hard walking since you entered by Lesha Gate, an unbroken afternoon of it. But the trekking is not the challenge. You have walked the parkland trails down to dirt. You’ve traveled the informational frontiers your whole adult life, mapping bonespace into realspace, stone and dirt and fabbing into archival infinities. You’ve got 880 hourcreds of rough terrain hiking to show for it, two royal trailwalking Nods, and if you cared enough about such things you could qualify as a walking guide to galactic-iso standards. You don’t.\nThe immortal who meets you at the outpost doesn’t greet you or give a name.\n“Agent, Park Service,” is all she says.\n“Szanna. On the Hectare Lab permit.” You push the permit to her in realspace.\nIt’s hard to tell for sure, but she seems to be waiting. She finally nods. She is uninterested in you, but you are very interested in her. You study her face. You note the long-growing ears, sculpted lobes, and aquiline nose indicative of immortality, the lack of folds around the smile packed tight as the patchy snow beneath her polydown-stuffed boots. She approves the permit and sends you maps of Florid Park, all its leafless copses and crops of boulders and snowy open fields. You remember the ancient game, Szanna. The game with the skier and yeti.\n“And the assistant you registered?” asks the Agent. In realspace, she pushes you Maschou’s card.\n“She couldn’t come.” The permit, which you worked a personal contact to obtain, didn’t extend to two. “But we should go,” you say. “I have three days to fill the whole habitat in.”\nThe Agent looks at you dully. You test out a smile.\n“This map is the main distraction at a Lapis Colloquium in a few nights, according to the client brief,” you elaborate. “Hectare Lab builds these playable archives all the time. We find you can’t skimp on detail.”\n“It’s a short walk there,” she says. She hefts a pack and does not offer to supplement your thin outerwear, your scant supplies. But neither does she challenge the rating of your blocker or prophylaxis. For that you’re grateful.\nSzanna, you march behind the Agent and do not look too closely at the birds stark against the trees, at the evidence of nanofuzzing like static between their feathers. You do not want to know how the intelligent selection plays out, which colonized birds will live, and which succumb. Which of them are intended, and which mistakes.\nYou squint. In the distance, specks resolve into people moving near the edges of the habitat. And in realspace, you’re unlocking the Agent’s locale packet. It’s sparse, some waypoints, a main track, some habitat zoning. But if it were any less sparse, you wouldn’t be here with the mapping permit you’ve got.\nIn bonespace and realspace, you search for Nouri.\nDo you remember this game from the twentieth century? They called it the Game of Life. Drab gray board, yellow tiles. Gray for death and yellow for life. Each round of gameplay would step forward a simulation of natural selection, proliferation, population decline. You imagine each yellow tile unpacking and spreading wings and taking to the treetops; you imagine Nouri a solitary blip in one corner, huddled in on himself.\nAnd how many rounds does it take to flip Nouri’s tile to gray? The answer is too many rounds. As many as the grid endures.\nAvicenna Park\nThere was a game you’d play with Nouri before you were grown. It was called The Immortals, and in the nonsense way of games it had nothing to do with life or death, but also everything to do with both. Once, with bare hands, the Nouri of your childhood scalloped a den inside a hedgebush on the border of Avicenna Park. The park beyond was golden and hazy with airborne sand. The royal desert, you two called it, because it was maintained by the private park service of the ruling family. (Somewhere inside, the foundations of Hectare Lab had just been poured, though that was nothing to you yet.) It was nearly nightfall and you were warm with chasing and falling, and with imagination. In you went, into the heart of the hedge-den, Nouri first, you squeezing in after. The prickly bush left lazy welts along your arms.\n“We’re the immortals now,” said Nouri in the perfect quiet. He was forty-three days younger than you and you never let him forget it.\nYou began to skip through the realspace archives, looking for some suitably regal concerto to fill the silence.\n“In their hideout, the immortals do not go to realspace,” Nouri chided.\nYou snapped back to bonespace. “What do they do?”\n“They make life better,” he said, “for everyone.”\nNouri did not explain the practicalities of making life better. You remained there with him for hours, fighting cramp, disappeared from the world. You leaned back on your elbows and stomped your feet when they deadened. The sun began to set outside. The humidity was brimming with the scent of eidergraze sap. Nouri fell asleep against you. You didn’t wake him. Later you were reminded that the desertland of Avicenna Park was freezing at night, cold as an atmosphereless planet, as cold as you are now, aged thirty-nine, and mortal.\nYou did not leave bonespace until Nouri woke and led you back, shivering, into purple night.\n“Next time, we’ll go all the way in,” he said, turning to face the Ghosh Gate of Avicenna Park.\nYou felt the cold then as a burning. Only your heart kept going through it.\nFlorid Park\nYou choose the first of the habitat’s structures to map, a bioshack on the outskirts of a domestic zone. With the Agent trailing you like this, the pestilents don’t come near. They are preparing meals, immersion meditating in ones and twos, fabbing clothing, quietly conversing. You squint downcast eyes, dazzled by the light—it’s like nothing you’ve experienced. All varietals of nano from the Upgrade onward are programmed to avoid the pestilence—you know this—but what shocks you is how different the world looks unfiltered. It scares you, makes the usual presence, somehow, loom.\nYou stop when the bioshack is within arm’s reach. The Agent is unceremonious. “Begin.”\nTo start a map from bonespace to realspace is as easy as forming a new thought.\nYou informationally lasso the bioshack, taking a rough model of it for your realspace map. Then, walking around it in bonespace, touching it with your hands, examining, you lance it, sampling informational layers, the textures and movable parts, the doors and windows and latches.\n(This, to you, is a kind of freedom, is expansive. Is, perhaps, a variety of immortality.)\nIn moments, the outside of the bioshack is mapped in. You’ll do the interior later. You turn to the Agent, gesture toward the next structure, a water generator behind the grilling station where pestilents are gathered, stirring something thickly bubbling. A scent like molasses carries in waves with the breeze.\nA few look up at you. Their hands slow. “They’re cooking homemade nanoblocker for their eyelids and nostrils,” says the Agent from behind you. Her voice comes from a great, unaffected distance. “They’re trying to lower the load in their cortical matter, and since their nanos conduit over mucous membranes—”\n“I know,” you interrupt, gently.\nWhen you see Nouri among the pestilents at the grilling station, you don’t recognize him at first, and you think your dazzled eyes are to blame. You would have sworn you’d know Nouri anywhere, any way. You know his face better than your own, even this changed face of an immortal-gone-wrong, the blanched-brown nanoburn patches up his neck and across his brow. He’s older, but not yet immortal-old, not so old that the elongated ears and nose have given him that vertical countenance.\nYou turn away before you know whether he’s seen you too, before his reaction betrays you. But your own face must be enough of a tell, because the Agent snaps, “I will supervise interactions.”\nIn realspace, you receive a line clipped from the permit agreement you didn’t bother to read. The Park Service’s data-chained signature is a golden plait in the corner.\n“For your safety,” the Agent adds. Not for the safety of the pestilents. That ease of abandonment, from one immortal to a lesser other.\nOut by the water generator, the wind slices. You begin to map. Szanna, you’re very cold. To your fingertips the world is gauze and extruded foam. You tamp down the urge to call Nouri’s name, to walk right up and tug him to your chest. Your prophylaxis is experimental, and Nouri must be teeming with pestilence. Still. If not for the Agent, you know what you would do.\nInstead, you visualize a gauze-stuffed throat. Call it silent. And call it your own.\nAnd then you build him a game.\nYou map in the water generator. There’s a condensation pole of four spires, a sectioned moat, a graduated filtering chamber. You map the spires into realspace, and in your own private instance of the map you add colored pennants. To each of the moats you add game pieces in the shapes of the finest lapis cuts: brilliantine, princess, convex, diamantine. To create movements of play, you add a truth-detector sensitive to tone of voice, a series of debate topics, a role of interlocutor and respondent controlled by a pair of badges. You declare the rules of the game: it’s a race to lower the pennants down the pole. The debate topics, you store in the filtering chamber, embossed on the bellies of golden fish: About immortality. About the flesh. About desire. About secrets.\nThen you embed the prize: the package of code you and Maschou have been developing at Hectare Lab for the past five years. You tie it in a bow.\nThis is the game you design for Nouri, Szanna. You finish the official map of the water generator, closing it with your maker’s plait. And there, over your shoulder, is the Agent, pacing. Wherever she goes, the pestilents leave a wide berth.\nIf you could get Nouri to handshake with you, exchange cards, you could give him the game. And if you two could find somewhere to immersion meditate without arousing attention, you could play a round. And if he wanted to win, you could help him win.\nWhen you look for Nouri this time, you’re subtle, the movement of your gaze a movement of clouds. And when you spot him again, he’s almost gone: heading out past the edges of the habitat in a group, in the grips of nanofever, driven by an imperative he can’t resist.\nLater, as the day dims, the Agent shows you to your bioshack. You stab praying hands into the nanofat membrane, let yourself in. Two foam pallets, a wet corner, a bidet, and a clothes cycler. It smells of new fabbing layered over the burned milk of the nanofat.\nYou lie down without undressing. You drift off chanting: about immortality, about the flesh.\nFlorid Park\nDo you remember this game from the twentieth century? Cast back. A game board is scattered with hidden mines. Concealed in the game board are clues. Heed the clues and you’ll know how many mines to look for. Sometimes, the game unravels for you, satisfying as a snarl of rope. Sometimes, your very first touch is doomed, a fate you are helpless to prevent.\nSzanna, on the second day, you ask the Agent for a pestilent. You’re heading for the habitat’s hospital, a silo towering over the bioshacks. It’s the biggest structure you’ll need to map. “Can one of them help with the ladder?”\n“If you like. You’re waivered; you’ve declared blocker and prophylaxis,” the Agent says. There’s no danger to her, after all, only to you. Florid Park is her home. Her nanos will of necessity be an impervious blend, made by Royal Warrant and restricted by Decree.\nYou scan intently for Nouri—the Agent sees this, thinks you’re scowling at the desolation.\n“The Park Service thinks in centuries, not years,” she says. It’s the first time she’s volunteered information. “Florid Park will spawn fantastic ecosystems in the future. The mix of evergreen life and nano. The temperature range is perfect for spawns of modded bios. Low precipitation too.”\nYou run your hand over the door fob of the hospital. It’s defunct, undiscoverable in realspace. A manual lock has been installed below it.\nThe Agent says, “The pestilents are happy here. They could live here forever.”\n“You mean, you’ll make sure they live here forever,” you say before you think.\nThe Agent’s eyes, when you meet them, are intrigued for the first time. “What is it you think we’re doing here?” she asks wryly. “The pestilence is as resourceful as it is corrupt. You hate immortals. Do you envy us? Resent the sureness of your death? Feel noble to have a beginning and an end? Or are you sorely tempted to live forever, but terrified of what you might become?\n“Whatever it is you think—Florid Park’s nanome is a barrier. You might not trust the mechanisms that are protecting you. But the fact remains—they are protecting you.”\nYou point across the habitat. In the industrial zone, Nouri is scooping and sorting something into three different sacks. “I want him. The tall one.”\nAvicenna Park\nAnd here is a game which is not a game. You are young, Szanna, though older than the evening you spent nestled in the hedgebush. You’re old enough that the game in the hedgebush makes you blush, the thought of you tucked in, your joints and corners and angles, and Nouri right there.\nThis game is: you and Nouri and Maschou walk together from Partridge Perch to the small gazebo in the Pasture of Buffalo. The game which is not a game is that you do everything to avoid Nouri’s eyes, though sometimes his eyes seek yours, all of him craning over, his new adolescent frame long and undernourished and potent with hungry bones. Nanos have never yet touched his marrow.\n“So would you?” he asks you both, looking from your face to Maschou’s. “Live forever?”\nImmortality has only newly cut away from the banquet halls and ballrooms of the royals. The immortals are, for the first time, on the streets. Szanna, you’ve known from very first awareness that it will never be for you to cheat death. But you do not say this.\n“If I was sure it was safe? If I was sure I’d still be me,” says Maschou, after solemn consideration.\n“Well?” says Nouri, turning to you. He does something he’s never done before. He takes your hand. Your lungs quiver and the walking cadence of your breath stalls. You look at neither of your friends. Ahead of you, the small gazebo in the Pasture of Buffalo appears on the horizon, its decorative curlicue spearing the sky’s flank. Also on the horizon: a whole, full life yet to be settled on. This particular game, Szanna? Holds a thrill you’ve never felt.\n“Maybe,” you stall. Your bluster seems an evident fake in your ears. “Would you?” you fire back.\n“Have this forever?” says Nouri, spreading his arms. “I’d do anything.” And he cranes over, and smiles directly into your eyes.\nFlorid Park\nYou and Nouri handshake privately. In realspace, he blooms, immediately there. A negative space you’d scarred over since the expiry of his last handshake returns to presence.\nIn bonespace, he is aloof, even a little rude, ruder to you than to the Agent. He sneers at you, airgaps your bodies, which of course he’s obliged to do—the public health Decree. But he exaggerates, seems all too willing to keep his distance.\nWhen you request it, he allows you to form a sensory chain, awkwardly scales the sandy rungs up to the hospital’s silo roof, runs his hands over and under panels and ports and receivers.\nYou think maybe it’s that he has forgotten. But then in realspace he tunnels to you, and blurts, “Szanna. It’s too late.”\nYou don’t ask what late means to an immortal.\nBy way of apology, you send him the game you made—with the water generator, the pennants, the fish.\n“Maschou tried to be here too,” you say in realspace.\nNouri replies with that old deep-bass pulse, his version of an affirmative.\n“This game looks fun,” he remarks after a while. “We should find a moment to play.”\nIn bonespace, he’s squatting on the roof of the hospital, gently lifting insulation foam, lancing down to the rusty layer below. You chain his informational feed into the realspace map, hungrily painting in the structure. It’s satisfying the way a long-awaited meal is satisfying.\n“We’ll certainly play it,” you say. “We’ll need a bit of privacy to immerse.”\nHis affirmative pulse comes with a lilt at the end. In realspace, this is how Nouri grins.\n“I’ve missed Maschou,” Nouri says. “But I think I’ve missed you more.”\nAvicenna Park\nThere is a corner of the royal desert that feels to you like home.\nThe path is badly marked, the trees pristine and unmodified. The wind makes a racket of the branches and throws flights of dust into your eyes until they stream beige tears.\nIn this corner of Avicenna Park is Hectare Lab, commissioned twenty years ago under the Royal Family’s Realspace Charter, decommissioned ten in favor of centralized governance. Your work permit, long expired, unlocks the gate for you every morning. A miracle.\nYou meet Maschou there. Every day should be the day she does not come. To be children together, to happen to be selected under the same Decree, was one thing. But for her to come daily to a decommissioned Hectare Lab, to do what you ask, uncompensated and unenlightened? She helps with both the covert real work and the public front for it—the realspace maps that you sell to private sponsors, affording you both operational legitimacy and income. You expect Maschou to steal the pestilence cultures, the prophylaxis cocktails, the permits, or the thermal cycler, any one of which she could sell on the gray market for enough to live on for a year. Szanna, you would not fault her if she did. She is owed a lot. But she comes. And does not leave, and does not take. For five years, she has come.\nIt took you half of those years to tell Maschou why you were doing this. What Nouri’d done. Before that, what did she think? And when she understood, what did she think? You see the way she looks at you. And you think you know why she stays.\nFlorid Park\nHours later, in the middle of the night, when the Agent’s breathing beside you has slowed, you stretch your nanoblocker over your body, arrange the windproofing on top, stand, and urge yourself back to life. Szanna, you are so much more expectant than afraid. You emerge into freezing cold, into pitch dark. You navigate in realspace, using the rough habitat map. In bonespace, you are shivering so hard you’re amazed to be moving forward. You crouch-run the length of your domestic zone. When you find Nouri’s bioshack, you kneel, widen a space in the nanofat. Crawl inside, violently shaking, reckless and punch-drunk with proximity.\nIn a belated heartbeat, Szanna, it will occur to you that the Nouri you’ve found here is not the Nouri you once knew. This Nouri stirs on his pallet. You pull your blocker as far up your neck as it will go, take a step forward. Not for the first time, you doubt the prophylaxis that Maschou fabbed for you. Neither of you knew exactly what versions of the pestilence might be in Nouri’s colony. Your cocktail is educated guesswork.\n“Can I touch you?” you ask from beyond the airgap. “I’m protected.” You sound so dangerously sure.\nFinally, his muffled voice in bonespace. Beloved. “Szanna—”\nHe sinks into quiet and you are drawn by the silence, drawn bodily forward. You’re on your knees when you see the feathered mess he’s holding against his flared nostrils. He is streaked with avian blood and nanofuzz.\n“A pre-Upgrade varietal?” you ask. “How’d it get into Florid Park?”\nIn realspace, his voice is steady. “Park Service calls this a closed system. The pestilence encircled by impervious varietals for miles.” He shifts minutely, creating an overhang of space on his pallet. “But no open-air quarantine could ever be fully tight. Not one enforced by aversion.”\nNouri scoots a little further, Szanna, ’til the space on the pallet is the width of your body. He does not disturb the placement of the dead bird he’s siphoning to diversify his colony. You know that inside of him, something is happening: first, the pestilence reprogramming the new arrivals until they too are the pestilence. Then, that formality dealt with, there’ll be round after round of selection. For more efficient algorithms, new imperatives, a faster colonization drive.\nThe goal of his colony is to keep Nouri alive forever. A side effect of this goal—swiftly traced to a bug in the orchestration routine of pre-Upgrade varietals, corrected in new varietals during the Upgrade, but never demonstrated to be patchable in an established colony—is making him sick.\n“Remember the game I sent you?” you ask, and mark it for him in realspace. “Can you immerse here? With me? I need to show you something.”\n“I don’t think I can right now,” says Nouri. “I’m too activated.” You note that he chooses that word, activated, over the other, aroused.\nHe sets the dead bird to one side and holds out a bloodied hand.\nMaybe it’s his lucidity, the fact that he seems there, seems himself. Whatever it is: you let yourself fall. Your knees hit padded nanofat. You fill the space he’s left open for you, let his heat smother the trembling, and you pray that Maschou’s prophylaxis will hold, that the nanoblocker will be better than useless. Because otherwise you are defenseless, Szanna. Are, as you’ve always been.\nAvicenna Park\nSummer is your season. It turns Avicenna Park rouge and planetary. You return from six months of tutoring at the Royal Science Boarders’ House, a whirlwind of cramming and barely edible canteen meals and experiments failed and retried. This half-year, you’ve taken your first ever round of prophylaxis against the pestilence—and by broad spectrum, against immortality too. Adolescence and prophylaxis are all mixed up in your bones. Nanos are a fact of life now, and so is the mutability of death. Immortality slowly permeates your list of acquaintances, then friends, then distant relatives, dribbling down from the wildly wealthy to the lavishly well-to-do. So far, their gambles are paying off. You know of nobody with the pestilence, but lots of somebodies who won’t ever die.\nYou’re so tired your first night back from boarders’ that you elect to eat dinner pacing the long carpet in the dining room to keep from nodding off. You split gravied dumplings with a tine, plate balanced on your forearm, while your mother and sister catch you up on their news.\nAfter updates on the weather, the gardening, and any local interest rumor your mother has found credible enough to share, this—“Nouri came by this morning.”\nWakefulness blossoms, brain stem up. “He hasn’t spoken to me in a while,” you say tentatively.\n“He said that if you have time tomorrow, you ought to meet him out at Ghosh Gate. He said his day is free.”\nYour ribs tighten like a belt, Szanna. His day is free spirals into a hundred lives that Nouri lives, here, where you both grew up, on the border of Avicenna Park. You know he refused his placement at boarders’ house, and also that he has been living with his mother and her younger children, his mother who stuns the neighborhood with her extravagances, her stone-sequined coats and deliveries of handcrafted furniture and her bloodline stake in at least one of Avicenna Park’s lapis mines.\nNouri, the eldest, the forgotten, but forty-three days younger than you, green plum of your heart. (He doesn’t know that. Can’t ever know that.) You meet him in the dripping croaking heat of dusk. He gives you a generous hug that tells how he hasn’t been worrying about this moment all day. The idea of you through his eyes gives you uneasy double vision.\nYou two enter Avicenna Park through Ghosh Gate. Nouri looks like he’s been sweating in the weather, something thick about his cheeks, his rise of color a desert sunset. His lips are wide and behind them his teeth sparkle. He’s grown up. The effect is intoxicating.\n“It’s wonderful to see you,” he says in bonespace. “How has your year been?”\nYou tell him. About the time you ate an entire celebration cake on a dare and were so severely ill they had to nanoflush your guts in the infirmary. About the group of girls who were unkind because no one in your bloodline had ever received a Nod from the royal family (at this, Nouri rolls his eyes), about the boy you thought you secretly loved (Nouri, attentive, what happened?) but who turned out to be an emotional celibate on exchange from the Royal Priesthood, about the endless rounds of prophylaxis—the transient nanococktails teaching your bones and blood something of resistance—\n“Prophylaxis? You?” says Nouri, stopping.\nAround you, Avicenna Park is this peach-skin landscape. You’d forgotten the citrus and alkaline scent of the yellow dust, here. An ibis calls out, shrill and short, from one of the many streams burbling through the rocks.\n“Yeah, me. I mean, me and everyone. We had no objectors.” You didn’t think this was controversial. “And . . . you?” You spit it out before you have time to be afraid of the answer.\nNouri laughs, now. “Not me.” He half-steps onto a jutting rock, bounds into a circle of dust, stamping two boot prints, and circles back. There’s always been something springy about how he carries his body. Still true, you note, now that he inhabits the body of a man.\n“Honestly? I went somewhat the opposite way,” he smiles coyly, and he’s walking over, breathing a little hard, and you stop strolling, and he comes over, and you can smell his skin and see the row of fine hairs between his eyebrows. He licks his lips and you stop breathing. You have dreamed this more than once.\nThen he does something you’ve never seen anyone do, only heard about. He furs his tongue against his front teeth, and sticks his tongue out flat as a pounded fillet, and you see them, his colony. Among the pink tendrils of his taste buds, a prismatic wave of metal.\n“No,” you say. Because you never thought he’d—because the risk. Because the pestilence. The cerebellum deactivation, spinal fluid clots, loss of sense of smell, ocular colonization leading to visual artifacts, the dun pigmentation of the skin presenting with cyclical fevers and a progressive degradation of executive function . . .\n“Do you want to live forever so badly that you’d risk eternity in a body that isn’t yours to control?” you whisper, heartbroken.\nNouri rakes his hair back. His eyes twinkle. “Small risk, big reward. And that makes it a good game,” he says.\nFlorid Park\nThe Agent walks you to the immersion theater—a bio-fabbed structure about four times the size of the domestic shacks. You’ve already mapped the outside; today she keys you in. In about half the seats, pestilents are in gecko pose or vertical repose, immersion meditating. The white noise in the background is barely audible. You think it’s supposed to be the sound of the padded drills in a lapis mine, but it might be wind in the leaves.\nYou’ve hidden last night’s realspace archives, obfuscated your conversation with Nouri, the long stretches afterward when neither of you said a thing—to your guilty conscience, just as telling—but when you ask the Agent for Nouri’s help again, she shakes her head no.\n“Do it without help.”\nYou work, Szanna, your body replaying more than your realspace archives hold. Never before has bonespace felt this much richer than the world of information.\nYou’re thinking of the hours you spent as close to Nouri as the barrier of skin would allow. Szanna, there’s a tumult inside you. You wonder whether your touch was too intimate, the skin-to-skin interface too perfect, too slick, your prophylaxis too weak.\nA note from Maschou snaps you back. “Permit extended.”\nAnd a moment later, the Agent elaborates, “Your assistant sent her approval through. She arrives this afternoon.”\nYou meet the question in her statement head-on, and with complete honesty. “That’s lucky. I didn’t think she’d make it. We have a lot left to do, and not much time.”\nSo. Maschou managed to work her personal contacts too. Maschou’s always been resourceful. She could beat an immortal at a game of resourcefulness.\n“Your assistant has asked for a walking guide. I will meet her at an outpost midway,” the Agent says testily.\nShe edges between you and the communal table you’re filling into your map, forcing your hands off the polished, fabbed wood. Every peaked bone in her face, every missing blemish, the oil slick of her nanocolony on the wet dipped crease of her lip, is suddenly yours to pore over. You can’t hide your fascination.\n“I don’t trust you, Szanna from Hectare Lab, but I don’t care about you either. Immortality is yours to take or leave, the pestilence yours to risk. My duty is only to protect the parkland.” She hitches her pack, readying to leave. “As a kindness, I remind you to value your life. These unfortunates—” the Agent gestures at the pestilents meditating or communing in hushed tones “—are not in control of themselves. Any one of them could end your life without meaning to.”\nShe heads for the door. Pauses. “Death must seem a trifling thing to someone like you,” she says, “but even then. It is a trifling thing with no hope of return.”\nDo you remember this game from the twentieth century? The armored tank will be protected at all costs. A brick wall surrounds it. A bevy of defenders trawl the game board, hunting intruders. You are an intruder. Your objective is to breach these defenses. Your objective is to eliminate every defender, restore normalcy. Your objective is not to be blown apart yourself.\nBahr Khalyy Openspace\nMaschou and Nouri knew each other first. You piece together a mercantile family relation dating back to before your friends were born—Nouri’s mother trading rock lapis through a network that shipped off-world; Maschou’s family managing allowances for the tradership, specializing not in the operational side of this, but in the shadowy art of influence that generated a reliable stream of Royal Decrees and Nods.\n“Let’s go somewhere else,” Nouri says, slowing as you approach Ghosh Gate.\nYou’re nine years old, just old enough to think of your life as a ribbon on which you are in motion, one with a beginning and an end.\nLast week you’d asked Nouri if you were his best friend, and he said yes, but Maschou a close second. “But who is Maschou?” you asked.\n“You don’t know her,” he’d sniped, and a foul-smelling flower blossomed inside your rib cage.\nBut today, you will know her. Nouri takes you to a dry lake bed called Bahr Khalyy. The kids never choose it over the royal desert, finding the barrenness here boring. But what Nouri shows you is that the openspace is rich in surprise: the eggs of amphibians pearl everything. Gnats cloud the air, iridescent in the beam of his blacklight torch.\nHe takes you to a hole in a hedge. “I told her to meet us here. Maschou!”\nHere she comes tumbling out to the sound of snapping twigs: a girl big for her age, a sprig tangled in her fringe, and with a smile so unguarded that when she meets your eye it takes you momentarily aback. She sends her card in realspace; you’ve got a weird reflex to bounce it. But you don’t. You handshake. She sends a pulse of pleasure.\n“How many hedges have you carved into hideouts anyway?” you ask Nouri, shy from the newness.\n“You never know when you might need a place to lay low,” Nouri says, pulling you by the hand.\n“An immortals’ court,” Maschou corrects him. She turns to you. Her smile is bold. “Check it out inside.”\n“Wait,” says Nouri, blocking you with his body. It’s unfair that he’s stronger than you, though you’re the same height. “You have to swear to keep the secret. Hideouts only work if no one knows about them.”\n“I promise,” you say. Maschou grins. The three of you Pact in realspace.\nFlorid Park\nAs soon as the Agent is gone, you go looking for Nouri.\nInside his bioshack, the air is settled. He’s not there. You emerge again into that glaring light. You check the grilling station. Behind the squat silo of the hospital, a group of pestilents chants in dissonant choir. No Nouri. You swing wide of them, head for the perimeter of the habitat, thinking you’ll go around once, scan for him.\nYou don’t need to go far. Nouri, there. At the back of a group heading for the tree line with that unmistakable cant of nanofever. You up your pace, catch up, and fall into step with him. Ahead of you, the pestilents walk briskly, favoring their forefeet, that well-documented cerebellum colonization, the overbalanced stride.\nYou consider your own feet, blistered and weather-burned despite your meticulously high-fastened boots. You consider the shape of your footfall. You think of Nouri’s body right against your own. Nanocolonization takes an instant or a year: it’s programmatic, not proliferative. You look around you. You fear the pestilents and fear yourself.\n“I need to talk to you,” you say to Nouri, in realspace. “There isn’t much time.”\n“Do you remember the first day of your life?” replies Nouri in bonespace, answering himself without giving you a chance: “Yes. The sun path was twenty-two degrees and four hours; the moons were both waning; the temperature was above average for the day. Rain misted in my hair. My mother was a celestial body.”\n“Nouri,” you insist in realspace—you grasp his arm, and in the bravest motion of your life, tug him away from the group, into the dappled shadow of an outlying tree.\n(You had no idea what strength to expect of this different Nouri, immortal-in-nanofever Nouri, but he’s so yielding, Szanna. So very like dough. His bones could be jelly.)\n“Do you remember the second day of your life?” Nouri asks. “You immediately crawled. You immediately hid. The game began, the hourglass turned.”\n“Look at me,” you say with sudden certainty. Your breath mists, swirls into his. His bottom lip is trembling. Nanoburns crawl in elaborate fractals into his hairline. “Take me there. Take me to the hideout.”`\nCaesura\nSzanna, do you remember this game you’d play? Every day, you’d swap one ugly thing for a beautiful one. You began in the world of information: every item you touched in realspace, you made better. You pored over every archival game from the twentieth century, enriching wikis. You built emulators to run primitive code, added secret levels, kinder enemies. You overlaid several archival layouts of early lapis mines to create fuller composites, added anecdotal waypoints to maps of off-world caravan routes.\nSome days you looked to bonespace. You were not as miraculous as a colony of nanos, but you could make the world better in your small ways. You collected replicas of playing cards and game pieces. Printed textured maps on archival paper. Knitted gloves for the lapis miners. Every day you planted a seed. Most were informational, but some were organic. You ended up in your thoughts. You would clear out the ones that hurt, and give their scars several days to scab over. You’d come back from your rough terrain hikes reeking of your body, meet Maschou for mixed fry or dumplings in yellow broth. She held her nose, exiled you to the far side of the table. You went and did not protest. A feeling jabbed your mortal heart, a good feeling, metronomic. It said: beat until you can’t.\nAnd some days, in the distance, beyond these vistas of your life, did you think you spied infinity?\nFlorid Park\nNouri takes you to a copse of trees gnarled with tendrils of fern. Nanofuzz sparkles on every patch of moss, every brush of kir, in every teardrop of tree gum.\n“Is it safe for me here?” you ask in bonespace.\n“Safe? Safe is a fallacy,” says Nouri, trudging ahead of you, breathing loudly, dripping fever sweat. You sense him trying to project sobriety, but everything about him is a giveaway. “No one is safe anywhere,” he adds. “Even immortality doesn’t mean safety.”\n—In realspace, Maschou opens a tunnel, pings you a locator. She has entered Florid Park by the north gate. You ping a locator back—\n“Remember, a Pact is a Pact,” says Nouri, and waves you toward a fern curtain hanging from the interlocking root system of a trio of kir trees, each tree immense, building-sized. “In here.”\nThe fern crackles with nanofuzz. You cover your eyes and nose, dive through it, bend and crawl, barely breathing.\nAnd in a moment you emerge, Szanna.\nWhat has Nouri built?\nAn immortals’ court.\nTowering hall, bubbly nanofilms moving like animated stained glass on wounds in the tree trunks. Thrones of moss and rock. Intricate tapestries stitched from the delicate bones of birds. The light here is soft and the air rich with sap. Tiles embedded into the earth under your boots are scales from pine cones and scales of kir, dark brown and light, inlaid in hoof patterns around a central medallion.\nIt’s the work of a lifetime, Szanna. The project of a life that has many chapters left, even if it’s a life warped thin and translucent between two fingers.\nYou breathe a heavy breath. Your heartbeat is irregular. Gullible, fallible.\n“Do you think this makes life better?” asks Nouri, looking around. Even refracted through his fever, the sincerity of his question bruises your heart.\n“Immerse with me,” you say softly. It’s quiet here, and safe. You open a realspace tunnel, obfuscate your conversation stream, hide the both of you as well as you can.\nIn realspace you mark the game again. You flutter the pennants on the condensation poles, rock the gleaming game pieces in their moats. “Maschou and I. We designed this for you. You just answer the questions. If the prize is what you seek? Then the prize is yours.”\n“You designed a whole game for me?” asks Nouri. “Why? How long did that take?”\n“How long did this take?” you counter, evading, spinning around.\n“Years,” he says in bonespace. “Years.”\nHe says it so sadly you almost forget how many years he has left.\nBahr Khalyy Openspace\nThe first game Nouri ever showed you from the twentieth century was the paper fortuneteller. He taught you how to make one from the flat papery leaf of the basalt tree growing by the creek in Bahr Khalyy. You were one day older than ten. He was forty-three days younger than you.\nIt remained your favorite game into adulthood. Out hiking, to distract yourself from cold or blisters, you ordered laser cuts of stiff silks and vegetable paper and oliosheet, dyed pastel colors. You made hundreds. Spelled enough fortunes to fill a royal almanac. One fortuneteller you encrusted with lapis pebbles Nouri’s mother had gifted you. They shone when the origami flared open. You held your fortuneteller pinched tight, a universe before inflation, and asked it about Nouri, about Maschou, about immortality. About every unlived year of your surprisingly persistent life. You picked numbers, picked colors. Picked death, picked life, picked death, picked life.\nFlorid Park\nYou open your eyes to Maschou’s face. You think, half-dreaming, that you are at boarders’, that Maschou is here to wake you so you don’t sleep through canteen again. You itch where your skin sticks hot to skin; you itch where pine cone scales have pressed wedges into your hip, into the small of your back. You untangle from an unconscious Nouri and the remnants of the coupled gecko pose you’d both been in, immersion meditating. Your body is sore.\n“Szanna,” says Maschou. She reaches out an arm. You take it. Her grip is sure. Has always been.\n“We don’t have long,” she says. “They’re looking for you both, but they’re looking out toward Lesha Gate. Let’s head east.”\nMaschou pulls you up. Your legs are crowing pins and needles. You do not feel much like yourself. You turn to look at Nouri, twitching, nude, his chest rising heavily. You trace backwards from the last thing you remember, then push forward, analyzing the game you and Nouri just played. Your questions, his answers. About immortality. About the flesh. About desire. About secrets.\nBut you’re too startled, your placid mind suddenly stormy with fight or flight. You remember playing, but you can’t remember who won.\n“Did it work?” you ask Maschou.\nHer brow furrows. “Give it some time,” she says. “We’ll know eventually. So will he. Then maybe we can just ask him? Ask him plainly if he’s happy.”\nShe puts an arm around your shoulder, cloaks your body with Florid-Park-rated windproofing.\n“He will live, one way or the other,” Maschou says.\n“Thank you,” you say. Sensation begins to return to your limbs.\nYou cover your eyes and nose as you crawl out between the tree roots.\nWhen you uncover your face, you look behind. The immortals’ court is an absence. A hollow, a heavy appearance. The calm sway of the disturbed fern, the gyring tinsel of its nanofuzz, is the only sign that some misguided someone—here, and everywhere—has been trying and failing to make life better.\nYou pick your way toward the east gate of Florid Park, Szanna, with Maschou at your side. Living or dying, mortal or not.\nSara Saab was born in Beirut, Lebanon. She now lives in North London, where she has perfected her Resting London Face. Her current interests are croissants and emojis thereof, amassing poetry collections, and coming up with a plausible reason to live on a sleeper train. Sara's a 2015 graduate of the Clarion Writers' Workshop. You can find more of her on Twitter as @fortnightlysara.", "source": "https://clarkesworldmagazine.com/saab_09_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Lapis by Sara Saab"}