{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "MJXEknH79V+T4gVm3ftflk1Hb7k=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: The Sad Truth About Short Fiction Magazines  Did you know that there are only three genre fiction magazines that completely support themselves from the revenue they generate? These are Analog, Asimov’s, and the Magazine of Fantasy & Science Fiction, collectively known as the Big Three. Others, like Tor.com and Subterranean (now closed), are supported by the revenue of their parent companies. Below them are four more groups: the non-profits (like Strange Horizons and Beneath Ceaseless Skies); the hobbyists or beginners (typically characterized by low or no pay for authors); the aspirants (they pay authors SFWA-qualifying rates or better, but haven’t found reliable way to cover that cost); and the conceivable (the aspirants that have learned to generate enough revenue to cover costs, but not adequately compensate their staff). Today, I’d like to talk about the first and last two groups, but primarily the latter.  For starters, I know there are people who will nitpick the categorizations I’ve created. If that’s what you’re going to focus on, you’ll probably miss the point of this editorial. None of those categories are meant to diminish the value or quality of a market. It’s simply a way to break them up in terms of the current state of their business models. Don’t get hung up on the names. I’ve gone through a dozen permutations and will likely go through a dozen more in the months ahead.  Since I haven’t labeled the first two examples, let’s group them together and call them the professionals. It would also be fair to call them the old guard professionals, organizations that have their foundation in the pre-ebook print world. Yes, some of them have launched digital magazines, but these businesses established themselves first in the print world. None of these organizations have their foundation in the digital world. This is not a criticism. It is a simple observation. To their credit, each has learned to embrace the industry’s transition to print and digital. That’s what good businesses do. They adapt to market shifts or die.  Clarkesworld published its first issue nine years ago this month. During that time period, I’ve paid very close attention to what has been happening within this corner of the short fiction field. Within that nine-year window, the lion’s share of new genre magazines have launched from a digital foundation. Sure, some of us dabble in print, but our business models are very digital-oriented. This is largely due to financial- and distribution-related issues. The amount of money necessary to launch a print-based aspirant-level market with national distribution is staggering. You could fully-fund a digital publication for well over a year with the same amount and that’s not even taking into consideration warehousing expenses, the headaches caused by the distributors and their antiquated returns system, or the USPS and their continually increasing postal costs. Even though none of the digital-native publications have risen to the ranks of professional, the smart money these days is to launch digitally. (Note: There have been new and even some old print magazines that have failed within this window.)  In the pre-digital world, which happens to be most of my life, there were always new magazines coming and going. Without the digital options available, they adapted in other ways. Small print runs, hand-selling at conventions, mailing parties, and lower pay for authors and artists were routine. While many dreamed of reaching that professional tier, it was often clearly out of reach and as a result their expectations had to be more realistic. Quality and readership for publications were more variable and the overwhelming majority never left the hobbyist/beginner group. None of them reached the ranks of the professionals.  Just like in the rest of the industry, digital publishing has considerably lowered the bar to entry and it has completely altered the landscape for genre magazines. The aspirants category is larger than ever, and may even be growing at a rate faster than the number of new readers and writers entering the field.  There are two reasons to be worried about this:  1. Quality   If the number of quality stories isn’t growing as fast as the number of stories publishers need to fill all their slots, then quality must dip to fill the void.  2. Sustainability   If the number of readers willing to pay for short fiction isn’t growing as fast as the financial need of the publishers, the field begins to starve itself.  I’m singling out the aspirants here because they are the most at-risk. Their financial foundation is the least stable of the groups I’m focusing on, so they are the most likely to fall victim. In the long term, the danger also extends up the food chain and endangers the conceivables and the professionals. It’s considerably less likely to significant alter the trajectory of the publications further down the chain.  Without a doubt, the lowered bar has triggered a boom period in short fiction. Most of the time that’s been quite exciting, but more recently I’ve found myself noticing some worrisome trends that could be signs of a market correction looming on the horizon.  Over the years, I’ve consulted on a number of new publishing projects. I generally start by telling people that they need to have a metric for knowing when to quit. For example, how much money are you willing to lose? It’s a business, not your baby, so you need to know when to fold. There’s no shame in this and you can always try again later. Our history is littered with magazines that couldn’t make a go of it for some reason or another.  The second thing I tell people is to start small and grow. You are only asking for trouble if you try to be everything you aspire to all at once. Map out where you want to be in three years and slowly work towards it by building the revenue and readership you need to justify it. Even if someone hands you a big check, you still need to plan wisely and think about more than just the next year.  Lately, I’ve started seeing projects to resurrect dead magazines or save those that couldn’t get enough subscribers to sustain their ambitious goals. It’s uplifting to see our community rallying around these causes, but are we setting ourselves up for a fall in the process? Are we simply delaying the inevitable, like what happened with Realms of Fantasy? (For those who don’t know, Realms of Fantasy was a print magazine that kept coming back from the dead because there were people passionate enough about it to want to see it continue, but not enough to make it a viable business.)  But what can any of us do about it? Here’s a few suggestions:  \r\n  Subscribe to or support any magazine that you’d be willing to bail out if they were to run aground. Just-in-time funding is not a sane or sustainable business model. If you want them to succeed, then be there before they need you.  If a magazine doesn’t offer subscriptions or have something like a Patreon page you can support them financially through, encourage them to do so.  Encourage SFWA to raise their qualifying rate for short fiction. Why? Given the small explosion in markets that are paying that rate, it’s clearly too easy for publishers to earn that badge. Yes, that rate is a badge of honor for publishers. Seriously though, the authors deserve better.  Don’t support new (or revival) projects until they clearly outline reasonable goals to sustain the publication after their initial funding runs out.  Introduce new readers to your favorite stories and magazines. This is particularly easy with so many online magazines being freely available at the moment. We need more short fiction readers if all this is to remain sustainable. This plays into my comments on short fiction reviews last month.  As I’ve worked on this piece, it’s been hard not to get depressed about the odds for any conceivables breaking into the ranks of the professionals. If we’re entering a phase of market compression, and I think we are, the hill will only become steeper. I’d love to see Clarkesworld be the first to cross over, but I’ve learned to be realistic about this business and appreciative of what we have achieved in the last nine years. I appreciate everything our readers have done to support us and hope you’ll continue to stick with us on the road ahead. We can’t do it without you. None of us can.  I consider many of the editors at the other magazines to be friends and colleagues. While I may not agree with some of their business practices (and they mine), they have my respect and best wishes. The sad truth about short fiction magazines is many of them won’t be around ten years from now. The good news is that the market always corrects itself and someone else—sometimes even someone who’s tried before—steps up to replace the fallen with something new.  One more time:  Thank you.  Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: The Sad Truth About Short Fiction Magazines\nDid you know that there are only three genre fiction magazines that completely support themselves from the revenue they generate? These are Analog, Asimov’s, and the Magazine of Fantasy & Science Fiction, collectively known as the Big Three. Others, like Tor.com and Subterranean (now closed), are supported by the revenue of their parent companies. Below them are four more groups: the non-profits (like Strange Horizons and Beneath Ceaseless Skies); the hobbyists or beginners (typically characterized by low or no pay for authors); the aspirants (they pay authors SFWA-qualifying rates or better, but haven’t found reliable way to cover that cost); and the conceivable (the aspirants that have learned to generate enough revenue to cover costs, but not adequately compensate their staff). Today, I’d like to talk about the first and last two groups, but primarily the latter.\nFor starters, I know there are people who will nitpick the categorizations I’ve created. If that’s what you’re going to focus on, you’ll probably miss the point of this editorial. None of those categories are meant to diminish the value or quality of a market. It’s simply a way to break them up in terms of the current state of their business models. Don’t get hung up on the names. I’ve gone through a dozen permutations and will likely go through a dozen more in the months ahead.\nSince I haven’t labeled the first two examples, let’s group them together and call them the professionals. It would also be fair to call them the old guard professionals, organizations that have their foundation in the pre-ebook print world. Yes, some of them have launched digital magazines, but these businesses established themselves first in the print world. None of these organizations have their foundation in the digital world. This is not a criticism. It is a simple observation. To their credit, each has learned to embrace the industry’s transition to print and digital. That’s what good businesses do. They adapt to market shifts or die.\nClarkesworld published its first issue nine years ago this month. During that time period, I’ve paid very close attention to what has been happening within this corner of the short fiction field. Within that nine-year window, the lion’s share of new genre magazines have launched from a digital foundation. Sure, some of us dabble in print, but our business models are very digital-oriented. This is largely due to financial- and distribution-related issues. The amount of money necessary to launch a print-based aspirant-level market with national distribution is staggering. You could fully-fund a digital publication for well over a year with the same amount and that’s not even taking into consideration warehousing expenses, the headaches caused by the distributors and their antiquated returns system, or the USPS and their continually increasing postal costs. Even though none of the digital-native publications have risen to the ranks of professional, the smart money these days is to launch digitally. (Note: There have been new and even some old print magazines that have failed within this window.)\nIn the pre-digital world, which happens to be most of my life, there were always new magazines coming and going. Without the digital options available, they adapted in other ways. Small print runs, hand-selling at conventions, mailing parties, and lower pay for authors and artists were routine. While many dreamed of reaching that professional tier, it was often clearly out of reach and as a result their expectations had to be more realistic. Quality and readership for publications were more variable and the overwhelming majority never left the hobbyist/beginner group. None of them reached the ranks of the professionals.\nJust like in the rest of the industry, digital publishing has considerably lowered the bar to entry and it has completely altered the landscape for genre magazines. The aspirants category is larger than ever, and may even be growing at a rate faster than the number of new readers and writers entering the field.\nThere are two reasons to be worried about this:\n1. Quality\nIf the number of quality stories isn’t growing as fast as the number of stories publishers need to fill all their slots, then quality must dip to fill the void.\n2. Sustainability\nIf the number of readers willing to pay for short fiction isn’t growing as fast as the financial need of the publishers, the field begins to starve itself.\nI’m singling out the aspirants here because they are the most at-risk. Their financial foundation is the least stable of the groups I’m focusing on, so they are the most likely to fall victim. In the long term, the danger also extends up the food chain and endangers the conceivables and the professionals. It’s considerably less likely to significant alter the trajectory of the publications further down the chain.\nWithout a doubt, the lowered bar has triggered a boom period in short fiction. Most of the time that’s been quite exciting, but more recently I’ve found myself noticing some worrisome trends that could be signs of a market correction looming on the horizon.\nOver the years, I’ve consulted on a number of new publishing projects. I generally start by telling people that they need to have a metric for knowing when to quit. For example, how much money are you willing to lose? It’s a business, not your baby, so you need to know when to fold. There’s no shame in this and you can always try again later. Our history is littered with magazines that couldn’t make a go of it for some reason or another.\nThe second thing I tell people is to start small and grow. You are only asking for trouble if you try to be everything you aspire to all at once. Map out where you want to be in three years and slowly work towards it by building the revenue and readership you need to justify it. Even if someone hands you a big check, you still need to plan wisely and think about more than just the next year.\nLately, I’ve started seeing projects to resurrect dead magazines or save those that couldn’t get enough subscribers to sustain their ambitious goals. It’s uplifting to see our community rallying around these causes, but are we setting ourselves up for a fall in the process? Are we simply delaying the inevitable, like what happened with Realms of Fantasy? (For those who don’t know, Realms of Fantasy was a print magazine that kept coming back from the dead because there were people passionate enough about it to want to see it continue, but not enough to make it a viable business.)\nBut what can any of us do about it? Here’s a few suggestions:\n- Subscribe to or support any magazine that you’d be willing to bail out if they were to run aground. Just-in-time funding is not a sane or sustainable business model. If you want them to succeed, then be there before they need you.\n- If a magazine doesn’t offer subscriptions or have something like a Patreon page you can support them financially through, encourage them to do so.\n- Encourage SFWA to raise their qualifying rate for short fiction. Why? Given the small explosion in markets that are paying that rate, it’s clearly too easy for publishers to earn that badge. Yes, that rate is a badge of honor for publishers. Seriously though, the authors deserve better.\n- Don’t support new (or revival) projects until they clearly outline reasonable goals to sustain the publication after their initial funding runs out.\n- Introduce new readers to your favorite stories and magazines. This is particularly easy with so many online magazines being freely available at the moment. We need more short fiction readers if all this is to remain sustainable. This plays into my comments on short fiction reviews last month.\nAs I’ve worked on this piece, it’s been hard not to get depressed about the odds for any conceivables breaking into the ranks of the professionals. If we’re entering a phase of market compression, and I think we are, the hill will only become steeper. I’d love to see Clarkesworld be the first to cross over, but I’ve learned to be realistic about this business and appreciative of what we have achieved in the last nine years. I appreciate everything our readers have done to support us and hope you’ll continue to stick with us on the road ahead. We can’t do it without you. None of us can.\nI consider many of the editors at the other magazines to be friends and colleagues. While I may not agree with some of their business practices (and they mine), they have my respect and best wishes. The sad truth about short fiction magazines is many of them won’t be around ten years from now. The good news is that the market always corrects itself and someone else—sometimes even someone who’s tried before—steps up to replace the fallen with something new.\nOne more time:\nThank you.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_10_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: The Sad Truth About Short Fiction Magazines by Neil Clarke"}