{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "PN6s6V6sPq1WtIKRsUUH9vrUD0o=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Enlightenment Voices and Norse A Cappella: A Conversation with Ada Palmer  History and the future are inexorably intertwined. It’s impossible to predict what will happen without first considering what has come before. Empires, dynasties, religions, and philosophical movements ebb and flow, pushing forward towards the horizon. This is why some of the best science fiction has one foot rooted deeply in history.  In Too Like the Lightning Ada Palmer introduced us to a world where everything was within commuting distance, national boundaries had been redrawn to encompass like-minded thinkers, the outward practice of religion had been banned, and we met a child with the inexplicable ability to breathe life into inanimate objects. And so began the Terra Ignota series. Written with the eloquent voice of Enlightenment thinkers, pulling from the philosophical annals of history, and told through the eyes of a witty and somewhat unreliable narrator, Seven Surrenders picks up where the first book left off and leads you deeper into the complex machinations of the utopia Palmer has created.  Ada Palmer is a professor in the history department at University of Chicago, specializing in Renaissance history and the history of ideas. She is also a composer of folk and Renaissance-tinged a capella music, most of which she performs with the group Sassafras. Her newest novel, Seven Surrenders, is the second in the Terra Ignota series and was released on March 7th from Tor Books.   The voice chosen for Too Like the Lightning and Seven Surrenders is unlike anything I've read in sci-fi before. What made you choose the particular Enlightenment style?  I had been reading Enlightenment science fiction. Though we think of SF as a 20th or perhaps 19th century genre, Voltaire wrote a short story called “Micromegas” where giant, many-mile-tall aliens come to Earth from another star, and encounter humans. And when they make first contact, the first things they ask each other are whether Descartes is right about the dualistic nature of the soul, whether the existence of Providence can be deduced from observations of Nature, and whether or not God made the universe for Man.  These are absolutely not the questions we have humans and aliens ask each other in first contact stories, which made me realize that our first contact stories are equally distorted in a sense, so that our aliens and humans ask each other about the hot issues of our day: whether technology will outstrip human control, the limits of the human, whether faith is in tension with science. I wanted to use the more sophisticated tools of modern science fiction, with all our development of tropes, cues, imagined technologies, but to interrogate a classic SF future (with flying cars, robot assistants, etc.) using the palette of questions that Voltaire and his colleagues had been concerned with in the 18th century, to see what happens when we put these amazing tools at the service of a different and non-modern set of questions.  Keeping the Enlightenment voice made sense to me, especially since authors like Diderot used direct address and dialog between the reader and the author so fruitfully, to create a special kind of intimacy with the narrator, and to ask questions about free will and power dynamics, such as the reader’s power over the author.  Your novels use different punctuation marks to highlight the language being spoken whether it is Spanish or Japanese or English. What inspired you to make this choice?  I read comic books, and they use different kinds of quotation marks all the time to differentiate things like telepathy, or radio communications, and many of the marks they use are quotation marks from non-English languages. That made me think I could use the same marks to differentiate my polyglot world and help bring readers’ attention to the fact that so much of the action wasn’t happening in English.  Since 20th century SF has been so dominated by America and the UK, English-speaking nations and their future descendants tend to loom extra-large in a lot of science fiction, so I wanted to write something where other cultures and their linguistic traditions were more visible. This is a polyglot future where English is the lingua franca but hasn’t erased other languages, far from it. Other languages are powerful as identity markers, and I wanted to make that visible.  I've read that you like to outline your books and really stick to them. What did your planning and writing process look like for Seven Surrenders?  I worldbuilt first, mulling on ideas and ingredients for the world, for about five years. Characters developed as part of that process—I would have an idea for an interesting character, or an interesting situation or relationship a person might be in, and then spin out from that the structures necessary to make that person exist and make sense. After the world was fully mature and populated, I spent six months outlining the series, made a complete chapter-by-chapter outline of the first two books, and a less-thorough but still detailed outline of the later two as well. Then I sat down and started book one, and, immediately after, book two, all in one flow, usually writing for an hour in the morning every day. The actual writing process for the first two books took me a little over a year.  The world you created is a utopia built on trade-offs. There is peace, but at the cost of some freedom and the banning of religion. Some people can gain incredible computing power but they give up some of their senses. Do you think that compromise is inherent in being able to move forward?  I don’t think it’s inherent, but I think it’s been the common historical experience, and while I think humanity will gradually get better and better at things, and that progress will have fewer negative effects, I don’t think we’ll be there by 2450. I’m a historian so, looking 400 years in our future, it made sense to me to look 400 years back, look at how much change there has been, and imagine a comparable if somewhat larger amount of change, with comparable sacrifices. One of my goals is to make the reader of Terra Ignota have an experience similar to the experience Voltaire or Diderot or Mary Wollstonecraft—great future-builders who shaped our world by working hard to make a better one—would have if they came forward to our present.  Some things would make them weep for joy: advanced medicine, 80-year average life spans, universal suffrage, widespread education, footprints on the Moon. Others things would be depressingly familiar: religious violence still raging, sexism still rampant, judicial torture still rearing its head. And other things they had held precious would be shockingly absent: France losing its worldwide cultural dominance, fashion and music incomprehensible, mores and daily behavior alien and frightening.  If you asked such an Enlightenment time-traveler, “Was it worth-it? You dedicated your life to making this world—are you content with the result?” they couldn’t give an easy “Yes” or an easy “No” because so much would be right, and so much would be unfinished, and so much would be gone. I wanted this world to ask the same question of us: if this were the future our efforts made, with some invaluable improvements, some frightening losses, and some cultural battles still depressingly unfinished, would that be worth-it? Because, realistically, that is what we would see if we could look forward 400 years.  Do you think that civilization is cyclical or is it more of a collection of building blocks that get mixed and matched as time passes?  I think more in terms of humanity acquiring more tools over time. Some tools are technologies: fire, the moldboard plow, the steam engine, and the computer. Others are social or intellectual technologies: voting, banking, consequentialist ethics, the scientific method; like mechanical technologies these too have traceable origin moments, and disseminate through societies, becoming permanently available thereafter. Each new tool in our toolkit adds more complexity, and complexity yields both new solutions and new problems, broadening the range of strategies we can use while also introducing new threats, generated either intentionally through conflict or unintentionally when we disrupt systems (social, biological, or geological) that we don’t fully understand.  Sometimes as things change people reach for the old tools, just as sometimes when the high-tech tool doesn’t fix our broken machine we hit it with a rock. And sometimes the rock works, just as sometimes a strategy which was abandoned in the Middle Ages turns out to work better in a later period. This can make things feel cyclical but they aren’t, since the new tools in the toolkit are still there and the old ones won’t have the same effect now that they did then—authoritarianism with the Internet cannot be the same thing as pre-modern authoritarianism, it just can’t.  Things may feel cyclical when old things are tried anew, and especially when old problems are re-unleashed. However, we’re steadily gaining in power, and in our understanding of the local and global systems that we’re continually disrupting—as our knowledge increases, we’re becoming better at correcting, and even avoiding side-effects of our actions. We can’t stop new tools from entering the toolkit, or remove them once they’re there, but one thing we can do is change ourselves, and how we choose to use them.  Another thing to keep in mind is that humanity is actually quite new to the process of intentionally trying to change our world with every generation. Oversimplifying briefly (for more detail see my blog), it wasn’t until the early 17th century that we really had the idea that constant intentional progress which could make each generation’s experience better than (or at least different from) the previous generation. It wasn’t until the Enlightenment matured in the 18th century that humans started to make intentional mass interventions in our own society, like universal education or legal overhauls.  Enlightenment mass social experiments had enormous benefits, but also explosively destructive side-effects, ranging from the French Revolution and colonial atrocities to the countless life-shortening effects of industrialization. It wasn’t until the end of the 19th century if not the early 20th that we came to understand that mass attempts at change disrupt a much more complicated system than we had imagined. That interconnectivity of society is an order of magnitude or two more complex than our Enlightenment predecessors had imagined (similarly at the same time we were learning that biology and disease are an order of magnitude more complex too, which is why our sanitation victory over cholera resulted in a disastrous increase in polio).  In that sense, we’ve had less than a century of understanding how complex the systems are, so we as a species are in the very early stages of learning how to make changes in such complex systems. I do think we are getting better at it, and that we will get better at it over time, but also that we’re really just starting that process, and it’s a new process, so it will be a few centuries until we understand systems enough to be really good at it.  In the meantime, as with baby steps, we’ll keep stumbling and hurting ourselves. That’s what raises very painful moral questions, such as when it is and isn’t appropriate to risk hurting/endangering people in the present to save/help greater numbers in the future. Which is why one of the biggest questions I ask in Terra Ignota is whether you would destroy a good present world to save a better future one. That’s a question we face every day without naming it, when we think about progress.  When you created a world where everything was in commuting distance, what was one of the most surprising implications that popped up while you were outlining these books?  We don’t see this much in the book, but it created a different kind of scarcity: the physical capacity of unique spaces. This is a prosperous future, with plenty of all resources and no one living below or even near a poverty line. However, no matter how efficiently your tech-printer, kitchen garden, and meat maker can supply goods and food, only ten thousand people a day can physically fit in the Uffizi Gallery, and each restaurant only has so many tables. Of course, every other restaurant and museum on Earth is within reach as a Plan B when one is full, but those places which are considered the most famous, the most popular, the best in some sense, would still have enormous demand. Every time a newspaper poll names somewhere one of the top ten ramen shops on Earth, that shop will suddenly have a two-year wait list for a table. In such a society, ostentatious opulence isn’t a suit covered in diamonds, it’s being able to afford spontaneous visits to in-demand places, paying someone $10,000 to give you the restaurant reservation they’ve been waiting on for 2 years, or paying $1,000,000 for a lifetime Uffizi line-skipping pass.  Sex has been used as a weapon and a way to gain power throughout history. Does Madame D’Arouet have any historical inspiration?  Madame de Pompadour is the obvious corollary, the incredibly powerful mistress of Louis XV. That’s how Madame sees herself, but for me it is more directly based on some of the fictitious stories of devious and powerful women told in the course of Diderot’s Jacques the Fatalist, and also in de Sade’s Philosophy in the Bedroom.  Diderot and de Sade were interested in the artificiality of social mores, how patterns of power, and seduction, and marriage, and relations are largely arbitrary rules invented by human society, and how it’s easier to manipulate those rules if you start thinking of them as arbitrary and not real.  But unlike de Sade, Diderot believed that it’s very hard to do that because society works so hard to ingrain belief in social mores in us, and that even people who can distance themselves from and manipulate social mores in some circumstances often remain viscerally locked in to other social mores. And Madame’s plans for her son are modeled partly on the version of the Roman Empress Livia (Augustus’ wife) as depicted in Robert Graves’ I Claudius.  Writers with other jobs frequently have that career impact their writing in unique and interesting ways. How has being a professor impacted your writing?  Being a historian, especially a historian of the pre-modern world, makes me think about longer timeframes than many people. For me 200 years is a very short time, and I have a good sense of how quickly change moves in a century or half-century. It also means that I have a deep palette of historical examples that come to mind instead of just modern ones.  When speculating about ways the future could be, a lot of people look at trends that we have experienced in our lifetimes, things that are different now from ten or twenty or fifty years ago, but I tend to think more readily about what’s different from 400 years ago. So a lot of things that seem stable to others feel like they’re in flux to me, like what grouping of people lives in one house (the nuclear family is a very recent thing!), or whether political units are defined by borders (since in my period they were usually defined by the ruling family, as borders shifted with every frequent war).  In general I think the past is a great tool for writing science fiction. Sometimes people joke about the expression “different as night and day” by pointing out that there’s nothing more similar to night than day (a 12 hour time period characterized by a particular light level). Similarly, there’s nothing more similar to the future than the past, so having experience working with the past is the ideal training for working with the future.  Do you have another project in the works for after the Terra Ignota series? Can you tell us anything about it?  Since I worldbuild slowly, I build several worlds at once, so I have several other series well worked out, ready to hit the outlining stage as soon as the last book of Terra Ignota is done. I have others that are less mature and need some more years of development.  The next series I plan to start after Terra Ignota will probably be Hearthfire, a story centered on Viking mythology, drawing on my reading of primary sources, and the themes of Norse myth that I’ve developed in my music. I also have another about ready to go which is darker and grittier, sort-of survival horror, and a few others slowly maturing, some fantasy, some SF, some historical.  Will Children of the Forest ever see the light of day or is that something you're going to keep in your desk drawer for now?  No, that one was very well-suited to a twelve-year-old playing with Robin Hood toys in her backyard, and a wonderful first learning experience about creating characters, stories, and learning how to introduce them to an audience, but I only ever wrote about half a chapter of it, and there isn’t really much of a there there.  I do have some other more mature early projects, worlds I developed in my college and early grad school years, that I used for the writing projects that eventually got my prose good enough to write Terra Ignota, and I do plan to go back and write some new works set in those worlds at some point, between the new ones.  Have you composed any a cappella music lately? Maybe more music about Norse gods?  I have a song about Frey and Freya slowly percolating in my quiet moments. My current musical projects are to finish “Friend in the Dark,” a half-finished album of new higher-quality versions of a lot of my older music, and to record a new CD of Renaissance polyphonic music that I’ve been working on editing down from six and five part pieces into trios. I’m concentrating on ones that aren’t available in recorded form anywhere, and on pastoral madrigals, the ones about shepherds and nymphs dating and dumping each other, which I’m weaving together into an ongoing narrative, so the whole selection, by different composers, will tell one story if you listen to it all the way through.  Since you're a historian with a particular focus on Italy, where is the best gelato in Florence?  Ha! I have put a lot of real world experience points into studying gelato, and perhaps the most important conclusion is that there is no one best gelato place, instead many different gelato places excel at a particular thing, so it’s best to visit several to get the best of both.  In Florence my home-away-from-home is Gelateria Perchè No . . . ! (which means Why not . . . !) which I love for its extraordinary sorbets, always made with the best seasonal fruit: figs and pears in the autumn, mandarins and Sicilian citrus in the winter, berries in the spring, then cantaloupe, and the summer masterpiece of watermelon granita (I don’t even really like watermelon but it’s just so good!!!)  But for a creamy dairy gelato I go to Rivareno, which has an extraordinarily smooth texture, fantastic for “fior di panna” (pure cream), and in summer a mango yogurt flavor that’s out of this world. For chocolate gelato I go to the chocolate shop Vestri, which does an amazing affogato with chocolate gelato covered in either espresso, liquid chocolate, or liqueur. And there’s such a fabulous dark caramel at GROM, and apple and pear in the autumn.  I have a cunning scheme someday to go to Florence with three friends, synchronize our watches, and go to all four shops at the same time, get the three best flavors from each, then meet in front of the Palazzo Vecchio and EAT THEM ALL TOGETHER! Then we will have the best gelato in Florence! (Wahahaha!) Of course, then we’ll have to go to Rome for San Crispino’s meringue semifredi, and for Giolitti’s sour cherry sorbet, and their chocolate-dipped cones stuffed with whipped cream.  Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nEnlightenment Voices and Norse A Cappella: A Conversation with Ada Palmer\nHistory and the future are inexorably intertwined. It’s impossible to predict what will happen without first considering what has come before. Empires, dynasties, religions, and philosophical movements ebb and flow, pushing forward towards the horizon. This is why some of the best science fiction has one foot rooted deeply in history.\nIn Too Like the Lightning Ada Palmer introduced us to a world where everything was within commuting distance, national boundaries had been redrawn to encompass like-minded thinkers, the outward practice of religion had been banned, and we met a child with the inexplicable ability to breathe life into inanimate objects. And so began the Terra Ignota series. Written with the eloquent voice of Enlightenment thinkers, pulling from the philosophical annals of history, and told through the eyes of a witty and somewhat unreliable narrator, Seven Surrenders picks up where the first book left off and leads you deeper into the complex machinations of the utopia Palmer has created.\nAda Palmer is a professor in the history department at University of Chicago, specializing in Renaissance history and the history of ideas. She is also a composer of folk and Renaissance-tinged a capella music, most of which she performs with the group Sassafras. Her newest novel, Seven Surrenders, is the second in the Terra Ignota series and was released on March 7th from Tor Books.\nThe voice chosen for Too Like the Lightning and Seven Surrenders is unlike anything I've read in sci-fi before. What made you choose the particular Enlightenment style?\nI had been reading Enlightenment science fiction. Though we think of SF as a 20th or perhaps 19th century genre, Voltaire wrote a short story called “Micromegas” where giant, many-mile-tall aliens come to Earth from another star, and encounter humans. And when they make first contact, the first things they ask each other are whether Descartes is right about the dualistic nature of the soul, whether the existence of Providence can be deduced from observations of Nature, and whether or not God made the universe for Man.\nThese are absolutely not the questions we have humans and aliens ask each other in first contact stories, which made me realize that our first contact stories are equally distorted in a sense, so that our aliens and humans ask each other about the hot issues of our day: whether technology will outstrip human control, the limits of the human, whether faith is in tension with science. I wanted to use the more sophisticated tools of modern science fiction, with all our development of tropes, cues, imagined technologies, but to interrogate a classic SF future (with flying cars, robot assistants, etc.) using the palette of questions that Voltaire and his colleagues had been concerned with in the 18th century, to see what happens when we put these amazing tools at the service of a different and non-modern set of questions.\nKeeping the Enlightenment voice made sense to me, especially since authors like Diderot used direct address and dialog between the reader and the author so fruitfully, to create a special kind of intimacy with the narrator, and to ask questions about free will and power dynamics, such as the reader’s power over the author.\nYour novels use different punctuation marks to highlight the language being spoken whether it is Spanish or Japanese or English. What inspired you to make this choice?\nI read comic books, and they use different kinds of quotation marks all the time to differentiate things like telepathy, or radio communications, and many of the marks they use are quotation marks from non-English languages. That made me think I could use the same marks to differentiate my polyglot world and help bring readers’ attention to the fact that so much of the action wasn’t happening in English.\nSince 20th century SF has been so dominated by America and the UK, English-speaking nations and their future descendants tend to loom extra-large in a lot of science fiction, so I wanted to write something where other cultures and their linguistic traditions were more visible. This is a polyglot future where English is the lingua franca but hasn’t erased other languages, far from it. Other languages are powerful as identity markers, and I wanted to make that visible.\nI've read that you like to outline your books and really stick to them. What did your planning and writing process look like for Seven Surrenders?\nI worldbuilt first, mulling on ideas and ingredients for the world, for about five years. Characters developed as part of that process—I would have an idea for an interesting character, or an interesting situation or relationship a person might be in, and then spin out from that the structures necessary to make that person exist and make sense. After the world was fully mature and populated, I spent six months outlining the series, made a complete chapter-by-chapter outline of the first two books, and a less-thorough but still detailed outline of the later two as well. Then I sat down and started book one, and, immediately after, book two, all in one flow, usually writing for an hour in the morning every day. The actual writing process for the first two books took me a little over a year.\nThe world you created is a utopia built on trade-offs. There is peace, but at the cost of some freedom and the banning of religion. Some people can gain incredible computing power but they give up some of their senses. Do you think that compromise is inherent in being able to move forward?\nI don’t think it’s inherent, but I think it’s been the common historical experience, and while I think humanity will gradually get better and better at things, and that progress will have fewer negative effects, I don’t think we’ll be there by 2450. I’m a historian so, looking 400 years in our future, it made sense to me to look 400 years back, look at how much change there has been, and imagine a comparable if somewhat larger amount of change, with comparable sacrifices. One of my goals is to make the reader of Terra Ignota have an experience similar to the experience Voltaire or Diderot or Mary Wollstonecraft—great future-builders who shaped our world by working hard to make a better one—would have if they came forward to our present.\nSome things would make them weep for joy: advanced medicine, 80-year average life spans, universal suffrage, widespread education, footprints on the Moon. Others things would be depressingly familiar: religious violence still raging, sexism still rampant, judicial torture still rearing its head. And other things they had held precious would be shockingly absent: France losing its worldwide cultural dominance, fashion and music incomprehensible, mores and daily behavior alien and frightening.\nIf you asked such an Enlightenment time-traveler, “Was it worth-it? You dedicated your life to making this world—are you content with the result?” they couldn’t give an easy “Yes” or an easy “No” because so much would be right, and so much would be unfinished, and so much would be gone. I wanted this world to ask the same question of us: if this were the future our efforts made, with some invaluable improvements, some frightening losses, and some cultural battles still depressingly unfinished, would that be worth-it? Because, realistically, that is what we would see if we could look forward 400 years.\nDo you think that civilization is cyclical or is it more of a collection of building blocks that get mixed and matched as time passes?\nI think more in terms of humanity acquiring more tools over time. Some tools are technologies: fire, the moldboard plow, the steam engine, and the computer. Others are social or intellectual technologies: voting, banking, consequentialist ethics, the scientific method; like mechanical technologies these too have traceable origin moments, and disseminate through societies, becoming permanently available thereafter. Each new tool in our toolkit adds more complexity, and complexity yields both new solutions and new problems, broadening the range of strategies we can use while also introducing new threats, generated either intentionally through conflict or unintentionally when we disrupt systems (social, biological, or geological) that we don’t fully understand.\nSometimes as things change people reach for the old tools, just as sometimes when the high-tech tool doesn’t fix our broken machine we hit it with a rock. And sometimes the rock works, just as sometimes a strategy which was abandoned in the Middle Ages turns out to work better in a later period. This can make things feel cyclical but they aren’t, since the new tools in the toolkit are still there and the old ones won’t have the same effect now that they did then—authoritarianism with the Internet cannot be the same thing as pre-modern authoritarianism, it just can’t.\nThings may feel cyclical when old things are tried anew, and especially when old problems are re-unleashed. However, we’re steadily gaining in power, and in our understanding of the local and global systems that we’re continually disrupting—as our knowledge increases, we’re becoming better at correcting, and even avoiding side-effects of our actions. We can’t stop new tools from entering the toolkit, or remove them once they’re there, but one thing we can do is change ourselves, and how we choose to use them.\nAnother thing to keep in mind is that humanity is actually quite new to the process of intentionally trying to change our world with every generation. Oversimplifying briefly (for more detail see my blog), it wasn’t until the early 17th century that we really had the idea that constant intentional progress which could make each generation’s experience better than (or at least different from) the previous generation. It wasn’t until the Enlightenment matured in the 18th century that humans started to make intentional mass interventions in our own society, like universal education or legal overhauls.\nEnlightenment mass social experiments had enormous benefits, but also explosively destructive side-effects, ranging from the French Revolution and colonial atrocities to the countless life-shortening effects of industrialization. It wasn’t until the end of the 19th century if not the early 20th that we came to understand that mass attempts at change disrupt a much more complicated system than we had imagined. That interconnectivity of society is an order of magnitude or two more complex than our Enlightenment predecessors had imagined (similarly at the same time we were learning that biology and disease are an order of magnitude more complex too, which is why our sanitation victory over cholera resulted in a disastrous increase in polio).\nIn that sense, we’ve had less than a century of understanding how complex the systems are, so we as a species are in the very early stages of learning how to make changes in such complex systems. I do think we are getting better at it, and that we will get better at it over time, but also that we’re really just starting that process, and it’s a new process, so it will be a few centuries until we understand systems enough to be really good at it.\nIn the meantime, as with baby steps, we’ll keep stumbling and hurting ourselves. That’s what raises very painful moral questions, such as when it is and isn’t appropriate to risk hurting/endangering people in the present to save/help greater numbers in the future. Which is why one of the biggest questions I ask in Terra Ignota is whether you would destroy a good present world to save a better future one. That’s a question we face every day without naming it, when we think about progress.\nWhen you created a world where everything was in commuting distance, what was one of the most surprising implications that popped up while you were outlining these books?\nWe don’t see this much in the book, but it created a different kind of scarcity: the physical capacity of unique spaces. This is a prosperous future, with plenty of all resources and no one living below or even near a poverty line. However, no matter how efficiently your tech-printer, kitchen garden, and meat maker can supply goods and food, only ten thousand people a day can physically fit in the Uffizi Gallery, and each restaurant only has so many tables. Of course, every other restaurant and museum on Earth is within reach as a Plan B when one is full, but those places which are considered the most famous, the most popular, the best in some sense, would still have enormous demand. Every time a newspaper poll names somewhere one of the top ten ramen shops on Earth, that shop will suddenly have a two-year wait list for a table. In such a society, ostentatious opulence isn’t a suit covered in diamonds, it’s being able to afford spontaneous visits to in-demand places, paying someone $10,000 to give you the restaurant reservation they’ve been waiting on for 2 years, or paying $1,000,000 for a lifetime Uffizi line-skipping pass.\nSex has been used as a weapon and a way to gain power throughout history. Does Madame D’Arouet have any historical inspiration?\nMadame de Pompadour is the obvious corollary, the incredibly powerful mistress of Louis XV. That’s how Madame sees herself, but for me it is more directly based on some of the fictitious stories of devious and powerful women told in the course of Diderot’s Jacques the Fatalist, and also in de Sade’s Philosophy in the Bedroom.\nDiderot and de Sade were interested in the artificiality of social mores, how patterns of power, and seduction, and marriage, and relations are largely arbitrary rules invented by human society, and how it’s easier to manipulate those rules if you start thinking of them as arbitrary and not real.\nBut unlike de Sade, Diderot believed that it’s very hard to do that because society works so hard to ingrain belief in social mores in us, and that even people who can distance themselves from and manipulate social mores in some circumstances often remain viscerally locked in to other social mores. And Madame’s plans for her son are modeled partly on the version of the Roman Empress Livia (Augustus’ wife) as depicted in Robert Graves’ I Claudius.\nWriters with other jobs frequently have that career impact their writing in unique and interesting ways. How has being a professor impacted your writing?\nBeing a historian, especially a historian of the pre-modern world, makes me think about longer timeframes than many people. For me 200 years is a very short time, and I have a good sense of how quickly change moves in a century or half-century. It also means that I have a deep palette of historical examples that come to mind instead of just modern ones.\nWhen speculating about ways the future could be, a lot of people look at trends that we have experienced in our lifetimes, things that are different now from ten or twenty or fifty years ago, but I tend to think more readily about what’s different from 400 years ago. So a lot of things that seem stable to others feel like they’re in flux to me, like what grouping of people lives in one house (the nuclear family is a very recent thing!), or whether political units are defined by borders (since in my period they were usually defined by the ruling family, as borders shifted with every frequent war).\nIn general I think the past is a great tool for writing science fiction. Sometimes people joke about the expression “different as night and day” by pointing out that there’s nothing more similar to night than day (a 12 hour time period characterized by a particular light level). Similarly, there’s nothing more similar to the future than the past, so having experience working with the past is the ideal training for working with the future.\nDo you have another project in the works for after the Terra Ignota series? Can you tell us anything about it?\nSince I worldbuild slowly, I build several worlds at once, so I have several other series well worked out, ready to hit the outlining stage as soon as the last book of Terra Ignota is done. I have others that are less mature and need some more years of development.\nThe next series I plan to start after Terra Ignota will probably be Hearthfire, a story centered on Viking mythology, drawing on my reading of primary sources, and the themes of Norse myth that I’ve developed in my music. I also have another about ready to go which is darker and grittier, sort-of survival horror, and a few others slowly maturing, some fantasy, some SF, some historical.\nWill Children of the Forest ever see the light of day or is that something you're going to keep in your desk drawer for now?\nNo, that one was very well-suited to a twelve-year-old playing with Robin Hood toys in her backyard, and a wonderful first learning experience about creating characters, stories, and learning how to introduce them to an audience, but I only ever wrote about half a chapter of it, and there isn’t really much of a there there.\nI do have some other more mature early projects, worlds I developed in my college and early grad school years, that I used for the writing projects that eventually got my prose good enough to write Terra Ignota, and I do plan to go back and write some new works set in those worlds at some point, between the new ones.\nHave you composed any a cappella music lately? Maybe more music about Norse gods?\nI have a song about Frey and Freya slowly percolating in my quiet moments. My current musical projects are to finish “Friend in the Dark,” a half-finished album of new higher-quality versions of a lot of my older music, and to record a new CD of Renaissance polyphonic music that I’ve been working on editing down from six and five part pieces into trios. I’m concentrating on ones that aren’t available in recorded form anywhere, and on pastoral madrigals, the ones about shepherds and nymphs dating and dumping each other, which I’m weaving together into an ongoing narrative, so the whole selection, by different composers, will tell one story if you listen to it all the way through.\nSince you're a historian with a particular focus on Italy, where is the best gelato in Florence?\nHa! I have put a lot of real world experience points into studying gelato, and perhaps the most important conclusion is that there is no one best gelato place, instead many different gelato places excel at a particular thing, so it’s best to visit several to get the best of both.\nIn Florence my home-away-from-home is Gelateria Perchè No . . . ! (which means Why not . . . !) which I love for its extraordinary sorbets, always made with the best seasonal fruit: figs and pears in the autumn, mandarins and Sicilian citrus in the winter, berries in the spring, then cantaloupe, and the summer masterpiece of watermelon granita (I don’t even really like watermelon but it’s just so good!!!)\nBut for a creamy dairy gelato I go to Rivareno, which has an extraordinarily smooth texture, fantastic for “fior di panna” (pure cream), and in summer a mango yogurt flavor that’s out of this world. For chocolate gelato I go to the chocolate shop Vestri, which does an amazing affogato with chocolate gelato covered in either espresso, liquid chocolate, or liqueur. And there’s such a fabulous dark caramel at GROM, and apple and pear in the autumn.\nI have a cunning scheme someday to go to Florence with three friends, synchronize our watches, and go to all four shops at the same time, get the three best flavors from each, then meet in front of the Palazzo Vecchio and EAT THEM ALL TOGETHER! Then we will have the best gelato in Florence! (Wahahaha!) Of course, then we’ll have to go to Rome for San Crispino’s meringue semifredi, and for Giolitti’s sour cherry sorbet, and their chocolate-dipped cones stuffed with whipped cream.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/palmer_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Enlightenment Voices and Norse A Cappella: A Conversation with Ada Palmer by Chris Urie"}