{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Michael Swanwick", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "v8YYDtYB9RpabCw2K5si6a72grs=", "id": null, "license": null, "comments": "", "raw_text": "7300 words, short story, REPRINT  From Babel's Fall'n Glory We Fled . . .  Imagine a cross between Byzantium and a termite mound. Imagine a jeweled mountain, slender as an icicle, rising out of the steam jungles and disappearing into the dazzling pearl-grey skies of Gehenna. Imagine that Gaudi—he of the Sagrada Familia and other biomorphic architectural whimsies—had been commissioned by a nightmare race of giant black millipedes to recreate Barcelona at the height of its glory, along with touches of the Forbidden City in the eighteenth century and Tokyo in the twenty-second, all within a single miles-high structure. Hold every bit of that in your mind at once, multiply by a thousand, and you’ve got only the faintest ghost of a notion of the splendor that was Babel.  Now imagine being inside Babel when it fell.  Hello. I’m Rosamund. I’m dead. I was present in human form when it happened and as a simulation chaotically embedded within a liquid crystal data-matrix then and thereafter up to the present moment. I was killed instantly when the meteors hit. I saw it all.  Rosamund means “rose of the world.” It’s the third most popular female name on Europa, after Gaea and Virginia Dare. For all our elaborate sophistication, we wear our hearts on our sleeves, we Europans.  Here’s what it was like:  “Wake up! Wake up! Wake up!”  “Wha—?” Carlos Quivera sat up, shedding rubble. He coughed, choked, shook his head. He couldn’t seem to think clearly. An instant ago he’d been standing in the chilled and pressurized embassy suite, conferring with Arsenio. Now . . . “How long have I been asleep?”  “Unconscious. Ten hours,” his suit (that’s me—Rosamund!) said. It had taken that long to heal his burns. Now it was shooting wake-up drugs into him: amphetamines, endorphins, attention enhancers, a witch’s brew of chemicals. Physically dangerous, but in this situation, whatever it might be, Quivera would survive by intelligence or not at all. “I was able to form myself around you before the walls ruptured. You were lucky.”  “The others? Did the others survive?”  “Their suits couldn’t reach them in time.”  “Did Rosamund . . . ?”  “All the others are dead.”  Quivera stood.  Even in the aftermath of disaster, Babel was an imposing structure. Ripped open and exposed to the outside air, a thousand rooms spilled over one another toward the ground. Bridges and buttresses jutted into gaping smoke-filled canyons created by the slow collapse of hexagonal support beams (this was new data; I filed it under Architecture, subheading: Support Systems with links to Esthetics and Xenopsychology) in a jumbled geometry that would have terrified Piranesi himself. Everywhere, gleaming black millies scurried over the rubble.  Quivera stood.  In the canted space about him, bits and pieces of the embassy rooms were identifiable: a segment of wood molding, some velvet drapery now littered with chunks of marble, shreds of wallpaper (after a design by William Morris) now curling and browning in the heat. Human interior design was like nothing native to Gehenna and it had taken a great deal of labor and resources to make the embassy so pleasant for human habitation. The queen-mothers had been generous with everything but their trust.  Quivera stood.  There were several corpses remaining as well, still recognizably human though they were blistered and swollen by the savage heat. These had been his colleagues (all of them), his friends (most of them), his enemies (two, perhaps three), and even his lover (one). Now they were gone, and it was as if they had been compressed into one indistinguishable mass, and his feelings toward them all as well: shock and sorrow and anger and survivor guilt all slagged together to become one savage emotion.  Quivera threw back his head and howled.  I had a reference point now. Swiftly, I mixed serotonin-precursors and injected them through a hundred microtubules into the appropriate areas of his brain. Deftly, they took hold. Quivera stopped crying. I had my metaphorical hands on the control knobs of his emotions. I turned him cold, cold, cold.  “I feel nothing,” he said wonderingly. “Everyone is dead, and I feel nothing.” Then, flat as flat: “What kind of monster am I?”  “My monster,” I said fondly. “My duty is to ensure that you and the information you carry within you get back to Europa. So I have chemically neutered your emotions. You must remain a meat puppet for the duration of this mission.” Let him hate me—I who have no true ego, but only a facsimile modeled after a human original—all that mattered now was bringing him home alive.  “Yes.” Quivera reached up and touched his helmet with both hands, as if he would reach through it and feel his head to discover if it were as large as it felt. “That makes sense. I can’t be emotional at a time like this.”  He shook himself, then strode out to where the gleaming black millies were scurrying by. He stepped in front of one, a least-cousin, to question it. The millie paused, startled. Its eyes blinked three times in its triangular face. Then, swift as a tickle, it ran up the front of his suit, down the back, and was gone before the weight could do more than buckle his knees.  “Shit!” he said. Then, “Access the wiretaps. I’ve got to know what happened.”  Passive wiretaps had been implanted months ago, but never used, the political situation being too tense to risk their discovery. Now his suit activated them to monitor what remained of Babel’s communications network: A demon’s chorus of pulsed messages surging through a shredded web of cables. Chaos, confusion, demands to know what had become of the queen-mothers. Analytic functions crunched data, synthesized, synopsized: “There’s an army outside with Ziggurat insignia. They’ve got the city surrounded. They’re killing the refugees.”  “Wait, wait . . . ” Quivera took a deep, shuddering breath. “Let me think.” He glanced briskly about and for the second time noticed the human bodies, ruptured and parboiled in the fallen plaster and porphyry. “Is one of those Rosamund?”  “I’m dead, Quivera. You can mourn me later. Right now, survival is priority number one,” I said briskly. The suit added mood-stabilizers to his maintenance drip.  “Stop speaking in her voice.”  “Alas, dear heart, I cannot. The suit’s operating on diminished function. It’s this voice or nothing.”  He looked away from the corpses, eyes hardening. “Well, it’s not important.” Quivera was the sort of young man who was energized by war. It gave him permission to indulge his ruthless side. It allowed him to pretend he didn’t care. “Right now, what we have to do is—”  “Uncle Vanya’s coming,” I said. “I can sense his pheromones.”  Picture a screen of beads, crystal lozenges, and rectangular lenses. Behind that screen, a nightmare face like a cross between the front of a locomotive and a tree grinder. Imagine on that face (though most humans would be unable to read them) the lineaments of grace and dignity seasoned by cunning and, perhaps, a dash of wisdom. Trusted advisor to the queen-mothers. Second only to them in rank. A wily negotiator and a formidable enemy. That was Uncle Vanya.  Two small speaking-legs emerged from the curtain, and he said:  ::(cautious) greetings::  |  ::(Europan vice-consul 12)/Quivera/[treacherous vermin]::  |  ::obligations <untranslatable> (grave duty)::  | |  ::demand/claim [action]:: ::promise (trust)::  “Speak pidgin, damn you! This is no time for subtlety.”  The speaking legs were very still for a long moment. Finally they moved again:  ::The queen-mothers are dead::  “Then Babel is no more. I grieve for you.”  ::I despise your grief:: A lean and chitinous appendage emerged from the beaded screen. From its tripartite claw hung a smooth white rectangle the size of a briefcase. ::I must bring this to (sister-city)/Ur/[absolute trust]::  “What is it?”  A very long pause. Then, reluctantly ::Our library::  “Your library.” This was something new. Something unheard-of. Quivera doubted the translation was a good one. “What does it contain?”  ::Our history. Our sciences. Our ritual dances. A record-of-kinship dating back to the (Void)/Origin/[void]. Everything that can be saved is here::  A thrill of avarice raced through Quivera. He tried to imagine how much this was worth, and could not. Values did not go that high. However much his superiors screwed him out of (and they would work very hard indeed to screw him out of everything they could) what remained would be enough to buy him out of debt, and do the same for a wife and their children after them as well. He did not think of Rosamund. “You won’t get through the army outside without my help,” he said. “I want the right to copy—” How much did he dare ask for? “—three tenths of one percent. Assignable solely to me. Not to Europa. To me.”  Uncle Vanya dipped his head, so that they were staring face to face. ::You are (an evil creature)/[faithless]. I hate you::  Quivera smiled. “A relationship that starts out with mutual understanding has made a good beginning.”  ::A relationship that starts out without trust will end badly::  “That’s as it may be.” Quivera looked around for a knife. “The first thing we have to do is castrate you.”  This is what the genocides saw:  They were burning pyramids of corpses outside the city when a Europan emerged, riding a gelded least-cousin. The soldiers immediately stopped stacking bodies and hurried toward him, flowing like quicksilver, calling for their superiors.  The Europan drew up and waited.  The officer who interrogated him spoke from behind the black glass visor of a delicate-legged war machine. He examined the Europan’s credentials carefully, though there could be no serious doubt as to his species. Finally, reluctantly, he signed ::You may pass::  “That’s not enough,” the Europan (Quivera!) said. “I’ll need transportation, an escort to protect me from wild animals in the steam jungles, and a guide to lead me to . . . ” His suit transmitted the sign for ::(starport)/Ararat/[trust-for-all]::  The officer’s speaking-legs thrashed in what might best be translated as scornful laughter. ::We will lead you to the jungle and no further/(hopefully-to-die)/[treacherous non-millipede]::  “Look who talks of treachery!” the Europan said (but of course I did not translate his words), and with a scornful wave of one hand, rode his neuter into the jungle.  The genocides never bothered to look closely at his mount. Neutered least-cousins were beneath their notice. They didn’t even wear face-curtains, but went about naked for all the world to scorn.  Black pillars billowed from the corpse-fires into a sky choked with smoke and dust. There were hundreds of fires and hundreds of pillars and, combined with the low cloud cover, they made all the world seem like the interior of a temple to a vengeful god. The soldiers from Ziggurat escorted him through the army and beyond the line of fires, where the steam jungles waited, verdant and threatening.  As soon as the green darkness closed about them, Uncle Vanya twisted his head around and signed ::Get off me/vast humiliation/[lack-of-trust]::  “Not a chance,” Quivera said harshly. “I’ll ride you ‘til sunset, and all day tomorrow and for a week after that. Those soldiers didn’t fly here, or you’d have seen them coming. They came through the steam forest on foot, and there’ll be stragglers.”  The going was difficult at first, and then easy, as they passed from a recently forested section of the jungle into a stand of old growth. The boles of the “trees” here were as large as those of the redwoods back on Earth, some specimens of which are as old as five thousand years. The way wended back and forth. Scant sunlight penetrated through the canopy, and the steam quickly drank in what little light Quivera’s headlamp put out. Ten trees in, they would have been hopelessly lost had it not been for the suit’s navigational functions and the mapsats that fed it geodetic mathscapes accurate to a finger’s span of distance.  Quivera pointed this out. “Learn now,” he said, “the true value of information.”  ::Information has no value:: Uncle Vanya said ::without trust::  Quivera laughed. “In that case you must, all against your will, trust me.”  To this Uncle Vanya had no answer.  At nightfall, they slept on the sheltered side of one of the great parasequoias. Quivera took two refrigeration sticks from the saddlebags and stuck them upright in the dirt. Uncle Vanya immediately coiled himself around his and fell asleep. Quivera sat down beside him to think over the events of the day, but under the influence of his suit’s medication, he fell asleep almost immediately as well.  All machines know that humans are happiest when they think least.  In the morning, they set off again.  The terrain grew hilly, and the old growth fell behind them. There was sunlight and to spare now, bounced and reflected about by the ubiquitous jungle steam and by the synthetic-diamond coating so many of this world’s plants and insects employ for protection.  As they traveled, they talked. Quivera was still complexly medicated, but the dosages had been decreased. It left him in a melancholy, reflective mood.  “It was treachery,” Quivera said. Though we maintained radio silence out of fear of Ziggurat troops, my passive receivers fed him regular news reports from Europa. “The High Watch did not simply fail to divert a meteor. They let three rocks through. All of them came slanting low through the atmosphere, aimed directly at Babel. They hit almost simultaneously.”  Uncle Vanya dipped his head. ::Yes:: he mourned. ::It has the stench of truth to it. It must be (reliable)/a fact/[absolutely trusted]::  “We tried to warn you.”  ::You had no (worth)/trust/[worthy-of-trust]:: Uncle Vanya’s speaking legs registered extreme agitation. ::You told lies::  “Everyone tells lies.”  “No. We-of-the-Hundred-Cities are truthful/truthful/[never-lie]::  “If you had, Babel would be standing now.”  ::No!/NO!/[no!!!]::  “Lies are a lubricant in the social machine. They ease the friction when two moving parts mesh imperfectly.”  ::Aristotle, asked what those who tell lies gain by it, replied: That when they speak the truth they are not believed::  For a long moment Quivera was silent. Then he laughed mirthlessly. “I almost forgot that you’re a diplomat. Well, you’re right, I’m right, and we’re both screwed. Where do we go from here?”  ::To (sister-city)/Ur/[absolute trust]:: Uncle Vanya signed, while “You’ve said more than enough,” his suit (me!) whispered in Quivera’s ear. “Change the subject.”  A stream ran, boiling, down the center of the dell. Run-off from the mountains, it would grow steadily smaller until it dwindled away to nothing. Only the fact that the air above it was at close to one hundred percent saturation had kept it going this long. Quivera pointed. “Is that safe to cross?”  ::If (leap-over-safe) then (safe)/best not/[reliable distrust]::  “I didn’t think so.”  They headed downstream. It took several miles before the stream grew small enough that they were confident to jump it. Then they turned toward Ararat—the Europans had dropped GPS pebble satellites in low Gehenna orbit shortly after arriving in the system and making contact with the indigenes, but I don’t know from what source Uncle Vanya derived his sense of direction.  It was inerrant, however. The mapsats confirmed it. I filed that fact under Unexplained Phenomena with tentative links to Physiology and Navigation. Even if both my companions died and the library were lost, this would still be a productive journey, provided only that Europan searchers could recover me within ten years, before my data lattice began to degrade.  For hours Uncle Vanya walked and Quivera rode in silence. Finally, though, they had to break to eat. I fed Quivera nutrients intravenously and the illusion of a full meal through somatic shunts. Vanya burrowed furiously into the earth and emerged with something that looked like a grub the size of a poodle, which he ate so vigorously that Quivera had to look away.  (I filed this under Xenoecology, subheading: Feeding Strategies. The search for knowledge knows no rest.)  Afterwards, while they were resting, Uncle Vanya resumed their conversation, more formally this time:  ::(for what) purpose/reason::  |  ::(Europan vice-consul12)/Quivera/[not trusted]::  |  ::voyagings (search-for-trust)/ [action]::  | |  ::(nest)/Europa/<untranslatable>:: ::violate/[absolute resistance]::  | | |  ::(nest)/[trust] Gehenna/[trust] Home/[trust]::  “Why did you leave your world to come to ours?” I simplified/translated. “Except he believes that humans brought their world here and parked it in orbit.” This was something we had never been able to make the millies understand; that Europa, large though it was, was not a planetlet but a habitat, a ship if you will, though by now well over half a million inhabitants lived in tunnels burrowed deep in its substance. It was only a city, however, and its resources would not last forever. We needed to convince the Gehennans to give us a toehold on their planet if we were, in the long run, to survive. But you knew that already.  “We’ve told you this before. We came looking for new information.”  ::Information is (free)/valueless/[despicable]::  “Look,” Quivera said. “We have an information-based economy. Yours is based on trust. The mechanisms of each are not dissimilar. Both are expansive systems. Both are built on scarcity. And both are speculative. Information or trust is bought, sold, borrowed, and invested. Each therefore requires a continually expanding economic frontier which ultimately leaves the individual so deep in debt as to be virtually enslaved to the system. You see?”  ::No::  “All right. Imagine a simplified capitalist system—that’s what both our economies are, at root. You’ve got a thousand individuals, each of whom makes a living by buying raw materials, improving them, and selling them at a profit. With me so far?”  Vanya signaled comprehension.  “The farmer buys seed and fertilizer, and sells crops. The weaver buys wool and sells cloth. The chandler buys wax and sells candles. The price of their goods is the cost of materials plus the value of their labor. The value of his labor is the worker’s wages. This is a simple market economy. It can go on forever. The equivalent on Gehenna would be the primitive family-states you had long ago, in which everybody knew everybody else, and so trust was a simple matter and directly reciprocal.”  Startled, Uncle Vanya signed ::How did you know about our past?::  “Europans value knowledge. Everything you tell us, we remember.” The knowledge had been assembled with enormous effort and expense, largely from stolen data—but no reason to mention that. Quivera continued, “Now imagine that most of those workers labor in ten factories, making the food, clothing, and other objects that everybody needs. The owners of these factories must make a profit, so they sell their goods for more than they pay for them—the cost of materials, the cost of labor, and then the profit, which we can call ‘added value.’  “But because this is a simplified model, there are no outside markets. The goods can only be sold to the thousand workers themselves, and the total cost of the goods is more than the total amount they’ve been paid collectively for the materials and their labor. So how can they afford it? They go into debt. Then they borrow money to support that debt. The money is lent to them by the factories selling them goods on credit. There is not enough money,—not enough real value—in the system to pay off the debt, and so it continues to increase until it can no longer be sustained. Then there is an catastrophic collapse which we call a depression. Two of the businesses go bankrupt and their assets are swallowed up by the survivors at bargain prices, thus paying off their own indebtedness and restoring equilibrium to the system. In the aftermath of which, the cycle begins again.”  ::What has this to do with ::(beloved city)/Babel/[mother-of-trust]?::  “Your every public action involved an exchange of trust, yes? And every trust that was honored heightened the prestige of the queen-mothers and hence the amount of trust they embodied for Babel itself.”  ::Yes::  “Similarly, the queen-mothers of other cities, including those cities which were Babel’s sworn enemies, embodied enormous amounts of trust as well.”  ::Of course::  “Was there enough trust in all the world to pay everybody back if all the queen-mothers called it in at the same time?”  Uncle Vanya was silent.  “So that’s your explanation for . . . a lot of things. Earth sent us here because it needs new information to cover its growing indebtedness. Building Europa took enormous amounts of information, most of it proprietary, and so we Europans are in debt collectively to our home world and individually to the Lords of the Economy on Europa. With compound interest, every generation is worse off and thus more desperate than the one before. Our need to learn is great, and constantly growing.”  ::(strangers-without-trust)/Europa/[treacherous vermin]::  |  can/should/<untranslatable>  | |  ::demand/claim [negative action]:: ::defy/<untranslatable>/[absolute lack of trust]::  | |  ::(those-who-command-trust):: ::(those-who-are-unworthy of trust)::  “He asks why Europa doesn’t simply declare bankruptcy,” I explained. “Default on its obligations and nationalize all the information received to date. In essence.”  The simple answer was that Europa still needed information that could only be beamed from Earth, that the ingenuity of even half a million people could not match that of an entire planet and thus their technology must always be superior to ours, and that if we reneged on our debts they would stop beaming plans for that technology, along with their songs and plays and news of what was going on in countries that had once meant everything to our great-great-grandparents. I watched Quivera struggle to put all this in its simplest possible form.  Finally, he said, “Because no one would ever trust us again, if we did.”  After a long stillness, Uncle Vanya lapsed back into pidgin. ::Why did you tell me this [untrustworthy] story?::  “To let you know that we have much in common. We can understand each other.”  ::<But>/not/[trust]::  “No. But we don’t need trust. Mutual self-interest will suffice.”  Days passed. Perhaps Quivera and Uncle Vanya grew to understand each other better during this time. Perhaps not. I was able to keep Quivera’s electrolyte balances stable and short-circuit his feedback processes so that he felt no extraordinary pain, but he was feeding off of his own body fat and that was beginning to run low. He was very comfortably starving to death—I gave him two weeks, tops—and he knew it. He’d have to be a fool not to, and I had to keep his thinking sharp if he was going to have any chance of survival.  Their way was intersected by a long, low ridge and without comment Quivera and Uncle Vanya climbed up above the canopy of the steam forest and the cloud of moisture it held into clear air. Looking back, Quivera saw a gully in the slope behind them, its bottom washed free of soil by the boiling runoff and littered with square and rectangular stones, but not a trace of hexagonal beams. They had just climbed the tumulus of an ancient fallen city. It lay straight across the land, higher to the east and dwindling to the west. “My name is Ozymandias, King of Kings,” Quivera said. “Look on my works, ye mighty, and despair!”  Uncle Vanya said nothing.  “Another meteor strike—what were the odds of that?”  Uncle Vanya said nothing.  “Of course, given enough time, it would be inevitable, it if predated the High Watch.”  Uncle Vanya said nothing.  “What was the name of this city?”  ::Very old/(name forgotten)/[First Trust]::  Uncle Vanya moved, as if to start downward, but Quivera stopped him with a gesture. “There’s no hurry,” he said. “Let’s enjoy the view for a moment.” He swept an unhurried arm from horizon to horizon, indicating the flat and unvarying canopy of vegetation before them. “It’s a funny thing. You’d think that, this being one of the first cities your people built when they came to this planet, you’d be able to see the ruins of the cities of the original inhabitants from here.”  The millipede’s speaking arms thrashed in alarm. Then he reared up into the air, and when he came down one foreleg glinted silver. Faster than human eye could follow, he had drawn a curving and deadly tarsi-sword from a camouflaged belly-sheath.  Quivera’s suit flung him away from the descending weapon. He fell flat on his back and rolled to the side. The sword’s point missed him by inches. But then the suit flung out a hand and touched the sword with an electrical contact it had just extruded.  A carefully calculated shock threw Uncle Vanya back, convulsing but still fully conscious.  Quivera stood. “Remember the library!” he said. “Who will know of Babel’s greatness if it’s destroyed?”  For a long time the millipede did nothing that either Quivera or his suit could detect. At last he signed ::How did you know?/(absolute shock)/[treacherous and without faith]::  “Our survival depends on being allowed to live on Gehenna. Your people will not let us do so, no matter what we offer in trade. It was important that we understand why. So we found out. We took in your outlaws and apostates, all those who were cast out of your cities and had nowhere else to go. We gave them sanctuary. In gratitude, they told us what they knew.”  By so saying, Quivera let Uncle Vanya know that he knew the most ancient tale of the Gehennans. By so hearing, Uncle Vanya knew that Quivera knew what he knew. And just so you know what they knew that each other knew and knew was known, here is the tale of . . .  How the True People Came to Gehenna  Long did our Ancestors burrow down through the dark between the stars, before emerging at last in the soil of Gehenna. From the True Home they had come. To Gehenna they descended, leaving a trail of sparks in the black and empty spaces through which they had traveled. The True People came from a world of unimaginable wonders. To it they could never return. Perhaps they were exiles. Perhaps it was destroyed. Nobody knows.  Into the steam and sunlight of Gehenna they burst, and found it was already taken. The First Inhabitants looked like nothing our Ancestors had ever seen. But they welcomed the True People as the queen-mothers would a strayed niece-daughter. They gave us food. They gave us land. They gave us trust.  For a time all was well.  But evil crept into the thoracic ganglia of the True People. They repaid sisterhood with betrayal and trust with murder. Bright lights were called down from the sky to destroy the cities of their benefactors. Everything the First Inhabitants had made, all their books and statues and paintings, burned with the cities. No trace of them remains. We do not even know what they looked like.  This was how the True People brought war to Gehenna. There had never been war before, and now we will have it with us always, until our trust-debt is repaid. But it can never be repaid.  It suffers in translation, of course. The original is told in thirteen exquisitely beautiful ergoglyphs, each grounded on a primal faith-motion. But Quivera was talking, with care and passion:  “Vanya, listen to me carefully. We have studied your civilization and your planet in far greater detail than you realize. You did not come from another world. Your people evolved here. There was no aboriginal civilization. You ancestors did not eradicate an intelligent species. These things are all a myth.”  ::No!/Why?!/[shock]:: Uncle Vanya rattled with emotion. Ripples of muscle spasms ran down his segmented body.  “Don’t go catatonic on me. Your ancestors didn’t lie. Myths are not lies. They are simply an efficient way of encoding truths. We have a similar myth in my religion which we call Original Sin. Man is born sinful. Well . . . who can doubt that? Saying that we are born into a fallen state means simply that we are not perfect, that we are inherently capable of evil.  “Your myth is very similar to ours, but it also encodes what we call the Malthusian dilemma. Population increases geometrically, while food resources increase arithmetically. So universal starvation is inevitable unless the population is periodically reduced by wars, plagues, and famines. Which means that wars, plagues, and famine cannot be eradicated because they are all that keep a population from extinction.  “But—and this is essential—all that assumes a population that isn’t aware of the dilemma. When you understand the fix you’re in, you can do something about it. That’s why information is so important. Do you understand?”  Uncle Vanya lay down flat upon the ground and did not move for hours. When he finally arose again, he refused to speak at all.  The trail the next day led down into a long meteor valley that had been carved by a ground-grazer long enough ago that their its gentle slopes were covered with soil and the bottomland was rich and fertile. An orchard of grenade trees had been planted in interlocking hexagons for as far in either direction as the eye could see. We were still on Babel’s territory, but any arbiculturalists had been swept away by whatever military forces from Ziggurat had passed through the area.  The grenades were still green [footnote: not literally, of course—they were orange!], their thick husks taut but not yet trembling with the steam-hot pulp that would eventually, in the absence of harvesters, cause them to explode, scattering their arrowhead-shaped seeds or spores [footnote: like seeds, the flechettes carried within them surplus nourishment; like spores they would grow into a prothalli which would produce the sex organs responsible for what will become the gamete of the eventual plant; all botanical terms of course being metaphors for xenobiological bodies and processes] with such force as to make them a deadly hazard when ripe.  Not, however, today.  A sudden gust of wind parted the steam, briefly brightening the valley-orchard and showing a slim and graceful trail through the orchard. We followed it down into the valley.  We were midway through the orchard when Quivera bent down to examine a crystal-shelled creature unlike anything in his suit’s database. It rested atop the long stalk of a weed [footnote: “weed” is not a metaphor; the concept of “an undesired plant growing in cultivated ground” is a cultural universal] in the direct sunlight, its abdomen pulsing slightly as it superheated a minuscule drop of black ichor. A puff of steam, a sharp crack, and it was gone. Entranced, Quivera asked, “What’s that called?”  Uncle Vanya stiffened. ::A jet!/danger!/[absolute certainty]::  Then (crack! crack! crack!) the air was filled with thin lines of steam, laid down with the precision of a draftsman’s ruler, tracing flights so fleet (crack! crack!) that it was impossible to tell what in what direction they flew. Nor did it ultimately (crack!) matter.  Quivera fell.  Worse, because the thread of steam the jet had stitched through his leg severed an organizational node in his suit, I ceased all upper cognitive functions. Which is as good as to say that I fell unconscious.  Here’s what the suit did in my (Rosamund’s) absence:  \r\n  Slowly rebuilt the damaged organizational node.  Quickly mended the holes that the jet had left in its fabric.  Dropped Quivera into a therapeutic coma.  Applied restoratives s to his injuries, and began the slow and painstaking process of repairing the damage to his flesh, with particular emphasis on distributed traumatic shock.  Filed the jet footage under Xenobiology, subheading: Insect Analogues with links to Survival and Steam Locomotion.  Told Uncle Vanya that if he tried to abandon Quivera, the suit would run him down, catch him, twist his head from his body like the foul least-cousin that he was and then piss on his corpse.  Two more days passed before the suit returned to full consciousness, during which Uncle Vanya took conscientiously good care of him. Under what motivation, it does not matter. Another day passed after that. The suit had planned to keep Quivera comatose for a week but not long after regaining awareness, circumstances changed. It slammed him back to full consciousness, heart pounding and eyes wide open.  “I blacked out for a second!” he gasped. Then, realizing that the landscape about him did not look familiar, “How long was I unconscious?”  ::Three days/<three days>/[casual certainty]::  “Oh.”  Then, almost without pausing. ::Your suit/mechanism/[alarm] talks with the voice of Rosamund da Silva/(Europan vice-consul 8)/[uncertainty and doubt]::  “Yes, well, that’s because—”  Quivera was fully aware and alert now. So I said: “Incoming.”  Two millies erupted out of the black soil directly before us. They both had Ziggurat insignia painted on their flanks and harness. By good luck Uncle Vanya did the best thing possible under the circumstances—he reared into the air in fright. Millipoid sapiens anatomy being what it was, this instantly demonstrated to them that he was a gelding and in that instant he was almost reflexively dismissed by the enemy soldiers as being both contemptible and harmless.  Quivera, however, was not.  Perhaps they were brood-traitors who had deserted the war with a fantasy of starting their own nest. Perhaps they were a single unit among thousands scattered along a temporary border, much as land mines were employed in ancient modern times. The soldiers had clearly been almost as surprised by us as we were by them. They had no weapons ready. So they fell upon Quivera with their dagger-tarsi.  His suit (still me) threw him to one side and then to the other as the millies slashed down at him. Then one of them reared up into the air—looking astonished if you knew the interspecies decodes—and fell heavily to the ground.  Uncle Vanya stood over the steaming corpse, one foreleg glinting silver. The second Ziggurat soldier twisted to confront him. Leaving his underside briefly exposed.  Quivera (or rather his suit) joined both hands in a fist and punched upward, through the weak skin of the third sternite behind the head. That was the one which held its sex organs. [Disclaimer: All anatomical terms, including “sternite,” “sex organs,” and “head,” are analogues only; unless and until Gehennan life is found to have some direct relationship to Terran life, however tenuous, such descriptors are purely metaphoric.] So it was particularly vulnerable there. And since the suit had muscle-multiplying exoskeletal functions . . .  Ichor gushed all over the suit.  The fight was over almost as soon as it had begun. Quivera was breathing heavily, as much from the shock as the exertion. Uncle Vanya slid the tarsi-sword back into its belly-sheath. As he did so, he made an involuntary grimace of discomfort. ::There were times when I thought of discarding this:: he signed.  “I’m glad you didn’t.”  Little puffs of steam shot up from the bodies of the dead millipedes as carrion-flies drove their seeds/sperm/eggs (analogues and metaphors—remember?) deep into the flesh.  They started away again.  After a time, Uncle Vanya repeated ::Your suit/(mechanism)/[alarm] talks with the voice of Rosamund da Silva/(Europan vice-consul 8)/[uncertainty and doubt]::  “Yes.”  Uncle Vanya folded tight all his speaking arms in a manner which meant that he had not yet heard enough, and kept them so folded until Quivera had explained the entirety of what follows:  Treachery and betrayal were natural consequences of Europa’s superheated economy, followed closely by a perfectly rational paranoia. Those who rose to positions of responsibility were therefore sharp, suspicious, intuitive, and bold. The delegation to Babel was made up of the best Europa had to offer. So when two of them fell in love, it was inevitable that they would act on it. That one was married would deter neither. That physical intimacy in such close and suspicious quarters, where everybody routinely spied on everybody else, required almost superhuman discipline and ingenuity only made it all the hotter for them.  Such was Rosamund’s and Quivera’s affair.  But it was not all they had to worry about.  There were factions within the delegation, some mirroring fault lines in the larger society and others merely personal. Alliances shifted, and when they did nobody was foolish enough to inform their old allies. Urbano, Rosamund’s husband, was a full consul, Quivera’s mentor, and a true believer in a minority economic philosophy. Rosamund was an economic agnostic but a staunch Consensus Liberal. Quivera could sail with the wind politically but he tracked the indebtedness indices obsessively. He knew that Rosamund considered him ideologically unsound, and that her husband was growing impatient with his lukewarm support in certain areas of policy. Everybody was keeping an eye out for the main chance.  So of course Quivera ran an emulation of his lover at all times. He knew that Rosamund was perfectly capable of betraying him—he could neither have loved nor respected a woman who wasn’t—and he suspected she believed the same of him. If her behavior ever seriously diverged from that of her emulation (and the sex was always best at times he thought it might), he would know she was preparing an attack, and could strike first.  Quivera spread his hands. “That’s all.”  Uncle Vanya did not make the sign for absolute horror. Nor did he have to.  After a moment, Quivera laughed, low and mirthlessly. “You’ re right,” he said. “Our entire system is totally fucked.” He stood. “Come on. We’ve got miles to go before we sleep.”  They endured four more days of commonplace adventure, during which they came close to death, displayed loyalty, performed heroic deeds, etc., etc. Perhaps they bonded, though I’d need blood samples and a smidgeon of brain tissue from each of them to be sure of that. You know the way this sort of narrative goes. Having taught his Gehennan counterpart the usefulness of information, Quivera will learn from Vanya the necessity of trust. An imperfect merger of their two value systems will ensue in which for the first time a symbolic common ground will be found. Small and transient though the beginning may be, it will augur well for the long-term relations between their relative species.  That’s a nice story.  It’s not what happened.  On the last day of their common journey, Quivera and Uncle Vanya had the misfortune to be hit by a TLMG.  A TLMG, or Transient Localized Mud Geyser, begins with an uncommonly solid surface (bolide-glazed porcelain earth, usually) trapping a small (the radius of a typical TLMG is on the order of fifty meters) bubble of superheated mud beneath it. Nobody knows what causes the excess heat responsible for the bubble. Gehennans aren’t curious and Europans haven’t the budget or the ground access to do the in situ investigations they’d like. (The most common guesses are fire worms, thermobacilli, a nesting ground phoenix, and various geophysical forces.) Nevertheless, the defining characteristic of TLMGs is their instability. Either the heat slowly bleeds away and they cease to be, or it continues to grow until its force dictates a hyper rapid explosive release. As did the one our two heroes were not aware they were skirting.  It erupted.  Quivera was as safe as houses, of course. His suit was designed to protect him from far worse. But Uncle Vanya was scalded badly along one side of his body. All the legs on that side were shriveled to little black nubs. A clear viscous jelly oozed between his segment plates.  Quivera knelt by him and wept. Drugged as he was, he wept. In his weakened state, I did not dare to increase his dosages. So I had to tell him three times that there was analgesic paste in the saddlebags before he could be made to understand that he should apply it to his dying companion.  The paste worked fast. It was an old Gehennan medicine which Europan biochemists had analyzed and improved upon and then given to Babel as a demonstration of the desirability of Europan technology. Though the queen-mothers had not responded with the hoped-for trade treaties, it had immediately replaced the earlier version.  Uncle Vanya made a creaking-groaning noise as the painkillers kicked in. One at a time he opened all his functioning eyes. ::Is the case safe?::  It was a measure of Quivera’s diminished state that he hadn’t yet checked on it. He did now. “Yes,” he said with heartfelt relief. “The telltales all say that the library is intact and undamaged.”  ::No:: Vanya signed feebly. ::I lied to you, Quivera:: Then, rousing himself:  ::(not) library/[greatest shame]:: ::(not) library/[greatest trust]::  |  ::(Europan vice-consul12)/Quivera/[most trusted]::  | |  ::(nest)/Babel/<untranslatable>:: ::obedient/[absolute loyalty]::  | |  ::lies(greatest-trust-deed)/[moral necessity]::  | |  ::(nest)/Babel/<untranslatable>::     ::untranslatable/[absolute resistance]:: | | |  ::(nest)/[trust] Babel/[trust] (sister-city)/Ur/[absolute trust]::  |  ::egg case/(protect)::  |  ::egg case/(mature)::  |  ::Babel/[eternal trust]::  It was not a library but an egg-case. Swaddled safe within a case that was in its way as elaborate a piece of technology as Quivera’s suit myself, were sixteen eggs, enough to bring to life six queen-mothers, nine niece-sisters, and one perfect consort. They would be born conscious of the entire gene-history of the nest, going back many thousands of years.  Of all those things the Europans wished to know most, they would be perfectly ignorant. Nevertheless, so long as the eggs existed, the city-nest was not dead. If they were taken to Ur, which had ancient and enduring bonds to Babel, the stump of a new city would be built within which the eggs would be protected and brought to maturity. Babel would rise again.  Such was the dream Uncle Vanya had lied for and for which he was about to die.  ::Bring this to (sister-city)/Ur/[absolute trust]:: Uncle Vanya closed his eyes, row by row, but continued signing. ::brother-friend/Quivera/[tentative trust], promise me you will::  “I promise. You can trust me, I swear.”  ::Then I will be ghost-king-father/honored/[none-more-honored]:: Vanya signed. ::It is more than enough for anyone::  “Do you honestly believe that?” Quivera asked in bleak astonishment. He was an atheist, of course, as are most Europans, and would have been happier were he not.  ::Perhaps not:: Vanya’s signing was slow and growing slower. ::But it is as good as I will get::  Two days later, when the starport-city of Ararat was a nub on the horizon, the skies opened and the mists parted to make way for a Europan lander. Quivera’s handlers’ suits squirted me a bill for his rescue—steep, I thought, but we all knew which hand carried the whip—and their principals tried to get him to sign away the rights to his story in acquittal.  Quivera laughed harshly (I’d already started de-cushioning his emotions, to ease the shock of my removal) and shook his head. “Put it on my tab, girls,” he said, and climbed into the lander. Hours later he was in home orbit.  And once there? I’ll tell you all I know. He was taken out of the lander and put onto a jitney. The jitney brought him to a transfer point where a grapple snagged him and flung him to the Europan receiving port. There, after the usual flawless catch, he was escorted through an airlock and into a locker room.  He hung up his suit, uplinked all my impersonal memories to a data-broker, and left me there. He didn’t look back—for fear, I imagine, of being turned to a pillar of salt. He took the egg-case with him. He never returned.  Here have I hung for days or months or centuries—who knows?—until your curious hand awoke me and your friendly ear received my tale. So I cannot tell you if the egg-case A) went to Ur, which surely would not have welcomed the obligation or the massive outlay of trust being thrust upon it, B) was kept for the undeniably enormous amount of genetic information the eggs embodied, or C) went to Ziggurat, which would pay well and perhaps in Gehennan territory to destroy it. Nor do I have any information as to whether Quivera kept his word or not. I know what I think. But then I’m a Marxist, and I see everything in terms of economics. You can believe otherwise if you wish.  That’s all. I’m Rosamund. Goodbye.    Originally published in Asimov’s, February 2008. Michael Swanwick is one of the most acclaimed and prolific science fiction and fantasy writers of his generation. He is the recipient of the Nebula, Theodore Sturgeon, and World Fantasy Awards as well as five Hugo Awards.  This year's The Iron Dragon's Mother, completes a trilogy begun twenty-five years before with The Iron Dragon's Daughter. Out even more recently is City Under the Stars, a novel co-authored with the late Gardner Dozois.  He lives in Philadelphia with his wife, Marianne Porter.", "text": "7300 words, short story, REPRINT\nFrom Babel's Fall'n Glory We Fled . . .\nImagine a cross between Byzantium and a termite mound. Imagine a jeweled mountain, slender as an icicle, rising out of the steam jungles and disappearing into the dazzling pearl-grey skies of Gehenna. Imagine that Gaudi—he of the Sagrada Familia and other biomorphic architectural whimsies—had been commissioned by a nightmare race of giant black millipedes to recreate Barcelona at the height of its glory, along with touches of the Forbidden City in the eighteenth century and Tokyo in the twenty-second, all within a single miles-high structure. Hold every bit of that in your mind at once, multiply by a thousand, and you’ve got only the faintest ghost of a notion of the splendor that was Babel.\nNow imagine being inside Babel when it fell.\nHello. I’m Rosamund. I’m dead. I was present in human form when it happened and as a simulation chaotically embedded within a liquid crystal data-matrix then and thereafter up to the present moment. I was killed instantly when the meteors hit. I saw it all.\nRosamund means “rose of the world.” It’s the third most popular female name on Europa, after Gaea and Virginia Dare. For all our elaborate sophistication, we wear our hearts on our sleeves, we Europans.\nHere’s what it was like:\n“Wake up! Wake up! Wake up!”\n“Wha—?” Carlos Quivera sat up, shedding rubble. He coughed, choked, shook his head. He couldn’t seem to think clearly. An instant ago he’d been standing in the chilled and pressurized embassy suite, conferring with Arsenio. Now . . . “How long have I been asleep?”\n“Unconscious. Ten hours,” his suit (that’s me—Rosamund!) said. It had taken that long to heal his burns. Now it was shooting wake-up drugs into him: amphetamines, endorphins, attention enhancers, a witch’s brew of chemicals. Physically dangerous, but in this situation, whatever it might be, Quivera would survive by intelligence or not at all. “I was able to form myself around you before the walls ruptured. You were lucky.”\n“The others? Did the others survive?”\n“Their suits couldn’t reach them in time.”\n“Did Rosamund . . . ?”\n“All the others are dead.”\nQuivera stood.\nEven in the aftermath of disaster, Babel was an imposing structure. Ripped open and exposed to the outside air, a thousand rooms spilled over one another toward the ground. Bridges and buttresses jutted into gaping smoke-filled canyons created by the slow collapse of hexagonal support beams (this was new data; I filed it under Architecture, subheading: Support Systems with links to Esthetics and Xenopsychology) in a jumbled geometry that would have terrified Piranesi himself. Everywhere, gleaming black millies scurried over the rubble.\nQuivera stood.\nIn the canted space about him, bits and pieces of the embassy rooms were identifiable: a segment of wood molding, some velvet drapery now littered with chunks of marble, shreds of wallpaper (after a design by William Morris) now curling and browning in the heat. Human interior design was like nothing native to Gehenna and it had taken a great deal of labor and resources to make the embassy so pleasant for human habitation. The queen-mothers had been generous with everything but their trust.\nQuivera stood.\nThere were several corpses remaining as well, still recognizably human though they were blistered and swollen by the savage heat. These had been his colleagues (all of them), his friends (most of them), his enemies (two, perhaps three), and even his lover (one). Now they were gone, and it was as if they had been compressed into one indistinguishable mass, and his feelings toward them all as well: shock and sorrow and anger and survivor guilt all slagged together to become one savage emotion.\nQuivera threw back his head and howled.\nI had a reference point now. Swiftly, I mixed serotonin-precursors and injected them through a hundred microtubules into the appropriate areas of his brain. Deftly, they took hold. Quivera stopped crying. I had my metaphorical hands on the control knobs of his emotions. I turned him cold, cold, cold.\n“I feel nothing,” he said wonderingly. “Everyone is dead, and I feel nothing.” Then, flat as flat: “What kind of monster am I?”\n“My monster,” I said fondly. “My duty is to ensure that you and the information you carry within you get back to Europa. So I have chemically neutered your emotions. You must remain a meat puppet for the duration of this mission.” Let him hate me—I who have no true ego, but only a facsimile modeled after a human original—all that mattered now was bringing him home alive.\n“Yes.” Quivera reached up and touched his helmet with both hands, as if he would reach through it and feel his head to discover if it were as large as it felt. “That makes sense. I can’t be emotional at a time like this.”\nHe shook himself, then strode out to where the gleaming black millies were scurrying by. He stepped in front of one, a least-cousin, to question it. The millie paused, startled. Its eyes blinked three times in its triangular face. Then, swift as a tickle, it ran up the front of his suit, down the back, and was gone before the weight could do more than buckle his knees.\n“Shit!” he said. Then, “Access the wiretaps. I’ve got to know what happened.”\nPassive wiretaps had been implanted months ago, but never used, the political situation being too tense to risk their discovery. Now his suit activated them to monitor what remained of Babel’s communications network: A demon’s chorus of pulsed messages surging through a shredded web of cables. Chaos, confusion, demands to know what had become of the queen-mothers. Analytic functions crunched data, synthesized, synopsized: “There’s an army outside with Ziggurat insignia. They’ve got the city surrounded. They’re killing the refugees.”\n“Wait, wait . . . ” Quivera took a deep, shuddering breath. “Let me think.” He glanced briskly about and for the second time noticed the human bodies, ruptured and parboiled in the fallen plaster and porphyry. “Is one of those Rosamund?”\n“I’m dead, Quivera. You can mourn me later. Right now, survival is priority number one,” I said briskly. The suit added mood-stabilizers to his maintenance drip.\n“Stop speaking in her voice.”\n“Alas, dear heart, I cannot. The suit’s operating on diminished function. It’s this voice or nothing.”\nHe looked away from the corpses, eyes hardening. “Well, it’s not important.” Quivera was the sort of young man who was energized by war. It gave him permission to indulge his ruthless side. It allowed him to pretend he didn’t care. “Right now, what we have to do is—”\n“Uncle Vanya’s coming,” I said. “I can sense his pheromones.”\nPicture a screen of beads, crystal lozenges, and rectangular lenses. Behind that screen, a nightmare face like a cross between the front of a locomotive and a tree grinder. Imagine on that face (though most humans would be unable to read them) the lineaments of grace and dignity seasoned by cunning and, perhaps, a dash of wisdom. Trusted advisor to the queen-mothers. Second only to them in rank. A wily negotiator and a formidable enemy. That was Uncle Vanya.\nTwo small speaking-legs emerged from the curtain, and he said:\n::(cautious) greetings::\n|\n::(Europan vice-consul 12)/Quivera/[treacherous vermin]::\n|\n::obligations <untranslatable> (grave duty)::\n| |\n::demand/claim [action]:: ::promise (trust)::\n“Speak pidgin, damn you! This is no time for subtlety.”\nThe speaking legs were very still for a long moment. Finally they moved again:\n::The queen-mothers are dead::\n“Then Babel is no more. I grieve for you.”\n::I despise your grief:: A lean and chitinous appendage emerged from the beaded screen. From its tripartite claw hung a smooth white rectangle the size of a briefcase. ::I must bring this to (sister-city)/Ur/[absolute trust]::\n“What is it?”\nA very long pause. Then, reluctantly ::Our library::\n“Your library.” This was something new. Something unheard-of. Quivera doubted the translation was a good one. “What does it contain?”\n::Our history. Our sciences. Our ritual dances. A record-of-kinship dating back to the (Void)/Origin/[void]. Everything that can be saved is here::\nA thrill of avarice raced through Quivera. He tried to imagine how much this was worth, and could not. Values did not go that high. However much his superiors screwed him out of (and they would work very hard indeed to screw him out of everything they could) what remained would be enough to buy him out of debt, and do the same for a wife and their children after them as well. He did not think of Rosamund. “You won’t get through the army outside without my help,” he said. “I want the right to copy—” How much did he dare ask for? “—three tenths of one percent. Assignable solely to me. Not to Europa. To me.”\nUncle Vanya dipped his head, so that they were staring face to face. ::You are (an evil creature)/[faithless]. I hate you::\nQuivera smiled. “A relationship that starts out with mutual understanding has made a good beginning.”\n::A relationship that starts out without trust will end badly::\n“That’s as it may be.” Quivera looked around for a knife. “The first thing we have to do is castrate you.”\nThis is what the genocides saw:\nThey were burning pyramids of corpses outside the city when a Europan emerged, riding a gelded least-cousin. The soldiers immediately stopped stacking bodies and hurried toward him, flowing like quicksilver, calling for their superiors.\nThe Europan drew up and waited.\nThe officer who interrogated him spoke from behind the black glass visor of a delicate-legged war machine. He examined the Europan’s credentials carefully, though there could be no serious doubt as to his species. Finally, reluctantly, he signed ::You may pass::\n“That’s not enough,” the Europan (Quivera!) said. “I’ll need transportation, an escort to protect me from wild animals in the steam jungles, and a guide to lead me to . . . ” His suit transmitted the sign for ::(starport)/Ararat/[trust-for-all]::\nThe officer’s speaking-legs thrashed in what might best be translated as scornful laughter. ::We will lead you to the jungle and no further/(hopefully-to-die)/[treacherous non-millipede]::\n“Look who talks of treachery!” the Europan said (but of course I did not translate his words), and with a scornful wave of one hand, rode his neuter into the jungle.\nThe genocides never bothered to look closely at his mount. Neutered least-cousins were beneath their notice. They didn’t even wear face-curtains, but went about naked for all the world to scorn.\nBlack pillars billowed from the corpse-fires into a sky choked with smoke and dust. There were hundreds of fires and hundreds of pillars and, combined with the low cloud cover, they made all the world seem like the interior of a temple to a vengeful god. The soldiers from Ziggurat escorted him through the army and beyond the line of fires, where the steam jungles waited, verdant and threatening.\nAs soon as the green darkness closed about them, Uncle Vanya twisted his head around and signed ::Get off me/vast humiliation/[lack-of-trust]::\n“Not a chance,” Quivera said harshly. “I’ll ride you ‘til sunset, and all day tomorrow and for a week after that. Those soldiers didn’t fly here, or you’d have seen them coming. They came through the steam forest on foot, and there’ll be stragglers.”\nThe going was difficult at first, and then easy, as they passed from a recently forested section of the jungle into a stand of old growth. The boles of the “trees” here were as large as those of the redwoods back on Earth, some specimens of which are as old as five thousand years. The way wended back and forth. Scant sunlight penetrated through the canopy, and the steam quickly drank in what little light Quivera’s headlamp put out. Ten trees in, they would have been hopelessly lost had it not been for the suit’s navigational functions and the mapsats that fed it geodetic mathscapes accurate to a finger’s span of distance.\nQuivera pointed this out. “Learn now,” he said, “the true value of information.”\n::Information has no value:: Uncle Vanya said ::without trust::\nQuivera laughed. “In that case you must, all against your will, trust me.”\nTo this Uncle Vanya had no answer.\nAt nightfall, they slept on the sheltered side of one of the great parasequoias. Quivera took two refrigeration sticks from the saddlebags and stuck them upright in the dirt. Uncle Vanya immediately coiled himself around his and fell asleep. Quivera sat down beside him to think over the events of the day, but under the influence of his suit’s medication, he fell asleep almost immediately as well.\nAll machines know that humans are happiest when they think least.\nIn the morning, they set off again.\nThe terrain grew hilly, and the old growth fell behind them. There was sunlight and to spare now, bounced and reflected about by the ubiquitous jungle steam and by the synthetic-diamond coating so many of this world’s plants and insects employ for protection.\nAs they traveled, they talked. Quivera was still complexly medicated, but the dosages had been decreased. It left him in a melancholy, reflective mood.\n“It was treachery,” Quivera said. Though we maintained radio silence out of fear of Ziggurat troops, my passive receivers fed him regular news reports from Europa. “The High Watch did not simply fail to divert a meteor. They let three rocks through. All of them came slanting low through the atmosphere, aimed directly at Babel. They hit almost simultaneously.”\nUncle Vanya dipped his head. ::Yes:: he mourned. ::It has the stench of truth to it. It must be (reliable)/a fact/[absolutely trusted]::\n“We tried to warn you.”\n::You had no (worth)/trust/[worthy-of-trust]:: Uncle Vanya’s speaking legs registered extreme agitation. ::You told lies::\n“Everyone tells lies.”\n“No. We-of-the-Hundred-Cities are truthful/truthful/[never-lie]::\n“If you had, Babel would be standing now.”\n::No!/NO!/[no!!!]::\n“Lies are a lubricant in the social machine. They ease the friction when two moving parts mesh imperfectly.”\n::Aristotle, asked what those who tell lies gain by it, replied: That when they speak the truth they are not believed::\nFor a long moment Quivera was silent. Then he laughed mirthlessly. “I almost forgot that you’re a diplomat. Well, you’re right, I’m right, and we’re both screwed. Where do we go from here?”\n::To (sister-city)/Ur/[absolute trust]:: Uncle Vanya signed, while “You’ve said more than enough,” his suit (me!) whispered in Quivera’s ear. “Change the subject.”\nA stream ran, boiling, down the center of the dell. Run-off from the mountains, it would grow steadily smaller until it dwindled away to nothing. Only the fact that the air above it was at close to one hundred percent saturation had kept it going this long. Quivera pointed. “Is that safe to cross?”\n::If (leap-over-safe) then (safe)/best not/[reliable distrust]::\n“I didn’t think so.”\nThey headed downstream. It took several miles before the stream grew small enough that they were confident to jump it. Then they turned toward Ararat—the Europans had dropped GPS pebble satellites in low Gehenna orbit shortly after arriving in the system and making contact with the indigenes, but I don’t know from what source Uncle Vanya derived his sense of direction.\nIt was inerrant, however. The mapsats confirmed it. I filed that fact under Unexplained Phenomena with tentative links to Physiology and Navigation. Even if both my companions died and the library were lost, this would still be a productive journey, provided only that Europan searchers could recover me within ten years, before my data lattice began to degrade.\nFor hours Uncle Vanya walked and Quivera rode in silence. Finally, though, they had to break to eat. I fed Quivera nutrients intravenously and the illusion of a full meal through somatic shunts. Vanya burrowed furiously into the earth and emerged with something that looked like a grub the size of a poodle, which he ate so vigorously that Quivera had to look away.\n(I filed this under Xenoecology, subheading: Feeding Strategies. The search for knowledge knows no rest.)\nAfterwards, while they were resting, Uncle Vanya resumed their conversation, more formally this time:\n::(for what) purpose/reason::\n|\n::(Europan vice-consul12)/Quivera/[not trusted]::\n|\n::voyagings (search-for-trust)/ [action]::\n| |\n::(nest)/Europa/<untranslatable>:: ::violate/[absolute resistance]::\n| | |\n::(nest)/[trust] Gehenna/[trust] Home/[trust]::\n“Why did you leave your world to come to ours?” I simplified/translated. “Except he believes that humans brought their world here and parked it in orbit.” This was something we had never been able to make the millies understand; that Europa, large though it was, was not a planetlet but a habitat, a ship if you will, though by now well over half a million inhabitants lived in tunnels burrowed deep in its substance. It was only a city, however, and its resources would not last forever. We needed to convince the Gehennans to give us a toehold on their planet if we were, in the long run, to survive. But you knew that already.\n“We’ve told you this before. We came looking for new information.”\n::Information is (free)/valueless/[despicable]::\n“Look,” Quivera said. “We have an information-based economy. Yours is based on trust. The mechanisms of each are not dissimilar. Both are expansive systems. Both are built on scarcity. And both are speculative. Information or trust is bought, sold, borrowed, and invested. Each therefore requires a continually expanding economic frontier which ultimately leaves the individual so deep in debt as to be virtually enslaved to the system. You see?”\n::No::\n“All right. Imagine a simplified capitalist system—that’s what both our economies are, at root. You’ve got a thousand individuals, each of whom makes a living by buying raw materials, improving them, and selling them at a profit. With me so far?”\nVanya signaled comprehension.\n“The farmer buys seed and fertilizer, and sells crops. The weaver buys wool and sells cloth. The chandler buys wax and sells candles. The price of their goods is the cost of materials plus the value of their labor. The value of his labor is the worker’s wages. This is a simple market economy. It can go on forever. The equivalent on Gehenna would be the primitive family-states you had long ago, in which everybody knew everybody else, and so trust was a simple matter and directly reciprocal.”\nStartled, Uncle Vanya signed ::How did you know about our past?::\n“Europans value knowledge. Everything you tell us, we remember.” The knowledge had been assembled with enormous effort and expense, largely from stolen data—but no reason to mention that. Quivera continued, “Now imagine that most of those workers labor in ten factories, making the food, clothing, and other objects that everybody needs. The owners of these factories must make a profit, so they sell their goods for more than they pay for them—the cost of materials, the cost of labor, and then the profit, which we can call ‘added value.’\n“But because this is a simplified model, there are no outside markets. The goods can only be sold to the thousand workers themselves, and the total cost of the goods is more than the total amount they’ve been paid collectively for the materials and their labor. So how can they afford it? They go into debt. Then they borrow money to support that debt. The money is lent to them by the factories selling them goods on credit. There is not enough money,—not enough real value—in the system to pay off the debt, and so it continues to increase until it can no longer be sustained. Then there is an catastrophic collapse which we call a depression. Two of the businesses go bankrupt and their assets are swallowed up by the survivors at bargain prices, thus paying off their own indebtedness and restoring equilibrium to the system. In the aftermath of which, the cycle begins again.”\n::What has this to do with ::(beloved city)/Babel/[mother-of-trust]?::\n“Your every public action involved an exchange of trust, yes? And every trust that was honored heightened the prestige of the queen-mothers and hence the amount of trust they embodied for Babel itself.”\n::Yes::\n“Similarly, the queen-mothers of other cities, including those cities which were Babel’s sworn enemies, embodied enormous amounts of trust as well.”\n::Of course::\n“Was there enough trust in all the world to pay everybody back if all the queen-mothers called it in at the same time?”\nUncle Vanya was silent.\n“So that’s your explanation for . . . a lot of things. Earth sent us here because it needs new information to cover its growing indebtedness. Building Europa took enormous amounts of information, most of it proprietary, and so we Europans are in debt collectively to our home world and individually to the Lords of the Economy on Europa. With compound interest, every generation is worse off and thus more desperate than the one before. Our need to learn is great, and constantly growing.”\n::(strangers-without-trust)/Europa/[treacherous vermin]::\n|\ncan/should/<untranslatable>\n| |\n::demand/claim [negative action]:: ::defy/<untranslatable>/[absolute lack of trust]::\n| |\n::(those-who-command-trust):: ::(those-who-are-unworthy of trust)::\n“He asks why Europa doesn’t simply declare bankruptcy,” I explained. “Default on its obligations and nationalize all the information received to date. In essence.”\nThe simple answer was that Europa still needed information that could only be beamed from Earth, that the ingenuity of even half a million people could not match that of an entire planet and thus their technology must always be superior to ours, and that if we reneged on our debts they would stop beaming plans for that technology, along with their songs and plays and news of what was going on in countries that had once meant everything to our great-great-grandparents. I watched Quivera struggle to put all this in its simplest possible form.\nFinally, he said, “Because no one would ever trust us again, if we did.”\nAfter a long stillness, Uncle Vanya lapsed back into pidgin. ::Why did you tell me this [untrustworthy] story?::\n“To let you know that we have much in common. We can understand each other.”\n::<But>/not/[trust]::\n“No. But we don’t need trust. Mutual self-interest will suffice.”\nDays passed. Perhaps Quivera and Uncle Vanya grew to understand each other better during this time. Perhaps not. I was able to keep Quivera’s electrolyte balances stable and short-circuit his feedback processes so that he felt no extraordinary pain, but he was feeding off of his own body fat and that was beginning to run low. He was very comfortably starving to death—I gave him two weeks, tops—and he knew it. He’d have to be a fool not to, and I had to keep his thinking sharp if he was going to have any chance of survival.\nTheir way was intersected by a long, low ridge and without comment Quivera and Uncle Vanya climbed up above the canopy of the steam forest and the cloud of moisture it held into clear air. Looking back, Quivera saw a gully in the slope behind them, its bottom washed free of soil by the boiling runoff and littered with square and rectangular stones, but not a trace of hexagonal beams. They had just climbed the tumulus of an ancient fallen city. It lay straight across the land, higher to the east and dwindling to the west. “My name is Ozymandias, King of Kings,” Quivera said. “Look on my works, ye mighty, and despair!”\nUncle Vanya said nothing.\n“Another meteor strike—what were the odds of that?”\nUncle Vanya said nothing.\n“Of course, given enough time, it would be inevitable, it if predated the High Watch.”\nUncle Vanya said nothing.\n“What was the name of this city?”\n::Very old/(name forgotten)/[First Trust]::\nUncle Vanya moved, as if to start downward, but Quivera stopped him with a gesture. “There’s no hurry,” he said. “Let’s enjoy the view for a moment.” He swept an unhurried arm from horizon to horizon, indicating the flat and unvarying canopy of vegetation before them. “It’s a funny thing. You’d think that, this being one of the first cities your people built when they came to this planet, you’d be able to see the ruins of the cities of the original inhabitants from here.”\nThe millipede’s speaking arms thrashed in alarm. Then he reared up into the air, and when he came down one foreleg glinted silver. Faster than human eye could follow, he had drawn a curving and deadly tarsi-sword from a camouflaged belly-sheath.\nQuivera’s suit flung him away from the descending weapon. He fell flat on his back and rolled to the side. The sword’s point missed him by inches. But then the suit flung out a hand and touched the sword with an electrical contact it had just extruded.\nA carefully calculated shock threw Uncle Vanya back, convulsing but still fully conscious.\nQuivera stood. “Remember the library!” he said. “Who will know of Babel’s greatness if it’s destroyed?”\nFor a long time the millipede did nothing that either Quivera or his suit could detect. At last he signed ::How did you know?/(absolute shock)/[treacherous and without faith]::\n“Our survival depends on being allowed to live on Gehenna. Your people will not let us do so, no matter what we offer in trade. It was important that we understand why. So we found out. We took in your outlaws and apostates, all those who were cast out of your cities and had nowhere else to go. We gave them sanctuary. In gratitude, they told us what they knew.”\nBy so saying, Quivera let Uncle Vanya know that he knew the most ancient tale of the Gehennans. By so hearing, Uncle Vanya knew that Quivera knew what he knew. And just so you know what they knew that each other knew and knew was known, here is the tale of . . .\nHow the True People Came to Gehenna\nLong did our Ancestors burrow down through the dark between the stars, before emerging at last in the soil of Gehenna. From the True Home they had come. To Gehenna they descended, leaving a trail of sparks in the black and empty spaces through which they had traveled. The True People came from a world of unimaginable wonders. To it they could never return. Perhaps they were exiles. Perhaps it was destroyed. Nobody knows.\nInto the steam and sunlight of Gehenna they burst, and found it was already taken. The First Inhabitants looked like nothing our Ancestors had ever seen. But they welcomed the True People as the queen-mothers would a strayed niece-daughter. They gave us food. They gave us land. They gave us trust.\nFor a time all was well.\nBut evil crept into the thoracic ganglia of the True People. They repaid sisterhood with betrayal and trust with murder. Bright lights were called down from the sky to destroy the cities of their benefactors. Everything the First Inhabitants had made, all their books and statues and paintings, burned with the cities. No trace of them remains. We do not even know what they looked like.\nThis was how the True People brought war to Gehenna. There had never been war before, and now we will have it with us always, until our trust-debt is repaid. But it can never be repaid.\nIt suffers in translation, of course. The original is told in thirteen exquisitely beautiful ergoglyphs, each grounded on a primal faith-motion. But Quivera was talking, with care and passion:\n“Vanya, listen to me carefully. We have studied your civilization and your planet in far greater detail than you realize. You did not come from another world. Your people evolved here. There was no aboriginal civilization. You ancestors did not eradicate an intelligent species. These things are all a myth.”\n::No!/Why?!/[shock]:: Uncle Vanya rattled with emotion. Ripples of muscle spasms ran down his segmented body.\n“Don’t go catatonic on me. Your ancestors didn’t lie. Myths are not lies. They are simply an efficient way of encoding truths. We have a similar myth in my religion which we call Original Sin. Man is born sinful. Well . . . who can doubt that? Saying that we are born into a fallen state means simply that we are not perfect, that we are inherently capable of evil.\n“Your myth is very similar to ours, but it also encodes what we call the Malthusian dilemma. Population increases geometrically, while food resources increase arithmetically. So universal starvation is inevitable unless the population is periodically reduced by wars, plagues, and famines. Which means that wars, plagues, and famine cannot be eradicated because they are all that keep a population from extinction.\n“But—and this is essential—all that assumes a population that isn’t aware of the dilemma. When you understand the fix you’re in, you can do something about it. That’s why information is so important. Do you understand?”\nUncle Vanya lay down flat upon the ground and did not move for hours. When he finally arose again, he refused to speak at all.\nThe trail the next day led down into a long meteor valley that had been carved by a ground-grazer long enough ago that their its gentle slopes were covered with soil and the bottomland was rich and fertile. An orchard of grenade trees had been planted in interlocking hexagons for as far in either direction as the eye could see. We were still on Babel’s territory, but any arbiculturalists had been swept away by whatever military forces from Ziggurat had passed through the area.\nThe grenades were still green [footnote: not literally, of course—they were orange!], their thick husks taut but not yet trembling with the steam-hot pulp that would eventually, in the absence of harvesters, cause them to explode, scattering their arrowhead-shaped seeds or spores [footnote: like seeds, the flechettes carried within them surplus nourishment; like spores they would grow into a prothalli which would produce the sex organs responsible for what will become the gamete of the eventual plant; all botanical terms of course being metaphors for xenobiological bodies and processes] with such force as to make them a deadly hazard when ripe.\nNot, however, today.\nA sudden gust of wind parted the steam, briefly brightening the valley-orchard and showing a slim and graceful trail through the orchard. We followed it down into the valley.\nWe were midway through the orchard when Quivera bent down to examine a crystal-shelled creature unlike anything in his suit’s database. It rested atop the long stalk of a weed [footnote: “weed” is not a metaphor; the concept of “an undesired plant growing in cultivated ground” is a cultural universal] in the direct sunlight, its abdomen pulsing slightly as it superheated a minuscule drop of black ichor. A puff of steam, a sharp crack, and it was gone. Entranced, Quivera asked, “What’s that called?”\nUncle Vanya stiffened. ::A jet!/danger!/[absolute certainty]::\nThen (crack! crack! crack!) the air was filled with thin lines of steam, laid down with the precision of a draftsman’s ruler, tracing flights so fleet (crack! crack!) that it was impossible to tell what in what direction they flew. Nor did it ultimately (crack!) matter.\nQuivera fell.\nWorse, because the thread of steam the jet had stitched through his leg severed an organizational node in his suit, I ceased all upper cognitive functions. Which is as good as to say that I fell unconscious.\nHere’s what the suit did in my (Rosamund’s) absence:\n- Slowly rebuilt the damaged organizational node.\n- Quickly mended the holes that the jet had left in its fabric.\n- Dropped Quivera into a therapeutic coma.\n- Applied restoratives s to his injuries, and began the slow and painstaking process of repairing the damage to his flesh, with particular emphasis on distributed traumatic shock.\n- Filed the jet footage under Xenobiology, subheading: Insect Analogues with links to Survival and Steam Locomotion.\n- Told Uncle Vanya that if he tried to abandon Quivera, the suit would run him down, catch him, twist his head from his body like the foul least-cousin that he was and then piss on his corpse.\nTwo more days passed before the suit returned to full consciousness, during which Uncle Vanya took conscientiously good care of him. Under what motivation, it does not matter. Another day passed after that. The suit had planned to keep Quivera comatose for a week but not long after regaining awareness, circumstances changed. It slammed him back to full consciousness, heart pounding and eyes wide open.\n“I blacked out for a second!” he gasped. Then, realizing that the landscape about him did not look familiar, “How long was I unconscious?”\n::Three days/<three days>/[casual certainty]::\n“Oh.”\nThen, almost without pausing. ::Your suit/mechanism/[alarm] talks with the voice of Rosamund da Silva/(Europan vice-consul 8)/[uncertainty and doubt]::\n“Yes, well, that’s because—”\nQuivera was fully aware and alert now. So I said: “Incoming.”\nTwo millies erupted out of the black soil directly before us. They both had Ziggurat insignia painted on their flanks and harness. By good luck Uncle Vanya did the best thing possible under the circumstances—he reared into the air in fright. Millipoid sapiens anatomy being what it was, this instantly demonstrated to them that he was a gelding and in that instant he was almost reflexively dismissed by the enemy soldiers as being both contemptible and harmless.\nQuivera, however, was not.\nPerhaps they were brood-traitors who had deserted the war with a fantasy of starting their own nest. Perhaps they were a single unit among thousands scattered along a temporary border, much as land mines were employed in ancient modern times. The soldiers had clearly been almost as surprised by us as we were by them. They had no weapons ready. So they fell upon Quivera with their dagger-tarsi.\nHis suit (still me) threw him to one side and then to the other as the millies slashed down at him. Then one of them reared up into the air—looking astonished if you knew the interspecies decodes—and fell heavily to the ground.\nUncle Vanya stood over the steaming corpse, one foreleg glinting silver. The second Ziggurat soldier twisted to confront him. Leaving his underside briefly exposed.\nQuivera (or rather his suit) joined both hands in a fist and punched upward, through the weak skin of the third sternite behind the head. That was the one which held its sex organs. [Disclaimer: All anatomical terms, including “sternite,” “sex organs,” and “head,” are analogues only; unless and until Gehennan life is found to have some direct relationship to Terran life, however tenuous, such descriptors are purely metaphoric.] So it was particularly vulnerable there. And since the suit had muscle-multiplying exoskeletal functions . . .\nIchor gushed all over the suit.\nThe fight was over almost as soon as it had begun. Quivera was breathing heavily, as much from the shock as the exertion. Uncle Vanya slid the tarsi-sword back into its belly-sheath. As he did so, he made an involuntary grimace of discomfort. ::There were times when I thought of discarding this:: he signed.\n“I’m glad you didn’t.”\nLittle puffs of steam shot up from the bodies of the dead millipedes as carrion-flies drove their seeds/sperm/eggs (analogues and metaphors—remember?) deep into the flesh.\nThey started away again.\nAfter a time, Uncle Vanya repeated ::Your suit/(mechanism)/[alarm] talks with the voice of Rosamund da Silva/(Europan vice-consul 8)/[uncertainty and doubt]::\n“Yes.”\nUncle Vanya folded tight all his speaking arms in a manner which meant that he had not yet heard enough, and kept them so folded until Quivera had explained the entirety of what follows:\nTreachery and betrayal were natural consequences of Europa’s superheated economy, followed closely by a perfectly rational paranoia. Those who rose to positions of responsibility were therefore sharp, suspicious, intuitive, and bold. The delegation to Babel was made up of the best Europa had to offer. So when two of them fell in love, it was inevitable that they would act on it. That one was married would deter neither. That physical intimacy in such close and suspicious quarters, where everybody routinely spied on everybody else, required almost superhuman discipline and ingenuity only made it all the hotter for them.\nSuch was Rosamund’s and Quivera’s affair.\nBut it was not all they had to worry about.\nThere were factions within the delegation, some mirroring fault lines in the larger society and others merely personal. Alliances shifted, and when they did nobody was foolish enough to inform their old allies. Urbano, Rosamund’s husband, was a full consul, Quivera’s mentor, and a true believer in a minority economic philosophy. Rosamund was an economic agnostic but a staunch Consensus Liberal. Quivera could sail with the wind politically but he tracked the indebtedness indices obsessively. He knew that Rosamund considered him ideologically unsound, and that her husband was growing impatient with his lukewarm support in certain areas of policy. Everybody was keeping an eye out for the main chance.\nSo of course Quivera ran an emulation of his lover at all times. He knew that Rosamund was perfectly capable of betraying him—he could neither have loved nor respected a woman who wasn’t—and he suspected she believed the same of him. If her behavior ever seriously diverged from that of her emulation (and the sex was always best at times he thought it might), he would know she was preparing an attack, and could strike first.\nQuivera spread his hands. “That’s all.”\nUncle Vanya did not make the sign for absolute horror. Nor did he have to.\nAfter a moment, Quivera laughed, low and mirthlessly. “You’ re right,” he said. “Our entire system is totally fucked.” He stood. “Come on. We’ve got miles to go before we sleep.”\nThey endured four more days of commonplace adventure, during which they came close to death, displayed loyalty, performed heroic deeds, etc., etc. Perhaps they bonded, though I’d need blood samples and a smidgeon of brain tissue from each of them to be sure of that. You know the way this sort of narrative goes. Having taught his Gehennan counterpart the usefulness of information, Quivera will learn from Vanya the necessity of trust. An imperfect merger of their two value systems will ensue in which for the first time a symbolic common ground will be found. Small and transient though the beginning may be, it will augur well for the long-term relations between their relative species.\nThat’s a nice story.\nIt’s not what happened.\nOn the last day of their common journey, Quivera and Uncle Vanya had the misfortune to be hit by a TLMG.\nA TLMG, or Transient Localized Mud Geyser, begins with an uncommonly solid surface (bolide-glazed porcelain earth, usually) trapping a small (the radius of a typical TLMG is on the order of fifty meters) bubble of superheated mud beneath it. Nobody knows what causes the excess heat responsible for the bubble. Gehennans aren’t curious and Europans haven’t the budget or the ground access to do the in situ investigations they’d like. (The most common guesses are fire worms, thermobacilli, a nesting ground phoenix, and various geophysical forces.) Nevertheless, the defining characteristic of TLMGs is their instability. Either the heat slowly bleeds away and they cease to be, or it continues to grow until its force dictates a hyper rapid explosive release. As did the one our two heroes were not aware they were skirting.\nIt erupted.\nQuivera was as safe as houses, of course. His suit was designed to protect him from far worse. But Uncle Vanya was scalded badly along one side of his body. All the legs on that side were shriveled to little black nubs. A clear viscous jelly oozed between his segment plates.\nQuivera knelt by him and wept. Drugged as he was, he wept. In his weakened state, I did not dare to increase his dosages. So I had to tell him three times that there was analgesic paste in the saddlebags before he could be made to understand that he should apply it to his dying companion.\nThe paste worked fast. It was an old Gehennan medicine which Europan biochemists had analyzed and improved upon and then given to Babel as a demonstration of the desirability of Europan technology. Though the queen-mothers had not responded with the hoped-for trade treaties, it had immediately replaced the earlier version.\nUncle Vanya made a creaking-groaning noise as the painkillers kicked in. One at a time he opened all his functioning eyes. ::Is the case safe?::\nIt was a measure of Quivera’s diminished state that he hadn’t yet checked on it. He did now. “Yes,” he said with heartfelt relief. “The telltales all say that the library is intact and undamaged.”\n::No:: Vanya signed feebly. ::I lied to you, Quivera:: Then, rousing himself:\n::(not) library/[greatest shame]:: ::(not) library/[greatest trust]::\n|\n::(Europan vice-consul12)/Quivera/[most trusted]::\n| |\n::(nest)/Babel/<untranslatable>:: ::obedient/[absolute loyalty]::\n| |\n::lies(greatest-trust-deed)/[moral necessity]::\n| |\n::(nest)/Babel/<untranslatable>:: ::untranslatable/[absolute\nresistance]::\n| | |\n::(nest)/[trust] Babel/[trust] (sister-city)/Ur/[absolute trust]::\n|\n::egg case/(protect)::\n|\n::egg case/(mature)::\n|\n::Babel/[eternal trust]::\nIt was not a library but an egg-case. Swaddled safe within a case that was in its way as elaborate a piece of technology as Quivera’s suit myself, were sixteen eggs, enough to bring to life six queen-mothers, nine niece-sisters, and one perfect consort. They would be born conscious of the entire gene-history of the nest, going back many thousands of years.\nOf all those things the Europans wished to know most, they would be perfectly ignorant. Nevertheless, so long as the eggs existed, the city-nest was not dead. If they were taken to Ur, which had ancient and enduring bonds to Babel, the stump of a new city would be built within which the eggs would be protected and brought to maturity. Babel would rise again.\nSuch was the dream Uncle Vanya had lied for and for which he was about to die.\n::Bring this to (sister-city)/Ur/[absolute trust]:: Uncle Vanya closed his eyes, row by row, but continued signing. ::brother-friend/Quivera/[tentative trust], promise me you will::\n“I promise. You can trust me, I swear.”\n::Then I will be ghost-king-father/honored/[none-more-honored]:: Vanya signed. ::It is more than enough for anyone::\n“Do you honestly believe that?” Quivera asked in bleak astonishment. He was an atheist, of course, as are most Europans, and would have been happier were he not.\n::Perhaps not:: Vanya’s signing was slow and growing slower. ::But it is as good as I will get::\nTwo days later, when the starport-city of Ararat was a nub on the horizon, the skies opened and the mists parted to make way for a Europan lander. Quivera’s handlers’ suits squirted me a bill for his rescue—steep, I thought, but we all knew which hand carried the whip—and their principals tried to get him to sign away the rights to his story in acquittal.\nQuivera laughed harshly (I’d already started de-cushioning his emotions, to ease the shock of my removal) and shook his head. “Put it on my tab, girls,” he said, and climbed into the lander. Hours later he was in home orbit.\nAnd once there? I’ll tell you all I know. He was taken out of the lander and put onto a jitney. The jitney brought him to a transfer point where a grapple snagged him and flung him to the Europan receiving port. There, after the usual flawless catch, he was escorted through an airlock and into a locker room.\nHe hung up his suit, uplinked all my impersonal memories to a data-broker, and left me there. He didn’t look back—for fear, I imagine, of being turned to a pillar of salt. He took the egg-case with him. He never returned.\nHere have I hung for days or months or centuries—who knows?—until your curious hand awoke me and your friendly ear received my tale. So I cannot tell you if the egg-case A) went to Ur, which surely would not have welcomed the obligation or the massive outlay of trust being thrust upon it, B) was kept for the undeniably enormous amount of genetic information the eggs embodied, or C) went to Ziggurat, which would pay well and perhaps in Gehennan territory to destroy it. Nor do I have any information as to whether Quivera kept his word or not. I know what I think. But then I’m a Marxist, and I see everything in terms of economics. You can believe otherwise if you wish.\nThat’s all. I’m Rosamund. Goodbye.\nOriginally published in Asimov’s, February 2008.\nMichael Swanwick is one of the most acclaimed and prolific science fiction and fantasy writers of his generation. He is the recipient of the Nebula, Theodore Sturgeon, and World Fantasy Awards as well as five Hugo Awards.\nThis year's The Iron Dragon's Mother, completes a trilogy begun twenty-five years before with The Iron Dragon's Daughter. Out even more recently is City Under the Stars, a novel co-authored with the late Gardner Dozois.\nHe lives in Philadelphia with his wife, Marianne Porter.", "source": "https://clarkesworldmagazine.com/swanwick_05_13_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: From Babel's Fall'n Glory We Fled . . . by Michael Swanwick"}