{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "John A McDermott", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "5Buu7TYnaQY6lRAI/VKWKu/Qb1Q=", "id": null, "license": null, "comments": "", "raw_text": "3180 words, short story  Passwords  Every four months a security program sent Max an e-mail to his work account reminding him to change his password. The first reminder came two weeks before he had to make the shift or lose access to his incoming messages. The second reminder came ten days before the change was necessary. The third note—a little shorter, even curt—came with a week left before he was locked out. Max ignored them all. It had been seventeen days since the initial message—Dearest Max, A Gentle Missive to Stir You—and three since the last—Attention: You Will Be Denied Access—and still, Max could log on safely, read, respond, ignore, even delete, his mail. The deadline passed and nothing changed.  Max reluctantly read the latest contact this morning, the first in a line of four messages, the yellow envelope pulsing from his mailbox icon, the red flag flipped up. Change Now, is all it said. No, he muttered and shook his head (though no one was there to hear or see him. His cubicle had high beige walls and most of his co-workers had yet to arrive, coffee and umbrellas in hand). He’d deliberately resisted the password change. He was sick of new codes. He’d worked for Bender Incorporated for seven years. A new password every four months (that’s three a year, folks) and the total tally, so far: twenty. The one he refused would have made twenty-one. 21: the year of independence, the year of maturation, the password to full citizenship.  What were the twenty previous passwords? A sampling: his childhood street address; his mother’s nickname; his wife’s first dog; his wife’s last dog before marriage (an ancient lab who’d hated him, who’d crapped in his running shoes, but whom Max had beaten by default—cancer clocked him before Jenny had to make a choice); the last name of his little brother’s favorite hockey player; his father’s profession; the last name of the first girl he’d had sex with; the first name of the last girl he wanted to have sex with; his favorite brand of cookie. And the list continued.  Max was spent. Emotionally, creatively, typographically. Spent.  He didn’t really want his mail, anyway. It all amounted to client complaints, boss nagging, and Jenny asking him when he was going to be home, what did he want for dinner, was he sick of Chinese? Chinese. He’d never invented a password in Chinese. He didn’t know any Chinese. He didn’t know any Chinese people. He remembered the actor’s name from Kung Fu. Carradine. He’d have to mix it up. CareAd9. That might work.  That was stupid. It was the actor’s last name with a nasty cold.  He wished he could karate chop his monitor, a swift open hand right down the center. The glass would blow out, the gray casing would crack, open like a shotgun wound, the wires and boards tumble out like so many high-tech intestines.  The second note this morning was from a supplier in Asia. Things will be delayed. A dockworker’s strike somewhere. (He only skimmed the note—Malaysia, Singapore, Hong Kong? He didn’t remember.) He was already debating how to break the news to his boss that the goods—a load of children’s raincoats dotted with the latest cartoon craze—wouldn’t arrive by the end of the week. It hadn’t stopped raining in eleven days and for each of the eleven days his boss had asked, “Where are the Pickle coats, Max? Where are the Pickle coats? There are wet kids out there. Wet kids with concerned parents who are ready to give us money, Max. Where are the coats?” The cartoon was a talking Pickle. Max had seen the show regularly; it was a favorite of his niece’s. Charity loved the talking Pickle. Pete? Paul? Pat? Pablo? He couldn’t remember the pickle’s name. It was alliterative, he knew that.  But the Pickle coats wouldn’t be here in time to serve the needs of the wet children of the northwestern United States.  “A strike,” he imagined saying to his boss. “Beyond our control. A strike. Who’d a guessed?”  The third note was from his wife. She was ovulating. They were trying to conceive. They were failing. Had failed for eighteen months now. Every month a strike out. The moment she said she felt PMS coming on, Max felt like a fool. Worthless. He’d never had problems with his masculine identity before. Now he felt . . . hollow. Not castrated or emasculated. Just empty.  Her time was right. He needed to come home for lunch.  “No,” he said again. It was a forty minute commute. He had an hour for lunch. The math didn’t add up. Why didn’t Jenny know that? Desperation was clouding her brain. Every time they visited his sister and saw Charity, now a bubbly three-year-old, Jenny would come home and cry for an hour. Max couldn’t console her. He didn’t know the right words. Everything he said made her shoulders lurch and shudder and her breath catch again. It used to be he could joke Jenny into a smile. He couldn’t anymore.  Max heard the elevator ding and footsteps in the hall behind him. Lydia called hello and he said hello back without turning around. Lydia was a systems analyst, almost always the other early morning arrival, unless one of the many dachshunds she raised decided to get sick or run away or commit some other doggy delinquency. Then she’d roll in with a dachshund story. Most days she called hello and went right to her cubicle.  Max read the fourth message. Change Now, it said. Or Else.  “Screw you,” Max said and tapped the delete key with a forceful finger.  The message disappeared.  Over the course of the morning, as Max silently composed a speech for his boss—“A dockworker’s strike is like lightning, sir. Now one can tell where it’ll hit. No one saw it coming,” he’d say, though the supplier in Asia had been hinting at the possibility for weeks. Or: “It’s going to be over in a jiffy, boss. The union’ll cave. No doubt about it,” though he’d read no such thing. Max’s knowledge of Asian dockworkers’ unions was sketchy, at best. He knew they worked on docks. He knew they were Asian. He tried to imagine an Asian Terry Malloy, an Asian Rod Steiger.  His own experience with docks was limited to a girl he dated in high school whose father owned a sailboat and where she had led him one Friday night, to her father’s boat moored in a private slip, and where they’d made out, drinking her father’s booze and getting mildly queasy from the swaying and the alcohol and his frustrated teen-age lust. He hadn’t used her name as a password yet (Bridget) or the name of the boat. He remembered it clearly, Well Past Time. Well past time for what, he wondered now, but not then. Well past time for a ship? For a trip? Well past time to let that memory go, Max considered. He’d brought a rubber with him that night, though he hadn’t used it. He didn’t know he was shooting blanks then. Think of all the money he could have saved over the years on contraception. Perhaps thousands of dollars and countless embarrassing trips to drugstores and supermarkets. He didn’t really know if he was shooting blanks. Jenny suggested a trip to a fertility specialist, but he balked at the expected images: a lobby of strangers, a nurse handing him a cup, a cramped bathroom, a pile of well-thumbed porno mags. It wasn’t appealing, but Jenny wanted to pinpoint their problem.  “We can’t fix,” she said, “what we don’t know, Max.”  It was well past time they figured it out, he imagined her saying. Well past time.  At eleven-thirty his wife sent another note. “I’m waiting,” she wrote. “Let’s get busy.”  He was already busy. His boss had phoned, said he was stopping by his son’s elementary school to see a play. It would only take an hour, his son had a few lines—“He’s a tree,” his boss had said. “A freakin’ tree. But my wife told me she’d skin me alive if I didn’t make the effort. I’m making the effort. See, Max, I’m making the effort. You’re goddamn lucky you don’t have kids, Max. Don’t ever do it, Max. I love my son, but kids throw wrenches into everything. It’s raining fucking wrenches. It is rainy, Max.” Max heard a pause on the other end of the line. “Where are the Pickle coats?”  Max was fortunate the cell phone reception deteriorated just then.  “I’ll be in by noon, Max,” his boss said through chunky static. “Noon.”  At eleven-forty his e-mail message center throbbed again.  “Jenny,” he cursed. “I can’t.”  But the note wasn’t from her.  Your password has expired, he read.  “Big whup,” he said.  He deleted it.  His mailbox throbbed.  CHANGE, the next note said. All caps were rude. He deleted that one, too.  Lydia asked if he wanted anything from the deli downstairs. She always asked. Most days he declined. He wasn’t hungry at all. Lydia scolded him for not eating properly.  “Not today,” Max said. “Don’t get on me today. I’m getting enough as it is.”  Lydia’s mouth curved down. She wasn’t one to show her emotions, but he could tell she was hurt. She turned on her short heels and he listened as she punched the down button with more force than usual. He expected her to say, “Fine,” under her breath, the way Jenny would if he’d pissed her off, but Lydia was silent. He could have dealt with a sharp “Fine.” Silence was worse. But why should he eat when he wasn’t hungry, when he was nearly nauseous because a throng of poorly-paid Taiwanese wanted a raise and better hours? Would a bagel and cream cheese cure any of his problems?  He didn’t budge. The elevator came and went and took Lydia’s sulking with it.  The red flag on his mailbox icon waved like Old Glory on the Fourth of July. He could actually see it whip in the electronic wind. Flap, flap, flap. He remembered the sound of empty halyards on the sailboats in the harbor, the high clang of metal on metal. Walking down the steps of the Well Past Time—to the bar, to the bed, he imagined, to paradise, he listened to them clang. The dinging punctuated the whole evening. He opened the new note with the songs of vacant masts still in his mind.  Your old house on Mulberry Avenue—Mulberry1226, to us—burned to the ground last night, the message said. The police are saying the cause was suspicious but may have been faulty wiring. What do you think, Max? You loved that house. Especially the laundry chute in your sister’s room. You dropped all sorts of things down that chute. Tennis balls, GI Joes, a fountain pen. That made a mess. You’ll miss that house.  Max shook his head and read the note again. The elevator doors whined behind him. Others were going to lunch. He heard chatter. Debate about the merits of tacos versus subs.  We told you to change.  His e-mail throbbed again. The red flag waved.  Remember LeRoy2Gone? Your wife didn’t want to put that dog down. She cried in the parking lot of the humane society for twenty minutes before she led Leroy to his death. She’s never quite forgiven you, Max. Do you think she should?  Max swiveled in his rolling chair. He looked at the ceiling. He glanced to each wall of his cubicle. This was a prank. A bad prank. And the dog was dying. He hadn’t given the dog cancer. (He hadn’t been particularly sympathetic either. He knew. He regretted.) There had to be cameras. He was the victim of a practical joke. He was on some television show.  Nothing was noticeably different. The same photos of Jenny were tacked to the cubicle’s stiff fabric sides. His Sierra Club calendar. A crayon drawing of Charity’s—a two-story house with a green lawn and red flowers up the walk. Smoke wafting from the chimney. Clearly, Charity didn’t have a handle on seasons yet. Summer outside, winter inside. You can’t have smoke and flowers.  He deleted the messages and wiped sweat from his forehead, though the building was always set to a comfortable seventy-two degrees. It never fluctuated.  The elevator chimed and he spun in his chair.  “Max. My office in five,” his boss said, the tall man’s stride taking him swiftly past Max’s cubicle and to the glass walls of his private room.  “Yes, sir,” Max said.  His boss paused at his open door. “Two lines, Max,” he said, holding up his right hand and flashing a V. From anyone else it would have meant peace or victory. “Two lines. Welcome to our forest and We grow with rain and light. That’s it.” He shut the door and moments later Max watched the blinds flip closed. They swayed a bit and were still.  It was always a bad sign when the boss went for privacy.  Max’s mailbox was full again.  “It’s almost noon and if you can read this, it means you’re still at work. I suppose we can wait until you get home this evening, Max, but my temperature is just right and I feel it, Max, I feel it. Now is the time. I’m looking out the window as I type this. I hope I see your car pull up the drive. I’m watching. I’m waiting, Max. Your Jenny.”  Max didn’t delete that one. He didn’t file it in the folder marked Jenny. He didn’t know what to do with it.  Another message appeared. Unless you change your password this instant, you will never have the ability to access your incoming mail box ever again. Not ever. We promise. This is not a vague threat, buster. Without your mail, you’re screwed. See if you can get the Pickle coats now. Without us, without the power we give you, you’re royally screwed.  There was a postscript. Wise up, bub. Passwords protect.  Max smacked his armrest and sent the casters on his chair rolling. He slipped off the edge of the cushioned seat. His knee hit the edge of his plastic-and-pressboard desk and he let out a squelched yowl. He clapped his hand over his mouth—realizing that no one really claps a hand over his own mouth, not ever, except in movies, old movies, and here he was, moaning, and swearing behind his own hot palm. He was a parody, but he wasn’t even sure of what. He was an unintelligible parody. Man with hurt knee. Man with irritable boss. Man with insistent, pleading wife. Man with a million Asian dockworkers holding up his order, his order alone among all others, letting everything else go free—cheap suits and furniture and golf balls and satchels—but not his Pickle coats.  “Wretched,” he said as if it were a common curse. “Wretched.” He kicked his chair and it rolled backward to the hallway and came to rest against the elevator door.  It opened and there stood Lydia, her red mouth an O of surprise, her eyes wide behind black-framed glasses. She held a bottle of orange juice in one hand by her side. The other arm she extended. She held out a thick bagel in a thin white paper napkin.  “Max,” she said. “I thought you needed something.”  He looked at her and nodded. He walked to her and took the bagel. Bits of sesame seed flicked off the crust and onto the pale blue carpet.  “Yes,” he said. “I do.” He took a bite and walked to his boss’s office. He chewed and then turned back, his hand on the door’s handle. Lydia was leaning out of the elevator, her head floating above his chair, her chin turned in his direction.  “Thank you,” he said, probably too loud.  “No problem,” she responded.  Max opened the door and stepped inside the dim room. His boss was behind his broad walnut desk, the shiny top littered with brass: a globe paperweight, a clock, a slim and sharp letter opener. “Tell me about the coats, Max.”  And Max did. He explained the strike. He described the delay—perhaps a day, perhaps a week, perhaps a month, how was Max to know? He hadn’t a crystal ball. Max explained and chewed his dry lunch and let sesame seeds rain on the boss’s better carpet, better than the one in the hall. A richer Berber, a better blue. His boss listened, his eyebrows poised high on his head, a pair of steep arches over his dark eyes.  “So we’ve missed this opportunity, Max,” his boss said.  “I’m afraid so, sir,” Max said, popping the last of the bagel into his mouth. “This time.”  “There won’t be a next time,” his boss said and Max understood, perhaps. The rain would end and the children would dry out and the Pickle coats would remain unsold, gathering dust in silent warehouses and on the rickety tables of discount clothing stores. Another cartoon character would hold sway over the offspring of America. That ship had sailed and Max and his boss and Bender Incorporated hadn’t made a dime. Or maybe it meant Max just lost his job. His next time was done. Max didn’t stay to find out. His boss waved his hand and Max left the dark room and closed the door behind him. The blinds swayed again.  He marched to his cubicle—someone had returned his chair, most likely Lydia—but he didn’t sit down. He bent over the gently humming machine and typed a reply.  My new password is Neveragain.  He tapped his foot and waited for an answer.  Your password must contain a mix of letters, digits, and/or symbols.  Neveragain1.  Thank you. He expected more, an insult, a threat. But no. This is what he got: That’s all we ever wanted, Max. An effort.  His finger hovered, waited, and hit delete.  His mailbox pulsed. Ah, he thought. Here it comes.  Yet this is what he read: “Dear Max. Come home. Forget why. Just . . . I miss you. That’s why. Your Jenny.”  Max stood straight and brushed bits of bagel off his shirt. He slid the mouse around and turned off his computer. He didn’t need any more mail.  Max was going home to make a baby. He didn’t know if it would work, but he’d try his best. He and Jenny would try, dead dogs and burned houses behind them. He didn’t know the magic words. He didn’t know the right prayer or oath or password. He only knew the question: how do you get it right? What sort of code did he need to use to get it right just this once? That was the password he needed. He didn’t know if it was love or please or now or it’s well past time, but he felt it all and would try to say it, in the right combination, whatever would work to unlock that door and let him and Jenny in: love and please and now and it was well past time. John A. McDermott has been a bad bartender, a worse house painter, a fairly good copywriter, and a better actor. Now he teaches creative writing and American literature at Stephen F. Austin State University in Nacogdoches, Texas. A proud native of Madison, Wisconsin, he’s not much of a Texan, but his students understand. His stories have appeared in a variety of journals, including Alaska Quarterly Review, Cimarron Review, Meridian, Southeast Review, and Zahir.", "text": "3180 words, short story\nPasswords\nEvery four months a security program sent Max an e-mail to his work account reminding him to change his password. The first reminder came two weeks before he had to make the shift or lose access to his incoming messages. The second reminder came ten days before the change was necessary. The third note—a little shorter, even curt—came with a week left before he was locked out. Max ignored them all. It had been seventeen days since the initial message—Dearest Max, A Gentle Missive to Stir You—and three since the last—Attention: You Will Be Denied Access—and still, Max could log on safely, read, respond, ignore, even delete, his mail. The deadline passed and nothing changed.\nMax reluctantly read the latest contact this morning, the first in a line of four messages, the yellow envelope pulsing from his mailbox icon, the red flag flipped up. Change Now, is all it said. No, he muttered and shook his head (though no one was there to hear or see him. His cubicle had high beige walls and most of his co-workers had yet to arrive, coffee and umbrellas in hand). He’d deliberately resisted the password change. He was sick of new codes. He’d worked for Bender Incorporated for seven years. A new password every four months (that’s three a year, folks) and the total tally, so far: twenty. The one he refused would have made twenty-one. 21: the year of independence, the year of maturation, the password to full citizenship.\nWhat were the twenty previous passwords? A sampling: his childhood street address; his mother’s nickname; his wife’s first dog; his wife’s last dog before marriage (an ancient lab who’d hated him, who’d crapped in his running shoes, but whom Max had beaten by default—cancer clocked him before Jenny had to make a choice); the last name of his little brother’s favorite hockey player; his father’s profession; the last name of the first girl he’d had sex with; the first name of the last girl he wanted to have sex with; his favorite brand of cookie. And the list continued.\nMax was spent. Emotionally, creatively, typographically. Spent.\nHe didn’t really want his mail, anyway. It all amounted to client complaints, boss nagging, and Jenny asking him when he was going to be home, what did he want for dinner, was he sick of Chinese? Chinese. He’d never invented a password in Chinese. He didn’t know any Chinese. He didn’t know any Chinese people. He remembered the actor’s name from Kung Fu. Carradine. He’d have to mix it up. CareAd9. That might work.\nThat was stupid. It was the actor’s last name with a nasty cold.\nHe wished he could karate chop his monitor, a swift open hand right down the center. The glass would blow out, the gray casing would crack, open like a shotgun wound, the wires and boards tumble out like so many high-tech intestines.\nThe second note this morning was from a supplier in Asia. Things will be delayed. A dockworker’s strike somewhere. (He only skimmed the note—Malaysia, Singapore, Hong Kong? He didn’t remember.) He was already debating how to break the news to his boss that the goods—a load of children’s raincoats dotted with the latest cartoon craze—wouldn’t arrive by the end of the week. It hadn’t stopped raining in eleven days and for each of the eleven days his boss had asked, “Where are the Pickle coats, Max? Where are the Pickle coats? There are wet kids out there. Wet kids with concerned parents who are ready to give us money, Max. Where are the coats?” The cartoon was a talking Pickle. Max had seen the show regularly; it was a favorite of his niece’s. Charity loved the talking Pickle. Pete? Paul? Pat? Pablo? He couldn’t remember the pickle’s name. It was alliterative, he knew that.\nBut the Pickle coats wouldn’t be here in time to serve the needs of the wet children of the northwestern United States.\n“A strike,” he imagined saying to his boss. “Beyond our control. A strike. Who’d a guessed?”\nThe third note was from his wife. She was ovulating. They were trying to conceive. They were failing. Had failed for eighteen months now. Every month a strike out. The moment she said she felt PMS coming on, Max felt like a fool. Worthless. He’d never had problems with his masculine identity before. Now he felt . . . hollow. Not castrated or emasculated. Just empty.\nHer time was right. He needed to come home for lunch.\n“No,” he said again. It was a forty minute commute. He had an hour for lunch. The math didn’t add up. Why didn’t Jenny know that? Desperation was clouding her brain. Every time they visited his sister and saw Charity, now a bubbly three-year-old, Jenny would come home and cry for an hour. Max couldn’t console her. He didn’t know the right words. Everything he said made her shoulders lurch and shudder and her breath catch again. It used to be he could joke Jenny into a smile. He couldn’t anymore.\nMax heard the elevator ding and footsteps in the hall behind him. Lydia called hello and he said hello back without turning around. Lydia was a systems analyst, almost always the other early morning arrival, unless one of the many dachshunds she raised decided to get sick or run away or commit some other doggy delinquency. Then she’d roll in with a dachshund story. Most days she called hello and went right to her cubicle.\nMax read the fourth message. Change Now, it said. Or Else.\n“Screw you,” Max said and tapped the delete key with a forceful finger.\nThe message disappeared.\nOver the course of the morning, as Max silently composed a speech for his boss—“A dockworker’s strike is like lightning, sir. Now one can tell where it’ll hit. No one saw it coming,” he’d say, though the supplier in Asia had been hinting at the possibility for weeks. Or: “It’s going to be over in a jiffy, boss. The union’ll cave. No doubt about it,” though he’d read no such thing. Max’s knowledge of Asian dockworkers’ unions was sketchy, at best. He knew they worked on docks. He knew they were Asian. He tried to imagine an Asian Terry Malloy, an Asian Rod Steiger.\nHis own experience with docks was limited to a girl he dated in high school whose father owned a sailboat and where she had led him one Friday night, to her father’s boat moored in a private slip, and where they’d made out, drinking her father’s booze and getting mildly queasy from the swaying and the alcohol and his frustrated teen-age lust. He hadn’t used her name as a password yet (Bridget) or the name of the boat. He remembered it clearly, Well Past Time. Well past time for what, he wondered now, but not then. Well past time for a ship? For a trip? Well past time to let that memory go, Max considered. He’d brought a rubber with him that night, though he hadn’t used it. He didn’t know he was shooting blanks then. Think of all the money he could have saved over the years on contraception. Perhaps thousands of dollars and countless embarrassing trips to drugstores and supermarkets. He didn’t really know if he was shooting blanks. Jenny suggested a trip to a fertility specialist, but he balked at the expected images: a lobby of strangers, a nurse handing him a cup, a cramped bathroom, a pile of well-thumbed porno mags. It wasn’t appealing, but Jenny wanted to pinpoint their problem.\n“We can’t fix,” she said, “what we don’t know, Max.”\nIt was well past time they figured it out, he imagined her saying. Well past time.\nAt eleven-thirty his wife sent another note. “I’m waiting,” she wrote. “Let’s get busy.”\nHe was already busy. His boss had phoned, said he was stopping by his son’s elementary school to see a play. It would only take an hour, his son had a few lines—“He’s a tree,” his boss had said. “A freakin’ tree. But my wife told me she’d skin me alive if I didn’t make the effort. I’m making the effort. See, Max, I’m making the effort. You’re goddamn lucky you don’t have kids, Max. Don’t ever do it, Max. I love my son, but kids throw wrenches into everything. It’s raining fucking wrenches. It is rainy, Max.” Max heard a pause on the other end of the line. “Where are the Pickle coats?”\nMax was fortunate the cell phone reception deteriorated just then.\n“I’ll be in by noon, Max,” his boss said through chunky static. “Noon.”\nAt eleven-forty his e-mail message center throbbed again.\n“Jenny,” he cursed. “I can’t.”\nBut the note wasn’t from her.\nYour password has expired, he read.\n“Big whup,” he said.\nHe deleted it.\nHis mailbox throbbed.\nCHANGE, the next note said. All caps were rude. He deleted that one, too.\nLydia asked if he wanted anything from the deli downstairs. She always asked. Most days he declined. He wasn’t hungry at all. Lydia scolded him for not eating properly.\n“Not today,” Max said. “Don’t get on me today. I’m getting enough as it is.”\nLydia’s mouth curved down. She wasn’t one to show her emotions, but he could tell she was hurt. She turned on her short heels and he listened as she punched the down button with more force than usual. He expected her to say, “Fine,” under her breath, the way Jenny would if he’d pissed her off, but Lydia was silent. He could have dealt with a sharp “Fine.” Silence was worse. But why should he eat when he wasn’t hungry, when he was nearly nauseous because a throng of poorly-paid Taiwanese wanted a raise and better hours? Would a bagel and cream cheese cure any of his problems?\nHe didn’t budge. The elevator came and went and took Lydia’s sulking with it.\nThe red flag on his mailbox icon waved like Old Glory on the Fourth of July. He could actually see it whip in the electronic wind. Flap, flap, flap. He remembered the sound of empty halyards on the sailboats in the harbor, the high clang of metal on metal. Walking down the steps of the Well Past Time—to the bar, to the bed, he imagined, to paradise, he listened to them clang. The dinging punctuated the whole evening. He opened the new note with the songs of vacant masts still in his mind.\nYour old house on Mulberry Avenue—Mulberry1226, to us—burned to the ground last night, the message said. The police are saying the cause was suspicious but may have been faulty wiring. What do you think, Max? You loved that house. Especially the laundry chute in your sister’s room. You dropped all sorts of things down that chute. Tennis balls, GI Joes, a fountain pen. That made a mess. You’ll miss that house.\nMax shook his head and read the note again. The elevator doors whined behind him. Others were going to lunch. He heard chatter. Debate about the merits of tacos versus subs.\nWe told you to change.\nHis e-mail throbbed again. The red flag waved.\nRemember LeRoy2Gone? Your wife didn’t want to put that dog down. She cried in the parking lot of the humane society for twenty minutes before she led Leroy to his death. She’s never quite forgiven you, Max. Do you think she should?\nMax swiveled in his rolling chair. He looked at the ceiling. He glanced to each wall of his cubicle. This was a prank. A bad prank. And the dog was dying. He hadn’t given the dog cancer. (He hadn’t been particularly sympathetic either. He knew. He regretted.) There had to be cameras. He was the victim of a practical joke. He was on some television show.\nNothing was noticeably different. The same photos of Jenny were tacked to the cubicle’s stiff fabric sides. His Sierra Club calendar. A crayon drawing of Charity’s—a two-story house with a green lawn and red flowers up the walk. Smoke wafting from the chimney. Clearly, Charity didn’t have a handle on seasons yet. Summer outside, winter inside. You can’t have smoke and flowers.\nHe deleted the messages and wiped sweat from his forehead, though the building was always set to a comfortable seventy-two degrees. It never fluctuated.\nThe elevator chimed and he spun in his chair.\n“Max. My office in five,” his boss said, the tall man’s stride taking him swiftly past Max’s cubicle and to the glass walls of his private room.\n“Yes, sir,” Max said.\nHis boss paused at his open door. “Two lines, Max,” he said, holding up his right hand and flashing a V. From anyone else it would have meant peace or victory. “Two lines. Welcome to our forest and We grow with rain and light. That’s it.” He shut the door and moments later Max watched the blinds flip closed. They swayed a bit and were still.\nIt was always a bad sign when the boss went for privacy.\nMax’s mailbox was full again.\n“It’s almost noon and if you can read this, it means you’re still at work. I suppose we can wait until you get home this evening, Max, but my temperature is just right and I feel it, Max, I feel it. Now is the time. I’m looking out the window as I type this. I hope I see your car pull up the drive. I’m watching. I’m waiting, Max. Your Jenny.”\nMax didn’t delete that one. He didn’t file it in the folder marked Jenny. He didn’t know what to do with it.\nAnother message appeared. Unless you change your password this instant, you will never have the ability to access your incoming mail box ever again. Not ever. We promise. This is not a vague threat, buster. Without your mail, you’re screwed. See if you can get the Pickle coats now. Without us, without the power we give you, you’re royally screwed.\nThere was a postscript. Wise up, bub. Passwords protect.\nMax smacked his armrest and sent the casters on his chair rolling. He slipped off the edge of the cushioned seat. His knee hit the edge of his plastic-and-pressboard desk and he let out a squelched yowl. He clapped his hand over his mouth—realizing that no one really claps a hand over his own mouth, not ever, except in movies, old movies, and here he was, moaning, and swearing behind his own hot palm. He was a parody, but he wasn’t even sure of what. He was an unintelligible parody. Man with hurt knee. Man with irritable boss. Man with insistent, pleading wife. Man with a million Asian dockworkers holding up his order, his order alone among all others, letting everything else go free—cheap suits and furniture and golf balls and satchels—but not his Pickle coats.\n“Wretched,” he said as if it were a common curse. “Wretched.” He kicked his chair and it rolled backward to the hallway and came to rest against the elevator door.\nIt opened and there stood Lydia, her red mouth an O of surprise, her eyes wide behind black-framed glasses. She held a bottle of orange juice in one hand by her side. The other arm she extended. She held out a thick bagel in a thin white paper napkin.\n“Max,” she said. “I thought you needed something.”\nHe looked at her and nodded. He walked to her and took the bagel. Bits of sesame seed flicked off the crust and onto the pale blue carpet.\n“Yes,” he said. “I do.” He took a bite and walked to his boss’s office. He chewed and then turned back, his hand on the door’s handle. Lydia was leaning out of the elevator, her head floating above his chair, her chin turned in his direction.\n“Thank you,” he said, probably too loud.\n“No problem,” she responded.\nMax opened the door and stepped inside the dim room. His boss was behind his broad walnut desk, the shiny top littered with brass: a globe paperweight, a clock, a slim and sharp letter opener. “Tell me about the coats, Max.”\nAnd Max did. He explained the strike. He described the delay—perhaps a day, perhaps a week, perhaps a month, how was Max to know? He hadn’t a crystal ball. Max explained and chewed his dry lunch and let sesame seeds rain on the boss’s better carpet, better than the one in the hall. A richer Berber, a better blue. His boss listened, his eyebrows poised high on his head, a pair of steep arches over his dark eyes.\n“So we’ve missed this opportunity, Max,” his boss said.\n“I’m afraid so, sir,” Max said, popping the last of the bagel into his mouth. “This time.”\n“There won’t be a next time,” his boss said and Max understood, perhaps. The rain would end and the children would dry out and the Pickle coats would remain unsold, gathering dust in silent warehouses and on the rickety tables of discount clothing stores. Another cartoon character would hold sway over the offspring of America. That ship had sailed and Max and his boss and Bender Incorporated hadn’t made a dime. Or maybe it meant Max just lost his job. His next time was done. Max didn’t stay to find out. His boss waved his hand and Max left the dark room and closed the door behind him. The blinds swayed again.\nHe marched to his cubicle—someone had returned his chair, most likely Lydia—but he didn’t sit down. He bent over the gently humming machine and typed a reply.\nMy new password is Neveragain.\nHe tapped his foot and waited for an answer.\nYour password must contain a mix of letters, digits, and/or symbols.\nNeveragain1.\nThank you. He expected more, an insult, a threat. But no. This is what he got: That’s all we ever wanted, Max. An effort.\nHis finger hovered, waited, and hit delete.\nHis mailbox pulsed. Ah, he thought. Here it comes.\nYet this is what he read: “Dear Max. Come home. Forget why. Just . . . I miss you. That’s why. Your Jenny.”\nMax stood straight and brushed bits of bagel off his shirt. He slid the mouse around and turned off his computer. He didn’t need any more mail.\nMax was going home to make a baby. He didn’t know if it would work, but he’d try his best. He and Jenny would try, dead dogs and burned houses behind them. He didn’t know the magic words. He didn’t know the right prayer or oath or password. He only knew the question: how do you get it right? What sort of code did he need to use to get it right just this once? That was the password he needed. He didn’t know if it was love or please or now or it’s well past time, but he felt it all and would try to say it, in the right combination, whatever would work to unlock that door and let him and Jenny in: love and please and now and it was well past time.\nJohn A. McDermott has been a bad bartender, a worse house painter, a fairly good copywriter, and a better actor. Now he teaches creative writing and American literature at Stephen F. Austin State University in Nacogdoches, Texas. A proud native of Madison, Wisconsin, he’s not much of a Texan, but his students understand. His stories have appeared in a variety of journals, including Alaska Quarterly Review, Cimarron Review, Meridian, Southeast Review, and Zahir.", "source": "https://clarkesworldmagazine.com/mcdermott_10_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Passwords by John A. McDermott"}