{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "QLp8ox0PwauymslzX6Q3ozmxUvg=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Living Through the Solstice  Last month, I had the opportunity to attend the Nebula Conference run by the Science Fiction and Fantasy Writers of America (SFWA). The conference was in Los Angeles this year, so after an early morning cross-country flight and a long drive through the never-ending LA traffic, I arrived at the hotel and settled in. Over the next few days, I was scheduled for two panels, several meetings, and to receive the Kate Wilhelm Solstice Award. On my personal checklist, as I mentioned last month, was to meet William Gibson, which I managed to do without making a fool of myself.  I’d like to talk a bit about that Solstice Award. The Kate Wilhelm Solstice Award is given by SFWA for “distinguished contributions to the science fiction and fantasy community.” The winners—Nisi Shawl was the other winner this year—are informed in advance. In my case, it started several months ago with an email from SFWA President Cat Rambo, that said something along the lines of “What’s your phone number? I promise it’s not bad news.” It was odd, but reassuring, since I tend to assume the worst when something can’t be said in an email.  Later that evening, Cat called me and told me the good news. I was both happy to be receiving the award, but also having a bit of a “me? really?” moment. After the call was over, I made the big mistake of looking at the list of previous recipients of the award: people like Alice Sheldon (James Tiptree, Jr.), Octavia E. Butler, Carl Sagan, and Sir Terry Pratchett. My “really?” moment turned into full-blown impostor syndrome and despite the multiple people congratulating and telling me how deserved this award was over the months to come, I struggled with it.  I wrote several versions of my acceptance speech, but until the morning of the Nebula Ceremony, I hadn’t managed to find words that weren’t mired by the struggle. Something clicked that morning. It didn’t matter that I was the second-youngest or least-experienced to receive the honor—yes, of course I checked, impostor syndrome can be incredibly self-destructive. It didn’t even matter if I didn’t feel worthy or not, Cat did, SFWA did, and so many other people in that room did as well. I am so overwhelmed that they feel that way. If, in their eyes, my thirteen years in publishing have made a “distinguished contribution,” then wow, thank you. I’m not oblivious to some of the things we’ve done, but I certainly lack the perspective they have from the outside.  My notes for the speech were a scribbled mess, but I tried to go into a bit of my struggle with the concept of receiving this honor and accepting that it was ultimately their opinion that mattered more. I had a list of names to thank, because this has not been a solo journey. I started with Sean, because we’ve been on this road together from the beginning. If it wasn’t for that late night Readercon conversation that started Clarkesworld and put me on this path, I’m not sure where I’d be right now. He’s become a brother to me in that time. If Sean is my brother, then Kate is my sister. She’s coming up on ten years with us and yet it feels like she’s always been there. And yes, my actual family—Lisa, Aidan, and Eamonn—were mentioned too. I believe I commented that launching a magazine at age forty must have seemed like a weird mid-life crisis, but my family has been supportive from day one.  At the ceremony, I was introduced by Regina Kanyu Wang, who has clearly gotten to know me well since we started working together on the Storycom-funded Chinese SF translations. Her introduction was perfect, personal, and amusing. She had teased me about my ability to travel to China for two weeks with nothing more than carry-on bags, so I started by setting the record straight. I did do that, but after a lifetime of flying out of Newark Airport, I had learned to pack really well and to never check luggage. From there, I was much more relaxed, which was perfect.  Since international—and particularly translated fiction—was one of the areas being cited for this honor, I commented that I thought it was so weird to have to say that international science fiction was important. As a community we write or read about characters on other worlds, but so seldom had we read what was written on the other side of our own world. I thanked Storycom, our translators, authors, artists, and everyone else that has helped with our efforts to address this. I have to say that seeing more and more of these works appearing across the market lately is one of the things that makes me happiest about our field in recent years. That it was part of this award was uplifting, not just for me. It sends a message to authors around the world that these efforts are valued by our community. That’s a big deal. Bigger than most probably realize.  If I have one regret from the speech, it was not to be a bit more specific in thanking SFWA, and particularly Cat Rambo for their belief in me. I feel like I adequately conveyed that in the moment and probably muddied it with my description of my own insecurity about receiving the award. Have they won me over? I’m probably more accepting than I was a month ago, but it remains very surreal to me. I still see the mountain of work ahead of us, but this moment has given me a chance to pause, see through the eyes of others, and realize the role we’ve played in changing the landscape for short fiction since 2006.  Of course, I must thank you as well. Like I’ve been trying to say, this is a team effort, but that team includes readers like you. Subscribing to the magazine, sharing the stories, and words of encouragement have meant a lot over the years. My name is on this award, but it couldn’t have happened without the entire team from readers to authors to editors. Thank you for your part, no matter how small you might think it is.  That said, I’m keeping the award myself. It’s very pretty and makes me happy to look over at as I type this.  Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Living Through the Solstice\nLast month, I had the opportunity to attend the Nebula Conference run by the Science Fiction and Fantasy Writers of America (SFWA). The conference was in Los Angeles this year, so after an early morning cross-country flight and a long drive through the never-ending LA traffic, I arrived at the hotel and settled in. Over the next few days, I was scheduled for two panels, several meetings, and to receive the Kate Wilhelm Solstice Award. On my personal checklist, as I mentioned last month, was to meet William Gibson, which I managed to do without making a fool of myself.\nI’d like to talk a bit about that Solstice Award. The Kate Wilhelm Solstice Award is given by SFWA for “distinguished contributions to the science fiction and fantasy community.” The winners—Nisi Shawl was the other winner this year—are informed in advance. In my case, it started several months ago with an email from SFWA President Cat Rambo, that said something along the lines of “What’s your phone number? I promise it’s not bad news.” It was odd, but reassuring, since I tend to assume the worst when something can’t be said in an email.\nLater that evening, Cat called me and told me the good news. I was both happy to be receiving the award, but also having a bit of a “me? really?” moment. After the call was over, I made the big mistake of looking at the list of previous recipients of the award: people like Alice Sheldon (James Tiptree, Jr.), Octavia E. Butler, Carl Sagan, and Sir Terry Pratchett. My “really?” moment turned into full-blown impostor syndrome and despite the multiple people congratulating and telling me how deserved this award was over the months to come, I struggled with it.\nI wrote several versions of my acceptance speech, but until the morning of the Nebula Ceremony, I hadn’t managed to find words that weren’t mired by the struggle. Something clicked that morning. It didn’t matter that I was the second-youngest or least-experienced to receive the honor—yes, of course I checked, impostor syndrome can be incredibly self-destructive. It didn’t even matter if I didn’t feel worthy or not, Cat did, SFWA did, and so many other people in that room did as well. I am so overwhelmed that they feel that way. If, in their eyes, my thirteen years in publishing have made a “distinguished contribution,” then wow, thank you. I’m not oblivious to some of the things we’ve done, but I certainly lack the perspective they have from the outside.\nMy notes for the speech were a scribbled mess, but I tried to go into a bit of my struggle with the concept of receiving this honor and accepting that it was ultimately their opinion that mattered more. I had a list of names to thank, because this has not been a solo journey. I started with Sean, because we’ve been on this road together from the beginning. If it wasn’t for that late night Readercon conversation that started Clarkesworld and put me on this path, I’m not sure where I’d be right now. He’s become a brother to me in that time. If Sean is my brother, then Kate is my sister. She’s coming up on ten years with us and yet it feels like she’s always been there. And yes, my actual family—Lisa, Aidan, and Eamonn—were mentioned too. I believe I commented that launching a magazine at age forty must have seemed like a weird mid-life crisis, but my family has been supportive from day one.\nAt the ceremony, I was introduced by Regina Kanyu Wang, who has clearly gotten to know me well since we started working together on the Storycom-funded Chinese SF translations. Her introduction was perfect, personal, and amusing. She had teased me about my ability to travel to China for two weeks with nothing more than carry-on bags, so I started by setting the record straight. I did do that, but after a lifetime of flying out of Newark Airport, I had learned to pack really well and to never check luggage. From there, I was much more relaxed, which was perfect.\nSince international—and particularly translated fiction—was one of the areas being cited for this honor, I commented that I thought it was so weird to have to say that international science fiction was important. As a community we write or read about characters on other worlds, but so seldom had we read what was written on the other side of our own world. I thanked Storycom, our translators, authors, artists, and everyone else that has helped with our efforts to address this. I have to say that seeing more and more of these works appearing across the market lately is one of the things that makes me happiest about our field in recent years. That it was part of this award was uplifting, not just for me. It sends a message to authors around the world that these efforts are valued by our community. That’s a big deal. Bigger than most probably realize.\nIf I have one regret from the speech, it was not to be a bit more specific in thanking SFWA, and particularly Cat Rambo for their belief in me. I feel like I adequately conveyed that in the moment and probably muddied it with my description of my own insecurity about receiving the award. Have they won me over? I’m probably more accepting than I was a month ago, but it remains very surreal to me. I still see the mountain of work ahead of us, but this moment has given me a chance to pause, see through the eyes of others, and realize the role we’ve played in changing the landscape for short fiction since 2006.\nOf course, I must thank you as well. Like I’ve been trying to say, this is a team effort, but that team includes readers like you. Subscribing to the magazine, sharing the stories, and words of encouragement have meant a lot over the years. My name is on this award, but it couldn’t have happened without the entire team from readers to authors to editors. Thank you for your part, no matter how small you might think it is.\nThat said, I’m keeping the award myself. It’s very pretty and makes me happy to look over at as I type this.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_06_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Living Through the Solstice by Neil Clarke"}