{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kij Johnson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "SUhfUbiz0yjK+YzEtch7d2HG+JY=", "id": null, "license": null, "comments": "", "raw_text": "960 words, short story  Mantis Wives  2013 Hugo Award Nominee for Best Short Story 2013 Locus Award Finalist for Best Short Story  “As for the insects, their lives are sustained only by intricate processes of fantastic horror.” —John Wyndham.  Eventually, the mantis women discovered that killing their husbands was not inseparable from the getting of young. Before this, a wife devoured her lover piece by piece during the act of coition: the head (and its shining eyes going dim as she ate); the long green prothorax; the forelegs crisp as straws; the bitter wings. She left for last the metathorax and its pumping legs, the abdomen, and finally the phallus. Mantis women needed nutrients for their pregnancies; their lovers offered this as well as their seed.  It was believed that mantis men would resist their deaths if permitted to choose the manner of their mating; but the women learned to turn elsewhere for nutrients after draining their husbands’ members, and yet the men lingered. And so their ladies continued to kill them, but slowly, in the fashioning of difficult arts. What else could there be between them?  The Bitter Edge: A wife may cut through her husband’s exoskeletal plates, each layer a different pattern, so that to look at a man is to see shining, hard brocade. At the deepest level are visible pieces of his core, the hint of internal parts bleeding out. He may suggest shapes.  The Eccentric Curve of His Thoughts: A wife may drill the tiniest hole into her lover’s head and insert a fine hair. She presses carefully, striving for specific results: a seizure, a novel pheromone burst, a dance that ends in self-castration. If she replaces the hair with a wasp’s narrow syringing stinger, she may blow air bubbles into his head and then he will react unpredictably. There is otherwise little he may do that will surprise her, or himself.  What is the art of the men, that they remain to die at the hands of their wives? What is the art of the wives, that they kill?  The Strength of Weight: Removing his wings, she leads him into the paths of ants.  Unready Jewels: A mantis wife may walk with her husband across the trunks of pines, until they come to a trail of sap and ascend to an insect-clustered wound. Staying to the side, she presses him down until his legs stick fast. He may grow restless as the sap sheathes his body and wings. His eyes may not dim for some time. Smaller insects may cluster upon his honeyed body like ornaments.  A mantis woman does not know why the men crave death, but she does not ask. Does she fear resistance? Does she hope for it? She has forgotten the ancient reasons for her acts, but in any case her art is more important.  The Oubliette: Or a wife may take not his life but his senses: plucking the antennae from his forehead; scouring with dust his clustered shining eyes; cracking apart his mandibles to scrape out the lining of his mouth and throat; plucking the sensing hairs from his foremost legs; excising the auditory thoracic organ; biting free the wings.  A mantis woman is not cruel. She gives her husband what he seeks. Who knows what poems he fashions in the darkness of a senseless life?  The Scent of Violets: They mate many times, until one dies.  Two Stones Grind Together: A wife collects with her forelegs small brightly colored poisonous insects, places them upon bitter green leaves, and encourages her husband to eat them. He is sometimes reluctant after the first taste but she speaks to him, or else he calms himself and eats.  He may foam at the mouth and anus, or grow paralyzed and fall from a branch. In extreme cases, he may stagger along the ground until he is seen by a bird and swallowed, and then even the bird may die.  A mantis has no veins; what passes for blood flows freely within its protective shell. It does have a heart.  The Desolate Junk-land: Or a mantis wife may lay her husband gently upon a soft bed and bring to him cool drinks and silver dishes filled with sweetmeats. She may offer him crossword puzzles and pornography; may kneel at his feet and tell him stories of mantis men who are heroes; may dance in veils before him.  He tears off his own legs before she begins. It is unclear whether The Desolate Junk-land is her art, or his.  Shame’s Uniformity: A wife may return to the First Art and, in a variant, devour her husband, but from the abdomen forward. Of all the arts this is hardest. There is no hair, no ant’s bite, no sap, no intervening instrument. He asks her questions until the end. He may doubt her motives, or she may.  The Paper-folder. Lichens’ Dance. The Ambition of Aphids. Civil Wars. The Secret History of Cumulus. The Lost Eyes Found. Sedges. The Unbeaked Sparrow.  There are as many arts as there are husbands and wives.  The Cruel Web: Perhaps they wish to love each other, but they cannot see a way to exist that does not involve the barb, the sticking sap, the bitter taste of poison. The Cruel Web can be performed only in the brambles of woods, and only when there has been no recent rain and the spider’s webs have grown thick. Wife and husband walk together. Webs catch and cling to their carapaces, their legs, their half-opened wings. They tear free, but the webs collect. Their glowing eyes grow veiled. Their curious antennae come to a tangled halt. Their pheromones become confused; their legs struggle against the gathering web. The spiders wait.  She is larger than he and stronger, but they often fall together.  How to Live: A mantis may dream of something else. This also may be a trap.  Kij Johnson is the author of several novels, including The Fox Woman and Fudoki, and a short story collection, At the Mouth of the River of Bees. She is a three-time winner of the Nebula Award, and has also won the Hugo, World Fantasy, Sturgeon, and Crawford Awards. In the past she has worked in publishing, edited cryptic crosswords, waitressed in a strip bar, identified Napa cabernets by winery and year while blindfolded, and climbed an occasional V-5. These days, she teaches at the University of Kansas, where she is associate director for the Center for the Study of Science Fiction.", "text": "960 words, short story\nMantis Wives\n2013 Hugo Award Nominee for Best Short Story\n2013 Locus Award Finalist for Best Short Story\n“As for the insects, their lives are sustained only by intricate processes of fantastic horror.” —John Wyndham.\nEventually, the mantis women discovered that killing their husbands was not inseparable from the getting of young. Before this, a wife devoured her lover piece by piece during the act of coition: the head (and its shining eyes going dim as she ate); the long green prothorax; the forelegs crisp as straws; the bitter wings. She left for last the metathorax and its pumping legs, the abdomen, and finally the phallus. Mantis women needed nutrients for their pregnancies; their lovers offered this as well as their seed.\nIt was believed that mantis men would resist their deaths if permitted to choose the manner of their mating; but the women learned to turn elsewhere for nutrients after draining their husbands’ members, and yet the men lingered. And so their ladies continued to kill them, but slowly, in the fashioning of difficult arts. What else could there be between them?\nThe Bitter Edge: A wife may cut through her husband’s exoskeletal plates, each layer a different pattern, so that to look at a man is to see shining, hard brocade. At the deepest level are visible pieces of his core, the hint of internal parts bleeding out. He may suggest shapes.\nThe Eccentric Curve of His Thoughts: A wife may drill the tiniest hole into her lover’s head and insert a fine hair. She presses carefully, striving for specific results: a seizure, a novel pheromone burst, a dance that ends in self-castration. If she replaces the hair with a wasp’s narrow syringing stinger, she may blow air bubbles into his head and then he will react unpredictably. There is otherwise little he may do that will surprise her, or himself.\nWhat is the art of the men, that they remain to die at the hands of their wives? What is the art of the wives, that they kill?\nThe Strength of Weight: Removing his wings, she leads him into the paths of ants.\nUnready Jewels: A mantis wife may walk with her husband across the trunks of pines, until they come to a trail of sap and ascend to an insect-clustered wound. Staying to the side, she presses him down until his legs stick fast. He may grow restless as the sap sheathes his body and wings. His eyes may not dim for some time. Smaller insects may cluster upon his honeyed body like ornaments.\nA mantis woman does not know why the men crave death, but she does not ask. Does she fear resistance? Does she hope for it? She has forgotten the ancient reasons for her acts, but in any case her art is more important.\nThe Oubliette: Or a wife may take not his life but his senses: plucking the antennae from his forehead; scouring with dust his clustered shining eyes; cracking apart his mandibles to scrape out the lining of his mouth and throat; plucking the sensing hairs from his foremost legs; excising the auditory thoracic organ; biting free the wings.\nA mantis woman is not cruel. She gives her husband what he seeks. Who knows what poems he fashions in the darkness of a senseless life?\nThe Scent of Violets: They mate many times, until one dies.\nTwo Stones Grind Together: A wife collects with her forelegs small brightly colored poisonous insects, places them upon bitter green leaves, and encourages her husband to eat them. He is sometimes reluctant after the first taste but she speaks to him, or else he calms himself and eats.\nHe may foam at the mouth and anus, or grow paralyzed and fall from a branch. In extreme cases, he may stagger along the ground until he is seen by a bird and swallowed, and then even the bird may die.\nA mantis has no veins; what passes for blood flows freely within its protective shell. It does have a heart.\nThe Desolate Junk-land: Or a mantis wife may lay her husband gently upon a soft bed and bring to him cool drinks and silver dishes filled with sweetmeats. She may offer him crossword puzzles and pornography; may kneel at his feet and tell him stories of mantis men who are heroes; may dance in veils before him.\nHe tears off his own legs before she begins. It is unclear whether The Desolate Junk-land is her art, or his.\nShame’s Uniformity: A wife may return to the First Art and, in a variant, devour her husband, but from the abdomen forward. Of all the arts this is hardest. There is no hair, no ant’s bite, no sap, no intervening instrument. He asks her questions until the end. He may doubt her motives, or she may.\nThe Paper-folder. Lichens’ Dance. The Ambition of Aphids. Civil Wars. The Secret History of Cumulus. The Lost Eyes Found. Sedges. The Unbeaked Sparrow.\nThere are as many arts as there are husbands and wives.\nThe Cruel Web: Perhaps they wish to love each other, but they cannot see a way to exist that does not involve the barb, the sticking sap, the bitter taste of poison. The Cruel Web can be performed only in the brambles of woods, and only when there has been no recent rain and the spider’s webs have grown thick. Wife and husband walk together. Webs catch and cling to their carapaces, their legs, their half-opened wings. They tear free, but the webs collect. Their glowing eyes grow veiled. Their curious antennae come to a tangled halt. Their pheromones become confused; their legs struggle against the gathering web. The spiders wait.\nShe is larger than he and stronger, but they often fall together.\nHow to Live: A mantis may dream of something else. This also may be a trap.\nKij Johnson is the author of several novels, including The Fox Woman and Fudoki, and a short story collection, At the Mouth of the River of Bees. She is a three-time winner of the Nebula Award, and has also won the Hugo, World Fantasy, Sturgeon, and Crawford Awards. In the past she has worked in publishing, edited cryptic crosswords, waitressed in a strip bar, identified Napa cabernets by winery and year while blindfolded, and climbed an occasional V-5. These days, she teaches at the University of Kansas, where she is associate director for the Center for the Study of Science Fiction.", "source": "https://clarkesworldmagazine.com/johnson_08_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mantis Wives by Kij Johnson"}