{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Zhang Ran; Ken Liu; Carmen Yiling Yan", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "EKd31lOccK/GdUTnjldXh+1zUdM=", "id": null, "license": null, "comments": "", "raw_text": "21340 words, novella  The Snow of Jinyang   Translators’ Note  This story is an alternate history and features events that would have been familiar to its original Chinese audience. To help set the scene for those less familiar with this period of history, we provide the following background information: Jinyang was an ancient city located in modern-day Shanxi Province, China. This story takes place in the 10th century CE, during the late Five Dynasties and Ten Kingdoms period, when the land we think of as China today was divided among multiple independent states. Jinyang was the capital of a state that called itself Han—or “Great Han,” though modern histories usually call it the “Northern Han.” (The name of the state should not be confused with the original Han Dynasty, which fell in the 2nd century, or the Han ethnic group. The ruling family of the Northern Han was ethnically Shatuo, but had the same surname, Liu, as the rulers of the Han Dynasty. It was common for a regime to claim descent and take the name of a prior dynasty to add legitimacy.)  Historically, the Northern Han survived for years while losing large swaths of territory to other states until it was just the single city of Jinyang. In 979 CE, the Song Emperor Zhao Guangyi finally captured Jinyang after a long siege, thereby completing the task of unifying China. Zhao then razed Jinyang to the ground to prevent future rebellions. Today, the city of Taiyuan stands near its ruins.  This story starts out in 979 CE with Jinyang under siege by the Song army . . .  1.  When Zhao Da stormed into Xuanren Ward with his men, Zhu Dagun was in his room on the internet. Had he any experience dueling wits with the government, he’d surely have realized that something was wrong in time to put on a better show.  It was three quarters of the way into the hour of the sheep, after lunch but well before dinner, naturally a fine time for business in the brothels of Xuanren Ward. Powder and perfume steamed in the sun; gaudy kerchiefs dazzled the eyes of passersby. Snatches of music drifted through two sets of walls from Pingkang Ward, on the opposite side of West Street, where the licensed courtesans of the Imperial Academy entertained blue bloods and VIPs. But the sisters of Xuanren Ward held their neighboring colleagues in contempt. They thought all that training as unnecessary as pulling down your pants to fart—the end result, after all, was still the same creak-creak-creak of a bed frame. Drink and gamble to liven things up, certainly, but why bother with the singing and plinking and bowing and piping? Days in the Xuanren Ward never lacked for the din of price-haggling, bet-placing, and bed frames creak-creaking. The hubbub had become so much a part of the place that when residents happened to spend the night elsewhere in Jinyang, they found those quieter neighborhoods utterly lacking in vitality.  The moment Zhao Da’s thin-soled boot touched the ward grounds, the warden in bowing attendance at the gate sensed that something was off. Zhao Da visited Xuanren Ward three or four times every month with his two skinny, sallow-faced soldier boys, and every time he walked in blustering and walked out bellowing, as if he felt he had to yell until his throat bled to really earn the monthly patrol salary. But this time, he slipped through the gates without a sound. He made a few hand gestures in the direction of the warden, as if anyone except himself understood them, and led his two soldier boys tip-toeing northward along the walls.  “Marquess, hey, Marquess Yu!” The warden chased after him, waving his arms. “What are you doing? You’re scaring me to death! Won’t you rest your feet and have some soup? If you need a—um—‘bonus’ or a pretty girl, just say the word—”  “Shut up!” Zhao Da glowered at him and lowered his voice. “Stand against the wall! Let’s get this straight: I have a warrant from the county magistrate. This is out of your hands!”  The terrified warden stumbled back against the wall and watched Zhao Da and his men creep away.  Shivering, he pulled over a nearby child. “Tell Sixth Madam to clear out. Quick!” The snot-nosed urchin bobbed his head and hightailed it.  In less time than it took to burn half a stick of incense, two hundred and forty shutters clattered over the windows of the thirteen brothels of Xuanren Ward. The noise of price-haggling, bet-placing, and bed frames creak-creaking disappeared without a trace. Somebody’s child started to wail, only to be silenced instantly by a resounding slap. A swarm of patrons still adjusting their robes and hats fled out the back, darting through gaps in the ward walls like startled rats to vanish into Jinyang’s streets and alleys.  A crow flew by. The guard outside the gate drew his bow and aimed, his right hand groping for an arrow, only to discover that his quiver was empty. Resentfully, he lowered the bow. The rawhide bowstring sprang back with a twang that made him jump. Only then did he realize that his surroundings had descended into total silence, so that even this little noise startled more than the hour drums at night.  That Zhu Dagun, resident of the ward for the last ten years and four months, failed to notice Xuanren in its busiest afternoon hours had plunged into a silence more absolute than post-curfew could only be attributed to remarkable obliviousness. Only when Zhao Da kicked down the door to his room did he start and look up, realizing that it was time to put on the show. So he bellowed and hurled a cup half-filled with hot water smack into Zhao Da’s forehead, following it up by knocking over his desk, sending the movable type in his type-tray clattering all over the floor.  “Zhu Dagun!” Zhao Da yelled, one hand over his battered forehead. “I have a warrant! If you don’t—”  Before he could finish, a fistful of movable type slammed into him. Made of baked clay, the brittle, hard type blocks hurt something fierce when they struck his body, and shattered into dust as they hit the ground. As Zhao Da leapt and dodged; clouds of yellow dust filled the room.  “You’ll never catch me!” Zhu Dagun opened fire left and right, hurling type blocks to hinder his foes while he threw the south window open, preparing to jump out. One of the young soldiers charged out of the yellow fog, chains raised. Zhu Dagun executed a flying kick; the boy cannonballed through the air and landed against a wall. The chain fell from his hands as nose-blood and tears flowed freely.  While Zhao Da and company continued to grope blindly about, Zhu Dagun vaulted out the window into freedom. Then he smacked his forehead, recalling the charge from Minister Ma Feng: “You must be caught, but not easily. You must resist, but not successfully. Lead them on; play the coquette. The show must not appear scripted.”  “Lead them on . . . lead them on my ass . . . ” Zhu Dagun steeled himself and barreled ahead, carefully tripping his right foot with the left just as he passed the middle of the courtyard. “Aiya!” he cried as he tumbled to the ground with a meaty slap; the water in the courtyard cisterns sloshed from the impact.  Tracking the commotion, Zhao Da ran outside. “Serves you right for running!” he guffawed at the sight, still nursing his bruised forehead. “Chain him up and bring him to the jail! Gather up all the evidence!”  Still bleeding from his nose, the soldier boy stumbled out of the room. “Chief!” he bawled. “He smashed that tray of clay blocks. What other evidence is there? Since I spilled blood today, I should eat rich white flour food tonight to get better! My ma said that if I enlisted with you I’d have steamed buns to eat, but it’s been two months and I haven’t seen the shadow of a bun! And now we’re trapped in the city, I can’t even go home. I don’t know if my ma and da are still alive—what’s the point of living?”  “Fool! The type blocks may be gone, but we still have the internet lines! Get some scissors and cut them loose to bring back with us.” Zhao Da bellowed. “Once we get this case sewn up, never mind steamed buns, you’ll have mincemeat every day if you want!”  2.  The fates of life’s bit players are often changed by a single word from the mighty.  It was the sixth day of the sixth month, in the first dog days of summer. The sun hung high above the northlands, the streetside willows limp and wilting under its glare. There shouldn’t have been a wisp of breeze, and yet a little whirlwind rose out of nowhere, sweeping the street end to end and sending the accumulated dust flying. The General of the Cavalry, Guo Wanchao, rode his carriage out of Liwu Residence and proceeded along the central boulevard toward the south gate for the better part of an hour. Being the ostentatious sort, he naturally sat high in the front, stamping on the pedal so the carriage made as much din as possible. This carriage was the latest model from the East City Institute, five feet wide, six feet four inches tall, twelve feet long, eaves on all four sides, front- and rear-hinged doors, with a chassis constructed from aged jujube wood and ornamented with a scrolling pattern of pomegranates in gold thread inlay. Majestic in air, exquisite in construction, the basic model’s starting price was twenty thousand copper coins—how many could afford such a ride in all of Jinyang, aside from a figure like Guo Wanchao?  The four chimneys belched thick black smoke; the wheels jounced along the rammed-earth street. Guo Wanchao had meant to sweep his cool gaze over the goings-on of the city, but due to the heavy vibrations, the passersby saw it as an amiable nod to all, and so all came over to bow and return the greeting to the General of the Cavalry. Guo Wanchao could only force a laugh and wave them off.  A massive cauldron of boiling water sat in the back of the carriage. Despite hours of explanation filled with fantastical jargon by the staff of the East City Institute, the general still didn’t understand how his vehicle functioned. Apparently it used fire-oil to boil the water. He knew that the stuff came from the southeast lands, and would burn at a spark and burn even harder on water. Defenders of a city would dump it on besiegers. This stuff boiled the water, and then somehow that made the carriage move. How was that supposed to work?  Regardless, the cauldron rumbled and bubbled, such that the armor at his back fairly sizzled from the radiating heat. He had to steady his silver helm with one hand so that it wouldn’t slip over his eyes every few bone-jarring feet. The General of the Cavalry had only himself to blame; inwardly, he bemoaned his decision to take the driver’s seat. Fortunately, he was approaching his destination. He took out his pair of black spectacles and put them on his sweating, greasy face as the carriage roared past streets and alleys.  A left turn, and the front gate of Xiqing Ward lay straight ahead. This was an era of degeneracy, insolence, and the collapse of the social order, to be sure: the residence walls were so full of gaps and holes that no one bothered to use the front gate. But Guo Wanchao felt that a high official ought to behave in a manner befitting the importance of his position. It just didn’t look proper without servants and guards leaping to action on his behalf.  But no one came to the ward gate to greet him. Not only was the warden missing, it seemed that the guards were napping in some hidden corner as well. Ancient scholar trees and cypresses lined the street, providing shade everywhere except in front of the completely barren front gate. It didn’t take long before Guo Wanchao, waiting in his stopped carriage, was panting and dripping sweat like rain.  “Guards!” he yelled. There was no response, not even a dog barking in acknowledgment. Furious, he jumped off the carriage and stormed into Xiqing Ward on foot. The residence of Minister Ma Feng was just south of the gate. Without bothering to speak to the doorkeeper, he shoved open the door to the minister’s residence and barged in, circling around the main building to head for the back courtyard. “Surrender, traitors!” he bellowed.  Pandemonium broke out. In a flash, the windows burst open front and back. Five or six escaping scholar-officials fought to escape by squeezing through the narrow openings, but only succeeded in tangling their flailing limbs and tumbling into a heap.  “Aiya, General!” Potbellied old Ma Feng had crept to the door and was peeking out the seam. He put a hand over his heart and thanked heaven and earth. “You mustn’t play this kind of trick on us! Everyone, everyone, let’s all go back inside! It’s just the General, nothing to be afraid of!” The old man had been so startled that his cap had fallen off, leaving his head of white hair hanging like a mop.  “Look at you!” Guo Wanchao smirked, an expression somewhere between amusement and ire. “How are you going to plot treason with so little courage?”  “Shhhh!” Old Ma Feng was given a second fright. He scurried over, took Guo Wanchao’s hand and dragged him inside. “Careful! The walls out here aren’t so thick . . . ”  The whole gang trooped back inside, latched the door, pressed the battered window panels back into their frames as best as they could, and gingerly took their seats. Minister Ma Feng pulled General Guo Wanchao toward a chair, but Guo shook him off and stood right in the middle of the room. It wasn’t that he didn’t want to sit; rather, the archaic armor he’d worn for its formidable appearance had nearly scraped his family jewels raw on the bumpy journey.  Old Ma Feng put on his cap, scratched at his grizzled beard, and introduced Guo Wanchao. “I’m sure everyone has seen the general at court before. We’ll need his help to accomplish our goals, so I secretly invited him here—”  A tall, rangy scholar in yellow robes interrupted. “Why does he wear those black spectacles? Does he hold us in such contempt that he covers his eyes to spare himself the sight?”  “Aha, I was waiting for someone to ask.” Guo Wanchao took off the black lenses nonchalantly. “It’s the latest curiosity from the East City Institute. They call it ‘Ray-Ban.’ They allow the wearer to see normally, and yet be spared the glare of the sun. A marvelous invention!”  “It hardly seems right for a man interested in enlightenment to reduce the reach of light,” grumbled the yellow-robed scholar.  “But who says banning rays is all I’m capable of?” Guo Wanchao proudly drew a teak-handled, brass-headed object from his sleeve. “This device, another invention from the East City Institute, can emit dazzling light that pierces darkness for a hundred paces. The staff from the institute didn’t give it a name, so I call it ‘Light-Saber.’ The banisher of rays and the sword of light! Brilliant, eh? It was a match made in heaven, haha . . . ”  “Disgusting ostentation!” shouted a white-robed scholar as he wiped at the blood on his face with his sleeve. He had run too quickly earlier and tripped, and the cut on his forehead had bled all over his delicate scholar’s face, encrusting his fair skin with blotches the exact color of farmland mud. “Ever since the East City Institute was established, our proud State of Han has fallen further by the day! We’ve been under siege for months; the people are full of fear and dread. And your kind still revels in such, such—”  Ma Feng hurriedly tugged at the scholar’s sleeve, attempting to smooth things over. “Brother Thirteenth, Brother Thirteenth, please quell your anger. Let’s take care of business first!” The old man made an unhurried patrol of the room, drawing the curtains and carefully covering up the cracks in the windows. After a phlegmy cough, he took out a three inch square of bamboo paper from his sleeve and displayed it to his audience, who saw that it was covered with characters the size of gnat’s heads.  Ma Feng began to read in a low voice. “Sixth month of the sixth year of the Guangyun Era. Great Han is weak and benighted, and the fires of war rage in the twelve provinces around us. We have fewer than forty thousand households, and our peasants cannot produce enough to equip our soldiers with strong armor and weapons. Beset by droughts and floods, our fields lie bare while the wells are exhausted, and our granaries and stores are empty. Meanwhile we still must pay tribute to Liao in the north and guard against mighty Song to the south, stretching the treasury beyond its capacity. The peasants have no food, the officials have no pay, the roads are lined with those dying of starvation, the horses have no grass to graze, the state is poor and its people are piteous! Woe is the land! Woe is Great Han!”  “Woe,” the roomful of scholars lamented in synch; then, they immediately chorused, “Well said!”  But Guo Wanchao glared at the speaker. “Enough of this flowery oratory! Get to the point!”  Ma Feng took out a brocade handkerchief and wiped the sweat from his forehead. “Yes, yes, there no need for me to continue reading from the formal denunciation. General, you know well that after such a long siege by the Song army, Han is at the end of its strength, while the Song ruler Zhao Guangyi has made the conquest of the city a matter of personal honor. His edict declared that ‘Han has long disobeyed the will of the rightful ruler, acted heedless to the right way, and governed the people ruinously. For the sake of the land and the people, I personally come to pacify Han in the name of justice.’  “Zhao Guangyi is known for his vicious, vengeful nature. Have you not seen how the King of Wuyue pledged his territories to Song voluntarily and was made a prince, while the ruler of Quan and Tang gave up his lands only after he saw the Song army at his gate, and was thus made a mere regional commander? By now, Jinyang has been under siege for nearly ten months. Zhao Guangyi is beyond furious. Once the city falls, the grandeur of the title he’s waiting to bestow our Han emperor will be the least of our concerns. The whole city will suffer the Song ruler’s rage! You won’t find an unbroken egg in a nest that has tumbled from a tree. General, you mustn’t let our people perish in unimaginable suffering!”  Guo Wanchao said, “I’ll be honest with you: we military officers haven’t been paid in half a month either. The footsoldiers whimper with hunger all day long. If we scrape away all your fancy allusions and circumlocutions, what you mean to say is that our little emperor Liu Jiyuan won’t be able to sit on his throne long anyway, so we might as well surrender to Song, am I correct?”  Instantly, the scholars jumped out of their seats in uproar, shouting curses and instructing him of the Confucian duties of ruler and subject, father and son, the respect due to a subject reciprocated by the loyalty due to a ruler, so on and so forth, until Ma Feng was shaking all over with fear. “Everyone! Everyone! The neighbors have ears, the neighbors have ears . . . ”  When the room had finally quieted, the old man hunched his shoulders and rubbed his hands together anxiously. “General, please understand that we’re aware of our duty of loyalty to the throne. But if the ruler doesn’t do his part, how can the subjects be expected to do theirs? If the emperor is unwise in his governance, we have no choice but to overstep our bounds! The first possibility ahead of us is that the city falls and the Song army slaughters us all. The second is that the Liao army arrives in time to drive away the Song, in which case Han will become nothing more than Liao territory. The third is that we open the gates and surrender to Song, ensuring the survival of Jinyang’s eight thousand six hundred households and twelve thousand soldiers, and preserving the bloodline of the imperial family. You too understand the superior choice, General! At least Song follows the same customs and speaks the same language as us, while Liao is Khitan and Tatar. It’s better to surrender to Song than let Liao enslave us! Our descendants might curse us for cowards and traitors, but we can’t become the dogs of the Khitan!”  Hearing this speech, Guo Wanchao had to revise his opinion of the old man. “Very well.” He gave a thumbs up. “You’re a righteous man indeed to make even surrender sound so fine and just. Tell me your plan, then. I’m listening.”  “Yes, yes.” Ma Feng gestured for everyone to resume their seats. “Ten years ago, when the previous Song ruler, Zhao Guangyi’s elder brother, was invading Han, Military Governor Liu Jiye and I wrote a memorandum to the emperor begging him to surrender. We were whipped and driven out of court. But today, the emperor spends his days drinking and feasting, careless of the matters of state, a perfect opportunity for us to act. I’ve already secretly contacted Inspector Guo Jin in the Song army. If you can open the Dasha, Yansha, and Shahe Gates, General, the Song will accept our surrender.”  “What about our little emperor, Liu Jiyuan?” asked Guo Wanchao.  “Once he sees that no other options are left to him, he’ll wisely surrender too.” Ma Feng answered.  “Good enough. But have you considered the most important problem? What are we going to do about the East City Institute?” Guo Wanchao looked around the room. “The prince of East City has people on all the city walls, gates, and fortifications, and they control all the defense mechanisms. If the prince doesn’t surrender, the Song army won’t be able to get in even if we open the gates.”  The room fell silent. “The East City Institute?” The white-robed scholar sighed. “If it weren’t for Prince Lu’s antics, perhaps Jinyang would have long since fallen . . . ”  Ma Feng said, “We’ve decided to send a representative to persuade Prince Lu toward the path of reason.”  “And if it doesn’t work?” asked Guo Wanchao.  “Then we send an assassin and get that fake prince out of the way with one stroke.”  “Easier said than done, old man,” said Guo Wanchao. “The East City Institute is heavily guarded. With all his strange devices, one might die before getting so much as a glimpse at Prince Lu’s face!”  Ma Feng said, “The East City Institute is located right next to the prison. All of the prince’s subordinates are criminals recruited from there. All we have to do is plant someone in the prison, and he’ll end up next to Prince Lu for certain.”  “Do you have candidates? One to persuade, another to kill.” Guo Wanchao swept his gaze around the room. The scholars avoided his eyes, focused inward, and began reciting the Thirteen Confucian Classics under their breaths.  Guo Wanchao smacked his forehead. “Wait, I have a candidate. He’s a scribe from your Hanlin Academy, an old acquaintance of sorts, a Shatuo who goes by a Han surname. He’s a middling scholar, but he’s strong. He’s the sort of muddled self-righteous fool who likes to spend his days complaining on the internet. Let’s give him a little money, then hand him a knife and deliver him a speech like the one you gave me. He’ll happily do what we want.”  Ma Feng clapped his hands. “Excellent! We just need to make sure he has a convincing reason for being thrown in jail so the East City Institute doesn’t get suspicious. Too severe a crime and he won’t be leaving the dungeon. But it can’t be too light, either. At the minimum it needs to justify shackles and chains.”  “Haha, that’s not a problem. This fellow spends all his time spewing unsought opinions and sowing slander online. His crime is ready-made.” Guo Wanchao gripped the armor at his crotch with one hand and turned to leave. “Well, keep today’s talk a secret between heaven, earth, you, and me. I’m off to find an internet monitor. I’ll bring the fellow over later. We’ll talk more next time. Farewell!”  The general’s armor clanged as he swaggered out of the room, the contemptuous gazes of the scholars bouncing harmlessly off the backplate. Outside, the fire-oil chariot began its deafening rumble. Ma Feng wiped his sweaty face and sighed. “I do hope that taking care of the East City Institute will really be this simple. Our lives are at stake, everyone. We must act with caution! Caution!”  3.  Zhu Dagun didn’t know which magistrate had dispatched his captors, but as Minister Ma Feng had told him, the Department of Justice Penitentiary, the Taiyuan Circuit Prison, the Jinyang County Prison, and the Jianxiong Military Prison were all the same nowadays. Who was to blame but a government of such staggering incompetence that it managed to lose all twelve of its prefectures, with only the lone city of Jinyang left under its rule?  As the soldiers dragged him through Xuanren Ward in chains, many curious gazes followed him through the cracks in the brothels’ boarded up doors. Who among the sisters, clients, and brothel keepers could fail to recognize the penniless scholar? Here was a scribe of the Hanlin Academy, living in the red-light district of all places. Perhaps it would be understandable in a man of passions, but despicably, he had not patronized the sisters even once in all these years. Every time he walked by, he would cover his eyes with his sleeve and quicken his steps, muttering “Sorry! Sorry!” One wondered if he was more embarrassed by the thought of his ancestors seeing his current circumstances, or by the thought of the Xuanren girls seeing whatever he hid in his pants.  Only Zhu Dagun knew that the only thing he was ashamed of was his wallet. With the arrival of the Song army, the Hanlin Academy had cut off his monthly stipend. In the three months of siege, he had received only four pecks of rice and five strings of coins as remuneration for his writing. They called them hundred-strings, but he counted only seventy-seven lead coins on each of them. If he spent a night in the House of Warm Fragrance, he’d be eating chaff for the rest of the month. Besides, he had to pay for internet. He’d chosen his address not only for the cheap rent, but also for the convenience of the network. It had a network management station right on top of the back wall. If anything went haywire, all he had to do was kick the ladder and yell upward. The internet fee was forty coins a month, plus a few more to keep the network manager friendly. Outspending his income was a negligible concern when he couldn’t live a day without the internet.  “What are you dragging your feet for? Move it!” Zhao Da yanked on the chain; Zhu Dagun stumbled forward, hurriedly covering his face with his hands as he went down the street. In a moment, they came out of the front gate of Xuanren Ward and turned to travel eastward along the wide thoroughfare of Zhuque Street. They saw few pedestrians, and none who paid any mind to a criminal in chains in this time of war and chaos. Zhu Dagun spent the walk hiding his face and cringing, terrified of bumping into a fellow Hanlin Academician. Fortunately, this was the hour after lunch, when everyone was napping with full bellies. He didn’t see a single scholar.  “S-sir.” After a while, Zhu Dagun couldn’t resist asking in a small voice, “What am I under arrest for?”  “What?” Zhao Da turned to glower at him. “Misinforming the public, starting rumors—did you think the government was ignorant of the trouble you were making online?”  “Is it a crime for concerned citizens to discuss current affairs?” Zhu Dagun asked. “Besides, how does the government know what we say online?”  Zhao Da laughed mirthlessly. “If it’s government business, there’s government people watching. You untitled little scribe, did you know that spreading slander and rumor about the current situation is a crime on the same level as inciting a disturbance at a governmental office or assaulting a minister? Besides, the internet is another novelty from the East City Institute. Naturally we have to be twice as cautious. You may think that the network manager’s there to keep the internet operating smoothly, but he’s writing down every word you send out in his dossier. It’s all there in black and white. Let’s see you try to wriggle out of it!”  Shocked, Zhu Dagun fell silent.  Chug chug chug chug. A fire-oil carriage rumbled past, spewing flame and smoke. It had “East City XII” painted on its side, marking it as one of the Institute’s repair vehicles.  “The Song army is trying to storm the city again,” said one of the soldiers. “Nothing will come of it this time either, most likely.”  “Shhh! Is it your place to talk about that?” His companion cut him off immediately.  Ahead, a crowd was gathered around some sort of vendor stand set up under the shade of the willows. A smirking Zhao Da turned to one of his soldiers and said, “Liu Fourteenth, you should save up some money and get your face scrubbed. You’ll have more luck finding a wife.”  Liu Fourteenth blushed. “Heh-heh . . . ”  Zhu Dagun then knew that it was the East City Institute’s tattoo removal stand. The emperor was afraid of the Han soldiers deserting, so he had their faces tattooed with the name of their army divisions. The Jianxiong soldiers were tattooed “Jianxiong;” the Shouyang soldiers were tattooed “Shouyang.” As for Liu Fourteenth, a homeless wanderer who’d been enlisting in every army he could find since boyhood, his face was inked shiny black from forehead to chin with the characters of every army that had ever patrolled this land. The only blank spot left was his eyeballs; if he wanted to enlist again in the future, he’d have to shave himself bald and start tattooing his scalp.  The East City prince’s tattoo removal method had the soldiers rushing to line up. The technique involved taking a thin needle dipped in a lye solution and pricking the skin all over. The scabs were peeled off, and the skin again brushed with lye solution before being wrapped with cloth. The second set of scabs then healed to reveal clean new skin. It was precisely due to the unease of being under siege that everyone wanted a wife to enjoy while they could. Prince Lu’s invention showed his deep understanding of the soldiers’ thoughts.  The procession walked a bit farther, then harnessed an oxcart at Youren Ward and continued east by cart. Zhu Dagun sat on a stuffed hemp sack, bouncing with every bump in the road, the chains scraping his neck raw. Deep inside, a little part of him couldn’t help but regret accepting the mission. He and the General of the Cavalry Guo Wanchao counted as old acquaintances. Their ancestors had been ministers together under old Emperor Gaozu Liu Zhiyuan. The fortunes of their families had gone opposite ways in the time since, but now and then they’d still simmer some wine and talk of things past.  That day, when Guo Wanchao invited him over, he’d been utterly unprepared to see Minister Ma Feng sitting there as well. Ma Feng wasn’t just anyone—his daughter was the emperor’s beloved concubine, such that the emperor even referred to him as father-in-law. It hadn’t been long since he’d stepped down from the position of Chancellor for the sinecure of Xuanhui Minister. In all of Jinyang, aside from a few self-important generals and military governors with soldiers under their command, no others could equal his status and power.  After a few rounds of wine, Ma Feng explained to him what they had in mind. Zhu Dagun immediately threw his cup to the floor and jumped up. “Isn’t this treason?”  “Sima Wengong once said, ‘Loyalty is to give all oneself for the well-being of another.’ Yanzi also said that ‘Being a loyal minister means advising one’s lord well, not dying with one’s lord.’ One should not take shelter under a wall on the verge of falling. Brother Zhu, consider your gains and losses carefully, for the sake of the people of the city . . . ” Old Ma Feng held on to Zhu Dagun’s sleeve, his whiskers trembling as he sermonized.  “Sit down! Sit down! Who do you think you’re fooling with that performance?” Guo Wanchao hawked out a glob of phlegm. “All you scholars are the same. Powerless to make any difference, you spend all day on the internet pontificating and debating, criticizing the emperor for never doing anything right, and lamenting that Han is going to collapse sooner or later. And now all of a sudden you can’t bear to hear a word against the emperor? To put it bluntly, once the Song dogs storm the city, everyone in it is motherfucking dead. Better to surrender while we can and save tens of thousands of lives. Do you really need me to spell this out for you?”  Awkwardly, Zhu Dagun stood there, unwilling to either acquiesce by sitting or to defy the general by leaving. “But Prince Lu has those machines on the city walls. Jinyang is well-fortified, and I hear a grain shipment from Liao arrived a few days ago from the Fen River. We can hold out for at least several more months—”  Guo Wanchao spat. “You think Prince Lu is helping us? He’s screwing us over! Those Song dogs now control the Central Plains. They have enough grain and money to keep the siege going for years. Back in the third month, a Song army crushed the Khitan at Baima Ridge, killing their Prince of the Southern Domain Yelu Talie. The Khitan are too scared to come out of Yanmen Pass now. Once the Song army cuts off the Fen and Jing Rivers, Jinyang will be completely isolated. How are we supposed to win? Besides, who knows where that East City prince came from, with all his strange devices. Does he really only care about helping us defend the city? I don’t think so!”  For a time, none spoke. A fire-oil lamp crackled on the table, illuminating the small room’s walls. The lamp was another one of Prince Lu’s inventions, naturally. A few coins’ worth of fire-oil could keep it burning until dawn. Its smoke smelled acrid and stained the ceiling a greasy black, but it burned far brighter than a vegetable seed oil lamp.  “What do you want me to do?” Zhu Dagun slowly sat.  “Try to reason with him first, and if that doesn’t work, whip out your knife. Isn’t that how things are always done?” Guo Wanchao said, raising his cup.  4.  Prince Lu’s origin was a complete mystery. No one had heard of him before the Song army surrounded the city. Then, after the loss of the twelve prefectures, stories of the East City Institute began to circulate through the wards. Seemingly overnight, countless novelties sprang up in Jinyang, three of which grabbed the most attention: the massive water wheel and foundry in Central City, the defensive weaponry on the city walls, and the city-spanning internet.  Jinyang was divided into three parts, West, Central, and East. Central City straddled the Fen River; the water wheel was installed right under a veranda, turning night and day with the river’s flow. Water wheels had long been used to irrigate fields and mill grain, but who knew that they had so many other uses? Squeaking wooden cogs drove the foundry’s bellows, and the water-dragons, fire-dragons, capstans, and gliding carts atop the city walls. The foundry held several furnaces, where the bellows blasted air over iron molten by fire-oil. The resulting iron was hard and heavy, far more convenient than before.  The changes were even greater on the city walls. Prince Lu had laid down a set of parallel wooden rails atop the wall and ran a strong rope along the track from end to end. Press down a spring-loaded lever, and the power of the water wheel drove the rope to pull a cart sliding along the track at lightning speed. The trip from Dasha Gate to Shahe Gate normally took an hour even on a fast horse, but with the gliding cart it took only five minutes. On the system’s maiden trip, the soldiers tied to the cart as the first passengers had screamed in terror, but a few more trips showed them the fun in it. With exposure came appreciation; they became the gliding cart operators, spending all day aboard the cart and refusing to get off. There were five carts in total, three for passengers and two for catapults. The catapults weren’t much different from the preexisting Han ones, except that they used the water wheel to winch back the throwing arm, not fifty strong men hauling on the oxhide rope; and they no longer threw stones, but pig bladders filled with fire-oil. Each bladder also contained a packet of gunpowder wrapped in oil cloth, with a protruding fuse that was lit right before firing.  Throwing down rocks and wooden beams was a staple of siege defense, but every beam dropped and rock hurled meant one less in the city. If the siege went on long enough, the defenders usually had to take apart houses in the city for things to throw. Therefore, the East City Institute came up with a vicious new invention. Instructed by Prince Lu, the defenders tamped yellow mud into big clay pillars, five feet long and two feet across, and embedded the surfaces with iron caltrops. The construction of the mud pillars followed a specific recipe: yellow mud was covered with straw mats to stew for a week; mixed with glutinous rice paste, chopped-up straw, and pig’s blood; and then pounded down repeatedly. The caltrops studding the pillars were doused with wastewater until they rusted an unnatural red-black. Prince Lu said that they’d make the Song soldiers catch a disease called “tetanus.” Weighing two thousand six hundred pounds each, glistening a sinister yellowish bronze color, and covered all over with filthy iron caltrops, the pillars turned out to be excellent weapons for slaughter. Hundreds of pillars were secured to the top of the wall with iron chains on each end. When the Song army approached, the pillars smashed down, pulverizing scaling ladders, rams, shields, and soldiers alike. Then, with a turn of the capstan, the water wheel winched the chains with little squeaks, and the bloodstained pillars ascended sedately toward the parapets once more.  After suffering great casualties from the pillars, the Song army changed tactics and sent Khitan captives and their own old, weak, and sick to serve as the vanguard. Taking advantage of the brief respite after their sacrifices were flattened and while the pillars were still down, the main body of the Song army advanced with ladders, siege towers, and catapults. But now the gliding cart-mounted catapults came into play. In a flash, hundreds of red, stinking, wobbling bladders took to the air, blooming into fireballs as they rained down among the Song troops. Wood crackled and soldiers screamed. The fragrance of meat roasted on fruit tree wood permeated the air. Last came the archers, sniping at anyone with a helmet plume—everyone knew that only Song officers could wear feathers on their helmet. But arrows were limited and had to be used conservatively; once the archers had shot a couple arrows each, they returned to rest, thus ending the battle.  Below the city walls was a field of char, smoke, and wailing. Above, the Han defenders poked and pointed into the distance, counting their kills. For every kill, they drew a black circle on their hand, and used the circles to collect their reward money from the East City Institute. By Prince Lu’s calculations, two million Song soldiers had died these months below the city. Everyone else, looking at the Song camps that still covered the horizon end to end, came to an unspoken consensus not to bring up the problem with statistics derived from self-reporting.  With Jinyang securely defended, Prince Lu invented the internet to keep everyone in the city from getting too bored. He first came up with something called movable type (which he claimed was cribbing from an old sage named Bi Sheng, although no one could recall ever having heard of this formidable personage). He’d first carved the text of the Thousand Character Classic in bas relief onto a wooden board, then pressed a layer of yellow mud mixed with glutinous rice, straw, and pig’s blood—leftover material from the death-dealing clay pillars—over the printing plate. Finally, he’d peeled the whole thing off and diced it into small rectangles, thus creating a set of individual type blocks that could be freely combined and assembled. He’d placed the thousand characters into a rectangular tray, attaching every block in the back to a strand of silk thread with a spring. The thousand strands of thread were then collected into a bundle the thickness of a wrist, termed a “web.”  Similar text-trays were found all over the city, while the bundles of silk threads passed through the bottoms of the walls to a network manager’s station. The end of each bundle of silk was then neatly fitted into a metal mesh by tying a small hook to the end of each thread and hanging the hooks to the mesh. These meshes lined the walls of a station, and if two text trays wanted to communicate, the manager found the two corresponding bundles and brought the metal meshes together with a twist that connected the thousand pairs of metal hooks together. The bundles were thus linked together in what Prince Lu called an “internet.”  Once a web connection was established, the users at each end could communicate through the text trays. When one side pressed down on one of the type pieces, the little spring tugged the silk thread, causing the corresponding type to sink down on the other side. Although picking out the desired character out of a thousand densely packed blocks posed quite a strain on the operator’s eyes, an experienced user could type with lightning speed. Some pedants worried that the depth and complexity of hanzi writing could not be adequately represented by such an invention. Though the Thousand Character Classic was an ingenious primer to introduce the wonders of hanzi, how could a mere one thousand characters be enough to discuss life and the universe? Prince Lu countered that they were one thousand unique characters—never mind discussing the universe, these characters had been enough for the majority of fine essays since antiquity; they were certainly enough for web users to express whatever they needed to say.  In actuality, in the Thousand Character Classic, one of the characters—the one for “pure”—did occur twice. The East City Institute removed one of them and substituted a piece of type with a bent arrow symbol. Since it would have been too difficult for two users to simultaneously type and squint at the text tray for a reply, Prince Lu decreed that the current speaker had to press this “carriage return” block when they finished typing to indicate that it was the other person’s turn. Why the symbol was called “carriage return” was something Prince Lu never bothered to explain.  At first, only two people could talk on a web connection at once, but Prince Lu later invented a complicated bronze hook rack that linked many internet lines together at once. If one person pressed a character, it would show up on all the other text trays.  This advance in the internet led to a new problem. If eight scholars sat down to chat, the moment one of them pressed the return key, the other seven would fight to speak first, with the result that their text trays would undulate up and down uncontrollably, like the dark waters of Lake Jinyang rippling in the north wind. To solve this problem, the East City Institute sold a new kind of text tray with ten blank type squares. When web users took advantage of the bronze rack to form a chat group, everyone first carved the members’ appellations onto the squares. If someone wanted to speak, they pressed the block with their name. Whoever’s block moved first had the right to speak until they pressed carriage return. Prince Lu first called this arrangement a “three-way handshake,” then “vying for the mike,” although he never explained what these terms meant. Zhu Dagun loved to smash his own “Zhu” block non-stop, naturally earning severe rebuke within his circles. Block-mashing not only disrupted the others’ ability to speak, but also often caused the internet line to snap.  Though the silk threads were resilient, damage from wind, rain, insects, mice, and bad users like Zhu Dagun was inevitable, and the lines broke from time to time. If you were chatting, only for someone to suddenly call you an “ignorant dog unworthy of the title of scholar sullying the names of past sages,” it was a good sign that the threads for some of your type blocks had broken. While you had meant to type “The Master spake, ‘even the sage-kings of old were met with failures in this,’” what had shown up in the other text trays was “The Master spake, ‘the sage-kings of old were failures,’” thereby not only denouncing the legendary sage-kings, but also smearing great Confucius as well.  At times like this, you had to yell “Manager!” and give the network manager a few coins for the trouble of inspecting the web lines while you took the opportunity to go to the market and buy a few pounds of flatbread. Meanwhile, the manager would sever the connection, find the broken silk lines, and knot them back together. If you didn’t invest enough into a friendly relationship with the network manager, he’d tie a big fat knot that clogged the network so that your lines moved at the rate of a geriatric ox pulling a caravan. But if you did hand over enough coppers, he’d take out a little comb, smooth out the threads until they gleamed, and tie a minuscule square knot. Then you tossed the flatbread through the station window and yelled “All’s well!”—that was why Zhu Dagun had no choice but to reserve money for bribing the network manager, no matter how strained his wallet.  The East City Institute’s siege defense weaponry won it the hearts of the soldiers; its peculiar little inventions won the hearts of the commoners; and the internet won the hearts of the scholars. To moralize and debate and weigh in on anything one desired without having to step outside one’s door—such convenience had never been available to anyone, not even in the time of the ancient sages of legend. With the Song army surrounding the city, the scholars could no longer venture out of the city to climb Xuanwa Mountain, sightsee along the Fen River, or drink and admire the flowers. Being shut inside, they had only writing to serve as a pastime, and that dejected them further. If it weren’t for West City’s internet coverage, these destitute, bored intellectuals would have tried to overthrow the government long ago. With an entire state reduced to one city, its three ministries and six departments gone in all but name, no pay for the ministers, and the emperor not even attending court, the scholars had become the most idle and useless group in the city and could only snipe and complain online.  If some loved the internet, of course others kept their distance, as they would for ghosts and gods—and anything else they didn’t really understand. If some praised Prince Lu, of course others muttered behind his back. No one had actually seen his person, but he was the hottest topic of gossip among the wards.  Zhu Dagun had never dreamed that the first time he had any contact with the prince would involve being sent by Ma Feng and Guo Wanchao to advise surrender. Whether it was more moral to fight or surrender, he hadn’t quite figured out himself. But since both the civil minister and the general charged him with such a weighty task, he could only venture forth, a petition and a sharp knife hidden in his clothes.  5.  The oxcart proceeded creakily past the walled courtyard of an inn. Prince Lu had built it not long after he came to Jinyang. The inn was painted orange, with a blue plaque emblazoned in large characters, “Best Western,” presumably to advertise itself as the best inn in West City. It was a somewhat odd name, though rather tame by the standards of the other neologisms that Prince Lu had invented.  After Prince Lu moved to the East City Institute, he had two windows carved in the wall surrounding the courtyard, one for selling wine and another for selling miscellaneous gadgets. The prince’s wine was called weishiji, presumably a poetic contraction for the phrase “feared and respected by even mighty warriors.” It was brewed by soaking and boiling the grain brought from Liao, creating an alcoholic liquid clear as water and crisp as ice that burned a trail of fire through one’s guts upon imbibing, far superior in flavor to the rice wine sold in the market. Two pints cost three hundred coins, a high price in a time of abundant moonshine stills, but connoisseurs naturally had their ways of paying.  “Soldiers, give us a volley!”  Zhu Dagun turned and saw a dozen or so hooligans standing at the foot of the city wall, yelling toward the outside. A soldier’s head poked out from the parapets above. “Are you short on cash again, Zhao Second? You’d better give us a bigger share of that good wine this time, or else the general’s going to crack down and—”  “Of course, of course!” the hooligans laughed. Then they resumed yelling in unison, “Soldiers, give us a volley! Soldiers, give us a volley!”  Soon after came the voices of the Song soldiers, yelling from outside the city. “You’d better keep your word! Five hundred arrows for twenty pints! Don’t you dare shortchange us.”  “Of course, of course!” With that, the hooligans jumped to action, wheeling out seven or eight haycarts from heaven knew where and arranging them at a distance from the wall. Then they ducked down at the foot of the wall, covering their heads with their arms. “All set. Shoot!”  Bows twanged. A swarm of arrows dense as locusts hissed through the air, arced over the ramparts, and thunked into the piles of hay, instantly transforming the carts into oversized hedgehogs.  Zhu Dagun watched from a distance, fascinated. “I’ve heard the old story of the Three-Kingdoms strategist who propped up straw men to trick arrows from the enemy. I never thought it would still work.”  Zhao Da spat. “These hooligans are colluding with the enemy. You could call it treason if you really wanted to prosecute. The city defense is always short on arrows, so the emperor decreed that he’d pay ten coins for every arrow turned in. The five hundred arrows these hooligans collected can be exchanged for five thousand coins, enough to buy thirty-four pints of alcohol. They lower twenty pints in a cask to the Song soldiers, hand out four pints to bribe the watchers on the wall, and drink the remaining ten until they pass out in the streets. Degenerates!” He turned to glare at them, and shouted, “You fellows have some nerve to do this in my sight!” The hooligans only laughed and bowed to him before whisking the carts down an alley.  Zhu Dagun knew that, whatever Zhao Da said, he was certainly in the hooligans’ pay. But he didn’t bother pointing this out; instead, he sighed. “The longer the siege goes on, the worse the thoughts in people’s heads. Sometimes it feels as if it’s better to let the Song army take the city and get it over with, huh.”  “Nonsense!” Zhao Da bellowed. “Any more traitorous talk and I’ll whip you!” Zhu Dagun still couldn’t figure out if Zhao Da was Ma Feng’s agent, dispatched to help him, so he didn’t speak further.  The sun beat down ruthlessly. The oxcart plodded forth in the shade of listless willows, down the main road through the internal gate dividing West from Central. Central City was no more than seventy yards across, divided into two levels. The water wheel, the foundry, and the various other hot and noisy machines were on the lower level. The upper level was for horses, carts, and pedestrians, and on either side of the road were the government buildings for the Departments of Hydrology, Textiles, Metallurgy, and Divination.  The road had been paved with jujube wood wherever possible. Central City had been built in the time of Empress Wu Zetian by the Secretary of Bing Prefecture to connect East and West Cities on either bank of the Fen River. In the three hundred years since, the jujube paving had been regularly polished with wax and tamped down by feet and hooves, until it gleamed a deep brown like dried blood and was hard as stone. When struck, it rang like a bronze bell; swords bounced off it, leaving only white scratch marks. Pried up and used as a shield, it could deflect blades and arrows, even bolts from the Song army’s repeating arcuballistas. At this point in the siege, the paving was full of gaps, carelessly filled in with yellow mud. Walking over it, you never knew which foot would start sinking. The soft spots could sprain an ox’s ankle.  “Off,” Zhao Da said. He instructed a subordinate to return the oxcart, while he personally led his captive through Central City on foot.  The Fen River was shallow and thin from the drought. Zhu Dagun looked at the turbid flow that wound in from the north, babbling through the city’s twelve arch bridges before continuing southward without rest. “Liao, Han, Song: north to south, three nations connected by a single river.” He sighed unconsciously. “With such a sight before me, I ought to compose a poem to commemorate—”  Before he had the chance, Zhao Da delivered a hard smack to the back of his head, knocking his cap askew and beating the poetic inspiration right out of him. “Enough, you starving scribbler. I sweated buckets getting you here, and I don’t need your chattering. The magistrate’s office is right ahead. Shut up and walk!”  Zhu Dagun quieted obediently, thinking the moment I’m free I’m going to go online and cuss you out to everyone, you corrupt official. Then he realized that if he succeeded in convincing Prince Lu of the East City Institute, Han would no longer exist. Would the internet still be there when Jinyang belonged to Song? For a time, he walked in a daze.  Wordlessly, they crossed Central City into the modest-scaled East City. They walked past the Taiyuan county building and made two turns on the dusty street to enter a courtyard of gray brick and gray tile. The courtyard walls were tall and smooth; the windows were covered with iron bars. Zhao Da exchanged greetings with the man inside and handed over papers, while the soldiers shoved Zhu Dagun into the west wing. Zhao Da took off Zhu Dagun’s chains. “The boss is giving you a cell to yourself. You’ll be brought two meals a day. If you want money, more food, or bedding, ask your family to bring them. Try to escape and your crime rises one rank in severity. Trial is in two days. Just tell everything like it is to the boss. Got everything?”  Zhu Dagun felt a sharp burst of pain in his back; he stumbled and fell into a cell. Guards locked and chained the door, then left.  Zhu Dagun pulled himself up and looked around, rubbing his butt. He found that the cell had a bed, a sitting mat, a bronze basin for washing his face, and a wooden bucket serving as a chamberpot. Although the room was poorly lit, it was neater and cleaner than his own home.  He sat on the mat. He groped the pouch inside his sleeve and found that everything was intact: a copy of the Analects, so that when he debated Prince Lu he could borrow courage from the writings of sages; an empty wooden box, with a hidden compartment containing Ma Feng’s voluminous petition—it may have been an entreaty to surrender, but the impeccable writing and righteous language had Zhu Dagun’s abject admiration; a double-edged dagger forged of prime steel, six and three-tenth inches. Of what import is the anger of a common man? The First Emperor had asked this of Tang Ju. A spray of blood five paces long, answered he. Thinking of this final tactic, the Han words churned Zhu Dagun’s Shatuo and Turkic blood.  6.  Only when Zhu Dagun awoke did he realize that he’d fallen asleep in the first place. A ray from the setting sun slanted through the window. It was late in the day now.  Footsteps sounded in the hallway outside. Zhu Dagun slowly climbed to his feet and stretched, looking out through the gaps between the bars.  Earlier, Ma Feng had said that he’d planted agents inside the prison to appear at a suitable time. At this moment, a guard was strolling over, an oil-paper lantern in his left hand and a box of food in his right, humming as he went. He stopped at Zhu Dagun’s cell and knocked on the bars with the lantern. “Hey, time to eat.” He took two flatcakes from the box, wrapped them around some pickled vegetables, and passed them through the bars.  Zhu Dagun accepted the meal with a friendly smile. “Thank you very much. Does your superior have any words for me?”  The guard glanced around, then set down the food box and took out a scrap of paper. “Here, read this,” he whispered. “Don’t let anyone see it. The general said to tell you, ‘Do what you can, but leave the rest to the will of heaven.’ As long as you do your duty, you’ll benefit whether it works or not.” Then he raised his voice. “There’s water in the basin. Scoop it up with your hands if you want to drink. Relieve yourself in the bucket. Don’t get any blood, pus, or phlegm on the bedding. Got it?”  The guard picked up the food box and strolled off. Zhu Dagun devoured the flatcakes in a few bites, poured some water down his gullet, then turned around and read the note by the last fading sunlight. However, once he was done, he felt more confused than before. He’d thought that the guard had been sent by Guo Wanchao, but the note suggested otherwise. It read:  Dear Sir:  Our state of Han is in big trouble. We’re low on soldiers and grain and rely on the siege defense machines to keep going. Lately I heard that the East City Institute people have been uneasy and Prince Lu seems unstable. If he defects to Song, Han is doomed. Woe! If you read this letter I hope you can talk to Prince Lu and make him see the light. He mustn’t surrender! He refuses to see any guests at the East City Institute so I can only try to do it roundabout like this. For the sake of our people please you must persuade him to stay strong! We’ll beat Song one day for sure!  —Yang Zhonggui again thanks you  The note was clumsy in language, the handwriting unrefined; clearly, the author was some rough fellow without much education. The name “Yang Zhonggui” seemed unfamiliar. Zhu Dagun thought for a long time before remembering that it was the original name of Military Governor Liu Jiye. He was the son of the Lin Province Inspector Yang Xin. Emperor Shizu had adopted him as a grandson and changed his name to Liu Jiye. In his thirty years as a general, he’d never been defeated in battle, earning him the moniker “Invincible.” Currently, he commanded the defense of Jinyang.  Signing the note with his original name showed his desire to distance himself from the current emperor. The reason was no secret. Ten years ago, the previous Song emperor had breached the Fen River dam in an attempt to flood Jinyang. The streets had disappeared under the waters, and corpses and trash floated everywhere. Liu Jiye had petitioned the emperor Liu Jiyuan to surrender, only to meet with curses and mockery. One of the other signatories to the petition, Guo Wuwei, was publicly executed. Liu Jiye had remained in disfavor ever since, stripped of any meaningful command.  Though he’d once advocated surrender, now he advocated fighting on. Zhu Dagun thought he understood why. The Invincible General might have been a renowned warrior who’d caused the deaths of countless soldiers, but he was also a credulous, short-sighted gentle soul who wept to see the ordinary people suffer. Ten years ago, the entire city was starving. Commoners swam into the streets every day to eat the bark off the willow trees; if they rolled off their roofs at night while sleeping, they drowned in the stinking water. Liu Jiye’s heart had ached so at the sight that he’d only wanted to open the gates and let the Song troops in and end all the suffering.  But this time, the city was comparatively well-stocked. The commoners could eat their fill and still have grain left over to trade for weishiji, trade for a few gadgets, or pay a visit to the brothel, satisfying themselves in both body and soul. Naturally this bolstered Liu Jiye’s spirit. He wanted nothing more than for the siege to last for a hundred years until the Song ruler died of old age right where he stood, as vengeance for the past. With Prince Lu holed up in his own territory in East City, shut off from all outsiders, only criminals could hope for an audience with him. General Liu had written his clumsy entreaty and left it in the prison in the hopes that some patriotic prisoner could whisper encouragement to Prince Lu.  “Ah . . . ” Zhu Dagun blinked. He tore up the note and threw the scraps into the wooden bucket, then pissed over them to destroy the evidence. The guard who brought him food hadn’t been the person he was waiting for, but Liu Jiye’s agent, in a strange coincidence.  The sky outside the window was soon dark, and there was no lamp in his cell. Zhu Dagun sat with a full stomach and nothing to do. Normally, this would have been a perfect hour for chatting online. He flexed his fingers restlessly as he mentally recited the Thousand Character Classic. Without sufficient familiarity with this cunning work, one wouldn’t be able to quickly find the right character in the text tray. Memorizing it—and thus the layout for the types—had become a requirement for the literati of his generation.  Footsteps once again sounded in the hall; the glow of flames grew as they approached. Zhu Dagun hurried to the bars and waited. A guard stopped in front of him, holding his torch high. “Zhu Dagun?” he said coldly. “In custody for sowing misinformation online?”  Zhu Dagun smiled. “That’s me. Though I’ve never heard of that crime . . . Does your superior have any words for me?”  “Hmph. Kneel!” the guard suddenly said, in total seriousness. He glanced around, then pulled out something shiny and golden, spreading it to let Zhu Dagun see. Zhu Dagun paled and instantly dropped to his knees. He was only a minor scribe with no governmental rank, but he’d once seen such an object on the incense table of a great scholar of the Imperial Archives. He shivered in fear, obediently touching his forehead to the ground. “The servant . . . the criminal Zhu Dagun a-awaits His Imperial Majesty’s instruction!”  The guard stuck out his chin and began to recite, enunciating each character crisply. “In representation of Heaven and the Emperor the edict speaks: We know of you and your abundance of opinions. Often, you debate matters of state on the internet and spin your words very skillfully to corrupt others. However, we understand that you’ve been falsely reported this time, and we assure you you’ll receive proper redress, but you need to help us out first. It’s improper for us to lower ourselves by going to the East City Institute, and Prince Lu isn’t willing to come to Jinyang Palace. Since we trust no one else in court, we can only put our hopes in you. You and I are both Shatuo, descendants of Yukuk Shad. We trust you, and you must trust us. Ask Prince Lu for us, what are we to do? He once promised that he’d build a flying vessel for us to enable our one hundred and six household members and four hundred old Shatuo retainers to escape from the city and head straight into Liao territories. But Prince Lu now insists that he is too busy with defending the city to build this ‘zeppelin,’ a name he glossed as ‘stairway to heaven’ in an abstruse dialect. It’s been two months and there are no signs of this vessel. The Song troops are fierce and many and our heart is filled with apprehension. Dear loyal scholar, help us convince Prince Lu to build the zeppelin, and we will reserve a seat for you. When the Liu clan once again rises, we’ll grant you the rank of Chancellor. A ruler does not joke.”  “Your servant a-accepts this edict.” Zhu Dagun lifted his hands above his head and felt a heavy scroll descend into them.  The guard sniffed at him. “See what you can do. The emperor is . . . ” He shook his head and left.  Zhu Dagun stood, covered in a cold sweat. He slid the scroll of yellow silk respectfully into his sleeve, his head spinning as he thought of its contents. Guo Wanchao and Ma Feng wanted to surrender; Liu Jiye wanted to fight; the emperor wanted to run away. All of them presented what seemed like reasonable arguments, but upon further thought, none of them seemed so reasonable. Who to listen to, and who to ignore? His heart was a tangle. The more he thought, the more his head hurt.  He didn’t know how much time had passed when new footsteps broke him from his torpor. He’d used up all his enthusiasm; he trudged to the bars and waited.  The guard held a fire-oil lamp. He shone the lamp around, then said, “Sorry I’m late. Since you’re the only prisoner here today, I couldn’t get in until the change of shifts.”  “Does your superior have any words for me?” Zhu Dagun said listlessly. He’d already asked this three times today.  The guard lowered his voice. “The General and Elder Ma want me to inform you that the East City Institute will send for you at the hour of the rat tomorrow. Prince Lu is mucking with something new and needs people. Just claim to be knowledgeable in alchemy and you’ll be able to approach him.”  “Alchemy?” Zhu Dagun said, surprised. “I’m an ordinary scholar. I don’t know anything about alchemy.”  The guard furrowed his brow. “Who said you have to know anything? You’re just trying to get close to Prince Lu. It’s not like you’re actually going to be smelting pills of immortality. Just mumble something about ceruse, litharge, cinnabar, sulfur, the Baopuzi, the Kinship of Three, the Collected Biographies of Immortals, and so on. No one understands this stuff anyway, so no one can call you out. Go to sleep early, and I’ll see you tomorrow. Good luck persuading him!” He turned to leave. Two steps later, he paused to ask, “You did bring the knife, right?”  7.  The sky brightened without fanfare. Sounds of shouting and fighting drifted in; the Song troops were trying to storm the city again. The residents of Jinyang had long since grown accustomed to this, and no one took note.  A guard came to deliver breakfast. Zhu Dagun took the bowl of porridge and looked him over carefully, only to realize he’d only paid attention to the lantern, the torch, and the fire-oil lamp the previous night. He couldn’t remember what the guards looked like at all and was unable to tell which faction this guard hailed from.  Zhu Dagun ate the porridge and sat for a while, doing nothing. The clamor of the morning crowd arose outside. A throng of burly men dressed in East City Institute uniforms flooded into the courtyard.  The guards took Zhu Dagun out into the yard. A man with a yellow beard covering his face walked up and greeted him. “I serve Prince Lu. By his mercy, prisoners here only need to be willing to work for the Institute to obtain pardon for their crime. Your charges aren’t too severe. Just sign here and you’ll be cleared.” The man took out paper and a writing implement. Instead of a brush, the instrument was a goose feather dipped in ink—before Prince Lu, who would have thought that you could pull a feather from a bird, soak it in lye, sharpen the tip, and write with such a thing?  Zhu Dagun automatically reached for the feather, but Yellow-Beard drew it back. “But right now, His Highness needs someone of unusual capabilities and skills. First tell me, are you knowledgeable in alchemy? I’ll be blunt, you look like the genteel, bookish sort, so don’t try to sell yourself for more than you’re worth.”  Zhu Dagun quickly dredged up a speech. “I’ve been studying the Kinship of Three since childhood under the guidance of my father. I am thoroughly versed in the ways of Dayi, Huanglao, and the forging flame. Heaven and Earth are my cauldron, water and fire are my ingredients, and yin and yang are my complements. I know when to stoke the flames and when to bank the embers. In my life I’ve refined one hundred and twenty pills of shining gold and imbibed them daily. Although I have not ascended to the ranks of enlightened immortals, my body has become light, nimble and impervious to disease. The pills have the power to cultivate the spirit and extend life.” To demonstrate the effectiveness of the golden pills, he sprang up and did two backflips in mid-air, then grabbed an eighty-pound stone drum lying in the yard. After lifting it above his head and tossing it from hand to hand, he threw it to the ground, where it landed with a thud. He dusted off his hands, his breathing unhurried, his face unchanged in color.  Yellow-Beard stared; his men started to clap. The guard standing behind him sneaked a thumbs up, upon which Zhu Dagun knew that this was Ma Feng’s agent.  “Excellent, excellent! We’ve found a real treasure today.” Yellow-Beard laughed and opened the small bamboo case at his waist. He dipped the goose quill in ink and handed it over. “Sign here, and you’ll belong to the East City Institute. We’re going straight to Prince Lu.”  Zhu Dagun signed his name as directed. Yellow-Beard ordered the guards to unfasten the manacles around his ankles, bowed all around to the prison staff, and left the courtyard with his retinue. He and his men escorted Zhu Dagun for half an hour before arriving at a large residence complex, both sprawling in area and dense with buildings. The blue-garbed guards at the gate smiled when they saw Yellow-Beard. “Got the goods? It’s been peaceful lately. We haven’t had any new people join in a while.”  “I know, Prince Lu was frantic about finding an alchemist to help him out,” replied Yellow-Beard. “We’ve finally taken care of that.”  A crowd was gathered in front of the gate: imperial messengers, merchants, government officials in search of glory by association, commoners seeking aid in redressing wrongs done to them, craftsmen bringing their own inventions in the hopes of an audience, idlers trying to return the novelties they purchased after they grew bored, laborers looking for work, prostitutes looking for clients. The guard recorded them one by one in his ledger, gently refusing, reporting, and chasing off with a stick as appropriate. If he saw anyone he was uncertain about, he went ahead and took the bribe, then told them to try their luck again in a few days. He was quite orderly and methodical in this work.  Yellow-Beard led his men into the compound. The courtyard was a different scene: behind a privacy wall was an immense pool of water, in the middle of which a geyser rose more than ten feet tall before majestically splashing down.  “Normally the fountain is powered by the water turbine from Central City, but with the Song army regularly trying to storm the city, we need the turbine to power the gliding carts, catapults, and capstans,” Yellow-Beard explained. “So instead the fountain mechanisms run on manpower. We have several dozen unskilled laborers in the Institute, whose only trade is doing heavy lifting, nothing like a white collar fellow like you.” Zhu Dagun had never heard of the strange words he used, so he simply looked where Yellow-Beard pointed. Indeed, he saw five dull-eyed, muscular fellows to the side, stepping on pedals that went up and down. The pedals drove rotors, the rotors churned a water tank, and the tank valves opened and shut, pumping water high into the air.  They went around the fountain and through an archway to enter the second partition of the courtyard. A dozen or so workshops stood to either side. Yellow-Beard said, “We build the flashlights, sunglasses, clockwork toys, microphones, magnifying glasses, and other things we sell in the city here. Institute staff get a fifty percent discount, and a lot of these gadgets are hard to find in the market. You should come check them out when you get a chance.”  As they spoke, they went through a third partition. Heavy, gleaming fire-oil carriage components lay everywhere under a high awning. A piece of heavy machinery puffed away, spewing white smoke and rapidly turning a carriage wheel. Several oil-stained craftsmen were engaged in an animated discussion full of strange words like “cylinder pressure,” “ignition timing,” and “steam saturation.” Two carpenters were hammering together a carriage framework. Several dozen large barrels of fire-oil stood in a corner of the yard, filling the air with their simultaneously aromatic and noxious smell. Fire-oil came from the island of Hainan and was originally used to douse attackers in flames during a siege, before it found myriad uses in Prince Lu’s hands. Yellow-Beard said, “All the fire-oil carriages running about in Jinyang were built here. They make up more than half the Institute’s income. The newest model will be released soon. It’s called Elong Musk—for the long-lasting fragrance of fire-oil after the vehicle darts out of sight. Even the name sounds fast!”  They continued walking, entering a fourth partition. This place was even stranger. There was constantly some shrill squeaking noise, or the crackle of an explosion, or an odd taste to the air, or colorful flashes of light. “This is the Institute’s research lab,” Yellow-Beard said. “Our prince gets a new idea a minute, and then our craftsmen try to follow up on his ideas and make them a reality. It’s best not to linger here; there are lots of accidents.”  On the walk here, the other members of their group had gradually dispersed, so that Yellow-Beard and Zhu Dagun were alone by the time they entered the fifth partition. Blue-garbed guards stood at the gateway; Yellow-Beard took out a pass, spoke a code phrase, and wrote down several passwords on a piece of paper; only then were they let inside. Hearing that Zhu Dagun was the newly arrived alchemist, the guards patted him down head to toe. Fortunately, he’d hidden the imperial edict in the rafters of his prison cell and tucked the dagger into his topknot. Zhu Dagun had a big head, covered in a black silk cap with jutting ears in the back. A guard snatched off his cap, but only saw a bulging bun of sallow hair, and didn’t look more carefully. On the other hand, the copy of the Analects they found in his sleeve pouch roused suspicion. They looked him up and down, then flipped through the book. “What’s an alchemist doing with this?”  This copy of the Analects hadn’t been printed with Prince Lu’s clay movable type. Rather, it had been printed in Emperor Shizong of Zhou’s time, using the official carved plates, and had been passed down for generations into Zhu Dagun’s hands. Zhu Dagun felt physical, visceral pain as he took back his crumpled and wrinkled treasure and prepared to head in.  Yellow-Beard said, “This row of buildings in the north is where His Highness normally spends all his time. He doesn’t like to be disturbed, so I won’t go in with you. Don’t be afraid, our prince is amiable and kind. He’s not hard to talk to . . . Right, I still don’t know your name.”  “My surname is Zhu,” Zhu Dagun quickly said. “I’m the eldest of my siblings and named after Gun, father of the first Xia ruler. My courtesy name is Bojie.”  Yellow-Beard said, “Brother Bojie, I’ve been one of His Highness’s helpers since he first arrived in Jinyang. He granted me the name Friday.”  Zhu Dagun bowed. “Thank you, Brother Friday.”  Yellow-Beard returned the bow. “Not at all, not at all,” he said, before turning and leaving.  Zhu Dagun straightened his clothes, cleared his throat, scrubbed at his face, swallowed, and entered the building.  The room was very spacious. Black paper covered the windows, and fire-oil lamps illuminated the inside. Two long tables stood at the center of the room, covered with various jars and bottles. A man stood at one of the tables, head down, working on something.  Zhu Dagun’s palms sweated, his heart raced, and his legs wobbled. He hesitated briefly before gathering his courage, clearing his throat stickily, and dropping to a kowtow. “Your Highness! I . . . this criminal is—”  The man turned. Zhu Dagun kept his head down, afraid to look at his face. He heard Prince Lu say, “About time! Hurry and help me, I’ve been messing with this for days without any progress. Why is it so hard to find someone who understands middle school chemistry? What’s your name? What are you doing there on the ground? Get up already and come here.”  At Prince Lu’s string of words, Zhu Dagun hurriedly stood up and came over, his head down. He thought that this august prince sounded friendly and genial, like someone easy to approach, although he pronounced his words so strangely that Zhu Dagun had to repeat them to himself several times before understanding the prince; he wasn’t sure what topolect it was. “Your lowly servant is Zhu Dagun, a criminal.” Still keeping his eyes lowered, he made his way to the center of the room. Jars and bottles clanged over as he went, not because of carelessness or poor eyesight, but because the floor was so packed with random objects that he couldn’t take a step without kicking something over.  “Hey, Lil’ Zhu. You can call me Old Wang.” The prince stood on tiptoes to pat his shoulder. “You’re really tall. 190 centimeters, maybe? I heard you’re from Hanlin Academy. I really wouldn’t have guessed that by looking at you. Have you eaten? If not, I’ll get us some takeout to pad our stomachs. Otherwise, let’s cut straight to the chase. I still haven’t gotten results from today’s experiment.”  These words threw Zhu Dagun into a daze. He sneaked a glance up and discovered that the prince didn’t look like a prince at all. He was of medium height, pale and beardless, and wore a buttoned white cotton coat. His hair was cropped short like a beggar-monk’s. He looked to be in his twenties, yet his brow remained creased with worry even when he smiled. “Your servant doesn’t quite understand what you’re saying, Your Highness . . . ” Zhu Dagun bowed anxiously, unsure of what story lay behind this strange prince.  Prince Lu laughed. “You think my accent is confusing, but all you guys sound like gibberish to me. When I first came, I couldn’t understand a single word. Your court speech sounds like Cantonese or Hakka, but nothing like the modern Shanxi and Shaanxi topolects. Since I wasn’t a historical linguist, I thought that all the topolects of ancient northern China wouldn’t sound very different from what I knew!”  This time, Zhu Dagun understood every individual word coming out of the prince’s mouth individually, but their combined meaning fluttered entirely from his grasp. Sweat trickled down his face. “Your servant lacks in erudition. What Your Highness just said . . . ”  Prince Lu waved a hand. “That’s to be expected. You don’t need to understand anyway. Come and hold this flask in place. Oh right, put on a filter mask. You studied alchemy, so you should know that chemical reactions can release toxic gases, I think?”  Zhu Dagun stared.  8.  The crystal bottles on the table held liquids that Zhu Dagun had neither seen nor smelled in his life. Some were red, some were green, some smelled burningly acrid, some stank unbearably. Prince Lu helped him put on a mask, then had him steady a small, wide-mouthed jar. “Take this rod and stir it slowly. Don’t stir faster than that under any circumstance, got it?”  Nervously, Zhu Dagun stirred the dark green fluid inside the jar. It smelled like the sea, and was hot like a bowl of potherb soup. “This is dried seaweed ash dissolved in alcohol,” Prince Lu explained. “You ancients call seaweed ‘kunbu.’ I got this Goryeo kunbu from the Imperial Physician. The Song of Medicine Recipes said ‘kunbu disperses goiter and breaks swelling’ . . . oh, wait, The Song of Medicine Recipes is from the Qing dynasty. I got mixed up again.”  As he spoke, he took out another small jar and carefully removed the sealing clay. The jar was full of an acrid-smelling pale yellow liquid. “This is sulfuric acid. You alchemists call this ‘green vitriol,’ right? Also ‘qiangshui,’ like in the Alchemical Classic of the Yellow Emperor’s Nine Cauldrons. ‘Bluestone is calcinated to obtain a white mist, which is dissolved in water to obtain strong qiangshui. The substance transforms the silver-haired into the ebony-haired. The choking white mist it emits instantly transports one into the realm of spirits, and after eighteen years one departs from senescence and returns to childhood.’ You should be familiar with that.”  Zhu Dagun nodded as if he was. “That’s right, Your Highness.”  “Just call me Old Wang. ‘Your Highness’ sets my teeth on edge. I’ll start now; keep stirring, don’t stop.” He set up a three-paned white paper screen to lean over the mouth of the flask, put on his mask, and slowly poured the green vitriol into the small jar. At first, all Zhu Dagun noticed was a stench that burned its way right through the cotton mask and up his nose, strong enough to make his brain ache and his eyes tear. Then he saw a miraculous purple cloud was floating up out of the jar, unfurling lazily. Zhu Dagun shivered in fright, but Prince Lu only laughed. “Finally! With this crude method for extracting iodine, that’s half my big plan taken care of! Don’t stop, keep stirring until the reaction finishes. I need to see just how much pure iodine I can extract from one pound of dried seaweed . . . Are you interested in how I created sulfuric acid and nitric acid? This is the first step in the Long March of establishing basic industry, you know.”  “I’d love to hear,” Zhu Dagun said automatically.  Prince Lu seemed delighted. “I was pretty good at chemistry back in high school, and I majored in mechanical engineering as an undergrad, so I got a decent foundation. I couldn’t have made it this far otherwise. At first I wanted to use the alchemists’ method of making sulfuric acid from bluestone, but I couldn’t find more than two pounds of it in the city, not nearly enough. Then I happened to see the massive piles of pyrite ore in the iron foundry. Treasure, right for the taking! Heating pyrite gives you sulfur dioxide, and dissolving that gives you sulfurous acid; let that sit for a while and you get sulfuric acid. You can purify that in clay jars; it’s how the munitions factories in Communist Shanbei managed, back in the day.  “With sulfuric acid taken care of, nitric acid wasn’t hard. The biggest problem was the limited supply of saltpeter, which we also needed to make gunpowder. I had to mobilize everyone in the Institute to scrape crusted urine off the bases of walls to refine into potassium nitrate. Our entire place reeked! Fortunately, people in this city have a habit of pissing anywhere there’s a wall. If it weren’t for that, we couldn’t have built the foundations of industry in Jinyang.”  Zhu Dagun flushed. “Sometimes the urges of the bladder are too great. Both men and women commonly take off their trousers and relieve themselves where they stand. Please humor the crude customs of the countryside, Your Highness.”  While they were speaking, the contents of the two jars had been combined into one, and the purple cloud had disappeared. Prince Lu spread the white paper screen out on the table and scraped the surface with a flat scrap of bamboo, removing a layer of purplish black powder. “The iodine in seaweed is easily oxidized in air under acidic conditions, creating elemental iodine. Very good, let me send them orders to follow my recipe and manufacture this in batches, and we’ll do the next experiment.” He crossed the room, sat down in front of the text tray in the corner, and began banging out a missive. Zhu Dagun walked over to look and discovered that this strange prince typed with lightning speed. He didn’t even glance at the characters, but typed blind with unfailing accuracy. “Your type tray looks like a different model, Your Highness,” Zhu Dagun blurted.  “Old Wang, call me Old Wang,” said Prince Lu. “The principle’s the same, but each terminal uses two sets of movable type. The bottom set is used for input and the top set’s used for output. Watch.” He pressed the carriage return to end his message and stood up to grab a crank handle and turn it. The crank turned a roller on which a seventeen-inch-wide length of calligraphy paper had been spooled, passing it smoothly over the text tray. The movable type in the tray, to which ink had been applied, suddenly began to rise and fall, stamping characters onto the paper.  Zhu Dagun bent down to pick up the paper and began to read. “The experiment data is correctly recorded. I’ve told the chemistry department to oversee it. Return.” He looked at the prince with admiration. “This is far clearer and more convenient! White paper and black ink simply reads better to the eye. When are you releasing this on the markets? We’ll support it with all our might!”  Prince Lu laughed. “This is only a prototype. Version two-point-one will use the same mechanism found in printers to stamp the output on the same line, instead of inking the characters all over the place and making it hard to read. You like the internet too? The thing I was least used to about this era was the lack of internet access, so I racked my brains to come up with this. I finally get to feel like a proper nerdy shut-in again.”  “Your August Highness—er . . . Old Wang,” Zhu Dagun corrected himself when he saw Prince Lu’s expression. “May your servant ask, from which prefecture did you originally hail? Are you a scholar of the Central Plains? You have an extraordinary air about you, after all.”  Prince Lu sighed. “The better question is, from what dynasty did I hail? The era I come from is one thousand sixty-one years, three months, and fourteen days distant.”  Zhu Dagun didn’t know if he was joking or raving. He did the arithmetic on his fingers and laughed obsequiously. “I see that you achieved the Way in Emperor Wu of Han’s time, and have lived on to today as an immortal!”  “Not one thousand years in the past,” Prince Lu said unhurriedly. “One thousand years in the future—and nine hundred billion forty-two universes away.”  9.  Zhu Dagun didn’t understand Prince Lu’s ravings, and he didn’t have time to dwell on them, because the next experiment had begun. Prince Lu placed a silver-plated copper coin into a small carved wooden chest, set the cup of newly-made iodine beside the coin, closed the lid, and lit a small clay brazier next to the chest to heat it a little. Soon, purple vapors came billowing out through the cracks in the chest. Heavens, we’re about to get some pills of immortality, Zhu Dagun thought, as he carefully waved the fan as Prince Lu instructed, afraid even to breathe too hard.  A while later, Prince Lu pushed the brazier aside, opened the chest, and reached in with a soft cloth. He carefully lifted the copper coin, cushioned on the cloth, revealing that its silver surface was coated with something yellowish. Zhu Dagun peeked inside the chest and didn’t see any pills of immortality, but Prince Lu did an excited dance. “It worked! It really worked! Look, this yellow stuff is called silver iodide. All I have to do now is scrape it off into a jar and put it somewhere dark. I can perform another magic trick with this: put this coin somewhere dark, expose it to light for about ten minutes, develop the image with mercury fumes, and fix it with saltwater. Once it’s rinsed and dry, the coin will be covered with a picture of this room, identical in every last detail! This is the Daguerreotype process, which takes advantage of silver iodide’s photosensitivity. But we’re storing up silver iodide for something else, so I’ll have to show you at a later date.”  “Without an artist, how can one obtain a picture?” Zhu Dagun asked, confused. “And . . . what miraculous powers does the yellow powder have? Does it impart health and sagehood on one who imbibes it?”  Prince Lu laughed. “It’s not that kind of magic. In my day, silver iodide had two main uses. One was photosensitivity, like I mentioned. The other, well, you’ll see.” He worked as he spoke, scraping the powder off the coin into a small porcelain bottle, before pulling off his mask and stretching. “That’s all for now. I’m done for the morning. I’ll send out the instructions for manufacturing silver iodide, and then I can rest. You haven’t eaten, right? We can eat together later. You’re tall and strong, and pretty good with your hands—it must be all that alchemy experience. I have some things I want to ask you, so don’t wander off. I’ll be right back.”  Prince Lu sat down at the text tray and began to type at a rattling pace. Now and then he cranked out a length of calligraphy paper and read it, nodding to himself. Zhu Dagun just stood there in the room, afraid to touch anything and accidentally break it, or trigger some mighty magic.  At this point, he finally remembered why he was there. He reached for his sleeve pouch, felt the copy of the Analects there, and took a deep breath. “Your Highness, there’s something that I don’t understand,” he said, looking down. “I hope you can advise your servant.”  “Go ahead, I’m listening.” Prince Lu was still at the text tray, cranking the spool of calligraphy paper, too busy to spare a glance.  Zhu Dagun asked, “Your Highness, are you Han or Hu?”  “Don’t be pretentious, call me Old Wang,” came the reply. “I’m Han. I grew up in Beijing’s Xichen District. My ma’s Hui Muslim, but I took after my ba. I may have played in the Niujie and Jiaozi neighborhoods as a kid, but I can’t live without pork, so no dice.”  Zhu Dagun had already learned to ignore Prince Lu’s incomprehensible ramblings. “If Your Highness is Han, why do you live in Jinyang instead of the southern lands?”  “You wouldn’t understand even if I explained,” said Prince Lu. “I’m Han, but I’m not a Han from your era. I know perfectly well that, of the Five Dynasties and Ten Kingdoms, Liang, Tang, Jin, Zhou, and even your so-called Great Han were founded by other ethnic groups, and most of your people are Hu too. But once my plan succeeds, I’ll be back at my point of departure, and this temporal node of your universe won’t have a thing to do with me, got it?”  Zhu Dagun took a step closer. “Your Highness, how are we going to defeat the Song army?”  “We can’t,” said Prince Lu. “We don’t have the soldiers or the food, and we can’t mass produce firearms. Flintlock muskets are easy to manufacture, but we don’t have nearly enough sulfur to make gunpowder. We scoured the city and only found a couple dozen pounds. We can’t do more than occasionally fire a cannon to give a scare. But that brings me to my next point. Though we can’t defeat the Song troops, we can hold out pretty easily. As long as Zhao Guangyi doesn’t find out how Liao is sending us grain under the surface of the water, Jinyang survives another day. Tying empty barrels to full barrels and sending them along the bottom of the Fen River is a trick you ancients would never think of.”  Zhu Dagun raised his voice. “But the commoners are hungry and weary, and the soldiers wail with pain and exhaustion! The longer Jinyang holds on, the more its tens of thousands of residents suffer, Your Highness!”  “Hey, good point.” Prince Lu turned on his stool. “Everyone else is delighted to work here—not only are they pardoned for their crimes, they can even earn some money. But you don’t sound like them. Let’s talk, then. I haven’t had anyone normal to talk to in months. It’s been”—he pulled out a piece of paper, took a look, and drew another X on it—“three months, seven and a half days since I was dropped here. I’ve got twenty-three and a half days before the observational platform automatically returns. The schedule will be tight, but judging from my current progress, I should be able to make it.”  Zhu Dagun understood only the faint longing for home that underlay his words. He immediately recited, “The Master said: as long as parents are alive, one should not journey far from them without method. When one’s father lives, observe one’s aspirations; when he does not, observe one’s actions; if in time they do not deviate from the father’s way one can be termed filial. Your Highness has long been away from your home and must miss your parents dearly. Foxes die with their heads pointing toward their burrow; crows feed their parents in their old age; lambs kneel before they drink from their mother’s teat; stallions will not mate with their dam—”  Prince Lu sighed. “Okay, we’re still not on the same frequency here. Can you shut up and listen?”  Zhu Dagun immediately shut up.  Prince Lu spoke slowly. “I’m sure you don’t know the alternate universe theory or quantum mechanics, so I’ll go over them briefly. My name is Wang Lu. I was an ordinary nerd, amateur writer of chuanyue1 novels, and professional time traveler. In my time, we’d perfected the multiverse theory, so that anyone could go to an agency, rent an observational platform, and go time traveling. At one time, people estimated the number of parallel universes overlaying each other to be around 10^(10^118), but more precise calculations later on indicated that, due to overlap between different diverged branches, only about three hundred quadrillion universes exist at any one time. Countless particle-level possibilities cause universes to endlessly emerge, split, merge, and disappear, and yet even the two parallel universes with the most differences are astonishingly similar on a physical level, even as their places on a timeline diverge further and further.  “In a way, this makes things boring, since humanity’s exploration of deep space remains stalled, and its understanding of the universe as a whole is very shallow. Even in the most advanced universe I’ve been to, humanity’s reach has gone no further than Alpha Centauri, just next door. But in another way, this makes things interesting, since with the invention of the wave function engine it means that we can step across to other parallel universes at our convenience. For topological reasons, the more similar the destination universe, the less energy it takes to travel there. The most advanced observational station we have can send travelers three hundred trillion universes away, though the commercially available equipment only has a maximum range of around forty trillion.”  Zhu Dagun kept nodding while he felt his sleeve pouch, inwardly debating whether to take out the dagger and persuade Prince Lu’s heart or take out the Analects and persuade his mind once he finished his raving. There was no one else in the room, creating a prime opportunity to make his move. It wasn’t that Zhu Dagun didn’t want to act promptly, but that he himself still felt somewhat undecided as to which esteemed personage he should act on behalf of.  Prince Lu picked up his teacup and took a sip, then continued. “I accepted a job from the Peking University history department, a research task to tally the population of the Sixteen Prefectures during the late Five Dynasties and Ten Kingdoms period. A parallel universe like yours is located toward the front of the timeline, which makes it an excellent place for historical observation.  “Don’t think just anyone can get a time travel license. You have to train systematically in quantum theory, computer operation, ground transportation, emergency drills, and more, and pass the test to get a job. If you want to lead tour groups, you have to take the Time Travel Tour Guide Examinations too. Due to the physical similarity between parallel universes, I activated the observational platform at Xuanwu Gate in Beijing to travel nine hundred billion forty-two universes and arrive here. By my calculations of revolution and rotation elements, I should have been able to arrive in You Prefecture. Who knew that my observational platform was getting long in the tooth? The wave function engine radiator boiled over, right in the middle of the trip! I had to pour in eight bottles of mineral water and a crate of Red Bull to get it to limp to the destination. The moment I arrived in this universe, the crown bar burst through the tank. That was the end of the engine. I crashed into a gully in Shanxi by the Fen River. My luggage, equipment, and spare fuel tanks were wiped out.  “It took me ten days to patch together the engine, only to discover all the fuel had leaked out. The bit left in the oil lines could hop me two or three universes over at most. What use would a few hours forward be?”  The sounds of shouting and fighting from outside grew louder. The Song army had begun another assault on East City gate. Prince Lu turned to glance at the report scrolling out above the text tray and typed a few characters himself. “Don’t worry.” He laughed. “We’ll take care of it as usual. I’ll move two bladder catapults over . . . Where was I? Ah, right, the wave function engine could just barely start, and raising the angular speed made the engine oil give off blue smoke like a tractor, but the main problem was that I didn’t have any fuel. Taking that census was of course out of the question, but even worse, since I hadn’t filed this private job with the Ministry of Civil Affairs’ Multiverse Administrative Office, I couldn’t just call the time police for help when they’d put me in jail for three to five years! If I wanted to get home, I needed some way to gather fuel. I didn’t have a choice but to hide my things in the gully and sneak into Jinyang.”  “Your Highness, you say you didn’t have any fuel, but isn’t the city full of fire-oil?” Zhu Dagun couldn’t resist interrupting. “Many carriages on the street burn fire-oil.”  Prince Lu sighed. “If only it combusted oil. Let me put it this way, the fuel tank didn’t hold real, physical fuel, but potential energy, the elastic potential between parallel universes. If I wanted to fill my tank, I needed to create a universe split. When a new universe split off as a result of some decision point, I’d be able to gather this escaped potential energy to power my return. This potential energy isn’t something intangible like entropy values. It’s more like when you snap a bamboo pole in two, and you hear the crack as it splits apart? I don’t understand it that well myself, but either way I had to create a big enough event to make the universe split. Now, how could I do this? Let’s take an example from history—on the fourteenth of the third month this year, a resident of Jinyang slipped from the parapets and fell to his death in the Fen River. The incident was witnessed by twenty people and recorded in minor history books. If, on the fourteenth of the third month, I grabbed his collar and saved his life, I’d create a change. But it wouldn’t be big enough. Out of the one hundred quadrillion universes where this event occurred, he was saved in one quadrillion of them even without me. In that moment, the parameters in one of those universes would change until it perfectly matched the universe we’re in, and the two universes would merge. Of course, you and I wouldn’t feel anything from where we stand, but the potential would decrease, and even remove fuel from my tank. To cause a new universe to split off, I have to create a big enough change, a change so big that no precedent exists in any one of the one hundred quadrillion universes past this point in the timeline. I managed to use the beat-up wave function computer to find a possibility, one that I could achieve without any modern equipment to help me.”  Zhu Dagun didn’t speak, only listened intently.  Prince Lu suddenly pulled open a drawer and took out a book. He read from it, “‘In the sixth month of 882 CE, the height of summer, Shang Rang led an army from Chang’an to attack Fengxiang. He had reached Yijun Camp when suddenly a great blizzard fell. Within three days, the snow was many feet thick. Thousands died or became frostbitten in the cold, and the Qi army retreated in defeat to Chang’an.’ Have you heard of this incident?”  “Huang Chao’s rebellion!” Zhu Dagun finally had an opportunity to add to the conversation. “Shang Rang was Grand Commandant of Qi. The story of the blizzard in the second year of Zhonghe is still oft told among the people. It’s recorded in the historical annals as well.”  “Exactly,” said Old Wang. “I’m a modern man, but I don’t have death rays or nukes or any kind of sci-fi weaponry, and I don’t have the Starship Enterprise or Macross to back me up. All I can do is use the scraps of knowledge I got from high school and college to alter this era as much as possible. It’s a historical fact that Song conquered Northern Han. In the vast majority of universes, the annals record that on the fourth day of the fifth month, the Song army took Jinyang and the Han ruler Liu Jiyuan surrendered. On the eighteenth day of the fifth month, Emperor Taizong of Song drove out all the city’s inhabitants and burned Jinyang to the ground. But here, I’ve already postponed these dates for more than a month. The Song army can’t stay here indefinitely; anyone can see that the primitive siege weapons of this era can’t break through the fortifications strengthened with my knowledge. Once the Song army retreats, history will be completely rewritten, and the universe will split, without a doubt!” He toyed with the little bottle of silver iodide and laughed delightedly. “And that’s without mentioning my new invention. This little thing is going to change history immediately and fill my observational platform’s fuel tank! The ancients believed in omens from the heavens more than anything. What could change history more than a snowstorm in the middle of summer?”  “Burn . . . Jinyang? Snowstorm?” Zhu Dagun said numbly.  “It’s easier to show than to explain! Follow me!” Prince Lu leapt to his feet and dragged Zhu Dagun by his sleeve to the room’s west wall. He pulled some mechanism, a hinge turned, and the entire wall suddenly fell outward to reveal a courtyard hidden among dense overhanging eaves. The blinding sunlight forced Zhu Dagun to squint; it took a few moments before he could clearly see the contents of the courtyard.  He was astonished. Laid out in the courtyard were many extraordinary things that he’d never seen before and didn’t know the names of. Several dozen East City Institute workers were laboring under the hot sun. They knelt to pay their respects when they saw the prince. Prince Lu smiled and waved a hand. “Continue. Don’t mind me.”  “We’re testing the hot air balloon,” Prince Lu explained, pointing at the workers in the middle of sewing cotton fabric. “I agreed to build an airship for the emperor so he can escape to Liao. An airship takes more time than this, but I’ll do what I can and build a balloon for now. When I came to Jinyang, I made a few flashy novelties and bribed some minor officials for an audience with the emperor. I told him I could make Jinyang impregnable for him, and he granted me the convenient title of Prince of Lu right on the spot. I have to repay that kind of generosity.”  They turned and came to a group of workers filling a cannon cast of black iron with gunpowder. “This cannon will be used to fire a cloud-seeding canister. Gunpowder isn’t strong enough a propellant, so we need the hot air balloon to lift the cannon into the air, and then fire it up at an angle. I’ve been keeping a close eye on the weather patterns lately. Don’t be fooled by how hot it is; the clouds that drift in from the Taihang Mountains every afternoon are full of cold air. By providing enough condensation nuclei at the right time, we can create a snowstorm out of nowhere!” Prince Lu grinned. “I sent the recipe over earlier. The chemical factory off-site is currently devoting all its resources to manufacturing silver iodide powder. It won’t be long before we can fill a cloud-seeding canister and load it into the cannon. We’ve already test-flown the hot-air balloon. All we have to do is wait for the right weather conditions!”  Zhu Dagun gazed up at the clear and fair sky. The sun shone like fire. The distant sounds of battle were fading; a magpie squawked from the eaves. A fire-oil carriage rumbled along a stone-paved road. The air smelled of blood, oil, and flatcakes. Zhu Dagun stood by the prince, unable to move, his mind in a muddle.  10.  The wall swung shut, returning the room to darkness. They ate a little. Prince Lu sent instructions to the city defense and the workshops through the internet, asking Zhu Dagun questions about alchemy as he worked. Zhu Dagun braced himself and spouted enough smooth-talk and nonsense to pass muster.  “Ah, I need to sleep. I pulled an all-nighter and I’m running out of steam.” Prince Lu stretched wearily and headed for the cot in a corner of the room. “Keep an eye out, will you? Wake me if there’s any news.”  “Yes, Your Highness.” Zhu Dagun bowed respectfully. He watched as Prince Lu lay down, pulled the brocade covers around himself, and soon began to snore. He let out a quiet breath and sat down, head spinning, to collect his chaotic thoughts.  Zhu Dagun didn’t understand everything Prince Lu had said, but he grasped the tone of his words clearly enough. The master of the East City Institute couldn’t care less about the Han dynasty or the people of Jinyang. He had come from a different land, and he would ultimately return there. He’d created his dazzling novelties and exotic toys to garner public support and earn money. He designed the internet to win over the scholar gentry and relay the East City Institute’s orders; he sold the fire-oil carriages, weapons, and fine wine to show goodwill toward the military; and the life-saving grain, deadly fire, and impossible snow were all, in the end, to further Prince Lu’s own selfish goals. Han Feizi had written, “Consider one who refuses to enter a dangerous place or fight in the army, who will not for the gain of all the people sacrifice even one hair on their leg . . . you have one who values life above all else.” Was Prince Lu not “one who valued life above all else?”  Something was fomenting inside of Zhu Dagun. His chest felt stuffed, his head swollen. His ears rang. He thought of what Ma Feng and Guo Wanchao, Liu Jiye, and the emperor had said. He thought of this state, this prefecture, this city, and the tens of thousands of living beings within. Liang, Tang, Jin, Zhou, and Han had taken the land in turn; Hu and Han were thrown together in this time of chaos. An inhabitant of this turbulent era, Zhu Dagun had once considered abandoning the brush for the sword and carve out some great undertaking. He’d settled in a quiet corner discussing philosophy all day long, not because he was lacking in strength or courage, but because he lacked for direction. The scholars frequently chatted of the grand principles of governing a state and bringing peace to the land. Zhu Dagun always thought that it was empty words, but what aside from their arrogant talk of the halcyon days of the Rule of Wen and Jing, the Restoration of Zhao and Xuan, the Golden Age of Kaiyuan, had they to while away their time? All he wanted was food, a bed, and a roof to sleep under; to spend his leisure time chatting and drinking; to be able to roll into bed after eating, express his aspirations online, visit the brothels when he had the money; to be at ease with the world. But in this era of chaos, to be at ease with the world in itself required swimming against the flow. Even a minor character like him had been dragged into a struggle for the survival of a country. At this moment, he held the fate of Great Han and the lives of everyone in the city in his hands. If he didn’t do something, how could he claim to be a scholar, one who spent twenty years filling himself with the words of sages?  Zhu Dagun pulled the fine steel dagger from his sleeve. He knew he couldn’t persuade Prince Lu because Prince Lu wasn’t a citizen of Han. Grand principles were a sham to him; only the six and three-tenths inches of steel in Zhu Dagun’s hand were real. In this moment, an idea floated into Zhu Dagun’s mind, perfect in three ways. He slowly unfolded his large frame and stood, a smile hovering on the corners of his mouth. He stepped soundlessly across the floorboards and reached the cot in a few steps—  “What the fuck are you doing!” Prince Lu snapped up, eyes wide and staring. “I got bitten by a mosquito and got up to burn some bug-repelling incense. What are you doing here with a knife? I’m going to call my memmmph”  Zhu Dagun had covered Prince Lu’s mouth solidly, setting the dagger at his pale, tender neck. “Don’t make noise and I’ll leave you a way out,” he murmured into the prince’s ear. “Earlier, I saw you use the internet to move the East City Institute’s city defense forces. You had a row of wooden movable type in your text tray. Give me the type blocks and tell me your passphrase, and I won’t kill you.”  Prince Lu was a prudent man. He nodded frantically, his forehead beaded all over with sweat. Zhu Dagun loosened his fingers, allowing a gap. Prince Lu gasped and panted as he took the movable type of red-colored wood from his pocket and threw them on the cot. “There’s no passphrase,” he stammered. “My orders pass through a special line straight to the city defense camps and the workshops. No one can fake it . . . Why are you doing this? I’ve protected Jinyang and invented countless novelties for every facet of life for soldiers and civilians alike to enjoy. Everyone in the city loves me. Where have I wronged Northern Han, wronged Taiyuan, wronged you?”  Zhu Dagun laughed mirthlessly. “Empty words. You look out only for yourself, while I plan for the benefit of a city’s worth of people. First, I’ll order the East City Institute to stop the defense. Once the fire-dragons, pillars, and catapults have stilled, General Guo Wanchao will open the gates and welcome the Song army in.  “Second, Minister Ma Feng is waiting inside the palace. Once the city gates are open and the army is thrown into panic, he will persuade the ruler Liu Jiyuan to come out with his family and surrender. But I will take the emperor and help him escape in the chaos, aboard the so-called hot air balloon to the Khitans.  “Third, I will bind you and give you to Zhao Guangyi, trading you for the lives of the city’s inhabitants. The Song army has besieged the city for three months without success; the Song ruler must be filled with hate for you, the inventor of the city’s defensive machines. If I bring you to him bound hand and foot, he is certain to be greatly relieved and spare Jinyang from the sword. In this way, I will not fail Guo Wanchao, Liu Jiye, or the emperor, or the people in danger of terrible suffering. I can achieve both benevolence and justice!”  Prince Lu gaped. “What kind of crappy plan is that? Whose faction are you in? You’ve cut everyone else a sweet deal, but I get thrown to the wolves, huh? Do you have to be so extreme? Let’s talk it out; everything is open to discussion. All I wanted was to gather a bit of energy and go home. Does that make me a bad person? Did I do anything wrong? Did I do anything wrong?”  “You did nothing wrong. I did nothing wrong. No one did anything wrong. So whose fault is it?” Zhu Dagun asked.  Old Wang didn’t have a chance to come up with an answer to this profound philosophical question before the dagger hilt struck his forehead, knocking him unconscious.  11.  Wang Lu slowly regained consciousness, just in time to see the hot air balloon slowly rise above the roof of the main building of the East City Institute. The balloon was sewn from one hundred and twenty-five panels of thick lacquered cotton, with a basket woven from bamboo. The basket held a fire-oil burner and the heavy pig iron cannon. Three or four people were squeezed into the basket in clear disregard of weight capacity, but as the throttle opened and the flames roared, hot air swelling the balloon, the massive flying object continued its swaying ascent. The dark brown lacquer gleamed in the setting sun, the balloon’s long shadow stretching across Jinyang.  “It worked . . . it worked!” Wang Lu sat right up, laughing skyward. The north wind was blowing, the summer heat dissipating in its chill. Clumps of water-vapor-rich clouds were gathering in the sky, perfect weather for artificially inducing snow. The time traveler watched the balloon as it rose higher and higher into the heavens, muttering, “Not enough not enough not enough, two hundred meters higher and then it can fire, a little more, a little more . . . ”  He tried to stand and find a better angle to observe from, only to realize that he couldn’t move his legs. He looked down and discovered that he was tied onto a fire-oil carriage parked in the middle of the road. The driver lay slumped over in his seat, dead. He looked farther and saw that the road was covered in piles of corpses—Han soldiers, Song soldiers, and Jinyang civilians, all dead in a variety of ways. Blood flowed down the roadside ditch, moistening yellow earth that had lain dry for months. Crying, screams, and the sounds of fighting came from the distance, like the roll of thunder on the horizon. And yet Jinyang seemed abnormally still, except for the crows circling and gathering in the sky.  “Fuck, what happened?” Wang Lu yelled, trying to twist free. His hands and feet had been soundly tied; movement made the coarse fibers slice agonizingly into his flesh. The prince let loose a string of curses, panting roughly, afraid to struggle further. At this time, a cavalry troop shot down the street, their armor and uniform marking them as Song. The riders didn’t even glance at Wang Lu as their steeds galloped toward the East City Gate, trampling the corpses. A few snatches of conversation lingered in the air.  “—We’re too late! What do we do if our arrows can’t hit it?”  “—It’s not a south wind, but a north wind. It’ll never reach Liao. It’ll only be blown southward—”  “—Will we be blamed?”  “—Otherwise we’d be too late!”  “Hey! What are you doing! Don’t leave me here!” Wang Lu yelled wildly. “Tell your master I know physics and chemistry and mechanical engineering! I can build you a steampunk Song Empire! Hey, wait! Don’t go! Don’t go . . . ”  The hoofbeats faded. Wang Lu looked up despairingly. The hot air balloon was now a small dot high in the sky, drifting southward with the north wind. Bang. He saw the puff of white smoke rise a moment before the sound reached him. The cannon had fired.  Wang Lu’s eyes filled with the light of his last hope. He wrenched his head down, bit his clothing, and tore it aside, revealing the skin of his chest. A line of light glowed beneath his left collarbone: the fuel gauge for the observational platform. At the moment, it displayed red to indicate low power. The wave function engine required at least thirty percent to carry him back; snow in July would create a universe split that would fill his tank to at least fifty. “Come on.” He was crying, bleeding, talking to himself with gritted teeth. “Come on come on come on and give me a big fat blizzard!”  Each gram of silver iodide powder could generate more than ten trillion particles; five kilograms was enough to create all the ice crystals for a blizzard. It seemed ridiculous, that someone could artificially create snow in an era of such low technology, but perhaps the time traveler’s crazed prayer had been fulfilled: the clouds began to gather in the sky, roiling, pitch-black and restless, reducing the setting sun behind them to a thread of golden light.  “Come on come on come on!” Wang Lu roared toward the sky.  A rumble of thunder resonated to the horizons. First, rain fell, cold rain mixed with ice crystals. But as the ground temperature continued to drop, the rain became snow. A single snowflake drifted down, landed on the tip of Wang Lu’s nose, and instantly melted from his body heat. But right after it came a second, then a third, heralding their quadrillions of compatriots.  The drenched time traveler laughed heavenward. It was a proper blizzard in July, the snow coming down in clumps; he couldn’t wait to see the palaces, buildings, willows, and walls painted powder white. Wang Lu looked down and saw the gauge on his chest glowing green. The engine’s energy forecast had crossed the baseline; the moment this universe split into two, the observational platform would collect the energy and automatically activate. In a moment too brief to be assigned a unit, it would send him home to his warm 900 square foot apartment near the Beiyuan neighborhood roundabout, Tongzhou District, Beijing.  “This will be legendary,” Wang Lu said to himself, shivering. “I’m going to go home, find a less dangerous job, find a wife, squeeze my way onto the subway every day to go to work, and do nothing but play video games when I get home. I’ve had enough adventure for a lifetime, truly . . . ”  At the rate the snow was accumulating, it would have taken less than an hour to bury Jinyang under a yard of white. But right at that moment, twenty dragons of fire rose from the four directions.  From the dozen gates of West, Central, and East City, the fire-dragon chassis were spraying pillars of flame, accompanied by countless pig bladder catapults hurling fireballs. They were weapons of city defense he’d built with his own hands, weapons the Song army had feared more than any other.  “Wait a . . . ” The light went out of Wang Lu’s eyes. “No, are they burning Jinyang down anyway? At least they could wait a little, until this snow’s done . . . wait, wait—”  Thick, viscous fire-oil sprayed everywhere; flames roared heavenward. The fires spread with a speed beyond anyone’s imagination. Jinyang had been long under drought, and the precipitation called by the time traveler hadn’t the chance to soak into tinder-dry timbers.  The fire in West City began in Jinyang Palace, engulfing Xiqing Ward, Guande Ward, Fumin Ward, Faxiang Ward, and Lixin Ward in turn in a sea of flames. The fire in Central City set the great water wheel alight first, then burned west toward Xuanguang Hall, Renshou Hall, Daming Hall, Feiyun House, Deyang Hall. The East City Institute soon transformed into a brilliant torch. The snowflakes whirling above vaporized without a trace before they had a chance to land. The green light on the time traveler’s chest faded. He howled his grief and agony, “Motherfucker, I was so close, so close!”  Bathed in fire, Jinyang lit dusk into daytime. The air boiled in the inferno; a scarlet dragon of flame wheeled upward, dispersing the clouds in an eyeblink. No one saw the fallen snow; they only saw flames that touched the heavens. The ancient city, first built in the Spring and Autumn Era, more than one thousand four hundred years before this moment, wailed distantly in the flames.  Jinyang’s fortunate survivors were being driven northeast by the Song army, looking back with every step, their weeping loud enough to shake heaven. The Song ruler Zhao Guangyi sat astride his warhorse, gazing at the flames of distant Jinyang and the figures kneeling before him.  He said, “When you’ve captured the pretend-emperor Liu Jiyuan, come and see me. Do not harm him. Guo Wanchao, I confer upon you the title of Militia Commander of Ci Prefecture. Ma Feng, I name you Supervisor of Imperial Construction. You two have done me service, and I hope you will turn all your ingenuity and wisdom to my Great Song from today onward. Liu Jiye, why do you refuse to surrender when all the others have? Do you not know the parable of the praying mantis who attempted to block the passage of a chariot?”  Liu Jiye, his hands bound, turned to kneel northward. “The ruler of Han has yet to surrender,” he said stubbornly. “How can I surrender first?”  Zhao Guangyi laughed. “I’ve long heard of Liu Jiye of the East Bank. You live up to your reputation. You can surrender once I capture the little emperor. You should revert to your original name of Yang. Why should a Han try to protect a Hu? If you want to fight, you should turn and fight the Khitans, don’t you think?”  Having finished talking to these men, Zhao Guangyi rode forward a few steps. He bent down. “What do you have to say?”  Zhu Dagun knelt on the ground, afraid to raise his head. From the corners of his eyes, he could see the raging flames on the horizon. “I claim no accomplishment,” he said, shaking. “I only ask that I be judged to have done no trespass.”  “Very well.” Zhao Guangyi waved his whip. “Posthumously grant him the title Duke of Tancheng, with a feifdom of thirty miles square. Chop off his head.”  “Your Imperial Majesty! What wrong did I commit?” Zhu Dagun stood up in shock, flinging aside the two soldiers next to him. Four or five more tackled him. The executioner raised his sword.  “You did nothing wrong. I did nothing wrong. No one did anything wrong. Who knows whose fault it is?” said the Song ruler indifferently.  The head rolled to a stop; the large frame thudded to the ground. The copy of Analects fell from Zhu Dagun’s sleeve pocket and into the puddle of blood, soaking through, until not a single character could be distinguished.  Everything the time traveler had created burned to ashes with Jinyang. After a new city was built nearby, people gradually came to think of those days of wonders as an old dream. Only Guo Wanchao would sometimes take out the “Ray-Ban” sunglasses while drinking with Zhao Da in the Ci Prefecture army camp. “If he’d been born in Song, the world would be a completely different place, huh.”  The Song conquest of Northern Han received only a brief description in the History of the Five Dynasties. One hundred sixty years later, the historian Li Tao at last wrote the great fire of Jinyang into the official histories, but naturally there were no mentions of a time traveler.  “In [979 CE], the emperor visited Taiyuan from the north through Shahe Gate. He dispatched the residents in groups to the new governing city of Bingzhou, setting fire to their homes. Children and the elderly did not reach the city gates in time, and many burned to death.”  —Extended Continuation of Zizhi Tongjian, Book 20    Footnote  1 - Chuanyue is an enormously popular Chinese genre similar to time travel, but with its own distinct tropes. Typically, the protagonist is from the modern day and travels into the historical past (or a secondary world version of the historical past,) often but not always through reincarnating into the body of someone of that era. Their anachronistic knowledge and upbringing sets them apart from others and allows them to break the status quo.  Originally published in Chinese in New Science Fiction, January 2014.    Translated and published in partnership with Storycom.  Born in 1981, Zhang Ran graduated from Beijing Jiaotong University in 2004 with a degree in Computer Science. After a stint in the IT industry, Mr. Zhang became a reporter and news analyst with Economic Daily and China Economic Net, during which time his news commentary won a China News Award. His stories have won numerous Gold and Silver Chinese Nebula Awards, and three Galaxy Awards for Best Novelette. He runs a coffee shop in southern China and writes in his spare time. The Windy City, his short story collection, was published in 2015.  Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.  Born in China and raised in the United States, Carmen Yiling Yan was first driven to translation in high school by the pain of reading really good stories and being unable to share them. Since then, her translations of Chinese science fiction have been published in Clarkesworld, Lightspeed, and Galaxy’s Edge, as well as numerous anthologies. She graduated from UCLA with a degree in Computer Science, but writes more fiction than code these days. She currently lives in the Midwest.", "text": "21340 words, novella\nThe Snow of Jinyang\nTranslators’ Note\nThis story is an alternate history and features events that would have been familiar to its original Chinese audience. To help set the scene for those less familiar with this period of history, we provide the following background information:\nJinyang was an ancient city located in modern-day Shanxi Province, China. This story takes place in the 10th century CE, during the late Five Dynasties and Ten Kingdoms period, when the land we think of as China today was divided among multiple independent states. Jinyang was the capital of a state that called itself Han—or “Great Han,” though modern histories usually call it the “Northern Han.” (The name of the state should not be confused with the original Han Dynasty, which fell in the 2nd century, or the Han ethnic group. The ruling family of the Northern Han was ethnically Shatuo, but had the same surname, Liu, as the rulers of the Han Dynasty. It was common for a regime to claim descent and take the name of a prior dynasty to add legitimacy.)\nHistorically, the Northern Han survived for years while losing large swaths of territory to other states until it was just the single city of Jinyang. In 979 CE, the Song Emperor Zhao Guangyi finally captured Jinyang after a long siege, thereby completing the task of unifying China. Zhao then razed Jinyang to the ground to prevent future rebellions. Today, the city of Taiyuan stands near its ruins.\nThis story starts out in 979 CE with Jinyang under siege by the Song army . . .\n1.\nWhen Zhao Da stormed into Xuanren Ward with his men, Zhu Dagun was in his room on the internet. Had he any experience dueling wits with the government, he’d surely have realized that something was wrong in time to put on a better show.\nIt was three quarters of the way into the hour of the sheep, after lunch but well before dinner, naturally a fine time for business in the brothels of Xuanren Ward. Powder and perfume steamed in the sun; gaudy kerchiefs dazzled the eyes of passersby. Snatches of music drifted through two sets of walls from Pingkang Ward, on the opposite side of West Street, where the licensed courtesans of the Imperial Academy entertained blue bloods and VIPs. But the sisters of Xuanren Ward held their neighboring colleagues in contempt. They thought all that training as unnecessary as pulling down your pants to fart—the end result, after all, was still the same creak-creak-creak of a bed frame. Drink and gamble to liven things up, certainly, but why bother with the singing and plinking and bowing and piping? Days in the Xuanren Ward never lacked for the din of price-haggling, bet-placing, and bed frames creak-creaking. The hubbub had become so much a part of the place that when residents happened to spend the night elsewhere in Jinyang, they found those quieter neighborhoods utterly lacking in vitality.\nThe moment Zhao Da’s thin-soled boot touched the ward grounds, the warden in bowing attendance at the gate sensed that something was off. Zhao Da visited Xuanren Ward three or four times every month with his two skinny, sallow-faced soldier boys, and every time he walked in blustering and walked out bellowing, as if he felt he had to yell until his throat bled to really earn the monthly patrol salary. But this time, he slipped through the gates without a sound. He made a few hand gestures in the direction of the warden, as if anyone except himself understood them, and led his two soldier boys tip-toeing northward along the walls.\n“Marquess, hey, Marquess Yu!” The warden chased after him, waving his arms. “What are you doing? You’re scaring me to death! Won’t you rest your feet and have some soup? If you need a—um—‘bonus’ or a pretty girl, just say the word—”\n“Shut up!” Zhao Da glowered at him and lowered his voice. “Stand against the wall! Let’s get this straight: I have a warrant from the county magistrate. This is out of your hands!”\nThe terrified warden stumbled back against the wall and watched Zhao Da and his men creep away.\nShivering, he pulled over a nearby child. “Tell Sixth Madam to clear out. Quick!” The snot-nosed urchin bobbed his head and hightailed it.\nIn less time than it took to burn half a stick of incense, two hundred and forty shutters clattered over the windows of the thirteen brothels of Xuanren Ward. The noise of price-haggling, bet-placing, and bed frames creak-creaking disappeared without a trace. Somebody’s child started to wail, only to be silenced instantly by a resounding slap. A swarm of patrons still adjusting their robes and hats fled out the back, darting through gaps in the ward walls like startled rats to vanish into Jinyang’s streets and alleys.\nA crow flew by. The guard outside the gate drew his bow and aimed, his right hand groping for an arrow, only to discover that his quiver was empty. Resentfully, he lowered the bow. The rawhide bowstring sprang back with a twang that made him jump. Only then did he realize that his surroundings had descended into total silence, so that even this little noise startled more than the hour drums at night.\nThat Zhu Dagun, resident of the ward for the last ten years and four months, failed to notice Xuanren in its busiest afternoon hours had plunged into a silence more absolute than post-curfew could only be attributed to remarkable obliviousness. Only when Zhao Da kicked down the door to his room did he start and look up, realizing that it was time to put on the show. So he bellowed and hurled a cup half-filled with hot water smack into Zhao Da’s forehead, following it up by knocking over his desk, sending the movable type in his type-tray clattering all over the floor.\n“Zhu Dagun!” Zhao Da yelled, one hand over his battered forehead. “I have a warrant! If you don’t—”\nBefore he could finish, a fistful of movable type slammed into him. Made of baked clay, the brittle, hard type blocks hurt something fierce when they struck his body, and shattered into dust as they hit the ground. As Zhao Da leapt and dodged; clouds of yellow dust filled the room.\n“You’ll never catch me!” Zhu Dagun opened fire left and right, hurling type blocks to hinder his foes while he threw the south window open, preparing to jump out. One of the young soldiers charged out of the yellow fog, chains raised. Zhu Dagun executed a flying kick; the boy cannonballed through the air and landed against a wall. The chain fell from his hands as nose-blood and tears flowed freely.\nWhile Zhao Da and company continued to grope blindly about, Zhu Dagun vaulted out the window into freedom. Then he smacked his forehead, recalling the charge from Minister Ma Feng: “You must be caught, but not easily. You must resist, but not successfully. Lead them on; play the coquette. The show must not appear scripted.”\n“Lead them on . . . lead them on my ass . . . ” Zhu Dagun steeled himself and barreled ahead, carefully tripping his right foot with the left just as he passed the middle of the courtyard. “Aiya!” he cried as he tumbled to the ground with a meaty slap; the water in the courtyard cisterns sloshed from the impact.\nTracking the commotion, Zhao Da ran outside. “Serves you right for running!” he guffawed at the sight, still nursing his bruised forehead. “Chain him up and bring him to the jail! Gather up all the evidence!”\nStill bleeding from his nose, the soldier boy stumbled out of the room. “Chief!” he bawled. “He smashed that tray of clay blocks. What other evidence is there? Since I spilled blood today, I should eat rich white flour food tonight to get better! My ma said that if I enlisted with you I’d have steamed buns to eat, but it’s been two months and I haven’t seen the shadow of a bun! And now we’re trapped in the city, I can’t even go home. I don’t know if my ma and da are still alive—what’s the point of living?”\n“Fool! The type blocks may be gone, but we still have the internet lines! Get some scissors and cut them loose to bring back with us.” Zhao Da bellowed. “Once we get this case sewn up, never mind steamed buns, you’ll have mincemeat every day if you want!”\n2.\nThe fates of life’s bit players are often changed by a single word from the mighty.\nIt was the sixth day of the sixth month, in the first dog days of summer. The sun hung high above the northlands, the streetside willows limp and wilting under its glare. There shouldn’t have been a wisp of breeze, and yet a little whirlwind rose out of nowhere, sweeping the street end to end and sending the accumulated dust flying. The General of the Cavalry, Guo Wanchao, rode his carriage out of Liwu Residence and proceeded along the central boulevard toward the south gate for the better part of an hour. Being the ostentatious sort, he naturally sat high in the front, stamping on the pedal so the carriage made as much din as possible. This carriage was the latest model from the East City Institute, five feet wide, six feet four inches tall, twelve feet long, eaves on all four sides, front- and rear-hinged doors, with a chassis constructed from aged jujube wood and ornamented with a scrolling pattern of pomegranates in gold thread inlay. Majestic in air, exquisite in construction, the basic model’s starting price was twenty thousand copper coins—how many could afford such a ride in all of Jinyang, aside from a figure like Guo Wanchao?\nThe four chimneys belched thick black smoke; the wheels jounced along the rammed-earth street. Guo Wanchao had meant to sweep his cool gaze over the goings-on of the city, but due to the heavy vibrations, the passersby saw it as an amiable nod to all, and so all came over to bow and return the greeting to the General of the Cavalry. Guo Wanchao could only force a laugh and wave them off.\nA massive cauldron of boiling water sat in the back of the carriage. Despite hours of explanation filled with fantastical jargon by the staff of the East City Institute, the general still didn’t understand how his vehicle functioned. Apparently it used fire-oil to boil the water. He knew that the stuff came from the southeast lands, and would burn at a spark and burn even harder on water. Defenders of a city would dump it on besiegers. This stuff boiled the water, and then somehow that made the carriage move. How was that supposed to work?\nRegardless, the cauldron rumbled and bubbled, such that the armor at his back fairly sizzled from the radiating heat. He had to steady his silver helm with one hand so that it wouldn’t slip over his eyes every few bone-jarring feet. The General of the Cavalry had only himself to blame; inwardly, he bemoaned his decision to take the driver’s seat. Fortunately, he was approaching his destination. He took out his pair of black spectacles and put them on his sweating, greasy face as the carriage roared past streets and alleys.\nA left turn, and the front gate of Xiqing Ward lay straight ahead. This was an era of degeneracy, insolence, and the collapse of the social order, to be sure: the residence walls were so full of gaps and holes that no one bothered to use the front gate. But Guo Wanchao felt that a high official ought to behave in a manner befitting the importance of his position. It just didn’t look proper without servants and guards leaping to action on his behalf.\nBut no one came to the ward gate to greet him. Not only was the warden missing, it seemed that the guards were napping in some hidden corner as well. Ancient scholar trees and cypresses lined the street, providing shade everywhere except in front of the completely barren front gate. It didn’t take long before Guo Wanchao, waiting in his stopped carriage, was panting and dripping sweat like rain.\n“Guards!” he yelled. There was no response, not even a dog barking in acknowledgment. Furious, he jumped off the carriage and stormed into Xiqing Ward on foot. The residence of Minister Ma Feng was just south of the gate. Without bothering to speak to the doorkeeper, he shoved open the door to the minister’s residence and barged in, circling around the main building to head for the back courtyard. “Surrender, traitors!” he bellowed.\nPandemonium broke out. In a flash, the windows burst open front and back. Five or six escaping scholar-officials fought to escape by squeezing through the narrow openings, but only succeeded in tangling their flailing limbs and tumbling into a heap.\n“Aiya, General!” Potbellied old Ma Feng had crept to the door and was peeking out the seam. He put a hand over his heart and thanked heaven and earth. “You mustn’t play this kind of trick on us! Everyone, everyone, let’s all go back inside! It’s just the General, nothing to be afraid of!” The old man had been so startled that his cap had fallen off, leaving his head of white hair hanging like a mop.\n“Look at you!” Guo Wanchao smirked, an expression somewhere between amusement and ire. “How are you going to plot treason with so little courage?”\n“Shhhh!” Old Ma Feng was given a second fright. He scurried over, took Guo Wanchao’s hand and dragged him inside. “Careful! The walls out here aren’t so thick . . . ”\nThe whole gang trooped back inside, latched the door, pressed the battered window panels back into their frames as best as they could, and gingerly took their seats. Minister Ma Feng pulled General Guo Wanchao toward a chair, but Guo shook him off and stood right in the middle of the room. It wasn’t that he didn’t want to sit; rather, the archaic armor he’d worn for its formidable appearance had nearly scraped his family jewels raw on the bumpy journey.\nOld Ma Feng put on his cap, scratched at his grizzled beard, and introduced Guo Wanchao. “I’m sure everyone has seen the general at court before. We’ll need his help to accomplish our goals, so I secretly invited him here—”\nA tall, rangy scholar in yellow robes interrupted. “Why does he wear those black spectacles? Does he hold us in such contempt that he covers his eyes to spare himself the sight?”\n“Aha, I was waiting for someone to ask.” Guo Wanchao took off the black lenses nonchalantly. “It’s the latest curiosity from the East City Institute. They call it ‘Ray-Ban.’ They allow the wearer to see normally, and yet be spared the glare of the sun. A marvelous invention!”\n“It hardly seems right for a man interested in enlightenment to reduce the reach of light,” grumbled the yellow-robed scholar.\n“But who says banning rays is all I’m capable of?” Guo Wanchao proudly drew a teak-handled, brass-headed object from his sleeve. “This device, another invention from the East City Institute, can emit dazzling light that pierces darkness for a hundred paces. The staff from the institute didn’t give it a name, so I call it ‘Light-Saber.’ The banisher of rays and the sword of light! Brilliant, eh? It was a match made in heaven, haha . . . ”\n“Disgusting ostentation!” shouted a white-robed scholar as he wiped at the blood on his face with his sleeve. He had run too quickly earlier and tripped, and the cut on his forehead had bled all over his delicate scholar’s face, encrusting his fair skin with blotches the exact color of farmland mud. “Ever since the East City Institute was established, our proud State of Han has fallen further by the day! We’ve been under siege for months; the people are full of fear and dread. And your kind still revels in such, such—”\nMa Feng hurriedly tugged at the scholar’s sleeve, attempting to smooth things over. “Brother Thirteenth, Brother Thirteenth, please quell your anger. Let’s take care of business first!” The old man made an unhurried patrol of the room, drawing the curtains and carefully covering up the cracks in the windows. After a phlegmy cough, he took out a three inch square of bamboo paper from his sleeve and displayed it to his audience, who saw that it was covered with characters the size of gnat’s heads.\nMa Feng began to read in a low voice. “Sixth month of the sixth year of the Guangyun Era. Great Han is weak and benighted, and the fires of war rage in the twelve provinces around us. We have fewer than forty thousand households, and our peasants cannot produce enough to equip our soldiers with strong armor and weapons. Beset by droughts and floods, our fields lie bare while the wells are exhausted, and our granaries and stores are empty. Meanwhile we still must pay tribute to Liao in the north and guard against mighty Song to the south, stretching the treasury beyond its capacity. The peasants have no food, the officials have no pay, the roads are lined with those dying of starvation, the horses have no grass to graze, the state is poor and its people are piteous! Woe is the land! Woe is Great Han!”\n“Woe,” the roomful of scholars lamented in synch; then, they immediately chorused, “Well said!”\nBut Guo Wanchao glared at the speaker. “Enough of this flowery oratory! Get to the point!”\nMa Feng took out a brocade handkerchief and wiped the sweat from his forehead. “Yes, yes, there no need for me to continue reading from the formal denunciation. General, you know well that after such a long siege by the Song army, Han is at the end of its strength, while the Song ruler Zhao Guangyi has made the conquest of the city a matter of personal honor. His edict declared that ‘Han has long disobeyed the will of the rightful ruler, acted heedless to the right way, and governed the people ruinously. For the sake of the land and the people, I personally come to pacify Han in the name of justice.’\n“Zhao Guangyi is known for his vicious, vengeful nature. Have you not seen how the King of Wuyue pledged his territories to Song voluntarily and was made a prince, while the ruler of Quan and Tang gave up his lands only after he saw the Song army at his gate, and was thus made a mere regional commander? By now, Jinyang has been under siege for nearly ten months. Zhao Guangyi is beyond furious. Once the city falls, the grandeur of the title he’s waiting to bestow our Han emperor will be the least of our concerns. The whole city will suffer the Song ruler’s rage! You won’t find an unbroken egg in a nest that has tumbled from a tree. General, you mustn’t let our people perish in unimaginable suffering!”\nGuo Wanchao said, “I’ll be honest with you: we military officers haven’t been paid in half a month either. The footsoldiers whimper with hunger all day long. If we scrape away all your fancy allusions and circumlocutions, what you mean to say is that our little emperor Liu Jiyuan won’t be able to sit on his throne long anyway, so we might as well surrender to Song, am I correct?”\nInstantly, the scholars jumped out of their seats in uproar, shouting curses and instructing him of the Confucian duties of ruler and subject, father and son, the respect due to a subject reciprocated by the loyalty due to a ruler, so on and so forth, until Ma Feng was shaking all over with fear. “Everyone! Everyone! The neighbors have ears, the neighbors have ears . . . ”\nWhen the room had finally quieted, the old man hunched his shoulders and rubbed his hands together anxiously. “General, please understand that we’re aware of our duty of loyalty to the throne. But if the ruler doesn’t do his part, how can the subjects be expected to do theirs? If the emperor is unwise in his governance, we have no choice but to overstep our bounds! The first possibility ahead of us is that the city falls and the Song army slaughters us all. The second is that the Liao army arrives in time to drive away the Song, in which case Han will become nothing more than Liao territory. The third is that we open the gates and surrender to Song, ensuring the survival of Jinyang’s eight thousand six hundred households and twelve thousand soldiers, and preserving the bloodline of the imperial family. You too understand the superior choice, General! At least Song follows the same customs and speaks the same language as us, while Liao is Khitan and Tatar. It’s better to surrender to Song than let Liao enslave us! Our descendants might curse us for cowards and traitors, but we can’t become the dogs of the Khitan!”\nHearing this speech, Guo Wanchao had to revise his opinion of the old man. “Very well.” He gave a thumbs up. “You’re a righteous man indeed to make even surrender sound so fine and just. Tell me your plan, then. I’m listening.”\n“Yes, yes.” Ma Feng gestured for everyone to resume their seats. “Ten years ago, when the previous Song ruler, Zhao Guangyi’s elder brother, was invading Han, Military Governor Liu Jiye and I wrote a memorandum to the emperor begging him to surrender. We were whipped and driven out of court. But today, the emperor spends his days drinking and feasting, careless of the matters of state, a perfect opportunity for us to act. I’ve already secretly contacted Inspector Guo Jin in the Song army. If you can open the Dasha, Yansha, and Shahe Gates, General, the Song will accept our surrender.”\n“What about our little emperor, Liu Jiyuan?” asked Guo Wanchao.\n“Once he sees that no other options are left to him, he’ll wisely surrender too.” Ma Feng answered.\n“Good enough. But have you considered the most important problem? What are we going to do about the East City Institute?” Guo Wanchao looked around the room. “The prince of East City has people on all the city walls, gates, and fortifications, and they control all the defense mechanisms. If the prince doesn’t surrender, the Song army won’t be able to get in even if we open the gates.”\nThe room fell silent. “The East City Institute?” The white-robed scholar sighed. “If it weren’t for Prince Lu’s antics, perhaps Jinyang would have long since fallen . . . ”\nMa Feng said, “We’ve decided to send a representative to persuade Prince Lu toward the path of reason.”\n“And if it doesn’t work?” asked Guo Wanchao.\n“Then we send an assassin and get that fake prince out of the way with one stroke.”\n“Easier said than done, old man,” said Guo Wanchao. “The East City Institute is heavily guarded. With all his strange devices, one might die before getting so much as a glimpse at Prince Lu’s face!”\nMa Feng said, “The East City Institute is located right next to the prison. All of the prince’s subordinates are criminals recruited from there. All we have to do is plant someone in the prison, and he’ll end up next to Prince Lu for certain.”\n“Do you have candidates? One to persuade, another to kill.” Guo Wanchao swept his gaze around the room. The scholars avoided his eyes, focused inward, and began reciting the Thirteen Confucian Classics under their breaths.\nGuo Wanchao smacked his forehead. “Wait, I have a candidate. He’s a scribe from your Hanlin Academy, an old acquaintance of sorts, a Shatuo who goes by a Han surname. He’s a middling scholar, but he’s strong. He’s the sort of muddled self-righteous fool who likes to spend his days complaining on the internet. Let’s give him a little money, then hand him a knife and deliver him a speech like the one you gave me. He’ll happily do what we want.”\nMa Feng clapped his hands. “Excellent! We just need to make sure he has a convincing reason for being thrown in jail so the East City Institute doesn’t get suspicious. Too severe a crime and he won’t be leaving the dungeon. But it can’t be too light, either. At the minimum it needs to justify shackles and chains.”\n“Haha, that’s not a problem. This fellow spends all his time spewing unsought opinions and sowing slander online. His crime is ready-made.” Guo Wanchao gripped the armor at his crotch with one hand and turned to leave. “Well, keep today’s talk a secret between heaven, earth, you, and me. I’m off to find an internet monitor. I’ll bring the fellow over later. We’ll talk more next time. Farewell!”\nThe general’s armor clanged as he swaggered out of the room, the contemptuous gazes of the scholars bouncing harmlessly off the backplate. Outside, the fire-oil chariot began its deafening rumble. Ma Feng wiped his sweaty face and sighed. “I do hope that taking care of the East City Institute will really be this simple. Our lives are at stake, everyone. We must act with caution! Caution!”\n3.\nZhu Dagun didn’t know which magistrate had dispatched his captors, but as Minister Ma Feng had told him, the Department of Justice Penitentiary, the Taiyuan Circuit Prison, the Jinyang County Prison, and the Jianxiong Military Prison were all the same nowadays. Who was to blame but a government of such staggering incompetence that it managed to lose all twelve of its prefectures, with only the lone city of Jinyang left under its rule?\nAs the soldiers dragged him through Xuanren Ward in chains, many curious gazes followed him through the cracks in the brothels’ boarded up doors. Who among the sisters, clients, and brothel keepers could fail to recognize the penniless scholar? Here was a scribe of the Hanlin Academy, living in the red-light district of all places. Perhaps it would be understandable in a man of passions, but despicably, he had not patronized the sisters even once in all these years. Every time he walked by, he would cover his eyes with his sleeve and quicken his steps, muttering “Sorry! Sorry!” One wondered if he was more embarrassed by the thought of his ancestors seeing his current circumstances, or by the thought of the Xuanren girls seeing whatever he hid in his pants.\nOnly Zhu Dagun knew that the only thing he was ashamed of was his wallet. With the arrival of the Song army, the Hanlin Academy had cut off his monthly stipend. In the three months of siege, he had received only four pecks of rice and five strings of coins as remuneration for his writing. They called them hundred-strings, but he counted only seventy-seven lead coins on each of them. If he spent a night in the House of Warm Fragrance, he’d be eating chaff for the rest of the month. Besides, he had to pay for internet. He’d chosen his address not only for the cheap rent, but also for the convenience of the network. It had a network management station right on top of the back wall. If anything went haywire, all he had to do was kick the ladder and yell upward. The internet fee was forty coins a month, plus a few more to keep the network manager friendly. Outspending his income was a negligible concern when he couldn’t live a day without the internet.\n“What are you dragging your feet for? Move it!” Zhao Da yanked on the chain; Zhu Dagun stumbled forward, hurriedly covering his face with his hands as he went down the street. In a moment, they came out of the front gate of Xuanren Ward and turned to travel eastward along the wide thoroughfare of Zhuque Street. They saw few pedestrians, and none who paid any mind to a criminal in chains in this time of war and chaos. Zhu Dagun spent the walk hiding his face and cringing, terrified of bumping into a fellow Hanlin Academician. Fortunately, this was the hour after lunch, when everyone was napping with full bellies. He didn’t see a single scholar.\n“S-sir.” After a while, Zhu Dagun couldn’t resist asking in a small voice, “What am I under arrest for?”\n“What?” Zhao Da turned to glower at him. “Misinforming the public, starting rumors—did you think the government was ignorant of the trouble you were making online?”\n“Is it a crime for concerned citizens to discuss current affairs?” Zhu Dagun asked. “Besides, how does the government know what we say online?”\nZhao Da laughed mirthlessly. “If it’s government business, there’s government people watching. You untitled little scribe, did you know that spreading slander and rumor about the current situation is a crime on the same level as inciting a disturbance at a governmental office or assaulting a minister? Besides, the internet is another novelty from the East City Institute. Naturally we have to be twice as cautious. You may think that the network manager’s there to keep the internet operating smoothly, but he’s writing down every word you send out in his dossier. It’s all there in black and white. Let’s see you try to wriggle out of it!”\nShocked, Zhu Dagun fell silent.\nChug chug chug chug. A fire-oil carriage rumbled past, spewing flame and smoke. It had “East City XII” painted on its side, marking it as one of the Institute’s repair vehicles.\n“The Song army is trying to storm the city again,” said one of the soldiers. “Nothing will come of it this time either, most likely.”\n“Shhh! Is it your place to talk about that?” His companion cut him off immediately.\nAhead, a crowd was gathered around some sort of vendor stand set up under the shade of the willows. A smirking Zhao Da turned to one of his soldiers and said, “Liu Fourteenth, you should save up some money and get your face scrubbed. You’ll have more luck finding a wife.”\nLiu Fourteenth blushed. “Heh-heh . . . ”\nZhu Dagun then knew that it was the East City Institute’s tattoo removal stand. The emperor was afraid of the Han soldiers deserting, so he had their faces tattooed with the name of their army divisions. The Jianxiong soldiers were tattooed “Jianxiong;” the Shouyang soldiers were tattooed “Shouyang.” As for Liu Fourteenth, a homeless wanderer who’d been enlisting in every army he could find since boyhood, his face was inked shiny black from forehead to chin with the characters of every army that had ever patrolled this land. The only blank spot left was his eyeballs; if he wanted to enlist again in the future, he’d have to shave himself bald and start tattooing his scalp.\nThe East City prince’s tattoo removal method had the soldiers rushing to line up. The technique involved taking a thin needle dipped in a lye solution and pricking the skin all over. The scabs were peeled off, and the skin again brushed with lye solution before being wrapped with cloth. The second set of scabs then healed to reveal clean new skin. It was precisely due to the unease of being under siege that everyone wanted a wife to enjoy while they could. Prince Lu’s invention showed his deep understanding of the soldiers’ thoughts.\nThe procession walked a bit farther, then harnessed an oxcart at Youren Ward and continued east by cart. Zhu Dagun sat on a stuffed hemp sack, bouncing with every bump in the road, the chains scraping his neck raw. Deep inside, a little part of him couldn’t help but regret accepting the mission. He and the General of the Cavalry Guo Wanchao counted as old acquaintances. Their ancestors had been ministers together under old Emperor Gaozu Liu Zhiyuan. The fortunes of their families had gone opposite ways in the time since, but now and then they’d still simmer some wine and talk of things past.\nThat day, when Guo Wanchao invited him over, he’d been utterly unprepared to see Minister Ma Feng sitting there as well. Ma Feng wasn’t just anyone—his daughter was the emperor’s beloved concubine, such that the emperor even referred to him as father-in-law. It hadn’t been long since he’d stepped down from the position of Chancellor for the sinecure of Xuanhui Minister. In all of Jinyang, aside from a few self-important generals and military governors with soldiers under their command, no others could equal his status and power.\nAfter a few rounds of wine, Ma Feng explained to him what they had in mind. Zhu Dagun immediately threw his cup to the floor and jumped up. “Isn’t this treason?”\n“Sima Wengong once said, ‘Loyalty is to give all oneself for the well-being of another.’ Yanzi also said that ‘Being a loyal minister means advising one’s lord well, not dying with one’s lord.’ One should not take shelter under a wall on the verge of falling. Brother Zhu, consider your gains and losses carefully, for the sake of the people of the city . . . ” Old Ma Feng held on to Zhu Dagun’s sleeve, his whiskers trembling as he sermonized.\n“Sit down! Sit down! Who do you think you’re fooling with that performance?” Guo Wanchao hawked out a glob of phlegm. “All you scholars are the same. Powerless to make any difference, you spend all day on the internet pontificating and debating, criticizing the emperor for never doing anything right, and lamenting that Han is going to collapse sooner or later. And now all of a sudden you can’t bear to hear a word against the emperor? To put it bluntly, once the Song dogs storm the city, everyone in it is motherfucking dead. Better to surrender while we can and save tens of thousands of lives. Do you really need me to spell this out for you?”\nAwkwardly, Zhu Dagun stood there, unwilling to either acquiesce by sitting or to defy the general by leaving. “But Prince Lu has those machines on the city walls. Jinyang is well-fortified, and I hear a grain shipment from Liao arrived a few days ago from the Fen River. We can hold out for at least several more months—”\nGuo Wanchao spat. “You think Prince Lu is helping us? He’s screwing us over! Those Song dogs now control the Central Plains. They have enough grain and money to keep the siege going for years. Back in the third month, a Song army crushed the Khitan at Baima Ridge, killing their Prince of the Southern Domain Yelu Talie. The Khitan are too scared to come out of Yanmen Pass now. Once the Song army cuts off the Fen and Jing Rivers, Jinyang will be completely isolated. How are we supposed to win? Besides, who knows where that East City prince came from, with all his strange devices. Does he really only care about helping us defend the city? I don’t think so!”\nFor a time, none spoke. A fire-oil lamp crackled on the table, illuminating the small room’s walls. The lamp was another one of Prince Lu’s inventions, naturally. A few coins’ worth of fire-oil could keep it burning until dawn. Its smoke smelled acrid and stained the ceiling a greasy black, but it burned far brighter than a vegetable seed oil lamp.\n“What do you want me to do?” Zhu Dagun slowly sat.\n“Try to reason with him first, and if that doesn’t work, whip out your knife. Isn’t that how things are always done?” Guo Wanchao said, raising his cup.\n4.\nPrince Lu’s origin was a complete mystery. No one had heard of him before the Song army surrounded the city. Then, after the loss of the twelve prefectures, stories of the East City Institute began to circulate through the wards. Seemingly overnight, countless novelties sprang up in Jinyang, three of which grabbed the most attention: the massive water wheel and foundry in Central City, the defensive weaponry on the city walls, and the city-spanning internet.\nJinyang was divided into three parts, West, Central, and East. Central City straddled the Fen River; the water wheel was installed right under a veranda, turning night and day with the river’s flow. Water wheels had long been used to irrigate fields and mill grain, but who knew that they had so many other uses? Squeaking wooden cogs drove the foundry’s bellows, and the water-dragons, fire-dragons, capstans, and gliding carts atop the city walls. The foundry held several furnaces, where the bellows blasted air over iron molten by fire-oil. The resulting iron was hard and heavy, far more convenient than before.\nThe changes were even greater on the city walls. Prince Lu had laid down a set of parallel wooden rails atop the wall and ran a strong rope along the track from end to end. Press down a spring-loaded lever, and the power of the water wheel drove the rope to pull a cart sliding along the track at lightning speed. The trip from Dasha Gate to Shahe Gate normally took an hour even on a fast horse, but with the gliding cart it took only five minutes. On the system’s maiden trip, the soldiers tied to the cart as the first passengers had screamed in terror, but a few more trips showed them the fun in it. With exposure came appreciation; they became the gliding cart operators, spending all day aboard the cart and refusing to get off. There were five carts in total, three for passengers and two for catapults. The catapults weren’t much different from the preexisting Han ones, except that they used the water wheel to winch back the throwing arm, not fifty strong men hauling on the oxhide rope; and they no longer threw stones, but pig bladders filled with fire-oil. Each bladder also contained a packet of gunpowder wrapped in oil cloth, with a protruding fuse that was lit right before firing.\nThrowing down rocks and wooden beams was a staple of siege defense, but every beam dropped and rock hurled meant one less in the city. If the siege went on long enough, the defenders usually had to take apart houses in the city for things to throw. Therefore, the East City Institute came up with a vicious new invention. Instructed by Prince Lu, the defenders tamped yellow mud into big clay pillars, five feet long and two feet across, and embedded the surfaces with iron caltrops. The construction of the mud pillars followed a specific recipe: yellow mud was covered with straw mats to stew for a week; mixed with glutinous rice paste, chopped-up straw, and pig’s blood; and then pounded down repeatedly. The caltrops studding the pillars were doused with wastewater until they rusted an unnatural red-black. Prince Lu said that they’d make the Song soldiers catch a disease called “tetanus.” Weighing two thousand six hundred pounds each, glistening a sinister yellowish bronze color, and covered all over with filthy iron caltrops, the pillars turned out to be excellent weapons for slaughter. Hundreds of pillars were secured to the top of the wall with iron chains on each end. When the Song army approached, the pillars smashed down, pulverizing scaling ladders, rams, shields, and soldiers alike. Then, with a turn of the capstan, the water wheel winched the chains with little squeaks, and the bloodstained pillars ascended sedately toward the parapets once more.\nAfter suffering great casualties from the pillars, the Song army changed tactics and sent Khitan captives and their own old, weak, and sick to serve as the vanguard. Taking advantage of the brief respite after their sacrifices were flattened and while the pillars were still down, the main body of the Song army advanced with ladders, siege towers, and catapults. But now the gliding cart-mounted catapults came into play. In a flash, hundreds of red, stinking, wobbling bladders took to the air, blooming into fireballs as they rained down among the Song troops. Wood crackled and soldiers screamed. The fragrance of meat roasted on fruit tree wood permeated the air. Last came the archers, sniping at anyone with a helmet plume—everyone knew that only Song officers could wear feathers on their helmet. But arrows were limited and had to be used conservatively; once the archers had shot a couple arrows each, they returned to rest, thus ending the battle.\nBelow the city walls was a field of char, smoke, and wailing. Above, the Han defenders poked and pointed into the distance, counting their kills. For every kill, they drew a black circle on their hand, and used the circles to collect their reward money from the East City Institute. By Prince Lu’s calculations, two million Song soldiers had died these months below the city. Everyone else, looking at the Song camps that still covered the horizon end to end, came to an unspoken consensus not to bring up the problem with statistics derived from self-reporting.\nWith Jinyang securely defended, Prince Lu invented the internet to keep everyone in the city from getting too bored. He first came up with something called movable type (which he claimed was cribbing from an old sage named Bi Sheng, although no one could recall ever having heard of this formidable personage). He’d first carved the text of the Thousand Character Classic in bas relief onto a wooden board, then pressed a layer of yellow mud mixed with glutinous rice, straw, and pig’s blood—leftover material from the death-dealing clay pillars—over the printing plate. Finally, he’d peeled the whole thing off and diced it into small rectangles, thus creating a set of individual type blocks that could be freely combined and assembled. He’d placed the thousand characters into a rectangular tray, attaching every block in the back to a strand of silk thread with a spring. The thousand strands of thread were then collected into a bundle the thickness of a wrist, termed a “web.”\nSimilar text-trays were found all over the city, while the bundles of silk threads passed through the bottoms of the walls to a network manager’s station. The end of each bundle of silk was then neatly fitted into a metal mesh by tying a small hook to the end of each thread and hanging the hooks to the mesh. These meshes lined the walls of a station, and if two text trays wanted to communicate, the manager found the two corresponding bundles and brought the metal meshes together with a twist that connected the thousand pairs of metal hooks together. The bundles were thus linked together in what Prince Lu called an “internet.”\nOnce a web connection was established, the users at each end could communicate through the text trays. When one side pressed down on one of the type pieces, the little spring tugged the silk thread, causing the corresponding type to sink down on the other side. Although picking out the desired character out of a thousand densely packed blocks posed quite a strain on the operator’s eyes, an experienced user could type with lightning speed. Some pedants worried that the depth and complexity of hanzi writing could not be adequately represented by such an invention. Though the Thousand Character Classic was an ingenious primer to introduce the wonders of hanzi, how could a mere one thousand characters be enough to discuss life and the universe? Prince Lu countered that they were one thousand unique characters—never mind discussing the universe, these characters had been enough for the majority of fine essays since antiquity; they were certainly enough for web users to express whatever they needed to say.\nIn actuality, in the Thousand Character Classic, one of the characters—the one for “pure”—did occur twice. The East City Institute removed one of them and substituted a piece of type with a bent arrow symbol. Since it would have been too difficult for two users to simultaneously type and squint at the text tray for a reply, Prince Lu decreed that the current speaker had to press this “carriage return” block when they finished typing to indicate that it was the other person’s turn. Why the symbol was called “carriage return” was something Prince Lu never bothered to explain.\nAt first, only two people could talk on a web connection at once, but Prince Lu later invented a complicated bronze hook rack that linked many internet lines together at once. If one person pressed a character, it would show up on all the other text trays.\nThis advance in the internet led to a new problem. If eight scholars sat down to chat, the moment one of them pressed the return key, the other seven would fight to speak first, with the result that their text trays would undulate up and down uncontrollably, like the dark waters of Lake Jinyang rippling in the north wind. To solve this problem, the East City Institute sold a new kind of text tray with ten blank type squares. When web users took advantage of the bronze rack to form a chat group, everyone first carved the members’ appellations onto the squares. If someone wanted to speak, they pressed the block with their name. Whoever’s block moved first had the right to speak until they pressed carriage return. Prince Lu first called this arrangement a “three-way handshake,” then “vying for the mike,” although he never explained what these terms meant. Zhu Dagun loved to smash his own “Zhu” block non-stop, naturally earning severe rebuke within his circles. Block-mashing not only disrupted the others’ ability to speak, but also often caused the internet line to snap.\nThough the silk threads were resilient, damage from wind, rain, insects, mice, and bad users like Zhu Dagun was inevitable, and the lines broke from time to time. If you were chatting, only for someone to suddenly call you an “ignorant dog unworthy of the title of scholar sullying the names of past sages,” it was a good sign that the threads for some of your type blocks had broken. While you had meant to type “The Master spake, ‘even the sage-kings of old were met with failures in this,’” what had shown up in the other text trays was “The Master spake, ‘the sage-kings of old were failures,’” thereby not only denouncing the legendary sage-kings, but also smearing great Confucius as well.\nAt times like this, you had to yell “Manager!” and give the network manager a few coins for the trouble of inspecting the web lines while you took the opportunity to go to the market and buy a few pounds of flatbread. Meanwhile, the manager would sever the connection, find the broken silk lines, and knot them back together. If you didn’t invest enough into a friendly relationship with the network manager, he’d tie a big fat knot that clogged the network so that your lines moved at the rate of a geriatric ox pulling a caravan. But if you did hand over enough coppers, he’d take out a little comb, smooth out the threads until they gleamed, and tie a minuscule square knot. Then you tossed the flatbread through the station window and yelled “All’s well!”—that was why Zhu Dagun had no choice but to reserve money for bribing the network manager, no matter how strained his wallet.\nThe East City Institute’s siege defense weaponry won it the hearts of the soldiers; its peculiar little inventions won the hearts of the commoners; and the internet won the hearts of the scholars. To moralize and debate and weigh in on anything one desired without having to step outside one’s door—such convenience had never been available to anyone, not even in the time of the ancient sages of legend. With the Song army surrounding the city, the scholars could no longer venture out of the city to climb Xuanwa Mountain, sightsee along the Fen River, or drink and admire the flowers. Being shut inside, they had only writing to serve as a pastime, and that dejected them further. If it weren’t for West City’s internet coverage, these destitute, bored intellectuals would have tried to overthrow the government long ago. With an entire state reduced to one city, its three ministries and six departments gone in all but name, no pay for the ministers, and the emperor not even attending court, the scholars had become the most idle and useless group in the city and could only snipe and complain online.\nIf some loved the internet, of course others kept their distance, as they would for ghosts and gods—and anything else they didn’t really understand. If some praised Prince Lu, of course others muttered behind his back. No one had actually seen his person, but he was the hottest topic of gossip among the wards.\nZhu Dagun had never dreamed that the first time he had any contact with the prince would involve being sent by Ma Feng and Guo Wanchao to advise surrender. Whether it was more moral to fight or surrender, he hadn’t quite figured out himself. But since both the civil minister and the general charged him with such a weighty task, he could only venture forth, a petition and a sharp knife hidden in his clothes.\n5.\nThe oxcart proceeded creakily past the walled courtyard of an inn. Prince Lu had built it not long after he came to Jinyang. The inn was painted orange, with a blue plaque emblazoned in large characters, “Best Western,” presumably to advertise itself as the best inn in West City. It was a somewhat odd name, though rather tame by the standards of the other neologisms that Prince Lu had invented.\nAfter Prince Lu moved to the East City Institute, he had two windows carved in the wall surrounding the courtyard, one for selling wine and another for selling miscellaneous gadgets. The prince’s wine was called weishiji, presumably a poetic contraction for the phrase “feared and respected by even mighty warriors.” It was brewed by soaking and boiling the grain brought from Liao, creating an alcoholic liquid clear as water and crisp as ice that burned a trail of fire through one’s guts upon imbibing, far superior in flavor to the rice wine sold in the market. Two pints cost three hundred coins, a high price in a time of abundant moonshine stills, but connoisseurs naturally had their ways of paying.\n“Soldiers, give us a volley!”\nZhu Dagun turned and saw a dozen or so hooligans standing at the foot of the city wall, yelling toward the outside. A soldier’s head poked out from the parapets above. “Are you short on cash again, Zhao Second? You’d better give us a bigger share of that good wine this time, or else the general’s going to crack down and—”\n“Of course, of course!” the hooligans laughed. Then they resumed yelling in unison, “Soldiers, give us a volley! Soldiers, give us a volley!”\nSoon after came the voices of the Song soldiers, yelling from outside the city. “You’d better keep your word! Five hundred arrows for twenty pints! Don’t you dare shortchange us.”\n“Of course, of course!” With that, the hooligans jumped to action, wheeling out seven or eight haycarts from heaven knew where and arranging them at a distance from the wall. Then they ducked down at the foot of the wall, covering their heads with their arms. “All set. Shoot!”\nBows twanged. A swarm of arrows dense as locusts hissed through the air, arced over the ramparts, and thunked into the piles of hay, instantly transforming the carts into oversized hedgehogs.\nZhu Dagun watched from a distance, fascinated. “I’ve heard the old story of the Three-Kingdoms strategist who propped up straw men to trick arrows from the enemy. I never thought it would still work.”\nZhao Da spat. “These hooligans are colluding with the enemy. You could call it treason if you really wanted to prosecute. The city defense is always short on arrows, so the emperor decreed that he’d pay ten coins for every arrow turned in. The five hundred arrows these hooligans collected can be exchanged for five thousand coins, enough to buy thirty-four pints of alcohol. They lower twenty pints in a cask to the Song soldiers, hand out four pints to bribe the watchers on the wall, and drink the remaining ten until they pass out in the streets. Degenerates!” He turned to glare at them, and shouted, “You fellows have some nerve to do this in my sight!” The hooligans only laughed and bowed to him before whisking the carts down an alley.\nZhu Dagun knew that, whatever Zhao Da said, he was certainly in the hooligans’ pay. But he didn’t bother pointing this out; instead, he sighed. “The longer the siege goes on, the worse the thoughts in people’s heads. Sometimes it feels as if it’s better to let the Song army take the city and get it over with, huh.”\n“Nonsense!” Zhao Da bellowed. “Any more traitorous talk and I’ll whip you!” Zhu Dagun still couldn’t figure out if Zhao Da was Ma Feng’s agent, dispatched to help him, so he didn’t speak further.\nThe sun beat down ruthlessly. The oxcart plodded forth in the shade of listless willows, down the main road through the internal gate dividing West from Central. Central City was no more than seventy yards across, divided into two levels. The water wheel, the foundry, and the various other hot and noisy machines were on the lower level. The upper level was for horses, carts, and pedestrians, and on either side of the road were the government buildings for the Departments of Hydrology, Textiles, Metallurgy, and Divination.\nThe road had been paved with jujube wood wherever possible. Central City had been built in the time of Empress Wu Zetian by the Secretary of Bing Prefecture to connect East and West Cities on either bank of the Fen River. In the three hundred years since, the jujube paving had been regularly polished with wax and tamped down by feet and hooves, until it gleamed a deep brown like dried blood and was hard as stone. When struck, it rang like a bronze bell; swords bounced off it, leaving only white scratch marks. Pried up and used as a shield, it could deflect blades and arrows, even bolts from the Song army’s repeating arcuballistas. At this point in the siege, the paving was full of gaps, carelessly filled in with yellow mud. Walking over it, you never knew which foot would start sinking. The soft spots could sprain an ox’s ankle.\n“Off,” Zhao Da said. He instructed a subordinate to return the oxcart, while he personally led his captive through Central City on foot.\nThe Fen River was shallow and thin from the drought. Zhu Dagun looked at the turbid flow that wound in from the north, babbling through the city’s twelve arch bridges before continuing southward without rest. “Liao, Han, Song: north to south, three nations connected by a single river.” He sighed unconsciously. “With such a sight before me, I ought to compose a poem to commemorate—”\nBefore he had the chance, Zhao Da delivered a hard smack to the back of his head, knocking his cap askew and beating the poetic inspiration right out of him. “Enough, you starving scribbler. I sweated buckets getting you here, and I don’t need your chattering. The magistrate’s office is right ahead. Shut up and walk!”\nZhu Dagun quieted obediently, thinking the moment I’m free I’m going to go online and cuss you out to everyone, you corrupt official. Then he realized that if he succeeded in convincing Prince Lu of the East City Institute, Han would no longer exist. Would the internet still be there when Jinyang belonged to Song? For a time, he walked in a daze.\nWordlessly, they crossed Central City into the modest-scaled East City. They walked past the Taiyuan county building and made two turns on the dusty street to enter a courtyard of gray brick and gray tile. The courtyard walls were tall and smooth; the windows were covered with iron bars. Zhao Da exchanged greetings with the man inside and handed over papers, while the soldiers shoved Zhu Dagun into the west wing. Zhao Da took off Zhu Dagun’s chains. “The boss is giving you a cell to yourself. You’ll be brought two meals a day. If you want money, more food, or bedding, ask your family to bring them. Try to escape and your crime rises one rank in severity. Trial is in two days. Just tell everything like it is to the boss. Got everything?”\nZhu Dagun felt a sharp burst of pain in his back; he stumbled and fell into a cell. Guards locked and chained the door, then left.\nZhu Dagun pulled himself up and looked around, rubbing his butt. He found that the cell had a bed, a sitting mat, a bronze basin for washing his face, and a wooden bucket serving as a chamberpot. Although the room was poorly lit, it was neater and cleaner than his own home.\nHe sat on the mat. He groped the pouch inside his sleeve and found that everything was intact: a copy of the Analects, so that when he debated Prince Lu he could borrow courage from the writings of sages; an empty wooden box, with a hidden compartment containing Ma Feng’s voluminous petition—it may have been an entreaty to surrender, but the impeccable writing and righteous language had Zhu Dagun’s abject admiration; a double-edged dagger forged of prime steel, six and three-tenth inches. Of what import is the anger of a common man? The First Emperor had asked this of Tang Ju. A spray of blood five paces long, answered he. Thinking of this final tactic, the Han words churned Zhu Dagun’s Shatuo and Turkic blood.\n6.\nOnly when Zhu Dagun awoke did he realize that he’d fallen asleep in the first place. A ray from the setting sun slanted through the window. It was late in the day now.\nFootsteps sounded in the hallway outside. Zhu Dagun slowly climbed to his feet and stretched, looking out through the gaps between the bars.\nEarlier, Ma Feng had said that he’d planted agents inside the prison to appear at a suitable time. At this moment, a guard was strolling over, an oil-paper lantern in his left hand and a box of food in his right, humming as he went. He stopped at Zhu Dagun’s cell and knocked on the bars with the lantern. “Hey, time to eat.” He took two flatcakes from the box, wrapped them around some pickled vegetables, and passed them through the bars.\nZhu Dagun accepted the meal with a friendly smile. “Thank you very much. Does your superior have any words for me?”\nThe guard glanced around, then set down the food box and took out a scrap of paper. “Here, read this,” he whispered. “Don’t let anyone see it. The general said to tell you, ‘Do what you can, but leave the rest to the will of heaven.’ As long as you do your duty, you’ll benefit whether it works or not.” Then he raised his voice. “There’s water in the basin. Scoop it up with your hands if you want to drink. Relieve yourself in the bucket. Don’t get any blood, pus, or phlegm on the bedding. Got it?”\nThe guard picked up the food box and strolled off. Zhu Dagun devoured the flatcakes in a few bites, poured some water down his gullet, then turned around and read the note by the last fading sunlight. However, once he was done, he felt more confused than before. He’d thought that the guard had been sent by Guo Wanchao, but the note suggested otherwise. It read:\nDear Sir:\nOur state of Han is in big trouble. We’re low on soldiers and grain and rely on the siege defense machines to keep going. Lately I heard that the East City Institute people have been uneasy and Prince Lu seems unstable. If he defects to Song, Han is doomed. Woe! If you read this letter I hope you can talk to Prince Lu and make him see the light. He mustn’t surrender! He refuses to see any guests at the East City Institute so I can only try to do it roundabout like this. For the sake of our people please you must persuade him to stay strong! We’ll beat Song one day for sure!\n—Yang Zhonggui again thanks you\nThe note was clumsy in language, the handwriting unrefined; clearly, the author was some rough fellow without much education. The name “Yang Zhonggui” seemed unfamiliar. Zhu Dagun thought for a long time before remembering that it was the original name of Military Governor Liu Jiye. He was the son of the Lin Province Inspector Yang Xin. Emperor Shizu had adopted him as a grandson and changed his name to Liu Jiye. In his thirty years as a general, he’d never been defeated in battle, earning him the moniker “Invincible.” Currently, he commanded the defense of Jinyang.\nSigning the note with his original name showed his desire to distance himself from the current emperor. The reason was no secret. Ten years ago, the previous Song emperor had breached the Fen River dam in an attempt to flood Jinyang. The streets had disappeared under the waters, and corpses and trash floated everywhere. Liu Jiye had petitioned the emperor Liu Jiyuan to surrender, only to meet with curses and mockery. One of the other signatories to the petition, Guo Wuwei, was publicly executed. Liu Jiye had remained in disfavor ever since, stripped of any meaningful command.\nThough he’d once advocated surrender, now he advocated fighting on. Zhu Dagun thought he understood why. The Invincible General might have been a renowned warrior who’d caused the deaths of countless soldiers, but he was also a credulous, short-sighted gentle soul who wept to see the ordinary people suffer. Ten years ago, the entire city was starving. Commoners swam into the streets every day to eat the bark off the willow trees; if they rolled off their roofs at night while sleeping, they drowned in the stinking water. Liu Jiye’s heart had ached so at the sight that he’d only wanted to open the gates and let the Song troops in and end all the suffering.\nBut this time, the city was comparatively well-stocked. The commoners could eat their fill and still have grain left over to trade for weishiji, trade for a few gadgets, or pay a visit to the brothel, satisfying themselves in both body and soul. Naturally this bolstered Liu Jiye’s spirit. He wanted nothing more than for the siege to last for a hundred years until the Song ruler died of old age right where he stood, as vengeance for the past. With Prince Lu holed up in his own territory in East City, shut off from all outsiders, only criminals could hope for an audience with him. General Liu had written his clumsy entreaty and left it in the prison in the hopes that some patriotic prisoner could whisper encouragement to Prince Lu.\n“Ah . . . ” Zhu Dagun blinked. He tore up the note and threw the scraps into the wooden bucket, then pissed over them to destroy the evidence. The guard who brought him food hadn’t been the person he was waiting for, but Liu Jiye’s agent, in a strange coincidence.\nThe sky outside the window was soon dark, and there was no lamp in his cell. Zhu Dagun sat with a full stomach and nothing to do. Normally, this would have been a perfect hour for chatting online. He flexed his fingers restlessly as he mentally recited the Thousand Character Classic. Without sufficient familiarity with this cunning work, one wouldn’t be able to quickly find the right character in the text tray. Memorizing it—and thus the layout for the types—had become a requirement for the literati of his generation.\nFootsteps once again sounded in the hall; the glow of flames grew as they approached. Zhu Dagun hurried to the bars and waited. A guard stopped in front of him, holding his torch high. “Zhu Dagun?” he said coldly. “In custody for sowing misinformation online?”\nZhu Dagun smiled. “That’s me. Though I’ve never heard of that crime . . . Does your superior have any words for me?”\n“Hmph. Kneel!” the guard suddenly said, in total seriousness. He glanced around, then pulled out something shiny and golden, spreading it to let Zhu Dagun see. Zhu Dagun paled and instantly dropped to his knees. He was only a minor scribe with no governmental rank, but he’d once seen such an object on the incense table of a great scholar of the Imperial Archives. He shivered in fear, obediently touching his forehead to the ground. “The servant . . . the criminal Zhu Dagun a-awaits His Imperial Majesty’s instruction!”\nThe guard stuck out his chin and began to recite, enunciating each character crisply. “In representation of Heaven and the Emperor the edict speaks: We know of you and your abundance of opinions. Often, you debate matters of state on the internet and spin your words very skillfully to corrupt others. However, we understand that you’ve been falsely reported this time, and we assure you you’ll receive proper redress, but you need to help us out first. It’s improper for us to lower ourselves by going to the East City Institute, and Prince Lu isn’t willing to come to Jinyang Palace. Since we trust no one else in court, we can only put our hopes in you. You and I are both Shatuo, descendants of Yukuk Shad. We trust you, and you must trust us. Ask Prince Lu for us, what are we to do? He once promised that he’d build a flying vessel for us to enable our one hundred and six household members and four hundred old Shatuo retainers to escape from the city and head straight into Liao territories. But Prince Lu now insists that he is too busy with defending the city to build this ‘zeppelin,’ a name he glossed as ‘stairway to heaven’ in an abstruse dialect. It’s been two months and there are no signs of this vessel. The Song troops are fierce and many and our heart is filled with apprehension. Dear loyal scholar, help us convince Prince Lu to build the zeppelin, and we will reserve a seat for you. When the Liu clan once again rises, we’ll grant you the rank of Chancellor. A ruler does not joke.”\n“Your servant a-accepts this edict.” Zhu Dagun lifted his hands above his head and felt a heavy scroll descend into them.\nThe guard sniffed at him. “See what you can do. The emperor is . . . ” He shook his head and left.\nZhu Dagun stood, covered in a cold sweat. He slid the scroll of yellow silk respectfully into his sleeve, his head spinning as he thought of its contents. Guo Wanchao and Ma Feng wanted to surrender; Liu Jiye wanted to fight; the emperor wanted to run away. All of them presented what seemed like reasonable arguments, but upon further thought, none of them seemed so reasonable. Who to listen to, and who to ignore? His heart was a tangle. The more he thought, the more his head hurt.\nHe didn’t know how much time had passed when new footsteps broke him from his torpor. He’d used up all his enthusiasm; he trudged to the bars and waited.\nThe guard held a fire-oil lamp. He shone the lamp around, then said, “Sorry I’m late. Since you’re the only prisoner here today, I couldn’t get in until the change of shifts.”\n“Does your superior have any words for me?” Zhu Dagun said listlessly. He’d already asked this three times today.\nThe guard lowered his voice. “The General and Elder Ma want me to inform you that the East City Institute will send for you at the hour of the rat tomorrow. Prince Lu is mucking with something new and needs people. Just claim to be knowledgeable in alchemy and you’ll be able to approach him.”\n“Alchemy?” Zhu Dagun said, surprised. “I’m an ordinary scholar. I don’t know anything about alchemy.”\nThe guard furrowed his brow. “Who said you have to know anything? You’re just trying to get close to Prince Lu. It’s not like you’re actually going to be smelting pills of immortality. Just mumble something about ceruse, litharge, cinnabar, sulfur, the Baopuzi, the Kinship of Three, the Collected Biographies of Immortals, and so on. No one understands this stuff anyway, so no one can call you out. Go to sleep early, and I’ll see you tomorrow. Good luck persuading him!” He turned to leave. Two steps later, he paused to ask, “You did bring the knife, right?”\n7.\nThe sky brightened without fanfare. Sounds of shouting and fighting drifted in; the Song troops were trying to storm the city again. The residents of Jinyang had long since grown accustomed to this, and no one took note.\nA guard came to deliver breakfast. Zhu Dagun took the bowl of porridge and looked him over carefully, only to realize he’d only paid attention to the lantern, the torch, and the fire-oil lamp the previous night. He couldn’t remember what the guards looked like at all and was unable to tell which faction this guard hailed from.\nZhu Dagun ate the porridge and sat for a while, doing nothing. The clamor of the morning crowd arose outside. A throng of burly men dressed in East City Institute uniforms flooded into the courtyard.\nThe guards took Zhu Dagun out into the yard. A man with a yellow beard covering his face walked up and greeted him. “I serve Prince Lu. By his mercy, prisoners here only need to be willing to work for the Institute to obtain pardon for their crime. Your charges aren’t too severe. Just sign here and you’ll be cleared.” The man took out paper and a writing implement. Instead of a brush, the instrument was a goose feather dipped in ink—before Prince Lu, who would have thought that you could pull a feather from a bird, soak it in lye, sharpen the tip, and write with such a thing?\nZhu Dagun automatically reached for the feather, but Yellow-Beard drew it back. “But right now, His Highness needs someone of unusual capabilities and skills. First tell me, are you knowledgeable in alchemy? I’ll be blunt, you look like the genteel, bookish sort, so don’t try to sell yourself for more than you’re worth.”\nZhu Dagun quickly dredged up a speech. “I’ve been studying the Kinship of Three since childhood under the guidance of my father. I am thoroughly versed in the ways of Dayi, Huanglao, and the forging flame. Heaven and Earth are my cauldron, water and fire are my ingredients, and yin and yang are my complements. I know when to stoke the flames and when to bank the embers. In my life I’ve refined one hundred and twenty pills of shining gold and imbibed them daily. Although I have not ascended to the ranks of enlightened immortals, my body has become light, nimble and impervious to disease. The pills have the power to cultivate the spirit and extend life.” To demonstrate the effectiveness of the golden pills, he sprang up and did two backflips in mid-air, then grabbed an eighty-pound stone drum lying in the yard. After lifting it above his head and tossing it from hand to hand, he threw it to the ground, where it landed with a thud. He dusted off his hands, his breathing unhurried, his face unchanged in color.\nYellow-Beard stared; his men started to clap. The guard standing behind him sneaked a thumbs up, upon which Zhu Dagun knew that this was Ma Feng’s agent.\n“Excellent, excellent! We’ve found a real treasure today.” Yellow-Beard laughed and opened the small bamboo case at his waist. He dipped the goose quill in ink and handed it over. “Sign here, and you’ll belong to the East City Institute. We’re going straight to Prince Lu.”\nZhu Dagun signed his name as directed. Yellow-Beard ordered the guards to unfasten the manacles around his ankles, bowed all around to the prison staff, and left the courtyard with his retinue. He and his men escorted Zhu Dagun for half an hour before arriving at a large residence complex, both sprawling in area and dense with buildings. The blue-garbed guards at the gate smiled when they saw Yellow-Beard. “Got the goods? It’s been peaceful lately. We haven’t had any new people join in a while.”\n“I know, Prince Lu was frantic about finding an alchemist to help him out,” replied Yellow-Beard. “We’ve finally taken care of that.”\nA crowd was gathered in front of the gate: imperial messengers, merchants, government officials in search of glory by association, commoners seeking aid in redressing wrongs done to them, craftsmen bringing their own inventions in the hopes of an audience, idlers trying to return the novelties they purchased after they grew bored, laborers looking for work, prostitutes looking for clients. The guard recorded them one by one in his ledger, gently refusing, reporting, and chasing off with a stick as appropriate. If he saw anyone he was uncertain about, he went ahead and took the bribe, then told them to try their luck again in a few days. He was quite orderly and methodical in this work.\nYellow-Beard led his men into the compound. The courtyard was a different scene: behind a privacy wall was an immense pool of water, in the middle of which a geyser rose more than ten feet tall before majestically splashing down.\n“Normally the fountain is powered by the water turbine from Central City, but with the Song army regularly trying to storm the city, we need the turbine to power the gliding carts, catapults, and capstans,” Yellow-Beard explained. “So instead the fountain mechanisms run on manpower. We have several dozen unskilled laborers in the Institute, whose only trade is doing heavy lifting, nothing like a white collar fellow like you.” Zhu Dagun had never heard of the strange words he used, so he simply looked where Yellow-Beard pointed. Indeed, he saw five dull-eyed, muscular fellows to the side, stepping on pedals that went up and down. The pedals drove rotors, the rotors churned a water tank, and the tank valves opened and shut, pumping water high into the air.\nThey went around the fountain and through an archway to enter the second partition of the courtyard. A dozen or so workshops stood to either side. Yellow-Beard said, “We build the flashlights, sunglasses, clockwork toys, microphones, magnifying glasses, and other things we sell in the city here. Institute staff get a fifty percent discount, and a lot of these gadgets are hard to find in the market. You should come check them out when you get a chance.”\nAs they spoke, they went through a third partition. Heavy, gleaming fire-oil carriage components lay everywhere under a high awning. A piece of heavy machinery puffed away, spewing white smoke and rapidly turning a carriage wheel. Several oil-stained craftsmen were engaged in an animated discussion full of strange words like “cylinder pressure,” “ignition timing,” and “steam saturation.” Two carpenters were hammering together a carriage framework. Several dozen large barrels of fire-oil stood in a corner of the yard, filling the air with their simultaneously aromatic and noxious smell. Fire-oil came from the island of Hainan and was originally used to douse attackers in flames during a siege, before it found myriad uses in Prince Lu’s hands. Yellow-Beard said, “All the fire-oil carriages running about in Jinyang were built here. They make up more than half the Institute’s income. The newest model will be released soon. It’s called Elong Musk—for the long-lasting fragrance of fire-oil after the vehicle darts out of sight. Even the name sounds fast!”\nThey continued walking, entering a fourth partition. This place was even stranger. There was constantly some shrill squeaking noise, or the crackle of an explosion, or an odd taste to the air, or colorful flashes of light. “This is the Institute’s research lab,” Yellow-Beard said. “Our prince gets a new idea a minute, and then our craftsmen try to follow up on his ideas and make them a reality. It’s best not to linger here; there are lots of accidents.”\nOn the walk here, the other members of their group had gradually dispersed, so that Yellow-Beard and Zhu Dagun were alone by the time they entered the fifth partition. Blue-garbed guards stood at the gateway; Yellow-Beard took out a pass, spoke a code phrase, and wrote down several passwords on a piece of paper; only then were they let inside. Hearing that Zhu Dagun was the newly arrived alchemist, the guards patted him down head to toe. Fortunately, he’d hidden the imperial edict in the rafters of his prison cell and tucked the dagger into his topknot. Zhu Dagun had a big head, covered in a black silk cap with jutting ears in the back. A guard snatched off his cap, but only saw a bulging bun of sallow hair, and didn’t look more carefully. On the other hand, the copy of the Analects they found in his sleeve pouch roused suspicion. They looked him up and down, then flipped through the book. “What’s an alchemist doing with this?”\nThis copy of the Analects hadn’t been printed with Prince Lu’s clay movable type. Rather, it had been printed in Emperor Shizong of Zhou’s time, using the official carved plates, and had been passed down for generations into Zhu Dagun’s hands. Zhu Dagun felt physical, visceral pain as he took back his crumpled and wrinkled treasure and prepared to head in.\nYellow-Beard said, “This row of buildings in the north is where His Highness normally spends all his time. He doesn’t like to be disturbed, so I won’t go in with you. Don’t be afraid, our prince is amiable and kind. He’s not hard to talk to . . . Right, I still don’t know your name.”\n“My surname is Zhu,” Zhu Dagun quickly said. “I’m the eldest of my siblings and named after Gun, father of the first Xia ruler. My courtesy name is Bojie.”\nYellow-Beard said, “Brother Bojie, I’ve been one of His Highness’s helpers since he first arrived in Jinyang. He granted me the name Friday.”\nZhu Dagun bowed. “Thank you, Brother Friday.”\nYellow-Beard returned the bow. “Not at all, not at all,” he said, before turning and leaving.\nZhu Dagun straightened his clothes, cleared his throat, scrubbed at his face, swallowed, and entered the building.\nThe room was very spacious. Black paper covered the windows, and fire-oil lamps illuminated the inside. Two long tables stood at the center of the room, covered with various jars and bottles. A man stood at one of the tables, head down, working on something.\nZhu Dagun’s palms sweated, his heart raced, and his legs wobbled. He hesitated briefly before gathering his courage, clearing his throat stickily, and dropping to a kowtow. “Your Highness! I . . . this criminal is—”\nThe man turned. Zhu Dagun kept his head down, afraid to look at his face. He heard Prince Lu say, “About time! Hurry and help me, I’ve been messing with this for days without any progress. Why is it so hard to find someone who understands middle school chemistry? What’s your name? What are you doing there on the ground? Get up already and come here.”\nAt Prince Lu’s string of words, Zhu Dagun hurriedly stood up and came over, his head down. He thought that this august prince sounded friendly and genial, like someone easy to approach, although he pronounced his words so strangely that Zhu Dagun had to repeat them to himself several times before understanding the prince; he wasn’t sure what topolect it was. “Your lowly servant is Zhu Dagun, a criminal.” Still keeping his eyes lowered, he made his way to the center of the room. Jars and bottles clanged over as he went, not because of carelessness or poor eyesight, but because the floor was so packed with random objects that he couldn’t take a step without kicking something over.\n“Hey, Lil’ Zhu. You can call me Old Wang.” The prince stood on tiptoes to pat his shoulder. “You’re really tall. 190 centimeters, maybe? I heard you’re from Hanlin Academy. I really wouldn’t have guessed that by looking at you. Have you eaten? If not, I’ll get us some takeout to pad our stomachs. Otherwise, let’s cut straight to the chase. I still haven’t gotten results from today’s experiment.”\nThese words threw Zhu Dagun into a daze. He sneaked a glance up and discovered that the prince didn’t look like a prince at all. He was of medium height, pale and beardless, and wore a buttoned white cotton coat. His hair was cropped short like a beggar-monk’s. He looked to be in his twenties, yet his brow remained creased with worry even when he smiled. “Your servant doesn’t quite understand what you’re saying, Your Highness . . . ” Zhu Dagun bowed anxiously, unsure of what story lay behind this strange prince.\nPrince Lu laughed. “You think my accent is confusing, but all you guys sound like gibberish to me. When I first came, I couldn’t understand a single word. Your court speech sounds like Cantonese or Hakka, but nothing like the modern Shanxi and Shaanxi topolects. Since I wasn’t a historical linguist, I thought that all the topolects of ancient northern China wouldn’t sound very different from what I knew!”\nThis time, Zhu Dagun understood every individual word coming out of the prince’s mouth individually, but their combined meaning fluttered entirely from his grasp. Sweat trickled down his face. “Your servant lacks in erudition. What Your Highness just said . . . ”\nPrince Lu waved a hand. “That’s to be expected. You don’t need to understand anyway. Come and hold this flask in place. Oh right, put on a filter mask. You studied alchemy, so you should know that chemical reactions can release toxic gases, I think?”\nZhu Dagun stared.\n8.\nThe crystal bottles on the table held liquids that Zhu Dagun had neither seen nor smelled in his life. Some were red, some were green, some smelled burningly acrid, some stank unbearably. Prince Lu helped him put on a mask, then had him steady a small, wide-mouthed jar. “Take this rod and stir it slowly. Don’t stir faster than that under any circumstance, got it?”\nNervously, Zhu Dagun stirred the dark green fluid inside the jar. It smelled like the sea, and was hot like a bowl of potherb soup. “This is dried seaweed ash dissolved in alcohol,” Prince Lu explained. “You ancients call seaweed ‘kunbu.’ I got this Goryeo kunbu from the Imperial Physician. The Song of Medicine Recipes said ‘kunbu disperses goiter and breaks swelling’ . . . oh, wait, The Song of Medicine Recipes is from the Qing dynasty. I got mixed up again.”\nAs he spoke, he took out another small jar and carefully removed the sealing clay. The jar was full of an acrid-smelling pale yellow liquid. “This is sulfuric acid. You alchemists call this ‘green vitriol,’ right? Also ‘qiangshui,’ like in the Alchemical Classic of the Yellow Emperor’s Nine Cauldrons. ‘Bluestone is calcinated to obtain a white mist, which is dissolved in water to obtain strong qiangshui. The substance transforms the silver-haired into the ebony-haired. The choking white mist it emits instantly transports one into the realm of spirits, and after eighteen years one departs from senescence and returns to childhood.’ You should be familiar with that.”\nZhu Dagun nodded as if he was. “That’s right, Your Highness.”\n“Just call me Old Wang. ‘Your Highness’ sets my teeth on edge. I’ll start now; keep stirring, don’t stop.” He set up a three-paned white paper screen to lean over the mouth of the flask, put on his mask, and slowly poured the green vitriol into the small jar. At first, all Zhu Dagun noticed was a stench that burned its way right through the cotton mask and up his nose, strong enough to make his brain ache and his eyes tear. Then he saw a miraculous purple cloud was floating up out of the jar, unfurling lazily. Zhu Dagun shivered in fright, but Prince Lu only laughed. “Finally! With this crude method for extracting iodine, that’s half my big plan taken care of! Don’t stop, keep stirring until the reaction finishes. I need to see just how much pure iodine I can extract from one pound of dried seaweed . . . Are you interested in how I created sulfuric acid and nitric acid? This is the first step in the Long March of establishing basic industry, you know.”\n“I’d love to hear,” Zhu Dagun said automatically.\nPrince Lu seemed delighted. “I was pretty good at chemistry back in high school, and I majored in mechanical engineering as an undergrad, so I got a decent foundation. I couldn’t have made it this far otherwise. At first I wanted to use the alchemists’ method of making sulfuric acid from bluestone, but I couldn’t find more than two pounds of it in the city, not nearly enough. Then I happened to see the massive piles of pyrite ore in the iron foundry. Treasure, right for the taking! Heating pyrite gives you sulfur dioxide, and dissolving that gives you sulfurous acid; let that sit for a while and you get sulfuric acid. You can purify that in clay jars; it’s how the munitions factories in Communist Shanbei managed, back in the day.\n“With sulfuric acid taken care of, nitric acid wasn’t hard. The biggest problem was the limited supply of saltpeter, which we also needed to make gunpowder. I had to mobilize everyone in the Institute to scrape crusted urine off the bases of walls to refine into potassium nitrate. Our entire place reeked! Fortunately, people in this city have a habit of pissing anywhere there’s a wall. If it weren’t for that, we couldn’t have built the foundations of industry in Jinyang.”\nZhu Dagun flushed. “Sometimes the urges of the bladder are too great. Both men and women commonly take off their trousers and relieve themselves where they stand. Please humor the crude customs of the countryside, Your Highness.”\nWhile they were speaking, the contents of the two jars had been combined into one, and the purple cloud had disappeared. Prince Lu spread the white paper screen out on the table and scraped the surface with a flat scrap of bamboo, removing a layer of purplish black powder. “The iodine in seaweed is easily oxidized in air under acidic conditions, creating elemental iodine. Very good, let me send them orders to follow my recipe and manufacture this in batches, and we’ll do the next experiment.” He crossed the room, sat down in front of the text tray in the corner, and began banging out a missive. Zhu Dagun walked over to look and discovered that this strange prince typed with lightning speed. He didn’t even glance at the characters, but typed blind with unfailing accuracy. “Your type tray looks like a different model, Your Highness,” Zhu Dagun blurted.\n“Old Wang, call me Old Wang,” said Prince Lu. “The principle’s the same, but each terminal uses two sets of movable type. The bottom set is used for input and the top set’s used for output. Watch.” He pressed the carriage return to end his message and stood up to grab a crank handle and turn it. The crank turned a roller on which a seventeen-inch-wide length of calligraphy paper had been spooled, passing it smoothly over the text tray. The movable type in the tray, to which ink had been applied, suddenly began to rise and fall, stamping characters onto the paper.\nZhu Dagun bent down to pick up the paper and began to read. “The experiment data is correctly recorded. I’ve told the chemistry department to oversee it. Return.” He looked at the prince with admiration. “This is far clearer and more convenient! White paper and black ink simply reads better to the eye. When are you releasing this on the markets? We’ll support it with all our might!”\nPrince Lu laughed. “This is only a prototype. Version two-point-one will use the same mechanism found in printers to stamp the output on the same line, instead of inking the characters all over the place and making it hard to read. You like the internet too? The thing I was least used to about this era was the lack of internet access, so I racked my brains to come up with this. I finally get to feel like a proper nerdy shut-in again.”\n“Your August Highness—er . . . Old Wang,” Zhu Dagun corrected himself when he saw Prince Lu’s expression. “May your servant ask, from which prefecture did you originally hail? Are you a scholar of the Central Plains? You have an extraordinary air about you, after all.”\nPrince Lu sighed. “The better question is, from what dynasty did I hail? The era I come from is one thousand sixty-one years, three months, and fourteen days distant.”\nZhu Dagun didn’t know if he was joking or raving. He did the arithmetic on his fingers and laughed obsequiously. “I see that you achieved the Way in Emperor Wu of Han’s time, and have lived on to today as an immortal!”\n“Not one thousand years in the past,” Prince Lu said unhurriedly. “One thousand years in the future—and nine hundred billion forty-two universes away.”\n9.\nZhu Dagun didn’t understand Prince Lu’s ravings, and he didn’t have time to dwell on them, because the next experiment had begun. Prince Lu placed a silver-plated copper coin into a small carved wooden chest, set the cup of newly-made iodine beside the coin, closed the lid, and lit a small clay brazier next to the chest to heat it a little. Soon, purple vapors came billowing out through the cracks in the chest. Heavens, we’re about to get some pills of immortality, Zhu Dagun thought, as he carefully waved the fan as Prince Lu instructed, afraid even to breathe too hard.\nA while later, Prince Lu pushed the brazier aside, opened the chest, and reached in with a soft cloth. He carefully lifted the copper coin, cushioned on the cloth, revealing that its silver surface was coated with something yellowish. Zhu Dagun peeked inside the chest and didn’t see any pills of immortality, but Prince Lu did an excited dance. “It worked! It really worked! Look, this yellow stuff is called silver iodide. All I have to do now is scrape it off into a jar and put it somewhere dark. I can perform another magic trick with this: put this coin somewhere dark, expose it to light for about ten minutes, develop the image with mercury fumes, and fix it with saltwater. Once it’s rinsed and dry, the coin will be covered with a picture of this room, identical in every last detail! This is the Daguerreotype process, which takes advantage of silver iodide’s photosensitivity. But we’re storing up silver iodide for something else, so I’ll have to show you at a later date.”\n“Without an artist, how can one obtain a picture?” Zhu Dagun asked, confused. “And . . . what miraculous powers does the yellow powder have? Does it impart health and sagehood on one who imbibes it?”\nPrince Lu laughed. “It’s not that kind of magic. In my day, silver iodide had two main uses. One was photosensitivity, like I mentioned. The other, well, you’ll see.” He worked as he spoke, scraping the powder off the coin into a small porcelain bottle, before pulling off his mask and stretching. “That’s all for now. I’m done for the morning. I’ll send out the instructions for manufacturing silver iodide, and then I can rest. You haven’t eaten, right? We can eat together later. You’re tall and strong, and pretty good with your hands—it must be all that alchemy experience. I have some things I want to ask you, so don’t wander off. I’ll be right back.”\nPrince Lu sat down at the text tray and began to type at a rattling pace. Now and then he cranked out a length of calligraphy paper and read it, nodding to himself. Zhu Dagun just stood there in the room, afraid to touch anything and accidentally break it, or trigger some mighty magic.\nAt this point, he finally remembered why he was there. He reached for his sleeve pouch, felt the copy of the Analects there, and took a deep breath. “Your Highness, there’s something that I don’t understand,” he said, looking down. “I hope you can advise your servant.”\n“Go ahead, I’m listening.” Prince Lu was still at the text tray, cranking the spool of calligraphy paper, too busy to spare a glance.\nZhu Dagun asked, “Your Highness, are you Han or Hu?”\n“Don’t be pretentious, call me Old Wang,” came the reply. “I’m Han. I grew up in Beijing’s Xichen District. My ma’s Hui Muslim, but I took after my ba. I may have played in the Niujie and Jiaozi neighborhoods as a kid, but I can’t live without pork, so no dice.”\nZhu Dagun had already learned to ignore Prince Lu’s incomprehensible ramblings. “If Your Highness is Han, why do you live in Jinyang instead of the southern lands?”\n“You wouldn’t understand even if I explained,” said Prince Lu. “I’m Han, but I’m not a Han from your era. I know perfectly well that, of the Five Dynasties and Ten Kingdoms, Liang, Tang, Jin, Zhou, and even your so-called Great Han were founded by other ethnic groups, and most of your people are Hu too. But once my plan succeeds, I’ll be back at my point of departure, and this temporal node of your universe won’t have a thing to do with me, got it?”\nZhu Dagun took a step closer. “Your Highness, how are we going to defeat the Song army?”\n“We can’t,” said Prince Lu. “We don’t have the soldiers or the food, and we can’t mass produce firearms. Flintlock muskets are easy to manufacture, but we don’t have nearly enough sulfur to make gunpowder. We scoured the city and only found a couple dozen pounds. We can’t do more than occasionally fire a cannon to give a scare. But that brings me to my next point. Though we can’t defeat the Song troops, we can hold out pretty easily. As long as Zhao Guangyi doesn’t find out how Liao is sending us grain under the surface of the water, Jinyang survives another day. Tying empty barrels to full barrels and sending them along the bottom of the Fen River is a trick you ancients would never think of.”\nZhu Dagun raised his voice. “But the commoners are hungry and weary, and the soldiers wail with pain and exhaustion! The longer Jinyang holds on, the more its tens of thousands of residents suffer, Your Highness!”\n“Hey, good point.” Prince Lu turned on his stool. “Everyone else is delighted to work here—not only are they pardoned for their crimes, they can even earn some money. But you don’t sound like them. Let’s talk, then. I haven’t had anyone normal to talk to in months. It’s been”—he pulled out a piece of paper, took a look, and drew another X on it—“three months, seven and a half days since I was dropped here. I’ve got twenty-three and a half days before the observational platform automatically returns. The schedule will be tight, but judging from my current progress, I should be able to make it.”\nZhu Dagun understood only the faint longing for home that underlay his words. He immediately recited, “The Master said: as long as parents are alive, one should not journey far from them without method. When one’s father lives, observe one’s aspirations; when he does not, observe one’s actions; if in time they do not deviate from the father’s way one can be termed filial. Your Highness has long been away from your home and must miss your parents dearly. Foxes die with their heads pointing toward their burrow; crows feed their parents in their old age; lambs kneel before they drink from their mother’s teat; stallions will not mate with their dam—”\nPrince Lu sighed. “Okay, we’re still not on the same frequency here. Can you shut up and listen?”\nZhu Dagun immediately shut up.\nPrince Lu spoke slowly. “I’m sure you don’t know the alternate universe theory or quantum mechanics, so I’ll go over them briefly. My name is Wang Lu. I was an ordinary nerd, amateur writer of chuanyue1 novels, and professional time traveler. In my time, we’d perfected the multiverse theory, so that anyone could go to an agency, rent an observational platform, and go time traveling. At one time, people estimated the number of parallel universes overlaying each other to be around 10^(10^118), but more precise calculations later on indicated that, due to overlap between different diverged branches, only about three hundred quadrillion universes exist at any one time. Countless particle-level possibilities cause universes to endlessly emerge, split, merge, and disappear, and yet even the two parallel universes with the most differences are astonishingly similar on a physical level, even as their places on a timeline diverge further and further.\n“In a way, this makes things boring, since humanity’s exploration of deep space remains stalled, and its understanding of the universe as a whole is very shallow. Even in the most advanced universe I’ve been to, humanity’s reach has gone no further than Alpha Centauri, just next door. But in another way, this makes things interesting, since with the invention of the wave function engine it means that we can step across to other parallel universes at our convenience. For topological reasons, the more similar the destination universe, the less energy it takes to travel there. The most advanced observational station we have can send travelers three hundred trillion universes away, though the commercially available equipment only has a maximum range of around forty trillion.”\nZhu Dagun kept nodding while he felt his sleeve pouch, inwardly debating whether to take out the dagger and persuade Prince Lu’s heart or take out the Analects and persuade his mind once he finished his raving. There was no one else in the room, creating a prime opportunity to make his move. It wasn’t that Zhu Dagun didn’t want to act promptly, but that he himself still felt somewhat undecided as to which esteemed personage he should act on behalf of.\nPrince Lu picked up his teacup and took a sip, then continued. “I accepted a job from the Peking University history department, a research task to tally the population of the Sixteen Prefectures during the late Five Dynasties and Ten Kingdoms period. A parallel universe like yours is located toward the front of the timeline, which makes it an excellent place for historical observation.\n“Don’t think just anyone can get a time travel license. You have to train systematically in quantum theory, computer operation, ground transportation, emergency drills, and more, and pass the test to get a job. If you want to lead tour groups, you have to take the Time Travel Tour Guide Examinations too. Due to the physical similarity between parallel universes, I activated the observational platform at Xuanwu Gate in Beijing to travel nine hundred billion forty-two universes and arrive here. By my calculations of revolution and rotation elements, I should have been able to arrive in You Prefecture. Who knew that my observational platform was getting long in the tooth? The wave function engine radiator boiled over, right in the middle of the trip! I had to pour in eight bottles of mineral water and a crate of Red Bull to get it to limp to the destination. The moment I arrived in this universe, the crown bar burst through the tank. That was the end of the engine. I crashed into a gully in Shanxi by the Fen River. My luggage, equipment, and spare fuel tanks were wiped out.\n“It took me ten days to patch together the engine, only to discover all the fuel had leaked out. The bit left in the oil lines could hop me two or three universes over at most. What use would a few hours forward be?”\nThe sounds of shouting and fighting from outside grew louder. The Song army had begun another assault on East City gate. Prince Lu turned to glance at the report scrolling out above the text tray and typed a few characters himself. “Don’t worry.” He laughed. “We’ll take care of it as usual. I’ll move two bladder catapults over . . . Where was I? Ah, right, the wave function engine could just barely start, and raising the angular speed made the engine oil give off blue smoke like a tractor, but the main problem was that I didn’t have any fuel. Taking that census was of course out of the question, but even worse, since I hadn’t filed this private job with the Ministry of Civil Affairs’ Multiverse Administrative Office, I couldn’t just call the time police for help when they’d put me in jail for three to five years! If I wanted to get home, I needed some way to gather fuel. I didn’t have a choice but to hide my things in the gully and sneak into Jinyang.”\n“Your Highness, you say you didn’t have any fuel, but isn’t the city full of fire-oil?” Zhu Dagun couldn’t resist interrupting. “Many carriages on the street burn fire-oil.”\nPrince Lu sighed. “If only it combusted oil. Let me put it this way, the fuel tank didn’t hold real, physical fuel, but potential energy, the elastic potential between parallel universes. If I wanted to fill my tank, I needed to create a universe split. When a new universe split off as a result of some decision point, I’d be able to gather this escaped potential energy to power my return. This potential energy isn’t something intangible like entropy values. It’s more like when you snap a bamboo pole in two, and you hear the crack as it splits apart? I don’t understand it that well myself, but either way I had to create a big enough event to make the universe split. Now, how could I do this? Let’s take an example from history—on the fourteenth of the third month this year, a resident of Jinyang slipped from the parapets and fell to his death in the Fen River. The incident was witnessed by twenty people and recorded in minor history books. If, on the fourteenth of the third month, I grabbed his collar and saved his life, I’d create a change. But it wouldn’t be big enough. Out of the one hundred quadrillion universes where this event occurred, he was saved in one quadrillion of them even without me. In that moment, the parameters in one of those universes would change until it perfectly matched the universe we’re in, and the two universes would merge. Of course, you and I wouldn’t feel anything from where we stand, but the potential would decrease, and even remove fuel from my tank. To cause a new universe to split off, I have to create a big enough change, a change so big that no precedent exists in any one of the one hundred quadrillion universes past this point in the timeline. I managed to use the beat-up wave function computer to find a possibility, one that I could achieve without any modern equipment to help me.”\nZhu Dagun didn’t speak, only listened intently.\nPrince Lu suddenly pulled open a drawer and took out a book. He read from it, “‘In the sixth month of 882 CE, the height of summer, Shang Rang led an army from Chang’an to attack Fengxiang. He had reached Yijun Camp when suddenly a great blizzard fell. Within three days, the snow was many feet thick. Thousands died or became frostbitten in the cold, and the Qi army retreated in defeat to Chang’an.’ Have you heard of this incident?”\n“Huang Chao’s rebellion!” Zhu Dagun finally had an opportunity to add to the conversation. “Shang Rang was Grand Commandant of Qi. The story of the blizzard in the second year of Zhonghe is still oft told among the people. It’s recorded in the historical annals as well.”\n“Exactly,” said Old Wang. “I’m a modern man, but I don’t have death rays or nukes or any kind of sci-fi weaponry, and I don’t have the Starship Enterprise or Macross to back me up. All I can do is use the scraps of knowledge I got from high school and college to alter this era as much as possible. It’s a historical fact that Song conquered Northern Han. In the vast majority of universes, the annals record that on the fourth day of the fifth month, the Song army took Jinyang and the Han ruler Liu Jiyuan surrendered. On the eighteenth day of the fifth month, Emperor Taizong of Song drove out all the city’s inhabitants and burned Jinyang to the ground. But here, I’ve already postponed these dates for more than a month. The Song army can’t stay here indefinitely; anyone can see that the primitive siege weapons of this era can’t break through the fortifications strengthened with my knowledge. Once the Song army retreats, history will be completely rewritten, and the universe will split, without a doubt!” He toyed with the little bottle of silver iodide and laughed delightedly. “And that’s without mentioning my new invention. This little thing is going to change history immediately and fill my observational platform’s fuel tank! The ancients believed in omens from the heavens more than anything. What could change history more than a snowstorm in the middle of summer?”\n“Burn . . . Jinyang? Snowstorm?” Zhu Dagun said numbly.\n“It’s easier to show than to explain! Follow me!” Prince Lu leapt to his feet and dragged Zhu Dagun by his sleeve to the room’s west wall. He pulled some mechanism, a hinge turned, and the entire wall suddenly fell outward to reveal a courtyard hidden among dense overhanging eaves. The blinding sunlight forced Zhu Dagun to squint; it took a few moments before he could clearly see the contents of the courtyard.\nHe was astonished. Laid out in the courtyard were many extraordinary things that he’d never seen before and didn’t know the names of. Several dozen East City Institute workers were laboring under the hot sun. They knelt to pay their respects when they saw the prince. Prince Lu smiled and waved a hand. “Continue. Don’t mind me.”\n“We’re testing the hot air balloon,” Prince Lu explained, pointing at the workers in the middle of sewing cotton fabric. “I agreed to build an airship for the emperor so he can escape to Liao. An airship takes more time than this, but I’ll do what I can and build a balloon for now. When I came to Jinyang, I made a few flashy novelties and bribed some minor officials for an audience with the emperor. I told him I could make Jinyang impregnable for him, and he granted me the convenient title of Prince of Lu right on the spot. I have to repay that kind of generosity.”\nThey turned and came to a group of workers filling a cannon cast of black iron with gunpowder. “This cannon will be used to fire a cloud-seeding canister. Gunpowder isn’t strong enough a propellant, so we need the hot air balloon to lift the cannon into the air, and then fire it up at an angle. I’ve been keeping a close eye on the weather patterns lately. Don’t be fooled by how hot it is; the clouds that drift in from the Taihang Mountains every afternoon are full of cold air. By providing enough condensation nuclei at the right time, we can create a snowstorm out of nowhere!” Prince Lu grinned. “I sent the recipe over earlier. The chemical factory off-site is currently devoting all its resources to manufacturing silver iodide powder. It won’t be long before we can fill a cloud-seeding canister and load it into the cannon. We’ve already test-flown the hot-air balloon. All we have to do is wait for the right weather conditions!”\nZhu Dagun gazed up at the clear and fair sky. The sun shone like fire. The distant sounds of battle were fading; a magpie squawked from the eaves. A fire-oil carriage rumbled along a stone-paved road. The air smelled of blood, oil, and flatcakes. Zhu Dagun stood by the prince, unable to move, his mind in a muddle.\n10.\nThe wall swung shut, returning the room to darkness. They ate a little. Prince Lu sent instructions to the city defense and the workshops through the internet, asking Zhu Dagun questions about alchemy as he worked. Zhu Dagun braced himself and spouted enough smooth-talk and nonsense to pass muster.\n“Ah, I need to sleep. I pulled an all-nighter and I’m running out of steam.” Prince Lu stretched wearily and headed for the cot in a corner of the room. “Keep an eye out, will you? Wake me if there’s any news.”\n“Yes, Your Highness.” Zhu Dagun bowed respectfully. He watched as Prince Lu lay down, pulled the brocade covers around himself, and soon began to snore. He let out a quiet breath and sat down, head spinning, to collect his chaotic thoughts.\nZhu Dagun didn’t understand everything Prince Lu had said, but he grasped the tone of his words clearly enough. The master of the East City Institute couldn’t care less about the Han dynasty or the people of Jinyang. He had come from a different land, and he would ultimately return there. He’d created his dazzling novelties and exotic toys to garner public support and earn money. He designed the internet to win over the scholar gentry and relay the East City Institute’s orders; he sold the fire-oil carriages, weapons, and fine wine to show goodwill toward the military; and the life-saving grain, deadly fire, and impossible snow were all, in the end, to further Prince Lu’s own selfish goals. Han Feizi had written, “Consider one who refuses to enter a dangerous place or fight in the army, who will not for the gain of all the people sacrifice even one hair on their leg . . . you have one who values life above all else.” Was Prince Lu not “one who valued life above all else?”\nSomething was fomenting inside of Zhu Dagun. His chest felt stuffed, his head swollen. His ears rang. He thought of what Ma Feng and Guo Wanchao, Liu Jiye, and the emperor had said. He thought of this state, this prefecture, this city, and the tens of thousands of living beings within. Liang, Tang, Jin, Zhou, and Han had taken the land in turn; Hu and Han were thrown together in this time of chaos. An inhabitant of this turbulent era, Zhu Dagun had once considered abandoning the brush for the sword and carve out some great undertaking. He’d settled in a quiet corner discussing philosophy all day long, not because he was lacking in strength or courage, but because he lacked for direction. The scholars frequently chatted of the grand principles of governing a state and bringing peace to the land. Zhu Dagun always thought that it was empty words, but what aside from their arrogant talk of the halcyon days of the Rule of Wen and Jing, the Restoration of Zhao and Xuan, the Golden Age of Kaiyuan, had they to while away their time? All he wanted was food, a bed, and a roof to sleep under; to spend his leisure time chatting and drinking; to be able to roll into bed after eating, express his aspirations online, visit the brothels when he had the money; to be at ease with the world. But in this era of chaos, to be at ease with the world in itself required swimming against the flow. Even a minor character like him had been dragged into a struggle for the survival of a country. At this moment, he held the fate of Great Han and the lives of everyone in the city in his hands. If he didn’t do something, how could he claim to be a scholar, one who spent twenty years filling himself with the words of sages?\nZhu Dagun pulled the fine steel dagger from his sleeve. He knew he couldn’t persuade Prince Lu because Prince Lu wasn’t a citizen of Han. Grand principles were a sham to him; only the six and three-tenths inches of steel in Zhu Dagun’s hand were real. In this moment, an idea floated into Zhu Dagun’s mind, perfect in three ways. He slowly unfolded his large frame and stood, a smile hovering on the corners of his mouth. He stepped soundlessly across the floorboards and reached the cot in a few steps—\n“What the fuck are you doing!” Prince Lu snapped up, eyes wide and staring. “I got bitten by a mosquito and got up to burn some bug-repelling incense. What are you doing here with a knife? I’m going to call my memmmph”\nZhu Dagun had covered Prince Lu’s mouth solidly, setting the dagger at his pale, tender neck. “Don’t make noise and I’ll leave you a way out,” he murmured into the prince’s ear. “Earlier, I saw you use the internet to move the East City Institute’s city defense forces. You had a row of wooden movable type in your text tray. Give me the type blocks and tell me your passphrase, and I won’t kill you.”\nPrince Lu was a prudent man. He nodded frantically, his forehead beaded all over with sweat. Zhu Dagun loosened his fingers, allowing a gap. Prince Lu gasped and panted as he took the movable type of red-colored wood from his pocket and threw them on the cot. “There’s no passphrase,” he stammered. “My orders pass through a special line straight to the city defense camps and the workshops. No one can fake it . . . Why are you doing this? I’ve protected Jinyang and invented countless novelties for every facet of life for soldiers and civilians alike to enjoy. Everyone in the city loves me. Where have I wronged Northern Han, wronged Taiyuan, wronged you?”\nZhu Dagun laughed mirthlessly. “Empty words. You look out only for yourself, while I plan for the benefit of a city’s worth of people. First, I’ll order the East City Institute to stop the defense. Once the fire-dragons, pillars, and catapults have stilled, General Guo Wanchao will open the gates and welcome the Song army in.\n“Second, Minister Ma Feng is waiting inside the palace. Once the city gates are open and the army is thrown into panic, he will persuade the ruler Liu Jiyuan to come out with his family and surrender. But I will take the emperor and help him escape in the chaos, aboard the so-called hot air balloon to the Khitans.\n“Third, I will bind you and give you to Zhao Guangyi, trading you for the lives of the city’s inhabitants. The Song army has besieged the city for three months without success; the Song ruler must be filled with hate for you, the inventor of the city’s defensive machines. If I bring you to him bound hand and foot, he is certain to be greatly relieved and spare Jinyang from the sword. In this way, I will not fail Guo Wanchao, Liu Jiye, or the emperor, or the people in danger of terrible suffering. I can achieve both benevolence and justice!”\nPrince Lu gaped. “What kind of crappy plan is that? Whose faction are you in? You’ve cut everyone else a sweet deal, but I get thrown to the wolves, huh? Do you have to be so extreme? Let’s talk it out; everything is open to discussion. All I wanted was to gather a bit of energy and go home. Does that make me a bad person? Did I do anything wrong? Did I do anything wrong?”\n“You did nothing wrong. I did nothing wrong. No one did anything wrong. So whose fault is it?” Zhu Dagun asked.\nOld Wang didn’t have a chance to come up with an answer to this profound philosophical question before the dagger hilt struck his forehead, knocking him unconscious.\n11.\nWang Lu slowly regained consciousness, just in time to see the hot air balloon slowly rise above the roof of the main building of the East City Institute. The balloon was sewn from one hundred and twenty-five panels of thick lacquered cotton, with a basket woven from bamboo. The basket held a fire-oil burner and the heavy pig iron cannon. Three or four people were squeezed into the basket in clear disregard of weight capacity, but as the throttle opened and the flames roared, hot air swelling the balloon, the massive flying object continued its swaying ascent. The dark brown lacquer gleamed in the setting sun, the balloon’s long shadow stretching across Jinyang.\n“It worked . . . it worked!” Wang Lu sat right up, laughing skyward. The north wind was blowing, the summer heat dissipating in its chill. Clumps of water-vapor-rich clouds were gathering in the sky, perfect weather for artificially inducing snow. The time traveler watched the balloon as it rose higher and higher into the heavens, muttering, “Not enough not enough not enough, two hundred meters higher and then it can fire, a little more, a little more . . . ”\nHe tried to stand and find a better angle to observe from, only to realize that he couldn’t move his legs. He looked down and discovered that he was tied onto a fire-oil carriage parked in the middle of the road. The driver lay slumped over in his seat, dead. He looked farther and saw that the road was covered in piles of corpses—Han soldiers, Song soldiers, and Jinyang civilians, all dead in a variety of ways. Blood flowed down the roadside ditch, moistening yellow earth that had lain dry for months. Crying, screams, and the sounds of fighting came from the distance, like the roll of thunder on the horizon. And yet Jinyang seemed abnormally still, except for the crows circling and gathering in the sky.\n“Fuck, what happened?” Wang Lu yelled, trying to twist free. His hands and feet had been soundly tied; movement made the coarse fibers slice agonizingly into his flesh. The prince let loose a string of curses, panting roughly, afraid to struggle further. At this time, a cavalry troop shot down the street, their armor and uniform marking them as Song. The riders didn’t even glance at Wang Lu as their steeds galloped toward the East City Gate, trampling the corpses. A few snatches of conversation lingered in the air.\n“—We’re too late! What do we do if our arrows can’t hit it?”\n“—It’s not a south wind, but a north wind. It’ll never reach Liao. It’ll only be blown southward—”\n“—Will we be blamed?”\n“—Otherwise we’d be too late!”\n“Hey! What are you doing! Don’t leave me here!” Wang Lu yelled wildly. “Tell your master I know physics and chemistry and mechanical engineering! I can build you a steampunk Song Empire! Hey, wait! Don’t go! Don’t go . . . ”\nThe hoofbeats faded. Wang Lu looked up despairingly. The hot air balloon was now a small dot high in the sky, drifting southward with the north wind. Bang. He saw the puff of white smoke rise a moment before the sound reached him. The cannon had fired.\nWang Lu’s eyes filled with the light of his last hope. He wrenched his head down, bit his clothing, and tore it aside, revealing the skin of his chest. A line of light glowed beneath his left collarbone: the fuel gauge for the observational platform. At the moment, it displayed red to indicate low power. The wave function engine required at least thirty percent to carry him back; snow in July would create a universe split that would fill his tank to at least fifty. “Come on.” He was crying, bleeding, talking to himself with gritted teeth. “Come on come on come on and give me a big fat blizzard!”\nEach gram of silver iodide powder could generate more than ten trillion particles; five kilograms was enough to create all the ice crystals for a blizzard. It seemed ridiculous, that someone could artificially create snow in an era of such low technology, but perhaps the time traveler’s crazed prayer had been fulfilled: the clouds began to gather in the sky, roiling, pitch-black and restless, reducing the setting sun behind them to a thread of golden light.\n“Come on come on come on!” Wang Lu roared toward the sky.\nA rumble of thunder resonated to the horizons. First, rain fell, cold rain mixed with ice crystals. But as the ground temperature continued to drop, the rain became snow. A single snowflake drifted down, landed on the tip of Wang Lu’s nose, and instantly melted from his body heat. But right after it came a second, then a third, heralding their quadrillions of compatriots.\nThe drenched time traveler laughed heavenward. It was a proper blizzard in July, the snow coming down in clumps; he couldn’t wait to see the palaces, buildings, willows, and walls painted powder white. Wang Lu looked down and saw the gauge on his chest glowing green. The engine’s energy forecast had crossed the baseline; the moment this universe split into two, the observational platform would collect the energy and automatically activate. In a moment too brief to be assigned a unit, it would send him home to his warm 900 square foot apartment near the Beiyuan neighborhood roundabout, Tongzhou District, Beijing.\n“This will be legendary,” Wang Lu said to himself, shivering. “I’m going to go home, find a less dangerous job, find a wife, squeeze my way onto the subway every day to go to work, and do nothing but play video games when I get home. I’ve had enough adventure for a lifetime, truly . . . ”\nAt the rate the snow was accumulating, it would have taken less than an hour to bury Jinyang under a yard of white. But right at that moment, twenty dragons of fire rose from the four directions.\nFrom the dozen gates of West, Central, and East City, the fire-dragon chassis were spraying pillars of flame, accompanied by countless pig bladder catapults hurling fireballs. They were weapons of city defense he’d built with his own hands, weapons the Song army had feared more than any other.\n“Wait a . . . ” The light went out of Wang Lu’s eyes. “No, are they burning Jinyang down anyway? At least they could wait a little, until this snow’s done . . . wait, wait—”\nThick, viscous fire-oil sprayed everywhere; flames roared heavenward. The fires spread with a speed beyond anyone’s imagination. Jinyang had been long under drought, and the precipitation called by the time traveler hadn’t the chance to soak into tinder-dry timbers.\nThe fire in West City began in Jinyang Palace, engulfing Xiqing Ward, Guande Ward, Fumin Ward, Faxiang Ward, and Lixin Ward in turn in a sea of flames. The fire in Central City set the great water wheel alight first, then burned west toward Xuanguang Hall, Renshou Hall, Daming Hall, Feiyun House, Deyang Hall. The East City Institute soon transformed into a brilliant torch. The snowflakes whirling above vaporized without a trace before they had a chance to land. The green light on the time traveler’s chest faded. He howled his grief and agony, “Motherfucker, I was so close, so close!”\nBathed in fire, Jinyang lit dusk into daytime. The air boiled in the inferno; a scarlet dragon of flame wheeled upward, dispersing the clouds in an eyeblink. No one saw the fallen snow; they only saw flames that touched the heavens. The ancient city, first built in the Spring and Autumn Era, more than one thousand four hundred years before this moment, wailed distantly in the flames.\nJinyang’s fortunate survivors were being driven northeast by the Song army, looking back with every step, their weeping loud enough to shake heaven. The Song ruler Zhao Guangyi sat astride his warhorse, gazing at the flames of distant Jinyang and the figures kneeling before him.\nHe said, “When you’ve captured the pretend-emperor Liu Jiyuan, come and see me. Do not harm him. Guo Wanchao, I confer upon you the title of Militia Commander of Ci Prefecture. Ma Feng, I name you Supervisor of Imperial Construction. You two have done me service, and I hope you will turn all your ingenuity and wisdom to my Great Song from today onward. Liu Jiye, why do you refuse to surrender when all the others have? Do you not know the parable of the praying mantis who attempted to block the passage of a chariot?”\nLiu Jiye, his hands bound, turned to kneel northward. “The ruler of Han has yet to surrender,” he said stubbornly. “How can I surrender first?”\nZhao Guangyi laughed. “I’ve long heard of Liu Jiye of the East Bank. You live up to your reputation. You can surrender once I capture the little emperor. You should revert to your original name of Yang. Why should a Han try to protect a Hu? If you want to fight, you should turn and fight the Khitans, don’t you think?”\nHaving finished talking to these men, Zhao Guangyi rode forward a few steps. He bent down. “What do you have to say?”\nZhu Dagun knelt on the ground, afraid to raise his head. From the corners of his eyes, he could see the raging flames on the horizon. “I claim no accomplishment,” he said, shaking. “I only ask that I be judged to have done no trespass.”\n“Very well.” Zhao Guangyi waved his whip. “Posthumously grant him the title Duke of Tancheng, with a feifdom of thirty miles square. Chop off his head.”\n“Your Imperial Majesty! What wrong did I commit?” Zhu Dagun stood up in shock, flinging aside the two soldiers next to him. Four or five more tackled him. The executioner raised his sword.\n“You did nothing wrong. I did nothing wrong. No one did anything wrong. Who knows whose fault it is?” said the Song ruler indifferently.\nThe head rolled to a stop; the large frame thudded to the ground. The copy of Analects fell from Zhu Dagun’s sleeve pocket and into the puddle of blood, soaking through, until not a single character could be distinguished.\nEverything the time traveler had created burned to ashes with Jinyang. After a new city was built nearby, people gradually came to think of those days of wonders as an old dream. Only Guo Wanchao would sometimes take out the “Ray-Ban” sunglasses while drinking with Zhao Da in the Ci Prefecture army camp. “If he’d been born in Song, the world would be a completely different place, huh.”\nThe Song conquest of Northern Han received only a brief description in the History of the Five Dynasties. One hundred sixty years later, the historian Li Tao at last wrote the great fire of Jinyang into the official histories, but naturally there were no mentions of a time traveler.\n“In [979 CE], the emperor visited Taiyuan from the north through Shahe Gate. He dispatched the residents in groups to the new governing city of Bingzhou, setting fire to their homes. Children and the elderly did not reach the city gates in time, and many burned to death.”\n—Extended Continuation of Zizhi Tongjian, Book 20\nFootnote\n1 - Chuanyue is an enormously popular Chinese genre similar to time travel, but with its own distinct tropes. Typically, the protagonist is from the modern day and travels into the historical past (or a secondary world version of the historical past,) often but not always through reincarnating into the body of someone of that era. Their anachronistic knowledge and upbringing sets them apart from others and allows them to break the status quo.\nOriginally published in Chinese in New Science Fiction, January 2014.\nTranslated and published in partnership with Storycom.\nBorn in 1981, Zhang Ran graduated from Beijing Jiaotong University in 2004 with a degree in Computer Science. After a stint in the IT industry, Mr. Zhang became a reporter and news analyst with Economic Daily and China Economic Net, during which time his news commentary won a China News Award. His stories have won numerous Gold and Silver Chinese Nebula Awards, and three Galaxy Awards for Best Novelette. He runs a coffee shop in southern China and writes in his spare time. The Windy City, his short story collection, was published in 2015.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.\nBorn in China and raised in the United States, Carmen Yiling Yan was first driven to translation in high school by the pain of reading really good stories and being unable to share them. Since then, her translations of Chinese science fiction have been published in Clarkesworld, Lightspeed, and Galaxy’s Edge, as well as numerous anthologies. She graduated from UCLA with a degree in Computer Science, but writes more fiction than code these days. She currently lives in the Midwest.", "source": "https://clarkesworldmagazine.com/zhang_06_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Snow of Jinyang by Zhang Ran, translated by Ken Liu and Carmen Yiling Yan"}