{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "K4V2zXUkg5pMmkxxvGcm4aKsSms=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Caste in Blood: A Conversation with Juliette Wade  Juliette Wade started writing fiction while studying for her PhD—a combination of linguistics and anthropology: “a ridiculously close look at cultural clashes inside classrooms where American students were learning Japanese, investigating how those impacted the way the students learned politeness grammar.” After finishing her degree, she continued to write in spare moments while working at home, raising her two sons. Wade has traveled the world as well as lived in France and Japan. Her fiction draws heavily on her academic background, her experiences in other countries, and her love of languages.  Wade’s first fiction sale was in 2008 to Analog Science Fiction and Fact. She was a judge for the 2015 Canopus Awards and her stories have appeared on the shortlist for Analog’s Analytical Laboratory Award five times. She has over a dozen stories out and her debut novel, Mazes of Power—first in The Broken Trust series—is due out from Penguin Random House/DAW in February of 2020. She has a blog, Dive Into Worldbuilding, where she discusses craft and holds interviews with authors such as Aliette de Bodard, Fonda Lee, Rebecca Roanhorse, and Nisi Shawl.   What books did you read growing up and how did reading transition into being a writer?  I was a voracious reader as a child, especially of fairy tales and folktales from different cultures across the world. I still have many of my folktale collections, including for example the gorgeously illustrated Folktales of the Amur by Dmitri Nagishkin, illustrated by Gennady Pavlishin, and I also consumed a ton of fantasy—I had a period where I would go to the library and check out any book with the word “magic” in the title. The Hobbit by J. R. R. Tolkien was a favorite; Red Moon and Black Mountain by Joy Chant also snared my imagination.  I started reading science fiction in junior high school; I recall finding Bradbury’s The Illustrated Man fascinating but terrifying. At that time, I loved to invent different species of fantastical creatures, but never felt I had any good book ideas. Then when I was twelve I went to visit the Gouffre de Padirac, a cavern in France, where I rode on a boat on an underground river. The following summer I had A Big Idea for a story set in an underground city. I tried to write it in ninth grade, but stopped when I realized I couldn’t write it the way it needed to be written. That idea, that world, never left me, even though I wrote very little fiction in high school or college. What did happen during that time was that my studies in anthropology and linguistics gave me a new perspective on the idea, and turned it from fantasy into sociological science fiction. I started writing the Varin world seriously in 1999, and discovered that I couldn’t stop. Fiction writing had captured me.  Looking at your website and ISFDB, your first sale was “Let The Word Take Me” to Analog Science Fiction and Fact in 2008. Did you go to workshops, receive rejections, and struggle towards selling fiction? Or did you start selling to pro markets right out of the gate?  By the time I got serious about trying to get published, I had written well over 350 thousand words, but I also had a three-month-old baby, so going to workshops wasn’t really an option for me. I had started writing short fiction at the recommendation of friends, to hone my craft, and I sent stories to a lot of markets but was universally rejected. “Let the Word Take Me” was my first ever piece of linguistics-based science fiction, my own take on the linguistic concept behind the famous Star Trek episode “Darmok.” I sent that to a number of markets and got long, incredibly helpful rejections (one, notably, from Strange Horizons), and revised it extensively. Then at a convention I told Sheila Finch (The Guild of Xenolinguists) about the story and she asked if I had considered sending it to Stanley Schmidt. I had never considered myself a writer of hard science fiction, so it had never occurred to me to send to Analog. When I sent the story to Stan, he replied “I like this.” I was shocked down to my toes! I changed a few details at his request, and that’s how I made my first sale.  Have you been able to sell everything you write? Are there stories you sold but which took a bit longer to find a home? Are there projects you felt like you had to trunk?  I write slowly, and I don’t write a lot of stories. Instead, I tend to take an idea and work it and redo it and rework it and refine it until it gains the right kind of internal resonances and turns into something good. I have sold every piece of linguistic science fiction I ever wrote—it’s something that really inspires me. Other stories took years to find a home. I’ve trunked a handful of stories. Around 2012, I decided I didn’t want to be exclusively “that woman who writes linguistic science fiction for Analog” and I put a lot of work into creating fantasy stories, some using my background in Japanese language and culture, and some in my Varin world. The first one of those I sold was “Suteta Mono de wa Nai (Not Easily Thrown Away),” to Clarkesworld in 2014. That was a huge break for me.  Eleven years later, your debut novel Mazes of Power is coming out with DAW. Is this the first novel you wrote, or are there other books you worked on along the way? Had you been working on this one since the beginning?  Mazes of Power is not the first novel I wrote—technically, it’s the fifth. However, it’s set in Varin, and it’s therefore a piece that has thirty plus years of cumulative work behind it, even though writing the book itself only took about two years. The novel idea I attempted in ninth grade proved to be a different part of the far larger timeline of Variner history. I have three Varin books that I have attempted, put down, broken, and reinvented as I learned the skills to make them work the way they needed to. I also have a completely different novel world that I started working on when I worried I had all my eggs in the Varin basket! That one is a linguistics- and literature-based fantasy setting.  How does format or length change your approach to writing fiction?  My initial attempts at writing were all novels, and for a time I had no concept of writing short fiction at all. When I first attempted short fiction, the stories were vignettes pulled from the larger Varin setting, which didn’t stand alone. Discovering that I love writing linguistic science fiction stories had a great impact. Those stories tend to be puzzles, constructed scene by scene as a person or alien tries to find a linguistic and cultural answer in a complex situation. For a long time, I despaired of writing anything shorter than a novelette, but my skills have improved! For me, writing a shorter piece is more about getting an idea of the right size than it is about word-cutting. I came to the novella length relatively late, but it has turned out to be a length I love to work at, especially when I’m exploring the complexities of the Varin world.  Some writers use shorter fiction to experiment with style or ideas. You have over a dozen shorter pieces out, most recently “The Persistence of Blood” in Clarkesworld #138 (technically a novella). Has writing short fiction or novella-length fiction helped with the novel in any way, or are they unrelated for you?  I have learned a ton from writing short fiction. I found it really helped me deepen my understanding of story structure. Manipulating structure in a short format helped me to understand how to move structural pieces on a smaller scale, and from there to begin seeing what I was doing structurally in my novels. I also will often write short fiction to explore a character from a larger work in more depth. Lady Selemei, from “The Persistence of Blood,” is one of those characters.  The Mazes of Power copy calls it “sociological science fiction.” What does this mean exactly, and how does this term apply to Mazes? What are a few of your favorite sociological science fiction novels and how are they similar or different from Mazes?  Sociological science fiction, sometimes also called social science fiction, is science fiction that sets its major focus on society and its impact rather than on other elements like gadgets, technologies, or frontiers. This is not to say that those other things are not involved! The term definitely applies to Mazes of Power, which features a complex caste system with seven different levels, each of which has its own vocation, ideals, manners, and culture. Members of the castes struggle to cope with the expectations of their caste identities just as people in our world struggle with the identities that are placed on them. My favorite past work of sociological science fiction is Ursula K. Le Guin’s The Left Hand of Darkness, which was one of the works that inspired me to explore characters’ culturally grounded judgments and flout readers’ underlying expectations. (The other major work that had the same effect was not science fiction, but the diary of Sei Shonagon, The Pillow Book.) I also consider Ann Leckie’s Imperial Radch series an example of sociological science fiction, though it’s more typically categorized as space opera. I love how Leckie keeps her focus tight and examines characters’ social and cultural expectations even as she works with the larger politics of the Radchaai Empire.  “The Persistence of Blood” is a tale about aristocrats, gender, childbirth, tradition, law, and more, with a female protagonist. Are there important similarities and differences in themes, concerns, characters, or style between this story and Mazes? Are there elements in the two that often appear in your fiction?  “The Persistence of Blood” is a prequel to Mazes of Power, and it is written in the same style, inasmuch as it uses a very tight third person point of view and looks at how the character reacts to both personal and political events. Lady Selemei does appear in Mazes, although she’s a secondary character there. Mazes uses three points of view, and takes a broader view of Variner society. I would call it a “zoom out” effect. Women’s issues are very important in Mazes as well, but they are only the beginning. I’m always fascinated by the way people exist inside of larger societal systems, and how the biases and influences of those systems show in the behaviors of individuals. That is a theme that can be seen in a great many of the stories I’ve written.  What is special or most important to you about Mazes of Power; what do you really want fans and readers to know about this book?  The social systems of Varin are what make this book unique. I designed Varin intending the society to feel very familiar to many readers, but to subvert expectations constantly. A reader should feel strangely at home—but while Varin features many of the same social issues as our own world, you should never quite know where those issues are going to become relevant. One friend who read the book said it reflected our own society as if in a fun house mirror. The social systems of Varin are inextricable from the characters, and inextricable from the power struggle the characters experience; they are almost a character in themselves.  What are you working on now that readers can look forward to?  Right now I’m writing hard on the sequel to Mazes of Power, which will be called Transgressions of Power. It’s going to change the camera angle in some interesting ways, and continue to explore regions of Varin that no one has yet seen. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nCaste in Blood: A Conversation with Juliette Wade\nJuliette Wade started writing fiction while studying for her PhD—a combination of linguistics and anthropology: “a ridiculously close look at cultural clashes inside classrooms where American students were learning Japanese, investigating how those impacted the way the students learned politeness grammar.” After finishing her degree, she continued to write in spare moments while working at home, raising her two sons. Wade has traveled the world as well as lived in France and Japan. Her fiction draws heavily on her academic background, her experiences in other countries, and her love of languages.\nWade’s first fiction sale was in 2008 to Analog Science Fiction and Fact. She was a judge for the 2015 Canopus Awards and her stories have appeared on the shortlist for Analog’s Analytical Laboratory Award five times. She has over a dozen stories out and her debut novel, Mazes of Power—first in The Broken Trust series—is due out from Penguin Random House/DAW in February of 2020. She has a blog, Dive Into Worldbuilding, where she discusses craft and holds interviews with authors such as Aliette de Bodard, Fonda Lee, Rebecca Roanhorse, and Nisi Shawl.\nWhat books did you read growing up and how did reading transition into being a writer?\nI was a voracious reader as a child, especially of fairy tales and folktales from different cultures across the world. I still have many of my folktale collections, including for example the gorgeously illustrated Folktales of the Amur by Dmitri Nagishkin, illustrated by Gennady Pavlishin, and I also consumed a ton of fantasy—I had a period where I would go to the library and check out any book with the word “magic” in the title. The Hobbit by J. R. R. Tolkien was a favorite; Red Moon and Black Mountain by Joy Chant also snared my imagination.\nI started reading science fiction in junior high school; I recall finding Bradbury’s The Illustrated Man fascinating but terrifying. At that time, I loved to invent different species of fantastical creatures, but never felt I had any good book ideas. Then when I was twelve I went to visit the Gouffre de Padirac, a cavern in France, where I rode on a boat on an underground river. The following summer I had A Big Idea for a story set in an underground city. I tried to write it in ninth grade, but stopped when I realized I couldn’t write it the way it needed to be written. That idea, that world, never left me, even though I wrote very little fiction in high school or college. What did happen during that time was that my studies in anthropology and linguistics gave me a new perspective on the idea, and turned it from fantasy into sociological science fiction. I started writing the Varin world seriously in 1999, and discovered that I couldn’t stop. Fiction writing had captured me.\nLooking at your website and ISFDB, your first sale was “Let The Word Take Me” to Analog Science Fiction and Fact in 2008. Did you go to workshops, receive rejections, and struggle towards selling fiction? Or did you start selling to pro markets right out of the gate?\nBy the time I got serious about trying to get published, I had written well over 350 thousand words, but I also had a three-month-old baby, so going to workshops wasn’t really an option for me. I had started writing short fiction at the recommendation of friends, to hone my craft, and I sent stories to a lot of markets but was universally rejected. “Let the Word Take Me” was my first ever piece of linguistics-based science fiction, my own take on the linguistic concept behind the famous Star Trek episode “Darmok.” I sent that to a number of markets and got long, incredibly helpful rejections (one, notably, from Strange Horizons), and revised it extensively. Then at a convention I told Sheila Finch (The Guild of Xenolinguists) about the story and she asked if I had considered sending it to Stanley Schmidt. I had never considered myself a writer of hard science fiction, so it had never occurred to me to send to Analog. When I sent the story to Stan, he replied “I like this.” I was shocked down to my toes! I changed a few details at his request, and that’s how I made my first sale.\nHave you been able to sell everything you write? Are there stories you sold but which took a bit longer to find a home? Are there projects you felt like you had to trunk?\nI write slowly, and I don’t write a lot of stories. Instead, I tend to take an idea and work it and redo it and rework it and refine it until it gains the right kind of internal resonances and turns into something good. I have sold every piece of linguistic science fiction I ever wrote—it’s something that really inspires me. Other stories took years to find a home. I’ve trunked a handful of stories. Around 2012, I decided I didn’t want to be exclusively “that woman who writes linguistic science fiction for Analog” and I put a lot of work into creating fantasy stories, some using my background in Japanese language and culture, and some in my Varin world. The first one of those I sold was “Suteta Mono de wa Nai (Not Easily Thrown Away),” to Clarkesworld in 2014. That was a huge break for me.\nEleven years later, your debut novel Mazes of Power is coming out with DAW. Is this the first novel you wrote, or are there other books you worked on along the way? Had you been working on this one since the beginning?\nMazes of Power is not the first novel I wrote—technically, it’s the fifth. However, it’s set in Varin, and it’s therefore a piece that has thirty plus years of cumulative work behind it, even though writing the book itself only took about two years. The novel idea I attempted in ninth grade proved to be a different part of the far larger timeline of Variner history. I have three Varin books that I have attempted, put down, broken, and reinvented as I learned the skills to make them work the way they needed to. I also have a completely different novel world that I started working on when I worried I had all my eggs in the Varin basket! That one is a linguistics- and literature-based fantasy setting.\nHow does format or length change your approach to writing fiction?\nMy initial attempts at writing were all novels, and for a time I had no concept of writing short fiction at all. When I first attempted short fiction, the stories were vignettes pulled from the larger Varin setting, which didn’t stand alone. Discovering that I love writing linguistic science fiction stories had a great impact. Those stories tend to be puzzles, constructed scene by scene as a person or alien tries to find a linguistic and cultural answer in a complex situation. For a long time, I despaired of writing anything shorter than a novelette, but my skills have improved! For me, writing a shorter piece is more about getting an idea of the right size than it is about word-cutting. I came to the novella length relatively late, but it has turned out to be a length I love to work at, especially when I’m exploring the complexities of the Varin world.\nSome writers use shorter fiction to experiment with style or ideas. You have over a dozen shorter pieces out, most recently “The Persistence of Blood” in Clarkesworld #138 (technically a novella). Has writing short fiction or novella-length fiction helped with the novel in any way, or are they unrelated for you?\nI have learned a ton from writing short fiction. I found it really helped me deepen my understanding of story structure. Manipulating structure in a short format helped me to understand how to move structural pieces on a smaller scale, and from there to begin seeing what I was doing structurally in my novels. I also will often write short fiction to explore a character from a larger work in more depth. Lady Selemei, from “The Persistence of Blood,” is one of those characters.\nThe Mazes of Power copy calls it “sociological science fiction.” What does this mean exactly, and how does this term apply to Mazes? What are a few of your favorite sociological science fiction novels and how are they similar or different from Mazes?\nSociological science fiction, sometimes also called social science fiction, is science fiction that sets its major focus on society and its impact rather than on other elements like gadgets, technologies, or frontiers. This is not to say that those other things are not involved! The term definitely applies to Mazes of Power, which features a complex caste system with seven different levels, each of which has its own vocation, ideals, manners, and culture. Members of the castes struggle to cope with the expectations of their caste identities just as people in our world struggle with the identities that are placed on them. My favorite past work of sociological science fiction is Ursula K. Le Guin’s The Left Hand of Darkness, which was one of the works that inspired me to explore characters’ culturally grounded judgments and flout readers’ underlying expectations. (The other major work that had the same effect was not science fiction, but the diary of Sei Shonagon, The Pillow Book.) I also consider Ann Leckie’s Imperial Radch series an example of sociological science fiction, though it’s more typically categorized as space opera. I love how Leckie keeps her focus tight and examines characters’ social and cultural expectations even as she works with the larger politics of the Radchaai Empire.\n“The Persistence of Blood” is a tale about aristocrats, gender, childbirth, tradition, law, and more, with a female protagonist. Are there important similarities and differences in themes, concerns, characters, or style between this story and Mazes? Are there elements in the two that often appear in your fiction?\n“The Persistence of Blood” is a prequel to Mazes of Power, and it is written in the same style, inasmuch as it uses a very tight third person point of view and looks at how the character reacts to both personal and political events. Lady Selemei does appear in Mazes, although she’s a secondary character there. Mazes uses three points of view, and takes a broader view of Variner society. I would call it a “zoom out” effect. Women’s issues are very important in Mazes as well, but they are only the beginning. I’m always fascinated by the way people exist inside of larger societal systems, and how the biases and influences of those systems show in the behaviors of individuals. That is a theme that can be seen in a great many of the stories I’ve written.\nWhat is special or most important to you about Mazes of Power; what do you really want fans and readers to know about this book?\nThe social systems of Varin are what make this book unique. I designed Varin intending the society to feel very familiar to many readers, but to subvert expectations constantly. A reader should feel strangely at home—but while Varin features many of the same social issues as our own world, you should never quite know where those issues are going to become relevant. One friend who read the book said it reflected our own society as if in a fun house mirror. The social systems of Varin are inextricable from the characters, and inextricable from the power struggle the characters experience; they are almost a character in themselves.\nWhat are you working on now that readers can look forward to?\nRight now I’m writing hard on the sequel to Mazes of Power, which will be called Transgressions of Power. It’s going to change the camera angle in some interesting ways, and continue to explore regions of Varin that no one has yet seen.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/wade_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Caste in Blood: A Conversation with Juliette Wade by Arley Sorg"}