{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "mEB8PZFPCDqq6QdIJiNppt6n3O8=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Six and Counting  We have some news to report this month. First of all, this is our sixth anniversary issue. The last six years have been amazing and you have helped make that possible. Many thanks for your support as we've continued to grow in both content and word count! I'm eager to see what opportunities arise as the next six years unfold.  Secondly, Jason Heller, our non-fiction editor, has turned in his resignation and will be leaving us by the end of the year. In his year with us he's done a lot great things and helped expand our non-fiction offerings. All of us here wish him the best of luck and continued success. In our next issue, I should be able to announce his successor and reveal some of our plans for the year ahead.  Last month, I mentioned that one of my goals is to be able to start paying our staff a real wage. I focused some attention on the importance of our Amazon and Weightless Books esubscriptions, since they are responsible for the bulk of our income. We do have other sources of income, but a few of them were sidelined by complications.  I am very pleased to say that the fabled Clarkesworld chapbooks are finally back on track. At this moment, a print copy of our January 2012 issue is sitting on my desk. It's only a proof, but we should be able to start producing final copies of this and other issues later this month. I hope to have at least four or five issues completed in time for the World Fantasy Convention in Toronto (along with some fun new promotional cards). These will be issued unsigned, but we will be making arrangements to have a small number of signed copies available as soon as possible.  Those same complications also put the annual Clarkesworld anthology series, Realms, on hold after the second volume. The series restarts with all the stories from our third year under the name Clarkesworld: Year Three. The introduction explains the name change, so I won't go into it here, but I can say that it should be available in print and ebook format by the end of the year. Volumes four and five will follow quickly in early 2013.  Lastly, I recently encouraged readers to leave reviews on our Amazon subscription page. Several of you wrote some very kind words there and I can't tell you how much I appreciate it. The time you spent doing that was extremely valuable to us and impacts our visibility on a site that is responsible for sending us a lot of new readers each month.  Thanks again for a wonderful six years. Catch you next month! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Six and Counting\nWe have some news to report this month. First of all, this is our sixth anniversary issue. The last six years have been amazing and you have helped make that possible. Many thanks for your support as we've continued to grow in both content and word count! I'm eager to see what opportunities arise as the next six years unfold.\nSecondly, Jason Heller, our non-fiction editor, has turned in his resignation and will be leaving us by the end of the year. In his year with us he's done a lot great things and helped expand our non-fiction offerings. All of us here wish him the best of luck and continued success. In our next issue, I should be able to announce his successor and reveal some of our plans for the year ahead.\nLast month, I mentioned that one of my goals is to be able to start paying our staff a real wage. I focused some attention on the importance of our Amazon and Weightless Books esubscriptions, since they are responsible for the bulk of our income. We do have other sources of income, but a few of them were sidelined by complications.\nI am very pleased to say that the fabled Clarkesworld chapbooks are finally back on track. At this moment, a print copy of our January 2012 issue is sitting on my desk. It's only a proof, but we should be able to start producing final copies of this and other issues later this month. I hope to have at least four or five issues completed in time for the World Fantasy Convention in Toronto (along with some fun new promotional cards). These will be issued unsigned, but we will be making arrangements to have a small number of signed copies available as soon as possible.\nThose same complications also put the annual Clarkesworld anthology series, Realms, on hold after the second volume. The series restarts with all the stories from our third year under the name Clarkesworld: Year Three. The introduction explains the name change, so I won't go into it here, but I can say that it should be available in print and ebook format by the end of the year. Volumes four and five will follow quickly in early 2013.\nLastly, I recently encouraged readers to leave reviews on our Amazon subscription page. Several of you wrote some very kind words there and I can't tell you how much I appreciate it. The time you spent doing that was extremely valuable to us and impacts our visibility on a site that is responsible for sending us a lot of new readers each month.\nThanks again for a wonderful six years. Catch you next month!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_10_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Six and Counting by Neil Clarke"}