{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Alex Shvartsman", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "FAjwnU8etUNe/TsLXwO7WrXiDaQ=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  A Brief History of Russian Science Fiction  It’s telling that the Russian term used to describe speculative fiction doesn’t distinguish between science fiction and fantasy. The word is fantastika (фантастика)—the literature of the fantastic. It is used equally to reference the Three Laws stories of Asimov and the Middle Earth tales of Tolkien. It is this lack of distinction—combined with Russia’s rich heritage of fairy tales and its rigorous education in mathematics and the sciences—that may be responsible for so many genre-bending tales penned by Russian-speaking authors, which have become classics of world literature. The history of Russian fantastika is inseparable from the history of Russia itself, and the political, economic, and social forces that have shaped it over the course of the twentieth century.  Russians were early adopters of the genre, with a number of science fiction novels appearing in the late nineteenth century. Rocket scientist Konstantin Tsiolkovsky wrote several such novels to popularize his ideas about space exploration among young readers. A number of other authors followed in the footsteps of H. G. Wells and Jules Verne, whose works were popular in translation and remain so even now. From the earliest days, Russian readers of genre literature looked outward, with translations from English, French, Polish, and a variety of other languages matching or exceeding the popularity of domestic offerings.  The Bolshevik revolution and the subsequent civil war that lasted into the 1920s resulted in a schism among Russian speculative writers. Some had embraced the new Soviet regime, whether for ideological reasons or for reasons of convenience (one couldn’t get anything published in the USSR if it defied the Communist Party’s preferred narrative). Writers like Alexander Belyaev (Professor Dowell’s Head, The Amphibian Man) and Aleksei Tolstoy (Aelita, The Hyperboloid of Engineer Garin) dominated the pre-World War II field with excellent pulp novels where communist heroes squared off against evil capitalists. Despite their overly politicized message, those works remain classics of Russian science fiction to this day.  On the other end of the spectrum were the dissidents. Writers disillusioned with the Soviet regime, who poured their discontent into their fiction. Yevgeny Zamyatin’s We became an instant classic of dystopian science fiction when it was published in English in 1924, but it was not officially printed in the Soviet Union until 1988, once the policies of perestroika and glasnost reshaped Russian society.  While Zamyatin wrote dystopian fiction, others found ways to criticize the regime through genre satire. Most notably, Mikhail Bulgakov wrote a Soviet-based riff on Wells’ The War of the Worlds titled The Fatal Eggs in 1924, following it a year later with Heart of a Dog—a scathing criticism of Soviet society, but also the general plot of Keyes’ Flowers for Algernon written thirty years earlier. Bulgakov went on to write one of the greatest novels of the twentieth century, The Master and Margarita, which may be the earliest example of magical realism. It too did not find publication in the USSR until 1966, when an abbreviated version was serialized in a magazine. It was first published in book form in 1973 and was only reprinted with a significant print run in 1980.  While The Master and Margarita and We both had an undeniable influence on world literature and are rightfully cited as some of the greatest Russian literary works of their era, they were not discovered by the majority of Russian readers until many decades later, and therefore may have been paradoxically less influential on the development of other genre fiction in Russia than fiction outside of its borders—similar to the way Moby Dick did not become a major influence in English literature until many decades after it was published.  After the communists had consolidated power, genre writers hoping to get their work past the censors had to adhere to certain formulas. The future they envisioned had to depict a society where communism had won, and the villains were often the Americans and other holdout regressive capitalists. Much of this literature was derivative of Belyaev and Tolstoy and ultimately forgettable.  Many talented voices were silenced or at least muted by the Soviet regime, never to earn the level of posthumous success enjoyed by the likes of Bulgakov. Consider, for example, the career of Yefim Zozulya: he may have been the greatest fabulist of his generation, and one of the most interesting writers of dark, speculative, and macabre short fiction in 1920s Russia. He was both prolific and successful, his works published in popular literary magazines. His short story “The Tale of Ak and Humanity” directly inspired Zamyatin’s We and may be the foundational work of the anti-utopian genre. And yet, if you’ve never heard of him before, you would be in good company with most Russian-speaking fans today, save for a loyal but relatively minor cult following.  As Soviet censorship flourished, it became more and more difficult for Zozulya to find homes for his intellectual and potentially subversive stories. He barely managed to publish a few stories in the 1930s, and his work was becoming less ambitious and more conformist during this era. Although he was never arrested or directly prosecuted by the regime, his career was successfully terminated. When Russia was invaded and drawn into the Second World War in 1941, fifty-year-old Zozulya volunteered for the front and was mortally wounded in battle a month later.  A slim collection of his short stories was reprinted in 1962, but it wasn’t until the Internet age that his work was rediscovered by critics and connoisseurs.  Zozulya’s tragic biography is indicative of why there was a significant gap in quality genre fiction coming out of Russia during the Stalin era. It wasn’t until the late 1950s that notable speculative works began to pop up again, with increasing frequency and quality.  The herald of this mid-century renaissance was Ivan Yefremov. His best-known work was Andromeda Nebula, a space opera set in a communist utopian future. Although the book was no literary masterpiece, and its characters were largely mouthpieces for Yefremov’s ideas, the sheer scope and scale of the story was groundbreaking for Russian science fiction, perhaps in a way similar to E. E. “Doc” Smith’s works among their early American counterparts.  In a 2006 interview, Boris Strugatsky explained: “[Yefremov] has shown how one can and should write modern SF, and thus has ushered a new era of Soviet SF. Of course, those times were already different, the Stalin Ice Age was nearing its end, and I think that even without Andromeda, Soviet SF would soon start a new course. But the publication of Andromeda has become a symbol of the new era, its banner, in some sense. Without it, the new growth would have been an order of magnitude more difficult, and a thaw in our SF wouldn’t have come until later.”  Inspired by Yefremov’s example, young authors began producing more ambitious and interesting works, and while the vast majority of domestic fiction remained forgettable, more outstanding authors and works emerged during the Cold War.  As fantastika was viewed by the government primarily as literature for the youth, some of the best authors to have emerged in that period were writing children’s books. Vladislav Krapivin, who wrote both speculative and realistic fiction, inspired a generation of authors, including Sergei Lukyanenko. Kir Bulychev’s books, and especially his Girl from the Future series of short stories and novellas, captured the imaginations of young Russian readers in the 1970s and 1980s, much as Heinlein’s juveniles did for American readers. As with Belyaev and Tolstoy, Bulychev’s stories provided source material for countless films, cartoons, and TV shows, and remain popular in the present.  Popular science magazines played an enormous role in publishing both domestic and translated fiction, as well as many short stories. Throughout the Soviet Union era, there was no such thing as a “science fiction magazine.” There were many pop sci publications that serialized novels or published short stories in every issue, but never an equivalent of Amazing Stories or Weird Tales.  The Strugatsky brothers (Roadside Picnic, Stalker) dominated and defined Russian science fiction in the latter half of the twentieth century. From space exploration and alien contact, to supernatural thrillers, to humorous urban fantasy, the writing team of Arkady and Boris Strugatsky produced a string of bestsellers henceforth unequaled in Russian genre literature.  Some of the other notable writers of the seventies and eighties include Olga Larionova (The Sea Sonata, The Leopard from atop Mt. Kilimanjaro) and Lyudmila Kozinets (The Broken Chain, Three Seasons of the Meister).  The censors tightly controlled which Western books were allowed to be translated and published in Russia. They tended toward stories they deemed critical of capitalism and modern Western society, with uneven results. As such, Asimov’s Three Laws of Robotics stories were widely published, but the Foundation series was obviously not. Those international authors whose work was seen by the censors as critical of capitalism (whether or not this was their intention) were published and often developed an enormous fan base in the USSR. Ironically, the works of Clifford Simak and Robert Sheckley are far more widely recognized in Russia than in the United States nowadays. Bradbury’s The Martian Chronicles was extremely popular. However, like so many books of the time, it was translated and published without the author’s permission. Bradbury is said to have flown into a rage when asked to sign Russian editions of his book.  The proliferation of copy machine technology allowed the Russian samizdat to flourish. Banned works including We and The Master and Margarita were passed from reader to reader despite the inherent risks. In addition, many fan translations of popular Western novels that weren’t approved by the censors were also circulated.  In the late 1980s, as the Soviet Union was crumbling, it became possible to publish all manner of works, both translated and original, and there was an enormous boom in genre publishing. As republics seceded and economies tanked, the trend among Russian writers once again turned dystopian, with many imagining the horrors of the upcoming civil wars. And as the economy stabilized by the late 1990s, many Russian writers turned to aspirational stories, where Russia was depicted as having regained its dominant standing in the world community. Many of the books published in the 1990s and 2010s could be considered stylistic throwbacks to 1960s and 1970s Western science fiction. This is due to the fact that most of the translated works these younger writers grew up reading were from that era; their generation missed the New Age and the experimental Western sci-fi of the 1980s almost entirely.  The most notable standout in the nineties was Sergei Lukyanenko. A prolific writer, he has written everything from space opera to cyberpunk to alternate history, steadily gaining popularity and fans, but it was the Night Watch urban fantasy series launched in 1998 that propelled him to stardom. He remains the most popular Russian-language fantasist today. Some of the other outstanding authors from this era include Andrei Lazarchuk (Those Who Were Late to Summer, The Hyperborea Plague) and the husband-and-wife team of Sergey and Marina Dyachenko (Vita Nostra, Daughter from the Dark), whose books were recently published in English.  The Dyachenkos were among the pioneers of traditional fantasy, a subgenre that was virtually nonexistent in Russian fantastika until the 1990s. Fantasy works were hardly ever translated into Russian during the Soviet era, either, with the notable exception of Tolkien’s The Lord of the Rings series, which was enormously popular and shaped the Russian conception of fantasy literature while works of Robert E. Howard, Lin Carter, and the like weren’t published until the nineties.  A number of science fiction magazines have launched and closed their doors since then. For whatever reason, a short fiction environment similar to that of American zines has never emerged in Russia. Not even with the advent of the Internet have we seen strong, consistent webzines emerging in the Russian language.  Which isn’t to say that there isn’t an abundance of quality short fiction; it has taken a unique form, thriving through online contests. Authors are given a tight deadline (usually from a couple of days to a couple of weeks) to write a themed short story. Hundreds of entries are judged anonymously by the entrants, and (in some contests) the top entries are handed over to celebrity judges to select the winners. The theme is usually provided by a celebrity guest; these have included authors such as Liu Cixin, Lois McMaster Bujold, and Neil Gaiman.  Because the entrants are anonymous, it is commonplace for even the most successful authors to participate and test their mettle against the up-and-comers. Perhaps the best-known of such contests is Rvanaya Grelka (Рваная Грелка)—which translates as “The ripped hot water-bottle,” a reference to a humorous idiomatic expression implying an easy and complete victory—which has been ongoing since 2001. It’s been won by established pros such as Sergei Lukyanenko and Leonid Kaganov, among others, but it’s also served as a platform for new and emerging authors.  The new generation of writers, who have grown up in post-Soviet Russia and the age of the Internet, are far more likely to experiment and produce unusual and interesting stories in the spirit, the wit, and the genre-bending tradition of Bulgakov. It’s a great privilege to read and to help share with Anglophone readers the writing of his spiritual successors.", "text": "Non-Fiction\nA Brief History of Russian Science Fiction\nIt’s telling that the Russian term used to describe speculative fiction doesn’t distinguish between science fiction and fantasy. The word is fantastika (фантастика)—the literature of the fantastic. It is used equally to reference the Three Laws stories of Asimov and the Middle Earth tales of Tolkien. It is this lack of distinction—combined with Russia’s rich heritage of fairy tales and its rigorous education in mathematics and the sciences—that may be responsible for so many genre-bending tales penned by Russian-speaking authors, which have become classics of world literature. The history of Russian fantastika is inseparable from the history of Russia itself, and the political, economic, and social forces that have shaped it over the course of the twentieth century.\nRussians were early adopters of the genre, with a number of science fiction novels appearing in the late nineteenth century. Rocket scientist Konstantin Tsiolkovsky wrote several such novels to popularize his ideas about space exploration among young readers. A number of other authors followed in the footsteps of H. G. Wells and Jules Verne, whose works were popular in translation and remain so even now. From the earliest days, Russian readers of genre literature looked outward, with translations from English, French, Polish, and a variety of other languages matching or exceeding the popularity of domestic offerings.\nThe Bolshevik revolution and the subsequent civil war that lasted into the 1920s resulted in a schism among Russian speculative writers. Some had embraced the new Soviet regime, whether for ideological reasons or for reasons of convenience (one couldn’t get anything published in the USSR if it defied the Communist Party’s preferred narrative). Writers like Alexander Belyaev (Professor Dowell’s Head, The Amphibian Man) and Aleksei Tolstoy (Aelita, The Hyperboloid of Engineer Garin) dominated the pre-World War II field with excellent pulp novels where communist heroes squared off against evil capitalists. Despite their overly politicized message, those works remain classics of Russian science fiction to this day.\nOn the other end of the spectrum were the dissidents. Writers disillusioned with the Soviet regime, who poured their discontent into their fiction. Yevgeny Zamyatin’s We became an instant classic of dystopian science fiction when it was published in English in 1924, but it was not officially printed in the Soviet Union until 1988, once the policies of perestroika and glasnost reshaped Russian society.\nWhile Zamyatin wrote dystopian fiction, others found ways to criticize the regime through genre satire. Most notably, Mikhail Bulgakov wrote a Soviet-based riff on Wells’ The War of the Worlds titled The Fatal Eggs in 1924, following it a year later with Heart of a Dog—a scathing criticism of Soviet society, but also the general plot of Keyes’ Flowers for Algernon written thirty years earlier. Bulgakov went on to write one of the greatest novels of the twentieth century, The Master and Margarita, which may be the earliest example of magical realism. It too did not find publication in the USSR until 1966, when an abbreviated version was serialized in a magazine. It was first published in book form in 1973 and was only reprinted with a significant print run in 1980.\nWhile The Master and Margarita and We both had an undeniable influence on world literature and are rightfully cited as some of the greatest Russian literary works of their era, they were not discovered by the majority of Russian readers until many decades later, and therefore may have been paradoxically less influential on the development of other genre fiction in Russia than fiction outside of its borders—similar to the way Moby Dick did not become a major influence in English literature until many decades after it was published.\nAfter the communists had consolidated power, genre writers hoping to get their work past the censors had to adhere to certain formulas. The future they envisioned had to depict a society where communism had won, and the villains were often the Americans and other holdout regressive capitalists. Much of this literature was derivative of Belyaev and Tolstoy and ultimately forgettable.\nMany talented voices were silenced or at least muted by the Soviet regime, never to earn the level of posthumous success enjoyed by the likes of Bulgakov. Consider, for example, the career of Yefim Zozulya: he may have been the greatest fabulist of his generation, and one of the most interesting writers of dark, speculative, and macabre short fiction in 1920s Russia. He was both prolific and successful, his works published in popular literary magazines. His short story “The Tale of Ak and Humanity” directly inspired Zamyatin’s We and may be the foundational work of the anti-utopian genre. And yet, if you’ve never heard of him before, you would be in good company with most Russian-speaking fans today, save for a loyal but relatively minor cult following.\nAs Soviet censorship flourished, it became more and more difficult for Zozulya to find homes for his intellectual and potentially subversive stories. He barely managed to publish a few stories in the 1930s, and his work was becoming less ambitious and more conformist during this era. Although he was never arrested or directly prosecuted by the regime, his career was successfully terminated. When Russia was invaded and drawn into the Second World War in 1941, fifty-year-old Zozulya volunteered for the front and was mortally wounded in battle a month later.\nA slim collection of his short stories was reprinted in 1962, but it wasn’t until the Internet age that his work was rediscovered by critics and connoisseurs.\nZozulya’s tragic biography is indicative of why there was a significant gap in quality genre fiction coming out of Russia during the Stalin era. It wasn’t until the late 1950s that notable speculative works began to pop up again, with increasing frequency and quality.\nThe herald of this mid-century renaissance was Ivan Yefremov. His best-known work was Andromeda Nebula, a space opera set in a communist utopian future. Although the book was no literary masterpiece, and its characters were largely mouthpieces for Yefremov’s ideas, the sheer scope and scale of the story was groundbreaking for Russian science fiction, perhaps in a way similar to E. E. “Doc” Smith’s works among their early American counterparts.\nIn a 2006 interview, Boris Strugatsky explained: “[Yefremov] has shown how one can and should write modern SF, and thus has ushered a new era of Soviet SF. Of course, those times were already different, the Stalin Ice Age was nearing its end, and I think that even without Andromeda, Soviet SF would soon start a new course. But the publication of Andromeda has become a symbol of the new era, its banner, in some sense. Without it, the new growth would have been an order of magnitude more difficult, and a thaw in our SF wouldn’t have come until later.”\nInspired by Yefremov’s example, young authors began producing more ambitious and interesting works, and while the vast majority of domestic fiction remained forgettable, more outstanding authors and works emerged during the Cold War.\nAs fantastika was viewed by the government primarily as literature for the youth, some of the best authors to have emerged in that period were writing children’s books. Vladislav Krapivin, who wrote both speculative and realistic fiction, inspired a generation of authors, including Sergei Lukyanenko. Kir Bulychev’s books, and especially his Girl from the Future series of short stories and novellas, captured the imaginations of young Russian readers in the 1970s and 1980s, much as Heinlein’s juveniles did for American readers. As with Belyaev and Tolstoy, Bulychev’s stories provided source material for countless films, cartoons, and TV shows, and remain popular in the present.\nPopular science magazines played an enormous role in publishing both domestic and translated fiction, as well as many short stories. Throughout the Soviet Union era, there was no such thing as a “science fiction magazine.” There were many pop sci publications that serialized novels or published short stories in every issue, but never an equivalent of Amazing Stories or Weird Tales.\nThe Strugatsky brothers (Roadside Picnic, Stalker) dominated and defined Russian science fiction in the latter half of the twentieth century. From space exploration and alien contact, to supernatural thrillers, to humorous urban fantasy, the writing team of Arkady and Boris Strugatsky produced a string of bestsellers henceforth unequaled in Russian genre literature.\nSome of the other notable writers of the seventies and eighties include Olga Larionova (The Sea Sonata, The Leopard from atop Mt. Kilimanjaro) and Lyudmila Kozinets (The Broken Chain, Three Seasons of the Meister).\nThe censors tightly controlled which Western books were allowed to be translated and published in Russia. They tended toward stories they deemed critical of capitalism and modern Western society, with uneven results. As such, Asimov’s Three Laws of Robotics stories were widely published, but the Foundation series was obviously not. Those international authors whose work was seen by the censors as critical of capitalism (whether or not this was their intention) were published and often developed an enormous fan base in the USSR. Ironically, the works of Clifford Simak and Robert Sheckley are far more widely recognized in Russia than in the United States nowadays. Bradbury’s The Martian Chronicles was extremely popular. However, like so many books of the time, it was translated and published without the author’s permission. Bradbury is said to have flown into a rage when asked to sign Russian editions of his book.\nThe proliferation of copy machine technology allowed the Russian samizdat to flourish. Banned works including We and The Master and Margarita were passed from reader to reader despite the inherent risks. In addition, many fan translations of popular Western novels that weren’t approved by the censors were also circulated.\nIn the late 1980s, as the Soviet Union was crumbling, it became possible to publish all manner of works, both translated and original, and there was an enormous boom in genre publishing. As republics seceded and economies tanked, the trend among Russian writers once again turned dystopian, with many imagining the horrors of the upcoming civil wars. And as the economy stabilized by the late 1990s, many Russian writers turned to aspirational stories, where Russia was depicted as having regained its dominant standing in the world community. Many of the books published in the 1990s and 2010s could be considered stylistic throwbacks to 1960s and 1970s Western science fiction. This is due to the fact that most of the translated works these younger writers grew up reading were from that era; their generation missed the New Age and the experimental Western sci-fi of the 1980s almost entirely.\nThe most notable standout in the nineties was Sergei Lukyanenko. A prolific writer, he has written everything from space opera to cyberpunk to alternate history, steadily gaining popularity and fans, but it was the Night Watch urban fantasy series launched in 1998 that propelled him to stardom. He remains the most popular Russian-language fantasist today. Some of the other outstanding authors from this era include Andrei Lazarchuk (Those Who Were Late to Summer, The Hyperborea Plague) and the husband-and-wife team of Sergey and Marina Dyachenko (Vita Nostra, Daughter from the Dark), whose books were recently published in English.\nThe Dyachenkos were among the pioneers of traditional fantasy, a subgenre that was virtually nonexistent in Russian fantastika until the 1990s. Fantasy works were hardly ever translated into Russian during the Soviet era, either, with the notable exception of Tolkien’s The Lord of the Rings series, which was enormously popular and shaped the Russian conception of fantasy literature while works of Robert E. Howard, Lin Carter, and the like weren’t published until the nineties.\nA number of science fiction magazines have launched and closed their doors since then. For whatever reason, a short fiction environment similar to that of American zines has never emerged in Russia. Not even with the advent of the Internet have we seen strong, consistent webzines emerging in the Russian language.\nWhich isn’t to say that there isn’t an abundance of quality short fiction; it has taken a unique form, thriving through online contests. Authors are given a tight deadline (usually from a couple of days to a couple of weeks) to write a themed short story. Hundreds of entries are judged anonymously by the entrants, and (in some contests) the top entries are handed over to celebrity judges to select the winners. The theme is usually provided by a celebrity guest; these have included authors such as Liu Cixin, Lois McMaster Bujold, and Neil Gaiman.\nBecause the entrants are anonymous, it is commonplace for even the most successful authors to participate and test their mettle against the up-and-comers. Perhaps the best-known of such contests is Rvanaya Grelka (Рваная Грелка)—which translates as “The ripped hot water-bottle,” a reference to a humorous idiomatic expression implying an easy and complete victory—which has been ongoing since 2001. It’s been won by established pros such as Sergei Lukyanenko and Leonid Kaganov, among others, but it’s also served as a platform for new and emerging authors.\nThe new generation of writers, who have grown up in post-Soviet Russia and the age of the Internet, are far more likely to experiment and produce unusual and interesting stories in the spirit, the wit, and the genre-bending tradition of Bulgakov. It’s a great privilege to read and to help share with Anglophone readers the writing of his spiritual successors.", "source": "https://clarkesworldmagazine.com/shvartsman_05_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: A Brief History of Russian Science Fiction by Alex Shvartsman"}