{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Sameem Siddiqui", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ZIeDKa2159X+kE5cXKP1eV87s2A=", "id": null, "license": null, "comments": "", "raw_text": "4970 words, short story  AirBody  2021 Finalist: Theodore A. Sturgeon Memorial Award  Amazing how all Desi aunties are basically the same. Even when separated by vast oceans for a few generations. I mean, they fit into a few basic archetypes. There’s the genuine-sweetheart proxy mother who, in between her late-night work shifts, always makes sure you and your friends have all the snacks you need. The manipulative gossiper, who conveniently keeps details of her own children’s scandals nestled under her tongue. The nervous fidgeter who has spent three decades so worried that her basic thirty-year-old son won’t ever find a wife that she forgets to teach him how to speak to women. The late-life hijabi, who pointedly replaces “Khuda-hafiz” with “Allah-hafiz” and “thank you, beta” with not just “jazak-allah” but the full on “jazak allahu khayran.” But which of these archetypes would find it appropriate to rent the body of a grown man halfway across the world?  I pull the AirBody request from Meena Khan into view in my contacts. She’s fifty-nine years old and from Karachi. Her short wavy hijab-less hair and her relaxed smile makes her seem content with life, so maybe she’s the genuine-sweetheart type. Her only notes on the request are a list of Desi groceries and some cookware, which only reinforces the archetype. Maybe she’s too ill to travel to visit family for Eid and wants to surprise them with a feast? It’s been a while since I’ve gotten a taste of such a spread. I hit accept and watch the usual legalese flash before me:  You acknowledge that you have the ability to observe, regain control, and remove your guests at any time and therefore may be complicit and responsible for any crimes or damage committed by your guests.  I tap “Yes” and begin to look through her grocery list more closely. Some of it, like the sweetened condensed milk, half-and-half, sugar and cardamom powder I can get at the regular grocery store. But for the Desi ghee and chanay ki daal, I either have to pay a premium at the hippie organic store downstairs or drive out to a Desi grocery store in the suburbs. A drive would help kill some time, so I choose the Desi grocery store.  When I return, I arrange all the ingredients in alphabetical order on my otherwise bare gray marble kitchen counter and head to bed. Meena activates at 6 AM and I don’t want to test AirBody’s zero-tolerance late policy. I also don’t want a review plagued with complaints of body odor and morning breath.  My alarm goes off at 5 AM, but I snooze several times, stumbling in and out of a wildly vivid dream about riding on the back of a sea turtle. Except, I’m not in the water. I think I might be floating through the sky. But, there are definitely other underwater creatures floating by, greeting us along the way. I feel love for the sea turtle and I lean over to kiss its rough green cheek when the snooze expires. Weird. But, my dreams have been odd since I started “playing host” on weekends a few months ago.  By 5:58 AM I’m towel dried, clothed and somewhat fed—a cookie is breakfast to some. I stand in front of the mirror as I clip the AirBody headset to the backs of my ears. It whirs on automatically—it doesn’t actually whir, but I imagine that’s the microscopic sound it makes as the violet light pulses. It authenticates my identity and says “Hello, Arsalan. Your AirBody guest is in the waiting area. Are you ready?”  “Yup, I’m ready,” I say, trying to sound chipper, but nervous as fuck about what this will be like. This is my sixth time hosting and so far it’s been a good distraction to get through my weekends. Most of my other guests have been men, usually here for some business meeting at the World Bank, or to tour the monuments and museums with their grandchildren. The only other woman I’ve hosted was a lobbyist from an asteroid mining firm who didn’t think a one-hour meeting with a congressperson was worth breaking orbit for.  My limbs tingle as they go numb. I feel heavy for second, like I can’t support my own weight and am about to fall. And I do, in a way. Not physically. More like falling asleep into a dream that makes so much sense that it’s boring. Which is why, I suppose, AirBody lets hosts stream content and games to the neural UI while their guests go corporeal.  I give Meena a few moments to adjust and watch her look around my living room. Her eyes stare at my mostly empty bookshelf surrounded by plain white walls. I don’t have much decor, except for the tiger painting Ammi bought in Thailand when she visited once in her early twenties.  “Hi!” I say, my voice in the AirBody interface sounding way louder than I intend. I feel my heart rate increase and realize I must have scared her. “Sorry, I, uh, just wanted to say hello and let you know I’m here to assist you during your stay if you need help.”  “Beta, Urdu nahin boltay?”  Oh crap. Not only am I going to get a bad review for my poor Urdu language skills, I’m now going to spend the next twenty-four hours meeting the scorn and judgment of a Pakistani aunty. Here we go.  “Nahin, aunty, I—” I say slowly, preparing to flex my mind’s tongue with words I haven’t used in years.  “Array profile pe Urdu likha tha!”  Oh god, if I don’t get removed after this listing, I need to delete Urdu from my language profile. If for nothing else, to escape this scorn. “Chalo, I’m here. What can I do now?” she says, waving my hands up in the air behind us. “Take me to the kitchen, beta . . . you do have a kitchen, right?”  “Haan, yes,” I say, retaking control. My limbs tingle awake and I walk to the kitchen before handing her back control.  I feel my body sigh and my head shake. “This will do,” she says as she walks to the corner of the counter where I’ve neatly arranged the ingredients she requested. She inspects them closely, as if she doesn’t trust that I bought the right things. But, she doesn’t make any complaints. She looks around the kitchen. There are a few dishes in the drying rack, but I made sure to clear out the sink, which is normally full until there’s a noticeable rot.  She begins opening cabinets, slowly and calmly at first. I assume she’s looking for something specific, but after a moment I’m sure she’s just being nosey. She comes to the last one, the little corner cabinet, the only one to the right of the sink. Shit.  I want to distract her, to keep her from opening it, but interfering with an experience without consent or a reasonable emergency would lead to a bad review. So I watch hopelessly as she swings the cabinet open and stares at the label on the little translucent bottle half full with brown liquid.  “Whiskey, beta? Tauba tauba,” she says as she slaps each of my cheeks gently. “Allah maf karay!” I’m not sure if she’s asking for forgiveness on my behalf, or if she somehow feels complicit in my sin by inhabiting my body. I mean, I’m not drunk—it’s six in the morning. Now if she wills that whiskey into me, then maybe she’d be complicit. Maybe.  She shuts the cabinet, still shaking her head, and pulls open the electric pressure cooker. We both notice the inner pot hasn’t been washed since the last time it was used, but only I know that this was many months ago. My eyes roll back into my head as she groans and clicks my tongue. She flicks on the tap and snatches the worn-out sponge on the edge of my sink. “Yeh koy tareeka hai, beta?”  She fills the pot with water so hot that I can feel the pain through the sensory suppression as she scrubs. I’m convinced this is intentional punishment. Maybe she isn’t the genuine-sweet type.  She empties the dal into the pot slowly, as if she doesn’t trust my eyes to check the quality of the product as a whole. The yellow pieces glint off the bottom of the worn metal, scattering into swirls as she shakes the bag to see if she can catch any unwanted particles.  One piece of dal pops off the bowl and onto the floor and I feel a tinge of the panic that froze me the first time I made dal. Not knowing what to do as the orange but almost magenta grains spilled onto the counter and to the floor. The worthlessness that would melt me into a blob as I’d hear Ammi’s tired and exasperated voice say “Beta, Arsalan, just once, would you do things without rushing?” Her finger would point at the door. “Out, now, if you can’t help properly.”  “Savvy for a ten year old,” Nani would say as I’d run to her lap before the tears began to flow.  “Haan, just as savvy as his useless father,” Ammi would say.  And then the fear of inadequacy would stand me up straight, wipe my tears, and walk me back into the kitchen defiantly, striding close enough to Ammi to move her out of the way without physically attacking her. I’d sort it out. I’d sift the dirt out of the fallen dal. I’d get a jar to pour the extra back. And I’d have dinner on the table before Ammi returned from her evening shift. I would not be my useless father.  “Is this right?” Meena asks as she presses the buttons on the pressure cooker.  “You’re not gonna soak the dal first?”  “Oh so now you’re such a refined cook?”  “I can make dal.”  “Then tell me, why soak the dal? What difference does it make, aside from wasting two hours of our lives?”  “Well it’s just, what . . . it’s just what you do.”  “Is it now?” She says, pressing start on the pressure cooker and effectively shutting me up. “Acha, where’s your janamaz beta? And the qibla is which direction?”  I’m pretty sure I can feel a smirk on my face as she asks.  “Inside the storage ottoman in the living room,” I say, coolly, trying to remember which way Ammi faced last time she visited. I point at my east facing windows and say, “And the qibla’s out the window that way, a little to the right.”  She opens the ottoman and pulls the janamaz out. I feel her stiffen as she notices my fingers grayed in dust. “Thank you beta,” she says, as she dusts off the janamaz and lays it out before the windows. I feel her swing my hands up to my ears before resting them high on my chest.  Should she technically have put a dupatta on? Ammi’s maroon ajrak one is still in the ottoman. The last time she was here I watched her throw it over her shoulder, say “Keep to our own,” and start her prayers before I could respond. We had just come home from lunch where I had finally introduced her to Karla. I sat on the couch and hunched over to inspect the lines on my palms where I had dug my nails in deep, hoping the pain would make the lunch go by faster. It didn’t work.  It wasn’t so much that she and Karla didn’t get along. It was more that each time Karla attempted to strike up conversation, Ammi just smiled at her and returned to her meal. Karla excused herself halfway through lunch, pretending she had just gotten called into the hospital to oversee an operation.  I kept my eyes down as she left and didn’t look up until a few moments later when Ammi said, “You know, the first time I met Eric’s mother, she did the same to me, but without a smile.”  “Oh, so it’s healthy to perpetuate this cycle, Ammi?”  “I stuck it out. When Eric got up to use the restroom, his mom leaned over and asked me if ‘your women still enjoy sex after your families circumcise you.’” Ammi sipped her tea and stared off somewhere above my head. “I smiled back, swallowed the words in my throat, and stuck it out. I’m glad Karla had the sense to run. She’s smarter and stronger than I was.”  I sunk into my couch watching Ammi flow through the motions of prayer that I never felt at home in. I’d happily keep to my own, if I knew who my own was.  “Chalo beta,” Meena says as she folds up the janamaz and puts it back into the dusty ottoman. “Let see how much time is left on this thing.”  The red digits flash through the final sixty seconds.  Meena clicks the depressurize button and watches, as if she’s hypnotized by the plume of steam hissing out of the metal cylinder. I feel my ears perk up as she hones in on the sound. It’s as if she hasn’t seen or heard this in ages.  “Don’t cook much anymore, eh?” I say, realizing I should probably contain my snark. But I don’t think she minds.  “No, I cook almost every day. It’s just that I’m a bit deaf, so I’ve forgotten how the steam speaks to you. If you pay attention to the hiss, you’ll hear it tell you if the food is really ready, if it was cooked the way you intended, or if you’ll be disappointed when the lid unlocks. And if you watch closely, you’ll see how the steam interacts with the spirits in the air. If they gather toward the steam, you’re cooking something delicious. If they flee, well . . . ” she shrugs. “It’s an old aunty secret.”  “Really?”  “You’re one of the most gullible saps I’ve ever met, I’m sure.”  “I didn’t believe you, I just couldn’t tell if you really believed it yourself.”  “Mhmm.”  “Alright, well you let me know if you need anything. I’m going to get some reading done.” Really there’s some gaming I need to catch up on, but she doesn’t need to know that. I suppress my visual feed and replace it with CoreEra4. Time to level up. The sensory suppression filters out most of Meena’s kitchen noise, until I hear the blender slicing through. I’m curious why she needs a blender to make dal, but not curious enough to hit pause.  I’m pretty immersed in the game when I feel an almost pungent, but ultimately bland taste on my tongue. Meena’s shoveled a bit of what she’s done to this dal into my mouth. She massages the hot, dry musty paste into a lump as she lets each part of my tongue feel and inspect the texture. As it crumbles into the back of my throat, an aftertaste surfaces that reminds me of wanting to be kissed amidst an audience of 80s era wood paneling on neglected basement walls. An aftertaste on my anxiety-dried adolescent tongue, which had just uttered “I’d kiss you Eid Mubarak if you’d let me.” A line tacky enough to hold the confident façade of my smile in place while I waited inside my head screaming what in the FUCK are you thinking?  I can almost hear Hafza’s laugh seeping in through my tongue and almost feel the slap that ended in an apologetic caress. My taste buds reverberate like the hair on the back of my neck when Hafza kissed the highest point of my cheekbone and then stared at me. I’d never seen anyone’s eyes so close. It was so overwhelming I had to close my own eyes. I’m not sure if she had started or me, but after years of pining, that was the first time my lips finally melted into another’s. And it would not be the last time I’d be rudely interrupted mid-kiss. Before the moment was over, Ammi was shouting, “Arsalan beta, let’s go!” from the top of the staircase behind me. Hafza broke the kiss and leaned over to whisper “Eid Mubarak, Arsalan” in my ear just before I jumped up, stunned by what had happened. The next thing I’d say to Hafza would be “congratulations” ten years later on her heavily decorated wedding stage, next to her heavily decorated new husband.  Meena fills my mouth with water, washing my memory out. I ache for another taste of the musty paste. I want to go back for more, even though there is nothing to go back to.  “What was that? It tasted familiar.”  “Well, mister expert, you’ll have to wait and see.”  So I watch her set the pot on the stove above the lowest possible flame and plop in a few heaps of ghee. As it melts and simmers unevenly in the pot, she picks up the blender and begins scooping the paste out. The warm ghee spatters on the backs of my hands as the first few clumps land in the pot.  My arm will no doubt be sore the next day, because for a while she just leans on the counter and stirs every few minutes, keeping the darkening paste on the bottom from sticking to the pot. Eventually she stops to add sugar, mixing it in evenly before flipping the paste over and pouring the rest of the sugar in. Once the white crystals disappear into the paste she scoops a spoon full out and closes my eyes as the warm sugary sensation hits my lips. I’m flooded with images of Tupperware decorated by cold and soggy deep-fried finger foods and heavenly sweetened desserts. But, it’s all dammed by the memory of Karla’s voice asking the question, “Why can’t you just bring me home for Eid, like a normal person?”  “Ammi’s just not well,” I had said, opening one dish and lifting it up. What dish was it?  “She’s well enough to have cooked all of this,” Karla had said, gesturing to the to-go holiday foods.  I plunged a spoon into the Tupperware and scooped up something and shoved it toward Karla’s mouth. “Just try a bite.”  Karla rolled her eyes and opened her mouth. Then, when the taste soaked into her tongue, she opened her eyes wide. Her eyes rolled again, but with pleasure this time. “What the fuck is this?”  “Chanay-ki daal ka-halwa,” I say into the AirBody UI.  “Very good!” Meena stabs with her standard tone of condescension. She pours another can of condensed milk in and continues stirring. “Gustatory memory.”  “What?”  “Taste. It’s got a peculiar way of triggering memory and emotion, don’t you think? More so than other senses. Taste links us directly to our gut, where our deepest unfulfilled needs keep us hungry. Your gut tricks your mind into thinking you’re getting what you want, when it’s really just using you to get the—” she scoops up another bite and I feel my eyes roll back into my head “—mmm. The sweet halwa.”  She opens my eyes and looks down at the bright yellowy paste.  “But, I remember this being brown whenever my Nani made it.”  “Haan beta, just wait,” she says as she preheats the oven to 400 degrees. When the oven beeps she slides the pan in and sets a timer for fifteen minutes.  “Acha beta, what kind of formal wear do you have?”  “Formal wear?”  “Haan, kurta pajama? Shalwar kameez? Whichever you’d like to call it.”  “Uhhh . . . ”  “Oh, of course. Well, at least put us in a pressed pant-shirt,” she says handing me back control.  “Sure,” I say, heading back to my room to pull out some blue slacks and a new red and gray striped shirt I haven’t worn yet.  I stand before the mirror making final touches when she pings for control back.  “Well at least you’ve got some color in your wardrobe.” She picks up a pen from my dresser and writes down an address on the price tag I just ripped off of the shirt I put on. “I need to go here.”  “Sounds good to me,” I say as I feel her pass control back.  As we make our way out of the city and onto the I-95 I glance at the sign for BWI Airport. The last time I was supposed to go to BWI was the last time I was supposed to see Karla. She had been away for work for a week and I was on my way to pick her up when I got a call from Ammi’s doctor. My mind went single track and I skipped the exit for the airport and drove straight to the hospital in Philly where Ammi was taking her last breaths, alone. I made it in time to say goodbye, but not much else.  Karla only called once that night. I stayed in Philly for six days and when I got back my place was emptied of Karla’s things, which was most everything. If I had called to let her know what was going on, she would have understood, would have come up to help. I never figured out why we played this game of chicken. We’d done it before. But, this time we both ran off the cliff and it felt right to let things rest at the bottom of the canyon rather than pick them up and rebuild.  I pull up in front of the house and step out of the car, grabbing the dish of halwa along the way. The magenta sunset laces the gray house like a mesh dupatta. There are a lot of cars parked on the driveway and a bluster of muffled laughter coming through the windows of the brightly lit living room.  As I get to the front door I hand back control and immediately feel my heart rate spike. She stares dead ahead, frozen still.  “Are you alright?”  “Haan, I just—”  The door swings open to a woman dressed in a gray and blue shalwar kameez. She’s still looking at her guests behind her and laughing. Her smile sticks as she turns to look at me. Her purple-streaked hair’s tied up in a bun. She’s probably a little younger than Meena, maybe late forties? I study her face to see if I can parse a family resemblance to Meena’s profile picture.  “I’m sorry, can I help you?” the woman asks, leaning against her door jamb.  I can feel Meena trying to push the air through my larynx and out of my mouth but it’s sealed shut. Instead, she just lifts the dish of halwa and opens it.  The woman leans forward and inspects the congealed brown paste. The sunset breeze blows a warm waft of the dish’s scent into my nose.  The woman looks back at me, but her eyebrows are strained around her eye sockets now. Without a word, she takes a step back and slams the door in my face.  Meena stands there for a minute in my shaking body, with the halwa still cooling in the open air. She flattens the lid back onto the dish and lays a card on top of it. She puts the dish down gently onto the frilly brown “Welcome Home” mat. She picks up a small white rock from the side of the porch and places it on top of the card to keep it from flying away, before turning back to the car.  As soon as I feel the first tear hit my cheek she stops.  “Beta, take us home.”  The tears stop as I take control, but I can still feel the strain in the back of my throat. This is the first time I’ve wondered what happens when people hand me back control temporarily. Do they come back to life in their homes? Is she convulsing over her toilet, vomiting up as much of the regret as possible before curling into a ball of tears on her bathroom floor? Or is she lying peacefully, letting the tears soak into her veins until the pain passes.  Once at home she requests control and immediately goes back to the cabinet in the corner, pulling out the bottle of whiskey and pouring it into a chipped glass she finds in my drying rack. She carries it in my shaking hands and walks to the armchair that faces the window. As the final moments of sunset fade away, I can see her staring back at me in the reflection of the window.  She holds up the glass and stares into the brown liquid as she swirls it around.  “Beta,” she says aloud. “How do you decide which one is right for you?”  “What do you mean?” I respond, echoing in my own head.  “Which drink? How did you know it was whiskey? Not Beer? Wine? Cocktail?”  “Well, I drink them all, so—” I hesitate, uncertain of where this is going, “—but I don’t drink much.”  “Haan, beta, whatever.” She smirks at me in the window and swings the whiskey full down my throat. I turn down the sensory suppression and feel the initial hit seep into my blood and loosen my muscles. She picks the bottle up from the table and pours another shot.  “Are you okay?”  “I’ll be fine, just need to process a bit.” She lifts the glass, but sips at the whiskey this time. I assume the first time was purely for shock value.  “What’s your deal?”  “My deal, beta?”  “Don’t beta me, I’m a grown man.”  “Haan,” she pauses, scanning my sad apartment, “of course you are.”  “Why are you here? Who was that woman?”  “Just an old acquaintance. It’s not important.”  “Then why me? Were there no other, more appropriate hosts available?”  “Appropriate how?”  “I don’t know, an older woman, someone more fitting your background?”  She laughs. “My background? Beta, you were the only ‘Urdu speaking’ host of Pakistani origin whose listing authorizes sexual behavior during a visit.”  Before I can respond there’s a knock at the door.  “Were you expecting anyone, beta?”  “No.”  She sets the glass down and goes to open the door. There is the woman, still in her gray and blue shalwar kameez, holding my dish with one hand and one hip. I watch my eyelids wrap around the woman in the doorway and make a shape I haven’t seen them make in months.  “Is it still you, Meena?”  Meena nods, my larynx suddenly sealed shut once again.  “You think you’re quite clever, don’t you?” The woman walks into the apartment and slides the dish onto the counter. She pulls the lid off, revealing at least 2-3 servings worth gone. “I’m going to eat the rest on my own as well. I’m not sharing.” She smiles as she pulls off her dupatta and throws it at me.  Meena catches it and laughs, finally loosening my throat. “Haniya, I—”  Haniya leans in quick to shut up Meena with a hard kiss that sends a chill down my spine and reverberates through the hairs on the back of my neck.  It’s been a while since I felt a kiss like that. In fact it’s just flat out been a while for me. I wonder how long it’d been for Meena and which matters more or if they’re additive and while I try to figure that out they stumble onto the couch and eventually roll onto the floor.  I shut my visual feed off, turn the sensory suppression back up, and do my best to give them some privacy. I won’t lie, I didn’t expect this guest to be the first to avail this “amenity.” But, I can’t entirely say I’m surprised. Meena has a determined bitterness that obviously guards something terribly sweet.  When I notice my heart rate begin to drop, I turn my visuals back on. They’ve made it to my bed. Meena’s lying on my back with Haniya’s head resting on my shoulder. The room is quiet except for the sound of calming breaths.  “Come back,” Meena squeezes out between breaths and into Haniya’s hair.  “As what, my love? Your assistant? Your cousin’s friend visiting from the states? An NGO worker there for training that you’re just showing around? What will you have me pretend to be this time?”  My throat locks up again as I feel blood rush to my cheeks.  Haniya sits up and lets my blanket fall off of her as she stands. She looks back down at me with a slight smile. “It was nice to see you again Meena. I’ve missed these stunts of yours.”  Meena just stares up at the ceiling while we listen to Haniya get dressed, slide the Tupperware off the counter and back onto her hip. Meena closes my eyes when we hear my apartment door open and shut. I’m certain she’s going to start crying again, but she just takes a deep breath and speaks.  “You’ll feel it one day.” She rolls into sitting position at the edge of the bed and looks in the mirror. “The desire to go back to when you were uncertain about who you’d turn out to be. When you lived foolishly thinking you could be something other than what you became in the end.” She lifts my right fingertips to my forehead, twice, with a gentle pseudo bounce and says, “Thanks for the company, Arsalan. Khuda-hafiz.”  As my limbs tingle back to me, I pull up Karla’s contact. While I mull the idea of calling her, I get an alert in my periphery from AirBody about a new request. I stare at Karla’s picture for a moment before closing her profile and pulling up AirBody. I’m certain I’ve already become who I’ll be in the end, so I might as well let everyone else be me for a little longer. Sameem Siddiqui is a speculative fiction writer currently living in the United States. He enjoys writing to explore the near future realities people of South Asian ancestry and Muslim heritage will face in the coming centuries. His stories explore issues of migration, gender, family structure, economics and space habitation. He’s attended the Tin House and FutureScapes workshops and his stories have appeared in Clarkesworld and ApparitionLit. Some of Sameem’s favorite authors include Kurt Vonnegut, Octavia Butler, and Haruki Murakami. When he’s not writing, Sameem enjoys reveling in fatherhood, watching 90’s Star Trek, and tinkering with data and music.", "text": "4970 words, short story\nAirBody\n2021 Finalist: Theodore A. Sturgeon Memorial Award\nAmazing how all Desi aunties are basically the same. Even when separated by vast oceans for a few generations. I mean, they fit into a few basic archetypes. There’s the genuine-sweetheart proxy mother who, in between her late-night work shifts, always makes sure you and your friends have all the snacks you need. The manipulative gossiper, who conveniently keeps details of her own children’s scandals nestled under her tongue. The nervous fidgeter who has spent three decades so worried that her basic thirty-year-old son won’t ever find a wife that she forgets to teach him how to speak to women. The late-life hijabi, who pointedly replaces “Khuda-hafiz” with “Allah-hafiz” and “thank you, beta” with not just “jazak-allah” but the full on “jazak allahu khayran.” But which of these archetypes would find it appropriate to rent the body of a grown man halfway across the world?\nI pull the AirBody request from Meena Khan into view in my contacts. She’s fifty-nine years old and from Karachi. Her short wavy hijab-less hair and her relaxed smile makes her seem content with life, so maybe she’s the genuine-sweetheart type. Her only notes on the request are a list of Desi groceries and some cookware, which only reinforces the archetype. Maybe she’s too ill to travel to visit family for Eid and wants to surprise them with a feast? It’s been a while since I’ve gotten a taste of such a spread. I hit accept and watch the usual legalese flash before me:\nYou acknowledge that you have the ability to observe, regain control, and remove your guests at any time and therefore may be complicit and responsible for any crimes or damage committed by your guests.\nI tap “Yes” and begin to look through her grocery list more closely. Some of it, like the sweetened condensed milk, half-and-half, sugar and cardamom powder I can get at the regular grocery store. But for the Desi ghee and chanay ki daal, I either have to pay a premium at the hippie organic store downstairs or drive out to a Desi grocery store in the suburbs. A drive would help kill some time, so I choose the Desi grocery store.\nWhen I return, I arrange all the ingredients in alphabetical order on my otherwise bare gray marble kitchen counter and head to bed. Meena activates at 6 AM and I don’t want to test AirBody’s zero-tolerance late policy. I also don’t want a review plagued with complaints of body odor and morning breath.\nMy alarm goes off at 5 AM, but I snooze several times, stumbling in and out of a wildly vivid dream about riding on the back of a sea turtle. Except, I’m not in the water. I think I might be floating through the sky. But, there are definitely other underwater creatures floating by, greeting us along the way. I feel love for the sea turtle and I lean over to kiss its rough green cheek when the snooze expires. Weird. But, my dreams have been odd since I started “playing host” on weekends a few months ago.\nBy 5:58 AM I’m towel dried, clothed and somewhat fed—a cookie is breakfast to some. I stand in front of the mirror as I clip the AirBody headset to the backs of my ears. It whirs on automatically—it doesn’t actually whir, but I imagine that’s the microscopic sound it makes as the violet light pulses. It authenticates my identity and says “Hello, Arsalan. Your AirBody guest is in the waiting area. Are you ready?”\n“Yup, I’m ready,” I say, trying to sound chipper, but nervous as fuck about what this will be like. This is my sixth time hosting and so far it’s been a good distraction to get through my weekends. Most of my other guests have been men, usually here for some business meeting at the World Bank, or to tour the monuments and museums with their grandchildren. The only other woman I’ve hosted was a lobbyist from an asteroid mining firm who didn’t think a one-hour meeting with a congressperson was worth breaking orbit for.\nMy limbs tingle as they go numb. I feel heavy for second, like I can’t support my own weight and am about to fall. And I do, in a way. Not physically. More like falling asleep into a dream that makes so much sense that it’s boring. Which is why, I suppose, AirBody lets hosts stream content and games to the neural UI while their guests go corporeal.\nI give Meena a few moments to adjust and watch her look around my living room. Her eyes stare at my mostly empty bookshelf surrounded by plain white walls. I don’t have much decor, except for the tiger painting Ammi bought in Thailand when she visited once in her early twenties.\n“Hi!” I say, my voice in the AirBody interface sounding way louder than I intend. I feel my heart rate increase and realize I must have scared her. “Sorry, I, uh, just wanted to say hello and let you know I’m here to assist you during your stay if you need help.”\n“Beta, Urdu nahin boltay?”\nOh crap. Not only am I going to get a bad review for my poor Urdu language skills, I’m now going to spend the next twenty-four hours meeting the scorn and judgment of a Pakistani aunty. Here we go.\n“Nahin, aunty, I—” I say slowly, preparing to flex my mind’s tongue with words I haven’t used in years.\n“Array profile pe Urdu likha tha!”\nOh god, if I don’t get removed after this listing, I need to delete Urdu from my language profile. If for nothing else, to escape this scorn. “Chalo, I’m here. What can I do now?” she says, waving my hands up in the air behind us. “Take me to the kitchen, beta . . . you do have a kitchen, right?”\n“Haan, yes,” I say, retaking control. My limbs tingle awake and I walk to the kitchen before handing her back control.\nI feel my body sigh and my head shake. “This will do,” she says as she walks to the corner of the counter where I’ve neatly arranged the ingredients she requested. She inspects them closely, as if she doesn’t trust that I bought the right things. But, she doesn’t make any complaints. She looks around the kitchen. There are a few dishes in the drying rack, but I made sure to clear out the sink, which is normally full until there’s a noticeable rot.\nShe begins opening cabinets, slowly and calmly at first. I assume she’s looking for something specific, but after a moment I’m sure she’s just being nosey. She comes to the last one, the little corner cabinet, the only one to the right of the sink. Shit.\nI want to distract her, to keep her from opening it, but interfering with an experience without consent or a reasonable emergency would lead to a bad review. So I watch hopelessly as she swings the cabinet open and stares at the label on the little translucent bottle half full with brown liquid.\n“Whiskey, beta? Tauba tauba,” she says as she slaps each of my cheeks gently. “Allah maf karay!” I’m not sure if she’s asking for forgiveness on my behalf, or if she somehow feels complicit in my sin by inhabiting my body. I mean, I’m not drunk—it’s six in the morning. Now if she wills that whiskey into me, then maybe she’d be complicit. Maybe.\nShe shuts the cabinet, still shaking her head, and pulls open the electric pressure cooker. We both notice the inner pot hasn’t been washed since the last time it was used, but only I know that this was many months ago. My eyes roll back into my head as she groans and clicks my tongue. She flicks on the tap and snatches the worn-out sponge on the edge of my sink. “Yeh koy tareeka hai, beta?”\nShe fills the pot with water so hot that I can feel the pain through the sensory suppression as she scrubs. I’m convinced this is intentional punishment. Maybe she isn’t the genuine-sweet type.\nShe empties the dal into the pot slowly, as if she doesn’t trust my eyes to check the quality of the product as a whole. The yellow pieces glint off the bottom of the worn metal, scattering into swirls as she shakes the bag to see if she can catch any unwanted particles.\nOne piece of dal pops off the bowl and onto the floor and I feel a tinge of the panic that froze me the first time I made dal. Not knowing what to do as the orange but almost magenta grains spilled onto the counter and to the floor. The worthlessness that would melt me into a blob as I’d hear Ammi’s tired and exasperated voice say “Beta, Arsalan, just once, would you do things without rushing?” Her finger would point at the door. “Out, now, if you can’t help properly.”\n“Savvy for a ten year old,” Nani would say as I’d run to her lap before the tears began to flow.\n“Haan, just as savvy as his useless father,” Ammi would say.\nAnd then the fear of inadequacy would stand me up straight, wipe my tears, and walk me back into the kitchen defiantly, striding close enough to Ammi to move her out of the way without physically attacking her. I’d sort it out. I’d sift the dirt out of the fallen dal. I’d get a jar to pour the extra back. And I’d have dinner on the table before Ammi returned from her evening shift. I would not be my useless father.\n“Is this right?” Meena asks as she presses the buttons on the pressure cooker.\n“You’re not gonna soak the dal first?”\n“Oh so now you’re such a refined cook?”\n“I can make dal.”\n“Then tell me, why soak the dal? What difference does it make, aside from wasting two hours of our lives?”\n“Well it’s just, what . . . it’s just what you do.”\n“Is it now?” She says, pressing start on the pressure cooker and effectively shutting me up. “Acha, where’s your janamaz beta? And the qibla is which direction?”\nI’m pretty sure I can feel a smirk on my face as she asks.\n“Inside the storage ottoman in the living room,” I say, coolly, trying to remember which way Ammi faced last time she visited. I point at my east facing windows and say, “And the qibla’s out the window that way, a little to the right.”\nShe opens the ottoman and pulls the janamaz out. I feel her stiffen as she notices my fingers grayed in dust. “Thank you beta,” she says, as she dusts off the janamaz and lays it out before the windows. I feel her swing my hands up to my ears before resting them high on my chest.\nShould she technically have put a dupatta on? Ammi’s maroon ajrak one is still in the ottoman. The last time she was here I watched her throw it over her shoulder, say “Keep to our own,” and start her prayers before I could respond. We had just come home from lunch where I had finally introduced her to Karla. I sat on the couch and hunched over to inspect the lines on my palms where I had dug my nails in deep, hoping the pain would make the lunch go by faster. It didn’t work.\nIt wasn’t so much that she and Karla didn’t get along. It was more that each time Karla attempted to strike up conversation, Ammi just smiled at her and returned to her meal. Karla excused herself halfway through lunch, pretending she had just gotten called into the hospital to oversee an operation.\nI kept my eyes down as she left and didn’t look up until a few moments later when Ammi said, “You know, the first time I met Eric’s mother, she did the same to me, but without a smile.”\n“Oh, so it’s healthy to perpetuate this cycle, Ammi?”\n“I stuck it out. When Eric got up to use the restroom, his mom leaned over and asked me if ‘your women still enjoy sex after your families circumcise you.’” Ammi sipped her tea and stared off somewhere above my head. “I smiled back, swallowed the words in my throat, and stuck it out. I’m glad Karla had the sense to run. She’s smarter and stronger than I was.”\nI sunk into my couch watching Ammi flow through the motions of prayer that I never felt at home in. I’d happily keep to my own, if I knew who my own was.\n“Chalo beta,” Meena says as she folds up the janamaz and puts it back into the dusty ottoman. “Let see how much time is left on this thing.”\nThe red digits flash through the final sixty seconds.\nMeena clicks the depressurize button and watches, as if she’s hypnotized by the plume of steam hissing out of the metal cylinder. I feel my ears perk up as she hones in on the sound. It’s as if she hasn’t seen or heard this in ages.\n“Don’t cook much anymore, eh?” I say, realizing I should probably contain my snark. But I don’t think she minds.\n“No, I cook almost every day. It’s just that I’m a bit deaf, so I’ve forgotten how the steam speaks to you. If you pay attention to the hiss, you’ll hear it tell you if the food is really ready, if it was cooked the way you intended, or if you’ll be disappointed when the lid unlocks. And if you watch closely, you’ll see how the steam interacts with the spirits in the air. If they gather toward the steam, you’re cooking something delicious. If they flee, well . . . ” she shrugs. “It’s an old aunty secret.”\n“Really?”\n“You’re one of the most gullible saps I’ve ever met, I’m sure.”\n“I didn’t believe you, I just couldn’t tell if you really believed it yourself.”\n“Mhmm.”\n“Alright, well you let me know if you need anything. I’m going to get some reading done.” Really there’s some gaming I need to catch up on, but she doesn’t need to know that. I suppress my visual feed and replace it with CoreEra4. Time to level up. The sensory suppression filters out most of Meena’s kitchen noise, until I hear the blender slicing through. I’m curious why she needs a blender to make dal, but not curious enough to hit pause.\nI’m pretty immersed in the game when I feel an almost pungent, but ultimately bland taste on my tongue. Meena’s shoveled a bit of what she’s done to this dal into my mouth. She massages the hot, dry musty paste into a lump as she lets each part of my tongue feel and inspect the texture. As it crumbles into the back of my throat, an aftertaste surfaces that reminds me of wanting to be kissed amidst an audience of 80s era wood paneling on neglected basement walls. An aftertaste on my anxiety-dried adolescent tongue, which had just uttered “I’d kiss you Eid Mubarak if you’d let me.” A line tacky enough to hold the confident façade of my smile in place while I waited inside my head screaming what in the FUCK are you thinking?\nI can almost hear Hafza’s laugh seeping in through my tongue and almost feel the slap that ended in an apologetic caress. My taste buds reverberate like the hair on the back of my neck when Hafza kissed the highest point of my cheekbone and then stared at me. I’d never seen anyone’s eyes so close. It was so overwhelming I had to close my own eyes. I’m not sure if she had started or me, but after years of pining, that was the first time my lips finally melted into another’s. And it would not be the last time I’d be rudely interrupted mid-kiss. Before the moment was over, Ammi was shouting, “Arsalan beta, let’s go!” from the top of the staircase behind me. Hafza broke the kiss and leaned over to whisper “Eid Mubarak, Arsalan” in my ear just before I jumped up, stunned by what had happened. The next thing I’d say to Hafza would be “congratulations” ten years later on her heavily decorated wedding stage, next to her heavily decorated new husband.\nMeena fills my mouth with water, washing my memory out. I ache for another taste of the musty paste. I want to go back for more, even though there is nothing to go back to.\n“What was that? It tasted familiar.”\n“Well, mister expert, you’ll have to wait and see.”\nSo I watch her set the pot on the stove above the lowest possible flame and plop in a few heaps of ghee. As it melts and simmers unevenly in the pot, she picks up the blender and begins scooping the paste out. The warm ghee spatters on the backs of my hands as the first few clumps land in the pot.\nMy arm will no doubt be sore the next day, because for a while she just leans on the counter and stirs every few minutes, keeping the darkening paste on the bottom from sticking to the pot. Eventually she stops to add sugar, mixing it in evenly before flipping the paste over and pouring the rest of the sugar in. Once the white crystals disappear into the paste she scoops a spoon full out and closes my eyes as the warm sugary sensation hits my lips. I’m flooded with images of Tupperware decorated by cold and soggy deep-fried finger foods and heavenly sweetened desserts. But, it’s all dammed by the memory of Karla’s voice asking the question, “Why can’t you just bring me home for Eid, like a normal person?”\n“Ammi’s just not well,” I had said, opening one dish and lifting it up. What dish was it?\n“She’s well enough to have cooked all of this,” Karla had said, gesturing to the to-go holiday foods.\nI plunged a spoon into the Tupperware and scooped up something and shoved it toward Karla’s mouth. “Just try a bite.”\nKarla rolled her eyes and opened her mouth. Then, when the taste soaked into her tongue, she opened her eyes wide. Her eyes rolled again, but with pleasure this time. “What the fuck is this?”\n“Chanay-ki daal ka-halwa,” I say into the AirBody UI.\n“Very good!” Meena stabs with her standard tone of condescension. She pours another can of condensed milk in and continues stirring. “Gustatory memory.”\n“What?”\n“Taste. It’s got a peculiar way of triggering memory and emotion, don’t you think? More so than other senses. Taste links us directly to our gut, where our deepest unfulfilled needs keep us hungry. Your gut tricks your mind into thinking you’re getting what you want, when it’s really just using you to get the—” she scoops up another bite and I feel my eyes roll back into my head “—mmm. The sweet halwa.”\nShe opens my eyes and looks down at the bright yellowy paste.\n“But, I remember this being brown whenever my Nani made it.”\n“Haan beta, just wait,” she says as she preheats the oven to 400 degrees. When the oven beeps she slides the pan in and sets a timer for fifteen minutes.\n“Acha beta, what kind of formal wear do you have?”\n“Formal wear?”\n“Haan, kurta pajama? Shalwar kameez? Whichever you’d like to call it.”\n“Uhhh . . . ”\n“Oh, of course. Well, at least put us in a pressed pant-shirt,” she says handing me back control.\n“Sure,” I say, heading back to my room to pull out some blue slacks and a new red and gray striped shirt I haven’t worn yet.\nI stand before the mirror making final touches when she pings for control back.\n“Well at least you’ve got some color in your wardrobe.” She picks up a pen from my dresser and writes down an address on the price tag I just ripped off of the shirt I put on. “I need to go here.”\n“Sounds good to me,” I say as I feel her pass control back.\nAs we make our way out of the city and onto the I-95 I glance at the sign for BWI Airport. The last time I was supposed to go to BWI was the last time I was supposed to see Karla. She had been away for work for a week and I was on my way to pick her up when I got a call from Ammi’s doctor. My mind went single track and I skipped the exit for the airport and drove straight to the hospital in Philly where Ammi was taking her last breaths, alone. I made it in time to say goodbye, but not much else.\nKarla only called once that night. I stayed in Philly for six days and when I got back my place was emptied of Karla’s things, which was most everything. If I had called to let her know what was going on, she would have understood, would have come up to help. I never figured out why we played this game of chicken. We’d done it before. But, this time we both ran off the cliff and it felt right to let things rest at the bottom of the canyon rather than pick them up and rebuild.\nI pull up in front of the house and step out of the car, grabbing the dish of halwa along the way. The magenta sunset laces the gray house like a mesh dupatta. There are a lot of cars parked on the driveway and a bluster of muffled laughter coming through the windows of the brightly lit living room.\nAs I get to the front door I hand back control and immediately feel my heart rate spike. She stares dead ahead, frozen still.\n“Are you alright?”\n“Haan, I just—”\nThe door swings open to a woman dressed in a gray and blue shalwar kameez. She’s still looking at her guests behind her and laughing. Her smile sticks as she turns to look at me. Her purple-streaked hair’s tied up in a bun. She’s probably a little younger than Meena, maybe late forties? I study her face to see if I can parse a family resemblance to Meena’s profile picture.\n“I’m sorry, can I help you?” the woman asks, leaning against her door jamb.\nI can feel Meena trying to push the air through my larynx and out of my mouth but it’s sealed shut. Instead, she just lifts the dish of halwa and opens it.\nThe woman leans forward and inspects the congealed brown paste. The sunset breeze blows a warm waft of the dish’s scent into my nose.\nThe woman looks back at me, but her eyebrows are strained around her eye sockets now. Without a word, she takes a step back and slams the door in my face.\nMeena stands there for a minute in my shaking body, with the halwa still cooling in the open air. She flattens the lid back onto the dish and lays a card on top of it. She puts the dish down gently onto the frilly brown “Welcome Home” mat. She picks up a small white rock from the side of the porch and places it on top of the card to keep it from flying away, before turning back to the car.\nAs soon as I feel the first tear hit my cheek she stops.\n“Beta, take us home.”\nThe tears stop as I take control, but I can still feel the strain in the back of my throat. This is the first time I’ve wondered what happens when people hand me back control temporarily. Do they come back to life in their homes? Is she convulsing over her toilet, vomiting up as much of the regret as possible before curling into a ball of tears on her bathroom floor? Or is she lying peacefully, letting the tears soak into her veins until the pain passes.\nOnce at home she requests control and immediately goes back to the cabinet in the corner, pulling out the bottle of whiskey and pouring it into a chipped glass she finds in my drying rack. She carries it in my shaking hands and walks to the armchair that faces the window. As the final moments of sunset fade away, I can see her staring back at me in the reflection of the window.\nShe holds up the glass and stares into the brown liquid as she swirls it around.\n“Beta,” she says aloud. “How do you decide which one is right for you?”\n“What do you mean?” I respond, echoing in my own head.\n“Which drink? How did you know it was whiskey? Not Beer? Wine? Cocktail?”\n“Well, I drink them all, so—” I hesitate, uncertain of where this is going, “—but I don’t drink much.”\n“Haan, beta, whatever.” She smirks at me in the window and swings the whiskey full down my throat. I turn down the sensory suppression and feel the initial hit seep into my blood and loosen my muscles. She picks the bottle up from the table and pours another shot.\n“Are you okay?”\n“I’ll be fine, just need to process a bit.” She lifts the glass, but sips at the whiskey this time. I assume the first time was purely for shock value.\n“What’s your deal?”\n“My deal, beta?”\n“Don’t beta me, I’m a grown man.”\n“Haan,” she pauses, scanning my sad apartment, “of course you are.”\n“Why are you here? Who was that woman?”\n“Just an old acquaintance. It’s not important.”\n“Then why me? Were there no other, more appropriate hosts available?”\n“Appropriate how?”\n“I don’t know, an older woman, someone more fitting your background?”\nShe laughs. “My background? Beta, you were the only ‘Urdu speaking’ host of Pakistani origin whose listing authorizes sexual behavior during a visit.”\nBefore I can respond there’s a knock at the door.\n“Were you expecting anyone, beta?”\n“No.”\nShe sets the glass down and goes to open the door. There is the woman, still in her gray and blue shalwar kameez, holding my dish with one hand and one hip. I watch my eyelids wrap around the woman in the doorway and make a shape I haven’t seen them make in months.\n“Is it still you, Meena?”\nMeena nods, my larynx suddenly sealed shut once again.\n“You think you’re quite clever, don’t you?” The woman walks into the apartment and slides the dish onto the counter. She pulls the lid off, revealing at least 2-3 servings worth gone. “I’m going to eat the rest on my own as well. I’m not sharing.” She smiles as she pulls off her dupatta and throws it at me.\nMeena catches it and laughs, finally loosening my throat. “Haniya, I—”\nHaniya leans in quick to shut up Meena with a hard kiss that sends a chill down my spine and reverberates through the hairs on the back of my neck.\nIt’s been a while since I felt a kiss like that. In fact it’s just flat out been a while for me. I wonder how long it’d been for Meena and which matters more or if they’re additive and while I try to figure that out they stumble onto the couch and eventually roll onto the floor.\nI shut my visual feed off, turn the sensory suppression back up, and do my best to give them some privacy. I won’t lie, I didn’t expect this guest to be the first to avail this “amenity.” But, I can’t entirely say I’m surprised. Meena has a determined bitterness that obviously guards something terribly sweet.\nWhen I notice my heart rate begin to drop, I turn my visuals back on. They’ve made it to my bed. Meena’s lying on my back with Haniya’s head resting on my shoulder. The room is quiet except for the sound of calming breaths.\n“Come back,” Meena squeezes out between breaths and into Haniya’s hair.\n“As what, my love? Your assistant? Your cousin’s friend visiting from the states? An NGO worker there for training that you’re just showing around? What will you have me pretend to be this time?”\nMy throat locks up again as I feel blood rush to my cheeks.\nHaniya sits up and lets my blanket fall off of her as she stands. She looks back down at me with a slight smile. “It was nice to see you again Meena. I’ve missed these stunts of yours.”\nMeena just stares up at the ceiling while we listen to Haniya get dressed, slide the Tupperware off the counter and back onto her hip. Meena closes my eyes when we hear my apartment door open and shut. I’m certain she’s going to start crying again, but she just takes a deep breath and speaks.\n“You’ll feel it one day.” She rolls into sitting position at the edge of the bed and looks in the mirror. “The desire to go back to when you were uncertain about who you’d turn out to be. When you lived foolishly thinking you could be something other than what you became in the end.” She lifts my right fingertips to my forehead, twice, with a gentle pseudo bounce and says, “Thanks for the company, Arsalan. Khuda-hafiz.”\nAs my limbs tingle back to me, I pull up Karla’s contact. While I mull the idea of calling her, I get an alert in my periphery from AirBody about a new request. I stare at Karla’s picture for a moment before closing her profile and pulling up AirBody. I’m certain I’ve already become who I’ll be in the end, so I might as well let everyone else be me for a little longer.\nSameem Siddiqui is a speculative fiction writer currently living in the United States. He enjoys writing to explore the near future realities people of South Asian ancestry and Muslim heritage will face in the coming centuries. His stories explore issues of migration, gender, family structure, economics and space habitation. He’s attended the Tin House and FutureScapes workshops and his stories have appeared in Clarkesworld and ApparitionLit. Some of Sameem’s favorite authors include Kurt Vonnegut, Octavia Butler, and Haruki Murakami. When he’s not writing, Sameem enjoys reveling in fatherhood, watching 90’s Star Trek, and tinkering with data and music.", "source": "https://clarkesworldmagazine.com/siddiqui_04_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: AirBody by Sameem Siddiqui"}