{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Madeline Ashby", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "T2Ez266zS90ltePZ0D+c0h2azws=", "id": null, "license": null, "comments": "", "raw_text": "8190 words, novelette, REPRINT  Death on Mars  “Is he still on schedule?”  Donna’s hand spidered across the tactical array. She pinched and threw a map into Khalidah’s lenses. Marshall’s tug glowed there, spiraling ever closer to its target. Khalidah caught herself missing baseball. She squashed the sentiment immediately. It wasn’t really the sport she missed, she reminded herself. She just missed her fantasy league. Phobos was much too far away to get a real game going; the lag was simply too long for her bets to cover any meaningful spread. She could run a model, of course, and had even filled one halfway during the trip out. It wasn’t the same.  Besides, it was more helpful to participate in hobbies she could share with the others. The counselors had been very clear on that subject. She was better off participating in Game Night, and the monthly book club they maintained with the Girl Scouts and Guides of North America.  “He’s on time,” Donna said. “Stop worrying.”  “I’m not worried,” Khalidah said. And she wasn’t. Not really. Not about when he would arrive.  Donna pushed away from the terminal. She looked older than she had when they’d landed. They’d all aged, of course—the trip out and the lack of real produce hadn’t exactly done any of them any favors—but Donna seemed to have changed more dramatically than Khalidah or Brooklyn or Song. She’d cut most of her hair off, and now the silver that once sparkled along her roots was the only color left. The exo-suit hung loose on her. She hadn’t been eating. Everyone hated the latest rotation of rations. Who on Earth—literally, who?—thought that testing the nutritional merits of a traditional Buddhist macrobiotic diet in space was a good idea? What sadistic special-interest group had funded that particular line of research?  “It will be fine,” Donna said. “We will be fine.”  “I just don’t want things to change.”  “Things always change,” Donna said. “God is change. Right, Octavia?” The station spoke: “Right, Donna.”  Khalidah folded her arms. “So do we have to add an Arthur, just for him? Or a Robert? Or an Isaac? Or a Philip?”  The station switched its persona to Alice B. Sheldon. Its icon spun like a coin in the upper right of Khalidah’s vision. “We already have a James,” the station said. The icon winked.  “Khalidah, look at me,” Donna said. Khalidah defocused from the In-Vision array and met the gaze of her mission manager. “It won’t be easy,” the older woman said. “But nothing out here is. We already have plenty of data about our particular group. You think there won’t be sudden changes to group dynamics, down there?”  She pointed. And there it was: red and rusty, the color of old blood. Mars.  His name was Cody Marshall. He was Florida born and bred, white, with white-blond hair and a tendency toward rosacea. He held a PhD in computer science from Mudd. He’d done one internship in Syria, building drone-supported mesh nets, and another in Alert, Nunavut. He’d coordinated the emergency repair of an oil pipeline there using a combination of declassified Russian submersibles and American cable-monitoring drones. He’d managed the project almost single-handedly after the team lead at Alert killed himself.  Now here he was on Phobos, sent to debug the borehole driller on Mars. A recent solar storm had completely fried the drill’s comms systems; Donna insisted it needed a complete overhaul, and two heads were better than one. Marshall couldn’t do the job from home—they’d lose days reprogramming the things on the fly, and the drill bits were in sensitive places. One false move and months of work might collapse around billions of dollars of research, crushing it deep into the red dirt. He needed to be close. After all, he’d written much of the code himself.  This was his first flight.  “I didn’t want to be an astronaut,” he’d told them over the lag, when they first met. “I got into this because I loved robots. That’s all. I had no idea this is where I would wind up. But I’m really grateful to be here. I know it’s a change.”  “If you make a toilet seat joke, we’ll delete your porn,” Song said, now. When they all laughed, she looked around at the crowd. “What’s funny? I’m serious. I didn’t come all the way out here to play out a sitcom.”  Marshall snapped his fingers. “That reminds me.” He rifled through one of the many pouches he’d lugged on board. “Your mom sent this along with me.” He coasted a vial through the air at her. Inside, a small crystal glinted. “That’s your brother’s wedding. And your new nephew’s baptism. Speaking of sitcoms. She told me some stories to tell you. She didn’t want to record them—”  “She’s very nervous about recording anything.”  “—so she told me to tell them to you.”  Song rolled her eyes. “Are they about Uncle Chan-wook?”  Marshall’s pale eyebrows lifted high on his pink forehead. “How’d you guess?”  Again, the room erupted in laughter. Brooklyn laughed the loudest. She was a natural flirt. Her parents had named her after a borough they’d visited only once. In high school, she had self-published a series of homoerotic detective novels set in ancient Greece. The profits financed med school. After that, she hit Parsons for an unconventional residency. She’d worked on the team that designed the exo-suits they now wore. She had already coordinated Marshall’s fitting over the lag. It fit him well. At least, Brooklyn seemed pleased. She was smiling so wide that Khalidah could see the single cavity she’d sustained in all her years of eschewing most refined sugars.  Khalidah rather suspected that Brooklyn had secretly advocated for the macrobiotic study. Chugging a blue algae smoothie every morning seemed like her kind of thing. Khalidah had never asked about it. It was better not to know.  But wasn’t that the larger point of this particular experiment? To see if they could all get along? To see if women—with their lower caloric needs, their lesser weight, their quite literally cheaper labor, in more ways than one—could get the job done on Phobos? Sure, they were there on a planetary protection mission to gather the last remaining soil samples before the first human-oriented missions showed up, thereby ensuring the “chain of evidence” for future DNA experimentation. But they all knew—didn’t they—what this was really about. How the media talked about them. How the Internet talked about them. Early on, before departure, Khalidah had seen the memes.  For Brooklyn, Marshall had a single chime. Brooklyn’s mother had sent it to “clear the energy” of the station. During the Cold Lake training mission, she’d sent a Tibetan singing bowl.  For Khalidah, he had all 4,860 games of last year’s regular season. “It’s lossless,” he said. “All 30 teams. Even the crappy ones. One of our guys down at Kennedy, he has a brother-in-law in Orlando, works at ESPN. They got in touch with your dad, and, well . . . ”  “Thank you,” Khalidah said.  “Yeah. Sure.” Marshall cleared his throat. He rocked on his toes, pitched a little too far forward, and wheeled his arms briefly to recover his balance. If possible, he turned even pinker, so the color of his face now matched the color of his ears. “So. Here you go. I don’t know what else is on there, but, um . . . there it is. Enjoy.”  “Thank you.” Khalidah lifted the vial of media from his hand. Her crystal was darker than Song’s. Denser. It had been etched more often. She stuffed it in the right breast pocket of her suit. If for some reason her heart cut out and the suit had to give her a jolt, the crystal would be safe.  “And for you, Donna. Here’s what we talked about. They gave you double, just in case.”  Donna’s hand was already out. It shook a little as Marshall placed a small bottle in it. The label was easy to see. Easy to read. Big purple letters branded on the stark white sticker. Lethezine. The death drug. The colony of nanomachines that quietly took over the brain, shutting off major functions silently and painlessly. The best, most dignified death possible. The kind you had to ask the government for personally, complete with letters of recommendation from people with advanced degrees that could be revoked if they lied, like it was a grant application or admission to a very prestigious community. Which in fact it was.  “What is that?” Brooklyn asked.  It was a stupid question. Everyone knew exactly what it was. She was just bringing it out into the open. They’d been briefed on that. On making the implicit become explicit. On voicing what had gone unasked. Speaking the unspeakable. It was, in fact, part of the training. There were certain things you were supposed to suppress. And other things that you couldn’t let fester. They had drilled on it, over and over, at Cold Lake and in Mongolia and again and again during role-plays with the station interface.  “Why do you have that?” Brooklyn continued, when Donna didn’t answer. “Why would he give that to you?”  Donna pocketed the bottle before she opened her mouth to speak. When she did, she lifted her gaze and stared at each of them in turn. She smiled tightly. For the first time, Khalidah realized the older woman’s grimace was not borne of impatience, but rather simple animal pain. “It’s because I’m dying,” she said.  She said it like it was a commonplace event. Like, “Oh, it’s because I’m painting the kitchen,” or “It’s because I took the dog for a walk.”  In her lenses, Khalidah saw the entire group’s auras begin to flare. The auras were nothing mystical, nothing more than ambient indicators of what the sensors in the suits were detecting: heart rate, blood pressure, temperature, odd little twitches of muscle fibers. She watched them move from baseline green to bruise purple—the color of tension, of frustration. Only Song remained calm: her aura its customary frosty mint green, the same shade once worn by astronauts’ wives at the advent of the Space Race.  “You knew?” she managed to say, just as Marshall said, “You didn’t tell them?”  Khalidah whirled to stare at him. His mouth hung open. He squinted at Donna, then glanced around the group. “Wait,” he said. “Wait. Let’s just take a minute. I . . . ” He swallowed. “I need a minute. You . . . ” He spun in place and pointed at Donna. “This was a shitty thing to do. I mean, really, truly, deeply, profoundly not cool. Lying to your team isn’t cool. Setting me up to fail isn’t cool.”  “I have a brain tumor,” Donna said blandly. “I’m not necessarily in my right mind.”  “Donna,” Song said quietly.  Oh, God. Donna was dying. She was dying and she hadn’t told them and minty-green Song had known about it the whole damn time.  “You knew,” Khalidah managed to say.  “Of course she knew,” Donna said. “She’s our doctor.”  Donna was dying. Donna would be dead, soon. Donna had lied to all of them.  “It’s inoperable,” Donna added, as though talking about a bad seam in her suit and not her gray matter. “And in any case, I wouldn’t want to operate on it. I still have a few good months here—”  “A few months?” Brooklyn was crying. The tears beaded away from her face and she batted at them, as though breaking them into smaller pieces would somehow dismantle the grief and its cause. “You have months? That’s it?”  “More or less.” Donna shrugged. “I could make it longer, with chemo, or nano. But we don’t have those kinds of therapies here. Even if we did, and the tumor did shrink, Song isn’t a brain surgeon, and the lag is too slow for Dr. Spyder to do something that delicate.” She jerked a thumb at the surgical assistant in its cubby. “And there’s the fact that I don’t want to leave.”  There was an awful silence filled only by the sounds of the station: the water recycler, the rasp of air in the vents, an unanswered alert chiming on and off, off and on. It was the sound the drill made when it encountered issues of structural integrity and wanted a directive on how to proceed. If they didn’t answer it in five more minutes, the chime would increase in rate and volume. If they didn’t answer it after another five minutes, the drill itself would relay a message via the rovers to tell mission control they were being bad parents.  And none of that mattered now. At least, Khalidah could not make it matter, in her head. She could not pull the alert into the “urgent” section of her mind. Because Donna was dying, Donna would be dead soon, Donna was in all likelihood going to kill herself right here on the station and what would they do—  Donna snapped her fingers and opened the alert. She pushed it over to tactical array where they could all see it. “Marshall, go and take a look.”  Marshall seemed glad of any excuse to leave the conversation. He drifted over to the array and started pulling apart the alert with his fingers. His suit was still so new that his every swipe and pinch and pull worked on the first try. His fingers hadn’t worn down yet. Not like theirs. Not like Donna’s.  “Can you do that?” Khalidah asked Donna. When Donna didn’t answer, she focused on Song. “Can she do that?”  Song’s face closed. She was in full physician mode now. Gone was the cheerful woman with the round face who joked about porn. Had the person they’d become friends with ever truly been real? Was she always this cold, underneath? Was it being so far away from Earth that made it so easy for her to lie to them? “It’s her body, Khal. She doesn’t have any obligation to force it to suffer.”  Khalidah tried to catch Donna’s eye. “You flew with the Air Force. You flew over Syria and Sudan. You—”  “Yes, and whatever I was exposed to there probably had a hand in this,” Donna muttered. “The buildings, you know. They released all kinds of nasty stuff. Like first responder syndrome, but worse.” She pinched her nose. It was the only sign she ever registered of a headache. “But it’s done, now, Khalidah. I’ve made my decision.”  “But—”  “We all knew this might be a one-way trip,” Song added.  “Don’t patronize me, Song,” Khalidah snapped.  “Then grow up,” Song sighed. “Donna put this in her living will ages ago. Long before she even had her first flight. She was preapproved for Lethezine, thanks to her family’s cancer history. There was always a chance that she would get cancer on this trip, given the radiation exposure. But her physicians decided it was an acceptable risk, and she chose to come here in full awareness of that risk.”  “I’m right here, you know,” Donna said. “I’m not dead yet.”  “You could still retire,” Khalidah heard herself say. “You could go private. Join a board of trustees somewhere, or something like that. They’d cover a subscription, maybe they could get you implants—”  “I don’t want implants, Khal, I want to die here—”  “I brought some implants,” Marshall said, without turning around. He slid one last number into place, then wiped away the display. Now he turned. He took a deep breath, as though he’d rehearsed this speech the whole trip over. Which he probably had. Belatedly, Khalidah noticed the length of his hair and fingernails. God, he’d done the whole trip alone. The station couldn’t bear more than one extra; as it was, he’d needed to bring extra scrubbers and promise to spend most of the time in his own hab docked to theirs.  “I brought implants,” he continued. “They’re prototypes. No surgery necessary. Houston insisted. They wanted to give you one last chance to change your mind.”  “I’m not going to change my mind,” Donna said. “I want to die here.”  “Please stop saying that.” Brooklyn wiped her eyes. “Please just stop saying that.”  “But it’s the truth,” Donna said, in her maddening why-isn’t-everyone-as-objective-about-this-as-I-am way. “My whole life, I’ve wanted to go to Mars. And now I’m within sight of it. I’m not going to leave just because there’s a lesion on my brain. Not when I just got here.” She huffed. “Besides. I’d be no good to any of you on chemo. I’d be sick.”  “You are sick,” Khalidah snapped.  “Not that sick.” Song lifted her gaze from her nails and gestured at the rest of them. “None of you noticed, did you? Both of you thought she was fine.”  “Yeah, no thanks to you.”  “Don’t take that tone with me. She’s my patient. I’d respect your right to confidentiality the same way I respected hers.”  “You put the mission at risk,” Khalidah said.  “Oh my God, Khal, stop talking like them.” Brooklyn’s voice was still thick with tears. “You’re not mission control. This has nothing to do with the mission”  “It has everything to do with the mission!” Khalidah rounded on Donna. “How could you do this? How could you not tell us? This entire experiment hinges on social cohesion. That’s why we’re here. We’re here to prove . . . ”  Now the silence had changed into something wholly other. It was much heavier now. Much more accusatory. Donna folded her arms.  “What are we here to prove, Khalidah?”  Khalidah shut her eyes. She would be professional. She would not cry. She would not get angry. At least, no angrier than she already was. She would not focus on Donna’s betrayal, and her deceit, and the fact that she had the audacity to pull this bullshit so soon after . . . Khalidah took a deep breath.  She would put it aside. Humans are containers of emotion. She made herself see the words in the visualizing interface they had for moments like this. When someone else’s emotions spill out, it’s because their container is full. She focused on her breathing. She pictured the color of her aura changing in the others’ lenses. She imagined pushing the color from purple to green, healing it slowly, as though it were the evidence of a terrible wound.  “I’m fine,” she said. “I’m fine. I’m sorry.”  “That’s good,” Donna said. “Because we’re not here to prove any one particular thing or another. We’re here to run experiments, gather the last Martian samples before the crewed missions begin, and observe the drills as they dig out the colony. That’s all we’re here to do. You may feel pressure to do something else, due to the nature of this team, but that’s not why we’re here. The work comes first. The policy comes later.”  The Morrígu was divided into three pods: Badb, Macha, and Nemain. No one referred to them that way, of course—only Marshall had the big idea to actually try stumbling through ancient Gaelic with his good ol’ boy accent. He gave up after two weeks. Nonetheless, he still referred to his unit as the Corvus.  “Nice of them to stick with the crow theme,” he said.  “Ravens are omens of death,” Donna said, and just like that, Game Night was over. That was fine with Khalidah. Low-gravity games never had the degree of complexity she liked; they had magnetic game boards, but they weren’t entirely the same. And without cards or tokens they couldn’t really visualize the game in front of them, and basically played permutations of Werewolf or Mafia until they learned each other’s tells.  Not that all that experience had helped her read Donna and Song’s dishonesty. Even after all their time spent together, in training, on the flight, on the station, there was the capacity for betrayal. Even now, she did not truly know them.  Not yet, Khalidah often repeated to herself, as the days stretched on. Not yet. Not for the first time, she wished for a return to 24-hour days. Once upon a time, they had seemed so long. She had yearned for afternoons to end, for lectures to cease, for shifts to close. Now she understood that days on Earth were beautifully, mercifully short.  Sometimes Khalidah caught Donna watching her silently, when she didn’t think Khalidah would notice. When Khalidah met her eyes, Donna would try to smile. It was more a crinkling of the eyes than anything else. It was hard to tell if she was in pain, or unhappy, or both. The brain had no nerve endings of its own, no pain receptors. The headaches that Donna felt were not the tissue’s response to her tumor, but rather a warning sign about a crowded nerve, an endless alarm that rang down through her spinal column and caused nausea and throbbing at odd hours. Or so she said.  Khalidah’s first email was to her own psychiatrist on Earth, through her personal private channel. It was likely the very same type of channel Donna had used to carry on her deception. Can a member of crew just hide any medical condition they want? she wrote.  Your confidentiality and privacy are paramount, Dr. Hassan wrote back from Detroit. You have sacrificed a great deal of privacy to go on this mission. You live in close quarters, quite literally right on top of each other. So the private channels you have left are considered sacrosanct. Communications between any participant and her doctor must remain private until the patient chooses to disclose.  This was not the answer Khalidah had wanted to hear.  Imagine if it were you who had a secret, Dr. Hassan continued, as though having anticipated Khalidah’s feelings on the matter. If you were experiencing the occasional suicidal ideation, for example, would you want your whole crew to know, or would you wait for the ideations to pass?  It was a valid counterargument. Mental health was a major concern on long-haul missions. Adequate care required stringent privacy. But Donna’s cancer wasn’t a passing thought about how much easier it would be to be dead. She was actually dying. And she hadn’t told them.  Now, after all that silence on the matter, the cancer seemed to be all anyone could talk about.  “I’ve almost trained the pain to live on Martian time,” Donna said, one morning. “Most patients feel pain in the morning, but they feel it on an Earth schedule, with full sunlight.”  Khalidah could not bring herself to smile back, not yet. Doing so felt like admitting defeat.  “She won’t die any slower just because you’re mad at her,” Brooklyn said, as they conducted seal checks on the suits.  “Leave me alone,” Khalidah said. Brooklyn just shrugged and got on with the checklist. A moment later, she asked for a flashlight. Khalidah handed it to her without a word.  “Have you watched any of the games your dad sent?” Marshall asked, the next day.  “Please don’t bring him up,” Khalidah said.  Five weeks later, the vomiting started. It was an intriguing low-gravity problem—barf bags were standard, but carrying them around wasn’t. And Donna couldn’t just commandeer the shop-vac for her own personal use. In the end, Marshall made her a little butterfly net, of sorts, with an iris at one end. It was like a very old-fashioned nebulizer for inhaling asthma medication. Only it worked in the other direction.  Not coincidentally, Marshall had brought with him an entire liquid diet intended specifically for cancer patients. Donna switched, and things got better.  “I’ll stick around long enough to get the last samples from Hellas,” she said, sipping a pouch of what appeared to be either a strawberry milkshake or an anti-nausea tonic. She coughed. The cough turned into a gag that she needed to suppress. She clenched a fist and then unclenched it, to master it. “I want my John Hancock on those damn things.”  “Don’t you want to see the landing?” Marshall asked. “You know, hand over the keys, see their faces when they see the ant farm in person for the first time?”  “What, and watch them fuck up all our hard work?”  They all laughed. All of them but Khalidah. How could they just act like everything was normal? Did the crew of the Ganesha mission even know that Donna was sick? Would the team have to explain it? How would that conversation even happen? (“Welcome to Mars. Sorry, but we’re in the middle of a funeral. Anyway, try not to get your microbes everywhere.” )  Then the seizures started. They weren’t violent. More like gentle panic attacks. “My arm doesn’t feel like my arm anymore,” Donna said, as she continued to man her console with one hand. “No visual changes, though. Just localized disassociation.”  “That’s a great band name,” Marshall said.  Morrígu tried to help, in her own way. The station gently reminded Khalidah of all the things that she already knew: that she was distracted, that she wasn’t sleeping, that she would lie awake listening for the slightest tremor in Donna’s breathing, and that sometimes Brooklyn would reach up from her cubby and squeeze Khalidah’s ankle because she was listening too. The station made herself available in the form of the alters, often pinging Khalidah when her gaze failed to track properly across a display, or when her blood pressure spiked, or when she couldn’t sleep. Ursula, most often, but then Octavia. God is Change, the station reminded her. The only lasting truth is Change.  And Khalidah knew that to be true. She did. She simply drew no comfort from it. Too many things had changed already. Donna was dying. Donna, who had calmly helped her slide the rods into the sleeves as they pitched tents in Alberta one dark night while the wolves howled and the thermometer dropped to 30 below. Donna, who had said, “Of course you can do it. That’s not the question,” when Khalidah reached between the cots during isolation week and asked Donna if the older woman thought she was really tough enough to do the job. Donna, without whom Khalidah might have quit at any time.  “You watch any of those games yet?” Marshall asked, when he caught her staring down at the blood-dark surface of the planet. Rusted, old. Not like the wine-dark samples that Song drained from Donna each week.  Khalidah only shook her head. Baseball seemed so stupid now.  “Your dad, he really wanted to get those to you before I left,” Marshall reminded her.  Khalidah took a deep, luxuriant breath. “I told you not to mention him, Marshall. I asked you nicely. Are you going to respect those boundaries, or are we going to have a problem?”  Marshall said nothing, at first. Instead he drifted in place, holding the nearest grip to keep himself tethered. He hadn’t learned how to tuck himself in yet, how to twist and wring himself so that he passed through without touching anyone else. Everything about his presence there still felt wrong.  “We don’t have to be friends,” he said, in measured tones. He pointed down into Storage. “But the others, they’re your friends. Or they thought they were. Until now.”  “They lied to me.”  “Oh, come on. You think it wasn’t tough for Song to go through that? You think she enjoyed it, not telling you? Jesus Christ, Khalidah. Maybe you haven’t noticed, but a lot of us made a lot of sacrifices to get this far.”  “Oh, I’m sure it was so difficult for you, finding out you’d get to go to Mars—”  “—Phobos.”  “—Phobos, without anything like the training we had to endure, just so you could pilot your finicky fucking drill God knows where—”  “Hey, now, I happen to like my finicky fucking drill very fucking much,” Marshall said. He blinked. Then covered his face with his hands. He’d filed his nails down and buzzed his hair in solidarity with Donna. His entire skull was flushed the color of a new spring geranium. “That . . . didn’t come out right.”  Khalidah hung in place. She drew her knees up to her chest and floated. It had been a long time since she’d experienced secondhand embarrassment. Something about sharing such a tiny space with the others for so long ground it out of a person. But she was embarrassed for Marshall now. Not as embarrassed as he was, thank goodness. But embarrassed.  “They sent me alone, you know,” he said, finally, through the splay of his fingers. He scrubbed at the bare stubble of his skull. “Alone. Do you even know what that means? You know all those desert island questions in job interviews? When they ask you what books you’d bring, if you were stranded in the middle of nowhere? Well, I read all of those. War and Peace. Being and Nothingness. Do you have any idea how good I am at solitaire, by now?”  “You can’t be good at solitaire, it’s—”  “But I did it, because they said it was the best chance for giving Donna extra time. If they’d sent two of us, you’d all have to go home a hell of a lot faster. You wouldn’t be here when Ganesha arrives. So I did it. I got here. Alone. I did the whole trip by myself. So you and Donna and the whole crew could have more time.”  Khalidah swallowed hard. “Are you finished?”  “Yes. I’m finished.” He pushed himself off the wall, then bounced away and twisted back to face her. “No. I’m not. I think you’re being a total hypocrite, and I think it’s undermining whatever social value the Morrígu experiment was meant to have.”  Khalidah felt her eyebrows crawl up to touch the edges of her veil. “Excuse me?”  “Yeah. You heard me. You’re being a hypocrite.” He lowered his voice. “Do your friends even know your dad died? Did you tell them that he was dying, when you left? Because I was told not to mention it, and that sure as hell sounds like a secret to me.”  Khalidah closed her eyes. The only place to go, in a space this small, was inward. There was no escape, otherwise. She waited until that soft darkness had settled around her and then asked, “Why are you doing this?”  “Because you’re not alone, out here. You have friends. Friends you’ve known and worked with for years, in one way or another. So what if Donna jerked you around? She jerked me around too, and you don’t see me acting like a brat about it. Or Brooklyn. Or Song. Meanwhile you’ve been keeping this massive life-changing event from them this whole time.”  Now Khalidah’s eyes opened. She had no need for that comforting blanket of darkness now. “My father dying is not a massive life-changing event,” she snapped. “You think you know all my secrets? You don’t know shit, Marshall. Because if you did, you’d know that I haven’t spoken to that bastard in 10 years.”  As though trying to extract some final usefulness from their former mistress, the drills decided to fail before the Banshee units returned with their samples, and before Ganesha arrived with the re-up and the Mars crew. Which meant that when Ganesha landed, the crew would have to live in half-dug habs.  “It’s the goddamn perchlorate,” Donna whispered. She had trouble swallowing now, and it meant her voice was constantly raw. “I told them we should have gone with the Japanese bit. It drilled the Shinkansen, I said. Too expensive, they said. Now the damn thing’s rusted all to shit.”  Which was exactly the case. The worm dried up suddenly, freezing in place—a “Bertha Bork,” like the huge drill that stalled under Seattle during an ill-fated transit project. They’d rehearsed this particular error. First they ordered all the rovers away in case of a sinkhole, and then started running satellites over the sink. And the drill himself told them what was wrong. The blades were corroded. After five years of work, too much of the red dirt had snuck down into the drill’s workings. It would need to be dug out and cleaned before it could continue. Or it would need to be replaced entirely.  The replacement prototype was already built. It had just completed its first test run in the side of a flattened mountain in West Virginia. It was strong and light and better articulated than the worm. But the final model was supposed to come over with Ganesha. And in the meantime, the hab network still needed major excavation.  “What’s the risk if we send one of the rovers to try to uncover it?” Song asked. “We’ve got one in the cage; it wrapped up its mission ages ago. Wouldn’t be too hard to reconfigure.”  “Phobos rovers might be too light,” Marshall said. “But the real problem is the crashberry; it’ll take three days to inflate and another week to energize. And that’s a week we’re not drilling.”  “We could tell Ganesha to slow down,” Khalidah said.  “They’re ballistic capture,” Marshall said. “If they slow down now, they lose serious momentum.”  “They’d pick it up on arrival, though.”  “Yeah . . . ” Marshall sucked his teeth. “But they’re carrying a big load. They could jackknife once they hit the well, if they don’t maintain a steady speed.” He scrubbed at the thin dusting of blonde across his scalp. “But we have to tell them about this, either way. Wouldn’t be right, not updating them.”  Khalidah snorted. The others ignored her.  “Can we redirect the Banshees?” Brooklyn asked. “Whiskey and Tango are the closest. We could have them dump their samples, set a pin, tell them to dig out the worm, and then come back.”  Khalidah shook her head. “They’re already full. They’re on their way to the mail drop. If we redeployed them now, they wouldn’t be in position when Ganesha arrives. Besides, they’re carrying Hellas—we can’t afford to compromise them.”  “Those samples are locked up like Fort Knox,” Brooklyn said. “What, are you worried that the crew of Ganesha will open them up by mistake? Because that’s pretty much guaranteed not to happen.”  “No, but—”  “There’s a storm in between Whiskey and the worm,” Marshall said. He pointed at an undulating pattern of lines on the screen between two blinking dots. “If we send Whiskey now, we might lose her forever. And the samples. And we still wouldn’t be any further with the drill. Fuck.”  He pushed away from the console, knuckling his eyes. Khalidah watched the planet. In the plate glass, she caught Donna watching her. Her friend was much thinner now. They’d had to turn off her suit, because it no longer fit snugly enough to read her heartbeat. Her breath came in rasps. She coughed often. Last month, Song speculated that the cancer had spread to her lungs; Donna claimed not to care very much. Khalidah heard the older woman sigh slow and deep. And she knew, before Donna even opened her mouth, what she was about to suggest.  “There’s always the Corvus,” Donna said.  “No,” Khalidah said. “Absolutely not.”  But Donna wasn’t even looking at her. She was looking at Marshall. “How much fuel did they really send, Marshall? You got here awfully fast.”  Marshall licked his lips. “Between what I have left over and what Ganesha is leaving behind for you midway, there’s enough to send you home.”  “Which means Corvus has just enough to send me down, and give me thrust to come back.”  “Even if that were true, you could still have a seizure while doing the job,” Song said.  “Then I’ll take my anti-seizure medication before I leave,” Donna said.  “The gravity would demolish you, with the state you’re in,” Marshall said. “It should be me. I should go. I know Corvus better, and my bone density is—”  “That’s very gallant of you, Mr. Marshall, but I outrank you,” Donna reminded him. “Yes, I tire easily. Yes, it’s hard for me to breathe. But I’m stronger than I would be if I were on chemo. And the suit can both give me some lift and push a good air mix for me. Right, Brooklyn?”  Brooklyn beamed. “Yes, ma’am.”  “And Marshall, if any of those things do occur, I need you up here to remote-pilot Corvus from topside and get the samples back here.” She gestured at the map. “If you tell Tango to meet me, I can take her samples and put them on Corvus. Then I get in Tango’s cargo compartment and drive her around the storm, to the worm. I dig out the drill, and you restart it from up here. When I come back, you have the samples, and Ganesha has another guest room.” She grinned. The smile made her face into a skull. “Easy peasy,” Donna said.  “You know you’re making history, right?” Marshall asked, as they performed the final checks on Corvus. “First human on Mars, and all that. You’re stealing Ganesha’s thunder.”  Donna coughed. “Don’t jinx it, Marshall.”  “How are your hands?”  Donna held them up. Slowly, she crunched her thickly gloved digits into fists. “They’re okay.”  “That’s good. Go slow. The Banshees take a light touch.”  “I know that, Marshall.”  He pinked. “I know you know. But I’m just reminding you. Now, I’ll get you down there, smooth as silk, and when it’s time to come home you just let us know, okay?”  Donna’s head tilted. She did that when she was about to ask an important question. For a moment it reminded Khalidah so much of the woman she’d been and the woman they’d lost that she forgot to breathe. “Is it home now, for you?”  Marshall’s blush deepened. He really did turn the most unfortunate shade of sunburned red. “I guess so,” he said. “Brooklyn, it’s your turn.”  Brooklyn breezed in and, flipping herself to hang upside down, performed the final checks on Donna’s suit. “You’ve got eight hours,” she said. “Sorry it couldn’t be more. Tango is already on her way, and she’ll be there to meet you when you land.”  “What’s Tango’s charge like?”  “She’s sprinting to meet you, so she’ll be half-empty by the time she hits the rendezvous point,” Marshall said. “But there’s a set of auxiliary batteries in the cargo area. You’d have to move them to get into the cockpit anyhow.”  Donna nodded. The reality of what was about to happen was settling on them. How odd, Khalidah thought, to be weightless and yet to feel the gravity of Donna’s mission tugging at the pit of her stomach. The first human on Mars. The first woman. The first cancer patient. She had read a metaphor of illness as another country, how patients became citizens of it, that place beyond the promise of life, and now she thought of Donna there on the blood-red sands, representing them. Not just a human, but a defiantly mortal one, one for whom all the life-extension dreams and schemes would never bear fruit. All the members of the Ganesha crew had augmentations to make their life on Mars more productive and less painful. Future colonists would doubtless have similar lifehacks. Donna was the only visitor who would ever set an unadulterated foot on that soil.  “I’ll be watching your vitals the whole time,” Song said. “If I don’t like what I see, I’ll tell Marshall to take control of Tango and bring you back.”  Donna cracked a smile. “Is that for my benefit, or the machine’s?”  “Both,” Song said. “We can’t have you passing out and crashing millions of dollars’ worth of machine learning and robotics.”  And then, too soon, the final checks were finished, and it was time for Donna to go. The others drifted to the other side of the airlock, and Brooklyn ran the final diagnostic of the detachment systems. Khalidah’s hands twitched at her veil. She had no idea what to say. Why did you lie to us? Did you really think that would make this easier? What were you so afraid of?  Donna regarded her from the interior of her suit. She looked so small inside it. Khalidah thought of her fragile body shaking inside its soft volumes, her thin neck and her bare skull juddering like a bad piece of video.  “I want—”  “Don’t,” Donna said. “Don’t, Khal. Not now.”  For the first time in a long time, Khalidah peeped at Donna’s aura through the additional layer in her lenses’ vision. It was deep blue, like a very wide and cold stretch of the sea. It was a color she had never seen on Donna. When she looked at her own pattern, it was much the same shade.  Marshall chose this moment to poke his head in. “It’s time.”  Donna reached over to the airlock button. “I have to go now, Khalidah.”  Before Khalidah could say anything, Marshall had tugged her backward. The door rolled shut. For a moment she watched Donna through the small bright circle of glass. Then Donna’s helmet snapped shut and she wore a halo within a halo, like a bull’s-eye.  The landing was as Marshall promised: smooth as silk. With Corvus he was in his element. He and the vessel knew each other well. They’d moved as much of Corvus’ cargo as they could into temporary storage outside the hab; the reduced weight would give Donna the extra boost on the trip back that she might need.  Donna herself rode out the landing better than any of them expected. She took her time unburdening herself of her restraints, and they heard her breathing heavily, trying to choke back the nausea that now dominated her daily life. But eventually she lurched free of the unit, tuned up the jets on her suit, jiggered her air mix, and began the unlocking procedure to open Corvus. They watched her gloved hands hovering over the final lock.  “I hope you’re not expecting some cheesy bullshit about giant leaps for womankind,” Donna said, panting audibly. She sounded sheepish. For Donna, that meant she was nervous. “I didn’t really have time to prepare any remarks. I have a job to do.”  Brooklyn wiped her eyes and covered her mouth. Marshall passed her a tissue, and took one for himself.  “You’ve wanted this since you were a little girl, Donna,” Song said. “Go out there and get it.”  Together they watched the lock spin open, and Donna eased herself out. There was Tango, ready and waiting. And there was Mars, or at least their little corner of it, raw and open and red like a wound.  “I wish I could smell it,” Donna said. “I wish I could taste the air. It feels strange to be here and yet not be here at the same time. You can stand here all you want and never really touch it.”  “You can look at the samples when you bring them back,” Brooklyn managed to say.  Donna said nothing, only silently made her way to Tango and moved the samples back to Corvus. Then she began the procedure to get Tango into manual. Her feed cut out a couple of times, but only briefly; they hadn’t thought to test the signal on the cameras themselves. Her audio was fine, though, and Marshall talked her through when she had questions. In the end it ran like any other remote repair. Even the dig went well; clearing the dirt from the drill and restarting it from the control panel was a lot simpler than any of them had expected.  Halfway back to Corvus, Tango slowly rolled to a stop.  “Donna, check your batteries,” Marshall suggested.  There was no answer. Only Donna’s slow, wet breathing.  “Donna, copy?”  Nothing. They looked at Song; Song pulled up Donna’s vitals. “No changes in her eye movements or alpha pattern,” Song whispered. “She’s not having a seizure. Donna. Donna! Do you need help?”  “No,” Donna said, finally. “I came here to do a job, and now I’m finished with it. I’m done.”  Something in Khalidah’s stomach turned to ice. “Don’t do this,” she whispered, as Marshall began to say “No, no, no,” over and over. He started bashing things on the console, running every override he could.  “No, you don’t, you crazy old broad,” he muttered. “I can get Tango to drive you back, you know!”  “Not if I’ve ripped out the receiver,” Donna said. She sounded exhausted. “I think I’ll just stay here, thank you. Ganesha can deal with me when they come. You don’t have to do it. You’d have had to freeze me, anyway, and vibrate me down to crystal, like cat litter, and—”  “Fuck. You.”  It was the first full complete sentence that Khalidah had spoken to her in months. So she repeated it.  “Fuck you. Fuck you for lying to us. Again. Fuck you for this selfish fucking bullshit. Oh, you think you’re being so romantic, dying on Mars. Well fuck you. We came here to prove we could live, not . . . ” Her lips were hot. Her eyes were hot. It was getting harder to breathe. “Not whatever the fuck it is you think you’re doing.”  Nothing.  “Donna, please don’t,” Brooklyn whispered in her most wheedling tone. “Please don’t leave us. We need you.” She sounded like a child. Then again, Khalidah wasn’t sure she herself sounded any better. Somehow this loss contained within it all the other losses she’d ever experienced: her mother, her father, the slow pull away from the Earth and into the shared unknown.  “This is a bad idea,” Marshall said, his voice calm and steady. “If you want to take the Lethezine, take the Lethezine. But you don’t know how it works—what if it doesn’t go like you think it will, and you’re alone and in pain down there? Why don’t you come back up, and if something goes wrong, we’ll be there to help?”  Silence. Was she deliberating? Could they change her mind? Khalidah strained to hear the sound of Tango starting back up again. They flicked nervous, tearful glances at each other.  “Are you just going to quit?” Khalidah asked, when the silence stretched too long. “Are you just going to run away, like this? Now that it’s hard?”  “You have no idea how hard this is, Khal, and you’ve never once thought to ask.”  It stung. Khalidah let the pain transform itself into anger. Anger, she decided, was the only way out of this problem. “I thought you didn’t want me to ask, given how you never told us anything until it was too late.”  “It’s not my fault I’m dying!”  “But it’s your fault you didn’t tell us! We would have—”  “You would have convinced me to go home.” Donna chuckled. It became a cough. The cough lasted too long. “Because you love me, and you want me to live. And I love you, so I would have done it.” She had another little coughing jag. “But the trouble with home is that there’s nothing to go back to. I’ve thrown my whole life into this. I’ve had to pass on things—real things—to get to this place. But now that I’m here, I know it was worth it. And that’s how I want to end it. I don’t want to die alone in a hospital surrounded by people who don’t understand what’s out here, or why we do this.”  Khalidah forced her voice to remain firm. “And so you want to die alone, down there, surrounded by nothing at all?”  “I’m not alone, Khal. You’re with me. You’re all with me, all the time.”  Brooklyn broke down. She pushed herself into one corner. Khalidah reached up, and held her ankle, tethering her into the group. She squeezed her eyes shut and felt tears bud away. Song’s beautiful ponytail drifted across her face. Arms curled around Khalidah’s body. Khalidah curled her arms around the others. They were a Gordian knot, hovering far above Donna, a problem she could not solve and could only avoid.  “That’s right, Donna,” Marshall said. “We’re here. We’re right here.”  “I’m sorry,” Donna said. “I’m sorry I lied. I didn’t want to. But I just . . . I wanted to stay, more than I wanted to tell you.”  “I’m sorry, too,” Khalidah said. “I . . . ” She wiped at her face. Her throat hurt. “I miss you. Already.”  “I miss you, too. I miss all of you.” Donna sniffed hard. “But this is where we’re supposed to be. Because this is where we are at our best.”  They were quiet for a while. There was nothing to do but weep. Khalidah thought she might weep forever. The pain was a real thing—she had forgotten that it hurt to cry. She had forgotten the raw throat and pounding head that came with full-body grief. She had forgotten, since her mother, how physically taxing it could be.  “Are you ready, now?” Song asked, finally. She wiped her eyes and swallowed. “Donna? Are you ready to take the dose?”  The silence went on a long time. But still, they kept asking, “Are you ready? Are you ready?”    Originally published in Visions, Ventures, Escape Velocities: A Collection of Space Futures, edited by Ed Finn, Joey Eschrich, and Juliet Ulman.  Madeline Ashby is a science fiction writer and futurist living in Toronto. She has worked with Intel Labs, the Institute for the Future, SciFutures, Nesta, Data & Society, The Atlantic Council, the ASU Center for Science and the Imagination, Changeist, and others. She has spoken at SXSW, FutureEverything, MozFest, and other events. Her essays have appeared at BoingBoing, io9, WorldChanging, Creators Project, Arcfinity, MISC Magazine, and FutureNow. Her fiction has appeared in Slate, MIT Tech Review, and elsewhere. She is the author of the Machine Dynasty novels. Her novel Company Town was a Canada Reads finalist.", "text": "8190 words, novelette, REPRINT\nDeath on Mars\n“Is he still on schedule?”\nDonna’s hand spidered across the tactical array. She pinched and threw a map into Khalidah’s lenses. Marshall’s tug glowed there, spiraling ever closer to its target. Khalidah caught herself missing baseball. She squashed the sentiment immediately. It wasn’t really the sport she missed, she reminded herself. She just missed her fantasy league. Phobos was much too far away to get a real game going; the lag was simply too long for her bets to cover any meaningful spread. She could run a model, of course, and had even filled one halfway during the trip out. It wasn’t the same.\nBesides, it was more helpful to participate in hobbies she could share with the others. The counselors had been very clear on that subject. She was better off participating in Game Night, and the monthly book club they maintained with the Girl Scouts and Guides of North America.\n“He’s on time,” Donna said. “Stop worrying.”\n“I’m not worried,” Khalidah said. And she wasn’t. Not really. Not about when he would arrive.\nDonna pushed away from the terminal. She looked older than she had when they’d landed. They’d all aged, of course—the trip out and the lack of real produce hadn’t exactly done any of them any favors—but Donna seemed to have changed more dramatically than Khalidah or Brooklyn or Song. She’d cut most of her hair off, and now the silver that once sparkled along her roots was the only color left. The exo-suit hung loose on her. She hadn’t been eating. Everyone hated the latest rotation of rations. Who on Earth—literally, who?—thought that testing the nutritional merits of a traditional Buddhist macrobiotic diet in space was a good idea? What sadistic special-interest group had funded that particular line of research?\n“It will be fine,” Donna said. “We will be fine.”\n“I just don’t want things to change.”\n“Things always change,” Donna said. “God is change. Right, Octavia?” The station spoke: “Right, Donna.”\nKhalidah folded her arms. “So do we have to add an Arthur, just for him? Or a Robert? Or an Isaac? Or a Philip?”\nThe station switched its persona to Alice B. Sheldon. Its icon spun like a coin in the upper right of Khalidah’s vision. “We already have a James,” the station said. The icon winked.\n“Khalidah, look at me,” Donna said. Khalidah defocused from the In-Vision array and met the gaze of her mission manager. “It won’t be easy,” the older woman said. “But nothing out here is. We already have plenty of data about our particular group. You think there won’t be sudden changes to group dynamics, down there?”\nShe pointed. And there it was: red and rusty, the color of old blood. Mars.\nHis name was Cody Marshall. He was Florida born and bred, white, with white-blond hair and a tendency toward rosacea. He held a PhD in computer science from Mudd. He’d done one internship in Syria, building drone-supported mesh nets, and another in Alert, Nunavut. He’d coordinated the emergency repair of an oil pipeline there using a combination of declassified Russian submersibles and American cable-monitoring drones. He’d managed the project almost single-handedly after the team lead at Alert killed himself.\nNow here he was on Phobos, sent to debug the borehole driller on Mars. A recent solar storm had completely fried the drill’s comms systems; Donna insisted it needed a complete overhaul, and two heads were better than one. Marshall couldn’t do the job from home—they’d lose days reprogramming the things on the fly, and the drill bits were in sensitive places. One false move and months of work might collapse around billions of dollars of research, crushing it deep into the red dirt. He needed to be close. After all, he’d written much of the code himself.\nThis was his first flight.\n“I didn’t want to be an astronaut,” he’d told them over the lag, when they first met. “I got into this because I loved robots. That’s all. I had no idea this is where I would wind up. But I’m really grateful to be here. I know it’s a change.”\n“If you make a toilet seat joke, we’ll delete your porn,” Song said, now. When they all laughed, she looked around at the crowd. “What’s funny? I’m serious. I didn’t come all the way out here to play out a sitcom.”\nMarshall snapped his fingers. “That reminds me.” He rifled through one of the many pouches he’d lugged on board. “Your mom sent this along with me.” He coasted a vial through the air at her. Inside, a small crystal glinted. “That’s your brother’s wedding. And your new nephew’s baptism. Speaking of sitcoms. She told me some stories to tell you. She didn’t want to record them—”\n“She’s very nervous about recording anything.”\n“—so she told me to tell them to you.”\nSong rolled her eyes. “Are they about Uncle Chan-wook?”\nMarshall’s pale eyebrows lifted high on his pink forehead. “How’d you guess?”\nAgain, the room erupted in laughter. Brooklyn laughed the loudest. She was a natural flirt. Her parents had named her after a borough they’d visited only once. In high school, she had self-published a series of homoerotic detective novels set in ancient Greece. The profits financed med school. After that, she hit Parsons for an unconventional residency. She’d worked on the team that designed the exo-suits they now wore. She had already coordinated Marshall’s fitting over the lag. It fit him well. At least, Brooklyn seemed pleased. She was smiling so wide that Khalidah could see the single cavity she’d sustained in all her years of eschewing most refined sugars.\nKhalidah rather suspected that Brooklyn had secretly advocated for the macrobiotic study. Chugging a blue algae smoothie every morning seemed like her kind of thing. Khalidah had never asked about it. It was better not to know.\nBut wasn’t that the larger point of this particular experiment? To see if they could all get along? To see if women—with their lower caloric needs, their lesser weight, their quite literally cheaper labor, in more ways than one—could get the job done on Phobos? Sure, they were there on a planetary protection mission to gather the last remaining soil samples before the first human-oriented missions showed up, thereby ensuring the “chain of evidence” for future DNA experimentation. But they all knew—didn’t they—what this was really about. How the media talked about them. How the Internet talked about them. Early on, before departure, Khalidah had seen the memes.\nFor Brooklyn, Marshall had a single chime. Brooklyn’s mother had sent it to “clear the energy” of the station. During the Cold Lake training mission, she’d sent a Tibetan singing bowl.\nFor Khalidah, he had all 4,860 games of last year’s regular season. “It’s lossless,” he said. “All 30 teams. Even the crappy ones. One of our guys down at Kennedy, he has a brother-in-law in Orlando, works at ESPN. They got in touch with your dad, and, well . . . ”\n“Thank you,” Khalidah said.\n“Yeah. Sure.” Marshall cleared his throat. He rocked on his toes, pitched a little too far forward, and wheeled his arms briefly to recover his balance. If possible, he turned even pinker, so the color of his face now matched the color of his ears. “So. Here you go. I don’t know what else is on there, but, um . . . there it is. Enjoy.”\n“Thank you.” Khalidah lifted the vial of media from his hand. Her crystal was darker than Song’s. Denser. It had been etched more often. She stuffed it in the right breast pocket of her suit. If for some reason her heart cut out and the suit had to give her a jolt, the crystal would be safe.\n“And for you, Donna. Here’s what we talked about. They gave you double, just in case.”\nDonna’s hand was already out. It shook a little as Marshall placed a small bottle in it. The label was easy to see. Easy to read. Big purple letters branded on the stark white sticker. Lethezine. The death drug. The colony of nanomachines that quietly took over the brain, shutting off major functions silently and painlessly. The best, most dignified death possible. The kind you had to ask the government for personally, complete with letters of recommendation from people with advanced degrees that could be revoked if they lied, like it was a grant application or admission to a very prestigious community. Which in fact it was.\n“What is that?” Brooklyn asked.\nIt was a stupid question. Everyone knew exactly what it was. She was just bringing it out into the open. They’d been briefed on that. On making the implicit become explicit. On voicing what had gone unasked. Speaking the unspeakable. It was, in fact, part of the training. There were certain things you were supposed to suppress. And other things that you couldn’t let fester. They had drilled on it, over and over, at Cold Lake and in Mongolia and again and again during role-plays with the station interface.\n“Why do you have that?” Brooklyn continued, when Donna didn’t answer. “Why would he give that to you?”\nDonna pocketed the bottle before she opened her mouth to speak. When she did, she lifted her gaze and stared at each of them in turn. She smiled tightly. For the first time, Khalidah realized the older woman’s grimace was not borne of impatience, but rather simple animal pain. “It’s because I’m dying,” she said.\nShe said it like it was a commonplace event. Like, “Oh, it’s because I’m painting the kitchen,” or “It’s because I took the dog for a walk.”\nIn her lenses, Khalidah saw the entire group’s auras begin to flare. The auras were nothing mystical, nothing more than ambient indicators of what the sensors in the suits were detecting: heart rate, blood pressure, temperature, odd little twitches of muscle fibers. She watched them move from baseline green to bruise purple—the color of tension, of frustration. Only Song remained calm: her aura its customary frosty mint green, the same shade once worn by astronauts’ wives at the advent of the Space Race.\n“You knew?” she managed to say, just as Marshall said, “You didn’t tell them?”\nKhalidah whirled to stare at him. His mouth hung open. He squinted at Donna, then glanced around the group. “Wait,” he said. “Wait. Let’s just take a minute. I . . . ” He swallowed. “I need a minute. You . . . ” He spun in place and pointed at Donna. “This was a shitty thing to do. I mean, really, truly, deeply, profoundly not cool. Lying to your team isn’t cool. Setting me up to fail isn’t cool.”\n“I have a brain tumor,” Donna said blandly. “I’m not necessarily in my right mind.”\n“Donna,” Song said quietly.\nOh, God. Donna was dying. She was dying and she hadn’t told them and minty-green Song had known about it the whole damn time.\n“You knew,” Khalidah managed to say.\n“Of course she knew,” Donna said. “She’s our doctor.”\nDonna was dying. Donna would be dead, soon. Donna had lied to all of them.\n“It’s inoperable,” Donna added, as though talking about a bad seam in her suit and not her gray matter. “And in any case, I wouldn’t want to operate on it. I still have a few good months here—”\n“A few months?” Brooklyn was crying. The tears beaded away from her face and she batted at them, as though breaking them into smaller pieces would somehow dismantle the grief and its cause. “You have months? That’s it?”\n“More or less.” Donna shrugged. “I could make it longer, with chemo, or nano. But we don’t have those kinds of therapies here. Even if we did, and the tumor did shrink, Song isn’t a brain surgeon, and the lag is too slow for Dr. Spyder to do something that delicate.” She jerked a thumb at the surgical assistant in its cubby. “And there’s the fact that I don’t want to leave.”\nThere was an awful silence filled only by the sounds of the station: the water recycler, the rasp of air in the vents, an unanswered alert chiming on and off, off and on. It was the sound the drill made when it encountered issues of structural integrity and wanted a directive on how to proceed. If they didn’t answer it in five more minutes, the chime would increase in rate and volume. If they didn’t answer it after another five minutes, the drill itself would relay a message via the rovers to tell mission control they were being bad parents.\nAnd none of that mattered now. At least, Khalidah could not make it matter, in her head. She could not pull the alert into the “urgent” section of her mind. Because Donna was dying, Donna would be dead soon, Donna was in all likelihood going to kill herself right here on the station and what would they do—\nDonna snapped her fingers and opened the alert. She pushed it over to tactical array where they could all see it. “Marshall, go and take a look.”\nMarshall seemed glad of any excuse to leave the conversation. He drifted over to the array and started pulling apart the alert with his fingers. His suit was still so new that his every swipe and pinch and pull worked on the first try. His fingers hadn’t worn down yet. Not like theirs. Not like Donna’s.\n“Can you do that?” Khalidah asked Donna. When Donna didn’t answer, she focused on Song. “Can she do that?”\nSong’s face closed. She was in full physician mode now. Gone was the cheerful woman with the round face who joked about porn. Had the person they’d become friends with ever truly been real? Was she always this cold, underneath? Was it being so far away from Earth that made it so easy for her to lie to them? “It’s her body, Khal. She doesn’t have any obligation to force it to suffer.”\nKhalidah tried to catch Donna’s eye. “You flew with the Air Force. You flew over Syria and Sudan. You—”\n“Yes, and whatever I was exposed to there probably had a hand in this,” Donna muttered. “The buildings, you know. They released all kinds of nasty stuff. Like first responder syndrome, but worse.” She pinched her nose. It was the only sign she ever registered of a headache. “But it’s done, now, Khalidah. I’ve made my decision.”\n“But—”\n“We all knew this might be a one-way trip,” Song added.\n“Don’t patronize me, Song,” Khalidah snapped.\n“Then grow up,” Song sighed. “Donna put this in her living will ages ago. Long before she even had her first flight. She was preapproved for Lethezine, thanks to her family’s cancer history. There was always a chance that she would get cancer on this trip, given the radiation exposure. But her physicians decided it was an acceptable risk, and she chose to come here in full awareness of that risk.”\n“I’m right here, you know,” Donna said. “I’m not dead yet.”\n“You could still retire,” Khalidah heard herself say. “You could go private. Join a board of trustees somewhere, or something like that. They’d cover a subscription, maybe they could get you implants—”\n“I don’t want implants, Khal, I want to die here—”\n“I brought some implants,” Marshall said, without turning around. He slid one last number into place, then wiped away the display. Now he turned. He took a deep breath, as though he’d rehearsed this speech the whole trip over. Which he probably had. Belatedly, Khalidah noticed the length of his hair and fingernails. God, he’d done the whole trip alone. The station couldn’t bear more than one extra; as it was, he’d needed to bring extra scrubbers and promise to spend most of the time in his own hab docked to theirs.\n“I brought implants,” he continued. “They’re prototypes. No surgery necessary. Houston insisted. They wanted to give you one last chance to change your mind.”\n“I’m not going to change my mind,” Donna said. “I want to die here.”\n“Please stop saying that.” Brooklyn wiped her eyes. “Please just stop saying that.”\n“But it’s the truth,” Donna said, in her maddening why-isn’t-everyone-as-objective-about-this-as-I-am way. “My whole life, I’ve wanted to go to Mars. And now I’m within sight of it. I’m not going to leave just because there’s a lesion on my brain. Not when I just got here.” She huffed. “Besides. I’d be no good to any of you on chemo. I’d be sick.”\n“You are sick,” Khalidah snapped.\n“Not that sick.” Song lifted her gaze from her nails and gestured at the rest of them. “None of you noticed, did you? Both of you thought she was fine.”\n“Yeah, no thanks to you.”\n“Don’t take that tone with me. She’s my patient. I’d respect your right to confidentiality the same way I respected hers.”\n“You put the mission at risk,” Khalidah said.\n“Oh my God, Khal, stop talking like them.” Brooklyn’s voice was still thick with tears. “You’re not mission control. This has nothing to do with the mission”\n“It has everything to do with the mission!” Khalidah rounded on Donna. “How could you do this? How could you not tell us? This entire experiment hinges on social cohesion. That’s why we’re here. We’re here to prove . . . ”\nNow the silence had changed into something wholly other. It was much heavier now. Much more accusatory. Donna folded her arms.\n“What are we here to prove, Khalidah?”\nKhalidah shut her eyes. She would be professional. She would not cry. She would not get angry. At least, no angrier than she already was. She would not focus on Donna’s betrayal, and her deceit, and the fact that she had the audacity to pull this bullshit so soon after . . . Khalidah took a deep breath.\nShe would put it aside. Humans are containers of emotion. She made herself see the words in the visualizing interface they had for moments like this. When someone else’s emotions spill out, it’s because their container is full. She focused on her breathing. She pictured the color of her aura changing in the others’ lenses. She imagined pushing the color from purple to green, healing it slowly, as though it were the evidence of a terrible wound.\n“I’m fine,” she said. “I’m fine. I’m sorry.”\n“That’s good,” Donna said. “Because we’re not here to prove any one particular thing or another. We’re here to run experiments, gather the last Martian samples before the crewed missions begin, and observe the drills as they dig out the colony. That’s all we’re here to do. You may feel pressure to do something else, due to the nature of this team, but that’s not why we’re here. The work comes first. The policy comes later.”\nThe Morrígu was divided into three pods: Badb, Macha, and Nemain. No one referred to them that way, of course—only Marshall had the big idea to actually try stumbling through ancient Gaelic with his good ol’ boy accent. He gave up after two weeks. Nonetheless, he still referred to his unit as the Corvus.\n“Nice of them to stick with the crow theme,” he said.\n“Ravens are omens of death,” Donna said, and just like that, Game Night was over. That was fine with Khalidah. Low-gravity games never had the degree of complexity she liked; they had magnetic game boards, but they weren’t entirely the same. And without cards or tokens they couldn’t really visualize the game in front of them, and basically played permutations of Werewolf or Mafia until they learned each other’s tells.\nNot that all that experience had helped her read Donna and Song’s dishonesty. Even after all their time spent together, in training, on the flight, on the station, there was the capacity for betrayal. Even now, she did not truly know them.\nNot yet, Khalidah often repeated to herself, as the days stretched on. Not yet. Not for the first time, she wished for a return to 24-hour days. Once upon a time, they had seemed so long. She had yearned for afternoons to end, for lectures to cease, for shifts to close. Now she understood that days on Earth were beautifully, mercifully short.\nSometimes Khalidah caught Donna watching her silently, when she didn’t think Khalidah would notice. When Khalidah met her eyes, Donna would try to smile. It was more a crinkling of the eyes than anything else. It was hard to tell if she was in pain, or unhappy, or both. The brain had no nerve endings of its own, no pain receptors. The headaches that Donna felt were not the tissue’s response to her tumor, but rather a warning sign about a crowded nerve, an endless alarm that rang down through her spinal column and caused nausea and throbbing at odd hours. Or so she said.\nKhalidah’s first email was to her own psychiatrist on Earth, through her personal private channel. It was likely the very same type of channel Donna had used to carry on her deception. Can a member of crew just hide any medical condition they want? she wrote.\nYour confidentiality and privacy are paramount, Dr. Hassan wrote back from Detroit. You have sacrificed a great deal of privacy to go on this mission. You live in close quarters, quite literally right on top of each other. So the private channels you have left are considered sacrosanct. Communications between any participant and her doctor must remain private until the patient chooses to disclose.\nThis was not the answer Khalidah had wanted to hear.\nImagine if it were you who had a secret, Dr. Hassan continued, as though having anticipated Khalidah’s feelings on the matter. If you were experiencing the occasional suicidal ideation, for example, would you want your whole crew to know, or would you wait for the ideations to pass?\nIt was a valid counterargument. Mental health was a major concern on long-haul missions. Adequate care required stringent privacy. But Donna’s cancer wasn’t a passing thought about how much easier it would be to be dead. She was actually dying. And she hadn’t told them.\nNow, after all that silence on the matter, the cancer seemed to be all anyone could talk about.\n“I’ve almost trained the pain to live on Martian time,” Donna said, one morning. “Most patients feel pain in the morning, but they feel it on an Earth schedule, with full sunlight.”\nKhalidah could not bring herself to smile back, not yet. Doing so felt like admitting defeat.\n“She won’t die any slower just because you’re mad at her,” Brooklyn said, as they conducted seal checks on the suits.\n“Leave me alone,” Khalidah said. Brooklyn just shrugged and got on with the checklist. A moment later, she asked for a flashlight. Khalidah handed it to her without a word.\n“Have you watched any of the games your dad sent?” Marshall asked, the next day.\n“Please don’t bring him up,” Khalidah said.\nFive weeks later, the vomiting started. It was an intriguing low-gravity problem—barf bags were standard, but carrying them around wasn’t. And Donna couldn’t just commandeer the shop-vac for her own personal use. In the end, Marshall made her a little butterfly net, of sorts, with an iris at one end. It was like a very old-fashioned nebulizer for inhaling asthma medication. Only it worked in the other direction.\nNot coincidentally, Marshall had brought with him an entire liquid diet intended specifically for cancer patients. Donna switched, and things got better.\n“I’ll stick around long enough to get the last samples from Hellas,” she said, sipping a pouch of what appeared to be either a strawberry milkshake or an anti-nausea tonic. She coughed. The cough turned into a gag that she needed to suppress. She clenched a fist and then unclenched it, to master it. “I want my John Hancock on those damn things.”\n“Don’t you want to see the landing?” Marshall asked. “You know, hand over the keys, see their faces when they see the ant farm in person for the first time?”\n“What, and watch them fuck up all our hard work?”\nThey all laughed. All of them but Khalidah. How could they just act like everything was normal? Did the crew of the Ganesha mission even know that Donna was sick? Would the team have to explain it? How would that conversation even happen? (“Welcome to Mars. Sorry, but we’re in the middle of a funeral. Anyway, try not to get your microbes everywhere.” )\nThen the seizures started. They weren’t violent. More like gentle panic attacks. “My arm doesn’t feel like my arm anymore,” Donna said, as she continued to man her console with one hand. “No visual changes, though. Just localized disassociation.”\n“That’s a great band name,” Marshall said.\nMorrígu tried to help, in her own way. The station gently reminded Khalidah of all the things that she already knew: that she was distracted, that she wasn’t sleeping, that she would lie awake listening for the slightest tremor in Donna’s breathing, and that sometimes Brooklyn would reach up from her cubby and squeeze Khalidah’s ankle because she was listening too. The station made herself available in the form of the alters, often pinging Khalidah when her gaze failed to track properly across a display, or when her blood pressure spiked, or when she couldn’t sleep. Ursula, most often, but then Octavia. God is Change, the station reminded her. The only lasting truth is Change.\nAnd Khalidah knew that to be true. She did. She simply drew no comfort from it. Too many things had changed already. Donna was dying. Donna, who had calmly helped her slide the rods into the sleeves as they pitched tents in Alberta one dark night while the wolves howled and the thermometer dropped to 30 below. Donna, who had said, “Of course you can do it. That’s not the question,” when Khalidah reached between the cots during isolation week and asked Donna if the older woman thought she was really tough enough to do the job. Donna, without whom Khalidah might have quit at any time.\n“You watch any of those games yet?” Marshall asked, when he caught her staring down at the blood-dark surface of the planet. Rusted, old. Not like the wine-dark samples that Song drained from Donna each week.\nKhalidah only shook her head. Baseball seemed so stupid now.\n“Your dad, he really wanted to get those to you before I left,” Marshall reminded her.\nKhalidah took a deep, luxuriant breath. “I told you not to mention him, Marshall. I asked you nicely. Are you going to respect those boundaries, or are we going to have a problem?”\nMarshall said nothing, at first. Instead he drifted in place, holding the nearest grip to keep himself tethered. He hadn’t learned how to tuck himself in yet, how to twist and wring himself so that he passed through without touching anyone else. Everything about his presence there still felt wrong.\n“We don’t have to be friends,” he said, in measured tones. He pointed down into Storage. “But the others, they’re your friends. Or they thought they were. Until now.”\n“They lied to me.”\n“Oh, come on. You think it wasn’t tough for Song to go through that? You think she enjoyed it, not telling you? Jesus Christ, Khalidah. Maybe you haven’t noticed, but a lot of us made a lot of sacrifices to get this far.”\n“Oh, I’m sure it was so difficult for you, finding out you’d get to go to Mars—”\n“—Phobos.”\n“—Phobos, without anything like the training we had to endure, just so you could pilot your finicky fucking drill God knows where—”\n“Hey, now, I happen to like my finicky fucking drill very fucking much,” Marshall said. He blinked. Then covered his face with his hands. He’d filed his nails down and buzzed his hair in solidarity with Donna. His entire skull was flushed the color of a new spring geranium. “That . . . didn’t come out right.”\nKhalidah hung in place. She drew her knees up to her chest and floated. It had been a long time since she’d experienced secondhand embarrassment. Something about sharing such a tiny space with the others for so long ground it out of a person. But she was embarrassed for Marshall now. Not as embarrassed as he was, thank goodness. But embarrassed.\n“They sent me alone, you know,” he said, finally, through the splay of his fingers. He scrubbed at the bare stubble of his skull. “Alone. Do you even know what that means? You know all those desert island questions in job interviews? When they ask you what books you’d bring, if you were stranded in the middle of nowhere? Well, I read all of those. War and Peace. Being and Nothingness. Do you have any idea how good I am at solitaire, by now?”\n“You can’t be good at solitaire, it’s—”\n“But I did it, because they said it was the best chance for giving Donna extra time. If they’d sent two of us, you’d all have to go home a hell of a lot faster. You wouldn’t be here when Ganesha arrives. So I did it. I got here. Alone. I did the whole trip by myself. So you and Donna and the whole crew could have more time.”\nKhalidah swallowed hard. “Are you finished?”\n“Yes. I’m finished.” He pushed himself off the wall, then bounced away and twisted back to face her. “No. I’m not. I think you’re being a total hypocrite, and I think it’s undermining whatever social value the Morrígu experiment was meant to have.”\nKhalidah felt her eyebrows crawl up to touch the edges of her veil. “Excuse me?”\n“Yeah. You heard me. You’re being a hypocrite.” He lowered his voice. “Do your friends even know your dad died? Did you tell them that he was dying, when you left? Because I was told not to mention it, and that sure as hell sounds like a secret to me.”\nKhalidah closed her eyes. The only place to go, in a space this small, was inward. There was no escape, otherwise. She waited until that soft darkness had settled around her and then asked, “Why are you doing this?”\n“Because you’re not alone, out here. You have friends. Friends you’ve known and worked with for years, in one way or another. So what if Donna jerked you around? She jerked me around too, and you don’t see me acting like a brat about it. Or Brooklyn. Or Song. Meanwhile you’ve been keeping this massive life-changing event from them this whole time.”\nNow Khalidah’s eyes opened. She had no need for that comforting blanket of darkness now. “My father dying is not a massive life-changing event,” she snapped. “You think you know all my secrets? You don’t know shit, Marshall. Because if you did, you’d know that I haven’t spoken to that bastard in 10 years.”\nAs though trying to extract some final usefulness from their former mistress, the drills decided to fail before the Banshee units returned with their samples, and before Ganesha arrived with the re-up and the Mars crew. Which meant that when Ganesha landed, the crew would have to live in half-dug habs.\n“It’s the goddamn perchlorate,” Donna whispered. She had trouble swallowing now, and it meant her voice was constantly raw. “I told them we should have gone with the Japanese bit. It drilled the Shinkansen, I said. Too expensive, they said. Now the damn thing’s rusted all to shit.”\nWhich was exactly the case. The worm dried up suddenly, freezing in place—a “Bertha Bork,” like the huge drill that stalled under Seattle during an ill-fated transit project. They’d rehearsed this particular error. First they ordered all the rovers away in case of a sinkhole, and then started running satellites over the sink. And the drill himself told them what was wrong. The blades were corroded. After five years of work, too much of the red dirt had snuck down into the drill’s workings. It would need to be dug out and cleaned before it could continue. Or it would need to be replaced entirely.\nThe replacement prototype was already built. It had just completed its first test run in the side of a flattened mountain in West Virginia. It was strong and light and better articulated than the worm. But the final model was supposed to come over with Ganesha. And in the meantime, the hab network still needed major excavation.\n“What’s the risk if we send one of the rovers to try to uncover it?” Song asked. “We’ve got one in the cage; it wrapped up its mission ages ago. Wouldn’t be too hard to reconfigure.”\n“Phobos rovers might be too light,” Marshall said. “But the real problem is the crashberry; it’ll take three days to inflate and another week to energize. And that’s a week we’re not drilling.”\n“We could tell Ganesha to slow down,” Khalidah said.\n“They’re ballistic capture,” Marshall said. “If they slow down now, they lose serious momentum.”\n“They’d pick it up on arrival, though.”\n“Yeah . . . ” Marshall sucked his teeth. “But they’re carrying a big load. They could jackknife once they hit the well, if they don’t maintain a steady speed.” He scrubbed at the thin dusting of blonde across his scalp. “But we have to tell them about this, either way. Wouldn’t be right, not updating them.”\nKhalidah snorted. The others ignored her.\n“Can we redirect the Banshees?” Brooklyn asked. “Whiskey and Tango are the closest. We could have them dump their samples, set a pin, tell them to dig out the worm, and then come back.”\nKhalidah shook her head. “They’re already full. They’re on their way to the mail drop. If we redeployed them now, they wouldn’t be in position when Ganesha arrives. Besides, they’re carrying Hellas—we can’t afford to compromise them.”\n“Those samples are locked up like Fort Knox,” Brooklyn said. “What, are you worried that the crew of Ganesha will open them up by mistake? Because that’s pretty much guaranteed not to happen.”\n“No, but—”\n“There’s a storm in between Whiskey and the worm,” Marshall said. He pointed at an undulating pattern of lines on the screen between two blinking dots. “If we send Whiskey now, we might lose her forever. And the samples. And we still wouldn’t be any further with the drill. Fuck.”\nHe pushed away from the console, knuckling his eyes. Khalidah watched the planet. In the plate glass, she caught Donna watching her. Her friend was much thinner now. They’d had to turn off her suit, because it no longer fit snugly enough to read her heartbeat. Her breath came in rasps. She coughed often. Last month, Song speculated that the cancer had spread to her lungs; Donna claimed not to care very much. Khalidah heard the older woman sigh slow and deep. And she knew, before Donna even opened her mouth, what she was about to suggest.\n“There’s always the Corvus,” Donna said.\n“No,” Khalidah said. “Absolutely not.”\nBut Donna wasn’t even looking at her. She was looking at Marshall. “How much fuel did they really send, Marshall? You got here awfully fast.”\nMarshall licked his lips. “Between what I have left over and what Ganesha is leaving behind for you midway, there’s enough to send you home.”\n“Which means Corvus has just enough to send me down, and give me thrust to come back.”\n“Even if that were true, you could still have a seizure while doing the job,” Song said.\n“Then I’ll take my anti-seizure medication before I leave,” Donna said.\n“The gravity would demolish you, with the state you’re in,” Marshall said. “It should be me. I should go. I know Corvus better, and my bone density is—”\n“That’s very gallant of you, Mr. Marshall, but I outrank you,” Donna reminded him. “Yes, I tire easily. Yes, it’s hard for me to breathe. But I’m stronger than I would be if I were on chemo. And the suit can both give me some lift and push a good air mix for me. Right, Brooklyn?”\nBrooklyn beamed. “Yes, ma’am.”\n“And Marshall, if any of those things do occur, I need you up here to remote-pilot Corvus from topside and get the samples back here.” She gestured at the map. “If you tell Tango to meet me, I can take her samples and put them on Corvus. Then I get in Tango’s cargo compartment and drive her around the storm, to the worm. I dig out the drill, and you restart it from up here. When I come back, you have the samples, and Ganesha has another guest room.” She grinned. The smile made her face into a skull. “Easy peasy,” Donna said.\n“You know you’re making history, right?” Marshall asked, as they performed the final checks on Corvus. “First human on Mars, and all that. You’re stealing Ganesha’s thunder.”\nDonna coughed. “Don’t jinx it, Marshall.”\n“How are your hands?”\nDonna held them up. Slowly, she crunched her thickly gloved digits into fists. “They’re okay.”\n“That’s good. Go slow. The Banshees take a light touch.”\n“I know that, Marshall.”\nHe pinked. “I know you know. But I’m just reminding you. Now, I’ll get you down there, smooth as silk, and when it’s time to come home you just let us know, okay?”\nDonna’s head tilted. She did that when she was about to ask an important question. For a moment it reminded Khalidah so much of the woman she’d been and the woman they’d lost that she forgot to breathe. “Is it home now, for you?”\nMarshall’s blush deepened. He really did turn the most unfortunate shade of sunburned red. “I guess so,” he said. “Brooklyn, it’s your turn.”\nBrooklyn breezed in and, flipping herself to hang upside down, performed the final checks on Donna’s suit. “You’ve got eight hours,” she said. “Sorry it couldn’t be more. Tango is already on her way, and she’ll be there to meet you when you land.”\n“What’s Tango’s charge like?”\n“She’s sprinting to meet you, so she’ll be half-empty by the time she hits the rendezvous point,” Marshall said. “But there’s a set of auxiliary batteries in the cargo area. You’d have to move them to get into the cockpit anyhow.”\nDonna nodded. The reality of what was about to happen was settling on them. How odd, Khalidah thought, to be weightless and yet to feel the gravity of Donna’s mission tugging at the pit of her stomach. The first human on Mars. The first woman. The first cancer patient. She had read a metaphor of illness as another country, how patients became citizens of it, that place beyond the promise of life, and now she thought of Donna there on the blood-red sands, representing them. Not just a human, but a defiantly mortal one, one for whom all the life-extension dreams and schemes would never bear fruit. All the members of the Ganesha crew had augmentations to make their life on Mars more productive and less painful. Future colonists would doubtless have similar lifehacks. Donna was the only visitor who would ever set an unadulterated foot on that soil.\n“I’ll be watching your vitals the whole time,” Song said. “If I don’t like what I see, I’ll tell Marshall to take control of Tango and bring you back.”\nDonna cracked a smile. “Is that for my benefit, or the machine’s?”\n“Both,” Song said. “We can’t have you passing out and crashing millions of dollars’ worth of machine learning and robotics.”\nAnd then, too soon, the final checks were finished, and it was time for Donna to go. The others drifted to the other side of the airlock, and Brooklyn ran the final diagnostic of the detachment systems. Khalidah’s hands twitched at her veil. She had no idea what to say. Why did you lie to us? Did you really think that would make this easier? What were you so afraid of?\nDonna regarded her from the interior of her suit. She looked so small inside it. Khalidah thought of her fragile body shaking inside its soft volumes, her thin neck and her bare skull juddering like a bad piece of video.\n“I want—”\n“Don’t,” Donna said. “Don’t, Khal. Not now.”\nFor the first time in a long time, Khalidah peeped at Donna’s aura through the additional layer in her lenses’ vision. It was deep blue, like a very wide and cold stretch of the sea. It was a color she had never seen on Donna. When she looked at her own pattern, it was much the same shade.\nMarshall chose this moment to poke his head in. “It’s time.”\nDonna reached over to the airlock button. “I have to go now, Khalidah.”\nBefore Khalidah could say anything, Marshall had tugged her backward. The door rolled shut. For a moment she watched Donna through the small bright circle of glass. Then Donna’s helmet snapped shut and she wore a halo within a halo, like a bull’s-eye.\nThe landing was as Marshall promised: smooth as silk. With Corvus he was in his element. He and the vessel knew each other well. They’d moved as much of Corvus’ cargo as they could into temporary storage outside the hab; the reduced weight would give Donna the extra boost on the trip back that she might need.\nDonna herself rode out the landing better than any of them expected. She took her time unburdening herself of her restraints, and they heard her breathing heavily, trying to choke back the nausea that now dominated her daily life. But eventually she lurched free of the unit, tuned up the jets on her suit, jiggered her air mix, and began the unlocking procedure to open Corvus. They watched her gloved hands hovering over the final lock.\n“I hope you’re not expecting some cheesy bullshit about giant leaps for womankind,” Donna said, panting audibly. She sounded sheepish. For Donna, that meant she was nervous. “I didn’t really have time to prepare any remarks. I have a job to do.”\nBrooklyn wiped her eyes and covered her mouth. Marshall passed her a tissue, and took one for himself.\n“You’ve wanted this since you were a little girl, Donna,” Song said. “Go out there and get it.”\nTogether they watched the lock spin open, and Donna eased herself out. There was Tango, ready and waiting. And there was Mars, or at least their little corner of it, raw and open and red like a wound.\n“I wish I could smell it,” Donna said. “I wish I could taste the air. It feels strange to be here and yet not be here at the same time. You can stand here all you want and never really touch it.”\n“You can look at the samples when you bring them back,” Brooklyn managed to say.\nDonna said nothing, only silently made her way to Tango and moved the samples back to Corvus. Then she began the procedure to get Tango into manual. Her feed cut out a couple of times, but only briefly; they hadn’t thought to test the signal on the cameras themselves. Her audio was fine, though, and Marshall talked her through when she had questions. In the end it ran like any other remote repair. Even the dig went well; clearing the dirt from the drill and restarting it from the control panel was a lot simpler than any of them had expected.\nHalfway back to Corvus, Tango slowly rolled to a stop.\n“Donna, check your batteries,” Marshall suggested.\nThere was no answer. Only Donna’s slow, wet breathing.\n“Donna, copy?”\nNothing. They looked at Song; Song pulled up Donna’s vitals. “No changes in her eye movements or alpha pattern,” Song whispered. “She’s not having a seizure. Donna. Donna! Do you need help?”\n“No,” Donna said, finally. “I came here to do a job, and now I’m finished with it. I’m done.”\nSomething in Khalidah’s stomach turned to ice. “Don’t do this,” she whispered, as Marshall began to say “No, no, no,” over and over. He started bashing things on the console, running every override he could.\n“No, you don’t, you crazy old broad,” he muttered. “I can get Tango to drive you back, you know!”\n“Not if I’ve ripped out the receiver,” Donna said. She sounded exhausted. “I think I’ll just stay here, thank you. Ganesha can deal with me when they come. You don’t have to do it. You’d have had to freeze me, anyway, and vibrate me down to crystal, like cat litter, and—”\n“Fuck. You.”\nIt was the first full complete sentence that Khalidah had spoken to her in months. So she repeated it.\n“Fuck you. Fuck you for lying to us. Again. Fuck you for this selfish fucking bullshit. Oh, you think you’re being so romantic, dying on Mars. Well fuck you. We came here to prove we could live, not . . . ” Her lips were hot. Her eyes were hot. It was getting harder to breathe. “Not whatever the fuck it is you think you’re doing.”\nNothing.\n“Donna, please don’t,” Brooklyn whispered in her most wheedling tone. “Please don’t leave us. We need you.” She sounded like a child. Then again, Khalidah wasn’t sure she herself sounded any better. Somehow this loss contained within it all the other losses she’d ever experienced: her mother, her father, the slow pull away from the Earth and into the shared unknown.\n“This is a bad idea,” Marshall said, his voice calm and steady. “If you want to take the Lethezine, take the Lethezine. But you don’t know how it works—what if it doesn’t go like you think it will, and you’re alone and in pain down there? Why don’t you come back up, and if something goes wrong, we’ll be there to help?”\nSilence. Was she deliberating? Could they change her mind? Khalidah strained to hear the sound of Tango starting back up again. They flicked nervous, tearful glances at each other.\n“Are you just going to quit?” Khalidah asked, when the silence stretched too long. “Are you just going to run away, like this? Now that it’s hard?”\n“You have no idea how hard this is, Khal, and you’ve never once thought to ask.”\nIt stung. Khalidah let the pain transform itself into anger. Anger, she decided, was the only way out of this problem. “I thought you didn’t want me to ask, given how you never told us anything until it was too late.”\n“It’s not my fault I’m dying!”\n“But it’s your fault you didn’t tell us! We would have—”\n“You would have convinced me to go home.” Donna chuckled. It became a cough. The cough lasted too long. “Because you love me, and you want me to live. And I love you, so I would have done it.” She had another little coughing jag. “But the trouble with home is that there’s nothing to go back to. I’ve thrown my whole life into this. I’ve had to pass on things—real things—to get to this place. But now that I’m here, I know it was worth it. And that’s how I want to end it. I don’t want to die alone in a hospital surrounded by people who don’t understand what’s out here, or why we do this.”\nKhalidah forced her voice to remain firm. “And so you want to die alone, down there, surrounded by nothing at all?”\n“I’m not alone, Khal. You’re with me. You’re all with me, all the time.”\nBrooklyn broke down. She pushed herself into one corner. Khalidah reached up, and held her ankle, tethering her into the group. She squeezed her eyes shut and felt tears bud away. Song’s beautiful ponytail drifted across her face. Arms curled around Khalidah’s body. Khalidah curled her arms around the others. They were a Gordian knot, hovering far above Donna, a problem she could not solve and could only avoid.\n“That’s right, Donna,” Marshall said. “We’re here. We’re right here.”\n“I’m sorry,” Donna said. “I’m sorry I lied. I didn’t want to. But I just . . . I wanted to stay, more than I wanted to tell you.”\n“I’m sorry, too,” Khalidah said. “I . . . ” She wiped at her face. Her throat hurt. “I miss you. Already.”\n“I miss you, too. I miss all of you.” Donna sniffed hard. “But this is where we’re supposed to be. Because this is where we are at our best.”\nThey were quiet for a while. There was nothing to do but weep. Khalidah thought she might weep forever. The pain was a real thing—she had forgotten that it hurt to cry. She had forgotten the raw throat and pounding head that came with full-body grief. She had forgotten, since her mother, how physically taxing it could be.\n“Are you ready, now?” Song asked, finally. She wiped her eyes and swallowed. “Donna? Are you ready to take the dose?”\nThe silence went on a long time. But still, they kept asking, “Are you ready? Are you ready?”\nOriginally published in Visions, Ventures, Escape Velocities: A Collection of Space Futures, edited by Ed Finn, Joey Eschrich, and Juliet Ulman.\nMadeline Ashby is a science fiction writer and futurist living in Toronto. She has worked with Intel Labs, the Institute for the Future, SciFutures, Nesta, Data & Society, The Atlantic Council, the ASU Center for Science and the Imagination, Changeist, and others. She has spoken at SXSW, FutureEverything, MozFest, and other events. Her essays have appeared at BoingBoing, io9, WorldChanging, Creators Project, Arcfinity, MISC Magazine, and FutureNow. Her fiction has appeared in Slate, MIT Tech Review, and elsewhere. She is the author of the Machine Dynasty novels. Her novel Company Town was a Canada Reads finalist.", "source": "https://clarkesworldmagazine.com/ashby_11_18_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Death on Mars by Madeline Ashby"}