{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Xiu Xinyu; Elizabeth Hanlon", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "UwS0UHdL+8n14QRfFMMUyvOiAN8=", "id": null, "license": null, "comments": "", "raw_text": "3600 words, short story  All Living Creation  [1] Lying in bed, I reaffirm to myself that all is well.  In some corner of the world, there is not another me, forced into life, sold, kept as a pet, tortured out of spite, assigned to a dirty, dangerous task. There’s only me. It’s lonely, but it’s a reassuring loneliness.  That night I can’t sleep. I keep thinking of her, tongue jittering wildly in my mouth, heart sinking down toward someplace dark. At four in the morning, birds begin to twitter outside my window. At six, they arrive.  Five of her, without even different uniforms to distinguish one from another. They’re maybe one or two years apart in age, but otherwise appear nearly identical. It creates a sort of illusion: I can’t shake the impression of shells sharing the same soul—if they have one at all. They wait politely at the door for me to come out. Keeping their heads slightly lowered, they flick their eyes upward every so often to observe me, seemingly on edge.  Their worry is uncalled for. After all, I’m simply going to visit my dear little sister.  Helen Zhang, rebellious in the way that all foolish young people are, left home eight years ago, after declaring to our parents, “Just forget you ever had a daughter!” That same year, she leaked her own genes and became the most popular commercial clone model ever.  The last time I saw her was five years ago, at a riotous parade. Feverish fans were everywhere, men and women, old and young, jostling, cheering. There were bright streamers, balloons, confetti cannons, signs, protective membranes deliberately slit open—everything you would expect to see at a parade, plus a large police presence to maintain order.  I gripped the handle of my briefcase tightly and watched as the flow of the crowd carried me farther and farther away from her.  The law protects our natural human freedoms against infringement, and our predetermined genes against theft. We cover our fingers in protective membranes, and all household objects are rigorously sterilized immediately after use. We avoid all physical contact to ensure the security of our genes.  Nearly everyone follows these precautions—everyone except my foolish little sister. Like Christ, she offered herself in sacrifice.  But only Christ can save this world of sin.  Outside, mechanical lenses swivel in my direction, soundlessly, the way vigilant birds might watch a predator. In a moment, I will appear on various news sites, not that it matters. The car that has come to collect me has a spacious passenger compartment, and the windows are black and opaque. It’s a little unnerving.  Two of the five women sit with me in the passenger compartment. Even without makeup, their features are bright and striking, eternally youthful. They keep silent, long lashes fluttering gently with each breath. In profile, with their prominent, pointed chins, their faces bear a faint resemblance to my own. My little sisters.  I finally get to see her again.  I can’t say I miss her. It doesn’t make sense, when in fact I see “her” almost every day. On the Internet, on TV, in the newspaper. At fast food joints, nightclubs, shopping malls. At noon, dusk, dawn. Too many of her to count. After she volunteered her genetic information, she became something of a free resource.  Free, and thus much despised and degraded.  [2] Thanks to advances in genetic engineering, it is theoretically possible to create a human with any given combination of traits.  We’ve certainly tried. I’ve seen the man in textbooks: no bulging musculature, and yet more than capable of shattering any Olympic record, or working at depths of thirty meters without protection for twenty minutes. What the textbooks leave out is that he died, quickly and quietly, after just a few days.  According to our instructor, it was a sudden heart attack. His heart couldn’t keep up with his body’s superhuman demand for blood. It was possible in theory, but not practice: blood oxygen content, hormone levels, muscular endurance . . . the variables involved were too numerous and complex.  The rules that govern our genetic makeup are far more complicated than we imagine. The slightest change can dramatically alter the whole. Attempts to correct every “error” made during the genetic modification process will only be subsumed by an endless stream of errors.  But it isn’t just the unpredictability of genetic engineering.  As my undergraduate advisor put it, nature is not merely more complex than we think; its complexity is beyond human comprehension. The terrible thing about genetic modification is that you can’t help but want to compensate for errors. But humanity has managed to advance despite innumerable defects. Compensating for so-called minor errors inevitably leads to fatal problems.  At a press conference I once attended, a pushy female reporter raised a cross to her chest and asked in a shrill voice, “Does this prove God created man? Only the divine can solve everything.”  Smiling, the representative from the research team replied, “Man is creating himself.”  It has taken humanity, eliminating unfavorable genetic combinations one generation at time, more than three million years to get where we are today.  Even as obtaining funding for genetic modification and recombination projects became increasingly difficult, human cloning plans gained ground. Businessmen didn’t have much patience for waiting, nor were they willing to incur the heavy costs of trial and error. Instead, they found a solution using the simplest and crudest means available. They simply screened existing genomes and selected the best to clone servants for themselves.  They turned tools into humans, and humans into tools.  Eight years ago, they selected my little sister. It was a campus beauty pageant—or at least, it had looked like one. The participants were subjected to a physical examination, as well as a lengthy and exhaustive comparative genetic analysis. Those who were chosen received a contract, and upon signing, entered into a business venture, one that promised to usher in a new era for humanity.  She didn’t consult us. Unbeknownst to our parents and me, she needed a large sum of money at the time. She never told us the reason she needed it.  [3] We don’t speak a word on the way there. When I get out of the car, I am greeted by the autumn sky, clouds thin as gauze, and a stand of withered trees. After three of her register our information at the entrance, the two of her who accompanied me in the car—one in front and one behind me—lead me down a narrow, sloping corridor.  As I step through the door, I realize that I am in an ancient underground church. After donating her genetic material, she received a substantial allowance, enough to live out the rest of her life however she pleased. It was rumored that she had bought up many of her own clones and established bases all over the world, for reasons best known to herself.  Light streams through the domed stained-glass ceiling, and I can smell wet earth.  “You’re a doctor now,” she says, mild curiosity in her voice. Seated beneath an enormous painted icon, she tilts her chin up and smiles at me. Her voice is almost identical to the voices that pervade my daily life. A little huskier, perhaps.  I once heard a saying that experience shapes character; that is, your memories define your identity. Only she ever pestered me to tell her fairy tales. The little mermaid trading her singing voice for a pair of legs, only to dissolve into foam; a wicked queen hatching murderous schemes before a talking mirror—those sorts of tales.  She is dressed in a simple ink-blue dress, cut from a heavy fabric that shows its age. Perhaps, after so many years on her own, she has grown accustomed to showing her age, too. She alone is my little sister.  Unobscured by protection of any kind, even the fine hairs on her face are clearly visible in the sunlight.  “A dentist,” I say. “I probably can’t save you, unless it’s your tooth that’s killing you.”  “You’re not a dentist.” She shakes her head.  She can’t possibly know.  “You’re the world’s top clinical virologist.” She smiles again and opens her arms to me, as though asking for a hug. I walk toward her ever so slowly.  “Do you cure disease? Do you save people?” Helen speaks softly, but in a wide-open space like this I can still hear her every word. “Do you save clones?”  The first time it happened, we had just finished a celebratory dinner. Our experiments had progressed swimmingly, so my boss had invited our investors and the project team to go out to eat together.  I can’t say exactly when the atmosphere changed. I was already half in the bag, but I still picked up on the significance in my coworkers’ gazes. Then the door to our private dining room opened and several scantily clad girls stepped in. She, of course, was among them. I drained several more glasses. When I came to again, I was already home.  Over time, I got used to it. I even tried to engage with her. To be more precise, I bought her services for an evening. The sky had already grown dark. After the clouds, golden-red in the light of the setting sun, vanished, a fog rolled in off the ocean, so thick that it was difficult to breathe or see straight ahead.  She shivered in her short skirt, like anyone else. And, like anyone else, a glistening protective membrane coated her skin: while she had no need to protect her genes, the membrane made her seem more normal, to say nothing of the customers who enjoyed the process of peeling off the layer with their own hands. She looked at me, a faint smile tugging at the corners of her mouth.  I took her home and made her a cup of hot cocoa. Unlike other clone models I’d encountered previously, she didn’t seem to care much for talking. Instead, she simply held her mug and looked at me. It was extremely uncomfortable.  “What’s wrong with you?” I asked.  “What’s wrong with you?” she asked, parroting me, the corners of her mouth creeping upward. “You don’t even want to touch me.”  My sister wouldn’t act this way. Helen was my constant shadow, sweet and obliging. She didn’t know how to talk back. Which meant we were all the more shocked by the subsequent turn of events.  She’d been confined to a room, but by then it was already too late. At that very moment, tens, hundreds, thousands of her were being cloned. She was healthy, intelligent, beautiful. The companies that had acquired her genes had struck gold.  “Do something about your sister!” said our mother, but what she really meant was, “Help your sister.”  I hadn’t been home in two years, as the project had entered a critical phase. But since the situation was truly dire, my supervisor granted me a two-day leave of absence.  I opened the door and saw my eighteen-year-old sister secured to a bed with metal restraints. Her body had been placed beneath an isolation hood, like she had slipped into endless slumber, like she was Sleeping Beauty waiting for a prince’s kiss.  Except it wasn’t a fairy tale. In reality, she’d been given a tranquilizer, and the police were due to arrive in the next half hour. In hopes of obtaining a light sentence for Helen, our parents had called them and confessed on her behalf. The charge was “disruption of the public order.” It was possible she’d be put away for life.  I just looked at her through the glass hood. A faint red mark still lingered on her face where our father had slapped her.  Even then I couldn’t save her.  [4] I’ve seen them many times.  I’ve accepted takeout from her hands. With the integration of artificial intelligence into logistics networks, the sole purpose justifying the existence of these workers is to humanize food delivery services, easing the loneliness of reclusive customers who seldom leave the house. Naturally, there are also those with a strong aversion to seeing their own kind: they simply make a note on their order to place the takeout in the parcel locker fixed to their door.  This one had a sweet smile. She couldn’t have been older than eighteen. She held out the warm pizza box, but when I reached for it, she didn’t let go, just smiled at me.  Perhaps she knew who I was. She was asking for help, but I could do nothing for her.  She, and all the others like her, had all been cloned. Deprived of all rights, not recognized as people. Microchips implanted into their wrists continuously reported back on their physical condition and location. Their lives were regulated down to the minute, even down to the second, to maximize performance.  I tightened my grip and pulled the pizza box from her hand. She lowered her gaze, turned, and left.  Once I witnessed two of them fight.  I pulled the car over to the side of the road to watch. Some pedestrians pretended not to see and hurried past, while others also stopped to look on. The one in a business suit brought her handbag down hard against the face of the one in jeans. Someone was screaming. They tore at each other’s hair until one of them produced a knife and drew blood. I drove away.  The crime rate is at a historic low. That is, the crime rate among normal people is at a historic low. We can’t use DNA evidence to arrest clones. They’re identical, so a sin committed by one is a sin committed by all.  Killers, crooks, and whores. My little sisters.  Many a young person has printed her name or face on T-shirts. Some have dedicated books to her. More than one have followed her example and leaked their own genes, as an act of rebellion, or simply out of a desire for fame. But no one ever took the world by storm quite like her. Or, to be more precise, no one ever took the world by storm quite like them.  I should have known this day would come, ever since we dropped her off at college.  While our parents parked the car, I helped her carry her luggage up the stairs. She trailed behind me with several bags of clothing, dragging her feet. Back then she was still a good girl, so obedient that she’d never once raised her voice to our parents.  Her steps grew slower and slower, and at last she stopped beneath a streetlamp. The soft lamplight lent a shimmering luster to her protective membrane. She looked like she was made of water.  She looked up at me with sparkling eyes, more beautiful than stars. Despite our shared parentage, the color of her irises was deeper than mine, her brow less creased by worry. Providence had truly smiled upon her.  “Brother, I’ve found someone special.”  Some things were inevitable. I paused by the door and waited for her to confess who the lucky bastard was.  But she said nothing, only looked me in the eye.  “I heard in the past people held hands without gloves and kissed mouth to mouth. Is that true?”  Is that true? Her tone was full of envy. Girls! They were totally hopeless.  “It’s true,” I said.  [5] Three years after completing my doctorate, I joined a cutting-edge laboratory. It was located aboard a submarine, whose existence remained hidden from the public as it cruised the deepest reaches of the oceans. There was no Internet and no phone reception. We ate specially provided compressed rations and once per month we were permitted to write home to let our families know we were safe.  The government provided funding for our research on viruses. Tailor-made viruses that only affected specific genomes. In case of a laboratory accident resulting in the release of a virus, the submarine would initiate a self-destruct procedure, taking everything with it into the depths of the ocean.  There was no entertainment. But there was alcohol. We’d find an empty conference room, project colorful models of viruses onto the wall, and drink as we admired their ingenious structures. We’d drink and talk about the past and the future.  This was an era Hitler could only dream of. With enough financial support, and enough determination, it was possible to rapidly and precisely exterminate an entire race, an entire country, or even just a single person.  I always thought of her.  In the dazzling church, separated by rows of empty pews, I gaze at her. She hesitates before finally lowering her beseeching arms and looks back at me.  “Clones are a disease.” I hear my own voice reverberate through the entire church. The ancient stained glass depicts a myth I don’t understand, about angels, and the benevolence of God. I’m not a believer. “Replicating endlessly. Meaningless.”  She scratches her cheek with her finger and seems to consider this.  “You aren’t sick,” I say. “Why did you call me here on such a flimsy excuse?”  “Who knows?” she replies. “Maybe she’s long dead. None of you would know.”  “I’m meaningless?” she asks.  [6] That night, she sipped her hot cocoa, warm brown liquid smearing the corners of her mouth, red lipstick prints on the rim of her mug.  “Did you have dreams, before this?”  “When I woke up, I was already twenty. There was no before this.” She arched her eyebrows in reproach. It was a practiced expression, one that made her seem equal parts adorable and pathetic.  I had a rough idea of how it was done. Separated by protective membranes, people would stroke each other, kiss each other. Two membranes, or sometimes, just one. She would remove these, the membranes hissing with electricity as they separated from the skin. It was as close as two people could get.  “My little sister and I used to love eating sweets. We always had toothaches, but our dentist was vicious. So I used to dream of becoming a dentist. If I was the one treating her, my sister wouldn’t have to be afraid.”  “You’re a good brother.” A trite compliment.  When we were young, my sister followed me everywhere. She wasn’t interested in freedom or rebellion. It wasn’t selflessness so much as indifference. On my first day of primary school, she cried at home for the whole afternoon.  “Whore,” I say. Whenever she came up in conversation, my classmates would sneer, “They’re all whores. Except your sister.”  She stiffened with fear, and set her mug down on the table. But the panic passed as quickly as it came, and her face quickly resumed its captivating smile. “Yes. Your whore, for tonight.”  She was wearing a warm perfume, which grew stronger as the evening went on. Even after I wiped the blood from the floorboards, the scent lingered.  The others were whores. She alone could become a saint.  The strike lasted for three months.  The first suicide attack caught everyone off guard. Only two people were killed: a housekeeper employed in the general manager’s household, and the general manager himself. Subsequent investigation revealed that the housekeeper had been replaced by a member of a clone resistance group several weeks earlier. Not merely content with demonstrations, the insurgents were entertaining more radical methods of expressing their demands.  The architect behind the second attack wasn’t even a clone. The thirty-year-old engineer had fallen in love with the pretty, intelligent worker who lived downstairs, and willingly sacrificed everything for her. These clones had been closely screened for a genetic predisposition to rebel, but of course there were people like my sister among them—healthy, young, intelligent, attractive people. They deserved their fair share of profits, and of love.  An official spokesperson announced that the government would take the most efficient course of action.  [7] Helen, I’ll never forget your smile.  You, standing beneath that icon, the sunlight gilding your dark brown hair. The shadows cast by your fluttering eyelashes, the fine, downy hairs on your face, the slight dimple of your cheek. The very image of the heroine of Greek myth, whose beauty toppled kingdoms.  There is someone standing behind you, always standing behind you. From far away, he looks like me. Up close, I fear we’d look identical.  I have always lived cautiously. Except that night, as I looked at you, just eighteen years old. You lay peacefully beneath the glass hood and then your brow furrowed, as though you were enduring some terrible pain. You were trembling all over.  Whose hand did you hold? Who did you kiss?  I removed my glove and gently smoothed the creases from your brow with my fingers. Your skin was warmer than I imagined, smoother. In half an hour, the police would come and take you away.  I did not yet know that three hours later you would be spirited out of prison and taken to a base belonging to the resistance. Five years later, I would sign a proxy consent form and put my newly developed virus into practice, wiping out every last one of you.  Except for you, my dear little sister. You, who are protected in the heart of the ocean.  “There is only one place for you at the Lord’s table,” I say to you in the church.  The man behind you wraps his arm around your shoulder. A salty, bitter taste suddenly wells up in my throat, like I’ve swallowed someone’s blood.    Originally published in Chinese in Science Fiction World, June 2017.  Translated and published in partnership with Storycom.  Elizabeth Hanlon is a Boston-based translator of Chinese fiction. She is a graduate of Tulane University and studied Chinese at the Inter-University Program for Chinese Language Studies at Tsinghua University. Her published translations include Of Ants and Dinosaurs, a novella by Hugo-Award-winning sci-fi author Cixin Liu; Beijing Graffiti, a non-fiction work on Beijing’s graffiti culture, and several short stories.", "text": "3600 words, short story\nAll Living Creation\n[1]\nLying in bed, I reaffirm to myself that all is well.\nIn some corner of the world, there is not another me, forced into life, sold, kept as a pet, tortured out of spite, assigned to a dirty, dangerous task. There’s only me. It’s lonely, but it’s a reassuring loneliness.\nThat night I can’t sleep. I keep thinking of her, tongue jittering wildly in my mouth, heart sinking down toward someplace dark. At four in the morning, birds begin to twitter outside my window. At six, they arrive.\nFive of her, without even different uniforms to distinguish one from another. They’re maybe one or two years apart in age, but otherwise appear nearly identical. It creates a sort of illusion: I can’t shake the impression of shells sharing the same soul—if they have one at all. They wait politely at the door for me to come out. Keeping their heads slightly lowered, they flick their eyes upward every so often to observe me, seemingly on edge.\nTheir worry is uncalled for. After all, I’m simply going to visit my dear little sister.\nHelen Zhang, rebellious in the way that all foolish young people are, left home eight years ago, after declaring to our parents, “Just forget you ever had a daughter!” That same year, she leaked her own genes and became the most popular commercial clone model ever.\nThe last time I saw her was five years ago, at a riotous parade. Feverish fans were everywhere, men and women, old and young, jostling, cheering. There were bright streamers, balloons, confetti cannons, signs, protective membranes deliberately slit open—everything you would expect to see at a parade, plus a large police presence to maintain order.\nI gripped the handle of my briefcase tightly and watched as the flow of the crowd carried me farther and farther away from her.\nThe law protects our natural human freedoms against infringement, and our predetermined genes against theft. We cover our fingers in protective membranes, and all household objects are rigorously sterilized immediately after use. We avoid all physical contact to ensure the security of our genes.\nNearly everyone follows these precautions—everyone except my foolish little sister. Like Christ, she offered herself in sacrifice.\nBut only Christ can save this world of sin.\nOutside, mechanical lenses swivel in my direction, soundlessly, the way vigilant birds might watch a predator. In a moment, I will appear on various news sites, not that it matters. The car that has come to collect me has a spacious passenger compartment, and the windows are black and opaque. It’s a little unnerving.\nTwo of the five women sit with me in the passenger compartment. Even without makeup, their features are bright and striking, eternally youthful. They keep silent, long lashes fluttering gently with each breath. In profile, with their prominent, pointed chins, their faces bear a faint resemblance to my own. My little sisters.\nI finally get to see her again.\nI can’t say I miss her. It doesn’t make sense, when in fact I see “her” almost every day. On the Internet, on TV, in the newspaper. At fast food joints, nightclubs, shopping malls. At noon, dusk, dawn. Too many of her to count. After she volunteered her genetic information, she became something of a free resource.\nFree, and thus much despised and degraded.\n[2]\nThanks to advances in genetic engineering, it is theoretically possible to create a human with any given combination of traits.\nWe’ve certainly tried. I’ve seen the man in textbooks: no bulging musculature, and yet more than capable of shattering any Olympic record, or working at depths of thirty meters without protection for twenty minutes. What the textbooks leave out is that he died, quickly and quietly, after just a few days.\nAccording to our instructor, it was a sudden heart attack. His heart couldn’t keep up with his body’s superhuman demand for blood. It was possible in theory, but not practice: blood oxygen content, hormone levels, muscular endurance . . . the variables involved were too numerous and complex.\nThe rules that govern our genetic makeup are far more complicated than we imagine. The slightest change can dramatically alter the whole. Attempts to correct every “error” made during the genetic modification process will only be subsumed by an endless stream of errors.\nBut it isn’t just the unpredictability of genetic engineering.\nAs my undergraduate advisor put it, nature is not merely more complex than we think; its complexity is beyond human comprehension. The terrible thing about genetic modification is that you can’t help but want to compensate for errors. But humanity has managed to advance despite innumerable defects. Compensating for so-called minor errors inevitably leads to fatal problems.\nAt a press conference I once attended, a pushy female reporter raised a cross to her chest and asked in a shrill voice, “Does this prove God created man? Only the divine can solve everything.”\nSmiling, the representative from the research team replied, “Man is creating himself.”\nIt has taken humanity, eliminating unfavorable genetic combinations one generation at time, more than three million years to get where we are today.\nEven as obtaining funding for genetic modification and recombination projects became increasingly difficult, human cloning plans gained ground. Businessmen didn’t have much patience for waiting, nor were they willing to incur the heavy costs of trial and error. Instead, they found a solution using the simplest and crudest means available. They simply screened existing genomes and selected the best to clone servants for themselves.\nThey turned tools into humans, and humans into tools.\nEight years ago, they selected my little sister. It was a campus beauty pageant—or at least, it had looked like one. The participants were subjected to a physical examination, as well as a lengthy and exhaustive comparative genetic analysis. Those who were chosen received a contract, and upon signing, entered into a business venture, one that promised to usher in a new era for humanity.\nShe didn’t consult us. Unbeknownst to our parents and me, she needed a large sum of money at the time. She never told us the reason she needed it.\n[3]\nWe don’t speak a word on the way there. When I get out of the car, I am greeted by the autumn sky, clouds thin as gauze, and a stand of withered trees. After three of her register our information at the entrance, the two of her who accompanied me in the car—one in front and one behind me—lead me down a narrow, sloping corridor.\nAs I step through the door, I realize that I am in an ancient underground church. After donating her genetic material, she received a substantial allowance, enough to live out the rest of her life however she pleased. It was rumored that she had bought up many of her own clones and established bases all over the world, for reasons best known to herself.\nLight streams through the domed stained-glass ceiling, and I can smell wet earth.\n“You’re a doctor now,” she says, mild curiosity in her voice. Seated beneath an enormous painted icon, she tilts her chin up and smiles at me. Her voice is almost identical to the voices that pervade my daily life. A little huskier, perhaps.\nI once heard a saying that experience shapes character; that is, your memories define your identity. Only she ever pestered me to tell her fairy tales. The little mermaid trading her singing voice for a pair of legs, only to dissolve into foam; a wicked queen hatching murderous schemes before a talking mirror—those sorts of tales.\nShe is dressed in a simple ink-blue dress, cut from a heavy fabric that shows its age. Perhaps, after so many years on her own, she has grown accustomed to showing her age, too. She alone is my little sister.\nUnobscured by protection of any kind, even the fine hairs on her face are clearly visible in the sunlight.\n“A dentist,” I say. “I probably can’t save you, unless it’s your tooth that’s killing you.”\n“You’re not a dentist.” She shakes her head.\nShe can’t possibly know.\n“You’re the world’s top clinical virologist.” She smiles again and opens her arms to me, as though asking for a hug. I walk toward her ever so slowly.\n“Do you cure disease? Do you save people?” Helen speaks softly, but in a wide-open space like this I can still hear her every word. “Do you save clones?”\nThe first time it happened, we had just finished a celebratory dinner. Our experiments had progressed swimmingly, so my boss had invited our investors and the project team to go out to eat together.\nI can’t say exactly when the atmosphere changed. I was already half in the bag, but I still picked up on the significance in my coworkers’ gazes. Then the door to our private dining room opened and several scantily clad girls stepped in. She, of course, was among them. I drained several more glasses. When I came to again, I was already home.\nOver time, I got used to it. I even tried to engage with her. To be more precise, I bought her services for an evening. The sky had already grown dark. After the clouds, golden-red in the light of the setting sun, vanished, a fog rolled in off the ocean, so thick that it was difficult to breathe or see straight ahead.\nShe shivered in her short skirt, like anyone else. And, like anyone else, a glistening protective membrane coated her skin: while she had no need to protect her genes, the membrane made her seem more normal, to say nothing of the customers who enjoyed the process of peeling off the layer with their own hands. She looked at me, a faint smile tugging at the corners of her mouth.\nI took her home and made her a cup of hot cocoa. Unlike other clone models I’d encountered previously, she didn’t seem to care much for talking. Instead, she simply held her mug and looked at me. It was extremely uncomfortable.\n“What’s wrong with you?” I asked.\n“What’s wrong with you?” she asked, parroting me, the corners of her mouth creeping upward. “You don’t even want to touch me.”\nMy sister wouldn’t act this way. Helen was my constant shadow, sweet and obliging. She didn’t know how to talk back. Which meant we were all the more shocked by the subsequent turn of events.\nShe’d been confined to a room, but by then it was already too late. At that very moment, tens, hundreds, thousands of her were being cloned. She was healthy, intelligent, beautiful. The companies that had acquired her genes had struck gold.\n“Do something about your sister!” said our mother, but what she really meant was, “Help your sister.”\nI hadn’t been home in two years, as the project had entered a critical phase. But since the situation was truly dire, my supervisor granted me a two-day leave of absence.\nI opened the door and saw my eighteen-year-old sister secured to a bed with metal restraints. Her body had been placed beneath an isolation hood, like she had slipped into endless slumber, like she was Sleeping Beauty waiting for a prince’s kiss.\nExcept it wasn’t a fairy tale. In reality, she’d been given a tranquilizer, and the police were due to arrive in the next half hour. In hopes of obtaining a light sentence for Helen, our parents had called them and confessed on her behalf. The charge was “disruption of the public order.” It was possible she’d be put away for life.\nI just looked at her through the glass hood. A faint red mark still lingered on her face where our father had slapped her.\nEven then I couldn’t save her.\n[4]\nI’ve seen them many times.\nI’ve accepted takeout from her hands. With the integration of artificial intelligence into logistics networks, the sole purpose justifying the existence of these workers is to humanize food delivery services, easing the loneliness of reclusive customers who seldom leave the house. Naturally, there are also those with a strong aversion to seeing their own kind: they simply make a note on their order to place the takeout in the parcel locker fixed to their door.\nThis one had a sweet smile. She couldn’t have been older than eighteen. She held out the warm pizza box, but when I reached for it, she didn’t let go, just smiled at me.\nPerhaps she knew who I was. She was asking for help, but I could do nothing for her.\nShe, and all the others like her, had all been cloned. Deprived of all rights, not recognized as people. Microchips implanted into their wrists continuously reported back on their physical condition and location. Their lives were regulated down to the minute, even down to the second, to maximize performance.\nI tightened my grip and pulled the pizza box from her hand. She lowered her gaze, turned, and left.\nOnce I witnessed two of them fight.\nI pulled the car over to the side of the road to watch. Some pedestrians pretended not to see and hurried past, while others also stopped to look on. The one in a business suit brought her handbag down hard against the face of the one in jeans. Someone was screaming. They tore at each other’s hair until one of them produced a knife and drew blood. I drove away.\nThe crime rate is at a historic low. That is, the crime rate among normal people is at a historic low. We can’t use DNA evidence to arrest clones. They’re identical, so a sin committed by one is a sin committed by all.\nKillers, crooks, and whores. My little sisters.\nMany a young person has printed her name or face on T-shirts. Some have dedicated books to her. More than one have followed her example and leaked their own genes, as an act of rebellion, or simply out of a desire for fame. But no one ever took the world by storm quite like her. Or, to be more precise, no one ever took the world by storm quite like them.\nI should have known this day would come, ever since we dropped her off at college.\nWhile our parents parked the car, I helped her carry her luggage up the stairs. She trailed behind me with several bags of clothing, dragging her feet. Back then she was still a good girl, so obedient that she’d never once raised her voice to our parents.\nHer steps grew slower and slower, and at last she stopped beneath a streetlamp. The soft lamplight lent a shimmering luster to her protective membrane. She looked like she was made of water.\nShe looked up at me with sparkling eyes, more beautiful than stars. Despite our shared parentage, the color of her irises was deeper than mine, her brow less creased by worry. Providence had truly smiled upon her.\n“Brother, I’ve found someone special.”\nSome things were inevitable. I paused by the door and waited for her to confess who the lucky bastard was.\nBut she said nothing, only looked me in the eye.\n“I heard in the past people held hands without gloves and kissed mouth to mouth. Is that true?”\nIs that true? Her tone was full of envy. Girls! They were totally hopeless.\n“It’s true,” I said.\n[5]\nThree years after completing my doctorate, I joined a cutting-edge laboratory. It was located aboard a submarine, whose existence remained hidden from the public as it cruised the deepest reaches of the oceans. There was no Internet and no phone reception. We ate specially provided compressed rations and once per month we were permitted to write home to let our families know we were safe.\nThe government provided funding for our research on viruses. Tailor-made viruses that only affected specific genomes. In case of a laboratory accident resulting in the release of a virus, the submarine would initiate a self-destruct procedure, taking everything with it into the depths of the ocean.\nThere was no entertainment. But there was alcohol. We’d find an empty conference room, project colorful models of viruses onto the wall, and drink as we admired their ingenious structures. We’d drink and talk about the past and the future.\nThis was an era Hitler could only dream of. With enough financial support, and enough determination, it was possible to rapidly and precisely exterminate an entire race, an entire country, or even just a single person.\nI always thought of her.\nIn the dazzling church, separated by rows of empty pews, I gaze at her. She hesitates before finally lowering her beseeching arms and looks back at me.\n“Clones are a disease.” I hear my own voice reverberate through the entire church. The ancient stained glass depicts a myth I don’t understand, about angels, and the benevolence of God. I’m not a believer. “Replicating endlessly. Meaningless.”\nShe scratches her cheek with her finger and seems to consider this.\n“You aren’t sick,” I say. “Why did you call me here on such a flimsy excuse?”\n“Who knows?” she replies. “Maybe she’s long dead. None of you would know.”\n“I’m meaningless?” she asks.\n[6]\nThat night, she sipped her hot cocoa, warm brown liquid smearing the corners of her mouth, red lipstick prints on the rim of her mug.\n“Did you have dreams, before this?”\n“When I woke up, I was already twenty. There was no before this.” She arched her eyebrows in reproach. It was a practiced expression, one that made her seem equal parts adorable and pathetic.\nI had a rough idea of how it was done. Separated by protective membranes, people would stroke each other, kiss each other. Two membranes, or sometimes, just one. She would remove these, the membranes hissing with electricity as they separated from the skin. It was as close as two people could get.\n“My little sister and I used to love eating sweets. We always had toothaches, but our dentist was vicious. So I used to dream of becoming a dentist. If I was the one treating her, my sister wouldn’t have to be afraid.”\n“You’re a good brother.” A trite compliment.\nWhen we were young, my sister followed me everywhere. She wasn’t interested in freedom or rebellion. It wasn’t selflessness so much as indifference. On my first day of primary school, she cried at home for the whole afternoon.\n“Whore,” I say. Whenever she came up in conversation, my classmates would sneer, “They’re all whores. Except your sister.”\nShe stiffened with fear, and set her mug down on the table. But the panic passed as quickly as it came, and her face quickly resumed its captivating smile. “Yes. Your whore, for tonight.”\nShe was wearing a warm perfume, which grew stronger as the evening went on. Even after I wiped the blood from the floorboards, the scent lingered.\nThe others were whores. She alone could become a saint.\nThe strike lasted for three months.\nThe first suicide attack caught everyone off guard. Only two people were killed: a housekeeper employed in the general manager’s household, and the general manager himself. Subsequent investigation revealed that the housekeeper had been replaced by a member of a clone resistance group several weeks earlier. Not merely content with demonstrations, the insurgents were entertaining more radical methods of expressing their demands.\nThe architect behind the second attack wasn’t even a clone. The thirty-year-old engineer had fallen in love with the pretty, intelligent worker who lived downstairs, and willingly sacrificed everything for her. These clones had been closely screened for a genetic predisposition to rebel, but of course there were people like my sister among them—healthy, young, intelligent, attractive people. They deserved their fair share of profits, and of love.\nAn official spokesperson announced that the government would take the most efficient course of action.\n[7]\nHelen, I’ll never forget your smile.\nYou, standing beneath that icon, the sunlight gilding your dark brown hair. The shadows cast by your fluttering eyelashes, the fine, downy hairs on your face, the slight dimple of your cheek. The very image of the heroine of Greek myth, whose beauty toppled kingdoms.\nThere is someone standing behind you, always standing behind you. From far away, he looks like me. Up close, I fear we’d look identical.\nI have always lived cautiously. Except that night, as I looked at you, just eighteen years old. You lay peacefully beneath the glass hood and then your brow furrowed, as though you were enduring some terrible pain. You were trembling all over.\nWhose hand did you hold? Who did you kiss?\nI removed my glove and gently smoothed the creases from your brow with my fingers. Your skin was warmer than I imagined, smoother. In half an hour, the police would come and take you away.\nI did not yet know that three hours later you would be spirited out of prison and taken to a base belonging to the resistance. Five years later, I would sign a proxy consent form and put my newly developed virus into practice, wiping out every last one of you.\nExcept for you, my dear little sister. You, who are protected in the heart of the ocean.\n“There is only one place for you at the Lord’s table,” I say to you in the church.\nThe man behind you wraps his arm around your shoulder. A salty, bitter taste suddenly wells up in my throat, like I’ve swallowed someone’s blood.\nOriginally published in Chinese in Science Fiction World, June 2017.\nTranslated and published in partnership with Storycom.\nElizabeth Hanlon is a Boston-based translator of Chinese fiction. She is a graduate of Tulane University and studied Chinese at the Inter-University Program for Chinese Language Studies at Tsinghua University. Her published translations include Of Ants and Dinosaurs, a novella by Hugo-Award-winning sci-fi author Cixin Liu; Beijing Graffiti, a non-fiction work on Beijing’s graffiti culture, and several short stories.", "source": "https://clarkesworldmagazine.com/xiu_10_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: All Living Creation by Xiu Xinyu, translated by Elizabeth Hanlon"}