{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tim Pratt", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "1UKNgeBdAdIJAtIpVLd2UsS+WVU=", "id": null, "license": null, "comments": "", "raw_text": "Select Year 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 ISSUE 16 – January 2008 FICTION The River Boy by Tim Pratt Debris Ensuing from a Supervortex by Brian Ames NON-FICTION Countdown to Singularity: A Conversation with Vernon Vinge by Shaun Farrell An Interview with Daniel Abraham by Tobias S. Buckell COVER ART Fractured Thoughts by Ray Toh PURCHASE THIS ISSUE: Amazon Kindle B&N EPUB Weightless EPUB/MOBI ISSUE 17 – February 2008 Captain's Lament by Stephen Graham Jones The Human Moments by Alexander Lumans I Like Writing but Hate Being a Writer by Richard Bowes An Interview with Catherynne M. Valente A Day Without You - Second Phase by Serj Iulian ISSUE 18 – March 2008 The Sky that Wraps the World Round, Past the Blue and Into the Black by Jay Lake Teeth by Stephen Dedman Evolutionary Arms Race: Competing Interests in Male and Female Genomes by Ekaterina Sedia An Interview with Kage Baker by Jeff VanderMeer Nomad by Pascal Blanche ISSUE 19 – April 2008 After Moreau by Jeffrey Ford Flight by Jeremiah Sturgill Not Now, Sweetie, Daddy's Worldbuilding Refusing to be the Same: An Interview with K.J. Bishop Floating Fish by Matts Minnhagen ISSUE 20 – May 2008 A Buyer's Guide to Maps of Antartica by Catherynne M. Valente Birdwatcher by Garth Upshaw Of Dice and Men: Modern Fantasists and the Influence of Role Playing Games by Justin Howe and Jason S. Ridler An Interview with John Picacio why i'm here by Cuson ISSUE 21 – June 2008 Clockwork Chickadee by Mary Robinette Kowal AUDIO EDITION read by Mary Robinette Kowal The Secret in the House of Smiles by Paul Jessup Cheer Up Emo Kid: Being Depressed (or Gay) is Not All in Your Genes The Laird Barron Sequence: Defining the Undefinable Chicken Little and the Death of Short Fiction by Neil Clarke DuckSoup ... The Revenge by Eli Effenberger ISSUE 22 – July 2008 When the Gentlemen Go By by Margaret Ronald AUDIO EDITION read by Cat Rambo The Glory of the World by Sergey Gerasimov Smart Broads and Tough Guys: The Strange World of Vintage Paperbacks by Lisa Morton John Grant and Paul Barnett Agree: Science Has Been Corrupted Cavemen Discovered in the 21st Century Colorless by Patipat Asavasena ISSUE 23 – August 2008 Blue Ink by Yoon Ha Lee Tetris Dooms Itself by Meghan McCarron Her Mother's Ghosts by Theodora Goss Writing My Mother's Ghosts An Interview with Gene Wolfe by Jeremy L. Jones 083 by Dan Hazelton and Jesse Smith ISSUE 24 – September 2008 Worm Within by Cat Rambo Can You See Me Now? by Eric M. Witchey White Girl by Alethea Kontis An Interview with Richard K. Morgan by Jason B. Jones Into the Depths by Patrick Reilly ISSUE 25 – October 2008 Gift of the Kites by Jim C. Hines Passwords by John A. McDermott How Candle Girl and V Took On 2MB by Gord Sellar Margo Lanagan and Tender Morsels Alien Cityscape by Joebert Zaide ISSUE 26 – November 2008 Idle Roomer by Mike Resnick and Lezli Robyn batch 39 and the deadman's switch by Simon DeDeo Writing with One Hand Tied to the Death Star: Award-Winning Authors and Media Tie-In Fiction by Jason S. Ridler Voodoo Economics: How to Find Serenity in an Industry that Does Not Want You The Traveller & the Chook by David Renn ISSUE 27 – December 2008 A Woman's Best Friend by Robert Reed Episode 72 by Don Webb The Completely Rechargeable Man by Karen Heuler To Believe the Magic Is Real: A Conversation with Ed Greenwood by Jeremy L. C. Jones Frosty was a WHAT?!! Brave Dissent by Adam Gillespie Browse By Fiction Audio Fiction Articles Interviews Editorials Awards & Recognition Authors & Artists Random Story Random Podcast Follow Us On SUBSCRIBE AT Amazon.com Apple Newsstand B&N Nook Newsstand Google Play Patreon ClarkesworldCitizens Weightless Books ISSN 1937-7843 · Clarkesworld Magazine © 2006-2022 Wyrm Publishing. Robot illustration by Serj Iulian.", "text": "Select Year\n2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022\nISSUE 16 – January 2008\nFICTION\nThe River Boy\nby Tim Pratt\nDebris Ensuing from a Supervortex\nby Brian Ames\nNON-FICTION\nCountdown to Singularity: A Conversation with Vernon Vinge\nby Shaun Farrell\nAn Interview with Daniel Abraham\nby Tobias S. Buckell\nCOVER ART\nFractured Thoughts\nby Ray Toh\nPURCHASE THIS ISSUE:\nAmazon Kindle\nB&N EPUB\nWeightless EPUB/MOBI\nISSUE 17 – February 2008\nCaptain's Lament\nby Stephen Graham Jones\nThe Human Moments\nby Alexander Lumans\nI Like Writing but Hate Being a Writer\nby Richard Bowes\nAn Interview with Catherynne M. Valente\nA Day Without You - Second Phase\nby Serj Iulian\nISSUE 18 – March 2008\nThe Sky that Wraps the World Round, Past the Blue and Into the Black\nby Jay Lake\nTeeth\nby Stephen Dedman\nEvolutionary Arms Race: Competing Interests in Male and Female Genomes\nby Ekaterina Sedia\nAn Interview with Kage Baker\nby Jeff VanderMeer\nNomad\nby Pascal Blanche\nISSUE 19 – April 2008\nAfter Moreau\nby Jeffrey Ford\nFlight\nby Jeremiah Sturgill\nNot Now, Sweetie, Daddy's Worldbuilding\nRefusing to be the Same: An Interview with K.J. Bishop\nFloating Fish\nby Matts Minnhagen\nISSUE 20 – May 2008\nA Buyer's Guide to Maps of Antartica\nby Catherynne M. Valente\nBirdwatcher\nby Garth Upshaw\nOf Dice and Men: Modern Fantasists and the Influence of Role Playing Games\nby Justin Howe and Jason S. Ridler\nAn Interview with John Picacio\nwhy i'm here\nby Cuson\nISSUE 21 – June 2008\nClockwork Chickadee\nby Mary Robinette Kowal\nAUDIO EDITION read by Mary Robinette Kowal\nThe Secret in the House of Smiles\nby Paul Jessup\nCheer Up Emo Kid: Being Depressed (or Gay) is Not All in Your Genes\nThe Laird Barron Sequence: Defining the Undefinable\nChicken Little and the Death of Short Fiction\nby Neil Clarke\nDuckSoup ... The Revenge\nby Eli Effenberger\nISSUE 22 – July 2008\nWhen the Gentlemen Go By\nby Margaret Ronald\nAUDIO EDITION read by Cat Rambo\nThe Glory of the World\nby Sergey Gerasimov\nSmart Broads and Tough Guys: The Strange World of Vintage Paperbacks\nby Lisa Morton\nJohn Grant and Paul Barnett Agree: Science Has Been Corrupted\nCavemen Discovered in the 21st Century\nColorless\nby Patipat Asavasena\nISSUE 23 – August 2008\nBlue Ink\nby Yoon Ha Lee\nTetris Dooms Itself\nby Meghan McCarron\nHer Mother's Ghosts\nby Theodora Goss\nWriting My Mother's Ghosts\nAn Interview with Gene Wolfe\nby Jeremy L. Jones\n083\nby Dan Hazelton and Jesse Smith\nISSUE 24 – September 2008\nWorm Within\nby Cat Rambo\nCan You See Me Now?\nby Eric M. Witchey\nWhite Girl\nby Alethea Kontis\nAn Interview with Richard K. Morgan\nby Jason B. Jones\nInto the Depths\nby Patrick Reilly\nISSUE 25 – October 2008\nGift of the Kites\nby Jim C. Hines\nPasswords\nby John A. McDermott\nHow Candle Girl and V Took On 2MB\nby Gord Sellar\nMargo Lanagan and Tender Morsels\nAlien Cityscape\nby Joebert Zaide\nISSUE 26 – November 2008\nIdle Roomer\nby Mike Resnick and Lezli Robyn\nbatch 39 and the deadman's switch\nby Simon DeDeo\nWriting with One Hand Tied to the Death Star:\nAward-Winning Authors and Media Tie-In Fiction\nby Jason S. Ridler\nVoodoo Economics:\nHow to Find Serenity in an Industry that Does Not Want You\nThe Traveller & the Chook\nby David Renn\nISSUE 27 – December 2008\nA Woman's Best Friend\nby Robert Reed\nEpisode 72\nby Don Webb\nThe Completely Rechargeable Man\nby Karen Heuler\nTo Believe the Magic Is Real: A Conversation with Ed Greenwood\nby Jeremy L. C. Jones\nFrosty was a WHAT?!!\nBrave Dissent\nby Adam Gillespie\nBrowse By\nFiction\nAudio Fiction\nArticles\nInterviews\nEditorials\nAwards & Recognition\nAuthors & Artists\nRandom Story\nRandom Podcast\nFollow Us On\nSUBSCRIBE AT\nAmazon.com\nApple Newsstand\nB&N Nook Newsstand\nGoogle Play\nPatreon\nClarkesworldCitizens\nWeightless Books\nISSN 1937-7843 · Clarkesworld Magazine © 2006-2022 Wyrm Publishing. Robot illustration by Serj Iulian.", "source": "https://clarkesworldmagazine.com/prior/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: 2008 Back Issues"}