{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "0NQDK2DcBDTJTQfamCn4YVyMTcA=", "id": null, "license": null, "comments": "", "raw_text": "5000 words, short story  Staying Behind  After the Singularity, most people chose to die.  The dead pity us and call us the left behind, as if we were unfortunate souls who couldn’t get to a life raft in time. They cannot fathom the idea that we might choose to stay behind. And so, year after year, relentlessly, the dead try to steal our children.  I was born in Year Zero of the Singularity, when the first man Uploaded into a machine. The Pope denounced the “Digital Adam”; the digerati celebrated; and everyone else struggled to make sense of the new world.  “We’ve always wanted to live forever,” said Adam Ever, the founder of Everlasting, Inc., and the first to go. In the form of a recording, his message was broadcast across the Internet. “Now we can.”  While Everlasting built its massive data center in Svalbard, nations around the world scrambled to decide if what happened there was murder. For every Uploaded man, there was a lifeless body left behind, the brain a bloody pulpy mess after the destructive scanning procedure. But what really happened to him, his essence, his—for lack of a better word—soul?  Was he now an artificial intelligence? Or was he still somehow human, with silicon and graphene performing the functions of neurons? Was it merely a hardware upgrade for consciousness? Or has he become a mere algorithm, a clockwork imitation of free will?  It began with the old and the terminally ill. It was very expensive. Then, as the price of admission lowered, hundreds, thousands, then millions lined up.  “Let’s do it,” Dad said, when I was in high school. By then, the world was falling into chaos. Half the country was depopulated. Commodity prices plunged. The threat of war and actual war were everywhere: conquests, re-conquests, endless slaughter. Those who could afford it left on the next flight to Svalbard. Humanity was abandoning the world and destroying itself.  Mom reached out and held Dad’s hand.  “No,” she said. “They think they can cheat death. But they died the minute they decided to abandon the real world for a simulation. So long as there’s sin, there must be death. It is the measure by which life gains meaning.”  She was a lapsed Catholic who nonetheless yearned for the certainty of the Church, and her theology always seemed to me a bit cobbled-together. But she believed that there was a right way to live, and a right way to die.  While Lucy is away at school, Carol and I search her room. Carol looks through her closet for pamphlets, books, and other physical tokens of contact with the dead. I log onto Lucy’s computer.  Lucy is strong-willed but dutiful. Ever since she was a little girl, I’ve been telling her that she must prepare to resist the temptations of the dead. Only she can assure the continuity of our way of life in this abandoned world. She listens to me and nods.  I want to trust her.  But the dead are very clever with their propaganda. In the beginning, they sometimes sent metallic gray drones over our towns, scattering leaflets filled with messages purporting to be from our loved ones. We burned the leaflets and shot at the drones, and eventually, they stopped coming.  Then they tried to come at us through the wireless links between the towns, the electronic lifeline that sustained those who stayed behind and kept our shrinking communities from being completely isolated from each other. We had to vigilantly watch the networks for their insidious tendrils, always seeking an opening.  Lately, their efforts have turned to the children. The dead may have finally given up on us, but they are grasping for the next generation, for our future. As her father, I have a duty to protect Lucy from that which she does not yet understand.  The computer boots up slowly. It’s a miracle that I’ve managed to keep it running for so long, years past the obsolescence planned by its manufacturer. I’ve replaced every component in it, some multiple times.  I scan for a list of files recently created or modified by Lucy, emails received, web pages retrieved. Most are schoolwork or innocent chatter with friends. The inter-settlement network, such as it is, shrinks daily. It’s difficult to keep the radio towers that link town to town powered and operating, with so many people each year dying and simply giving up. It used to be possible for us to communicate with friends as far away as San Francisco, the packets of data skipping from town to town in between like stones across a pond. But now, only less than a thousand computers are still reachable from here, none further away than Maine. Someday we won’t be able to scavenge the components to keep the computers running any more, and we’ll regress even further into the past.  Carol is already done with her search. She sits down on Lucy’s bed to watch me.  “That was fast,” I say.  She shrugs. “We’ll never find anything. If she trusts us, she’ll talk to us. If she doesn’t, then we won’t find what she wants hidden.”  Lately, I’ve detected more such fatalistic sentiments in Carol. It’s as though she’s getting tired, not as committed to the cause. I find myself constantly striving to rekindle her faith.  “Lucy is still young,” I tell her, “too young to understand what she would have to give up in exchange for the false promises of the dead. I know you hate this spying, but we’re trying to save her life.”  Carol looks at me, and eventually she sighs and nods.  I check the image files for hidden data. I check the disk for links to deleted files that might hold secret codes. I scan the web pages, looking for code words offering false promises.  I sigh with relief. She’s clean.  I don’t much like leaving Lowell these days. The world outside our fence grows ever more harsh and dangerous. Bears have come back to eastern Massachusetts. Every year, the forest grows denser, closer to the town line. Some claim to have seen wolves roaming in the woods too.  A year ago, Brad Lee and I had to go to Boston to find spare parts for the town’s generator, housed in the old mill by the Merrimac River. We carried shotguns, protection against both the animals and the vandals who still scurried in urban ruins, living off of the last of the canned food. The surface of Mass Ave, deserted for thirty years, was full of cracks, tufts of grass and shrubs peeking out from them. The harsh New England winters, wielding seeping water and prying ice, had chipped away at the tall buildings around us, their windowless shells crumbling and rusting in the absence of artificial heat and regular maintenance.  Coming around a corner downtown, we surprised two of them huddled around a fire, which they fed with books and papers taken from the bookstore nearby. Even vandals needed warmth, and maybe they also delighted in destroying what was left of civilization.  The two crouched and growled at us, but made no move as Brad and I pointed our guns at them. I remember their thin legs and arms, their dirty faces, their bloodshot eyes full of hate and terror. But mostly, I remember their wrinkled faces and white hair. Even the vandals are growing old, I thought. And they have no children.  Brad and I backed away carefully. I was glad we didn’t have to shoot anyone.  The summer I was eight and Laura eleven, my parents took us on a road trip through Arizona, New Mexico, and Texas. We drove along old highways and side roads, a tour of the monumental beauty of the Western deserts, filled with nostalgic, desolate ghost towns.  As we passed through the Indian reservations—Navajo, Zuni, Acoma, Laguna—Mom wanted to stop at every roadside shop to admire the traditional pottery. Laura and I gingerly stepped through the aisles, careful not to break anything.  Back in the car, Mom let me handle a small pot that she had bought. I turned it over and over in my hands, examining the rough white surface, the neat, clean, black geometric designs, and the bold outline of the hunched-over flute player with feathers coming out of his head.  “Amazing, isn’t it?” Mom said. “This wasn’t made on a potter’s wheel. The woman coiled it by hand, using the same techniques that have been passed down for generations in her family. She even dug for the clay in the same places that her great grandmother used. She’s keeping alive an ancient tradition, a way of life.”  The pot suddenly felt heavy in my hands, as though I could sense the weight of its generations of memory.  “That’s just a story to drum up business,” Dad said, glancing at me in the rear view mirror. “But it would be even sadder if the story were true. If you’re doing things the exact same way as your ancestors, then your way of life is dead, and you’ve become a fossil, a performance for the entertainment of tourists.”  “She was not performing,” Mom said. “You have no sense of what’s really important in life, what’s worth holding onto. There’s more to being human than progress. You’re as bad as those Singularity zealots.”  “Please don’t argue any more,” Laura said. “Let’s just get to the hotel and sit by the pool.”  Jack, Brad Lee’s son, is at the door. He’s shy and awkward, even though he has been coming by our house for months. I’ve known him since he was a baby, like I know all the children in town. There are so few of them left. The high school, operating out of the old Whistler House, has only twelve students.  “Hello,” he mumbles, looking at the floor. “Lucy and I need to work on our report.” I step aside to let him pass on his way upstairs to Lucy’s room.  I don’t need to remind him about the rules: door to the bedroom open, at least three of their four feet on the carpet at all times. I hear the indistinct sounds of their chatter and occasional laughter.  There is a kind of innocence to their courtship that was absent from my youth. Without the endless blast of cynical sexuality from TV and the real Internet, children can stay children longer.  There weren’t many doctors left near the end. Those of us who wanted to stay behind gathered into small communities, circling the wagons against the marauding bands of vandals who gorged themselves on pleasures of the flesh as the Uploaded left the physical world behind. I never got to finish college.  Mom lingered in her sickness for months. She was bedridden and drifted in and out of consciousness, her body pumped full of drugs that numbed her pain. We took turns sitting by her, holding her hand. When she had good days, temporary lulls of lucidity, there was only one topic of conversation.  “No,” Mom said, wheezing. “You must promise me. This is important. I’ve lived a real life, and I will die a real death. I will not be turned into a recording. There are worse things than death.”  “If you Upload,” Dad said, “you’ll still have a choice. They can suspend your consciousness, or even erase it, if you don’t like it after you try it. But if you don’t Upload, you’ll be gone forever. There’s no room for regret or return.”  “If I do what you want,” Mom said, “I will be gone. There is no way to come back to this, to the real world. I will not be simulated by a bunch of electrons.”  “Please stop,” Laura pleaded with Dad. “You’re hurting her. Why can’t you leave her alone?”  Mom’s moments of lucidity came further and further apart.  Then that night: waking up to the sound of the front door closing, looking outside the window to see the shuttle on the lawn, tumbling down the stairs.  They were carrying Mom into the shuttle on a stretcher. Dad stood by the door of the gray vehicle, only a little bigger than a van, EVERLASTING, INC. painted on its side.  “Stop!” I shouted over the sound of the shuttle’s engines.  “There’s no time,” Dad said. His eyes were bloodshot. He hadn’t slept for days. None of us had. “They have to do it now before it’s too late. I can’t lose her.”  We struggled. He held me in a tight hug and wrestled me to the ground. “It’s her choice, not yours!” I screamed into his ear. He only held me tighter. I fought to free myself. “Laura, stop them!”  Laura covered her eyes. “Stop fighting, all of you! She would have wanted all of you to stop.”  I hated her for speaking as though Mom was already gone.  The shuttle closed its door and lifted into the air.  Dad left for Svalbard two days later. I refused to speak to him until the end.  “I’m going to join her now,” he said. “Come as soon as you can.”  “You killed her,” I said. He flinched at the words, and I was glad.  Jack has asked Lucy to the prom. I’m pleased that the kids have decided to hold one. It shows that they are serious about keeping alive the stories and traditions they’ve heard from their parents, legends from a world they have only experienced vicariously in old videos and old pictures.  We struggle to maintain what we can of the life from before: put on old plays, read old books, celebrate the old holidays, sing old songs. We’ve had to give up so much. Old recipes have had to be adapted for limited ingredients, old hopes and dreams shrunken to fit within tightened horizons. But every deprivation has also brought us closer as a community, to hold on tighter to our traditions.  Lucy wants to make her own dress. Carol suggests that she look through her old dresses first. “I have some formals left from when I was just a little older than you.”  Lucy is not interested. “They’re old,” she says.  “They’re classic,” I tell her.  But Lucy is adamant. She cuts up her old dresses, curtains, scavenged tablecloths, and trades with the other girls for bits of fabric: silk, chiffon, taffeta, lace, plain cotton. She flips through Carol’s old magazines, looking for inspiration.  Lucy is a good seamstress, far better than Carol. The children are all skilled in trades long thought obsolete in the world I grew up in: knitting, woodworking, planting and hunting. Carol and I had to rediscover and learn these things from books when we were already adults, adapting to a suddenly changed world. But for the children, it is all they have known. They are natives here.  All the students at the high school have spent the last few months doing research in the Textile History Museum, investigating the possibility of weaving our own cloth, preparing for a time when the decaying ruins of the cities would run out of usable cloths for us to salvage. There is some poetic justice in this: Lowell, which once rose on the back of the textile industry, must now rediscover those lost arts on our gentle slide back down the technology curve.  A week after Dad left, we received an email from Mom:   I was wrong.  Sometimes, I’m nostalgic and sad. I miss you, my children, and the world we left behind. But I’m ecstatic most of the time, often incredulous.  There are hundreds of millions of us here, but there is no crowding. In this house there are countless mansions. Each of our minds inhabits its own world, and each of us has infinite space and infinite time.  How can I explain it to you? I can only use the same words so many others have already used. In my old existence, I felt life but dimly and from a distance, cushioned, constrained, tied down by the body. But now I am free, a bare soul exposed to the full tides of eternal Life.  How can speech compare to the intimacy of sharing with your father psyche to psyche? How can hearing about how much he loved me compare to actually feeling his love? To truly understand another person, to experience the texture of his mind—it is glorious.  They tell me that this sensation is called hyperreality. But I don’t care what it is called. I was wrong to cling so tightly to the comforts of an old shell made of flesh and blood. We, the real us, have always been patterns of electrons cascading across the abyss, the nothingness between atoms. What difference does it make if those electrons are in a brain or silicon chips?  Life is sacred and eternal. But our old way of life was unsustainable. We demanded too much of our planet, of sacrifices made by every other living thing. I once thought that an unavoidable aspect of our existence, but it isn’t. Now, with the oil tankers aground, the cars and trucks still, the fields fallow and factories silent, the living world that we had made almost extinct will return.  Humanity is not a cancer of the planet. We simply needed to transcend the demands of our inefficient bodies, machines no longer adequate for their task. How many consciousnesses will now live in this new world, pure creatures of electric spirit and weightless thought? There are no limits.  Come join us. We cannot wait to embrace you again.  -- Mom  Laura cried as she read it. But I felt nothing. This wasn’t my mother speaking. The real Mom knew that what really mattered in life was the authenticity of this messy existence, the constant yearning for closeness to another despite imperfect understanding, the pain and suffering of our flesh.  She taught me that our mortality makes us human. The limited time given to each of us makes what we do meaningful. We die to make place for our children, and through our children a piece of us lives on, the only form of immortality that is real.  It is this world, the world we are meant to live in, that anchors us and demands our presence, not the imagined landscapes of a computed illusion.  This was a simulacrum of her, a recording of propaganda, a temptation into nihilism.  Carol and I met on one of my earliest scavenging trips. Her family had been hiding in the basement of their house on Beacon Hill. A gang of vandals found them and killed her father and brother. They were about to start on her when we showed up. I killed a man-shaped animal that day, and I’m not sorry about it.  We brought her back to Lowell, and though she was seventeen, for days, she clung to me and would not let me out of her sight. Even when sleeping, she wanted me to be there, holding her hand.  “Maybe my family made a mistake,” she said one day. “We would have been better off if we had Uploaded. There’s nothing but death left here now.”  I didn’t argue with her. I let her follow me around as I went about my chores. I showed her how we were keeping the generator running, how we treated each other with respect, how we rescued old books and held onto old routines. There was still civilization in this world, kept alive like a candle flame. People did die, but people were also born. Life went on, sweet, joyful, authentic life.  Then one day, she kissed me.  “There’s also you in this world,” she said. “And that is enough.”  “No, not enough,” I said. “We will also bring new life here.”  Tonight is the night.  Jack is at the door. He looks good in that tuxedo. It’s the same one I wore to my prom. They’ll play the same songs too, pumping the music from an old laptop and speakers on their last legs.  Lucy is splendid in her dress: white with black print, cut in a simple pattern, but very elegant. The skirt is wide and full-length, draping gracefully to the floor. Carol did her hair, curls with a hint of glitter. She looks glamorous, with a hint of childish playfulness.  I take pictures with a camera, one that still mostly works.  I wait until I’m sure I have my voice under control. “You have no idea how glad I am to see young people dancing, the way we used to.”  She kisses me on the cheek. “Goodbye, Dad.” There are tears in her eyes. And that makes everything go blurry for me again.  Carol and Lucy embrace for a moment. Carol wipes her eyes. “You’re all set.”  “Thanks, Mom.”  Then Lucy turns to Jack. “Let’s go.”  Jack will take her to the Lowell Four Seasons on his bicycle. It’s the best that can be done since we’ve been without gasoline for many years. Lucy gingerly settles onto the top tube, sitting sideways, one hand holding her dress up. Jack wraps her in his arms protectively as he grabs the handles. And they are off, wobbling down the street.  “Have fun,” I yell after them.  Laura’s betrayal was the hardest to take.  “I thought you were going to help me and Carol with the baby,” I said.  “What kind of world is this to bring a child into?” Laura said.  “And you think things will be better if you go there, where there are no children, no new life?”  “We’ve tried to keep this going for fifteen years, and every year it becomes harder and harder to believe in this charade. Maybe we were wrong. We should adapt.”  “It’s only a charade when you’ve lost faith,” I said.  “Faith in what?”  “In humanity, in our way of life.”  “I don’t want to fight our parents any more. I just want us to be together again, a family.”  “Those things aren’t our parents. They are imitation algorithms. You’ve always wanted to avoid conflict, Laura. But some conflicts cannot be avoided. Our parents died when Dad lost faith, when he couldn’t resist the false promises made by machines.”  At the end of the road into the woods was a little clearing, grassy, full of wildflowers. A shuttle was waiting in the middle. Laura stepped into the open door.  Another life lost.  The children have permission to stay out until midnight. Lucy had asked me not to volunteer as a chaperone, and I complied, conceding her this bit of space for the night.  Carol is restless. She tries to read but she’s been on the same page for an hour.  “Don’t worry.” I try to comfort her.  She tries to smile at me, but she can’t hide her anxiety. She looks up past my shoulder at the clock on the living room wall.  I glance back too. “Doesn’t it feel later than 11?”  “No,” Carol says. “Not at all. I don’t know what you mean.”  Her voice is too eager, almost desperate. There’s a hint of fear in her eyes. She’s close to panicking.  I open the door of the house and step into the dark street. The sky has grown clearer over the years, and many more stars are now visible. But I’m looking for the Moon. It’s not in the right place.  I come back into the house and go into the bedroom. My old watch, one that I no longer wear because there are so few occasions when being on time matters, is in the nightstand drawer. I pull it out. It’s almost one in the morning. Someone had tampered with the living room clock.  Carol stands in the door to the bedroom. The light is behind her so I can’t see her face.  “What have you done?” I ask. I’m not angry, just disappointed.  “She can’t talk to you. She doesn’t think you’ll listen.”  Now the anger rises in me like hot bile.  “Where are they?”  Carol shakes her head, saying nothing.  I remember the way Lucy said goodbye to me. I remember the way she walked carefully out to Jack’s bike, holding up her voluminous skirt, a skirt so wide that she could hide anything under it, a change of clothing and comfortable shoes for the woods. I remember Carol saying, “You’re all set.”  “It’s too late,” Carol says. “Laura is coming to pick them up.”  “Get out of the way. I have to save her.”  “Save her for what?” Carol is suddenly furious. She does not move. “This is a play, a joke, a re-enactment of something that never was. Did you go to your prom on a bicycle? Did you play only songs that your parents listened to when they were kids? Did you grow up thinking that scavenging would be the only profession? Our way of life is long gone, dead, finished!  “What will you have her do when this house falls apart in thirty years? What will she do when the last bottle of aspirin is gone, the last steel pot rusted through? Will you condemn her and her children to a life of picking through our garbage heaps, sliding down the technology ladder year after year until they’ve lost all the progress made by the human race in the last five thousand years?”  I don’t have time to debate her. Gently, but firmly, I put my hands on her shoulders, ready to push her aside.  “I will stay with you,” Carol says. “I will always stay with you because I love you so much that I’m not afraid of death. But she is a child. She should have a chance for something new.”  Strength seems to drain from my arms. “You have it backwards.” I look into her eyes, willing her to have faith again. “Her life gives our lives meaning.”  Her body suddenly goes limp, and she sinks to the floor, sobbing silently.  “Let her go,” Carol says, quietly. “Just let her go.”  “I can’t give up,” I tell Carol. “I’m human.”  I pump the pedals furiously once I’m past the gate in the fence. The cone of light cast by the flashlight jumps around as I try to hold it against the handlebars. But I know this road into the woods well. It leads to the clearing where Laura once stepped into that shuttle.  Bright light in the distance, and the sound of engines revving up.  I take out my gun and fire a few shots into the air.  The sound of the engines dies down.  I emerge into the opening in the woods, under a sky full of bright, cold, pinprick stars. I jump off the bike and let it fall by the side of the path. The shuttle is in the middle of the clearing. Lucy and Jack, now in casual clothes, stand in the open doorway of the shuttle.  “Lucy, sweetheart, come back out of there.”  “Dad, I’m sorry. I’m going.”  “No, you are not.”  An electronic simulation of Laura’s voice comes out of the shuttle’s speakers. “Let her go, brother. She deserves to have a chance to see what you refuse to see. Or, better yet, come with us. We’ve all missed you.”  I ignore her, it. “Lucy, there is no future there. What the machines promise you is not real. There are no children there, no hope, only a timeless, changeless, simulated existence as fragments of a machine.”  “We have children now,” the copy of Laura’s voice says. “We’ve figured out how to create children of the mind, natives of the digital world. You should come and meet your nephews and nieces. You are the one clinging to a changeless existence. This is the next step in our evolution.”  “You can experience nothing when you are not human.” I shake my head. I shouldn’t take its bait and debate a machine.  “If you leave,” I tell Lucy, “you’ll die a death with no meaning. The dead will have won. I can’t let that happen.”  I raise my gun. The barrel points at her. I will not lose my child to the dead.  Jack tries to step in front of her, but Lucy pushes him away. Her eyes are full of sorrow, and the light from inside the shuttle frames her face and golden hair like an angel.  Suddenly I see how much she looks like my mother. Mom’s features, having passed through me, have come alive again on my daughter. This is how life is meant to be lived. Grandparents, parents, children, each generation stepping out of the way of the next, an eternal striving towards the future, to progress.  I think about how Mom’s choice was taken away from her, how she was not allowed to die as a human, how she was devoured by the dead, how she became a part of their ceaselessly looping, mindless recordings. My mother’s face, from memory, is superimposed onto the face of my daughter, my sweet, innocent, foolish Lucy.  I tighten my grip on the gun.  “Dad,” Lucy says, calmly, her face as steady as Mom’s all those years ago. “This is my choice. Not yours.”  It’s morning by the time Carol steps into the clearing. Warm sunlight through the leaves dapples the empty circle of grass. Dewdrops hang from the tips of the grass blades, in each a miniature, suspended, vision of the world. Birdsong fills the waking silence. My bike is still on the ground by the path where I left it.  Carol sits down by me without speaking. I put my arm around her shoulders and pull her close to me. I don’t know what she’s thinking, but it’s enough for us to sit together like this, our bodies pressed together, keeping each other warm. There’s no need for words. We look around at this pristine world, a garden inherited from the dead.  We have all the time in the world. Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.", "text": "5000 words, short story\nStaying Behind\nAfter the Singularity, most people chose to die.\nThe dead pity us and call us the left behind, as if we were unfortunate souls who couldn’t get to a life raft in time. They cannot fathom the idea that we might choose to stay behind. And so, year after year, relentlessly, the dead try to steal our children.\nI was born in Year Zero of the Singularity, when the first man Uploaded into a machine. The Pope denounced the “Digital Adam”; the digerati celebrated; and everyone else struggled to make sense of the new world.\n“We’ve always wanted to live forever,” said Adam Ever, the founder of Everlasting, Inc., and the first to go. In the form of a recording, his message was broadcast across the Internet. “Now we can.”\nWhile Everlasting built its massive data center in Svalbard, nations around the world scrambled to decide if what happened there was murder. For every Uploaded man, there was a lifeless body left behind, the brain a bloody pulpy mess after the destructive scanning procedure. But what really happened to him, his essence, his—for lack of a better word—soul?\nWas he now an artificial intelligence? Or was he still somehow human, with silicon and graphene performing the functions of neurons? Was it merely a hardware upgrade for consciousness? Or has he become a mere algorithm, a clockwork imitation of free will?\nIt began with the old and the terminally ill. It was very expensive. Then, as the price of admission lowered, hundreds, thousands, then millions lined up.\n“Let’s do it,” Dad said, when I was in high school. By then, the world was falling into chaos. Half the country was depopulated. Commodity prices plunged. The threat of war and actual war were everywhere: conquests, re-conquests, endless slaughter. Those who could afford it left on the next flight to Svalbard. Humanity was abandoning the world and destroying itself.\nMom reached out and held Dad’s hand.\n“No,” she said. “They think they can cheat death. But they died the minute they decided to abandon the real world for a simulation. So long as there’s sin, there must be death. It is the measure by which life gains meaning.”\nShe was a lapsed Catholic who nonetheless yearned for the certainty of the Church, and her theology always seemed to me a bit cobbled-together. But she believed that there was a right way to live, and a right way to die.\nWhile Lucy is away at school, Carol and I search her room. Carol looks through her closet for pamphlets, books, and other physical tokens of contact with the dead. I log onto Lucy’s computer.\nLucy is strong-willed but dutiful. Ever since she was a little girl, I’ve been telling her that she must prepare to resist the temptations of the dead. Only she can assure the continuity of our way of life in this abandoned world. She listens to me and nods.\nI want to trust her.\nBut the dead are very clever with their propaganda. In the beginning, they sometimes sent metallic gray drones over our towns, scattering leaflets filled with messages purporting to be from our loved ones. We burned the leaflets and shot at the drones, and eventually, they stopped coming.\nThen they tried to come at us through the wireless links between the towns, the electronic lifeline that sustained those who stayed behind and kept our shrinking communities from being completely isolated from each other. We had to vigilantly watch the networks for their insidious tendrils, always seeking an opening.\nLately, their efforts have turned to the children. The dead may have finally given up on us, but they are grasping for the next generation, for our future. As her father, I have a duty to protect Lucy from that which she does not yet understand.\nThe computer boots up slowly. It’s a miracle that I’ve managed to keep it running for so long, years past the obsolescence planned by its manufacturer. I’ve replaced every component in it, some multiple times.\nI scan for a list of files recently created or modified by Lucy, emails received, web pages retrieved. Most are schoolwork or innocent chatter with friends. The inter-settlement network, such as it is, shrinks daily. It’s difficult to keep the radio towers that link town to town powered and operating, with so many people each year dying and simply giving up. It used to be possible for us to communicate with friends as far away as San Francisco, the packets of data skipping from town to town in between like stones across a pond. But now, only less than a thousand computers are still reachable from here, none further away than Maine. Someday we won’t be able to scavenge the components to keep the computers running any more, and we’ll regress even further into the past.\nCarol is already done with her search. She sits down on Lucy’s bed to watch me.\n“That was fast,” I say.\nShe shrugs. “We’ll never find anything. If she trusts us, she’ll talk to us. If she doesn’t, then we won’t find what she wants hidden.”\nLately, I’ve detected more such fatalistic sentiments in Carol. It’s as though she’s getting tired, not as committed to the cause. I find myself constantly striving to rekindle her faith.\n“Lucy is still young,” I tell her, “too young to understand what she would have to give up in exchange for the false promises of the dead. I know you hate this spying, but we’re trying to save her life.”\nCarol looks at me, and eventually she sighs and nods.\nI check the image files for hidden data. I check the disk for links to deleted files that might hold secret codes. I scan the web pages, looking for code words offering false promises.\nI sigh with relief. She’s clean.\nI don’t much like leaving Lowell these days. The world outside our fence grows ever more harsh and dangerous. Bears have come back to eastern Massachusetts. Every year, the forest grows denser, closer to the town line. Some claim to have seen wolves roaming in the woods too.\nA year ago, Brad Lee and I had to go to Boston to find spare parts for the town’s generator, housed in the old mill by the Merrimac River. We carried shotguns, protection against both the animals and the vandals who still scurried in urban ruins, living off of the last of the canned food. The surface of Mass Ave, deserted for thirty years, was full of cracks, tufts of grass and shrubs peeking out from them. The harsh New England winters, wielding seeping water and prying ice, had chipped away at the tall buildings around us, their windowless shells crumbling and rusting in the absence of artificial heat and regular maintenance.\nComing around a corner downtown, we surprised two of them huddled around a fire, which they fed with books and papers taken from the bookstore nearby. Even vandals needed warmth, and maybe they also delighted in destroying what was left of civilization.\nThe two crouched and growled at us, but made no move as Brad and I pointed our guns at them. I remember their thin legs and arms, their dirty faces, their bloodshot eyes full of hate and terror. But mostly, I remember their wrinkled faces and white hair. Even the vandals are growing old, I thought. And they have no children.\nBrad and I backed away carefully. I was glad we didn’t have to shoot anyone.\nThe summer I was eight and Laura eleven, my parents took us on a road trip through Arizona, New Mexico, and Texas. We drove along old highways and side roads, a tour of the monumental beauty of the Western deserts, filled with nostalgic, desolate ghost towns.\nAs we passed through the Indian reservations—Navajo, Zuni, Acoma, Laguna—Mom wanted to stop at every roadside shop to admire the traditional pottery. Laura and I gingerly stepped through the aisles, careful not to break anything.\nBack in the car, Mom let me handle a small pot that she had bought. I turned it over and over in my hands, examining the rough white surface, the neat, clean, black geometric designs, and the bold outline of the hunched-over flute player with feathers coming out of his head.\n“Amazing, isn’t it?” Mom said. “This wasn’t made on a potter’s wheel. The woman coiled it by hand, using the same techniques that have been passed down for generations in her family. She even dug for the clay in the same places that her great grandmother used. She’s keeping alive an ancient tradition, a way of life.”\nThe pot suddenly felt heavy in my hands, as though I could sense the weight of its generations of memory.\n“That’s just a story to drum up business,” Dad said, glancing at me in the rear view mirror. “But it would be even sadder if the story were true. If you’re doing things the exact same way as your ancestors, then your way of life is dead, and you’ve become a fossil, a performance for the entertainment of tourists.”\n“She was not performing,” Mom said. “You have no sense of what’s really important in life, what’s worth holding onto. There’s more to being human than progress. You’re as bad as those Singularity zealots.”\n“Please don’t argue any more,” Laura said. “Let’s just get to the hotel and sit by the pool.”\nJack, Brad Lee’s son, is at the door. He’s shy and awkward, even though he has been coming by our house for months. I’ve known him since he was a baby, like I know all the children in town. There are so few of them left. The high school, operating out of the old Whistler House, has only twelve students.\n“Hello,” he mumbles, looking at the floor. “Lucy and I need to work on our report.” I step aside to let him pass on his way upstairs to Lucy’s room.\nI don’t need to remind him about the rules: door to the bedroom open, at least three of their four feet on the carpet at all times. I hear the indistinct sounds of their chatter and occasional laughter.\nThere is a kind of innocence to their courtship that was absent from my youth. Without the endless blast of cynical sexuality from TV and the real Internet, children can stay children longer.\nThere weren’t many doctors left near the end. Those of us who wanted to stay behind gathered into small communities, circling the wagons against the marauding bands of vandals who gorged themselves on pleasures of the flesh as the Uploaded left the physical world behind. I never got to finish college.\nMom lingered in her sickness for months. She was bedridden and drifted in and out of consciousness, her body pumped full of drugs that numbed her pain. We took turns sitting by her, holding her hand. When she had good days, temporary lulls of lucidity, there was only one topic of conversation.\n“No,” Mom said, wheezing. “You must promise me. This is important. I’ve lived a real life, and I will die a real death. I will not be turned into a recording. There are worse things than death.”\n“If you Upload,” Dad said, “you’ll still have a choice. They can suspend your consciousness, or even erase it, if you don’t like it after you try it. But if you don’t Upload, you’ll be gone forever. There’s no room for regret or return.”\n“If I do what you want,” Mom said, “I will be gone. There is no way to come back to this, to the real world. I will not be simulated by a bunch of electrons.”\n“Please stop,” Laura pleaded with Dad. “You’re hurting her. Why can’t you leave her alone?”\nMom’s moments of lucidity came further and further apart.\nThen that night: waking up to the sound of the front door closing, looking outside the window to see the shuttle on the lawn, tumbling down the stairs.\nThey were carrying Mom into the shuttle on a stretcher. Dad stood by the door of the gray vehicle, only a little bigger than a van, EVERLASTING, INC. painted on its side.\n“Stop!” I shouted over the sound of the shuttle’s engines.\n“There’s no time,” Dad said. His eyes were bloodshot. He hadn’t slept for days. None of us had. “They have to do it now before it’s too late. I can’t lose her.”\nWe struggled. He held me in a tight hug and wrestled me to the ground. “It’s her choice, not yours!” I screamed into his ear. He only held me tighter. I fought to free myself. “Laura, stop them!”\nLaura covered her eyes. “Stop fighting, all of you! She would have wanted all of you to stop.”\nI hated her for speaking as though Mom was already gone.\nThe shuttle closed its door and lifted into the air.\nDad left for Svalbard two days later. I refused to speak to him until the end.\n“I’m going to join her now,” he said. “Come as soon as you can.”\n“You killed her,” I said. He flinched at the words, and I was glad.\nJack has asked Lucy to the prom. I’m pleased that the kids have decided to hold one. It shows that they are serious about keeping alive the stories and traditions they’ve heard from their parents, legends from a world they have only experienced vicariously in old videos and old pictures.\nWe struggle to maintain what we can of the life from before: put on old plays, read old books, celebrate the old holidays, sing old songs. We’ve had to give up so much. Old recipes have had to be adapted for limited ingredients, old hopes and dreams shrunken to fit within tightened horizons. But every deprivation has also brought us closer as a community, to hold on tighter to our traditions.\nLucy wants to make her own dress. Carol suggests that she look through her old dresses first. “I have some formals left from when I was just a little older than you.”\nLucy is not interested. “They’re old,” she says.\n“They’re classic,” I tell her.\nBut Lucy is adamant. She cuts up her old dresses, curtains, scavenged tablecloths, and trades with the other girls for bits of fabric: silk, chiffon, taffeta, lace, plain cotton. She flips through Carol’s old magazines, looking for inspiration.\nLucy is a good seamstress, far better than Carol. The children are all skilled in trades long thought obsolete in the world I grew up in: knitting, woodworking, planting and hunting. Carol and I had to rediscover and learn these things from books when we were already adults, adapting to a suddenly changed world. But for the children, it is all they have known. They are natives here.\nAll the students at the high school have spent the last few months doing research in the Textile History Museum, investigating the possibility of weaving our own cloth, preparing for a time when the decaying ruins of the cities would run out of usable cloths for us to salvage. There is some poetic justice in this: Lowell, which once rose on the back of the textile industry, must now rediscover those lost arts on our gentle slide back down the technology curve.\nA week after Dad left, we received an email from Mom:\nI was wrong.\nSometimes, I’m nostalgic and sad. I miss you, my children, and the world we left behind. But I’m ecstatic most of the time, often incredulous.\nThere are hundreds of millions of us here, but there is no crowding. In this house there are countless mansions. Each of our minds inhabits its own world, and each of us has infinite space and infinite time.\nHow can I explain it to you? I can only use the same words so many others have already used. In my old existence, I felt life but dimly and from a distance, cushioned, constrained, tied down by the body. But now I am free, a bare soul exposed to the full tides of eternal Life.\nHow can speech compare to the intimacy of sharing with your father psyche to psyche? How can hearing about how much he loved me compare to actually feeling his love? To truly understand another person, to experience the texture of his mind—it is glorious.\nThey tell me that this sensation is called hyperreality. But I don’t care what it is called. I was wrong to cling so tightly to the comforts of an old shell made of flesh and blood. We, the real us, have always been patterns of electrons cascading across the abyss, the nothingness between atoms. What difference does it make if those electrons are in a brain or silicon chips?\nLife is sacred and eternal. But our old way of life was unsustainable. We demanded too much of our planet, of sacrifices made by every other living thing. I once thought that an unavoidable aspect of our existence, but it isn’t. Now, with the oil tankers aground, the cars and trucks still, the fields fallow and factories silent, the living world that we had made almost extinct will return.\nHumanity is not a cancer of the planet. We simply needed to transcend the demands of our inefficient bodies, machines no longer adequate for their task. How many consciousnesses will now live in this new world, pure creatures of electric spirit and weightless thought? There are no limits.\nCome join us. We cannot wait to embrace you again.\n-- Mom\nLaura cried as she read it. But I felt nothing. This wasn’t my mother speaking. The real Mom knew that what really mattered in life was the authenticity of this messy existence, the constant yearning for closeness to another despite imperfect understanding, the pain and suffering of our flesh.\nShe taught me that our mortality makes us human. The limited time given to each of us makes what we do meaningful. We die to make place for our children, and through our children a piece of us lives on, the only form of immortality that is real.\nIt is this world, the world we are meant to live in, that anchors us and demands our presence, not the imagined landscapes of a computed illusion.\nThis was a simulacrum of her, a recording of propaganda, a temptation into nihilism.\nCarol and I met on one of my earliest scavenging trips. Her family had been hiding in the basement of their house on Beacon Hill. A gang of vandals found them and killed her father and brother. They were about to start on her when we showed up. I killed a man-shaped animal that day, and I’m not sorry about it.\nWe brought her back to Lowell, and though she was seventeen, for days, she clung to me and would not let me out of her sight. Even when sleeping, she wanted me to be there, holding her hand.\n“Maybe my family made a mistake,” she said one day. “We would have been better off if we had Uploaded. There’s nothing but death left here now.”\nI didn’t argue with her. I let her follow me around as I went about my chores. I showed her how we were keeping the generator running, how we treated each other with respect, how we rescued old books and held onto old routines. There was still civilization in this world, kept alive like a candle flame. People did die, but people were also born. Life went on, sweet, joyful, authentic life.\nThen one day, she kissed me.\n“There’s also you in this world,” she said. “And that is enough.”\n“No, not enough,” I said. “We will also bring new life here.”\nTonight is the night.\nJack is at the door. He looks good in that tuxedo. It’s the same one I wore to my prom. They’ll play the same songs too, pumping the music from an old laptop and speakers on their last legs.\nLucy is splendid in her dress: white with black print, cut in a simple pattern, but very elegant. The skirt is wide and full-length, draping gracefully to the floor. Carol did her hair, curls with a hint of glitter. She looks glamorous, with a hint of childish playfulness.\nI take pictures with a camera, one that still mostly works.\nI wait until I’m sure I have my voice under control. “You have no idea how glad I am to see young people dancing, the way we used to.”\nShe kisses me on the cheek. “Goodbye, Dad.” There are tears in her eyes. And that makes everything go blurry for me again.\nCarol and Lucy embrace for a moment. Carol wipes her eyes. “You’re all set.”\n“Thanks, Mom.”\nThen Lucy turns to Jack. “Let’s go.”\nJack will take her to the Lowell Four Seasons on his bicycle. It’s the best that can be done since we’ve been without gasoline for many years. Lucy gingerly settles onto the top tube, sitting sideways, one hand holding her dress up. Jack wraps her in his arms protectively as he grabs the handles. And they are off, wobbling down the street.\n“Have fun,” I yell after them.\nLaura’s betrayal was the hardest to take.\n“I thought you were going to help me and Carol with the baby,” I said.\n“What kind of world is this to bring a child into?” Laura said.\n“And you think things will be better if you go there, where there are no children, no new life?”\n“We’ve tried to keep this going for fifteen years, and every year it becomes harder and harder to believe in this charade. Maybe we were wrong. We should adapt.”\n“It’s only a charade when you’ve lost faith,” I said.\n“Faith in what?”\n“In humanity, in our way of life.”\n“I don’t want to fight our parents any more. I just want us to be together again, a family.”\n“Those things aren’t our parents. They are imitation algorithms. You’ve always wanted to avoid conflict, Laura. But some conflicts cannot be avoided. Our parents died when Dad lost faith, when he couldn’t resist the false promises made by machines.”\nAt the end of the road into the woods was a little clearing, grassy, full of wildflowers. A shuttle was waiting in the middle. Laura stepped into the open door.\nAnother life lost.\nThe children have permission to stay out until midnight. Lucy had asked me not to volunteer as a chaperone, and I complied, conceding her this bit of space for the night.\nCarol is restless. She tries to read but she’s been on the same page for an hour.\n“Don’t worry.” I try to comfort her.\nShe tries to smile at me, but she can’t hide her anxiety. She looks up past my shoulder at the clock on the living room wall.\nI glance back too. “Doesn’t it feel later than 11?”\n“No,” Carol says. “Not at all. I don’t know what you mean.”\nHer voice is too eager, almost desperate. There’s a hint of fear in her eyes. She’s close to panicking.\nI open the door of the house and step into the dark street. The sky has grown clearer over the years, and many more stars are now visible. But I’m looking for the Moon. It’s not in the right place.\nI come back into the house and go into the bedroom. My old watch, one that I no longer wear because there are so few occasions when being on time matters, is in the nightstand drawer. I pull it out. It’s almost one in the morning. Someone had tampered with the living room clock.\nCarol stands in the door to the bedroom. The light is behind her so I can’t see her face.\n“What have you done?” I ask. I’m not angry, just disappointed.\n“She can’t talk to you. She doesn’t think you’ll listen.”\nNow the anger rises in me like hot bile.\n“Where are they?”\nCarol shakes her head, saying nothing.\nI remember the way Lucy said goodbye to me. I remember the way she walked carefully out to Jack’s bike, holding up her voluminous skirt, a skirt so wide that she could hide anything under it, a change of clothing and comfortable shoes for the woods. I remember Carol saying, “You’re all set.”\n“It’s too late,” Carol says. “Laura is coming to pick them up.”\n“Get out of the way. I have to save her.”\n“Save her for what?” Carol is suddenly furious. She does not move. “This is a play, a joke, a re-enactment of something that never was. Did you go to your prom on a bicycle? Did you play only songs that your parents listened to when they were kids? Did you grow up thinking that scavenging would be the only profession? Our way of life is long gone, dead, finished!\n“What will you have her do when this house falls apart in thirty years? What will she do when the last bottle of aspirin is gone, the last steel pot rusted through? Will you condemn her and her children to a life of picking through our garbage heaps, sliding down the technology ladder year after year until they’ve lost all the progress made by the human race in the last five thousand years?”\nI don’t have time to debate her. Gently, but firmly, I put my hands on her shoulders, ready to push her aside.\n“I will stay with you,” Carol says. “I will always stay with you because I love you so much that I’m not afraid of death. But she is a child. She should have a chance for something new.”\nStrength seems to drain from my arms. “You have it backwards.” I look into her eyes, willing her to have faith again. “Her life gives our lives meaning.”\nHer body suddenly goes limp, and she sinks to the floor, sobbing silently.\n“Let her go,” Carol says, quietly. “Just let her go.”\n“I can’t give up,” I tell Carol. “I’m human.”\nI pump the pedals furiously once I’m past the gate in the fence. The cone of light cast by the flashlight jumps around as I try to hold it against the handlebars. But I know this road into the woods well. It leads to the clearing where Laura once stepped into that shuttle.\nBright light in the distance, and the sound of engines revving up.\nI take out my gun and fire a few shots into the air.\nThe sound of the engines dies down.\nI emerge into the opening in the woods, under a sky full of bright, cold, pinprick stars. I jump off the bike and let it fall by the side of the path. The shuttle is in the middle of the clearing. Lucy and Jack, now in casual clothes, stand in the open doorway of the shuttle.\n“Lucy, sweetheart, come back out of there.”\n“Dad, I’m sorry. I’m going.”\n“No, you are not.”\nAn electronic simulation of Laura’s voice comes out of the shuttle’s speakers. “Let her go, brother. She deserves to have a chance to see what you refuse to see. Or, better yet, come with us. We’ve all missed you.”\nI ignore her, it. “Lucy, there is no future there. What the machines promise you is not real. There are no children there, no hope, only a timeless, changeless, simulated existence as fragments of a machine.”\n“We have children now,” the copy of Laura’s voice says. “We’ve figured out how to create children of the mind, natives of the digital world. You should come and meet your nephews and nieces. You are the one clinging to a changeless existence. This is the next step in our evolution.”\n“You can experience nothing when you are not human.” I shake my head. I shouldn’t take its bait and debate a machine.\n“If you leave,” I tell Lucy, “you’ll die a death with no meaning. The dead will have won. I can’t let that happen.”\nI raise my gun. The barrel points at her. I will not lose my child to the dead.\nJack tries to step in front of her, but Lucy pushes him away. Her eyes are full of sorrow, and the light from inside the shuttle frames her face and golden hair like an angel.\nSuddenly I see how much she looks like my mother. Mom’s features, having passed through me, have come alive again on my daughter. This is how life is meant to be lived. Grandparents, parents, children, each generation stepping out of the way of the next, an eternal striving towards the future, to progress.\nI think about how Mom’s choice was taken away from her, how she was not allowed to die as a human, how she was devoured by the dead, how she became a part of their ceaselessly looping, mindless recordings. My mother’s face, from memory, is superimposed onto the face of my daughter, my sweet, innocent, foolish Lucy.\nI tighten my grip on the gun.\n“Dad,” Lucy says, calmly, her face as steady as Mom’s all those years ago. “This is my choice. Not yours.”\nIt’s morning by the time Carol steps into the clearing. Warm sunlight through the leaves dapples the empty circle of grass. Dewdrops hang from the tips of the grass blades, in each a miniature, suspended, vision of the world. Birdsong fills the waking silence. My bike is still on the ground by the path where I left it.\nCarol sits down by me without speaking. I put my arm around her shoulders and pull her close to me. I don’t know what she’s thinking, but it’s enough for us to sit together like this, our bodies pressed together, keeping each other warm. There’s no need for words. We look around at this pristine world, a garden inherited from the dead.\nWe have all the time in the world.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.", "source": "https://clarkesworldmagazine.com/liu_10_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Staying Behind by Ken Liu"}