{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nancy Kress", "hostname": "clarkesworldmagazine.com", "date": "2002-05-08", "categories": "", "tags": "", "fingerprint": "WMO2CdyebTYJC7+9P271usiqTJQ=", "id": null, "license": null, "comments": "", "raw_text": "9130 words, novelette, REPRINT  The Most Famous Little Girl in the World  2002  The most famous little girl in the world stuck out her tongue at me. “These are all my Barbie dolls and you can’t use them!”  I ran to Mommy. “Kyra won’t share!”  “Kyra, dear,” Aunt Julie said in that funny tight voice she had ever since IT happened, “share your new dolls with Amy.”  “No, they’re mine!” Kyra said. “The news people gave them all to me!” She tried to hold all the Barbie dolls, nine or ten, in her arms all at once, and then she started to cry. She does that a lot now.  “Julie,” Mommy said, real quiet, “she doesn’t have to share.”  “Yes, she does. Just because she’s now some sort of . . . oh, God, I wish none of this had happened!” Then Aunt Julie was crying, too.  Grown ups aren’t supposed to cry. I looked at Aunt Julie, and then at stupid Kyra, still bawling, and then at Aunt Julie again. Nothing was right.  Mommy took me by the hand, led me into the kitchen, and sat me on her lap. The kitchen was all warm and there were chocolate-chip cookies baking, so that was good. “Amy,” Mommy said, “I want to talk to you.”  “I’m too big to sit on your lap,” I said.  “No, you’re not,” Mommy said, and held me closer, and I felt better. “But you are big enough to understand what happened to Kyra.”  “Kyra says she doesn’t understand it!”  “Well, in one sense that’s true,” Mommy said. “But you understand some of it, anyway. You know that Kyra and you were in the cow field, and a big spaceship came down.”  “Can I have a cookie?”  “They’re not done yet. Sit still and listen, Amy.”  I said, “I know all this! The ship came down, and the door opened, and Kyra went in and I was far away and I didn’t.” And then I called Mommy on the cell phone and she called 911 and people came running. Not Aunt Julie—Mommy was baby-sitting Kyra at Kyra’s house. But police cars and firemen and ambulances. The cars drove right into the cow field, right through cow poop. If the cows hadn’t been all bunched together way over by the fence, I bet the cars would have driven through the cows, too. That would have been kind of cool.  Kyra was in there a long time. The police shouted at the little spaceship, but it didn’t open up or anything. I was watching from an upstairs window, where Mommy made me go, through Uncle John’s binoculars. A helicopter came but before it could do anything, the spaceship door opened and Kyra walked out and policemen rushed forward and grabbed her. And then the spaceship just rose up and went away, passing the helicopter, and ever since everybody thinks Kyra is the coolest thing in the world. Well, I don’t.  “I hate her, Mommy.”  “No, you don’t. But Kyra is getting all the attention and—” She sighed and held me tighter. It was nice, even though I’m too big to be held tight like that.  “Is Kyra going to go on TV?”  “No. Aunt Julie and I agreed to keep both of you off TV and magazines and whatever.”  “Kyra’s been on lots of magazines.”  “Not by choice.”  “Mommy,” I said, because it was safe sitting there on her lap and the cookies smelled good, “what did Kyra do in the spaceship?”  Her chest got stiff. “We don’t know. Kyra can’t remember. Unless . . . unless she told you something, Amy?”  “She says she can’t remember.”  I twisted to look at Mommy’s face. “So how come they still send presents? It was last year!”  “I know.” Mommy put me on the floor and opened the oven to poke at the cookies. They smelled wonderful.  “And,” I demanded, “how come Uncle John doesn’t come home anymore?”  Mommy bit her lip. “Would you like a cookie, Amy?”  “Yes. How come?”  “Sometimes people just—”  “Are Aunt Julie and Uncle John getting a divorce? Because of Kyra?”  “No. Kyra is not responsible here, and you just remember that, young lady! I don’t want you making her feel more confused than she is!”  I ate my cookie. Kyra wasn’t confused. She was a cry-baby and a Barbie hog and I hated her. I didn’t want her to be my cousin anymore.  What was so great about going into some stupid spaceship, anyway? Nothing. She couldn’t even remember anything about it!  Mommy put her hands over her face.  2008  Whispers broke out all over the cafeteria. “That’s her . . . her . . . her!”  Oh, shit. I bent my head over my milk. Last year the cafeteria used to serve fizzies and Coke and there were vending machines with candy and chips, but the new principal took all that out. He’s a real bastard. Part of the “Clean Up America” campaign our new president is forcing down our throats, Dad said. Only he didn’t say “forcing” because he thinks it’s cool, like all the Carter Falls High parents do. Supervision for kids. School uniforms. Silent prayer. A mandatory class in citizenship. Getting expelled for everything short of breathing. It all sucks.  “It is her,” Jack said. “I saw her picture online.”  Hannah said, “What do you suppose they really did to her in that ship when she was a little kid?”  Angie giggled and licked her lips. She has a really dirty mind. Carter, who’s sort of a goody-goody even though he’s on the football team, said, “It’s none of our business. And she was just a little kid.”  “So?” Angie smirked. “You never heard of pedophiles?”  Hannah said, “Pedophile aliens? Grow up, Angie.”  Jack said, “She’s kind of cute.”  “I thought you wanted a virgin, Jack,” Angie said, still smirking.  Carter said, “Oh, give her a break. She just moved here, after all.”  I watched Kyra walk uncertainly toward the cafeteria tables. The monitors were keeping a close eye on everybody. We have monitors everywhere, just like the street has National Guard everywhere. Clean up America, my ass. Kyra squinted; she’s near-sighted and doesn’t like to wear her contacts because she says they itch. I ducked lower over my milk.  Angie said, “Somebody told me Kyra Lunden is your cousin.”  Everybody’s head jerked to look at me. Damn that bitch Angie! Where had she heard that? Mom had promised me that nobody in school would know and Kyra wouldn’t say anything! She and Aunt Julie had to move, Mom and Dad said, because Aunt Julie was having a rough time since the divorce and she needed to be close to her sister, and I should understand that. Well, I did, I guess, but not if Kyra blasted in and ruined everything for me. This was my school, not hers, I spent a lot of time getting into the good groups, the ones I was never part of in junior high, and no pathetic famous cousin was going to wreck that. She couldn’t even dance.  Jack said, “Kyra Lunden is your cousin, Amy? Really?”  “No,” I said. “Of course not.”  Angie said, “That’s not what I heard.”  Carter said, “So it’s just gossip? You can hurt people that way, Angie.”  “God, Carter, don’t you ever let up? Holier-than-thou!”  Carter mottled red. Hannah, who likes him even though Carter doesn’t know it, said, “It’s nice that some people at least try to be kind to others.”  “Spit it in your soup, Hannah,” Angie said.  Jack and Hannah exchanged a look. They really make the decisions for the group, and for a bunch of other groups, too. Angie’s too stupid to realize that, or to realize that she’s going to be oozed out. I don’t feel sorry for her. She deserves it, even if being oozed is really horrible. You walk through the halls alone, and nobody looks directly at you, and people laugh at you behind your back because you can’t even keep your own friends. Still, Angie deserves it.  Hannah looked at me straight, with that look Jack calls her “police interrogation gaze.”  “Amy, is Kyra Lunden your cousin?”  Kyra sat alone at one end of a table. A bunch of kids, the really cobra ones that run the VR lab, sat at the other end, kind of laughing at her without laughing. I saw Eleanor Murphy, who was elected Queen of VR Gala even though she’s only a junior, give Kyra a long cool level look and then turn disdainfully away.  “No,” I said, “I already told you. She’s not my cousin. In fact, I’ve never even met her.”  2018  I stared at the villa with disbelief. Not at the guards—everywhere rich is guarded now, we’re a nation of paranoids, perhaps not without reason. There seems no containing the lunatic terrorists, home-grown patriotic militias, White Supremacists, and Black Equalizers, not to mention the run-of-the-mill gangs and petty drug lords and black-market smugglers. Plus, of course, the government’s response to these, which sometimes seems to involve putting every single nineteen-year-old in the country out on the streets in camouflage—except, of course, those nineteen-year-olds who are already bespoken as lunatic terrorists, home-grown militia, White Supremacists, et al. The rest of us get on with our normal lives.  So the guards didn’t surprise me—the villa did. It was a miniaturized replica of a Forbidden City palace—in Minnesota.  The chief guard caught me gaping at the swooping curved roof, the gilded archways, the octagonal pagoda. “Papers, please?”  I pulled myself together and looked professional, which is to say, not desperate. I was desperate, of course. But not even Kyra was going to know that.  “I am Madame Lunden’s cousin,” I said formally, “Amy Parker. Madame Lunden is expecting me.”  Forget inscrutable Chinese—the guard looked as suspicious as if I’d said I was a Muslim Turkic Uighur. He examined me, he examined my identity card, he ran the computer match on my retina scan. I walked through metal detectors, explosive residue detectors, detector detectors. I was patted down thoroughly but not obscenely. Finally he let me through the inner gate, watching me all the way through the arch carved with incongruous peacocks and dragons.  Kyra waited in the courtyard beyond the arch. She wore an aggressively fashionable blue jumpsuit with a double row of tiny mirrors sewn down the front. Her hair was dyed bright blonde and cut in the sharp asymmetrical cut popularized by that Dutch online model, Brigitte. In the traditional Chinese courtyard, set with flowering plum trees in porcelain pots and a pool with golden carp, she looked either ridiculous or exotic, depending on your point of view. Point of view was why I was here. We hadn’t seen each other in eight years.  “Hello, Amy,” Kyra said in her low, husky voice.  “Hello, Kyra. Thank you for seeing me.”  “My pleasure.”  Was there mockery in her tone? Probably. If so, I’d earned it. “How is Aunt Julie?”  “I have no idea. She refuses to have any contact with me.”  My eyes widened; I hadn’t known that. I should have known that. A good journalist does her homework. Kyra smiled at me, and this time there was no mistaking the mockery. I had stepped in it, and oh God, I couldn’t afford to ruin this interview. My job depended on it. Staff was being cut, and Paul had not axed me only because I said, with the desperation of fear, Kyra Lunden is my cousin. I know she’s refused all other interviews, but maybe . . .  Kyra said, “Sit down, Amy. Shall we start? Which service do you write for, again?”  “Times online.”  “Ah, yes. Well, what do you want to know?”  “I thought we’d start with some background. How did you and General Chou meet?”  “At a party.”  “Oh. Where was the party held?” She wasn’t going to help me at all.  Kyra crossed her legs. The expensive blue fabric of the jumpsuit draped becomingly. She looked fabulous; I wondered if she’d had any body work done. But, then, she’d always been pretty, even when she’d been ten and the most famous little girl in the world, blinking bewildered into the clunky TV equipment of sixteen years ago. My robocam drifted beside me, automatically recording us from the most flattering angles.  “The party was at Carol Perez’s,” Kyra said, naming a Washington hostess I’d only seen in the society programs. “I’d met Carol at Yale, of course. I met a lot of people at Yale.”  Yes, she did. By college, Kyra had lost her shyness about what had happened to her when we were ten. She’d developed what sounded like a superb act—we had mutual friends—composed of mystery combined with notoriety. Subtly she reminded people that she had had an experience unique to all of mankind, never duplicated since, and that although she was reluctant to talk about it, yes, it was true that she was undergoing deep hypnosis and it was possible she might remember what actually happened.  By her junior year, she’d “remembered.” Tastefully, shyly, nothing to make people label her a lunatic. The aliens were small and bipedal, they’d put a sort of helmet on her head and she’d watched holograms while, presumably, they recorded her reactions. No, she couldn’t remember any specifics. Not yet, anyway.  Yale ate it up. Intellectuals, especially political types, debated the aliens’ intentions in terms of future United States policy. Artsy preppies’ imaginations were stirred. Socialites decided that Kyra Lunden was an interesting addition to their parties. She was in.  “Carol’s party was at their Virginia home,” Kyra continued. “Diplomats, horse people, the usual. Ch’un-fu and I were introduced, and we both knew right away this could be something special.”  I peered at her. Could she really be that naive? Chou Ch’un-fu had already had two American mistresses. The Han Chinese, Chou’s party, and the United States were now allies, united in their actions against terrorists from the western part of China, the Muslim Turkic Uighurs, who were destabilizing China with their desperate war for independence. The Uighurs would lose. Everyone knew this, probably even the Uighurs. But until they did, they were blowing up things in Peking and Shanghai and San Francisco and London, sometimes in frantic negotiation for money, sometimes with arrogant political manifestos, sometimes, it seemed, out of sheer frustration. The carnage, even in a century used to it, could make a diplomat pale. General Chou was experienced in all this. Press drudges like me don’t get insider data, but rumor linked him with some brutal actions. He maintained a home in Minnesota because it was easy to reach on the rocket flights over the pole.  And Kyra believed they had a “special” romantic relationship?  Incredibly, it seemed she did. As she talked about their meeting, about her life with Chou, I saw no trace of irony, of doubt, of simple confusion. Certainly not of anything approaching shame. I did detect anger, and that was the most intriguing thing about her demeanor. Who was she angry with? Chou? Her mother, that straight-laced paragon who had rejected her? The aliens? Fate?  She deflected all political questions. “Kyra, do you approve of the way the Chinese-American alliance is developing?”  “I approve of the way my life is developing.” Tinkly laugh, undercut with anger.  We toured the villa, and she let me photograph everything, even their bedroom. Huge canopied bed, carved chests, jars of plum blossoms. Chou, or some PR spinner, had decided that a Chinese political partner should appear neither too austere nor too American. China’s past was honored in her present, even as she looked toward the future—that was clearly the message I was to get out. I recorded everything. Kyra said nothing as we toured, usually not even looking at me. She combed her hair in front of her ornate carved mirror, fiddled with objects, sat in deep reverie. It was as if she’d forgotten I was there.  Kyra’s silence broke only as she escorted me to the gate. Abruptly she said, “Amy, do you remember Carter Falls High? The VR Gala?”  “Yes,” I said cautiously.  “You and I and our dates were in the jungle room. There was a virtual coconut fight. I tossed a coconut at you, it hit, and you pretended you didn’t even see it.”  “Yes,” I said. Out of all the shunning I’d done to her in those horrible, terrified, cruel teenage years, she picked that to recall!  “But you did see it. You knew I was there.”  “Yes. I’m sorry, Kyra.”  “Don’t worry about it,” she said, with such a glittering smile that all at once I knew who her anger was directed at. She had given me this interview out of old family ties, or a desire to show off the superiority of our relative positions, or something, but she was angry at me. And always would be.  “I’m sorry,” I said again, with spectacular inadequacy. Kyra didn’t answer, merely turned and walked back toward her tiny Forbidden City.  My story was a great success. The Times ran it in flat-screen, 3D, and VR, and its access rate went off the charts. It was the first time anyone had been inside the Chou compound, had met the American girlfriend of an enigmatic general, had seen that particular lifestyle up close. Kyra’s mysterious encounter with aliens sixteen years ago gave it a unique edge. Even those who hated the story—and there were many, calling it exploitative, immoral, decadent, symptomatic of this or that—noticed it. My message system nearly collapsed under the weight of congratulations, condemnations, job offers.  The next day, Kyra Lunden called a press conference. She denied everything. I had been admitted to the Chou villa, yes, but only as a relative, for tea. Our agreement had been no recorders. I had violated that, had recorded secretly, and furthermore had endangered Chinese-American relations. Kyra had tears in her eyes. The Chinese Embassy issued an angry denunciation. The State Department was not pleased.  The Times fired me.  Standing in my apartment, still surrounded by the masses of flowers that had arrived yesterday, I stared at nothing. The sickeningly sweet fragrances made me queasy. Wild ideas, stupid ideas, rioted in my head. I could sue. I could kill myself. Kyra really had been altered by the aliens. She was no longer human, but a VR-thriller simulacrum of a human, and it was my duty to expose her.  All stupid. Only one idea was true.  Kyra had, after all these years, found a way to get even.  2027  In the second year of the war, the aliens came back.  David told me while I was bathing the baby in the kitchen sink. The twins, Lucy and Lem, were shrieking around the tiny apartment like a pair of banshees. It was a crummy apartment, but it wasn’t too far from David’s job, and we were lucky to get it. There was a war on.  “The Blanding telescope has picked up an alien ship heading for Earth.” David spoke the amazing sentence flatly, the way he speaks everything to me now. It was the first time he’d initiated conversation in two weeks.  I tightened my grip on Robin, a wriggler slippery with soap, and stared at him. “When . . . how . . . ”  “It would be good, Amy, if you could ever finish a sentence,” David said, with the dispassionate hypercriticism he brings these days to everything I say. It wasn’t always like this. David wasn’t always like this. Depression, his doctor told me, unfortunately not responding to available medications. Well, great, so David’s depressed. The whole country’s depressed. Also frightened and poor and gray-faced with anxiety about this unpredictable war’s bio-attacks and Q-bomb attacks and EMP attacks, all seemingly random. We’re all depressed, but not all of us take it out on the people we live with.  I said with great deliberation, “When did the Blanding pick up the aliens, and do the scientists believe they’re the same aliens that came here in July of 2002?”  “Yesterday. Yes. You should either bathe Robin or not bathe him, instead of suspending a vital parental job in the middle like that.” He left the room.  I rinsed Robin, wrapped him in a large, gray-from-age towel, and laid him on the floor. He smiled at me; such a sweet-natured child. I gave Lucy and Lem, too frenetic for sweetness, a hoarded cookie each, and turned on the Internet. The Trumpeter avatar, whom someone had designed to subtly remind viewers of Honest Abe Lincoln, was in the middle of the story, complete with what must have been hastily assembled archival footage from obsolete media.  There was the little pewter-colored spaceship in my Uncle John’s cow field twenty-five years ago, and Kyra walking out with a dazed look on her small face. God—she’d been only a few years older than Lucy and Lem. There was the ship lifting straight up, passing the Army helicopter. That time, no watching telescopes or satellites had detected a larger ship, coming or going . . . either our technology was better now, or the aliens had a different game plan. Now the screen showed pictures from the Blanding, which looked like nothing but a dot in space until computers enhanced it, surrounded it with graphics, and “artistically rendered” various imaginary appearances and routes and speculations. In the midst of the hype given somberly in Abraham Lincoln’s “voice,” I gathered that the ship’s trajectory would intersect with the same cow pasture as last time—unless, of course, it didn’t—and would arrive at Earth in thirteen hours and seven minutes.  A Chinese general appeared on screen, announcing in translation that China was prepared to shoot the intruder down.  “Mommy!” Lucy shrieked. “My cookie’s gone!”  “Not now, honey.”  “But Lem gots some of his cookie and he won’t share!”  “In a minute!”  “But Mommy—”  The Internet abruptly cut out. The Internet.  Into the shocking, eerie silence came Lem’s voice, marginally quieter than his sister’s. “Mommy. I hear some sirens.”  Three days of chaos. I had never believed panic—old-style Roman rioting in the streets, totally out of control, murderous panic—could happen in the United States, in gray cities like Rochester, New York. Yes, there were periodic race riots in Atlanta and looting spells in New York or war hysteria in San Francisco, but the National Guard quickly contained them in neighborhoods where violence was a way of life anyway. But this panic took over the whole city in a cold February and watching on the Internet, when a given site’s coverage was up anyway, was to know a surreal horror. This was supposed to be America.  People were publicly beheaded on the lawns of the art museum, their breath frozen on the winter air a second before the blood leapt from their severed heads toward the camera. No one could say why they were being executed, or even if there was a reason. Buildings that the National Guard had protected from being bombed by Chinese terrorists were bombed by crazed Americans. Anyone Chinese-American, or appearing Chinese-American, or rumored to be Chinese-American, was so savagely assaulted that the fourteenth century would have been disgusted. A dead, mangled baby was thrown onto our fourth-floor fire escape, where it lay for the entire three days, pecked at by crows.  I kept the children huddled in the bathroom, which had no windows to shatter. Or see out of. The electricity went off, then on, then off for good. The heat ceased. David stayed by the living room window in case the building caught fire and we had no choice but to evacuate. Even during this horror he belittled and criticized: “If you’d had more food stockpiled, Amy, maybe the kids wouldn’t have to have cereal again.” “You never were any good at keeping them soothed and quiet.”  Soothed and quiet. The crows on the fire escape had plucked out the dead infant’s eyes.  Whenever Lucy, Lem, and Robin were finally asleep, I turned on the radio. The riots were coming under control. No, they weren’t. The President was dead. No, he wasn’t. The President had declared martial law. Massive bio-weapons had been unleashed in New York. No, in London. No, in Peking. The Chinese were behind these attacks. No, the Chinese were having worse riots than we were, their present chaos merging with their previous chaos of civil war. It was that civil war that had broken the American-Chinese alliance three years ago. And then during their civil upheavals, the Chinese had attacked Alaska. Maybe. Not even the international intelligence network was completely sure who’d released the bubonic-plague-carrying rats in Anchorage. But, announced the White House, the excesses of China had become too much for the Western world to stomach.  I didn’t see how those excesses could be worse than this.  And then it was over. The Army prevailed. Or maybe the chaos, self-limiting as some plagues, just ran its course. Everyone left alive was immune. After another week, David and I—but not the kids—emerged from our building into the rubble to start rebuilding some sort of economic and communal existence. We never left the children alone, but even so David had found an isolated moment to say, resentment in every line of his body, “You’re the one who wanted to have children. I don’t know how much longer I can go on paying for your bad judgment.”  It was then that I got the email from Kyra.  “Why did you come?” Kyra asked me.  We faced each other in a federal prison in the Catskill Mountains northeast of New York City. The prison, built in 2022, was state-of-the-art. Nothing could break in or out, including bacteria, viruses, and some radiation. The Kyra sitting opposite me, this frightened woman, was actually two miles away, locked in some cell that probably looked nothing like the hologram of her I faced in the Visitors’ Center.  I said slowly, “I can’t say why I came.” This was the truth. Or, rather, I could say but only with so much mixed motive that she would never understand. Because I had to get away from David for these two days. Because the childhood she and I shared, no matter how embittered by events, nonetheless looked to me now like Arcadia. Because I wanted to see Kyra humbled, in pain, as she had once put me. Because I had some insane idea, as crazy as the chaos we had lived through two weeks ago, that she might hold a key to understanding the inexplicable. Because.  She said, “Did you come to gloat?”  “In part.”  “All right, you’re entitled. Just help me!”  “To tell the truth, Kyra, you don’t look like you need all that much help. You look well-fed, and bathed, and safe enough behind these walls.” All more than my children were. “When did you land in here, anyway?”  “They put me in the second the alien ship was spotted.” Her voice was bitter.  “On what charges?”  “No charges. I’m a detainee for the good of the state.”  I said levelly, “Because of the alien ship or because you slept with the Chinese enemy?”  “They weren’t the enemy then!” she said angrily, and I saw that my goading was pushing her to the point where she wanted to tell me to fuck off. But she didn’t dare.  She didn’t look bad. Well-fed, bathed, as I’d said. No longer pretty, however. Well, it had been nine hard years since I’d seen her. That delicate skin had coarsened and wrinkled much more than mine, as if she’d spent a lot of time in the sun. The hair, once blazingly blonde, was a dull brown streaked with gray. My Aunt Julie, her mother, had died five years ago in a traffic accident.  “Amy,” she said, visibly controlling herself, “I’m afraid they’ll just quietly keep me here forever. I don’t have any ties with the Chinese any more, and I don’t know anything about or from that alien ship. I was just living quietly, under an alias, and then they broke in to my apartment in the middle of the night and cuffed me and brought me here.”  “Why don’t you contact General Chou?” I said cruelly.  Kyra only looked at me with such despair that I despised her. She was, had always been, a sentimentalist. I remembered how she’d actually thought that military monster loved her.  “Tell me what happened since 2018,” I said, and watched her seize on this with desperate hope.  “After your news story came out and—I’m sorry, Amy, I . . . ”  “Don’t,” I said harshly, and she knew enough to stop.  “I left Chun’fu, or rather he threw me out. It hit me hard, although I guess I was pretty much a fool not to think he’d react that way, not to anticipate—” She looked away, old pain fresh on her face. I thought that “fool” didn’t begin to cover it.  “Anyway, I had some old friends who helped me. Most people wanted nothing to do with me, but a few loyal ones got me a new identity and a job on a lobster farm on Cape Cod. You know, I liked it. I’d forgotten how good it can feel to work outdoors. It was different from my father’s dairy farm, of course, but the wind and the rain and the sea . . . ” She trailed off, remembering things I’d never seen.  “I met a lobster farmer named Daniel and we lived together. I never told him my real name. We had a daughter, Jane.”  I thought I’d seen pain on her face before. I’d been wrong.  I said, and it came out gentle, “Where are Daniel and Jane now?”  “Dead. A bio-virus attack. I didn’t think I could go on after that, but of course I did. People do. Are you married, Amy?”  “Yes. I hate him.” I hadn’t planned on saying that. Something in her pain drew out my own. Kyra didn’t look shocked.  “Kids?”  “Three wonderful ones. Five-year-old twins and a six-month-old.”  She leaned forward, like a plant hungry for sun. “What are their names?”  “Lucy. Lem. Robin. Kyra . . . how do you think I can help you?”  “Write about me. You’re a journalist.”  “No, I’m not. You ended my career.” Did Kyra really not know that?  “Then call a press conference. Send data to the news outlets. Write letters to Congress. Just don’t let me rot here indefinitely because they don’t know what to do with me!”  She really had no idea how things worked. Still an innocent. I wasn’t ready yet to tell her that all her anguish was silly. Instead I said, “Did the aliens communicate with you from their ship in some way?”  “Of course not!”  “The ship left, you know.”  From her face, it was clear she didn’t know. “They left?”  “Two weeks ago. Came no closer than the moon. If we had any sort of decent space program left, if anyone did, we might have tried to contact them. But they just observed us, or whatever, from that distance, then took off again.”  “Fuck them to bloody hell! I wish we had shot them down!”  She had surprised me, with both the language—Kyra had always been a bit prissy, despite her sexual adventures—and the hatred. My surprise must have shown on my face.  “Amy,” Kyra said, “they ruined my life. Without that abduction—” the word didn’t really seem appropriate—“when I was ten, my parents would never have divorced. I wouldn’t have been an outcast in school. I never would have met Chou, or behaved like . . . and I certainly wouldn’t be in this fucking prison now! They came here to ruin my life and they succeeded!”  “You take no responsibility for anything,” I said evenly.  Kyra glared at me. “Don’t you dare judge me, Amy. You with your beautiful living children and your life free of any suspicion that you’re somehow deformed and dangerous because of a few childhood hours you can’t even remember—”  “‘Can’t remember’? What about the helmet and the flickering images and the observing aliens? Did you make those all up, Kyra?”  Enraged, she lunged forward to slap me. There was nothing there, of course. We were only virtually together. I stood to leave my half of the farce.  “Please, Amy . . . please! Say you’ll help me!”  “You’re a fool, Kyra. You learn nothing. Do you think the prison officials would be letting you have this ‘meeting’ with me if they were going to keep you here hidden away for good? Do you think you’d even have been permitted to send me email? You’re as good as out already. And when you are, try this time to behave as if you weren’t still ten years old.”  We parted in contempt and anger. I hoped to never see or hear from her again.  2047  The next time the aliens returned, they landed.  I was at JungleTime Playland with my granddaughter, Lehani. She loved JungleTime Playland. I was amused by it; in the long, long rebuilding after the war, VR had finally reached the commercial level that Robin and Lucy and Lem, Lehani’s father, had also played in. Of course, government applications of VR and holo and AI were another matter, but I had nothing to do with those. I led a very small, contented life.  “I go Yung Lan,” Lehani said, looking up at me with the shining, whole-hearted hope of the young on her small face. Every wish granted is paradise, every wish crushed is eternal disappointment.  “Yes, you can go into JungleLand, but we have to wait our turn, dear heart.”  So she stood in line beside me, hopping from foot to foot, holding my hand. Nobody ever told me grandmotherhood was going to be this sweet.  When we finally reached the head of the line, I registered her, put the tag on her neck that would keep me informed of her every move as well as the most minute changes in her skin conductivity. If she got scared or inattentive, I would know it. No adults are allowed in Jungle Playland; that would spoil the thrill. Lehani grinned and ran through the virtual curtain. I accepted the map tuned to her tag and sat at a table in the lobby, surrounded by lines of older children registering for the other VR playlands.  Sipping tea, I was checking my email when the big lobby screen abruptly came on.  “News! News! An alien ship has been sighted moving toward Earth. Government sources say it resembles the ship that landed in Minnesota in 2002 and traveled as far as lunar orbit in 2027 but so far no—”  People erupted all around me. Buzzing, signaling for their children, and, in the case of one stupid woman, pointless shrieking. Under cover of the noise I comlinked Central, before the site was hopelessly jammed.  “Library,” I keyed in. “Public Records, State of Maine. Data search.”  “Search ready,” the tiny screen said.  “Death certificate, first name Daniel, same date as death certificate, first name Jane, years 2020 through 2026.”  “Searching.”  Children began to pour out of the playlands, most resentful at having their VR time interrupted. Kyra had never told me Daniel’s last name. Nor did I have any idea what name she was using now. But if she simply wanted to pass unnoticed among ordinary people, his name would do, and Kyra had always been sentimental. The government, of course, would know exactly where she was, but they would know that no matter what name she used or what paper trails she falsified. Her DNA was on record. The press, too, could track her down if they decided to take the trouble. The alien landing meant they would take the trouble.  My handheld displayed, “Daniel Ethan Parmani, died June 16, 2025, age forty-two, and Jane Julia Parmani, died June 16, 2025, age three.”  “Second search. United States. Locate Kyra Parmani, ages—” What age might Kyra think she could pass for? In prison, twenty years ago, she had looked far older than she was. “Ages fifty through seventy.”  “Searching.”  Lehani appeared at the JungleLand door, looking furious. She spied me and ran over. “Lady sayed I can’t play!”  “I know, sweetie. Come sit on Grandma’s lap.”  She climbed onto me, buried her head in my shoulder, and burst into angry tears. I peered around her to see the handheld.  “Six matches.” It displayed them. Six? With a name like “Parmani” coupled with one like “Kyra”? I sighed and shifted Lehani’s weight.  “Call each of them in turn.”  Kyra was the second match. She answered the call herself, her voice unconcerned. She hadn’t heard. “Hello?”  “Kyra. It’s Amy, your cousin. Listen, they’ve just spotted an alien ship coming in. They’ll be looking for you again.” Silence on the other end. “Kyra?”  “How did you find me?”  “Lucky guesswork. But if you want to hide, from the feds or the press . . . ” They might put her in jail again, and who knew this time when she would get out? At the very least, the press would make her life, whatever it was now, a misery. I said, “Do you have somewhere to go? Some not-too-close-but-perfectly-trusted friend’s back bedroom or strange structure in a cowfield?”  She didn’t laugh. Kyra never had had much of a sense of humor. Not that this was an especially good time for joking.  “Yes, Amy. I do. Why are you warning me?”  “Oh, God, Kyra, how do I answer that?”  Maybe she understood. Maybe not. She merely said, “All right. And thanks. Amy . . . ”  “What?”  “I’m getting married again. I’m happy.”  That was certainly like her: blurting out the personal that no one had asked about. For a second I, too, was the old Amy, bitter and jealous. I had not remarried since my terrible divorce from David, had not even loved any one again. I suspected I never would. But the moment passed. I had Robin and Lem and Lehani and, intermittently when she was in the country, Lucy.  “Congratulations, Kyra. Now get going. They can find you in about forty seconds if they want to, you know.”  “I know. I’ll call you when this is all over, Amy. Where are you?”  “Prince George’s County, Maryland. Amy Suiter Parker. Bye, Kyra.” I broke the link.  “Who on link?” Lehani demanded, apparently having decided her tears were not accomplishing anything.  “Somebody Grandma knew a long time ago, dear heart. Come on, let’s go home, and you can play with Mr. Grindle’s cat.”  “Yes! Yes!”  It is always so easy to distract the uncorrupted.  The alien ship parked itself in lunar orbit for the better part of three days. Naturally we had no one up there; not a single nation on Earth had anything you could call a space program any more. But there were satellites. Maybe we communicated with the aliens, or they with us, or maybe we tried to destroy them, or entice them, or threaten them. Or all of the above, by different nations with different satellites. Ordinary citizens like me were not told. And of course the aliens could have been doing anything with their ship: sampling broadcasts, scrambling military signals, seeding clouds, sending messages to true believers’ back teeth. How would I know?  On the second day, three agents from People’s Safety Commission, the latest political reincarnation of that office, showed up to ask me about Kyra’s whereabouts. I said, truthfully, that I hadn’t seen her in twenty years and had no idea where she was now. They thanked me politely and left. News cams staked out her house, a modest foamcast building in a small Pennsylvania town, and they dissected her current life, but they never actually found her, so it made a pretty lackluster story.  After three days of lunar orbit, a small alien craft landed on the upland savanna of East Africa. Somehow it sneaked past whatever surveillance we had as if it didn’t exist. The ship set down just beyond sight of a Kikuyu village. Two small boys herding goats spotted it, and one of them went inside.  By the time the world learned of this, from a call made on the village’s only comlink, the child was already inside the alien ship. News people and government people raced to the scene. East Africa was in its usual state of confused civil war, incipient drought, and raging disease. The borders were theoretically sealed. This made no difference whatsoever. Gunfire erupted, disinformation spread, ultimata were issued. The robocams went on recording.  “Does it look the same as the ship you saw?” Lem said softly, watching the news beside me. His wife Amalie was in the kitchen with Lehani. I could hear them laughing.  “It looks the same.” Forty-five years fell away and I stood in Uncle John’s cow field, watching Kyra walk into the pewter-colored ship and walk out the most famous little girl in the world.  Lem said, “What do you think they want?”  I stared at him. “Don’t you think I’ve wondered that for four and a half decades? That everyone has wondered that?”  Lem was silent.  A helicopter appeared in the sky over the alien craft. That, too, was familiar—until it set down and I grasped its huge size. Troops began pouring out, guns were leveled, and orders barked. A newsman, maybe live but probably virtual, said, “We’re being ordered to shut down all reporting on this—” He disappeared.  A black cloud emanated from the helicopter, but not before a robocam had shown more equipment being off-loaded. Lem said, “My God, I think that’s a bombcase!” Through the black cloud ripped more gunfire.  Then no news came through at all.  The stories conflicted wildly, of course. At least six different agencies, in three different countries, were blamed. A hundred and three people died at the scene, and uncounted more in the senseless riots that followed. One of the dead was the second little boy that had witnessed the landing.  The first child went up with the ship. It was the only picture that emerged after the government erected visual and electronic blockage: the small craft rising unharmed above the black cloud, ascending into the sky and disappearing into the bright African sunlight.  The Kikuyu boy was released about a hundred miles away, near another village, but it was a long time before ordinary people learned that.  Kyra never called me after the furor had died down. I searched for her, but she was more savvy about choosing her aliases. If the government located her, and I assumed they did, no one informed me.  Why would they?  2075  Sometimes the world you want comes too late.  It was not really the world anyone wanted, of course. Third world countries, especially but not exclusively in Africa, were still essentially ungovernable. Fetid urban slums, disease, and terror from local warlords. Daily want, brutality, and suffering, all made orders of magnitude worse by the lunatic compulsion to genocide. Much of the globe lives like this, with little hope of foreseeable change.  But inside the United States’ tightly guarded, expensively defended borders, a miracle had occurred. Loaves from fishes, something for nothing, the free lunch there ain’t supposed to be one of. Nanotechnology.  It was still an embryonic industry. But it had brought burgeoning prosperity. And with prosperity came the things that aren’t supposed to cost money but always do: peace, generosity, civility. And one more thing: a space program, the cause of all the news agitation I was pointedly not watching.  “It’s not fair to say that nano brought civility,” Lucy protested. She was back from a journalism assignment in Sudan that had left her gaunt and limping, with half her hair fallen out. Lucy didn’t volunteer details and I didn’t ask. From the look in her haunted eyes, I didn’t think I could bear to hear her answers.  “Civility is a by-product of money,” I said. “Starving people are not civil to each other.”  “Sometimes they are,” she said, looking at some painful memory I could not imagine.  “Often?” I pressed.  “No. Not often.” Abruptly Lucy left the room.  I have learned to wait serenely until she’s ready to return to me, just as she has learned to wait, less serenely, until she is ready to return to those parts of the world where she makes her living. My daughter is too old for what she does, but she cannot, somehow, leave it alone. Injured, diseased, half bald, she always goes back.  But Lucy is partly right. It isn’t just America’s present riches that have led to her present civility. This decade’s culture—optimistic, tolerant, fairly formal—is also a simple backlash to what went before. Pendulums swing. They cannot not swing.  While I waited for Lucy, I returned to my needlepoint. Now that nano has begun to easily make us anything, things that are hard to make are back in fashion. My eyes are too old for embroidery or even petit point, but gros point I can do. Under my fingers, roses bloomed on a pair of slippers. A bird flew to the tree beside me, lit on a branch, and watched me solemnly.  I’m still not used to birds in the house. But, then, I’m not used to this house of my son’s, either. All the rooms open into an open central courtyard two stories high. Atop the courtyard is some sort of invisible shield that I don’t understand. It keeps out cold and insects, and it can be adjusted to let rain in or keep it out. The shield keeps in the birds who live here. What Lem has is a miniature, climate-controlled, carefully landscaped, indoor Eden. The bird watching me was bright red with an extravagant gold tail, undoubtedly genetically engineered for health and long life. Other birds glow in the dark. One has what looks like blue fur.  “Go away,” I told it. I like the fresh air; the genemod birds give me the creeps.  When Lucy returned, someone was with her. I put down my needlework, pasted on a smile, and prepared to be civil. The visitor used a walker, moving very slowly. She had sparse gray hair. I let out a little cry.  I hadn’t even known Kyra was still alive.  “Mom, guess who’s here! Your cousin Kyra!”  “Hello, Amy,” Kyra said, and her voice hadn’t changed, still low and husky.  “Where . . . how did you . . . ”  “Oh, you were always easy to find, remember? I was the difficult one to locate.”  Lucy said, “Are they looking for you now, Kyra?”  Kyra. Lucy was born too soon for the new civil formality. Lem’s and Robin’s children would have called her Ms. Lunden, or ma’am.  “Oh, probably,” Kyra said. “But if they show up, child, just tell them my hearing implant failed again.” She lowered herself into a chair, which obligingly curved itself around her. That still gives me the creeps, too, but Kyra didn’t seem to mind.  We stared at each other, two ancient ladies in comfortable baggy clothing, and I suddenly saw the twenty-six-year-old she had been, gaudily dressed mistress to an enemy general. Every detail was sharp as winter air: her blue jumpsuit with a double row of tiny mirrors sewn down the front, her asymmetrical hair the color of gold-leaf. That happens to me more and more. The past is so much clearer than the present.  Lucy said, “I’ll go make some tea, all right?”  “Yes, dear, please,” I said.  Kyra smiled. “She seems like a good person.”  “Too good,” I said, without explanation. “Kyra, why are you here? Do you need to hide again? This probably isn’t the best place.”  “No, I’m not hiding. They’re either looking for me or they’re not, but I think not. They’ve got their hands full, after all, up at Celadon.”  Celadon is the aggressively new international space station. When I first heard the name, I’d thought, why name a space station after a color? But it turns out that’s the name of some famous engineer who designed the nuclear devices that make it cheap to hoist things back and forth from Earth to orbit. They’ve hoisted a lot of things. The station is still growing, but it already houses one hundred seventy scientists, techies, and administrators. Plus, now, two aliens.  They appeared in the solar system three months ago. The usual alarms went off, but there was no rioting, at least not in the United States. People watched their children more closely. But we had the space station now, a place for the aliens to contact, without actually coming to Earth. And maybe the New Civility (that’s how journalists write about it, with capital letters) made a difference as well. I couldn’t say. But the aliens spent a month or so communicating with Celadon, and then they came aboard, and a few selected humans went aboard their mothership, and the whole thing began to resemble a tea party fortified with the security of a transnational bank vault.  Kyra was watching me. “You aren’t paying any attention to the aliens’ return, are you, Amy?”  “Not really.” I picked up my needlepoint and started to work.  “That’s a switch, isn’t it? It used to be you who were interested in the political and me who wasn’t.”  It seemed an odd thing to say, given her career, but I didn’t argue. “How are you, Kyra?”  “Old.”  “Ah, yes. I know that feeling.”  “And your children?”  I made myself go on stitching. “Robin is dead. Cross-fire victim. His ashes are buried there, under that lilac tree. Lucy you saw. Lem and his wife are fine, and their two kids, and my three great-grandchildren.”  Kyra nodded, unsurprised. “I have three step-children, two step-grandchildren. Wonderful kids.”  “You married again?”  “Late. I was sixty-five, Bill sixty-seven. A pair of sagging gray arthritic honeymooners. But we had ten good years, and I’m grateful for them.”  I knew what she meant. At the end, one was grateful for all the good years, no matter what their aftermath. I said, “Kyra, I still don’t know why you’re here. Not that you’re not welcome, of course, but why now?”  “I told you. I wanted to hear what you thought of the aliens’ coming to Celadon.”  “You could have comlinked.”  She didn’t say anything to that. I stitched on. Lucy brought tea, poured it, and left again.  “Amy, I really want to know what you think.”  She was serious. It mattered to her. I put down my teacup. “All right. On Mondays I think they’re not on Celadon at all and the government made the whole thing up. On Tuesdays I think that they’re here to do just what it looks like: make contact with humans, and this is the first time it looks safe to them. The other three times we met them with soldiers and bombs and anger because they landed on our planet. Now there’s a place to interact without coming too close, and we aren’t screeching at them in panic, and they were waiting for that in order to establish trade and/or diplomatic relations. On Wednesdays I think they’re worming their way into our confidence, gathering knowledge about our technology, in order to enslave us or destroy us. On Thursdays I think that they’re aliens, so how can we ever hope to understand their reasons? They’re not human. On Fridays I hope, and on Saturdays I despair, and on Sundays I take a day of rest.”  Kyra didn’t smile. I remembered that about her: she didn’t have much of a sense of humor. She said, “And why do you think they took me and that Kikuyu boy into their ships?”  “On Mondays—”  “I’m serious, Amy!”  “Always. All right, I guess they just wanted to learn about us in person, so they picked out two growing specimens and knocked them out so they could garner all the secrets of our physical bodies for future use. They might even have taken some of your DNA, you know. You’d never miss it. There could be small culture-grown Kyras running around some distant planet. Or not so small, by now.”  But Kyra wasn’t interested in the possibilities of genetic engineering. “I think I know why they came.”  “You do?” Once she had told me that the aliens came just to destroy her life. But that kind of hubris was for the young.  “Yes,” Kyra said. “I think they came without knowing the reason. They just came. After all, Amy, if I think about it, I can’t really say why I did half the things in my life. They just seemed the available course of action at the time, so I did them. Why should the aliens be any different? Can you say that you really know why you did all the things in your life?”  Could I? I thought about it. “Yes, Kyra. I think I can, pretty much. That’s not to say my reasons were good. But they were understandable.”  She shrugged. “Then you’re different from me. But I’ll tell you this: Any plan the government makes to deal with these aliens won’t work. You know why? Because it will be one plan, one set of attitudes and procedures, and pretty soon things will change on Earth or on Celadon or for the aliens, and then the plan won’t work anymore and still everybody will try desperately to make it work. They’ll try to stay in control, and nobody can control anything important.”  She said this last with such intensity that I looked up from my needlepoint. She meant it, this banal and obvious insight that she was offering as if it were cutting edge knowledge.  And yet, it was cutting edge, because each person had to acquire it painfully, in his or her own way, through loss and failure and births and plagues and war and victories and, sometimes, a life shaped by an hour in an alien spaceship. All fodder for the same trite, heart-breaking conclusion. Everything old is new again.  And yet—  Sudden tenderness washed over me for Kyra. We had spent most of our lives locked in pointless battle. I reached over to her, carefully so as not to aggravate my creaky joints, and took her hand.  “Kyra, if you believe you can’t control anything, then you won’t try for control, which of course guarantees that you end up not controlling anything.”  “Never in my whole life have I been able to make a difference to—what the fuck is that!”  The furry blue bird had landed on her head, its feet tangling briefly in her hair. “It’s one of Lem’s genemod birds,” I said. “It’s been engineered to have no fear of humans.”  “Well, that’s a stupid idea!” Kyra said, swatting at it with surprising vigor. The bird flew away. “If that thing lands on me again, I’ll strangle it!”  “Yes,” I said, and laughed, and didn’t bother to explain why.    Originally published in Sci Fiction, May 8, 2002. Nancy Kress is the author of thirty-five books, including twenty-seven novels, four collections of short stories, and three books on writing. Her work has won six Nebulas, two Hugos, a Sturgeon, and the John W. Campbell Memorial Award. Her most recent works are a stand-alone novella about genetic engineering, Sea Change (Tachyon, 2020) and an SF novel of power and money, The Eleventh Gate (Baen, 2020). Nancy’s fiction has been translated into nearly two dozen languages including Klingon, none of which she can read. She has taught writing SF at various venues including Clarion and the annual two-week intensive workshop Taos Toolbox with Walter Jon Williams. She lives in Seattle with her husband, writer Jack Skillingstead, and Pippin, a Chihuahua puppy who chews everything.", "text": "9130 words, novelette, REPRINT\nThe Most Famous Little Girl in the World\n2002\nThe most famous little girl in the world stuck out her tongue at me. “These are all my Barbie dolls and you can’t use them!”\nI ran to Mommy. “Kyra won’t share!”\n“Kyra, dear,” Aunt Julie said in that funny tight voice she had ever since IT happened, “share your new dolls with Amy.”\n“No, they’re mine!” Kyra said. “The news people gave them all to me!” She tried to hold all the Barbie dolls, nine or ten, in her arms all at once, and then she started to cry. She does that a lot now.\n“Julie,” Mommy said, real quiet, “she doesn’t have to share.”\n“Yes, she does. Just because she’s now some sort of . . . oh, God, I wish none of this had happened!” Then Aunt Julie was crying, too.\nGrown ups aren’t supposed to cry. I looked at Aunt Julie, and then at stupid Kyra, still bawling, and then at Aunt Julie again. Nothing was right.\nMommy took me by the hand, led me into the kitchen, and sat me on her lap. The kitchen was all warm and there were chocolate-chip cookies baking, so that was good. “Amy,” Mommy said, “I want to talk to you.”\n“I’m too big to sit on your lap,” I said.\n“No, you’re not,” Mommy said, and held me closer, and I felt better. “But you are big enough to understand what happened to Kyra.”\n“Kyra says she doesn’t understand it!”\n“Well, in one sense that’s true,” Mommy said. “But you understand some of it, anyway. You know that Kyra and you were in the cow field, and a big spaceship came down.”\n“Can I have a cookie?”\n“They’re not done yet. Sit still and listen, Amy.”\nI said, “I know all this! The ship came down, and the door opened, and Kyra went in and I was far away and I didn’t.” And then I called Mommy on the cell phone and she called 911 and people came running. Not Aunt Julie—Mommy was baby-sitting Kyra at Kyra’s house. But police cars and firemen and ambulances. The cars drove right into the cow field, right through cow poop. If the cows hadn’t been all bunched together way over by the fence, I bet the cars would have driven through the cows, too. That would have been kind of cool.\nKyra was in there a long time. The police shouted at the little spaceship, but it didn’t open up or anything. I was watching from an upstairs window, where Mommy made me go, through Uncle John’s binoculars. A helicopter came but before it could do anything, the spaceship door opened and Kyra walked out and policemen rushed forward and grabbed her. And then the spaceship just rose up and went away, passing the helicopter, and ever since everybody thinks Kyra is the coolest thing in the world. Well, I don’t.\n“I hate her, Mommy.”\n“No, you don’t. But Kyra is getting all the attention and—” She sighed and held me tighter. It was nice, even though I’m too big to be held tight like that.\n“Is Kyra going to go on TV?”\n“No. Aunt Julie and I agreed to keep both of you off TV and magazines and whatever.”\n“Kyra’s been on lots of magazines.”\n“Not by choice.”\n“Mommy,” I said, because it was safe sitting there on her lap and the cookies smelled good, “what did Kyra do in the spaceship?”\nHer chest got stiff. “We don’t know. Kyra can’t remember. Unless . . . unless she told you something, Amy?”\n“She says she can’t remember.”\nI twisted to look at Mommy’s face. “So how come they still send presents? It was last year!”\n“I know.” Mommy put me on the floor and opened the oven to poke at the cookies. They smelled wonderful.\n“And,” I demanded, “how come Uncle John doesn’t come home anymore?”\nMommy bit her lip. “Would you like a cookie, Amy?”\n“Yes. How come?”\n“Sometimes people just—”\n“Are Aunt Julie and Uncle John getting a divorce? Because of Kyra?”\n“No. Kyra is not responsible here, and you just remember that, young lady! I don’t want you making her feel more confused than she is!”\nI ate my cookie. Kyra wasn’t confused. She was a cry-baby and a Barbie hog and I hated her. I didn’t want her to be my cousin anymore.\nWhat was so great about going into some stupid spaceship, anyway? Nothing. She couldn’t even remember anything about it!\nMommy put her hands over her face.\n2008\nWhispers broke out all over the cafeteria. “That’s her . . . her . . . her!”\nOh, shit. I bent my head over my milk. Last year the cafeteria used to serve fizzies and Coke and there were vending machines with candy and chips, but the new principal took all that out. He’s a real bastard. Part of the “Clean Up America” campaign our new president is forcing down our throats, Dad said. Only he didn’t say “forcing” because he thinks it’s cool, like all the Carter Falls High parents do. Supervision for kids. School uniforms. Silent prayer. A mandatory class in citizenship. Getting expelled for everything short of breathing. It all sucks.\n“It is her,” Jack said. “I saw her picture online.”\nHannah said, “What do you suppose they really did to her in that ship when she was a little kid?”\nAngie giggled and licked her lips. She has a really dirty mind. Carter, who’s sort of a goody-goody even though he’s on the football team, said, “It’s none of our business. And she was just a little kid.”\n“So?” Angie smirked. “You never heard of pedophiles?”\nHannah said, “Pedophile aliens? Grow up, Angie.”\nJack said, “She’s kind of cute.”\n“I thought you wanted a virgin, Jack,” Angie said, still smirking.\nCarter said, “Oh, give her a break. She just moved here, after all.”\nI watched Kyra walk uncertainly toward the cafeteria tables. The monitors were keeping a close eye on everybody. We have monitors everywhere, just like the street has National Guard everywhere. Clean up America, my ass. Kyra squinted; she’s near-sighted and doesn’t like to wear her contacts because she says they itch. I ducked lower over my milk.\nAngie said, “Somebody told me Kyra Lunden is your cousin.”\nEverybody’s head jerked to look at me. Damn that bitch Angie! Where had she heard that? Mom had promised me that nobody in school would know and Kyra wouldn’t say anything! She and Aunt Julie had to move, Mom and Dad said, because Aunt Julie was having a rough time since the divorce and she needed to be close to her sister, and I should understand that. Well, I did, I guess, but not if Kyra blasted in and ruined everything for me. This was my school, not hers, I spent a lot of time getting into the good groups, the ones I was never part of in junior high, and no pathetic famous cousin was going to wreck that. She couldn’t even dance.\nJack said, “Kyra Lunden is your cousin, Amy? Really?”\n“No,” I said. “Of course not.”\nAngie said, “That’s not what I heard.”\nCarter said, “So it’s just gossip? You can hurt people that way, Angie.”\n“God, Carter, don’t you ever let up? Holier-than-thou!”\nCarter mottled red. Hannah, who likes him even though Carter doesn’t know it, said, “It’s nice that some people at least try to be kind to others.”\n“Spit it in your soup, Hannah,” Angie said.\nJack and Hannah exchanged a look. They really make the decisions for the group, and for a bunch of other groups, too. Angie’s too stupid to realize that, or to realize that she’s going to be oozed out. I don’t feel sorry for her. She deserves it, even if being oozed is really horrible. You walk through the halls alone, and nobody looks directly at you, and people laugh at you behind your back because you can’t even keep your own friends. Still, Angie deserves it.\nHannah looked at me straight, with that look Jack calls her “police interrogation gaze.”\n“Amy, is Kyra Lunden your cousin?”\nKyra sat alone at one end of a table. A bunch of kids, the really cobra ones that run the VR lab, sat at the other end, kind of laughing at her without laughing. I saw Eleanor Murphy, who was elected Queen of VR Gala even though she’s only a junior, give Kyra a long cool level look and then turn disdainfully away.\n“No,” I said, “I already told you. She’s not my cousin. In fact, I’ve never even met her.”\n2018\nI stared at the villa with disbelief. Not at the guards—everywhere rich is guarded now, we’re a nation of paranoids, perhaps not without reason. There seems no containing the lunatic terrorists, home-grown patriotic militias, White Supremacists, and Black Equalizers, not to mention the run-of-the-mill gangs and petty drug lords and black-market smugglers. Plus, of course, the government’s response to these, which sometimes seems to involve putting every single nineteen-year-old in the country out on the streets in camouflage—except, of course, those nineteen-year-olds who are already bespoken as lunatic terrorists, home-grown militia, White Supremacists, et al. The rest of us get on with our normal lives.\nSo the guards didn’t surprise me—the villa did. It was a miniaturized replica of a Forbidden City palace—in Minnesota.\nThe chief guard caught me gaping at the swooping curved roof, the gilded archways, the octagonal pagoda. “Papers, please?”\nI pulled myself together and looked professional, which is to say, not desperate. I was desperate, of course. But not even Kyra was going to know that.\n“I am Madame Lunden’s cousin,” I said formally, “Amy Parker. Madame Lunden is expecting me.”\nForget inscrutable Chinese—the guard looked as suspicious as if I’d said I was a Muslim Turkic Uighur. He examined me, he examined my identity card, he ran the computer match on my retina scan. I walked through metal detectors, explosive residue detectors, detector detectors. I was patted down thoroughly but not obscenely. Finally he let me through the inner gate, watching me all the way through the arch carved with incongruous peacocks and dragons.\nKyra waited in the courtyard beyond the arch. She wore an aggressively fashionable blue jumpsuit with a double row of tiny mirrors sewn down the front. Her hair was dyed bright blonde and cut in the sharp asymmetrical cut popularized by that Dutch online model, Brigitte. In the traditional Chinese courtyard, set with flowering plum trees in porcelain pots and a pool with golden carp, she looked either ridiculous or exotic, depending on your point of view. Point of view was why I was here. We hadn’t seen each other in eight years.\n“Hello, Amy,” Kyra said in her low, husky voice.\n“Hello, Kyra. Thank you for seeing me.”\n“My pleasure.”\nWas there mockery in her tone? Probably. If so, I’d earned it. “How is Aunt Julie?”\n“I have no idea. She refuses to have any contact with me.”\nMy eyes widened; I hadn’t known that. I should have known that. A good journalist does her homework. Kyra smiled at me, and this time there was no mistaking the mockery. I had stepped in it, and oh God, I couldn’t afford to ruin this interview. My job depended on it. Staff was being cut, and Paul had not axed me only because I said, with the desperation of fear, Kyra Lunden is my cousin. I know she’s refused all other interviews, but maybe . . .\nKyra said, “Sit down, Amy. Shall we start? Which service do you write for, again?”\n“Times online.”\n“Ah, yes. Well, what do you want to know?”\n“I thought we’d start with some background. How did you and General Chou meet?”\n“At a party.”\n“Oh. Where was the party held?” She wasn’t going to help me at all.\nKyra crossed her legs. The expensive blue fabric of the jumpsuit draped becomingly. She looked fabulous; I wondered if she’d had any body work done. But, then, she’d always been pretty, even when she’d been ten and the most famous little girl in the world, blinking bewildered into the clunky TV equipment of sixteen years ago. My robocam drifted beside me, automatically recording us from the most flattering angles.\n“The party was at Carol Perez’s,” Kyra said, naming a Washington hostess I’d only seen in the society programs. “I’d met Carol at Yale, of course. I met a lot of people at Yale.”\nYes, she did. By college, Kyra had lost her shyness about what had happened to her when we were ten. She’d developed what sounded like a superb act—we had mutual friends—composed of mystery combined with notoriety. Subtly she reminded people that she had had an experience unique to all of mankind, never duplicated since, and that although she was reluctant to talk about it, yes, it was true that she was undergoing deep hypnosis and it was possible she might remember what actually happened.\nBy her junior year, she’d “remembered.” Tastefully, shyly, nothing to make people label her a lunatic. The aliens were small and bipedal, they’d put a sort of helmet on her head and she’d watched holograms while, presumably, they recorded her reactions. No, she couldn’t remember any specifics. Not yet, anyway.\nYale ate it up. Intellectuals, especially political types, debated the aliens’ intentions in terms of future United States policy. Artsy preppies’ imaginations were stirred. Socialites decided that Kyra Lunden was an interesting addition to their parties. She was in.\n“Carol’s party was at their Virginia home,” Kyra continued. “Diplomats, horse people, the usual. Ch’un-fu and I were introduced, and we both knew right away this could be something special.”\nI peered at her. Could she really be that naive? Chou Ch’un-fu had already had two American mistresses. The Han Chinese, Chou’s party, and the United States were now allies, united in their actions against terrorists from the western part of China, the Muslim Turkic Uighurs, who were destabilizing China with their desperate war for independence. The Uighurs would lose. Everyone knew this, probably even the Uighurs. But until they did, they were blowing up things in Peking and Shanghai and San Francisco and London, sometimes in frantic negotiation for money, sometimes with arrogant political manifestos, sometimes, it seemed, out of sheer frustration. The carnage, even in a century used to it, could make a diplomat pale. General Chou was experienced in all this. Press drudges like me don’t get insider data, but rumor linked him with some brutal actions. He maintained a home in Minnesota because it was easy to reach on the rocket flights over the pole.\nAnd Kyra believed they had a “special” romantic relationship?\nIncredibly, it seemed she did. As she talked about their meeting, about her life with Chou, I saw no trace of irony, of doubt, of simple confusion. Certainly not of anything approaching shame. I did detect anger, and that was the most intriguing thing about her demeanor. Who was she angry with? Chou? Her mother, that straight-laced paragon who had rejected her? The aliens? Fate?\nShe deflected all political questions. “Kyra, do you approve of the way the Chinese-American alliance is developing?”\n“I approve of the way my life is developing.” Tinkly laugh, undercut with anger.\nWe toured the villa, and she let me photograph everything, even their bedroom. Huge canopied bed, carved chests, jars of plum blossoms. Chou, or some PR spinner, had decided that a Chinese political partner should appear neither too austere nor too American. China’s past was honored in her present, even as she looked toward the future—that was clearly the message I was to get out. I recorded everything. Kyra said nothing as we toured, usually not even looking at me. She combed her hair in front of her ornate carved mirror, fiddled with objects, sat in deep reverie. It was as if she’d forgotten I was there.\nKyra’s silence broke only as she escorted me to the gate. Abruptly she said, “Amy, do you remember Carter Falls High? The VR Gala?”\n“Yes,” I said cautiously.\n“You and I and our dates were in the jungle room. There was a virtual coconut fight. I tossed a coconut at you, it hit, and you pretended you didn’t even see it.”\n“Yes,” I said. Out of all the shunning I’d done to her in those horrible, terrified, cruel teenage years, she picked that to recall!\n“But you did see it. You knew I was there.”\n“Yes. I’m sorry, Kyra.”\n“Don’t worry about it,” she said, with such a glittering smile that all at once I knew who her anger was directed at. She had given me this interview out of old family ties, or a desire to show off the superiority of our relative positions, or something, but she was angry at me. And always would be.\n“I’m sorry,” I said again, with spectacular inadequacy. Kyra didn’t answer, merely turned and walked back toward her tiny Forbidden City.\nMy story was a great success. The Times ran it in flat-screen, 3D, and VR, and its access rate went off the charts. It was the first time anyone had been inside the Chou compound, had met the American girlfriend of an enigmatic general, had seen that particular lifestyle up close. Kyra’s mysterious encounter with aliens sixteen years ago gave it a unique edge. Even those who hated the story—and there were many, calling it exploitative, immoral, decadent, symptomatic of this or that—noticed it. My message system nearly collapsed under the weight of congratulations, condemnations, job offers.\nThe next day, Kyra Lunden called a press conference. She denied everything. I had been admitted to the Chou villa, yes, but only as a relative, for tea. Our agreement had been no recorders. I had violated that, had recorded secretly, and furthermore had endangered Chinese-American relations. Kyra had tears in her eyes. The Chinese Embassy issued an angry denunciation. The State Department was not pleased.\nThe Times fired me.\nStanding in my apartment, still surrounded by the masses of flowers that had arrived yesterday, I stared at nothing. The sickeningly sweet fragrances made me queasy. Wild ideas, stupid ideas, rioted in my head. I could sue. I could kill myself. Kyra really had been altered by the aliens. She was no longer human, but a VR-thriller simulacrum of a human, and it was my duty to expose her.\nAll stupid. Only one idea was true.\nKyra had, after all these years, found a way to get even.\n2027\nIn the second year of the war, the aliens came back.\nDavid told me while I was bathing the baby in the kitchen sink. The twins, Lucy and Lem, were shrieking around the tiny apartment like a pair of banshees. It was a crummy apartment, but it wasn’t too far from David’s job, and we were lucky to get it. There was a war on.\n“The Blanding telescope has picked up an alien ship heading for Earth.” David spoke the amazing sentence flatly, the way he speaks everything to me now. It was the first time he’d initiated conversation in two weeks.\nI tightened my grip on Robin, a wriggler slippery with soap, and stared at him. “When . . . how . . . ”\n“It would be good, Amy, if you could ever finish a sentence,” David said, with the dispassionate hypercriticism he brings these days to everything I say. It wasn’t always like this. David wasn’t always like this. Depression, his doctor told me, unfortunately not responding to available medications. Well, great, so David’s depressed. The whole country’s depressed. Also frightened and poor and gray-faced with anxiety about this unpredictable war’s bio-attacks and Q-bomb attacks and EMP attacks, all seemingly random. We’re all depressed, but not all of us take it out on the people we live with.\nI said with great deliberation, “When did the Blanding pick up the aliens, and do the scientists believe they’re the same aliens that came here in July of 2002?”\n“Yesterday. Yes. You should either bathe Robin or not bathe him, instead of suspending a vital parental job in the middle like that.” He left the room.\nI rinsed Robin, wrapped him in a large, gray-from-age towel, and laid him on the floor. He smiled at me; such a sweet-natured child. I gave Lucy and Lem, too frenetic for sweetness, a hoarded cookie each, and turned on the Internet. The Trumpeter avatar, whom someone had designed to subtly remind viewers of Honest Abe Lincoln, was in the middle of the story, complete with what must have been hastily assembled archival footage from obsolete media.\nThere was the little pewter-colored spaceship in my Uncle John’s cow field twenty-five years ago, and Kyra walking out with a dazed look on her small face. God—she’d been only a few years older than Lucy and Lem. There was the ship lifting straight up, passing the Army helicopter. That time, no watching telescopes or satellites had detected a larger ship, coming or going . . . either our technology was better now, or the aliens had a different game plan. Now the screen showed pictures from the Blanding, which looked like nothing but a dot in space until computers enhanced it, surrounded it with graphics, and “artistically rendered” various imaginary appearances and routes and speculations. In the midst of the hype given somberly in Abraham Lincoln’s “voice,” I gathered that the ship’s trajectory would intersect with the same cow pasture as last time—unless, of course, it didn’t—and would arrive at Earth in thirteen hours and seven minutes.\nA Chinese general appeared on screen, announcing in translation that China was prepared to shoot the intruder down.\n“Mommy!” Lucy shrieked. “My cookie’s gone!”\n“Not now, honey.”\n“But Lem gots some of his cookie and he won’t share!”\n“In a minute!”\n“But Mommy—”\nThe Internet abruptly cut out. The Internet.\nInto the shocking, eerie silence came Lem’s voice, marginally quieter than his sister’s. “Mommy. I hear some sirens.”\nThree days of chaos. I had never believed panic—old-style Roman rioting in the streets, totally out of control, murderous panic—could happen in the United States, in gray cities like Rochester, New York. Yes, there were periodic race riots in Atlanta and looting spells in New York or war hysteria in San Francisco, but the National Guard quickly contained them in neighborhoods where violence was a way of life anyway. But this panic took over the whole city in a cold February and watching on the Internet, when a given site’s coverage was up anyway, was to know a surreal horror. This was supposed to be America.\nPeople were publicly beheaded on the lawns of the art museum, their breath frozen on the winter air a second before the blood leapt from their severed heads toward the camera. No one could say why they were being executed, or even if there was a reason. Buildings that the National Guard had protected from being bombed by Chinese terrorists were bombed by crazed Americans. Anyone Chinese-American, or appearing Chinese-American, or rumored to be Chinese-American, was so savagely assaulted that the fourteenth century would have been disgusted. A dead, mangled baby was thrown onto our fourth-floor fire escape, where it lay for the entire three days, pecked at by crows.\nI kept the children huddled in the bathroom, which had no windows to shatter. Or see out of. The electricity went off, then on, then off for good. The heat ceased. David stayed by the living room window in case the building caught fire and we had no choice but to evacuate. Even during this horror he belittled and criticized: “If you’d had more food stockpiled, Amy, maybe the kids wouldn’t have to have cereal again.” “You never were any good at keeping them soothed and quiet.”\nSoothed and quiet. The crows on the fire escape had plucked out the dead infant’s eyes.\nWhenever Lucy, Lem, and Robin were finally asleep, I turned on the radio. The riots were coming under control. No, they weren’t. The President was dead. No, he wasn’t. The President had declared martial law. Massive bio-weapons had been unleashed in New York. No, in London. No, in Peking. The Chinese were behind these attacks. No, the Chinese were having worse riots than we were, their present chaos merging with their previous chaos of civil war. It was that civil war that had broken the American-Chinese alliance three years ago. And then during their civil upheavals, the Chinese had attacked Alaska. Maybe. Not even the international intelligence network was completely sure who’d released the bubonic-plague-carrying rats in Anchorage. But, announced the White House, the excesses of China had become too much for the Western world to stomach.\nI didn’t see how those excesses could be worse than this.\nAnd then it was over. The Army prevailed. Or maybe the chaos, self-limiting as some plagues, just ran its course. Everyone left alive was immune. After another week, David and I—but not the kids—emerged from our building into the rubble to start rebuilding some sort of economic and communal existence. We never left the children alone, but even so David had found an isolated moment to say, resentment in every line of his body, “You’re the one who wanted to have children. I don’t know how much longer I can go on paying for your bad judgment.”\nIt was then that I got the email from Kyra.\n“Why did you come?” Kyra asked me.\nWe faced each other in a federal prison in the Catskill Mountains northeast of New York City. The prison, built in 2022, was state-of-the-art. Nothing could break in or out, including bacteria, viruses, and some radiation. The Kyra sitting opposite me, this frightened woman, was actually two miles away, locked in some cell that probably looked nothing like the hologram of her I faced in the Visitors’ Center.\nI said slowly, “I can’t say why I came.” This was the truth. Or, rather, I could say but only with so much mixed motive that she would never understand. Because I had to get away from David for these two days. Because the childhood she and I shared, no matter how embittered by events, nonetheless looked to me now like Arcadia. Because I wanted to see Kyra humbled, in pain, as she had once put me. Because I had some insane idea, as crazy as the chaos we had lived through two weeks ago, that she might hold a key to understanding the inexplicable. Because.\nShe said, “Did you come to gloat?”\n“In part.”\n“All right, you’re entitled. Just help me!”\n“To tell the truth, Kyra, you don’t look like you need all that much help. You look well-fed, and bathed, and safe enough behind these walls.” All more than my children were. “When did you land in here, anyway?”\n“They put me in the second the alien ship was spotted.” Her voice was bitter.\n“On what charges?”\n“No charges. I’m a detainee for the good of the state.”\nI said levelly, “Because of the alien ship or because you slept with the Chinese enemy?”\n“They weren’t the enemy then!” she said angrily, and I saw that my goading was pushing her to the point where she wanted to tell me to fuck off. But she didn’t dare.\nShe didn’t look bad. Well-fed, bathed, as I’d said. No longer pretty, however. Well, it had been nine hard years since I’d seen her. That delicate skin had coarsened and wrinkled much more than mine, as if she’d spent a lot of time in the sun. The hair, once blazingly blonde, was a dull brown streaked with gray. My Aunt Julie, her mother, had died five years ago in a traffic accident.\n“Amy,” she said, visibly controlling herself, “I’m afraid they’ll just quietly keep me here forever. I don’t have any ties with the Chinese any more, and I don’t know anything about or from that alien ship. I was just living quietly, under an alias, and then they broke in to my apartment in the middle of the night and cuffed me and brought me here.”\n“Why don’t you contact General Chou?” I said cruelly.\nKyra only looked at me with such despair that I despised her. She was, had always been, a sentimentalist. I remembered how she’d actually thought that military monster loved her.\n“Tell me what happened since 2018,” I said, and watched her seize on this with desperate hope.\n“After your news story came out and—I’m sorry, Amy, I . . . ”\n“Don’t,” I said harshly, and she knew enough to stop.\n“I left Chun’fu, or rather he threw me out. It hit me hard, although I guess I was pretty much a fool not to think he’d react that way, not to anticipate—” She looked away, old pain fresh on her face. I thought that “fool” didn’t begin to cover it.\n“Anyway, I had some old friends who helped me. Most people wanted nothing to do with me, but a few loyal ones got me a new identity and a job on a lobster farm on Cape Cod. You know, I liked it. I’d forgotten how good it can feel to work outdoors. It was different from my father’s dairy farm, of course, but the wind and the rain and the sea . . . ” She trailed off, remembering things I’d never seen.\n“I met a lobster farmer named Daniel and we lived together. I never told him my real name. We had a daughter, Jane.”\nI thought I’d seen pain on her face before. I’d been wrong.\nI said, and it came out gentle, “Where are Daniel and Jane now?”\n“Dead. A bio-virus attack. I didn’t think I could go on after that, but of course I did. People do. Are you married, Amy?”\n“Yes. I hate him.” I hadn’t planned on saying that. Something in her pain drew out my own. Kyra didn’t look shocked.\n“Kids?”\n“Three wonderful ones. Five-year-old twins and a six-month-old.”\nShe leaned forward, like a plant hungry for sun. “What are their names?”\n“Lucy. Lem. Robin. Kyra . . . how do you think I can help you?”\n“Write about me. You’re a journalist.”\n“No, I’m not. You ended my career.” Did Kyra really not know that?\n“Then call a press conference. Send data to the news outlets. Write letters to Congress. Just don’t let me rot here indefinitely because they don’t know what to do with me!”\nShe really had no idea how things worked. Still an innocent. I wasn’t ready yet to tell her that all her anguish was silly. Instead I said, “Did the aliens communicate with you from their ship in some way?”\n“Of course not!”\n“The ship left, you know.”\nFrom her face, it was clear she didn’t know. “They left?”\n“Two weeks ago. Came no closer than the moon. If we had any sort of decent space program left, if anyone did, we might have tried to contact them. But they just observed us, or whatever, from that distance, then took off again.”\n“Fuck them to bloody hell! I wish we had shot them down!”\nShe had surprised me, with both the language—Kyra had always been a bit prissy, despite her sexual adventures—and the hatred. My surprise must have shown on my face.\n“Amy,” Kyra said, “they ruined my life. Without that abduction—” the word didn’t really seem appropriate—“when I was ten, my parents would never have divorced. I wouldn’t have been an outcast in school. I never would have met Chou, or behaved like . . . and I certainly wouldn’t be in this fucking prison now! They came here to ruin my life and they succeeded!”\n“You take no responsibility for anything,” I said evenly.\nKyra glared at me. “Don’t you dare judge me, Amy. You with your beautiful living children and your life free of any suspicion that you’re somehow deformed and dangerous because of a few childhood hours you can’t even remember—”\n“‘Can’t remember’? What about the helmet and the flickering images and the observing aliens? Did you make those all up, Kyra?”\nEnraged, she lunged forward to slap me. There was nothing there, of course. We were only virtually together. I stood to leave my half of the farce.\n“Please, Amy . . . please! Say you’ll help me!”\n“You’re a fool, Kyra. You learn nothing. Do you think the prison officials would be letting you have this ‘meeting’ with me if they were going to keep you here hidden away for good? Do you think you’d even have been permitted to send me email? You’re as good as out already. And when you are, try this time to behave as if you weren’t still ten years old.”\nWe parted in contempt and anger. I hoped to never see or hear from her again.\n2047\nThe next time the aliens returned, they landed.\nI was at JungleTime Playland with my granddaughter, Lehani. She loved JungleTime Playland. I was amused by it; in the long, long rebuilding after the war, VR had finally reached the commercial level that Robin and Lucy and Lem, Lehani’s father, had also played in. Of course, government applications of VR and holo and AI were another matter, but I had nothing to do with those. I led a very small, contented life.\n“I go Yung Lan,” Lehani said, looking up at me with the shining, whole-hearted hope of the young on her small face. Every wish granted is paradise, every wish crushed is eternal disappointment.\n“Yes, you can go into JungleLand, but we have to wait our turn, dear heart.”\nSo she stood in line beside me, hopping from foot to foot, holding my hand. Nobody ever told me grandmotherhood was going to be this sweet.\nWhen we finally reached the head of the line, I registered her, put the tag on her neck that would keep me informed of her every move as well as the most minute changes in her skin conductivity. If she got scared or inattentive, I would know it. No adults are allowed in Jungle Playland; that would spoil the thrill. Lehani grinned and ran through the virtual curtain. I accepted the map tuned to her tag and sat at a table in the lobby, surrounded by lines of older children registering for the other VR playlands.\nSipping tea, I was checking my email when the big lobby screen abruptly came on.\n“News! News! An alien ship has been sighted moving toward Earth. Government sources say it resembles the ship that landed in Minnesota in 2002 and traveled as far as lunar orbit in 2027 but so far no—”\nPeople erupted all around me. Buzzing, signaling for their children, and, in the case of one stupid woman, pointless shrieking. Under cover of the noise I comlinked Central, before the site was hopelessly jammed.\n“Library,” I keyed in. “Public Records, State of Maine. Data search.”\n“Search ready,” the tiny screen said.\n“Death certificate, first name Daniel, same date as death certificate, first name Jane, years 2020 through 2026.”\n“Searching.”\nChildren began to pour out of the playlands, most resentful at having their VR time interrupted. Kyra had never told me Daniel’s last name. Nor did I have any idea what name she was using now. But if she simply wanted to pass unnoticed among ordinary people, his name would do, and Kyra had always been sentimental. The government, of course, would know exactly where she was, but they would know that no matter what name she used or what paper trails she falsified. Her DNA was on record. The press, too, could track her down if they decided to take the trouble. The alien landing meant they would take the trouble.\nMy handheld displayed, “Daniel Ethan Parmani, died June 16, 2025, age forty-two, and Jane Julia Parmani, died June 16, 2025, age three.”\n“Second search. United States. Locate Kyra Parmani, ages—” What age might Kyra think she could pass for? In prison, twenty years ago, she had looked far older than she was. “Ages fifty through seventy.”\n“Searching.”\nLehani appeared at the JungleLand door, looking furious. She spied me and ran over. “Lady sayed I can’t play!”\n“I know, sweetie. Come sit on Grandma’s lap.”\nShe climbed onto me, buried her head in my shoulder, and burst into angry tears. I peered around her to see the handheld.\n“Six matches.” It displayed them. Six? With a name like “Parmani” coupled with one like “Kyra”? I sighed and shifted Lehani’s weight.\n“Call each of them in turn.”\nKyra was the second match. She answered the call herself, her voice unconcerned. She hadn’t heard. “Hello?”\n“Kyra. It’s Amy, your cousin. Listen, they’ve just spotted an alien ship coming in. They’ll be looking for you again.” Silence on the other end. “Kyra?”\n“How did you find me?”\n“Lucky guesswork. But if you want to hide, from the feds or the press . . . ” They might put her in jail again, and who knew this time when she would get out? At the very least, the press would make her life, whatever it was now, a misery. I said, “Do you have somewhere to go? Some not-too-close-but-perfectly-trusted friend’s back bedroom or strange structure in a cowfield?”\nShe didn’t laugh. Kyra never had had much of a sense of humor. Not that this was an especially good time for joking.\n“Yes, Amy. I do. Why are you warning me?”\n“Oh, God, Kyra, how do I answer that?”\nMaybe she understood. Maybe not. She merely said, “All right. And thanks. Amy . . . ”\n“What?”\n“I’m getting married again. I’m happy.”\nThat was certainly like her: blurting out the personal that no one had asked about. For a second I, too, was the old Amy, bitter and jealous. I had not remarried since my terrible divorce from David, had not even loved any one again. I suspected I never would. But the moment passed. I had Robin and Lem and Lehani and, intermittently when she was in the country, Lucy.\n“Congratulations, Kyra. Now get going. They can find you in about forty seconds if they want to, you know.”\n“I know. I’ll call you when this is all over, Amy. Where are you?”\n“Prince George’s County, Maryland. Amy Suiter Parker. Bye, Kyra.” I broke the link.\n“Who on link?” Lehani demanded, apparently having decided her tears were not accomplishing anything.\n“Somebody Grandma knew a long time ago, dear heart. Come on, let’s go home, and you can play with Mr. Grindle’s cat.”\n“Yes! Yes!”\nIt is always so easy to distract the uncorrupted.\nThe alien ship parked itself in lunar orbit for the better part of three days. Naturally we had no one up there; not a single nation on Earth had anything you could call a space program any more. But there were satellites. Maybe we communicated with the aliens, or they with us, or maybe we tried to destroy them, or entice them, or threaten them. Or all of the above, by different nations with different satellites. Ordinary citizens like me were not told. And of course the aliens could have been doing anything with their ship: sampling broadcasts, scrambling military signals, seeding clouds, sending messages to true believers’ back teeth. How would I know?\nOn the second day, three agents from People’s Safety Commission, the latest political reincarnation of that office, showed up to ask me about Kyra’s whereabouts. I said, truthfully, that I hadn’t seen her in twenty years and had no idea where she was now. They thanked me politely and left. News cams staked out her house, a modest foamcast building in a small Pennsylvania town, and they dissected her current life, but they never actually found her, so it made a pretty lackluster story.\nAfter three days of lunar orbit, a small alien craft landed on the upland savanna of East Africa. Somehow it sneaked past whatever surveillance we had as if it didn’t exist. The ship set down just beyond sight of a Kikuyu village. Two small boys herding goats spotted it, and one of them went inside.\nBy the time the world learned of this, from a call made on the village’s only comlink, the child was already inside the alien ship. News people and government people raced to the scene. East Africa was in its usual state of confused civil war, incipient drought, and raging disease. The borders were theoretically sealed. This made no difference whatsoever. Gunfire erupted, disinformation spread, ultimata were issued. The robocams went on recording.\n“Does it look the same as the ship you saw?” Lem said softly, watching the news beside me. His wife Amalie was in the kitchen with Lehani. I could hear them laughing.\n“It looks the same.” Forty-five years fell away and I stood in Uncle John’s cow field, watching Kyra walk into the pewter-colored ship and walk out the most famous little girl in the world.\nLem said, “What do you think they want?”\nI stared at him. “Don’t you think I’ve wondered that for four and a half decades? That everyone has wondered that?”\nLem was silent.\nA helicopter appeared in the sky over the alien craft. That, too, was familiar—until it set down and I grasped its huge size. Troops began pouring out, guns were leveled, and orders barked. A newsman, maybe live but probably virtual, said, “We’re being ordered to shut down all reporting on this—” He disappeared.\nA black cloud emanated from the helicopter, but not before a robocam had shown more equipment being off-loaded. Lem said, “My God, I think that’s a bombcase!” Through the black cloud ripped more gunfire.\nThen no news came through at all.\nThe stories conflicted wildly, of course. At least six different agencies, in three different countries, were blamed. A hundred and three people died at the scene, and uncounted more in the senseless riots that followed. One of the dead was the second little boy that had witnessed the landing.\nThe first child went up with the ship. It was the only picture that emerged after the government erected visual and electronic blockage: the small craft rising unharmed above the black cloud, ascending into the sky and disappearing into the bright African sunlight.\nThe Kikuyu boy was released about a hundred miles away, near another village, but it was a long time before ordinary people learned that.\nKyra never called me after the furor had died down. I searched for her, but she was more savvy about choosing her aliases. If the government located her, and I assumed they did, no one informed me.\nWhy would they?\n2075\nSometimes the world you want comes too late.\nIt was not really the world anyone wanted, of course. Third world countries, especially but not exclusively in Africa, were still essentially ungovernable. Fetid urban slums, disease, and terror from local warlords. Daily want, brutality, and suffering, all made orders of magnitude worse by the lunatic compulsion to genocide. Much of the globe lives like this, with little hope of foreseeable change.\nBut inside the United States’ tightly guarded, expensively defended borders, a miracle had occurred. Loaves from fishes, something for nothing, the free lunch there ain’t supposed to be one of. Nanotechnology.\nIt was still an embryonic industry. But it had brought burgeoning prosperity. And with prosperity came the things that aren’t supposed to cost money but always do: peace, generosity, civility. And one more thing: a space program, the cause of all the news agitation I was pointedly not watching.\n“It’s not fair to say that nano brought civility,” Lucy protested. She was back from a journalism assignment in Sudan that had left her gaunt and limping, with half her hair fallen out. Lucy didn’t volunteer details and I didn’t ask. From the look in her haunted eyes, I didn’t think I could bear to hear her answers.\n“Civility is a by-product of money,” I said. “Starving people are not civil to each other.”\n“Sometimes they are,” she said, looking at some painful memory I could not imagine.\n“Often?” I pressed.\n“No. Not often.” Abruptly Lucy left the room.\nI have learned to wait serenely until she’s ready to return to me, just as she has learned to wait, less serenely, until she is ready to return to those parts of the world where she makes her living. My daughter is too old for what she does, but she cannot, somehow, leave it alone. Injured, diseased, half bald, she always goes back.\nBut Lucy is partly right. It isn’t just America’s present riches that have led to her present civility. This decade’s culture—optimistic, tolerant, fairly formal—is also a simple backlash to what went before. Pendulums swing. They cannot not swing.\nWhile I waited for Lucy, I returned to my needlepoint. Now that nano has begun to easily make us anything, things that are hard to make are back in fashion. My eyes are too old for embroidery or even petit point, but gros point I can do. Under my fingers, roses bloomed on a pair of slippers. A bird flew to the tree beside me, lit on a branch, and watched me solemnly.\nI’m still not used to birds in the house. But, then, I’m not used to this house of my son’s, either. All the rooms open into an open central courtyard two stories high. Atop the courtyard is some sort of invisible shield that I don’t understand. It keeps out cold and insects, and it can be adjusted to let rain in or keep it out. The shield keeps in the birds who live here. What Lem has is a miniature, climate-controlled, carefully landscaped, indoor Eden. The bird watching me was bright red with an extravagant gold tail, undoubtedly genetically engineered for health and long life. Other birds glow in the dark. One has what looks like blue fur.\n“Go away,” I told it. I like the fresh air; the genemod birds give me the creeps.\nWhen Lucy returned, someone was with her. I put down my needlework, pasted on a smile, and prepared to be civil. The visitor used a walker, moving very slowly. She had sparse gray hair. I let out a little cry.\nI hadn’t even known Kyra was still alive.\n“Mom, guess who’s here! Your cousin Kyra!”\n“Hello, Amy,” Kyra said, and her voice hadn’t changed, still low and husky.\n“Where . . . how did you . . . ”\n“Oh, you were always easy to find, remember? I was the difficult one to locate.”\nLucy said, “Are they looking for you now, Kyra?”\nKyra. Lucy was born too soon for the new civil formality. Lem’s and Robin’s children would have called her Ms. Lunden, or ma’am.\n“Oh, probably,” Kyra said. “But if they show up, child, just tell them my hearing implant failed again.” She lowered herself into a chair, which obligingly curved itself around her. That still gives me the creeps, too, but Kyra didn’t seem to mind.\nWe stared at each other, two ancient ladies in comfortable baggy clothing, and I suddenly saw the twenty-six-year-old she had been, gaudily dressed mistress to an enemy general. Every detail was sharp as winter air: her blue jumpsuit with a double row of tiny mirrors sewn down the front, her asymmetrical hair the color of gold-leaf. That happens to me more and more. The past is so much clearer than the present.\nLucy said, “I’ll go make some tea, all right?”\n“Yes, dear, please,” I said.\nKyra smiled. “She seems like a good person.”\n“Too good,” I said, without explanation. “Kyra, why are you here? Do you need to hide again? This probably isn’t the best place.”\n“No, I’m not hiding. They’re either looking for me or they’re not, but I think not. They’ve got their hands full, after all, up at Celadon.”\nCeladon is the aggressively new international space station. When I first heard the name, I’d thought, why name a space station after a color? But it turns out that’s the name of some famous engineer who designed the nuclear devices that make it cheap to hoist things back and forth from Earth to orbit. They’ve hoisted a lot of things. The station is still growing, but it already houses one hundred seventy scientists, techies, and administrators. Plus, now, two aliens.\nThey appeared in the solar system three months ago. The usual alarms went off, but there was no rioting, at least not in the United States. People watched their children more closely. But we had the space station now, a place for the aliens to contact, without actually coming to Earth. And maybe the New Civility (that’s how journalists write about it, with capital letters) made a difference as well. I couldn’t say. But the aliens spent a month or so communicating with Celadon, and then they came aboard, and a few selected humans went aboard their mothership, and the whole thing began to resemble a tea party fortified with the security of a transnational bank vault.\nKyra was watching me. “You aren’t paying any attention to the aliens’ return, are you, Amy?”\n“Not really.” I picked up my needlepoint and started to work.\n“That’s a switch, isn’t it? It used to be you who were interested in the political and me who wasn’t.”\nIt seemed an odd thing to say, given her career, but I didn’t argue. “How are you, Kyra?”\n“Old.”\n“Ah, yes. I know that feeling.”\n“And your children?”\nI made myself go on stitching. “Robin is dead. Cross-fire victim. His ashes are buried there, under that lilac tree. Lucy you saw. Lem and his wife are fine, and their two kids, and my three great-grandchildren.”\nKyra nodded, unsurprised. “I have three step-children, two step-grandchildren. Wonderful kids.”\n“You married again?”\n“Late. I was sixty-five, Bill sixty-seven. A pair of sagging gray arthritic honeymooners. But we had ten good years, and I’m grateful for them.”\nI knew what she meant. At the end, one was grateful for all the good years, no matter what their aftermath. I said, “Kyra, I still don’t know why you’re here. Not that you’re not welcome, of course, but why now?”\n“I told you. I wanted to hear what you thought of the aliens’ coming to Celadon.”\n“You could have comlinked.”\nShe didn’t say anything to that. I stitched on. Lucy brought tea, poured it, and left again.\n“Amy, I really want to know what you think.”\nShe was serious. It mattered to her. I put down my teacup. “All right. On Mondays I think they’re not on Celadon at all and the government made the whole thing up. On Tuesdays I think that they’re here to do just what it looks like: make contact with humans, and this is the first time it looks safe to them. The other three times we met them with soldiers and bombs and anger because they landed on our planet. Now there’s a place to interact without coming too close, and we aren’t screeching at them in panic, and they were waiting for that in order to establish trade and/or diplomatic relations. On Wednesdays I think they’re worming their way into our confidence, gathering knowledge about our technology, in order to enslave us or destroy us. On Thursdays I think that they’re aliens, so how can we ever hope to understand their reasons? They’re not human. On Fridays I hope, and on Saturdays I despair, and on Sundays I take a day of rest.”\nKyra didn’t smile. I remembered that about her: she didn’t have much of a sense of humor. She said, “And why do you think they took me and that Kikuyu boy into their ships?”\n“On Mondays—”\n“I’m serious, Amy!”\n“Always. All right, I guess they just wanted to learn about us in person, so they picked out two growing specimens and knocked them out so they could garner all the secrets of our physical bodies for future use. They might even have taken some of your DNA, you know. You’d never miss it. There could be small culture-grown Kyras running around some distant planet. Or not so small, by now.”\nBut Kyra wasn’t interested in the possibilities of genetic engineering. “I think I know why they came.”\n“You do?” Once she had told me that the aliens came just to destroy her life. But that kind of hubris was for the young.\n“Yes,” Kyra said. “I think they came without knowing the reason. They just came. After all, Amy, if I think about it, I can’t really say why I did half the things in my life. They just seemed the available course of action at the time, so I did them. Why should the aliens be any different? Can you say that you really know why you did all the things in your life?”\nCould I? I thought about it. “Yes, Kyra. I think I can, pretty much. That’s not to say my reasons were good. But they were understandable.”\nShe shrugged. “Then you’re different from me. But I’ll tell you this: Any plan the government makes to deal with these aliens won’t work. You know why? Because it will be one plan, one set of attitudes and procedures, and pretty soon things will change on Earth or on Celadon or for the aliens, and then the plan won’t work anymore and still everybody will try desperately to make it work. They’ll try to stay in control, and nobody can control anything important.”\nShe said this last with such intensity that I looked up from my needlepoint. She meant it, this banal and obvious insight that she was offering as if it were cutting edge knowledge.\nAnd yet, it was cutting edge, because each person had to acquire it painfully, in his or her own way, through loss and failure and births and plagues and war and victories and, sometimes, a life shaped by an hour in an alien spaceship. All fodder for the same trite, heart-breaking conclusion. Everything old is new again.\nAnd yet—\nSudden tenderness washed over me for Kyra. We had spent most of our lives locked in pointless battle. I reached over to her, carefully so as not to aggravate my creaky joints, and took her hand.\n“Kyra, if you believe you can’t control anything, then you won’t try for control, which of course guarantees that you end up not controlling anything.”\n“Never in my whole life have I been able to make a difference to—what the fuck is that!”\nThe furry blue bird had landed on her head, its feet tangling briefly in her hair. “It’s one of Lem’s genemod birds,” I said. “It’s been engineered to have no fear of humans.”\n“Well, that’s a stupid idea!” Kyra said, swatting at it with surprising vigor. The bird flew away. “If that thing lands on me again, I’ll strangle it!”\n“Yes,” I said, and laughed, and didn’t bother to explain why.\nOriginally published in Sci Fiction, May 8, 2002.\nNancy Kress is the author of thirty-five books, including twenty-seven novels, four collections of short stories, and three books on writing. Her work has won six Nebulas, two Hugos, a Sturgeon, and the John W. Campbell Memorial Award. Her most recent works are a stand-alone novella about genetic engineering, Sea Change (Tachyon, 2020) and an SF novel of power and money, The Eleventh Gate (Baen, 2020). Nancy’s fiction has been translated into nearly two dozen languages including Klingon, none of which she can read. She has taught writing SF at various venues including Clarion and the annual two-week intensive workshop Taos Toolbox with Walter Jon Williams. She lives in Seattle with her husband, writer Jack Skillingstead, and Pippin, a Chihuahua puppy who chews everything.", "source": "https://clarkesworldmagazine.com/kress_12_16_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Most Famous Little Girl in the World by Nancy Kress"}