{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nina Kiriki Hoffman", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "1U///cnMiMaX4XS42nE1DQJdZzc=", "id": null, "license": null, "comments": "", "raw_text": "3780 words, short story  Futures in the Memories Market  You can’t do anything else when you emp one of Geeta Tilrassen’s memory modules. Her senses seize you; you see through her eyes, taste with her tongue, hear with her ears. And touch? You’ve never felt air against your skin until you’ve felt it breathe across hers. In a desert environment, there’s a sense of cinnamon in the air. When Geeta’s on a water world, you feel the humidity as embrace instead of torture, as though you are constantly being kissed. Every module Geeta makes is fresh and innocent, and every time you use one, you feel as though it’s the first time.  I’ve got one legitimate copy of a Geeta memod; I’m only allowed one at a time, and I’ve kept this one for a while. It’s her visit to the Hallen people. Nothing very exciting happens. She walks into their village. (The red sand gets into your sandals, but instead of grinding against your feet or raising blisters, it’s a pleasant friction.) The air smells of woodsmoke, charred flesh, and sage.  Hallen burrows are mostly underground, but they have built delicate aboveground structures of woven withies, beautiful as spider webs, with small crystals at the intersections that flare in the red sunlight.  The Hallen greet Geeta, draw her into one of the withy shelters, and give her the only thing it’s safe for her to ingest from their cuisine, some kind of berry drink with bits of leaf in it. She drinks. The liquid is cool on your tongue, a nice contrast to the desert heat. You taste the essence of that drink a long time after she’s swallowed the last sip, a sour-sweet merging of bright and dark flavors. She presses palms with the head lizard, smells his individual scent that shares species straw-tones with the others in the shelter but smells a shade more like sulfur and ginger. She listens to their drum-intensive music and sits in a woven-leaf chair with a Hallen egg in her lap. The music gets inside you like a second heartbeat, chasing your blood until you want to rise and dance. You can feel how warm the egg is, how there’s something moving inside that leather shell. You sense Geeta’s delight, the way it feathers her insides.  It only lasts about a minute real-time, maybe twenty minutes mod time. It’s my favorite possession. I save it for the most difficult days, when I hate being Itzal Bidarte, the man who lost his home as a child and has never found another. I long for roots, and all I do is wander.  If I had Geeta’s power, perhaps my memories of my homeland would be stronger. They are fragments, mostly visual, a plane of light on my mother’s cheek as she leans to kiss me, my father settling in a deep chair beside the hearth and lighting his pipe with a coal on a wire he’s fished from the fire.  I acquired a memod made by a cousin of mine, dead now. When I play it, I see again the stream beside our village, smoke rising from the chimneys of the white-plastered, red-shuttered houses on a cool morning, pots of red geraniums beside the doors, and even, I think, I catch a glimpse of my father leading a donkey down to drink. My dead cousin’s memory is too flat, too simple. There are only muted sounds, distant scents, no touch. I don’t feel as though I’m there. It is more like seeing something in a smoked mirror.  I’ve emped Geeta’s memory module of the Hallen about twenty times. I notice different things each time. She is so alert to every sensation that a normal person can’t take it all in at once.  What I don’t see in the memod are Geeta’s bodyguards. GreaTimes, the memory merchants who have the sole license to distribute Geeta’s mods, edits us out. Even though I’ve gone on memory missions with Geeta, you will never sense me in one of her mods.  As the ship approached our next destination, I pressed the alert beside Geeta’s cabin door. The door slid up and let me in.  Geeta stood in the middle of the cabin, with colored outfits draped over the omnishapes of furniture whose functions she hadn’t set. The scentser laid down a faint, unobtrusive smell that covered any other odors in the cabin, and the audio was playing very low, something melodic without any percussion. Aside from the colors, this was Geeta neutral, as close as she could get to shutting down her senses and living on a par with the rest of us.  “Itzal,” Geeta said, “you know more about this than I do. What should I wear on Tice?”  She had been to Tice before, but she didn’t remember.  I looked over all her outfits and pointed to the scarlet one with the gilt, point-edged hem. “We’re going to a big city on Tice, lots of energy and interaction. That dress will attract attention and intensify your experience.”  She looked at me sideways, her broad mouth quirked at one corner. She was not beautiful in any of the regular ways, but her face was full of character, elastic enough to reflect her moods and thoughts. Only lately had I learned that she might be a different person behind her face, that there were parts of herself she had been hiding. “What if I want to have a quiet time?”  “Do you?” I asked.  She spun around, stopped, hugged herself. “You know me better than I know myself.” She took the red dress and hung it from a ceiling ring. I helped her pick up the other clothes and store them behind the wall. She controlled the furniture into two chairs and a table, and we sat facing each other.  She tapped her wrist. I lifted my own wrist and swept the room with the spystopper. No glow: Geeta’s corporate masters weren’t watching us.  “Did you get me one?” she asked.  I shook my head. Sentients all through the interlinked worlds could buy Geeta’s memods, but access to them was strictly limited aboard The Collector. Each crewmember could own one at a time, and Geeta was not allowed to use any of them. She didn’t have an implanted emp receptor like the rest of us. She had to use an external one to get the cultural gloss and language of the places we visited before we arrived. Her corporate masters allowed her some forms of entertainment so she would be stimulated during our tween-worlds journeys through the skip nodes and in and out of systems. Nobody wanted Geeta to get bored.  “Maybe I can pick up something on Tice,” I said. “I’m not sure how to get it aboard, though.”  “Could you disguise it as something else?” she asked.  I thought about that. “Maybe. If I have enough money. I’d need to find an underground tech there who could make it look like your normal entertainment emps, so you could put it into the emper without them knowing what you’re doing.” I tapped my lips with my index fingers. Before I landed this job as Geeta’s bodyguard, I had done some less-than-legal things—most of my guard training had come from people operating at the fringes of the linked worlds, in shadowy spaces often called Underground. I knew a few signs of the Starlight Fraternity that might lead me to someone on Tice who could successfully disguise an emp. Or the signs might have expired, and using them could get me into trouble.  I shook my head. “I don’t think I can pay enough.”  “I’ll give you money.”  “But Geet, you don’t have any.”  Geeta made the best memods in the business, according to her fans, who were legion across many worlds. GreaTimes bought her contract when she was very young, recognizing her memory potential even then; they had automated observers on most worlds, watching for talented children like Geeta. Geeta was kept in luxury, given everything she needed and wanted so long as it wouldn’t interfere with her memories, but she had no salary, and no real freedom.  “I’ll trade something.” She looked around her cabin, went to the wall and opened a drawer full of jewelry. She had a robber bird’s delight in sparkling things, so she often asked for and received jewel gifts when she had completed a memory job. She got out the Kudic rubies, a necklace with raw chunks of pink stone. It was one of her most expensive pieces.  I felt a prickle of excitement. We usually visited backwater planets, because people who bought memods seldom went there, and they were hungry for Geeta’s fresh experiences. Tice was bigger than our usual stop; I might successfully fence jewels like these. They’d have a wider choice of memods for sale there, too. “Which memory do you want most?” I asked, tucking the jewels in an inner pocket.  “The horse people,” she said. Though she wasn’t allowed to emp her own memods, she could check the infostream and see the GreaTimes catalog, read the blurbs.  “I’ll see what I can do.” Geeta had a second guard, Ibo; we alternated shifts when we were in relatively safe environments. I had some leave due, and Tice had some quiet places Geeta was scheduled to visit.  “Thanks, Itzal.” She pressed her cheek to the back of my hand. I wondered what that was like for her. Did she like my smell? The feel of my skin? These were small random memories no one would ever buy. GreaTimes let Geeta keep all her memories between missions, the dull details of shipboard life; it was only the planet visits they siphoned off, leaving her with amnesia of all her adventures, unknowing of any lessons she might have learned. They kept her in a state of confused innocence. She wanted to change that. She wanted me to help her recover the memories she had lost.  Ibo and I flanked Geeta as she stepped out of the shuttle, through the docking tunnel, and into Tice’s “Welcome Outworld Travelers” Terminal. She looked everywhere, smiling wide. Hanging baskets of local plants with long, colored fronds filtered the light coming through the hazed sky-ceiling, scattering spots of green and lavender on the floor. People attended by companion animals moved through the distance, intent on their own business. A mother with triplet daughters dangled a star on a string in front of her babies. They laughed and reached for it, and Geeta laughed, too.  I hungered for her response to this situation even as I surveyed the area for potential threats. Like Geeta and Ibo, I’d emped the culture and language memod for Tice last night. I still wasn’t sure about the companion animals; they’d be easy to mimic. Some looked like large dogs, some like pack animals, and some walked upright like the humans they accompanied, and looked like nothing I’d seen before. What if one of them was the kind of fan who wanted Geeta to experience death or pain so they could share her intense response to that? She’d encountered threats before.  Because of the nature of her memories, most people had no idea what Geeta looked like. She rarely looked at herself in mirrors. If her reflection happened to show up in a memory, GreaTimes fuzzed it. She had been captured in some tourist vids GreaTimes could do nothing about, though; a tricky outsider might have some idea of what she looked like. Plus there was always the general threat anyone might fall under in any place.  Ibo took the lead. We went through customs scan. They determined that Ibo and I were licensed to carry the stun weapons we had. We had no luggage. Geeta never stayed anywhere overnight. It only took her a few hours to collect several salable memory sets. She had already started. She had a long conversation with the customs official about what kind of people he met, what their stories were, what people tried to smuggle in. Ibo and I stood patiently while the customs official called over his superior and had her tell more stories. All part of Geeta.  I had the rubies in a shielded belt. I wasn’t sure the belt would fool sophisticated scanners on Tice, or even the ship’s scanner, though I hoped the stones would show up as just rocks and metal. (Emps triggered the ship scanner—it was looking for them.) Then again, rubies weren’t illegal or dangerous. I didn’t want Captain Ark to know about them, though, or Ibo.  We left the terminal through close-pressed crowds of various kinds of people and animals. Geeta smiled at them, and they found themselves smiling back, maybe without thinking about it. The usual ripple of pleasant spread around us as we moved. Even the pickpocket whose hand I caught in Geeta’s purse smiled after I retrieved Geeta’s pay-ID, because Geeta said, “Better luck next time,” with a short warble of laughter, and kissed his cheek before I released him back into the wild.  On the curb of Hollow Street, Geeta engaged a cab. She sat in the back sandwiched between me and Ibo and told the driver we wanted to go to the Queen’s Sculpture Garden, the first of four planned stops here.  Last time Geeta came to Tice, she started with the amusement park. I wasn’t with her then, but I’ve heard from people who have emped that module. They love it. Even when she threw up on the big roller ride. I was surprised that wasn’t edited out.  The sculpture garden was quiet when we got there, apparently not a big attraction early on a work day. Only some of the sculptures were made by humans; others had been left behind by vanished alien civilizations, or some made by the three alien species we regularly traded with. All were meant to be touched. Geeta was in her element, studying the sculpture with eyes, ears, nose, fingers, palms, finally full-bodied embraces. She climbed into the lap of a Greatmother and curled up there, hugging herself, her cheek against the smooth dark stone. The bliss on her face made me wonder if she were thinking about her own mother’s lap, or some other place where she had been perfectly comfortable. Her emotions loaded with the memods, but you couldn’t read her thoughts, though sometimes I felt like I could.  Ibo and I had been standing at an easily editable distance, watching Geeta make memories for half an hour, when she looked around and said, “Ibo, we’re safe here, aren’t we?”  Ibo and I both surveyed the garden, using our detection gear to see if anyone or anything dangerous was nearby. No threats.  “It’s okay for Itzal to take half an hour of his leave now,” Geeta said. “I’ll be here at least that much longer.”  “What have you two cooked up?” Ibo asked.  “You took leave on Geloway,” I said. We had been walking a tour trail through a spectacular lava field when Ibo begged time off. He had come back, smelling of sex shop perfume, when we were in the sweet shop at the end of the tour.  “True,” he said. He frowned as though he realized it was a mistake to accuse me and Geeta of anything during a memod. The GreaTimes people edited us out, but for sure they listened to our conversations before they eliminated them. “All right. See you later, Itzal,” he said, and I left.  We are not supposed to know how to hack our trackers, but my last job before joining the Geeta team was with a research and development security company, and I learned a lot there. I entered false coordinates in my tracker and headed for Pawn Alley.  Twenty-nine minutes later I was back in the sculpture garden with news I kept to myself.  The rest of our tour of Tice went without trouble, and Geeta, Ibo, and I taxied back to the terminal, our arms full of souvenirs—boxes of Tice teacakes in five flavors, soft and textured stuffed animals, three new dresses for Geeta with hats, shoes, overtunics, and jewelry to match, and an infostream address for the man Geeta had met and kissed at the races. Having walked through the day with Geeta, and watched her differing delights, including that kiss, I wanted the whole suite of today’s memods. Maybe I’d get them, one at a time, though there were so many Geeta memods on my wish list already . . .  Geeta had a party with the ship’s crew, sharing the treats she’d brought back, and talking about her day. We were all charmed, as we always were the night before the company extracted her memories. We got to see who Geeta might be if she could have held on to her experiences. We all loved the woman she would never become.  Later, the cakes gone and souvenirs distributed amongst the crew, to be hidden any time Geeta came near—though she always got to keep any clothes and accessories she bought—I escorted Geeta back to her cabin. She went into the changing alcove while I spystopped. I found a new active camera and managed to remotely access its feed while my back was to it. Geeta fluttered back into the cabin in her exercise clothes, talked about her adventures, then started her nightly routine. Three repetitions in, I created a loop and sent the camera into nontime. As soon as I gave Geeta the all-clear, she rushed to me.  She saw my expression and sighed, two steps before she would have collided with me.  “They were fake,” I said.  “The rubies?”  “I went to three pawn shops and they all told me the same thing. Decent fakes, not spectacular. Worth no more than glass. Didn’t get enough to even contact anyone who might have disguised the real memods. I traded what I got for the rubies for a couple disguised bootlegs, the lava walk on Placeholder and the plunge valley on Paradise. I need to test them. Maybe they won’t be infected.” I had tried a couple of bootlegs of Geeta’s memods without testing them, back when I was younger and stupider. They were dirt cheap but still amazing, though they suffered from copy fatigue. Often the bootleggers placed compulsions in them that took money, time, and effort to eradicate. I still had the urge to gamble every time I passed an Ergo machine.  “Fake,” Geeta repeated. She wandered to her jewelry drawer, stared down at her treasures, and shut the drawer, her shoulders drooping. Then, angry, she stepped back into place and resumed her exercises. I unlooped the spy camera and we went through her night-of-a-collection-day routine, which included a shower for Geeta and a furniture keying for me: I had to shape the bed so it would do the extraction during the night.  Washed free of every trace of Tice, Geeta let me help her into the bed, fasten the restraints, and plug in her head. “Kiss me,” she said. “I want two kisses in a day. I never had that experience before, did I?”  I kissed her long and deep, kissing the woman we were killing. This kiss wouldn’t make it into the memods; her return to the ship was always cut out. We had done the Tice Ending Shot at sunset on a mountain where cool wind touched us with feathered fingers; it would be spliced onto the end of each of Geeta’s Tice memods.  Geeta would not remember the kiss, but I would, the taste of her sorrow and desperation mixed with the last sweet tang of willowcake. She often kissed me last thing after a mission; I had a collection of these moments in my memory, moments that sometimes deceived me into thinking we were closer than we were.  Her lips relaxed, and I straightened out of the kiss, looked down into her tear-wet eyes.  “Good night, Geeta,” I said softly.  “Good night, Itzal.” She closed her eyes. I set the bed on COLLECT and touched off the lights as I left the room.  In my own much smaller and sparer cabin, I checked for spies. I had never found one; what I did away from Geeta didn’t concern the GreaTimes people, as long as it was legal and not going to impair my care for her.  I put the Hallen memod in the recycle slot and took out the memod I had bought with the ruby money, what I hadn’t put away. I had bought the horse people, the one she’d asked me for. It was a memod she’d made before I was part of her staff. I had read the sales copy on all of them, wanting to know who she had been as much as she did. This was one of the better ones; all the reviews said so.  I set the new memod in my receptor and settled down to emp.  Geeta walked down a ramp into a sky seething with dawn clouds and the tracks of skitterbirds. The air smelled of damp and green, and morning animals called, a random concert with notes that sometimes clashed and sometimes harmonized. In Geeta’s mind, it was all beautiful. The air was cool; Geeta felt it as a pleasurable hug from a chilly friend.  Three horses galloped up the soft-surfaced road and stopped just in front of her, breathing grass-scented breath, musky warmth pouring off them. She laughed and went to hug one, even though the culture memod said people weren’t allowed to do that. How amazing to have your arms around so much huge intelligent warmth; the texture of damp hair against your cheek, the solid muscles shifting against your chest. The smell of the horse’s sweat, salty and musky, stirred Geeta awake on several levels.  “Miss,” said the horse, “Miss, I don’t know you.”  She released him and stepped back. “Oh! I’m sorry. Please forgive me. You don’t know me yet, but I hope you will.” He watched her with one large dark eye, as intricate and beautiful a glistening eye as I had ever seen, with a depth in it that might lead to mystery. I fell in love with the horse. I knew Geeta smiled up at him, because I saw his response: charmed, his head nodding a little, even as his companions laughed at him.  I settled deeper into being Geeta, finding a home that wasn’t really mine but felt like mine. Geeta was home everywhere she went, and when I was emping her, I felt that way, too.  I didn’t know if I would ever share this with her. Over the past twenty-some years, Nina Kiriki Hoffman has sold adult and YA novels and more than 250 short stories. Her works have been finalists for the World Fantasy, Mythopoeic, Sturgeon, Philip K. Dick, and Endeavour awards. Her first novel, The Thread that Binds the Bones, won a Stoker award, and her short story \"Trophy Wives\" won a Nebula Award in 2009. }}} Her fantasy novel Fall of Light came out from Ace in May, 2009. Her middle-school novel Thresholds will come out from Viking in August, 2010. Nina does production work for the Magazine of Fantasy & Science Fiction. She also works with teen writers. She lives in Eugene, Oregon.", "text": "3780 words, short story\nFutures in the Memories Market\nYou can’t do anything else when you emp one of Geeta Tilrassen’s memory modules. Her senses seize you; you see through her eyes, taste with her tongue, hear with her ears. And touch? You’ve never felt air against your skin until you’ve felt it breathe across hers. In a desert environment, there’s a sense of cinnamon in the air. When Geeta’s on a water world, you feel the humidity as embrace instead of torture, as though you are constantly being kissed. Every module Geeta makes is fresh and innocent, and every time you use one, you feel as though it’s the first time.\nI’ve got one legitimate copy of a Geeta memod; I’m only allowed one at a time, and I’ve kept this one for a while. It’s her visit to the Hallen people. Nothing very exciting happens. She walks into their village. (The red sand gets into your sandals, but instead of grinding against your feet or raising blisters, it’s a pleasant friction.) The air smells of woodsmoke, charred flesh, and sage.\nHallen burrows are mostly underground, but they have built delicate aboveground structures of woven withies, beautiful as spider webs, with small crystals at the intersections that flare in the red sunlight.\nThe Hallen greet Geeta, draw her into one of the withy shelters, and give her the only thing it’s safe for her to ingest from their cuisine, some kind of berry drink with bits of leaf in it. She drinks. The liquid is cool on your tongue, a nice contrast to the desert heat. You taste the essence of that drink a long time after she’s swallowed the last sip, a sour-sweet merging of bright and dark flavors. She presses palms with the head lizard, smells his individual scent that shares species straw-tones with the others in the shelter but smells a shade more like sulfur and ginger. She listens to their drum-intensive music and sits in a woven-leaf chair with a Hallen egg in her lap. The music gets inside you like a second heartbeat, chasing your blood until you want to rise and dance. You can feel how warm the egg is, how there’s something moving inside that leather shell. You sense Geeta’s delight, the way it feathers her insides.\nIt only lasts about a minute real-time, maybe twenty minutes mod time. It’s my favorite possession. I save it for the most difficult days, when I hate being Itzal Bidarte, the man who lost his home as a child and has never found another. I long for roots, and all I do is wander.\nIf I had Geeta’s power, perhaps my memories of my homeland would be stronger. They are fragments, mostly visual, a plane of light on my mother’s cheek as she leans to kiss me, my father settling in a deep chair beside the hearth and lighting his pipe with a coal on a wire he’s fished from the fire.\nI acquired a memod made by a cousin of mine, dead now. When I play it, I see again the stream beside our village, smoke rising from the chimneys of the white-plastered, red-shuttered houses on a cool morning, pots of red geraniums beside the doors, and even, I think, I catch a glimpse of my father leading a donkey down to drink. My dead cousin’s memory is too flat, too simple. There are only muted sounds, distant scents, no touch. I don’t feel as though I’m there. It is more like seeing something in a smoked mirror.\nI’ve emped Geeta’s memory module of the Hallen about twenty times. I notice different things each time. She is so alert to every sensation that a normal person can’t take it all in at once.\nWhat I don’t see in the memod are Geeta’s bodyguards. GreaTimes, the memory merchants who have the sole license to distribute Geeta’s mods, edits us out. Even though I’ve gone on memory missions with Geeta, you will never sense me in one of her mods.\nAs the ship approached our next destination, I pressed the alert beside Geeta’s cabin door. The door slid up and let me in.\nGeeta stood in the middle of the cabin, with colored outfits draped over the omnishapes of furniture whose functions she hadn’t set. The scentser laid down a faint, unobtrusive smell that covered any other odors in the cabin, and the audio was playing very low, something melodic without any percussion. Aside from the colors, this was Geeta neutral, as close as she could get to shutting down her senses and living on a par with the rest of us.\n“Itzal,” Geeta said, “you know more about this than I do. What should I wear on Tice?”\nShe had been to Tice before, but she didn’t remember.\nI looked over all her outfits and pointed to the scarlet one with the gilt, point-edged hem. “We’re going to a big city on Tice, lots of energy and interaction. That dress will attract attention and intensify your experience.”\nShe looked at me sideways, her broad mouth quirked at one corner. She was not beautiful in any of the regular ways, but her face was full of character, elastic enough to reflect her moods and thoughts. Only lately had I learned that she might be a different person behind her face, that there were parts of herself she had been hiding. “What if I want to have a quiet time?”\n“Do you?” I asked.\nShe spun around, stopped, hugged herself. “You know me better than I know myself.” She took the red dress and hung it from a ceiling ring. I helped her pick up the other clothes and store them behind the wall. She controlled the furniture into two chairs and a table, and we sat facing each other.\nShe tapped her wrist. I lifted my own wrist and swept the room with the spystopper. No glow: Geeta’s corporate masters weren’t watching us.\n“Did you get me one?” she asked.\nI shook my head. Sentients all through the interlinked worlds could buy Geeta’s memods, but access to them was strictly limited aboard The Collector. Each crewmember could own one at a time, and Geeta was not allowed to use any of them. She didn’t have an implanted emp receptor like the rest of us. She had to use an external one to get the cultural gloss and language of the places we visited before we arrived. Her corporate masters allowed her some forms of entertainment so she would be stimulated during our tween-worlds journeys through the skip nodes and in and out of systems. Nobody wanted Geeta to get bored.\n“Maybe I can pick up something on Tice,” I said. “I’m not sure how to get it aboard, though.”\n“Could you disguise it as something else?” she asked.\nI thought about that. “Maybe. If I have enough money. I’d need to find an underground tech there who could make it look like your normal entertainment emps, so you could put it into the emper without them knowing what you’re doing.” I tapped my lips with my index fingers. Before I landed this job as Geeta’s bodyguard, I had done some less-than-legal things—most of my guard training had come from people operating at the fringes of the linked worlds, in shadowy spaces often called Underground. I knew a few signs of the Starlight Fraternity that might lead me to someone on Tice who could successfully disguise an emp. Or the signs might have expired, and using them could get me into trouble.\nI shook my head. “I don’t think I can pay enough.”\n“I’ll give you money.”\n“But Geet, you don’t have any.”\nGeeta made the best memods in the business, according to her fans, who were legion across many worlds. GreaTimes bought her contract when she was very young, recognizing her memory potential even then; they had automated observers on most worlds, watching for talented children like Geeta. Geeta was kept in luxury, given everything she needed and wanted so long as it wouldn’t interfere with her memories, but she had no salary, and no real freedom.\n“I’ll trade something.” She looked around her cabin, went to the wall and opened a drawer full of jewelry. She had a robber bird’s delight in sparkling things, so she often asked for and received jewel gifts when she had completed a memory job. She got out the Kudic rubies, a necklace with raw chunks of pink stone. It was one of her most expensive pieces.\nI felt a prickle of excitement. We usually visited backwater planets, because people who bought memods seldom went there, and they were hungry for Geeta’s fresh experiences. Tice was bigger than our usual stop; I might successfully fence jewels like these. They’d have a wider choice of memods for sale there, too. “Which memory do you want most?” I asked, tucking the jewels in an inner pocket.\n“The horse people,” she said. Though she wasn’t allowed to emp her own memods, she could check the infostream and see the GreaTimes catalog, read the blurbs.\n“I’ll see what I can do.” Geeta had a second guard, Ibo; we alternated shifts when we were in relatively safe environments. I had some leave due, and Tice had some quiet places Geeta was scheduled to visit.\n“Thanks, Itzal.” She pressed her cheek to the back of my hand. I wondered what that was like for her. Did she like my smell? The feel of my skin? These were small random memories no one would ever buy. GreaTimes let Geeta keep all her memories between missions, the dull details of shipboard life; it was only the planet visits they siphoned off, leaving her with amnesia of all her adventures, unknowing of any lessons she might have learned. They kept her in a state of confused innocence. She wanted to change that. She wanted me to help her recover the memories she had lost.\nIbo and I flanked Geeta as she stepped out of the shuttle, through the docking tunnel, and into Tice’s “Welcome Outworld Travelers” Terminal. She looked everywhere, smiling wide. Hanging baskets of local plants with long, colored fronds filtered the light coming through the hazed sky-ceiling, scattering spots of green and lavender on the floor. People attended by companion animals moved through the distance, intent on their own business. A mother with triplet daughters dangled a star on a string in front of her babies. They laughed and reached for it, and Geeta laughed, too.\nI hungered for her response to this situation even as I surveyed the area for potential threats. Like Geeta and Ibo, I’d emped the culture and language memod for Tice last night. I still wasn’t sure about the companion animals; they’d be easy to mimic. Some looked like large dogs, some like pack animals, and some walked upright like the humans they accompanied, and looked like nothing I’d seen before. What if one of them was the kind of fan who wanted Geeta to experience death or pain so they could share her intense response to that? She’d encountered threats before.\nBecause of the nature of her memories, most people had no idea what Geeta looked like. She rarely looked at herself in mirrors. If her reflection happened to show up in a memory, GreaTimes fuzzed it. She had been captured in some tourist vids GreaTimes could do nothing about, though; a tricky outsider might have some idea of what she looked like. Plus there was always the general threat anyone might fall under in any place.\nIbo took the lead. We went through customs scan. They determined that Ibo and I were licensed to carry the stun weapons we had. We had no luggage. Geeta never stayed anywhere overnight. It only took her a few hours to collect several salable memory sets. She had already started. She had a long conversation with the customs official about what kind of people he met, what their stories were, what people tried to smuggle in. Ibo and I stood patiently while the customs official called over his superior and had her tell more stories. All part of Geeta.\nI had the rubies in a shielded belt. I wasn’t sure the belt would fool sophisticated scanners on Tice, or even the ship’s scanner, though I hoped the stones would show up as just rocks and metal. (Emps triggered the ship scanner—it was looking for them.) Then again, rubies weren’t illegal or dangerous. I didn’t want Captain Ark to know about them, though, or Ibo.\nWe left the terminal through close-pressed crowds of various kinds of people and animals. Geeta smiled at them, and they found themselves smiling back, maybe without thinking about it. The usual ripple of pleasant spread around us as we moved. Even the pickpocket whose hand I caught in Geeta’s purse smiled after I retrieved Geeta’s pay-ID, because Geeta said, “Better luck next time,” with a short warble of laughter, and kissed his cheek before I released him back into the wild.\nOn the curb of Hollow Street, Geeta engaged a cab. She sat in the back sandwiched between me and Ibo and told the driver we wanted to go to the Queen’s Sculpture Garden, the first of four planned stops here.\nLast time Geeta came to Tice, she started with the amusement park. I wasn’t with her then, but I’ve heard from people who have emped that module. They love it. Even when she threw up on the big roller ride. I was surprised that wasn’t edited out.\nThe sculpture garden was quiet when we got there, apparently not a big attraction early on a work day. Only some of the sculptures were made by humans; others had been left behind by vanished alien civilizations, or some made by the three alien species we regularly traded with. All were meant to be touched. Geeta was in her element, studying the sculpture with eyes, ears, nose, fingers, palms, finally full-bodied embraces. She climbed into the lap of a Greatmother and curled up there, hugging herself, her cheek against the smooth dark stone. The bliss on her face made me wonder if she were thinking about her own mother’s lap, or some other place where she had been perfectly comfortable. Her emotions loaded with the memods, but you couldn’t read her thoughts, though sometimes I felt like I could.\nIbo and I had been standing at an easily editable distance, watching Geeta make memories for half an hour, when she looked around and said, “Ibo, we’re safe here, aren’t we?”\nIbo and I both surveyed the garden, using our detection gear to see if anyone or anything dangerous was nearby. No threats.\n“It’s okay for Itzal to take half an hour of his leave now,” Geeta said. “I’ll be here at least that much longer.”\n“What have you two cooked up?” Ibo asked.\n“You took leave on Geloway,” I said. We had been walking a tour trail through a spectacular lava field when Ibo begged time off. He had come back, smelling of sex shop perfume, when we were in the sweet shop at the end of the tour.\n“True,” he said. He frowned as though he realized it was a mistake to accuse me and Geeta of anything during a memod. The GreaTimes people edited us out, but for sure they listened to our conversations before they eliminated them. “All right. See you later, Itzal,” he said, and I left.\nWe are not supposed to know how to hack our trackers, but my last job before joining the Geeta team was with a research and development security company, and I learned a lot there. I entered false coordinates in my tracker and headed for Pawn Alley.\nTwenty-nine minutes later I was back in the sculpture garden with news I kept to myself.\nThe rest of our tour of Tice went without trouble, and Geeta, Ibo, and I taxied back to the terminal, our arms full of souvenirs—boxes of Tice teacakes in five flavors, soft and textured stuffed animals, three new dresses for Geeta with hats, shoes, overtunics, and jewelry to match, and an infostream address for the man Geeta had met and kissed at the races. Having walked through the day with Geeta, and watched her differing delights, including that kiss, I wanted the whole suite of today’s memods. Maybe I’d get them, one at a time, though there were so many Geeta memods on my wish list already . . .\nGeeta had a party with the ship’s crew, sharing the treats she’d brought back, and talking about her day. We were all charmed, as we always were the night before the company extracted her memories. We got to see who Geeta might be if she could have held on to her experiences. We all loved the woman she would never become.\nLater, the cakes gone and souvenirs distributed amongst the crew, to be hidden any time Geeta came near—though she always got to keep any clothes and accessories she bought—I escorted Geeta back to her cabin. She went into the changing alcove while I spystopped. I found a new active camera and managed to remotely access its feed while my back was to it. Geeta fluttered back into the cabin in her exercise clothes, talked about her adventures, then started her nightly routine. Three repetitions in, I created a loop and sent the camera into nontime. As soon as I gave Geeta the all-clear, she rushed to me.\nShe saw my expression and sighed, two steps before she would have collided with me.\n“They were fake,” I said.\n“The rubies?”\n“I went to three pawn shops and they all told me the same thing. Decent fakes, not spectacular. Worth no more than glass. Didn’t get enough to even contact anyone who might have disguised the real memods. I traded what I got for the rubies for a couple disguised bootlegs, the lava walk on Placeholder and the plunge valley on Paradise. I need to test them. Maybe they won’t be infected.” I had tried a couple of bootlegs of Geeta’s memods without testing them, back when I was younger and stupider. They were dirt cheap but still amazing, though they suffered from copy fatigue. Often the bootleggers placed compulsions in them that took money, time, and effort to eradicate. I still had the urge to gamble every time I passed an Ergo machine.\n“Fake,” Geeta repeated. She wandered to her jewelry drawer, stared down at her treasures, and shut the drawer, her shoulders drooping. Then, angry, she stepped back into place and resumed her exercises. I unlooped the spy camera and we went through her night-of-a-collection-day routine, which included a shower for Geeta and a furniture keying for me: I had to shape the bed so it would do the extraction during the night.\nWashed free of every trace of Tice, Geeta let me help her into the bed, fasten the restraints, and plug in her head. “Kiss me,” she said. “I want two kisses in a day. I never had that experience before, did I?”\nI kissed her long and deep, kissing the woman we were killing. This kiss wouldn’t make it into the memods; her return to the ship was always cut out. We had done the Tice Ending Shot at sunset on a mountain where cool wind touched us with feathered fingers; it would be spliced onto the end of each of Geeta’s Tice memods.\nGeeta would not remember the kiss, but I would, the taste of her sorrow and desperation mixed with the last sweet tang of willowcake. She often kissed me last thing after a mission; I had a collection of these moments in my memory, moments that sometimes deceived me into thinking we were closer than we were.\nHer lips relaxed, and I straightened out of the kiss, looked down into her tear-wet eyes.\n“Good night, Geeta,” I said softly.\n“Good night, Itzal.” She closed her eyes. I set the bed on COLLECT and touched off the lights as I left the room.\nIn my own much smaller and sparer cabin, I checked for spies. I had never found one; what I did away from Geeta didn’t concern the GreaTimes people, as long as it was legal and not going to impair my care for her.\nI put the Hallen memod in the recycle slot and took out the memod I had bought with the ruby money, what I hadn’t put away. I had bought the horse people, the one she’d asked me for. It was a memod she’d made before I was part of her staff. I had read the sales copy on all of them, wanting to know who she had been as much as she did. This was one of the better ones; all the reviews said so.\nI set the new memod in my receptor and settled down to emp.\nGeeta walked down a ramp into a sky seething with dawn clouds and the tracks of skitterbirds. The air smelled of damp and green, and morning animals called, a random concert with notes that sometimes clashed and sometimes harmonized. In Geeta’s mind, it was all beautiful. The air was cool; Geeta felt it as a pleasurable hug from a chilly friend.\nThree horses galloped up the soft-surfaced road and stopped just in front of her, breathing grass-scented breath, musky warmth pouring off them. She laughed and went to hug one, even though the culture memod said people weren’t allowed to do that. How amazing to have your arms around so much huge intelligent warmth; the texture of damp hair against your cheek, the solid muscles shifting against your chest. The smell of the horse’s sweat, salty and musky, stirred Geeta awake on several levels.\n“Miss,” said the horse, “Miss, I don’t know you.”\nShe released him and stepped back. “Oh! I’m sorry. Please forgive me. You don’t know me yet, but I hope you will.” He watched her with one large dark eye, as intricate and beautiful a glistening eye as I had ever seen, with a depth in it that might lead to mystery. I fell in love with the horse. I knew Geeta smiled up at him, because I saw his response: charmed, his head nodding a little, even as his companions laughed at him.\nI settled deeper into being Geeta, finding a home that wasn’t really mine but felt like mine. Geeta was home everywhere she went, and when I was emping her, I felt that way, too.\nI didn’t know if I would ever share this with her.\nOver the past twenty-some years, Nina Kiriki Hoffman has sold adult and YA novels and more than 250 short stories. Her works have been finalists for the World Fantasy, Mythopoeic, Sturgeon, Philip K. Dick, and Endeavour awards. Her first novel, The Thread that Binds the Bones, won a Stoker award, and her short story \"Trophy Wives\" won a Nebula Award in 2009.\n}}}\nHer fantasy novel Fall of Light came out from Ace in May, 2009. Her middle-school novel Thresholds will come out from Viking in August, 2010. Nina does production work for the Magazine of Fantasy & Science Fiction. She also works with teen writers. She lives in Eugene, Oregon.", "source": "https://clarkesworldmagazine.com/hoffman_06_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Futures in the Memories Market by Nina Kiriki Hoffman"}