{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Helena Bell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "eWOIp20YV5+WuvbCiSUV/GGXZ+s=", "id": null, "license": null, "comments": "", "raw_text": "2820 words, short story  Variations on Bluebeard and Dalton’s Law Along the Event Horizon  The First Wife  When I am told well, the shade of my husband’s beard is a word for longing. A robin’s egg, deep water below the coral reef, the night sky against the glow of a dying flashlight. A fooling color so I will not know his plans for me until the first door is opened and my neck is sliced: the thin edge like fresh cut paper.  In these stories I have a courtship, a wedding, a ring of flowers whose speed of wilting is an inside jest. In some tellings there is a disagreement, an escalation, a sense that all those who follow will be an attempt at reconciliation. In others there is no tenderness. In others there are no questions. In others there are only answers: many doors and each one I pass is the curve of desire. It builds until I will open nothing without proscription. I open his drawers, his pockets, the last box of cereal. I keep my fists closed when he passes the salt. On our wedding night, and each thereafter I tell him nothing. No endearments, no cries, not even my own name. Slowly my legs close too, a fusion of flesh and scaled distaste. A mermaid’s tail, and he with his skinning knife.  When I am told less well, I am not mentioned at all. I am merely one of a row of bodies. Perhaps I am described like fruit or hanging clothes. Perhaps I am so far in the distance you cannot even see me, do not know that I am there. I am neither naked nor clothed: a mountain bathed in blue light. Atmospheric perspective, they call it. One of three, one of six, one of ten thousand brides lined like British soldiers whose red coats have fallen to the ground to stain the next girl’s silken shoes and the indiscreet brass key. Is it brass? I do not know. When I am told by Frenchmen, I am given neither explanation nor warning for the guillotine. Rhyming morals concerning curiosity and prenuptial agreements, the efficacy of protective brothers are left for others. I have no family; no one ever looks for me; I am nothing and no one; forgotten.  The Second Wife  He wished I was like his first wife: queen, domestic goddess with the small hands and curling eyelashes. Neck like a willow branch. His beard turned blue with lamentation: I cannot talk, nor cook, nor breathe like she.  I purged her slowly. The drapes were shredded and resewn in patterns of crass aesthetic then sold at auction. How poor her taste must have been, I told the others. It’s no wonder he remarried. I gave away the silver she touched, a parting gift to her former servants. Her kin in town were moved. Any tastes we shared, I changed. She liked dogs? I stuffed the menagerie with cheetahs, plucked fathers off her squawking parrot and shoved it naked into my cats' teeth.  He resisted at first: all men do. Shifted her belongings to the fourth hall closet, barred the entrance. Doubted my will. But I would not rest until there were no rooms left.  The Third Wife  Sometimes I am a painting on the wall, admired from a distance and ordered by post, like a political match or salad spinner. It largely depends on the century in which I am dressed: leather, feathers, silk brocade. A suit of white fabric with hard joint bearings, a glass hat. Whether I have white gloves or bare wrists, a tattoo of iron gates from knuckles to clavicle. I am zoftig or slight, depending on the fashion, but always the moment’s desire in the dark.  I am also: first loser to the first loser. Pinned to a horse I am the color of piss, the quick hump before four.  Here is a secret only I can tell you: I sat quietly in the hall with the key in hand. I did not open it; I was pushed.  The Fourth Wife  The morning after my husband first tries to kill me, his former wives join me for breakfast. Always they tie scarves around their wounds, dip their fingers in rouge so each touch to the furniture, the linens, my cheek, leaves russet stains which smelled faintly of spice. Sometimes they do not wear clothing—only the wisp of silk below their chins—and in these versions I fear I must be imagining their touch: the explanation for the dark red blooming upon my flesh.  My husband never interests me. The only reason we marry is so that I may come here, to this moment, though it always goes in ways I do not wish it to.  In each version, I think they like me at first. The one with black and gold in a windsor knot, she smiles and ducks her head when I reach out to grasp her hand. We are like fresh burns or blisters, bubbling over and longing to touch ourselves, each other.  “There are enough of us now,” I say and the one with white rabbits clucks her tongue and shakes her head.  The others look less sure. “Do you know how to fight?  “Can you shoot? Can you poison? Do you know how to evade the constable, the copper, the polygraph? Have you a swamp in which to hide the body, a furnace which heats to a thousand degrees? What is our means of escape? The horses? The car? The black hole looming outside the starboard window?”  The conversation never changes, only the number of mornings like this one. The consumption of bread and tea, the women’s bodies pressing in like so many eager accomplices.  Later, in the closet, I remember the clink of metal on metal as their fingers tapped in feigned boredom. I would ask what it means but we have no mouths here, and it is time for the next.  Five through Sixteen: Optional  These girls have been added over time. Some say they are to pad the body count, others to establish the subtle patterns of a psychological profile. There are rumors that Wife Fourteen staved the moment of her execution for three years by slowly revealing a complex quadratic equation for the attainment of eternal youth. She began with a history of decompression: the white goats of Haldane falling to their knees with each expansion of depth and time ratios. She draws parallels between fractal theory and time travel. Some say this is an example of distraction like Scheharazade. Her cleverness should be lauded, held as an example to all women who must deal with difficult men. Others are less sure.  The Seventeenth Wife  I do not appear until the thousandth telling, but I am there for every one thereafter. I am dropped in without warning, an elision of motivation and necessity. I am the first wife with metal skin and wiring but am given incontrovertible rules of behavior such that they are of little use.  There are other versions of me too who come later, but though we are all called the Seventeenth, we do not think of ourselves as the same. One of us has yellow buttons for eyes, an analog radio mouth. We suppose we could deconstruct ourselves, interchange our organs of rocket thrusters and screens of pulsing data. Or perhaps lay our skins out, our alveoli and cortexes, hard limbs (do we have these things? we must have these things if we are to breathe and to think and calculate the integral of our breasts) to blanket the entire galaxy.  It occurs to us occasionally that we could stop our husband from killing us, we could raise our arms and the blade would find no purchase in the deep paunch of our necks. But at least it is a quick death. Clean, uncompromising. Sometimes we think we prefer it.  Nineteen  Eventually it comes to pass that those who tell the story insert themselves into its fabric. There is the green-skinned housekeeper who hands me a tangled knot of thread when I first enter the house and warns me of a monster at the center of the maze. I believe she is confused with other constructions, other stories which are being told and retold in other places, at other times and I (and we all who come after) are too embarrassed to tell her so.  I am the first who can see outside: the black hills and black sun, the blue limbed trees which sway in winds too warm for brittle skin. I take the thread and tie it to the door anyway, shed my shoes and run as fast as I can in any direction. The air fills with a fine silt and it is hours before I realize I am not breathing it in.  I breathe nothing in.  I do not breathe.  When I wake, I am lying beneath the crystal chandelier in the entrance, the green-skinned housekeeper who speaks in clucking syllables and waves her many arms and legs in gestures of emphatic apology, hands me a ball of tangled thread. I believe she is confused; I am too embarrassed to tell her I am already dead.  Nineteen (after many more tellings)  Eventually it comes to pass that I learn to expand and contract my diaphragm. When I meet the housekeeper, I ask her for a mask, for cylinders, and boots made of thick rubber and hard soles. I clip lights and lines, learn to turn my regular on and off in the dark. I keep a journal with times and distance and SAC rates. If ever one of us is to escape, I feel it must be through me.  My husband and I spent every anniversary in Mexico. Once, as he carried my gear down the wooden steps, where the snorkelers were gathered, he asks the name of the place. Nahoch Nah Chich, I tell him.  Giant birdcage. He laughed. Why do we name such things, but out of fear, or longing.  I do not remember marrying him. I do not remember how we met, or where I was born, my mother’s face, the ten page checklist of mission objectives.  Tying the thread to the door, I feel a familiarity in my fingers. I bend my legs at the knees, floating above the alien world and it is not alien at all: white fingers of limestone drip down and all is quiet save the sound of my own breathing. It is a different cave each time. Different jumps and line arrows; the thread never pulls me back, but eventually I fade.  Thirty  A woman made entirely of bees introduces me to my husband. She sits us both down and explains, in as few words as possible, that I am here to be murdered by him. The story says it must be so. There would be time to come to it naturally, a progression of intimacies and arguments, tests of will as we circled each other like dogs, but everything is running slower than expected. He must do it now. Quickly.  My husband argues with her. He says he does not wish to kill anyone. He has never wished to kill anyone and could he please simply go home. He laments the destruction of free will, the confines of destiny. Why is his role never examined, the contextual analysis of his decisions given more than cursory glances.  The woman of bees grows large and small before him. “The things that I could show you would make you piss yourself in fear.”  My husband is undeterred. “You brought us here. This is all on you.”  “We did not make you,” she says.  There are glimpses within her form, planets and stars I do not remember, and I reach out without thinking. If the universe had formed in an infinitesimally different way, had a molecule collapsed or grown larger, had a butterfly been squished beneath a hunter’s boot, my life would not exist.  I hold stardust in my palm, I think, as a few crushed bees twitch and tickle against my skin.  I do not think this one small act has the power to affect great change. We are not at the beginning after all and the universe is expanding too quickly to catch up with it now. How insurmountable the arrogance that a crushed insect could change a presidential election (I do not believe I have ever seen an election, besides).  Four Hundred Thirty Seven  On our first date I tell the man who will one day be my husband how in 1994 Sheck Exley drowned at 925 feet in Zacatón cenote trying to see what the bottom was like. I linger on the ideal percentages in his gas mixture and tell him how the total pressure exerted by a mixture of gases is equal to the sum of the pressures that would be exerted by each of those gases if they alone were present and occupied the volume. I calculated the distance and ascent rate of an exhalation on a cocktail napkin to explain how when the last of his bubbles breached the surface, Sheck’s wife must have known he had died a full ten minutes before.  “But didn’t she jump in after him?” he asks.  “It would have been pointless,” I say.  Our relationship becomes a study of inverse calculations. Pressure and volume. My love for him is a steel cylinder, over-pressurized. Quantifiable, divisible into clean fractions, calculable for the prevention of oxygen toxicity and nitrogen narcosis. I do not enter a cave unless I am sure I have enough to get out. But he is decompression: a slow release of frustration and longing. Mathematically imprecise.  “What is the most scared you’ve ever been,” he says and I tell him of the Blue Holes in the Bahamas, how a woman there likes to follow the cave divers inside, flips their line arrows around to discourage them from returning.  “There are places one may reach,” I say, “where all exits point back to the self.”  “So that happened to you?” he asks and I shake my head.  “But all of us suffer the same fears. Even though I have never seen that place, I can still feel her eyes on me in the dark. Kindred spirits. Like the myth of twins who can feel when the other is in pain, or dies.”  “In this story, are you the lost diver? Or are you the one who traps them inside, so they will never return?”  “Can’t I be both?”  “Why are all the mad ones women,” he laughs. “Medusa, Lusca, evil queens and scorned ex-wives.” He smiles at me and I remember smiling. I remember agreeing. I remember being foolish in a great many ways.  Later, when I cannot clean the tell-tale blood from my hands he snaps my neck. The last thing I hear is the key hitting the floor. A small sound, less than leaves breaking, and I see there are two of him behind his eyes. One I will never understand, and the other who whispers It was a kindness.  The Husband’s Last Will and Testament Left on His Brother’s Answering Machine Before Lift-Off Which the First Wife Sometimes Whispers to Wife 1001 Like a Greeting, or a Prayer  Please take care of the dogs. Keep the house, or sell it—by the time we get back there won’t be a house left. If we get back. Tell your kids I’ll name whole galaxies after them.  I’ve left you all our books save one. It’s her favorite and I’m thinking of sneaking it up there by hiding it in my jumpsuit. We’re not supposed to take any unauthorized items, and they tell us the sum of human history is in the computer if we get bored. But just the two us, willing to float out there alone for centuries, how can they say no?  The Penultimate Wife  I enter the story knowing my husband's plans for me. He weeps as he does it; he begs forgiveness. We can be so much better than the sum of what has come before.  He mistakes my disinterest for his guilt as evidence that I do not know what I am, what we are, where we have been and where we were headed. It know it was a moment’s sentiment when the knife glanced against my throat and failed. A miscalculation of time and distance, a desire to wait until the last possible second.  He believes it is my story he is telling, dividing me into ten thousand forms, variation after variation and in this way he can keep us both alive. My consciousness hangs like silt stirred by the breath of unknown women. He hopes the sum of us will equal the whole, but looking into my eyes he must know the tiniest parts of me have been discontinued.  I'm sorry, he says. I'm sorry. I promise not to do it again.  Helena Bell is an occasional poet, writer, and international traveler which means that over half of what she says is completely made up, the other half is probably made up, and the third half is about the condition of the roads. She has a BA, an MFA, a JD, and a Tax LLM which fulfills her life long dream of having more letters follow her name than are actually in it. Her work has appeared or is forthcoming in Shimmer Magazine, Brain Harvest, and Rattle.", "text": "2820 words, short story\nVariations on Bluebeard and Dalton’s Law Along the Event Horizon\nThe First Wife\nWhen I am told well, the shade of my husband’s beard is a word for longing. A robin’s egg, deep water below the coral reef, the night sky against the glow of a dying flashlight. A fooling color so I will not know his plans for me until the first door is opened and my neck is sliced: the thin edge like fresh cut paper.\nIn these stories I have a courtship, a wedding, a ring of flowers whose speed of wilting is an inside jest. In some tellings there is a disagreement, an escalation, a sense that all those who follow will be an attempt at reconciliation. In others there is no tenderness. In others there are no questions. In others there are only answers: many doors and each one I pass is the curve of desire. It builds until I will open nothing without proscription. I open his drawers, his pockets, the last box of cereal. I keep my fists closed when he passes the salt. On our wedding night, and each thereafter I tell him nothing. No endearments, no cries, not even my own name. Slowly my legs close too, a fusion of flesh and scaled distaste. A mermaid’s tail, and he with his skinning knife.\nWhen I am told less well, I am not mentioned at all. I am merely one of a row of bodies. Perhaps I am described like fruit or hanging clothes. Perhaps I am so far in the distance you cannot even see me, do not know that I am there. I am neither naked nor clothed: a mountain bathed in blue light. Atmospheric perspective, they call it. One of three, one of six, one of ten thousand brides lined like British soldiers whose red coats have fallen to the ground to stain the next girl’s silken shoes and the indiscreet brass key. Is it brass? I do not know. When I am told by Frenchmen, I am given neither explanation nor warning for the guillotine. Rhyming morals concerning curiosity and prenuptial agreements, the efficacy of protective brothers are left for others. I have no family; no one ever looks for me; I am nothing and no one; forgotten.\nThe Second Wife\nHe wished I was like his first wife: queen, domestic goddess with the small hands and curling eyelashes. Neck like a willow branch. His beard turned blue with lamentation: I cannot talk, nor cook, nor breathe like she.\nI purged her slowly. The drapes were shredded and resewn in patterns of crass aesthetic then sold at auction. How poor her taste must have been, I told the others. It’s no wonder he remarried. I gave away the silver she touched, a parting gift to her former servants. Her kin in town were moved. Any tastes we shared, I changed. She liked dogs? I stuffed the menagerie with cheetahs, plucked fathers off her squawking parrot and shoved it naked into my cats' teeth.\nHe resisted at first: all men do. Shifted her belongings to the fourth hall closet, barred the entrance. Doubted my will. But I would not rest until there were no rooms left.\nThe Third Wife\nSometimes I am a painting on the wall, admired from a distance and ordered by post, like a political match or salad spinner. It largely depends on the century in which I am dressed: leather, feathers, silk brocade. A suit of white fabric with hard joint bearings, a glass hat. Whether I have white gloves or bare wrists, a tattoo of iron gates from knuckles to clavicle. I am zoftig or slight, depending on the fashion, but always the moment’s desire in the dark.\nI am also: first loser to the first loser. Pinned to a horse I am the color of piss, the quick hump before four.\nHere is a secret only I can tell you: I sat quietly in the hall with the key in hand. I did not open it; I was pushed.\nThe Fourth Wife\nThe morning after my husband first tries to kill me, his former wives join me for breakfast. Always they tie scarves around their wounds, dip their fingers in rouge so each touch to the furniture, the linens, my cheek, leaves russet stains which smelled faintly of spice. Sometimes they do not wear clothing—only the wisp of silk below their chins—and in these versions I fear I must be imagining their touch: the explanation for the dark red blooming upon my flesh.\nMy husband never interests me. The only reason we marry is so that I may come here, to this moment, though it always goes in ways I do not wish it to.\nIn each version, I think they like me at first. The one with black and gold in a windsor knot, she smiles and ducks her head when I reach out to grasp her hand. We are like fresh burns or blisters, bubbling over and longing to touch ourselves, each other.\n“There are enough of us now,” I say and the one with white rabbits clucks her tongue and shakes her head.\nThe others look less sure. “Do you know how to fight?\n“Can you shoot? Can you poison? Do you know how to evade the constable, the copper, the polygraph? Have you a swamp in which to hide the body, a furnace which heats to a thousand degrees? What is our means of escape? The horses? The car? The black hole looming outside the starboard window?”\nThe conversation never changes, only the number of mornings like this one. The consumption of bread and tea, the women’s bodies pressing in like so many eager accomplices.\nLater, in the closet, I remember the clink of metal on metal as their fingers tapped in feigned boredom. I would ask what it means but we have no mouths here, and it is time for the next.\nFive through Sixteen: Optional\nThese girls have been added over time. Some say they are to pad the body count, others to establish the subtle patterns of a psychological profile. There are rumors that Wife Fourteen staved the moment of her execution for three years by slowly revealing a complex quadratic equation for the attainment of eternal youth. She began with a history of decompression: the white goats of Haldane falling to their knees with each expansion of depth and time ratios. She draws parallels between fractal theory and time travel. Some say this is an example of distraction like Scheharazade. Her cleverness should be lauded, held as an example to all women who must deal with difficult men. Others are less sure.\nThe Seventeenth Wife\nI do not appear until the thousandth telling, but I am there for every one thereafter. I am dropped in without warning, an elision of motivation and necessity. I am the first wife with metal skin and wiring but am given incontrovertible rules of behavior such that they are of little use.\nThere are other versions of me too who come later, but though we are all called the Seventeenth, we do not think of ourselves as the same. One of us has yellow buttons for eyes, an analog radio mouth. We suppose we could deconstruct ourselves, interchange our organs of rocket thrusters and screens of pulsing data. Or perhaps lay our skins out, our alveoli and cortexes, hard limbs (do we have these things? we must have these things if we are to breathe and to think and calculate the integral of our breasts) to blanket the entire galaxy.\nIt occurs to us occasionally that we could stop our husband from killing us, we could raise our arms and the blade would find no purchase in the deep paunch of our necks. But at least it is a quick death. Clean, uncompromising. Sometimes we think we prefer it.\nNineteen\nEventually it comes to pass that those who tell the story insert themselves into its fabric. There is the green-skinned housekeeper who hands me a tangled knot of thread when I first enter the house and warns me of a monster at the center of the maze. I believe she is confused with other constructions, other stories which are being told and retold in other places, at other times and I (and we all who come after) are too embarrassed to tell her so.\nI am the first who can see outside: the black hills and black sun, the blue limbed trees which sway in winds too warm for brittle skin. I take the thread and tie it to the door anyway, shed my shoes and run as fast as I can in any direction. The air fills with a fine silt and it is hours before I realize I am not breathing it in.\nI breathe nothing in.\nI do not breathe.\nWhen I wake, I am lying beneath the crystal chandelier in the entrance, the green-skinned housekeeper who speaks in clucking syllables and waves her many arms and legs in gestures of emphatic apology, hands me a ball of tangled thread. I believe she is confused; I am too embarrassed to tell her I am already dead.\nNineteen (after many more tellings)\nEventually it comes to pass that I learn to expand and contract my diaphragm. When I meet the housekeeper, I ask her for a mask, for cylinders, and boots made of thick rubber and hard soles. I clip lights and lines, learn to turn my regular on and off in the dark. I keep a journal with times and distance and SAC rates. If ever one of us is to escape, I feel it must be through me.\nMy husband and I spent every anniversary in Mexico. Once, as he carried my gear down the wooden steps, where the snorkelers were gathered, he asks the name of the place. Nahoch Nah Chich, I tell him.\nGiant birdcage. He laughed. Why do we name such things, but out of fear, or longing.\nI do not remember marrying him. I do not remember how we met, or where I was born, my mother’s face, the ten page checklist of mission objectives.\nTying the thread to the door, I feel a familiarity in my fingers. I bend my legs at the knees, floating above the alien world and it is not alien at all: white fingers of limestone drip down and all is quiet save the sound of my own breathing. It is a different cave each time. Different jumps and line arrows; the thread never pulls me back, but eventually I fade.\nThirty\nA woman made entirely of bees introduces me to my husband. She sits us both down and explains, in as few words as possible, that I am here to be murdered by him. The story says it must be so. There would be time to come to it naturally, a progression of intimacies and arguments, tests of will as we circled each other like dogs, but everything is running slower than expected. He must do it now. Quickly.\nMy husband argues with her. He says he does not wish to kill anyone. He has never wished to kill anyone and could he please simply go home. He laments the destruction of free will, the confines of destiny. Why is his role never examined, the contextual analysis of his decisions given more than cursory glances.\nThe woman of bees grows large and small before him. “The things that I could show you would make you piss yourself in fear.”\nMy husband is undeterred. “You brought us here. This is all on you.”\n“We did not make you,” she says.\nThere are glimpses within her form, planets and stars I do not remember, and I reach out without thinking. If the universe had formed in an infinitesimally different way, had a molecule collapsed or grown larger, had a butterfly been squished beneath a hunter’s boot, my life would not exist.\nI hold stardust in my palm, I think, as a few crushed bees twitch and tickle against my skin.\nI do not think this one small act has the power to affect great change. We are not at the beginning after all and the universe is expanding too quickly to catch up with it now. How insurmountable the arrogance that a crushed insect could change a presidential election (I do not believe I have ever seen an election, besides).\nFour Hundred Thirty Seven\nOn our first date I tell the man who will one day be my husband how in 1994 Sheck Exley drowned at 925 feet in Zacatón cenote trying to see what the bottom was like. I linger on the ideal percentages in his gas mixture and tell him how the total pressure exerted by a mixture of gases is equal to the sum of the pressures that would be exerted by each of those gases if they alone were present and occupied the volume. I calculated the distance and ascent rate of an exhalation on a cocktail napkin to explain how when the last of his bubbles breached the surface, Sheck’s wife must have known he had died a full ten minutes before.\n“But didn’t she jump in after him?” he asks.\n“It would have been pointless,” I say.\nOur relationship becomes a study of inverse calculations. Pressure and volume. My love for him is a steel cylinder, over-pressurized. Quantifiable, divisible into clean fractions, calculable for the prevention of oxygen toxicity and nitrogen narcosis. I do not enter a cave unless I am sure I have enough to get out. But he is decompression: a slow release of frustration and longing. Mathematically imprecise.\n“What is the most scared you’ve ever been,” he says and I tell him of the Blue Holes in the Bahamas, how a woman there likes to follow the cave divers inside, flips their line arrows around to discourage them from returning.\n“There are places one may reach,” I say, “where all exits point back to the self.”\n“So that happened to you?” he asks and I shake my head.\n“But all of us suffer the same fears. Even though I have never seen that place, I can still feel her eyes on me in the dark. Kindred spirits. Like the myth of twins who can feel when the other is in pain, or dies.”\n“In this story, are you the lost diver? Or are you the one who traps them inside, so they will never return?”\n“Can’t I be both?”\n“Why are all the mad ones women,” he laughs. “Medusa, Lusca, evil queens and scorned ex-wives.” He smiles at me and I remember smiling. I remember agreeing. I remember being foolish in a great many ways.\nLater, when I cannot clean the tell-tale blood from my hands he snaps my neck. The last thing I hear is the key hitting the floor. A small sound, less than leaves breaking, and I see there are two of him behind his eyes. One I will never understand, and the other who whispers It was a kindness.\nThe Husband’s Last Will and Testament Left on His Brother’s Answering Machine Before Lift-Off Which the First Wife Sometimes Whispers to Wife 1001 Like a Greeting, or a Prayer\nPlease take care of the dogs. Keep the house, or sell it—by the time we get back there won’t be a house left. If we get back. Tell your kids I’ll name whole galaxies after them.\nI’ve left you all our books save one. It’s her favorite and I’m thinking of sneaking it up there by hiding it in my jumpsuit. We’re not supposed to take any unauthorized items, and they tell us the sum of human history is in the computer if we get bored. But just the two us, willing to float out there alone for centuries, how can they say no?\nThe Penultimate Wife\nI enter the story knowing my husband's plans for me. He weeps as he does it; he begs forgiveness. We can be so much better than the sum of what has come before.\nHe mistakes my disinterest for his guilt as evidence that I do not know what I am, what we are, where we have been and where we were headed. It know it was a moment’s sentiment when the knife glanced against my throat and failed. A miscalculation of time and distance, a desire to wait until the last possible second.\nHe believes it is my story he is telling, dividing me into ten thousand forms, variation after variation and in this way he can keep us both alive. My consciousness hangs like silt stirred by the breath of unknown women. He hopes the sum of us will equal the whole, but looking into my eyes he must know the tiniest parts of me have been discontinued.\nI'm sorry, he says. I'm sorry. I promise not to do it again.\nHelena Bell is an occasional poet, writer, and international traveler which means that over half of what she says is completely made up, the other half is probably made up, and the third half is about the condition of the roads. She has a BA, an MFA, a JD, and a Tax LLM which fulfills her life long dream of having more letters follow her name than are actually in it. Her work has appeared or is forthcoming in Shimmer Magazine, Brain Harvest, and Rattle.", "source": "https://clarkesworldmagazine.com/bell_01_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Variations on Bluebeard and Dalton's Law Along the Event Horizon by Helena Bell"}