{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Margot Atwell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ry/GhnA/p4f4IpZeC1SqeF8Zr7w=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: Technology Creates a New Golden Age of Speculative Fiction  Typically, when readers think of technology and science fiction, they imagine spaceships, teleportation devices, and other fantastic contraptions. But technology isn’t just a great subject for sci-fi stories. Combined with new distribution methods, it has had a massive impact on genre fiction in the last decade. In that time, I’ve worked in various parts of the publishing industry: as an agent, an editor, publisher, and currently at Kickstarter, at the intersection of publishing and technology. I believe that recent intense innovation has changed what people write and read, and ushered in a new Golden Age of speculative short fiction.  For the last hundred years, trends and innovations in the publishing industry have influenced the types of writing that have been popular. Short fiction was critical to the establishment of the sci-fi genre. Many people trace the birth of modern science fiction back to Hugo Gernsback, who began “sneaking short stories into his electronics magazine [Modern Electronics],” according to Jim Freund, host of the speculative-fiction-oriented Hour of the Wolf radio show. Gernsback later founded Amazing Stories, a cheap pulp magazine where he could publish short stories openly instead of smuggling them into a venue with a different focus. Americans devoured the stories in that publication and other pulp magazines, in spite of the dubious quality of some of the work. Over time, low-paying pulp magazines gave way to digests, and editors began to approach the genre with a more critical editorial eye.  In 1939, the paperback book was introduced to the US market. Paperbacks were a cheap alternative to hardcover books—they sold for a quarter instead of $2.75, making novels accessible to a mass audience. They were more physically accessible as well: paperbacks were sold on newsstands and many other locations in addition to bookstores.  Publishing novels became more lucrative for authors than writing short fiction, and there was more cachet associated with them. Writers such as Ray Bradbury and Arthur C. Clarke were encouraged to expand their stories into novels: recognizable favorites such as Fahrenheit 451 and Childhood’s End began as works of short fiction. Over time, markets for short fiction began to dry up. Dozens of science fiction and fantasy magazines ceased publication in the 1950s.  The significant costs of developing, printing, and distributing a book meant that publishers did not find it lucrative to publish shorter works such as a stand-alone novella. So writers focused on writing novels, and short fiction typically lived in the handful of remaining magazines.  But the internet and other digital technologies have brought major changes for publishers and readers over the last decade. It might seem hard to believe, but the first SONY e-ink ebook reader was sold in the US in September 2006, with Amazon’s first Kindle device following a year later. However, in 2007, both companies’ e-readers cost around $400, which was prohibitive for most consumers. In addition, few titles were available for sale in ebook format.  2010 was a year of significant change. The cost of the Kindle and SONY e-readers dropped below $200. Barnes & Noble had launched their Nook reader the year before, and Apple introduced the first iPad. The impact of the cheaper e-readers was almost instantaneous. These devices did for books what the iPod and other MP3 players had done for music: they made digital content portable, and therefore usable.  As a publisher just dipping a toe into the uncertain waters of ebook publishing, I was amazed to see my company’s ebook sales jump ten-fold after Christmas 2010. Suddenly, for the first time, people actually owned devices they could use to read ebooks! As smartphones became ubiquitous, that accelerated the acceptance of ebooks as a viable format for readers. Robust online sales channels were developed to distribute that media, with Amazon leading the charge to provide an easy way for readers to pay for electronic content to read on their devices.  Print-on-demand technology was also improving drastically around the same time, enabling authors and publishers to put out a book without sinking tens of thousands of dollars into a print run of thousands of copies before they knew whether or not anyone would want to buy the book. The decreased cost of publishing and distributing a book or magazine meant that becoming a publisher, or publishing one’s own work, was no longer out of reach for many authors and publishing hopefuls.  These radical shifts in technology, combined with the lower capital requirements to start a publishing venture, have created fertile ground especially in the technology-friendly world of speculative fiction. Over the past decade, more than a dozen professional and semi-pro science fiction and fantasy magazines have sprung up, along with many fanzines and online publications.  Since 2005, publications such as Lightspeed Magazine, Beneath Ceaseless Skies, Apex Magazine, Uncanny Magazine, Tor.com, Forever Magazine, Clarkesworld itself, and other publications with significant or exclusively digital presences have been established. These publications have offered homes to the work of many writers writing short fiction in the speculative fiction genre, both established voices and new talents.  In addition, because the cost of establishing a publication or undertaking a project is lower, publishers and authors can take more risks. They can focus on niche subjects, or speak directly to reading communities that had previously been overlooked by publishers trying to cast the widest possible net.  Crowdfunding platforms such as Kickstarter and Patreon have also changed the publishing landscape by providing a simple, well-understood way for readers to support a project before an author or publisher commits resources to it. That means that anyone with an idea can reach out to their community to see if their project will capture the imagination of readers, instead of gambling that there will be an audience for a book once it’s published.  Projects such as the Long Hidden anthology edited by Daniel José Older and Rose Fox began as a Twitter conversation and ended up as an award-nominated anthology of over 150,000 words of short fiction “from the margins of speculative history.” The Women Destroy Science Fiction special issue of Lightspeed Magazine came into being, according to editor Christie Yant, when “we took hurt and rage and turned it into something beautiful.” In the coming years, I expect to see many more books and magazines that speak to readers who have been ignored or underserved by mainstream publishing.  The ability to publish and sell shorter works without incurring massive costs means that publishers can also experiment more with length, publishing and selling novellas, novelettes, and even single short stories. Tor.com Publishing has established a line specifically to publish novellas and short novels. Hugh Howey’s wildly popular novel, Wool, began as a stand-alone short story published via Amazon’s Kindle Direct Publishing. He later expanded it, experimenting with serial publishing to great success.  Very short stories and flash fiction, sold in collections or magazines or published online, are appealing to busy readers who want bite-size entertainment for their commute or while waiting for an appointment. O. Westin (@MicroSFF) tweets “very short, single-tweet, original science fiction/fantasy stories” for readers who are really in a hurry!  Social media has also given readers a direct way to follow the careers of the writers they love. Like old-school author fan clubs, Twitter and Facebook let fans support and follow writers. Connecting through these online channels can feel more intimate, more like a two-sided relationship between author and reader. What’s more, authors can communicate with readers when they sell a story to a publication or when an anthology features their work, so readers can discover and support these creative ventures.  Traditional publishers seem to be noticing this trend of great short fiction, as the past year has seen the introduction of at least two year’s best anthologies in the science fiction and fantasy genres: The Best American Science Fiction and Fantasy series, edited by John Joseph Adams and various co-editors, and the forthcoming The Best Science Fiction of the Year, edited by Clarkesworld editor Neil Clarke. These series will provide further opportunities for writers in the speculative fiction genre, and bring greater attention to these stories and the publications where they originate.  Ultimately, all these changes mean more options for readers: More stories, and more ways to read. A greater diversity of writers’ voices and subjects. And more ways for readers’ own voices to be heard by the people creating and publishing all of this literary abundance.  These technological changes have created a new Golden Age of speculative fiction in a variety of forms, which will help bring new readers into the genre and keep current readers intrigued, challenged, and entertained. I can’t wait to see how further innovation is adopted by publishers and authors in the service of connecting great stories with readers. Margot Atwell works with publishers and authors as the Publishing Lead at Kickstarter. She is the author of Derby Life: A Crash Course in the Incredible Sport of Roller Derby and co-author of The Insider's Guide to Book Publishing Success, along with articles for SF Signal, Moviefone, Derbylife.com, Publishing Perspectives, Publishers Weekly, and The Huffington Post. She is also the publisher at Gutpunch Press. She lives in Brooklyn and tweets as @MargotAtwell.", "text": "Non-Fiction\nAnother Word: Technology Creates a New Golden Age of Speculative Fiction\nTypically, when readers think of technology and science fiction, they imagine spaceships, teleportation devices, and other fantastic contraptions. But technology isn’t just a great subject for sci-fi stories. Combined with new distribution methods, it has had a massive impact on genre fiction in the last decade. In that time, I’ve worked in various parts of the publishing industry: as an agent, an editor, publisher, and currently at Kickstarter, at the intersection of publishing and technology. I believe that recent intense innovation has changed what people write and read, and ushered in a new Golden Age of speculative short fiction.\nFor the last hundred years, trends and innovations in the publishing industry have influenced the types of writing that have been popular. Short fiction was critical to the establishment of the sci-fi genre. Many people trace the birth of modern science fiction back to Hugo Gernsback, who began “sneaking short stories into his electronics magazine [Modern Electronics],” according to Jim Freund, host of the speculative-fiction-oriented Hour of the Wolf radio show. Gernsback later founded Amazing Stories, a cheap pulp magazine where he could publish short stories openly instead of smuggling them into a venue with a different focus. Americans devoured the stories in that publication and other pulp magazines, in spite of the dubious quality of some of the work. Over time, low-paying pulp magazines gave way to digests, and editors began to approach the genre with a more critical editorial eye.\nIn 1939, the paperback book was introduced to the US market. Paperbacks were a cheap alternative to hardcover books—they sold for a quarter instead of $2.75, making novels accessible to a mass audience. They were more physically accessible as well: paperbacks were sold on newsstands and many other locations in addition to bookstores.\nPublishing novels became more lucrative for authors than writing short fiction, and there was more cachet associated with them. Writers such as Ray Bradbury and Arthur C. Clarke were encouraged to expand their stories into novels: recognizable favorites such as Fahrenheit 451 and Childhood’s End began as works of short fiction. Over time, markets for short fiction began to dry up. Dozens of science fiction and fantasy magazines ceased publication in the 1950s.\nThe significant costs of developing, printing, and distributing a book meant that publishers did not find it lucrative to publish shorter works such as a stand-alone novella. So writers focused on writing novels, and short fiction typically lived in the handful of remaining magazines.\nBut the internet and other digital technologies have brought major changes for publishers and readers over the last decade. It might seem hard to believe, but the first SONY e-ink ebook reader was sold in the US in September 2006, with Amazon’s first Kindle device following a year later. However, in 2007, both companies’ e-readers cost around $400, which was prohibitive for most consumers. In addition, few titles were available for sale in ebook format.\n2010 was a year of significant change. The cost of the Kindle and SONY e-readers dropped below $200. Barnes & Noble had launched their Nook reader the year before, and Apple introduced the first iPad. The impact of the cheaper e-readers was almost instantaneous. These devices did for books what the iPod and other MP3 players had done for music: they made digital content portable, and therefore usable.\nAs a publisher just dipping a toe into the uncertain waters of ebook publishing, I was amazed to see my company’s ebook sales jump ten-fold after Christmas 2010. Suddenly, for the first time, people actually owned devices they could use to read ebooks! As smartphones became ubiquitous, that accelerated the acceptance of ebooks as a viable format for readers. Robust online sales channels were developed to distribute that media, with Amazon leading the charge to provide an easy way for readers to pay for electronic content to read on their devices.\nPrint-on-demand technology was also improving drastically around the same time, enabling authors and publishers to put out a book without sinking tens of thousands of dollars into a print run of thousands of copies before they knew whether or not anyone would want to buy the book. The decreased cost of publishing and distributing a book or magazine meant that becoming a publisher, or publishing one’s own work, was no longer out of reach for many authors and publishing hopefuls.\nThese radical shifts in technology, combined with the lower capital requirements to start a publishing venture, have created fertile ground especially in the technology-friendly world of speculative fiction. Over the past decade, more than a dozen professional and semi-pro science fiction and fantasy magazines have sprung up, along with many fanzines and online publications.\nSince 2005, publications such as Lightspeed Magazine, Beneath Ceaseless Skies, Apex Magazine, Uncanny Magazine, Tor.com, Forever Magazine, Clarkesworld itself, and other publications with significant or exclusively digital presences have been established. These publications have offered homes to the work of many writers writing short fiction in the speculative fiction genre, both established voices and new talents.\nIn addition, because the cost of establishing a publication or undertaking a project is lower, publishers and authors can take more risks. They can focus on niche subjects, or speak directly to reading communities that had previously been overlooked by publishers trying to cast the widest possible net.\nCrowdfunding platforms such as Kickstarter and Patreon have also changed the publishing landscape by providing a simple, well-understood way for readers to support a project before an author or publisher commits resources to it. That means that anyone with an idea can reach out to their community to see if their project will capture the imagination of readers, instead of gambling that there will be an audience for a book once it’s published.\nProjects such as the Long Hidden anthology edited by Daniel José Older and Rose Fox began as a Twitter conversation and ended up as an award-nominated anthology of over 150,000 words of short fiction “from the margins of speculative history.” The Women Destroy Science Fiction special issue of Lightspeed Magazine came into being, according to editor Christie Yant, when “we took hurt and rage and turned it into something beautiful.” In the coming years, I expect to see many more books and magazines that speak to readers who have been ignored or underserved by mainstream publishing.\nThe ability to publish and sell shorter works without incurring massive costs means that publishers can also experiment more with length, publishing and selling novellas, novelettes, and even single short stories. Tor.com Publishing has established a line specifically to publish novellas and short novels. Hugh Howey’s wildly popular novel, Wool, began as a stand-alone short story published via Amazon’s Kindle Direct Publishing. He later expanded it, experimenting with serial publishing to great success.\nVery short stories and flash fiction, sold in collections or magazines or published online, are appealing to busy readers who want bite-size entertainment for their commute or while waiting for an appointment. O. Westin (@MicroSFF) tweets “very short, single-tweet, original science fiction/fantasy stories” for readers who are really in a hurry!\nSocial media has also given readers a direct way to follow the careers of the writers they love. Like old-school author fan clubs, Twitter and Facebook let fans support and follow writers. Connecting through these online channels can feel more intimate, more like a two-sided relationship between author and reader. What’s more, authors can communicate with readers when they sell a story to a publication or when an anthology features their work, so readers can discover and support these creative ventures.\nTraditional publishers seem to be noticing this trend of great short fiction, as the past year has seen the introduction of at least two year’s best anthologies in the science fiction and fantasy genres: The Best American Science Fiction and Fantasy series, edited by John Joseph Adams and various co-editors, and the forthcoming The Best Science Fiction of the Year, edited by Clarkesworld editor Neil Clarke. These series will provide further opportunities for writers in the speculative fiction genre, and bring greater attention to these stories and the publications where they originate.\nUltimately, all these changes mean more options for readers: More stories, and more ways to read. A greater diversity of writers’ voices and subjects. And more ways for readers’ own voices to be heard by the people creating and publishing all of this literary abundance.\nThese technological changes have created a new Golden Age of speculative fiction in a variety of forms, which will help bring new readers into the genre and keep current readers intrigued, challenged, and entertained. I can’t wait to see how further innovation is adopted by publishers and authors in the service of connecting great stories with readers.\nMargot Atwell works with publishers and authors as the Publishing Lead at Kickstarter. She is the author of Derby Life: A Crash Course in the Incredible Sport of Roller Derby and co-author of The Insider's Guide to Book Publishing Success, along with articles for SF Signal, Moviefone, Derbylife.com, Publishing Perspectives, Publishers Weekly, and The Huffington Post. She is also the publisher at Gutpunch Press. She lives in Brooklyn and tweets as @MargotAtwell.", "source": "https://clarkesworldmagazine.com/another_word_04_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Technology Creates a New Golden Age of Speculative Fiction by Margot Atwell"}