{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "vdsQ0qbeNy491q3YQQtZWDx8mHc=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Eyewitness to History's Future: A Conversation with Kim Stanley Robinson  Well known for his award-winning trilogy about terraforming Mars with Red Mars in 1992, Green Mars in 1993, and Blue Mars in 1996, Kim Stanley Robinson’s first novel, The Wild Shore, came out in 1984. The Wild Shore was the first book for his Orange County trilogy as well as the first title in Ace Book’s revived “Science Fiction Specials” line, which was devoted to first novels and edited by Terry Carr. In 1984, Ace also published Robinson’s Icehenge, “ . . . three stories connected through time, two of which were published before and significantly revised for the novel, and one written for the novel.”  Long before his career as a novelist began (over twenty novels so far), Robinson sold his first stories—novelette “Coming Back to Dixieland” and short story “In Pierson’s Orchestra”—to editor Damon Knight for the 1976 anthology Orbit 18. He continued to sell stories to Knight and Kate Wilhelm until 1981’s Universe 11 anthology, edited by Terry Carr, which had Robinson’s short story “Venice Drowned.” That story earned him his first Nebula Award nomination.  The Magazine of Fantasy and Science Fiction published Robinson’s novella “Black Air” in their March 1983 issue. Not only did the novella take first place in SF Chronicle’s poll, it won Robinson a World Fantasy Award. Robinson’s work has made regular appearances on major awards lists and readers polls since, including the Tiptree, Clarke, Locus, Nebula, and Hugo awards, as well as international lists such as the Seiun, the Kurd Laßwitz, the Ignotus, the Grand prix de l'Imaginaire, the BSFA, and more. Recent accolades include a 2013 Nebula Award for Best Novel for 2312, an Arthur C. Clarke Award for Imagination in Service to Society in 2017, and having an asteroid named after him.  Robinson grew up in Orange County, CA. He earned a BA in literature from UC San Diego and a master’s in English from Boston University. He went to Clarion in 1975, then returned to UC San Diego to get his PhD in literature. His doctoral thesis was published as The Novels of Philip K. Dick in 1984. He is known for his interests in utopian and ecological issues, and is regarded among his peers as both erudite and personable. His work is considered to be both imaginative and scientifically rigorous. He lives in Davis, CA, but his recent favorite activity is building a lakefront rock wall at his wife’s family place in Maine, “rebuilding what her grandfather did—it falls down every winter in the freeze-thaw cycles.” His newest novel is titled The Ministry for the Future, available from Orbit Books on October 6th, 2020.   In your previous 2015 Clarkesworld interview, you called yourself a science fiction “patriot.” What are a few of the SF classics that still stand as important to you, what sort of impact did they have on you when you first read them, and are there reasons people should pick them up today?  This could go on quite a long time, as I have a personal SF canon that remains very meaningful to me. I keep those books on a shelf in my living room, along with a shelf that has my non-SF novel canon, also a poetry canon, and a nonfiction canon. It’s just for the fun of looking at those books.  Anyway, I came to SF during the New Wave and many of those books changed me for good, and turned me into an SF writer, and still speak to me. Le Guin’s The Left Hand of Darkness and The Dispossessed, Russ’ The Female Man—these should still be read by everyone. I also loved Delany’s Dhalgren, and Wolfe’s The Fifth Head of Cerberus, and Lem’s Solaris. I could go on and on, and maybe I should mention Olaf Stapledon’s Star Maker as the mind-boggler it will always be, and mention also the great writers of the 1950s, like PKD and Pangborn. But best to say, the SF of the New Wave period remains for me the high point in the history of the genre, in literary and political terms. They were life changing.  In 1984, your first novel, The Wild Shore, was nominated for a Nebula Award and won the Locus Award for Best First Novel. Even before this your shorter work was landing on awards ballots. Decades later your work is still widely read, still winning awards, and still amassing accolades. How do you not only stay relevant in science fiction, but actually stay successful, over such a span of time?  I like to write. Also, I’ve been lucky. I was lucky in my teachers, and lucky to meet and marry Lisa. Living with a working scientist and being the home parent for our kids were both great experiences for writing science fiction. And I was lucky in the editors I’ve worked with, from Damon Knight right through to Tim Holman; they all encouraged me and helped me, and got my books out there.  Also, I like to read. And I work a lot, but it doesn’t feel like work, because I enjoy making sentences and stories. I’d rather do it than not. Maybe it helps to live in a very boring town—there’s nothing better to do. In any case, I like the work. I’d rather be in the middle of a novel, wrestling with a big problem, than be finished with it; so when I finish one, I start another one. And the ideas keep coming.  Then lastly, my readers are generous. I write with the idea of a reader who likes to work hard to unpack a novel, so that the book becomes a kind of imaginative collaboration between writer and reader. I read that way myself and imagine there are other readers like me, as clearly there are. So, I’ve pushed, and kept trying new things, and some risks I’ve taken have paid off, because of my readers.  What was breaking in for you, how did it happen? Were there struggles or has it been a fairly easy journey?  Breaking in was relatively easy, because Damon Knight liked my stories and he was buying them for Orbit. While I went to graduate school, and was only writing a couple of stories a year, he was buying them, and that was enough to give me the feeling I was a professional writer, and to pursue that profession with all my efforts. Suddenly being an English major had a point beyond its semireligious aspect. Graduate school and my various jobs, teaching freshman composition, working in a bookstore and other retail, all these were tailored toward the end of being a writer. The early encouragement from Damon was crucial.  In fact, speaking of breaking in, my wife and I just recently drove past the spot on Highway 80 in Wyoming where I spent the night after calling my parents and learning I had sold my first story to Damon. This was on my drive east to go to college in Boston. There’s a rest stop at the highest point on Highway 80 that has a gigantic statue of Lincoln’s head perched on a granite plinth over the highway, and I slept in the parking lot under it that night, on the sidewalk beside my car, and read Fritz Leiber’s “Gonna Roll the Bones” from Dangerous Visions by the light of a parking lot streetlamp, under Lincoln’s giant bronze head. That was a great way to start.  After that, well, it’s been so long, there’s definitely been ups and downs, a kind of roller coaster in fact, but after the downs something always happened to drag things back up again. And truthfully, since I started to work with Tim Holman and Orbit Books, which began in late 2009, it’s been continuously good. I owe an awful lot to Tim and the whole crew at Orbit—in effect they’ve given me my sixties, and artists don’t always get their sixties, so that’s been a blessing and an opportunity.  Looking over your career, were there books that almost didn’t happen for one reason or another, or titles that you felt strongly about but which didn’t see the sort of reception you’d thought they’d merited?  I can’t think of any books that almost didn’t happen, because I’ve always had a small group of ideas for novels jostling in my head, and when I finished one, I’d pick the next one that seemed ready, and get on with it. I’ve never consulted with anyone as to which book I should write, until this last decade working with Tim Holman, who has been a big help to me in sorting out which of the various alternatives I should do next. There’s a couple more ideas I have that I haven’t written yet, but there’s nothing in the way of me writing them, except that I haven’t gotten to them yet.  As for comparatively neglected books, yes, I do have a couple favorites that haven’t had as many readers as some of my others, which I regret. But on the other hand, I think they’ve had some happy readers, and more will come to them as part of reading my overall body of work, if readers are interested. So, this isn’t any kind of powerful feeling, but I would enjoy thinking there were more readers for Galileo’s Dream and Shaman. I’m very fond of both of them, and they have their advocates, but more would be nice.  In the aforementioned interview, you and Alvaro Zinos-Amaro talked about your works as being in conversation with other science fiction works, and your contributions to genre in that sense. Do you see a relationship or conversation between your new book, The Ministry for the Future, and specific titles?  Wow, that’s a hard one. I’m pondering that and not coming up with anything right away. Not that many novelists are foolish enough to try what that book tries. But I will say that in figuring out a way to tell that story, I discovered what I think is a distinct genre, which is the eyewitness account, and that was a real find for me. There are collections of these eyewitness accounts, often clustered around some event (like the spring 1945 in Germany), although one is just called Eyewitness to History (it’s not very good compared to the more targeted ones). What I found is that eyewitnesses don’t dramatize their accounts like fiction writers would. They don’t give you dramatized scenes, in other words, but instead they offer summarized accounts, often made years later, so that a lot of compression happens, but key moments remain, and judgments are made, this is very important; the event is seen as important, and put into the context of the eyewitness’ subsequent life, and so on. In effect it’s telling not showing, and I like that very much; the workshop phrase “show don’t tell” is actually a very silly and simplistic instruction, and much bad fiction has come out of writing workshops because of people trying to enact this command. Eyewitness accounts are often vivid in ways a dramatized scene isn’t. Anyway, I got interested in writing a whole lot of fictional eyewitness accounts to describe my invented near future, and that was the key to that book. It felt like a tremendous discovery.  In chapter two of The Ministry for the Future, it reads like a prose poem, invoking a certain power through structure and voice. Can you talk a bit about writing this piece, and perhaps your relationship to poetry?  Yes, thanks for that—I love poetry, and keep trying to write it, though I am not good at it. But it’s fun to try. And in many chapters of The Ministry for the Future, I’ve tried various kinds of writing that are like prose poems, often in the form of riddles. About a third of the Anglo-Saxon literature we have is their riddles, often without answers provided, and that was another genre I found very helpful in writing this book. Also, I included mini-essays that can be like prose poems, and conversations between a smooth radio host and a grumpy commentator, and transcripts of meetings, and a few other forms. I wanted a mélange of voices and styles. For the riddles, I first included them without their answers, but my editor Tim Holman suggested this might be distracting and frustrating for readers, and when I went back to look I found that I myself couldn’t figure some of them out, so I took his point, and provided the answers to all but a couple of them. Then also, my teacher Fredric Jameson, to whom the book is dedicated, read a draft and suggested it was important that the second chapter be as different as possible in form from the first, to show readers what kind of game they were being invited to play. That was a good suggestion, which I took.  As for poetry, I mainly read single-author collections, a couple poems a night before falling asleep. Most recently it was John Ashbery, who is very good, although maybe better taken a poem at a time, every few months or so. His influence on later poets is perhaps a little unfortunate; it’s often better to make more sense than he does. Few can pull off his wandering syntax and thinking. I like Chinese landscape poetry, and tend to write poems that pretend to be translated out of Chinese, which gives me some cover for my simplicities. W. S. Merwin is one of my favorite poets, and I’m always reading the poetry of another teacher of mine, Gary Snyder. And I keep coming back to Emily Dickinson, as I’m thinking of assembling a selection of her poems, which would be the ones I understand—a pretty slim volume, but so very powerful.  The book opens in Uttar Pradesh with a scene that evokes a similar dread-feeling to refined horror. Why Uttar Pradesh as an opening setting?  It’s one of the places most susceptible to the increasingly deadly heat waves we are headed toward. So are many other places, like the US Gulf Coast, but I wanted India to be a big factor in this future history I was describing, even though the novel is mostly set in Zurich. But India is a big force, and will more and more be a major player in world history. Or so it seems. Anyway, having put the opening scene there, I had to keep coming back to India, to see what impact the event had.  A lot of your work deals with non-US cultures and settings. Are there specific challenges or pitfalls to utilizing these settings, and how do you deal with those challenges?  It’s a risk. The problem is my ignorance. I’m a Californian, and I’ve done some traveling, but not that much. And Lisa and I lived for two years in Zurich, which I’ve finally gotten into a book. And I’m a white male American born in 1952, so these are facts that set a lot of constraints and so on. So, I just try my best and hope for the best. Fiction is not self-expression. It’s based on writing the other. This is a shocking thing to try, really, but that’s what fiction tries, that’s what novels are. And I love novels. They are my religion, you might say—they are the way I make meaning out of the world. I don’t like memoirs. I did this, I did that—no. I don’t like memoir, I don’t even like travel writing. I like novels. So, every novelist has to take that leap into the unknown, of writing the other. You can of course base your novels on your own life, I’ve done that, occasionally, or you can write about peoples and places you have no direct experience with, I’ve done more often. Good novels can come out of both methods, although for me, I’ve had better luck staying away from my own life and trying to write others who are very much other. Although really even your own sibling, or yourself at an earlier time, is always an other. But I like to try to imagine what other lives might be like. I like that feeling.  One way to avoid the pitfalls of one’s inevitable ignorance is to ask for help and get readers who know more than I do to read drafts of my books and tell me what they think, make corrections and suggestions. Generous helpers have given me their time and thoughts, and my books have been better for it. But in the end the stories are mine, and what I imagine of these other places and times and people is simply my imagination of what they might be like. It’s no more than that. But I would suggest that in trying to imagine the other, even if you’re always failing, you are engaged in a good thing to try. And if you are going to try to write a novel, you’re stuck with that trying no matter what your theories are. This is why science fiction with all its wild leaps is just as valid a form of literature as any other kind—they’re all leaps.  The Ministry for the Future itself is predicated on the idea of the rights of people who aren’t yet born. Do you feel like here in the US, generally speaking, our culture is fairly concerned with the rights of future generations? Or is ours a culture of individualism, and in that individualism, the rights of others stand as less important, let alone the rights of future generations?  Good question. Solidarity with other people gets expressed in very concrete material ways that aren’t always noticed or talked about or remembered in our discourse. So, we talk about individualism in American culture, some people a little bit too much so, but no one could actually get by on their own in this world, it’s a vast eight billion-person collaboration, improvised and awkward, but very real. So, sticking to the level of discourse, there’s a lot of talk in the US about individual rights, and a lot of selfish behaviors too, which will damage the lives of people yet to come. Not good. It would be better to remember our descendants and act on their behalf. I like Aldo Leopold here: what’s good is what’s good for the land. This is a good working ethic, since the land supports us and will be needed by future generations for their support too. We can’t do without it. It’s good to remember that. A certain wing of science fiction is not good at remembering that—likes to pretend to forget it. Oh well—they can upload themselves into computers, or fly away in spaceships, and be fine. Good luck; and sometimes it makes for good stories too, so fair enough. But if SF is thinking about the future, which sometimes it is, these aren’t very useful thoughts. Except fun can be useful too, so, whatever.  There’s a strong sense of a political stance in this book, a look at global history from a specific perspective. Do you feel like taking a stand or making a statement is important in fiction, is it perhaps inevitable?  I think all novels inevitably contain a political or social statement, but often it’s just inherent or implied, and that’s fine. They’re works of art, and art is meant to be fun and educational both at once. Aristotle is very clear on this, and Brecht also—that we maybe separate these strands a little bit too much when we discuss them—that education can be fun, and fun can be educational, and what you want is to combine the two to make some kind of delight that is also illuminating or useful. For me, novels are about characters engaged in a plot, which usually means something has gone wrong. Then you have your story. Mainly I want to tell interesting stories. The question then becomes, what’s interesting?  Your books tend to be heavily researched, grounded in science, and often involve travel to the locales in question. Do you have any favorite bits of research or interesting experiences that didn’t make it into the final text of The Ministry for the Future for one reason or another?  Almost everything got into that novel, it’s a real kitchen sink, but I did consider a scuba diving scene down a moulin to the underside of a glacier in Antarctica, but decided that would be a bridge too far, in terms of realism and craziness. I did get to return to Antarctica in 2016, which I put into this book quite a bit, that was really fun. I love Antarctica and hope to return. It’s easy travel to other planets, to quote an old title (that book was actually about falling in love with a dolphin).  Beyond the blurbs and the reviews, is there anything you really want readers to know about this book?  I guess I’d like to suggest there are ways of going forward in the next few decades that dodge the mass extinction event we’re headed toward now, achievable futures that are not horrible—not fascistic or totally disastrous—livable futures that you might still be able to believe in. So, for a while I was thinking this book would be something like the blackest utopia of all time, but it isn’t really utopian, nor is it all that black, it’s just history, an unholy mess, and the book an attempt to indicate how chaotic the next thirty years are going to feel, even if things go fairly well compared to worse scenarios, which are maybe more likely. But there is a general intellect in civilization itself, and the Paris Agreement exists, which is already quite implausible, so you can see that people really are taking the situation seriously. We might squeak out of the century with most of the other species still with us, although that would have to be our main goal for it to happen. I hope it will be.  For this novel, I guess I’d add that solving the formal problem, by way of the eyewitness accounts and all the other modes I used, is my next step, maybe the last step, in a long move toward polyphony—the idea that the novel can take on a huge load of material without sinking—or not completely sinking, maybe submarining along, who knows—anyway, I really enjoyed the feeling this time of channeling voices, of being the telephone operator in one of those 1940s movies, jamming the plugs into the big board and linking up voices of all kinds. That’s the great fun of writing novels, for me, so this one was quite something to write.  What are you working on now?  I’m writing a nonfiction book about the Sierra Nevada of California. It has elements of geology, history, backpacking technique, routes to take, and memoir. So, there’s just the kind of travel book and memoir in it that I said I didn’t like to read, but somehow, I’m compelled to do it this one time, and it’s been very absorbing. Kind of a portrait of the artist as young mountain rambler. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nEyewitness to History's Future: A Conversation with Kim Stanley Robinson\nWell known for his award-winning trilogy about terraforming Mars with Red Mars in 1992, Green Mars in 1993, and Blue Mars in 1996, Kim Stanley Robinson’s first novel, The Wild Shore, came out in 1984. The Wild Shore was the first book for his Orange County trilogy as well as the first title in Ace Book’s revived “Science Fiction Specials” line, which was devoted to first novels and edited by Terry Carr. In 1984, Ace also published Robinson’s Icehenge, “ . . . three stories connected through time, two of which were published before and significantly revised for the novel, and one written for the novel.”\nLong before his career as a novelist began (over twenty novels so far), Robinson sold his first stories—novelette “Coming Back to Dixieland” and short story “In Pierson’s Orchestra”—to editor Damon Knight for the 1976 anthology Orbit 18. He continued to sell stories to Knight and Kate Wilhelm until 1981’s Universe 11 anthology, edited by Terry Carr, which had Robinson’s short story “Venice Drowned.” That story earned him his first Nebula Award nomination.\nThe Magazine of Fantasy and Science Fiction published Robinson’s novella “Black Air” in their March 1983 issue. Not only did the novella take first place in SF Chronicle’s poll, it won Robinson a World Fantasy Award. Robinson’s work has made regular appearances on major awards lists and readers polls since, including the Tiptree, Clarke, Locus, Nebula, and Hugo awards, as well as international lists such as the Seiun, the Kurd Laßwitz, the Ignotus, the Grand prix de l'Imaginaire, the BSFA, and more. Recent accolades include a 2013 Nebula Award for Best Novel for 2312, an Arthur C. Clarke Award for Imagination in Service to Society in 2017, and having an asteroid named after him.\nRobinson grew up in Orange County, CA. He earned a BA in literature from UC San Diego and a master’s in English from Boston University. He went to Clarion in 1975, then returned to UC San Diego to get his PhD in literature. His doctoral thesis was published as The Novels of Philip K. Dick in 1984. He is known for his interests in utopian and ecological issues, and is regarded among his peers as both erudite and personable. His work is considered to be both imaginative and scientifically rigorous. He lives in Davis, CA, but his recent favorite activity is building a lakefront rock wall at his wife’s family place in Maine, “rebuilding what her grandfather did—it falls down every winter in the freeze-thaw cycles.” His newest novel is titled The Ministry for the Future, available from Orbit Books on October 6th, 2020.\nIn your previous 2015 Clarkesworld interview, you called yourself a science fiction “patriot.” What are a few of the SF classics that still stand as important to you, what sort of impact did they have on you when you first read them, and are there reasons people should pick them up today?\nThis could go on quite a long time, as I have a personal SF canon that remains very meaningful to me. I keep those books on a shelf in my living room, along with a shelf that has my non-SF novel canon, also a poetry canon, and a nonfiction canon. It’s just for the fun of looking at those books.\nAnyway, I came to SF during the New Wave and many of those books changed me for good, and turned me into an SF writer, and still speak to me. Le Guin’s The Left Hand of Darkness and The Dispossessed, Russ’ The Female Man—these should still be read by everyone. I also loved Delany’s Dhalgren, and Wolfe’s The Fifth Head of Cerberus, and Lem’s Solaris. I could go on and on, and maybe I should mention Olaf Stapledon’s Star Maker as the mind-boggler it will always be, and mention also the great writers of the 1950s, like PKD and Pangborn. But best to say, the SF of the New Wave period remains for me the high point in the history of the genre, in literary and political terms. They were life changing.\nIn 1984, your first novel, The Wild Shore, was nominated for a Nebula Award and won the Locus Award for Best First Novel. Even before this your shorter work was landing on awards ballots. Decades later your work is still widely read, still winning awards, and still amassing accolades. How do you not only stay relevant in science fiction, but actually stay successful, over such a span of time?\nI like to write. Also, I’ve been lucky. I was lucky in my teachers, and lucky to meet and marry Lisa. Living with a working scientist and being the home parent for our kids were both great experiences for writing science fiction. And I was lucky in the editors I’ve worked with, from Damon Knight right through to Tim Holman; they all encouraged me and helped me, and got my books out there.\nAlso, I like to read. And I work a lot, but it doesn’t feel like work, because I enjoy making sentences and stories. I’d rather do it than not. Maybe it helps to live in a very boring town—there’s nothing better to do. In any case, I like the work. I’d rather be in the middle of a novel, wrestling with a big problem, than be finished with it; so when I finish one, I start another one. And the ideas keep coming.\nThen lastly, my readers are generous. I write with the idea of a reader who likes to work hard to unpack a novel, so that the book becomes a kind of imaginative collaboration between writer and reader. I read that way myself and imagine there are other readers like me, as clearly there are. So, I’ve pushed, and kept trying new things, and some risks I’ve taken have paid off, because of my readers.\nWhat was breaking in for you, how did it happen? Were there struggles or has it been a fairly easy journey?\nBreaking in was relatively easy, because Damon Knight liked my stories and he was buying them for Orbit. While I went to graduate school, and was only writing a couple of stories a year, he was buying them, and that was enough to give me the feeling I was a professional writer, and to pursue that profession with all my efforts. Suddenly being an English major had a point beyond its semireligious aspect. Graduate school and my various jobs, teaching freshman composition, working in a bookstore and other retail, all these were tailored toward the end of being a writer. The early encouragement from Damon was crucial.\nIn fact, speaking of breaking in, my wife and I just recently drove past the spot on Highway 80 in Wyoming where I spent the night after calling my parents and learning I had sold my first story to Damon. This was on my drive east to go to college in Boston. There’s a rest stop at the highest point on Highway 80 that has a gigantic statue of Lincoln’s head perched on a granite plinth over the highway, and I slept in the parking lot under it that night, on the sidewalk beside my car, and read Fritz Leiber’s “Gonna Roll the Bones” from Dangerous Visions by the light of a parking lot streetlamp, under Lincoln’s giant bronze head. That was a great way to start.\nAfter that, well, it’s been so long, there’s definitely been ups and downs, a kind of roller coaster in fact, but after the downs something always happened to drag things back up again. And truthfully, since I started to work with Tim Holman and Orbit Books, which began in late 2009, it’s been continuously good. I owe an awful lot to Tim and the whole crew at Orbit—in effect they’ve given me my sixties, and artists don’t always get their sixties, so that’s been a blessing and an opportunity.\nLooking over your career, were there books that almost didn’t happen for one reason or another, or titles that you felt strongly about but which didn’t see the sort of reception you’d thought they’d merited?\nI can’t think of any books that almost didn’t happen, because I’ve always had a small group of ideas for novels jostling in my head, and when I finished one, I’d pick the next one that seemed ready, and get on with it. I’ve never consulted with anyone as to which book I should write, until this last decade working with Tim Holman, who has been a big help to me in sorting out which of the various alternatives I should do next. There’s a couple more ideas I have that I haven’t written yet, but there’s nothing in the way of me writing them, except that I haven’t gotten to them yet.\nAs for comparatively neglected books, yes, I do have a couple favorites that haven’t had as many readers as some of my others, which I regret. But on the other hand, I think they’ve had some happy readers, and more will come to them as part of reading my overall body of work, if readers are interested. So, this isn’t any kind of powerful feeling, but I would enjoy thinking there were more readers for Galileo’s Dream and Shaman. I’m very fond of both of them, and they have their advocates, but more would be nice.\nIn the aforementioned interview, you and Alvaro Zinos-Amaro talked about your works as being in conversation with other science fiction works, and your contributions to genre in that sense. Do you see a relationship or conversation between your new book, The Ministry for the Future, and specific titles?\nWow, that’s a hard one. I’m pondering that and not coming up with anything right away. Not that many novelists are foolish enough to try what that book tries. But I will say that in figuring out a way to tell that story, I discovered what I think is a distinct genre, which is the eyewitness account, and that was a real find for me. There are collections of these eyewitness accounts, often clustered around some event (like the spring 1945 in Germany), although one is just called Eyewitness to History (it’s not very good compared to the more targeted ones). What I found is that eyewitnesses don’t dramatize their accounts like fiction writers would. They don’t give you dramatized scenes, in other words, but instead they offer summarized accounts, often made years later, so that a lot of compression happens, but key moments remain, and judgments are made, this is very important; the event is seen as important, and put into the context of the eyewitness’ subsequent life, and so on. In effect it’s telling not showing, and I like that very much; the workshop phrase “show don’t tell” is actually a very silly and simplistic instruction, and much bad fiction has come out of writing workshops because of people trying to enact this command. Eyewitness accounts are often vivid in ways a dramatized scene isn’t. Anyway, I got interested in writing a whole lot of fictional eyewitness accounts to describe my invented near future, and that was the key to that book. It felt like a tremendous discovery.\nIn chapter two of The Ministry for the Future, it reads like a prose poem, invoking a certain power through structure and voice. Can you talk a bit about writing this piece, and perhaps your relationship to poetry?\nYes, thanks for that—I love poetry, and keep trying to write it, though I am not good at it. But it’s fun to try. And in many chapters of The Ministry for the Future, I’ve tried various kinds of writing that are like prose poems, often in the form of riddles. About a third of the Anglo-Saxon literature we have is their riddles, often without answers provided, and that was another genre I found very helpful in writing this book. Also, I included mini-essays that can be like prose poems, and conversations between a smooth radio host and a grumpy commentator, and transcripts of meetings, and a few other forms. I wanted a mélange of voices and styles. For the riddles, I first included them without their answers, but my editor Tim Holman suggested this might be distracting and frustrating for readers, and when I went back to look I found that I myself couldn’t figure some of them out, so I took his point, and provided the answers to all but a couple of them. Then also, my teacher Fredric Jameson, to whom the book is dedicated, read a draft and suggested it was important that the second chapter be as different as possible in form from the first, to show readers what kind of game they were being invited to play. That was a good suggestion, which I took.\nAs for poetry, I mainly read single-author collections, a couple poems a night before falling asleep. Most recently it was John Ashbery, who is very good, although maybe better taken a poem at a time, every few months or so. His influence on later poets is perhaps a little unfortunate; it’s often better to make more sense than he does. Few can pull off his wandering syntax and thinking. I like Chinese landscape poetry, and tend to write poems that pretend to be translated out of Chinese, which gives me some cover for my simplicities. W. S. Merwin is one of my favorite poets, and I’m always reading the poetry of another teacher of mine, Gary Snyder. And I keep coming back to Emily Dickinson, as I’m thinking of assembling a selection of her poems, which would be the ones I understand—a pretty slim volume, but so very powerful.\nThe book opens in Uttar Pradesh with a scene that evokes a similar dread-feeling to refined horror. Why Uttar Pradesh as an opening setting?\nIt’s one of the places most susceptible to the increasingly deadly heat waves we are headed toward. So are many other places, like the US Gulf Coast, but I wanted India to be a big factor in this future history I was describing, even though the novel is mostly set in Zurich. But India is a big force, and will more and more be a major player in world history. Or so it seems. Anyway, having put the opening scene there, I had to keep coming back to India, to see what impact the event had.\nA lot of your work deals with non-US cultures and settings. Are there specific challenges or pitfalls to utilizing these settings, and how do you deal with those challenges?\nIt’s a risk. The problem is my ignorance. I’m a Californian, and I’ve done some traveling, but not that much. And Lisa and I lived for two years in Zurich, which I’ve finally gotten into a book. And I’m a white male American born in 1952, so these are facts that set a lot of constraints and so on. So, I just try my best and hope for the best. Fiction is not self-expression. It’s based on writing the other. This is a shocking thing to try, really, but that’s what fiction tries, that’s what novels are. And I love novels. They are my religion, you might say—they are the way I make meaning out of the world. I don’t like memoirs. I did this, I did that—no. I don’t like memoir, I don’t even like travel writing. I like novels. So, every novelist has to take that leap into the unknown, of writing the other. You can of course base your novels on your own life, I’ve done that, occasionally, or you can write about peoples and places you have no direct experience with, I’ve done more often. Good novels can come out of both methods, although for me, I’ve had better luck staying away from my own life and trying to write others who are very much other. Although really even your own sibling, or yourself at an earlier time, is always an other. But I like to try to imagine what other lives might be like. I like that feeling.\nOne way to avoid the pitfalls of one’s inevitable ignorance is to ask for help and get readers who know more than I do to read drafts of my books and tell me what they think, make corrections and suggestions. Generous helpers have given me their time and thoughts, and my books have been better for it. But in the end the stories are mine, and what I imagine of these other places and times and people is simply my imagination of what they might be like. It’s no more than that. But I would suggest that in trying to imagine the other, even if you’re always failing, you are engaged in a good thing to try. And if you are going to try to write a novel, you’re stuck with that trying no matter what your theories are. This is why science fiction with all its wild leaps is just as valid a form of literature as any other kind—they’re all leaps.\nThe Ministry for the Future itself is predicated on the idea of the rights of people who aren’t yet born. Do you feel like here in the US, generally speaking, our culture is fairly concerned with the rights of future generations? Or is ours a culture of individualism, and in that individualism, the rights of others stand as less important, let alone the rights of future generations?\nGood question. Solidarity with other people gets expressed in very concrete material ways that aren’t always noticed or talked about or remembered in our discourse. So, we talk about individualism in American culture, some people a little bit too much so, but no one could actually get by on their own in this world, it’s a vast eight billion-person collaboration, improvised and awkward, but very real. So, sticking to the level of discourse, there’s a lot of talk in the US about individual rights, and a lot of selfish behaviors too, which will damage the lives of people yet to come. Not good. It would be better to remember our descendants and act on their behalf. I like Aldo Leopold here: what’s good is what’s good for the land. This is a good working ethic, since the land supports us and will be needed by future generations for their support too. We can’t do without it. It’s good to remember that. A certain wing of science fiction is not good at remembering that—likes to pretend to forget it. Oh well—they can upload themselves into computers, or fly away in spaceships, and be fine. Good luck; and sometimes it makes for good stories too, so fair enough. But if SF is thinking about the future, which sometimes it is, these aren’t very useful thoughts. Except fun can be useful too, so, whatever.\nThere’s a strong sense of a political stance in this book, a look at global history from a specific perspective. Do you feel like taking a stand or making a statement is important in fiction, is it perhaps inevitable?\nI think all novels inevitably contain a political or social statement, but often it’s just inherent or implied, and that’s fine. They’re works of art, and art is meant to be fun and educational both at once. Aristotle is very clear on this, and Brecht also—that we maybe separate these strands a little bit too much when we discuss them—that education can be fun, and fun can be educational, and what you want is to combine the two to make some kind of delight that is also illuminating or useful. For me, novels are about characters engaged in a plot, which usually means something has gone wrong. Then you have your story. Mainly I want to tell interesting stories. The question then becomes, what’s interesting?\nYour books tend to be heavily researched, grounded in science, and often involve travel to the locales in question. Do you have any favorite bits of research or interesting experiences that didn’t make it into the final text of The Ministry for the Future for one reason or another?\nAlmost everything got into that novel, it’s a real kitchen sink, but I did consider a scuba diving scene down a moulin to the underside of a glacier in Antarctica, but decided that would be a bridge too far, in terms of realism and craziness. I did get to return to Antarctica in 2016, which I put into this book quite a bit, that was really fun. I love Antarctica and hope to return. It’s easy travel to other planets, to quote an old title (that book was actually about falling in love with a dolphin).\nBeyond the blurbs and the reviews, is there anything you really want readers to know about this book?\nI guess I’d like to suggest there are ways of going forward in the next few decades that dodge the mass extinction event we’re headed toward now, achievable futures that are not horrible—not fascistic or totally disastrous—livable futures that you might still be able to believe in. So, for a while I was thinking this book would be something like the blackest utopia of all time, but it isn’t really utopian, nor is it all that black, it’s just history, an unholy mess, and the book an attempt to indicate how chaotic the next thirty years are going to feel, even if things go fairly well compared to worse scenarios, which are maybe more likely. But there is a general intellect in civilization itself, and the Paris Agreement exists, which is already quite implausible, so you can see that people really are taking the situation seriously. We might squeak out of the century with most of the other species still with us, although that would have to be our main goal for it to happen. I hope it will be.\nFor this novel, I guess I’d add that solving the formal problem, by way of the eyewitness accounts and all the other modes I used, is my next step, maybe the last step, in a long move toward polyphony—the idea that the novel can take on a huge load of material without sinking—or not completely sinking, maybe submarining along, who knows—anyway, I really enjoyed the feeling this time of channeling voices, of being the telephone operator in one of those 1940s movies, jamming the plugs into the big board and linking up voices of all kinds. That’s the great fun of writing novels, for me, so this one was quite something to write.\nWhat are you working on now?\nI’m writing a nonfiction book about the Sierra Nevada of California. It has elements of geology, history, backpacking technique, routes to take, and memoir. So, there’s just the kind of travel book and memoir in it that I said I didn’t like to read, but somehow, I’m compelled to do it this one time, and it’s been very absorbing. Kind of a portrait of the artist as young mountain rambler.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/robinson_interview_2020/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Eyewitness to History's Future: A Conversation with Kim Stanley Robinson by Arley Sorg"}