{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "M L Clark", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "r6qhc522E3H6Ov8CnQIxQ5ntiDI=", "id": null, "license": null, "comments": "", "raw_text": "20700 words, novella  Nine Words for Loneliness in the Language of the Uma'u  Jess: That myth’s as old as Earth, babe. Maybe it’ll take longer, but you can translate anything.  Kap: Sure, but with the same efficiency?  Jess: Ha! Haven’t you ever heard Seli? When’s language ever been efficient?  Kap: No, but, see, that’s the dream—the idea that another culture, in just a handful of syllables, can describe the same experiences we’re fumbling through with whole paragraphs.  Jess: Oh, come on, though . . . if someone groks your exact experience of loneliness in three syllables, how alone could you really’ve been?  Kap: Ooo! Now, that’s exactly the sort of thing I’m going to ask once the delegation’s settled in. Speaking of which—have they debarked yet? What’s your scop say?  Jess: Any minute now, according to—only . . . wait. No. Wait a sec, Kap. It’s security—it’s—blazes, babe, look—  Kap: What? What is it?  Jess: It’s—stars, just look, look at the—  Kap: Oh. Oh stars.  Jess: Stars, stars, stars . . .  1. /e.we.o/ the loneliness of meeting a stranger in one’s reflection off the water I speak to you, my love, before I remember the end of you.  No matter.  Who else would hear me anyway, in this place?  But oh, I should not be talking to you at all, my dearest. Not at this distance. I should still be lying in the Otherrealm, tail in tail with you on a heavy yoru’nan bough, while below us the copper-green grasses river-run all the way to the mountains in a late summer’s breeze.  Instead, I wake to feel my tail in bandages, hanging from a medbay pallet three times my body’s size, in a room with gray-padded walls to sink a claw into. I cannot leap to them, nor spring up with hackles raised. The air about me is thick, astringent, and when I try to breathe I feel a terrible ache blooming along my lower spine. There is a powerful itch, too, across my fur—or no, across fur’s absence: erratic patches of seared skin with some vile blue smear of treatment over it. I twitch my ears in the direction of each beep and buzz, background hum and pulse, but no, there is nothing here of Uma’u. Nothing here of you.  A giant mossy log looms overhead.  I am still dreaming, maybe?  No. The mossy log exhales coherent speech through cracks in its . . . bark? An alien, then, but with no mouth like any in the recordings they gave our diplomatic mission, to try to train ourselves to speak in Standard-Variant Partner, and to hear it clearly when spoken by so many other species, too. Well . . . but you did say that the Partnership was big, my love, and that it held species unlike any our people had ever imagined, not even in our fiercest dreaming.  Oh, but Wene’ss . . . must this giant stump of a thing be the first alien I encounter in a fully conscious state? Why not one of the lizard-toms they have here, or the giant amphibians? I hardly know where to fix my gaze, for this log has four massive, knotted protrusions, yet no obvious patterning to guide me to a face. Still, I know it to be sentient. Attentive, even. When it speaks, it exudes an emotive odor—heavy, sincere—that helps it get the gist across. It’s attempting to reassure me. I focus on the words of greatest emphasis.  “esTEEMdAH WEH NAH TOH, onbeHAFuv SEB-TWENteeWUN nth’ol PAR’nerSHIPcruIgreevwi’THYOU yurLOSS.”  . . . SEB-TWENteeWUN?  Numbers in Partner take me a moment to process, and then it registers:  CEB-21, the research way station. Our destination.  And, oh . . . you came so close to it, my love.  But also . . . LOSS. Yes. Yes, I know that word. The log’s last and also the most important, though at first I struggle to remember why. Whose loss, exactly? Mine? Vaguely, while the log awaits response, I wonder after you—where are you? where are everyone else’s pallets?—for surely one of you will be able to explain to me what this mossy being means.  The mind can do such foolish things sometimes, you know: accept death on the surface, as a matter of course, while also refusing to, on a far deeper, more important level. But soon enough your absence lengthens—the silence of you, and of all the rest—and when I focus on medbay sounds, I can use them to leap from now-here-now to somewhere long before.  There I remember . . . the gentle ping confirming a good seal for the docking tube between our ship and CEB-21. Then warmth: the rest of our delegation, familiar fur after fur, brushing past me as each scampers on ahead. Next, your musk, sacrosanct as it sweeps by, though you linger only to chastise me for holding our luggage wrong. Ah yes—and next comes my glib retort, the product of irritation after so long and rough a cryo-flight: What? We’re in a connecting tube. It’s not like we’re going to lose it to the vacuum of—  Then that explosive flash from halfway down the passageway.  That taste of incinerated polymers in a haze of floating particulate.  That thrust from being thrown back while all the rest . . . all of you . . . tumble out.  Back in medbay, the pain begins to radiate from everywhere: pain the size of the bed, the room, the station . . . or maybe I have my frame of reference wrong? Maybe everything’s collapsing to the size of me? Yes, that seems more probable: a smothering cosmos, this station, which suddenly I know that I hate, and violently. Your last stop—my dearest! My only! How could your last stop be so sterile, so impersonal, so far from our true home?  “Who—you?” I manage. My Partner always needs warming up, but in that moment I can hardly breathe through my grief, let alone muster the energy to talk in any tongue.  Does the log sense this? It rolls back on its lower stumps as if to consider. When it speaks, it speaks slowly enough for me to make out more of its phrasing.  “Well, ah—Urrum Urree is my name,” it says. “Of the Fen, a people here. But maybe you mean, who am I? A query about my function? If so, answer: I am one of the station’s counselors, here to facilitate spiritual support. Now, we saw no specific religious denominations on your species profile, and Jess thinks that maybe the Uma’u are like the felines on her homeworld—gods unto yourselves, you know . . . which, ha ha . . . ah, well . . . It’s a Human joke, she says, but made, I promise, only with the warmest of intentions. Only—”  The log creeks a wobbly sigh. “Look, Awenato of the Uma’u, we had so looked forward to meeting your delegation, and to learning from you about your world. But now you will have to forgive the haste and . . . yes, the errors, I suppose . . . of our introduction. First contact in the flesh! And already there has been so much tragedy. The Partnership hardly knows what to ask of you, at least until it has more information about the beings responsible, and so . . . who am I, you ask me? I am here. That is what my people are, and do. We bear witness. And so I am here if you would like someone to be. So you need not grieve alone.”  I give myself the benefit of the doubt and assume maybe thirty percent comprehension of the log’s breathy speech. None of it impresses. My whiskers perceive too much else in this visitor’s performance—discomfort, uncertainty, helplessness—and what fur remains rises in lockstep with a low and territorial growl. These should be my feelings, mine first to express in the wake of this act of sheer depravity. Who are those brutish, careless toms from the Partnership to permit anyone to blow up—to destroy! to murder!—five of our people, then enter my recovery room entreating sympathy for their ignorance and sense of loss?  The log’s odor changes. Stillness. Awareness. Delicacy.  “I understand,” says Urrum Urree. One of its knots grows branch-like toward a shelf beside my pallet. It places a portable vidscreen there. A “scop,” I recall, along with flickers of a memory from my earlier delirium, the incoherent pain and chaos of my first and most unjust waking here, when one of the medics had used her own to show me external footage of the attack, and all the . . . the debris . . . still spiraling out from station ports.  But—the death—event—I had struggled to convey to her in my limited, groggy Partner.  The disaster?  No, no, not the disaster. What comes after. With the bodies. I shook my head, striking a clenched paw in frustration at the side of my pallet. The goodbye-ing? Other-death-uniting-together?  It took her a beat to process my direct translation of two similar Uma’u expressions: ai’da, edan’neata. Ah, you mean a funeral? Death rites? Yes, we’ll be holding services. Only . . .  Only what? I try to focus on this sliver of memory, but that first waking was a mess of trauma, an agony of separation from you, my love, my only; and before I can distill the most important impressions from those first, most crushing moments of conscious and singular survival, that giant log in the now-here-now interrupts me by exhaling “This is . . . ”  Teeth bared in annoyance, I nevertheless make an effort to stay in the waking as it continues: “ . . . The Sunmaster’s Journey. One of our sacred texts. It’s a symbol of strength and unity, and it lies at the very heart of the Partnership. Every species we’ve encountered changes it eventually. Adds to it, modifies. Swaps out local equivalents for core themes, then argues over whether the swap was true to the original. We were going to present you with a formal copy—your diplomatic delegation, that is—but now, considering . . . well, I simply hope it offers strength. I’ve marked some passages for auto-play, if you want to give it a try.”  I say nothing, not even flicking my gaze toward the scop, and Urrum Urree dips its lumbering frame in what seems to be acknowledgement of its need to leave.  “Oh, and the Partnership will, of course, postpone diplomatic proceedings until we’ve had a chance to inform your homeworld, which we know will take a while. Comms estimate maybe three lunars for our broadcast to arrive, and almost four in reply? Stars, how much easier this would be if we’d already reached the point where we were exchanging tech, no? Ah, but it is what it is. So, for now, there will be another with you soon, but not the negotiators. Not the politicians, either. First, and for a while: your integration facilitator, Jess.”  So many exhalations. So many words. A wash of noise to my tired, ointment-plastered ears. I do not even recognize this last word as a name at first. From sound alone, it sits in the verb position of the log’s strange Partner sentence. An order? A state of being?  “What—Jess?”  “Oh! Human,” says Urrum Urree, misunderstanding me in turn. “She’s the one with the feli—she’s Human. Another species here. They’re not easy, I grant you. But they desire truth, justice, and community, when it suits them. For now, I think this situation suits them.”  I get the gist, though, and next try to parse what an “integration facilitator” is—but my head throbs, my fur still stands greasily on end, my claws are half-bared, and . . . did I mention that I am tired, my love? So tired by the effort of remaining here, alive, with breath, without you. Beside the pallet, too, is data-glass, my vitals flickering across its surface; and when I look at it, I can see the remains of my mangled face reflecting back. Oh, but what’s even the point of looking, Wene’ss, when from now on I will always be less than whatever I see there?  How can these toms ever hope to remake me without you?  By the time Urrum Urree leaves, my mind has completely dedicated itself to retrieving the first medic’s explanation for a lack of proper death rites. The rest of the memory fragment. Yes, in my frantic state she told me that there would be services eventually, but . . .  Not with the bodies, I’m afraid. We don’t even have most of the pieces, see. It’s the vacuum, you know. The blast radius. They were projected . . . quite far out. Those bodies have their own trajectories now.  I could study Partner forever, I think as I curl up on the oversize alien pallet and draw that radiating ache tight against my frame again, so as not to lose a trace of it . . . forever and a day, even, my oneness, my only . . . yet still I will never fathom the full weight of those words.  2. /e.we.a.ta/ the loneliness of one’s own making, though the world still beats loudly all around Half a lunar after my release from medbay, we drowse together, you and I, in a sliver of white light cast by CEB-21’s anchor star. The station’s maintenance workers, some of the only regulars I see when Jess is not around, keep trying to tell me that this is a very special way station, in a solar system filled with opportunities for renewal. They try to tell me that this star was an energy source for an ancient species the Partnership is desperate to find, and meet, and know, because in this system the “Makers” first developed extraordinary technologies capable of widespread transformation.  Who knows, eh, what other wonders they might’ve developed since?  The station workers tell me this, I think, as though they expect the news to cheer me. As though, what, I believe in magic? Make believe? Miracles of timeline revisionism, too?  But oh, what need have I for magic, Wene’ss, and other such alien nonsense? I have our drowsing in the Otherrealm. And ours is a good drowsing, my dearest—especially this day-cycle, while all the station spreads report that our attackers have at last been identified. No, I was not told this great news first, or privately, which puzzles me, but no more than I’ve been puzzled by many other routines taken for granted here. What’s one mere tom in recovery to do about it? Rest, they keep telling me: your number one job is to rest. And so I have, but not entirely. Today, while I drowse, I also contemplate the shape of my revenge against your killers, corners of my mouth twitching around sharp teeth as I dream upon our yoru’nan bough, its glossy blue-black bark hard as stone right up to the distant branch tips, where fragile white flowers have started to bud, each one weighed down only slightly by the dreaming’s morning dew . . .  There were three killers, apparently, from three different species outside the Partnership: from a whole other intergalactic compact, with another mess of aliens, and a compendium of lying languages all their own. I wonder: Will they bleed different bloods? Taste different as my teeth sink into their necks and I wring their wretched, forfeit lives from them? Will they have any necks to wring at all? What sounds will they make as they expire?  My mind in the dreaming flits over many possibilities: A beetle’s crunch. A sponge’s chewiness. A rodent’s anguished squeaks. I have no confidence in any of them, though, for I have not bothered to open that scop, connect it to the alTspeaK network, and review the details at greater length. Cannot bear it, maybe—to see these three killers, in all their inevitable inferiority to the lives they took. Yours. Ese’ima’s. Yukelene’s. Abareto’s. Eo’rilen’s. If I were to look right then at the Partnership’s whirlwind of public forums, where every detail about your killers is now being spun into a host of wild new theories . . . and see nothing there but, oh, a bunch of worms staring back, however could I bear it? How would I refrain from beating this scarred old head against a bulkhead until its aching passed for good?  All I know from that murky sea of way station gossip is that these assassins hail from something called the “Alliance of Friendship” . . . and, oh, Wene’ss, are they toying with me, do you think? What kind of name is that? What kind of world is this? It’s all just . . . absurdity heaped upon absurdity, in this land so far from the sensibility of our home.  But then, who am I, even, to speak of home? Do I not remember it less and less every day? I could look it up on the gifted scop, but my claws tremble even to pick up the alien object, and so I leave it with all other Partner things inside the too-large quarters I’ve been given. I know there is a bio-dome on the station, but I have been introduced to very little here firsthand—not “strong” enough for the tour, I’m told—and so the closest thing I have to Uma’u is where I am now: curled up in the deep, round recess of a porthole near my quarters, where my still-healing tail can hang low in artificial gravity as I slumber, hoping to catch on yours in the Otherrealm.  Hold me, I whisper to you there. Hold me, and I will tell you of their brutal murders in the soon-there-soon. Like a mating call. Like each of your every favorite operas rolled into one. But ah, this day-cycle, dearest deadmate, you are to me but a restless shadow: your body twisting in its slumber, soft bluish underfur catching in the far-off sunlight; wide, strong muzzle nudging, then nestling under mine. So be it, my tease, my triumph—no interlocking tails for now, and no teeth bared outward against our shared enemies in the wild green-gold yonder . . . but still we are together, out in that dreamland thick with Uma’u gutturals, and Uma’u ears bent to the rustles of Uma’u forest landscapes, all twitching in a communicative dance as good as speech . . .  We are together, at least, until a Human approaches in the now-here-now, on booted feet, and then your shadow—my love, my loss, my only—darts again from my aching heart, up one of those elusive yoru’nan trees. Even the blossoms seem to shy into grayness without you.  “Knock knock,” says Jess, in Partner.  “No.”  “Aw, come on, you haven’t even—”  “Napping.”  I draw my tail up and wrap it around my body: a poor replacement for yours, Wene’ss, but the best that this waking realm provides. I don’t need to open my eyes to envision what’s called a “pout” on that wide bulge of Human lips, nor to hear Jess hesitate before sitting beside me in the curve of ledge that rings this shielded cut of glass.  “Is this a new one, your jumpsuit?” she says. “I like it. Fits better than the last one. Glad our tailor’s got your size figured out.”  Or so I later realize that Jess has said, because my first conversation of the day in Partner is never easy. Not even after weeks alone among them. Not after all our months of prep back on Uma’u, either. What can I say, Wene’ss? I never had your gift for other tongues.  The best I can do is to recognize my lapses, like how I lose all but the present tense upon waking, and struggle to follow the cadence of words worn smooth in native speakers’ mouths. For me, in that moment, this Human has as good as enunciated “Iz-ZIS-anu-n-yer-JUMP-sooot? LY-kit! FITS-bet-r-n-uh-las-n. GLAH-dur-TAY-ler-sgot-yer-SIZE-fig-gerd-ow-t.” But . . . key words, my love. Key words. They help me glean surface meaning. As for the rest . . . well, there’s more to language than vocabulary, isn’t there? Even from a species lacking proper ears and whiskers. And Jess’ smell and posture convey . . . tension. Uncertainty. I am half her size, claws carefully retracted, on a station not of Uma’u design, at an agony of a remove from Uma’u itself, and my integration facilitator hasn’t even the perspicacity to sense your mighty spirit beside me. So, this distortion of power unnerves, of course.  I stretch to a sit and resist the urge to stress groom. Not easy anyway, in this uniform.  “What—new?” I try. Then, hearing my errors, I correct for the missing words. Oh, Wene’ss, how you would smile at the stiffness of my speech! “What’s the latest news?”  Jess exhales, shakes her head, and throws up her hands. More nonverbal markers of helplessness and frustration, affected or otherwise.  “I don’t know how to tell you, Ah-wei. I want to say it’s going great—that they caught the perps, that the perps are in tribunal, that the perps are going to get what they deserve.”  I contemplate the verb structure. Once I remember that “perp” is short for “perpetrator,” meaning the assassins, most of it sounds promising: they caught, the perps are, the perps are going to get . . . but still I struggle with the import of formal speech. I want to say, I want to say . . . Is that phrasing merely ornamental? Can she not say as much? Is all the rest a lie?  “But . . . ?” I venture.  Jess smiles in a way that I have learned is less than wholehearted. Wistful. Forlorn.  “Yeah, you get it,” she says. “I’m sorry, but your people chose a lousy time to try to join the Partnership. All good when you signed on, I’m sure—but by the time your delegation arrived . . . a whole PSY later . . . well, there have been some changes in upper management, and the Supreme Council now sees our trade relationship with the Alliance of Friendship as too important to gunk up by making a public example of killers in their ranks. And, yeah, they’ve got the names of your attackers now, but they also expelled those creeps instead of detaining them. Why? Who knows. All this fear about another cold war between us. I mean, for sure, they’re trying to bring about an internal reckoning, through extended barter at the trades-table, but it’s a mess, is all I can say. Ugly backlash bullshit that has nothing to do with your breed. Your—species, I mean. Your people just got caught in the middle, Ah-wei. And paid the price. Dearly, I know.” Jess pauses to breathe. “I’m so sorry.”  Native speakers forget how easily Partner can land as crashing waves on foreign ears, but I understand I’m so sorry clearly enough, and infer the rest from context.  “I smell it,” I say—and then, adjusting to the more common Partner phrase: “I see.”  And yes, my love, of course I want to ask her more. I want to ask her, Why? Why did the killers do it? Why did they target so new and remote a species, one just beginning discussions to enter into the Partnership fold? And what is the Alliance of Friendship, really, to the Partnership, that fear of war should change its reactions so much in the wake of an external threat? Isn’t CEB-21 a Partnership station? Why does another intergalactic compact have so much power over its internal security? Doesn’t the law work here as it does on Uma’u: that if one resides in another’s land, one lives by another’s rules?  Also, more pragmatically, how can I even trust this Supreme Council when it says that all guilty parties have been expelled? What about local aiders and abettors? How can way station security be so sure they’ve found everyone in on the plot? How can Jess and her own lifemate, a command-crew officer named Kap, guarantee my continued safety here? Even though I have no other choice but to remain? Even though my duty for now is to await further instruction from homeworld—still an eternity of a quarter-lightyear away?  I want to ask Jess all of this and more, but I don’t trust my Partner with the precision such an asking requires—and because, oh, my loveliness, does Jess ever talk a lot for every syllable I struggle to form. The sheer thought of all the rough sifting through her responses that my questions would compel is enough to wear me out. So, I say no more.  “Have you thought about a crew placement yet?” she asks instead.  I turn to the round of porthole glass, with its shielded view of a pinprick of near brightness against a field of colder stars. What do you say, my love, my light? I ask you through the desolation of the cosmos. Should I try to make of your death place a home?  You do not answer.  But, of course you do not.  You’re not out there, after all. You’re in the trees. The dreaming.  Where I now ache to be.  “Hey, that’s okay,” says Jess, eventually. “No one’s going to force you. Only, it might do you a bit of good to meet the others. There are other solos on board, you know. One Lucasian, but don’t let her catch you in a corner. Seli’s working the bio-dome, though—so no corners, right? Ha ha. That’s . . . that’s Earth humor, sorry. I’ve been told it’s bad. And one Retet—doesn’t speak much, misses its people a lot, but I hear it’s nice to be around. Down in storage, where the work’s a bit technical. Not much open space, either, but that’s how a tunnel-dwelling species likes it. Oh, and then there’s the Gremshu, stars alive! The Gremshu! They’re a herd-entity, see, so when they speak it’s always a bit insular, but once you catch the drift of their metaphors, it’s something else entirely. They run volunteer detail in the canteen ring. Yeah, I know, we’ve got servitors that could do the cafeteria work just as well—oh! and even one of those freaky biocomps the Makers left around this sun. That’s a sight for sure. But no . . . it wouldn’t do, because for plenty of species a meal is more than food. It’s also, like, daily social contract building? So we let all our citizens here make a ritual out of it. It’s like—”  I crouch, then curl up anew, closing one set of eyelids, then the other. Jess doesn’t seem to mind my disengagement. Jess keeps talking. At this point, my dearest, I’m not yet certain if this is something all her species do, because I’ve yet to meet her lifemate or talk to anyone else on CEB-21 at sufficient length. Already, though, I must confess, I’m not entirely opposed to the sound of her chatter, so long as I don’t have to contribute. Listening’s not the same as having purpose—not like when I first chose to follow you out into this terrain. Nor like the calm that used to come from the cadence of your throaty speech, or the heady purr of your belly beneath my whiskers, on the grassy knolls of our long-lost life together on Uma’u.  No, the experience of Jess on CEB-21 is not any of that. It is not you. But her chatter is still a better focal point than all the images that return to me whenever I idle too long in the waking. What images, you ask? Oh . . . strange ones, my deadmate. After all, I didn’t actually see your body tumble out of that exploded docking tube, so my mind has constructed entirely different ideas of what went on. It has fashioned a version of events where you are always staring at me in your death throes, no matter how much your lithe, blue-gray body might have contorted in reality under vacuum pressures. No matter how quickly, either, my head in real life struck something solid and knocked me out. No, my oneness, my only . . . in my waking brain’s version of events, the two of us are simply locked together, Uma’u gaze to gaze, all the while that this unnamable alien violence steals you away. And even when your body slips fully from my purview, even when I am left only to imagine your freezing limbs shattering beyond that wretched tube, still those bright eyes of yours, my queen, my queendom—eyes the color of harvest grass interwoven with threads of red—watch me from the abyss. Accusingly? No, never: my jewel, my triumph. But, as a reminder? . . . Yes.  My love, my deadmate, my five-footed mess of a stumbling fool the first time I ever saw you dancing at court . . . those eyes keep whispering on your behalf: Ima’i.  Now-here-now.  A promise, as you know, as much as a description of time and place. A way of saying—go now, child of Uma’u; carry your grief for me into this den of strangers who stood by and let me die, and I promise to pad by your side through everything, then meet you for eternity in the Otherrealm, when your time in these lands is through. But remember as you do, my guardian, my shield, my shelter . . . that until I’ve been avenged for so wrong an end as this, wherever you go, whatever you do, whenever you are in the waking, this is where I will always be.  Such a difference in intensity, no? Between the waking and the dreaming? And who among us could ever think to outrun such intensity for long?  Sure enough, then, in time even Jess’ voice can’t drown out that abiding surge of self-recrimination, that wrenching call for me to act, act out, act out against them all already damn it, even though I cannot envision more right now than the final slashing blow, or how I will bite all the napes of the murderers’ wretched necks or their alien equivalents. And so, after twitching at the sudden press of my facilitator’s hand against my fur (though why Jess thinks herself permitted to touch my fur without asking, I hardly know how to answer), I shudder into the only true escape I have from this reminder of my many failings . . . failings to you, my perfection; and to the rest of our delegation; and most of all, to myself.  I fall back, that is, into the only slumber known to me where your mighty spirit is of a younger, kinder, and more forgiving nature; and where, for all my inadequate size and lack of dominance in the waking realm, you might still deign descend again from those distant, ethereal yoru’nan trees . . . expecting nothing further from me than that I idle with you on a glossy blue-black bough as often as possible, before I too dwell forever in our Otherrealm.  3. /e.we.ren/ the loneliness of nervous silence, when asked to speak one’s truth But oh, my queen, it’s true: Jess’ larger point cannot be escaped forever. I am but one tom, easily the smallest of any organic sentience here, and perhaps due to my oneness and my size, I am treated more like an orphaned youngling than the brutish less-breed that I appeared to be to any who glanced my way back home. And how convenient are the Partnership’s claims of care, no? For, with them, the Partnership has as good as revoked my authority to speak for all of Uma’u until they report on this incident to our High Court and receive its reply, which gives them seven lunars’ grace to smooth out local consequences of the event.  Clever, clever.  Oh, and yes, of course, I’m watching them all carefully, Wene’ss: all these Partnership operatives who still insist that my only job is to recover. I listen to reports from their Supreme Council and wander the corridors observing technicians at their work. So many different species: the lizards and the mammals, the sponges and the spindles, and even the lurking shadow of a giant spider, with a scent that makes me hunger for some of our littler delicacies back home. Out the way station’s portholes, too, I track the progress of a massive planet stalking the anchor star: the same planet of miracles the crew often talks of in hushed, excited tones. With image enhancements, I can also see around the anchor star itself the band of mysterious tech, not unlike a yoru’nan bough in its coloration and its sheen, that has drawn so many to this precarious nexus of . . . not Partnership territory, exactly, but Partnership control. A nexus that also just happens to be a quarter-lightyear from our home. Strange, no? That there should have been so formidable a power so near to us, that never thought to visit our long-clawed ancestors? Not even once?  Unless these ancient Makers did, perhaps? Slipped into the stories told by queens and toms of old, and all their kindred dreamscapes, and seeded it with secrets yet unknown? Do you think that if we were to dream hard enough today, we might even find them, lurking in the one sacred place where the Partnership seems incapable of looking? Are they perhaps wandering in our Otherrealm, in communion-song with all generations of Uma’u come before?  Oh, my brilliance, my Wene’ss . . . but now I picture you smiling at such silliness and catching mine ear tenderly in your sharpened maw. You’re right, of course: how foolish of me. This is merely the consequence of trying to answer too much about this strange new culture all by myself. If I want answers to my questions while I wait here, at least five more lunars until my fate as our lone surviving diplomat is made known, I must mingle with the locals. Learn how toms and queens speak here . . . even without necessarily using the right words.  I accept, then, an invitation from Jess to dinner in her quarters, where she lives with another Human: Lieutenant Commander Capacia, known as Kap. I wait in the corridor until she answers the pad-press I have to strain to reach, then hesitate as a striking smell assails me once the door slides open. Another animal’s heat signature. The distinct olfactory notes of fur.  “Ah-wei, you made it!”  A curious phrase, my love—for what accomplishment exists in showing up to sup?  “Come in, come in.” She beckons me into the living space, but as I enter I hear a low growl and startle at the sight of a fluffy mane on a smaller creature atop a carpeted assembly of poles and platforms. The creature looks vaguely Uma’u, but . . . hobbled, somehow. Something in its body structure restricting it to quadrupedal motions; like one of our distant ancestors, if it had also lost its proud, strong jawline and adorned itself in excess tufting and bejeweled accessories. And if it hadn’t been particularly bright.  “Oh, that’s Moscow. He’s harmless. All glare and no bite, aren’t you, boy?”  Moscow’s growl deepens, and he shifts his paws uncertainly beneath the crest of his chest. Does he even know how to strategize a fight, or do his stunted primal instincts only give him to imagine the initial, thrilling pounce? I turn to see Kap entering, a plate in either hand, which she affixes to table clips for added stability. An unusual precaution, since CEB-21 does not often lose gravity, and most do not bother with such measures.  “Oh! Hello! Stars, I didn’t realize you’d arrived yet, and so I—” Kap turned to Jess. “Is it okay to talk at this speed? Am I talking okay? Should I use simpler words?”  “Is good, fine,” I say, in a deeper register than my usual. I know, my love: patience, patience . . . but whenever someone turns to an intermediary to speak to me through them instead, I just . . . my retracted claws, my dearest . . . they itch . . .  In any case, Kap startles again before my annoyance can register more visibly in my fur. Color rises in her facial nakedness.  “Yes, of course! Good. Well! Welcome, Ah-wei-nah-toh, please, sit, sit—”  She is making an effort to say my name in full, even if she over-enunciates every syllable to the point of absurdity. I try to focus on that goodwill gesture, although the sheer nervousness radiating from them both is aggravating. What am I, a star about to go nova?  I perch on a booster Jess has added to my chair to reach the table and attempt to set them at ease with positive physical gestures, reassuring and elaborate sounds of appreciation for the food. I am, I know, little more than a caricature, like in one of Eo’rilen’s operatic solos. You remember when he auditioned for you, don’t you? That time he nearly fell off the courtyard wall, performing the part with the drunken broken heart? This memory helps me to smile more as the Humans smile, their wide lips closed and upturned without snarling; and that smile seems to do the trick. Soon enough, the pair relaxes into chatter about the meal, and the provenance of our beverages; and then they allow the beverage’s alcoholic properties to affect their biochemistry.  I do as well. Why not? Partner seems to flow more easily from me when I consume it.  Only—at one point their alcohol makes me impulsive, too, and I wonder aloud then at the pair of them: a partnering with no toms that I can see or have heard tell of. How does that work when you go into heat, I ask. Who protects whom from the trespasses of all the others that must be called upon to sate a rose-queen in her moment’s relentless need? Kap bursts into laughter, while Jess explains that heat is different for Human queens, rose and otherwise. Not nearly as unrelenting, she continues: just enough for one alone to quench it, at any given time.  “Well . . . unless we want it to be more,” Kap adds, while making eyes at Jess that help me understand how deep and true their pairing is, for all its differences from an Uma’u’s own. “Why, what’s it like for the Uma’u? I know I’ve given Jess so many questions to pass on. I’ve been just awful, haven’t I? But honestly, it’s just not fair, you know? The whole blazing mess of it. All that’s been lost between us already, and, and for what? You know?”  “Easy, girl. Easy,” says Jess. She pats Kap’s knee before rising to call Moscow to his own dinner, in a little tray, while Kap refills her glass and hesitates. The curl of another question rises on her lips before she drinks it away.  Her first question, though, has me realizing the impertinence of my own. What was I thinking, dearest—to ask these two of such private and intimate affairs! High Court-help-me, what on Uma’u came over me? And so I struggle to suppress the indignation sparked by her request to learn of something so private and sacred for us, my queen: Something as powerfully binding as my role as your guardian, your oneness and your only, in keeping such careful, protective watch while so many wildling toms answer the desperation of your call in the mating grove, and on occasion seek to press their advantage too much against your urgency. How I would clean you of their scents thereafter, and tend to all the wounds they left upon you, while you lay in all your perfect, secret panting, spent in a manner known to mine own eyes alone, and watched me with one brightly welling eye. Your purr still so faint and fragile in the nethers of your chest, my queen, my hope, my oneness . . . My lifemate, my loss.  Yes, I suppose we would have had to share this concept with the Partnership eventually. What else is a diplomatic mission for, if not for an exchange of contexts through which to better understand another’s whole? But . . . alone? Alone I am supposed to tell these Humans about this sacred thing, just me against their twoness—and no, not only their twoness, but rather, their twoness on one side, while from another I still smell the smallness of that creature they keep, that Terran animal like some rough mockery of our ancestors, which after supping is now settling into a dreaming all its own?  No, my queen, oh no . . . Together I might have managed it, but as I am alone, these memories of ours, I claim as mine alone as well. How can I give away even more of you to these strangers than I’ve already been compelled to by their carelessness with security? Where is justice here for you? For all the rest?  Thankfully, some wilting in my ears seems to catch my facilitator’s attention when she returns. Jess changes the subject—brightly, hastily—while sitting down and raising a glass, to join Kap with a salutatory gesture.  “Did we toast? I don’t think we toasted. Oh, and listen to this—this might be a new one for you, Ah-wei. This is,‘to the same example!’ Do you know it?”  I shake my head but recognize the general concept. It is as we do, my love, in deference to the Highest Court before we feast. “We say . . . mer’i’ma’ss.”  Kap shapes her mouth to mimic the sounds, again over-enunciating.  “merEE mahESS. Love it! What does that mean?”  I consider. “It is . . . many ideas made small. ‘Now health living long,’ I am thinking? But all short. No sense in parts. One word. One big thinking. You dreaming me?”  And yes, yes, Wene’ss: maybe the alcohol is not enough to make me fluent: just confident enough to keep going through my worst mistakes. I can hear, at least, that my last expression is far too Uma’u for the room, and amend it: “Do you understand me?”  Jess nods, graciously bypassing the rest of my linguistic mess, and leans in. “That’s just like ours—‘To the same example!’ It makes no sense out of context. It’s a small part of a bigger whole. But we all know the context here. It’s in our book. It’s from our Journey.”  “Journey?”  “The Sunmaster’s Journey,” says Kap. “Oh! Have they given you a copy yet?”  I remember Urrum Urree’s gift, but still haven’t turned on the scop since being released from medbay—no, not even to peruse the names of your assassins, for there’s been enough chatter in all the station’s common areas to make direct inquiry an exercise in redundancy. More to the point, even two lunars on, I still shrink from the touch of that thing . . . because everything associated with medbay—my unrighteous survival there, the wretched aching of your absence—only intensifies the pressure of your unwavering eyes in the silence of my waking realm. When I pick up the scop, I feel them calling to me . . .  Act, act now, avenge me, avenge us, where is your great brutality now, child of Uma’u?  It’s in my quarters somewhere, I’m sure, but . . . radioactive to my shaking touch. So—  “Yes,” I say, to avoid further questions.  “Well, no matter if you haven’t read it yet,” Jess replies. “But the full phrase is ‘We are all the same example.’ It’s one of those things the Partnership tries to live by. How all life in the cosmos is equal. How all of us, deep down, are the same. You know?”  I understand the principle, but something quiets deep within me to hear Jess tell me that the Partnership believes itself to live by those terms. Can it really, when . . . ?  But before either fur or expression can betray my skepticism, Kap raps the table with her knuckles, excited. “See, this? This is what I was hoping for. Oh, there was so much I wanted to learn from your people, Ah-wei! We’d just had one of our AI go through your histories, your mythologies, your languages . . . especially the biggest one, the royal tongue. The one your people call a passkey to the Highest Court? Stars! What a language! Our compiler says it even has a whole bunch of specific words for concepts we barely understand in Partner. Like, you’ve got seventeen words for madness, I think it was? Nine for loneliness? So—I’m sorry if I came off too strong earlier. Really, I am. It’s just that, before I was in this uniform, I studied the xenopsychology of colony management. I did a whole thesis on representations of isolation on Partnership frontier worlds. So, it’s important, you see. This whole opportunity with you, your people . . . it was all very precious to me.”  Another wash of Partner-ese. Do they really not realize how like a crash of nonsense all these sentences can sound to non-native ears? Something beneath my ribs tightens at those last two sentences in particular, though. The sheer audacity of the pair.  “My crewmates—same—to me,” I reply, just barely keeping an exasperated hiss out of my speech. Even Moscow’s ears prick to hear it in his dreaming, curled up and purring atop a plush and richly colored bed. On some level I suspect that Kap has heard it, too. Yes, yes, I know . . . So hostile for a diplomat. But I am tired, Wene’ss. It can’t be helped.  Kap freezes while Jess stands as if just remembering the after-meal. “Dessert?”  “Of course,” says Kap. It takes a second to realize she is speaking to me, not her partner. “Of course they were precious to you,” she clarifies, leaning in. “And—stars, this is all just unfathomable, isn’t it? But if you need anything from us, anything at all . . . ”  She extends a hand over the table. An attempt at restoration. But I have consumed too many of their alcoholic beverages for niceties. I bare teeth instead.  “Why no justice for Wene’ss? Why the lives most killerly let free? Why there is always being—excuses? ‘Same example?’ No! Made example. But not knowing why, and I must!”  Jess returns, holding a bowl of what I know are meat-fruits: genetically constructed hybrids with the texture of a sturdier protein, but still retaining the refreshing snap of plants. These, and some palate-cleansing greens, she sets on the table without clipping them in, while her lifemate routinely re-clips her own utensils, her plate. Looking curiously at me, then sharpishly at Kap, and then exuding a general sadness, Jess exhales and sits down.  “Look . . . the Partnership’s got a problem,” she says, every syllable belabored while pushing the bowl my way. “We’re dealing with radicals, okay? Same as you find anywhere in the universe. You have radicals among your people too, maybe? Those who disagree with the courts on Uma’u?”  I struggle for the word in Partner. She is correct, but in royal tongue it is so much easier: the neren’, the word’s severance after the core noun phrase so intrinsically harsh to an Uma’u ear. A refusal of synchronicity. A denial of restorative balance in language as in life. Even neren’ata has a kindness to it, doesn’t it, my love? The castaway, the forlorn, the tom that has made of himself a tool of oppression, later to be discarded. The tomwho earns such a term is still redeemable, though, isn’t he? Even if the role he performs as neren’ is not. Even if the dreaming he must endure to serve as neren’ is not fit for any youngling’s ears and tongue.  Oh, but we would have worried such nuances as this to bits, wouldn’t we, my dearest? If you were still at my side, boostered into another giant chair across from these lumbering simians, while their primitive feline snuffles with its soft belly bared in the dreaming. We could have told them, too, about how, when you and I first bonded, you had grown inordinately excited by our names: A-we-n[e]-at[a], a variant of the more regal “Awe’ne’ata,” made coarser by my breeding . . . and We-ne’-ss, three more perfect syllables than I had ever known before I knew of you. We could have explained to them, this fellow coupling so contentedly with itself, how you had delighted to notice the rarity that our names shared: that conjunction of opposing concepts as the core noun phrase.  We-, the quality of loneliness.  Ne-, the quality of connection.  Both bound together in each of us, separately—then bound together in us, together.  It is fate, you’d declared in that distant, pristine moment of late-youngling memory, before sealing the heat of our bond with that first, delirious press of your paw against the hardness of my left shoulder, and finding a secret shudder in me there.  Ine’ata, I had agreed, fighting back an Uma’u’s smile. Fate indeed.  But now, without you . . . without the strength of your tongue in either language . . . what Partnership term shall I use to capture the elegant balance of our linguistics in its purest form—to say nothing of the depravity we feel most whiskerly when the balance is not there?  “You mean . . . toms that no follow their ancestoring?” I attempt. It seems to suffice.  “Yes, exactly. Blasphemers.” Jess nods, and I echo this last word, blasphemers, under my breath to remember it. (Their –ers are like our –atas, I am learning. But I’m sure, my dearest, that you already knew that.)  “Well, we have those, too,” she continues. “And the problem with radicals is that they’re always hungry for more attention, more fear. So, the Partnership decided that the greatest punishment for what they’d done would be . . . not to give them what they wanted. What they really wanted. Not to make a spectacle of their expulsion or tribunals. Oh, but they’ll be tried, of course, on another world. The Partnership received a guarantee from the Alliance of Friendship during recent negotiations.”  Kap and Jess look at me intently then. So eager, so nervous for approval. They want me to accept what they are telling me—or, no, one better: they need me to accept it.  Why need, though? Whatever can I, a solo tom in this realm of giants, ever hope to do that scares them so? What danger lies in the threat of my dissatisfaction with their justice?  I cannot put my paw on it exactly, Wene’ss, but there is something about the power these two Humans see in me, or impose on me . . . that feels like no power, really, here at all.  4. /o.we.ren/ the loneliness of speaking one’s truth and not at all being heard More lessons follow in living Partner, learning Partner, being Partner. I watch the crew and visiting citizens, and I listen, and I placate at every turn the staff’s insistence that I rest, and heal, and find my way into minor work cultures however I see best. Well, “however I see best,” that is, except through all the truly better ways. Without getting an audience, say, with the Supreme Council. Without having returned to me my full status as an Uma’u diplomat to CEB-21’s Partnership representatives. Even my inquiries about proper memorial services for the five of you are met with baffling delays, though I am assured that, once word from homeworld has arrived, a proper honoring of your lives and passings will at last take place. (I suspect, my love, that the Partnership is simply stalling to avoid the possibility of a repeat incident. But perhaps I am being too generous with them all.)  What remains, then, for a tom like me to do in a world of towering aliens? Only the sorts of roles that Jess suggests. Small contributions to the way station’s daily scut work.  Well, so be it. It’s a start.  And I began—as you know, my dearest—at a rank far lower than even this. A rank so low that I dared not laugh aloud even when I saw you make such a happy, clumsy fool of yourself at that first dance: your first entrance, on the cusp of queening, into the mainlanders’ shared court. (Oh, but you saw the laughter in my eyes then, didn’t you, from my meager serving post? And you knew it was not mockery I stored up there; it was a happy laughing, deep within, that longed to be as public then as yours.)  It is with far less cheer that I accept volunteer placement in the canteen ring, maybe half a lunar after my dinner with Jess and Kap . . . but the memory of foolish early days between us strengthens me all the same. The eating area on CEB-21 is called by most locals “The Trough,” and I am hoping a massive crowd will be the perfect place in which to lose myself, to become anonymous enough to observe without being watched in turn.  Oh, but Wene’ss! Now who’s the clumsy fool? Because, by my second hour on duty in The Trough, I realize I have made a terrible mistake. I should’ve chosen something remote, like the storage bay. But no: With all the interspecies murmuring, sparking, and beeping in CEB-21’s canteen ring, I had been so certain I could get by with minimal chatter of my own. How could I have ever believed, though, that a simple jut of lips, tentacles, or hooves in the direction of a food tray or gas bubble would ever have served here as sufficient talk?  In practice, I discover that social contract-building matters more to locals than mealtime efficiencies, and so, for all the pell-mell chaos of alien smells and sounds, locals still find excuses to bark and bay in Nonstandard-Variant, then await my response with curious and impatient stares. Sometimes they ask after the ingredients for a particular menu item. Other times, make note of my novelty—half or a third their size, after all. Some even extend genuine alarm about my regrown fur being so close to their lunch trays, which I suppose is fair enough, for the hairless cultures here.  All in all, though, it amounts to such a bewildering array of conversation topics and tonal variations. It exhausts me, dear one—leaves me feeling dizzyingly alone in a sea of noise worse than any individual’s hasty speech in closer quarters. But then, I am also not alone. Not once, not for a single syllable in the canteen ring’s cacophony. Rather, each perception-bulb among the would-be eaters creases with its own show of surprise, then amusement, upon hearing me struggle in Standard-Variant, with all my Uma’u direct translations slipping through. Each amused alien then asks me where I’m really from, and if I’m “The One Who Survived,” and finally, if I know just why it all went down.  “I heard maybe there was something explosive on your ship?”  “They’re crazy, those Alliance creeps. You know that, right? Not the sort that your people should’ve messed with. Should’ve kept your distance from the start.”  “Is there, like, a side-war, maybe, between the two of you? Something you kept secret from the Partnership when it first invited you to apply? Because sorry, friend-o, but that should really negate the application process entirely . . . ”  And yes, Wene’ss, of course I find it difficult to remain calm in the wake of such inanities, especially when these assertions keep showing up one right after another after another, as one alien listens in on my conversation with another, then tries to leap off that other alien’s absurd claim, or point. Meanwhile . . .  No, I want to retort at all the simpler queries: No, you got me! I’m not the sole survivor; I’m some other Uma’u, who conveniently arrived after the incident but before my homeworld’s even heard about how its first delegation was murdered under the claws of your security. How did you know?  Then, at the far more invasive questions, I also want to arch my back, hiss, and retreat under the temporary shelter of a menacing growl. But, no, my dearest: Of course I don’t. I know that doing so would only give them more fodder, bolstering all their terrible intimations of less-than-perfect-innocence on our delegation’s part. So, I simply try not to blame them for their fear and ignorance, my queen. I try.  And still, I fail. Yes, I realize that they are only trying to shift blame onto me because it’s a natural defense for anyone who regards CEB-21 idealistically, as a place of stately calm meant for the purest scientific research; and which also happens to serve as a vital way station between stars. But also, why must I always be the more charitable and understanding tom in the face of all their carelessness, cruelty, and cowardice? Why shouldn’t I get to be openly, recklessly angry at the laziness of their assumptions, the smallness of their views?  “I mean, it’s just . . . ” some even tell me. “No offense, but they must’ve picked you for a reason, right? So how can we be sure that you’re not dangerous, too?”  Oh, but they have picked the wrong Uma’u, my dearest, if they thought that such a statement could ever chasten me. There was enough prejudicial nonsense for me back home, you know—as a tom whose stripes marked me for mere brute work, and no more. How our court had blinked so slowly at my request to take the higher exams! How even you, my love, at the beginning . . . how even you saw me more as muscle than as mind. And liked it.  Ah ah ah! Now, dearest, don’t you try to deny it. Later, you even confessed to me—far later, mind, with a playful, grooming lick to ease the sting of it—that this prejudice had also been part of the appeal: the sense of danger to me, in your ignorant upper-court eyes.  Meanwhile . . . Dangerous? Me? As if, my love.  Everything else was dangerous to you, though, for a spell, wasn’t it? The way you’d slip off courtyard siding, or miss a landing whenever you leaped in those early years. How you’d tumble in the most ungainly way to the dirt or grasslands; then recover—quickly—and saunter off with pure composure and intent . . . your tail always so elegantly erect, as if no error had been made by you at all. A queen even in your years of jesterdom: that was always you.  But my dearest, my only . . . you do realize, don’t you, that I was never more of a threat than, say, a distant yoru’nan tree branch that you would gauge wrong and hit so hard that your claws nearly shattered while digging in to cling all the better on? As for me . . . I never so much as bit your neck to hold you down while mating. Didn’t you notice that? Didn’t you slacken and still for me all the more under the trusting shelter of my large-yet-bridled maw? And hadn’t I also played my role as protector with such discretion and even greater loyalty? Hadn’t I keened and howled and dragged myself through the grasses with you in the aftermath, too, when our first litter was lost, all lost, the year the sickness came to court? Did I not groom you for hours—gently, slowly—through the ensuing silence of our shared grief?  So, if the luggage had been a sore point between us just before your passing, my love . . . if my last words to you as you stepped into that doomed connecting tube had been so very, very wrong . . . Hear me, Wene’ss: it is only because of that first impression I sometimes still fear you have of me. That image of this . . . this brute, this know-nothing low-court tom: barely domesticated into civil service, and hardly able to patch a sentence together in a second tongue, even when first contact with the Partnership drove you to submit our names for diplomatic application. I was just this hulking menace who happened to be on your side, and yet, in that most critical moment in his service to you . . . when you most needed a brute indeed . . . I’d been given no chance, not one, of saving you from the abysmal dark.  “Hulking,” though. Well, there’s another joke to dwell upon, no? For whatever I may have been among Uma’u, whatever private suspicions you might’ve nursed of me as well . . . whenever I hear someone insinuate similar about me in The Trough—that I might be dangerous, or violent—I just want to yowl at the absurdity of being seen a threat to anyone here at all. How could I be? How is it even possible, when everyone, everyone except the younglings on CEB-21, are twice or thrice my size?  I don’t yowl in outrage, though: certainly not in the packed canteen ring. During my volunteer shift, for all the awful things they say and assume of me, I never give in to any of these giant aliens’ baiting and bewilderingly accented remarks. I simply wait, and serve, and after the lunch rush eases, take a much-needed moment in a recessed corner. I’m stress grooming, of course—I can taste the associated stink in my fur, when gathering more of it in my mouth than expected with each sweep—but the jumpsuits here make it difficult to reach my most pungent crevices. And when I sense too many sidelong glances from the rest of the staff, I look for stress relief work-arounds with the furniture instead.  “Plains of dry grass near aflame?” says the Gremshu heading up detail—or rather, so says one of the hair-coils along a top-heavy shag of a body that all but obscures two bright black eyes, flaring brown nostrils, wide, curving horns, and—far below them—four bi-toed hooves.  “Peel of bark twisting on its trunk?” says another.  “Kick of dust on skin?” says a third.  “E—excuse me?” My ears flatten in confusion, shame, or both.  “Itchy,” explains a nearby log: one of Urrum Urree’s species, freshly retreated from the condiments to clean a yellow squirt from a patch of moss. “They’re asking if you’re itchy.”  “Ah. Well. Sort of,” I say. “I’m sorrying, I—”  “Over there, that post might help.” The log points with a heavy branch to an ornamental pillar with knobs at the perfect height and size to catch between my shoulder blades. “It does for the Gremshu, at least. Doesn’t shut the herd up, but at least they sigh in symphony for a while.”  “Ah—thanks.” I say to the log, before repeating this sentiment to the Gremshu.  “Clear streams,” one Gremshu-coil replies.  “Sweet plains-grass breeze,” adds another.  “No problem,” the log translates.  “Thanks, I—I think I am getting that last one from context.” I quirk what I hope is a smile to accommodate the awkwardness of my grammar, but the log simply exhales a more muted odor. Disappointment-turned-resentment is a familiar, if unsettling response from some locals, who prefer when I act perfectly helpless before them, like a lost youngling. How quickly, too, such locals try to catch me out for having less than perfect comprehension or elocution, yet still declining their “aid,” which always amounts to an incessantly patronizing form of correction. They act sometimes . . . oh, love . . . almost as if I’m being arrogant in refusing their supposed generosity. Like I need to be reminded of how little I truly know, and how small I really am, and how grateful I should be that anyone is willing to educate me at all.  Oh, but I know to tread carefully with such types, my queen. To placate their wounded egos all the better to survive. And so I crinkle my nose, breathing slowly, and take out the scop I have started practicing carrying with me, in a prominent jumpsuit pocket, to give others the impression that I am fitting in. It still feels almost radioactive to the touch, and I have yet to bother to turn it on, but maybe this Partnership tech could help bridge the hostile gap I sense forming between me and this log? Maybe it could help this new log feel superior in its usefulness to me, after all?  Worth a try at least, so—  “Other contexts,” I say, holding up the device. “Still very—harder, though. You know the order, maybe, that this is to be—reading?”  The log leans forward, but its odor sours after it inspects the label on my device’s screen once I switch on the scop. Then the log pounds one of its branches on the nearest counter: an action that begins to make all my hairs stand on edge. “Are you kidding me with that fungal rot?” it barks at me. “Get that putrefaction out of my airways.”  I quickly comply, switching off and pocketing the scop again.  “I am sorrying,” I say. “I am only thinking it to be the tale told by your people? Urrum Urree, the . . . the spiritual advisor here, he is saying that—”  But the log interrupts with a hot burst of sound that I take for an irritated laugh.  “Ho ho! Urrum Urree, a spiritual advisor? No, no, no—that bit of mulch-for-brains does not speak for all Fens, little twig. And if that . . . that piece of fire-starter wants to take on an enslavers’ text like The Sunmaster’s Journey, fine, let it have it—but oh, what arrogance to pretend this text is all of ours. Ours! Hah! If you want a tale told by our people—not imposed on them—read The Starchild’s Voyage. That’s ours.”  “I am sorrying,” I say again, quieter and with mounting confusion. “I am not knowing that one. Is that also—part of Partnership? Or—”  “No, but funny, you asking that. It’s from the Alliance of Friendship,” replies the log. “We are . . . the true Fen, at least . . . some of its founding members.”  As with Urrum Urree, I can make out no face upon this particular Fen, and yet I can feel it watching me. Yet, why shouldn’t it be watching me, studying my every minute reaction? I am as rigid as a yoru’nan bough myself, to hear what it has just told me.  “Turns the wind sharply,” says a Gremshu-coil.  “Bitter runs the stream,” adds another.  “Bone-taste in the ashen earth,” agrees a third.  Warnings, I gather: all sorts of natural warnings, given by the herd-entity to the log. But warnings against what? What terrain has now been entered by us? What power do they sense in me, that I can hardly understand myself?  The Fen, though . . . The Fen seems to understand far more.  “Yes, yes.” It swats vaguely at the Gremshu. “I know his kind’s met with a bad end thanks to rogue agents. But, you see me here? You see me working the same detail with you? That’s because plenty of good still runs between our compacts, the Partnership and the Alliance of Friendship, which none of us wants to see wasted on another war. Besides, it’s not your fault that the Partnership built its empire on the wrong version of the greatest cosmic story ever told. Just as it’s not our fault that some of us have gone . . . okay, fine, maybe more to seed than others, while trying to protect the sanctity of the Voyage’s lessons. But how could they not, when everything else in the galaxy seems such a mess?”  I feel the surface of my skin drop a degree or three.  “So, the Fens are . . . ?”  “A multi-compact species, yes. Some of our colonies liberated themselves into the construction of the Alliance of Friendship. This, of course, was after our homeworld was first tricked by the Partnership. Lots of animosity behind that division, mind you, because lots of homeworld Fen established themselves within the Partnership, then turned against we outworlders . . . we, that is, who have nothing but pity for homeworld’s failure to see through Partnership lies, plus sorrow for their failure to follow us into a far better deal.”  A Gremshu-coil snorts. “Salt lick on the seventh day.”  The log makes an appreciative sound at this, and odors of amusement reach the tip of my tongue. “Old story,” this Fen explains to me. “The herd’s trying to say that every species from a multi-planet system has the same issues once it starts hopping from rock to rock. Different colonies, different loyalties, you know? But, no . . . no, you Uma’u wouldn’t know much about that, eh? Your world’s the only planet in orbit around your sun, which must’ve put a serious stone or two in the way of the first roots you flung offworld. Kind of amazing you kept on at all, really. And then, after what happened to your people when you first got here? Stars, but that’s a strange business, don’t you think? Almost too strange, hm?”  I taste a blend of curiosity and animosity wafting toward me, but most of the log’s speech doesn’t make a lick of sense in all its contradictions. I mean, sure, I understand “old story” on a literal level, Wene’ss . . . but I’m also too busy grappling with its two possible meanings—a story that is ancient, or a story that has been repeated to the point of tedium—to pay full enough attention to the rest of the log’s pointed commentary. And something about its last words leave me reluctant to ask the log to repeat itself. So, I don’t.  Not that I’m given much of a chance to, though, either, because in the midst of all this exhaustion and elevated tension, my heart already thudding in my chest at this introduction to the first Alliance member I have known close-up . . . a loud clatter at a nearby food stall startles me: the shape of the sound too abrupt, too deafening, not to awaken some more primal instinct. It’s only a moment’s disorientation, honest, for a little tom in a great big alien world. Only a flicker of a memory of the last similar dramatic upset to accompany a startling sound . . .  Nevertheless, it’s enough to have me leaping wildly, claws bared, fur raised, as if from one yoru’nan bough to another of those near stonelike perches in the forests of Uma’u . . . and then leave me struggling to process the existence of a terrible sound, an immense yawning pain that seems to travel the whole canteen ring before I realize just where it’s coming from.  Oh, no. Not from me.  From the log.  For I realize then, my dear one, that I have flung myself straight into the lignin-scented richness of this other sentient being, my claws sinking deep—painfully deep, I’m afraid—into the moaning log’s mossy bark. Notyoru’nan bark, either. Not that sturdy bark at all.  I’m sunk so far into the Alliance-Fen’s outer husk before I realize this, though; so frantic with the sudden urgency of wresting my claws loose from this fellow creature who has done me no harm. I never see what is used to knock me out—in both senses of the term.  I vaguely imagine it to be a branch, but no, I later learn: a hoof.  5. /we.ne.a.ta/ the loneliness that begets another’s loneliness in turn Small worlds, these Partnership way stations, with their portholes overlooking miracle planets and tech-shackled stars, and all their ships and species just passing through or else lingering awhile to study this system’s ancient, vanished race. How many stories here, I wonder? How many unexpected connections between citizens, species, and whole compacts?  When Jess first told me about the lone Retet working storage here, for instance, she never mentioned that “storage” was also the part of CEB-21 with holding cells. Or maybe she had, and I’d just fallen to dreaming through that part of her chatter? I wouldn’t be surprised, if the latter: all the most important parts of those waves of tedious Partner speech always seem to pass me by.  Yet local penalties for their oversight never seem to, too.  I do remember being told, though, that the Retet is an “it”: each giant rodent in its species sharing genetic code with its birth brood, and all Retets are neuter until the time of mating, when each chooses what role to play within proceedings, before reverting to “neuter” afterward. And now I begin to see, Wene’ss, the other side of my feelings about that pitiful feline creature in Jess’ quarters—for what would this Retet think, I wonder, if our diplomatic mission had brought along a native delicacy from a species much like its own, but in mentally deficient miniature? Is there perhaps a species on CEB-21, too, that keeps primitive simians in similar captivity? For amusement? Subordinate companionship? Repast?  It begins to dawn on me that each higher-sentient species now seeking communion with the rest on this station, in this compact that extols such grand virtues, represents no less than its own world’s brutal conqueror; and that none of us comes to our present fraternity save through histories of planetary strife still visible in all the species we still keep in private service.  Of course, such musings truly belong to another timeline, don’t they, dearest? One in which our delegation is unharmed and progressing smoothly through first contact activities; where perhaps I’m striking up conversation at a formal function with someone mutely standing by while his own, dazzling version of a Wene’ss parlays with you over treaty terms and future plans for the Uma’u. Oh, I’m sure we would’ve spoken then of all the histories of injustice our two species had so valiantly surmounted, while also tacitly reminding each other that, should the need arise, our respective peoples nevertheless stand ready to war again.  That’s the sort of might we’re used to wielding, at least, isn’t it? But in this universe, for all the supposed civility of this research way station . . . I am but a single, solitary tom in high-tech captivity . . . and just thankful that the Retet seems discreet. It keeps its distance, that is, while attending to nearby maintenance tasks, which allows me to watch it without being too obvious about watching it, from within this semicircular, see-through enclosure, with its arc of a padded bench that terminates on one side in facilities for physical release. Since privacy is not a consideration in this cell’s design, I see no reason to keep up my own pretense either; to linger in the provided jumpsuit so as to “fit in.” Even thusly freed, though, stress grooming is not easy with the headache that lingers from the Gremshu’s knockout blow. I manage a few licks before it’s too much, then turn on the bench, ready to descend into the Otherrealm.  At length, though—at respectful length, I might add—the Retet pauses in its labors, glancing my way, and all drowsiness leaves me at the fact of his staring. I am uncertain, after all, just what I expect from this other loner on CEB-21: Pity? Fraternity? Curiosity? Nor do I know what it really sees in me, as I curl up to rest within my cell: An angry alien? A poorly domesticated pet? The first is what Jess says was given to her in the Fen’s report, as an account of my behavior in The Trough, corroborated by “witnesses” whose names do not even matter, for how much they’re all strangers to me here.  Indeed, if I am disappointed by anything in this supposed case that rose against me in two mere cycles here, it is only that even the Gremshu’s coils seem to be in disagreement over what they witnessed during volunteer detail. There is an argument within the herd, that is, because some coils had a more abiding view of the “attack,” and others only swiveled to observe after the vicious blow had landed. Usually the coils in their species would side with whichever was the most direct witness, but occasionally something in the Gremshu as a collective maintains a broader, more persistent doubt. So it seems has happened here—the inner hunch superseding the verdict of its many “eyes”—though why, I can hardly even speculate. Maybe it was the fact of its own isolation, the way a loner might side against another loner to reinforce its own stability in a larger hierarchy? Or did all the way station and alTspeaK insinuations have something to do with this: all those background suggestions that maybe the Uma’u’s diplomatic mission had first done something to merit so outlandish a terrorist attack?  But what do the specifics really matter, eh, my dearest? It’s all fear of the unknown in one form or another. For ours might be a little species among these giants, and I might be a particularly little tom on CEB-21 . . . but still, such rumormongering has given me an aura of some kind . . . something above and beyond scent and posture and word alike . . . that has changed how all Uma’u are seen. Changed our reputation enough, that is, to turn even other lone sentients against me, and leave me licking wounds in the bewildering shelter of a holding cell, while the Supreme Council organizes a mediation to assess the charges set upon me.  So after all that, my lovely . . . what am I to expect from this other loner, too?  But the Retet surprises me, tense as I am in the slipstream before dreaming. It faces me without approaching, then tilts its head, looking less confrontational as it speaks.  “Awenato, right?”  And . . .  Oh . . .  Oh, Wene’ss.  Oh, beloved.  The sheer sound of one’s name, when articulated correctly after so long!  I draw myself up, with a cautious stretch of my hind limbs, to a sit.  “I have—no name—of yours,” I attempt.  “Zittru. Zittru of the Barrow Rennick. But Zitty’s fine. Plenty find it easier.”  I squint into the broader shadows of the storage bay. “Zit-tru,” I say, firmly.  Zittru’s cheeks widen—a Retet version, I think, of the Humans’ smile. “Close enough,” it says. “How’s your head?” It gestures at its own, to help confirm comprehension.  “Better,” I say. “In—physical, at least. But mind—surprised. So much to be learning.”  The Retet approaches—one step, two, then pausing. It does not seem afraid of me so much as afraid of giving the impression of aggression: It, having space to run; and me, still trapped. Its apparent consideration relaxes me, and I let my tail hang loose.  “When I first arrived . . . ” Zittru continues, “I entered into a bad spiritual argument here. But I was okay, because I wasn’t the first Retet everyone else had seen, so when I said something that seemed like a threat to someone else, a third party intervened and explained. All was fixed really quickly, and nobody thought that my mistake reflected on everyone from my far-off home. I mean, it might have, for all I know—because for my people, the Golden Tunnel is everything, you know? But, to other species, it can sound like I was threatening to put them in a tomb. If someone like me meets a species that believes the Divine is in the air, not the ground, well, sometimes things get intense.”  I do not understand all of Zittru’s words, but the general impression seems promising. An attempt at empathy, a meeting of minds, through similar misunderstandings in the past?  “What is . . . the Golden Tunnel?” I ask.  The Retet’s cheeks puff out further, joined with a soft chitter I feel safe interpreting as amusement. Zittru’s whole posture, at least, conveys no active threat.  “It’s . . . Hm. How to explain? A special space. A secret land for Retets. A place where we go when we die, and sometimes visit when we’re living, too.”  My ears prick up. “An Otherrealm?”  Zittru’s head tips from side to side. “Sure, another realm,” it says, though its emphasis does not seem to reflect my own. “They tell me that the Uma’u don’t have faith in the Divine, though, so maybe it’s not so easy to understand?”  “No!” I say, moving to the edge of my padded bench before realizing how unclear this exclamation is. My head still throbs, but, oh, Wene’ss, you have no idea how hungry I am for this connection. It is . . . such a simple thing on the surface, this thread of fellow feeling entwining between strangers, but in all my weariness after the event in the canteen ring, how like a beacon this communion feels. The Retet’s words and its behavior, its apparent understanding and its calm, clear speech . . . they’re like a laser pointer directing me to look, look here!  “I am meaning—yes, it is easy, this understanding,” I explain. “We Uma’u have place too. Place like . . . an away-from-here. Now-away-now. Iren’i. It is with us in the dreaming, and it is waiting-us after death. Already my deadmate is living there, ima’i. Now-here-now.”  And I go on—explaining the yoru’nan trees with their glossy-hard bark shining bluer in the daylight, and the green-gold rivers of late-summer grass that wend and weave all the way out to the horizon. And the Uma’u smells. The thick tastes of Uma’u ancestry in the wind. The Uma’u secrets dwelling, so many of us believe, in far-off mountaintops. My Partner phrasing is still not the strongest, granted, yet the Retet considers my words with steady black eyes upon me, as if taking each one seriously. As if willing to wait forever, for them all.  “Well,” says Zittru, at last. “That might explain their fear of you, then.”  I flare my nostrils, softly yowling in incredulity. “Fear of me? What happened to—they speak of this sometimes—the ‘same example’? Why not me as the same example, too?”  The corners of the Retet’s mouth twitch. Amusement? Difficult to say, but its body’s posture and odors are still relaxed. That must suffice, for now.  “Who taught you that? From The Sunmaster’s Journey, right?”  I tense a little in my cell. “Not—not the . . . Star Baby Voyage, no.”  Zittru throws back its head and chitters merrily. The louder emotions are easier to recognize, and I am beginning to realize that these Retets are not so different, either, from our delicious crunchlings back home.  “No, not The Starchild’s Voyage,” it continues, “though, yes, the Alliance’s version of the text is similar on this accord. But it’s a funny expression, which is why I’m asking, Mr. Awenato: ‘We are all the same example’? Is that what they taught you here? Just like that?”  I blink a few times while considering. “More or less.”  The Retet exhales and shakes its head. “Context, my little friend. Context matters. It’s from a poem where every creature says that to another before they eat or kill it. It’s a poem about the hypocrisy of our claims to want equality. But some people just take the line on its own because it sounds nice. And yet, as you’ve seen yourself, in practice . . . ?”  Zittru gestures at the broader storage bay. I understand its point from within my cell.  “Will they be killing me soon?” I say, quietly, after what seems an appropriate pause.  The Retet whistles. “No, I think not. That would show incompetence on their part.”  “What, then?”  “They’ll use you as an example. A different kind of example, of course. Not like this ‘same example’ that everyone uses out of context. You’ll see soon enough, in mediation.”  But the weight of this news, Wene’ss, transfers strangely to all parts of my body. Is it possible for one’s very fur to feel angry? I had never thought so, but in that moment there is fury right to each hair tip, I’m certain of it; and radiating from every tooth- and nail-point, too.  Make an example of me at their mediation!  After letting your murderers flee?  On what possible authority? In what mad flight of arrogance?  I flare my nostrils and remind myself that this Retet is not responsible for the callous treatment, the utter cruelty on the rest of the Partnership’s part. I remember that, my love: I do. But I also need now to know this truth in full, in all the ways that the Humans and the rest here have been too afraid to do.  “Why—they hate—Uma’u?” I ask so-far-honest Zittru, before sitting back on my haunches and waiting. If I had asked anyone else, how quickly they would’ve rushed to negation and reassurance, telling me that I must be tired, in need of more recovery. That I can’t be thinking clearly, because of course we’re not hated. Of course our dying was a mistake!  But this Retet, I notice right away, is not at all surprised by my question. It studies a spot on the floor and sighs, then nods to the jumpsuit in a heap beside me.  “You still have your scop, yes? I see the bulge of it there. Can you access anything on it? Look up Partnership texts? Or are they out of your access range?”  I puzzle over this last. Access range? I suppose that’s a feature I would have better understood if I’d ever made an effort to interact with the thing, to surmount how much my paws tremble just to hold it, and how my claws click nervously over the outerplex and metal of it. My radioactive talisman: which I had hoped would make me look a touch more natural among the station’s complement; which has instead only exacerbated the feel of your eyes upon me in the waking, as if whispering to me as well, you have the means, it’s all right here, all the names and places and star charts . . . all of it! So why not act, act already, avenge me, my guardian, my only!  High Court-help me, Wene’ss, but the mind truly creates some unusual associations in the throes of trauma, doesn’t it? Latching on to just the strangest branches in fierce winds.  “I am having—Sunmaster Journey on it,” I tell Zittru, though I am not sure how true these words even are: “No more, I am thinking.”  The Retet lifts the folds over its eyes. There now. There is surprise.  “Yes, well, that’ll do. If you feel my rumble, then . . . there’s this argument on alTspeaK forums. It started when the Partnership came to this system and realized that an ancient civilization had been here long before us. That really got under some people’s diggers, because here we have this major story about Sunmastership, see. And what does that mean, exactly? Well, it’s about achieving greatness in the cosmos—as an individual, as a community, as a species, as the idea of sentience itself. It’s the basic blueprint for all our compact’s success to date—or so, at least, the Partnership likes to tell itself.  “And yet . . . that central story never mentions this other species, these other beings who mastered all of that and more, long before us, and then . . . disappeared. So, some people in the Partnership and the Alliance of Friendship have been looking for hidden signs in these stories. Then we discovered you, the Uma’u, only a quarter-lightyear from Drasti Prime, and well, some of us . . . considering how close your homeworld is, some think there’s something you Uma’u aren’t telling us. That you’re hiding other secrets for this ancient race.”  Zittru speaks so slowly, my love, and uses plain speech as often as it can. Why can the others not be as careful and considerate? I have never before wanted so much to lick—but not eat—a rat as I do now, for I understand almost everything it says the first time through. My questions are myriad, of course, but as I try to order them my ears prick first at the neutrality of the tone it’s using to relay all of this to me.  “On—alTspeaK—they say these things,” I begin, confident that this generous Retet will allow me the time I need to form my questions better. “But not . . . you? Why you are not thinking the same things? Worrying the same worryings as all the rest?”  The Retet puffs its cheeks again and hums. “Because, Mr. Awenato . . . like I said, I am on my way to the Golden Tunnel. I know The Sunmaster’s Journey is only a story for this multiverse. Meanwhile, I know a story of . . . something bigger, far more important to us all.”  This Golden Tunnel, of course, sounds like nonsense, but do you remember, my love, how Yukelene carried his own silly notions with us into the stars? All our instrumental data, as we prepared for cryosleep, could not deter him from his conviction that our dreaming forms existed in the Otherrealm even while we were in the waking; and that if we entered cryosleep with the right mentality, already in the dreaming before the freeze kicked in, we could find even greater truths while we lingered with our loved ones there. Yukelene was . . . an excellent computational chemist, of course. But intelligence in one realm is no cure for the power of ego in another; and yet, this foolish conviction was as much a part of him as his tail. Without it, he would have died . . . oh . . . long before that tube exploded. Who would dare take it from him?  I thank Zittru for its kindness, then, in sharing its knowings with me, despite how impossible and absurd some of them appear.  Mind you, Wene’ss, I want to thank it for so much more—for its patience with my Partner; for the clarity of its own; for its understanding in general of my aloneness here.  But now I do not trust my words for another reason.  I am not certain, you see, if I can utter them without my heart seizing up at so much sudden, unexpected acknowledgement of my fear and smallness here.  Without devolving, that is, into an embarrassing round of whimpers . . . maybe mewls . . . for having felt, for the first time in whole lunars, seen.  6. /ne.we.o/ the loneliness that sees the loneliness in another and cannot answer with its own Nevertheless, I am revived by Zittru’s kindness in the long run, and by the hour of mediation, two day-cycles later, I can at least hold Urrum Urree’s scop without trembling—even if reading from the thing still seems an unbearable concession to the world that took you from me. Urrum Urree seems pleased enough by this progress when it comes to collect me, though, and soon I sit, a small weight on one side of the mediation platform, while the Fen’s representative speaks of our people in a most exaggerated way. I cannot follow all the words, but I understand this representative’s manner well enough.  Kap is the mediator—selected from the senior crew, I am told, by the Partnership’s Supreme Council itself—while Jess sits with evident apprehension among the few not simply watching these events via alTspeaK livestream. There is something called a “j-bot” in one corner, recording and translating everything that proceeds in here for online observers, though I don’t understand why there is so much interest in so middling and minor an event. Have they no better entertainment broadcasts in this compact?  Kap is asking the Fen’s representative, in any case—while I muse on all this and more from my booster seat—why he’s taking such a retributive approach in proceedings that are, at their heart, beholden to Partnership standards for common membership dignity above all else.  “Is this a joke?” the representative returns, waving an arm at me. The representative’s digits are long, spindly, and sevenfold upon each stump of a hand. Even as he holds that stump steady, his digits seem to quiver in place, as if sensing the surrounding atmosphere. A little like thick whiskers, dearest—if not for the little bioluminescent blue nodes at their ends. You would have had trouble, I suspect, not trying to leap for them and tear those blue nodes off. I’m tempted, honestly, myself. “Does the defendant look like a Partnership member yet?”  Urrum Urree exhales sharply, rising on its stumps with a branch thrust back in the other representative’s direction. The log would not permit any other to represent me, once it learned who’d filed the claim. “Jafris!” says my log. “This is the sole surviving diplomat—”  “Oh ho! So, we’re going to plead diplomatic immunity now?”  “Now, now, Jafris, you know there’s no such thing,” says Kap, not a little wearily from her mediator’s chair. “And none of this ‘defendant’ nonsense, either. Listen—I understand that there’s a way of doing things among the Dutri, but is it really necessary here? All that pomposity? All that combativeness? Does your client really—?”  “My client only wants what’s best for the whole of the station, and let’s face it, the Uma’u haven’t given us much to work with. We know the texts, we know the stories—”  “The Starchild’s Voyage is a teaching document,” Urrum Urree protests, rising anew. “Inferior to The Sunmaster’s Journey, perhaps, but even then, neither is meant to be read with that sort of fanatic rigidity. You’re going to argue, what? That a small and isolated alien, traumatized after the violent loss of its own people, left to its own devices on this vast station full of strange sights, sounds, and cultural differences, poses a genuine threat because a sensory trigger spooked him into a defensive response? I assure you, my Esteemed Elloo Ellu, that my client is deeply sorry for the wounds caused by that incident, but this is all a terrible misunderstanding, not this nasty conspiracy that you’re all—”  “‘Left to its own devices!’ Hah.” The Fen’s representative turns giant, buggy eyes to me and blinks slowly. “Clearly, Urrum Urree, you’ve lost your touch, or else you’d have felt the presence this being carries with it. You think that the Fen walk well with others? You think that you and my client know what it’s like to sit with the whole universe in all its grieving? Well, I’ll tell you plainly—you, our Esteemed Mediator, everyone listening in—that when this Uma’u attacked my client, Elloo Ellu recognized something more to this alien than maybe met everyone else’s eyes. An otherwordly force, in fact—just as the ancient texts predicted! By which I mean, Mediator, that this Uma’u has the means to travel to places you and I could only dream of. And yet he chooses not to share them with us, to let us know the full power in his claws. My client could feel that power, though—because it wasn’t just the claws, and it wasn’t just the fear; and the Gremshu felt it, too, which is why they went against the direct witness of some of its coils. Direct witness, as you know, can sometimes obscure greater truths! And in this case, the Gremshu tells us that there was . . . another scent involved. A dangerous flavor. My client sensed it, too. And so my client is not, I repeat, not on a mission of retribution here today. Mediator, I beg of you, understand us: we come before you today seeking only truth.”  Kap glances my way with a raised eyebrow before studying the injured Fen, Elloo Ellu, which still bears a mud-like substance over its wounds. Then she turns to Jafris, with all the representative’s long, spindly digits twitching. Next, Jess’ lifemate rests her forehead on two clawless fingers, painted at the ends, and nods Elloo Ellu’s way.  “Well, what are you asking me to do here, exactly? Just how do you propose we arrive at this ‘truth’ your representative suggests you seek?”  I am not alone, I suspect, in hearing a hush settle over the broader assembly. Jess in particular looks to be holding a concerned breath from her place in the audience, but even Jafris seems surprised to have been indulged. Urrum Urree creaks a sigh beside me, sinking back on its stumps with two knotty protrusions folded over the mediation platform.  “Confine it,” the opposing Fen exhales triumphantly, with a thump of its branches. “Confine it until it confesses!”  Did you hear that, my love? It.  Kap reclines in her mediator’s chair. Considering? I’m not greatly concerned by confinement myself, Wene’ss. I will simply return to the dreaming as often as I can. What is this whole way station but a form of confinement for me, anyway? Just waiting, waiting, waiting until the Supreme Council runs out of excuses for not treating me as I am due. For not letting me return to active service, the official diplomat for our people that I should have always been.  “The entire point of a first contact delegation, you understand,” says the mediator slowly, “is to establish a rapport, a basis of fraternity and free exchange. Instead, our guest here has been placed in a disorienting position since his arrival. He has lost the rest of his team. Stars, I don’t think we’ve even . . . Have we had the memorial yet?”  My ears prick at this. I follow Kap’s gaze to another in the audience. A station medic, by the uniform. The figure rises in its formal jumpsuit, clears its throat, and says:  “Ah, no, Mediator. I’m afraid not. We’re still waiting on—”  “On the Supreme Council, yes, yes, I figured. They do take their sweet time when it suits them, don’t they?” Kap waves this medic off, then turns her attention back to Elloo Ellu. “And yet, a very different court, the court of popular opinion, tends to rule with much greater urgency and exactitude, does it not? So, no, Elloo Ellu, I am not inclined to grant you this extreme request. Awenato will serve what we all must serve for second-degree harm without intent: mandatory service for three months of work-cycles. Are we understood? Awenato?”  Urrum Urree nudges me and I stand, blinking both sets of eyelids slowly. “Awenato, I’m placing you with the Lucasian known as Seli to complete your service. Don’t think of this as a punishment so much as participatory community restoration. And I suspect that simply seeing you in the course of more routine labors will help more of the station to naturalize, too, to your presence. That’s what true justice is here, at least. Becoming less like strangers, more like partners in our grand, shared journey through the cosmos. And maybe even . . . friends?”  But Elloo Ellu of the Alliance rumbles through its affronted bark. “How dare you speak of justice now!”  And its representative, Jafris, echoes this with a wet snort. “Yes, so much for honoring my client’s wounds, Esteemed Mediator, and its simple aim to prevent more.”  “We do honor your wounds,” says Kap. Her words now have a seasoned quality, as if well-worn from practice among her people, and perhaps from other mediations. “But we ask, too, for your partnership, in our efforts to make a better system for us all.”  “Partnership! Hah. Do you hear that, Jafris? Another joke! See, this is what gets me about you people. You want to pretend that we’re equals when we’re not. An alliance of friendship is more pragmatic, more honest, because in an alliance, you never once forget who you are, where you came from, and where your bonds are strongest. But just where are your bonds strongest, Mediator? Or aren’t you willing to admit you’ve got your preferences? Won’t you admit that you’re fascinated with the Uma’u? And that this bias clouds its danger?”  Kap shakes her head. “You act as if there aren’t AI analytics behind every Supreme Council appointment, Esteemed Elloo Ellu. Your accusation of bias has no standing. But also, think, will you? This Uma’u isn’t going anywhere. He’s stuck here until we get word from his people, so everyone can rest assured that all precautions will be taken to keep CEB-21 safe.”  The Fen rustles its branches. “Well . . . you’d better be serious about that last part, Mediator—because there are too many Alliance lives here, and I will not risk them to the folly of Partnership negligence. You’d best monitor this . . . this secret keeper closely . . . or else, I swear to you, I will take those precautions myself.”  Kap’s lips purse tightly. “Mind your threats, Elloo Ellu. They will find you no favor here.” She rises, an action allowing all in attendance to realize that the mediation is complete.  And favorably, I might add, all things considered. Which makes my next choice . . . a little unreasonable, I know. But you’ll forgive me, Wene’ss, won’t you? You know how the saying goes about curiosity, after all, among the toms on Uma’u . . .  7. /ne.we.ne.a.ta/ the loneliness of the shared bed, a chasm formed between them So yes, as the mediation ends I ask Urrum Urree to let me have a moment outside the mediation chamber, to speak directly to Elloo Ellu. The wounded party does not accept these terms exactly—insisting that Jafris stay close at hand, for “protection” of all things from little me—but, it accepts. Also, outside the mediation chamber, its demeanor quiets some; I can tell as much from the fragrance of its patchy bark. It even seems to be listening.  “Again, my sorryings,” I tell it, not for the first time since these proceedings began. “I am hoping your healings are fast and many. My claws . . . they are made for much harder bark than yours. Nothing was done with bad intent. But also, please, I am also not understanding: what mean you in saying to everyone that there is more power with me than all the others were to be seeing, when I scared leap-attack-you in The Trough?”  Jafris snorts wetly, but Elloo Ellu is quiet. Its cracks and fissures exude surprise.  “Do you really not know?” it exhales, heavily. “I wonder. I felt it so powerfully myself when you attacked me, and I have been carrying the energy of that great fright with me since. So, maybe I misjudge your self-awareness? Or maybe you are just pretending that you don’t know the spirit that walks alongside you . . . Do you truly mean to tell me you know nothing of this, this massive animality that peers out from your abyss?”  Can . . . can this giant log see you, Wene’ss? Does it know of the eyes that stare at me in every waking moment? Oh, my deadmate, my dearest, my secret power through all my aloneness here . . . is it possible? Are you truly alive in more dimensions than even I thought I knew, visible to others in my own moments of extreme distress?  But Urrum Urree has been listening to all of this at a careful distance, and quickly returns with a gentle touch to my shoulder, the rest of the Fen’s towering form offering shelter not entirely unlike the reprieve of a yoru’nan tree in high summer’s heat.  “Quoting The Starchild’s Voyage to advance your paranoia does not serve our species’ central aim, Brother Fen. What point is there in bearing witness if you also try to coax the witness, too. I know you have been wounded, deeply, but come now: ‘The massive animality that peers out from your abyss’ is a line unfairly plucked from context. You know how the rest of the story goes—but this little twig, he does not.”  Elloo Ellu rocks back on its stumps and shakes its loose protrusions. “Surprising that you’d know, actually, Brother Fen. I thought you didn’t bother with ‘inferior’ texts?”  “It helps in my line of work to stay informed.” Then Urrum Urree turns its trunk to me, and though I am still hopeless at discerning the face, I can at least follow the yawning sounds to something resembling a source. “It’s a riddle, little friend. And the answer—the ‘massive animality’—is only your reflection. Just, the worst of oneself, peering back.”  I process these words; and with them, the other log’s manipulations, which had indeed given me to feel a flicker of momentary . . . doubt? Or hope? Yes, my queen, hope—hope that someone else had seen you, too; that there was evidence of your continued presence in this waking realm after all.  Then the mediation chamber opens, and more beings spill out, Kap and Jess among them. An audience. So be it. My indignation rises at Elloo Ellu’s trickery, as does my exhaustion with it all. I want . . . I want this awful log to tremble as it has made me tremble. I want it to know that, yes, I do have power after all, even if it will never really understand where that power lies. So—  “No, no, it is correct!” I say, raising my voice and glaring dull-goldly at Elloo Ellu. “You are correct. I have in me a direct line and I am communicating immediately with all the Ancients—all these . . . these Makers. That is the power you felt from me in The Trough. And I am telling them all this now, so you will be sorrying very soon. Yes, you will be sorrying so much when they hear all and decide what next. For you. For everyone in the now-here-now. For . . . for all of you. The whole way station, even.”  And this Fen from the Alliance does indeed freeze at my words—Jafris, too—but I have no time to enjoy my victory over their accusations, because all at once I sense . . . such fear as well in Kap. And Urrum Urree, whose protrusions tense over my shoulder. And Jess, whose fear is plainest of all on her large-lipped, naked face.  Ah, Wene’ss . . .  What is this foolish thing I have done?  Is this any way to shake those eyes of yours, ever on me in the waking; ever calling me to act, act now, avenge you through my dealings with these aliens?  8. /o.we.o/ the loneliness of living too long with the lie I am not spoken to much after the mediation—or rather, after the enigmatic threats I made outside mediation-chamber doors. It’s like those green-gold grasses back on Uma’u: a bending and a parting, riverlike, as I move through all of CEB-21. Everyone is careful and polite on my way to mandatory work placement, in the bio-dome where sustenance for all is grown. You might think the people here would be too afraid to have me oversee such a critical part of the local economy, but it is in fact a startlingly mechanical affair, even in parts where the illusion of genuine nature has been built into the walls, the floor. Plus, I am never alone here. The Lucasian, Seli, works here: has to, apparently, because the spritz of moisture some sections of the bio-dome offer are her only reprieve from the general aridity (for her species) of the climate elsewhere on CEB-21. A massive spider from the nearby world serves here, too. A Spinner, they call her. That arachnid is huge and cannot move about at all on certain levels of the station. Even here she has to keep her legs grouped close together as she moves through the bio-dome, and I . . . I cannot help but water for those legs, Wene’ss. I have the most terrific urge just to pounce on one and nibble at it as she drags herself along. Would she even notice the loss when there is so much of her on whole?  I know, I know, a terrible wondering for a diplomat. Only, she’s quite similar to one of our delicacies back home. Maybe a thousand times an ebe’li’s size? And wearing the most absurd pale-blue mask, vaguely Humanlike in its features, over her sumptuous red eyes.  Yet for all my hungry, salivating glances her way, the Spinner does not fear me as the rest do—and neither does Seli, though I have no idea if she’s even been told about the enigmatic menace I became outside the mediation chamber. After a few hours, though, in this uncanny world of compartmentalized soils, synth-scents, and chlorophyll mixed with artificial composites, I realize that she poses another challenge for me anyway: the fresh peculiarities, that is, of her specific Partner accent.  It’s . . . Standard-Variant, I suppose? But while the others often slip into idioms directly translated from their native tongues . . . the ancestral tunnel-dwelling Retet leaning on “feel my rumble” for “understand me”; Elloo Ellu’s colorful “Are you kidding me with that fungal rot?”; and almost everything out of a Gremshu’s coils . . . the Lucasian is different. This Lucasian simply seems . . . as bad at Partner as I am.  Just, bad in different ways.  I might gesture, for example, at some nutrient tubing that seems to require replacement, and say, “These are for the changing?”  Then Seli—a spongy-white mass with rolling lumps for limbs, like a giant multicellular clump fringed in cilia—will open her speech-lump to utter in rounded, popping syllables:  “PAH-fect ob-PAH-servaSHAH-n!”  And it will take me a few seconds to process the words beneath the pops, both because the accent is so heavy and because the phrase she is leaning on . . . isn’t a perfect fit. She has many of these catchphrases, though, and she cycles through them in lieu of generating more nuanced speech. Worse, she cycles through them almost nonstop, as if speech in some form is as vital to her species as air is to our own.  For all my direct exposure to her, too, you might think that my ear for her alternately accented Partner would improve. But, oh, you can laugh, my queen, for it definitely has not.  Nevertheless, I am relieved not to sense animosity or fear off Seli’s massive form, nor disappointment when I choose not to interact with the baffling rhythms of her relentless chatter during our shifts. Some days, I concentrate instead on taking out the scop and holding it a little longer in calm hands. Watching myself a little longer, too, in its dark, reflective glass.  A half-lunar passes as such, with Seli and the gardens of CEB-21 and the gifted scop; and then, one day-cycle, while sitting with the device on break, a delicious shadow nears me under the meat-fruit trees.  “Difficulty with the scop?” says the Spinner. “Do you require assistance?”  I look up at this richly scented arachnoid feast.  “Thank you, very kind,” I say. “No, I am . . . I am only afraid to use it.”  Tick-tick-tick-tick. Its legs shuffle in place, as if processing this.  “Well, yes, that is a silliness of mine, maybe,” I add. “But in this machine is a story that I am being told over and over explains the hurting of my people, my deadmate, my everything. And I am thinking, over and over . . . I should be learning the story, yes? To learn how to defeat it, how to keep it from ever hurting my people again? Also, I still need to hunt those who hunted the rest of my crew. Maybe this will help with my hunting, too?  “But also I am thinking over and over: What if I read it, this great big story that everyone here is talking about in so many different ways, and . . . and I am learning that the story is not in fact holding all the danger to my people? What if there is nothing in here at all to explain why these people acted so killerly to my one, my only, and the rest?”  Tick-tick-tick-tick go those legs again. Then, slowly, as if recalling an underused habit, half-forgotten to muscle memory . . . the Spinner reaches for her blue-spun mask and slips it from her eyes. So many glistening, juicy red eyes. And that sweetness, her pungent heat . . .  Wene’ss, I swear, it really is like an ebe’li—only, blown up a thousandfold, as if for another’s purpose. I can almost imagine what it would be like to lap at one of those fresh eyelings, or to set the whole of that body for a minute or two to roast . . .  “You are Uma’u,” says the Spinner—reminding me that she is more than food.  “I am,” I say, working my salivating maw around the words.  “But also . . . you are not . . . uma’u.”  And oh, Wene’ss. Wene’ss . . . Every hair on this lone tom’s body stands on end to hear that nuance after so very long. What a curious meal this creature is! For it knows, somehow, both “Uma’u” the planet, the people . . . and also uma’u, the concept: u-,a completeness always doubled around the noun phrase, plus ma, the undeniable fact of something’s existence.  So—  No, I want to say to this brilliant nibble. No, you are right, I am not whole. Far from it.  But the words catch in my throat.  The Spinner seems nonetheless to understand. She continues:  “You need to hunt those who have taken uma’u from you.”  “Yes—yes!” I manage, almost a squeak while I startle into a better posture. “Yes, exactly. But the story on this scop . . . this is not the way to be going, is it?”  The Spinner stares at me for a lengthier silence, which puzzles me. I know that my chosen vocabulary was not complicated, so what about my question is so difficult for this being to process? Is it one of the lesser sentiences here, perhaps, for all its massive size?  “Uma’u needs no story to find uma’u,” she says at last.  I crouch to process this in turn. “Because . . . because I am having the dreaming? But the dreaming is not enough for uma’u. I have in the waking still the eyes of the dead, and they follow me everywhere I go. They are telling me I am needing to act, but how, how can I act when the people killerly are far from here? So far in the waking. How can I be reaching them, when the Partnership has control of all my moving here?”  A lesser pause this time. Perhaps the Spinner needs questions posed more directly? I remember Ese’ima being literal like that: An excellent technician, while she lived. A brilliant engineer and planner, so long as every project parameter was known precisely to her first.  “Spinner has the spinning. Uma’u has the dreaming. Every piece, its powers and parts.”  And then the giant spider dips low on its massive legs, until one of its bright eyes is level with mine, and I can see the whole of my distorted reflection in that gloss, and she says to me in perfect High Court Uma’u:  “ . . . ’beata neru’yoli, odanata ine’atali ane’na . . . ”  Walking mountainward, the hunter to his fate is arriving. The Spinner’s Uma’u really is impeccable . . . but then again, Kap did mention that some of the AI here were studying our culture and our language. Should I be surprised to discover another has, as well?  Next, I let the meaning of these perfect words sink in. Walking mountainward . . . but, there are no mountains on CEB-21. Only in . . .  But is that possible?  Oh, Wene’ss, I can almost feel you catching at my ear again with your fierce teeth, but consider it for a moment, won’t you? What if our tales about distant vistas in the dreaming are not just told to younglings to sooth them when older toms and queens go on ahead? What if we have always had this other way to slip between whole worlds, and realms, and . . . stars?  Then again, for all I know, this Spinner is simply pulling a trick like Elloo Ellu. Maybe this is just another line from those accursed texts of theirs—only, translated this time into Uma’u, to try to manipulate me again, into giving them what they all think I know?  I set down the scop by one of the water filtration tanks, a wave of exhaustion following my uncertainty. I want no more of it, my dearest—all these Partnership stories, all their impositions on our dreaming. Where am I, where are you, where is Uma’u to be found in this supposedly enlightened compact?  Uncanny timing for this question, though—because not right away, but mere hours after, as I gather my things to leave at shift’s end, Seli calls me over with a heightened PAH, SHAH, AH’ing of her Partner. Excitement, I think? Followed by a slight deflating of her form to show signs of solemnity and sympathy, too.  “TheyAH AHre HAHving it!” she tells me. “FAHNAHlly! AHweNAHto! THAH celebraSHAHn of LAHfe FAH YAHr peoPAHle!”  Oh, but I don’t even try to parse this, my queen. I have long given up trying to understand her. I incline my head instead to study Seli’s scop. There is indeed a message on it for her to pass on to me: “A celebration of life.” A memorial service. A funeral, whole lunar-cycles overdue, for Uma’u’s dead. There we are, my dearest. At last, and so long overdue.  So why now? My ears flatten in careful contemplation. It has only been . . . two quarter-lunars, after all, since all my mysterious, menacing talk about having connections to the Makers. Could that have done the trick? Did that finally make the Supreme Council think to take me seriously—me, this frail little tom that for lunars now they’ve been insisting simply needs its rest, and should not worry about such things?  I consider doubling back and taking that flying leap at the Spinner’s leg in my euphoria at this news. No, I’m not irate with her, of course—but a thrill of hunger’s rising in me, my beloved. Power, my love! Agency, my queen! At last!  And, oh, Wene’ss, I am ready now. I am wanting again . . . so much more.  9. /we.ne.we/ the loneliness that welcomes its own existence as an invitation to seek out more You should be here to see this in person, my dearest—truly. What a grandiose affair of a funeral the Partnership finally thinks to throw for me, on all of your accounts. Five beautiful pedestals, each with a holoimage of one of you upon it, with details projecting outward when sensor-triggered by passing spectators; each with biographies for all of you, too, which have been drawn from the mission brief and given a distinctly Partnership flavor. Such slender fragments of all of you, really. Nothing in yours, for instance, about that fearless klutziness I so admired in you, when stood first on the cusp of queendom. Nothing in Abareto’s bio, either, about the wager he once made, and lost, with the captain of the islanders’ guard, before the High Court ruled that all island toms had to be eliminated for the good of the mainland, and all the queens there redistributed among the other colonies. How Abareto had wandered through the ruins of that island settlement for months after, uselessly fixated on the fact that he’d never had a chance to pay back what he owed before the massacre party had torn through that place, with him among the invading forces.  There are many forms of guilt we carry through the waking, aren’t there, love?  I wonder myself—I never thought to ask him, of course, but . . . I wonder: Did Abareto have the captain’s eyes bearing down upon him in his waking, too? And if he’d been the one to dawdle on our ship with the luggage—if he’d been blown back while all the rest of us, scampering on ahead to CEB-21, were tumbled out into the darkness . . . would he have the same hauntings that I do now?  Well. One can hope. Here, though, is what I do know:  There are stories we Uma’u tell of being Uma’u.  And now, in the Partnership, and in the Alliance of Friendship, there are stories the outsiders tell of being Uma’u, too.  Then there are the littler stories . . . of me. At least, these are the littler stories I hope that all the toms and queens here remember to tell only of me, as me—and not as some absolute example of what it means to be Uma’u.  Jess, for instance, must have such a story of me. She is among those who attend this memorial ceremony, as is Kap. So many are here, I’m convinced, only out of curiosity. Others, out of suspicion. And oh, maybe a few out of genuine condolences and horrified grief, that such a violent act should have happened in so peaceful place. But as for Jess and Kap . . .  Is it guilt that brings them here, or more fear?  When Jess approaches me this time, while we mill about in wait for the appointed hour for speeches, she no longer attempts to touch my fur without permission, and neither does Kap linger by her side to ask questions about our people. Kap does not even make eye contact with me, really. Since we are in The Trough, converted for the ceremony to allow for a meal after, she sweeps past us for a drink instead. I watch her out the corner of my eye, though; note the care with which she repeats a cleaning ritual upon a single glass before pouring it. A kind of Human stress grooming, maybe?  Jess, following my gaze to her lifemate’s repetitive actions, confirms my suspicion.  “Kap studied isolation for her thesis, I think she told you?” says my old integration facilitator. “Because her father knew isolation well, and kept the household in a constant state of readiness, out of fear that what’d happened to his wife, her mother, on their frontier world might happen to them again. Kap’s . . . managed a fairly easygoing life since becoming an officer and moving here, all things considered, but she still has trouble, sometimes, accepting when she cannot control every variable. She’s been trying to find the perfect lock on things, the magic word that suddenly makes sense of every fear she’s ever lived through. But then . . . after what you said after the mediation . . . that threat you made to the Fen . . . ”  “I scared you. I am knowing this.”  But Jess looks down at me with . . . less fear than I expected. Her and Kap’s first bout of nervousness around me, I realize now, was a fear that I would reject their friendship, when they were just so fascinated by me—or at least, by the idea of me, and what my species represented in the way of new learning opportunities. Now, though, the second fear, the one I gave everyone outside the mediation chamber . . . that fear has changed their investment in the first. And so, I am not an object of fascination anymore. Only a scenario to be handled with caution, like everything else in their fragile lives.  I try not to be disappointed. There are so many ways in which I have served others’ understandings here of what Uma’u is. Of who I am. But even the flattering versions are unkind in their own way. In their oversimplification of, oh, everything about me. My uma’u.  In whose eyes does the truth of me matter? Only yours, my one, my only, my dearest deadmate—or at least the notion of you that my mind has forged to replace your reality in this lonely waking life. Even now, at this long overdue and clearly politicized ceremony, where a soft series of chimes at last marks our arrival at the hour of what will be my greatest performance in Standard-Variant Partner yet: a presentation of all your lives, and the immense wastefulness of your loss, to this strangeling group of species from across two compacts . . . Even now, your eyes loom larger than life on the canteen ring wall beyond the five pedestals and their associated plaques. Those two massive rounds of red-flecked gold, my queen, my everything, just . . . waiting, watching, frozen in that moment of your death I never did see firsthand, but carry with me, all the same, whenever we are not in the Otherrealm together.  I do not watch the Fens or the Humans in the audience as I ascend the added booster to reach a visible height for all. Nor do I look to the lizard-toms whose species-name I don’t recall, or to the Retet, or the Gremshu, or the j-bot for livestream participants, or any of the dozen other researching species that I have yet to formally meet, let alone even begin to get to know. I know what they’re all really here for, of course—the curious and the guilty, the grieving and the suspicious. They’re here for some greater payoff . . . not today, perhaps. But later. They’re here to convince me, with their presence, with this sudden united front of respect, that they can be trusted with the secrets of this ancient race, the Makers, that I have already given them . . . plenty of reason to think I truly know.  The game is so simple, really:  Show up. Pay respects. Ingratiate themselves with the little, unassuming tom that just a lunar ago they all smirked at or belittled for speaking so poorly, so haphazardly, and through so much ongoing trauma, in their frustrating Standard tongue.  And then . . . the gates to all great knowledge will open for them, yes?  Then I will introduce them to all that Uma’u knows of the ancient ones?  Oh, beloved . . . I do so hope there is truly a dreaming after we pass on, and that it is not just a false realm we speak of to soothe our younglings in the now-here-now.  You’ll wait for me there, though, won’t you? High up in the finest of yoru’nan trees, that we may nuzzle eternally in its perfect summer’s heat, tail in tail, that heavy maw of yours nestling so effortlessly under mine, tongues flicking lazily to catch and crunch on ebe’li, even in our drowsing, as they skitter past the fragile buds at last giving way to blooms?  Because first, my dearest, my only . . . after this last speech is through, there are some mountains in the dreaming I think it’s high time I set about exploring. Yukelene truly believed, didn’t he, that if you fell into the dreaming before you entered cryo, you could conceivably travel further? Almost anywhere?  Into Alliance territory, maybe?  Into what dreams your killers might still be dreaming even now?  Yes, of course, my love—if it works, I’ll tell you all about it.  The death cries. Their screaming.  Who else would understand me anyway, in that—or any—place? Canadian by birth, M L Clark is now based in Colombia. Clark is the published author of science- and speculative-fiction stories in Analog, Clarkesworld, and Lightspeed, with work forthcoming in F&SF. Other projects pending publication include a novel in the universe of “To Catch All Sorts of Flying Things” and “Leave-Taking,” and a humanist column and podcast to launch at the end of 2021.", "text": "20700 words, novella\nNine Words for Loneliness in the Language of the Uma'u\nJess: That myth’s as old as Earth, babe. Maybe it’ll take longer, but you can translate anything.\nKap: Sure, but with the same efficiency?\nJess: Ha! Haven’t you ever heard Seli? When’s language ever been efficient?\nKap: No, but, see, that’s the dream—the idea that another culture, in just a handful of syllables, can describe the same experiences we’re fumbling through with whole paragraphs.\nJess: Oh, come on, though . . . if someone groks your exact experience of loneliness in three syllables, how alone could you really’ve been?\nKap: Ooo! Now, that’s exactly the sort of thing I’m going to ask once the delegation’s settled in. Speaking of which—have they debarked yet? What’s your scop say?\nJess: Any minute now, according to—only . . . wait. No. Wait a sec, Kap. It’s security—it’s—blazes, babe, look—\nKap: What? What is it?\nJess: It’s—stars, just look, look at the—\nKap: Oh. Oh stars.\nJess: Stars, stars, stars . . .\n1. /e.we.o/\nthe loneliness of meeting a stranger in one’s reflection off the water\nI speak to you, my love, before I remember the end of you.\nNo matter.\nWho else would hear me anyway, in this place?\nBut oh, I should not be talking to you at all, my dearest. Not at this distance. I should still be lying in the Otherrealm, tail in tail with you on a heavy yoru’nan bough, while below us the copper-green grasses river-run all the way to the mountains in a late summer’s breeze.\nInstead, I wake to feel my tail in bandages, hanging from a medbay pallet three times my body’s size, in a room with gray-padded walls to sink a claw into. I cannot leap to them, nor spring up with hackles raised. The air about me is thick, astringent, and when I try to breathe I feel a terrible ache blooming along my lower spine. There is a powerful itch, too, across my fur—or no, across fur’s absence: erratic patches of seared skin with some vile blue smear of treatment over it. I twitch my ears in the direction of each beep and buzz, background hum and pulse, but no, there is nothing here of Uma’u. Nothing here of you.\nA giant mossy log looms overhead.\nI am still dreaming, maybe?\nNo. The mossy log exhales coherent speech through cracks in its . . . bark? An alien, then, but with no mouth like any in the recordings they gave our diplomatic mission, to try to train ourselves to speak in Standard-Variant Partner, and to hear it clearly when spoken by so many other species, too. Well . . . but you did say that the Partnership was big, my love, and that it held species unlike any our people had ever imagined, not even in our fiercest dreaming.\nOh, but Wene’ss . . . must this giant stump of a thing be the first alien I encounter in a fully conscious state? Why not one of the lizard-toms they have here, or the giant amphibians? I hardly know where to fix my gaze, for this log has four massive, knotted protrusions, yet no obvious patterning to guide me to a face. Still, I know it to be sentient. Attentive, even. When it speaks, it exudes an emotive odor—heavy, sincere—that helps it get the gist across. It’s attempting to reassure me. I focus on the words of greatest emphasis.\n“esTEEMdAH WEH NAH TOH, onbeHAFuv SEB-TWENteeWUN nth’ol PAR’nerSHIPcruIgreevwi’THYOU yurLOSS.”\n. . . SEB-TWENteeWUN?\nNumbers in Partner take me a moment to process, and then it registers:\nCEB-21, the research way station. Our destination.\nAnd, oh . . . you came so close to it, my love.\nBut also . . . LOSS. Yes. Yes, I know that word. The log’s last and also the most important, though at first I struggle to remember why. Whose loss, exactly? Mine? Vaguely, while the log awaits response, I wonder after you—where are you? where are everyone else’s pallets?—for surely one of you will be able to explain to me what this mossy being means.\nThe mind can do such foolish things sometimes, you know: accept death on the surface, as a matter of course, while also refusing to, on a far deeper, more important level. But soon enough your absence lengthens—the silence of you, and of all the rest—and when I focus on medbay sounds, I can use them to leap from now-here-now to somewhere long before.\nThere I remember . . . the gentle ping confirming a good seal for the docking tube between our ship and CEB-21. Then warmth: the rest of our delegation, familiar fur after fur, brushing past me as each scampers on ahead. Next, your musk, sacrosanct as it sweeps by, though you linger only to chastise me for holding our luggage wrong. Ah yes—and next comes my glib retort, the product of irritation after so long and rough a cryo-flight: What? We’re in a connecting tube. It’s not like we’re going to lose it to the vacuum of—\nThen that explosive flash from halfway down the passageway.\nThat taste of incinerated polymers in a haze of floating particulate.\nThat thrust from being thrown back while all the rest . . . all of you . . . tumble out.\nBack in medbay, the pain begins to radiate from everywhere: pain the size of the bed, the room, the station . . . or maybe I have my frame of reference wrong? Maybe everything’s collapsing to the size of me? Yes, that seems more probable: a smothering cosmos, this station, which suddenly I know that I hate, and violently. Your last stop—my dearest! My only! How could your last stop be so sterile, so impersonal, so far from our true home?\n“Who—you?” I manage. My Partner always needs warming up, but in that moment I can hardly breathe through my grief, let alone muster the energy to talk in any tongue.\nDoes the log sense this? It rolls back on its lower stumps as if to consider. When it speaks, it speaks slowly enough for me to make out more of its phrasing.\n“Well, ah—Urrum Urree is my name,” it says. “Of the Fen, a people here. But maybe you mean, who am I? A query about my function? If so, answer: I am one of the station’s counselors, here to facilitate spiritual support. Now, we saw no specific religious denominations on your species profile, and Jess thinks that maybe the Uma’u are like the felines on her homeworld—gods unto yourselves, you know . . . which, ha ha . . . ah, well . . . It’s a Human joke, she says, but made, I promise, only with the warmest of intentions. Only—”\nThe log creeks a wobbly sigh. “Look, Awenato of the Uma’u, we had so looked forward to meeting your delegation, and to learning from you about your world. But now you will have to forgive the haste and . . . yes, the errors, I suppose . . . of our introduction. First contact in the flesh! And already there has been so much tragedy. The Partnership hardly knows what to ask of you, at least until it has more information about the beings responsible, and so . . . who am I, you ask me? I am here. That is what my people are, and do. We bear witness. And so I am here if you would like someone to be. So you need not grieve alone.”\nI give myself the benefit of the doubt and assume maybe thirty percent comprehension of the log’s breathy speech. None of it impresses. My whiskers perceive too much else in this visitor’s performance—discomfort, uncertainty, helplessness—and what fur remains rises in lockstep with a low and territorial growl. These should be my feelings, mine first to express in the wake of this act of sheer depravity. Who are those brutish, careless toms from the Partnership to permit anyone to blow up—to destroy! to murder!—five of our people, then enter my recovery room entreating sympathy for their ignorance and sense of loss?\nThe log’s odor changes. Stillness. Awareness. Delicacy.\n“I understand,” says Urrum Urree. One of its knots grows branch-like toward a shelf beside my pallet. It places a portable vidscreen there. A “scop,” I recall, along with flickers of a memory from my earlier delirium, the incoherent pain and chaos of my first and most unjust waking here, when one of the medics had used her own to show me external footage of the attack, and all the . . . the debris . . . still spiraling out from station ports.\nBut—the death—event—I had struggled to convey to her in my limited, groggy Partner.\nThe disaster?\nNo, no, not the disaster. What comes after. With the bodies. I shook my head, striking a clenched paw in frustration at the side of my pallet. The goodbye-ing? Other-death-uniting-together?\nIt took her a beat to process my direct translation of two similar Uma’u expressions: ai’da, edan’neata. Ah, you mean a funeral? Death rites? Yes, we’ll be holding services. Only . . .\nOnly what? I try to focus on this sliver of memory, but that first waking was a mess of trauma, an agony of separation from you, my love, my only; and before I can distill the most important impressions from those first, most crushing moments of conscious and singular survival, that giant log in the now-here-now interrupts me by exhaling “This is . . . ”\nTeeth bared in annoyance, I nevertheless make an effort to stay in the waking as it continues: “ . . . The Sunmaster’s Journey. One of our sacred texts. It’s a symbol of strength and unity, and it lies at the very heart of the Partnership. Every species we’ve encountered changes it eventually. Adds to it, modifies. Swaps out local equivalents for core themes, then argues over whether the swap was true to the original. We were going to present you with a formal copy—your diplomatic delegation, that is—but now, considering . . . well, I simply hope it offers strength. I’ve marked some passages for auto-play, if you want to give it a try.”\nI say nothing, not even flicking my gaze toward the scop, and Urrum Urree dips its lumbering frame in what seems to be acknowledgement of its need to leave.\n“Oh, and the Partnership will, of course, postpone diplomatic proceedings until we’ve had a chance to inform your homeworld, which we know will take a while. Comms estimate maybe three lunars for our broadcast to arrive, and almost four in reply? Stars, how much easier this would be if we’d already reached the point where we were exchanging tech, no? Ah, but it is what it is. So, for now, there will be another with you soon, but not the negotiators. Not the politicians, either. First, and for a while: your integration facilitator, Jess.”\nSo many exhalations. So many words. A wash of noise to my tired, ointment-plastered ears. I do not even recognize this last word as a name at first. From sound alone, it sits in the verb position of the log’s strange Partner sentence. An order? A state of being?\n“What—Jess?”\n“Oh! Human,” says Urrum Urree, misunderstanding me in turn. “She’s the one with the feli—she’s Human. Another species here. They’re not easy, I grant you. But they desire truth, justice, and community, when it suits them. For now, I think this situation suits them.”\nI get the gist, though, and next try to parse what an “integration facilitator” is—but my head throbs, my fur still stands greasily on end, my claws are half-bared, and . . . did I mention that I am tired, my love? So tired by the effort of remaining here, alive, with breath, without you. Beside the pallet, too, is data-glass, my vitals flickering across its surface; and when I look at it, I can see the remains of my mangled face reflecting back. Oh, but what’s even the point of looking, Wene’ss, when from now on I will always be less than whatever I see there?\nHow can these toms ever hope to remake me without you?\nBy the time Urrum Urree leaves, my mind has completely dedicated itself to retrieving the first medic’s explanation for a lack of proper death rites. The rest of the memory fragment. Yes, in my frantic state she told me that there would be services eventually, but . . .\nNot with the bodies, I’m afraid. We don’t even have most of the pieces, see. It’s the vacuum, you know. The blast radius. They were projected . . . quite far out. Those bodies have their own trajectories now.\nI could study Partner forever, I think as I curl up on the oversize alien pallet and draw that radiating ache tight against my frame again, so as not to lose a trace of it . . . forever and a day, even, my oneness, my only . . . yet still I will never fathom the full weight of those words.\n2. /e.we.a.ta/\nthe loneliness of one’s own making, though the world still beats loudly all around\nHalf a lunar after my release from medbay, we drowse together, you and I, in a sliver of white light cast by CEB-21’s anchor star. The station’s maintenance workers, some of the only regulars I see when Jess is not around, keep trying to tell me that this is a very special way station, in a solar system filled with opportunities for renewal. They try to tell me that this star was an energy source for an ancient species the Partnership is desperate to find, and meet, and know, because in this system the “Makers” first developed extraordinary technologies capable of widespread transformation.\nWho knows, eh, what other wonders they might’ve developed since?\nThe station workers tell me this, I think, as though they expect the news to cheer me. As though, what, I believe in magic? Make believe? Miracles of timeline revisionism, too?\nBut oh, what need have I for magic, Wene’ss, and other such alien nonsense? I have our drowsing in the Otherrealm. And ours is a good drowsing, my dearest—especially this day-cycle, while all the station spreads report that our attackers have at last been identified. No, I was not told this great news first, or privately, which puzzles me, but no more than I’ve been puzzled by many other routines taken for granted here. What’s one mere tom in recovery to do about it? Rest, they keep telling me: your number one job is to rest. And so I have, but not entirely. Today, while I drowse, I also contemplate the shape of my revenge against your killers, corners of my mouth twitching around sharp teeth as I dream upon our yoru’nan bough, its glossy blue-black bark hard as stone right up to the distant branch tips, where fragile white flowers have started to bud, each one weighed down only slightly by the dreaming’s morning dew . . .\nThere were three killers, apparently, from three different species outside the Partnership: from a whole other intergalactic compact, with another mess of aliens, and a compendium of lying languages all their own. I wonder: Will they bleed different bloods? Taste different as my teeth sink into their necks and I wring their wretched, forfeit lives from them? Will they have any necks to wring at all? What sounds will they make as they expire?\nMy mind in the dreaming flits over many possibilities: A beetle’s crunch. A sponge’s chewiness. A rodent’s anguished squeaks. I have no confidence in any of them, though, for I have not bothered to open that scop, connect it to the alTspeaK network, and review the details at greater length. Cannot bear it, maybe—to see these three killers, in all their inevitable inferiority to the lives they took. Yours. Ese’ima’s. Yukelene’s. Abareto’s. Eo’rilen’s. If I were to look right then at the Partnership’s whirlwind of public forums, where every detail about your killers is now being spun into a host of wild new theories . . . and see nothing there but, oh, a bunch of worms staring back, however could I bear it? How would I refrain from beating this scarred old head against a bulkhead until its aching passed for good?\nAll I know from that murky sea of way station gossip is that these assassins hail from something called the “Alliance of Friendship” . . . and, oh, Wene’ss, are they toying with me, do you think? What kind of name is that? What kind of world is this? It’s all just . . . absurdity heaped upon absurdity, in this land so far from the sensibility of our home.\nBut then, who am I, even, to speak of home? Do I not remember it less and less every day? I could look it up on the gifted scop, but my claws tremble even to pick up the alien object, and so I leave it with all other Partner things inside the too-large quarters I’ve been given. I know there is a bio-dome on the station, but I have been introduced to very little here firsthand—not “strong” enough for the tour, I’m told—and so the closest thing I have to Uma’u is where I am now: curled up in the deep, round recess of a porthole near my quarters, where my still-healing tail can hang low in artificial gravity as I slumber, hoping to catch on yours in the Otherrealm.\nHold me, I whisper to you there. Hold me, and I will tell you of their brutal murders in the soon-there-soon. Like a mating call. Like each of your every favorite operas rolled into one. But ah, this day-cycle, dearest deadmate, you are to me but a restless shadow: your body twisting in its slumber, soft bluish underfur catching in the far-off sunlight; wide, strong muzzle nudging, then nestling under mine. So be it, my tease, my triumph—no interlocking tails for now, and no teeth bared outward against our shared enemies in the wild green-gold yonder . . . but still we are together, out in that dreamland thick with Uma’u gutturals, and Uma’u ears bent to the rustles of Uma’u forest landscapes, all twitching in a communicative dance as good as speech . . .\nWe are together, at least, until a Human approaches in the now-here-now, on booted feet, and then your shadow—my love, my loss, my only—darts again from my aching heart, up one of those elusive yoru’nan trees. Even the blossoms seem to shy into grayness without you.\n“Knock knock,” says Jess, in Partner.\n“No.”\n“Aw, come on, you haven’t even—”\n“Napping.”\nI draw my tail up and wrap it around my body: a poor replacement for yours, Wene’ss, but the best that this waking realm provides. I don’t need to open my eyes to envision what’s called a “pout” on that wide bulge of Human lips, nor to hear Jess hesitate before sitting beside me in the curve of ledge that rings this shielded cut of glass.\n“Is this a new one, your jumpsuit?” she says. “I like it. Fits better than the last one. Glad our tailor’s got your size figured out.”\nOr so I later realize that Jess has said, because my first conversation of the day in Partner is never easy. Not even after weeks alone among them. Not after all our months of prep back on Uma’u, either. What can I say, Wene’ss? I never had your gift for other tongues.\nThe best I can do is to recognize my lapses, like how I lose all but the present tense upon waking, and struggle to follow the cadence of words worn smooth in native speakers’ mouths. For me, in that moment, this Human has as good as enunciated “Iz-ZIS-anu-n-yer-JUMP-sooot? LY-kit! FITS-bet-r-n-uh-las-n. GLAH-dur-TAY-ler-sgot-yer-SIZE-fig-gerd-ow-t.” But . . . key words, my love. Key words. They help me glean surface meaning. As for the rest . . . well, there’s more to language than vocabulary, isn’t there? Even from a species lacking proper ears and whiskers. And Jess’ smell and posture convey . . . tension. Uncertainty. I am half her size, claws carefully retracted, on a station not of Uma’u design, at an agony of a remove from Uma’u itself, and my integration facilitator hasn’t even the perspicacity to sense your mighty spirit beside me. So, this distortion of power unnerves, of course.\nI stretch to a sit and resist the urge to stress groom. Not easy anyway, in this uniform.\n“What—new?” I try. Then, hearing my errors, I correct for the missing words. Oh, Wene’ss, how you would smile at the stiffness of my speech! “What’s the latest news?”\nJess exhales, shakes her head, and throws up her hands. More nonverbal markers of helplessness and frustration, affected or otherwise.\n“I don’t know how to tell you, Ah-wei. I want to say it’s going great—that they caught the perps, that the perps are in tribunal, that the perps are going to get what they deserve.”\nI contemplate the verb structure. Once I remember that “perp” is short for “perpetrator,” meaning the assassins, most of it sounds promising: they caught, the perps are, the perps are going to get . . . but still I struggle with the import of formal speech. I want to say, I want to say . . . Is that phrasing merely ornamental? Can she not say as much? Is all the rest a lie?\n“But . . . ?” I venture.\nJess smiles in a way that I have learned is less than wholehearted. Wistful. Forlorn.\n“Yeah, you get it,” she says. “I’m sorry, but your people chose a lousy time to try to join the Partnership. All good when you signed on, I’m sure—but by the time your delegation arrived . . . a whole PSY later . . . well, there have been some changes in upper management, and the Supreme Council now sees our trade relationship with the Alliance of Friendship as too important to gunk up by making a public example of killers in their ranks. And, yeah, they’ve got the names of your attackers now, but they also expelled those creeps instead of detaining them. Why? Who knows. All this fear about another cold war between us. I mean, for sure, they’re trying to bring about an internal reckoning, through extended barter at the trades-table, but it’s a mess, is all I can say. Ugly backlash bullshit that has nothing to do with your breed. Your—species, I mean. Your people just got caught in the middle, Ah-wei. And paid the price. Dearly, I know.” Jess pauses to breathe. “I’m so sorry.”\nNative speakers forget how easily Partner can land as crashing waves on foreign ears, but I understand I’m so sorry clearly enough, and infer the rest from context.\n“I smell it,” I say—and then, adjusting to the more common Partner phrase: “I see.”\nAnd yes, my love, of course I want to ask her more. I want to ask her, Why? Why did the killers do it? Why did they target so new and remote a species, one just beginning discussions to enter into the Partnership fold? And what is the Alliance of Friendship, really, to the Partnership, that fear of war should change its reactions so much in the wake of an external threat? Isn’t CEB-21 a Partnership station? Why does another intergalactic compact have so much power over its internal security? Doesn’t the law work here as it does on Uma’u: that if one resides in another’s land, one lives by another’s rules?\nAlso, more pragmatically, how can I even trust this Supreme Council when it says that all guilty parties have been expelled? What about local aiders and abettors? How can way station security be so sure they’ve found everyone in on the plot? How can Jess and her own lifemate, a command-crew officer named Kap, guarantee my continued safety here? Even though I have no other choice but to remain? Even though my duty for now is to await further instruction from homeworld—still an eternity of a quarter-lightyear away?\nI want to ask Jess all of this and more, but I don’t trust my Partner with the precision such an asking requires—and because, oh, my loveliness, does Jess ever talk a lot for every syllable I struggle to form. The sheer thought of all the rough sifting through her responses that my questions would compel is enough to wear me out. So, I say no more.\n“Have you thought about a crew placement yet?” she asks instead.\nI turn to the round of porthole glass, with its shielded view of a pinprick of near brightness against a field of colder stars. What do you say, my love, my light? I ask you through the desolation of the cosmos. Should I try to make of your death place a home?\nYou do not answer.\nBut, of course you do not.\nYou’re not out there, after all. You’re in the trees. The dreaming.\nWhere I now ache to be.\n“Hey, that’s okay,” says Jess, eventually. “No one’s going to force you. Only, it might do you a bit of good to meet the others. There are other solos on board, you know. One Lucasian, but don’t let her catch you in a corner. Seli’s working the bio-dome, though—so no corners, right? Ha ha. That’s . . . that’s Earth humor, sorry. I’ve been told it’s bad. And one Retet—doesn’t speak much, misses its people a lot, but I hear it’s nice to be around. Down in storage, where the work’s a bit technical. Not much open space, either, but that’s how a tunnel-dwelling species likes it. Oh, and then there’s the Gremshu, stars alive! The Gremshu! They’re a herd-entity, see, so when they speak it’s always a bit insular, but once you catch the drift of their metaphors, it’s something else entirely. They run volunteer detail in the canteen ring. Yeah, I know, we’ve got servitors that could do the cafeteria work just as well—oh! and even one of those freaky biocomps the Makers left around this sun. That’s a sight for sure. But no . . . it wouldn’t do, because for plenty of species a meal is more than food. It’s also, like, daily social contract building? So we let all our citizens here make a ritual out of it. It’s like—”\nI crouch, then curl up anew, closing one set of eyelids, then the other. Jess doesn’t seem to mind my disengagement. Jess keeps talking. At this point, my dearest, I’m not yet certain if this is something all her species do, because I’ve yet to meet her lifemate or talk to anyone else on CEB-21 at sufficient length. Already, though, I must confess, I’m not entirely opposed to the sound of her chatter, so long as I don’t have to contribute. Listening’s not the same as having purpose—not like when I first chose to follow you out into this terrain. Nor like the calm that used to come from the cadence of your throaty speech, or the heady purr of your belly beneath my whiskers, on the grassy knolls of our long-lost life together on Uma’u.\nNo, the experience of Jess on CEB-21 is not any of that. It is not you. But her chatter is still a better focal point than all the images that return to me whenever I idle too long in the waking. What images, you ask? Oh . . . strange ones, my deadmate. After all, I didn’t actually see your body tumble out of that exploded docking tube, so my mind has constructed entirely different ideas of what went on. It has fashioned a version of events where you are always staring at me in your death throes, no matter how much your lithe, blue-gray body might have contorted in reality under vacuum pressures. No matter how quickly, either, my head in real life struck something solid and knocked me out. No, my oneness, my only . . . in my waking brain’s version of events, the two of us are simply locked together, Uma’u gaze to gaze, all the while that this unnamable alien violence steals you away. And even when your body slips fully from my purview, even when I am left only to imagine your freezing limbs shattering beyond that wretched tube, still those bright eyes of yours, my queen, my queendom—eyes the color of harvest grass interwoven with threads of red—watch me from the abyss. Accusingly? No, never: my jewel, my triumph. But, as a reminder? . . . Yes.\nMy love, my deadmate, my five-footed mess of a stumbling fool the first time I ever saw you dancing at court . . . those eyes keep whispering on your behalf: Ima’i.\nNow-here-now.\nA promise, as you know, as much as a description of time and place. A way of saying—go now, child of Uma’u; carry your grief for me into this den of strangers who stood by and let me die, and I promise to pad by your side through everything, then meet you for eternity in the Otherrealm, when your time in these lands is through. But remember as you do, my guardian, my shield, my shelter . . . that until I’ve been avenged for so wrong an end as this, wherever you go, whatever you do, whenever you are in the waking, this is where I will always be.\nSuch a difference in intensity, no? Between the waking and the dreaming? And who among us could ever think to outrun such intensity for long?\nSure enough, then, in time even Jess’ voice can’t drown out that abiding surge of self-recrimination, that wrenching call for me to act, act out, act out against them all already damn it, even though I cannot envision more right now than the final slashing blow, or how I will bite all the napes of the murderers’ wretched necks or their alien equivalents. And so, after twitching at the sudden press of my facilitator’s hand against my fur (though why Jess thinks herself permitted to touch my fur without asking, I hardly know how to answer), I shudder into the only true escape I have from this reminder of my many failings . . . failings to you, my perfection; and to the rest of our delegation; and most of all, to myself.\nI fall back, that is, into the only slumber known to me where your mighty spirit is of a younger, kinder, and more forgiving nature; and where, for all my inadequate size and lack of dominance in the waking realm, you might still deign descend again from those distant, ethereal yoru’nan trees . . . expecting nothing further from me than that I idle with you on a glossy blue-black bough as often as possible, before I too dwell forever in our Otherrealm.\n3. /e.we.ren/\nthe loneliness of nervous silence, when asked to speak one’s truth\nBut oh, my queen, it’s true: Jess’ larger point cannot be escaped forever. I am but one tom, easily the smallest of any organic sentience here, and perhaps due to my oneness and my size, I am treated more like an orphaned youngling than the brutish less-breed that I appeared to be to any who glanced my way back home. And how convenient are the Partnership’s claims of care, no? For, with them, the Partnership has as good as revoked my authority to speak for all of Uma’u until they report on this incident to our High Court and receive its reply, which gives them seven lunars’ grace to smooth out local consequences of the event.\nClever, clever.\nOh, and yes, of course, I’m watching them all carefully, Wene’ss: all these Partnership operatives who still insist that my only job is to recover. I listen to reports from their Supreme Council and wander the corridors observing technicians at their work. So many different species: the lizards and the mammals, the sponges and the spindles, and even the lurking shadow of a giant spider, with a scent that makes me hunger for some of our littler delicacies back home. Out the way station’s portholes, too, I track the progress of a massive planet stalking the anchor star: the same planet of miracles the crew often talks of in hushed, excited tones. With image enhancements, I can also see around the anchor star itself the band of mysterious tech, not unlike a yoru’nan bough in its coloration and its sheen, that has drawn so many to this precarious nexus of . . . not Partnership territory, exactly, but Partnership control. A nexus that also just happens to be a quarter-lightyear from our home. Strange, no? That there should have been so formidable a power so near to us, that never thought to visit our long-clawed ancestors? Not even once?\nUnless these ancient Makers did, perhaps? Slipped into the stories told by queens and toms of old, and all their kindred dreamscapes, and seeded it with secrets yet unknown? Do you think that if we were to dream hard enough today, we might even find them, lurking in the one sacred place where the Partnership seems incapable of looking? Are they perhaps wandering in our Otherrealm, in communion-song with all generations of Uma’u come before?\nOh, my brilliance, my Wene’ss . . . but now I picture you smiling at such silliness and catching mine ear tenderly in your sharpened maw. You’re right, of course: how foolish of me. This is merely the consequence of trying to answer too much about this strange new culture all by myself. If I want answers to my questions while I wait here, at least five more lunars until my fate as our lone surviving diplomat is made known, I must mingle with the locals. Learn how toms and queens speak here . . . even without necessarily using the right words.\nI accept, then, an invitation from Jess to dinner in her quarters, where she lives with another Human: Lieutenant Commander Capacia, known as Kap. I wait in the corridor until she answers the pad-press I have to strain to reach, then hesitate as a striking smell assails me once the door slides open. Another animal’s heat signature. The distinct olfactory notes of fur.\n“Ah-wei, you made it!”\nA curious phrase, my love—for what accomplishment exists in showing up to sup?\n“Come in, come in.” She beckons me into the living space, but as I enter I hear a low growl and startle at the sight of a fluffy mane on a smaller creature atop a carpeted assembly of poles and platforms. The creature looks vaguely Uma’u, but . . . hobbled, somehow. Something in its body structure restricting it to quadrupedal motions; like one of our distant ancestors, if it had also lost its proud, strong jawline and adorned itself in excess tufting and bejeweled accessories. And if it hadn’t been particularly bright.\n“Oh, that’s Moscow. He’s harmless. All glare and no bite, aren’t you, boy?”\nMoscow’s growl deepens, and he shifts his paws uncertainly beneath the crest of his chest. Does he even know how to strategize a fight, or do his stunted primal instincts only give him to imagine the initial, thrilling pounce? I turn to see Kap entering, a plate in either hand, which she affixes to table clips for added stability. An unusual precaution, since CEB-21 does not often lose gravity, and most do not bother with such measures.\n“Oh! Hello! Stars, I didn’t realize you’d arrived yet, and so I—” Kap turned to Jess. “Is it okay to talk at this speed? Am I talking okay? Should I use simpler words?”\n“Is good, fine,” I say, in a deeper register than my usual. I know, my love: patience, patience . . . but whenever someone turns to an intermediary to speak to me through them instead, I just . . . my retracted claws, my dearest . . . they itch . . .\nIn any case, Kap startles again before my annoyance can register more visibly in my fur. Color rises in her facial nakedness.\n“Yes, of course! Good. Well! Welcome, Ah-wei-nah-toh, please, sit, sit—”\nShe is making an effort to say my name in full, even if she over-enunciates every syllable to the point of absurdity. I try to focus on that goodwill gesture, although the sheer nervousness radiating from them both is aggravating. What am I, a star about to go nova?\nI perch on a booster Jess has added to my chair to reach the table and attempt to set them at ease with positive physical gestures, reassuring and elaborate sounds of appreciation for the food. I am, I know, little more than a caricature, like in one of Eo’rilen’s operatic solos. You remember when he auditioned for you, don’t you? That time he nearly fell off the courtyard wall, performing the part with the drunken broken heart? This memory helps me to smile more as the Humans smile, their wide lips closed and upturned without snarling; and that smile seems to do the trick. Soon enough, the pair relaxes into chatter about the meal, and the provenance of our beverages; and then they allow the beverage’s alcoholic properties to affect their biochemistry.\nI do as well. Why not? Partner seems to flow more easily from me when I consume it.\nOnly—at one point their alcohol makes me impulsive, too, and I wonder aloud then at the pair of them: a partnering with no toms that I can see or have heard tell of. How does that work when you go into heat, I ask. Who protects whom from the trespasses of all the others that must be called upon to sate a rose-queen in her moment’s relentless need? Kap bursts into laughter, while Jess explains that heat is different for Human queens, rose and otherwise. Not nearly as unrelenting, she continues: just enough for one alone to quench it, at any given time.\n“Well . . . unless we want it to be more,” Kap adds, while making eyes at Jess that help me understand how deep and true their pairing is, for all its differences from an Uma’u’s own. “Why, what’s it like for the Uma’u? I know I’ve given Jess so many questions to pass on. I’ve been just awful, haven’t I? But honestly, it’s just not fair, you know? The whole blazing mess of it. All that’s been lost between us already, and, and for what? You know?”\n“Easy, girl. Easy,” says Jess. She pats Kap’s knee before rising to call Moscow to his own dinner, in a little tray, while Kap refills her glass and hesitates. The curl of another question rises on her lips before she drinks it away.\nHer first question, though, has me realizing the impertinence of my own. What was I thinking, dearest—to ask these two of such private and intimate affairs! High Court-help-me, what on Uma’u came over me? And so I struggle to suppress the indignation sparked by her request to learn of something so private and sacred for us, my queen: Something as powerfully binding as my role as your guardian, your oneness and your only, in keeping such careful, protective watch while so many wildling toms answer the desperation of your call in the mating grove, and on occasion seek to press their advantage too much against your urgency. How I would clean you of their scents thereafter, and tend to all the wounds they left upon you, while you lay in all your perfect, secret panting, spent in a manner known to mine own eyes alone, and watched me with one brightly welling eye. Your purr still so faint and fragile in the nethers of your chest, my queen, my hope, my oneness . . . My lifemate, my loss.\nYes, I suppose we would have had to share this concept with the Partnership eventually. What else is a diplomatic mission for, if not for an exchange of contexts through which to better understand another’s whole? But . . . alone? Alone I am supposed to tell these Humans about this sacred thing, just me against their twoness—and no, not only their twoness, but rather, their twoness on one side, while from another I still smell the smallness of that creature they keep, that Terran animal like some rough mockery of our ancestors, which after supping is now settling into a dreaming all its own?\nNo, my queen, oh no . . . Together I might have managed it, but as I am alone, these memories of ours, I claim as mine alone as well. How can I give away even more of you to these strangers than I’ve already been compelled to by their carelessness with security? Where is justice here for you? For all the rest?\nThankfully, some wilting in my ears seems to catch my facilitator’s attention when she returns. Jess changes the subject—brightly, hastily—while sitting down and raising a glass, to join Kap with a salutatory gesture.\n“Did we toast? I don’t think we toasted. Oh, and listen to this—this might be a new one for you, Ah-wei. This is,‘to the same example!’ Do you know it?”\nI shake my head but recognize the general concept. It is as we do, my love, in deference to the Highest Court before we feast. “We say . . . mer’i’ma’ss.”\nKap shapes her mouth to mimic the sounds, again over-enunciating.\n“merEE mahESS. Love it! What does that mean?”\nI consider. “It is . . . many ideas made small. ‘Now health living long,’ I am thinking? But all short. No sense in parts. One word. One big thinking. You dreaming me?”\nAnd yes, yes, Wene’ss: maybe the alcohol is not enough to make me fluent: just confident enough to keep going through my worst mistakes. I can hear, at least, that my last expression is far too Uma’u for the room, and amend it: “Do you understand me?”\nJess nods, graciously bypassing the rest of my linguistic mess, and leans in. “That’s just like ours—‘To the same example!’ It makes no sense out of context. It’s a small part of a bigger whole. But we all know the context here. It’s in our book. It’s from our Journey.”\n“Journey?”\n“The Sunmaster’s Journey,” says Kap. “Oh! Have they given you a copy yet?”\nI remember Urrum Urree’s gift, but still haven’t turned on the scop since being released from medbay—no, not even to peruse the names of your assassins, for there’s been enough chatter in all the station’s common areas to make direct inquiry an exercise in redundancy. More to the point, even two lunars on, I still shrink from the touch of that thing . . . because everything associated with medbay—my unrighteous survival there, the wretched aching of your absence—only intensifies the pressure of your unwavering eyes in the silence of my waking realm. When I pick up the scop, I feel them calling to me . . .\nAct, act now, avenge me, avenge us, where is your great brutality now, child of Uma’u?\nIt’s in my quarters somewhere, I’m sure, but . . . radioactive to my shaking touch. So—\n“Yes,” I say, to avoid further questions.\n“Well, no matter if you haven’t read it yet,” Jess replies. “But the full phrase is ‘We are all the same example.’ It’s one of those things the Partnership tries to live by. How all life in the cosmos is equal. How all of us, deep down, are the same. You know?”\nI understand the principle, but something quiets deep within me to hear Jess tell me that the Partnership believes itself to live by those terms. Can it really, when . . . ?\nBut before either fur or expression can betray my skepticism, Kap raps the table with her knuckles, excited. “See, this? This is what I was hoping for. Oh, there was so much I wanted to learn from your people, Ah-wei! We’d just had one of our AI go through your histories, your mythologies, your languages . . . especially the biggest one, the royal tongue. The one your people call a passkey to the Highest Court? Stars! What a language! Our compiler says it even has a whole bunch of specific words for concepts we barely understand in Partner. Like, you’ve got seventeen words for madness, I think it was? Nine for loneliness? So—I’m sorry if I came off too strong earlier. Really, I am. It’s just that, before I was in this uniform, I studied the xenopsychology of colony management. I did a whole thesis on representations of isolation on Partnership frontier worlds. So, it’s important, you see. This whole opportunity with you, your people . . . it was all very precious to me.”\nAnother wash of Partner-ese. Do they really not realize how like a crash of nonsense all these sentences can sound to non-native ears? Something beneath my ribs tightens at those last two sentences in particular, though. The sheer audacity of the pair.\n“My crewmates—same—to me,” I reply, just barely keeping an exasperated hiss out of my speech. Even Moscow’s ears prick to hear it in his dreaming, curled up and purring atop a plush and richly colored bed. On some level I suspect that Kap has heard it, too. Yes, yes, I know . . . So hostile for a diplomat. But I am tired, Wene’ss. It can’t be helped.\nKap freezes while Jess stands as if just remembering the after-meal. “Dessert?”\n“Of course,” says Kap. It takes a second to realize she is speaking to me, not her partner. “Of course they were precious to you,” she clarifies, leaning in. “And—stars, this is all just unfathomable, isn’t it? But if you need anything from us, anything at all . . . ”\nShe extends a hand over the table. An attempt at restoration. But I have consumed too many of their alcoholic beverages for niceties. I bare teeth instead.\n“Why no justice for Wene’ss? Why the lives most killerly let free? Why there is always being—excuses? ‘Same example?’ No! Made example. But not knowing why, and I must!”\nJess returns, holding a bowl of what I know are meat-fruits: genetically constructed hybrids with the texture of a sturdier protein, but still retaining the refreshing snap of plants. These, and some palate-cleansing greens, she sets on the table without clipping them in, while her lifemate routinely re-clips her own utensils, her plate. Looking curiously at me, then sharpishly at Kap, and then exuding a general sadness, Jess exhales and sits down.\n“Look . . . the Partnership’s got a problem,” she says, every syllable belabored while pushing the bowl my way. “We’re dealing with radicals, okay? Same as you find anywhere in the universe. You have radicals among your people too, maybe? Those who disagree with the courts on Uma’u?”\nI struggle for the word in Partner. She is correct, but in royal tongue it is so much easier: the neren’, the word’s severance after the core noun phrase so intrinsically harsh to an Uma’u ear. A refusal of synchronicity. A denial of restorative balance in language as in life. Even neren’ata has a kindness to it, doesn’t it, my love? The castaway, the forlorn, the tom that has made of himself a tool of oppression, later to be discarded. The tomwho earns such a term is still redeemable, though, isn’t he? Even if the role he performs as neren’ is not. Even if the dreaming he must endure to serve as neren’ is not fit for any youngling’s ears and tongue.\nOh, but we would have worried such nuances as this to bits, wouldn’t we, my dearest? If you were still at my side, boostered into another giant chair across from these lumbering simians, while their primitive feline snuffles with its soft belly bared in the dreaming. We could have told them, too, about how, when you and I first bonded, you had grown inordinately excited by our names: A-we-n[e]-at[a], a variant of the more regal “Awe’ne’ata,” made coarser by my breeding . . . and We-ne’-ss, three more perfect syllables than I had ever known before I knew of you. We could have explained to them, this fellow coupling so contentedly with itself, how you had delighted to notice the rarity that our names shared: that conjunction of opposing concepts as the core noun phrase.\nWe-, the quality of loneliness.\nNe-, the quality of connection.\nBoth bound together in each of us, separately—then bound together in us, together.\nIt is fate, you’d declared in that distant, pristine moment of late-youngling memory, before sealing the heat of our bond with that first, delirious press of your paw against the hardness of my left shoulder, and finding a secret shudder in me there.\nIne’ata, I had agreed, fighting back an Uma’u’s smile. Fate indeed.\nBut now, without you . . . without the strength of your tongue in either language . . . what Partnership term shall I use to capture the elegant balance of our linguistics in its purest form—to say nothing of the depravity we feel most whiskerly when the balance is not there?\n“You mean . . . toms that no follow their ancestoring?” I attempt. It seems to suffice.\n“Yes, exactly. Blasphemers.” Jess nods, and I echo this last word, blasphemers, under my breath to remember it. (Their –ers are like our –atas, I am learning. But I’m sure, my dearest, that you already knew that.)\n“Well, we have those, too,” she continues. “And the problem with radicals is that they’re always hungry for more attention, more fear. So, the Partnership decided that the greatest punishment for what they’d done would be . . . not to give them what they wanted. What they really wanted. Not to make a spectacle of their expulsion or tribunals. Oh, but they’ll be tried, of course, on another world. The Partnership received a guarantee from the Alliance of Friendship during recent negotiations.”\nKap and Jess look at me intently then. So eager, so nervous for approval. They want me to accept what they are telling me—or, no, one better: they need me to accept it.\nWhy need, though? Whatever can I, a solo tom in this realm of giants, ever hope to do that scares them so? What danger lies in the threat of my dissatisfaction with their justice?\nI cannot put my paw on it exactly, Wene’ss, but there is something about the power these two Humans see in me, or impose on me . . . that feels like no power, really, here at all.\n4. /o.we.ren/\nthe loneliness of speaking one’s truth and not at all being heard\nMore lessons follow in living Partner, learning Partner, being Partner. I watch the crew and visiting citizens, and I listen, and I placate at every turn the staff’s insistence that I rest, and heal, and find my way into minor work cultures however I see best. Well, “however I see best,” that is, except through all the truly better ways. Without getting an audience, say, with the Supreme Council. Without having returned to me my full status as an Uma’u diplomat to CEB-21’s Partnership representatives. Even my inquiries about proper memorial services for the five of you are met with baffling delays, though I am assured that, once word from homeworld has arrived, a proper honoring of your lives and passings will at last take place. (I suspect, my love, that the Partnership is simply stalling to avoid the possibility of a repeat incident. But perhaps I am being too generous with them all.)\nWhat remains, then, for a tom like me to do in a world of towering aliens? Only the sorts of roles that Jess suggests. Small contributions to the way station’s daily scut work.\nWell, so be it. It’s a start.\nAnd I began—as you know, my dearest—at a rank far lower than even this. A rank so low that I dared not laugh aloud even when I saw you make such a happy, clumsy fool of yourself at that first dance: your first entrance, on the cusp of queening, into the mainlanders’ shared court. (Oh, but you saw the laughter in my eyes then, didn’t you, from my meager serving post? And you knew it was not mockery I stored up there; it was a happy laughing, deep within, that longed to be as public then as yours.)\nIt is with far less cheer that I accept volunteer placement in the canteen ring, maybe half a lunar after my dinner with Jess and Kap . . . but the memory of foolish early days between us strengthens me all the same. The eating area on CEB-21 is called by most locals “The Trough,” and I am hoping a massive crowd will be the perfect place in which to lose myself, to become anonymous enough to observe without being watched in turn.\nOh, but Wene’ss! Now who’s the clumsy fool? Because, by my second hour on duty in The Trough, I realize I have made a terrible mistake. I should’ve chosen something remote, like the storage bay. But no: With all the interspecies murmuring, sparking, and beeping in CEB-21’s canteen ring, I had been so certain I could get by with minimal chatter of my own. How could I have ever believed, though, that a simple jut of lips, tentacles, or hooves in the direction of a food tray or gas bubble would ever have served here as sufficient talk?\nIn practice, I discover that social contract-building matters more to locals than mealtime efficiencies, and so, for all the pell-mell chaos of alien smells and sounds, locals still find excuses to bark and bay in Nonstandard-Variant, then await my response with curious and impatient stares. Sometimes they ask after the ingredients for a particular menu item. Other times, make note of my novelty—half or a third their size, after all. Some even extend genuine alarm about my regrown fur being so close to their lunch trays, which I suppose is fair enough, for the hairless cultures here.\nAll in all, though, it amounts to such a bewildering array of conversation topics and tonal variations. It exhausts me, dear one—leaves me feeling dizzyingly alone in a sea of noise worse than any individual’s hasty speech in closer quarters. But then, I am also not alone. Not once, not for a single syllable in the canteen ring’s cacophony. Rather, each perception-bulb among the would-be eaters creases with its own show of surprise, then amusement, upon hearing me struggle in Standard-Variant, with all my Uma’u direct translations slipping through. Each amused alien then asks me where I’m really from, and if I’m “The One Who Survived,” and finally, if I know just why it all went down.\n“I heard maybe there was something explosive on your ship?”\n“They’re crazy, those Alliance creeps. You know that, right? Not the sort that your people should’ve messed with. Should’ve kept your distance from the start.”\n“Is there, like, a side-war, maybe, between the two of you? Something you kept secret from the Partnership when it first invited you to apply? Because sorry, friend-o, but that should really negate the application process entirely . . . ”\nAnd yes, Wene’ss, of course I find it difficult to remain calm in the wake of such inanities, especially when these assertions keep showing up one right after another after another, as one alien listens in on my conversation with another, then tries to leap off that other alien’s absurd claim, or point. Meanwhile . . .\nNo, I want to retort at all the simpler queries: No, you got me! I’m not the sole survivor; I’m some other Uma’u, who conveniently arrived after the incident but before my homeworld’s even heard about how its first delegation was murdered under the claws of your security. How did you know?\nThen, at the far more invasive questions, I also want to arch my back, hiss, and retreat under the temporary shelter of a menacing growl. But, no, my dearest: Of course I don’t. I know that doing so would only give them more fodder, bolstering all their terrible intimations of less-than-perfect-innocence on our delegation’s part. So, I simply try not to blame them for their fear and ignorance, my queen. I try.\nAnd still, I fail. Yes, I realize that they are only trying to shift blame onto me because it’s a natural defense for anyone who regards CEB-21 idealistically, as a place of stately calm meant for the purest scientific research; and which also happens to serve as a vital way station between stars. But also, why must I always be the more charitable and understanding tom in the face of all their carelessness, cruelty, and cowardice? Why shouldn’t I get to be openly, recklessly angry at the laziness of their assumptions, the smallness of their views?\n“I mean, it’s just . . . ” some even tell me. “No offense, but they must’ve picked you for a reason, right? So how can we be sure that you’re not dangerous, too?”\nOh, but they have picked the wrong Uma’u, my dearest, if they thought that such a statement could ever chasten me. There was enough prejudicial nonsense for me back home, you know—as a tom whose stripes marked me for mere brute work, and no more. How our court had blinked so slowly at my request to take the higher exams! How even you, my love, at the beginning . . . how even you saw me more as muscle than as mind. And liked it.\nAh ah ah! Now, dearest, don’t you try to deny it. Later, you even confessed to me—far later, mind, with a playful, grooming lick to ease the sting of it—that this prejudice had also been part of the appeal: the sense of danger to me, in your ignorant upper-court eyes.\nMeanwhile . . . Dangerous? Me? As if, my love.\nEverything else was dangerous to you, though, for a spell, wasn’t it? The way you’d slip off courtyard siding, or miss a landing whenever you leaped in those early years. How you’d tumble in the most ungainly way to the dirt or grasslands; then recover—quickly—and saunter off with pure composure and intent . . . your tail always so elegantly erect, as if no error had been made by you at all. A queen even in your years of jesterdom: that was always you.\nBut my dearest, my only . . . you do realize, don’t you, that I was never more of a threat than, say, a distant yoru’nan tree branch that you would gauge wrong and hit so hard that your claws nearly shattered while digging in to cling all the better on? As for me . . . I never so much as bit your neck to hold you down while mating. Didn’t you notice that? Didn’t you slacken and still for me all the more under the trusting shelter of my large-yet-bridled maw? And hadn’t I also played my role as protector with such discretion and even greater loyalty? Hadn’t I keened and howled and dragged myself through the grasses with you in the aftermath, too, when our first litter was lost, all lost, the year the sickness came to court? Did I not groom you for hours—gently, slowly—through the ensuing silence of our shared grief?\nSo, if the luggage had been a sore point between us just before your passing, my love . . . if my last words to you as you stepped into that doomed connecting tube had been so very, very wrong . . . Hear me, Wene’ss: it is only because of that first impression I sometimes still fear you have of me. That image of this . . . this brute, this know-nothing low-court tom: barely domesticated into civil service, and hardly able to patch a sentence together in a second tongue, even when first contact with the Partnership drove you to submit our names for diplomatic application. I was just this hulking menace who happened to be on your side, and yet, in that most critical moment in his service to you . . . when you most needed a brute indeed . . . I’d been given no chance, not one, of saving you from the abysmal dark.\n“Hulking,” though. Well, there’s another joke to dwell upon, no? For whatever I may have been among Uma’u, whatever private suspicions you might’ve nursed of me as well . . . whenever I hear someone insinuate similar about me in The Trough—that I might be dangerous, or violent—I just want to yowl at the absurdity of being seen a threat to anyone here at all. How could I be? How is it even possible, when everyone, everyone except the younglings on CEB-21, are twice or thrice my size?\nI don’t yowl in outrage, though: certainly not in the packed canteen ring. During my volunteer shift, for all the awful things they say and assume of me, I never give in to any of these giant aliens’ baiting and bewilderingly accented remarks. I simply wait, and serve, and after the lunch rush eases, take a much-needed moment in a recessed corner. I’m stress grooming, of course—I can taste the associated stink in my fur, when gathering more of it in my mouth than expected with each sweep—but the jumpsuits here make it difficult to reach my most pungent crevices. And when I sense too many sidelong glances from the rest of the staff, I look for stress relief work-arounds with the furniture instead.\n“Plains of dry grass near aflame?” says the Gremshu heading up detail—or rather, so says one of the hair-coils along a top-heavy shag of a body that all but obscures two bright black eyes, flaring brown nostrils, wide, curving horns, and—far below them—four bi-toed hooves.\n“Peel of bark twisting on its trunk?” says another.\n“Kick of dust on skin?” says a third.\n“E—excuse me?” My ears flatten in confusion, shame, or both.\n“Itchy,” explains a nearby log: one of Urrum Urree’s species, freshly retreated from the condiments to clean a yellow squirt from a patch of moss. “They’re asking if you’re itchy.”\n“Ah. Well. Sort of,” I say. “I’m sorrying, I—”\n“Over there, that post might help.” The log points with a heavy branch to an ornamental pillar with knobs at the perfect height and size to catch between my shoulder blades. “It does for the Gremshu, at least. Doesn’t shut the herd up, but at least they sigh in symphony for a while.”\n“Ah—thanks.” I say to the log, before repeating this sentiment to the Gremshu.\n“Clear streams,” one Gremshu-coil replies.\n“Sweet plains-grass breeze,” adds another.\n“No problem,” the log translates.\n“Thanks, I—I think I am getting that last one from context.” I quirk what I hope is a smile to accommodate the awkwardness of my grammar, but the log simply exhales a more muted odor. Disappointment-turned-resentment is a familiar, if unsettling response from some locals, who prefer when I act perfectly helpless before them, like a lost youngling. How quickly, too, such locals try to catch me out for having less than perfect comprehension or elocution, yet still declining their “aid,” which always amounts to an incessantly patronizing form of correction. They act sometimes . . . oh, love . . . almost as if I’m being arrogant in refusing their supposed generosity. Like I need to be reminded of how little I truly know, and how small I really am, and how grateful I should be that anyone is willing to educate me at all.\nOh, but I know to tread carefully with such types, my queen. To placate their wounded egos all the better to survive. And so I crinkle my nose, breathing slowly, and take out the scop I have started practicing carrying with me, in a prominent jumpsuit pocket, to give others the impression that I am fitting in. It still feels almost radioactive to the touch, and I have yet to bother to turn it on, but maybe this Partnership tech could help bridge the hostile gap I sense forming between me and this log? Maybe it could help this new log feel superior in its usefulness to me, after all?\nWorth a try at least, so—\n“Other contexts,” I say, holding up the device. “Still very—harder, though. You know the order, maybe, that this is to be—reading?”\nThe log leans forward, but its odor sours after it inspects the label on my device’s screen once I switch on the scop. Then the log pounds one of its branches on the nearest counter: an action that begins to make all my hairs stand on edge. “Are you kidding me with that fungal rot?” it barks at me. “Get that putrefaction out of my airways.”\nI quickly comply, switching off and pocketing the scop again.\n“I am sorrying,” I say. “I am only thinking it to be the tale told by your people? Urrum Urree, the . . . the spiritual advisor here, he is saying that—”\nBut the log interrupts with a hot burst of sound that I take for an irritated laugh.\n“Ho ho! Urrum Urree, a spiritual advisor? No, no, no—that bit of mulch-for-brains does not speak for all Fens, little twig. And if that . . . that piece of fire-starter wants to take on an enslavers’ text like The Sunmaster’s Journey, fine, let it have it—but oh, what arrogance to pretend this text is all of ours. Ours! Hah! If you want a tale told by our people—not imposed on them—read The Starchild’s Voyage. That’s ours.”\n“I am sorrying,” I say again, quieter and with mounting confusion. “I am not knowing that one. Is that also—part of Partnership? Or—”\n“No, but funny, you asking that. It’s from the Alliance of Friendship,” replies the log. “We are . . . the true Fen, at least . . . some of its founding members.”\nAs with Urrum Urree, I can make out no face upon this particular Fen, and yet I can feel it watching me. Yet, why shouldn’t it be watching me, studying my every minute reaction? I am as rigid as a yoru’nan bough myself, to hear what it has just told me.\n“Turns the wind sharply,” says a Gremshu-coil.\n“Bitter runs the stream,” adds another.\n“Bone-taste in the ashen earth,” agrees a third.\nWarnings, I gather: all sorts of natural warnings, given by the herd-entity to the log. But warnings against what? What terrain has now been entered by us? What power do they sense in me, that I can hardly understand myself?\nThe Fen, though . . . The Fen seems to understand far more.\n“Yes, yes.” It swats vaguely at the Gremshu. “I know his kind’s met with a bad end thanks to rogue agents. But, you see me here? You see me working the same detail with you? That’s because plenty of good still runs between our compacts, the Partnership and the Alliance of Friendship, which none of us wants to see wasted on another war. Besides, it’s not your fault that the Partnership built its empire on the wrong version of the greatest cosmic story ever told. Just as it’s not our fault that some of us have gone . . . okay, fine, maybe more to seed than others, while trying to protect the sanctity of the Voyage’s lessons. But how could they not, when everything else in the galaxy seems such a mess?”\nI feel the surface of my skin drop a degree or three.\n“So, the Fens are . . . ?”\n“A multi-compact species, yes. Some of our colonies liberated themselves into the construction of the Alliance of Friendship. This, of course, was after our homeworld was first tricked by the Partnership. Lots of animosity behind that division, mind you, because lots of homeworld Fen established themselves within the Partnership, then turned against we outworlders . . . we, that is, who have nothing but pity for homeworld’s failure to see through Partnership lies, plus sorrow for their failure to follow us into a far better deal.”\nA Gremshu-coil snorts. “Salt lick on the seventh day.”\nThe log makes an appreciative sound at this, and odors of amusement reach the tip of my tongue. “Old story,” this Fen explains to me. “The herd’s trying to say that every species from a multi-planet system has the same issues once it starts hopping from rock to rock. Different colonies, different loyalties, you know? But, no . . . no, you Uma’u wouldn’t know much about that, eh? Your world’s the only planet in orbit around your sun, which must’ve put a serious stone or two in the way of the first roots you flung offworld. Kind of amazing you kept on at all, really. And then, after what happened to your people when you first got here? Stars, but that’s a strange business, don’t you think? Almost too strange, hm?”\nI taste a blend of curiosity and animosity wafting toward me, but most of the log’s speech doesn’t make a lick of sense in all its contradictions. I mean, sure, I understand “old story” on a literal level, Wene’ss . . . but I’m also too busy grappling with its two possible meanings—a story that is ancient, or a story that has been repeated to the point of tedium—to pay full enough attention to the rest of the log’s pointed commentary. And something about its last words leave me reluctant to ask the log to repeat itself. So, I don’t.\nNot that I’m given much of a chance to, though, either, because in the midst of all this exhaustion and elevated tension, my heart already thudding in my chest at this introduction to the first Alliance member I have known close-up . . . a loud clatter at a nearby food stall startles me: the shape of the sound too abrupt, too deafening, not to awaken some more primal instinct. It’s only a moment’s disorientation, honest, for a little tom in a great big alien world. Only a flicker of a memory of the last similar dramatic upset to accompany a startling sound . . .\nNevertheless, it’s enough to have me leaping wildly, claws bared, fur raised, as if from one yoru’nan bough to another of those near stonelike perches in the forests of Uma’u . . . and then leave me struggling to process the existence of a terrible sound, an immense yawning pain that seems to travel the whole canteen ring before I realize just where it’s coming from.\nOh, no. Not from me.\nFrom the log.\nFor I realize then, my dear one, that I have flung myself straight into the lignin-scented richness of this other sentient being, my claws sinking deep—painfully deep, I’m afraid—into the moaning log’s mossy bark. Notyoru’nan bark, either. Not that sturdy bark at all.\nI’m sunk so far into the Alliance-Fen’s outer husk before I realize this, though; so frantic with the sudden urgency of wresting my claws loose from this fellow creature who has done me no harm. I never see what is used to knock me out—in both senses of the term.\nI vaguely imagine it to be a branch, but no, I later learn: a hoof.\n5. /we.ne.a.ta/\nthe loneliness that begets another’s loneliness in turn\nSmall worlds, these Partnership way stations, with their portholes overlooking miracle planets and tech-shackled stars, and all their ships and species just passing through or else lingering awhile to study this system’s ancient, vanished race. How many stories here, I wonder? How many unexpected connections between citizens, species, and whole compacts?\nWhen Jess first told me about the lone Retet working storage here, for instance, she never mentioned that “storage” was also the part of CEB-21 with holding cells. Or maybe she had, and I’d just fallen to dreaming through that part of her chatter? I wouldn’t be surprised, if the latter: all the most important parts of those waves of tedious Partner speech always seem to pass me by.\nYet local penalties for their oversight never seem to, too.\nI do remember being told, though, that the Retet is an “it”: each giant rodent in its species sharing genetic code with its birth brood, and all Retets are neuter until the time of mating, when each chooses what role to play within proceedings, before reverting to “neuter” afterward. And now I begin to see, Wene’ss, the other side of my feelings about that pitiful feline creature in Jess’ quarters—for what would this Retet think, I wonder, if our diplomatic mission had brought along a native delicacy from a species much like its own, but in mentally deficient miniature? Is there perhaps a species on CEB-21, too, that keeps primitive simians in similar captivity? For amusement? Subordinate companionship? Repast?\nIt begins to dawn on me that each higher-sentient species now seeking communion with the rest on this station, in this compact that extols such grand virtues, represents no less than its own world’s brutal conqueror; and that none of us comes to our present fraternity save through histories of planetary strife still visible in all the species we still keep in private service.\nOf course, such musings truly belong to another timeline, don’t they, dearest? One in which our delegation is unharmed and progressing smoothly through first contact activities; where perhaps I’m striking up conversation at a formal function with someone mutely standing by while his own, dazzling version of a Wene’ss parlays with you over treaty terms and future plans for the Uma’u. Oh, I’m sure we would’ve spoken then of all the histories of injustice our two species had so valiantly surmounted, while also tacitly reminding each other that, should the need arise, our respective peoples nevertheless stand ready to war again.\nThat’s the sort of might we’re used to wielding, at least, isn’t it? But in this universe, for all the supposed civility of this research way station . . . I am but a single, solitary tom in high-tech captivity . . . and just thankful that the Retet seems discreet. It keeps its distance, that is, while attending to nearby maintenance tasks, which allows me to watch it without being too obvious about watching it, from within this semicircular, see-through enclosure, with its arc of a padded bench that terminates on one side in facilities for physical release. Since privacy is not a consideration in this cell’s design, I see no reason to keep up my own pretense either; to linger in the provided jumpsuit so as to “fit in.” Even thusly freed, though, stress grooming is not easy with the headache that lingers from the Gremshu’s knockout blow. I manage a few licks before it’s too much, then turn on the bench, ready to descend into the Otherrealm.\nAt length, though—at respectful length, I might add—the Retet pauses in its labors, glancing my way, and all drowsiness leaves me at the fact of his staring. I am uncertain, after all, just what I expect from this other loner on CEB-21: Pity? Fraternity? Curiosity? Nor do I know what it really sees in me, as I curl up to rest within my cell: An angry alien? A poorly domesticated pet? The first is what Jess says was given to her in the Fen’s report, as an account of my behavior in The Trough, corroborated by “witnesses” whose names do not even matter, for how much they’re all strangers to me here.\nIndeed, if I am disappointed by anything in this supposed case that rose against me in two mere cycles here, it is only that even the Gremshu’s coils seem to be in disagreement over what they witnessed during volunteer detail. There is an argument within the herd, that is, because some coils had a more abiding view of the “attack,” and others only swiveled to observe after the vicious blow had landed. Usually the coils in their species would side with whichever was the most direct witness, but occasionally something in the Gremshu as a collective maintains a broader, more persistent doubt. So it seems has happened here—the inner hunch superseding the verdict of its many “eyes”—though why, I can hardly even speculate. Maybe it was the fact of its own isolation, the way a loner might side against another loner to reinforce its own stability in a larger hierarchy? Or did all the way station and alTspeaK insinuations have something to do with this: all those background suggestions that maybe the Uma’u’s diplomatic mission had first done something to merit so outlandish a terrorist attack?\nBut what do the specifics really matter, eh, my dearest? It’s all fear of the unknown in one form or another. For ours might be a little species among these giants, and I might be a particularly little tom on CEB-21 . . . but still, such rumormongering has given me an aura of some kind . . . something above and beyond scent and posture and word alike . . . that has changed how all Uma’u are seen. Changed our reputation enough, that is, to turn even other lone sentients against me, and leave me licking wounds in the bewildering shelter of a holding cell, while the Supreme Council organizes a mediation to assess the charges set upon me.\nSo after all that, my lovely . . . what am I to expect from this other loner, too?\nBut the Retet surprises me, tense as I am in the slipstream before dreaming. It faces me without approaching, then tilts its head, looking less confrontational as it speaks.\n“Awenato, right?”\nAnd . . .\nOh . . .\nOh, Wene’ss.\nOh, beloved.\nThe sheer sound of one’s name, when articulated correctly after so long!\nI draw myself up, with a cautious stretch of my hind limbs, to a sit.\n“I have—no name—of yours,” I attempt.\n“Zittru. Zittru of the Barrow Rennick. But Zitty’s fine. Plenty find it easier.”\nI squint into the broader shadows of the storage bay. “Zit-tru,” I say, firmly.\nZittru’s cheeks widen—a Retet version, I think, of the Humans’ smile. “Close enough,” it says. “How’s your head?” It gestures at its own, to help confirm comprehension.\n“Better,” I say. “In—physical, at least. But mind—surprised. So much to be learning.”\nThe Retet approaches—one step, two, then pausing. It does not seem afraid of me so much as afraid of giving the impression of aggression: It, having space to run; and me, still trapped. Its apparent consideration relaxes me, and I let my tail hang loose.\n“When I first arrived . . . ” Zittru continues, “I entered into a bad spiritual argument here. But I was okay, because I wasn’t the first Retet everyone else had seen, so when I said something that seemed like a threat to someone else, a third party intervened and explained. All was fixed really quickly, and nobody thought that my mistake reflected on everyone from my far-off home. I mean, it might have, for all I know—because for my people, the Golden Tunnel is everything, you know? But, to other species, it can sound like I was threatening to put them in a tomb. If someone like me meets a species that believes the Divine is in the air, not the ground, well, sometimes things get intense.”\nI do not understand all of Zittru’s words, but the general impression seems promising. An attempt at empathy, a meeting of minds, through similar misunderstandings in the past?\n“What is . . . the Golden Tunnel?” I ask.\nThe Retet’s cheeks puff out further, joined with a soft chitter I feel safe interpreting as amusement. Zittru’s whole posture, at least, conveys no active threat.\n“It’s . . . Hm. How to explain? A special space. A secret land for Retets. A place where we go when we die, and sometimes visit when we’re living, too.”\nMy ears prick up. “An Otherrealm?”\nZittru’s head tips from side to side. “Sure, another realm,” it says, though its emphasis does not seem to reflect my own. “They tell me that the Uma’u don’t have faith in the Divine, though, so maybe it’s not so easy to understand?”\n“No!” I say, moving to the edge of my padded bench before realizing how unclear this exclamation is. My head still throbs, but, oh, Wene’ss, you have no idea how hungry I am for this connection. It is . . . such a simple thing on the surface, this thread of fellow feeling entwining between strangers, but in all my weariness after the event in the canteen ring, how like a beacon this communion feels. The Retet’s words and its behavior, its apparent understanding and its calm, clear speech . . . they’re like a laser pointer directing me to look, look here!\n“I am meaning—yes, it is easy, this understanding,” I explain. “We Uma’u have place too. Place like . . . an away-from-here. Now-away-now. Iren’i. It is with us in the dreaming, and it is waiting-us after death. Already my deadmate is living there, ima’i. Now-here-now.”\nAnd I go on—explaining the yoru’nan trees with their glossy-hard bark shining bluer in the daylight, and the green-gold rivers of late-summer grass that wend and weave all the way out to the horizon. And the Uma’u smells. The thick tastes of Uma’u ancestry in the wind. The Uma’u secrets dwelling, so many of us believe, in far-off mountaintops. My Partner phrasing is still not the strongest, granted, yet the Retet considers my words with steady black eyes upon me, as if taking each one seriously. As if willing to wait forever, for them all.\n“Well,” says Zittru, at last. “That might explain their fear of you, then.”\nI flare my nostrils, softly yowling in incredulity. “Fear of me? What happened to—they speak of this sometimes—the ‘same example’? Why not me as the same example, too?”\nThe corners of the Retet’s mouth twitch. Amusement? Difficult to say, but its body’s posture and odors are still relaxed. That must suffice, for now.\n“Who taught you that? From The Sunmaster’s Journey, right?”\nI tense a little in my cell. “Not—not the . . . Star Baby Voyage, no.”\nZittru throws back its head and chitters merrily. The louder emotions are easier to recognize, and I am beginning to realize that these Retets are not so different, either, from our delicious crunchlings back home.\n“No, not The Starchild’s Voyage,” it continues, “though, yes, the Alliance’s version of the text is similar on this accord. But it’s a funny expression, which is why I’m asking, Mr. Awenato: ‘We are all the same example’? Is that what they taught you here? Just like that?”\nI blink a few times while considering. “More or less.”\nThe Retet exhales and shakes its head. “Context, my little friend. Context matters. It’s from a poem where every creature says that to another before they eat or kill it. It’s a poem about the hypocrisy of our claims to want equality. But some people just take the line on its own because it sounds nice. And yet, as you’ve seen yourself, in practice . . . ?”\nZittru gestures at the broader storage bay. I understand its point from within my cell.\n“Will they be killing me soon?” I say, quietly, after what seems an appropriate pause.\nThe Retet whistles. “No, I think not. That would show incompetence on their part.”\n“What, then?”\n“They’ll use you as an example. A different kind of example, of course. Not like this ‘same example’ that everyone uses out of context. You’ll see soon enough, in mediation.”\nBut the weight of this news, Wene’ss, transfers strangely to all parts of my body. Is it possible for one’s very fur to feel angry? I had never thought so, but in that moment there is fury right to each hair tip, I’m certain of it; and radiating from every tooth- and nail-point, too.\nMake an example of me at their mediation!\nAfter letting your murderers flee?\nOn what possible authority? In what mad flight of arrogance?\nI flare my nostrils and remind myself that this Retet is not responsible for the callous treatment, the utter cruelty on the rest of the Partnership’s part. I remember that, my love: I do. But I also need now to know this truth in full, in all the ways that the Humans and the rest here have been too afraid to do.\n“Why—they hate—Uma’u?” I ask so-far-honest Zittru, before sitting back on my haunches and waiting. If I had asked anyone else, how quickly they would’ve rushed to negation and reassurance, telling me that I must be tired, in need of more recovery. That I can’t be thinking clearly, because of course we’re not hated. Of course our dying was a mistake!\nBut this Retet, I notice right away, is not at all surprised by my question. It studies a spot on the floor and sighs, then nods to the jumpsuit in a heap beside me.\n“You still have your scop, yes? I see the bulge of it there. Can you access anything on it? Look up Partnership texts? Or are they out of your access range?”\nI puzzle over this last. Access range? I suppose that’s a feature I would have better understood if I’d ever made an effort to interact with the thing, to surmount how much my paws tremble just to hold it, and how my claws click nervously over the outerplex and metal of it. My radioactive talisman: which I had hoped would make me look a touch more natural among the station’s complement; which has instead only exacerbated the feel of your eyes upon me in the waking, as if whispering to me as well, you have the means, it’s all right here, all the names and places and star charts . . . all of it! So why not act, act already, avenge me, my guardian, my only!\nHigh Court-help me, Wene’ss, but the mind truly creates some unusual associations in the throes of trauma, doesn’t it? Latching on to just the strangest branches in fierce winds.\n“I am having—Sunmaster Journey on it,” I tell Zittru, though I am not sure how true these words even are: “No more, I am thinking.”\nThe Retet lifts the folds over its eyes. There now. There is surprise.\n“Yes, well, that’ll do. If you feel my rumble, then . . . there’s this argument on alTspeaK forums. It started when the Partnership came to this system and realized that an ancient civilization had been here long before us. That really got under some people’s diggers, because here we have this major story about Sunmastership, see. And what does that mean, exactly? Well, it’s about achieving greatness in the cosmos—as an individual, as a community, as a species, as the idea of sentience itself. It’s the basic blueprint for all our compact’s success to date—or so, at least, the Partnership likes to tell itself.\n“And yet . . . that central story never mentions this other species, these other beings who mastered all of that and more, long before us, and then . . . disappeared. So, some people in the Partnership and the Alliance of Friendship have been looking for hidden signs in these stories. Then we discovered you, the Uma’u, only a quarter-lightyear from Drasti Prime, and well, some of us . . . considering how close your homeworld is, some think there’s something you Uma’u aren’t telling us. That you’re hiding other secrets for this ancient race.”\nZittru speaks so slowly, my love, and uses plain speech as often as it can. Why can the others not be as careful and considerate? I have never before wanted so much to lick—but not eat—a rat as I do now, for I understand almost everything it says the first time through. My questions are myriad, of course, but as I try to order them my ears prick first at the neutrality of the tone it’s using to relay all of this to me.\n“On—alTspeaK—they say these things,” I begin, confident that this generous Retet will allow me the time I need to form my questions better. “But not . . . you? Why you are not thinking the same things? Worrying the same worryings as all the rest?”\nThe Retet puffs its cheeks again and hums. “Because, Mr. Awenato . . . like I said, I am on my way to the Golden Tunnel. I know The Sunmaster’s Journey is only a story for this multiverse. Meanwhile, I know a story of . . . something bigger, far more important to us all.”\nThis Golden Tunnel, of course, sounds like nonsense, but do you remember, my love, how Yukelene carried his own silly notions with us into the stars? All our instrumental data, as we prepared for cryosleep, could not deter him from his conviction that our dreaming forms existed in the Otherrealm even while we were in the waking; and that if we entered cryosleep with the right mentality, already in the dreaming before the freeze kicked in, we could find even greater truths while we lingered with our loved ones there. Yukelene was . . . an excellent computational chemist, of course. But intelligence in one realm is no cure for the power of ego in another; and yet, this foolish conviction was as much a part of him as his tail. Without it, he would have died . . . oh . . . long before that tube exploded. Who would dare take it from him?\nI thank Zittru for its kindness, then, in sharing its knowings with me, despite how impossible and absurd some of them appear.\nMind you, Wene’ss, I want to thank it for so much more—for its patience with my Partner; for the clarity of its own; for its understanding in general of my aloneness here.\nBut now I do not trust my words for another reason.\nI am not certain, you see, if I can utter them without my heart seizing up at so much sudden, unexpected acknowledgement of my fear and smallness here.\nWithout devolving, that is, into an embarrassing round of whimpers . . . maybe mewls . . . for having felt, for the first time in whole lunars, seen.\n6. /ne.we.o/\nthe loneliness that sees the loneliness in another and cannot answer with its own\nNevertheless, I am revived by Zittru’s kindness in the long run, and by the hour of mediation, two day-cycles later, I can at least hold Urrum Urree’s scop without trembling—even if reading from the thing still seems an unbearable concession to the world that took you from me. Urrum Urree seems pleased enough by this progress when it comes to collect me, though, and soon I sit, a small weight on one side of the mediation platform, while the Fen’s representative speaks of our people in a most exaggerated way. I cannot follow all the words, but I understand this representative’s manner well enough.\nKap is the mediator—selected from the senior crew, I am told, by the Partnership’s Supreme Council itself—while Jess sits with evident apprehension among the few not simply watching these events via alTspeaK livestream. There is something called a “j-bot” in one corner, recording and translating everything that proceeds in here for online observers, though I don’t understand why there is so much interest in so middling and minor an event. Have they no better entertainment broadcasts in this compact?\nKap is asking the Fen’s representative, in any case—while I muse on all this and more from my booster seat—why he’s taking such a retributive approach in proceedings that are, at their heart, beholden to Partnership standards for common membership dignity above all else.\n“Is this a joke?” the representative returns, waving an arm at me. The representative’s digits are long, spindly, and sevenfold upon each stump of a hand. Even as he holds that stump steady, his digits seem to quiver in place, as if sensing the surrounding atmosphere. A little like thick whiskers, dearest—if not for the little bioluminescent blue nodes at their ends. You would have had trouble, I suspect, not trying to leap for them and tear those blue nodes off. I’m tempted, honestly, myself. “Does the defendant look like a Partnership member yet?”\nUrrum Urree exhales sharply, rising on its stumps with a branch thrust back in the other representative’s direction. The log would not permit any other to represent me, once it learned who’d filed the claim. “Jafris!” says my log. “This is the sole surviving diplomat—”\n“Oh ho! So, we’re going to plead diplomatic immunity now?”\n“Now, now, Jafris, you know there’s no such thing,” says Kap, not a little wearily from her mediator’s chair. “And none of this ‘defendant’ nonsense, either. Listen—I understand that there’s a way of doing things among the Dutri, but is it really necessary here? All that pomposity? All that combativeness? Does your client really—?”\n“My client only wants what’s best for the whole of the station, and let’s face it, the Uma’u haven’t given us much to work with. We know the texts, we know the stories—”\n“The Starchild’s Voyage is a teaching document,” Urrum Urree protests, rising anew. “Inferior to The Sunmaster’s Journey, perhaps, but even then, neither is meant to be read with that sort of fanatic rigidity. You’re going to argue, what? That a small and isolated alien, traumatized after the violent loss of its own people, left to its own devices on this vast station full of strange sights, sounds, and cultural differences, poses a genuine threat because a sensory trigger spooked him into a defensive response? I assure you, my Esteemed Elloo Ellu, that my client is deeply sorry for the wounds caused by that incident, but this is all a terrible misunderstanding, not this nasty conspiracy that you’re all—”\n“‘Left to its own devices!’ Hah.” The Fen’s representative turns giant, buggy eyes to me and blinks slowly. “Clearly, Urrum Urree, you’ve lost your touch, or else you’d have felt the presence this being carries with it. You think that the Fen walk well with others? You think that you and my client know what it’s like to sit with the whole universe in all its grieving? Well, I’ll tell you plainly—you, our Esteemed Mediator, everyone listening in—that when this Uma’u attacked my client, Elloo Ellu recognized something more to this alien than maybe met everyone else’s eyes. An otherwordly force, in fact—just as the ancient texts predicted! By which I mean, Mediator, that this Uma’u has the means to travel to places you and I could only dream of. And yet he chooses not to share them with us, to let us know the full power in his claws. My client could feel that power, though—because it wasn’t just the claws, and it wasn’t just the fear; and the Gremshu felt it, too, which is why they went against the direct witness of some of its coils. Direct witness, as you know, can sometimes obscure greater truths! And in this case, the Gremshu tells us that there was . . . another scent involved. A dangerous flavor. My client sensed it, too. And so my client is not, I repeat, not on a mission of retribution here today. Mediator, I beg of you, understand us: we come before you today seeking only truth.”\nKap glances my way with a raised eyebrow before studying the injured Fen, Elloo Ellu, which still bears a mud-like substance over its wounds. Then she turns to Jafris, with all the representative’s long, spindly digits twitching. Next, Jess’ lifemate rests her forehead on two clawless fingers, painted at the ends, and nods Elloo Ellu’s way.\n“Well, what are you asking me to do here, exactly? Just how do you propose we arrive at this ‘truth’ your representative suggests you seek?”\nI am not alone, I suspect, in hearing a hush settle over the broader assembly. Jess in particular looks to be holding a concerned breath from her place in the audience, but even Jafris seems surprised to have been indulged. Urrum Urree creaks a sigh beside me, sinking back on its stumps with two knotty protrusions folded over the mediation platform.\n“Confine it,” the opposing Fen exhales triumphantly, with a thump of its branches. “Confine it until it confesses!”\nDid you hear that, my love? It.\nKap reclines in her mediator’s chair. Considering? I’m not greatly concerned by confinement myself, Wene’ss. I will simply return to the dreaming as often as I can. What is this whole way station but a form of confinement for me, anyway? Just waiting, waiting, waiting until the Supreme Council runs out of excuses for not treating me as I am due. For not letting me return to active service, the official diplomat for our people that I should have always been.\n“The entire point of a first contact delegation, you understand,” says the mediator slowly, “is to establish a rapport, a basis of fraternity and free exchange. Instead, our guest here has been placed in a disorienting position since his arrival. He has lost the rest of his team. Stars, I don’t think we’ve even . . . Have we had the memorial yet?”\nMy ears prick at this. I follow Kap’s gaze to another in the audience. A station medic, by the uniform. The figure rises in its formal jumpsuit, clears its throat, and says:\n“Ah, no, Mediator. I’m afraid not. We’re still waiting on—”\n“On the Supreme Council, yes, yes, I figured. They do take their sweet time when it suits them, don’t they?” Kap waves this medic off, then turns her attention back to Elloo Ellu. “And yet, a very different court, the court of popular opinion, tends to rule with much greater urgency and exactitude, does it not? So, no, Elloo Ellu, I am not inclined to grant you this extreme request. Awenato will serve what we all must serve for second-degree harm without intent: mandatory service for three months of work-cycles. Are we understood? Awenato?”\nUrrum Urree nudges me and I stand, blinking both sets of eyelids slowly. “Awenato, I’m placing you with the Lucasian known as Seli to complete your service. Don’t think of this as a punishment so much as participatory community restoration. And I suspect that simply seeing you in the course of more routine labors will help more of the station to naturalize, too, to your presence. That’s what true justice is here, at least. Becoming less like strangers, more like partners in our grand, shared journey through the cosmos. And maybe even . . . friends?”\nBut Elloo Ellu of the Alliance rumbles through its affronted bark. “How dare you speak of justice now!”\nAnd its representative, Jafris, echoes this with a wet snort. “Yes, so much for honoring my client’s wounds, Esteemed Mediator, and its simple aim to prevent more.”\n“We do honor your wounds,” says Kap. Her words now have a seasoned quality, as if well-worn from practice among her people, and perhaps from other mediations. “But we ask, too, for your partnership, in our efforts to make a better system for us all.”\n“Partnership! Hah. Do you hear that, Jafris? Another joke! See, this is what gets me about you people. You want to pretend that we’re equals when we’re not. An alliance of friendship is more pragmatic, more honest, because in an alliance, you never once forget who you are, where you came from, and where your bonds are strongest. But just where are your bonds strongest, Mediator? Or aren’t you willing to admit you’ve got your preferences? Won’t you admit that you’re fascinated with the Uma’u? And that this bias clouds its danger?”\nKap shakes her head. “You act as if there aren’t AI analytics behind every Supreme Council appointment, Esteemed Elloo Ellu. Your accusation of bias has no standing. But also, think, will you? This Uma’u isn’t going anywhere. He’s stuck here until we get word from his people, so everyone can rest assured that all precautions will be taken to keep CEB-21 safe.”\nThe Fen rustles its branches. “Well . . . you’d better be serious about that last part, Mediator—because there are too many Alliance lives here, and I will not risk them to the folly of Partnership negligence. You’d best monitor this . . . this secret keeper closely . . . or else, I swear to you, I will take those precautions myself.”\nKap’s lips purse tightly. “Mind your threats, Elloo Ellu. They will find you no favor here.” She rises, an action allowing all in attendance to realize that the mediation is complete.\nAnd favorably, I might add, all things considered. Which makes my next choice . . . a little unreasonable, I know. But you’ll forgive me, Wene’ss, won’t you? You know how the saying goes about curiosity, after all, among the toms on Uma’u . . .\n7. /ne.we.ne.a.ta/\nthe loneliness of the shared bed, a chasm formed between them\nSo yes, as the mediation ends I ask Urrum Urree to let me have a moment outside the mediation chamber, to speak directly to Elloo Ellu. The wounded party does not accept these terms exactly—insisting that Jafris stay close at hand, for “protection” of all things from little me—but, it accepts. Also, outside the mediation chamber, its demeanor quiets some; I can tell as much from the fragrance of its patchy bark. It even seems to be listening.\n“Again, my sorryings,” I tell it, not for the first time since these proceedings began. “I am hoping your healings are fast and many. My claws . . . they are made for much harder bark than yours. Nothing was done with bad intent. But also, please, I am also not understanding: what mean you in saying to everyone that there is more power with me than all the others were to be seeing, when I scared leap-attack-you in The Trough?”\nJafris snorts wetly, but Elloo Ellu is quiet. Its cracks and fissures exude surprise.\n“Do you really not know?” it exhales, heavily. “I wonder. I felt it so powerfully myself when you attacked me, and I have been carrying the energy of that great fright with me since. So, maybe I misjudge your self-awareness? Or maybe you are just pretending that you don’t know the spirit that walks alongside you . . . Do you truly mean to tell me you know nothing of this, this massive animality that peers out from your abyss?”\nCan . . . can this giant log see you, Wene’ss? Does it know of the eyes that stare at me in every waking moment? Oh, my deadmate, my dearest, my secret power through all my aloneness here . . . is it possible? Are you truly alive in more dimensions than even I thought I knew, visible to others in my own moments of extreme distress?\nBut Urrum Urree has been listening to all of this at a careful distance, and quickly returns with a gentle touch to my shoulder, the rest of the Fen’s towering form offering shelter not entirely unlike the reprieve of a yoru’nan tree in high summer’s heat.\n“Quoting The Starchild’s Voyage to advance your paranoia does not serve our species’ central aim, Brother Fen. What point is there in bearing witness if you also try to coax the witness, too. I know you have been wounded, deeply, but come now: ‘The massive animality that peers out from your abyss’ is a line unfairly plucked from context. You know how the rest of the story goes—but this little twig, he does not.”\nElloo Ellu rocks back on its stumps and shakes its loose protrusions. “Surprising that you’d know, actually, Brother Fen. I thought you didn’t bother with ‘inferior’ texts?”\n“It helps in my line of work to stay informed.” Then Urrum Urree turns its trunk to me, and though I am still hopeless at discerning the face, I can at least follow the yawning sounds to something resembling a source. “It’s a riddle, little friend. And the answer—the ‘massive animality’—is only your reflection. Just, the worst of oneself, peering back.”\nI process these words; and with them, the other log’s manipulations, which had indeed given me to feel a flicker of momentary . . . doubt? Or hope? Yes, my queen, hope—hope that someone else had seen you, too; that there was evidence of your continued presence in this waking realm after all.\nThen the mediation chamber opens, and more beings spill out, Kap and Jess among them. An audience. So be it. My indignation rises at Elloo Ellu’s trickery, as does my exhaustion with it all. I want . . . I want this awful log to tremble as it has made me tremble. I want it to know that, yes, I do have power after all, even if it will never really understand where that power lies. So—\n“No, no, it is correct!” I say, raising my voice and glaring dull-goldly at Elloo Ellu. “You are correct. I have in me a direct line and I am communicating immediately with all the Ancients—all these . . . these Makers. That is the power you felt from me in The Trough. And I am telling them all this now, so you will be sorrying very soon. Yes, you will be sorrying so much when they hear all and decide what next. For you. For everyone in the now-here-now. For . . . for all of you. The whole way station, even.”\nAnd this Fen from the Alliance does indeed freeze at my words—Jafris, too—but I have no time to enjoy my victory over their accusations, because all at once I sense . . . such fear as well in Kap. And Urrum Urree, whose protrusions tense over my shoulder. And Jess, whose fear is plainest of all on her large-lipped, naked face.\nAh, Wene’ss . . .\nWhat is this foolish thing I have done?\nIs this any way to shake those eyes of yours, ever on me in the waking; ever calling me to act, act now, avenge you through my dealings with these aliens?\n8. /o.we.o/\nthe loneliness of living too long with the lie\nI am not spoken to much after the mediation—or rather, after the enigmatic threats I made outside mediation-chamber doors. It’s like those green-gold grasses back on Uma’u: a bending and a parting, riverlike, as I move through all of CEB-21. Everyone is careful and polite on my way to mandatory work placement, in the bio-dome where sustenance for all is grown. You might think the people here would be too afraid to have me oversee such a critical part of the local economy, but it is in fact a startlingly mechanical affair, even in parts where the illusion of genuine nature has been built into the walls, the floor. Plus, I am never alone here. The Lucasian, Seli, works here: has to, apparently, because the spritz of moisture some sections of the bio-dome offer are her only reprieve from the general aridity (for her species) of the climate elsewhere on CEB-21. A massive spider from the nearby world serves here, too. A Spinner, they call her. That arachnid is huge and cannot move about at all on certain levels of the station. Even here she has to keep her legs grouped close together as she moves through the bio-dome, and I . . . I cannot help but water for those legs, Wene’ss. I have the most terrific urge just to pounce on one and nibble at it as she drags herself along. Would she even notice the loss when there is so much of her on whole?\nI know, I know, a terrible wondering for a diplomat. Only, she’s quite similar to one of our delicacies back home. Maybe a thousand times an ebe’li’s size? And wearing the most absurd pale-blue mask, vaguely Humanlike in its features, over her sumptuous red eyes.\nYet for all my hungry, salivating glances her way, the Spinner does not fear me as the rest do—and neither does Seli, though I have no idea if she’s even been told about the enigmatic menace I became outside the mediation chamber. After a few hours, though, in this uncanny world of compartmentalized soils, synth-scents, and chlorophyll mixed with artificial composites, I realize that she poses another challenge for me anyway: the fresh peculiarities, that is, of her specific Partner accent.\nIt’s . . . Standard-Variant, I suppose? But while the others often slip into idioms directly translated from their native tongues . . . the ancestral tunnel-dwelling Retet leaning on “feel my rumble” for “understand me”; Elloo Ellu’s colorful “Are you kidding me with that fungal rot?”; and almost everything out of a Gremshu’s coils . . . the Lucasian is different. This Lucasian simply seems . . . as bad at Partner as I am.\nJust, bad in different ways.\nI might gesture, for example, at some nutrient tubing that seems to require replacement, and say, “These are for the changing?”\nThen Seli—a spongy-white mass with rolling lumps for limbs, like a giant multicellular clump fringed in cilia—will open her speech-lump to utter in rounded, popping syllables:\n“PAH-fect ob-PAH-servaSHAH-n!”\nAnd it will take me a few seconds to process the words beneath the pops, both because the accent is so heavy and because the phrase she is leaning on . . . isn’t a perfect fit. She has many of these catchphrases, though, and she cycles through them in lieu of generating more nuanced speech. Worse, she cycles through them almost nonstop, as if speech in some form is as vital to her species as air is to our own.\nFor all my direct exposure to her, too, you might think that my ear for her alternately accented Partner would improve. But, oh, you can laugh, my queen, for it definitely has not.\nNevertheless, I am relieved not to sense animosity or fear off Seli’s massive form, nor disappointment when I choose not to interact with the baffling rhythms of her relentless chatter during our shifts. Some days, I concentrate instead on taking out the scop and holding it a little longer in calm hands. Watching myself a little longer, too, in its dark, reflective glass.\nA half-lunar passes as such, with Seli and the gardens of CEB-21 and the gifted scop; and then, one day-cycle, while sitting with the device on break, a delicious shadow nears me under the meat-fruit trees.\n“Difficulty with the scop?” says the Spinner. “Do you require assistance?”\nI look up at this richly scented arachnoid feast.\n“Thank you, very kind,” I say. “No, I am . . . I am only afraid to use it.”\nTick-tick-tick-tick. Its legs shuffle in place, as if processing this.\n“Well, yes, that is a silliness of mine, maybe,” I add. “But in this machine is a story that I am being told over and over explains the hurting of my people, my deadmate, my everything. And I am thinking, over and over . . . I should be learning the story, yes? To learn how to defeat it, how to keep it from ever hurting my people again? Also, I still need to hunt those who hunted the rest of my crew. Maybe this will help with my hunting, too?\n“But also I am thinking over and over: What if I read it, this great big story that everyone here is talking about in so many different ways, and . . . and I am learning that the story is not in fact holding all the danger to my people? What if there is nothing in here at all to explain why these people acted so killerly to my one, my only, and the rest?”\nTick-tick-tick-tick go those legs again. Then, slowly, as if recalling an underused habit, half-forgotten to muscle memory . . . the Spinner reaches for her blue-spun mask and slips it from her eyes. So many glistening, juicy red eyes. And that sweetness, her pungent heat . . .\nWene’ss, I swear, it really is like an ebe’li—only, blown up a thousandfold, as if for another’s purpose. I can almost imagine what it would be like to lap at one of those fresh eyelings, or to set the whole of that body for a minute or two to roast . . .\n“You are Uma’u,” says the Spinner—reminding me that she is more than food.\n“I am,” I say, working my salivating maw around the words.\n“But also . . . you are not . . . uma’u.”\nAnd oh, Wene’ss. Wene’ss . . . Every hair on this lone tom’s body stands on end to hear that nuance after so very long. What a curious meal this creature is! For it knows, somehow, both “Uma’u” the planet, the people . . . and also uma’u, the concept: u-,a completeness always doubled around the noun phrase, plus ma, the undeniable fact of something’s existence.\nSo—\nNo, I want to say to this brilliant nibble. No, you are right, I am not whole. Far from it.\nBut the words catch in my throat.\nThe Spinner seems nonetheless to understand. She continues:\n“You need to hunt those who have taken uma’u from you.”\n“Yes—yes!” I manage, almost a squeak while I startle into a better posture. “Yes, exactly. But the story on this scop . . . this is not the way to be going, is it?”\nThe Spinner stares at me for a lengthier silence, which puzzles me. I know that my chosen vocabulary was not complicated, so what about my question is so difficult for this being to process? Is it one of the lesser sentiences here, perhaps, for all its massive size?\n“Uma’u needs no story to find uma’u,” she says at last.\nI crouch to process this in turn. “Because . . . because I am having the dreaming? But the dreaming is not enough for uma’u. I have in the waking still the eyes of the dead, and they follow me everywhere I go. They are telling me I am needing to act, but how, how can I act when the people killerly are far from here? So far in the waking. How can I be reaching them, when the Partnership has control of all my moving here?”\nA lesser pause this time. Perhaps the Spinner needs questions posed more directly? I remember Ese’ima being literal like that: An excellent technician, while she lived. A brilliant engineer and planner, so long as every project parameter was known precisely to her first.\n“Spinner has the spinning. Uma’u has the dreaming. Every piece, its powers and parts.”\nAnd then the giant spider dips low on its massive legs, until one of its bright eyes is level with mine, and I can see the whole of my distorted reflection in that gloss, and she says to me in perfect High Court Uma’u:\n“ . . . ’beata neru’yoli, odanata ine’atali ane’na . . . ”\nWalking mountainward, the hunter to his fate is arriving. The Spinner’s Uma’u really is impeccable . . . but then again, Kap did mention that some of the AI here were studying our culture and our language. Should I be surprised to discover another has, as well?\nNext, I let the meaning of these perfect words sink in. Walking mountainward . . . but, there are no mountains on CEB-21. Only in . . .\nBut is that possible?\nOh, Wene’ss, I can almost feel you catching at my ear again with your fierce teeth, but consider it for a moment, won’t you? What if our tales about distant vistas in the dreaming are not just told to younglings to sooth them when older toms and queens go on ahead? What if we have always had this other way to slip between whole worlds, and realms, and . . . stars?\nThen again, for all I know, this Spinner is simply pulling a trick like Elloo Ellu. Maybe this is just another line from those accursed texts of theirs—only, translated this time into Uma’u, to try to manipulate me again, into giving them what they all think I know?\nI set down the scop by one of the water filtration tanks, a wave of exhaustion following my uncertainty. I want no more of it, my dearest—all these Partnership stories, all their impositions on our dreaming. Where am I, where are you, where is Uma’u to be found in this supposedly enlightened compact?\nUncanny timing for this question, though—because not right away, but mere hours after, as I gather my things to leave at shift’s end, Seli calls me over with a heightened PAH, SHAH, AH’ing of her Partner. Excitement, I think? Followed by a slight deflating of her form to show signs of solemnity and sympathy, too.\n“TheyAH AHre HAHving it!” she tells me. “FAHNAHlly! AHweNAHto! THAH celebraSHAHn of LAHfe FAH YAHr peoPAHle!”\nOh, but I don’t even try to parse this, my queen. I have long given up trying to understand her. I incline my head instead to study Seli’s scop. There is indeed a message on it for her to pass on to me: “A celebration of life.” A memorial service. A funeral, whole lunar-cycles overdue, for Uma’u’s dead. There we are, my dearest. At last, and so long overdue.\nSo why now? My ears flatten in careful contemplation. It has only been . . . two quarter-lunars, after all, since all my mysterious, menacing talk about having connections to the Makers. Could that have done the trick? Did that finally make the Supreme Council think to take me seriously—me, this frail little tom that for lunars now they’ve been insisting simply needs its rest, and should not worry about such things?\nI consider doubling back and taking that flying leap at the Spinner’s leg in my euphoria at this news. No, I’m not irate with her, of course—but a thrill of hunger’s rising in me, my beloved. Power, my love! Agency, my queen! At last!\nAnd, oh, Wene’ss, I am ready now. I am wanting again . . . so much more.\n9. /we.ne.we/\nthe loneliness that welcomes its own existence as an invitation to seek out more\nYou should be here to see this in person, my dearest—truly. What a grandiose affair of a funeral the Partnership finally thinks to throw for me, on all of your accounts. Five beautiful pedestals, each with a holoimage of one of you upon it, with details projecting outward when sensor-triggered by passing spectators; each with biographies for all of you, too, which have been drawn from the mission brief and given a distinctly Partnership flavor. Such slender fragments of all of you, really. Nothing in yours, for instance, about that fearless klutziness I so admired in you, when stood first on the cusp of queendom. Nothing in Abareto’s bio, either, about the wager he once made, and lost, with the captain of the islanders’ guard, before the High Court ruled that all island toms had to be eliminated for the good of the mainland, and all the queens there redistributed among the other colonies. How Abareto had wandered through the ruins of that island settlement for months after, uselessly fixated on the fact that he’d never had a chance to pay back what he owed before the massacre party had torn through that place, with him among the invading forces.\nThere are many forms of guilt we carry through the waking, aren’t there, love?\nI wonder myself—I never thought to ask him, of course, but . . . I wonder: Did Abareto have the captain’s eyes bearing down upon him in his waking, too? And if he’d been the one to dawdle on our ship with the luggage—if he’d been blown back while all the rest of us, scampering on ahead to CEB-21, were tumbled out into the darkness . . . would he have the same hauntings that I do now?\nWell. One can hope. Here, though, is what I do know:\nThere are stories we Uma’u tell of being Uma’u.\nAnd now, in the Partnership, and in the Alliance of Friendship, there are stories the outsiders tell of being Uma’u, too.\nThen there are the littler stories . . . of me. At least, these are the littler stories I hope that all the toms and queens here remember to tell only of me, as me—and not as some absolute example of what it means to be Uma’u.\nJess, for instance, must have such a story of me. She is among those who attend this memorial ceremony, as is Kap. So many are here, I’m convinced, only out of curiosity. Others, out of suspicion. And oh, maybe a few out of genuine condolences and horrified grief, that such a violent act should have happened in so peaceful place. But as for Jess and Kap . . .\nIs it guilt that brings them here, or more fear?\nWhen Jess approaches me this time, while we mill about in wait for the appointed hour for speeches, she no longer attempts to touch my fur without permission, and neither does Kap linger by her side to ask questions about our people. Kap does not even make eye contact with me, really. Since we are in The Trough, converted for the ceremony to allow for a meal after, she sweeps past us for a drink instead. I watch her out the corner of my eye, though; note the care with which she repeats a cleaning ritual upon a single glass before pouring it. A kind of Human stress grooming, maybe?\nJess, following my gaze to her lifemate’s repetitive actions, confirms my suspicion.\n“Kap studied isolation for her thesis, I think she told you?” says my old integration facilitator. “Because her father knew isolation well, and kept the household in a constant state of readiness, out of fear that what’d happened to his wife, her mother, on their frontier world might happen to them again. Kap’s . . . managed a fairly easygoing life since becoming an officer and moving here, all things considered, but she still has trouble, sometimes, accepting when she cannot control every variable. She’s been trying to find the perfect lock on things, the magic word that suddenly makes sense of every fear she’s ever lived through. But then . . . after what you said after the mediation . . . that threat you made to the Fen . . . ”\n“I scared you. I am knowing this.”\nBut Jess looks down at me with . . . less fear than I expected. Her and Kap’s first bout of nervousness around me, I realize now, was a fear that I would reject their friendship, when they were just so fascinated by me—or at least, by the idea of me, and what my species represented in the way of new learning opportunities. Now, though, the second fear, the one I gave everyone outside the mediation chamber . . . that fear has changed their investment in the first. And so, I am not an object of fascination anymore. Only a scenario to be handled with caution, like everything else in their fragile lives.\nI try not to be disappointed. There are so many ways in which I have served others’ understandings here of what Uma’u is. Of who I am. But even the flattering versions are unkind in their own way. In their oversimplification of, oh, everything about me. My uma’u.\nIn whose eyes does the truth of me matter? Only yours, my one, my only, my dearest deadmate—or at least the notion of you that my mind has forged to replace your reality in this lonely waking life. Even now, at this long overdue and clearly politicized ceremony, where a soft series of chimes at last marks our arrival at the hour of what will be my greatest performance in Standard-Variant Partner yet: a presentation of all your lives, and the immense wastefulness of your loss, to this strangeling group of species from across two compacts . . . Even now, your eyes loom larger than life on the canteen ring wall beyond the five pedestals and their associated plaques. Those two massive rounds of red-flecked gold, my queen, my everything, just . . . waiting, watching, frozen in that moment of your death I never did see firsthand, but carry with me, all the same, whenever we are not in the Otherrealm together.\nI do not watch the Fens or the Humans in the audience as I ascend the added booster to reach a visible height for all. Nor do I look to the lizard-toms whose species-name I don’t recall, or to the Retet, or the Gremshu, or the j-bot for livestream participants, or any of the dozen other researching species that I have yet to formally meet, let alone even begin to get to know. I know what they’re all really here for, of course—the curious and the guilty, the grieving and the suspicious. They’re here for some greater payoff . . . not today, perhaps. But later. They’re here to convince me, with their presence, with this sudden united front of respect, that they can be trusted with the secrets of this ancient race, the Makers, that I have already given them . . . plenty of reason to think I truly know.\nThe game is so simple, really:\nShow up. Pay respects. Ingratiate themselves with the little, unassuming tom that just a lunar ago they all smirked at or belittled for speaking so poorly, so haphazardly, and through so much ongoing trauma, in their frustrating Standard tongue.\nAnd then . . . the gates to all great knowledge will open for them, yes?\nThen I will introduce them to all that Uma’u knows of the ancient ones?\nOh, beloved . . . I do so hope there is truly a dreaming after we pass on, and that it is not just a false realm we speak of to soothe our younglings in the now-here-now.\nYou’ll wait for me there, though, won’t you? High up in the finest of yoru’nan trees, that we may nuzzle eternally in its perfect summer’s heat, tail in tail, that heavy maw of yours nestling so effortlessly under mine, tongues flicking lazily to catch and crunch on ebe’li, even in our drowsing, as they skitter past the fragile buds at last giving way to blooms?\nBecause first, my dearest, my only . . . after this last speech is through, there are some mountains in the dreaming I think it’s high time I set about exploring. Yukelene truly believed, didn’t he, that if you fell into the dreaming before you entered cryo, you could conceivably travel further? Almost anywhere?\nInto Alliance territory, maybe?\nInto what dreams your killers might still be dreaming even now?\nYes, of course, my love—if it works, I’ll tell you all about it.\nThe death cries. Their screaming.\nWho else would understand me anyway, in that—or any—place?\nCanadian by birth, M L Clark is now based in Colombia. Clark is the published author of science- and speculative-fiction stories in Analog, Clarkesworld, and Lightspeed, with work forthcoming in F&SF. Other projects pending publication include a novel in the universe of “To Catch All Sorts of Flying Things” and “Leave-Taking,” and a humanist column and podcast to launch at the end of 2021.", "source": "https://clarkesworldmagazine.com/clark_06_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Nine Words for Loneliness in the Language of the Uma'u by M. L. Clark"}