{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Stephen Dedman", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "ZHTPha0wjuTjU145B7rrGdQ5HEA=", "id": null, "license": null, "comments": "", "raw_text": "2130 words, short story  Teeth  The little oblong box was made of ebony: I had to give Klein credit for a sense of irony, and possibly his knowledge of the genre. I stared at the glistening white lumps of ivory inside, and shook my head. “Beautifully preserved, aren’t they?” said Klein.  “Suspiciously,” I growled. “How sure are you of their provenance?”  He made a see-sawing gesture. He’d never had the looks or the range to make it as an actor (though that hadn’t stopped him trying), but he was a pretty good salesman. He worked for a well-known theatrical agency, mostly getting people the stuff that they wanted that couldn’t be written into their contracts. “They came from Temple’s collection. Before that, I have my doubts,” he admitted, “but he could hardly have asked for documentation. Body-snatchers didn’t go in for paperwork.”  “So you expect me trust you? Or am I supposed to try extracting some DNA?”  Klein smiled. “You could, I suppose, if you had anything for comparison . . . but you’ll have to buy them first.” He closed the little casket with an audible snap. “I’m not giving away free samples here. And if you look up the records, you’ll find that when they disinterred Poe’s corpse in 1875, the sexton noted that while the skeleton was in near-perfect condition, the top teeth had been dislodged from the skull.”  I knew the story, of course. In 1873, the philanthropist George Childs had been persuaded that Edgar deserved a better monument than an overgrown grave in the Poe family plot, and paid for a new memorial. “So who collected these? The sexton?”  “Maybe, or one of the gravediggers. You could still sell teeth back then, to be made into dentures: maybe he meant to do that, or maybe he realized how valuable they were . . . anyway, one of Childs’ servants found them in his collection after his death in 1894, or so the story goes, and sold them to Jules Verne. After that, the trail is easier to follow, though they were always sold in secret. Temple bought them some time in the 1980s.”  I tried to look unimpressed, and refilled my glass with Amontillado, leaving his empty. “What’s in the other box?”  Klein’s smile became a grin, and he opened the second ebon casket with a conjurer’s flourish. These teeth had been set into dentures in a wire frame, though the work was obviously primitive. “Don’t touch,” he said, pulling the box away from me.  “Whose are these supposed to be?” I said, dryly. “His teeth when he was a boy?”  “His mother’s,” Klein gloated. “I don’t know whose dentures they were, but those are her original teeth.”  “You can’t be serious.”  Klein lost a minute fraction of his smugness. “The provenance on these is a little less reliable,” he admitted, “but the story is interesting. You remember Poe’s story ‘Berenice’?”  I may have sniffed: just because I make movies, doesn’t mean I can’t read. ‘Berenice’ is not Poe’s best story, and it’s most interesting for containing the seeds for ‘The Fall of the House of Usher’ and ‘Ligeia’, as well as some disturbing autobiographical elements. The obsessive Egaeus is betrothed to his cousin Berenice, but only notices her beauty when he sees her in the haunted library where his mother had died. (Poe’s own mother, a beautiful actress, had died of tuberculosis when he was two: he married his cousin Virginia six months after ‘Berenice’ was published, and she died of tuberculosis several years later.) After Berenice dies, Egaeus breaks into her tomb and steals her most attractive feature, her teeth. When readers complained about the story, Poe actually apologized to the editor who published it, claiming that he’d written it on a bet that he “could produce nothing effective on a subject so singular” and allowing “that it approaches the very verge of bad taste”—which means it’s pretty tame by modern standards.  “In 1834,” Klein continued, “somebody approached Poe and offered to sell him these teeth, saying they were his mother’s. Poe may have believed them, or not, but he couldn’t meet their price, even though he’d just won a prize for ‘MS. Found in a Bottle’. He wrote ‘Berenice’ hoping to raise the money, but by the time he was paid for it, the seller had disappeared. Childs’ servant said he bought the teeth, and a letter from Poe describing the incident, from Lizzie Doten sometime in the 1870s, but the letter is lost. Of course, I can’t really prove any of this, but since you’re the biggest private collector of Poe memorabilia alive now that Temple is gone . . . and not exactly a premature burial, if I may say so . . . ”  I smiled at that, involuntarily, and tried to hide it behind my glass, but I could tell that Klein had noticed. “So,” I said, as blandly as I could manage, “you’re asking me to pay out a quarter million based on the claims of a couple of grave-robbers, at least one thief, two fantasists—one of them the creator of a celebrated hoax — and a poet who claimed to be channeling the dead, and now a dealer in stolen artwork, and God knows how many fools and liars in between.”  Klein shrugged: he didn’t need to look around at the bookshelves, the bust of Pallas above the door or the mummy case in the corner to know how obsessed I was with Poe, horror’s patron sinner. “You must be used to that.”  He was right, of course—everybody in Hollywood lies constantly, if only to themselves—but that didn’t stop it sounding like an insult, and I hate being insulted. “You’ve seen them,” he continued, smirking. “Sleep on it, and decide for yourself, but don’t take too long. I can always find another buyer: do you want to spend the rest of your life wondering what you could have had?”  Poe said it better than I could, of course: And the evening closed in upon me thus—and then the darkness came, and tarried, and went—and the day again dawned—and the mists of a second night were now gathering around—and still I sat motionless in that solitary room—and still I sat buried in meditation—and still the phantasma of the teeth maintained its terrible ascendancy, as with the most vivid and hideous distinctness it floated about amid the changing lights and shadows of the chamber.  Of course, I didn’t spend all of that time motionless or meditating: I wasn’t able to sleep for long without dreaming of adding those teeth to my collection, but I made the effort. I remembered to eat, and wash, and while I didn’t need to leave the house, the phone and fax machine was never silent for very long: I had another two films in pre-production and one in post, so I had plenty to occupy my time if not my mind. But I kept returning to the library and staring at the treasures of my collection. The teeth, if I bought them, would have to go in the safe: if they were fake, then the fewer people who knew I had bought them and been fooled, the better. But if they were real, the idea of them belonging to someone else was unbearable.  I picked up a collection of Poe stories, and leafed through it, hoping he would give me an answer.  Klein was grinning again, or still, as he walked into my office at the studio on Friday night, opened his attaché case, and produced the boxes again. “I was sure you’d call,” he gloated.  “Sure enough that you didn’t try to sell them to anybody else?” I murmured.  He faltered slightly at that, but his insulting smirk returned as I handed him a glass. He gulped it down as though it were water, and I poured him another. “Yes,” he admitted. “I knew you could pay more, and sooner.”  I nodded, and opened the attaché case to show him the stacked banknotes, then snapped it shut again. “You have them?”  He opened his own case, removed the ebony caskets, and placed them on my desk. I looked inside both boxes, and nodded. “The old law of Hollywood: give ’em what they want.” I drew a deep breath. “What do you want, Klein?”  “Well, I’d like to be paid,” he said dryly.  “You will be, I promise . . . but what do you do with your money? Do you collect anything?”  “No, not in the way you mean it. I mean, I like to have the best, but so does everybody, right?”  “The best of what?”  “The usual stuff. House, car, clothes . . . you know.”  “Anything you wouldn’t sell for a profit?”  “No, I guess not. Why?”  “So what really moves you is money?”  “Well, sure, same as everybody. So what?”  “Have you read much Poe, Klein? ‘The Cask of Amontillado’, perhaps? ‘Hop-Frog’? ‘The Conqueror Worm’?” Somehow, looking at his triumphant sneer brought that one instantly to mind. “’The Premature Burial’?”  “I saw some of the films.”  “A poor substitute for the genuine article,” I said. “And a man in your line should be able to tell real from fake.” I pulled the small pistol from my pocket and pointed it at his stomach. “Take this, for example.”  His eyes widened. “What—”  “This might just be a prop,” I said, “and if it is, then you can just grab that case and run out of here and tell people how you managed to take me for a quarter mill. But it might not be: sometimes it’s cheaper to buy the real thing than fake it.” I grabbed the case, and nodded at the door. “There’s something I want to show you.”  It was so satisfying him seeing him walk down the corridor, hands clasped behind his head, that I almost took pity on him—but if I did that, I’d be finished in Hollywood. I steered him towards the soundstage where the crew had reconstructed a used crematorium. I pressed the buttons to open the door, and another to start the burners. “For example,” I said, “is that fire really hot enough to actually destroy a body?”  Klein was sweating by now, and I doubted it was because of the flames. “If it helps, it would need to be about 1600 degrees not to leave any identifiable remains. But paper burns at a third of that.” And I threw the attaché case into the oven.  Klein squawked, then stared at me. “You’re crazy!”  “Crazy enough to throw away a quarter million on a whim? Maybe I am . . . but then, that’s not my money: it’s yours. All you have to do is go and get it—but don’t take too long.”  He stared into the flames. “You’re bluffing. The money’s fake. Counterfeit. Copies. Whatever.”  “Maybe,” I said. “Maybe not. But to me, that money’s worth less than the possibility that these teeth are real. What’s it worth to you? Do you want to spend the rest of your life wondering what you could have had?”  He turned to look at me, hoping for some clue in my expression, then leapt into the flames. I pressed the button to close the door, and stood there for a few minutes half-hoping to hear a cry of “For the love of God, Montressor!”—but there was nothing but silence.  I waited for two hours, reading e-mails and script outlines on my Blackberry, before turning the flames off. When I returned to the studio on Monday, the oven had cooled down, and the crew was emptying it out.  Maybe I shouldn’t have gone down to the soundstage to watch them, but I had to make sure there was nothing left that could be identified, no tell-tale hearts or anything of that nature. Klein was right about the money, of course: most of it was fake, but he’d probably never had a chance to find out. Fortunately, nothing in the ashes resembled a banknote, or the attaché case. Just some small fragments of bone indistinguishable from the others we’d used to decorate some of the sets, and some lumps of molten metal that had once been his Rolex and his belt buckle.  One of the stage hands picked some white lumps out of the ashes, and looked at them curiously. Teeth. Human teeth. My heart grew sick, but then he tossed them into the bin with the other rubbish. I smiled to see them there, but my smile failed as the teeth seemed to form themselves back into Klein’s familiar smirk. Another shovel-full of ash landed on top of them, but I could still see them glistening there. I see them still. Stephen Dedman was exposed to the works of Ray Bradbury and Edgar Allan Poe at an early age, and has never quite recovered. The author of four novels and more than 100 short stories published in an eclectic range of magazines and anthologies, he has won the Aurealis and Ditmar awards for short fiction and been nominated for the Bram Stoker Award, the BSFA Award, the Seiun Award, the Spectrum Award, the Sidewise Award and a sainthood.", "text": "2130 words, short story\nTeeth\nThe little oblong box was made of ebony: I had to give Klein credit for a sense of irony, and possibly his knowledge of the genre. I stared at the glistening white lumps of ivory inside, and shook my head. “Beautifully preserved, aren’t they?” said Klein.\n“Suspiciously,” I growled. “How sure are you of their provenance?”\nHe made a see-sawing gesture. He’d never had the looks or the range to make it as an actor (though that hadn’t stopped him trying), but he was a pretty good salesman. He worked for a well-known theatrical agency, mostly getting people the stuff that they wanted that couldn’t be written into their contracts. “They came from Temple’s collection. Before that, I have my doubts,” he admitted, “but he could hardly have asked for documentation. Body-snatchers didn’t go in for paperwork.”\n“So you expect me trust you? Or am I supposed to try extracting some DNA?”\nKlein smiled. “You could, I suppose, if you had anything for comparison . . . but you’ll have to buy them first.” He closed the little casket with an audible snap. “I’m not giving away free samples here. And if you look up the records, you’ll find that when they disinterred Poe’s corpse in 1875, the sexton noted that while the skeleton was in near-perfect condition, the top teeth had been dislodged from the skull.”\nI knew the story, of course. In 1873, the philanthropist George Childs had been persuaded that Edgar deserved a better monument than an overgrown grave in the Poe family plot, and paid for a new memorial. “So who collected these? The sexton?”\n“Maybe, or one of the gravediggers. You could still sell teeth back then, to be made into dentures: maybe he meant to do that, or maybe he realized how valuable they were . . . anyway, one of Childs’ servants found them in his collection after his death in 1894, or so the story goes, and sold them to Jules Verne. After that, the trail is easier to follow, though they were always sold in secret. Temple bought them some time in the 1980s.”\nI tried to look unimpressed, and refilled my glass with Amontillado, leaving his empty. “What’s in the other box?”\nKlein’s smile became a grin, and he opened the second ebon casket with a conjurer’s flourish. These teeth had been set into dentures in a wire frame, though the work was obviously primitive. “Don’t touch,” he said, pulling the box away from me.\n“Whose are these supposed to be?” I said, dryly. “His teeth when he was a boy?”\n“His mother’s,” Klein gloated. “I don’t know whose dentures they were, but those are her original teeth.”\n“You can’t be serious.”\nKlein lost a minute fraction of his smugness. “The provenance on these is a little less reliable,” he admitted, “but the story is interesting. You remember Poe’s story ‘Berenice’?”\nI may have sniffed: just because I make movies, doesn’t mean I can’t read. ‘Berenice’ is not Poe’s best story, and it’s most interesting for containing the seeds for ‘The Fall of the House of Usher’ and ‘Ligeia’, as well as some disturbing autobiographical elements. The obsessive Egaeus is betrothed to his cousin Berenice, but only notices her beauty when he sees her in the haunted library where his mother had died. (Poe’s own mother, a beautiful actress, had died of tuberculosis when he was two: he married his cousin Virginia six months after ‘Berenice’ was published, and she died of tuberculosis several years later.) After Berenice dies, Egaeus breaks into her tomb and steals her most attractive feature, her teeth. When readers complained about the story, Poe actually apologized to the editor who published it, claiming that he’d written it on a bet that he “could produce nothing effective on a subject so singular” and allowing “that it approaches the very verge of bad taste”—which means it’s pretty tame by modern standards.\n“In 1834,” Klein continued, “somebody approached Poe and offered to sell him these teeth, saying they were his mother’s. Poe may have believed them, or not, but he couldn’t meet their price, even though he’d just won a prize for ‘MS. Found in a Bottle’. He wrote ‘Berenice’ hoping to raise the money, but by the time he was paid for it, the seller had disappeared. Childs’ servant said he bought the teeth, and a letter from Poe describing the incident, from Lizzie Doten sometime in the 1870s, but the letter is lost. Of course, I can’t really prove any of this, but since you’re the biggest private collector of Poe memorabilia alive now that Temple is gone . . . and not exactly a premature burial, if I may say so . . . ”\nI smiled at that, involuntarily, and tried to hide it behind my glass, but I could tell that Klein had noticed. “So,” I said, as blandly as I could manage, “you’re asking me to pay out a quarter million based on the claims of a couple of grave-robbers, at least one thief, two fantasists—one of them the creator of a celebrated hoax — and a poet who claimed to be channeling the dead, and now a dealer in stolen artwork, and God knows how many fools and liars in between.”\nKlein shrugged: he didn’t need to look around at the bookshelves, the bust of Pallas above the door or the mummy case in the corner to know how obsessed I was with Poe, horror’s patron sinner. “You must be used to that.”\nHe was right, of course—everybody in Hollywood lies constantly, if only to themselves—but that didn’t stop it sounding like an insult, and I hate being insulted. “You’ve seen them,” he continued, smirking. “Sleep on it, and decide for yourself, but don’t take too long. I can always find another buyer: do you want to spend the rest of your life wondering what you could have had?”\nPoe said it better than I could, of course: And the evening closed in upon me thus—and then the darkness came, and tarried, and went—and the day again dawned—and the mists of a second night were now gathering around—and still I sat motionless in that solitary room—and still I sat buried in meditation—and still the phantasma of the teeth maintained its terrible ascendancy, as with the most vivid and hideous distinctness it floated about amid the changing lights and shadows of the chamber.\nOf course, I didn’t spend all of that time motionless or meditating: I wasn’t able to sleep for long without dreaming of adding those teeth to my collection, but I made the effort. I remembered to eat, and wash, and while I didn’t need to leave the house, the phone and fax machine was never silent for very long: I had another two films in pre-production and one in post, so I had plenty to occupy my time if not my mind. But I kept returning to the library and staring at the treasures of my collection. The teeth, if I bought them, would have to go in the safe: if they were fake, then the fewer people who knew I had bought them and been fooled, the better. But if they were real, the idea of them belonging to someone else was unbearable.\nI picked up a collection of Poe stories, and leafed through it, hoping he would give me an answer.\nKlein was grinning again, or still, as he walked into my office at the studio on Friday night, opened his attaché case, and produced the boxes again. “I was sure you’d call,” he gloated.\n“Sure enough that you didn’t try to sell them to anybody else?” I murmured.\nHe faltered slightly at that, but his insulting smirk returned as I handed him a glass. He gulped it down as though it were water, and I poured him another. “Yes,” he admitted. “I knew you could pay more, and sooner.”\nI nodded, and opened the attaché case to show him the stacked banknotes, then snapped it shut again. “You have them?”\nHe opened his own case, removed the ebony caskets, and placed them on my desk. I looked inside both boxes, and nodded. “The old law of Hollywood: give ’em what they want.” I drew a deep breath. “What do you want, Klein?”\n“Well, I’d like to be paid,” he said dryly.\n“You will be, I promise . . . but what do you do with your money? Do you collect anything?”\n“No, not in the way you mean it. I mean, I like to have the best, but so does everybody, right?”\n“The best of what?”\n“The usual stuff. House, car, clothes . . . you know.”\n“Anything you wouldn’t sell for a profit?”\n“No, I guess not. Why?”\n“So what really moves you is money?”\n“Well, sure, same as everybody. So what?”\n“Have you read much Poe, Klein? ‘The Cask of Amontillado’, perhaps? ‘Hop-Frog’? ‘The Conqueror Worm’?” Somehow, looking at his triumphant sneer brought that one instantly to mind. “’The Premature Burial’?”\n“I saw some of the films.”\n“A poor substitute for the genuine article,” I said. “And a man in your line should be able to tell real from fake.” I pulled the small pistol from my pocket and pointed it at his stomach. “Take this, for example.”\nHis eyes widened. “What—”\n“This might just be a prop,” I said, “and if it is, then you can just grab that case and run out of here and tell people how you managed to take me for a quarter mill. But it might not be: sometimes it’s cheaper to buy the real thing than fake it.” I grabbed the case, and nodded at the door. “There’s something I want to show you.”\nIt was so satisfying him seeing him walk down the corridor, hands clasped behind his head, that I almost took pity on him—but if I did that, I’d be finished in Hollywood. I steered him towards the soundstage where the crew had reconstructed a used crematorium. I pressed the buttons to open the door, and another to start the burners. “For example,” I said, “is that fire really hot enough to actually destroy a body?”\nKlein was sweating by now, and I doubted it was because of the flames. “If it helps, it would need to be about 1600 degrees not to leave any identifiable remains. But paper burns at a third of that.” And I threw the attaché case into the oven.\nKlein squawked, then stared at me. “You’re crazy!”\n“Crazy enough to throw away a quarter million on a whim? Maybe I am . . . but then, that’s not my money: it’s yours. All you have to do is go and get it—but don’t take too long.”\nHe stared into the flames. “You’re bluffing. The money’s fake. Counterfeit. Copies. Whatever.”\n“Maybe,” I said. “Maybe not. But to me, that money’s worth less than the possibility that these teeth are real. What’s it worth to you? Do you want to spend the rest of your life wondering what you could have had?”\nHe turned to look at me, hoping for some clue in my expression, then leapt into the flames. I pressed the button to close the door, and stood there for a few minutes half-hoping to hear a cry of “For the love of God, Montressor!”—but there was nothing but silence.\nI waited for two hours, reading e-mails and script outlines on my Blackberry, before turning the flames off. When I returned to the studio on Monday, the oven had cooled down, and the crew was emptying it out.\nMaybe I shouldn’t have gone down to the soundstage to watch them, but I had to make sure there was nothing left that could be identified, no tell-tale hearts or anything of that nature. Klein was right about the money, of course: most of it was fake, but he’d probably never had a chance to find out. Fortunately, nothing in the ashes resembled a banknote, or the attaché case. Just some small fragments of bone indistinguishable from the others we’d used to decorate some of the sets, and some lumps of molten metal that had once been his Rolex and his belt buckle.\nOne of the stage hands picked some white lumps out of the ashes, and looked at them curiously. Teeth. Human teeth. My heart grew sick, but then he tossed them into the bin with the other rubbish. I smiled to see them there, but my smile failed as the teeth seemed to form themselves back into Klein’s familiar smirk. Another shovel-full of ash landed on top of them, but I could still see them glistening there. I see them still.\nStephen Dedman was exposed to the works of Ray Bradbury and Edgar Allan Poe at an early age, and has never quite recovered. The author of four novels and more than 100 short stories published in an eclectic range of magazines and anthologies, he has won the Aurealis and Ditmar awards for short fiction and been nominated for the Bram Stoker Award, the BSFA Award, the Seiun Award, the Spectrum Award, the Sidewise Award and a sainthood.", "source": "https://clarkesworldmagazine.com/dedman_03_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Teeth by Stephen Dedman"}