{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Helena Bell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "LSc1vH2Oiay+GsaKPBhOXrIJ72k=", "id": null, "license": null, "comments": "", "raw_text": "2950 words, short story  All the Young Kirks and Their Good Intentions  2249 A.D.  All the young Kirks in Riverside Public High School are assigned to the same Homeroom class. They sit together in the back corner on the far side from the door. They speak only to each other.  The young Kirk on the Moon goes to school with no one. Each of the colonists has a job and he or she is responsible only to the duties of that job. The others call him Fisher instead of James since he spends his days knee deep in the trout pond, allowing the fish to glide between his legs. When the fish become completely inured to his presence, he thrusts his hands into the water and grasps one around the belly. It fights and Fisher holds on. He is supposed to take it out of the water, to throw it into the white bucket by the shore, but Fisher never does. He lets the fish go and when he comes home, with nothing to show for it, his mother expresses her irrevocable disappointment and sends him to bed.  Jamie  All the young Kirks in Riverside are in love with Jamie. She wears tight green skirts and impractical shoes. When she crosses and uncrosses her legs all the Kirks, even the girls, turn their heads ever so slightly to watch. Jamie does not have a boyfriend as none of the Kirks are so bold as to admit their feelings to another. Sometimes, when the teacher lectures on the sixth extinction and flashes slides of West African frogs and fungal diseases, Jamie slides the heel of her shoe off and lets it dangle from her toes. She enjoys being wanted, but sometimes imagines instead that she is a girl named Lucy who is allowed to love whomever she chooses without upsetting the balance.  Jamie Kirk has a plan. Every year they send the best and brightest students to the moon to join the colony. She hears there are animals there long dead on earth, and everyone is beautiful and kind and exotic. There will be no other Kirks there to demand she talk and act in a certain way. She will be free.  The moon colony is very selective, only one couple from Riverside has ever gone, but Jamie knows she alone of the Kirks will be selected as she is the best, the brightest, the most adored. The other Kirks will beg her to bring them too as her one true love and companion. They will fight amongst themselves to see which of them is the most worthy, and Captain, or perhaps Jimmy, or Tiberia of the surreptitious movements, will win. When she is about to consent, a gleaming stranger with skin brighter than fresh fallen snow will appear as there is always a twist in these kinds of dreams.  Jamie is in love with the Challenger. She has been in love with him/her since the first night she climbed to the top of her parents’ barn and saw him/her walking on the road leading away from the river. Jamie believes the Challenger must be a creature of magic: the embodiment of hope and freedom who walks the roads alone because he/she is unafraid of the nighttime creatures, of the illnesses which travel on the air. Jamie suspects The Challenger is an alien, an unknown race who wanders the dark roads for someone worthy of his/her company. Jamie is worthy. Jamie is worthy of all.  But Jamie cannot tell any of the others about the stranger as they are all in love with her and she must pretend to not be in love with them all equally. To balance between the sharp edges of desire and duty to her companions is a very Kirk-like thing to do. And so she waits.  T  All the young Kirks ride their bicycles to the Wal-Mart parking lot after school. They draw straws to see which of them will go inside and attempt to buy a case of beer. Though he does not know how, T’s straw is always the shortest. Captain hands him a wad of sweaty, five-dollar bills and wishes him luck. With a confidence which is not his own, T walks in and slams the beer and the money on the counter.  “Go home,” the cashier says.  “Please,” T says. “Just once.”  The cashier shakes his head.  When T comes out, empty handed, Captain sighs and goes in himself.  “You just have to know how to talk to them,” Captain says.  “Yeah,” Jimmy says. “It’s all in the attitude.”  Captain hands the cans out in order of his favorites. T is always last, and he always refuses to take it. “I don’t drink shit.”  Captain smiles. “Now I see. You’re choosing not to buy it each time. Making an executive decision, saving us from this foul-tasting beverage.”  T shrugs. “Think what you want.”  T suspects that the cashier and Captain have a secret arrangement designed to humiliate T in front of Jamie and everyone else. He fears that one day Captain will kick him out of the group entirely unless he can find a way to be useful. One night, as they ride home, T tells Captain that there’s a tree on T’s property from which, with a telescope, one can see into Jamie’s bedroom window.  “I know,” Captain says. “You can see into Red’s too,” and with a grin, rides off.  Red  Red has a job at the local Wal-Mart. She is the only one of the Riverside Kirks to have dropped out of school and seek employment elsewhere. She saves every cent and one day will buy a steamboat ticket to anywhere out of Iowa. She does not care about the moon or space or destiny. She loves her family and cheers for the local team at football games, but there is a deep restlessness in her feet. Each night she wakes from her dreams to find herself knee deep in the English River with her nightgown and underclothes floating away downstream. She doesn’t tell anyone of her plan to escape, least of all her brother T who will see it as yet another rejection. She suspects her presence is the only thing which protects him from the other Kirks. One day they will discover his birthday is not March 22, but 2 minutes past. She does not know what will happen then, but does not trust the calculated laziness in Captain’s eyes, or the pounding of Jimmy’s fists, or Jamie’s nonchalance, or any of the others whose only concern is moving in perfect synchronization with what is expected of them.  It must be the thought of her brother, the need to protect him which wakes her before she can dive into the deep part of the river and float away forever.  Walking back on the long dirt road Red feels her skin tingling in the moonlight and she knows that any boy looking out from his window will think she is a white stag or changeling or star. She hopes he falls in love with her so one day, when she is gone from this place, there will be an idea of her that takes root and grows. Perhaps in this way enough of her spirit will remain behind to cocoon her brother. Perhaps when she is gone he will fill into some of her Kirkness, enough to belong. Enough that the others will not push him away.  Water is always the problem, Red thinks. It moves and carries where it will. Red caresses the open sores on her legs, and the infections taking root therein. She wishes her sleeping brain had the sense to put on waders before stepping out the door but knows that contagion is an inevitable condition. If not the river, then the rain, then the tap, then the bottled water they import from the Delta in exchange for organic crops. At Wal-Mart she prepares the sleeping lofts where the outlying farmers will come to live when the river floods. No one builds for permanence anymore and she marvels at the other Kirks insistence on pattern.  Every day her brother comes in attempting to buy beer. Every day he fails.  “Why,” she asks T.  “If I don’t, they’ll kick me out.”  “Why,” she later asks the cashier.  “Have you seen the crap floating around in one of those cans?”  “But Captain?”  “Little prick deserves whatever salmonella he catches.”  In the winter months, Red returns to school and sits with the other Kirks in the back corner but she is ever so slightly out of step. While the others gaze longingly at the mauve pump dangling inches away from Jamie’s instep, Red is leaning back to examine the topographic maps on the walls. The Mississippi stretches from floor to ceiling, its many tributaries and old beds undulating in multi-colored bands. The teacher watches her and after class guides her hand up one stream and down the other.  “This is where we lined it with concrete to save the port, this is where it jumped its banks. This is where we think it may go, and where we now try to guide it.”  His hand on her wrist and the inside of her arm is insistent and imploring. “You can’t control a river forever. It goes where it wants. Or goes where it does not want, just to spite you.”  Red pulls back, the backs of her legs tingling with flashes of hot then cold. In the bathroom she pulls up her pant leg and dabs at the cracked scabs. She considers telling the nurse, but there’s not much to be done. She will be dead by summer, like so many others before her.  During her evening shift, Red tells the cashier she’ll make out with him if he agrees to sell T the beer.  “Just once,” she adds.  The cashier shrugs. “You’re not my type, but if it means that much to you.”  T  T’s mother says names have power. They are invasive, like a white fungus, a vine, a jumping carp. Names can take hold, changing the host and adapting it to become the perfect carrier. Why name your son and daughter after an ordinary person: Martha, George, John, Abigail when you can name your children something which will inspire them to a greatness which is not their own, but could be?  T suspects his mother failed him by having twins. If names have power, then surely that power can be diluted. Not all the Kirks are equal. Jamie is the one with whom they are all in love. Captain is the one who can charm. James is particularly good with guns. Jimmy is the bully, but he is strong and fair when it comes to the other Kirks, most of the time. Tiberius and Tiberia are lithe as willow branches and quick as rabbits. Once they claimed to have seen a falcon swooping down upon the highway, and if anyone has eyes fast enough to catch an extinct bird, they do. Jimmy K and Kirkland don’t speak much, but when they do it is measured and wise. What weaknesses he has identified in himself, T sees converted into strengths in others. They are like wandering palms in some ancient forest, constantly moving into the light. He alone feels himself slowly falling down. What space he used to occupy shall be trod over by many soft, green-leaved feet.  One afternoon Captain hands T the cash and slaps him on the back. “This time, try not to fail.”  When he walks in the cashier heads him off. “Compliments of your sister,” he says and hands T a bottle of whiskey.  T is convinced that this is yet another ploy to humiliate him though he does not know how except for the suspicion that everything in his life is a mere contrivance to expose his weaknesses. When he reaches the group, Captain holds out his hand for the bottle but T ignores him. He opens it and hands it to Jimmy. It goes around and around, until finally someone hands it back to T, empty.  T shrugs. “Hasn’t tasted right since Scotland went under anyway.”  “How the fuck would you know?” someone says.  T doesn’t answer, but looks up at the sky. The sun has gone down and they all shiver in the cooling air. It will be difficult riding back in the dark, with loose stones and jostling cyclists on the road. One of them could take him out, if they perceived him as a threat or a mere annoyance. Jimmy might take him out just ’cause. For once the thought doesn’t scare him and he realizes that knowing death is certain and not caring is his first Kirk-like thought. Maybe the clock at the hospital was wrong; maybe his mother was right.  “Same way he knows everything,” Captain says. “He pretends. He thinks he’s better, different, special. But he’s not. He’s just the same as any one of us.”  T smiles back. “Think what you want,” he says.  No one attacks him on the way home, but T knows it is only a matter of time. None of them are safe; they are not a team and were never meant to be.  Jamie  The colony will select new immigrants any day now. Applications have been submitted: education, skills, physical exams. Jamie waits and waits while fending off the advances of the other Kirks.  “We will fly to the moon, you and I,” Captain says. “They let you take a companion, and I will always choose you.”  Weeks go by, months. Rumors spread that an illness has delayed the selection process and the most likely candidates will have advanced degrees in human physiology and evolutionary biology. Jamie doesn’t worry as she knows she is the perfect example of youth and health and they will want her for these attributes alone.  When the spring floods begin most of the Kirks begin to pair off: Kirkland comforts T after his sister’s funeral and rather than calling her a slut, the other girls begin turning to her for advice. When Jamie shifts her legs in class, fewer and fewer Kirks turn their heads. Jamie’s skirts become shorter and shorter until eventually the teacher pulls her aside and gives her a sweatshirt to tie around her waist.  “The noise your flesh makes when it sticks to the seat is distracting. This will help.”  Jamie pouts and twirls her hair in her fingers. “Is that the only thing about it which is distracting?”  “Yes. Now go sit down.”  Jamie believes when the floods recede everything will go back to normal. But it doesn’t. Even her white-skinned alien has abandoned her, and no longer walks along the road by her house. She begins to doubt she ever saw him/her at all.  Only Captain favors Jamie openly and she pretends to favor him back to spite the others. She lets his hand wander up her leg and kisses him when the others are looking. She tells herself she is only salvaging her plan when she allows him to undress her in the dark. She is only recapturing her essence when he moves against her. But she feels nothing when he murmurs that their souls are mere whispers in the dark. She is robotic in her movements and she feels Captain, the other Kirks, the alien, her entire world slipping away from her. When they finish, Jamie goes back to the roof hoping that now she has sacrificed some small part of herself, perhaps the alien will come back. But instead there is only silence and the moon gleaming on the empty gravel.  Fisher  Everyone in the colony is slowly dying, save Fisher. He suspects his immunity is a sign of his guilt. He is the new typhoid Mary: asymptomatic and always suspiciously present. He eats only nutrition capsules and does not handle the food or animals. He walks while covered in latex gloves, hazmat suits and sanitizes constantly. If the others blame him, they do not let on and instead insist that he learn how to operate the colony in their inevitable absence.  No new immigrants will come, not until the disease is quarantined and eradicated. The computers and robots and Fisher will need to carry on, long enough to stave off the extinction. When each colonist dies, the others strip the body and place it outside the clear walls of the compound. No one is buried or incinerated. Rather, a pile of dehydrated corpses piles up in view of the corn fields where the wild deer graze. No single human matters, only the responsibility to the birds, amphibians, lizards and mammals which were saved and transplanted.  “We never intended to stay, you know,” Fisher’s mother tells him. “We just thought . . . a foothold. Something to get us started.”  Fisher knows that one day all the colonists save him will be dead and he will be consigned to carrying on alone. Earth will send him one companion each year and he will fall in love with him or her each time but he or she will die and another one sent. He will have to be brave enough each time, hoping that this one is different.  He reaches into the water and lets the fish glide by. If one looks long enough, one can see a pattern in any movement but it does not mean you can change it. Still, he believes one day someone will arrive who is strong enough to adapt to the path on which he or she finds herself. One day someone will open the shuttle bay door and be the person with whom Kirk can settle down and live a long, fruitful life. Helena Bell is an occasional poet, writer, and international traveler which means that over half of what she says is completely made up, the other half is probably made up, and the third half is about the condition of the roads. She has a BA, an MFA, a JD, and a Tax LLM which fulfills her life long dream of having more letters follow her name than are actually in it. Her work has appeared or is forthcoming in Shimmer Magazine, Brain Harvest, and Rattle.", "text": "2950 words, short story\nAll the Young Kirks and Their Good Intentions\n2249 A.D.\nAll the young Kirks in Riverside Public High School are assigned to the same Homeroom class. They sit together in the back corner on the far side from the door. They speak only to each other.\nThe young Kirk on the Moon goes to school with no one. Each of the colonists has a job and he or she is responsible only to the duties of that job. The others call him Fisher instead of James since he spends his days knee deep in the trout pond, allowing the fish to glide between his legs. When the fish become completely inured to his presence, he thrusts his hands into the water and grasps one around the belly. It fights and Fisher holds on. He is supposed to take it out of the water, to throw it into the white bucket by the shore, but Fisher never does. He lets the fish go and when he comes home, with nothing to show for it, his mother expresses her irrevocable disappointment and sends him to bed.\nJamie\nAll the young Kirks in Riverside are in love with Jamie. She wears tight green skirts and impractical shoes. When she crosses and uncrosses her legs all the Kirks, even the girls, turn their heads ever so slightly to watch. Jamie does not have a boyfriend as none of the Kirks are so bold as to admit their feelings to another. Sometimes, when the teacher lectures on the sixth extinction and flashes slides of West African frogs and fungal diseases, Jamie slides the heel of her shoe off and lets it dangle from her toes. She enjoys being wanted, but sometimes imagines instead that she is a girl named Lucy who is allowed to love whomever she chooses without upsetting the balance.\nJamie Kirk has a plan. Every year they send the best and brightest students to the moon to join the colony. She hears there are animals there long dead on earth, and everyone is beautiful and kind and exotic. There will be no other Kirks there to demand she talk and act in a certain way. She will be free.\nThe moon colony is very selective, only one couple from Riverside has ever gone, but Jamie knows she alone of the Kirks will be selected as she is the best, the brightest, the most adored. The other Kirks will beg her to bring them too as her one true love and companion. They will fight amongst themselves to see which of them is the most worthy, and Captain, or perhaps Jimmy, or Tiberia of the surreptitious movements, will win. When she is about to consent, a gleaming stranger with skin brighter than fresh fallen snow will appear as there is always a twist in these kinds of dreams.\nJamie is in love with the Challenger. She has been in love with him/her since the first night she climbed to the top of her parents’ barn and saw him/her walking on the road leading away from the river. Jamie believes the Challenger must be a creature of magic: the embodiment of hope and freedom who walks the roads alone because he/she is unafraid of the nighttime creatures, of the illnesses which travel on the air. Jamie suspects The Challenger is an alien, an unknown race who wanders the dark roads for someone worthy of his/her company. Jamie is worthy. Jamie is worthy of all.\nBut Jamie cannot tell any of the others about the stranger as they are all in love with her and she must pretend to not be in love with them all equally. To balance between the sharp edges of desire and duty to her companions is a very Kirk-like thing to do. And so she waits.\nT\nAll the young Kirks ride their bicycles to the Wal-Mart parking lot after school. They draw straws to see which of them will go inside and attempt to buy a case of beer. Though he does not know how, T’s straw is always the shortest. Captain hands him a wad of sweaty, five-dollar bills and wishes him luck. With a confidence which is not his own, T walks in and slams the beer and the money on the counter.\n“Go home,” the cashier says.\n“Please,” T says. “Just once.”\nThe cashier shakes his head.\nWhen T comes out, empty handed, Captain sighs and goes in himself.\n“You just have to know how to talk to them,” Captain says.\n“Yeah,” Jimmy says. “It’s all in the attitude.”\nCaptain hands the cans out in order of his favorites. T is always last, and he always refuses to take it. “I don’t drink shit.”\nCaptain smiles. “Now I see. You’re choosing not to buy it each time. Making an executive decision, saving us from this foul-tasting beverage.”\nT shrugs. “Think what you want.”\nT suspects that the cashier and Captain have a secret arrangement designed to humiliate T in front of Jamie and everyone else. He fears that one day Captain will kick him out of the group entirely unless he can find a way to be useful. One night, as they ride home, T tells Captain that there’s a tree on T’s property from which, with a telescope, one can see into Jamie’s bedroom window.\n“I know,” Captain says. “You can see into Red’s too,” and with a grin, rides off.\nRed\nRed has a job at the local Wal-Mart. She is the only one of the Riverside Kirks to have dropped out of school and seek employment elsewhere. She saves every cent and one day will buy a steamboat ticket to anywhere out of Iowa. She does not care about the moon or space or destiny. She loves her family and cheers for the local team at football games, but there is a deep restlessness in her feet. Each night she wakes from her dreams to find herself knee deep in the English River with her nightgown and underclothes floating away downstream. She doesn’t tell anyone of her plan to escape, least of all her brother T who will see it as yet another rejection. She suspects her presence is the only thing which protects him from the other Kirks. One day they will discover his birthday is not March 22, but 2 minutes past. She does not know what will happen then, but does not trust the calculated laziness in Captain’s eyes, or the pounding of Jimmy’s fists, or Jamie’s nonchalance, or any of the others whose only concern is moving in perfect synchronization with what is expected of them.\nIt must be the thought of her brother, the need to protect him which wakes her before she can dive into the deep part of the river and float away forever.\nWalking back on the long dirt road Red feels her skin tingling in the moonlight and she knows that any boy looking out from his window will think she is a white stag or changeling or star. She hopes he falls in love with her so one day, when she is gone from this place, there will be an idea of her that takes root and grows. Perhaps in this way enough of her spirit will remain behind to cocoon her brother. Perhaps when she is gone he will fill into some of her Kirkness, enough to belong. Enough that the others will not push him away.\nWater is always the problem, Red thinks. It moves and carries where it will. Red caresses the open sores on her legs, and the infections taking root therein. She wishes her sleeping brain had the sense to put on waders before stepping out the door but knows that contagion is an inevitable condition. If not the river, then the rain, then the tap, then the bottled water they import from the Delta in exchange for organic crops. At Wal-Mart she prepares the sleeping lofts where the outlying farmers will come to live when the river floods. No one builds for permanence anymore and she marvels at the other Kirks insistence on pattern.\nEvery day her brother comes in attempting to buy beer. Every day he fails.\n“Why,” she asks T.\n“If I don’t, they’ll kick me out.”\n“Why,” she later asks the cashier.\n“Have you seen the crap floating around in one of those cans?”\n“But Captain?”\n“Little prick deserves whatever salmonella he catches.”\nIn the winter months, Red returns to school and sits with the other Kirks in the back corner but she is ever so slightly out of step. While the others gaze longingly at the mauve pump dangling inches away from Jamie’s instep, Red is leaning back to examine the topographic maps on the walls. The Mississippi stretches from floor to ceiling, its many tributaries and old beds undulating in multi-colored bands. The teacher watches her and after class guides her hand up one stream and down the other.\n“This is where we lined it with concrete to save the port, this is where it jumped its banks. This is where we think it may go, and where we now try to guide it.”\nHis hand on her wrist and the inside of her arm is insistent and imploring. “You can’t control a river forever. It goes where it wants. Or goes where it does not want, just to spite you.”\nRed pulls back, the backs of her legs tingling with flashes of hot then cold. In the bathroom she pulls up her pant leg and dabs at the cracked scabs. She considers telling the nurse, but there’s not much to be done. She will be dead by summer, like so many others before her.\nDuring her evening shift, Red tells the cashier she’ll make out with him if he agrees to sell T the beer.\n“Just once,” she adds.\nThe cashier shrugs. “You’re not my type, but if it means that much to you.”\nT\nT’s mother says names have power. They are invasive, like a white fungus, a vine, a jumping carp. Names can take hold, changing the host and adapting it to become the perfect carrier. Why name your son and daughter after an ordinary person: Martha, George, John, Abigail when you can name your children something which will inspire them to a greatness which is not their own, but could be?\nT suspects his mother failed him by having twins. If names have power, then surely that power can be diluted. Not all the Kirks are equal. Jamie is the one with whom they are all in love. Captain is the one who can charm. James is particularly good with guns. Jimmy is the bully, but he is strong and fair when it comes to the other Kirks, most of the time. Tiberius and Tiberia are lithe as willow branches and quick as rabbits. Once they claimed to have seen a falcon swooping down upon the highway, and if anyone has eyes fast enough to catch an extinct bird, they do. Jimmy K and Kirkland don’t speak much, but when they do it is measured and wise. What weaknesses he has identified in himself, T sees converted into strengths in others. They are like wandering palms in some ancient forest, constantly moving into the light. He alone feels himself slowly falling down. What space he used to occupy shall be trod over by many soft, green-leaved feet.\nOne afternoon Captain hands T the cash and slaps him on the back. “This time, try not to fail.”\nWhen he walks in the cashier heads him off. “Compliments of your sister,” he says and hands T a bottle of whiskey.\nT is convinced that this is yet another ploy to humiliate him though he does not know how except for the suspicion that everything in his life is a mere contrivance to expose his weaknesses. When he reaches the group, Captain holds out his hand for the bottle but T ignores him. He opens it and hands it to Jimmy. It goes around and around, until finally someone hands it back to T, empty.\nT shrugs. “Hasn’t tasted right since Scotland went under anyway.”\n“How the fuck would you know?” someone says.\nT doesn’t answer, but looks up at the sky. The sun has gone down and they all shiver in the cooling air. It will be difficult riding back in the dark, with loose stones and jostling cyclists on the road. One of them could take him out, if they perceived him as a threat or a mere annoyance. Jimmy might take him out just ’cause. For once the thought doesn’t scare him and he realizes that knowing death is certain and not caring is his first Kirk-like thought. Maybe the clock at the hospital was wrong; maybe his mother was right.\n“Same way he knows everything,” Captain says. “He pretends. He thinks he’s better, different, special. But he’s not. He’s just the same as any one of us.”\nT smiles back. “Think what you want,” he says.\nNo one attacks him on the way home, but T knows it is only a matter of time. None of them are safe; they are not a team and were never meant to be.\nJamie\nThe colony will select new immigrants any day now. Applications have been submitted: education, skills, physical exams. Jamie waits and waits while fending off the advances of the other Kirks.\n“We will fly to the moon, you and I,” Captain says. “They let you take a companion, and I will always choose you.”\nWeeks go by, months. Rumors spread that an illness has delayed the selection process and the most likely candidates will have advanced degrees in human physiology and evolutionary biology. Jamie doesn’t worry as she knows she is the perfect example of youth and health and they will want her for these attributes alone.\nWhen the spring floods begin most of the Kirks begin to pair off: Kirkland comforts T after his sister’s funeral and rather than calling her a slut, the other girls begin turning to her for advice. When Jamie shifts her legs in class, fewer and fewer Kirks turn their heads. Jamie’s skirts become shorter and shorter until eventually the teacher pulls her aside and gives her a sweatshirt to tie around her waist.\n“The noise your flesh makes when it sticks to the seat is distracting. This will help.”\nJamie pouts and twirls her hair in her fingers. “Is that the only thing about it which is distracting?”\n“Yes. Now go sit down.”\nJamie believes when the floods recede everything will go back to normal. But it doesn’t. Even her white-skinned alien has abandoned her, and no longer walks along the road by her house. She begins to doubt she ever saw him/her at all.\nOnly Captain favors Jamie openly and she pretends to favor him back to spite the others. She lets his hand wander up her leg and kisses him when the others are looking. She tells herself she is only salvaging her plan when she allows him to undress her in the dark. She is only recapturing her essence when he moves against her. But she feels nothing when he murmurs that their souls are mere whispers in the dark. She is robotic in her movements and she feels Captain, the other Kirks, the alien, her entire world slipping away from her. When they finish, Jamie goes back to the roof hoping that now she has sacrificed some small part of herself, perhaps the alien will come back. But instead there is only silence and the moon gleaming on the empty gravel.\nFisher\nEveryone in the colony is slowly dying, save Fisher. He suspects his immunity is a sign of his guilt. He is the new typhoid Mary: asymptomatic and always suspiciously present. He eats only nutrition capsules and does not handle the food or animals. He walks while covered in latex gloves, hazmat suits and sanitizes constantly. If the others blame him, they do not let on and instead insist that he learn how to operate the colony in their inevitable absence.\nNo new immigrants will come, not until the disease is quarantined and eradicated. The computers and robots and Fisher will need to carry on, long enough to stave off the extinction. When each colonist dies, the others strip the body and place it outside the clear walls of the compound. No one is buried or incinerated. Rather, a pile of dehydrated corpses piles up in view of the corn fields where the wild deer graze. No single human matters, only the responsibility to the birds, amphibians, lizards and mammals which were saved and transplanted.\n“We never intended to stay, you know,” Fisher’s mother tells him. “We just thought . . . a foothold. Something to get us started.”\nFisher knows that one day all the colonists save him will be dead and he will be consigned to carrying on alone. Earth will send him one companion each year and he will fall in love with him or her each time but he or she will die and another one sent. He will have to be brave enough each time, hoping that this one is different.\nHe reaches into the water and lets the fish glide by. If one looks long enough, one can see a pattern in any movement but it does not mean you can change it. Still, he believes one day someone will arrive who is strong enough to adapt to the path on which he or she finds herself. One day someone will open the shuttle bay door and be the person with whom Kirk can settle down and live a long, fruitful life.\nHelena Bell is an occasional poet, writer, and international traveler which means that over half of what she says is completely made up, the other half is probably made up, and the third half is about the condition of the roads. She has a BA, an MFA, a JD, and a Tax LLM which fulfills her life long dream of having more letters follow her name than are actually in it. Her work has appeared or is forthcoming in Shimmer Magazine, Brain Harvest, and Rattle.", "source": "https://clarkesworldmagazine.com/bell_02_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: All the Young Kirks and Their Good Intentions by Helena Bell"}