{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Kage Baker", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "SDuXpFs+obYzki+MCpzxQof4iQg=", "id": null, "license": null, "comments": "", "raw_text": "7830 words, novelette, REPRINT  Noble Mold  For a while I lived in this little town by the sea. Boy, it was a soft job. Santa Barbara had become civilized by then: no more Indian rebellions, no more pirates storming up the beach, nearly all the grizzly bears gone. Once in a while some bureaucrat from Mexico City would raise hell with us, but by and large the days of the old Missions were declining into forlorn shades, waiting for the Yankees to come.  The Company operated a receiving, storage, and shipping terminal out of what looked like an oaken chest in my cell. I had a mortal identity as an alert little padre with an administrative career ahead of him, so the Church kept me pretty busy pushing a quill. My Company duties, though, were minor: I logged in consignments from agents in the field and forwarded communiqués.  It was sort of a forty-year vacation. There were fiestas and fandangos down in the pueblo. There were horse races along the shore of the lagoon. My social standing with the De La Guerra family was high, so I got invited out to supper a lot. And at night, when the bishop had gone to bed and our few pathetic Indians were tucked in for the night, I would sneak a little glass of Communion wine and then relax out on the front steps of the church. There I’d sit, listening to the night sounds, looking down the long slope to the night sea. Sometimes I’d sit there until the sky pinked up in the east and the bells rang for Matins. We Old Ones don’t need much sleep.  One August night I was sitting like that, watching the moon drop down toward the Pacific, when I picked up the signal of another immortal somewhere out there in the night. I tracked it coming along the shoreline, past the point at Goleta; then it crossed the Camino Real and came straight uphill at me. Company business. I sighed and broadcast, Quo Vadis?  Hola, came the reply. I scanned, but I knew who it was anyway. Hi, Mendoza, I signaled back, and leaned up on my elbows to await her arrival. Pretty soon I picked her up on visual, too, climbing up out of the mists that flowed along the little stream; first the wide-brimmed hat, then the shoulders bent forward under the weight of the pack, the long walking skirt, the determined lope of the field operative without transportation.  Mendoza is a botanist, and has been out in the field too long. At this point she’d been tramping around Alta California for the better part of twelve decades. God only knew what the Company had found for her to do out in the back of beyond; I’d have known, if I’d been nosy enough to read the Company directives I relayed to her from time to time. I wasn’t her case officer anymore, though, so I didn’t.  She raised burning eyes to me and my heart sank. She was on a Mission, and I don’t mean the kind with stuccoed arches and tile roofs. Mendoza takes her work way too seriously. “How’s it going, kid?” I greeted her in a loud whisper when she was close enough.  “Okay.” She slung down her pack on the step beside me, picked up my wine and drank it, handed me back the empty glass and sat down.  “I thought you were back up in Monterey these days,” I ventured.  “No. The Ventana,” she replied. There was a silence while the sky got a little brighter. Far off, a rooster started to crow and then thought better of it.  “Well, well. To what do I owe the pleasure, et cetera?” I prompted.  She gave me a sharp look. “Company Directive 080444-C,” she said, as though it were really obvious.  I’d developed this terrible habit of storing incoming Green Directives in my tertiary consciousness without scanning them first. The soft life, I guess. I accessed hastily. “They’re sending you after grapes?” I cried a second later.  “Not just grapes.” She leaned forward and stared into my eyes. “Mission grapes. All the cultivars around here that will be replaced by the varieties the Yankees introduce. I’m to collect genetic material from every remaining vine within a twenty-five-mile radius of this building.” She looked around disdainfully. “Not that I expect to find all that many. This place is a wreck. The Church has really let its agricultural program go to hell, hasn’t it?”  “Hard to get slave labor nowadays.” I shrugged. “Can’t keep ’em down on the farm without leg irons. We get a little help from the ones who really bought into the religion, but that’s about it.”  “And the Holy Office can’t touch them.” Mendoza shook her head. “Never thought I’d see the day.”  “Hey, things change.” I stretched out and crossed my sandaled feet one over the other. “Anyway. The Mexicans hate my poor little bishop and are doing their level best to drive him crazy. In all the confusion with the Missions being closed down, a lot of stuff has been looted. Plants get dug up and moved to people’s gardens in the dark of night. There are still a few Indian families back in some of the canyons, too, and a lot of them have tiny little farms. Probably a lot of specimens out there, but you’ll really have to hunt around for them.”  She nodded, all brisk. “I’ll need a processing credenza. Bed and board, too, and a cover identity. That’s your job. Can you arrange them by 0600 hours?”  “Gosh, this is just like old times,” I said without enthusiasm. She gave me that look again.  “I have work to do,” she explained with exaggerated patience. “It is very important work. I’m a good little machine and I love my work. Nothing is more important than My Work. You taught me that, remember?”  Which I had, so I just smiled my most sincere smile as I clapped her on the shoulder. “And a damned good machine you are, too, I know you’ll do a great job, Mendoza. And I feel that your efficiency will be increased if you don’t rush this job. Take the time to do it right, you know? Mix a little rest and rec into your schedule. After all, you really deserve a holiday, a hard-working operative like you. This is a great place for fun. You could come to one of our local cascaron balls. Dance the night away. You used to like to dance.”  Boy, was that the wrong thing to say. She stood up slowly, like a cobra rearing back.  “I haven’t owned a ballgown since 1703. I haven’t attended a mortal party since 1555. If you’ve chosen to forget that miserable Christmas, I can assure you I haven’t. You play with the damned monkeys, if you’re so fond of them.” She drew a deep breath. “I, myself, have better things to do.” She stalked away up the steps, but I called after her:  “You’re still sore about the Englishman, huh?”  She didn’t deign to respond but shoved her way between the church doors, presumably to get some sleep behind the altar screen where she wouldn’t be disturbed.  She was still sore about the Englishman.  I may have a more relaxed attitude toward my job than some people I could mention, but I’m still the best at it. By the time Mendoza wandered squinting into morning light I had her station set up, complete with hardware, in one of the Mission’s guest cells. For the benefit of my fellow friars she was my cousin from Guadalajara, visiting me while she awaited the arrival of her husband from Mexico City. As befitted the daughter of an old Christian family, the senora was of a sober and studious nature, and derived much innocent pleasure from painting flowers and other subjects of natural history.  She didn’t waste any time. Mendoza went straight out to what remained of the Mission vineyard and set to work, clipping specimens, taking soil samples, doing all those things you’d have to be an obsessed specialist to enjoy. By the first evening she was hard at work at her credenza, processing it all.  When it came time to loot the private gardens of the Gentes de Razon her social introductions went okay, too, once I got her into some decent visiting clothes. I did most of the talking to the Ortegas and Carrillos and the rest, and the fact that she was a little stiff and silent while taking grape brandy with them could easily be explained away by her white skin and blue veins. If you had any Spanish blood you were sort of expected to sneer about it in that place, in those days.  Anyway it was a relief for everybody when she’d finished in the pueblo and went roving up and down the canyons, pouncing on unclaimed vines. There were a few Indians settled back in the hills, ex-neophytes scratching out a living between two worlds, on land nobody else had wanted. What they made of this woman, white as their worst nightmares, who spoke to them in imperious and perfectly accented Barbareno Chumash, I can only imagine. However she persuaded them, though, she got samples of their vines too. I figured she’d soon be on her way back to the hinterlands, and had an extra glass of Communion wine to celebrate. Was that ever premature!  I was hearing confessions when her scream of excitement cut through the subvocal ether, followed by delighted profanity in sixteenth-century Galician. My parishioner went on:  “ . . . which you should also know, Father, was that I have coveted Juana’s new pans. These are not common iron pans but enamelware, white with a blue stripe, very pretty, and they came from the Yankee trading ship. It disturbs me that such things should imperil my soul.”  Joseph! Joseph! Joseph!  “It is good to be concerned on that account, my child.” I shut out Mendoza’s transmission so I could concentrate on the elderly mortal woman on the other side of the screen. “To covet worldly things is very sinful indeed, especially for the poor. The Devil himself sent the Yankees with those pans, you may be certain.” But Mendoza had left her credenza and was coming down the arcade in search of me, ten meters, twenty meters, twenty-five . . . “For this, and for your sinful dreams, you must say thirty Paternosters and sixty Ave Marias . . . ” Mendoza was coming up the church steps two at a time . . . “Now, recite with me the Act of Contrition—”  “Hey!” Mendoza pulled back the door of the confessional. Her eyes were glowing with happiness. I gave her a stern look and continued the Act of Contrition with my somewhat disconcerted penitent, so Mendoza went out to stride up and down in front of the church in her impatience.  “Don’t you know better than to interrupt me when I’m administering a sacrament?” I snapped when I was finally able to come out to her. “Some Spaniard you are!”  “So report me to the Holy Office. Joseph, this is important. One of my specimens read out with an F-M Class One rating.”  “And?” I put my hands in my sleeves and frowned at her, refusing to come out of the role of offended friar.  “Favorable Mutation, Joseph, don’t you know what that means? It’s a Mission grape with a difference. It’s got Saccharomyces with style and Botrytis in rare bloom. Do you know what happens when a field operative discovers an F-M Class One, Joseph?”  “You get a prize,” I guessed.  “Si señor!” She did a little dance down the steps and stared up at me in blazing jubilation. I hadn’t seen her this happy since 1554. “I get a Discovery Bonus! Six months of access to a lab for my own personal research projects, with the very finest equipment available! Oh joy, oh rapture. So I need you to help me.”  “What do you need?”  “The Company wants the parent plant I took the specimen from, the whole thing, root and branch. It’s a big vine, must have been planted years ago, so I need you to get me some Indians to dig it up and bring it back here in a carreta. Six months at a Sciences Base, can you imagine?”  “Where did you get the specimen?” I inquired.  She barely thought about it. “Two kilometers south-southeast. Just some Indian family back in the hills, Joseph, with a hut in a clearing and a garden. Kasmali, that was what they called themselves. You know the family? I suppose we’ll have to pay them something for it. You’ll have to arrange that for me, okay?”  I sighed. Once again the kindly padre was going to explain to the Indian why it was necessary to give up yet another of his belongings. Not my favorite role, all things considered.  But there we were that afternoon, the jolly friar and his haughty cousin, paying a call on the Kasmali family.  They were good parishioners of mine, the old abuela at Mass every day of the week, rain or shine, the rest of the family lined up there every Sunday. That was a lot to expect of our Indians in this day and age. They were prosperous, too, as Indians went: they had three walls of a real adobe house and had patched in the rest with woven brush. They had terraced their tiny hillside garden and were growing all kinds of vegetables on land not fit for grazing. There were a few chickens, there were a few little brown children chasing them, there were a few cotton garments drying on the bushes. And, on the crest of the hill, a little way from the house, there was the vineyard: four old vines, big as trees, with branches spreading out to shade most of an acre of land.  The children saw us coming and vanished into the house without a sound. By the time we reached the top of the winding stony path, they had all come out and were staring at us: the toothless old woman from daily Mass, a toothless old man I did not know, the old son, the two grown grandsons, their wives, and children of assorted ages. The elder of the grandsons came forward to greet us.  “Good evening, little Father.” He looked uneasily at Mendoza. “Good evening, lady.”  “Good evening, Emidio.” I paused and pretended to be catching my breath after the climb, scanning him. He was small, solidly built, with broad and very dark features; he had a stiff black moustache. His wide eyes flickered once more to Mendoza, then back to me. “You have already been introduced to my cousin, I see.”  “Yes, little Father.” He made a slight bow in her direction. “The lady came yesterday and cut some branches off our grapevines. We did not mind, of course.”  “It is very kind of you to permit her to collect these things.” I eyed Mendoza, hoping she’d been tactful with them.  “Not at all. The lady speaks our language very well.”  “That is only courtesy, my son. Now, I must tell you that one of your vines has taken her fancy, for its extraordinary fruit and certain virtues in the leaves. We have come back here today, therefore, to ask you what you will accept for that near vine at the bottom of the terrace.”  The rest of the family stood like statues, even the children. Emidio moved his hands in a helpless gesture and said, “The lady must of course accept our gift.”  “No, no,” said Mendoza. “We’ll pay you. How much do you want for it?” I winced.  “She must accept the gift, please, Father.” Emidio’s smile was wretched.  “Of course she shall,” I agreed. “And, Emidio, I have a gift I have been meaning to give you since the feast of San Juan. Two little pigs, a boar and a sow, so they may increase. When you bring down the vine for us you may collect them.”  The wives lifted up their heads at that. This was a good deal. Emidio spread out his hands again. “Of course, little Father. Tomorrow.”  “Well, that was easy,” Mendoza remarked as we picked our way down the hill through the chaparral. “You’re so good with mortals, Joseph. You just have to treat Indians like children, I guess, huh?”  “No, you don’t,” I sighed. “But it’s what they expect you to do, so they play along.” There was more to it than that, of course, but something else was bothering me. I had picked up something more than the usual stifled resentment when I had voiced my request: someone in the family had been badly frightened for a second. Why? “You didn’t do anything to, like, scare those people when you were there before, did you, Mendoza? Didn’t threaten them or anything, did you?”  “Heavens, no.” She stopped to examine a weed. “I was quite polite. They weren’t comfortable around me, actually, but then mortals never are. Look at this! I’ve never seen this blooming so late in the year, have you?”  “Nice.” I glanced at it. I don’t know from plants. I know a lot about mortals, though.  So I was surprised as hell next day when Emidio and his brother appeared at the Mission, trundling a cart full of swaying leaves into the open space by the fountain. I went out to greet them and Mendoza was behind me like a shadow. She must have been prowling her room, listening for the squeak of wheels.  “This is very good, my sons, I am proud of you—” I was saying heartily, when Mendoza transmitted a blast of subvocal fury.  Damn it, Joseph, this is wrong! These are just clippings, they haven’t brought the whole vine!  “—but I perceive there has been a misunderstanding,” I continued. “My cousin requested the vine itself, with its roots, that she may replant it. You have brought only cut branches, apparently.” The Indians exchanged glances.  “Please forgive us, little Father. We did not understand.” They set down the traces and Emidio reached into the back. “We did bring all the grapes that were ripe. Maybe it was these the lady wanted?” And he proffered a big woven dish of grapes. I looked close and noticed they did have a funny look to them, a bloom on the skin so heavy it was almost . . . furry?  “No,” said Mendoza, in clearest Chumash. “Not just the grapes. I want the vine. The whole plant. You need to dig it up, roots and all, and bring it here. Do you understand now?”  “Oh,” said Emidio. “We’re very sorry. We didn’t understand.”  “But you understand now?” she demanded.  “I am certain they do,” I said smoothly. “What remarkable grapes these are, my sons, and what a beautiful basket! Come in and rest in the shade, my sons, and have a cool drink. Then we will go catch one of the little pigs I promised you.”  By the time we got back, Mendoza had vanished; the grapes and the vine cuttings were gone too. The brothers trudged away up the hill with their cart and one squealing shoat, his legs bound with twine. Pig Number Two remained in the Mission pen, to be paid on delivery of the vine. I figured if the wives got that message they’d see to it the job got done.  Mendoza came out when they were gone. She looked paler than usual. She handed me a sheet of paper from her credenza. “This is a Priority Order,” she told me. “I sent them the codes on the grapes and clippings anyway, but it’s not enough.”  I read the memo. She wasn’t kidding; it was a first-class trans-departmental Priority Gold telling me I was to do everything in my power to facilitate, expedite and et cetera. “What have we got here, anyway, cancer cures from grapes?” I speculated.  “You don’t need to know and neither do I,” said Mendoza flatly. “But the Company means business now, Joseph. We must get that vine.”  “We’ll get it tomorrow,” I told her. “Trust me.”  Next day, same hour, the brothers came with hopeful smiles and a big muddy mess of a vine trailing out of their cart. Such relief! Such heartfelt praise and thanks the kindly friar showered on his obedient sons in Christ! Mendoza heard their arrival and came tearing out into the courtyard, only to pull up short with an expression of baffled rage.  THAT’S NOT THE VINE! she transmitted, with such intensity I thought for a second we were having an earthquake.  “ . . . And yet, my sons, I am afraid we have not understood each other once again,” I went on wearily. “It appears that, although you have brought us a whole vine, you have not brought the particular vine that was specifically asked for by my cousin.”  “We are so sorry,” replied Emidio, averting his eyes from Mendoza. “How stupid we were! But, Father, this is a very good vine. It’s in much better condition than the other one and bears much prettier grapes. Also, it was very difficult to dig it all up and we have brought it a long way. Maybe the lady will be satisfied with this vine instead?”  Mendoza was shaking her head, not trusting herself to speak, although the air around her was wavering like a mirage. Hastily I said:  “My dearest sons, I am sure it is an excellent vine, and we would not take it from your family. You must understand that it is the other vine we want, the very one you brought cuttings from yesterday. That vine and no other, and all of that vine. Now, you have clearly worked very hard and in good faith, so I will certainly send you home with your other pig, but you must come back tomorrow with the right vine.”  The brothers looked at each other and I picked up a flash of despair from them, and some weird kind of fear too. “Yes, little Father,” they replied.  But on the next day they didn’t come at all.  Mendoza paced the arcade until nine in the evening, alarming the other friars. Finally I went out to her and braced myself for the blast.  “You know, you lost yourself two perfectly good pigs,” she informed me through gritted teeth. “Damned lying Indians.”  I shook my head. “Something’s wrong here, Mendoza.”  “You bet something’s wrong! You’ve got a three-day delay on a Priority Gold.”  “But there’s some reason we’re not getting. Something is missing from this picture . . . ”  “We never should have tried to bargain with them, you know that? They offered it as a gift in the first place. We should have just taken it. Now they know it’s really worth something! I’ll go up there with a spade and dig the damned vine up myself, if I have to.”  “No! You can’t do that, not now. They’ll know who took it, don’t you see?”  “One more crime against the helpless Indians laid at the door of Spain. As if it mattered any more!” Mendoza turned on her heel to stare at me. Down at the other end of the arcade one of my brother friars put his head out in discreet inquiry.  It does matter! I dropped to a subvocal hiss. It matters to them and it matters to me! I call them my beloved sons, but they know I’ve got the power to go up there and confiscate anything they have on any excuse at all because that’s how it’s always been done! Only I don’t. They know Father Rubio won’t do that to them. I’ve built up a cover identity as a kindly, honorable guy because I’ve got to live with these people for the next thirty years! You’ll get your damn specimen and go away again into the sagebrush, but I’ve got a character to maintain!  My God, she sneered, He wants his little Indians to love him.  Company policy, baby. It’s easier to deal with mortals when they trust you. Something you used to understand. So just you try screwing with my cover identity! Just you try it and see what happens.  She widened her eyes at that, too furious for words, and I saw her knuckles go white; little chips of whitewash began falling from the walls. We both looked up at them and cooled down in a hurry.  Sorry. But I mean what I say, Mendoza. We handle this my way.  She threw her hands up in the air. What are you going to do, then, smart guy? You have to do something.  Day four of the Priority Gold, and Company Directive 081244-A anxiously inquired why no progress on previous transdepartmental request for facilitation?  Situation Report follows, I responded. Please stand by. Then I put on my walking sandals and set off up the canyon alone.  Before I had toiled more than halfway, though, I met Emidio coming in my direction. He didn’t try to avoid me, but as he approached he looked down the canyon past me in the direction of the Mission. “Good morning, little Father,” he called.  “Good morning, my son.”  “Is your cousin lady with you?” He dropped his voice as he drew close.  “No, my son. We are alone.”  “I need to speak with you, little Father, about the grapevine.” He cleared his throat. “I know the lady must be very angry, and I am sorry. I don’t mean to make you angry too, little Father, because I know she is your cousin—”  “I understand, my son, believe me. And I am not angry.”  “Well then.” He drew a deep breath. “This is the matter. The grapevines do not belong to me, nor to my father. They belong to our grandfather Diego. And he will not let us dig up the vine the lady wants.”  “Why will he not?”  “He won’t tell us. He just refuses. Don’t be stupid, we told him. Father Rubio has been good to us, he has treated us fairly. Look at the fine pigs he has given us, we said. He just sits in the sun and rocks himself, and refuses us. And our grandmother came and touched his feet and cried, though she didn’t say anything, but he wouldn’t even look at her.”  “I see.”  “We have said everything we could say to him, but he will not let us dig up that vine. We tried to fool the lady twice by pretending to make mistakes (and that was a sin, little Father, and I’m sorry), but it didn’t work. Somehow she knew. Then our grandfather—” he paused in obvious embarrassment. “I don’t know how to say this, little Father—you know the old people are superstitious and still believe foolish things—I think he somehow has the idea that your cousin lady is a nunasis. Please don’t take this the wrong way—”  “No, no, go on—”  “We have an old story about a spirit who walks on the mountains and wears a hat like hers, you see, throwing a shadow cold as death. I know it’s stupid. Even so, Grandfather won’t let us dig up that vine. Now, you might say, our grandfather is only an old man and a little bit crazy now, and we’re strong, so he can be put aside as though he were a little baby; but if we did that, we would be breaking the commandment about honoring the old people. It seems to us that would be a worse sin than the white lady not getting what she wanted. What do you think, little Father?”  Boy, oh, boy. “This is very hard, my son,” I said, and I meant it. “But you are right.”  Emidio studied me in silence for a long moment, his eyes narrowed. “Thank you,” he said at last. After another pause he added, “Is there anything we can do that will make the lady happy? She’ll be angry with you, now.”  I found myself laughing. “She will make my life a Purgatory, I can tell you,” I said. “But I will offer it up for my sins. Go home, Emidio, and don’t worry. Perhaps God will send a miracle.”  I wasn’t laughing when I got back to the Mission, though, and when Mendoza came looking for me she saw my failure right away.  “No dice, huh?” She squinted evilly. “Well. This is no longer a matter of me and my poor little bonus now, Joseph. The Company wants that vine. I suggest you think of something fast or there are liable to be some dead Indians around here soon, pardon my indelicate phrasing.”  “I’m working on it,” I told her.  And I was. I went to the big leatherbound books that held the Mission records. I sat down in a corner of the scriptorium and went over them in minute detail.  1789—here was the baptism of Diego Kasmali, age given as thirty years. 1790, marriage to Maria Conception, age not given. 1791 through 1810, a whole string of baptisms of little Kasmalis: Agustin, Xavier, Pablo, Juan Bautista, Maria, Dolores, Guadalupe, Dieguito, Marta, Tomas, Luisa, Bartolomeo. First Communion for Xavier Kasmali, 1796. One after the other, a string of little funerals: Agustin age two days, Pablo age three months six days, Juan Bautista age six days, Maria age two years . . . too sad to go on down the list, but not unusual. Confirmation for Xavier Kasmali, 1802. Xavier Kasmali married to Juana Catalina of the Dos Pueblos rancheria, age 18 years, 1812. Baptism of Emidio Kasmali, 1813. Baptism of Salvador Kasmali, 1814. Funeral of Juana Catalina, 1814. First Communions, Confirmations, Marriages, Baptisms, Extreme Unctions . . . not a sacrament missed. Really good Catholics.  Why the old, old woman was at Mass every single day of the year, rain or shine, though she was propped like a bundle of sticks in the shadows at the back of the church. Maria Conception, wife of Diego Kasmali. But Diego never, ever at Mass. Why not? On a desperate hunch I went to my transmitter and typed in a request for something unusual.  The reply came back: Query: first please resolution Priority Gold status?  Request relates Priority, I replied. Resolving now. Requisition Sim ParaN Phenom re: Priority resolution?  That gave them pause. They verified and counterverified my authority, they re-scanned the original orders and mulled over their implications. At least, I guessed they were doing that, as the blue screen flickered. Feeling I had them on the run, I pushed for a little extra, just for my own satisfaction: Helpful Priority specify mutation. What? Why?  Pause while they verified me again, then the bright letters crawled onscreen in a slow response:  Patent Black Elysium.  I fell back laughing, though it wasn’t exactly funny. The rest of the message followed in a rapid burst: S-P Requisition approved. Specify Tech support?  I told them what I needed.  Estimate resolution time Priority Gold?  I told them how long it would take.  Expecting full specimen consign & report then, was the reply, and they signed off.  “Why don’t they ever put convenient handles on these things?” grumbled Mendoza. She had one end of the transport trunk and a shovel; I had the other end of the trunk and the other shovel. It was long after midnight and we were struggling up the rocky defile that led to the Kasmali residence.  “Too much T-field drag,” I explained.  “Well, you would think that an all-powerful cabal of scientists and businessmen, with advance knowledge of every event in recorded history and infinite time in which to take every possible advantage of said events, and every possible technological resource at their command, and unlimited wealth—” Mendoza shifted the trunk again and we went on “—you’d think they could devise something as simple as a recessed handle.”  “They tried it. The recess cuts down on the available transport space inside,” I told her.  “You’re kidding me.”  “No. I was part of a test shipment. Damn thing got me right in the third cervical vertebra.”  “I might have known there’d be a reason.”  “The Company has a reason for everything, Mendoza.”  We came within earshot of the house, so conversation ended. There were three big dogs in the yard before the door. One slept undisturbed, but two raised their heads and began to growl. We set down the mink. I opened it and from the close-packed contents managed to prize out the hush unit. The bigger of the dogs got to his feet, preparing to bark.  I switched on the unit. Good dog, what a sleepy doggie; he fell over with a woof and did not move again. The other dog dropped his head on his paws. Dog Number Three would not wake at all now, nor would any of the occupants of the house, not while the hush field was being generated.  I carried the unit up to the house and left it by the dogs, Mendoza dragging the trunk after me. We removed the box of golden altar vessels and set off up the hill with it.  The amazing mutated vine was pretty sorry-looking now, with most of its branches clipped off in the attempt to appease Mendoza. I hoped to God their well-meaning efforts hadn’t killed it. Mendoza must have been thinking the same thing, but she just shrugged grimly. We began to dig.  We made a neat hole, small but very deep, just behind the trunk and singled slightly under it. There was no way to hide our disturbance of the earth, but fortunately the ground had already been so spaded up and trampled over that our work shouldn’t be that obvious.  “How deep does this have to be?” I panted when we had gone about six feet and I was in the bottom passing spadefuls up to Mendoza.  “Not much deeper; I’d like it buried well below the root ball.” She leaned in and peered.  “Well, how deep is that?” Before she could reply my spade hit something with a metallic clank. We halted.  Mendoza giggled nervously. “Jesus, don’t tell me there’s already buried treasure down there!”  I scraped a little with the spade. “There’s something like a hook,” I said. “And something else,” I got the spade under it and launched it up out of the hole with one good heave. The whole mass fell on the other side of the dirt heap, out of my view. “It looked kind of round,” I remarked.  “It looks kind of like a hat—” Mendoza told me cautiously, bending down and turning it over. Abruptly she yelled and danced back from it. I scrambled up out of the hole to see what was going on.  It was a hat, all right, or what was left of it; one of the hard-cured leather kind Spain had issued to her soldiers in the latter half of the last century. I remembered seeing them on the presidio personnel. Beside the hat, where my spade-toss had dislodged it, was the head that had been wearing it. Only a brown skull now, the eyes blind with black earth. Close to it was the hilt of a sword, the metallic thing I’d hit.  “Oh, gross!” Mendoza wrung her hands.  “Alas, poor Yorick,” was all I could think of to say.  “Oh, God, how disgusting. Is the rest of him down there?”  I peered down into the hole. I could see a jawbone and pieces of what might have been cavalry boots. “Looks like it, I’m afraid.”  “What do you suppose he’s doing down there?” Mendoza fretted, from behind the handkerchief she had clapped over her mouth and nose.  “Not a damn thing nowadays,” I guessed, doing a quick scan of the bones. “Take it easy: no pathogens left. This guy’s been dead a long time.”  “Sixty years, by any chance?” Mendoza’s voice sharpened.  “They must have planted him with the grapevine,” I agreed. In the thoughtful silence that followed I began to snicker. I couldn’t help myself. I leaned back and had myself a nice sprawling guffaw.  “I fail to see what’s so amusing,” said Mendoza.  “Sorry. Sorry. I was just wondering: do you suppose you could cause a favorable mutation in something by planting a dead Spaniard under it?”  “Of course not, you idiot, not unless his sword was radioactive or something.”  “No, of course not. What about those little wild yeast spores in the bloom on the grapes, though? You think they might be influenced somehow by the close proximity of a gentleman of Old Castile?”  “What are you talking about?” Mendoza took a step closer.  “This isn’t a cancer cure, you know.” I waved my hand at the vine-stock, black against the stars. “I found out why the Company is so eager to get hold of your Favorable Mutation, kid. This is the grape that makes Black Elysium.”  “The dessert wine?” Mendoza cried.  “The very expensive dessert wine. The hallucinogenic-controlled-substance dessert wine. The absinthe of the twenty-fourth century. The one the Company holds the patent on. That stuff. Yeah.”  Stunned silence from my fellow immortal creature. I went on:  “I was just thinking, you know, about all those decadent technocrats sitting around in the future getting bombed on an elixir produced horn . . . ”  “So it gets discovered here, in 1844,” said Mendoza at last. “It isn’t genetically engineered cultivar at all. And the wild spores somehow came from . . . ?”  “But nobody else will ever know the truth, because we’re removing every trace of this vine from the knowledge of mortal men, see?” I explained. “Root and branch and all.”  “I’d sure better get that bonus,” Mendoza reflected.  “Don’t push your luck. You aren’t supposed to know.” I took my shovel and clambered back into the hole. “Come on, let’s get the rest of him out of here. The show must go on.”  Two hours later there was a tidy heap of brown bones and rusted sled moldering away in a new hiding place, and a tidy sum in gold plate occupying the former burial site. We filled in the hole, set up the rest of the equipment we’d brought, tested it, camouflaged it, turned it on and hurried away back down the canyon to the Mission, taking the hush unit with us. I made it in time for Matins.  News travels fast in a small town. By nine there were Indians, and some of the Gentes de Razon too, running in from all directions to tell us that I he Blessed Virgin had appeared in the Kasmalis’ garden. Even if I hadn’t known already, I would have been tipped off by the fact that old Maria Conception did not show up for morning Mass.  By the time we got up there, the bishop and I and all my fellow friars and Mendoza, a cloud of dust hung above the dirt track from all the traffic. The Kasmalis’ tomatoes and corn had been trampled by the milling crowd. People ran everywhere, waving pieces of grapevine; the oilier plants had been stripped as bare as the special one. The rancheros watched from horseback, or urged their mounts closer across the careful beds of peppers and beans.  Around the one vine, the family had formed a tight circle. Some of them watched Emidio and Salvador, who were digging frantically, already about five feet down in the hole; others stared unblinking at the floating image of the Virgin of Guadalupe who smiled upon them from midair above the vine. She was complete in every detail, nicely three-dimensional and accompanied by heavenly music. Actually it was a long tape loop of Ralph Vaughan Williams’s Fantasia on a Theme by Thomas Tallis, which nobody would recognize because it hadn’t been composed yet.  “Little Father!” One of the wives caught me by my robe. “It’s the Mother of God! She told us to dig up the vine, she said there was treasure buried underneath!”  “Has she told you anything else?” I inquired, making the sign of the cross. My brother friars were falling to their knees in raptures, beginning to sing the Ave Maria; the bishop was sobbing.  “No, not since this morning,” the wife told me. “Only the beautiful music has gone on and on.”  Emidio looked up and noticed me for the first time. He stopped shoveling for a moment, staring at me, and a look of dark speculation crossed his face. Then his shovel was moving again, clearing away the earth, and more earth, and more earth.  At my side, Mendoza turned away her face in disgust. But I was watching the old couple, who stood a little way back from the rest of the family. They clung to each other in mute terror and had no eyes for the smiling Virgin. It was the bottom of the ever-deepening hole they watched, as birds watch a snake.  And I watched them. Old Diego was bent and toothless now, but sixty years ago he’d had teeth, all right; sixty years ago his race hadn’t yet learned never to fight back against its conquerors. Maria Conception, what had she been sixty years ago when those vines were planted? Not a dried-up shuffling old thing back then. She might have been a beauty, and maybe a careless beauty.  The old bones and the rusting steel could have told you, sixty years ago. Had he been a handsome young captain with smooth ways, or just a soldier who took what he wanted? Whatever he’d been, or done, he’d wound up buried under that vine, and only Diego and Maria knew he was there. All those years, through the children and grandchildren and great-grandchildren, he’d been there. Diego never coming to Mass because of a sin he couldn’t confess. Maria never missing Mass, praying for someone.  Maybe that was the way it had happened. Nobody would ever tell the story, I was fairly sure. But it was clear that Diego and Maria, alone of all those watching, did not expect to see treasure come out of that hole in the ground.  So when the first glint of gold appeared, and then the chalice and altar plate were brought up, their old faces were a study in confusion.  “The treasure!” cried Salvador. “Look!”  And the rancheros spurred their horses through the crowd to get a better look, lashing the Indians out of the way; but I touched the remote hidden in my sleeve and the Blessed Virgin spoke, in a voice as sweet mid immortal as a synthesizer:  “This, my beloved children, is the altar plate that was lost from the Church at San Carlos Borromeo, long ago in the time of the pirates. My beloved Son has caused it to be found here as a sign to you all that ALL SINS ARE FORGIVEN!”  I touched the remote again and the Holy Apparition winked out like a soap bubble, and the beautiful music fell silent.  Old Diego pushed his way forward to the hole and looked in. There was nothing else there in the hole now, nothing at all. Maria came timidly to his side and she looked in too. They remained there staring a long time, unnoticed by the mass of the crowd, who were watching the dispute that had already erupted over the gold.  The bishop had pounced on it like a duck on a June bug, as they say, asserting the right of Holy Mother Church to her lost property. Emidio and Salvador had let it be snatched from them with hard patient smiles. One of the Gentes de Razon actually got off his horse to tell the bishop that the true provenance of the items had to be decided by the authorities in Mexico City, and until they could be contacted the treasure had better be kept under lock and key at the alcalde’s house. Blessed Virgin? Yes, there had seemed to be an apparition of some kind; but then again, perhaps it had been a trick of the light.  The argument moved away down the hill—the bishop had a good grip on the gold and kept walking with it, so almost everyone had to follow him. I went to stand beside Diego and Maria, in the ruins of their garden.  “She forgave us,” whispered Diego.  “A great weight of sin has been lifted from you today, my children,” I told them. “Rejoice, for Christ loves you both. Come to the church with me now and I will celebrate a special Mass in your honor.”  I led them away with me, one on either arm. Unseen behind us, Mendoza advanced on the uprooted and forgotten vine with a face like a lioness kept from her prey.  Well, the old couple made out all right, anyway. I saw to it that they got new grapevines and food from the Mission supplies to tide the family over until their garden recovered. Within a couple of years they passed away, one after the other, and were buried reasonably near one another in the consecrated ground of the Mission cemetery, in which respect they were luckier than the unknown captain from Castile, or wherever he’d come from.  They never got the golden treasure, but being Indians there had never been any question that they would. Their descendants lived on and multiplied in the area, doing particularly well after the coming of the Yankees, who (to the mortification of the Gentes de Razon) couldn’t tell an Indian from a Spanish Mexican and lumped them all together under the common designation of Greaser, treating one no worse than the other.  Actually I never kept track of what happened to the gold. The title dispute dragged on for years, I think, with the friars swearing there had been a miracle and the rancheros swearing there hadn’t been. The gold may have been returned to Carmel, or it may have gone to Mexico City, or it may have gone into a trunk underneath the alcalde’s bed, I didn’t care; it was all faked Company-issue reproductions anyway. The bishop died and the Yankees came and were the new conquerors, and maybe nothing ever did get resolved either way.  But Mendoza got her damned vine and her bonus, so she was as happy as she ever is. The Company got its patent on Black Elysium secured. I lived on at the Mission for years and years before (apparently) dying of venerable old age and (apparently) being buried in the same cemetery as Diego and Maria. God forgave us all, I guess, and I moved on to less pleasant work.  Sometimes, when I’m in that part of the world, I stop in as a tourist and check out my grave. It’s the nicest of the many I’ve had, except maybe for that crypt in Hollywood. Well, well; life goes on.  Mine does anyway.    Originally published in Asimov’s Science Fiction, March 1997.  One of the most prolific new writers to appear in the late '90s, the late Kage Baker made her first sale in 1997, with \"Noble Mold,\" the first of her long sequence of sly and compelling stories of the adventures and misadventures of the time-traveling agents of the Company. Her Company novels include, In the Garden of Iden, Sky Coyote, Mendoza in Hollywood, The Graveyard Game, The Life of the World to Come, The Machine's Child, Sons of Heaven, and Not Less Than Gods. Her other books include fantasy novels The Anvil of the World, The House of the Stag, and The Bird on the River, science fiction novel The Empress of Mars, YA novel The Hotel Under the Sand, and Or Else My Lady Keeps the Key, about some of the real pirates of the Caribbean. Her many stories were collected in Black Projects, White Knights, Mother Aegypt and Other Stories, The Children of the Company, Dark Mondays, and Gods and Pawns. Her posthumously published books include Neil Gwynne's Scarlet Spy, Neil Gwynne's On Land and Sea (with Kathleen Barholomew), and a collection, In the Company of Thieves. Baker died, tragically young, in 2010.", "text": "7830 words, novelette, REPRINT\nNoble Mold\nFor a while I lived in this little town by the sea. Boy, it was a soft job. Santa Barbara had become civilized by then: no more Indian rebellions, no more pirates storming up the beach, nearly all the grizzly bears gone. Once in a while some bureaucrat from Mexico City would raise hell with us, but by and large the days of the old Missions were declining into forlorn shades, waiting for the Yankees to come.\nThe Company operated a receiving, storage, and shipping terminal out of what looked like an oaken chest in my cell. I had a mortal identity as an alert little padre with an administrative career ahead of him, so the Church kept me pretty busy pushing a quill. My Company duties, though, were minor: I logged in consignments from agents in the field and forwarded communiqués.\nIt was sort of a forty-year vacation. There were fiestas and fandangos down in the pueblo. There were horse races along the shore of the lagoon. My social standing with the De La Guerra family was high, so I got invited out to supper a lot. And at night, when the bishop had gone to bed and our few pathetic Indians were tucked in for the night, I would sneak a little glass of Communion wine and then relax out on the front steps of the church. There I’d sit, listening to the night sounds, looking down the long slope to the night sea. Sometimes I’d sit there until the sky pinked up in the east and the bells rang for Matins. We Old Ones don’t need much sleep.\nOne August night I was sitting like that, watching the moon drop down toward the Pacific, when I picked up the signal of another immortal somewhere out there in the night. I tracked it coming along the shoreline, past the point at Goleta; then it crossed the Camino Real and came straight uphill at me. Company business. I sighed and broadcast, Quo Vadis?\nHola, came the reply. I scanned, but I knew who it was anyway. Hi, Mendoza, I signaled back, and leaned up on my elbows to await her arrival. Pretty soon I picked her up on visual, too, climbing up out of the mists that flowed along the little stream; first the wide-brimmed hat, then the shoulders bent forward under the weight of the pack, the long walking skirt, the determined lope of the field operative without transportation.\nMendoza is a botanist, and has been out in the field too long. At this point she’d been tramping around Alta California for the better part of twelve decades. God only knew what the Company had found for her to do out in the back of beyond; I’d have known, if I’d been nosy enough to read the Company directives I relayed to her from time to time. I wasn’t her case officer anymore, though, so I didn’t.\nShe raised burning eyes to me and my heart sank. She was on a Mission, and I don’t mean the kind with stuccoed arches and tile roofs. Mendoza takes her work way too seriously. “How’s it going, kid?” I greeted her in a loud whisper when she was close enough.\n“Okay.” She slung down her pack on the step beside me, picked up my wine and drank it, handed me back the empty glass and sat down.\n“I thought you were back up in Monterey these days,” I ventured.\n“No. The Ventana,” she replied. There was a silence while the sky got a little brighter. Far off, a rooster started to crow and then thought better of it.\n“Well, well. To what do I owe the pleasure, et cetera?” I prompted.\nShe gave me a sharp look. “Company Directive 080444-C,” she said, as though it were really obvious.\nI’d developed this terrible habit of storing incoming Green Directives in my tertiary consciousness without scanning them first. The soft life, I guess. I accessed hastily. “They’re sending you after grapes?” I cried a second later.\n“Not just grapes.” She leaned forward and stared into my eyes. “Mission grapes. All the cultivars around here that will be replaced by the varieties the Yankees introduce. I’m to collect genetic material from every remaining vine within a twenty-five-mile radius of this building.” She looked around disdainfully. “Not that I expect to find all that many. This place is a wreck. The Church has really let its agricultural program go to hell, hasn’t it?”\n“Hard to get slave labor nowadays.” I shrugged. “Can’t keep ’em down on the farm without leg irons. We get a little help from the ones who really bought into the religion, but that’s about it.”\n“And the Holy Office can’t touch them.” Mendoza shook her head. “Never thought I’d see the day.”\n“Hey, things change.” I stretched out and crossed my sandaled feet one over the other. “Anyway. The Mexicans hate my poor little bishop and are doing their level best to drive him crazy. In all the confusion with the Missions being closed down, a lot of stuff has been looted. Plants get dug up and moved to people’s gardens in the dark of night. There are still a few Indian families back in some of the canyons, too, and a lot of them have tiny little farms. Probably a lot of specimens out there, but you’ll really have to hunt around for them.”\nShe nodded, all brisk. “I’ll need a processing credenza. Bed and board, too, and a cover identity. That’s your job. Can you arrange them by 0600 hours?”\n“Gosh, this is just like old times,” I said without enthusiasm. She gave me that look again.\n“I have work to do,” she explained with exaggerated patience. “It is very important work. I’m a good little machine and I love my work. Nothing is more important than My Work. You taught me that, remember?”\nWhich I had, so I just smiled my most sincere smile as I clapped her on the shoulder. “And a damned good machine you are, too, I know you’ll do a great job, Mendoza. And I feel that your efficiency will be increased if you don’t rush this job. Take the time to do it right, you know? Mix a little rest and rec into your schedule. After all, you really deserve a holiday, a hard-working operative like you. This is a great place for fun. You could come to one of our local cascaron balls. Dance the night away. You used to like to dance.”\nBoy, was that the wrong thing to say. She stood up slowly, like a cobra rearing back.\n“I haven’t owned a ballgown since 1703. I haven’t attended a mortal party since 1555. If you’ve chosen to forget that miserable Christmas, I can assure you I haven’t. You play with the damned monkeys, if you’re so fond of them.” She drew a deep breath. “I, myself, have better things to do.” She stalked away up the steps, but I called after her:\n“You’re still sore about the Englishman, huh?”\nShe didn’t deign to respond but shoved her way between the church doors, presumably to get some sleep behind the altar screen where she wouldn’t be disturbed.\nShe was still sore about the Englishman.\nI may have a more relaxed attitude toward my job than some people I could mention, but I’m still the best at it. By the time Mendoza wandered squinting into morning light I had her station set up, complete with hardware, in one of the Mission’s guest cells. For the benefit of my fellow friars she was my cousin from Guadalajara, visiting me while she awaited the arrival of her husband from Mexico City. As befitted the daughter of an old Christian family, the senora was of a sober and studious nature, and derived much innocent pleasure from painting flowers and other subjects of natural history.\nShe didn’t waste any time. Mendoza went straight out to what remained of the Mission vineyard and set to work, clipping specimens, taking soil samples, doing all those things you’d have to be an obsessed specialist to enjoy. By the first evening she was hard at work at her credenza, processing it all.\nWhen it came time to loot the private gardens of the Gentes de Razon her social introductions went okay, too, once I got her into some decent visiting clothes. I did most of the talking to the Ortegas and Carrillos and the rest, and the fact that she was a little stiff and silent while taking grape brandy with them could easily be explained away by her white skin and blue veins. If you had any Spanish blood you were sort of expected to sneer about it in that place, in those days.\nAnyway it was a relief for everybody when she’d finished in the pueblo and went roving up and down the canyons, pouncing on unclaimed vines. There were a few Indians settled back in the hills, ex-neophytes scratching out a living between two worlds, on land nobody else had wanted. What they made of this woman, white as their worst nightmares, who spoke to them in imperious and perfectly accented Barbareno Chumash, I can only imagine. However she persuaded them, though, she got samples of their vines too. I figured she’d soon be on her way back to the hinterlands, and had an extra glass of Communion wine to celebrate. Was that ever premature!\nI was hearing confessions when her scream of excitement cut through the subvocal ether, followed by delighted profanity in sixteenth-century Galician. My parishioner went on:\n“ . . . which you should also know, Father, was that I have coveted Juana’s new pans. These are not common iron pans but enamelware, white with a blue stripe, very pretty, and they came from the Yankee trading ship. It disturbs me that such things should imperil my soul.”\nJoseph! Joseph! Joseph!\n“It is good to be concerned on that account, my child.” I shut out Mendoza’s transmission so I could concentrate on the elderly mortal woman on the other side of the screen. “To covet worldly things is very sinful indeed, especially for the poor. The Devil himself sent the Yankees with those pans, you may be certain.” But Mendoza had left her credenza and was coming down the arcade in search of me, ten meters, twenty meters, twenty-five . . . “For this, and for your sinful dreams, you must say thirty Paternosters and sixty Ave Marias . . . ” Mendoza was coming up the church steps two at a time . . . “Now, recite with me the Act of Contrition—”\n“Hey!” Mendoza pulled back the door of the confessional. Her eyes were glowing with happiness. I gave her a stern look and continued the Act of Contrition with my somewhat disconcerted penitent, so Mendoza went out to stride up and down in front of the church in her impatience.\n“Don’t you know better than to interrupt me when I’m administering a sacrament?” I snapped when I was finally able to come out to her. “Some Spaniard you are!”\n“So report me to the Holy Office. Joseph, this is important. One of my specimens read out with an F-M Class One rating.”\n“And?” I put my hands in my sleeves and frowned at her, refusing to come out of the role of offended friar.\n“Favorable Mutation, Joseph, don’t you know what that means? It’s a Mission grape with a difference. It’s got Saccharomyces with style and Botrytis in rare bloom. Do you know what happens when a field operative discovers an F-M Class One, Joseph?”\n“You get a prize,” I guessed.\n“Si señor!” She did a little dance down the steps and stared up at me in blazing jubilation. I hadn’t seen her this happy since 1554. “I get a Discovery Bonus! Six months of access to a lab for my own personal research projects, with the very finest equipment available! Oh joy, oh rapture. So I need you to help me.”\n“What do you need?”\n“The Company wants the parent plant I took the specimen from, the whole thing, root and branch. It’s a big vine, must have been planted years ago, so I need you to get me some Indians to dig it up and bring it back here in a carreta. Six months at a Sciences Base, can you imagine?”\n“Where did you get the specimen?” I inquired.\nShe barely thought about it. “Two kilometers south-southeast. Just some Indian family back in the hills, Joseph, with a hut in a clearing and a garden. Kasmali, that was what they called themselves. You know the family? I suppose we’ll have to pay them something for it. You’ll have to arrange that for me, okay?”\nI sighed. Once again the kindly padre was going to explain to the Indian why it was necessary to give up yet another of his belongings. Not my favorite role, all things considered.\nBut there we were that afternoon, the jolly friar and his haughty cousin, paying a call on the Kasmali family.\nThey were good parishioners of mine, the old abuela at Mass every day of the week, rain or shine, the rest of the family lined up there every Sunday. That was a lot to expect of our Indians in this day and age. They were prosperous, too, as Indians went: they had three walls of a real adobe house and had patched in the rest with woven brush. They had terraced their tiny hillside garden and were growing all kinds of vegetables on land not fit for grazing. There were a few chickens, there were a few little brown children chasing them, there were a few cotton garments drying on the bushes. And, on the crest of the hill, a little way from the house, there was the vineyard: four old vines, big as trees, with branches spreading out to shade most of an acre of land.\nThe children saw us coming and vanished into the house without a sound. By the time we reached the top of the winding stony path, they had all come out and were staring at us: the toothless old woman from daily Mass, a toothless old man I did not know, the old son, the two grown grandsons, their wives, and children of assorted ages. The elder of the grandsons came forward to greet us.\n“Good evening, little Father.” He looked uneasily at Mendoza. “Good evening, lady.”\n“Good evening, Emidio.” I paused and pretended to be catching my breath after the climb, scanning him. He was small, solidly built, with broad and very dark features; he had a stiff black moustache. His wide eyes flickered once more to Mendoza, then back to me. “You have already been introduced to my cousin, I see.”\n“Yes, little Father.” He made a slight bow in her direction. “The lady came yesterday and cut some branches off our grapevines. We did not mind, of course.”\n“It is very kind of you to permit her to collect these things.” I eyed Mendoza, hoping she’d been tactful with them.\n“Not at all. The lady speaks our language very well.”\n“That is only courtesy, my son. Now, I must tell you that one of your vines has taken her fancy, for its extraordinary fruit and certain virtues in the leaves. We have come back here today, therefore, to ask you what you will accept for that near vine at the bottom of the terrace.”\nThe rest of the family stood like statues, even the children. Emidio moved his hands in a helpless gesture and said, “The lady must of course accept our gift.”\n“No, no,” said Mendoza. “We’ll pay you. How much do you want for it?” I winced.\n“She must accept the gift, please, Father.” Emidio’s smile was wretched.\n“Of course she shall,” I agreed. “And, Emidio, I have a gift I have been meaning to give you since the feast of San Juan. Two little pigs, a boar and a sow, so they may increase. When you bring down the vine for us you may collect them.”\nThe wives lifted up their heads at that. This was a good deal. Emidio spread out his hands again. “Of course, little Father. Tomorrow.”\n“Well, that was easy,” Mendoza remarked as we picked our way down the hill through the chaparral. “You’re so good with mortals, Joseph. You just have to treat Indians like children, I guess, huh?”\n“No, you don’t,” I sighed. “But it’s what they expect you to do, so they play along.” There was more to it than that, of course, but something else was bothering me. I had picked up something more than the usual stifled resentment when I had voiced my request: someone in the family had been badly frightened for a second. Why? “You didn’t do anything to, like, scare those people when you were there before, did you, Mendoza? Didn’t threaten them or anything, did you?”\n“Heavens, no.” She stopped to examine a weed. “I was quite polite. They weren’t comfortable around me, actually, but then mortals never are. Look at this! I’ve never seen this blooming so late in the year, have you?”\n“Nice.” I glanced at it. I don’t know from plants. I know a lot about mortals, though.\nSo I was surprised as hell next day when Emidio and his brother appeared at the Mission, trundling a cart full of swaying leaves into the open space by the fountain. I went out to greet them and Mendoza was behind me like a shadow. She must have been prowling her room, listening for the squeak of wheels.\n“This is very good, my sons, I am proud of you—” I was saying heartily, when Mendoza transmitted a blast of subvocal fury.\nDamn it, Joseph, this is wrong! These are just clippings, they haven’t brought the whole vine!\n“—but I perceive there has been a misunderstanding,” I continued. “My cousin requested the vine itself, with its roots, that she may replant it. You have brought only cut branches, apparently.” The Indians exchanged glances.\n“Please forgive us, little Father. We did not understand.” They set down the traces and Emidio reached into the back. “We did bring all the grapes that were ripe. Maybe it was these the lady wanted?” And he proffered a big woven dish of grapes. I looked close and noticed they did have a funny look to them, a bloom on the skin so heavy it was almost . . . furry?\n“No,” said Mendoza, in clearest Chumash. “Not just the grapes. I want the vine. The whole plant. You need to dig it up, roots and all, and bring it here. Do you understand now?”\n“Oh,” said Emidio. “We’re very sorry. We didn’t understand.”\n“But you understand now?” she demanded.\n“I am certain they do,” I said smoothly. “What remarkable grapes these are, my sons, and what a beautiful basket! Come in and rest in the shade, my sons, and have a cool drink. Then we will go catch one of the little pigs I promised you.”\nBy the time we got back, Mendoza had vanished; the grapes and the vine cuttings were gone too. The brothers trudged away up the hill with their cart and one squealing shoat, his legs bound with twine. Pig Number Two remained in the Mission pen, to be paid on delivery of the vine. I figured if the wives got that message they’d see to it the job got done.\nMendoza came out when they were gone. She looked paler than usual. She handed me a sheet of paper from her credenza. “This is a Priority Order,” she told me. “I sent them the codes on the grapes and clippings anyway, but it’s not enough.”\nI read the memo. She wasn’t kidding; it was a first-class trans-departmental Priority Gold telling me I was to do everything in my power to facilitate, expedite and et cetera. “What have we got here, anyway, cancer cures from grapes?” I speculated.\n“You don’t need to know and neither do I,” said Mendoza flatly. “But the Company means business now, Joseph. We must get that vine.”\n“We’ll get it tomorrow,” I told her. “Trust me.”\nNext day, same hour, the brothers came with hopeful smiles and a big muddy mess of a vine trailing out of their cart. Such relief! Such heartfelt praise and thanks the kindly friar showered on his obedient sons in Christ! Mendoza heard their arrival and came tearing out into the courtyard, only to pull up short with an expression of baffled rage.\nTHAT’S NOT THE VINE! she transmitted, with such intensity I thought for a second we were having an earthquake.\n“ . . . And yet, my sons, I am afraid we have not understood each other once again,” I went on wearily. “It appears that, although you have brought us a whole vine, you have not brought the particular vine that was specifically asked for by my cousin.”\n“We are so sorry,” replied Emidio, averting his eyes from Mendoza. “How stupid we were! But, Father, this is a very good vine. It’s in much better condition than the other one and bears much prettier grapes. Also, it was very difficult to dig it all up and we have brought it a long way. Maybe the lady will be satisfied with this vine instead?”\nMendoza was shaking her head, not trusting herself to speak, although the air around her was wavering like a mirage. Hastily I said:\n“My dearest sons, I am sure it is an excellent vine, and we would not take it from your family. You must understand that it is the other vine we want, the very one you brought cuttings from yesterday. That vine and no other, and all of that vine. Now, you have clearly worked very hard and in good faith, so I will certainly send you home with your other pig, but you must come back tomorrow with the right vine.”\nThe brothers looked at each other and I picked up a flash of despair from them, and some weird kind of fear too. “Yes, little Father,” they replied.\nBut on the next day they didn’t come at all.\nMendoza paced the arcade until nine in the evening, alarming the other friars. Finally I went out to her and braced myself for the blast.\n“You know, you lost yourself two perfectly good pigs,” she informed me through gritted teeth. “Damned lying Indians.”\nI shook my head. “Something’s wrong here, Mendoza.”\n“You bet something’s wrong! You’ve got a three-day delay on a Priority Gold.”\n“But there’s some reason we’re not getting. Something is missing from this picture . . . ”\n“We never should have tried to bargain with them, you know that? They offered it as a gift in the first place. We should have just taken it. Now they know it’s really worth something! I’ll go up there with a spade and dig the damned vine up myself, if I have to.”\n“No! You can’t do that, not now. They’ll know who took it, don’t you see?”\n“One more crime against the helpless Indians laid at the door of Spain. As if it mattered any more!” Mendoza turned on her heel to stare at me. Down at the other end of the arcade one of my brother friars put his head out in discreet inquiry.\nIt does matter! I dropped to a subvocal hiss. It matters to them and it matters to me! I call them my beloved sons, but they know I’ve got the power to go up there and confiscate anything they have on any excuse at all because that’s how it’s always been done! Only I don’t. They know Father Rubio won’t do that to them. I’ve built up a cover identity as a kindly, honorable guy because I’ve got to live with these people for the next thirty years! You’ll get your damn specimen and go away again into the sagebrush, but I’ve got a character to maintain!\nMy God, she sneered, He wants his little Indians to love him.\nCompany policy, baby. It’s easier to deal with mortals when they trust you. Something you used to understand. So just you try screwing with my cover identity! Just you try it and see what happens.\nShe widened her eyes at that, too furious for words, and I saw her knuckles go white; little chips of whitewash began falling from the walls. We both looked up at them and cooled down in a hurry.\nSorry. But I mean what I say, Mendoza. We handle this my way.\nShe threw her hands up in the air. What are you going to do, then, smart guy? You have to do something.\nDay four of the Priority Gold, and Company Directive 081244-A anxiously inquired why no progress on previous transdepartmental request for facilitation?\nSituation Report follows, I responded. Please stand by. Then I put on my walking sandals and set off up the canyon alone.\nBefore I had toiled more than halfway, though, I met Emidio coming in my direction. He didn’t try to avoid me, but as he approached he looked down the canyon past me in the direction of the Mission. “Good morning, little Father,” he called.\n“Good morning, my son.”\n“Is your cousin lady with you?” He dropped his voice as he drew close.\n“No, my son. We are alone.”\n“I need to speak with you, little Father, about the grapevine.” He cleared his throat. “I know the lady must be very angry, and I am sorry. I don’t mean to make you angry too, little Father, because I know she is your cousin—”\n“I understand, my son, believe me. And I am not angry.”\n“Well then.” He drew a deep breath. “This is the matter. The grapevines do not belong to me, nor to my father. They belong to our grandfather Diego. And he will not let us dig up the vine the lady wants.”\n“Why will he not?”\n“He won’t tell us. He just refuses. Don’t be stupid, we told him. Father Rubio has been good to us, he has treated us fairly. Look at the fine pigs he has given us, we said. He just sits in the sun and rocks himself, and refuses us. And our grandmother came and touched his feet and cried, though she didn’t say anything, but he wouldn’t even look at her.”\n“I see.”\n“We have said everything we could say to him, but he will not let us dig up that vine. We tried to fool the lady twice by pretending to make mistakes (and that was a sin, little Father, and I’m sorry), but it didn’t work. Somehow she knew. Then our grandfather—” he paused in obvious embarrassment. “I don’t know how to say this, little Father—you know the old people are superstitious and still believe foolish things—I think he somehow has the idea that your cousin lady is a nunasis. Please don’t take this the wrong way—”\n“No, no, go on—”\n“We have an old story about a spirit who walks on the mountains and wears a hat like hers, you see, throwing a shadow cold as death. I know it’s stupid. Even so, Grandfather won’t let us dig up that vine. Now, you might say, our grandfather is only an old man and a little bit crazy now, and we’re strong, so he can be put aside as though he were a little baby; but if we did that, we would be breaking the commandment about honoring the old people. It seems to us that would be a worse sin than the white lady not getting what she wanted. What do you think, little Father?”\nBoy, oh, boy. “This is very hard, my son,” I said, and I meant it. “But you are right.”\nEmidio studied me in silence for a long moment, his eyes narrowed. “Thank you,” he said at last. After another pause he added, “Is there anything we can do that will make the lady happy? She’ll be angry with you, now.”\nI found myself laughing. “She will make my life a Purgatory, I can tell you,” I said. “But I will offer it up for my sins. Go home, Emidio, and don’t worry. Perhaps God will send a miracle.”\nI wasn’t laughing when I got back to the Mission, though, and when Mendoza came looking for me she saw my failure right away.\n“No dice, huh?” She squinted evilly. “Well. This is no longer a matter of me and my poor little bonus now, Joseph. The Company wants that vine. I suggest you think of something fast or there are liable to be some dead Indians around here soon, pardon my indelicate phrasing.”\n“I’m working on it,” I told her.\nAnd I was. I went to the big leatherbound books that held the Mission records. I sat down in a corner of the scriptorium and went over them in minute detail.\n1789—here was the baptism of Diego Kasmali, age given as thirty years. 1790, marriage to Maria Conception, age not given. 1791 through 1810, a whole string of baptisms of little Kasmalis: Agustin, Xavier, Pablo, Juan Bautista, Maria, Dolores, Guadalupe, Dieguito, Marta, Tomas, Luisa, Bartolomeo. First Communion for Xavier Kasmali, 1796. One after the other, a string of little funerals: Agustin age two days, Pablo age three months six days, Juan Bautista age six days, Maria age two years . . . too sad to go on down the list, but not unusual. Confirmation for Xavier Kasmali, 1802. Xavier Kasmali married to Juana Catalina of the Dos Pueblos rancheria, age 18 years, 1812. Baptism of Emidio Kasmali, 1813. Baptism of Salvador Kasmali, 1814. Funeral of Juana Catalina, 1814. First Communions, Confirmations, Marriages, Baptisms, Extreme Unctions . . . not a sacrament missed. Really good Catholics.\nWhy the old, old woman was at Mass every single day of the year, rain or shine, though she was propped like a bundle of sticks in the shadows at the back of the church. Maria Conception, wife of Diego Kasmali. But Diego never, ever at Mass. Why not? On a desperate hunch I went to my transmitter and typed in a request for something unusual.\nThe reply came back: Query: first please resolution Priority Gold status?\nRequest relates Priority, I replied. Resolving now. Requisition Sim ParaN Phenom re: Priority resolution?\nThat gave them pause. They verified and counterverified my authority, they re-scanned the original orders and mulled over their implications. At least, I guessed they were doing that, as the blue screen flickered. Feeling I had them on the run, I pushed for a little extra, just for my own satisfaction: Helpful Priority specify mutation. What? Why?\nPause while they verified me again, then the bright letters crawled onscreen in a slow response:\nPatent Black Elysium.\nI fell back laughing, though it wasn’t exactly funny. The rest of the message followed in a rapid burst: S-P Requisition approved. Specify Tech support?\nI told them what I needed.\nEstimate resolution time Priority Gold?\nI told them how long it would take.\nExpecting full specimen consign & report then, was the reply, and they signed off.\n“Why don’t they ever put convenient handles on these things?” grumbled Mendoza. She had one end of the transport trunk and a shovel; I had the other end of the trunk and the other shovel. It was long after midnight and we were struggling up the rocky defile that led to the Kasmali residence.\n“Too much T-field drag,” I explained.\n“Well, you would think that an all-powerful cabal of scientists and businessmen, with advance knowledge of every event in recorded history and infinite time in which to take every possible advantage of said events, and every possible technological resource at their command, and unlimited wealth—” Mendoza shifted the trunk again and we went on “—you’d think they could devise something as simple as a recessed handle.”\n“They tried it. The recess cuts down on the available transport space inside,” I told her.\n“You’re kidding me.”\n“No. I was part of a test shipment. Damn thing got me right in the third cervical vertebra.”\n“I might have known there’d be a reason.”\n“The Company has a reason for everything, Mendoza.”\nWe came within earshot of the house, so conversation ended. There were three big dogs in the yard before the door. One slept undisturbed, but two raised their heads and began to growl. We set down the mink. I opened it and from the close-packed contents managed to prize out the hush unit. The bigger of the dogs got to his feet, preparing to bark.\nI switched on the unit. Good dog, what a sleepy doggie; he fell over with a woof and did not move again. The other dog dropped his head on his paws. Dog Number Three would not wake at all now, nor would any of the occupants of the house, not while the hush field was being generated.\nI carried the unit up to the house and left it by the dogs, Mendoza dragging the trunk after me. We removed the box of golden altar vessels and set off up the hill with it.\nThe amazing mutated vine was pretty sorry-looking now, with most of its branches clipped off in the attempt to appease Mendoza. I hoped to God their well-meaning efforts hadn’t killed it. Mendoza must have been thinking the same thing, but she just shrugged grimly. We began to dig.\nWe made a neat hole, small but very deep, just behind the trunk and singled slightly under it. There was no way to hide our disturbance of the earth, but fortunately the ground had already been so spaded up and trampled over that our work shouldn’t be that obvious.\n“How deep does this have to be?” I panted when we had gone about six feet and I was in the bottom passing spadefuls up to Mendoza.\n“Not much deeper; I’d like it buried well below the root ball.” She leaned in and peered.\n“Well, how deep is that?” Before she could reply my spade hit something with a metallic clank. We halted.\nMendoza giggled nervously. “Jesus, don’t tell me there’s already buried treasure down there!”\nI scraped a little with the spade. “There’s something like a hook,” I said. “And something else,” I got the spade under it and launched it up out of the hole with one good heave. The whole mass fell on the other side of the dirt heap, out of my view. “It looked kind of round,” I remarked.\n“It looks kind of like a hat—” Mendoza told me cautiously, bending down and turning it over. Abruptly she yelled and danced back from it. I scrambled up out of the hole to see what was going on.\nIt was a hat, all right, or what was left of it; one of the hard-cured leather kind Spain had issued to her soldiers in the latter half of the last century. I remembered seeing them on the presidio personnel. Beside the hat, where my spade-toss had dislodged it, was the head that had been wearing it. Only a brown skull now, the eyes blind with black earth. Close to it was the hilt of a sword, the metallic thing I’d hit.\n“Oh, gross!” Mendoza wrung her hands.\n“Alas, poor Yorick,” was all I could think of to say.\n“Oh, God, how disgusting. Is the rest of him down there?”\nI peered down into the hole. I could see a jawbone and pieces of what might have been cavalry boots. “Looks like it, I’m afraid.”\n“What do you suppose he’s doing down there?” Mendoza fretted, from behind the handkerchief she had clapped over her mouth and nose.\n“Not a damn thing nowadays,” I guessed, doing a quick scan of the bones. “Take it easy: no pathogens left. This guy’s been dead a long time.”\n“Sixty years, by any chance?” Mendoza’s voice sharpened.\n“They must have planted him with the grapevine,” I agreed. In the thoughtful silence that followed I began to snicker. I couldn’t help myself. I leaned back and had myself a nice sprawling guffaw.\n“I fail to see what’s so amusing,” said Mendoza.\n“Sorry. Sorry. I was just wondering: do you suppose you could cause a favorable mutation in something by planting a dead Spaniard under it?”\n“Of course not, you idiot, not unless his sword was radioactive or something.”\n“No, of course not. What about those little wild yeast spores in the bloom on the grapes, though? You think they might be influenced somehow by the close proximity of a gentleman of Old Castile?”\n“What are you talking about?” Mendoza took a step closer.\n“This isn’t a cancer cure, you know.” I waved my hand at the vine-stock, black against the stars. “I found out why the Company is so eager to get hold of your Favorable Mutation, kid. This is the grape that makes Black Elysium.”\n“The dessert wine?” Mendoza cried.\n“The very expensive dessert wine. The hallucinogenic-controlled-substance dessert wine. The absinthe of the twenty-fourth century. The one the Company holds the patent on. That stuff. Yeah.”\nStunned silence from my fellow immortal creature. I went on:\n“I was just thinking, you know, about all those decadent technocrats sitting around in the future getting bombed on an elixir produced horn . . . ”\n“So it gets discovered here, in 1844,” said Mendoza at last. “It isn’t genetically engineered cultivar at all. And the wild spores somehow came from . . . ?”\n“But nobody else will ever know the truth, because we’re removing every trace of this vine from the knowledge of mortal men, see?” I explained. “Root and branch and all.”\n“I’d sure better get that bonus,” Mendoza reflected.\n“Don’t push your luck. You aren’t supposed to know.” I took my shovel and clambered back into the hole. “Come on, let’s get the rest of him out of here. The show must go on.”\nTwo hours later there was a tidy heap of brown bones and rusted sled moldering away in a new hiding place, and a tidy sum in gold plate occupying the former burial site. We filled in the hole, set up the rest of the equipment we’d brought, tested it, camouflaged it, turned it on and hurried away back down the canyon to the Mission, taking the hush unit with us. I made it in time for Matins.\nNews travels fast in a small town. By nine there were Indians, and some of the Gentes de Razon too, running in from all directions to tell us that I he Blessed Virgin had appeared in the Kasmalis’ garden. Even if I hadn’t known already, I would have been tipped off by the fact that old Maria Conception did not show up for morning Mass.\nBy the time we got up there, the bishop and I and all my fellow friars and Mendoza, a cloud of dust hung above the dirt track from all the traffic. The Kasmalis’ tomatoes and corn had been trampled by the milling crowd. People ran everywhere, waving pieces of grapevine; the oilier plants had been stripped as bare as the special one. The rancheros watched from horseback, or urged their mounts closer across the careful beds of peppers and beans.\nAround the one vine, the family had formed a tight circle. Some of them watched Emidio and Salvador, who were digging frantically, already about five feet down in the hole; others stared unblinking at the floating image of the Virgin of Guadalupe who smiled upon them from midair above the vine. She was complete in every detail, nicely three-dimensional and accompanied by heavenly music. Actually it was a long tape loop of Ralph Vaughan Williams’s Fantasia on a Theme by Thomas Tallis, which nobody would recognize because it hadn’t been composed yet.\n“Little Father!” One of the wives caught me by my robe. “It’s the Mother of God! She told us to dig up the vine, she said there was treasure buried underneath!”\n“Has she told you anything else?” I inquired, making the sign of the cross. My brother friars were falling to their knees in raptures, beginning to sing the Ave Maria; the bishop was sobbing.\n“No, not since this morning,” the wife told me. “Only the beautiful music has gone on and on.”\nEmidio looked up and noticed me for the first time. He stopped shoveling for a moment, staring at me, and a look of dark speculation crossed his face. Then his shovel was moving again, clearing away the earth, and more earth, and more earth.\nAt my side, Mendoza turned away her face in disgust. But I was watching the old couple, who stood a little way back from the rest of the family. They clung to each other in mute terror and had no eyes for the smiling Virgin. It was the bottom of the ever-deepening hole they watched, as birds watch a snake.\nAnd I watched them. Old Diego was bent and toothless now, but sixty years ago he’d had teeth, all right; sixty years ago his race hadn’t yet learned never to fight back against its conquerors. Maria Conception, what had she been sixty years ago when those vines were planted? Not a dried-up shuffling old thing back then. She might have been a beauty, and maybe a careless beauty.\nThe old bones and the rusting steel could have told you, sixty years ago. Had he been a handsome young captain with smooth ways, or just a soldier who took what he wanted? Whatever he’d been, or done, he’d wound up buried under that vine, and only Diego and Maria knew he was there. All those years, through the children and grandchildren and great-grandchildren, he’d been there. Diego never coming to Mass because of a sin he couldn’t confess. Maria never missing Mass, praying for someone.\nMaybe that was the way it had happened. Nobody would ever tell the story, I was fairly sure. But it was clear that Diego and Maria, alone of all those watching, did not expect to see treasure come out of that hole in the ground.\nSo when the first glint of gold appeared, and then the chalice and altar plate were brought up, their old faces were a study in confusion.\n“The treasure!” cried Salvador. “Look!”\nAnd the rancheros spurred their horses through the crowd to get a better look, lashing the Indians out of the way; but I touched the remote hidden in my sleeve and the Blessed Virgin spoke, in a voice as sweet mid immortal as a synthesizer:\n“This, my beloved children, is the altar plate that was lost from the Church at San Carlos Borromeo, long ago in the time of the pirates. My beloved Son has caused it to be found here as a sign to you all that ALL SINS ARE FORGIVEN!”\nI touched the remote again and the Holy Apparition winked out like a soap bubble, and the beautiful music fell silent.\nOld Diego pushed his way forward to the hole and looked in. There was nothing else there in the hole now, nothing at all. Maria came timidly to his side and she looked in too. They remained there staring a long time, unnoticed by the mass of the crowd, who were watching the dispute that had already erupted over the gold.\nThe bishop had pounced on it like a duck on a June bug, as they say, asserting the right of Holy Mother Church to her lost property. Emidio and Salvador had let it be snatched from them with hard patient smiles. One of the Gentes de Razon actually got off his horse to tell the bishop that the true provenance of the items had to be decided by the authorities in Mexico City, and until they could be contacted the treasure had better be kept under lock and key at the alcalde’s house. Blessed Virgin? Yes, there had seemed to be an apparition of some kind; but then again, perhaps it had been a trick of the light.\nThe argument moved away down the hill—the bishop had a good grip on the gold and kept walking with it, so almost everyone had to follow him. I went to stand beside Diego and Maria, in the ruins of their garden.\n“She forgave us,” whispered Diego.\n“A great weight of sin has been lifted from you today, my children,” I told them. “Rejoice, for Christ loves you both. Come to the church with me now and I will celebrate a special Mass in your honor.”\nI led them away with me, one on either arm. Unseen behind us, Mendoza advanced on the uprooted and forgotten vine with a face like a lioness kept from her prey.\nWell, the old couple made out all right, anyway. I saw to it that they got new grapevines and food from the Mission supplies to tide the family over until their garden recovered. Within a couple of years they passed away, one after the other, and were buried reasonably near one another in the consecrated ground of the Mission cemetery, in which respect they were luckier than the unknown captain from Castile, or wherever he’d come from.\nThey never got the golden treasure, but being Indians there had never been any question that they would. Their descendants lived on and multiplied in the area, doing particularly well after the coming of the Yankees, who (to the mortification of the Gentes de Razon) couldn’t tell an Indian from a Spanish Mexican and lumped them all together under the common designation of Greaser, treating one no worse than the other.\nActually I never kept track of what happened to the gold. The title dispute dragged on for years, I think, with the friars swearing there had been a miracle and the rancheros swearing there hadn’t been. The gold may have been returned to Carmel, or it may have gone to Mexico City, or it may have gone into a trunk underneath the alcalde’s bed, I didn’t care; it was all faked Company-issue reproductions anyway. The bishop died and the Yankees came and were the new conquerors, and maybe nothing ever did get resolved either way.\nBut Mendoza got her damned vine and her bonus, so she was as happy as she ever is. The Company got its patent on Black Elysium secured. I lived on at the Mission for years and years before (apparently) dying of venerable old age and (apparently) being buried in the same cemetery as Diego and Maria. God forgave us all, I guess, and I moved on to less pleasant work.\nSometimes, when I’m in that part of the world, I stop in as a tourist and check out my grave. It’s the nicest of the many I’ve had, except maybe for that crypt in Hollywood. Well, well; life goes on.\nMine does anyway.\nOriginally published in Asimov’s Science Fiction, March 1997.\nOne of the most prolific new writers to appear in the late '90s, the late Kage Baker made her first sale in 1997, with \"Noble Mold,\" the first of her long sequence of sly and compelling stories of the adventures and misadventures of the time-traveling agents of the Company. Her Company novels include, In the Garden of Iden, Sky Coyote, Mendoza in Hollywood, The Graveyard Game, The Life of the World to Come, The Machine's Child, Sons of Heaven, and Not Less Than Gods. Her other books include fantasy novels The Anvil of the World, The House of the Stag, and The Bird on the River, science fiction novel The Empress of Mars, YA novel The Hotel Under the Sand, and Or Else My Lady Keeps the Key, about some of the real pirates of the Caribbean. Her many stories were collected in Black Projects, White Knights, Mother Aegypt and Other Stories, The Children of the Company, Dark Mondays, and Gods and Pawns. Her posthumously published books include Neil Gwynne's Scarlet Spy, Neil Gwynne's On Land and Sea (with Kathleen Barholomew), and a collection, In the Company of Thieves. Baker died, tragically young, in 2010.", "source": "https://clarkesworldmagazine.com/baker_04_15_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Noble Mold by Kage Baker"}