{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Catherynne M Valente", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "0FJtSKE4XyR+ht6LRRhsSQczCEg=", "id": null, "license": null, "comments": "", "raw_text": "4280 words, short story  The Radiant Car Thy Sparrows Drew  Being unable to retrace our steps in Time, we decided to move forward in Space. Shall we never be able to glide back up the stream of Time, and peep into the old home, and gaze on the old faces? Perhaps when the phonograph and the kinesigraph are perfected, and some future worker has solved the problem of colour photography, our descendants will be able to deceive themselves with something very like it: but it will be but a barren husk: a soulless phantasm and nothing more. ‘Oh for the touch of a vanished hand, and the sound of a voice that is still!’”  —Wordsworth Donisthorpe, inventor of the Kinesigraph Camera  View the Famous Callowhale Divers of Venus from the Safety of a Silk Balloon! Two Bits a Flight!  —Advertisement Visible in the Launch Sequence of The Radiant Car Thy Sparrows Drew  EXT. The cannon pad at the Vancouver World’s Fair in 1986, late afternoon, festooned with crepe and banners wishing luck and safe travel.  The Documentarian Bysshe and her crew wave jerkily as confetti sticks to their sleek skullcaps and glistening breathing apparati. Her smile is immaculate, practiced, the smile of the honest young woman of the hopeful future; her copper-finned helmet gleams at her feet. Bysshe wears women’s clothing but reluctantly and only for this shot, and the curl of her lip betrays disdain of the bizarre, flare-waisted swimming costume that so titillates the crowds. Later, she would write of the severe wind-burns she suffered in cannon-flight due to the totally inadequate protection of that flutter of black silk. She tucks a mahogany case smartly under one arm, which surely must contain George, her favorite cinematographe. Each of her crewmen strap canisters of film—and the occasional bit of food or oxygen or other minor accoutrements—to their broad backs. The cannon sparkles, a late-model Algernon design, filigreed and etched with motifs that curl and leaf like patterns in spring ice breaking. The brilliant nose of the Venusian capsule Clamshell rests snugly in the cannon’s silvery mouth.  They are a small circus—the strongmen, the clowns, the trapeze artist poised on her platform, arm crooked in an evocative half-moon, toes pointed into the void.  I find it so difficult to watch her now, her narrow, monkish face, not a pore wasted, her eyes huge and sepia-toned, her smile enormous, full of the peculiar, feral excitement which in those days seemed to infect everyone who looked up into the evening sky to see Venus there, seducing behind veils of light, as she has always done. Those who looked and had eyes only for red Mars, all baleful and bright, were rough, raucous, ready and hale. Those who saw Venus were lost.  She was such a figure then: Bysshe, no surname, or simply the Documentarian. Her revolving lovers made the newsreels spin, her films packed the nickelodeons and wrapped the streets three times ‘round. Weeks before a Bysshe opened, buskers and salesmen would camp out on the thoroughfares beside every theater, selling genuine cells she touched with her own hand and replica spangled cages from To Thee, Bright Queen! sized just right to hold a male of Saturnine extraction. Her father, Percival Unck, was a brooding and notorious director in his time, his gothic dramas full of wraith-like heroines with black, bruised eyes and mouths perpetually agape with horror or orgiastic transcendence. Her mother was, naturally, one of those ever-transported actresses, though which one it is hard to remember, since each Unck leading lady became, by association and binding contract, little black-bobbed Bysshe’s mother-of-the-moment. Thus it is possible to see, in her flickering, dust-scratched face, the echoes of a dozen fleeting, hopeful actresses, easily forgotten but for the legacy of their adoptive daughter’s famous, lean features, her scornful, knowing grin.  Bysshe rejected her father’s idiom utterly. Her film debut in Unck’s The Spectres of Mare Nubium is charming, to say the least. During the famous ballroom sequence wherein the decadent dowager Clarena Schirm is beset with the ghosts of her victims, little Bysshe can be seen crouching unhappily near the rice-wine fountain, picking at the pearls on her traditional lunar kokoshnik and rubbing at her make-up. The legend goes that when Percival Unck tried to smudge his daughter’s eyes with black shadows and convince her to pretend herself a poor Schirm relation while an airy phantasm—years later to become her seventh mother—swooped down upon the innocent child, Bysshe looked up exasperatedly and said: “Papa. This is silly! I want only to be myself!”  And so she would be, forever, only and always Bysshe. As soon as she could work the crank on a cinematographe herself, she set about recording “the really real and actual world” (age 7) or “the genuine and righteous world of the true tale,” (age 21) and declaring her father’s beloved ghosts and devils “a load of double exposure drivel.” Her first documentary, The Famine Queen of Phobos, brought the colony’s food riots to harsh light, and earned her a Lumiere medal, a prize Percival Unck would never receive. When asked if his daughter’s polemics against fictive cinema had embittered him, Unck smiled in his raffish, canine way and said: “The lens, my good man, does not discriminate between the real and the unreal.”  Of her final film, The Radiant Car Thy Sparrows Drew, only five sequences remain, badly damaged. Though they have been widely copied, cut up and re-used in countless sallow and imitative documentaries on her life, the originals continue to deteriorate in their crystalline museum displays. I go there, to the Grand Eternal Exhibition, in the evenings, to watch them rot. It comforts me. I place my brow upon the cool wall, and she flashes before my eyes, smiling, waving, crawling into the mouth of the cannon-capsule with the ease of a natural performer, a natural aeronaut—and perhaps those were always much the same thing.  EXT. Former Site of the Village of Adonis, on the Shores of the Sea of Qadesh, Night.  A small boy, head bent, dressed in the uniform of a callowhale diver, walks in circles in what was once the village center. The trees and omnipresent cacao-ferns are splashed with a milky spatter. He does not look up as the camera watches him. He simply turns and turns and turns, over and over. The corrupted film skips and jumps; the boy seems to leap through his circuit, flashing in and out of sight.  When she was seventeen, Bysshe and her beloved cinematographe, George, followed the Bedouin road to Neptune for two years, resulting in her elegiac And the Sea Remembered, Suddenly. There, they say, she learned her skill at the sculpting of titanium, aquatic animal handling, and a sexual variant of Samayika mediation developed by a cult of levitation on tiny Halimede, where the wind blows warm and violet. There is a sequence, towards the melancholy conclusion of And the Sea, wherein Bysshe visits coral-devoured Enki, the great floating city which circumnavigates the planet once a decade, buoyed the lugubrious Neptunian current. Reclining on chaises with glass screens raised to keep out the perpetual rain, Bysshe smokes a ball of creamy, heady af-yun with a woman-levitator, her hair lashed with leather whips. When theaters received the prints of And the Sea, a phonograph and several records were included, so that Bysshe herself could narrate her opus to audiences across the world. A solemn bellhop changed the record when the onscreen Bysshe winked, seemingly to no one. And so one may sit on a plush chair, still, and hear her deep, nasal voice echo loudly—too loud, too loud!—in the theater.  The levitator told her of a town called Adonis, a whole colony on Venus that vanished in the space of a night. Divers they were, mostly, subject both to the great callowhales with their translucent skin and the tourists who came to watch and shiver in cathartic delight as the divers risked their lives to milk the recalcitrant mothers in their hibernation. They built a sweet village on the shores of the Qadesh, plaiting their roofs with grease-weed and hammering doors from the chunks of raw copper which comprised the ersatz Venusian beach. They lived; they ate the thready local cacao and shot, once or twice a year, a leathery ‘Tryx from the sky, enough to keep them all in fat and protein for months.  “It was a good life,” the blue-skinned levitator said, and Bysshe, on her slick black record, imitated the breathy, shy accent of Halimede as onscreen version of herself loaded another lump of af-yun into the atomizer. “And then, one day—pop! All gone. Houses, stairs, meat-smoking racks, diving bells.”  “This sort of thing happens,” Bysshe dismissed it all with a wave of her hand. “What planet is there without a mysteriously vanished colony to pull in the tourist cash? Slap up a couple of alien runes on a burned-out doorframe and people will stream in from every terminus. Might as well call them all New Roanoke and have done with it.” (In fact, one of Percival Unck’s less popular films was The Abduction of Prosperina, a loose retelling of that lost Plutonian city, though presumably with rather more demonic ice-dragons than were actually involved.)  Crab-heart trifles and saltwhiskey were passed around as Bysshe’s crew laughed and nodded along with her. The levitator smiled.  “Of course, Miss,” she said, eyes downcast within the equine blinders knotted to her head. “Well, except for the little boy. The one who was left behind. They say he’s still there. He’s stuck, somehow, in the middle of where the village used to be, just walking around in circles, around and around. Like a skip on a phonograph. He never even stops to sleep.” The Documentarian frowns sourly in black and white, her disapproval of such fancies, her father’s fancies, disappeared heroines and eldritch locations where something terrible surely occurred, showing in the wrinkling of her brow, the tapping of her fingernails against the atomizer as bubbling storms lapped their glass cupola, and armored penance-fish nosed the flotation arrays, their jaw-lanterns flashing.  But you can see her thinking, the new film, which was to be her last, taking shape behind her eyes.  This is what she came to see.  Dead Adonis, laid out in state on the beach-head. Her single mourner. The great ocean provides a kind of score for her starlit landing, and in the old days a foley-boy would thrash rushes against the floor of the theater to simulate the colossal, dusky red tide of the Qadesh. We would all squint in the dark, and try to see scarlet in the monochrome waves, emerald in the undulating cacao-ferns. The black silk balloon crinkles and billows lightly on the strand, clinging to the ruin of the landing capsule. The dwarf moon Anchises shines a kind of limping, diffident light on Bysshe as she walks into frame, her short hair sweat-curled in the wilting wind. She has thrown the exhibition costume into an offscreen campfire and is clothed now in her accustomed jodhpurs and famous black jacket. The boy turns and turns. His hands flicker and blur as if he is signing something, or writing on phantom paper. She holds out her hand as though approaching a horse, squats down beside the child in a friendly, schoolteacherly fashion. The boy does not raise his head to look at her. He stares at his feet. Bysshe looks uncertainly over her shoulder at the long snarl of sea behind them—the cinematographe operator, temporarily trusted with the care and feeding of George, says something to her offscreen, he must, because she cocks her head as though considering a riddle and says something back to him. Her mouth moves in the silent footage, mouthing words the audience cannot ever quite read.  Once, a deaf scholar was brought to view this little scene in a private projector room. She was given coffee and a treacle tart. She reported the words as: Look at the whales. Are they getting closer?  Bysshe stands up straight and strides without warning into the child’s path, blocking his little pilgrim’s progress around the sad patch of dune grass.  The child does not stop. He collides with Bysshe, steps back, collides with her again. He beats his head against her soft belly. Back and forth, back and forth.  The Documentarian looks helplessly into the camera.  EXT. Former Site of the Village of Adonis, afternoon.  One of the crewmen shaves in a mirror nailed to furry black cacao-fern bark. He uses a straight razor whose handle is inlaid with fossilized kelp. He is shirtless and circus huge, his face angular and broad. He catches a glimpse of Bysshe in his mirror and whirls to catch her up, kissing her and smearing shaving cream on her face. She laughs and punches his arm—he recoils in mock agony. It is a pleasant scene. This is Erasmo St. John, the Documentarian’s lover and lighting-master, who would later claim to have fathered a child with her, despite being unable to produce a convincing moppet.  Clouds drift down in long, indistinct spirals. Behind them, the boy turns and turns, still, celluloid transforming the brutal orange of the Venusian sun into a blinding white nova. Beyond him, pearlescent islands hump up out of the foamy Qadesh—callowhales, a whole pod, silent, pale.  Adonis was established some twenty years prior to the Bysshe expedition, one of many villages eager to take advantage of the callowhale hibernations. What, precisely, callowhale is is still the subject of debate. There are diagrams, to be sure—one even accompanies the Radiant Car press kit—but these are guesses only. It cannot even be safely said whether they are animal or vegetable matter. The first aeronauts, their braggart flags flapping in that first, raw breeze, assumed them to be barren islands. The huge masses simply lay motionless in the water, their surfaces milky, motley, the occasional swirl of chemical blue or gold sizzling through their depths. But soon enough, divers and fishermen and treasure-seekers flocked to the watery promise of Venus, and they called the creatures true. Beneath the waterline were calm, even dead leviathans—taninim, said a neo-Hasidic bounty hunter, some sort of proto-pliosaur, said one of the myriad research corps. Their fins lay flush against their flanks, horned and barbed. Their eyes were then perpetually shut—hibernating, said the research cotillion. Dreaming, said the rest. From their flat, wide skulls extended long, fern-like antennae which curled in fractal infinitude, tangling with the others of their occasional pods, their fronds stroking one another lightly, imperceptibly, in the quick, clever Qadesh currents. Whether they have any sentience is popular tea-chatter—their hibernation cycle seems to be much longer than a human life.  Some few divers claim to have heard them sing—the word they give to a series of unpredictable vibrations that occasionally shiver through the fern-antennae. Like sonar, these quaking oscillations can be fatal to any living thing caught up in them—unlike sonar, the unfortunates are instantly vaporized into constituent atoms. Yet the divers say that from a safe distance, their echoes brush against the skin in strange and intimate patterns, like music, like lovemaking. The divers cannot look at the camera when they speak of these things, as though it is the eye of God and by not meeting His gaze, they may preserve virtue. The vibrations are the color of morning, they whisper.  It is the milk the divers are after—nearly everything produced on Venus contains callowhale milk, the consistency of honey, the color of cream, the taste something like sucking on a dandelion stem caked in green peppercorn. It is protein-rich, fat-clotted, thick with vitamins—equally sought after as an industrial lubricant, foodstuff, fuel, as an ingredient in medicines, anesthesia, illicit hallucinogens, poured into molds and dried as an exotic building material. Certain artists have created entire murals from it, which looked upon straight seem like blank canvases, but seen slant-wise reveal impossibly complex patterns of shades of white. Little by little, Venusian-born children began to be reared on the stuff, to no apparent ill effect—and the practice became fashionable among the sorts of people whose fashions become the morality of the crowds. Erasmo St. John pioneered a kind of long-lit camera lantern by scalding the milk at low temperatures, producing an eerie phosphorescence. The later Unck films use this to great effect as spectral light. Cultivation has always been dangerous—the tubules that secrete milk are part and parcel of the ferny antennae, extending from the throat-sac of the callowhale. In order to harvest it, the diver must avoid the tendrils of fern and hope upon hope that the whale is not seized with a sudden desire to sing. For this danger, and for the callowhales’ rude insistence upon evolving on Venus and not some more convenient locale, the milk was so precious that dozens of coastal towns could be sustained by encouraging a relatively small population of municipal divers. Stock footage sent back to earth shows family after beaming family, clad in glittering counterpressure mesh, dark copper diving bells tucked neatly under their arms, hoisting healthy, robust goblets of milk, toasting the empire back home.  But where there is milk, there is mating, isn’t there? There are children. The ghost-voice of Bysshe comes over the phonograph as the final shot of And the Sea Remembered, Suddenly flickers silver-dark and the floating Neptunian pleasure-domes recede. Everyone knew where she was bound next, long before principal photography ever began. To Venus, and Adonis, to the little village rich in milk and children that vanished two decades after its founding, while the callowhales watched offshore, impassive, unperturbed.  EXT. Village Green, Twilight.  Bysshe is grabbing the child’s hand urgently while he screams, soundlessly, held brutally still in his steps by the gaffer and the key grip, whose muscles bulge with what appears to be a colossal effort—keeping this single, tiny, bird-boned child from his circuit. The Documentarian’s jagged hair and occasionally her chin swing in and out of frame as she struggles with him. She turns over the boy’s hand, roughly, to show the camera what she has found there: tiny fronds growing from his skin, tendrils like ferns, seeking, wavering, wet with milk. The film jumps and shudders; the child’s hand vibrates, faster, faster.  It is a difficult thing, to have an aftermath without an event.  The tabloids, ever beloved of Bysshe and her exploits, heralded the return of the expedition long before the orbits were favorable. They salivated for the new work, which would surely set records for attendance. The nickelodeons began taking ticket orders a year in advance, installing the revolutionary new sound equipment which might allow us all to hear the sound of the surf on a Venusian shore. The balloon was sighted in orbit and spontaneous, Romanesque gin-triumphs were held in three national capitals. Finally, on a grassy field outside Vancouver, the black silk confection of Bysshe’s studio balloon wrinkled and sighed to rest on the spring ground. The grips and gaffers came out first, their eyes downcast, refusing to speak. Then the producer, clutching his hat to his chest. Lastly came Erasmo St. John, clutching the hand of the greatest star of the coming century: a little boy with ferns in his fists.  Bysshe did not return. Her crew would not speak of where she had gone, only that she was to be left to it, called dead if not actually deceased—and possibly deceased. They mumbled; they evaded. Their damaged film, waterlogged and half-missing, was hurried into theaters and pored over by hundreds of actors, scholars, gossip columnists. It is said that Percival Unck only once viewed the reels. He looked into his lap when the last shot had faded to black and smiled, a secret smile, of regret, perhaps, or of victory.  The boy was sent to school, paid for by the studio. He was given a new name, though later in life he, too, would eschew any surname, having no family connections to speak of save to a dead documentarian. He wore gloves, always, and shared his memories as generously as he could with the waves of popular interest in Venus, in Adonis, in the lost film. No, I don’t remember what happened to my parents. I’m sorry, I wish I did. One day they were gone. Yes, I remember Bysshe. She gave me a lemon candy.  And I do remember her. The jacket only looks black on film. I remember—it was red.  I once saw a group of performance artists—rich students with little better to do, I thought—mount a showing of the shredded, abrupt footage of The Radiant Car, intercut with highlights of the great Unck gothics. The effect was strange and sad: Bysshe seemed to step out of her lover’s arms and into a ballroom, becoming suddenly an unhappy little girl, only to leap out again, shimmering into the shape of another child, with a serious expression, turning in endless circles on a green lawn. One of the students, whose hair was plaited and piled upon her head, soaked and crusted in callowhale milk until it glowed with a faint phosphor, stood before the screen with a brass bullhorn. She wore a bustle frame but no bustle, shoelaces lashed in criss-crossings around her calves but no shoes. The jingly player-piano kept time with the film, and behind her Bysshe stared intently into the phantasm of a distant audience, unknowable as God.  “Ask yourself,” she cried brazenly, clutching her small, naked breasts. “As Bysshe had the courage to ask! What is milk for, if not to nurture a new generation, a new world? We have never seen a callowhale calf, yet the mothers endlessly nurse. What do they nurture, out there in their red sea? I will tell you. For the space is not smooth that darkly floats between our earth and that morning star, Lucifer’s star, in eternal revolt against the order of heaven. It is thick, it is swollen, its disrupted proteins skittering across the black like foam—like milk spilled across the stars. And in this quantum milk how many bubbles may form and break, how many abortive universes gestated by the eternal sleeping mothers may burgeon and burst? I suggest this awe-ful idea: Venus is an anchor, where all waveforms meet in a radiant scarlet sea, where the milk of creation is milled, and we have pillaged it, gorged upon it all unknowing. Perhaps in each bubble of milk is a world suckled at the breast of a pearlescent cetacean. Perhaps there is one where Venus is no watery Eden as close as a sister, but a distant inferno of steam and stone, lifeless, blistered. Perhaps you have drunk the milk of this world—perhaps I have, and destroyed it with my digestion. Perhaps a skin of probabilistic milk, dribbling from the mouths of babes, is all that separates our world from the others. Perhaps the villagers of Adonis drank so deeply of the primordial milk that they became as the great mothers, blinking through worlds like holes burned in film—leaving behind only the last child born, who had not yet enough of the milk to change, circling, circling the place where the bubble between worlds burst!” The girl let her milk-barnacled hair fall with a violent gesture, dripping the peppery-sharp smelling cream onto the stage.  “Bysshe asked the great question: where did Adonis go in death? The old tales know. Adonis returned to his mother, the Queen of the Dark, the Queen of the Otherworld.” Behind her, on a forty-foot screen, the boy’s fern-bound palm—my palm, my vanished hand—shivered and vibrated and faded into the thoughtful, narrow face of Bysshe as she hears for the first time the name of Adonis. The girl screams: “Even here on Earth we have supped all our lives on this alien milk. We are the calves of the callowhales, and no human mothers. We will ride upon the milky foam, and one day, one distant, distant day, our heads will break the surf of a red sea, and the eyes of the whales will open, and weep, and dote upon us!”  The girl held up her hand, palm outward, to the meager audience. I squinted. There, on her skin, where her heart line and fate line ought to have been, was a tiny fern, almost imperceptible, but wavering nonetheless, uncertain, ethereal, new.  A rush of blood beat at my brow. As if compelled by strings and pulleys, I raised up my own palm in return. Between the two fronds, some silent shiver passed, the color of morning.  INT. The depths of the sea of Qadesh.  Bysshe swims through the murky water, holding one of Erasmo’s milk-lanterns out before her. St. John follows behind with George, encased in a crystal canister. The film is badly stained and burned through several frames. She swims upward, dropping lead weights from her shimmering counterpressure mesh as she rises. The grille of her diving bell gleams faintly in the shadows. Above her, slowly, the belly of a callowhale comes into view. It is impossibly massive, the size of a sky. Bysshe strains towards it, extending her fingers to touch it, just once, as if to verify it for herself, that such a thing could be real.  The audience will always and forever see it before Bysshe does. A slit in the side of the great whale, like a door opening. As the Documentarian stretches towards it, with an instinctual blocking that is nothing short of spectacular—the suddenly tiny figure of a young woman frozen forever in this pose of surprise, of yearning, in the center of the shot—the eye of the callowhale, so huge as to encompass the whole screen, opens around her. Catherynne M. Valente is the New York Times bestselling author of over two dozen works of fiction and poetry, including Palimpsest, the Orphan's Tales series, Deathless, Radiance, and the crowdfunded phenomenon The Girl Who Circumnavigated Fairyland in a Ship of Own Making (and the four books that followed it). She is the winner of the Andre Norton, Tiptree, Sturgeon, Prix Imaginales, Eugie Foster Memorial, Mythopoeic, Rhysling, Lambda, Locus, Romantic Times' Critics Choice and Hugo awards. She has been a finalist for the Nebula and World Fantasy Awards. She lives on an island off the coast of Maine with a small but growing menagerie of beasts, some of which are human.", "text": "4280 words, short story\nThe Radiant Car Thy Sparrows Drew\nBeing unable to retrace our steps in Time, we decided to move forward in Space. Shall we never be able to glide back up the stream of Time, and peep into the old home, and gaze on the old faces? Perhaps when the phonograph and the kinesigraph are perfected, and some future worker has solved the problem of colour photography, our descendants will be able to deceive themselves with something very like it: but it will be but a barren husk: a soulless phantasm and nothing more. ‘Oh for the touch of a vanished hand, and the sound of a voice that is still!’”\n—Wordsworth Donisthorpe, inventor of the Kinesigraph Camera\nView the Famous Callowhale Divers of Venus from the Safety of a Silk Balloon! Two Bits a Flight!\n—Advertisement Visible in the Launch Sequence of The Radiant Car Thy Sparrows Drew\nEXT. The cannon pad at the Vancouver World’s Fair in 1986, late afternoon, festooned with crepe and banners wishing luck and safe travel.\nThe Documentarian Bysshe and her crew wave jerkily as confetti sticks to their sleek skullcaps and glistening breathing apparati. Her smile is immaculate, practiced, the smile of the honest young woman of the hopeful future; her copper-finned helmet gleams at her feet. Bysshe wears women’s clothing but reluctantly and only for this shot, and the curl of her lip betrays disdain of the bizarre, flare-waisted swimming costume that so titillates the crowds. Later, she would write of the severe wind-burns she suffered in cannon-flight due to the totally inadequate protection of that flutter of black silk. She tucks a mahogany case smartly under one arm, which surely must contain George, her favorite cinematographe. Each of her crewmen strap canisters of film—and the occasional bit of food or oxygen or other minor accoutrements—to their broad backs. The cannon sparkles, a late-model Algernon design, filigreed and etched with motifs that curl and leaf like patterns in spring ice breaking. The brilliant nose of the Venusian capsule Clamshell rests snugly in the cannon’s silvery mouth.\nThey are a small circus—the strongmen, the clowns, the trapeze artist poised on her platform, arm crooked in an evocative half-moon, toes pointed into the void.\nI find it so difficult to watch her now, her narrow, monkish face, not a pore wasted, her eyes huge and sepia-toned, her smile enormous, full of the peculiar, feral excitement which in those days seemed to infect everyone who looked up into the evening sky to see Venus there, seducing behind veils of light, as she has always done. Those who looked and had eyes only for red Mars, all baleful and bright, were rough, raucous, ready and hale. Those who saw Venus were lost.\nShe was such a figure then: Bysshe, no surname, or simply the Documentarian. Her revolving lovers made the newsreels spin, her films packed the nickelodeons and wrapped the streets three times ‘round. Weeks before a Bysshe opened, buskers and salesmen would camp out on the thoroughfares beside every theater, selling genuine cells she touched with her own hand and replica spangled cages from To Thee, Bright Queen! sized just right to hold a male of Saturnine extraction. Her father, Percival Unck, was a brooding and notorious director in his time, his gothic dramas full of wraith-like heroines with black, bruised eyes and mouths perpetually agape with horror or orgiastic transcendence. Her mother was, naturally, one of those ever-transported actresses, though which one it is hard to remember, since each Unck leading lady became, by association and binding contract, little black-bobbed Bysshe’s mother-of-the-moment. Thus it is possible to see, in her flickering, dust-scratched face, the echoes of a dozen fleeting, hopeful actresses, easily forgotten but for the legacy of their adoptive daughter’s famous, lean features, her scornful, knowing grin.\nBysshe rejected her father’s idiom utterly. Her film debut in Unck’s The Spectres of Mare Nubium is charming, to say the least. During the famous ballroom sequence wherein the decadent dowager Clarena Schirm is beset with the ghosts of her victims, little Bysshe can be seen crouching unhappily near the rice-wine fountain, picking at the pearls on her traditional lunar kokoshnik and rubbing at her make-up. The legend goes that when Percival Unck tried to smudge his daughter’s eyes with black shadows and convince her to pretend herself a poor Schirm relation while an airy phantasm—years later to become her seventh mother—swooped down upon the innocent child, Bysshe looked up exasperatedly and said: “Papa. This is silly! I want only to be myself!”\nAnd so she would be, forever, only and always Bysshe. As soon as she could work the crank on a cinematographe herself, she set about recording “the really real and actual world” (age 7) or “the genuine and righteous world of the true tale,” (age 21) and declaring her father’s beloved ghosts and devils “a load of double exposure drivel.” Her first documentary, The Famine Queen of Phobos, brought the colony’s food riots to harsh light, and earned her a Lumiere medal, a prize Percival Unck would never receive. When asked if his daughter’s polemics against fictive cinema had embittered him, Unck smiled in his raffish, canine way and said: “The lens, my good man, does not discriminate between the real and the unreal.”\nOf her final film, The Radiant Car Thy Sparrows Drew, only five sequences remain, badly damaged. Though they have been widely copied, cut up and re-used in countless sallow and imitative documentaries on her life, the originals continue to deteriorate in their crystalline museum displays. I go there, to the Grand Eternal Exhibition, in the evenings, to watch them rot. It comforts me. I place my brow upon the cool wall, and she flashes before my eyes, smiling, waving, crawling into the mouth of the cannon-capsule with the ease of a natural performer, a natural aeronaut—and perhaps those were always much the same thing.\nEXT. Former Site of the Village of Adonis, on the Shores of the Sea of Qadesh, Night.\nA small boy, head bent, dressed in the uniform of a callowhale diver, walks in circles in what was once the village center. The trees and omnipresent cacao-ferns are splashed with a milky spatter. He does not look up as the camera watches him. He simply turns and turns and turns, over and over. The corrupted film skips and jumps; the boy seems to leap through his circuit, flashing in and out of sight.\nWhen she was seventeen, Bysshe and her beloved cinematographe, George, followed the Bedouin road to Neptune for two years, resulting in her elegiac And the Sea Remembered, Suddenly. There, they say, she learned her skill at the sculpting of titanium, aquatic animal handling, and a sexual variant of Samayika mediation developed by a cult of levitation on tiny Halimede, where the wind blows warm and violet. There is a sequence, towards the melancholy conclusion of And the Sea, wherein Bysshe visits coral-devoured Enki, the great floating city which circumnavigates the planet once a decade, buoyed the lugubrious Neptunian current. Reclining on chaises with glass screens raised to keep out the perpetual rain, Bysshe smokes a ball of creamy, heady af-yun with a woman-levitator, her hair lashed with leather whips. When theaters received the prints of And the Sea, a phonograph and several records were included, so that Bysshe herself could narrate her opus to audiences across the world. A solemn bellhop changed the record when the onscreen Bysshe winked, seemingly to no one. And so one may sit on a plush chair, still, and hear her deep, nasal voice echo loudly—too loud, too loud!—in the theater.\nThe levitator told her of a town called Adonis, a whole colony on Venus that vanished in the space of a night. Divers they were, mostly, subject both to the great callowhales with their translucent skin and the tourists who came to watch and shiver in cathartic delight as the divers risked their lives to milk the recalcitrant mothers in their hibernation. They built a sweet village on the shores of the Qadesh, plaiting their roofs with grease-weed and hammering doors from the chunks of raw copper which comprised the ersatz Venusian beach. They lived; they ate the thready local cacao and shot, once or twice a year, a leathery ‘Tryx from the sky, enough to keep them all in fat and protein for months.\n“It was a good life,” the blue-skinned levitator said, and Bysshe, on her slick black record, imitated the breathy, shy accent of Halimede as onscreen version of herself loaded another lump of af-yun into the atomizer. “And then, one day—pop! All gone. Houses, stairs, meat-smoking racks, diving bells.”\n“This sort of thing happens,” Bysshe dismissed it all with a wave of her hand. “What planet is there without a mysteriously vanished colony to pull in the tourist cash? Slap up a couple of alien runes on a burned-out doorframe and people will stream in from every terminus. Might as well call them all New Roanoke and have done with it.” (In fact, one of Percival Unck’s less popular films was The Abduction of Prosperina, a loose retelling of that lost Plutonian city, though presumably with rather more demonic ice-dragons than were actually involved.)\nCrab-heart trifles and saltwhiskey were passed around as Bysshe’s crew laughed and nodded along with her. The levitator smiled.\n“Of course, Miss,” she said, eyes downcast within the equine blinders knotted to her head. “Well, except for the little boy. The one who was left behind. They say he’s still there. He’s stuck, somehow, in the middle of where the village used to be, just walking around in circles, around and around. Like a skip on a phonograph. He never even stops to sleep.” The Documentarian frowns sourly in black and white, her disapproval of such fancies, her father’s fancies, disappeared heroines and eldritch locations where something terrible surely occurred, showing in the wrinkling of her brow, the tapping of her fingernails against the atomizer as bubbling storms lapped their glass cupola, and armored penance-fish nosed the flotation arrays, their jaw-lanterns flashing.\nBut you can see her thinking, the new film, which was to be her last, taking shape behind her eyes.\nThis is what she came to see.\nDead Adonis, laid out in state on the beach-head. Her single mourner. The great ocean provides a kind of score for her starlit landing, and in the old days a foley-boy would thrash rushes against the floor of the theater to simulate the colossal, dusky red tide of the Qadesh. We would all squint in the dark, and try to see scarlet in the monochrome waves, emerald in the undulating cacao-ferns. The black silk balloon crinkles and billows lightly on the strand, clinging to the ruin of the landing capsule. The dwarf moon Anchises shines a kind of limping, diffident light on Bysshe as she walks into frame, her short hair sweat-curled in the wilting wind. She has thrown the exhibition costume into an offscreen campfire and is clothed now in her accustomed jodhpurs and famous black jacket. The boy turns and turns. His hands flicker and blur as if he is signing something, or writing on phantom paper. She holds out her hand as though approaching a horse, squats down beside the child in a friendly, schoolteacherly fashion. The boy does not raise his head to look at her. He stares at his feet. Bysshe looks uncertainly over her shoulder at the long snarl of sea behind them—the cinematographe operator, temporarily trusted with the care and feeding of George, says something to her offscreen, he must, because she cocks her head as though considering a riddle and says something back to him. Her mouth moves in the silent footage, mouthing words the audience cannot ever quite read.\nOnce, a deaf scholar was brought to view this little scene in a private projector room. She was given coffee and a treacle tart. She reported the words as: Look at the whales. Are they getting closer?\nBysshe stands up straight and strides without warning into the child’s path, blocking his little pilgrim’s progress around the sad patch of dune grass.\nThe child does not stop. He collides with Bysshe, steps back, collides with her again. He beats his head against her soft belly. Back and forth, back and forth.\nThe Documentarian looks helplessly into the camera.\nEXT. Former Site of the Village of Adonis, afternoon.\nOne of the crewmen shaves in a mirror nailed to furry black cacao-fern bark. He uses a straight razor whose handle is inlaid with fossilized kelp. He is shirtless and circus huge, his face angular and broad. He catches a glimpse of Bysshe in his mirror and whirls to catch her up, kissing her and smearing shaving cream on her face. She laughs and punches his arm—he recoils in mock agony. It is a pleasant scene. This is Erasmo St. John, the Documentarian’s lover and lighting-master, who would later claim to have fathered a child with her, despite being unable to produce a convincing moppet.\nClouds drift down in long, indistinct spirals. Behind them, the boy turns and turns, still, celluloid transforming the brutal orange of the Venusian sun into a blinding white nova. Beyond him, pearlescent islands hump up out of the foamy Qadesh—callowhales, a whole pod, silent, pale.\nAdonis was established some twenty years prior to the Bysshe expedition, one of many villages eager to take advantage of the callowhale hibernations. What, precisely, callowhale is is still the subject of debate. There are diagrams, to be sure—one even accompanies the Radiant Car press kit—but these are guesses only. It cannot even be safely said whether they are animal or vegetable matter. The first aeronauts, their braggart flags flapping in that first, raw breeze, assumed them to be barren islands. The huge masses simply lay motionless in the water, their surfaces milky, motley, the occasional swirl of chemical blue or gold sizzling through their depths. But soon enough, divers and fishermen and treasure-seekers flocked to the watery promise of Venus, and they called the creatures true. Beneath the waterline were calm, even dead leviathans—taninim, said a neo-Hasidic bounty hunter, some sort of proto-pliosaur, said one of the myriad research corps. Their fins lay flush against their flanks, horned and barbed. Their eyes were then perpetually shut—hibernating, said the research cotillion. Dreaming, said the rest. From their flat, wide skulls extended long, fern-like antennae which curled in fractal infinitude, tangling with the others of their occasional pods, their fronds stroking one another lightly, imperceptibly, in the quick, clever Qadesh currents. Whether they have any sentience is popular tea-chatter—their hibernation cycle seems to be much longer than a human life.\nSome few divers claim to have heard them sing—the word they give to a series of unpredictable vibrations that occasionally shiver through the fern-antennae. Like sonar, these quaking oscillations can be fatal to any living thing caught up in them—unlike sonar, the unfortunates are instantly vaporized into constituent atoms. Yet the divers say that from a safe distance, their echoes brush against the skin in strange and intimate patterns, like music, like lovemaking. The divers cannot look at the camera when they speak of these things, as though it is the eye of God and by not meeting His gaze, they may preserve virtue. The vibrations are the color of morning, they whisper.\nIt is the milk the divers are after—nearly everything produced on Venus contains callowhale milk, the consistency of honey, the color of cream, the taste something like sucking on a dandelion stem caked in green peppercorn. It is protein-rich, fat-clotted, thick with vitamins—equally sought after as an industrial lubricant, foodstuff, fuel, as an ingredient in medicines, anesthesia, illicit hallucinogens, poured into molds and dried as an exotic building material. Certain artists have created entire murals from it, which looked upon straight seem like blank canvases, but seen slant-wise reveal impossibly complex patterns of shades of white. Little by little, Venusian-born children began to be reared on the stuff, to no apparent ill effect—and the practice became fashionable among the sorts of people whose fashions become the morality of the crowds. Erasmo St. John pioneered a kind of long-lit camera lantern by scalding the milk at low temperatures, producing an eerie phosphorescence. The later Unck films use this to great effect as spectral light. Cultivation has always been dangerous—the tubules that secrete milk are part and parcel of the ferny antennae, extending from the throat-sac of the callowhale. In order to harvest it, the diver must avoid the tendrils of fern and hope upon hope that the whale is not seized with a sudden desire to sing. For this danger, and for the callowhales’ rude insistence upon evolving on Venus and not some more convenient locale, the milk was so precious that dozens of coastal towns could be sustained by encouraging a relatively small population of municipal divers. Stock footage sent back to earth shows family after beaming family, clad in glittering counterpressure mesh, dark copper diving bells tucked neatly under their arms, hoisting healthy, robust goblets of milk, toasting the empire back home.\nBut where there is milk, there is mating, isn’t there? There are children. The ghost-voice of Bysshe comes over the phonograph as the final shot of And the Sea Remembered, Suddenly flickers silver-dark and the floating Neptunian pleasure-domes recede. Everyone knew where she was bound next, long before principal photography ever began. To Venus, and Adonis, to the little village rich in milk and children that vanished two decades after its founding, while the callowhales watched offshore, impassive, unperturbed.\nEXT. Village Green, Twilight.\nBysshe is grabbing the child’s hand urgently while he screams, soundlessly, held brutally still in his steps by the gaffer and the key grip, whose muscles bulge with what appears to be a colossal effort—keeping this single, tiny, bird-boned child from his circuit. The Documentarian’s jagged hair and occasionally her chin swing in and out of frame as she struggles with him. She turns over the boy’s hand, roughly, to show the camera what she has found there: tiny fronds growing from his skin, tendrils like ferns, seeking, wavering, wet with milk. The film jumps and shudders; the child’s hand vibrates, faster, faster.\nIt is a difficult thing, to have an aftermath without an event.\nThe tabloids, ever beloved of Bysshe and her exploits, heralded the return of the expedition long before the orbits were favorable. They salivated for the new work, which would surely set records for attendance. The nickelodeons began taking ticket orders a year in advance, installing the revolutionary new sound equipment which might allow us all to hear the sound of the surf on a Venusian shore. The balloon was sighted in orbit and spontaneous, Romanesque gin-triumphs were held in three national capitals. Finally, on a grassy field outside Vancouver, the black silk confection of Bysshe’s studio balloon wrinkled and sighed to rest on the spring ground. The grips and gaffers came out first, their eyes downcast, refusing to speak. Then the producer, clutching his hat to his chest. Lastly came Erasmo St. John, clutching the hand of the greatest star of the coming century: a little boy with ferns in his fists.\nBysshe did not return. Her crew would not speak of where she had gone, only that she was to be left to it, called dead if not actually deceased—and possibly deceased. They mumbled; they evaded. Their damaged film, waterlogged and half-missing, was hurried into theaters and pored over by hundreds of actors, scholars, gossip columnists. It is said that Percival Unck only once viewed the reels. He looked into his lap when the last shot had faded to black and smiled, a secret smile, of regret, perhaps, or of victory.\nThe boy was sent to school, paid for by the studio. He was given a new name, though later in life he, too, would eschew any surname, having no family connections to speak of save to a dead documentarian. He wore gloves, always, and shared his memories as generously as he could with the waves of popular interest in Venus, in Adonis, in the lost film. No, I don’t remember what happened to my parents. I’m sorry, I wish I did. One day they were gone. Yes, I remember Bysshe. She gave me a lemon candy.\nAnd I do remember her. The jacket only looks black on film. I remember—it was red.\nI once saw a group of performance artists—rich students with little better to do, I thought—mount a showing of the shredded, abrupt footage of The Radiant Car, intercut with highlights of the great Unck gothics. The effect was strange and sad: Bysshe seemed to step out of her lover’s arms and into a ballroom, becoming suddenly an unhappy little girl, only to leap out again, shimmering into the shape of another child, with a serious expression, turning in endless circles on a green lawn. One of the students, whose hair was plaited and piled upon her head, soaked and crusted in callowhale milk until it glowed with a faint phosphor, stood before the screen with a brass bullhorn. She wore a bustle frame but no bustle, shoelaces lashed in criss-crossings around her calves but no shoes. The jingly player-piano kept time with the film, and behind her Bysshe stared intently into the phantasm of a distant audience, unknowable as God.\n“Ask yourself,” she cried brazenly, clutching her small, naked breasts. “As Bysshe had the courage to ask! What is milk for, if not to nurture a new generation, a new world? We have never seen a callowhale calf, yet the mothers endlessly nurse. What do they nurture, out there in their red sea? I will tell you. For the space is not smooth that darkly floats between our earth and that morning star, Lucifer’s star, in eternal revolt against the order of heaven. It is thick, it is swollen, its disrupted proteins skittering across the black like foam—like milk spilled across the stars. And in this quantum milk how many bubbles may form and break, how many abortive universes gestated by the eternal sleeping mothers may burgeon and burst? I suggest this awe-ful idea: Venus is an anchor, where all waveforms meet in a radiant scarlet sea, where the milk of creation is milled, and we have pillaged it, gorged upon it all unknowing. Perhaps in each bubble of milk is a world suckled at the breast of a pearlescent cetacean. Perhaps there is one where Venus is no watery Eden as close as a sister, but a distant inferno of steam and stone, lifeless, blistered. Perhaps you have drunk the milk of this world—perhaps I have, and destroyed it with my digestion. Perhaps a skin of probabilistic milk, dribbling from the mouths of babes, is all that separates our world from the others. Perhaps the villagers of Adonis drank so deeply of the primordial milk that they became as the great mothers, blinking through worlds like holes burned in film—leaving behind only the last child born, who had not yet enough of the milk to change, circling, circling the place where the bubble between worlds burst!” The girl let her milk-barnacled hair fall with a violent gesture, dripping the peppery-sharp smelling cream onto the stage.\n“Bysshe asked the great question: where did Adonis go in death? The old tales know. Adonis returned to his mother, the Queen of the Dark, the Queen of the Otherworld.” Behind her, on a forty-foot screen, the boy’s fern-bound palm—my palm, my vanished hand—shivered and vibrated and faded into the thoughtful, narrow face of Bysshe as she hears for the first time the name of Adonis. The girl screams: “Even here on Earth we have supped all our lives on this alien milk. We are the calves of the callowhales, and no human mothers. We will ride upon the milky foam, and one day, one distant, distant day, our heads will break the surf of a red sea, and the eyes of the whales will open, and weep, and dote upon us!”\nThe girl held up her hand, palm outward, to the meager audience. I squinted. There, on her skin, where her heart line and fate line ought to have been, was a tiny fern, almost imperceptible, but wavering nonetheless, uncertain, ethereal, new.\nA rush of blood beat at my brow. As if compelled by strings and pulleys, I raised up my own palm in return. Between the two fronds, some silent shiver passed, the color of morning.\nINT. The depths of the sea of Qadesh.\nBysshe swims through the murky water, holding one of Erasmo’s milk-lanterns out before her. St. John follows behind with George, encased in a crystal canister. The film is badly stained and burned through several frames. She swims upward, dropping lead weights from her shimmering counterpressure mesh as she rises. The grille of her diving bell gleams faintly in the shadows. Above her, slowly, the belly of a callowhale comes into view. It is impossibly massive, the size of a sky. Bysshe strains towards it, extending her fingers to touch it, just once, as if to verify it for herself, that such a thing could be real.\nThe audience will always and forever see it before Bysshe does. A slit in the side of the great whale, like a door opening. As the Documentarian stretches towards it, with an instinctual blocking that is nothing short of spectacular—the suddenly tiny figure of a young woman frozen forever in this pose of surprise, of yearning, in the center of the shot—the eye of the callowhale, so huge as to encompass the whole screen, opens around her.\nCatherynne M. Valente is the New York Times bestselling author of over two dozen works of fiction and poetry, including Palimpsest, the Orphan's Tales series, Deathless, Radiance, and the crowdfunded phenomenon The Girl Who Circumnavigated Fairyland in a Ship of Own Making (and the four books that followed it). She is the winner of the Andre Norton, Tiptree, Sturgeon, Prix Imaginales, Eugie Foster Memorial, Mythopoeic, Rhysling, Lambda, Locus, Romantic Times' Critics Choice and Hugo awards. She has been a finalist for the Nebula and World Fantasy Awards. She lives on an island off the coast of Maine with a small but growing menagerie of beasts, some of which are human.", "source": "https://clarkesworldmagazine.com/valente_08_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Radiant Car Thy Sparrows Drew by Catherynne M. Valente"}