{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ziggy Schutz", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "K6ft1NChm/j0VZ5fwi4RPEsNikc=", "id": null, "license": null, "comments": "", "raw_text": "6680 words, short story  It is a Pleasure to Receive You  If one wants to feel small, all one has to do is look up at the sky on a clear night. There is something about the stretch of the horizon, about the distance between you and each bright spark, numbers that feel so large as to be nearly impossible summed up in a simple gesture.  Some might find it terrifying, but Simon’s always found that anonymity to be a comfort. No matter how often he stumbles, how many mistakes he might make, they mean nothing against the great scope of the universe.  And when the chance came, to throw himself into that expanse, to pull space around him like a favorite blanket and float through it like a dream, he threw himself at it with more will and want than he’d ever done anything in his sixteen years of life.  Caught up in the constellations, his very own satellite is just another spark in a vast sky, and there’s something poetic about how it’s only once he’s surrounded by the vacuum of space that he’s able to breathe deeply.  Simon is the sole occupant of the communications satellite Nirah-89, and most days are this—staring out at the stars, Earth indistinguishable from everything else in the universe, and caught up in the wonder that his little home manages to pick up anything at all.  But she does, and so he sits at his desk, listening to all of the messages that humans have sent into space, as sound waves flash by on his screen. He listens, notes where they are coming from and if there has been any response. For the older ones, the rusty and the rough, he pauses, runs them through his systems and his fingers until they’re smooth once more, adjusting levels and tidying up tones until they’re almost as good as new, and then he sends them on their way again.  How tragic would it be, after all, if one of these decades-old messages were to finally find its way to someone who needed it, and it was too tired to be heard?  In the grand scheme of things, he’s just a little speck in the larger picture that is space expansion and exploration. Many of these oldest messages were sent before humans ever settled onto other worlds, before they expanded to the edges of their solar system and beyond, comingling with all they found there. And many of the newer ones are nothing important, echoes of letters home and shopping lists for space station stopovers that are months past, now.  But it’s not his job, to determine which of these messages hold value. Simon is no museum curator, only selecting the most significant voices to honor. No, he’s simply an archivist and janitor, tidying the papers he finds on the floor, leaving the sorting through them to decide which ones can be recycled for someone else.  Maybe this is why he reacts the way he does, when a particular set of words come through his systems just as he’s about to tuck himself into bed. He could blame the late hour (in the way that every hour is a late one, he runs off of his own time here, dictated by his needs for sleep and for food more than any number or clock), or the fact that it’s midway between one supply ship visit and the next, meaning it’s the longest he goes without talking to another person.  Whatever it is, when he hears a stranger wonder if anyone is listening, hears how their voice breaks as they ask if anyone has ever, he does what janitors and archivists and satellites are never supposed to do.  He engages.  He answers.  “Yes, I hear you,” he says, and is shocked by how steady his voice is, when everything around him is vibrating. The satellite, as it continues its lonely orbit. His skeleton, at the breaking of rules, at the effort of reaching out. But his voice is steady, calm enough to almost feel like a lie, except that he never quite got the hang of lying, never thought to practice it with his peers, instead preferring to spend his time playing pretend with imaginary friends.  Maybe that’s why it feels so easy. With no visuals, he can close his eyes and pretend the voice belongs to some conjured companion, as opposed to a person, somewhere else entirely, only sharing this moment with him through happenstance and an inconsistent sleep schedule.  “And are you real?” asks the soft voice, no hesitation, just hope.  It’s a question Simon has asked himself before, on the days that bleed into nights and back again, where sleep is more memory than reality, and he’s not sure if the ship is spinning or if that’s all him.  But when faced with someone asking, the answer is easy.  “Yes,” he says. “Are you?”  “ . . . I think so.” The reply is slower this time, but the words no less honest, no less bare. “Wasn’t sure for a second, there. But I am now.”  “Good.” Simon smiles. “You’ve reached the satellite Nirah-86. Do you have a message you would like to send?”  “I do,” they say, and Simon would like to imagine that they are smiling back. “Thank you.”  It’s not that they’re not allowed to call. He knows, in theory, that many of the satellites make calls home. Often, even. There’s only so far their entertainment packages can take them before something a little more substantial is needed, something more personal.  It’s just that he’s never done it. Called home. Not really something he’s interested in, and most of the friends he’d managed to make in school were fleeting at best, held together more by convenience than any real connection.  And they’re definitely not supposed to be responding to the messages they hear. At training, Simon had been told over and over that it was best to break down each message into collections of meaningless words. It makes them more objective, means that they wouldn’t accidentally add their biases to the transmissions in the form of emphasis, cultural context, or translation.  Nirah-86’s systems can speak almost every language humanity has ever made, plus an ever-growing database of alien dialects and settlement slang.  Simon can only speak about seven, but he’s working on it, over his morning meals and in the quiet moments the days find.  He still lets the computers do the translating. He just likes to follow along. Likes to understand.  It’s easier to make their messages shine, when he has an idea of what they were doing, when they were sending them. Who they were, even if it’s all just guesswork.  Imaginary friends, again.  “I think I’m technically a prospector,” they say. They’ve talked well through Simon’s night, and their voice is raspy. This time, not with the desperation that had them reaching out in the first place, but with the wear that comes through talking for hours with a stranger. “But I prefer gardener, and it’s not like anyone is around to argue with me over it.”  Their accent has the rolling highs and lows of Saturn’s moons, settled early on in the expansion and largely unchanged since. Their name—“Lyrical Wonder, but only my mothers use the full thing. Lyric is just fine”—also speaks of an old family, and Simon can’t help but wonder what sent them spinning off-moon, landing in a digital swamp somewhere on Earth, combing through old deleted files and abandoned clouds for anything tangible.  “What do you do,” he asks. “When you find them?”  That much discarded information makes the ground soggy, the air damp, a man-made bog with little in the way of life, and always a threat of spreading. That’s what people like Lyric are there for, or so they explain. To keep the boundaries clear, to stop the slow creep, to encourage the growth of plants and things with roots that know to reach for the sun.  Simon hadn’t known that there were scraps of paper to be found, too. That sometimes the tossed info came in the form of books, newspapers from before either of them were born. But there are, and Lyric finds them, sifts through the mire with a net and a song, pockets full of pages.  “I plant them.” Their smile is obvious in their words, an affection often reserved for pets or small children sneaking into their voice. “If I’m lucky, they’ll grow.”  A garden, in the middle of a place that’s supposedly known for its still water, its lack of life.  “What do they grow into?” Simon can’t imagine it, and there’s a need in his words, to understand, to be able to picture it, if he can.  “Oh, Nirah-86,” And there’s something intimate in Lyric’s voice, as they shape the name of a satellite with their gentle tone. Something that cuts through the miles between them, like a hand on his shoulder. “Whatever they know how to be.”  “Simon,” he corrects them. “The satellite is Nirah-86. I’m Simon.”  “Simon, then.” A little laugh. “This is usually where I shake a new friend’s hand.”  “I’ll accept an IOU,” he replies, before he can overthink it, and the laugh grows, passed between them until they’re both giggling. A sound so small shouldn’t be able to fill up the whole ship, Simon thinks, but it does, lingering in the corners like stardust.  He looks it up later, when Lyric’s soft words have shifted into the even softer sounds of sleep. Recycled nanotech, something almost obsolete turned into art and metaphor instead. Fragments of things can grow in all sorts of ways. Most often, flowers with paper petals, folded as delicately as nature can manage, ink turned to gentle coloring and shades. Pretty, although not particularly useful.  But sometimes, under the hands of a good gardener, they’ll grow into whatever they have words for. Whatever their bits of story captured.  Simon sits, thousands of miles away from anyone at all, the sound of a new friend sleeping in his ears, and wonders if that isn’t what they all do. Grow into whatever shape they have words for.  It’s not supposed to be a sad thing, he thinks, as he feels his chest grow tight.  But he can’t help but wonder what words he’s missing from his own makeup. What he could become, if only his vocabulary were a little bit larger.  Maybe it’s time to work on language number eight.  “It’s really only breaking the rules once.”  Lyric’s logic is a little sideways, in Simon’s opinion. They approach problems from angles Simon hasn’t learned how to see, offer solutions by skipping steps altogether, and they can deliver it all in such a steady tone that it doesn’t even sound all that out there.  “After that, it’s just phone calls home. And you’re allowed those!” There’s a pause, and then a hurried addendum, their voice pitched up in panic. “Not that I’m calling myself your home, or anything!”  Funny. Lyric’s voice has slipped so easily into the simple routines that make up his life. If they hadn’t drawn attention to their phrasing, he would never have questioned it.  “You’re fine,” he assures them. “You’re right. We’re allowed to call friends. And there’s no small print about how we’re supposed to have met those friends.”  He knows because he checked.  “If anyone asks, we can say we met . . . ”  “On a reality broadcast,” Lyric suggests, anxiety discarded in favor of this new game. They’d told him distractions always work best. “At a conference for left-handed folks.”  Simon’s already laughing. “I’m not left-handed.”  “Neither am I,” Lyric admits, and they’re laughing too. “We’re time travelers, we met a century ago when we both went to assassinate the same person.”  That shouldn’t make him laugh harder, but it does, sends him spinning off to the corner of the room, because his satellite had decided it was the perfect day to run updates on its gravitational system, and he’d forgotten to strap himself in.  It’s what he blames, for the giddy, weightless feeling that talking to Lyric fills him with.  “Hate to break it to you, but I’m not a time traveling assassin, either.”  “Not yet, you’re not,” Lyric chirps back, and Simon sees stars.  Sometimes, Lyric’s words come quick and fast, and Simon has to scramble to keep up. But sometimes it’s quiet days, where full minutes pass after starting a call before they even say hello.  On days where Lyric’s words have run dry, he lets them listen in while he works.  It’s only fair, he tells himself. They’ve got him invested in each plant and scrap in their garden, so why not let them listen in as he works away on the messages that find him? And they get it, without him having to explain. Why it feels important, even if there’s no one waiting on the other end.  Of course, that’s how it happens. He never would have done it on his own, wouldn’t have had the words or the bravery to go with them.  The message is a short one, but crystal clear. A single voice, laughing weakly as the owner of the voice asks if anyone knows how to wrap up a broken ankle well enough to stand on it.  “Simon,” Lyric says, voice gone tight with worry, with urgency.  “I don’t know,” he admits. He took another language, instead of the first aid course. “I can look it up, but we have no idea if they’ll be able to hear us, if they’re even still listening—”  “We can try.” And Lyric’s right, they should try, but he’s frozen, too far away to be of any help, listening to the laughter turn into a pained whine as the stranger attempts to stand.  “I don’t know what to do.” He feels like he’s failing, like he’s falling, but Lyric is there, calm in the face of someone’s pain in a way they never quite manage with their own.  “Patch me through,” they’re saying. “I know how, patch me through.”  And Simon breaks the rules a second time.  “Hey,” Lyric says, talking to the stranger now. “Can you hear me? We can hear you. I’m Lyric, they/them. I can talk you through it. We’re here to help.”  The “we” makes Simon wince. He’s done nothing but connect them, connect them and panic.  “Sup, Lyric,” says the voice on the other end, and there’s a relief to the voice now, a relief Simon lets sink into his own limbs. “M’Nova, she/her. Not to rush you, but I’m not exactly in a place I’m supposed to be, right now, so if you can speed run me through this . . . ”  And Lyric does, steady and sure. Hands used to coaxing seeds made up of punctuation to grow in places they shouldn’t be able to now walk Nova through a bandage wound like a trellis, not even stumbling when Nova explains that she’s only got one hand to work with, on account of her other one being in the shop.  “Got strong teeth, though,” she says, and Simon thinks of grins with bloody teeth, of what “survivor” looks like in his mind, and adds to that image a low laugh, a voice raspy and sharp, like at any moment it’s about to grow claws.  When Nova is able to push herself to standing, Lyric actually claps, they’re so caught up in the moment. If Simon were a little less frozen, he would have been right there with them.  “Cute,” Nova says, and then there’s the sound of shouts in the background, and she curses.  “Gotta go, thanks for the save!”  The transmission ends, and Lyric and Simon sit in silence, the space given at the end of a song to let it really sink in.  This is the place to applaud, he thinks, and Lyric lets out a shaky breath that sounds like it’s been held for far too long.  “Think we’ll hear from her again?” Lyric asks, hours later, and Simon marvels at how they can be so far apart and still thinking the same thing.  “Hard to say,” Simon says. “Never really done this before. She seems like the kind of person to do whatever is least expected, anyway. Just to say she did.”  “Yeah.” Lyric hums for a few bars, which Simon knows means they’re thinking.  “I guess I’ll just have to expect to not meet her again, then.”  Simon smiles, softer than he should. It’s fine. Only his satellite’s ceiling is here to see it.  “I’ll do the same.”  The next day, Simon catches the tail end of a transmission in a familiar voice, asking if the stars had any clever medical advice to share today.  “No stars here,” he says, as Lyric’s voice jumps up in excitement.  “Yeah,” Nova answers, like she breaks ankles and takes part in daring rescues every day. “Stars aren’t nearly so generous with their skills.”  The stars aren’t exactly around to defend themselves, and they’re basically Simon’s neighbors, so he takes on that task himself.  With three people laughing at once, the satellite feels bigger than it ever has.  “So you’re a gardener in a place you’re not supposed to be able to garden,” Nova summarizes, and Lyric makes a noise that somehow sounds like a nod, wordless but no less clear. “And I’m a sculptor whose first art piece was my arm, and I did go for form over function.”  Simon thinks that’s a wild way to downplay the brilliance it must have taken, to design, build, and install her own arm. Especially since all of her materials come from the junkyard she’s been squatting in for the better half of a year, ever since whatever happened to make her lose her arm had inspired her to drop out of school and run full tilt at being a starving artist type.  “It’s like if graffiti was in three dimensions,” she’d said, trying to describe her work to the two of them. “Or tattoos, if tattoos could turn against you . . . And if they were made out of your mom’s old pocket kitchenette.”  Simon can’t picture it, but he wants to. Wants to see Nova’s sculptures just as much as he wants to wander through Lyric’s gardens.  “Quite a pair,” Simon says, and it is perhaps the wrong response, because he can feel Nova’s attention turn to him, can hear her smile get wider.  “What about you then, Simon-my-boy?” she asks. “You a walking contradiction like the rest of us?”  He doesn’t want to talk about what he does. He supposes it’s not that far off of what the both of them do, finding beauty in the discarded pieces of other people’s lives. But they both transform the scraps they find, into things new and stunning.  He just tidies up other people’s good words and sends them on their way again.  So he deflects, focuses on the wrong part of the sentence.  “Oh, I’m not a boy.” he says, nothing but cheer in the correction. “I collect genders like you collect space junk.”  It’s a good metaphor, he thinks, for all that he still can’t quite picture her work. Pretty pieces of potential on a shelf, and some days they fit one way and some days another.  “I just use he/him out of convenience.”  “Whose convenience?” Nova asks, sharp as skeptics, and he feels his heart flutter at how quick she is to ready herself to defend him.  “My own,” he assures her. “It’s for no one but myself. I like how it sounds, and it’s the most accurate the most of the time.”  He doesn’t get into the rest of it, how in this tiny satellite of his, he could be anyone, could wake up a new person each day, and that terrifies him. How easy, to lose yourself in space. He needs constants, needs touchstones of identity to keep him company. His name, his pronouns, they are like magnets on a fridge, pins on a board. Keeping the less permanent parts of him steady, for a time.  “Okay,” Lyric comes in, ballast to Nova’s sails. “If that changes, you’ll let us know, right?”  What a delightful thought, that they’d know each other long enough to update each other on things like shifting identities.  “I promise,” he says, and the future is sweet on his tongue.  Do you believe in fate, he almost asks, when Nova just so happens to call him on a night that is especially dark. She goes on about a piece of junk she’s found, how it bends just like a waterfall, and he listens, lets her fire light up the room.  Did you ever read fairy tales, he traces into his desk, not daring to ask out loud, on a morning where Lyric has enough words to walk them both through every flower they have growing. He hasn’t managed to sleep, but their voice makes it easier.  If we’d met differently, he practices out loud, on a day where both of them are busy, and he is alone. If I were closer, do you think . . . ?  He doesn’t know how to end that sentence, so he saves it. An unsent transmission. A secret, just for him and all of space.  It’s not like the universe cares, anyway.  Once he finds the perfect way to say it, he will, he tells himself, runs the sentences through every language he knows to see if one sounds better than the others.  Maybe it’s just a vocabulary issue again.  He’ll leave it for now.  “A shift is five months?”  Simon shrugs, a gesture more out of habit than any added meaning. Nova’s outrage on his behalf has quickly become a comfort, even if he still feels a twinge of guilt for bringing it out at all.  “It’s not like I have to stay up the whole time, or anything. It’s just easier on resources for us to stay up for extended periods of time. Sending a supply ship up to all of us, instead of us going down and up.” He brightens. “But we get a month or two off between shifts, if we’d like.”  “If you’d like.” Lyric’s not convinced. Neither is Nova, not even a little. She’s known him barely two months, Lyric only a few more, and already they both see through him better than anyone at home ever managed. It’s enough to make a satellite feel stripped bare. “So, if you wanted, you could stay up there even longer?”  Nova’s reading into his silence before he’s even made up his mind whether or not to answer, cutting to the quick.  “Hey, Simon? When was the last time you pulled your head out of the clouds?”  He hesitates again. Not because he doesn’t want to tell her, but because he needs to take a moment to count.  “ . . . Fourteen months,” he says.  “Simon,” she hisses, and he grimaces.  “It’s not on purpose!” he says, quick now, trying to cut off the lecture he knows he’ll get otherwise. “It’s just, my hometown isn’t exactly my favorite place, and my parents are really busy anyways, and they’ll just ask why I had to run away to the stars to avoid going to university, and I can’t be bothered to have that conversation with them again.”  He should really give them a call. It’s been almost a year.  Later, he assures himself. He’ll worry about it later.  “It’s not that I don’t want to come down,” he says. “I just don’t really have anywhere I’d want to land.”  “You didn’t,” Lyric corrects him, and the confidence alone winds him, leaves him blinking away the stinging in his eyes. “You didn’t. But that’s changed, right?”  “It better have,” Nova growls, and the growl makes him feel warm, hands to his cheeks so he can feel his own blush spread. “I’m working on something really neat, but it’s gonna sound stupid as hell if I try to describe it.”  “You’ll just have to go see it in person,” Lyric says, and how can he say no to them both, when they so perfectly overlap like this?  He should say yes. He should say yes, thank you, I would love that.  Instead, he starts to cry.  “Simon?” chorus two voices belonging to faces he has never seen, and he aches with it.  “Sorry,” he gets out, curling up on himself, tucked away in his chair. It’s on wheels, so that he can move it to the other rooms when he needs to. There’s only one chair, in this whole place. It was only made for one person, why would he need more than one?  “You don’t have to apologize,” Nora says, almost stepping on him in her haste to get the words out.  “Talk to us,” Lyric says. “Please, Simon.”  And he does.  “I think the whole world must be lonely.”  The words ring in his ears.  “Why do you say that?” Lyric asks, and their voice is soft, the way one might speak at a funeral.  “There are decades and decades of us sending letters to the stars. Not knowing if anyone would listen to them, desperate to connect, to have someone respond. Thousands of words, in as many languages as we’ve got. Reaching out to the sky, again and again, hoping against hope that someone will reach back.”  “That’s not—” Nova starts, but it’s Lyric’s voice that comes through clear.  “I don’t think that’s loneliness,” they say, that same whisper, threaded with a conviction like steel. “You said it yourself, Simon. That’s hope.”  There’s a hum of agreement from the other line.  Later, he’ll wonder when they all started to pick up each other’s speech patterns and verbal stims. But that’s for later.  Lyric continues.  “They reached out because they had hope that one day, their messages would find someone who was listening, hoping to hear something in the stars. It is in direct opposition of loneliness. How many of them use the word ‘friend’?”  “A lot of them,” he says, and they echo in his head. Greeting, friends. Friends of space. Welcome home. Before, they had always sounded like half-finished tragedies. But the words themselves don’t really say that, did they?  “I can see how someone might hear them and hear them just as messages never answered, and there’s something terribly lonely in that,” they continue. “But I think these words came from a much brighter place than that.”  “And they did find someone,” Nova comes in, and where Lyric is the wind, Nova is the river. “They found you, didn’t they? You heard them.”  “I did,” Simon confirms, and he wonders what his choked-up words sound like, sent across a thousand miles.  “Even if you’re the only person who ever hears them, they’ll have done what they were meant to do. They found someone out there and let them know that they had friends here. That they weren’t alone.”  Simon sits above the Earth in his little satellite, spinning through space at a pace he can largely not even comprehend, and he listens to two voices remind him that he is not alone, using the words he’s repeated to himself like a prayer on the most empty of nights.  They take on a new life, on their tongues, and he is reminded of the first time he found these words, his first shift, his first night away from home. How precious the words felt, held in his hands like seeds he couldn’t wait to plant, metal he couldn’t wait to bend.  When had they lost their shine? When had he stopped hearing the beauty in them, and instead interpreted them like a tragedy?  “Thank you,” he says, and he’s really sobbing now, but something’s changed. He doesn’t think it’s because he’s sad anymore.  He’d been taught, somewhere between grade school and the great adventure of space, that if someone is crying the best thing you can do is support them without commenting on it. It’s polite. It saves the person any embarrassment.  But he thinks that maybe the person who taught him that has never had two voices, different in every way, thousands of miles between them, say “oh, Simon,” in perfect synchronicity, as his voice breaks over the call and they reach out with all that they have to comfort him.  He falls asleep to their quiet conversations, and he sleeps without dreaming.  Do you think you can fall for two people at once? he asks the static.  There’s no answer.  He takes the words and buries them inside of him.  He doesn’t know what he’ll do, if they decide to grow.  The universe is infinite. This he knows.  But the world is circular, and he knows this too, orbits around it every day.  Life has infinite possibilities. That is what they say.  But it prefers to stick to patterns. To days and months and years, starting something the same place something else has ended. History repeats, little stories spin in circles, and transmissions loop.  Somewhere on Earth, in a digital swamp no one would really make note of, it is storming.  In space, there is no rain to hammer on the roof of a little cabin, to offer warning. There is no putting down your feet to find out that the water is already up to your ankles, and the fear that comes with that flood, because the ground is soft here. Perfect for planting.  Not perfect for escaping a mire that has snuck up on you in the night.  Simon doesn’t know any of these things, of course. For him, panic comes in the form of a staticky call for help, made crackling by the weather rather than by the age, and a voice he has grown to know so well, begging for help.  He’s up in an instant, heart in his throat as he sprints to his workstation.  “Lyric?” he calls down the line. “Lyric, can you hear me?”  With one hand, he is calling for Nova, because he needs her, because he can’t do this alone.  The other is doing what he does best, hours and hours sitting right here—cleaning up the message, so that every word is perfectly clear.  Nova joins him just in time to hear Lyric bite back a gasp.  “I’m stuck,” they cry, and there’s sounds Simon isn’t used to, the rushing of water and data, the sucking of solid ground suddenly turned to deep, deep mud.  “Thought you were supposed to leave yesterday?” Nova asks, and yes, yes, she’s right. The bog’s dangerous this time of year, Lyric was supposed to spend the next month or two in the city, waiting for the ground to get solid enough for planting again.  “There was . . . things were still growing,” Lyric confesses. “I was going to go today, but I . . . ”  Later. They can tell them off later. After they’re somewhere safe and dry.  But it was them, who walked Simon and Nova through the last crisis. Their steady voice, their careful hands.  “I’m sorry,” Lyric says, and Simon thinks they’ve said it a few times now. Panic is making it hard to catch each word. “I’m sorry, I keep sinking, I’m sorry . . . ”  “Simon,” Nova hisses, and her claws cut through the fear. “You have to tell me where they are.”  That’s not something he’s ever done. It’s the most important rule, after all. His job is not about the people who send these messages, just like it’s not about who receives them. He is not, under any circumstance, supposed to trace a transmission.  But this isn’t a transmission, says the part of him that sounds more and more like Lyric. This is a call home.  To hell with the rules, growls a part of him that parrots Nova’s bravery. Rules are only as good as the people they protect.  “I can try,” he says, and already his hands are moving. He’s never done this. But he knows this system, knows it better than he’s known anything.  He can take it apart, split it open and follow them, the seeds and the scraps and the nuts and bolts. He can tune in to the words, and more importantly, to the voice that’s saying them.  His instructors had told him that it didn’t matter, the person behind the messages he heard. That they were all as good as ghosts, as far as they were concerned.  They were wrong. They were wrong about so much, and this most of all.  For the third time, Simon of Satellite Nirah-86 breaks the rules.  “I’ve got you,” he promises Lyric, who’s sunk to their waist now, who reached out into the stars and just so happened to find him.  “We’ve got you,” he promises Nova, as he sends her a coordinate, listens to her bike roar like something wild as she goes speeding off.  He hadn’t looked before, but he’s looking now. All these months, and the two of them had been less than fifty miles from each other.  The universe is so big, but it doesn’t have to be. Sometimes it shrinks to just this. Just three people, moving as one, to save a life.  “You’re going to be okay,” he repeats, on loop like one of his favorite messages, polished to shining. “Nova’s almost there, you’re going to be okay.”  “I believe you,” Lyric assures him. “I’ve always believed you, Simon.”  He doesn’t know what he says, in those painful, stretched minutes or hours or years between that first cry for help and the distant sound of Nova’s voice through Lyric’s line, calling their name. He must say lots of things, because he talks the whole time, so that Lyric can save their breath for surviving, and Nova for the race toward them. Bits of messages he’d memorized before he’d met them, sentences they’d both said to him that stuck. Reworked, reshaped into something all its own, a monologue designed to reach down from the stars and pull Lyric up and out of that mud and into the arms of someone who loves them.  He talks until Nova gets close, and then he lends his shouts to Lyric’s, as they call until Nova spots them.  He only stops talking when Lyric’s line drops out, and it’s through Nova’s alone that he hears “I’ve got you, we’ve got you, told you we’d do it.”  And he cries along with them both, when they reach solid ground and he hears them both collapse with it, tangled in each other with his voice in between them, muffled by how tightly they’re holding onto each other, but never intruding.  This call has three heartbeats, all racing with their close call, and it’s to that pounding beat that one of them moves, and the other one responds, and Simon realizes that they’re kissing.  “You’re a force of nature, Ms. Nova,” Lyric finally gets out, and Simon can hear their smile.  “You’re an idiot,” Nova replies, but she’s smiling too.  “You’re okay,” Simon breathes. “You’re together and you’re okay.”  “We’re okay,” Lyric repeats, and then the rain that’s been the backing music to this all suddenly lets up, and Nova swears, and Lyric laughs, and as always, their laughter is contagious enough to catch.  They spend the first few minutes together laughing until the panic drains away like the storm.  Simon’s not sure if he believes in fate, or in rules, or in the patterns of the universe.  But he thinks he could be happy, just believing in this feeling. Whatever it happens to be.  Simon tries to give them space. He does. A lot has happened, and near-death experiences have a way of taking a lot out of you. Not to mention kissing someone you’d only just met. It’s a lot. He’s trying to be respectful.  Neither of them will have it.  “Look, I miss you too,” he admits, after Nova calls him five times in as many minutes, and he finally picks up. “But Lyric’s recovering, and the two of you are getting settled, and . . . I mean, the two of you kissed. You’re . . . shouldn’t you talk about this? Before just inviting me to visit?”  “If you’d been here, I’d have kissed you too, idiot.” Nova says, and he’s so stunned that he forgets, for a second, every language he knows.  “It is something we should talk about,” Lyric says, and there’s still a thrill, to seeing both of their voices come through one transmission. “But conversations like this are best had in person. Don’t you think?”  So they’re really serious. Simon hums, a thinking noise, and looks over at the screen that serves as calendar and countdown both.  . . . His shift is up in three days.  How had he not noticed?  “Because you’ve never had a reason to look forward to it before,” Nova says, responding to a question he must have asked out loud. “Because you’re a workaholic.”  “We all are,” Simon reminds her, and then makes a face. Might be a bit soon, when Lyric’s work had so recently almost killed them.  But there’s laughter on the other end, and he relaxes. Not too soon, then. Or maybe they’ve all just been looking for an excuse to laugh in the face of what they had just survived.  “Yes,” Lyric agrees. “Maybe we all need a break.”  “ . . . I have some vacation saved up,” Simon admits. Months and months of it, although he doesn’t want to start with that. Doesn’t want to move too fast. “If you’re both sure. If you don’t mind.”  “Come on down, Simon Satellite,” Nova calls, singsong. “Come be our summer fling.”  If Simon is remembering right, it’s not even midwinter where they are.  It’s an invitation, then. A long one.  It’s a place to land.  Simon swallows, mouth gone dry with anxiety. No, not quite. With a terrifying, intoxicating anticipation.  “I can be there in three weeks,” he says.  “Holding you to that, then.”  “We’ll be waiting,” Lyric adds, and there they go again. Making promises of a future Simon is less and less scared to imagine.  Simon still feels small, when he looks up at the sky.  There’s no such thing as a clear night, in the bogs. There’s always a slight blur to the air, millions of bytes of information drifting through their final resting place.  It makes the stars seem closer, somehow. Brighter.  The horizon still stretches out in every direction, but to Simon’s left is a short someone with hair that curls tighter in the humidity, and the night looks so much smaller, when mirrored by their dark skin, freckles like their own constellations, ones Simon cannot wait to study.  And to Simon’s right is a taller girl, smile sharp and daring, and her arm interrupts any straight lines, as she points at the world and questions what everyone else has gone and accepted as truths, and her pale cheeks go red when Simon reaches out and captures her hand, tangling their fingers together and suggesting that maybe, they can find the answers together.  The numbers that make up the impossible expanse of space feel smaller, when viewed by three.  Maybe they really do mean nothing, in the grand scheme of things.  But maybe that’s not the point.  The universe doesn’t know who he is, and that’s fine. He’s not really anyone—just a satellite, just space junk held together by scribbled equations and an outdated sound system.  But he doesn’t need to be someone important to the universe, to be someone to the two on either side of him.  He can just be Simon.  Tonight, he plants his name between his ribs. In the soft ground beneath their feet. In the metal sculptures that stand like sentinels around them.  Tomorrow, together, they will see what grows. Ziggy Schutz (she/her/he/him) is a queer, disabled writer who is at all times looking for ways to make his favorite fairy tales and sci fi tropes reflect people who look a little more like her.  When he’s not writing, she’s spending his time exploring haunted houses and chatting up the ghosts who live there. This is not a bit.", "text": "6680 words, short story\nIt is a Pleasure to Receive You\nIf one wants to feel small, all one has to do is look up at the sky on a clear night. There is something about the stretch of the horizon, about the distance between you and each bright spark, numbers that feel so large as to be nearly impossible summed up in a simple gesture.\nSome might find it terrifying, but Simon’s always found that anonymity to be a comfort. No matter how often he stumbles, how many mistakes he might make, they mean nothing against the great scope of the universe.\nAnd when the chance came, to throw himself into that expanse, to pull space around him like a favorite blanket and float through it like a dream, he threw himself at it with more will and want than he’d ever done anything in his sixteen years of life.\nCaught up in the constellations, his very own satellite is just another spark in a vast sky, and there’s something poetic about how it’s only once he’s surrounded by the vacuum of space that he’s able to breathe deeply.\nSimon is the sole occupant of the communications satellite Nirah-89, and most days are this—staring out at the stars, Earth indistinguishable from everything else in the universe, and caught up in the wonder that his little home manages to pick up anything at all.\nBut she does, and so he sits at his desk, listening to all of the messages that humans have sent into space, as sound waves flash by on his screen. He listens, notes where they are coming from and if there has been any response. For the older ones, the rusty and the rough, he pauses, runs them through his systems and his fingers until they’re smooth once more, adjusting levels and tidying up tones until they’re almost as good as new, and then he sends them on their way again.\nHow tragic would it be, after all, if one of these decades-old messages were to finally find its way to someone who needed it, and it was too tired to be heard?\nIn the grand scheme of things, he’s just a little speck in the larger picture that is space expansion and exploration. Many of these oldest messages were sent before humans ever settled onto other worlds, before they expanded to the edges of their solar system and beyond, comingling with all they found there. And many of the newer ones are nothing important, echoes of letters home and shopping lists for space station stopovers that are months past, now.\nBut it’s not his job, to determine which of these messages hold value. Simon is no museum curator, only selecting the most significant voices to honor. No, he’s simply an archivist and janitor, tidying the papers he finds on the floor, leaving the sorting through them to decide which ones can be recycled for someone else.\nMaybe this is why he reacts the way he does, when a particular set of words come through his systems just as he’s about to tuck himself into bed. He could blame the late hour (in the way that every hour is a late one, he runs off of his own time here, dictated by his needs for sleep and for food more than any number or clock), or the fact that it’s midway between one supply ship visit and the next, meaning it’s the longest he goes without talking to another person.\nWhatever it is, when he hears a stranger wonder if anyone is listening, hears how their voice breaks as they ask if anyone has ever, he does what janitors and archivists and satellites are never supposed to do.\nHe engages.\nHe answers.\n“Yes, I hear you,” he says, and is shocked by how steady his voice is, when everything around him is vibrating. The satellite, as it continues its lonely orbit. His skeleton, at the breaking of rules, at the effort of reaching out. But his voice is steady, calm enough to almost feel like a lie, except that he never quite got the hang of lying, never thought to practice it with his peers, instead preferring to spend his time playing pretend with imaginary friends.\nMaybe that’s why it feels so easy. With no visuals, he can close his eyes and pretend the voice belongs to some conjured companion, as opposed to a person, somewhere else entirely, only sharing this moment with him through happenstance and an inconsistent sleep schedule.\n“And are you real?” asks the soft voice, no hesitation, just hope.\nIt’s a question Simon has asked himself before, on the days that bleed into nights and back again, where sleep is more memory than reality, and he’s not sure if the ship is spinning or if that’s all him.\nBut when faced with someone asking, the answer is easy.\n“Yes,” he says. “Are you?”\n“ . . . I think so.” The reply is slower this time, but the words no less honest, no less bare. “Wasn’t sure for a second, there. But I am now.”\n“Good.” Simon smiles. “You’ve reached the satellite Nirah-86. Do you have a message you would like to send?”\n“I do,” they say, and Simon would like to imagine that they are smiling back. “Thank you.”\nIt’s not that they’re not allowed to call. He knows, in theory, that many of the satellites make calls home. Often, even. There’s only so far their entertainment packages can take them before something a little more substantial is needed, something more personal.\nIt’s just that he’s never done it. Called home. Not really something he’s interested in, and most of the friends he’d managed to make in school were fleeting at best, held together more by convenience than any real connection.\nAnd they’re definitely not supposed to be responding to the messages they hear. At training, Simon had been told over and over that it was best to break down each message into collections of meaningless words. It makes them more objective, means that they wouldn’t accidentally add their biases to the transmissions in the form of emphasis, cultural context, or translation.\nNirah-86’s systems can speak almost every language humanity has ever made, plus an ever-growing database of alien dialects and settlement slang.\nSimon can only speak about seven, but he’s working on it, over his morning meals and in the quiet moments the days find.\nHe still lets the computers do the translating. He just likes to follow along. Likes to understand.\nIt’s easier to make their messages shine, when he has an idea of what they were doing, when they were sending them. Who they were, even if it’s all just guesswork.\nImaginary friends, again.\n“I think I’m technically a prospector,” they say. They’ve talked well through Simon’s night, and their voice is raspy. This time, not with the desperation that had them reaching out in the first place, but with the wear that comes through talking for hours with a stranger. “But I prefer gardener, and it’s not like anyone is around to argue with me over it.”\nTheir accent has the rolling highs and lows of Saturn’s moons, settled early on in the expansion and largely unchanged since. Their name—“Lyrical Wonder, but only my mothers use the full thing. Lyric is just fine”—also speaks of an old family, and Simon can’t help but wonder what sent them spinning off-moon, landing in a digital swamp somewhere on Earth, combing through old deleted files and abandoned clouds for anything tangible.\n“What do you do,” he asks. “When you find them?”\nThat much discarded information makes the ground soggy, the air damp, a man-made bog with little in the way of life, and always a threat of spreading. That’s what people like Lyric are there for, or so they explain. To keep the boundaries clear, to stop the slow creep, to encourage the growth of plants and things with roots that know to reach for the sun.\nSimon hadn’t known that there were scraps of paper to be found, too. That sometimes the tossed info came in the form of books, newspapers from before either of them were born. But there are, and Lyric finds them, sifts through the mire with a net and a song, pockets full of pages.\n“I plant them.” Their smile is obvious in their words, an affection often reserved for pets or small children sneaking into their voice. “If I’m lucky, they’ll grow.”\nA garden, in the middle of a place that’s supposedly known for its still water, its lack of life.\n“What do they grow into?” Simon can’t imagine it, and there’s a need in his words, to understand, to be able to picture it, if he can.\n“Oh, Nirah-86,” And there’s something intimate in Lyric’s voice, as they shape the name of a satellite with their gentle tone. Something that cuts through the miles between them, like a hand on his shoulder. “Whatever they know how to be.”\n“Simon,” he corrects them. “The satellite is Nirah-86. I’m Simon.”\n“Simon, then.” A little laugh. “This is usually where I shake a new friend’s hand.”\n“I’ll accept an IOU,” he replies, before he can overthink it, and the laugh grows, passed between them until they’re both giggling. A sound so small shouldn’t be able to fill up the whole ship, Simon thinks, but it does, lingering in the corners like stardust.\nHe looks it up later, when Lyric’s soft words have shifted into the even softer sounds of sleep. Recycled nanotech, something almost obsolete turned into art and metaphor instead. Fragments of things can grow in all sorts of ways. Most often, flowers with paper petals, folded as delicately as nature can manage, ink turned to gentle coloring and shades. Pretty, although not particularly useful.\nBut sometimes, under the hands of a good gardener, they’ll grow into whatever they have words for. Whatever their bits of story captured.\nSimon sits, thousands of miles away from anyone at all, the sound of a new friend sleeping in his ears, and wonders if that isn’t what they all do. Grow into whatever shape they have words for.\nIt’s not supposed to be a sad thing, he thinks, as he feels his chest grow tight.\nBut he can’t help but wonder what words he’s missing from his own makeup. What he could become, if only his vocabulary were a little bit larger.\nMaybe it’s time to work on language number eight.\n“It’s really only breaking the rules once.”\nLyric’s logic is a little sideways, in Simon’s opinion. They approach problems from angles Simon hasn’t learned how to see, offer solutions by skipping steps altogether, and they can deliver it all in such a steady tone that it doesn’t even sound all that out there.\n“After that, it’s just phone calls home. And you’re allowed those!” There’s a pause, and then a hurried addendum, their voice pitched up in panic. “Not that I’m calling myself your home, or anything!”\nFunny. Lyric’s voice has slipped so easily into the simple routines that make up his life. If they hadn’t drawn attention to their phrasing, he would never have questioned it.\n“You’re fine,” he assures them. “You’re right. We’re allowed to call friends. And there’s no small print about how we’re supposed to have met those friends.”\nHe knows because he checked.\n“If anyone asks, we can say we met . . . ”\n“On a reality broadcast,” Lyric suggests, anxiety discarded in favor of this new game. They’d told him distractions always work best. “At a conference for left-handed folks.”\nSimon’s already laughing. “I’m not left-handed.”\n“Neither am I,” Lyric admits, and they’re laughing too. “We’re time travelers, we met a century ago when we both went to assassinate the same person.”\nThat shouldn’t make him laugh harder, but it does, sends him spinning off to the corner of the room, because his satellite had decided it was the perfect day to run updates on its gravitational system, and he’d forgotten to strap himself in.\nIt’s what he blames, for the giddy, weightless feeling that talking to Lyric fills him with.\n“Hate to break it to you, but I’m not a time traveling assassin, either.”\n“Not yet, you’re not,” Lyric chirps back, and Simon sees stars.\nSometimes, Lyric’s words come quick and fast, and Simon has to scramble to keep up. But sometimes it’s quiet days, where full minutes pass after starting a call before they even say hello.\nOn days where Lyric’s words have run dry, he lets them listen in while he works.\nIt’s only fair, he tells himself. They’ve got him invested in each plant and scrap in their garden, so why not let them listen in as he works away on the messages that find him? And they get it, without him having to explain. Why it feels important, even if there’s no one waiting on the other end.\nOf course, that’s how it happens. He never would have done it on his own, wouldn’t have had the words or the bravery to go with them.\nThe message is a short one, but crystal clear. A single voice, laughing weakly as the owner of the voice asks if anyone knows how to wrap up a broken ankle well enough to stand on it.\n“Simon,” Lyric says, voice gone tight with worry, with urgency.\n“I don’t know,” he admits. He took another language, instead of the first aid course. “I can look it up, but we have no idea if they’ll be able to hear us, if they’re even still listening—”\n“We can try.” And Lyric’s right, they should try, but he’s frozen, too far away to be of any help, listening to the laughter turn into a pained whine as the stranger attempts to stand.\n“I don’t know what to do.” He feels like he’s failing, like he’s falling, but Lyric is there, calm in the face of someone’s pain in a way they never quite manage with their own.\n“Patch me through,” they’re saying. “I know how, patch me through.”\nAnd Simon breaks the rules a second time.\n“Hey,” Lyric says, talking to the stranger now. “Can you hear me? We can hear you. I’m Lyric, they/them. I can talk you through it. We’re here to help.”\nThe “we” makes Simon wince. He’s done nothing but connect them, connect them and panic.\n“Sup, Lyric,” says the voice on the other end, and there’s a relief to the voice now, a relief Simon lets sink into his own limbs. “M’Nova, she/her. Not to rush you, but I’m not exactly in a place I’m supposed to be, right now, so if you can speed run me through this . . . ”\nAnd Lyric does, steady and sure. Hands used to coaxing seeds made up of punctuation to grow in places they shouldn’t be able to now walk Nova through a bandage wound like a trellis, not even stumbling when Nova explains that she’s only got one hand to work with, on account of her other one being in the shop.\n“Got strong teeth, though,” she says, and Simon thinks of grins with bloody teeth, of what “survivor” looks like in his mind, and adds to that image a low laugh, a voice raspy and sharp, like at any moment it’s about to grow claws.\nWhen Nova is able to push herself to standing, Lyric actually claps, they’re so caught up in the moment. If Simon were a little less frozen, he would have been right there with them.\n“Cute,” Nova says, and then there’s the sound of shouts in the background, and she curses.\n“Gotta go, thanks for the save!”\nThe transmission ends, and Lyric and Simon sit in silence, the space given at the end of a song to let it really sink in.\nThis is the place to applaud, he thinks, and Lyric lets out a shaky breath that sounds like it’s been held for far too long.\n“Think we’ll hear from her again?” Lyric asks, hours later, and Simon marvels at how they can be so far apart and still thinking the same thing.\n“Hard to say,” Simon says. “Never really done this before. She seems like the kind of person to do whatever is least expected, anyway. Just to say she did.”\n“Yeah.” Lyric hums for a few bars, which Simon knows means they’re thinking.\n“I guess I’ll just have to expect to not meet her again, then.”\nSimon smiles, softer than he should. It’s fine. Only his satellite’s ceiling is here to see it.\n“I’ll do the same.”\nThe next day, Simon catches the tail end of a transmission in a familiar voice, asking if the stars had any clever medical advice to share today.\n“No stars here,” he says, as Lyric’s voice jumps up in excitement.\n“Yeah,” Nova answers, like she breaks ankles and takes part in daring rescues every day. “Stars aren’t nearly so generous with their skills.”\nThe stars aren’t exactly around to defend themselves, and they’re basically Simon’s neighbors, so he takes on that task himself.\nWith three people laughing at once, the satellite feels bigger than it ever has.\n“So you’re a gardener in a place you’re not supposed to be able to garden,” Nova summarizes, and Lyric makes a noise that somehow sounds like a nod, wordless but no less clear. “And I’m a sculptor whose first art piece was my arm, and I did go for form over function.”\nSimon thinks that’s a wild way to downplay the brilliance it must have taken, to design, build, and install her own arm. Especially since all of her materials come from the junkyard she’s been squatting in for the better half of a year, ever since whatever happened to make her lose her arm had inspired her to drop out of school and run full tilt at being a starving artist type.\n“It’s like if graffiti was in three dimensions,” she’d said, trying to describe her work to the two of them. “Or tattoos, if tattoos could turn against you . . . And if they were made out of your mom’s old pocket kitchenette.”\nSimon can’t picture it, but he wants to. Wants to see Nova’s sculptures just as much as he wants to wander through Lyric’s gardens.\n“Quite a pair,” Simon says, and it is perhaps the wrong response, because he can feel Nova’s attention turn to him, can hear her smile get wider.\n“What about you then, Simon-my-boy?” she asks. “You a walking contradiction like the rest of us?”\nHe doesn’t want to talk about what he does. He supposes it’s not that far off of what the both of them do, finding beauty in the discarded pieces of other people’s lives. But they both transform the scraps they find, into things new and stunning.\nHe just tidies up other people’s good words and sends them on their way again.\nSo he deflects, focuses on the wrong part of the sentence.\n“Oh, I’m not a boy.” he says, nothing but cheer in the correction. “I collect genders like you collect space junk.”\nIt’s a good metaphor, he thinks, for all that he still can’t quite picture her work. Pretty pieces of potential on a shelf, and some days they fit one way and some days another.\n“I just use he/him out of convenience.”\n“Whose convenience?” Nova asks, sharp as skeptics, and he feels his heart flutter at how quick she is to ready herself to defend him.\n“My own,” he assures her. “It’s for no one but myself. I like how it sounds, and it’s the most accurate the most of the time.”\nHe doesn’t get into the rest of it, how in this tiny satellite of his, he could be anyone, could wake up a new person each day, and that terrifies him. How easy, to lose yourself in space. He needs constants, needs touchstones of identity to keep him company. His name, his pronouns, they are like magnets on a fridge, pins on a board. Keeping the less permanent parts of him steady, for a time.\n“Okay,” Lyric comes in, ballast to Nova’s sails. “If that changes, you’ll let us know, right?”\nWhat a delightful thought, that they’d know each other long enough to update each other on things like shifting identities.\n“I promise,” he says, and the future is sweet on his tongue.\nDo you believe in fate, he almost asks, when Nova just so happens to call him on a night that is especially dark. She goes on about a piece of junk she’s found, how it bends just like a waterfall, and he listens, lets her fire light up the room.\nDid you ever read fairy tales, he traces into his desk, not daring to ask out loud, on a morning where Lyric has enough words to walk them both through every flower they have growing. He hasn’t managed to sleep, but their voice makes it easier.\nIf we’d met differently, he practices out loud, on a day where both of them are busy, and he is alone. If I were closer, do you think . . . ?\nHe doesn’t know how to end that sentence, so he saves it. An unsent transmission. A secret, just for him and all of space.\nIt’s not like the universe cares, anyway.\nOnce he finds the perfect way to say it, he will, he tells himself, runs the sentences through every language he knows to see if one sounds better than the others.\nMaybe it’s just a vocabulary issue again.\nHe’ll leave it for now.\n“A shift is five months?”\nSimon shrugs, a gesture more out of habit than any added meaning. Nova’s outrage on his behalf has quickly become a comfort, even if he still feels a twinge of guilt for bringing it out at all.\n“It’s not like I have to stay up the whole time, or anything. It’s just easier on resources for us to stay up for extended periods of time. Sending a supply ship up to all of us, instead of us going down and up.” He brightens. “But we get a month or two off between shifts, if we’d like.”\n“If you’d like.” Lyric’s not convinced. Neither is Nova, not even a little. She’s known him barely two months, Lyric only a few more, and already they both see through him better than anyone at home ever managed. It’s enough to make a satellite feel stripped bare. “So, if you wanted, you could stay up there even longer?”\nNova’s reading into his silence before he’s even made up his mind whether or not to answer, cutting to the quick.\n“Hey, Simon? When was the last time you pulled your head out of the clouds?”\nHe hesitates again. Not because he doesn’t want to tell her, but because he needs to take a moment to count.\n“ . . . Fourteen months,” he says.\n“Simon,” she hisses, and he grimaces.\n“It’s not on purpose!” he says, quick now, trying to cut off the lecture he knows he’ll get otherwise. “It’s just, my hometown isn’t exactly my favorite place, and my parents are really busy anyways, and they’ll just ask why I had to run away to the stars to avoid going to university, and I can’t be bothered to have that conversation with them again.”\nHe should really give them a call. It’s been almost a year.\nLater, he assures himself. He’ll worry about it later.\n“It’s not that I don’t want to come down,” he says. “I just don’t really have anywhere I’d want to land.”\n“You didn’t,” Lyric corrects him, and the confidence alone winds him, leaves him blinking away the stinging in his eyes. “You didn’t. But that’s changed, right?”\n“It better have,” Nova growls, and the growl makes him feel warm, hands to his cheeks so he can feel his own blush spread. “I’m working on something really neat, but it’s gonna sound stupid as hell if I try to describe it.”\n“You’ll just have to go see it in person,” Lyric says, and how can he say no to them both, when they so perfectly overlap like this?\nHe should say yes. He should say yes, thank you, I would love that.\nInstead, he starts to cry.\n“Simon?” chorus two voices belonging to faces he has never seen, and he aches with it.\n“Sorry,” he gets out, curling up on himself, tucked away in his chair. It’s on wheels, so that he can move it to the other rooms when he needs to. There’s only one chair, in this whole place. It was only made for one person, why would he need more than one?\n“You don’t have to apologize,” Nora says, almost stepping on him in her haste to get the words out.\n“Talk to us,” Lyric says. “Please, Simon.”\nAnd he does.\n“I think the whole world must be lonely.”\nThe words ring in his ears.\n“Why do you say that?” Lyric asks, and their voice is soft, the way one might speak at a funeral.\n“There are decades and decades of us sending letters to the stars. Not knowing if anyone would listen to them, desperate to connect, to have someone respond. Thousands of words, in as many languages as we’ve got. Reaching out to the sky, again and again, hoping against hope that someone will reach back.”\n“That’s not—” Nova starts, but it’s Lyric’s voice that comes through clear.\n“I don’t think that’s loneliness,” they say, that same whisper, threaded with a conviction like steel. “You said it yourself, Simon. That’s hope.”\nThere’s a hum of agreement from the other line.\nLater, he’ll wonder when they all started to pick up each other’s speech patterns and verbal stims. But that’s for later.\nLyric continues.\n“They reached out because they had hope that one day, their messages would find someone who was listening, hoping to hear something in the stars. It is in direct opposition of loneliness. How many of them use the word ‘friend’?”\n“A lot of them,” he says, and they echo in his head. Greeting, friends. Friends of space. Welcome home. Before, they had always sounded like half-finished tragedies. But the words themselves don’t really say that, did they?\n“I can see how someone might hear them and hear them just as messages never answered, and there’s something terribly lonely in that,” they continue. “But I think these words came from a much brighter place than that.”\n“And they did find someone,” Nova comes in, and where Lyric is the wind, Nova is the river. “They found you, didn’t they? You heard them.”\n“I did,” Simon confirms, and he wonders what his choked-up words sound like, sent across a thousand miles.\n“Even if you’re the only person who ever hears them, they’ll have done what they were meant to do. They found someone out there and let them know that they had friends here. That they weren’t alone.”\nSimon sits above the Earth in his little satellite, spinning through space at a pace he can largely not even comprehend, and he listens to two voices remind him that he is not alone, using the words he’s repeated to himself like a prayer on the most empty of nights.\nThey take on a new life, on their tongues, and he is reminded of the first time he found these words, his first shift, his first night away from home. How precious the words felt, held in his hands like seeds he couldn’t wait to plant, metal he couldn’t wait to bend.\nWhen had they lost their shine? When had he stopped hearing the beauty in them, and instead interpreted them like a tragedy?\n“Thank you,” he says, and he’s really sobbing now, but something’s changed. He doesn’t think it’s because he’s sad anymore.\nHe’d been taught, somewhere between grade school and the great adventure of space, that if someone is crying the best thing you can do is support them without commenting on it. It’s polite. It saves the person any embarrassment.\nBut he thinks that maybe the person who taught him that has never had two voices, different in every way, thousands of miles between them, say “oh, Simon,” in perfect synchronicity, as his voice breaks over the call and they reach out with all that they have to comfort him.\nHe falls asleep to their quiet conversations, and he sleeps without dreaming.\nDo you think you can fall for two people at once? he asks the static.\nThere’s no answer.\nHe takes the words and buries them inside of him.\nHe doesn’t know what he’ll do, if they decide to grow.\nThe universe is infinite. This he knows.\nBut the world is circular, and he knows this too, orbits around it every day.\nLife has infinite possibilities. That is what they say.\nBut it prefers to stick to patterns. To days and months and years, starting something the same place something else has ended. History repeats, little stories spin in circles, and transmissions loop.\nSomewhere on Earth, in a digital swamp no one would really make note of, it is storming.\nIn space, there is no rain to hammer on the roof of a little cabin, to offer warning. There is no putting down your feet to find out that the water is already up to your ankles, and the fear that comes with that flood, because the ground is soft here. Perfect for planting.\nNot perfect for escaping a mire that has snuck up on you in the night.\nSimon doesn’t know any of these things, of course. For him, panic comes in the form of a staticky call for help, made crackling by the weather rather than by the age, and a voice he has grown to know so well, begging for help.\nHe’s up in an instant, heart in his throat as he sprints to his workstation.\n“Lyric?” he calls down the line. “Lyric, can you hear me?”\nWith one hand, he is calling for Nova, because he needs her, because he can’t do this alone.\nThe other is doing what he does best, hours and hours sitting right here—cleaning up the message, so that every word is perfectly clear.\nNova joins him just in time to hear Lyric bite back a gasp.\n“I’m stuck,” they cry, and there’s sounds Simon isn’t used to, the rushing of water and data, the sucking of solid ground suddenly turned to deep, deep mud.\n“Thought you were supposed to leave yesterday?” Nova asks, and yes, yes, she’s right. The bog’s dangerous this time of year, Lyric was supposed to spend the next month or two in the city, waiting for the ground to get solid enough for planting again.\n“There was . . . things were still growing,” Lyric confesses. “I was going to go today, but I . . . ”\nLater. They can tell them off later. After they’re somewhere safe and dry.\nBut it was them, who walked Simon and Nova through the last crisis. Their steady voice, their careful hands.\n“I’m sorry,” Lyric says, and Simon thinks they’ve said it a few times now. Panic is making it hard to catch each word. “I’m sorry, I keep sinking, I’m sorry . . . ”\n“Simon,” Nova hisses, and her claws cut through the fear. “You have to tell me where they are.”\nThat’s not something he’s ever done. It’s the most important rule, after all. His job is not about the people who send these messages, just like it’s not about who receives them. He is not, under any circumstance, supposed to trace a transmission.\nBut this isn’t a transmission, says the part of him that sounds more and more like Lyric. This is a call home.\nTo hell with the rules, growls a part of him that parrots Nova’s bravery. Rules are only as good as the people they protect.\n“I can try,” he says, and already his hands are moving. He’s never done this. But he knows this system, knows it better than he’s known anything.\nHe can take it apart, split it open and follow them, the seeds and the scraps and the nuts and bolts. He can tune in to the words, and more importantly, to the voice that’s saying them.\nHis instructors had told him that it didn’t matter, the person behind the messages he heard. That they were all as good as ghosts, as far as they were concerned.\nThey were wrong. They were wrong about so much, and this most of all.\nFor the third time, Simon of Satellite Nirah-86 breaks the rules.\n“I’ve got you,” he promises Lyric, who’s sunk to their waist now, who reached out into the stars and just so happened to find him.\n“We’ve got you,” he promises Nova, as he sends her a coordinate, listens to her bike roar like something wild as she goes speeding off.\nHe hadn’t looked before, but he’s looking now. All these months, and the two of them had been less than fifty miles from each other.\nThe universe is so big, but it doesn’t have to be. Sometimes it shrinks to just this. Just three people, moving as one, to save a life.\n“You’re going to be okay,” he repeats, on loop like one of his favorite messages, polished to shining. “Nova’s almost there, you’re going to be okay.”\n“I believe you,” Lyric assures him. “I’ve always believed you, Simon.”\nHe doesn’t know what he says, in those painful, stretched minutes or hours or years between that first cry for help and the distant sound of Nova’s voice through Lyric’s line, calling their name. He must say lots of things, because he talks the whole time, so that Lyric can save their breath for surviving, and Nova for the race toward them. Bits of messages he’d memorized before he’d met them, sentences they’d both said to him that stuck. Reworked, reshaped into something all its own, a monologue designed to reach down from the stars and pull Lyric up and out of that mud and into the arms of someone who loves them.\nHe talks until Nova gets close, and then he lends his shouts to Lyric’s, as they call until Nova spots them.\nHe only stops talking when Lyric’s line drops out, and it’s through Nova’s alone that he hears “I’ve got you, we’ve got you, told you we’d do it.”\nAnd he cries along with them both, when they reach solid ground and he hears them both collapse with it, tangled in each other with his voice in between them, muffled by how tightly they’re holding onto each other, but never intruding.\nThis call has three heartbeats, all racing with their close call, and it’s to that pounding beat that one of them moves, and the other one responds, and Simon realizes that they’re kissing.\n“You’re a force of nature, Ms. Nova,” Lyric finally gets out, and Simon can hear their smile.\n“You’re an idiot,” Nova replies, but she’s smiling too.\n“You’re okay,” Simon breathes. “You’re together and you’re okay.”\n“We’re okay,” Lyric repeats, and then the rain that’s been the backing music to this all suddenly lets up, and Nova swears, and Lyric laughs, and as always, their laughter is contagious enough to catch.\nThey spend the first few minutes together laughing until the panic drains away like the storm.\nSimon’s not sure if he believes in fate, or in rules, or in the patterns of the universe.\nBut he thinks he could be happy, just believing in this feeling. Whatever it happens to be.\nSimon tries to give them space. He does. A lot has happened, and near-death experiences have a way of taking a lot out of you. Not to mention kissing someone you’d only just met. It’s a lot. He’s trying to be respectful.\nNeither of them will have it.\n“Look, I miss you too,” he admits, after Nova calls him five times in as many minutes, and he finally picks up. “But Lyric’s recovering, and the two of you are getting settled, and . . . I mean, the two of you kissed. You’re . . . shouldn’t you talk about this? Before just inviting me to visit?”\n“If you’d been here, I’d have kissed you too, idiot.” Nova says, and he’s so stunned that he forgets, for a second, every language he knows.\n“It is something we should talk about,” Lyric says, and there’s still a thrill, to seeing both of their voices come through one transmission. “But conversations like this are best had in person. Don’t you think?”\nSo they’re really serious. Simon hums, a thinking noise, and looks over at the screen that serves as calendar and countdown both.\n. . . His shift is up in three days.\nHow had he not noticed?\n“Because you’ve never had a reason to look forward to it before,” Nova says, responding to a question he must have asked out loud. “Because you’re a workaholic.”\n“We all are,” Simon reminds her, and then makes a face. Might be a bit soon, when Lyric’s work had so recently almost killed them.\nBut there’s laughter on the other end, and he relaxes. Not too soon, then. Or maybe they’ve all just been looking for an excuse to laugh in the face of what they had just survived.\n“Yes,” Lyric agrees. “Maybe we all need a break.”\n“ . . . I have some vacation saved up,” Simon admits. Months and months of it, although he doesn’t want to start with that. Doesn’t want to move too fast. “If you’re both sure. If you don’t mind.”\n“Come on down, Simon Satellite,” Nova calls, singsong. “Come be our summer fling.”\nIf Simon is remembering right, it’s not even midwinter where they are.\nIt’s an invitation, then. A long one.\nIt’s a place to land.\nSimon swallows, mouth gone dry with anxiety. No, not quite. With a terrifying, intoxicating anticipation.\n“I can be there in three weeks,” he says.\n“Holding you to that, then.”\n“We’ll be waiting,” Lyric adds, and there they go again. Making promises of a future Simon is less and less scared to imagine.\nSimon still feels small, when he looks up at the sky.\nThere’s no such thing as a clear night, in the bogs. There’s always a slight blur to the air, millions of bytes of information drifting through their final resting place.\nIt makes the stars seem closer, somehow. Brighter.\nThe horizon still stretches out in every direction, but to Simon’s left is a short someone with hair that curls tighter in the humidity, and the night looks so much smaller, when mirrored by their dark skin, freckles like their own constellations, ones Simon cannot wait to study.\nAnd to Simon’s right is a taller girl, smile sharp and daring, and her arm interrupts any straight lines, as she points at the world and questions what everyone else has gone and accepted as truths, and her pale cheeks go red when Simon reaches out and captures her hand, tangling their fingers together and suggesting that maybe, they can find the answers together.\nThe numbers that make up the impossible expanse of space feel smaller, when viewed by three.\nMaybe they really do mean nothing, in the grand scheme of things.\nBut maybe that’s not the point.\nThe universe doesn’t know who he is, and that’s fine. He’s not really anyone—just a satellite, just space junk held together by scribbled equations and an outdated sound system.\nBut he doesn’t need to be someone important to the universe, to be someone to the two on either side of him.\nHe can just be Simon.\nTonight, he plants his name between his ribs. In the soft ground beneath their feet. In the metal sculptures that stand like sentinels around them.\nTomorrow, together, they will see what grows.\nZiggy Schutz (she/her/he/him) is a queer, disabled writer who is at all times looking for ways to make his favorite fairy tales and sci fi tropes reflect people who look a little more like her.\nWhen he’s not writing, she’s spending his time exploring haunted houses and chatting up the ghosts who live there. This is not a bit.", "source": "https://clarkesworldmagazine.com/schutz_09_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: It is a Pleasure to Receive You by Ziggy Schutz"}