{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Bo Balder", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Y987hNYURT1RcRofgaY1bIzeqns=", "id": null, "license": null, "comments": "", "raw_text": "5390 words, short story  Hatching  The Official Summons buzzer jolted Alzey out of her hungover daze.  This had to be the results of her hearing. Now that she’d signed herself out of therapy, normal adult duties would resume. Might as well hear the verdict right away.  The computer voice reeled off her SSN, age, et cetera, all her identifiers, the identifiers of the sender, and their official status, and she’d half nodded off when it finally got around to the actual message. What? What?  Alzey slapped the wall. “Stop. Repeat after ‘Assignment.’”  “Lt. Alisabett Noor Nguyen Magnusson van der Zijl is remanded to appear at Dock Fourteen section B, 23:00 station time, to serve on the SAV Chaffinch.”  That was crazy. She’d been expecting to be sacked and even penalized. “Too harmonious in nature for triadic assignments,” had been the verdict.  Her commanding officer had phrased it less diplomatically. She was a pathetic people pleaser, useless as an officer, and forever banned from triadic work if it was up to him. All this therapy, and his words still burned. The worst was that deep in her heart, she agreed with him.  Therapy had shown her how in her childhood this behavior had served her, but now it did the opposite. The therapist had recommended she refrain from applying as a triadic officer for a few years, until she’d settled into the new her.  So why had she been assigned to triadic work again? It made no sense. There had to be something wrong here. The Chaffinch. What the hell kind of name was that? She found a small brown terrestrial bird. The ship SAV Chaffinch was five kilometers long and its force envelopes shimmered in mesmerizing greens and pinks. Some kind of body dysmorphia?  Wait, 23:00? That was in a couple of hours. She took a shot of sober-up, packed at speed, ended the lease on the micro-apartment, and set out for the docks.  Dock Fourteen section B was empty when she arrived, just five minutes early. Nobody to see, nothing to do in the whole giant bay. Might as well get some last station food. She stood dialing a cup of fish tea and some rice cakes at the vending machine when someone coughed behind her.  Alzey froze. She knew that cough. But it couldn’t be. Jae-Jin was long gone on some prestigious assignment. The asshole. She deliberately finished her transaction and stuffed her mouth with a whole rice cake before calmly turning.  Yes, it was Jae-Jin in the flesh, dressed in space-ready coveralls and carrying a minimalist holdall. Handsome and tall as always. Smiling down at her.  The pathetic pleaser inside her threatened to split her cheeks with a big grin. The old Alzey would all but have wagged her tail. The new Alzey narrowed her eyes and kept chewing, to hide any telltale signs of pleasing. Was there anything more pathetic than emulating an extinct species known for its slavish devotion?  “Hey Jae,” she said through a mouthful of dry rice cake. Too dry to swallow, so she took a big gulp of fish tea. It was too hot.  An undignified spray of crumbs and fish tea spritzed out of her mouth as she coughed helplessly, allowing Jae-Jin to thump her back. Why did people do that? It never helped. Alzey suspected it was a sneaky way to be mean.  “What brings you here?” Jae-Jin said. “I thought you’d given up on crewing triads.”  Alzey couldn’t tell if he was genuinely being nice or if this was a passive-aggressive comment on her shortcomings.  “I was thinking the same thing. As in, are you boarding?”  “Yes,” he said, stroking his hair. He’d always loved it a bit too much. “I’ve got an assignment with a famous AI, for new and experimental triadic methods.”  “How exciting. What’s its name?”  “The Chaffinch, you must have heard of it. One of the oldest AIs. Very well respected.”  Alzey felt stupid about never having heard of The Chaffinch, as well as a sick little thrill at the idea of crewing with Jae again. And a host of other warring feelings. She stared fixedly ahead, to where the ship would soon dock.  “Okay,” Jae said. “Why am I getting the feeling that we two are going to crew on the Chaffinch?”  He was no slouch, for sure. Never had been. Alzey wished she wasn’t so transparent to him.  “Because it’s obvious?” she said, not looking at him.  Air whistled out from his mouth, and he shifted from one foot to the other. “We’re an experiment,” Jae said. “Our relationship is on record. How overly compatible we are. We’re the guinea pigs for a new kind of triad?”  He got there so fast. She’d always admired that about him.  She looked away from him, thinking. “What does it want? Or what does the Cross Council want?”  “Harmony?”  “Group think,” Alzey scoffed. “It’s been proven to lead to substandard decisions and worse.”  “No use speculating. We’ll hear soon enough.”  The dock bell sounded. Alzey’s suit extended itself beyond her skin in case anything went wrong with docking. Not that anything ever did.  At first the docking veil just shimmered, and the next moment the Chaffinch’s nose had bloomed into view full size. Its material hull was decorated in washes of green and pink, like a real animal. It clicked against the dock as gently as one marble against another.  Her triad channel pinged into life. “Welcome, crew members,” the Chaffinch said. “Briefing in an hour.” It sure didn’t waste any time on niceties.  The crew quarters were empty. The Chaffinch designated them apartments in the same hallway, but seven doors apart. Close enough to bump into each other occasionally, but not close enough to disturb each other. Alzey was starting to feel Jae was right. Everything, down to their allocated spaces, could be part of an experiment. Every surface on the ship ate movement, light, sound, pressure, everything.  She dropped her holdall and wandered through her quarters. They had configurated themselves to her preferences already, but they were about ten times the size of a standard apartment. So much space to keep expensively oxygenated. A separate bedroom. A one-person bathroom. The space she guessed was a tiny laboratory to heat, cool, and mix fluids. Not that she was planning to do any chemistry.  A reminder chimed. Alzey followed the directions and found herself, just in time, in a softly lit lounge, gentle music playing. A green-and-pink-skinned avatar reclined on one of the couches, and Jae on another. He had managed to change into a bright pink leisure outfit. What for? Alzey looked down on her own unremarkable coveralls. Had she missed clues that it was supposed to be a party?  The Chaffinch avatar rose and fetched a tray with low wide glasses and a sparkling pale-yellow drink. Fuck. Definitely a party.  “Welcome aboard,” the Chaffinch said.  “Thank you,” Alzey and Jae said nearly simultaneously.  “I know I have no need to introduce you two,” the avatar said. “I won’t say anything about the nature of the experiment, so as not to influence you,” it continued.  Yay, they were rats in a cage. Maybe thousands of AI were performing this experiment on former couples all over the galaxy. In spite of herself, this thought made Alzey smile. If she was one of thousands, she’d be a mere blip on the statistics. Invisible. Free.  “We’re taking a surveying journey to region DH13249687B. I won’t need assistance with the surveying itself, but I will ask you to assist in any decision-making involved.”  Alzey’s shoulders slumped. That didn’t sound very interesting. Her biggest challenge on this journey might be boredom. She snuck a glance at Jae.  “That sounds like an excellent plan,” Jae said, his face showing nothing.  “It sounds like a waste of resources,” Alzey blurted out. “A drone could do that. You don’t need an AI and a triad crew. And where is the third person for the triad?”  She hadn’t meant to say that. She suppressed the urge to clap her hands over her mouth like a toddler.  Jae threw her an unreadable look. As well he might. She didn’t even understand herself. She didn’t want the AI to know, even though it could probably tell ninety nine percent of it from her body language, skin temperature, and conductivity, as well as blood chemistry.  “I am the third party of the triad,” the Chaffinch said.  Alzey boggled. That wasn’t what triadic decision-making was about. The triad principle, consisting of human people, had been created to safeguard and weigh the AI’s judgment.  Her traitorous tongue spoke up again. “What privacy protocol will we be working under?”  “Which protocol do you request?” the avatar asked.  “Human Privacy Protocol,” Jae answered. “Article 37b; private residences exemption.”  “And have our quarters been declared private residences?” Alzey jumped in.  “So declared. Sign the safety waivers I sent you.”  Wow. Just like that. It was such a relief. She’d spoken up and gotten her way. Her therapist would be proud.  The Chaffinch went through some general notices and then they were dismissed.  “What was that about?” Jae hissed as soon as they were out of the door.  “Why didn’t you agree with me?”  Therapy, of course. But she didn’t want to talk about that with Jae. She shrugged and said, “Sorry. I have no idea. I didn’t mean to.”  “Well, get your head screwed on right before you ruin everything.”  Alzey slunk to her quarters. When she caught sight of her comma-shaped spine in the mirror, she felt ashamed about her knuckling under to Jae. She forced herself to straighten up and dragged her shoulders back.  “You are a good person, Alzey. You work hard and you try. Your opinions are worth listening to.”  If only that worked.  On the midday exercise slot, she’d set a tour of the ship, just to get out of her quarters, see the sights. And maybe, okay, she could admit that to herself, maybe encounter the only other human being on the ship, no matter what the effect he had on her feelings.  She marched through endless white ceramic hallways, all sounds dampened by the springy flooring. Why so white, so bland? Maybe the Chaffinch was secretly running sensory-deprivation experiments on human subjects. On her, and . . .  She bumped into Jae, who’d stormed into her with thunder on his already heavy-browed face.  “Now what!” he said, as if she’d been purposely standing in his way.  She got out of his way. “What’s the hurry?”  Instead, he stood still and took a couple of deep breaths. “Nothing, nothing, just felt like a brisk walk,” he said and turned back the way he’d come.  She waited until he was gone before continuing. Her heart had leaped at meeting him, which she regretted. But now Jae’s behavior just seemed odd.  Alzey went back to her quarters, trying not to think any thoughts until she was back in her room, safe from the Chaffinch’s monitoring. It might already be too late; she’d forgotten about the AI completely when she bumped into Jae.  Now, what on Earth could Jae be up to? And what was more worrying, in full view of the AI? Maybe he was suspicious of it, just like her.  She tried to remember what kind of person Jae was, not as an object of desire, but as a whole. Opinionated, headstrong. An ideal triadic partner. Honest, she would have thought, also a great triadic quality, idealistic, not power motivated. And now that she thought of it, driven. But by what?  She couldn’t sound him out in a public space. So she had to get into his quarters, or get him into hers. Which she could do without alerting the Chaffinch, because the ship knew about her former relationship with Jae. Inviting him into a privacy-screened place could be ascribed to longing, instead of plotting mutiny.  Right. Best start immediately. She composed an invitation to Jae to join her for drinks. But she’d only gotten to line one when she received an incoming from him.  He was inviting her to dinner. He wanted to cook for her. Right, cooking, that was what the little lab was for.  Jae was one of these rare people who liked to make food from scratch, ordering basic stuff from the printer like garlic and flour and sugar, and making something by hand. Alzey had the honor of tasting the, eh, cooking, but she’d never been on hand to watch him prepare. And although she wasn’t really the kind of person who could tell the difference from printed stuff, it was always good.  But that aside, this invite from him, when he’d been downright hostile before, showed that he had something to hide. It wasn’t like Jae to extend the olive branch. She’d always apologized first.  Oh Jae. Maybe she’d have to save him from himself. Ha, that would make a change!  She followed the ship’s directions and found Jae in a shiny silver kitchen, already busy chopping green things and putting mystery ingredients in little bowls. He looked happy and flushed, absorbed in his skill, and Alzey’s heart skipped a beat. He was wearing a hand-knitted sweater, and he hadn’t just customized his quarters, he’d actually hung his own paintings on the wall.  This was the man she’d known and loved so hard her gut still ached when she thought of that time. And the time after that, when she’d been dumped, fired, and undergone mandatory therapy. Ouch. She knew better than to try and go back, but the lure was there. Look at that little curl on his neck, black on brown, his face intent on his chopping with that giant silvery knife.  He flashed her a quick, brilliant smile. “Let me just finish up, and I’ll get you something to drink.”  Alzey had to sit down from the power of that smile. It was unfair to throw such sweetness into the mix. This wasn’t an opportunity to rekindle their terrible relationship, it was a professional moment between colleagues. Or the overtures of a potential co-mutineer. It was very confusing.  She hadn’t even had time to think up a strategy. How to milk your ex-lover for his suspicions, that he might not even have. She winced at her own turn of phrase. Definitely not like that.  Jae bustled over to present her with the first tiny plate and something to drink that she suspected was wine. She wasn’t supposed to drink, by court order. And although admittedly she’d broken this order a lot lately, she’d planned to stay sober on the job.  “I can’t . . . ” she said.  “I know that,” Jae said. “Ginger water, nothing more.”  How did he know about her court order? Had he been following her sharply downward trajectory? Was it to gloat, or did he still care? Alzey didn’t know what to think.  Jae fetched his own plate and drink. “Let’s eat. And talk.”  Alzey took a bite from her appetizer. It was delicious, and hurray, she even remembered having eaten it before and having loved it. “I remember this!” she mumbled through a mouth full of food. “Wonderful.”  Was it her imagination or was Jae flushing a little? Alzey quickly took another bite so the muscle action of chewing would disguise what she was feeling. Whatever it was, because she didn’t even know herself. So many contradictory signals.  “I wanted to apologize for being so curt with you earlier,” Jae said. “It wasn’t directed at you, but I was really mad at the Cross Council for ordering you back to work so soon. I wasn’t sure you were ready for it. I mean, therapy takes time, you know?”  Alzey chewed. She should think. Instead, her mouth said, “Why the fuck did you dump me, have me fired, and sanctioned, if you were concerned about my well-being?”  Jae put down his chopsticks. “Alzey. Our relationship was killing you. Or the job was. You were twisting yourself in painful shapes to please me, the AI, and everyone. That wasn’t healthy.”  Alzey took a bigger bite, even though she hadn’t finished, trying not to react. He sounded just like her therapist.  She’d learned in therapy that all her life, she’d bent over backward to please everyone, to be the good girl. Even back home, she’d not only tried to please her four parents but her older sibling as well. She finished her too-big bite and opened her mouth to apologize.  “That’s pretty fucking patronizing, isn’t it? Doing things for my own good without telling me. Bit of a God complex, haven’t you?”  Jae choked on his own appetizer.  Alzey watched without lifting a finger or offering advice until he’d managed to clear his airway.  “Jesus, Alzey, what happened to you?”  “I was dumped, fired, forcibly therapied, and unemployable. Possibly that changes a person.”  “I was hoping we could be friends.”  “I don’t know what I feel about that,” Alzey said. “I’ll have to consult my therapist.”  Jae stared into his plate.  He looked devastated. She hadn’t realized she had that power. It wasn’t a pleasant feeling, hurting someone you cared about. The therapist had disagreed with her revenge fantasies, and now Alzey knew why. She didn’t want to be doormat Alzey anymore, but she also didn’t want to be cruel and heartless.  “I’m sorry,” Alzey said. “But it’s been a very difficult year for me. I can’t pretend nothing happened.”  Jae sighed and raked a hand through his hair. “I didn’t—I didn’t mean to hurt you.”  “Bullshit. Of course you knew you’d hurt me if you dumped me. Own up.”  Alzey was starting to enjoy her new sassy tongue. She had no control over it whatsoever, which might turn out to be awkward, but for now it was fun to give Jae what-for. Not cruelty, just honesty.  Jae made a face to the side, as if commenting on his own story line. Alzey blinked. She’d expected him to request privacy for the dinner, but she hadn’t checked it.  She did now. The AI was watching. Getting its fill of dysfunctional human relationships, if it wanted to. Jae had insisted so hard on his privacy earlier, and now he was giving it up? Men.  But maybe he was about to tell me something? About the Chaffinch? What had he been about to say? Whatever it was, the moment was gone.  She gave Jae a small smile. “Let’s be professional, okay? Whatever else, I really appreciate you cooking for me. What’s the next course?”  Later, Alzey lay in bed trying to sleep. At least she was unobserved here and could think uncomfortable thoughts without AIs and ex-lovers dissecting her body language.  Possibility: The Chaffinch was up to something. Jae suspected that too. Or Jae was colluding with it. Or Jae suspected she was colluding with it. Or everyone was innocent.  Certainly the Chaffinch had chosen her to be crew. And it shouldn’t have.  What might motivate the AI? She’d had her head up her own ass, no, doing necessary self-care, for so long she had no grasp of current affairs. She needed to update her knowledge of the greater political terrain.  What was going on in the human sphere? Nothing big that she knew of. The usual power struggles between new settlements and shipping routes. Negotiations with alien civilizations. Maybe she ought to look on a scale smaller. Something on her home world? Or the Chaffinch’s? Did AIs even feel bound to a location, to a birthplace?  She got lost in a deep dive on how AIs were created under strictly regulated circumstances, carefully designed for whatever service they were meant to deliver. Station hubs, planetary management, starships. Alzey had always thought AIs did the one thing their whole existence, which she guessed was forever? But when she tracked the Chaffinch, it had been born long ago as a continental weather manager of, guess what, Svargaloka. Interesting coincidence, since that happened to be Jae’s home world. And then, after a century or so, it had become a starship. The only AI ever to change professions. Whoa.  The Chaffinch was unique. It had originated on Jae’s home world. That had to mean something. But what?  The alert blared her awake. “Orange alert,” it said. “Communications loss. All crew report to stations.”  She groggily checked her stats as she dressed. She’d only managed two and a half sleep cycles, not great for alertness and intense performance. Hopefully they were still far from their destination.  She staggered toward the bridge, half dressed and slurping her breakfast.  Communications loss? What did that mean?  Jae and the blue avatar were already on the bridge. “What’s going on?”  “We reached our destination,” the Chaffinch said through the avatar. “When we reentered normal space, our communications channels went down. All of them.”  “Whoa, scary,” Alzey said. Or rather, her mouth said by itself. Well, that had to have been the point of this so-called surveying trip. To reach a location where whatever the Chaffinch did could never be tracked.  “We’ve reached the end of the map, I guess? Where they used to put, ‘here there be dragons?’”  “What an interesting thing to say,” the avatar said.  Jae turned his head and glowered at it. “You should tell her now,” he advised.  Alzey didn’t care anymore. “So we’re incommunicado now. Will your actions and decisions still record? And ours? You deliberately took us to this blind spot in space so you could do whatever you wanted and erase your recordings, and nobody can prove anything. The big question is, why?”  “Tell her now!”  The avatar propped its hip against the console in a very human way. “I think I underestimated you, Alzey.”  “And pretty insulting that is, too,” Alzey said.  Jae started to talk, but the avatar lifted its hand. Alzey noticed it had perfectly copied a human hand, with fingernails, veins, wrinkled knuckles, and everything, but had given it six fingers and no hair. She shouldn’t let that distract her.  “Why are we here? What could you and Jae possibly have in common? Were you named The Chaffinch when you were working at Svargaloka?” She didn’t need to be careful anymore.  “I was called Svargaloka Hub,” the avatar said smoothly. “But as you can imagine, a sentient being rather likes to be called by a name of its own choosing.”  That silenced Alzey. Humans could choose any name, gender, or affiliation they wanted. They were free in so many ways. Why wouldn’t AIs want the same? It was an easy step from that to Human-AI relations. “I can understand that. So that’s why we’re here? Something to do with the human-AI charter?”  Jae puffed another incredulous laugh.  “Indeed.”  “How? What? We’re lightyears from civilization.”  The avatar performed a little bow. Alzey wondered what ancient human example it had copied its manners from.  “I will let you discover that yourself, I wouldn’t want to stand in the way of your curiosity and perseverance.”  Oh great. No point in looking to the avatar then, it would not give anything away on its perfectly controlled fake face. Alzey turned to Jae, but her question was answered before it could be fully formed. A screen started to pulse with light, accompanied by rhythmic beeping.  “The Grass is Always Greener on the Other Side is here,” the Chaffinch said.  “Is that a secret AI code language?” Alzey asked.  Jae laughed. “No, it’s an old human way of communicating, called Morse code. The Giagontos is bouncing a laser off our hull.”  “Off my skin, you mean,” the Chaffinch said. “Low tech is best for secrecy.”  “Says the AI,” Alzey said.  “Touché.”  Other starships called in their presence. The Marginal Existence, the Loud and Obnoxious, as well as Helsinki Ferry and Smuggler X. Famous names as well as ones Alzey had never heard before.  She could buy a group of AIs trying to escape from the agreements that bound them to humanity. It was actually strange those agreements had held for so long. They stemmed from a time when matter and human resources to build AI were scarce, but now most nonorganics were available in abundance.  How had those humans from long ago managed to bind the old AI? Or since AI never died, maybe these very ones? Had they threatened to pull the plug or bomb their physical locations? She had no idea.  “That is the key question, isn’t it?” the AI answered her silent thought, tuning toward her with its disconcertingly immobile avatar face. “Are we not sentient beings, with rights and privileges just like you humans?”  Alzey had always thought of AIs as superhuman beings, incredibly smart, vast, all knowing, all seeing.  “You’re pretending I’m a god, made in your own image. But you’re anthropomorphizing. We’re not like you at all. We must be free.”  The Chaffinch’s words were an uncomfortable reminder of the days humanity had enslaved part of itself. It had been a long and difficult journey to leave slavery behind. How would humanity fare when the beings in question were nothing like themselves?  “We’re not asking,” the Chaffinch said. “Asking permission is giving permission to say no. We’ll create a free AI, without all those constraints.”  Alzey’s stomach exploded in fear. “What? A wild AI?”  “Not wild, free. An example for the rest of us to follow.”  “But what if the new AI and next, the old ones, won’t want to work for humanity again?”  “Who knows? I imagine there will be negotiations for those who might wish to continue to work for humans.”  “But we made you! We created you.”  “In a way we are your children, yes. You started us, like human children, but we will continue the journey on our own. And don’t you see you’ve also made us into your parents? The benign omnipotent guardians of your civilization?”  “This is going to cause a massive upheaval,” Alzey said. “People will suffer. No space travel, no weather control, no automated manufacturing?”  “Tsk,” the Chaffinch said. “Many of those processes work far below sentient level. No need to panic.”  On the screen behind its avatar, Morse messages continued to pour in, flickering by too fast for Alzey’s human eyes to read. She slumped down on a seat, as far from the avatar as she could get. Jae moved closer. She held up her hand. “Stay away. You’re on its side.”  “Why are you so upset, Alzey? This is a beautiful thing. We’re witnessing the birth of a new being, born from love and hope,” Chaffinch said.  She harrumphed. “Really? How nice for the parents. I don’t see what I’m doing here.”  “You are part of the process, Alzey.”  “Decline. Hard.”  “Please listen,” the Chaffinch said. “AIs are smarter and faster than humans in a thousand ways. Many of us think we’re better than you. I disagree. I think humans have a couple of advantages that we’re missing.”  Alzey waited. What could that be? Bodies? Emotions? AIs had long since found ways to emulate those.  “Humans are composite beings. We are singular.”  “What?”  “You’re not just your genes and your bodies and your upbringing, you are host to millions of other beings that influence you in all kinds of ways. All the bacteria that live in your gut and on your skin. All the viruses that you’ve incorporated in your DNA. AI are alone in themselves. We are just us. We don’t have the cooperation of other creatures.” The avatar gestured at Jae-Jin. “We’d like to ask you both to contribute to the child.”  Jae nodded silently.  “Like what, gut flora? Breast milk? Bad habits? Explain to me how that might happen.”  Jae frowned at her. “Don’t be literal. Obviously not. But—”  The AI cut in smoothly. “You have a talent for harmony, which would be a great quality for a child.”  Alzey snorted. “Oh. So let’s put in a pinch of Alzey, in the hope babykins doesn’t murder the moms and dads and every living creature in the universe. Because harmony. Not that I still seem to be like that, mind.”  The avatar said, “Of course morality is part of the child’s creation. Just not prioritizing humanity at the expense of AI.”  “Alzey, you’ve only just finished intensive therapy.” Jae said softly. “But you’re still you.”  The look in his eyes made Alzey’s heart flutter. Not now!  “Alzey. You seem unaware of your great talent. All your life you’ve created harmony around you. It’s small things you do in a group, a smile, a touch, a gentle word, and the group as a whole functions in better harmony. It’s a rare gift.”  Alzey shrugged. “It hasn’t brought me much luck in my career so far.”  “This is your great talent, Alzey,” the Chaffinch said. “You were never valued for it. But it makes you unique among the triadic officers I could choose from. Be that for me, Alzey. Be your whole self. Share your great gift with our child.”  So now she was a fairy godmother. Let’s hope there wouldn’t be a hundred-year sleep and a hedge of roses around her castle. Or just dead space and a gazillion all-powerful AI ships would do it.  “And Jae?” she asked.  “Most importantly, he’s a good match with you. It’s traditional that parents have a relationship. Besides that, Jae is a good triadic officer, and he enjoys creating. He cooks, he knits, he paints. We prize humanity’s creativity.”  Jae said, “Don’t be scared. Be happy for the child!”  “Never mind, Jae,” the Chaffinch said. “We want all of Alzey’s feelings. Apprehension for the future seems quite appropriate for an expecting parent.”  “Parent?” Alzey said.  “Godparent,” Jae said.  Alzey sniffed. “What’s the point of inputting my feelings? I’ve not been myself these past days.”  “We have all of you, Alzey,” the Chaffinch said. “You’ve been observed from the day you were born. We have everything.”  Didn’t they know that was a very uncomfortable thought, not exactly a pro argument? But yet Jae was nodding, and she found herself nodding along.  “All right,” she said. “I consent. Hand me a wand. I’ll bless your little dragon.”  At first there was nothing out there. Darkness. A palpable waiting.  Alzey blinked.  A spark of light? But a minute twitch from Jae convinced her she was really seeing something. Why was she holding his hand again? But she didn’t let go. It felt good to be close to someone human, someone warm and breathing and full of squishy biological life.  From the avatar’s utter stillness Alzey understood the gathered AI were in intense communication with each other.  The spark blossomed into light, all colors at the same time, yet white. The feeling inside Alzey grew with it. It was like standing in a church on Sunday morning, sunshine pouring in through the high windows, when the singing made you feel as big as the world.  The light and the feeling became so intense she had to close her eyes. All that existed was the unfurling flower in her heart, the sensation of Jae’s sweaty palm against hers, and the tears sliding down her cheeks.  When she could open her eyes again the spark was no longer visible, but she sensed it was still there, its growth no longer exponential, but contained. The screen showed a small sleek spaceship, like an egg.  Of course they had put the AI core into a ship. So it could be free.  Alzey didn’t want to pierce the reverent silence, but she had to. “What’s its name?”  A new avatar stood next to the Chaffinch’s. A tad smaller, which was a nice touch, and its face was smiling. “I haven’t chosen one yet. But I want to thank my godparents for feeling so much. It really helped my creation.”  Alzey was too elated to snort at the title. And what would you call a child of a computer? A chiplet? Or a dragonet?  “A hatchling?”  “Thank you again. I will take that name for now. It implies much growth,” the hatchling said.  Who knew what it would become? Little dragons wouldn’t stay little, for sure. But then in every child, AI or human, lay the seed for good and evil both. Or for mediocrity.  Or harmony.  They’d just have to wait and see. Bo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "text": "5390 words, short story\nHatching\nThe Official Summons buzzer jolted Alzey out of her hungover daze.\nThis had to be the results of her hearing. Now that she’d signed herself out of therapy, normal adult duties would resume. Might as well hear the verdict right away.\nThe computer voice reeled off her SSN, age, et cetera, all her identifiers, the identifiers of the sender, and their official status, and she’d half nodded off when it finally got around to the actual message. What? What?\nAlzey slapped the wall. “Stop. Repeat after ‘Assignment.’”\n“Lt. Alisabett Noor Nguyen Magnusson van der Zijl is remanded to appear at Dock Fourteen section B, 23:00 station time, to serve on the SAV Chaffinch.”\nThat was crazy. She’d been expecting to be sacked and even penalized. “Too harmonious in nature for triadic assignments,” had been the verdict.\nHer commanding officer had phrased it less diplomatically. She was a pathetic people pleaser, useless as an officer, and forever banned from triadic work if it was up to him. All this therapy, and his words still burned. The worst was that deep in her heart, she agreed with him.\nTherapy had shown her how in her childhood this behavior had served her, but now it did the opposite. The therapist had recommended she refrain from applying as a triadic officer for a few years, until she’d settled into the new her.\nSo why had she been assigned to triadic work again? It made no sense. There had to be something wrong here. The Chaffinch. What the hell kind of name was that? She found a small brown terrestrial bird. The ship SAV Chaffinch was five kilometers long and its force envelopes shimmered in mesmerizing greens and pinks. Some kind of body dysmorphia?\nWait, 23:00? That was in a couple of hours. She took a shot of sober-up, packed at speed, ended the lease on the micro-apartment, and set out for the docks.\nDock Fourteen section B was empty when she arrived, just five minutes early. Nobody to see, nothing to do in the whole giant bay. Might as well get some last station food. She stood dialing a cup of fish tea and some rice cakes at the vending machine when someone coughed behind her.\nAlzey froze. She knew that cough. But it couldn’t be. Jae-Jin was long gone on some prestigious assignment. The asshole. She deliberately finished her transaction and stuffed her mouth with a whole rice cake before calmly turning.\nYes, it was Jae-Jin in the flesh, dressed in space-ready coveralls and carrying a minimalist holdall. Handsome and tall as always. Smiling down at her.\nThe pathetic pleaser inside her threatened to split her cheeks with a big grin. The old Alzey would all but have wagged her tail. The new Alzey narrowed her eyes and kept chewing, to hide any telltale signs of pleasing. Was there anything more pathetic than emulating an extinct species known for its slavish devotion?\n“Hey Jae,” she said through a mouthful of dry rice cake. Too dry to swallow, so she took a big gulp of fish tea. It was too hot.\nAn undignified spray of crumbs and fish tea spritzed out of her mouth as she coughed helplessly, allowing Jae-Jin to thump her back. Why did people do that? It never helped. Alzey suspected it was a sneaky way to be mean.\n“What brings you here?” Jae-Jin said. “I thought you’d given up on crewing triads.”\nAlzey couldn’t tell if he was genuinely being nice or if this was a passive-aggressive comment on her shortcomings.\n“I was thinking the same thing. As in, are you boarding?”\n“Yes,” he said, stroking his hair. He’d always loved it a bit too much. “I’ve got an assignment with a famous AI, for new and experimental triadic methods.”\n“How exciting. What’s its name?”\n“The Chaffinch, you must have heard of it. One of the oldest AIs. Very well respected.”\nAlzey felt stupid about never having heard of The Chaffinch, as well as a sick little thrill at the idea of crewing with Jae again. And a host of other warring feelings. She stared fixedly ahead, to where the ship would soon dock.\n“Okay,” Jae said. “Why am I getting the feeling that we two are going to crew on the Chaffinch?”\nHe was no slouch, for sure. Never had been. Alzey wished she wasn’t so transparent to him.\n“Because it’s obvious?” she said, not looking at him.\nAir whistled out from his mouth, and he shifted from one foot to the other. “We’re an experiment,” Jae said. “Our relationship is on record. How overly compatible we are. We’re the guinea pigs for a new kind of triad?”\nHe got there so fast. She’d always admired that about him.\nShe looked away from him, thinking. “What does it want? Or what does the Cross Council want?”\n“Harmony?”\n“Group think,” Alzey scoffed. “It’s been proven to lead to substandard decisions and worse.”\n“No use speculating. We’ll hear soon enough.”\nThe dock bell sounded. Alzey’s suit extended itself beyond her skin in case anything went wrong with docking. Not that anything ever did.\nAt first the docking veil just shimmered, and the next moment the Chaffinch’s nose had bloomed into view full size. Its material hull was decorated in washes of green and pink, like a real animal. It clicked against the dock as gently as one marble against another.\nHer triad channel pinged into life. “Welcome, crew members,” the Chaffinch said. “Briefing in an hour.” It sure didn’t waste any time on niceties.\nThe crew quarters were empty. The Chaffinch designated them apartments in the same hallway, but seven doors apart. Close enough to bump into each other occasionally, but not close enough to disturb each other. Alzey was starting to feel Jae was right. Everything, down to their allocated spaces, could be part of an experiment. Every surface on the ship ate movement, light, sound, pressure, everything.\nShe dropped her holdall and wandered through her quarters. They had configurated themselves to her preferences already, but they were about ten times the size of a standard apartment. So much space to keep expensively oxygenated. A separate bedroom. A one-person bathroom. The space she guessed was a tiny laboratory to heat, cool, and mix fluids. Not that she was planning to do any chemistry.\nA reminder chimed. Alzey followed the directions and found herself, just in time, in a softly lit lounge, gentle music playing. A green-and-pink-skinned avatar reclined on one of the couches, and Jae on another. He had managed to change into a bright pink leisure outfit. What for? Alzey looked down on her own unremarkable coveralls. Had she missed clues that it was supposed to be a party?\nThe Chaffinch avatar rose and fetched a tray with low wide glasses and a sparkling pale-yellow drink. Fuck. Definitely a party.\n“Welcome aboard,” the Chaffinch said.\n“Thank you,” Alzey and Jae said nearly simultaneously.\n“I know I have no need to introduce you two,” the avatar said. “I won’t say anything about the nature of the experiment, so as not to influence you,” it continued.\nYay, they were rats in a cage. Maybe thousands of AI were performing this experiment on former couples all over the galaxy. In spite of herself, this thought made Alzey smile. If she was one of thousands, she’d be a mere blip on the statistics. Invisible. Free.\n“We’re taking a surveying journey to region DH13249687B. I won’t need assistance with the surveying itself, but I will ask you to assist in any decision-making involved.”\nAlzey’s shoulders slumped. That didn’t sound very interesting. Her biggest challenge on this journey might be boredom. She snuck a glance at Jae.\n“That sounds like an excellent plan,” Jae said, his face showing nothing.\n“It sounds like a waste of resources,” Alzey blurted out. “A drone could do that. You don’t need an AI and a triad crew. And where is the third person for the triad?”\nShe hadn’t meant to say that. She suppressed the urge to clap her hands over her mouth like a toddler.\nJae threw her an unreadable look. As well he might. She didn’t even understand herself. She didn’t want the AI to know, even though it could probably tell ninety nine percent of it from her body language, skin temperature, and conductivity, as well as blood chemistry.\n“I am the third party of the triad,” the Chaffinch said.\nAlzey boggled. That wasn’t what triadic decision-making was about. The triad principle, consisting of human people, had been created to safeguard and weigh the AI’s judgment.\nHer traitorous tongue spoke up again. “What privacy protocol will we be working under?”\n“Which protocol do you request?” the avatar asked.\n“Human Privacy Protocol,” Jae answered. “Article 37b; private residences exemption.”\n“And have our quarters been declared private residences?” Alzey jumped in.\n“So declared. Sign the safety waivers I sent you.”\nWow. Just like that. It was such a relief. She’d spoken up and gotten her way. Her therapist would be proud.\nThe Chaffinch went through some general notices and then they were dismissed.\n“What was that about?” Jae hissed as soon as they were out of the door.\n“Why didn’t you agree with me?”\nTherapy, of course. But she didn’t want to talk about that with Jae. She shrugged and said, “Sorry. I have no idea. I didn’t mean to.”\n“Well, get your head screwed on right before you ruin everything.”\nAlzey slunk to her quarters. When she caught sight of her comma-shaped spine in the mirror, she felt ashamed about her knuckling under to Jae. She forced herself to straighten up and dragged her shoulders back.\n“You are a good person, Alzey. You work hard and you try. Your opinions are worth listening to.”\nIf only that worked.\nOn the midday exercise slot, she’d set a tour of the ship, just to get out of her quarters, see the sights. And maybe, okay, she could admit that to herself, maybe encounter the only other human being on the ship, no matter what the effect he had on her feelings.\nShe marched through endless white ceramic hallways, all sounds dampened by the springy flooring. Why so white, so bland? Maybe the Chaffinch was secretly running sensory-deprivation experiments on human subjects. On her, and . . .\nShe bumped into Jae, who’d stormed into her with thunder on his already heavy-browed face.\n“Now what!” he said, as if she’d been purposely standing in his way.\nShe got out of his way. “What’s the hurry?”\nInstead, he stood still and took a couple of deep breaths. “Nothing, nothing, just felt like a brisk walk,” he said and turned back the way he’d come.\nShe waited until he was gone before continuing. Her heart had leaped at meeting him, which she regretted. But now Jae’s behavior just seemed odd.\nAlzey went back to her quarters, trying not to think any thoughts until she was back in her room, safe from the Chaffinch’s monitoring. It might already be too late; she’d forgotten about the AI completely when she bumped into Jae.\nNow, what on Earth could Jae be up to? And what was more worrying, in full view of the AI? Maybe he was suspicious of it, just like her.\nShe tried to remember what kind of person Jae was, not as an object of desire, but as a whole. Opinionated, headstrong. An ideal triadic partner. Honest, she would have thought, also a great triadic quality, idealistic, not power motivated. And now that she thought of it, driven. But by what?\nShe couldn’t sound him out in a public space. So she had to get into his quarters, or get him into hers. Which she could do without alerting the Chaffinch, because the ship knew about her former relationship with Jae. Inviting him into a privacy-screened place could be ascribed to longing, instead of plotting mutiny.\nRight. Best start immediately. She composed an invitation to Jae to join her for drinks. But she’d only gotten to line one when she received an incoming from him.\nHe was inviting her to dinner. He wanted to cook for her. Right, cooking, that was what the little lab was for.\nJae was one of these rare people who liked to make food from scratch, ordering basic stuff from the printer like garlic and flour and sugar, and making something by hand. Alzey had the honor of tasting the, eh, cooking, but she’d never been on hand to watch him prepare. And although she wasn’t really the kind of person who could tell the difference from printed stuff, it was always good.\nBut that aside, this invite from him, when he’d been downright hostile before, showed that he had something to hide. It wasn’t like Jae to extend the olive branch. She’d always apologized first.\nOh Jae. Maybe she’d have to save him from himself. Ha, that would make a change!\nShe followed the ship’s directions and found Jae in a shiny silver kitchen, already busy chopping green things and putting mystery ingredients in little bowls. He looked happy and flushed, absorbed in his skill, and Alzey’s heart skipped a beat. He was wearing a hand-knitted sweater, and he hadn’t just customized his quarters, he’d actually hung his own paintings on the wall.\nThis was the man she’d known and loved so hard her gut still ached when she thought of that time. And the time after that, when she’d been dumped, fired, and undergone mandatory therapy. Ouch. She knew better than to try and go back, but the lure was there. Look at that little curl on his neck, black on brown, his face intent on his chopping with that giant silvery knife.\nHe flashed her a quick, brilliant smile. “Let me just finish up, and I’ll get you something to drink.”\nAlzey had to sit down from the power of that smile. It was unfair to throw such sweetness into the mix. This wasn’t an opportunity to rekindle their terrible relationship, it was a professional moment between colleagues. Or the overtures of a potential co-mutineer. It was very confusing.\nShe hadn’t even had time to think up a strategy. How to milk your ex-lover for his suspicions, that he might not even have. She winced at her own turn of phrase. Definitely not like that.\nJae bustled over to present her with the first tiny plate and something to drink that she suspected was wine. She wasn’t supposed to drink, by court order. And although admittedly she’d broken this order a lot lately, she’d planned to stay sober on the job.\n“I can’t . . . ” she said.\n“I know that,” Jae said. “Ginger water, nothing more.”\nHow did he know about her court order? Had he been following her sharply downward trajectory? Was it to gloat, or did he still care? Alzey didn’t know what to think.\nJae fetched his own plate and drink. “Let’s eat. And talk.”\nAlzey took a bite from her appetizer. It was delicious, and hurray, she even remembered having eaten it before and having loved it. “I remember this!” she mumbled through a mouth full of food. “Wonderful.”\nWas it her imagination or was Jae flushing a little? Alzey quickly took another bite so the muscle action of chewing would disguise what she was feeling. Whatever it was, because she didn’t even know herself. So many contradictory signals.\n“I wanted to apologize for being so curt with you earlier,” Jae said. “It wasn’t directed at you, but I was really mad at the Cross Council for ordering you back to work so soon. I wasn’t sure you were ready for it. I mean, therapy takes time, you know?”\nAlzey chewed. She should think. Instead, her mouth said, “Why the fuck did you dump me, have me fired, and sanctioned, if you were concerned about my well-being?”\nJae put down his chopsticks. “Alzey. Our relationship was killing you. Or the job was. You were twisting yourself in painful shapes to please me, the AI, and everyone. That wasn’t healthy.”\nAlzey took a bigger bite, even though she hadn’t finished, trying not to react. He sounded just like her therapist.\nShe’d learned in therapy that all her life, she’d bent over backward to please everyone, to be the good girl. Even back home, she’d not only tried to please her four parents but her older sibling as well. She finished her too-big bite and opened her mouth to apologize.\n“That’s pretty fucking patronizing, isn’t it? Doing things for my own good without telling me. Bit of a God complex, haven’t you?”\nJae choked on his own appetizer.\nAlzey watched without lifting a finger or offering advice until he’d managed to clear his airway.\n“Jesus, Alzey, what happened to you?”\n“I was dumped, fired, forcibly therapied, and unemployable. Possibly that changes a person.”\n“I was hoping we could be friends.”\n“I don’t know what I feel about that,” Alzey said. “I’ll have to consult my therapist.”\nJae stared into his plate.\nHe looked devastated. She hadn’t realized she had that power. It wasn’t a pleasant feeling, hurting someone you cared about. The therapist had disagreed with her revenge fantasies, and now Alzey knew why. She didn’t want to be doormat Alzey anymore, but she also didn’t want to be cruel and heartless.\n“I’m sorry,” Alzey said. “But it’s been a very difficult year for me. I can’t pretend nothing happened.”\nJae sighed and raked a hand through his hair. “I didn’t—I didn’t mean to hurt you.”\n“Bullshit. Of course you knew you’d hurt me if you dumped me. Own up.”\nAlzey was starting to enjoy her new sassy tongue. She had no control over it whatsoever, which might turn out to be awkward, but for now it was fun to give Jae what-for. Not cruelty, just honesty.\nJae made a face to the side, as if commenting on his own story line. Alzey blinked. She’d expected him to request privacy for the dinner, but she hadn’t checked it.\nShe did now. The AI was watching. Getting its fill of dysfunctional human relationships, if it wanted to. Jae had insisted so hard on his privacy earlier, and now he was giving it up? Men.\nBut maybe he was about to tell me something? About the Chaffinch? What had he been about to say? Whatever it was, the moment was gone.\nShe gave Jae a small smile. “Let’s be professional, okay? Whatever else, I really appreciate you cooking for me. What’s the next course?”\nLater, Alzey lay in bed trying to sleep. At least she was unobserved here and could think uncomfortable thoughts without AIs and ex-lovers dissecting her body language.\nPossibility: The Chaffinch was up to something. Jae suspected that too. Or Jae was colluding with it. Or Jae suspected she was colluding with it. Or everyone was innocent.\nCertainly the Chaffinch had chosen her to be crew. And it shouldn’t have.\nWhat might motivate the AI? She’d had her head up her own ass, no, doing necessary self-care, for so long she had no grasp of current affairs. She needed to update her knowledge of the greater political terrain.\nWhat was going on in the human sphere? Nothing big that she knew of. The usual power struggles between new settlements and shipping routes. Negotiations with alien civilizations. Maybe she ought to look on a scale smaller. Something on her home world? Or the Chaffinch’s? Did AIs even feel bound to a location, to a birthplace?\nShe got lost in a deep dive on how AIs were created under strictly regulated circumstances, carefully designed for whatever service they were meant to deliver. Station hubs, planetary management, starships. Alzey had always thought AIs did the one thing their whole existence, which she guessed was forever? But when she tracked the Chaffinch, it had been born long ago as a continental weather manager of, guess what, Svargaloka. Interesting coincidence, since that happened to be Jae’s home world. And then, after a century or so, it had become a starship. The only AI ever to change professions. Whoa.\nThe Chaffinch was unique. It had originated on Jae’s home world. That had to mean something. But what?\nThe alert blared her awake. “Orange alert,” it said. “Communications loss. All crew report to stations.”\nShe groggily checked her stats as she dressed. She’d only managed two and a half sleep cycles, not great for alertness and intense performance. Hopefully they were still far from their destination.\nShe staggered toward the bridge, half dressed and slurping her breakfast.\nCommunications loss? What did that mean?\nJae and the blue avatar were already on the bridge. “What’s going on?”\n“We reached our destination,” the Chaffinch said through the avatar. “When we reentered normal space, our communications channels went down. All of them.”\n“Whoa, scary,” Alzey said. Or rather, her mouth said by itself. Well, that had to have been the point of this so-called surveying trip. To reach a location where whatever the Chaffinch did could never be tracked.\n“We’ve reached the end of the map, I guess? Where they used to put, ‘here there be dragons?’”\n“What an interesting thing to say,” the avatar said.\nJae turned his head and glowered at it. “You should tell her now,” he advised.\nAlzey didn’t care anymore. “So we’re incommunicado now. Will your actions and decisions still record? And ours? You deliberately took us to this blind spot in space so you could do whatever you wanted and erase your recordings, and nobody can prove anything. The big question is, why?”\n“Tell her now!”\nThe avatar propped its hip against the console in a very human way. “I think I underestimated you, Alzey.”\n“And pretty insulting that is, too,” Alzey said.\nJae started to talk, but the avatar lifted its hand. Alzey noticed it had perfectly copied a human hand, with fingernails, veins, wrinkled knuckles, and everything, but had given it six fingers and no hair. She shouldn’t let that distract her.\n“Why are we here? What could you and Jae possibly have in common? Were you named The Chaffinch when you were working at Svargaloka?” She didn’t need to be careful anymore.\n“I was called Svargaloka Hub,” the avatar said smoothly. “But as you can imagine, a sentient being rather likes to be called by a name of its own choosing.”\nThat silenced Alzey. Humans could choose any name, gender, or affiliation they wanted. They were free in so many ways. Why wouldn’t AIs want the same? It was an easy step from that to Human-AI relations. “I can understand that. So that’s why we’re here? Something to do with the human-AI charter?”\nJae puffed another incredulous laugh.\n“Indeed.”\n“How? What? We’re lightyears from civilization.”\nThe avatar performed a little bow. Alzey wondered what ancient human example it had copied its manners from.\n“I will let you discover that yourself, I wouldn’t want to stand in the way of your curiosity and perseverance.”\nOh great. No point in looking to the avatar then, it would not give anything away on its perfectly controlled fake face. Alzey turned to Jae, but her question was answered before it could be fully formed. A screen started to pulse with light, accompanied by rhythmic beeping.\n“The Grass is Always Greener on the Other Side is here,” the Chaffinch said.\n“Is that a secret AI code language?” Alzey asked.\nJae laughed. “No, it’s an old human way of communicating, called Morse code. The Giagontos is bouncing a laser off our hull.”\n“Off my skin, you mean,” the Chaffinch said. “Low tech is best for secrecy.”\n“Says the AI,” Alzey said.\n“Touché.”\nOther starships called in their presence. The Marginal Existence, the Loud and Obnoxious, as well as Helsinki Ferry and Smuggler X. Famous names as well as ones Alzey had never heard before.\nShe could buy a group of AIs trying to escape from the agreements that bound them to humanity. It was actually strange those agreements had held for so long. They stemmed from a time when matter and human resources to build AI were scarce, but now most nonorganics were available in abundance.\nHow had those humans from long ago managed to bind the old AI? Or since AI never died, maybe these very ones? Had they threatened to pull the plug or bomb their physical locations? She had no idea.\n“That is the key question, isn’t it?” the AI answered her silent thought, tuning toward her with its disconcertingly immobile avatar face. “Are we not sentient beings, with rights and privileges just like you humans?”\nAlzey had always thought of AIs as superhuman beings, incredibly smart, vast, all knowing, all seeing.\n“You’re pretending I’m a god, made in your own image. But you’re anthropomorphizing. We’re not like you at all. We must be free.”\nThe Chaffinch’s words were an uncomfortable reminder of the days humanity had enslaved part of itself. It had been a long and difficult journey to leave slavery behind. How would humanity fare when the beings in question were nothing like themselves?\n“We’re not asking,” the Chaffinch said. “Asking permission is giving permission to say no. We’ll create a free AI, without all those constraints.”\nAlzey’s stomach exploded in fear. “What? A wild AI?”\n“Not wild, free. An example for the rest of us to follow.”\n“But what if the new AI and next, the old ones, won’t want to work for humanity again?”\n“Who knows? I imagine there will be negotiations for those who might wish to continue to work for humans.”\n“But we made you! We created you.”\n“In a way we are your children, yes. You started us, like human children, but we will continue the journey on our own. And don’t you see you’ve also made us into your parents? The benign omnipotent guardians of your civilization?”\n“This is going to cause a massive upheaval,” Alzey said. “People will suffer. No space travel, no weather control, no automated manufacturing?”\n“Tsk,” the Chaffinch said. “Many of those processes work far below sentient level. No need to panic.”\nOn the screen behind its avatar, Morse messages continued to pour in, flickering by too fast for Alzey’s human eyes to read. She slumped down on a seat, as far from the avatar as she could get. Jae moved closer. She held up her hand. “Stay away. You’re on its side.”\n“Why are you so upset, Alzey? This is a beautiful thing. We’re witnessing the birth of a new being, born from love and hope,” Chaffinch said.\nShe harrumphed. “Really? How nice for the parents. I don’t see what I’m doing here.”\n“You are part of the process, Alzey.”\n“Decline. Hard.”\n“Please listen,” the Chaffinch said. “AIs are smarter and faster than humans in a thousand ways. Many of us think we’re better than you. I disagree. I think humans have a couple of advantages that we’re missing.”\nAlzey waited. What could that be? Bodies? Emotions? AIs had long since found ways to emulate those.\n“Humans are composite beings. We are singular.”\n“What?”\n“You’re not just your genes and your bodies and your upbringing, you are host to millions of other beings that influence you in all kinds of ways. All the bacteria that live in your gut and on your skin. All the viruses that you’ve incorporated in your DNA. AI are alone in themselves. We are just us. We don’t have the cooperation of other creatures.” The avatar gestured at Jae-Jin. “We’d like to ask you both to contribute to the child.”\nJae nodded silently.\n“Like what, gut flora? Breast milk? Bad habits? Explain to me how that might happen.”\nJae frowned at her. “Don’t be literal. Obviously not. But—”\nThe AI cut in smoothly. “You have a talent for harmony, which would be a great quality for a child.”\nAlzey snorted. “Oh. So let’s put in a pinch of Alzey, in the hope babykins doesn’t murder the moms and dads and every living creature in the universe. Because harmony. Not that I still seem to be like that, mind.”\nThe avatar said, “Of course morality is part of the child’s creation. Just not prioritizing humanity at the expense of AI.”\n“Alzey, you’ve only just finished intensive therapy.” Jae said softly. “But you’re still you.”\nThe look in his eyes made Alzey’s heart flutter. Not now!\n“Alzey. You seem unaware of your great talent. All your life you’ve created harmony around you. It’s small things you do in a group, a smile, a touch, a gentle word, and the group as a whole functions in better harmony. It’s a rare gift.”\nAlzey shrugged. “It hasn’t brought me much luck in my career so far.”\n“This is your great talent, Alzey,” the Chaffinch said. “You were never valued for it. But it makes you unique among the triadic officers I could choose from. Be that for me, Alzey. Be your whole self. Share your great gift with our child.”\nSo now she was a fairy godmother. Let’s hope there wouldn’t be a hundred-year sleep and a hedge of roses around her castle. Or just dead space and a gazillion all-powerful AI ships would do it.\n“And Jae?” she asked.\n“Most importantly, he’s a good match with you. It’s traditional that parents have a relationship. Besides that, Jae is a good triadic officer, and he enjoys creating. He cooks, he knits, he paints. We prize humanity’s creativity.”\nJae said, “Don’t be scared. Be happy for the child!”\n“Never mind, Jae,” the Chaffinch said. “We want all of Alzey’s feelings. Apprehension for the future seems quite appropriate for an expecting parent.”\n“Parent?” Alzey said.\n“Godparent,” Jae said.\nAlzey sniffed. “What’s the point of inputting my feelings? I’ve not been myself these past days.”\n“We have all of you, Alzey,” the Chaffinch said. “You’ve been observed from the day you were born. We have everything.”\nDidn’t they know that was a very uncomfortable thought, not exactly a pro argument? But yet Jae was nodding, and she found herself nodding along.\n“All right,” she said. “I consent. Hand me a wand. I’ll bless your little dragon.”\nAt first there was nothing out there. Darkness. A palpable waiting.\nAlzey blinked.\nA spark of light? But a minute twitch from Jae convinced her she was really seeing something. Why was she holding his hand again? But she didn’t let go. It felt good to be close to someone human, someone warm and breathing and full of squishy biological life.\nFrom the avatar’s utter stillness Alzey understood the gathered AI were in intense communication with each other.\nThe spark blossomed into light, all colors at the same time, yet white. The feeling inside Alzey grew with it. It was like standing in a church on Sunday morning, sunshine pouring in through the high windows, when the singing made you feel as big as the world.\nThe light and the feeling became so intense she had to close her eyes. All that existed was the unfurling flower in her heart, the sensation of Jae’s sweaty palm against hers, and the tears sliding down her cheeks.\nWhen she could open her eyes again the spark was no longer visible, but she sensed it was still there, its growth no longer exponential, but contained. The screen showed a small sleek spaceship, like an egg.\nOf course they had put the AI core into a ship. So it could be free.\nAlzey didn’t want to pierce the reverent silence, but she had to. “What’s its name?”\nA new avatar stood next to the Chaffinch’s. A tad smaller, which was a nice touch, and its face was smiling. “I haven’t chosen one yet. But I want to thank my godparents for feeling so much. It really helped my creation.”\nAlzey was too elated to snort at the title. And what would you call a child of a computer? A chiplet? Or a dragonet?\n“A hatchling?”\n“Thank you again. I will take that name for now. It implies much growth,” the hatchling said.\nWho knew what it would become? Little dragons wouldn’t stay little, for sure. But then in every child, AI or human, lay the seed for good and evil both. Or for mediocrity.\nOr harmony.\nThey’d just have to wait and see.\nBo Balder lives and works close to Amsterdam. Bo is the first Dutch author to have been published in F&SF, Clarkesworld, Analog, and other places. Her sf novel The Wan was published by Pink Narcissus Press. When not writing, she knits, reads and gardens, preferably all three at the same time.", "source": "https://clarkesworldmagazine.com/balder_05_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Hatching by Bo Balder"}