{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chen Qiufan; Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "jGff+/qktYnJ5FLSCOUo7GnMgLs=", "id": null, "license": null, "comments": "", "raw_text": "5100 words, short story  The Fish of Lijiang  Winner: 2012 Science Fiction and Fantasy Translation Award Short Story Two fists are before my eyes, bright sunlight reflecting from the backs of the hands.  “Left or right?”  I see myself reaching out with a child’s finger, hesitating, and pointing to the one on the left. The fist flips, opens. Empty.  The fists disappear and reappear.  “One more chance. Left or right?”  I point to the one on the right.  “You’re sure? Want to change your mind?”  My finger hesitates in the air, waving left, then right, like a swimming fish.  “Final answer? Three . . . two . . . one.”  My finger stops on the left.  The fist flips, opens. Other than the bright sunlight, the hand is empty.  A dream?  I open my eyes. The sun is bright, white, and hurts my eyes. I’ve been dozing in this Naxi-style courtyard for who knows how long. I haven’t felt this comfortable in such a long time. The sky is so fucking blue. I stretch until my bones crack.  After ten years, everything here has changed. The only thing that remains the same is the color of the sky.  Lijiang, I’m back. This time, I’m a sick man.  Twenty-four hours ago, I had a multiplicity of identities: an office drone with a strict routine, the master of a gray Ford, the prospective owner of a moldy apartment tucked into a hidden fold of the city, a debt-ridden parasite, etc.  Now, I’m just a patient, a patient in need of rehabilitation.  It’s the fault of that damned mandatory physical exam. On the last page of the report were the words: PNFD II (Psychogenic Neural-Functional Disorder II). Translated into words normal people can understand, they say that I’m messed up and I must take two weeks off to rehabilitate.  My face flushed, I asked my boss whether I could be exempted. I felt the stares of everyone in the office burning into the back of my neck. Schadenfreude. They were delighted that the “boss’s pet” was shown to be human after all, weak in the head, collapsing under the stress.  I shuddered. That’s office politics for you.  The boss spoke slowly, methodically: “You think I want this? I have to pay for your mandatory vacation! People working at other companies can’t even get rehab even if they need it. But the new labor law requires it of us. Our company is a proper, globalized business; we have to set an example . . . Anyway, if you get worse, your disease will turn into neurosyphilis and infect the rest of us. Better that you leave now, yes?”  Ashamed, I left the boss’s office and cleaned out my desk. I ignored the stares. Keep on looking, you neurosyphilitic assholes. I’ll be back in two weeks and we’ll see who gets to be assistant manager at the end of the year.  On the airplane, I listened to the snores around me, unable to fall asleep. I’ve been dealing with insomnia for more than a month. Actually, I’ve been dealing with a lot of things: upset stomach, forgetfulness, headaches, fatigue, depression, loss of libido . . . maybe it really was time for me to rest for a while.  I flipped through the in-flight magazine: the pictures of the tourist sights around Lijiang were so beautiful they almost seemed fake.  Ten years ago, I had nothing and no care. Ten years ago, Lijiang was a paradise for those who liked to exile themselves from civilization. (Or, to put it less pretentiously, that was where young people who fancied themselves “artists” slept with each other.) Ten years ago, I carried everything I owned on my back (still had some muscles then). A map of the ancient city in my pocket, I wandered through it from morning till midnight, chatted with every woman who was alone, fell asleep to the accompaniment of song and alcohol.  Now I’m back. I have a car, a house—everything a man should have, including erectile dysfunction and insomnia. If happiness and time are the two axes of a graph, then I’m afraid that the curve of my life has already passed the apex and is on its inexorable way down to the bottom.  I stay still, thinking of nothing. Sunlight falls from the top of the high walls into the yard, which smells of Chinese mahogany. I don’t know how much time has passed. My watch, mobile, and any other gadget capable of displaying time have been taken away by the staff of the rehabilitation center.  The ancient city has no computers and no TV. But some of the inhabitants have decided to rent out the space on their foreheads and chests. Tiny LCDs are embedded into their skin, showing all kinds of ads, twenty-four hours a day. Like I said, this is no longer the Lijiang I knew.  Strangely, my desire to get better as soon as possible so that I can get back to the office is fading in the sunlight, like the fading smell of the Chinese mahogany.  My stomach growls, once. I decide to go find something to eat. My stomach seems the only way I have left to tell time—oh, there’s also my bladder and the shifting lights in the sky.  The slate-lined street has few pedestrians—this part of the city is reserved for the use of the rehabilitating patients. There are many stray dogs, however: fat, thin, all kinds.  On the flight here I heard a joke. Serious economic criminals, in addition to the death penalty and life imprisonment, can now be sentenced to a third kind of punishment: become experimental subjects for consciousness transfer operations in Lijiang so that they can be turned into dogs. Normally, because these experiments often fail, no one volunteers. But the idea of living in Lijiang is so attractive—even as a dog—many have jumped at the opportunity.  Seeing how these dogs are so obsequious before pretty girls and so nervous before city inspectors, I almost think the joke is reportage.  I finish a bowl of soy chicken, find a café, and sit with a cup of black coffee. I flip through a few books I’ve always been meaning to read (and will never finish) and think about “the meaning of life.”  Is this how you get better? Without any physical therapy, medication, special diet, yoga, yin-yang dynamics, or any other kind of professional care? Is this the meaning of the slogan plastered all over the rehabilitation center: “Healthy Minds, Happy Bodies”?  I have to admit it: I have a great appetite; I’m sleeping well; I’m relaxed; I feel better even than I did ten years ago.  Even my nose, which has been stuffed up for several weeks, can now pick out the fragrance of sachets in a coffee shop. Wait. Sachets?  I lift my head. A girl in a dark green dress is sitting across from me, holding a drink that smells delicious and looking at me with a big smile on her face. This is like the hook for some French film, I think, or maybe a dream, either sweet or terrifying.  “So you’re in marketing?”  The woman and I are walking together in the light of the setting sun. The stone-paved street is bathed in a golden glow. Lovely smells waft from the snack bars.  “Sure. You can also say I’m in sales. How about you? Office lady? Civil service? Police? Teacher?” Then I add a bit of flattery. “Actress?”  “Ha! Keep on guessing.” She seems to enjoy my attempt at humor. “I’m a special care nurse. Surprised?”  “So even nurses can get sick and need rehab.”  After dinner, we go to a bar. She’s disappointed by the decline in the level of service at Lijiang. “What happened to all the fun people who used to run this place?”  From one of the waiters we find out that the place is now owned by Lijiang Industries (stock code # 203845), backed by several wealthy conglomerates. The local owners she knew sold because they either could no longer afford to keep the place running or could not afford a new license. Everything is so much more expensive now. But the stock of Lijiang Industries is doing very well.  The ancient city at night is filled with the spirit of consumerism, but we can’t find anywhere we want to go. She has no interest in hearing Naxi folk music played by a robot orchestra—“Sounds like a braying donkey with its balls cut off.” I don’t want to see a folk dance demonstration by a bonfire—“Like a human BBQ.” In the end we decide to lie down on our bellies by the side of the street, watching the little fish swimming in the waterway.  In the waterways of Lijiang live schools of red fish. Whether it’s dawn, dusk, or midnight, you can see them hovering in the water, facing the same direction, lined up like soldiers on a parade ground ready for inspection. But if you look closer, you’ll see that they aren’t really still. In fact, they’re struggling against the current in order to maintain their position. Once in a while, one or two fish become tired and are pushed out of the formation by the current. But soon, tails fluttering, they struggle back into place.  It’s been ten years since I last saw them. They, at least, haven’t changed.  “Swim, swim, swim. Before you know it, life is over.” I repeat the same words I said ten years ago.  “Just like us,” she says.  “This is the hidden meaning of life,” I say. “At least we still can choose how to live.” I sound so pretentious that I want to gag.  “But the reality is that I didn’t choose you, and you didn’t choose me.”  My heart skips a beat. I look at her. I really haven’t thought about inviting her to come back to my hotel. I still don’t feel the return of my libido. This is a misunderstanding.  She begins to laugh.  “I was quoting a song. You don’t know it? Well, I’m pretty beat. Why don’t we meet up again tomorrow? You’re fun.”  “But how do I find you . . . ” I suddenly realize that I don’t have my mobile.  “I’m staying here.” She hands me the card from a hotel. “If you’re too lazy to walk there, just get a dog.”  “A dog?”  “You really don’t know? Any stray dog would do. Take a piece of paper, write down the time and place you want to meet at and stick it in the dog’s collar. Then swipe the hotel card through the collar.”  “You’re not kidding?”  “You need to read your Lijiang guidebook.”  I don’t know how long I slept.  I think it’s the afternoon of the second day, but the position of the sun tells me it’s morning. Except I have no way of ascertaining that it’s not the morning of the third day, the fourth day, or a morning that comes after a dream that lasts a lifetime.  Maybe that’s the trick to full rehab: just don’t dream about business reports and my boss’s fat face.  I look for a dog. But the dogs here have sharp noses. They can smell the failure on me and run away. I’m forced to buy a packet of yak jerky. I feed a dog—a real son of a bitch—until it’s stuffed. Finally I get him to carry my message.  In case she forgets who I am, I sign the note “Last Night’s Fish.”  I wander the streets. I enjoy the sun and the idleness. No one here has any sense of time anyway, so she can come whenever she wants to.  I see an old man sitting in a corner with a falcon. The falcon and the man are both full of energy. I go up to them with my camera.  “No pictures!” the old man shouts.  “Five yuan! One dollar!” the falcon shouts in a mixture of Sichuan-accented Mandarin and English.  Fuck! They’re both robots. The city has nothing authentic any more. I turn around angrily.  “Do you want to know why the sky in Lijiang is so blue? Do you want to hear the legend of the Jade Dragon Snow Mountain?” Seeing that I’m about to go away, the old man changes his pitch and even his accent. Now he sounds like a man from urbane Suzhou. “I know everything there is to know about Lijiang. One yuan only for each piece of information.”  Why not? I just want to kill some time. Might as well hear his lies. I take out a coin and stick it into the falcon’s beak. Clink! A panel opens in the falcon’s chest, revealing a pink-glowing keypad.  “To hear why the sky of Lijiang is so blue, press 1. To hear the Legend of Jade Dragon Snow Mountain, press 2. . . . ”  Enough. I press “1.”  “Modern Lijiang relies on condensation control and scatter index standardization. The technology is able to maintain sunny days with probability above 95.426%. Through micro-adjustments to the atmospheric particle content, it is able to maintain the hue of the sky between Pantone2975c and 3035c. The system is designed by . . . ”  Damn it. I feel sad. Even the sky, so beautiful it’s like the pristine sky present at Creation, is fake.  “Looking for UFOs?” she asks, as she puts her hands on my shoulders from behind.  “Can you tell me if anything here is real?” I mutter.  “Sure. There’s you. There’s me. We’re real.”  “Real sick,” I correct her.  “Tell me about yourself. I love getting to know someone.”  We’re now back in the bar. Through the window we can see the fish in the waterway below, swimming, swimming, going nowhere.  “Let’s play a game,” she says. “We take turns guessing facts about the other person. If the guess is right, the other person drinks. If the guess is wrong, the guesser drinks.”  “Sure. We’ll see who gets drunk first.”  “I’ll go first. You work for a big company, right?”  “Ha. My boss’s favorite saying is: We’re a proper, global, modern, big”—I lower my voice—“factory.”  She giggles.  I can’t remember if I told her anything about my company in the past. But I take a drink anyway.  “Your patients,” I ask, “are all important people, right?” She drinks.  “You’re an important man at your company,” she says. I drink.  “I’ll ask something more interesting,” I say. “You’ve had patients who made passes at you, haven’t you?”  She blushes, and drains her glass.  “You must have many girlfriends,” she says. I hesitate for a second, and drink. “Had” is a form of “have,” I tell myself.  “You are not married,” I say.  She smiles, not answering.  I shrug, taking a drink.  Only after I’m done does she lift her glass and drink.  “Not fair! You tricked me.” I say. But I’m happy.  “It’s your own fault for being impatient.”  “Fine, then I’m going to guess that you have insomnia, anxiety, arrhythmia, irregular periods . . . ” I know I’ve been drinking too fast. I know I’m going to regret this but I can’t stop talking.  She glares at me, and drinks. Then she adds, “Whatever symptoms you have, I don’t. Whatever symptoms I have, you don’t.”  “We’re both here, aren’t we?”  She shakes her head. “You think nothing has meaning.”  “That was before I met you,” I say, in what I think is a seductive tone. Now I’m just shameless.  She ignores me. “You’re often anxious, because you hate the feeling of the seconds slipping away from you. The world is changing every day. And every day you’re getting older. But there are still so many things you haven’t done. You want to hold onto the sand. But the harder you squeeze, the quicker the sand slips from the cracks between your fingers, until nothing is left . . . ”  Coming from anyone else, the words would just be pop psychology, pseudo intellectualism, cheap spirituality. But somehow, coming from her, they sound like the truth. Every word strikes against my heart, making me wince.  I drink by myself in silence. Her smile begins to multiply: two, three, four of her . . . I want to ask her something, but my tongue is no longer obeying.  She looks embarrassed. She whispers to me, “You’re drunk. I’ll take you back.”  So, I’ve failed again.  It takes a long time for me to remember where I am.  During the time I’m thinking, the sun shifts through six window squares. The sun marches across three more window squares before I’ve washed away the smell of alcohol on my body and the vomit in the bathroom.  I guess Miss Nurse hasn’t taken good care of this patient. I have a splitting headache.  I don’t want to send a dog after her. Indeed, I’m a bit scared to meet her. Maybe she’s a telepath? It makes sense to have a telepath as a special care nurse, right? Especially if a patient can no longer speak.  The biggest fear is for someone else to understand what you really fear.  A Shar-Pei enters my room and barks at me. I take out the slip of paper tucked into its collar.  She wants me to go with her to listen to robots playing Naxi folk music, which she described to me as a donkey braying with its balls cut off. She signed her note “I’m No Telepath.”  Screw you! You bourgeois bitch! I kick the Shar-Pai. It whimpers.  In the end, curiosity overcomes fear. I wash, get dressed, go to the concert hall. She’s dressed all in yellow. I nod at her.  But she ignores my attempt to remain distant. She walks right up to me, takes my hand in hers, and drags me inside.  “Stop pretending,” she whispers in my ear. I have to struggle to keep from her how aroused I am.  They begin to play. It does sound like a donkey braying. It’s an insult to real Naxi music, the sort I heard ten years ago.  The robots swing back and forth, pretending to play all sorts of Naxi instruments, and recorded music streams from speakers embedded into the seats. The robots are clearly made in China: stiff, ridiculous movements, limited repertoire of gestures, monotonous expressions. Only robot Xuan Ke is made with any kind of care for detail. Once in a while he even acts as though he’s completely absorbed by his performance. I worry that he’ll swing so hard that his head is going to fall off.  “I thought you didn’t like donkey-braying,” I whisper into her ear. The fragrance of sachets surrounds me.  “This is one part of our rehabilitation.”  “Yeah, right.”  I try to kiss her. But she dodges out of the way and my lips meet her fingers.  “Back in your office, on your desk, there’s a tiny grey alarm clock. It’s shaped like a mushroom, and it often runs fast.”  Her tone is calm, but I’m stupefied. That clock was a gift from the company when I won employee of the month. How does she know about it?  I lost the drinking game—maybe that was an accident. But this . . .  I continue to stare at her profile. The donkey-braying music washes over me like a tidal wave. I seem to have also become a robot musician. I strain to play my foolish song of seduction, but she sees through me with no effort. I have nothing in my chest but a mechanical heart made of iron.  We end up in bed together.  She acts as though this is nothing special. But not me. A man is such a strange animal: fear and desire are expressed by the same organ. For the former, he loses control of the organ and it lets out urine; for the latter, he loses control of the organ and it fills with blood.  Is this part of our rehab too? I can imagine myself mocking her. But I don’t, because I fear how she’ll answer.  “Who are you really?” I can’t help myself.  Her voice is muffled, indistinct.  “I’m a nurse. My patient is time.”  In the end she does tell me her story.  She works for a place called “Time Care Unit.” Only the most important men of the business world get to go there.  The old men are like mummies, their bodies plugged full of tubes and wires. Twenty-four hours a day they must be watched and cared for. Every day, all kinds of people come to visit. They dress in sterile biosuits and stand around the beds, communing with the old men, reporting and receiving instructions in silence.  The old men never move. Each of their breaths takes hours. Once in a while, one of them moans like a baby, and someone makes a record of it. Looking at all the biological signs, they should all be considered dead. The numbers shown on their machines never change. But they remain in that place for years, decades.  She tells me that they are receiving “time sense dilation therapy.” She calls them “the living dead.”  The therapy began some twenty years ago. Back then, scientists discovered that by controlling the biological clock of an organism, it was possible to reduce the production of free radicals and slow down aging. But the decay of the mind and its eventual death could not be reversed or halted.  Someone made another discovery: the aging of the mind was intimately connected with the sense of the passage of time. By manipulating certain receptors in the pineal gland, it was possible to slow down one’s sense of time, to dilate it. The body of a person receiving time sense dilation therapy remains in the normal stream of time, but his mind experiences time a hundred, a thousand times slower than the rest of us.  “But what does this have to do with you?” I ask.  “You know that women who live together synchronize their biological rhythms, like menstrual cycles?”  I nod.  “It’s the same thing with us nurses who care for these living dead, day in, day out. Once a year, I have to come to Lijiang to rehabilitate, to remove the effects time dilation has on my body.”  I feel dizzy. Time sense dilation is used on those old men because of the need to maintain stock prices or to delay power struggles among successors. But what if the dilation is applied to a normal person? I try to imagine experiencing a hundred years within a second. But my imagination is not up to the task. To extend time to near infinity is to slow it down until it’s almost still. Then isn’t the mind under such dilation immortal? What’s the need for a body made of flesh?  “Remember what I told you? I didn’t choose you, and you didn’t choose me,” she says, smiling almost apologetically.  I begin to feel anxiety again, as though my fingers are wrapped around a handful of sand, leaking sand.  “You’re the other half of me, cloven by Zeus’s thunderbolt.”  The words sound to me like a curse.  She’s leaving.  She tells me that her rehabilitation period is up.  We sit in the dark. In front of us is the imposing mass of Jade Dragon Snow Mountain, its snowy peaks reflecting the silver moonlight. Neither of us speaks.  The donkey-braying music loops again and again in my head.  “Remember that alarm clock on your desk?”  Although time sense dilation therapy is very expensive, the opposite procedure—time sense compression—is not. The procedure is cheap enough to be commercialized. Several large conglomerates have invested in it, and taking advantage of certain loopholes in China’s labor laws (and the complicity of the government), they’ve been conducting secret trials on Chinese employees of international companies.  That alarm clock is a prototype time sense compressor.  “So we are all lab mice,” I remember mocking myself at her revelation. Even my boss is a mouse—he also has one of those clocks on his desk.  “It doesn’t matter if you know the truth,” she says. “The theoretical basis for time sense compression does not exist.”  “Does not exist?”  “Theoretical physics says it’s impossible, so they had to base it on the philosophy of Henri Bergson. It’s all about intuition.”  “What are you talking about?”  “I don’t know.” She laughs. “Maybe it’s all nonsense.”  “You’re telling me that my disease, this PNFD II or whatever it’s called, is the result of time sense compression?”  She doesn’t say anything.  But it makes sense. Time passes quicker in my mind than it does in the real world. Every day I’m exhausted. I’m always working overtime. I accomplish so much more in twenty-four hours than others. No wonder the company thinks I’m a model employee.  Clouds drift over and hide the moon, eliminating the reflected light on the snowy peaks. Everything grows darker like after they lower the lights in a theatre.  A bright red laser beam lands on the snowy cliffs—5600 meters above the sea—now acting as a giant screen. The laser creates shifting patterns, telling an animated tale, the creation of the world. A myth has been bowdlerized to mass entertainment. I’m not in the mood to appreciate it. The dancing lights only make my heart beat irregularly.  Time sense compression is wonderful for improving productivity and GDP. But there are many side effects. The mismatch between subjective time and physical time causes metabolic problems that accumulate into severe symptoms.  The conglomerates that invested in the technology created the rehabilitation centers in China and lobbied to change the labor laws to institutionalize the idea of “rehabilitation” so as to hide the truth.  They discovered that those suffering from the side effects of time sense dilation and those suffering from the side effects of time sense compression can help each other, be each other’s cure.  “I’m the yang to your yin, is that it?” So her interest in me is limited to my value as a medical device. My middle-aged male ego is hurt.  “Sure, if you insist on thinking about it that way.” Her tone, at least, is compassionate.  “What about the donkey-braying music?”  “It’s a way to harmonize our biorhythms.”  I wait for her to stroke my ego by telling me that compared to her previous rehabilitation biorhythm partners, I’m better looking, more interesting, more special, etc. But she says nothing of the kind.  “What about the dogs?” I’m running out of things to say before she leaves.  “They started out as regular dogs. But because they’re exposed to so many patients with out-of-sync senses of time, the structures in their brain have changed.”  “I have only one last wish.” I stare at her bright eyes in the darkness, like a pair of fireflies. “Come and look at the fish in the waterways with me. Maybe they’re the only creatures in this world who live real lives.”  The fireflies brighten. She touches my face lightly. “Actually . . . ”  I silence her lips with my fingers. I shake my head. I’ve succeeded. There’s no need for her to tell me what she’s going to tell me, the three heaviest words in the world.  But she gently moves my hand away, and says three words, three different words.  “Don’t be stupid.”  I’m alone by the waterway, staring at the fish.  She’s gone, leaving behind no way to contact her. Sand pricks my palms. No matter how hard I squeeze, they slip away.  Fish, oh fish, you’re the only ones left to keep me company.  Suddenly, I feel an intense jealousy of these fish. Their lives are so simple, so pure. There’s only one direction—against the current. They do not have to hesitate, overwhelmed by an endless array of choices. But if I really lived a life like that, maybe I’d still complain. A man is never content with what he has.  Suddenly I want to spit at myself for my self-love, self-pity, self-obsession, self-self. But in the end I do nothing.  I look at one single fish: it’s pushed away from its school by the current. Once, twice, thrice. It falls behind, waves its tail madly, and returns to its position.  Fuck. It’s tough.  But wait.  Why is it always this one fish? Why is its trajectory and movement always exactly the same?  I wait, unblinking.  Two minutes later, that same little fish again drifts away from the school, again waves its tail madly, again returns to its position.  I lift the stone in my hand.  The stone falls through the holographic fish and sinks to the bottom of the waterway.  I have nothing left in my hand, not even a single grain of sand.  My rehabilitation over, I’m on my return flight with my not-so-healthy mind and not-so-happy body. The airplane hasn’t taken off yet but the cabin is already filled with snores.  I guess some people at least have been fully rehabilitated.  Suddenly the idea of returning to that concrete jungle to struggle against my fellow time-compressors disgusts me.  The plane takes off. Cities, roads, mountains, rivers—everything recedes into a small chessboard composed of parti-colored squares. In every square, time flows faster or slower. The people below throng like a nest of ants controlled by an invisible hand, divide into a few groups, are stuffed into the different squares: time flies past the laborer, the poor, the “third world”; time crawls for the rich, the idle, the “developed world”; time stays still for those in charge, the idols, the gods . . .  Suddenly, two fat hands belonging to a child appear before me, holding the entire world in them, backs of the hands up.  “Left or right?”  I look to the left and then right. I’m frightened. I have no way to pick.  Mocking laughter.  I lunge and grab both fists and force the fingers open: both are empty, both lies.  “Sir, sir!”  The pretty flight attendant wakes me. Now I finally remember the origin of that dream. It was my cousin who tormented me as a child. His favorite game was to force me to guess in which hand he had hidden the candy he took away from me. He loved to tease me because I was always hesitant, always had trouble deciding.  “Sir, would you like soda, coffee, tea or something else?”  “ . . . you.”  She blushes.  I smile at her. “I just want coffee, black.”  This is the only truly free choice I have left.    \"The Fish of Lijiang\" was originally published in Chinese in Science Fiction World, May 2006. Chen Qiufan was born in 1981, in Shantou, China. (In accordance with Chinese custom, Mr. Chen's surname is written first. He sometimes uses the English name Stanley Chan.) He is a graduate of Peking University and published his first short story in 1997 in Science Fiction World, China's largest science fiction magazine. Since 2004, he has published over thirty stories in Science Fiction World, Esquire, Chutzpah, and other magazines. His first novel, The Abyss of Vision, came out in 2006. He won Taiwan's Dragon Fantasy Award in 2006 with \"A Record of the Cave of Ning Mountain,\" a work written in Classical Chinese. In English, his short stories have been published in Clarkesworld, Lightspeed, MIT Technology Review, Slate, Pathlight and other venues. His novel, Waste Tide was published by Tor in 2019.  Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.", "text": "5100 words, short story\nThe Fish of Lijiang\nWinner: 2012 Science Fiction and Fantasy Translation Award\nShort Story\nTwo fists are before my eyes, bright sunlight reflecting from the backs of the hands.\n“Left or right?”\nI see myself reaching out with a child’s finger, hesitating, and pointing to the one on the left. The fist flips, opens. Empty.\nThe fists disappear and reappear.\n“One more chance. Left or right?”\nI point to the one on the right.\n“You’re sure? Want to change your mind?”\nMy finger hesitates in the air, waving left, then right, like a swimming fish.\n“Final answer? Three . . . two . . . one.”\nMy finger stops on the left.\nThe fist flips, opens. Other than the bright sunlight, the hand is empty.\nA dream?\nI open my eyes. The sun is bright, white, and hurts my eyes. I’ve been dozing in this Naxi-style courtyard for who knows how long. I haven’t felt this comfortable in such a long time. The sky is so fucking blue. I stretch until my bones crack.\nAfter ten years, everything here has changed. The only thing that remains the same is the color of the sky.\nLijiang, I’m back. This time, I’m a sick man.\nTwenty-four hours ago, I had a multiplicity of identities: an office drone with a strict routine, the master of a gray Ford, the prospective owner of a moldy apartment tucked into a hidden fold of the city, a debt-ridden parasite, etc.\nNow, I’m just a patient, a patient in need of rehabilitation.\nIt’s the fault of that damned mandatory physical exam. On the last page of the report were the words: PNFD II (Psychogenic Neural-Functional Disorder II). Translated into words normal people can understand, they say that I’m messed up and I must take two weeks off to rehabilitate.\nMy face flushed, I asked my boss whether I could be exempted. I felt the stares of everyone in the office burning into the back of my neck. Schadenfreude. They were delighted that the “boss’s pet” was shown to be human after all, weak in the head, collapsing under the stress.\nI shuddered. That’s office politics for you.\nThe boss spoke slowly, methodically: “You think I want this? I have to pay for your mandatory vacation! People working at other companies can’t even get rehab even if they need it. But the new labor law requires it of us. Our company is a proper, globalized business; we have to set an example . . . Anyway, if you get worse, your disease will turn into neurosyphilis and infect the rest of us. Better that you leave now, yes?”\nAshamed, I left the boss’s office and cleaned out my desk. I ignored the stares. Keep on looking, you neurosyphilitic assholes. I’ll be back in two weeks and we’ll see who gets to be assistant manager at the end of the year.\nOn the airplane, I listened to the snores around me, unable to fall asleep. I’ve been dealing with insomnia for more than a month. Actually, I’ve been dealing with a lot of things: upset stomach, forgetfulness, headaches, fatigue, depression, loss of libido . . . maybe it really was time for me to rest for a while.\nI flipped through the in-flight magazine: the pictures of the tourist sights around Lijiang were so beautiful they almost seemed fake.\nTen years ago, I had nothing and no care. Ten years ago, Lijiang was a paradise for those who liked to exile themselves from civilization. (Or, to put it less pretentiously, that was where young people who fancied themselves “artists” slept with each other.) Ten years ago, I carried everything I owned on my back (still had some muscles then). A map of the ancient city in my pocket, I wandered through it from morning till midnight, chatted with every woman who was alone, fell asleep to the accompaniment of song and alcohol.\nNow I’m back. I have a car, a house—everything a man should have, including erectile dysfunction and insomnia. If happiness and time are the two axes of a graph, then I’m afraid that the curve of my life has already passed the apex and is on its inexorable way down to the bottom.\nI stay still, thinking of nothing. Sunlight falls from the top of the high walls into the yard, which smells of Chinese mahogany. I don’t know how much time has passed. My watch, mobile, and any other gadget capable of displaying time have been taken away by the staff of the rehabilitation center.\nThe ancient city has no computers and no TV. But some of the inhabitants have decided to rent out the space on their foreheads and chests. Tiny LCDs are embedded into their skin, showing all kinds of ads, twenty-four hours a day. Like I said, this is no longer the Lijiang I knew.\nStrangely, my desire to get better as soon as possible so that I can get back to the office is fading in the sunlight, like the fading smell of the Chinese mahogany.\nMy stomach growls, once. I decide to go find something to eat. My stomach seems the only way I have left to tell time—oh, there’s also my bladder and the shifting lights in the sky.\nThe slate-lined street has few pedestrians—this part of the city is reserved for the use of the rehabilitating patients. There are many stray dogs, however: fat, thin, all kinds.\nOn the flight here I heard a joke. Serious economic criminals, in addition to the death penalty and life imprisonment, can now be sentenced to a third kind of punishment: become experimental subjects for consciousness transfer operations in Lijiang so that they can be turned into dogs. Normally, because these experiments often fail, no one volunteers. But the idea of living in Lijiang is so attractive—even as a dog—many have jumped at the opportunity.\nSeeing how these dogs are so obsequious before pretty girls and so nervous before city inspectors, I almost think the joke is reportage.\nI finish a bowl of soy chicken, find a café, and sit with a cup of black coffee. I flip through a few books I’ve always been meaning to read (and will never finish) and think about “the meaning of life.”\nIs this how you get better? Without any physical therapy, medication, special diet, yoga, yin-yang dynamics, or any other kind of professional care? Is this the meaning of the slogan plastered all over the rehabilitation center: “Healthy Minds, Happy Bodies”?\nI have to admit it: I have a great appetite; I’m sleeping well; I’m relaxed; I feel better even than I did ten years ago.\nEven my nose, which has been stuffed up for several weeks, can now pick out the fragrance of sachets in a coffee shop. Wait. Sachets?\nI lift my head. A girl in a dark green dress is sitting across from me, holding a drink that smells delicious and looking at me with a big smile on her face. This is like the hook for some French film, I think, or maybe a dream, either sweet or terrifying.\n“So you’re in marketing?”\nThe woman and I are walking together in the light of the setting sun. The stone-paved street is bathed in a golden glow. Lovely smells waft from the snack bars.\n“Sure. You can also say I’m in sales. How about you? Office lady? Civil service? Police? Teacher?” Then I add a bit of flattery. “Actress?”\n“Ha! Keep on guessing.” She seems to enjoy my attempt at humor. “I’m a special care nurse. Surprised?”\n“So even nurses can get sick and need rehab.”\nAfter dinner, we go to a bar. She’s disappointed by the decline in the level of service at Lijiang. “What happened to all the fun people who used to run this place?”\nFrom one of the waiters we find out that the place is now owned by Lijiang Industries (stock code # 203845), backed by several wealthy conglomerates. The local owners she knew sold because they either could no longer afford to keep the place running or could not afford a new license. Everything is so much more expensive now. But the stock of Lijiang Industries is doing very well.\nThe ancient city at night is filled with the spirit of consumerism, but we can’t find anywhere we want to go. She has no interest in hearing Naxi folk music played by a robot orchestra—“Sounds like a braying donkey with its balls cut off.” I don’t want to see a folk dance demonstration by a bonfire—“Like a human BBQ.” In the end we decide to lie down on our bellies by the side of the street, watching the little fish swimming in the waterway.\nIn the waterways of Lijiang live schools of red fish. Whether it’s dawn, dusk, or midnight, you can see them hovering in the water, facing the same direction, lined up like soldiers on a parade ground ready for inspection. But if you look closer, you’ll see that they aren’t really still. In fact, they’re struggling against the current in order to maintain their position. Once in a while, one or two fish become tired and are pushed out of the formation by the current. But soon, tails fluttering, they struggle back into place.\nIt’s been ten years since I last saw them. They, at least, haven’t changed.\n“Swim, swim, swim. Before you know it, life is over.” I repeat the same words I said ten years ago.\n“Just like us,” she says.\n“This is the hidden meaning of life,” I say. “At least we still can choose how to live.” I sound so pretentious that I want to gag.\n“But the reality is that I didn’t choose you, and you didn’t choose me.”\nMy heart skips a beat. I look at her. I really haven’t thought about inviting her to come back to my hotel. I still don’t feel the return of my libido. This is a misunderstanding.\nShe begins to laugh.\n“I was quoting a song. You don’t know it? Well, I’m pretty beat. Why don’t we meet up again tomorrow? You’re fun.”\n“But how do I find you . . . ” I suddenly realize that I don’t have my mobile.\n“I’m staying here.” She hands me the card from a hotel. “If you’re too lazy to walk there, just get a dog.”\n“A dog?”\n“You really don’t know? Any stray dog would do. Take a piece of paper, write down the time and place you want to meet at and stick it in the dog’s collar. Then swipe the hotel card through the collar.”\n“You’re not kidding?”\n“You need to read your Lijiang guidebook.”\nI don’t know how long I slept.\nI think it’s the afternoon of the second day, but the position of the sun tells me it’s morning. Except I have no way of ascertaining that it’s not the morning of the third day, the fourth day, or a morning that comes after a dream that lasts a lifetime.\nMaybe that’s the trick to full rehab: just don’t dream about business reports and my boss’s fat face.\nI look for a dog. But the dogs here have sharp noses. They can smell the failure on me and run away. I’m forced to buy a packet of yak jerky. I feed a dog—a real son of a bitch—until it’s stuffed. Finally I get him to carry my message.\nIn case she forgets who I am, I sign the note “Last Night’s Fish.”\nI wander the streets. I enjoy the sun and the idleness. No one here has any sense of time anyway, so she can come whenever she wants to.\nI see an old man sitting in a corner with a falcon. The falcon and the man are both full of energy. I go up to them with my camera.\n“No pictures!” the old man shouts.\n“Five yuan! One dollar!” the falcon shouts in a mixture of Sichuan-accented Mandarin and English.\nFuck! They’re both robots. The city has nothing authentic any more. I turn around angrily.\n“Do you want to know why the sky in Lijiang is so blue? Do you want to hear the legend of the Jade Dragon Snow Mountain?” Seeing that I’m about to go away, the old man changes his pitch and even his accent. Now he sounds like a man from urbane Suzhou. “I know everything there is to know about Lijiang. One yuan only for each piece of information.”\nWhy not? I just want to kill some time. Might as well hear his lies. I take out a coin and stick it into the falcon’s beak. Clink! A panel opens in the falcon’s chest, revealing a pink-glowing keypad.\n“To hear why the sky of Lijiang is so blue, press 1. To hear the Legend of Jade Dragon Snow Mountain, press 2. . . . ”\nEnough. I press “1.”\n“Modern Lijiang relies on condensation control and scatter index standardization. The technology is able to maintain sunny days with probability above 95.426%. Through micro-adjustments to the atmospheric particle content, it is able to maintain the hue of the sky between Pantone2975c and 3035c. The system is designed by . . . ”\nDamn it. I feel sad. Even the sky, so beautiful it’s like the pristine sky present at Creation, is fake.\n“Looking for UFOs?” she asks, as she puts her hands on my shoulders from behind.\n“Can you tell me if anything here is real?” I mutter.\n“Sure. There’s you. There’s me. We’re real.”\n“Real sick,” I correct her.\n“Tell me about yourself. I love getting to know someone.”\nWe’re now back in the bar. Through the window we can see the fish in the waterway below, swimming, swimming, going nowhere.\n“Let’s play a game,” she says. “We take turns guessing facts about the other person. If the guess is right, the other person drinks. If the guess is wrong, the guesser drinks.”\n“Sure. We’ll see who gets drunk first.”\n“I’ll go first. You work for a big company, right?”\n“Ha. My boss’s favorite saying is: We’re a proper, global, modern, big”—I lower my voice—“factory.”\nShe giggles.\nI can’t remember if I told her anything about my company in the past. But I take a drink anyway.\n“Your patients,” I ask, “are all important people, right?” She drinks.\n“You’re an important man at your company,” she says. I drink.\n“I’ll ask something more interesting,” I say. “You’ve had patients who made passes at you, haven’t you?”\nShe blushes, and drains her glass.\n“You must have many girlfriends,” she says. I hesitate for a second, and drink. “Had” is a form of “have,” I tell myself.\n“You are not married,” I say.\nShe smiles, not answering.\nI shrug, taking a drink.\nOnly after I’m done does she lift her glass and drink.\n“Not fair! You tricked me.” I say. But I’m happy.\n“It’s your own fault for being impatient.”\n“Fine, then I’m going to guess that you have insomnia, anxiety, arrhythmia, irregular periods . . . ” I know I’ve been drinking too fast. I know I’m going to regret this but I can’t stop talking.\nShe glares at me, and drinks. Then she adds, “Whatever symptoms you have, I don’t. Whatever symptoms I have, you don’t.”\n“We’re both here, aren’t we?”\nShe shakes her head. “You think nothing has meaning.”\n“That was before I met you,” I say, in what I think is a seductive tone. Now I’m just shameless.\nShe ignores me. “You’re often anxious, because you hate the feeling of the seconds slipping away from you. The world is changing every day. And every day you’re getting older. But there are still so many things you haven’t done. You want to hold onto the sand. But the harder you squeeze, the quicker the sand slips from the cracks between your fingers, until nothing is left . . . ”\nComing from anyone else, the words would just be pop psychology, pseudo intellectualism, cheap spirituality. But somehow, coming from her, they sound like the truth. Every word strikes against my heart, making me wince.\nI drink by myself in silence. Her smile begins to multiply: two, three, four of her . . . I want to ask her something, but my tongue is no longer obeying.\nShe looks embarrassed. She whispers to me, “You’re drunk. I’ll take you back.”\nSo, I’ve failed again.\nIt takes a long time for me to remember where I am.\nDuring the time I’m thinking, the sun shifts through six window squares. The sun marches across three more window squares before I’ve washed away the smell of alcohol on my body and the vomit in the bathroom.\nI guess Miss Nurse hasn’t taken good care of this patient. I have a splitting headache.\nI don’t want to send a dog after her. Indeed, I’m a bit scared to meet her. Maybe she’s a telepath? It makes sense to have a telepath as a special care nurse, right? Especially if a patient can no longer speak.\nThe biggest fear is for someone else to understand what you really fear.\nA Shar-Pei enters my room and barks at me. I take out the slip of paper tucked into its collar.\nShe wants me to go with her to listen to robots playing Naxi folk music, which she described to me as a donkey braying with its balls cut off. She signed her note “I’m No Telepath.”\nScrew you! You bourgeois bitch! I kick the Shar-Pai. It whimpers.\nIn the end, curiosity overcomes fear. I wash, get dressed, go to the concert hall. She’s dressed all in yellow. I nod at her.\nBut she ignores my attempt to remain distant. She walks right up to me, takes my hand in hers, and drags me inside.\n“Stop pretending,” she whispers in my ear. I have to struggle to keep from her how aroused I am.\nThey begin to play. It does sound like a donkey braying. It’s an insult to real Naxi music, the sort I heard ten years ago.\nThe robots swing back and forth, pretending to play all sorts of Naxi instruments, and recorded music streams from speakers embedded into the seats. The robots are clearly made in China: stiff, ridiculous movements, limited repertoire of gestures, monotonous expressions. Only robot Xuan Ke is made with any kind of care for detail. Once in a while he even acts as though he’s completely absorbed by his performance. I worry that he’ll swing so hard that his head is going to fall off.\n“I thought you didn’t like donkey-braying,” I whisper into her ear. The fragrance of sachets surrounds me.\n“This is one part of our rehabilitation.”\n“Yeah, right.”\nI try to kiss her. But she dodges out of the way and my lips meet her fingers.\n“Back in your office, on your desk, there’s a tiny grey alarm clock. It’s shaped like a mushroom, and it often runs fast.”\nHer tone is calm, but I’m stupefied. That clock was a gift from the company when I won employee of the month. How does she know about it?\nI lost the drinking game—maybe that was an accident. But this . . .\nI continue to stare at her profile. The donkey-braying music washes over me like a tidal wave. I seem to have also become a robot musician. I strain to play my foolish song of seduction, but she sees through me with no effort. I have nothing in my chest but a mechanical heart made of iron.\nWe end up in bed together.\nShe acts as though this is nothing special. But not me. A man is such a strange animal: fear and desire are expressed by the same organ. For the former, he loses control of the organ and it lets out urine; for the latter, he loses control of the organ and it fills with blood.\nIs this part of our rehab too? I can imagine myself mocking her. But I don’t, because I fear how she’ll answer.\n“Who are you really?” I can’t help myself.\nHer voice is muffled, indistinct.\n“I’m a nurse. My patient is time.”\nIn the end she does tell me her story.\nShe works for a place called “Time Care Unit.” Only the most important men of the business world get to go there.\nThe old men are like mummies, their bodies plugged full of tubes and wires. Twenty-four hours a day they must be watched and cared for. Every day, all kinds of people come to visit. They dress in sterile biosuits and stand around the beds, communing with the old men, reporting and receiving instructions in silence.\nThe old men never move. Each of their breaths takes hours. Once in a while, one of them moans like a baby, and someone makes a record of it. Looking at all the biological signs, they should all be considered dead. The numbers shown on their machines never change. But they remain in that place for years, decades.\nShe tells me that they are receiving “time sense dilation therapy.” She calls them “the living dead.”\nThe therapy began some twenty years ago. Back then, scientists discovered that by controlling the biological clock of an organism, it was possible to reduce the production of free radicals and slow down aging. But the decay of the mind and its eventual death could not be reversed or halted.\nSomeone made another discovery: the aging of the mind was intimately connected with the sense of the passage of time. By manipulating certain receptors in the pineal gland, it was possible to slow down one’s sense of time, to dilate it. The body of a person receiving time sense dilation therapy remains in the normal stream of time, but his mind experiences time a hundred, a thousand times slower than the rest of us.\n“But what does this have to do with you?” I ask.\n“You know that women who live together synchronize their biological rhythms, like menstrual cycles?”\nI nod.\n“It’s the same thing with us nurses who care for these living dead, day in, day out. Once a year, I have to come to Lijiang to rehabilitate, to remove the effects time dilation has on my body.”\nI feel dizzy. Time sense dilation is used on those old men because of the need to maintain stock prices or to delay power struggles among successors. But what if the dilation is applied to a normal person? I try to imagine experiencing a hundred years within a second. But my imagination is not up to the task. To extend time to near infinity is to slow it down until it’s almost still. Then isn’t the mind under such dilation immortal? What’s the need for a body made of flesh?\n“Remember what I told you? I didn’t choose you, and you didn’t choose me,” she says, smiling almost apologetically.\nI begin to feel anxiety again, as though my fingers are wrapped around a handful of sand, leaking sand.\n“You’re the other half of me, cloven by Zeus’s thunderbolt.”\nThe words sound to me like a curse.\nShe’s leaving.\nShe tells me that her rehabilitation period is up.\nWe sit in the dark. In front of us is the imposing mass of Jade Dragon Snow Mountain, its snowy peaks reflecting the silver moonlight. Neither of us speaks.\nThe donkey-braying music loops again and again in my head.\n“Remember that alarm clock on your desk?”\nAlthough time sense dilation therapy is very expensive, the opposite procedure—time sense compression—is not. The procedure is cheap enough to be commercialized. Several large conglomerates have invested in it, and taking advantage of certain loopholes in China’s labor laws (and the complicity of the government), they’ve been conducting secret trials on Chinese employees of international companies.\nThat alarm clock is a prototype time sense compressor.\n“So we are all lab mice,” I remember mocking myself at her revelation. Even my boss is a mouse—he also has one of those clocks on his desk.\n“It doesn’t matter if you know the truth,” she says. “The theoretical basis for time sense compression does not exist.”\n“Does not exist?”\n“Theoretical physics says it’s impossible, so they had to base it on the philosophy of Henri Bergson. It’s all about intuition.”\n“What are you talking about?”\n“I don’t know.” She laughs. “Maybe it’s all nonsense.”\n“You’re telling me that my disease, this PNFD II or whatever it’s called, is the result of time sense compression?”\nShe doesn’t say anything.\nBut it makes sense. Time passes quicker in my mind than it does in the real world. Every day I’m exhausted. I’m always working overtime. I accomplish so much more in twenty-four hours than others. No wonder the company thinks I’m a model employee.\nClouds drift over and hide the moon, eliminating the reflected light on the snowy peaks. Everything grows darker like after they lower the lights in a theatre.\nA bright red laser beam lands on the snowy cliffs—5600 meters above the sea—now acting as a giant screen. The laser creates shifting patterns, telling an animated tale, the creation of the world. A myth has been bowdlerized to mass entertainment. I’m not in the mood to appreciate it. The dancing lights only make my heart beat irregularly.\nTime sense compression is wonderful for improving productivity and GDP. But there are many side effects. The mismatch between subjective time and physical time causes metabolic problems that accumulate into severe symptoms.\nThe conglomerates that invested in the technology created the rehabilitation centers in China and lobbied to change the labor laws to institutionalize the idea of “rehabilitation” so as to hide the truth.\nThey discovered that those suffering from the side effects of time sense dilation and those suffering from the side effects of time sense compression can help each other, be each other’s cure.\n“I’m the yang to your yin, is that it?” So her interest in me is limited to my value as a medical device. My middle-aged male ego is hurt.\n“Sure, if you insist on thinking about it that way.” Her tone, at least, is compassionate.\n“What about the donkey-braying music?”\n“It’s a way to harmonize our biorhythms.”\nI wait for her to stroke my ego by telling me that compared to her previous rehabilitation biorhythm partners, I’m better looking, more interesting, more special, etc. But she says nothing of the kind.\n“What about the dogs?” I’m running out of things to say before she leaves.\n“They started out as regular dogs. But because they’re exposed to so many patients with out-of-sync senses of time, the structures in their brain have changed.”\n“I have only one last wish.” I stare at her bright eyes in the darkness, like a pair of fireflies. “Come and look at the fish in the waterways with me. Maybe they’re the only creatures in this world who live real lives.”\nThe fireflies brighten. She touches my face lightly. “Actually . . . ”\nI silence her lips with my fingers. I shake my head. I’ve succeeded. There’s no need for her to tell me what she’s going to tell me, the three heaviest words in the world.\nBut she gently moves my hand away, and says three words, three different words.\n“Don’t be stupid.”\nI’m alone by the waterway, staring at the fish.\nShe’s gone, leaving behind no way to contact her. Sand pricks my palms. No matter how hard I squeeze, they slip away.\nFish, oh fish, you’re the only ones left to keep me company.\nSuddenly, I feel an intense jealousy of these fish. Their lives are so simple, so pure. There’s only one direction—against the current. They do not have to hesitate, overwhelmed by an endless array of choices. But if I really lived a life like that, maybe I’d still complain. A man is never content with what he has.\nSuddenly I want to spit at myself for my self-love, self-pity, self-obsession, self-self. But in the end I do nothing.\nI look at one single fish: it’s pushed away from its school by the current. Once, twice, thrice. It falls behind, waves its tail madly, and returns to its position.\nFuck. It’s tough.\nBut wait.\nWhy is it always this one fish? Why is its trajectory and movement always exactly the same?\nI wait, unblinking.\nTwo minutes later, that same little fish again drifts away from the school, again waves its tail madly, again returns to its position.\nI lift the stone in my hand.\nThe stone falls through the holographic fish and sinks to the bottom of the waterway.\nI have nothing left in my hand, not even a single grain of sand.\nMy rehabilitation over, I’m on my return flight with my not-so-healthy mind and not-so-happy body. The airplane hasn’t taken off yet but the cabin is already filled with snores.\nI guess some people at least have been fully rehabilitated.\nSuddenly the idea of returning to that concrete jungle to struggle against my fellow time-compressors disgusts me.\nThe plane takes off. Cities, roads, mountains, rivers—everything recedes into a small chessboard composed of parti-colored squares. In every square, time flows faster or slower. The people below throng like a nest of ants controlled by an invisible hand, divide into a few groups, are stuffed into the different squares: time flies past the laborer, the poor, the “third world”; time crawls for the rich, the idle, the “developed world”; time stays still for those in charge, the idols, the gods . . .\nSuddenly, two fat hands belonging to a child appear before me, holding the entire world in them, backs of the hands up.\n“Left or right?”\nI look to the left and then right. I’m frightened. I have no way to pick.\nMocking laughter.\nI lunge and grab both fists and force the fingers open: both are empty, both lies.\n“Sir, sir!”\nThe pretty flight attendant wakes me. Now I finally remember the origin of that dream. It was my cousin who tormented me as a child. His favorite game was to force me to guess in which hand he had hidden the candy he took away from me. He loved to tease me because I was always hesitant, always had trouble deciding.\n“Sir, would you like soda, coffee, tea or something else?”\n“ . . . you.”\nShe blushes.\nI smile at her. “I just want coffee, black.”\nThis is the only truly free choice I have left.\n\"The Fish of Lijiang\" was originally published in Chinese in Science Fiction World, May 2006.\nChen Qiufan was born in 1981, in Shantou, China. (In accordance with Chinese custom, Mr. Chen's surname is written first. He sometimes uses the English name Stanley Chan.) He is a graduate of Peking University and published his first short story in 1997 in Science Fiction World, China's largest science fiction magazine. Since 2004, he has published over thirty stories in Science Fiction World, Esquire, Chutzpah, and other magazines. His first novel, The Abyss of Vision, came out in 2006. He won Taiwan's Dragon Fantasy Award in 2006 with \"A Record of the Cave of Ning Mountain,\" a work written in Classical Chinese. In English, his short stories have been published in Clarkesworld, Lightspeed, MIT Technology Review, Slate, Pathlight and other venues. His novel, Waste Tide was published by Tor in 2019.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.", "source": "https://clarkesworldmagazine.com/chen_08_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Fish of Lijiang by Chen Qiufan, translated by Ken Liu"}