{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Marie Vibbert", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "yD6IpyIaBwcBgq1sIP6mxNbzUMY=", "id": null, "license": null, "comments": "", "raw_text": "8510 words, novelette  We Built This City  Every sunset, Julia climbs the city her mother built. It feels enormous, on the outside. Inside, it’s cramped, a human anthill. It didn’t used to be, but Julia doesn’t remember what it felt like when there was room enough for everyone.  In the locker room, Rafael’s elbow scissors into her personal space as Julia zips her coveralls. Her helmet and face shield are grimy, the padding smells of a mixture of her sweat and the false sweetness of institutional cleaner. The breather elastic is way too loose. She’s already tied knots on each side.  Rafael stays too close, his chin tucked down. “They’re talking about cuts. Big ones.”  Julia straightens. He ducks to tighten his overshoes, showing her with his posture that this is meant to be a secret.  It’s not like Rafael to gossip. He’s a good worker. A hard worker. Julia pretends to adjust her pant cuffs. “There’s nothing left to cut.” She requisitioned new gloves two years ago and is still waiting for them. Her right pointer finger slides out through taped-over repairs and the skin is permanently red.  “Angel, in the office? He says they’re cutting the salary budget in half.” Rafael’s voice gets quieter until “half” is only mouthed.  Pedro presses his face between them. “Passing notes? I’ll be at the top before you’re done.”  Rafael turns to taunt Pedro, and that’s the end of the strange conversation. People are filing out of the room. The day has begun.  The catwalk rattles with feet as Julia jogs. The calls of “ready” start coming in on her radio before Julia has gotten to her section and clipped her belt to the safety line. It’s a brave job, and they treat it as such. Every sunset they race to the top, for the privilege of turning the knob that starts the water flow and alerts the system washing is taking place. Julia has never been first, but she has been second.  She has never truly given her all. She has felt like she has, but there’s a difference, between feeling it and doing it. She could, if she dug deep, run up the wall like her life depended on it. She could be first.  The sixteenth “ready” comes, and she leaps the first step, skittering mad and hard past the vertical. The city dome curves comfortingly under her gripping soles, and she sees the sun sinking in the west, painting oil slicks on the glass, the marks that never wash out, the bleeding minerals of the grilles.  This is her favorite part of the job, the beauty and solitude, the clouds rolling underneath the city, the sun melting into the soft horizon like a pat of butter in potatoes.  Her mother climbed cliffs on Earth with Julia’s abuela. Her stories are peppered with references to anchor points and cracks and other things Julia doesn’t know how to fit into her own experience of climbing. Once upon a time, her mother was here, lifting the beams supporting her into place. That is easier to imagine. The dome a fragile, empty thing, alone in the feral clouds of Venus, no city inside yet.  Julia can feel herself slowing near the top, arms and thighs getting lazy, pulling at her to slow down. She forces a second wind. The hard part is almost done.  Rafael is at the top already. She gives up, checks the hose and nozzle at her hip, turns the squeegee so it’s at the angle she likes to grab it. She gets through the last few feet. The rest of the crew is coming into view. Rafael gets to turn the knob. Again. He does it like a stage magician revealing a dove.  The top of the dome is a sixteen-pointed star of time-painted titanium, and they, alone, get to enjoy it up close, to be out here with room to stretch. So they do, as they prepare to descend.  Pedro huffs. “I’m tired already.”  He’s just mad not to have made it to the top first. “If you want to quit, I’ll take your pay.” Julia tries not to sound out of breath. Pedro flips her off. No one’s going to quit and lose their housing allotment.  She plays out a few feet of hose and hops back lightly. She hears Rafael teasing Pedro as she sprays a thin stream of soapy water along the rails that separate her section from the others. She’s proud of her skill at this. She has the best water conservation scores.  She imagines the wash soothes the tired city. Acids eat every weak spot and lingers in unexpected salts. Without their careful maintenance, the dome could leak, and leaking meant sinking into the hellish pressure below. The air they breathe is also the lifting gas that holds the city aloft in Venus’ denser atmosphere. Their parents’ generation built a city to float in the clouds. Her generation keeps it flying.  She spots a nick and easily switches hands, holstering her water sprayer and pulling out the repair gel. Squirt, squeegee, and the white silica gel rapidly sinks into transparency as she switches hands again.  Hop back, spray, swipe clean. She gets into the rhythm, working left to right, then right to left as her section widens. She and Rafael meet at their boundary, and he looks over at her. “Have you thought about it? About what you’ll do?”  Julia scowls. There’s no time in her rhythm to respond, and she feels put upon that he throws troubles into her mind as she plays her rope out and drops out, down, left to start the next pass. There’s Rafael coming toward her again. She has three hops and as many seconds to form a response. “So?” is all she comes up with.  “We need to stand together,” he says. “All or none.” And he’s gone.  He thinks they’ll be laid off? The city needs them. They never got a robot washer to work. Even if they did, there’s no room in the city to store a washing robot, and to leave it out in the atmosphere is to ask for it to be slowly destroyed.  But he’s serious.  What if they cut the staff? No. That would be too cruel with the housing rules. But they might. Would they move to washing every other sunset? Or will they each wash two sections? Her thighs burn as she hops. Her mother will hate that. Too much time in menial work, no time to improve herself.  “Why did you settle for this job where they can ask you to do this?” her mother will say.  The next time their paths touch, Julia and Rafael meet without words. It takes six hours to wash the dome now. Could she do this for twelve hours straight?  Her mother tells a story about climbing a limestone spire in El Potrero Chico, something like six hundred meters, with no guide rope. She never says how long it took, but that she lagged behind Abuela by hours.  Abuela exists in her mother’s stories like a cartoon character or saint Julia doesn’t quite believe in. Is this mythic grandmother meant to reflect on their relationship? Is there a moral behind the story she is expected to decipher? Did daughters always end up not quite as strong as their mothers?  Julia’s left knee twinges when she plants to begin her next pass. An old injury, telling the tale of years on the job. Her mother wanted her to work with her brain. “I busted my ass so you don’t have to bust yours.” But it isn’t any easier, busting her brain. The hardest problem in school isn’t a differential equation or history fact, it’s finding a job you’ll love to do that wants you.  Rafael is hidden by the curve of the dome most of the time now. These longer passes are grueling. Her shoulders strain without the break of dropping to the next level. It’s lonelier. The race and thrill are over. But this is her work, and she is good at it, and she wants to keep doing it.  She side-hops over an apartment block. It’s fascinating how people take the same room and make it their own. A toddler looks out at her, mouth open, pounding a doll’s head with a plastic cube.  When she reaches Rafael again, she says, “All or none. Of course.”  He gives her a sad look. “You promise? If they lay off, we all walk?”  She nods curtly. It’s a drop and another long pass. The apartment below has curtains drawn. A waxy white fabric, edges of burgundy that must be the color on the inside. A spiderwort pokes its tendrils under and around. Her mother is a terrible gardener but keeps trying. They have a duty to grow green things. Every apartment a vegetable garden.  She only thinks of her mother in motion. Repotting, watering, tearing up failures. Or pointing up at some girder or crossbeam to lecture about bracing and counterbalancing. “Physics. That’s everything, mija. Study your physics and be a scientist and support me in my old age, eh?”  Would her mother understand if she walked off the job? Julia doesn’t know, but she feels strong, excited at the idea of doing something radical.  At the bottom of the window, Julia sets her feet on the lip of the city and walks across. Her section is a fifteen-minute walk at the bottom, when it was a single bound side-to-side at top. Her last pass is done crouching and is the slowest pass of all. A trough under the catwalk catches the soapy water, funnels it down to be filtered and processed. She’ll follow the pipes down, under the floor of the city. There, the rest of the work shift will be cleaning and stowing the equipment. She tugs her hose to start it retracting.  The weariness in her thighs and shoulders feels like a job well done. She walks clockwise back to the airlock. Rafael’s steps echo behind her. She wants to look back, now that they are coconspirators, but doesn’t. She wants the dreary part of the night done, the indoor’s grime and machines. She’ll get a beer before heading home. It’s a gorgeous evening, no higher clouds. The central square will be flooded with starlight as second Sun Day ends and first Dark Day begins, the city speeding far above the lagging ground in the atmospheric current. Forever the same.  It’s possible Rafael is wrong. Maybe nothing will happen.  Angel, the office manager, is waiting in the locker room. That’s not normal. He fidgets like he has to go to the bathroom while they take off their outdoor suits and hang their face shields. Rafael gives her a look that says, “I told you so.”  Julia wishes she’d worn a better shirt today. This one has a stain on the sleeve where she set her elbow in spilled coffee. The face shields get rinsed in the sink and hung to dry. The suits go into a laundry hamper. The shoes rest in a tray full of acid-neutralizing chalk. She changes her socks. Many of the others don’t, but she can’t imagine going through the rest of her day in damp socks. Everyone is finished. Julia sucks the acid burn on the side of her pointer finger. One of the women starts brushing her hair. They should be going into the machine room now, but Angel is in the way.  He clears his throat. “The boss gave me the job of telling you guys. They’re letting most of you go. We’re keeping Rodriguez, Hammerstein, Corredor, and Lopez. I’m sorry.”  Julia is Lopez. She feels a relief that squashes into instant horror and guilt. No one is talking, no one is moving. Rafael (Rodriguez) steps forward, shoulders wide. Is this it? Is he going to do something? Julia fears confrontations. She wants to hide. But she’ll stand with him. She said she would.  Rafael asks, “How are four people expected to clean the whole dome?”  Angel’s response sounds prepared. “You’ll work four shifts, do it in sections. If we really stay on top of it, admin thinks it’ll be enough. They’re downsizing the office staff, too. Hector and Alverez from maintenance are going to do all the interior work. All you have to worry about are the windows.”  “Fucking thanks.” Marta Hammerstein throws a towel into her locker.  Pedro looks at Julia with hate in his eyes, and she realizes she isn’t going to get a beer tonight, after all.  Rafael doesn’t do anything. His face is trembling like he might cry or shout, but he doesn’t say anything.  What’s worse, neither does Julia.  Angel twists, half a shrug, half an aborted apology, and leaves.  Four shifts. Her mother will hardly see her. The argument between them is fully in her mind, as though it has already happened. She chose to be a dumb beast, not a knowledge worker. She can’t afford to stand up for herself, when her mother . . . her mother built the city.  Normally, she would work a twelve-hour shift, with the interior work after the washing. They worked long on First Dark Day, got Second Dark Day off, and did an inspection pass on First Sun Day, making small repairs, and got Second Sun Day off. It was a good schedule, a familiar rhythm. The document Angel sent to her drew out a complicated schedule that creeped forward and wrapped around the week, rather than working with it. Did they no longer care about the increased evaporation during Sun Days?  Julia walks half-blind, reading the schedule, dragging it over her old schedule, trying to make sense of it. No matter how slow she walks, she’ll be home early. Behind her, Pedro is inconsolable, moaning and crying while another worker, RiRi, who has a strident voice, attempts to soothe him by pouring gasoline on his flame. “You know it’s the corps. They’re paying cash on the head for anyone we deport. You know why, don’t you? Because their own workers are dying like flies. Like flies!”  She’s almost home.  Julia lives in a frame stack building, aluminum beams white with age holding corrugated plastic in faded fruit juice colors. It sits wedged between newer buildings built on what had been streets, walkways relegated to tunnels underneath them, and even those are lined with sleeping bags. Their proud city resembles nothing so much as a warren of stacked plastic crates and abandoned campsites.  “They can’t,” Pedro moans. “They’re not gonna . . . there’s time, right? They gotta give people time.”  “Time is an illusion.” RiRi’s getting louder. “They make you think you have time, but who’s hiring, eh? Who’s hiring?!”  A figure wrapped in a blanket rolls over, tightens the fabric around its head, and Julia flushes with embarrassment. How ungrateful they must sound, clean and well-fed, on their way to homes.  This isn’t the utopia the Mexican government imagined, but they didn’t know there would be refugees from the corporate factory-aerostats. Couldn’t have dreamed such places would exist, so awful their workers were willing to risk the crushing depths to hop on a homemade glider or balloon and make it to the free air of New Tenochtitlan.  A door bangs open, a man shouts, private tragedy spilling into the street like food waste. Julia assumes it has nothing to do with her and studiously avoids looking until the man in the too-loose shirt is charging her way, and past her, and slapping Pedro.  “Pops! Ow!”  “You lost your job? You LOST YOUR JOB?”  Julia lowers her head and hurries, pretending that she doesn’t hear every word.  “What are we supposed to do? Eh? What is your mother going to do when you get stolen away?!”  She pretends she isn’t relieved by the contrast to her imagined argument with her mother. She hasn’t lost her job. She will, at first, simply not mention the layoffs.  Julia’s mother’s apartment is small, smaller than the ones under Julia’s section of dome. What had been “her” section. She supposes she’ll now do a full quarter of the city. She’s exhausted thinking about it. Like her first week on the job, when every night her body was spent and every morning her muscles felt like poorly set concrete.  Her mother bursts into the room the second she arrives, a tiny tornado with a gray buzz cut. “Are you okay? Did anyone get violent?”  Julia lets her mother drag her to the sofa and fuss over her. “You found out?”  “Eduardo. His daughter works in administration, and her wife is the facility manager’s cousin. She says it’s coming from the top. RyelCorp offered to pay for deportations in one big swoop, so the city wants all the unemployed people they can get at once.”  “Ma, that’s a conspiracy theory.”  She shrugs. “I’m a lazy retired lady now, we do nothing but gossip.”  Around the room, her mother’s plants, quilts, and exercise equipment tell a different story. When will the concern fade and the recriminations start? “I guess I’ll see how it works next sundown. The revised schedule.”  Her mother freezes. “You didn’t quit?”  She feels she has failed an important test. She also feels the threat of deportation to RyelCorp’s factory bubbles. “Whatever the city needs, right?”  Her mother shifts on the sofa to face her directly, hands on her shoulders. “You listen to me, mija. Yes, those are words I’ve said, and I mean them most of the time, but not now.” Julia’s heart swells with love. “A city without people is only a ruin.” Yes, that’s it, exactly. But then her mother gives her a little shake and breaks her heart. “This is your chance. To leave that drudgery behind and get a real job.”  Julia is on her feet so fast her mother’s hands fly up as if in surrender. There’s only the one bedroom. Julia sleeps on the sofa. She goes to the bathroom. At least it has a door.  The flimsy printed door doesn’t muffle her mother’s voice. “I shouldn’t have said ‘real.’ I meant ‘better.’ When God closes a door, he opens a window.”  Julia sits on the toilet and wishes there was a window she could escape through.  There are only four window washers now, and the city will not survive without their labor. It should be easy to band together, to refuse.  They have a group chat.  Marta: I’m pissed, too, but I can’t afford to lose this job.  Corredor: TO ANY EXECUTIVE READING - I AM NOT A PART OF THIS DISCUSSION  Marta: Luis has a point. We’ll get fired if they see this thread.  Rafael: But if we band together, they’d have to fire all of us.  Marta: You think they fucking won’t?  That killed the thread. There was nothing after it but Rafael repeating some variation of the same thought:  Rafael: Come on, guys. I can’t do anything on my own.  It’s hot in the square, already halfway into the forty-eight-hour day. First Sun Day evening, or noon, as the sky tells it. The sun winks through the windowpanes, the heavy plants perspire. It smells both human and jungle. Here, the packing crate apartment buildings are a backdrop behind monuments and trees. The administration offices are built like a stepped pyramid, with lush foliage on every step.  Julia’s mother is dragging her forward with a sweaty hand clamped manacle-tight on her wrist. Like she’s a child again.  Julia looks yearningly toward the Cloud Bar’s blue curlicue entrance. “Ma, this isn’t going to do anything. You aren’t important anymore.”  “I should wash your mouth. I built this city. Now you’ll see. It’s not what you know all the time, sometimes it’s who you know.” She marches up to the reception desk at City Hall and knocks on it. “Hello, young man. We need to talk to Valeria, right away. Tell her it’s Hortensia Lopez.”  The man at the reception desk looks past them like they aren’t there. Julia should have put on better clothes. She should have insisted her mother change. Their coveralls are like camouflage. They may as well be potted plants.  Hortensia continues speaking anyway. “The city is making a dangerous mistake. I won’t have our maintenance workers mistreated this way. They keep us safe. When I—”  A woman in light, flowing shorts favored by the fashionable walks in, and the receptionist’s attention immediately centers on her. Julia watches her mother’s frown deepen as the man leans around her like she’s an inconvenient post.  Hortensia says, “Did your mother not teach you respect? I’m here to see the mayor. It’s Hortensia Lopez. She’ll know me.”  The receptionist draws back. “Do you have an appointment?” he asks, clearly assuming not. Assuming correctly, which is worse. “I can’t even call her if you don’t have an appointment. Try the public comments box.”  Julia tries to get her mother to leave, but Hortensia has seen someone she knows and is marching across the foyer. “Darrin! Darrin Ruiz do not turn away from me, you know who I am!”  Her mother chases this man to a side entrance, where he turns at last and stares coldly. “Do you have a reason to be here?”  “Yes! My daughter, Julia, she has—”  “You don’t belong here. Please leave.” He walks away.  Hortensia blinks like she can’t see. Julia wraps her arms around her bicep and urges her toward the exit.  “I held him at his first birthday party,” Hortensia says.  As the sun sets, Julia prepares for work. She’s gotten notice of the length of her shift, sixteen hours. Enough time to do three sections with three twenty-minute breaks between. Sixteen hours of washing. She packs muscle balm and an extra bottle of electrolyte-bearing water.  Her mother cracks the bedroom door, disarranged for sleep. “Mija what are you doing up so late?”  “I have to get to work. Double shift.” She feels like a shady politician, prettying up the truth.  Hortensia’s face falls in disappointment.  Julia keeps her eyes on packing her lunch box.  Her mother tries to grab her hand. She tries to evade her, but then Hortensia takes both hands, hers moist and warm from bed, like bread loaves ready to bake. “Don’t go. They’ll give you two weeks, it’s plenty of time.”  Julia doesn’t want to go to work. She wants to be strong enough to say no. She wants to not feel this weight of expectation, the thousands of mornings of going to school, of going to practice, of going to work.  She flees the weight, and her mother’s big, heavy hands. She goes to work.  Angel is in the locker room. It doesn’t feel too small this morning. Marta is shaking her shoes out over the lime dust. Rafael doesn’t look up from sealing his coveralls. Luis dresses like he’s alone in the room.  Angel watches the four of them like they might bolt at any moment. “You made the right decision,” he says to her.  Julia wonders when she made the decision. She goes to her locker. Someone has put gloves on top of hers, some other worker’s less-worn pair. Pedro’s? It feels wrong to be so close to Rafael when now there are many empty lockers. She starts to move her spare socks to the next locker over, and stops, seeing the name still there.  She turns to Rafael, waits for him to look at her. He doesn’t. “Are we really doing this?” she asks him.  “Aren’t we?” He sounds defeated.  She doesn’t want to be on the side of defeat. She doesn’t want to be on the side of Angel’s untrusting smile. She feels, suddenly, disgusted at all of them.  She picks up her spare socks and snatches the photo of her ex-boyfriend and the picture from the New Year’s Party. That’s all that’s hers in the locker. She turns and walks out.  The shaking starts before she passes Angel. Her anger cools to fear. Will they let her keep walking? She could be going to get something she forgot. Now she’s at the exit. Now she’s in the corridor. She realizes she’s crumpled her photos.  “Lopez!” Angel reaches for her arm. She whirls on him, and he backs off, both hands in the air. Did she do that? With a look? “We picked you because you were the four best. Doesn’t that mean anything? We picked you.”  No one else has followed her out of the locker room. Not Rafael, not Marta. She feels defeat like a thing just under her stomach, waiting to rise. But Angel called her by her last name. The name that saved the city.  He says, “They’ll just hire back one of the others, someone worse. The city will suffer.”  Julia raises her chin. “That’s their mistake to make.”  She hates that she is doing what her mother wanted. When she gets home, her mother rises from the kitchen table, beaming joyful relief. Julia wants to scream, or argue, or explain, but instead she shakes and cries in her mother’s arms. Hortensia rubs circles into her back. “No. It’s good. You couldn’t know your strength until it was tested.”  Julia spends First Dark Day checking messages. The company gives her a second chance, twenty-four hours to return. She can use a sick day. They don’t say who worked her shift, or if the dome went one-quarter unwashed.  Rafael wants to know if she hates him.  She doesn’t, but she hates him asking.  At least he has finally done one thing: he has added all the laid off workers to the group chat.  Rafael: They’re going to ask one of you to take Julia’s place. Don’t do it. Not unless they agree to hire more back.  Pedro: You’re still working, right? Did you demand they hire us back?  Rafael doesn’t answer. Julia wonders if she has been silent too long. She had something she could have said, once.  Hortensia cooks her best, most comforting dish, the cheese potato mash, and they finish off the red wine. It’s almost a party, except for her mother going over the budget and writing out timelines they can live on. “There, you see? The charges for not having an employment voucher aren’t so much. There is air, and water, and sewage. We can cover you two months.”  “They deport after two weeks.”  “I’m sure that’s not really true. And I bet it doesn’t take so long, now you’re really looking. If you must, you’ll find something temporary before two weeks are up.”  Julia hasn’t found any open positions she can apply to. She hadn’t found anything in all the years she tried to meet her mother’s expectations, and those years felt full of opportunity, the city uncrowded.  Her mother isn’t worried, with her pension guaranteeing her residence until death. Julia tries not to resent that.  When Hortensia catches Julia going over the figures, she closes the screen. “But that’s tomorrow and tomorrow, darling. Don’t worry. I am the mother. I will tell you when to worry.”  Sleeping in doesn’t feel as good the second time. It’s Sun Day and the light is strong, seeping through the cracks in the walls. Julia dresses in her best clothes and goes for a walk.  Her feet take her to work. They don’t know any other walk.  She slows as the “employees only” sign comes into sight. She wonders who replaced her. How it felt, washing four sections instead of one. If the city will survive, or if the tired metal is even now being irrevocably eaten away.  A policeman stands at the door. Julia is several feet back, so she’s surprised when he approaches. “You can’t be here.”  “I was just—”  “Leave or you’ll be arrested.”  Julia stares at him. “Arrested for what? This is a public corridor.”  Which is how she gets arrested.  The jail is crowded. Each cell, designed to hold one person, holds five. One of the persons in her cell has peed on himself. The others huddle away from him, near the front. Their sweat and breath mingle in a moist fug.  She wishes she had her com so she could check the news. She wishes she’d done something more meaningful to get arrested than stand there.  The door to the corridor opens and a few people start shouting. When’s my court date? Where’s dinner? But the guard ignores them, leading her mother, who looks like she is claiming a prize at the end of this stinking corridor.  Julia is genuinely stunned her mother is getting her out. As she leaves the cell, she whispers, “Was it the mayor? Did you—?”  Her mother pins her a furious glance for one heartbeat.  She doesn’t explain the bail until they are in their own apartment. Their savings, halved. The resources to find a new job shortened. “But it’s fine. A mother provides. You’ll find something.”  They orbit each other in the cramped apartment like two positively charged magnets. They have three months of rent. Two months, if they want to eat.  Julia receives two messages. One from the city, stating that she has two weeks to find employment, or prove she is in a training program for employment, or she will be deported. She doesn’t forward it to her mother, doesn’t say “I told you so.” The other message is from Angel, asking her to please come back, they will look the other way, just this once.  The group chat hasn’t gotten any better.  Marta: They hired some untrained cloud-hopper. I blame you, Lopez! I’d take any of you fuckers over him. Smith’s section may as well not get done. Found two cavities today, and it’s only going to get worse.  Julia closes the feed. “I have an interview,” she says, and keeps her head turned away from the way her mother brightens. She shouldn’t have said it. She doesn’t need an excuse to go outside.  The woman who has been sleeping on the edge of the walkway all week is gone, with her blanket and her bag of belongings. Julia wonders about tragedies that touch her life and don’t. She’ll never know where the woman came from, where she went.  Head down, she walks to the bar. It’s been a long time since the after-work beer she never got, and she wants it. Deserves it.  Cloud Bar is beautiful. The floor is glass, and the ceiling, too, though nearby buildings block most of that view. The ceiling supports are covered in cotton fluff and sheer curtains to make it feel like you are in the sky. She has always loved this place. The prices are cheap before happy hour. She gets her favorite beer and finds a seat near the wall. Through the floor she can see the under-city and the RyelCorp High Pressure Lab, dangling like a rudder into the clouds. It was supposed to bring great, wonderful things to the city. It brought chemical engineers who got all the best housing, didn’t pay taxes, and probably voted for the citizenship-by-employment mandate.  She imagines she can kick it off the city with her foot.  If she can’t find another job in two weeks, she’ll have to take Angel’s offer. It feels like giving too much up, like admitting the administration can do this.  She sees Rafael arrive. Sees him see her and freeze. He looks to the exit. He sags. He comes to her, standing awkwardly like a new waiter. “I saw you got arrested.”  “For walking on the sidewalk.” She means it as half a joke; it comes out hard. Rafael looks like she kicked him in the gut. She shakes her head, loosening her hair and her tone. “The funny thing is, I wasn’t even trying to picket or anything. I’d just come back to look at the place.”  “Assholes!” He hovers. “Can I? I mean . . . ”  “Sit. Don’t explain or excuse, though. None of that.”  He doesn’t understand how much she means it because as he settles into the seat next to her, he explains himself. “I got scared. More scared than I thought I could get. I was ready to do it. Walk right out of there. I pictured every step, but then this thought popped into my head: what about my son? What about all the things he needs? You’re single. You don’t know what the burden feels like.”  Julia considers dumping her beer on his head, but she doesn’t think she can afford another. “What about when your son gets a job? What about when he’s asked to work sixteen hours in the acid rain?”  “I didn’t say I was right. I said I was scared.” He waves for the bartender, who ignores him. “Anyway, I’m not going back.” He pauses. She doesn’t give him the reaction he’s clearly pressing for. He slumps. “It was killing me, my hands, my legs. And yesterday, Marta slipped. Not a little slip, I mean she was hanging from her safety line, unable to get her feet under her until me and José got to her. And my legs were shaking so I almost couldn’t help. It terrified me. What if we all had slipped? No paycheck is worth dying for.” He holds up two fingers and exchanges nods with a waiter. He looks back at Julia. “You don’t believe me? You think I’m too strong to collapse? Girl, I only ever beat you by a step, you realize that?”  “No, I believe you.” She avoids looking at him. “About being tired.” Had she gotten the offer to return only because Rafael quit? “You’re one of the good ones,” the message said, “You care about the city.” It implies there are “bad ones.”  Rafael fidgets. “I mean it about not going back. I threw all my gear in a bundle off the platform! I made sure I couldn’t chicken out again. Ah, bless it.” This he says to the beer approaching their table. “It’ll be my last foolish act. They’ve outlawed striking. I only got out by saying I wasn’t doing that, I was quitting. So that’s it.” He looks into his beer as though seeing the end of something. “I checked with RyelCorp, they aren’t hiring. I thought maybe your mother has some connections with the building crews? I’ll do anything.”  Julia imagines the sunrise on top of the dome, who will see it. She drains her beer. It hits her hard. Not enough to eat, lately. She doesn’t want to feel guilty. She stares past Rafael, at the community news report. The high school baseball finals. Kids smiling against the projected green field, swinging real bats at holographic balls and running on treadmills. It’s hard to see it the way the kids will.  “They got Pedro,” Rafael says and cringes like he wants to take it back. He lowers his voice. “I mean, he’s gone. There was a shipment to the corp domes yesterday. His folks aren’t talking.”  The news report flashes red. Emergency. “Low Pressure Detected in Section 4.” The steady buzz of talk and motion around the room freezes into one tense silence, all eyes fixed to the man who appears on the screen. “There is no cause for panic. A leak has been detected, but balloons are being deployed. Citizens are recommended to seal their rooms if they can be sealed. This is only a precaution.”  Some people leave. Some go back to their drinks. The general buzz of conversation shifts, becomes serious. Julia wants to spit acid, call out the greed that so predictably led here. What would she say, though, who would listen?  The news shifts to a shot of the cleaning crew—her cleaning crew, leaving work. It must have been shot weeks ago. “The blame for the dome leak is being laid on workers who walked off the job in a bid for shorter working hours.”  Julia feels a pulse of anger so visceral it’s like a fireball expanding from her chest. Someone shoots her a dirty look. A familiar face. A regular. Does he recognize her from that split second of video?  Julia stands up. “You want something to do? Come on, let’s go.”  Rafael’s face is slack with shock, but he obligingly stands. “Where are we going?”  “To get arrested.”  There are three police officers at the turn for the maintenance employee entrance. As Julia and Rafael approach, they straighten from lounging against walls, set their feet wide. A violent intention thrums through their posture.  “This is where we walk on the sidewalk?” Rafael whispers, his voice wavering.  Julia strides forward. “We’re here to fix the leak.” It comes out more confident than she thought she could sound. A clarion call, a command. One of the cops steps back.  Only one.  She turns to Rafael. “Come on.” He nods, solemn.  They make it even with the police, not half a step further, and hard hands are on her biceps. She and Rafael are pushed back. One officer, a woman, says, “Get out of here. Try that again, and we’ll have to take you in.”  Julia almost laughs. “Why not take me in now?”  The cops look at each other. Julia has a guess. That jail was pretty full before. Has someone said not to bring more people in? She hooks Rafael’s arm and leads him away.  Julia makes her first post to the group chat.  Julia: Who’s up for storming the locker room?  Rafael: Julia wants to break in, help fix the dome. It’ll show the city we’re the right side. There are only three guards, and they’re not very threatening. Just kinda scowled at us.  No one posts “yes,” though there are a number of icon responses. Eyeballs. A fist. Rafael posts a date and time. Julia has no idea what to expect when it arrives.  On the corner with the noodle place, they meet RiRi and Rafael’s former roommate and a friend of a friend who used to date Pedro. The roommate had worked on windows once, in high school, but the ex is just there for moral support and muscle. Julia feels like she has misjudged each of these people by not recognizing their compassion before now. She wants to cry, and to hug them. Instead, she just nods.  They form two rows, two and three, and they march right past the guards. The police grab her, again, but Julia punches her fist into the air, pushing the hold up her arm. She presses forward, through hands and a tripping leg, and the door is in front of her.  Someone grabs her hair, then, and yanks her off her feet.  It’s a mess. A tangle of limbs and shouting. It feels more like children wrestling than something adult. There’s a sharp smell of ozone, and Rafael cries out.  It ends quickly after the taser.  Julia gets a fat lip and zip ties on her wrists. The five of them are sat down in a row, Rafael shaking his head and blinking like he can dispel the memory of electricity.  One cop paces back and forth in front of them, his fists tightening and releasing as if he doesn’t know what to do with the energy. The other two confer, anxious whispers that get loud enough to hear. “So call.” “I’m not going to—” “Look.”  Two more police officers arrive. One has the golden eagle of a commander. She stops three feet away and holds up a hand. “I am very disappointed in you,” she says to Julia and her companions. “We’re in a dangerous situation and the city needs you to be calm, to not make matters worse.”  RiRi snaps, “We were trying to—” and is kicked by the officer who had been pacing.  “Now,” the commander says, a gentle admonishment, as if this were a child drawing on the walls. “None of that. We need to be civilized.” She hooks her thumbs on her belt. “The jail’s a bit crowded at present, so I’m going to let you off with probation. Don’t mistake this for nothing. You’re out of warnings. If you so much as spit on a walkway, your asses are going straight to deportation holding. Is that clear?”  Are they supposed to answer? Agree to this? Pedro’s ex murmurs “Yes, ma’am,” and the others follow. The woman stares at Julia until she ducks her head and says, “Yes, ma’am,” too.  They reconvene on the High Path, a narrow public walkway that loops through the upper levels of the city, connecting to buildings and support struts, with a few benches and baskets of plants attached to its sides. None of them have the money to waste on beer or even hot noodles. Julia feels like she’s in a trap and only waiting for it to snap shut. There’s still a red line on her wrist from the zip tie.  RiRi sighs and sticks their legs over the edge to dangle. “I think it’s that prisoners can’t be deported before trial. That’s why they don’t want to arrest us. This is actually worse, this one-offense warning.”  Rafael is unfairly happy, pacing back and forth, making the walk bounce with his steps. “No. This was a step. A stride. They backed down. We have them. Five people is too many for them to arrest. Imagine what we can do with this!”  “Get beat up again?” Pedro’s ex asks.  They can see so much from up here. Part of a mural that might be a child throwing a baseball or just reaching for a glowing, floating one. The odd, organic blue plastic of the university annex peeking around the traditional, square shapes of other buildings. Graffiti. There’s a man leaning on a railing below them, gesturing now and again as he talks to someone remotely. His forearms are like drumsticks. A woman waters a sweet pea vine in a window to the right of him.  Walkways and stairways and floors, all built one atop another, atop empty air. Julia imagines it falling, emptying, ending. She imagines what it was like when her mother first saw it, when there was just an aerostat and a gantry and a fabber spinning out material from clouds.  The others haven’t stopped arguing. “Well, what are we supposed to do, then?” Rafael demands. “Nothing?”  Julia can see through crossed walkways and power lines to workers brushing a mylar sheet against the interior of the dome. An ugly, temporary fix. It brings the anger back.  Two men are jogging on the walkway. Rafael and Pedro’s ex have to squeeze to the side to let them pass. As they do, one of the joggers mutters, “Lazy bums.”  The other is louder. “If you don’t love the city, leave it.”  The first whispers something to him, and they both turn back, scowling, and it’s not the casual hatred of the rich for the poor, it’s specific. They know who they are looking at, and they want very much to push the lot of them off the walkway.  Julia gets up and goes toward the nearest stairs down.  She didn’t expect Rafael and RiRi to come with. They followed her down and pestered until the direction she walked made it pointless to hide her destination. “I’m going to talk to Angel.” She showed them the message, that she could still have her job back.  “Are you, though?”  Julia shrugs. “It’ll get me in to talk to him.”  Angel holds the door frame as if to prevent them from entering the administrative office. “Are you ALL expecting me to give your jobs back?” He looks pointedly at Rafael.  “We just want to talk,” Julia says.  Angel starts to close the door. Julia pushes her arm into the gap. “You know the dome needs regular maintenance. You know it’s more work than four people can do.”  “It’s not my decision.”  “Then let us talk to whoever’s it is.”  Angel shakes his head. “I need to keep my job.”  His exhausted expression isn’t different from Marta’s when she said the same thing. “Do you? Why? Who decided we had to bow to jobs? What about my mother? What’s her job?”  “She served the city.”  “So did I.”  Angel presses his hands together. “Please. Just take the job back. They’re already threatening to ship you off for leaving.”  Julia has nothing to threaten other than violence, and she doesn’t want that. Angel is awful, but he is also a person. “Let us cut through the office.”  He frowns. “What? No. I just said. I need this job!”  Julia puts her hand on Angel’s chest and pushes. She increases force until it’s enough and he stumbles back. She pushes him all the way to his desk, and his arms pinwheel until they clasp the front edge. “So we forced our way in,” she says, and leaves him there, walking to the inner door, the one that leads from administration to operations, and from there, to the locker room.  She still doesn’t expect Rafael and RiRi to follow, but they do.  She doesn’t go deeper into operations looking for the boss. She doesn’t think it would help. There’s an endless line above Angel, of people just doing their jobs, pointing up until you got to the top, and the top person points down at the bottom, saying, “I need to keep their support.”  The locker room is a tumbled mess. Anti-acid powder footprints track everywhere. Julia finds a clean pair of grip-soles and puts them on over her regular shoes. If she’s doing this, she might as well be comfortable.  RiRi hangs by the door, uncertain, but Rafael starts gearing up, taking gloves from this locker, a face shield from that. RiRi shakes their head. “So, you’re . . . breaking in here, just to work?”  “Someone has to do this.” Julia hasn’t thought too much beyond that. She’s angry and tired of being blamed for not doing a job she wants to do.  Rafael settles the shoulder straps of a safety harness and grins. “It’s perfect. We save the city, we show them what side they should support.”  Not much Rafael has said has ever turned out true, but Julia wants to take comfort in his optimism. She starts to put on a face shield, finds it stinks of garlic and sickness, and puts it back, picking up another.  That’s when the door bursts open. She doesn’t hear what they shout, something like “get down” or “hands up”—it’s a percussion note, like the boots, the batons hitting the lockers. The police fan in quickly, one left, one right, one left.  RiRi stumbles, pushed down by them. They look up, disbelief in their eyes, their arms cradling their head, and then RiRi is diving toward the police, rolling on the floor into their legs.  Rafael has already gone out the airlock. Julia hates that she doesn’t hesitate longer.  Rafael slams the door behind them and twists the handle off. Julia doesn’t think that will actually do anything, but there’s no time to argue about it. She grabs her rope and starts climbing.  It’s full Sun Day, not the right time for doing this, and the heat is unexpected, strange. The texture of her feet on the glass feels stickier.  Whatever’s happening behind her, she is soon absorbed in the task of climbing. She’s already out of shape, gasping more than usual. Or maybe it’s the heat.  She skitters to the top to see Rafael a few paces behind her. Sees him see her and slow down, checking his squeegee on his hip. When they both reach the top, he bows to her, gesturing.  “Dork,” she says, but she twists the knob. It doesn’t feel how she’d imagined.  With gestures, they split the dome in two. They go slowly, no time limit, checking for damage. It doesn’t take long to find the first crack. Julia smooths it and wonders if someone will climb up behind her, yank her off the city. There are emergency service balloons and helicopters. Her back prickles and not all the sweat is from the sun.  Two passes, and it’s already feeling longer than doing the base of her old section. Her radio crackles. She forgot it was built into the helmet, that she was wearing it.  “Rafael Rodriguez. Julia Lopez. By order of the chief of police, you will not be permitted to reenter the city.”  Julia stops where she is, the too-loud, hard voice echoing in her mind. She keeps expecting them to say more. She hears the rhythmic jingling of Rafael’s harness as he hops to her. He’s breathing heavy. “They’re locking us out.”  Julia readjusts her grip on the safety line. She looks at her feet. They’re still on the flattish top of the dome, the view beneath her is a rooftop with skylights and vents. Will the acid rain melt their clothes first? No, she’s being silly. They’ll die of thirst long before anything else gets them.  Julia sees what might be a crack to her right. “See you on the other side,” she says and goes to it.  Rafael is still and quiet a long time before he resumes washing.  Two more passes. They get another warning not to go near the airlocks. Rafael finds a discolored patch. “I don’t know if anyone is listening on this channel. But it’s grid 4-C-10. Someone should make a note and come back here.”  Julia is exhausted. She finds Rafael has stopped, sitting, his knees up, on the curve of the glass. “We’re not getting through this in four hours, chica. Take a load off.”  So she copies his posture and looks out on the cloud sea. The tantalizing deep valleys that look like they hold secrets. The soft curving slopes she imagined sledding down as a child. “We’re going to die here.”  Rafael snorts like it’s a joke. “And I’m already almost out of repair gel.”  When their legs are rested, they resume their work. There doesn’t seem to be anything else to do.  On the next pass, they are even with some apartments, and people have gathered to watch for them. A man with a baby waves. Julia waves back.  The next floor down, there are more people. They don’t look angry at them. They look excited. It gives Julia strength. She works harder.  Then she sees her mother.  It’s a rooftop park. A nicer neighborhood than theirs. She went there once with a school club, to do some plant-identification assignment. Julia can’t see the little cards on the beds now because the rooftop is crowded with people holding signs.  “Maintenance is life,” reads a large one. Another says, “Justice for workers.”  She is startled by two girls waving at her, shaking a banner. “I stand with Lopez.”  Her mother’s sign is one of the nicest, of course, with clean, elegant letters. “My daughter has the most important job in the city.” Marie Vibbert has sold over eighty short stories to places like Nature, F&SF, and Analog. Her work has been translated into Vietnamese and Chinese. Her debut novel, Galactic Hellcats, about a female biker gang in outer space rescuing a gay prince, was on the British Science Fiction Association’s long list for 2021. Her second novel, The Gods Awoke (Journey Press, September 2022), is about a powerful telepathic sentience discovering she is not a god.", "text": "8510 words, novelette\nWe Built This City\nEvery sunset, Julia climbs the city her mother built. It feels enormous, on the outside. Inside, it’s cramped, a human anthill. It didn’t used to be, but Julia doesn’t remember what it felt like when there was room enough for everyone.\nIn the locker room, Rafael’s elbow scissors into her personal space as Julia zips her coveralls. Her helmet and face shield are grimy, the padding smells of a mixture of her sweat and the false sweetness of institutional cleaner. The breather elastic is way too loose. She’s already tied knots on each side.\nRafael stays too close, his chin tucked down. “They’re talking about cuts. Big ones.”\nJulia straightens. He ducks to tighten his overshoes, showing her with his posture that this is meant to be a secret.\nIt’s not like Rafael to gossip. He’s a good worker. A hard worker. Julia pretends to adjust her pant cuffs. “There’s nothing left to cut.” She requisitioned new gloves two years ago and is still waiting for them. Her right pointer finger slides out through taped-over repairs and the skin is permanently red.\n“Angel, in the office? He says they’re cutting the salary budget in half.” Rafael’s voice gets quieter until “half” is only mouthed.\nPedro presses his face between them. “Passing notes? I’ll be at the top before you’re done.”\nRafael turns to taunt Pedro, and that’s the end of the strange conversation. People are filing out of the room. The day has begun.\nThe catwalk rattles with feet as Julia jogs. The calls of “ready” start coming in on her radio before Julia has gotten to her section and clipped her belt to the safety line. It’s a brave job, and they treat it as such. Every sunset they race to the top, for the privilege of turning the knob that starts the water flow and alerts the system washing is taking place. Julia has never been first, but she has been second.\nShe has never truly given her all. She has felt like she has, but there’s a difference, between feeling it and doing it. She could, if she dug deep, run up the wall like her life depended on it. She could be first.\nThe sixteenth “ready” comes, and she leaps the first step, skittering mad and hard past the vertical. The city dome curves comfortingly under her gripping soles, and she sees the sun sinking in the west, painting oil slicks on the glass, the marks that never wash out, the bleeding minerals of the grilles.\nThis is her favorite part of the job, the beauty and solitude, the clouds rolling underneath the city, the sun melting into the soft horizon like a pat of butter in potatoes.\nHer mother climbed cliffs on Earth with Julia’s abuela. Her stories are peppered with references to anchor points and cracks and other things Julia doesn’t know how to fit into her own experience of climbing. Once upon a time, her mother was here, lifting the beams supporting her into place. That is easier to imagine. The dome a fragile, empty thing, alone in the feral clouds of Venus, no city inside yet.\nJulia can feel herself slowing near the top, arms and thighs getting lazy, pulling at her to slow down. She forces a second wind. The hard part is almost done.\nRafael is at the top already. She gives up, checks the hose and nozzle at her hip, turns the squeegee so it’s at the angle she likes to grab it. She gets through the last few feet. The rest of the crew is coming into view. Rafael gets to turn the knob. Again. He does it like a stage magician revealing a dove.\nThe top of the dome is a sixteen-pointed star of time-painted titanium, and they, alone, get to enjoy it up close, to be out here with room to stretch. So they do, as they prepare to descend.\nPedro huffs. “I’m tired already.”\nHe’s just mad not to have made it to the top first. “If you want to quit, I’ll take your pay.” Julia tries not to sound out of breath. Pedro flips her off. No one’s going to quit and lose their housing allotment.\nShe plays out a few feet of hose and hops back lightly. She hears Rafael teasing Pedro as she sprays a thin stream of soapy water along the rails that separate her section from the others. She’s proud of her skill at this. She has the best water conservation scores.\nShe imagines the wash soothes the tired city. Acids eat every weak spot and lingers in unexpected salts. Without their careful maintenance, the dome could leak, and leaking meant sinking into the hellish pressure below. The air they breathe is also the lifting gas that holds the city aloft in Venus’ denser atmosphere. Their parents’ generation built a city to float in the clouds. Her generation keeps it flying.\nShe spots a nick and easily switches hands, holstering her water sprayer and pulling out the repair gel. Squirt, squeegee, and the white silica gel rapidly sinks into transparency as she switches hands again.\nHop back, spray, swipe clean. She gets into the rhythm, working left to right, then right to left as her section widens. She and Rafael meet at their boundary, and he looks over at her. “Have you thought about it? About what you’ll do?”\nJulia scowls. There’s no time in her rhythm to respond, and she feels put upon that he throws troubles into her mind as she plays her rope out and drops out, down, left to start the next pass. There’s Rafael coming toward her again. She has three hops and as many seconds to form a response. “So?” is all she comes up with.\n“We need to stand together,” he says. “All or none.” And he’s gone.\nHe thinks they’ll be laid off? The city needs them. They never got a robot washer to work. Even if they did, there’s no room in the city to store a washing robot, and to leave it out in the atmosphere is to ask for it to be slowly destroyed.\nBut he’s serious.\nWhat if they cut the staff? No. That would be too cruel with the housing rules. But they might. Would they move to washing every other sunset? Or will they each wash two sections? Her thighs burn as she hops. Her mother will hate that. Too much time in menial work, no time to improve herself.\n“Why did you settle for this job where they can ask you to do this?” her mother will say.\nThe next time their paths touch, Julia and Rafael meet without words. It takes six hours to wash the dome now. Could she do this for twelve hours straight?\nHer mother tells a story about climbing a limestone spire in El Potrero Chico, something like six hundred meters, with no guide rope. She never says how long it took, but that she lagged behind Abuela by hours.\nAbuela exists in her mother’s stories like a cartoon character or saint Julia doesn’t quite believe in. Is this mythic grandmother meant to reflect on their relationship? Is there a moral behind the story she is expected to decipher? Did daughters always end up not quite as strong as their mothers?\nJulia’s left knee twinges when she plants to begin her next pass. An old injury, telling the tale of years on the job. Her mother wanted her to work with her brain. “I busted my ass so you don’t have to bust yours.” But it isn’t any easier, busting her brain. The hardest problem in school isn’t a differential equation or history fact, it’s finding a job you’ll love to do that wants you.\nRafael is hidden by the curve of the dome most of the time now. These longer passes are grueling. Her shoulders strain without the break of dropping to the next level. It’s lonelier. The race and thrill are over. But this is her work, and she is good at it, and she wants to keep doing it.\nShe side-hops over an apartment block. It’s fascinating how people take the same room and make it their own. A toddler looks out at her, mouth open, pounding a doll’s head with a plastic cube.\nWhen she reaches Rafael again, she says, “All or none. Of course.”\nHe gives her a sad look. “You promise? If they lay off, we all walk?”\nShe nods curtly. It’s a drop and another long pass. The apartment below has curtains drawn. A waxy white fabric, edges of burgundy that must be the color on the inside. A spiderwort pokes its tendrils under and around. Her mother is a terrible gardener but keeps trying. They have a duty to grow green things. Every apartment a vegetable garden.\nShe only thinks of her mother in motion. Repotting, watering, tearing up failures. Or pointing up at some girder or crossbeam to lecture about bracing and counterbalancing. “Physics. That’s everything, mija. Study your physics and be a scientist and support me in my old age, eh?”\nWould her mother understand if she walked off the job? Julia doesn’t know, but she feels strong, excited at the idea of doing something radical.\nAt the bottom of the window, Julia sets her feet on the lip of the city and walks across. Her section is a fifteen-minute walk at the bottom, when it was a single bound side-to-side at top. Her last pass is done crouching and is the slowest pass of all. A trough under the catwalk catches the soapy water, funnels it down to be filtered and processed. She’ll follow the pipes down, under the floor of the city. There, the rest of the work shift will be cleaning and stowing the equipment. She tugs her hose to start it retracting.\nThe weariness in her thighs and shoulders feels like a job well done. She walks clockwise back to the airlock. Rafael’s steps echo behind her. She wants to look back, now that they are coconspirators, but doesn’t. She wants the dreary part of the night done, the indoor’s grime and machines. She’ll get a beer before heading home. It’s a gorgeous evening, no higher clouds. The central square will be flooded with starlight as second Sun Day ends and first Dark Day begins, the city speeding far above the lagging ground in the atmospheric current. Forever the same.\nIt’s possible Rafael is wrong. Maybe nothing will happen.\nAngel, the office manager, is waiting in the locker room. That’s not normal. He fidgets like he has to go to the bathroom while they take off their outdoor suits and hang their face shields. Rafael gives her a look that says, “I told you so.”\nJulia wishes she’d worn a better shirt today. This one has a stain on the sleeve where she set her elbow in spilled coffee. The face shields get rinsed in the sink and hung to dry. The suits go into a laundry hamper. The shoes rest in a tray full of acid-neutralizing chalk. She changes her socks. Many of the others don’t, but she can’t imagine going through the rest of her day in damp socks. Everyone is finished. Julia sucks the acid burn on the side of her pointer finger. One of the women starts brushing her hair. They should be going into the machine room now, but Angel is in the way.\nHe clears his throat. “The boss gave me the job of telling you guys. They’re letting most of you go. We’re keeping Rodriguez, Hammerstein, Corredor, and Lopez. I’m sorry.”\nJulia is Lopez. She feels a relief that squashes into instant horror and guilt. No one is talking, no one is moving. Rafael (Rodriguez) steps forward, shoulders wide. Is this it? Is he going to do something? Julia fears confrontations. She wants to hide. But she’ll stand with him. She said she would.\nRafael asks, “How are four people expected to clean the whole dome?”\nAngel’s response sounds prepared. “You’ll work four shifts, do it in sections. If we really stay on top of it, admin thinks it’ll be enough. They’re downsizing the office staff, too. Hector and Alverez from maintenance are going to do all the interior work. All you have to worry about are the windows.”\n“Fucking thanks.” Marta Hammerstein throws a towel into her locker.\nPedro looks at Julia with hate in his eyes, and she realizes she isn’t going to get a beer tonight, after all.\nRafael doesn’t do anything. His face is trembling like he might cry or shout, but he doesn’t say anything.\nWhat’s worse, neither does Julia.\nAngel twists, half a shrug, half an aborted apology, and leaves.\nFour shifts. Her mother will hardly see her. The argument between them is fully in her mind, as though it has already happened. She chose to be a dumb beast, not a knowledge worker. She can’t afford to stand up for herself, when her mother . . . her mother built the city.\nNormally, she would work a twelve-hour shift, with the interior work after the washing. They worked long on First Dark Day, got Second Dark Day off, and did an inspection pass on First Sun Day, making small repairs, and got Second Sun Day off. It was a good schedule, a familiar rhythm. The document Angel sent to her drew out a complicated schedule that creeped forward and wrapped around the week, rather than working with it. Did they no longer care about the increased evaporation during Sun Days?\nJulia walks half-blind, reading the schedule, dragging it over her old schedule, trying to make sense of it. No matter how slow she walks, she’ll be home early. Behind her, Pedro is inconsolable, moaning and crying while another worker, RiRi, who has a strident voice, attempts to soothe him by pouring gasoline on his flame. “You know it’s the corps. They’re paying cash on the head for anyone we deport. You know why, don’t you? Because their own workers are dying like flies. Like flies!”\nShe’s almost home.\nJulia lives in a frame stack building, aluminum beams white with age holding corrugated plastic in faded fruit juice colors. It sits wedged between newer buildings built on what had been streets, walkways relegated to tunnels underneath them, and even those are lined with sleeping bags. Their proud city resembles nothing so much as a warren of stacked plastic crates and abandoned campsites.\n“They can’t,” Pedro moans. “They’re not gonna . . . there’s time, right? They gotta give people time.”\n“Time is an illusion.” RiRi’s getting louder. “They make you think you have time, but who’s hiring, eh? Who’s hiring?!”\nA figure wrapped in a blanket rolls over, tightens the fabric around its head, and Julia flushes with embarrassment. How ungrateful they must sound, clean and well-fed, on their way to homes.\nThis isn’t the utopia the Mexican government imagined, but they didn’t know there would be refugees from the corporate factory-aerostats. Couldn’t have dreamed such places would exist, so awful their workers were willing to risk the crushing depths to hop on a homemade glider or balloon and make it to the free air of New Tenochtitlan.\nA door bangs open, a man shouts, private tragedy spilling into the street like food waste. Julia assumes it has nothing to do with her and studiously avoids looking until the man in the too-loose shirt is charging her way, and past her, and slapping Pedro.\n“Pops! Ow!”\n“You lost your job? You LOST YOUR JOB?”\nJulia lowers her head and hurries, pretending that she doesn’t hear every word.\n“What are we supposed to do? Eh? What is your mother going to do when you get stolen away?!”\nShe pretends she isn’t relieved by the contrast to her imagined argument with her mother. She hasn’t lost her job. She will, at first, simply not mention the layoffs.\nJulia’s mother’s apartment is small, smaller than the ones under Julia’s section of dome. What had been “her” section. She supposes she’ll now do a full quarter of the city. She’s exhausted thinking about it. Like her first week on the job, when every night her body was spent and every morning her muscles felt like poorly set concrete.\nHer mother bursts into the room the second she arrives, a tiny tornado with a gray buzz cut. “Are you okay? Did anyone get violent?”\nJulia lets her mother drag her to the sofa and fuss over her. “You found out?”\n“Eduardo. His daughter works in administration, and her wife is the facility manager’s cousin. She says it’s coming from the top. RyelCorp offered to pay for deportations in one big swoop, so the city wants all the unemployed people they can get at once.”\n“Ma, that’s a conspiracy theory.”\nShe shrugs. “I’m a lazy retired lady now, we do nothing but gossip.”\nAround the room, her mother’s plants, quilts, and exercise equipment tell a different story. When will the concern fade and the recriminations start? “I guess I’ll see how it works next sundown. The revised schedule.”\nHer mother freezes. “You didn’t quit?”\nShe feels she has failed an important test. She also feels the threat of deportation to RyelCorp’s factory bubbles. “Whatever the city needs, right?”\nHer mother shifts on the sofa to face her directly, hands on her shoulders. “You listen to me, mija. Yes, those are words I’ve said, and I mean them most of the time, but not now.” Julia’s heart swells with love. “A city without people is only a ruin.” Yes, that’s it, exactly. But then her mother gives her a little shake and breaks her heart. “This is your chance. To leave that drudgery behind and get a real job.”\nJulia is on her feet so fast her mother’s hands fly up as if in surrender. There’s only the one bedroom. Julia sleeps on the sofa. She goes to the bathroom. At least it has a door.\nThe flimsy printed door doesn’t muffle her mother’s voice. “I shouldn’t have said ‘real.’ I meant ‘better.’ When God closes a door, he opens a window.”\nJulia sits on the toilet and wishes there was a window she could escape through.\nThere are only four window washers now, and the city will not survive without their labor. It should be easy to band together, to refuse.\nThey have a group chat.\nMarta: I’m pissed, too, but I can’t afford to lose this job.\nCorredor: TO ANY EXECUTIVE READING - I AM NOT A PART OF THIS DISCUSSION\nMarta: Luis has a point. We’ll get fired if they see this thread.\nRafael: But if we band together, they’d have to fire all of us.\nMarta: You think they fucking won’t?\nThat killed the thread. There was nothing after it but Rafael repeating some variation of the same thought:\nRafael: Come on, guys. I can’t do anything on my own.\nIt’s hot in the square, already halfway into the forty-eight-hour day. First Sun Day evening, or noon, as the sky tells it. The sun winks through the windowpanes, the heavy plants perspire. It smells both human and jungle. Here, the packing crate apartment buildings are a backdrop behind monuments and trees. The administration offices are built like a stepped pyramid, with lush foliage on every step.\nJulia’s mother is dragging her forward with a sweaty hand clamped manacle-tight on her wrist. Like she’s a child again.\nJulia looks yearningly toward the Cloud Bar’s blue curlicue entrance. “Ma, this isn’t going to do anything. You aren’t important anymore.”\n“I should wash your mouth. I built this city. Now you’ll see. It’s not what you know all the time, sometimes it’s who you know.” She marches up to the reception desk at City Hall and knocks on it. “Hello, young man. We need to talk to Valeria, right away. Tell her it’s Hortensia Lopez.”\nThe man at the reception desk looks past them like they aren’t there. Julia should have put on better clothes. She should have insisted her mother change. Their coveralls are like camouflage. They may as well be potted plants.\nHortensia continues speaking anyway. “The city is making a dangerous mistake. I won’t have our maintenance workers mistreated this way. They keep us safe. When I—”\nA woman in light, flowing shorts favored by the fashionable walks in, and the receptionist’s attention immediately centers on her. Julia watches her mother’s frown deepen as the man leans around her like she’s an inconvenient post.\nHortensia says, “Did your mother not teach you respect? I’m here to see the mayor. It’s Hortensia Lopez. She’ll know me.”\nThe receptionist draws back. “Do you have an appointment?” he asks, clearly assuming not. Assuming correctly, which is worse. “I can’t even call her if you don’t have an appointment. Try the public comments box.”\nJulia tries to get her mother to leave, but Hortensia has seen someone she knows and is marching across the foyer. “Darrin! Darrin Ruiz do not turn away from me, you know who I am!”\nHer mother chases this man to a side entrance, where he turns at last and stares coldly. “Do you have a reason to be here?”\n“Yes! My daughter, Julia, she has—”\n“You don’t belong here. Please leave.” He walks away.\nHortensia blinks like she can’t see. Julia wraps her arms around her bicep and urges her toward the exit.\n“I held him at his first birthday party,” Hortensia says.\nAs the sun sets, Julia prepares for work. She’s gotten notice of the length of her shift, sixteen hours. Enough time to do three sections with three twenty-minute breaks between. Sixteen hours of washing. She packs muscle balm and an extra bottle of electrolyte-bearing water.\nHer mother cracks the bedroom door, disarranged for sleep. “Mija what are you doing up so late?”\n“I have to get to work. Double shift.” She feels like a shady politician, prettying up the truth.\nHortensia’s face falls in disappointment.\nJulia keeps her eyes on packing her lunch box.\nHer mother tries to grab her hand. She tries to evade her, but then Hortensia takes both hands, hers moist and warm from bed, like bread loaves ready to bake. “Don’t go. They’ll give you two weeks, it’s plenty of time.”\nJulia doesn’t want to go to work. She wants to be strong enough to say no. She wants to not feel this weight of expectation, the thousands of mornings of going to school, of going to practice, of going to work.\nShe flees the weight, and her mother’s big, heavy hands. She goes to work.\nAngel is in the locker room. It doesn’t feel too small this morning. Marta is shaking her shoes out over the lime dust. Rafael doesn’t look up from sealing his coveralls. Luis dresses like he’s alone in the room.\nAngel watches the four of them like they might bolt at any moment. “You made the right decision,” he says to her.\nJulia wonders when she made the decision. She goes to her locker. Someone has put gloves on top of hers, some other worker’s less-worn pair. Pedro’s? It feels wrong to be so close to Rafael when now there are many empty lockers. She starts to move her spare socks to the next locker over, and stops, seeing the name still there.\nShe turns to Rafael, waits for him to look at her. He doesn’t. “Are we really doing this?” she asks him.\n“Aren’t we?” He sounds defeated.\nShe doesn’t want to be on the side of defeat. She doesn’t want to be on the side of Angel’s untrusting smile. She feels, suddenly, disgusted at all of them.\nShe picks up her spare socks and snatches the photo of her ex-boyfriend and the picture from the New Year’s Party. That’s all that’s hers in the locker. She turns and walks out.\nThe shaking starts before she passes Angel. Her anger cools to fear. Will they let her keep walking? She could be going to get something she forgot. Now she’s at the exit. Now she’s in the corridor. She realizes she’s crumpled her photos.\n“Lopez!” Angel reaches for her arm. She whirls on him, and he backs off, both hands in the air. Did she do that? With a look? “We picked you because you were the four best. Doesn’t that mean anything? We picked you.”\nNo one else has followed her out of the locker room. Not Rafael, not Marta. She feels defeat like a thing just under her stomach, waiting to rise. But Angel called her by her last name. The name that saved the city.\nHe says, “They’ll just hire back one of the others, someone worse. The city will suffer.”\nJulia raises her chin. “That’s their mistake to make.”\nShe hates that she is doing what her mother wanted. When she gets home, her mother rises from the kitchen table, beaming joyful relief. Julia wants to scream, or argue, or explain, but instead she shakes and cries in her mother’s arms. Hortensia rubs circles into her back. “No. It’s good. You couldn’t know your strength until it was tested.”\nJulia spends First Dark Day checking messages. The company gives her a second chance, twenty-four hours to return. She can use a sick day. They don’t say who worked her shift, or if the dome went one-quarter unwashed.\nRafael wants to know if she hates him.\nShe doesn’t, but she hates him asking.\nAt least he has finally done one thing: he has added all the laid off workers to the group chat.\nRafael: They’re going to ask one of you to take Julia’s place. Don’t do it. Not unless they agree to hire more back.\nPedro: You’re still working, right? Did you demand they hire us back?\nRafael doesn’t answer. Julia wonders if she has been silent too long. She had something she could have said, once.\nHortensia cooks her best, most comforting dish, the cheese potato mash, and they finish off the red wine. It’s almost a party, except for her mother going over the budget and writing out timelines they can live on. “There, you see? The charges for not having an employment voucher aren’t so much. There is air, and water, and sewage. We can cover you two months.”\n“They deport after two weeks.”\n“I’m sure that’s not really true. And I bet it doesn’t take so long, now you’re really looking. If you must, you’ll find something temporary before two weeks are up.”\nJulia hasn’t found any open positions she can apply to. She hadn’t found anything in all the years she tried to meet her mother’s expectations, and those years felt full of opportunity, the city uncrowded.\nHer mother isn’t worried, with her pension guaranteeing her residence until death. Julia tries not to resent that.\nWhen Hortensia catches Julia going over the figures, she closes the screen. “But that’s tomorrow and tomorrow, darling. Don’t worry. I am the mother. I will tell you when to worry.”\nSleeping in doesn’t feel as good the second time. It’s Sun Day and the light is strong, seeping through the cracks in the walls. Julia dresses in her best clothes and goes for a walk.\nHer feet take her to work. They don’t know any other walk.\nShe slows as the “employees only” sign comes into sight. She wonders who replaced her. How it felt, washing four sections instead of one. If the city will survive, or if the tired metal is even now being irrevocably eaten away.\nA policeman stands at the door. Julia is several feet back, so she’s surprised when he approaches. “You can’t be here.”\n“I was just—”\n“Leave or you’ll be arrested.”\nJulia stares at him. “Arrested for what? This is a public corridor.”\nWhich is how she gets arrested.\nThe jail is crowded. Each cell, designed to hold one person, holds five. One of the persons in her cell has peed on himself. The others huddle away from him, near the front. Their sweat and breath mingle in a moist fug.\nShe wishes she had her com so she could check the news. She wishes she’d done something more meaningful to get arrested than stand there.\nThe door to the corridor opens and a few people start shouting. When’s my court date? Where’s dinner? But the guard ignores them, leading her mother, who looks like she is claiming a prize at the end of this stinking corridor.\nJulia is genuinely stunned her mother is getting her out. As she leaves the cell, she whispers, “Was it the mayor? Did you—?”\nHer mother pins her a furious glance for one heartbeat.\nShe doesn’t explain the bail until they are in their own apartment. Their savings, halved. The resources to find a new job shortened. “But it’s fine. A mother provides. You’ll find something.”\nThey orbit each other in the cramped apartment like two positively charged magnets. They have three months of rent. Two months, if they want to eat.\nJulia receives two messages. One from the city, stating that she has two weeks to find employment, or prove she is in a training program for employment, or she will be deported. She doesn’t forward it to her mother, doesn’t say “I told you so.” The other message is from Angel, asking her to please come back, they will look the other way, just this once.\nThe group chat hasn’t gotten any better.\nMarta: They hired some untrained cloud-hopper. I blame you, Lopez! I’d take any of you fuckers over him. Smith’s section may as well not get done. Found two cavities today, and it’s only going to get worse.\nJulia closes the feed. “I have an interview,” she says, and keeps her head turned away from the way her mother brightens. She shouldn’t have said it. She doesn’t need an excuse to go outside.\nThe woman who has been sleeping on the edge of the walkway all week is gone, with her blanket and her bag of belongings. Julia wonders about tragedies that touch her life and don’t. She’ll never know where the woman came from, where she went.\nHead down, she walks to the bar. It’s been a long time since the after-work beer she never got, and she wants it. Deserves it.\nCloud Bar is beautiful. The floor is glass, and the ceiling, too, though nearby buildings block most of that view. The ceiling supports are covered in cotton fluff and sheer curtains to make it feel like you are in the sky. She has always loved this place. The prices are cheap before happy hour. She gets her favorite beer and finds a seat near the wall. Through the floor she can see the under-city and the RyelCorp High Pressure Lab, dangling like a rudder into the clouds. It was supposed to bring great, wonderful things to the city. It brought chemical engineers who got all the best housing, didn’t pay taxes, and probably voted for the citizenship-by-employment mandate.\nShe imagines she can kick it off the city with her foot.\nIf she can’t find another job in two weeks, she’ll have to take Angel’s offer. It feels like giving too much up, like admitting the administration can do this.\nShe sees Rafael arrive. Sees him see her and freeze. He looks to the exit. He sags. He comes to her, standing awkwardly like a new waiter. “I saw you got arrested.”\n“For walking on the sidewalk.” She means it as half a joke; it comes out hard. Rafael looks like she kicked him in the gut. She shakes her head, loosening her hair and her tone. “The funny thing is, I wasn’t even trying to picket or anything. I’d just come back to look at the place.”\n“Assholes!” He hovers. “Can I? I mean . . . ”\n“Sit. Don’t explain or excuse, though. None of that.”\nHe doesn’t understand how much she means it because as he settles into the seat next to her, he explains himself. “I got scared. More scared than I thought I could get. I was ready to do it. Walk right out of there. I pictured every step, but then this thought popped into my head: what about my son? What about all the things he needs? You’re single. You don’t know what the burden feels like.”\nJulia considers dumping her beer on his head, but she doesn’t think she can afford another. “What about when your son gets a job? What about when he’s asked to work sixteen hours in the acid rain?”\n“I didn’t say I was right. I said I was scared.” He waves for the bartender, who ignores him. “Anyway, I’m not going back.” He pauses. She doesn’t give him the reaction he’s clearly pressing for. He slumps. “It was killing me, my hands, my legs. And yesterday, Marta slipped. Not a little slip, I mean she was hanging from her safety line, unable to get her feet under her until me and José got to her. And my legs were shaking so I almost couldn’t help. It terrified me. What if we all had slipped? No paycheck is worth dying for.” He holds up two fingers and exchanges nods with a waiter. He looks back at Julia. “You don’t believe me? You think I’m too strong to collapse? Girl, I only ever beat you by a step, you realize that?”\n“No, I believe you.” She avoids looking at him. “About being tired.” Had she gotten the offer to return only because Rafael quit? “You’re one of the good ones,” the message said, “You care about the city.” It implies there are “bad ones.”\nRafael fidgets. “I mean it about not going back. I threw all my gear in a bundle off the platform! I made sure I couldn’t chicken out again. Ah, bless it.” This he says to the beer approaching their table. “It’ll be my last foolish act. They’ve outlawed striking. I only got out by saying I wasn’t doing that, I was quitting. So that’s it.” He looks into his beer as though seeing the end of something. “I checked with RyelCorp, they aren’t hiring. I thought maybe your mother has some connections with the building crews? I’ll do anything.”\nJulia imagines the sunrise on top of the dome, who will see it. She drains her beer. It hits her hard. Not enough to eat, lately. She doesn’t want to feel guilty. She stares past Rafael, at the community news report. The high school baseball finals. Kids smiling against the projected green field, swinging real bats at holographic balls and running on treadmills. It’s hard to see it the way the kids will.\n“They got Pedro,” Rafael says and cringes like he wants to take it back. He lowers his voice. “I mean, he’s gone. There was a shipment to the corp domes yesterday. His folks aren’t talking.”\nThe news report flashes red. Emergency. “Low Pressure Detected in Section 4.” The steady buzz of talk and motion around the room freezes into one tense silence, all eyes fixed to the man who appears on the screen. “There is no cause for panic. A leak has been detected, but balloons are being deployed. Citizens are recommended to seal their rooms if they can be sealed. This is only a precaution.”\nSome people leave. Some go back to their drinks. The general buzz of conversation shifts, becomes serious. Julia wants to spit acid, call out the greed that so predictably led here. What would she say, though, who would listen?\nThe news shifts to a shot of the cleaning crew—her cleaning crew, leaving work. It must have been shot weeks ago. “The blame for the dome leak is being laid on workers who walked off the job in a bid for shorter working hours.”\nJulia feels a pulse of anger so visceral it’s like a fireball expanding from her chest. Someone shoots her a dirty look. A familiar face. A regular. Does he recognize her from that split second of video?\nJulia stands up. “You want something to do? Come on, let’s go.”\nRafael’s face is slack with shock, but he obligingly stands. “Where are we going?”\n“To get arrested.”\nThere are three police officers at the turn for the maintenance employee entrance. As Julia and Rafael approach, they straighten from lounging against walls, set their feet wide. A violent intention thrums through their posture.\n“This is where we walk on the sidewalk?” Rafael whispers, his voice wavering.\nJulia strides forward. “We’re here to fix the leak.” It comes out more confident than she thought she could sound. A clarion call, a command. One of the cops steps back.\nOnly one.\nShe turns to Rafael. “Come on.” He nods, solemn.\nThey make it even with the police, not half a step further, and hard hands are on her biceps. She and Rafael are pushed back. One officer, a woman, says, “Get out of here. Try that again, and we’ll have to take you in.”\nJulia almost laughs. “Why not take me in now?”\nThe cops look at each other. Julia has a guess. That jail was pretty full before. Has someone said not to bring more people in? She hooks Rafael’s arm and leads him away.\nJulia makes her first post to the group chat.\nJulia: Who’s up for storming the locker room?\nRafael: Julia wants to break in, help fix the dome. It’ll show the city we’re the right side. There are only three guards, and they’re not very threatening. Just kinda scowled at us.\nNo one posts “yes,” though there are a number of icon responses. Eyeballs. A fist. Rafael posts a date and time. Julia has no idea what to expect when it arrives.\nOn the corner with the noodle place, they meet RiRi and Rafael’s former roommate and a friend of a friend who used to date Pedro. The roommate had worked on windows once, in high school, but the ex is just there for moral support and muscle. Julia feels like she has misjudged each of these people by not recognizing their compassion before now. She wants to cry, and to hug them. Instead, she just nods.\nThey form two rows, two and three, and they march right past the guards. The police grab her, again, but Julia punches her fist into the air, pushing the hold up her arm. She presses forward, through hands and a tripping leg, and the door is in front of her.\nSomeone grabs her hair, then, and yanks her off her feet.\nIt’s a mess. A tangle of limbs and shouting. It feels more like children wrestling than something adult. There’s a sharp smell of ozone, and Rafael cries out.\nIt ends quickly after the taser.\nJulia gets a fat lip and zip ties on her wrists. The five of them are sat down in a row, Rafael shaking his head and blinking like he can dispel the memory of electricity.\nOne cop paces back and forth in front of them, his fists tightening and releasing as if he doesn’t know what to do with the energy. The other two confer, anxious whispers that get loud enough to hear. “So call.” “I’m not going to—” “Look.”\nTwo more police officers arrive. One has the golden eagle of a commander. She stops three feet away and holds up a hand. “I am very disappointed in you,” she says to Julia and her companions. “We’re in a dangerous situation and the city needs you to be calm, to not make matters worse.”\nRiRi snaps, “We were trying to—” and is kicked by the officer who had been pacing.\n“Now,” the commander says, a gentle admonishment, as if this were a child drawing on the walls. “None of that. We need to be civilized.” She hooks her thumbs on her belt. “The jail’s a bit crowded at present, so I’m going to let you off with probation. Don’t mistake this for nothing. You’re out of warnings. If you so much as spit on a walkway, your asses are going straight to deportation holding. Is that clear?”\nAre they supposed to answer? Agree to this? Pedro’s ex murmurs “Yes, ma’am,” and the others follow. The woman stares at Julia until she ducks her head and says, “Yes, ma’am,” too.\nThey reconvene on the High Path, a narrow public walkway that loops through the upper levels of the city, connecting to buildings and support struts, with a few benches and baskets of plants attached to its sides. None of them have the money to waste on beer or even hot noodles. Julia feels like she’s in a trap and only waiting for it to snap shut. There’s still a red line on her wrist from the zip tie.\nRiRi sighs and sticks their legs over the edge to dangle. “I think it’s that prisoners can’t be deported before trial. That’s why they don’t want to arrest us. This is actually worse, this one-offense warning.”\nRafael is unfairly happy, pacing back and forth, making the walk bounce with his steps. “No. This was a step. A stride. They backed down. We have them. Five people is too many for them to arrest. Imagine what we can do with this!”\n“Get beat up again?” Pedro’s ex asks.\nThey can see so much from up here. Part of a mural that might be a child throwing a baseball or just reaching for a glowing, floating one. The odd, organic blue plastic of the university annex peeking around the traditional, square shapes of other buildings. Graffiti. There’s a man leaning on a railing below them, gesturing now and again as he talks to someone remotely. His forearms are like drumsticks. A woman waters a sweet pea vine in a window to the right of him.\nWalkways and stairways and floors, all built one atop another, atop empty air. Julia imagines it falling, emptying, ending. She imagines what it was like when her mother first saw it, when there was just an aerostat and a gantry and a fabber spinning out material from clouds.\nThe others haven’t stopped arguing. “Well, what are we supposed to do, then?” Rafael demands. “Nothing?”\nJulia can see through crossed walkways and power lines to workers brushing a mylar sheet against the interior of the dome. An ugly, temporary fix. It brings the anger back.\nTwo men are jogging on the walkway. Rafael and Pedro’s ex have to squeeze to the side to let them pass. As they do, one of the joggers mutters, “Lazy bums.”\nThe other is louder. “If you don’t love the city, leave it.”\nThe first whispers something to him, and they both turn back, scowling, and it’s not the casual hatred of the rich for the poor, it’s specific. They know who they are looking at, and they want very much to push the lot of them off the walkway.\nJulia gets up and goes toward the nearest stairs down.\nShe didn’t expect Rafael and RiRi to come with. They followed her down and pestered until the direction she walked made it pointless to hide her destination. “I’m going to talk to Angel.” She showed them the message, that she could still have her job back.\n“Are you, though?”\nJulia shrugs. “It’ll get me in to talk to him.”\nAngel holds the door frame as if to prevent them from entering the administrative office. “Are you ALL expecting me to give your jobs back?” He looks pointedly at Rafael.\n“We just want to talk,” Julia says.\nAngel starts to close the door. Julia pushes her arm into the gap. “You know the dome needs regular maintenance. You know it’s more work than four people can do.”\n“It’s not my decision.”\n“Then let us talk to whoever’s it is.”\nAngel shakes his head. “I need to keep my job.”\nHis exhausted expression isn’t different from Marta’s when she said the same thing. “Do you? Why? Who decided we had to bow to jobs? What about my mother? What’s her job?”\n“She served the city.”\n“So did I.”\nAngel presses his hands together. “Please. Just take the job back. They’re already threatening to ship you off for leaving.”\nJulia has nothing to threaten other than violence, and she doesn’t want that. Angel is awful, but he is also a person. “Let us cut through the office.”\nHe frowns. “What? No. I just said. I need this job!”\nJulia puts her hand on Angel’s chest and pushes. She increases force until it’s enough and he stumbles back. She pushes him all the way to his desk, and his arms pinwheel until they clasp the front edge. “So we forced our way in,” she says, and leaves him there, walking to the inner door, the one that leads from administration to operations, and from there, to the locker room.\nShe still doesn’t expect Rafael and RiRi to follow, but they do.\nShe doesn’t go deeper into operations looking for the boss. She doesn’t think it would help. There’s an endless line above Angel, of people just doing their jobs, pointing up until you got to the top, and the top person points down at the bottom, saying, “I need to keep their support.”\nThe locker room is a tumbled mess. Anti-acid powder footprints track everywhere. Julia finds a clean pair of grip-soles and puts them on over her regular shoes. If she’s doing this, she might as well be comfortable.\nRiRi hangs by the door, uncertain, but Rafael starts gearing up, taking gloves from this locker, a face shield from that. RiRi shakes their head. “So, you’re . . . breaking in here, just to work?”\n“Someone has to do this.” Julia hasn’t thought too much beyond that. She’s angry and tired of being blamed for not doing a job she wants to do.\nRafael settles the shoulder straps of a safety harness and grins. “It’s perfect. We save the city, we show them what side they should support.”\nNot much Rafael has said has ever turned out true, but Julia wants to take comfort in his optimism. She starts to put on a face shield, finds it stinks of garlic and sickness, and puts it back, picking up another.\nThat’s when the door bursts open. She doesn’t hear what they shout, something like “get down” or “hands up”—it’s a percussion note, like the boots, the batons hitting the lockers. The police fan in quickly, one left, one right, one left.\nRiRi stumbles, pushed down by them. They look up, disbelief in their eyes, their arms cradling their head, and then RiRi is diving toward the police, rolling on the floor into their legs.\nRafael has already gone out the airlock. Julia hates that she doesn’t hesitate longer.\nRafael slams the door behind them and twists the handle off. Julia doesn’t think that will actually do anything, but there’s no time to argue about it. She grabs her rope and starts climbing.\nIt’s full Sun Day, not the right time for doing this, and the heat is unexpected, strange. The texture of her feet on the glass feels stickier.\nWhatever’s happening behind her, she is soon absorbed in the task of climbing. She’s already out of shape, gasping more than usual. Or maybe it’s the heat.\nShe skitters to the top to see Rafael a few paces behind her. Sees him see her and slow down, checking his squeegee on his hip. When they both reach the top, he bows to her, gesturing.\n“Dork,” she says, but she twists the knob. It doesn’t feel how she’d imagined.\nWith gestures, they split the dome in two. They go slowly, no time limit, checking for damage. It doesn’t take long to find the first crack. Julia smooths it and wonders if someone will climb up behind her, yank her off the city. There are emergency service balloons and helicopters. Her back prickles and not all the sweat is from the sun.\nTwo passes, and it’s already feeling longer than doing the base of her old section. Her radio crackles. She forgot it was built into the helmet, that she was wearing it.\n“Rafael Rodriguez. Julia Lopez. By order of the chief of police, you will not be permitted to reenter the city.”\nJulia stops where she is, the too-loud, hard voice echoing in her mind. She keeps expecting them to say more. She hears the rhythmic jingling of Rafael’s harness as he hops to her. He’s breathing heavy. “They’re locking us out.”\nJulia readjusts her grip on the safety line. She looks at her feet. They’re still on the flattish top of the dome, the view beneath her is a rooftop with skylights and vents. Will the acid rain melt their clothes first? No, she’s being silly. They’ll die of thirst long before anything else gets them.\nJulia sees what might be a crack to her right. “See you on the other side,” she says and goes to it.\nRafael is still and quiet a long time before he resumes washing.\nTwo more passes. They get another warning not to go near the airlocks. Rafael finds a discolored patch. “I don’t know if anyone is listening on this channel. But it’s grid 4-C-10. Someone should make a note and come back here.”\nJulia is exhausted. She finds Rafael has stopped, sitting, his knees up, on the curve of the glass. “We’re not getting through this in four hours, chica. Take a load off.”\nSo she copies his posture and looks out on the cloud sea. The tantalizing deep valleys that look like they hold secrets. The soft curving slopes she imagined sledding down as a child. “We’re going to die here.”\nRafael snorts like it’s a joke. “And I’m already almost out of repair gel.”\nWhen their legs are rested, they resume their work. There doesn’t seem to be anything else to do.\nOn the next pass, they are even with some apartments, and people have gathered to watch for them. A man with a baby waves. Julia waves back.\nThe next floor down, there are more people. They don’t look angry at them. They look excited. It gives Julia strength. She works harder.\nThen she sees her mother.\nIt’s a rooftop park. A nicer neighborhood than theirs. She went there once with a school club, to do some plant-identification assignment. Julia can’t see the little cards on the beds now because the rooftop is crowded with people holding signs.\n“Maintenance is life,” reads a large one. Another says, “Justice for workers.”\nShe is startled by two girls waving at her, shaking a banner. “I stand with Lopez.”\nHer mother’s sign is one of the nicest, of course, with clean, elegant letters. “My daughter has the most important job in the city.”\nMarie Vibbert has sold over eighty short stories to places like Nature, F&SF, and Analog. Her work has been translated into Vietnamese and Chinese. Her debut novel, Galactic Hellcats, about a female biker gang in outer space rescuing a gay prince, was on the British Science Fiction Association’s long list for 2021. Her second novel, The Gods Awoke (Journey Press, September 2022), is about a powerful telepathic sentience discovering she is not a god.", "source": "https://clarkesworldmagazine.com/vibbert_06_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: We Built This City by Marie Vibbert"}