{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "/cVAOMnXeJDfOLE/rFXnF2a60XA=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Finding the Good in a Dark Day  Last month, my family and I filled the van with books and drove four-and-a-half hours to Burlington, MA for Readercon, one of my favorite conventions. After a nice dinner with Lisa and the boys, I walked over to the dealer’s room to get started on setting up the Clarkesworld table. After a team of volunteers helped unload my van, I started assembling my shelves. Halfway through, I began to feel overheated and nauseous. It felt like food poisoning, so I headed back to our room, but the situation worsened as time passed. Eventually, Lisa had to call the front desk for an ambulance. The paramedics arrived quickly, and after a series of questions, began to suspect that I was having a significant heart attack. They were right. I was rushed down the street to the Lahey Clinic, where they then proceeded to put two stents in my heart, in a location of my heart that they refer to as “the widowmaker.”  The day after, I recall asking Lisa to see if friends at the con could arrange to get all my boxes loaded back into the van. Later, however, she told me that when people heard what happened, they set up my table and arranged to have volunteers handle sales for the entire weekend. They were determined to make sure that I wouldn’t be carrying any boxes of books back with me. Cards were made from my promotional posters and people kept stopping by the table to sign and send me their best wishes for a speedy recovery. They even made arrangements to get some books from my personal collection signed for me. They handled every little detail. By the end of the weekend, they took what remained of the books, loaded my van and handed Lisa a stack of money. From my hospital bed, I checked in on email, Facebook and Twitter via my Kindle Fire. Every day, I was emotionally overwhelmed by the support and efforts of these people. I still am.   All too often, we only hear about the bad things that happen within fandom. It’s right to point out the creeps and other disturbing things that happen, but we can’t let those few outshine the genuinely good people that make up the majority. In many ways, it is a testament to fandom that I haven’t been able to track down all the names of the people that helped my family that weekend. Friends, acquaintances and even total strangers pitched in and gave up their own time when we really needed it. Even the smallest gestures added up and lifted our spirits when we needed it the most. For that, I will be eternally grateful. I can’t think of a sufficient way to thank everyone.  I’m told the following people are deserving of special thanks: Gavin Grant, Sean Wallace, Kate Baker, Jaym Gates, Genevieve Valentine, Eric Rosenfield, Molly Tanzer, and Sam Berman. These are good people. Treat them that way.  I wish the story could end right here, but unfortunately there’s more. Within eight hours of returning home, I found myself headed to the emergency room of Morristown Memorial Hospital with a kidney stone. Normally a simple procedure, my already weakened heart and the high level of blood thinners in my system complicated any attempts to fix things. Eventually, they decided to go in after the stone, but it proved too much. Instead they left a stent inside me to help prevent the stone from causing further pain until such a time that my heart can handle the strain of the full procedure. I have months of recovery ahead of me, but I am finally home and have the support of my friends and family. That’s enough for me right now.  Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Finding the Good in a Dark Day\nLast month, my family and I filled the van with books and drove four-and-a-half hours to Burlington, MA for Readercon, one of my favorite conventions. After a nice dinner with Lisa and the boys, I walked over to the dealer’s room to get started on setting up the Clarkesworld table. After a team of volunteers helped unload my van, I started assembling my shelves. Halfway through, I began to feel overheated and nauseous. It felt like food poisoning, so I headed back to our room, but the situation worsened as time passed. Eventually, Lisa had to call the front desk for an ambulance. The paramedics arrived quickly, and after a series of questions, began to suspect that I was having a significant heart attack. They were right. I was rushed down the street to the Lahey Clinic, where they then proceeded to put two stents in my heart, in a location of my heart that they refer to as “the widowmaker.”\nThe day after, I recall asking Lisa to see if friends at the con could arrange to get all my boxes loaded back into the van. Later, however, she told me that when people heard what happened, they set up my table and arranged to have volunteers handle sales for the entire weekend. They were determined to make sure that I wouldn’t be carrying any boxes of books back with me. Cards were made from my promotional posters and people kept stopping by the table to sign and send me their best wishes for a speedy recovery. They even made arrangements to get some books from my personal collection signed for me. They handled every little detail. By the end of the weekend, they took what remained of the books, loaded my van and handed Lisa a stack of money. From my hospital bed, I checked in on email, Facebook and Twitter via my Kindle Fire. Every day, I was emotionally overwhelmed by the support and efforts of these people. I still am.\nAll too often, we only hear about the bad things that happen within fandom. It’s right to point out the creeps and other disturbing things that happen, but we can’t let those few outshine the genuinely good people that make up the majority. In many ways, it is a testament to fandom that I haven’t been able to track down all the names of the people that helped my family that weekend. Friends, acquaintances and even total strangers pitched in and gave up their own time when we really needed it. Even the smallest gestures added up and lifted our spirits when we needed it the most. For that, I will be eternally grateful. I can’t think of a sufficient way to thank everyone.\nI’m told the following people are deserving of special thanks: Gavin Grant, Sean Wallace, Kate Baker, Jaym Gates, Genevieve Valentine, Eric Rosenfield, Molly Tanzer, and Sam Berman. These are good people. Treat them that way.\nI wish the story could end right here, but unfortunately there’s more. Within eight hours of returning home, I found myself headed to the emergency room of Morristown Memorial Hospital with a kidney stone. Normally a simple procedure, my already weakened heart and the high level of blood thinners in my system complicated any attempts to fix things. Eventually, they decided to go in after the stone, but it proved too much. Instead they left a stent inside me to help prevent the stone from causing further pain until such a time that my heart can handle the strain of the full procedure. I have months of recovery ahead of me, but I am finally home and have the support of my friends and family. That’s enough for me right now.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_08_12/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Finding the Good in a Dark Day by Neil Clarke"}