{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Natalia Theodoridou", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "lfKrHFf5l7yTLQLOzfCWah8SoMo=", "id": null, "license": null, "comments": "", "raw_text": "5490 words, short story  Android Whores Can't Cry  False start #1  MEETINGS AT MASSACRE MARKET by Aliki Karyotakis for the London New Times I met Brigitte at what the locals call Massacre Market. She pronounced her name as if she were French—or I should say French-made, I guess, but I didn’t know that at the time. She was a working girl, owned by a guy named Jerome—also French, supposedly. She was waiting there for my local liaison and I, among desiccated corpses and stalls full of blown-up photos of the tortured and the dead. She kissed Dick on the lips when she saw us, before greeting me. She did it in a mechanical way, as if she were supposed to, as if she couldn’t do otherwise. That’s when I saw the long strip of nacre that ran down the back of her neck, along her spine, pure and magnificent. I shot Dick a questioning look.  “Yeah yeah, it’s the real deal,” he said. “She’s my artificial girlfriend in this town. I’m renting her full time. Very useful. She knows people.” Dick could be snide like that. “I’m sure you girls will get along,” he added.  Brigitte turned to me, holding out her hand. She gave me a warm smile, but I could tell that she, unlike Dick, was very well aware of where we were, of the transactable images of gore and violence that surrounded us. Of the history of this place.  “Pleasure to meet you,” she said, a glint of something indecipherable in her eye. Was that an android thing? Or was that the part of her that is human?  Androids can usually pass, if they don’t have any visible nacre. But, of course, as soon as nacre appeared on android skin, people started wearing fake nacre patches as a fashion statement. When the patches are high quality you can’t really tell them apart.  What was the nacre’s appeal? I suppose part of it is that we still don’t understand why or how it is formed. The other part is that it’s perfect, beautiful. And that it doesn’t perish.  Nacre is forever. [Note to self: You sound like an infatuated schoolgirl. What does Brigitte have to do with anything? Get it together. Just get the facts straight. Also, preserve both Dick’s and Brigitte’s anonymity.] >>>END OF FILE  Nacre: Formation and Function  Nacre, or “mother of pearl” is a composite material produced by certain molluscs as an inner shell lining and as the outer coating of pearls.1 Since the APC-VII2 finalized and started regulating the production of androids globally, nacre has been a standard feature of all artificially produced semi-mechanical humanoid organisms.3 The production of android nacre had not been foreseen and remains unexplained. However, android nacre is considered harmless, if not beneficial for humans as an identifying mark, and so no attempts to avoid its appearance on android skin have been made.  Nacre formation is an evolutionary conserved and multiply-convergent process among the Mollusca phylum, arising as early as the Ordovician period (488 to 443 million years ago). While the exact process of its production is little understood even in nature, the function of natural nacre is largely defensive: layers of nacre protect the soft tissues of the organism from parasites, while damaging debris can be entombed in successive layers of nacre, ultimately resulting in the formation of a pearl.  The function of android nacre remains unknown.  1 - “Pearl” is also slang for a locally produced hallucinogenic that is sometimes used in meditation. Despite the name, the connection with either natural or android nacre has not been confirmed, largely due to lack of research.  2 - APC: Android Production Committee.  3 - These are commonly referred to as Androids, as this has been the popular term for many decades—however the universal applicability of the term has been questioned on various grounds. Still, other proposed terms, such as Gynoid and Cyborg, although more accurate in certain cases, are no longer in widespread use.  >>>END OF FILE  Fieldnotes #1  It’s Dick’s afternoon playtime and he makes Brigitte re-enact scenes from his past while I try to work on my article. Playing in front of me is awkward, indiscrete. Vulgar, even. But I’m sure he does it on purpose—he wants me there. He wants me to witness this, and he knows I won’t interfere. He is the client: his game, his rules.  Brigitte playacts Sandra, my college friend and Dick’s ex-wife. She kinda looks like her too. Now they’re acting out the night Sandra left him—left us. Dick is high on pearl. I can tell from that slightly unfocused look in his eyes. Like he sees things past Brigitte, past the windows and the smog, past the illusion of life.  “I can’t be with you any more,” Brigitte says. It sounds like she’s said this line a hundred times already—a recitation. It seems she’s in learning mode for these sessions. Dick is shaping her into Sandra. I find this deeply disturbing. “You’re such a brute,” Brigitte recites. “Not sophisticated at all.”  “That’s who I was when you married me. What was different then?”  Brigitte pretends to put all of her clothes in a suitcase, preparing to leave. Dick follows her around, practically yelling in her ear.  “I’ll tell you what was different,” Dick says, “you were a horny little cunt back then, weren’t you.”  Brigitte stops packing and just stares at him.  “You’re supposed to cry now,” Dick says, and then pretend-slaps his forehead. “But I forgot. You can’t cry, can you?” He turns to me. “Hey Aliki, did you know that? Android whores can’t cry. Because who wants to fuck a whiny bitch, right? Right?”  I look at Brigitte. I think I see a twitch disfigure her lips for the tiniest of moments, but then she smiles. “Who wants to fuck a whiny bitch?” she repeats. Still in learning mode. Damn it.  “You really are a dick sometimes, Richard,” I say.  Dick laughs. He comes over and hugs me.  Brigitte keeps smiling, a twinkle in her eye.  >>>END OF FILE  Nacre: Human Use  Historically, nacre has been prized for its iridescent appearance, while its strength and resilience has made it a suitable material for a variety of purposes. The nacreous shells of sea snails were used as gunpowder flasks in the 18th century and earlier. Nacre inlays have decorated some of the most renowned temples and palaces in Istanbul, traditional musical instruments in Greece, the keys of flutes, and the buttons of kings and queens the world over. Some accordion and concertina bodies are entirely inlaid with nacre. Little spoons made solely of nacre have been used to eat caviar in Russia, in order not to spoil the taste with metal.  All of these practices, although rarer, continue to this day. However, where natural nacre was used in the past, android nacre, the price of which is exorbitant due to the legal restrictions placed on its farming, is mostly used today. [Note to self: I wonder what it feels like for androids. Do they consider nacre to be a part of their skin? A part of who they are? What would it feel like to see your skin as decoration, a musical instrument, a spoon?] >>>END OF FILE  False Start #2  MASSACRE MARKET: A HISTORY OF VIOLENCE AND SILENCE by Aliki Karyotakis for the London New Times “That great dust-heap called ‘history.’” —Augustine Birrell “Truth? I have no use for that. Truth won’t feed my people. It won’t cover their bodies. Won’t keep them safe.” —The General My air-conditioned taxi drives me through the outskirts of the city. I gaze in comfort at the unfinished highways, the hollow skeletons of skyscrapers looming over them as a reminder of the economic fallout—a city in perpetual suspension. But once at the centre, this city is impeccable—polished and shiny, no sign of poverty or suffering anywhere. It makes one think of the new regime’s necessity, its efficiency. A good alternative to the chaos and agony that came before. Only the smog weighs on us, like a bad omen.  As soon as I step out of the vehicle, I realize this is the hottest and most humid part of the day; the smog is so thick I can hardly breathe or make out any sky. My local liaison is meeting me in front of the city pillar, the geographical and spiritual centre of the city, from where everything extends outwards. I find out that the Massacre Market is tucked away at the heart of a crowded, semi-underground slum—the city’s last. We have to get there on foot. It will be a difficult journey.  When we arrive, hot and breathless, I am greeted by what my liaison describes as “The Political Cadaver of this country”: the dead body politic, the regime’s atrocities mechanically reproduced and exchanged in a gamble with the spirits of the dead, a funerary protest. The place is crowded and dark and putrid; the stalls exhibit small mountains of body parts and corpses—some fake, some real (and I can’t tell which is which)—the brownish hue of decay accentuated by the bright orange robes of the monks and nuns that frequent the place, looking for visual aids to their death meditations. Tall cork-lined walls are covered by the forbidden pictures of the massacred and those brutalized by police. Relatives petrified in front of them, looking for the familiar face among the myriads, looking but not wanting to find I’m sure, or making small shrines with offerings for the disappeared; while protestors and instigators pick out the most shocking ones to circulate and share, to dub as the hidden reality of the regime, its true face the face of those it murdered. In the loudspeakers, recordings of the massacre’s soundscape: screams and bullets, the sound of revolting children and of a state devouring its young.  I spot a mother clinging to the image of her dead boy, his face proliferated ad infinitum, plastering an entire wall, in protest.  Here, at Massacre Market, death is a political act. [Note to self: People need the historical and political background of the story to make sense of any of these. Start with an interview instead? Also, explain Death Meditation.] >>>END OF FILE  The First Death Meditation  Death is certain.  There is no way to escape death.  We start dying the moment we are born.  The body is a husk, a shell, an overcoat. It must be left behind.  Imagine you are performing a vivisection on yourself.  Imagine every detail.  Concentrate on the repulsiveness of the human body.  The corpse, swollen and bruised.  The skin, peeled back.  The fat, removed.  The muscle, shredded.  The organs, shrivelled and gone.  The bones, pulverized.  The corpse, festering. The corpse, fissured. The corpse, gnawed. The corpse, dismembered, fragmented, scattered. The corpse, bleeding. The corpse, eaten by maggots and gone.  You remain.  >>>END OF FILE  Interview with X, one of the leading protestors at the November Massacre  Part I [PLX1.vf] Q: What is Massacre Market?  A: Images of death, disease, and violence are forbidden by the regime; they are not good for foreign affairs, for the economy, won’t bring in investments. So now there’s a black market for that. It’s not about money, though. We believe in an exchange of gifts with and for the dead. At the same time, it’s a political thing. Because the government and the military want to hide the dead, when we photograph them and share their pictures, when we circulate footage of the massacres, we are exposing the true face of the regime. It’s a form of protest.  Q: A protest against what?  A: Against the regime’s suppression of the fundamental truths of life and death. Of poverty and suffering. Against the state’s cover-ups of its core practices, the terrorizing and massacre of its own citizens when they dare to speak out or deviate in any way.  Q: Then how does Massacre Market survive? How come they haven’t shut it down yet?  A: They have tried; they do raid it from time to time, but it pops up again after a while. Some people believe it is allowed to exist, or even that it has been set up by the government, as a safety valve, you know? To serve as an illusion of resistance.  Q: Do you believe that?  A: I do not.  Q: Can you talk about the November Massacre? I know this is the most recent one, but there have been others.  A: Yes, that is correct. [He hesitates.] Q: Can you recount the day of the Massacre?  A: [Pause] In the morning, the General was scheduled to appear at the city centre, very near the University. Attendance was, of course, mandatory, for students and first class citizens alike. So everyone gathered as planned. The General delivered the formal greeting and raised his arms in the usual salutation. The masses cheered, as expected, as they should. They couldn’t do otherwise, you understand. But then, then, they kept on cheering. And clapping. Just cheering and clapping as loud as they could, whistling and cheering, and waving. And they wouldn’t stop. After a few minutes, it became evident that this was no enthusiasm. It was super-conformity, you see? By cheering, they did not allow the General to speak. He literally couldn’t get a word in. But what could he do? We were only applauding, he couldn’t possibly punish us for that. So he mumbled the end of the speech he never managed to actually deliver, got off the podium and went back to wherever it is the General goes back to. And then the crowd was allowed to disperse, but the students and some others lingered. They were still not allowing themselves to talk, but they were smiling. They were shaking hands, not yet daring to speak about change, but that feeling, you know? That feeling, it was there. I felt it.  But then the trucks and the tanks appeared and sealed off the main square around the city pillar with the students still in it. We were surrounded before we realized what was going on. Some of us managed to slip through and save ourselves. Some holed themselves up inside the Polytechnic School at the University. They got them, though, eventually. They got them all.  Q: What did they do to them?  A: Why are you asking? You know very well what they did to them. You’ve seen the pictures, no? [Kneeling under the sun, hands tied, some behind their backs, some in front of their chests, beaten with steel batons and shiny black boots. Taken with a fisheye lens, they look like a human ocean. Innumerable, uncountable, and unaccounted for.] You’ve seen the footage. [Herded onto cattle-trucks by the back of their necks. Taken to that off-camera place from where no-one returns.] At four o’clock, it rained. The streets turned red. [Pause] Of this, we will not speak. [He takes a moment to find his bearings, he seems truly emotional. Then he adds:] They even destroyed several androids—most of them sex workers and cleaners—and later reimbursed their owners. I should say “bribed,” to keep them from making a fuss. Q: You said androids? Why were they there? Were androids part of the protest?  A: Yes, android guerillas have always been on our side, and uni students are often particularly drawn to them. There are several reasons for this. On the one hand, androids are part of the oppressed. They are low class, second rate, not even citizens. Most people don’t even consider them persons. But there is also something about them that speaks of truth, not least their perfect, infallible memories. It’s the human machine’s trap: the freedoms afforded to them by what little flesh they possess and command, the failings of that same flesh . . . these are not so easy to tell apart. They do not decay, too, while our whole culture is premised on decay and death, or, now, on its concealment. Why do you think people are so crazy about those nacre patches? You’ve seen the ones? [Note to Self: Transcribe the rest of the interview from voice file PLX2.vf] >>>END OF FILE  Fieldnotes #2  Getting people to talk is difficult. Brigitte and Dick work hard to find me the right contacts. But it takes time, and I know so little. I understand so little. This investigation is going to be long. We need to be discreet.  I often sit and watch Brigitte when she thinks I’m in my head, working, not paying attention to her.  She seems restless in her own skin, walking from the door to the window and back again. She stares outside at the smog—you can’t see anything out the window, just grey and brown. Well, at least I can’t. Maybe she can see something, maybe she can see everything. I don’t know.  Her nacre has been multiplying the past few weeks. There is a new patch behind her left ear, and one on the back of her right hand—her most prominent still. It makes her look adorned.  When she catches me looking at her, the programming kicks in and she responds with her standard line, every time: “What can I do for you, honey?” Then she lowers her eyes and looks embarrassed.  She’s always lived here, and yet I can detect a faint French accent when she says this. Like some guy’s fantasy of what a French whore should sound like.  >>>END OF FILE  Some notes on the translation of Massacre Market  There is some uncertainty about the translation from the local language of what I have called “Massacre Market.” Other possible translations include “Atrocity Place,” “Massacre Fair,” or, and that was the most confusing aspect of this, “Pearl Fountain,” because even though each of the two words means something different, together they create a new compound which, as Dick and Brigitte explained to me, could rather clumsily be interpreted as “a fountain whence pearls flow,” “the breeding ground of oysters,” or even “the plane of sublime imperfections.”  >>>END OF FILE  Fieldnotes #3  Dick has started being rougher in his re-enactments; I doubt these are memories, no, I’m sure they are not, because these versions are conflicting and contradictory, and things happen that I know never really happened. Brigitte/Sandra is not always the one leaving him any more—sometimes he leaves her, sometimes she dies. Sometimes he kills her, chokes her. Or, he pretends to. He acts disinterested afterwards, says these are only stories he makes up and likes to play out; but I know, any reporter knows there are no disinterested stories, least of all the ones we tell ourselves.  Brigitte says she doesn’t mind, she doesn’t feel, remember? It’s her job, she says. I’m still not convinced. I find myself in my reporter’s role nonetheless, taking everything in, observing, reluctant to participate. This is not how the game is played, I tell myself.  I watch the nacre spread on her skin, covering more and more each day, like a disease of unbearable beauty.  “How did you end up in this mess, anyway?” Dick asked me yesterday. “I never thought they’d send a woman.”  I hit him hard on the arm and he laughed. “I choose not to be insulted,” I said. “Anyway, I needed this. Badly. Went through a rough patch a while back and was out of circulation for some time. So when I went back to my boss and begged, he gave me the case nobody else would take.”  Dick stopped fiddling with his cigarettes and turned to me. I had his full attention now, and I wasn’t sure I wanted it. I shouldn’t have said anything.  “Rough? How rough?” he asked.  I said nothing.  “You know you can talk to me, right?”  I thought of his hands around Brigitte’s neck. What happened to you, Richard? You were a tender boy, back then.  “It’s been a while, Dick. I’m sorry.”  I think I hurt his feelings, but he tried not to show it. And at that moment I realized I didn’t mind. Hurting him. I didn’t mind at all.  >>>END OF FILE  The Second Death Meditation  The second meditation rehearses the actual death process.  Engage now in this series of yogas, modelled on death.  First, the body becomes very thin, the limbs barely held together. You will feel that the body is sinking into the earth. Your sight becomes blurry and obscured. You may see mirages. Do not believe them. The body loses its lustre.  Then, all the fluids in the body dry up. Saliva, sweat, urine, blood dry up. Feelings of pleasure and pain dry with them. You may feel like smoke.  Then, you can no longer hear. You cannot digest food or drink. You do not remember your name, or the names of the ones you knew and loved. You cannot smell. You may not be able to inhale, but you will be able to exhale.  Then, the ten winds of the body move to your heart. You will no longer inhale or exhale. You will not be able to taste. You will not care. The root of your tongue will turn blue. You may feel like a lamp about to go out.  Then, nothing.  Then, nothing.  Then, nothing. The ten winds dissolve. The indestructible drop at the heart is all that remains.  >>>END OF FILE  Fieldnotes #4  “Why do you let him treat you like that?” I ask her almost reflexively one day. I regret it right away. Am I blaming her for the way he treats her? Shouldn’t I be blaming him?  She thinks about it for a while, then shrugs.  “It’s my job,” she says. “I don’t have a choice. Some things are in my programming.”  “Yes, but some aren’t.”  She looks me in the eyes, fixes her gaze there, and she seems less human than ever before. People don’t look at others like that. “I’m a whore,” she states.  “You are more than a whore. It’s not who you are. It’s simply what you do.”  “See, you got it backwards. What we are for is who we are. A hammer is what a hammer does. Would you ever use a hammer to screw a screw or cut a piece of wood?”  “Just a tool, then.”  “That’s right. Just a tool.”  “Doesn’t my saying that offend you?”  “Do you think it should?”  I don’t say anything.  “Why?” she continues. “We are all tools for something. Aren’t you? It’s not an android thing. It’s an existential thing.”  I lower my eyes.  She leans over and touches my shoulder. “I’m sorry,” she says. “Sometimes empathy is difficult for me. We don’t feel anything, you know. No feelings.”  She seems sincere, but I don’t believe her; I tell her so. “Some people say the nacre is a byproduct of the things you do feel that were not programmed. Just like the nacre wasn’t, and yet, there it is.”  She shrugs again. “My programming allows me to imitate feeling and to learn from other people’s perceptions of me. No one knows what the nacre is, or what it does.” She pauses for a bit. Then she adds: “Perhaps it’s a form of rust. Tools do rust, don’t they?”  >>>END OF FILE  My trip  I’m sitting by the window, looking out. The smog seems heavier today. Darker, too. I think it’s the colour of rot. I wish I could see past it. I wish I could see.  Brigitte comes home—I notice there is a bright new patch of nacre under her right eye. She smiles, like she always does.  “Get dressed,” she says. “I need to show you something.”  When I’m ready to go, she holds out her hand closed in a fist. Slowly, she uncurls her fingers and reveals a pearl resting on her palm. It takes me a couple of seconds to realize what it is, and then I look at her, trying to figure out what she’s planning.  “Put this under your tongue, Aliki,” she says. “You’ll see. You’ll understand.”  I put the pearl into my mouth and we set out into the smog and that corpse of a city.  We are at the main square. The pearl is still dissolving under my tongue; it tastes sweet and tangy and makes my heart beat irregularly. I see the city pillar towering over us—round and bulging at the bottom, thinning as it reaches for the sky. The top disappears into the thick layers of smog above. Its marble surface emits a subdued light, like a fading beacon.  “It was built hundreds of years ago as a mystical axis around which the city would be born, you know,” Brigitte says. “The story of its construction is now largely ignored and forgotten, but spirit mediums still gather here sometimes. They consider it a source of power for those who commune with the dead. It is said that when the foundation for the pillar was laid, a fosse was dug around it. They brought every young pregnant slave girl they could find, slit their throats and threw them in there to die, and through their deaths empowered the pillar to protect the city.”  I look at the base of the pillar and realize I am standing on top of where the trench would have been, if that story were true. The pillar starts glowing brighter and brighter and I look up to see if the sun has somehow penetrated the smog. I feel the ground shake under my feet, then give, and I fall into the trench. The slave girls are there, all around me, with their blood still seeping into the earth, their fetuses still dying in their wombs.  This city is built on gore. The shiny marble, a tombstone laid over history. I see the streets turn into veins. I see students parade through the city with what corpses they could salvage; they carry them on their shoulders, their friends, their classmates, their lovers, displaying them like a mute witness to the regime’s moral order. And then these students are shot down or snatched off the streets, the corpses torn from their arms. They are strung on trees and shot, or burnt alive, or worse. Of this, we will not speak.  The body is nothing. Its image, everything.  Brigitte pulls me away. She leads me through the city’s red streets, the ten winds of its body dying down. I think Brigitte is speaking to me. I think she says:  “Let’s look for the indestructible drop at the heart.”  We are descending. She is walking in front of me, showing me the way. The nacre on her skin seems brighter than ever. I dare touch it for the first time—I reach out and brush my fingers against the back of her neck, tracing the nacre down her spine. I didn’t expect it to be so hard. “You are indestructible,” I mutter, or I think I do, and she turns around and smiles.  We are at Massacre Market. It has changed since the first time I saw it; it seems even more crowded now, the walls of photographs fuller, covered once, and then covered again by more pictures, and more on top of those, layer upon gory layer, corpse upon corpse, body part upon body part. The desiccated corpses seem more real now, almost alive, absurd. Brigitte tells me something I don’t hear; her voice drowns in the screams and static spilling from the loudspeakers.  One of the photographs on the wall next to me catches my eye. I walk closer—it’s grainy, black and white, but I can still see the girl: she is laid out in a field next to others, dozens of others. Her top is removed, her chest slashed open. “Foreign slut” is written on her bare belly. She looks like a younger version of myself. This is me, I think, this is me, years ago. Why don’t I remember this? I put my palm on the photograph—what did I want to do? Cover her up, I suppose—and I notice a patch of nacre spreading between my fingers. I pull my hand back as if the photo suddenly burnt me and I watch the nacre spread. I feel it cover my entire body, and I’m calcified, my skin adorned and indestructible. “I feel like an instrument,” I shout to Brigitte over the sound of massacre, “like an accordion, or a concertina.” Play me like a flute, O Lord, I think.  Brigitte tries to tell me something, but I can’t make it out. I struggle to read her lips. “ . . . it disappoints . . . ” I hear, but the rest is stifled by static, and she’s far away. I see her pointing at my arms from afar. I look down and see the nacre growing dull and flaking, then my skin peeling and falling off, the fat exposed, the muscle, the bone, and I know, I know then, this city is a skin, no blood anywhere in sight, all surface, all shine and the slightest glimpse of nacre here and there—is it real? Is it not? Does it make a difference?  >>>END OF FILE  False Endings  I have precious little time left. So I will not say much. One never has the skin that befits her.  I know I’ll never finish this article—I still haven’t even decided on the title, or what this story is really about. What do you think? I might have called it:  Massacre Market  or  The Mechanical Reproduction of Violence: Truth, Massacre, History  or even  Android Whores Can’t Cry: Under the Surface of Death Meditation  Either way, I know that, if I did finish it, I would dedicate it  “To my B., my pearl, who taught me this:  The skin always disappoints.”  >>>END OF FILE  >>>END OF RECORD. 14 OF 14 FILES RECOVERED.  This is all the material I managed to retrieve from Aliki’s hard drives. I wait for the reporter sitting across from me in Dick’s living room to go through them.  “You realize your memory files provide conflicting information about what happened to both my colleague Aliki Karyotakis and her informant Richard Phillips,” he says.  I am silent. Is that true?  I recall the last time I saw Aliki.  She is lurching at Dick, pushing him away from me during one of his violent playacts. He falls back and hits his head. He is very still. We are all very still.  She is also standing by the city pillar with me, in a crowd of people I haven’t quite registered. I look at the sky. The sun is shining through the smog. When I look down again, she’s gone.  She is also looking at me as a tall man leads her onto a platform and places a hood over her head. Then a noose. Then the platform gives.  She was also never here. I never met her.  And Dick? Dick is always either dead or missing.  “Have you tinkered with your memory?” the reporter asks.  “It is possible,” I say. “But I have no memory of that, as I am sure you are aware.”  “Of course.” He shuffles in his chair. “OK, let’s take the first version. Can you tell me what happened?”  He already knows this. Why does he ask?  “She pushed him. He died. Humans break easily like that.”  “And then?”  “She turned herself in.”  “Wasn’t she terminated?” That’s when I notice the nacre on his underarm. Ah.  “I think the human term is ‘sentenced to death and executed,’” I correct him. He should know this. I’m sure he does.  “Did you watch? The execution, I mean.”  I watch him. He is serious, eyes cold. A reporter reports.  “A hammer is what a hammer does,” I whisper.  “Excuse me?”  “Nothing,” I say. “A reflex. Yes. Yes, I think I watched.” I sense the nacre spread on my face, my surface irreparably hardened. It reflects the light so brightly it almost hurts my eyes.  “Are you going to cry?” he asks, hoping, I bet, for a good twist in his story.  The programming takes over, like gears shifting inside me, and I can’t stop it, I can’t stop it, I can’t.  “Android whores can’t cry,” I say. “Who wants to fuck a whiny bitch?”  This puzzles him. He focuses on my lips, and he’s about to say something, but he stops. I know he stops because of what he sees. He looks disappointed.  I feel the nacre cover my lips and I realize this was the last time I spoke. This shouldn’t be happening so fast. I think of freedoms and failings. I am not sure which is which. It doesn’t matter. I am the oyster and the pearl. I am a shell that doesn’t speak.  I wonder what really happened to her, what happened to Dick. I know I’ll never know—and this somehow strikes me as appropriate. The truth has seeped through the pores on the skin of the city. Aliki is in its bloodstream now. So is Dick. So is the core of this story.  I remain. Natalia Theodoridou is a media & cultural studies scholar, the winner of the 2018 World Fantasy Award for Short Fiction, and a Clarion West graduate (class of 2018). Natalia's stories have appeared in Strange Horizons, Uncanny, Beneath Ceaseless Skies, F&SF, Fireside, and elsewhere. Rent-a-Vice, a cyberpunk interactive noir published by Choice of Games, was a 2018 Nebula Award Finalist. For details, follow @natalia_theodor on Twitter.", "text": "5490 words, short story\nAndroid Whores Can't Cry\nFalse start #1\nMEETINGS AT MASSACRE MARKET\nby Aliki Karyotakis\nfor the London New Times\nI met Brigitte at what the locals call Massacre Market. She pronounced her name as if she were French—or I should say French-made, I guess, but I didn’t know that at the time. She was a working girl, owned by a guy named Jerome—also French, supposedly. She was waiting there for my local liaison and I, among desiccated corpses and stalls full of blown-up photos of the tortured and the dead. She kissed Dick on the lips when she saw us, before greeting me. She did it in a mechanical way, as if she were supposed to, as if she couldn’t do otherwise. That’s when I saw the long strip of nacre that ran down the back of her neck, along her spine, pure and magnificent. I shot Dick a questioning look.\n“Yeah yeah, it’s the real deal,” he said. “She’s my artificial girlfriend in this town. I’m renting her full time. Very useful. She knows people.” Dick could be snide like that. “I’m sure you girls will get along,” he added.\nBrigitte turned to me, holding out her hand. She gave me a warm smile, but I could tell that she, unlike Dick, was very well aware of where we were, of the transactable images of gore and violence that surrounded us. Of the history of this place.\n“Pleasure to meet you,” she said, a glint of something indecipherable in her eye. Was that an android thing? Or was that the part of her that is human?\nAndroids can usually pass, if they don’t have any visible nacre. But, of course, as soon as nacre appeared on android skin, people started wearing fake nacre patches as a fashion statement. When the patches are high quality you can’t really tell them apart.\nWhat was the nacre’s appeal? I suppose part of it is that we still don’t understand why or how it is formed. The other part is that it’s perfect, beautiful. And that it doesn’t perish.\nNacre is forever.[Note to self: You sound like an infatuated schoolgirl. What does Brigitte have to do with anything? Get it together. Just get the facts straight. Also, preserve both Dick’s and Brigitte’s anonymity.]\n>>>END OF FILE\nNacre: Formation and Function\nNacre, or “mother of pearl” is a composite material produced by certain molluscs as an inner shell lining and as the outer coating of pearls.1 Since the APC-VII2 finalized and started regulating the production of androids globally, nacre has been a standard feature of all artificially produced semi-mechanical humanoid organisms.3 The production of android nacre had not been foreseen and remains unexplained. However, android nacre is considered harmless, if not beneficial for humans as an identifying mark, and so no attempts to avoid its appearance on android skin have been made.\nNacre formation is an evolutionary conserved and multiply-convergent process among the Mollusca phylum, arising as early as the Ordovician period (488 to 443 million years ago). While the exact process of its production is little understood even in nature, the function of natural nacre is largely defensive: layers of nacre protect the soft tissues of the organism from parasites, while damaging debris can be entombed in successive layers of nacre, ultimately resulting in the formation of a pearl.\nThe function of android nacre remains unknown.\n1 - “Pearl” is also slang for a locally produced hallucinogenic that is sometimes used in meditation. Despite the name, the connection with either natural or android nacre has not been confirmed, largely due to lack of research.\n2 - APC: Android Production Committee.\n3 - These are commonly referred to as Androids, as this has been the popular term for many decades—however the universal applicability of the term has been questioned on various grounds. Still, other proposed terms, such as Gynoid and Cyborg, although more accurate in certain cases, are no longer in widespread use.\n>>>END OF FILE\nFieldnotes #1\nIt’s Dick’s afternoon playtime and he makes Brigitte re-enact scenes from his past while I try to work on my article. Playing in front of me is awkward, indiscrete. Vulgar, even. But I’m sure he does it on purpose—he wants me there. He wants me to witness this, and he knows I won’t interfere. He is the client: his game, his rules.\nBrigitte playacts Sandra, my college friend and Dick’s ex-wife. She kinda looks like her too. Now they’re acting out the night Sandra left him—left us. Dick is high on pearl. I can tell from that slightly unfocused look in his eyes. Like he sees things past Brigitte, past the windows and the smog, past the illusion of life.\n“I can’t be with you any more,” Brigitte says. It sounds like she’s said this line a hundred times already—a recitation. It seems she’s in learning mode for these sessions. Dick is shaping her into Sandra. I find this deeply disturbing. “You’re such a brute,” Brigitte recites. “Not sophisticated at all.”\n“That’s who I was when you married me. What was different then?”\nBrigitte pretends to put all of her clothes in a suitcase, preparing to leave. Dick follows her around, practically yelling in her ear.\n“I’ll tell you what was different,” Dick says, “you were a horny little cunt back then, weren’t you.”\nBrigitte stops packing and just stares at him.\n“You’re supposed to cry now,” Dick says, and then pretend-slaps his forehead. “But I forgot. You can’t cry, can you?” He turns to me. “Hey Aliki, did you know that? Android whores can’t cry. Because who wants to fuck a whiny bitch, right? Right?”\nI look at Brigitte. I think I see a twitch disfigure her lips for the tiniest of moments, but then she smiles. “Who wants to fuck a whiny bitch?” she repeats. Still in learning mode. Damn it.\n“You really are a dick sometimes, Richard,” I say.\nDick laughs. He comes over and hugs me.\nBrigitte keeps smiling, a twinkle in her eye.\n>>>END OF FILE\nNacre: Human Use\nHistorically, nacre has been prized for its iridescent appearance, while its strength and resilience has made it a suitable material for a variety of purposes. The nacreous shells of sea snails were used as gunpowder flasks in the 18th century and earlier. Nacre inlays have decorated some of the most renowned temples and palaces in Istanbul, traditional musical instruments in Greece, the keys of flutes, and the buttons of kings and queens the world over. Some accordion and concertina bodies are entirely inlaid with nacre. Little spoons made solely of nacre have been used to eat caviar in Russia, in order not to spoil the taste with metal.\nAll of these practices, although rarer, continue to this day. However, where natural nacre was used in the past, android nacre, the price of which is exorbitant due to the legal restrictions placed on its farming, is mostly used today.[Note to self: I wonder what it feels like for androids. Do they consider nacre to be a part of their skin? A part of who they are? What would it feel like to see your skin as decoration, a musical instrument, a spoon?]\n>>>END OF FILE\nFalse Start #2\nMASSACRE MARKET: A HISTORY OF VIOLENCE AND SILENCE\nby Aliki Karyotakis\nfor the London New Times\n“That great dust-heap called ‘history.’”\n—Augustine Birrell\n“Truth? I have no use for that. Truth won’t feed my people. It won’t cover their bodies. Won’t keep them safe.”\n—The General\nMy air-conditioned taxi drives me through the outskirts of the city. I gaze in comfort at the unfinished highways, the hollow skeletons of skyscrapers looming over them as a reminder of the economic fallout—a city in perpetual suspension. But once at the centre, this city is impeccable—polished and shiny, no sign of poverty or suffering anywhere. It makes one think of the new regime’s necessity, its efficiency. A good alternative to the chaos and agony that came before. Only the smog weighs on us, like a bad omen.\nAs soon as I step out of the vehicle, I realize this is the hottest and most humid part of the day; the smog is so thick I can hardly breathe or make out any sky. My local liaison is meeting me in front of the city pillar, the geographical and spiritual centre of the city, from where everything extends outwards. I find out that the Massacre Market is tucked away at the heart of a crowded, semi-underground slum—the city’s last. We have to get there on foot. It will be a difficult journey.\nWhen we arrive, hot and breathless, I am greeted by what my liaison describes as “The Political Cadaver of this country”: the dead body politic, the regime’s atrocities mechanically reproduced and exchanged in a gamble with the spirits of the dead, a funerary protest. The place is crowded and dark and putrid; the stalls exhibit small mountains of body parts and corpses—some fake, some real (and I can’t tell which is which)—the brownish hue of decay accentuated by the bright orange robes of the monks and nuns that frequent the place, looking for visual aids to their death meditations. Tall cork-lined walls are covered by the forbidden pictures of the massacred and those brutalized by police. Relatives petrified in front of them, looking for the familiar face among the myriads, looking but not wanting to find I’m sure, or making small shrines with offerings for the disappeared; while protestors and instigators pick out the most shocking ones to circulate and share, to dub as the hidden reality of the regime, its true face the face of those it murdered. In the loudspeakers, recordings of the massacre’s soundscape: screams and bullets, the sound of revolting children and of a state devouring its young.\nI spot a mother clinging to the image of her dead boy, his face proliferated ad infinitum, plastering an entire wall, in protest.\nHere, at Massacre Market, death is a political act.[Note to self: People need the historical and political background of the story to make sense of any of these. Start with an interview instead? Also, explain Death Meditation.]\n>>>END OF FILE\nThe First Death Meditation\nDeath is certain.\nThere is no way to escape death.\nWe start dying the moment we are born.\nThe body is a husk, a shell, an overcoat. It must be left behind.\nImagine you are performing a vivisection on yourself.\nImagine every detail.\nConcentrate on the repulsiveness of the human body.\nThe corpse, swollen and bruised.\nThe skin, peeled back.\nThe fat, removed.\nThe muscle, shredded.\nThe organs, shrivelled and gone.\nThe bones, pulverized.\nThe corpse, festering. The corpse, fissured. The corpse, gnawed. The corpse, dismembered, fragmented, scattered. The corpse, bleeding. The corpse, eaten by maggots and gone.\nYou remain.\n>>>END OF FILE\nInterview with X, one of the leading protestors at the November Massacre\nPart I [PLX1.vf]\nQ: What is Massacre Market?\nA: Images of death, disease, and violence are forbidden by the regime; they are not good for foreign affairs, for the economy, won’t bring in investments. So now there’s a black market for that. It’s not about money, though. We believe in an exchange of gifts with and for the dead. At the same time, it’s a political thing. Because the government and the military want to hide the dead, when we photograph them and share their pictures, when we circulate footage of the massacres, we are exposing the true face of the regime. It’s a form of protest.\nQ: A protest against what?\nA: Against the regime’s suppression of the fundamental truths of life and death. Of poverty and suffering. Against the state’s cover-ups of its core practices, the terrorizing and massacre of its own citizens when they dare to speak out or deviate in any way.\nQ: Then how does Massacre Market survive? How come they haven’t shut it down yet?\nA: They have tried; they do raid it from time to time, but it pops up again after a while. Some people believe it is allowed to exist, or even that it has been set up by the government, as a safety valve, you know? To serve as an illusion of resistance.\nQ: Do you believe that?\nA: I do not.\nQ: Can you talk about the November Massacre? I know this is the most recent one, but there have been others.\nA: Yes, that is correct.[He hesitates.]\nQ: Can you recount the day of the Massacre?\nA: [Pause] In the morning, the General was scheduled to appear at the city centre, very near the University. Attendance was, of course, mandatory, for students and first class citizens alike. So everyone gathered as planned. The General delivered the formal greeting and raised his arms in the usual salutation. The masses cheered, as expected, as they should. They couldn’t do otherwise, you understand. But then, then, they kept on cheering. And clapping. Just cheering and clapping as loud as they could, whistling and cheering, and waving. And they wouldn’t stop. After a few minutes, it became evident that this was no enthusiasm. It was super-conformity, you see? By cheering, they did not allow the General to speak. He literally couldn’t get a word in. But what could he do? We were only applauding, he couldn’t possibly punish us for that. So he mumbled the end of the speech he never managed to actually deliver, got off the podium and went back to wherever it is the General goes back to. And then the crowd was allowed to disperse, but the students and some others lingered. They were still not allowing themselves to talk, but they were smiling. They were shaking hands, not yet daring to speak about change, but that feeling, you know? That feeling, it was there. I felt it.\nBut then the trucks and the tanks appeared and sealed off the main square around the city pillar with the students still in it. We were surrounded before we realized what was going on. Some of us managed to slip through and save ourselves. Some holed themselves up inside the Polytechnic School at the University. They got them, though, eventually. They got them all.\nQ: What did they do to them?\nA: Why are you asking? You know very well what they did to them. You’ve seen the pictures, no? [Kneeling under the sun, hands tied, some behind their backs, some in front of their chests, beaten with steel batons and shiny black boots. Taken with a fisheye lens, they look like a human ocean. Innumerable, uncountable, and unaccounted for.] You’ve seen the footage. [Herded onto cattle-trucks by the back of their necks. Taken to that off-camera place from where no-one returns.] At four o’clock, it rained. The streets turned red.[Pause] Of this, we will not speak. [He takes a moment to find his bearings, he seems truly emotional. Then he adds:] They even destroyed several androids—most of them sex workers and cleaners—and later reimbursed their owners. I should say “bribed,” to keep them from making a fuss.\nQ: You said androids? Why were they there? Were androids part of the protest?\nA: Yes, android guerillas have always been on our side, and uni students are often particularly drawn to them. There are several reasons for this. On the one hand, androids are part of the oppressed. They are low class, second rate, not even citizens. Most people don’t even consider them persons. But there is also something about them that speaks of truth, not least their perfect, infallible memories. It’s the human machine’s trap: the freedoms afforded to them by what little flesh they possess and command, the failings of that same flesh . . . these are not so easy to tell apart. They do not decay, too, while our whole culture is premised on decay and death, or, now, on its concealment. Why do you think people are so crazy about those nacre patches? You’ve seen the ones?[Note to Self: Transcribe the rest of the interview from voice file PLX2.vf]\n>>>END OF FILE\nFieldnotes #2\nGetting people to talk is difficult. Brigitte and Dick work hard to find me the right contacts. But it takes time, and I know so little. I understand so little. This investigation is going to be long. We need to be discreet.\nI often sit and watch Brigitte when she thinks I’m in my head, working, not paying attention to her.\nShe seems restless in her own skin, walking from the door to the window and back again. She stares outside at the smog—you can’t see anything out the window, just grey and brown. Well, at least I can’t. Maybe she can see something, maybe she can see everything. I don’t know.\nHer nacre has been multiplying the past few weeks. There is a new patch behind her left ear, and one on the back of her right hand—her most prominent still. It makes her look adorned.\nWhen she catches me looking at her, the programming kicks in and she responds with her standard line, every time: “What can I do for you, honey?” Then she lowers her eyes and looks embarrassed.\nShe’s always lived here, and yet I can detect a faint French accent when she says this. Like some guy’s fantasy of what a French whore should sound like.\n>>>END OF FILE\nSome notes on the translation of Massacre Market\nThere is some uncertainty about the translation from the local language of what I have called “Massacre Market.” Other possible translations include “Atrocity Place,” “Massacre Fair,” or, and that was the most confusing aspect of this, “Pearl Fountain,” because even though each of the two words means something different, together they create a new compound which, as Dick and Brigitte explained to me, could rather clumsily be interpreted as “a fountain whence pearls flow,” “the breeding ground of oysters,” or even “the plane of sublime imperfections.”\n>>>END OF FILE\nFieldnotes #3\nDick has started being rougher in his re-enactments; I doubt these are memories, no, I’m sure they are not, because these versions are conflicting and contradictory, and things happen that I know never really happened. Brigitte/Sandra is not always the one leaving him any more—sometimes he leaves her, sometimes she dies. Sometimes he kills her, chokes her. Or, he pretends to. He acts disinterested afterwards, says these are only stories he makes up and likes to play out; but I know, any reporter knows there are no disinterested stories, least of all the ones we tell ourselves.\nBrigitte says she doesn’t mind, she doesn’t feel, remember? It’s her job, she says. I’m still not convinced. I find myself in my reporter’s role nonetheless, taking everything in, observing, reluctant to participate. This is not how the game is played, I tell myself.\nI watch the nacre spread on her skin, covering more and more each day, like a disease of unbearable beauty.\n“How did you end up in this mess, anyway?” Dick asked me yesterday. “I never thought they’d send a woman.”\nI hit him hard on the arm and he laughed. “I choose not to be insulted,” I said. “Anyway, I needed this. Badly. Went through a rough patch a while back and was out of circulation for some time. So when I went back to my boss and begged, he gave me the case nobody else would take.”\nDick stopped fiddling with his cigarettes and turned to me. I had his full attention now, and I wasn’t sure I wanted it. I shouldn’t have said anything.\n“Rough? How rough?” he asked.\nI said nothing.\n“You know you can talk to me, right?”\nI thought of his hands around Brigitte’s neck. What happened to you, Richard? You were a tender boy, back then.\n“It’s been a while, Dick. I’m sorry.”\nI think I hurt his feelings, but he tried not to show it. And at that moment I realized I didn’t mind. Hurting him. I didn’t mind at all.\n>>>END OF FILE\nThe Second Death Meditation\nThe second meditation rehearses the actual death process.\nEngage now in this series of yogas, modelled on death.\nFirst, the body becomes very thin, the limbs barely held together. You will feel that the body is sinking into the earth. Your sight becomes blurry and obscured. You may see mirages. Do not believe them. The body loses its lustre.\nThen, all the fluids in the body dry up. Saliva, sweat, urine, blood dry up. Feelings of pleasure and pain dry with them. You may feel like smoke.\nThen, you can no longer hear. You cannot digest food or drink. You do not remember your name, or the names of the ones you knew and loved. You cannot smell. You may not be able to inhale, but you will be able to exhale.\nThen, the ten winds of the body move to your heart. You will no longer inhale or exhale. You will not be able to taste. You will not care. The root of your tongue will turn blue. You may feel like a lamp about to go out.\nThen, nothing.\nThen, nothing.\nThen, nothing. The ten winds dissolve. The indestructible drop at the heart is all that remains.\n>>>END OF FILE\nFieldnotes #4\n“Why do you let him treat you like that?” I ask her almost reflexively one day. I regret it right away. Am I blaming her for the way he treats her? Shouldn’t I be blaming him?\nShe thinks about it for a while, then shrugs.\n“It’s my job,” she says. “I don’t have a choice. Some things are in my programming.”\n“Yes, but some aren’t.”\nShe looks me in the eyes, fixes her gaze there, and she seems less human than ever before. People don’t look at others like that. “I’m a whore,” she states.\n“You are more than a whore. It’s not who you are. It’s simply what you do.”\n“See, you got it backwards. What we are for is who we are. A hammer is what a hammer does. Would you ever use a hammer to screw a screw or cut a piece of wood?”\n“Just a tool, then.”\n“That’s right. Just a tool.”\n“Doesn’t my saying that offend you?”\n“Do you think it should?”\nI don’t say anything.\n“Why?” she continues. “We are all tools for something. Aren’t you? It’s not an android thing. It’s an existential thing.”\nI lower my eyes.\nShe leans over and touches my shoulder. “I’m sorry,” she says. “Sometimes empathy is difficult for me. We don’t feel anything, you know. No feelings.”\nShe seems sincere, but I don’t believe her; I tell her so. “Some people say the nacre is a byproduct of the things you do feel that were not programmed. Just like the nacre wasn’t, and yet, there it is.”\nShe shrugs again. “My programming allows me to imitate feeling and to learn from other people’s perceptions of me. No one knows what the nacre is, or what it does.” She pauses for a bit. Then she adds: “Perhaps it’s a form of rust. Tools do rust, don’t they?”\n>>>END OF FILE\nMy trip\nI’m sitting by the window, looking out. The smog seems heavier today. Darker, too. I think it’s the colour of rot. I wish I could see past it. I wish I could see.\nBrigitte comes home—I notice there is a bright new patch of nacre under her right eye. She smiles, like she always does.\n“Get dressed,” she says. “I need to show you something.”\nWhen I’m ready to go, she holds out her hand closed in a fist. Slowly, she uncurls her fingers and reveals a pearl resting on her palm. It takes me a couple of seconds to realize what it is, and then I look at her, trying to figure out what she’s planning.\n“Put this under your tongue, Aliki,” she says. “You’ll see. You’ll understand.”\nI put the pearl into my mouth and we set out into the smog and that corpse of a city.\nWe are at the main square. The pearl is still dissolving under my tongue; it tastes sweet and tangy and makes my heart beat irregularly. I see the city pillar towering over us—round and bulging at the bottom, thinning as it reaches for the sky. The top disappears into the thick layers of smog above. Its marble surface emits a subdued light, like a fading beacon.\n“It was built hundreds of years ago as a mystical axis around which the city would be born, you know,” Brigitte says. “The story of its construction is now largely ignored and forgotten, but spirit mediums still gather here sometimes. They consider it a source of power for those who commune with the dead. It is said that when the foundation for the pillar was laid, a fosse was dug around it. They brought every young pregnant slave girl they could find, slit their throats and threw them in there to die, and through their deaths empowered the pillar to protect the city.”\nI look at the base of the pillar and realize I am standing on top of where the trench would have been, if that story were true. The pillar starts glowing brighter and brighter and I look up to see if the sun has somehow penetrated the smog. I feel the ground shake under my feet, then give, and I fall into the trench. The slave girls are there, all around me, with their blood still seeping into the earth, their fetuses still dying in their wombs.\nThis city is built on gore. The shiny marble, a tombstone laid over history. I see the streets turn into veins. I see students parade through the city with what corpses they could salvage; they carry them on their shoulders, their friends, their classmates, their lovers, displaying them like a mute witness to the regime’s moral order. And then these students are shot down or snatched off the streets, the corpses torn from their arms. They are strung on trees and shot, or burnt alive, or worse. Of this, we will not speak.\nThe body is nothing. Its image, everything.\nBrigitte pulls me away. She leads me through the city’s red streets, the ten winds of its body dying down. I think Brigitte is speaking to me. I think she says:\n“Let’s look for the indestructible drop at the heart.”\nWe are descending. She is walking in front of me, showing me the way. The nacre on her skin seems brighter than ever. I dare touch it for the first time—I reach out and brush my fingers against the back of her neck, tracing the nacre down her spine. I didn’t expect it to be so hard. “You are indestructible,” I mutter, or I think I do, and she turns around and smiles.\nWe are at Massacre Market. It has changed since the first time I saw it; it seems even more crowded now, the walls of photographs fuller, covered once, and then covered again by more pictures, and more on top of those, layer upon gory layer, corpse upon corpse, body part upon body part. The desiccated corpses seem more real now, almost alive, absurd. Brigitte tells me something I don’t hear; her voice drowns in the screams and static spilling from the loudspeakers.\nOne of the photographs on the wall next to me catches my eye. I walk closer—it’s grainy, black and white, but I can still see the girl: she is laid out in a field next to others, dozens of others. Her top is removed, her chest slashed open. “Foreign slut” is written on her bare belly. She looks like a younger version of myself. This is me, I think, this is me, years ago. Why don’t I remember this? I put my palm on the photograph—what did I want to do? Cover her up, I suppose—and I notice a patch of nacre spreading between my fingers. I pull my hand back as if the photo suddenly burnt me and I watch the nacre spread. I feel it cover my entire body, and I’m calcified, my skin adorned and indestructible. “I feel like an instrument,” I shout to Brigitte over the sound of massacre, “like an accordion, or a concertina.” Play me like a flute, O Lord, I think.\nBrigitte tries to tell me something, but I can’t make it out. I struggle to read her lips. “ . . . it disappoints . . . ” I hear, but the rest is stifled by static, and she’s far away. I see her pointing at my arms from afar. I look down and see the nacre growing dull and flaking, then my skin peeling and falling off, the fat exposed, the muscle, the bone, and I know, I know then, this city is a skin, no blood anywhere in sight, all surface, all shine and the slightest glimpse of nacre here and there—is it real? Is it not? Does it make a difference?\n>>>END OF FILE\nFalse Endings\nI have precious little time left. So I will not say much. One never has the skin that befits her.\nI know I’ll never finish this article—I still haven’t even decided on the title, or what this story is really about. What do you think? I might have called it:\nMassacre Market\nor\nThe Mechanical Reproduction of Violence: Truth, Massacre, History\nor even\nAndroid Whores Can’t Cry: Under the Surface of Death Meditation\nEither way, I know that, if I did finish it, I would dedicate it\n“To my B., my pearl, who taught me this:\nThe skin always disappoints.”\n>>>END OF FILE\n>>>END OF RECORD. 14 OF 14 FILES RECOVERED.\nThis is all the material I managed to retrieve from Aliki’s hard drives. I wait for the reporter sitting across from me in Dick’s living room to go through them.\n“You realize your memory files provide conflicting information about what happened to both my colleague Aliki Karyotakis and her informant Richard Phillips,” he says.\nI am silent. Is that true?\nI recall the last time I saw Aliki.\nShe is lurching at Dick, pushing him away from me during one of his violent playacts. He falls back and hits his head. He is very still. We are all very still.\nShe is also standing by the city pillar with me, in a crowd of people I haven’t quite registered. I look at the sky. The sun is shining through the smog. When I look down again, she’s gone.\nShe is also looking at me as a tall man leads her onto a platform and places a hood over her head. Then a noose. Then the platform gives.\nShe was also never here. I never met her.\nAnd Dick? Dick is always either dead or missing.\n“Have you tinkered with your memory?” the reporter asks.\n“It is possible,” I say. “But I have no memory of that, as I am sure you are aware.”\n“Of course.” He shuffles in his chair. “OK, let’s take the first version. Can you tell me what happened?”\nHe already knows this. Why does he ask?\n“She pushed him. He died. Humans break easily like that.”\n“And then?”\n“She turned herself in.”\n“Wasn’t she terminated?” That’s when I notice the nacre on his underarm. Ah.\n“I think the human term is ‘sentenced to death and executed,’” I correct him. He should know this. I’m sure he does.\n“Did you watch? The execution, I mean.”\nI watch him. He is serious, eyes cold. A reporter reports.\n“A hammer is what a hammer does,” I whisper.\n“Excuse me?”\n“Nothing,” I say. “A reflex. Yes. Yes, I think I watched.” I sense the nacre spread on my face, my surface irreparably hardened. It reflects the light so brightly it almost hurts my eyes.\n“Are you going to cry?” he asks, hoping, I bet, for a good twist in his story.\nThe programming takes over, like gears shifting inside me, and I can’t stop it, I can’t stop it, I can’t.\n“Android whores can’t cry,” I say. “Who wants to fuck a whiny bitch?”\nThis puzzles him. He focuses on my lips, and he’s about to say something, but he stops. I know he stops because of what he sees. He looks disappointed.\nI feel the nacre cover my lips and I realize this was the last time I spoke. This shouldn’t be happening so fast. I think of freedoms and failings. I am not sure which is which. It doesn’t matter. I am the oyster and the pearl. I am a shell that doesn’t speak.\nI wonder what really happened to her, what happened to Dick. I know I’ll never know—and this somehow strikes me as appropriate. The truth has seeped through the pores on the skin of the city. Aliki is in its bloodstream now. So is Dick. So is the core of this story.\nI remain.\nNatalia Theodoridou is a media & cultural studies scholar, the winner of the 2018 World Fantasy Award for Short Fiction, and a Clarion West graduate (class of 2018). Natalia's stories have appeared in Strange Horizons, Uncanny, Beneath Ceaseless Skies, F&SF, Fireside, and elsewhere. Rent-a-Vice, a cyberpunk interactive noir published by Choice of Games, was a 2018 Nebula Award Finalist. For details, follow @natalia_theodor on Twitter.", "source": "https://clarkesworldmagazine.com/theodoridou_07_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Android Whores Can't Cry by Natalia Theodoridou"}