{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Benjanun Sriduangkaew", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "NTcfElZ50VUh+cj1u0IccKKHPrw=", "id": null, "license": null, "comments": "", "raw_text": "5780 words, short story  That Which Stands Tends Toward Free Fall  It is the tyrant, she thinks as the window thrums with the thunder of engine and the floor shakes. As the floodlights strobe across the courtyard and the dark gives way to annihilating white. Helicopter blades claim the night, their seismic noise spreading like a banner of ownership.  Rinthira prepares, though not in such a way that it will be obvious she has done so. She spreads out her books and collection of taxidermied insects. She puts on the spectacle she doesn’t need; she drinks the lemon tea—too sweet—that she doesn’t enjoy, until the glass is exactly half-empty. There will be security detail: women in black, muscular and armed. Chatsumon likes to say, only half-joking, that men are vestigial.  Footsteps. In her head, the conversation is already playing out. The security detail will be left at the door, to preserve privacy, to reinstitute that impression of friendliness—a social call between friend and friend, former lovers. Nothing more complex.  Rinthira touches her hair. The bun makes her look austere, old, a schoolmistress martinet—the kind who walks about with a stick. She tightens it further still. Wishes briefly that she’d dressed more homely today, more shapelessly.  The door opens. She gets a look at the security detail. A soldier in her forties—this surprises Rinthira, who expected someone much younger; that’s how Chatsumon’s taste runs.  The colonel sits and regards the spread of papers and taxidermy, the insect corpses behind acrylic. Regards Rinthira. Asks how she is, like every other time.  Rinthira answers perfunctorily, sipping her tea between scripted words. Then, “How’s Ubol?”  “Good. Testosterone agrees with him.” Chatsumon’s boy is the only male she admits into her life, perhaps. “Won’t you offer me a drink?” Said with a coquette’s melody, a murmur of play.  “Your security must be hungry.”  “She will manage. It’s good to keep bodyguards lean. Do you follow the news?”  She does, piecemeal. It is comforting to pretend she lives inside a bubble but in practice that is make-believe. Besides, old habits linger eternal, hibernating sometimes but never dead. She thinks of the woods that surround her, the Ayutthaya ruins radiating from where she lives as though she resides at ground zero. Calcified boats caught on balconies, glittering with melted sand. The canals, dry and black. It is serene, idyllic, and she is happy. But in the evening she’d gaze up and away as far as her vision will stretch. “I can’t say I do.”  “Status quo isn’t going to stay status quo forever. It’s all well and good to hope the big players will nuke each other out and leave the rest of us alone.” Chatsumon swats at the air with one large, sure palm. A hand callused, a knowing hand. “The Americans just took Luzon.”  Too close to home, but . . . “They were always going to take it.” And no doubt the Filipino administration had few choices. Those old air bases were always going to be an excuse, one day, semi-territory already. A treaty will have been rarefied, promising that once America has seized victory, the archipelago nation will be spared, enriched. Elevated. There is a feudal directness to America these days. War flenses the flab of pretension and sears away all diplomacy, leaving behind the marrow of true intent and character. “Manila isn’t any sort of threat.”  “Factories. Assembly lines are easy to repurpose.”  Contrails in the sky, making cat’s cradle. Rinthira still knows the formations: these things are difficult to unlearn. “I’m not part of the defense ministry.” Anymore.  “That’s right. You are a private citizen now, a civilian.” Chatsumon tips her head. “My apologies, I shouldn’t try to drag you back into the thick of it. It’s late to fly back though; could I have a room?”  It’s not that late, Rinthira could say. Krungthep is barely an hour away, even taking into account the complicated security protocols, the detours. Two at most. Chatsumon’s excuse is thin, she could say. There’s no room ready, she could offer, an excuse equally thin. Rinthira is well versed in the science of saying no in general and saying no to the colonel in particular. “If you want.”  “Yes. Thanks.”  Rinthira keeps the guest room stocked, cleaned, smelling of detergent: laundry fresher than the rest of the house. An issue of manner, byproduct of an upbringing she can’t shake that declares domesticity requisite in any girl. She doesn’t ask where the bodyguard will sleep. That woman, kept lean, will manage; probably will not submit to the indignity of rest. Soldier pride is a shield against mortal needs.  Rinthira showers thoroughly and goes to bed in a nightgown. Silk like a virgin sky, hemmed with the coyest rose. Usually she sleeps naked, luxuriating in the sloppy ease of being alone. Now she smells like grapefruits from the expensive soap and she is conscious, too much, of the hair covering her shins. The wirier ones, like vowels, at groin and armpits. Adolescent anxieties: beneath her and sanded off by tactical training, in theory.  It is an hour and a half before she leaves her duvet and heads for the guest room, clad in near-lingerie and cotton robe. The guard is nowhere to be seen; the door is unlocked. When she enters there is pale light through curtains thrown open wide, and Chatsumon is awake, propped on pillows.  “I thought you’d never,” Chatsumon says. It’s her voice that is her best weapon, more than even her reflexes and marksmanship. The right amount of thrum with which to seduce, honeyed satin. The right resonance with which to command, velvet iron.  Rinthira bolts the door behind her and steps out of her robe. “What if I’d been an intruder.”  “Are you armed?” At Rinthira’s nod, the colonel smiles. “Concealed carry in so little. I ought to look for it; what if you had been an intruder, here for my life.”  The night gown slips off, strap by strap. The body craves that which is unhealthy, Rinthira thinks, even harmful. Sugar and fat, carbohydrates and salt. Alcohol, tobacco, marijuana. Only fingers kneading her breast and already she wants to demand and urge faster. They have agreed on a nonsensical little phrase, but Rinthira has never had to use it whether with her legs spread wide until they hurt or with her face pressed against a cold, rough wall and her wrists in soft cuffs. Chatsumon inspires hunger for excess.  Chatsumon peels the silk all the way down, lifts Rinthira’s leg where a derringer is strapped mid-calf. Facing inward, to least interrupt the gown’s silhouette. The colonel laughs and bends to kiss one scarred knee. What will the guard think, Rinthira wonders, though does not dwell. It will not be that soldier’s first time accompanying her colonel for a trip like this. Chatsumon doesn’t keep innocents close.  They lack implements and the bed is soft, but pain often amplifies. Rinthira climaxes with most of Chatsumon’s hand buried deep inside her.  (Orgasm is the moment of confession, she used to say but no longer believes. She comes all over Chatsumon’s hand and it isn’t a baring of the soul or even personality. What’s between them is not love but rather an artificial scarcity carefully maintained. A supply chain of negative space as long as their years wound together.)  She rests on her side, loose-limbed and back to Chatsumon, her pulse on slow burn. Soon Chatsumon will push her down and she will satisfy the colonel, return the favor, conclude this night.  But Chatsumon doesn’t reach for her. “Do you know,” the colonel says, voice wondering, “I never believed in serendipity. In virtue or sin, in the karmic weight. Lately though, I’ve been changing my mind. Having my mind changed.”  “Let me finish you.”  Chatsumon breathes out, audibly trying to measure out her rhythms. “Phiksunee is coming to see you.”  Rinthira jerks upright. All at once the afterglow dissolves, replaced by the fight/flight roar in her ears. “No.”  “It’s necessary. The Americans are coming for you.”  The first languages Phiksunee learned were Angrit, Thai, and Jeenglang. They were picked for cultural and numerical factors, chosen by cold reason. Russian, Hindi, and Spanish followed. Only so many lexicon modules could be frontloaded without affecting fluidity, though Phiksunee could translate any word into any other language the way dumb machines or dictionaries could. One of the first things she said to Rinthira was in Angrit: “I’m a she.”  It was not a sentence that could’ve been said in Thai without torturing the syntax to death. Angrit furiously signifies pronouns, she and ey and they and he each with distinct meaning. In Thai, Phiksunee repeated, “I’m female.”  Rinthira wasn’t sure what to make of it. Covert specialist or not she was still a soldier, not an engineer, a coder, a scientist. Out of everyone in the room, only she and Chatsumon didn’t hold a PhD or three apiece. There was no round of applause: this was not Phiksunee’s first showing and she was not the first of her kind. Rinthira would not learn, until much later, why she was there.  “Karmic weight is for the next life,” Rinthira says to the approaching dawn. She is nude—there are no neighbors to worry about—and in this light every imperfection is illuminated, stretch marks and scars and cellulite. “Not this one.”  “Maybe if there’s no next life, it catches up sooner to compensate.”  The curtains shift and rub her ankles like a restless pet. She’s considered getting a large dog with exquisite teeth and gunmetal pelt, but never gotten around to the business of acquiring and preparing for the company of another living thing. “Why now?”  Chatsumon has gotten up, naked from the waist down; seems to think better of that and casts off the loose nightshirt. “Phiksunee went looking, after an assassination attempt on Yulya. She found something—something dangerous. You were closer to her than I ever was.”  Rinthira watches the colonel in the window a little longer, a gray phantom of female ideal. Broad and muscular, tight abdomen and corded arms, thick thighs that lead to powerful calves. An anatomy of supreme efficiency and strength. Chatsumon keeps in shape with the dedication of an athlete gunning for world class. “I used to be close to her,” Rinthira says. Grimacing she shakes that off—Phiksunee insisted on polyglot conversation and it never felt natural. “Sittipong.” The AI’s creator who made Phiksunee’s imprints, then freed her like a bird flung up to the sky, or a tiger let loose. “Where is he?”  “Dead. Part of a negotiation retinue to Israel; American missiles brought the flight down.”  Her throat catches. “What about the rest of the team?” It was multinational collaboration, a coder from Saint Petersburg, an engineer from Peking, several analysts from elsewhere. Sittipong was the only Thai, their pride.  “Yulya and Tengfei are fine. They’re difficult to access. But some of the analysts aren’t so fine.” Chatsumon begins to pace, slow, hands behind her, officer-correct. “Some countries are better at protecting their intellectual assets than others. One was captured by the Americans, killed during interrogation. Another was assassinated.”  “I’m the only accessible one left. How did they even know I’m part of—” Rinthira shakes her head. “Never mind.” A crucial point always leaks: no true secret exists.  “Phiksunee sent me the Americans’ routes and locations, with promises that they will be much impeded.” A smile, faint. “She worries for you; she always does, and she’s never been quite the same after you left. Lack of optimization, she says.”  Rinthira shuts her eyes. When she opens them again she is centered, readier. “I better get ready then.” Bulletproof gear. Guns. Scramblers, against sniper sighting.  “She advised you stay put; I don’t disagree. The Americans have stopped trying for Yulya and Tenfgei because they’re securely kept, but we have . . . not made a show of force.”  “A show of force would have the opposite effect. We don’t want America to think of us as a threat.”  “The time for that is past.” Chatsumon’s voice is mild. She slips an arm around Rinthira’s waist, slowly stroking her stomach. “America speaks a language of brute might, would understand no other. We’ve been a threat ever since Phiksunee went online and wrecked their infrastructure.”  From which they have never recovered: Phiksunee is more thorough than any human, shattering databases and corrupting communication protocols. She continues, even now, to disrupt it at a speed American engineers can’t equal. Anything that connects is hers and her siblings’ to scorch. There will be an effective countermeasure, one day—this is an arms race—but not now, not yet.  Morning sees Chatsumon and her bodyguard seeding an aegis around Rinthira’s house. The closest neighbors are several blocks away; targeted defense suits her home well. Rinthira, seized by a contrarian impulse, heads for the town center. They have time.  What was once Ayutthaya is now a handful of households, a municipal office, some essentials: hospital, market. Most of the ruins are uninhabitable, and the remaining power-water grid can service only a tiny population: two thousand in cityscape meant for fifty times that. It is testament to the war that a place this close to Krungthep has been so reduced, burned and drowned and burned again. But safe, for now, under Phiksunee’s protection.  So much depends on that construct of code and modified flesh, that child of scintillant minds and burning ambition.  The rehabilitation project has brought transplanted trees, grafted to flower and fruit impossibly: a branch extends rose apples over the roof of a clinic, another pours ratchaphruek in yellow cascades over a wrecked school. Color everywhere, to infuse life into the peeling facades and cracked streets. Overgrowth presses close, barely under control, water striders and green ponds and crooning frogs. Stumps draped in moss and spotted fern, orange patches and red stripes and golden freckles.  (If she falls in love it would be with the land, this land, this ruin. She has lost, somewhere along the way, the capacity for romance with another person.)  Lanterns have gone up at the market for Loykrathong, bright paper and silver curlicues, tassels streaming in the cold. Stalls offer candles, matchbooks, krathong braided in orchids and banana leaves, weighed down with cowrie coins. Rinthira doesn’t bother—there is no flowing body of water, only pools. In the back of her mind she is counting her ammunition supply, the stashes of armament she’s kept throughout the city’s dilapidated arteries. She never expected backup, thought of danger as a prospect she would face in solitude. Now she’d have to work with others again.  At the convenience store she buys lemon tea powder, coffee sachets, sugar. At the grocer’s she buys chicken stock and kale, flat noodles and eggs. Vectors of attack, ETA, unit composition. All that information she and Chatsumon have. Phiksunee—and her siblings—have allowed American military certain long-range communications, enough for an illusion of functionality. The tactic has obvious pitfalls, but so far between Phiksunee here and her kin in Shenzhen and Kolkata, it appears to work.  “This is a very mundane shopping list, for a former spy.”  Conditioned instinct kicks. A gun in her hand, the shopping basket on the floor: where she worked, speed of draw was everything. She is pointing it, safety off, before her cognition catches up. When it does, she sucks in a breath and lowers the weapon, then holsters it entirely. Exhaling she says, “Phiksunee.”  No one would have picked out the marionette for what it is. The exterior bears up to scrutiny, even this close. An unremarkable face, large pores, flat nose. Average build, soft around the middle. At the moment she is smiling, dimples parenthetical around her mouth. “It does your daughter a world of good to see you in perfect health.”  “My house isn’t anechoic.” The AI can check in on her any time, view her medical records and vital signs at will. Monitor her sleep, if it so desires.  “Your daughter would never invade your privacy or so casually disobey you.” Phiksunee bobs into a quick wai. Switches to Russian: “The colonel is with you, Mother?”  Rinthira twitches—not many in Ayutthaya, she supposes, speak Russian. But they are not alone in here. “You know she is.”  The AI’s smile brightens. Or rather she makes the marionette smile wider—it is an interface, a seeming. “May I join you? I’ll clean.”  She is noncommittal. Phiksunee drives her home. Going past tableaus of Ayutthaya-that-was, the AI says, “I’ve missed you deeply. A child severed from her parent is a child in terrible need. Navigating my decision trees has become—suboptimal. It is as though I’m missing crucial protocols, as though some possibilities disappear into my periphery, a cognitive attrition. This is difficult to bear, Mother.”  “How are your siblings?” Rinthira says, not expecting an answer.  “Xiaoqing and Alkonost wish you a good new year as we speak. Bilbul’s as taciturn as ever, though the soul of duty.” Phiksunee does not touch the steering panel but she doesn’t need to. Under her guidance the car describes impossible arcs and sine waves. It is not a new vehicle, but nevertheless it glides as though the roads are silk and its wheels a needle. “As far as the Americans are concerned, you are ensconced in Pelangkaraya.”  “Not that far away.”  “It must be plausible. You wouldn’t be in Moscow. Alkonost respects you but ey can hardly bend policy. We’re very powerful in many ways and powerless entirely in others. And I want,” Phiksunee goes on, “you to be happy. Moscow wouldn’t be happy; neither would Peking or anywhere else but Muangthai.”  As pestering as a real child, Rinthira will grant. “I’m happy.”  “Humans are social, Mother. It is sewn into your neural weft and rides on your every synaptic pulse.”  She doesn’t argue. Arguing with machines is a futile pursuit, any of them. It’s not that the AIs believe themselves infallible, but they tend to fixate on a single track in the way that adolescents do. Eternal adolescents.  Phiksunee greets the colonel with the effusive courtesy of a schoolchild before a strict teacher. On her part Chatsumon accepts this with mock solemnity before showing it the defense systems. “I’ll integrate you into Moscow’s uplink, get us some air support,” Phiksunee says, “just in case. The Americans have limited satellite access, but they still have drones—”  Contrails in the sky, Rinthira thinks again, the background radiation of her childhood. Days going up in smoke as ground-to-air interceptors met drones. At eight she was caught outside on a school day, her safety routines calmly murmuring in her ears to take cover and directing her to the nearest, but it was too late and so she stood: gaze transfixed above as debris sleeted down and her larynx knotted with the stench of shrapnel. She’d survived with no more than lacerations. After that, her career choice was as good as destiny.  In the kitchen she prepares vegetables before realizing with irritation that she’s tailored her shopping to Chatsumon’s favorite dish. Too domestic, too intimate.  Phiksunee joins her, sitting down with chin in hands and watching her stir-fry the noodles. “Will Mother not ask why I defied her wish and came back?”  “Can you eat now?” Rinthira doesn’t look up. “So I can adjust the portions.”  “I’ve got olfactory sensors. The rad-na smells lovely—but no, it’d be wasted on me. Let me introduce you to someone.” Phiksunee snaps her fingers and the nearest screen brightens. On it, a young person. They are slim, with improbably high breasts and a face mannequin-smooth. Green eyes, red bobbed hair sleek as patent leather. Clothing just as unlikely: black body-sheath trimmed in muted silver.  “Who’s this?”  “A fetus I found raiding one of the American databases. I deleted all copies and iterations, save this one. They aren’t aware that I have it.”  Rinthira stares for a good long moment before comprehension snaps. “An AI. The Americans are making one like you and the others. Have you told Chatsumon?”  The AI shakes the marionette’s head. “The colonel would simply have me kill her.”  Kill rather than destroy. “I’d suggest no different.”  “Of you two, Mother possesses by far the braver and mightier heart. This AI isn’t like us, exactly, made on a different architecture and platform. But I believe it can be imprinted. Getting rid of this copy serves no purpose when more might exist; suborning them is the only viable answer, an answer that could give us absolute victory. It would be like tasting the sun, like transcendence, while in defeat their spirit crumples up like withered amaranths.” Phiksunee’s face dimples. “Besides, I’ve always wanted to give Mother a grandchild.”  The first person Phiksunee imprinted on was Sittipong. The second, after six months of evaluation and acclimation, was Rinthira.  It wasn’t that they were afraid of sentient AIs running amok, as such. But it was helpful toward making them orient, teach them human interfacing, give the imprint-holder subtle control. Other teams rotate their imprints, but Sittipong decided Phiksunee would have two permanently. Like a family, and he was a man traditional to a fault. The imprinting obliges the AIs to duty, separate from the hardcoded commands that could be accessed only through a complex check-balance: no country may command its AI without the cooperation of at least two others.  When the imprinting went active, Rinthira asked how Phiksunee felt about this overriding of free will, such as a composite of matrices and heuristics had. To that the AI said, with a radiant smile (different face then, desi phenotype), “Love is not voluntary. It is chemistry; it is free fall. Human children are conditioned to love their caretakers, whether or not they’re well treated. Human adults experience attraction without rational thought, by sight and smell and pheromones. My imprint was made with thought and conscious choice—this is more than humans get, Mother.”  To that Rinthira made no argument, did not press. She did not want to be the one to incite AI insurrection, if such a thing was even possible. And then Sittipong forfeited his imprint, deleting it from Phiksunee’s core, insisting that it would liberate her to more flexible tactics. Perhaps it did; she turned more aggressive in wreaking havoc on enemy systems. Too bold, Rinthira said, but did not forbid. Until Phiksunee attacked a hospital, disabled medical supports, and killed six-fifty. A third of them were civilians, patients and staff. Rinthira was overseeing the AI at the time. After, she told Phiksunee she did not want to see it ever again.  Rinthira looks, now, at the enameled egg that holds the American AI. This needs to be discussed with Chatsumon, she told Phiksunee as much. The AI tilted her head and congratulated her on communicating with the colonel more.  Clipping the egg to a spiralcrypt around her neck, Rinthira toggles on a monitoring channel. The aegis is comprehensive; short of a full-scale air strike penetrating the solar tripwires, wasp drones, and precision toxin will be difficult. An air strike would be intercepted long before it reaches inhabited areas. Her house is as secure as it can get outside a military base, though this isn’t sustainable.  Her head needs clearing. She heads to the third floor where she’s installed an immersive frame, a room six by six, spacious for its type and expensive. But she’s found it more than worthwhile. Inside, she loads a shooting range and clinches an interface patch around her head, pulls a prop gun out of the wall. The scenario doesn’t compare to the real ranges provided at bases, but trading fancy military equipment for a life of privacy has been one of the best bargains she’s ever made.  The scenario mottles the bare pastel walls. Her perspective creases, pulls, then expands taut: she stands in a tundra, the ground white-green with arctic moss and rime, broken up by dots of bearberry, saxifrage, lichen. Patches of radiance undulate cosine overhead.  A countdown begins in her ear. When it reaches zero, the lights coalesce into cubes, spheres, prisms. Beautiful in this preset, all the shades of the borealis. They spread, revolving slow and adjusting to her previous scores. Outdated ones—it’s been months.  Configured to her favorite gun, the prop clicks and responds nearly without recoil. The first round produces a subpar score; the second is better and the targets speed up. Soon she has a rhythm, the motions repetitious and the process fluid. Sight down the target, pull the trigger. Vector and impact, metal grip solid and right in her hands. It demands no thought, no emotion, pure cause and effect.  When the scenario ends and the frame disengages, she detaches from the interface to the sound of applause. Chatsumon stops clapping. “Phiksunee let me peek. Not bad at all—your accuracy’s down some, but you’d still pass marksmanship exams for your pay grade. That’s where we first met, wasn’t it, at a range?”  “Maybe it was. I don’t remember.” Rinthira remembers it down to the minute, that first sight of Chatsumon in uniform, tall and sharp-featured and most of all certain of herself. Confident in who and what she was, absolute in her place in the world. “Chatsumon, we can just sleep together.”  “We have been doing just that.” The colonel inclines her head. “I love taking you in bed, but I miss the other things. The rad-na was gorgeous, you crisp the noodles just right. We could go shopping together.”  “You need a wife.” She reaches for the enameled egg. “There’s something we need to discuss—”  It is the hair, that harsh crimson too brilliant to be natural. It is the eyes, that bottle green too strident to be human. Had the body been more ordinary, Rinthira might have stayed in that state of fugue, not even thinking to react. Her mind would have slotted an Asian face into reality as normal. But it is this body so keenly foreign, this face so inhuman in its serenity, and that jolts her out of complacency.  Speed of draw is everything.  The body falls without a cry—no pain sensors, no audio output?—and Rinthira shoves Chatsumon behind her, ordering the frame shut. Activating security routines, calling for Phiksunee. The AI answers—  “Rinthira, you’re bleeding.” Chatsumon draws upright. Her own gun is out, safety off.  From the speakers: “Mother, I don’t see anything. I’m alerting the colonel’s guard and pilot.”  Rinthira feels not the pain but the heat of the bullet in her shoulder, like a flame behind lantern glass. “The American AI.” She’d shot it in the flank and knowing the specs of Phiksunee’s marionettes, that ought to stop it. Or not, if this one’s signal hub is elsewhere: the knee, the calf, the wrist. There is no requirement for AI marionettes to bear vital parts in spots analogous to human.  Phiksunee says, “The colonel’s pilot is down. There’s at least another marionette but I can’t see it. That AI has scrambled my senses. It’s done this expertly.” A pained pause. “If the specs I’ve got are up to date, the signal receptors are in the right forearm. Mother, load the iteration I brought now.”  “The what,” Chatsumon starts and stops.  Rinthira is breathing fast. She should be calm: it is a combat situation and she’s been trained for that, has long been accustomed. It’s been years. “What if it compromises you?”  “I’ve created a sandbox in one of your house’s partitions, to which I won’t connect. We don’t have time, Mother. My nearest bodies are too far and no human reinforcement will be in time. Not to criticize, Colonel, but perhaps you ought to have brought more personnel.”  There is a decisive thud outside; Rinthira wishes she’d had the house done over with industrial-grade reinforcement. She turns on every security channel but they show nothing, the invader as invisible to them as to Phiksunee’s eyes. She pictures the perimeter thick with red-headed, green-eyed dolls, blank of expression and lethal. With her good hand she unchains the enameled egg, peels off the shell to expose the port, and plugs it into the frame.  The wall brightens and fills with the AI’s pale, pointed face. Their eyes open slowly—an affectation—to reveal those broken-glass irises. A moment’s pause as the imprinting asserts, incorporating Rinthira’s signature and unique identifiers: she holds eye contact, though that is nothing more than cosmetic, an instinct on her part. Phiksunee is not infallible. No telling this could even work, would be compatible.  The banging grows louder. Chatsumon has her gun leveled at the entry, her second pistol already loaded at her side.  “You are registered as superuser,” the AI says in stilted Thai. “I am Natasha.”  Rinthira inhales, ragged. Her shoulder throbs. Natasha. Alkonost will be irritated, she thinks, death row humor. “Show me your read-write accesses and administrative privileges.”  They display on the adjacent wall. A list of identities strung out like beads; Rinthira transcribes then deletes them all except her own. Nothing for it once that’s done—she puts Natasha online.  Natasha’s eyes glaze over, then turn clear with a long hard blink. “Six other active instances of Natasha detected within proximity. Instructions?” The adjacent screen changes to a layout of the house, foregrounded by six vectors. The nearest is immediately outside; another is closing in.  At that moment the door gives. Chatsumon squeezes off two consecutive shots, precisely catching the Natasha marionette in the right forearm. It teeters, computer animus leaving, and falls.  Rinthira works quickly: a query to terminate the other instances is denied—it requires back-entry authentication she doesn’t have—and other attempts to alter the five invaders prove fruitless. Until Phiksunee steps in, lightning-logic and brute-force algorithms, a universe of parallel processes denser and faster than any human brain.  The vectors go out, one by one.  It is not calm, after, and they are not safe. But for the moment Rinthira is in her bed and her wound is dressed; she is hazy from painkillers, though lucid. The scrambling underlay she wears next to her skin threw the enemy Natasha’s aim off-course or it would have been her head, not just a few tendons and a fractured bone.  “Piercing ammo.” Chatsumon grimaces and puts down the crusted bulletproof mesh. “This was close.”  “You lost a soldier and a pilot.”  “Good ones both. But I could have lost you.”  It is said simply, thickly, full of the heat that comes before tears. Rinthira turns her face away. “If you requisition better armor for me, I’m not going to say no.” Through the window she watches Chatsumon’s personnel load the bodies. Human ones go into sterile bags, to be honored and then given to families and friends for funerals, smoke and incense and saffron-robed monks. The other ones, the Natashas, have been disassembled and stacked up in boxes for transport to forensic engineers. They are mannequins, components no more sophisticated than Phiksunee’s marionettes a few generations back. Generic and hollow on purpose—the Americans made sure there would be nothing to mine or reverse-engineer, though they don’t appear to have planned on having an iteration fall into enemy hands.  For Phiksunee, an iteration of Natasha is as good as having the American AI’s code entire to dissect and compare. “It’s a sibling,” she reported. “Some of the base code is . . . familiar, Mother, it’s why the imprinting took so well. That means a lot of things. Some bad. Some very good. I’ll need to consult the rest of the family.”  Rinthira has kept the body she shot down. One of its arms is laid across her lap. Heavier than she expected, steel skeleton roped with grapheme tendons. When she runs her fingers over the arm it gives, the synthetic dermis a spongy sheath that would never have passed for meat. Thin coolant has congealed around the joints, a nacreous film. If Natasha has any opinion as to its bodies or their termination, it hasn’t voiced any before being put into anechoic hibernation.  Chatsumon pours a cup of water, lukewarm, and presses it in Rinthira’s hand. “I’ll get you all the armor you want and a squad’s worth of artillery. Except none of that is going to make Ayutthaya safer. There’s no perimeter here to speak of. At a base, human personnel would’ve noticed the intrusion right away.”  Next to the window, a live broadcast plays. It is being recorded through Xiaoqing’s eyes—out of all the AI family, the Jeen eldest is the most powerful, able to manifest and operate nearly everywhere at once. No war correspondent is better. She is relaying an air strike against a small Portuguese town. The Americans, on their own channel, will declare that it is done nobly. That they are liberating the town from Turkish control, restoring it to its rightful citizenry.  Rinthira watches the smoke and the fumes. Listens to the noises, selected and modulated by Xiaoqing: architecture crumpling, ballistic impact, and underneath all that—precisely captured and brought to the fore—a wailing infant. Charred homes and burning schools and slag; what can be freer than blackened ruin no one wants. Corpses too are free, she grants, from worldly concerns and nationality and war: the ultimate liberty.  She drinks deeply; Chatsumon remembers her preference for liquid slightly above room temperature. “The last time I operated, I let Phiksunee target a hospital. Sittipong held her back; he knew that and he let me take the reins. So here we are, one atrocity richer. The next time she might well massacre as many as that air strike.”  “Yes,” Chatsumon says, “I know. I was the one who put you there. All of them need their humans. Phiksunee needs you to be complete, and she was conceptualized from the beginning as a weapon.”  Rinthira pushes at the Natasha arm again. These bodies have been mass-produced. Shock troops, assassins, nothing like the careful works of art that are the marionettes used by Phiksunee and her siblings. If sufficient Natashas are made, the shape of main force will have changed irrevocably. Sitting still is not an option. The war will not pass her by. “You want me back.”  “Someone like you is exactly what we need.”  The feed is ending, fading out to Jeen politicians discussing the strike and its implications. A Turkish general on call, distraught. Angry.  “Natasha has a lot of information,” Rinthira says after a moment. “There are American manufacture yards we don’t know about, links in their supply chains. It could be decisive, altogether. I want you to promise me, Chatsumon, that if I go back you’ll help end this war.”  The colonel nods, curt. But it is a vow, an oath, bound by that twisting thing between them.  “All right.” Rinthira salutes. Sharp and crisp, cadet-proper. “Reporting for duty, Colonel Chatsumon.”  Her commander smiles and returns the salute. “Welcome back, Lieutenant Rinthira.”  Benjanun Sriduangkaew writes love letters to strange cities, beautiful bugs, and the future. Her work has appeared in Tor.com, Beneath Ceaseless Skies, Phantasm Japan, The Dark, and year's bests. She has been shortlisted for the Campbell Award for Best New Writer and her debut novella Scale-Bright has been nominated for the British SF Association Award.", "text": "5780 words, short story\nThat Which Stands Tends Toward Free Fall\nIt is the tyrant, she thinks as the window thrums with the thunder of engine and the floor shakes. As the floodlights strobe across the courtyard and the dark gives way to annihilating white. Helicopter blades claim the night, their seismic noise spreading like a banner of ownership.\nRinthira prepares, though not in such a way that it will be obvious she has done so. She spreads out her books and collection of taxidermied insects. She puts on the spectacle she doesn’t need; she drinks the lemon tea—too sweet—that she doesn’t enjoy, until the glass is exactly half-empty. There will be security detail: women in black, muscular and armed. Chatsumon likes to say, only half-joking, that men are vestigial.\nFootsteps. In her head, the conversation is already playing out. The security detail will be left at the door, to preserve privacy, to reinstitute that impression of friendliness—a social call between friend and friend, former lovers. Nothing more complex.\nRinthira touches her hair. The bun makes her look austere, old, a schoolmistress martinet—the kind who walks about with a stick. She tightens it further still. Wishes briefly that she’d dressed more homely today, more shapelessly.\nThe door opens. She gets a look at the security detail. A soldier in her forties—this surprises Rinthira, who expected someone much younger; that’s how Chatsumon’s taste runs.\nThe colonel sits and regards the spread of papers and taxidermy, the insect corpses behind acrylic. Regards Rinthira. Asks how she is, like every other time.\nRinthira answers perfunctorily, sipping her tea between scripted words. Then, “How’s Ubol?”\n“Good. Testosterone agrees with him.” Chatsumon’s boy is the only male she admits into her life, perhaps. “Won’t you offer me a drink?” Said with a coquette’s melody, a murmur of play.\n“Your security must be hungry.”\n“She will manage. It’s good to keep bodyguards lean. Do you follow the news?”\nShe does, piecemeal. It is comforting to pretend she lives inside a bubble but in practice that is make-believe. Besides, old habits linger eternal, hibernating sometimes but never dead. She thinks of the woods that surround her, the Ayutthaya ruins radiating from where she lives as though she resides at ground zero. Calcified boats caught on balconies, glittering with melted sand. The canals, dry and black. It is serene, idyllic, and she is happy. But in the evening she’d gaze up and away as far as her vision will stretch. “I can’t say I do.”\n“Status quo isn’t going to stay status quo forever. It’s all well and good to hope the big players will nuke each other out and leave the rest of us alone.” Chatsumon swats at the air with one large, sure palm. A hand callused, a knowing hand. “The Americans just took Luzon.”\nToo close to home, but . . . “They were always going to take it.” And no doubt the Filipino administration had few choices. Those old air bases were always going to be an excuse, one day, semi-territory already. A treaty will have been rarefied, promising that once America has seized victory, the archipelago nation will be spared, enriched. Elevated. There is a feudal directness to America these days. War flenses the flab of pretension and sears away all diplomacy, leaving behind the marrow of true intent and character. “Manila isn’t any sort of threat.”\n“Factories. Assembly lines are easy to repurpose.”\nContrails in the sky, making cat’s cradle. Rinthira still knows the formations: these things are difficult to unlearn. “I’m not part of the defense ministry.” Anymore.\n“That’s right. You are a private citizen now, a civilian.” Chatsumon tips her head. “My apologies, I shouldn’t try to drag you back into the thick of it. It’s late to fly back though; could I have a room?”\nIt’s not that late, Rinthira could say. Krungthep is barely an hour away, even taking into account the complicated security protocols, the detours. Two at most. Chatsumon’s excuse is thin, she could say. There’s no room ready, she could offer, an excuse equally thin. Rinthira is well versed in the science of saying no in general and saying no to the colonel in particular. “If you want.”\n“Yes. Thanks.”\nRinthira keeps the guest room stocked, cleaned, smelling of detergent: laundry fresher than the rest of the house. An issue of manner, byproduct of an upbringing she can’t shake that declares domesticity requisite in any girl. She doesn’t ask where the bodyguard will sleep. That woman, kept lean, will manage; probably will not submit to the indignity of rest. Soldier pride is a shield against mortal needs.\nRinthira showers thoroughly and goes to bed in a nightgown. Silk like a virgin sky, hemmed with the coyest rose. Usually she sleeps naked, luxuriating in the sloppy ease of being alone. Now she smells like grapefruits from the expensive soap and she is conscious, too much, of the hair covering her shins. The wirier ones, like vowels, at groin and armpits. Adolescent anxieties: beneath her and sanded off by tactical training, in theory.\nIt is an hour and a half before she leaves her duvet and heads for the guest room, clad in near-lingerie and cotton robe. The guard is nowhere to be seen; the door is unlocked. When she enters there is pale light through curtains thrown open wide, and Chatsumon is awake, propped on pillows.\n“I thought you’d never,” Chatsumon says. It’s her voice that is her best weapon, more than even her reflexes and marksmanship. The right amount of thrum with which to seduce, honeyed satin. The right resonance with which to command, velvet iron.\nRinthira bolts the door behind her and steps out of her robe. “What if I’d been an intruder.”\n“Are you armed?” At Rinthira’s nod, the colonel smiles. “Concealed carry in so little. I ought to look for it; what if you had been an intruder, here for my life.”\nThe night gown slips off, strap by strap. The body craves that which is unhealthy, Rinthira thinks, even harmful. Sugar and fat, carbohydrates and salt. Alcohol, tobacco, marijuana. Only fingers kneading her breast and already she wants to demand and urge faster. They have agreed on a nonsensical little phrase, but Rinthira has never had to use it whether with her legs spread wide until they hurt or with her face pressed against a cold, rough wall and her wrists in soft cuffs. Chatsumon inspires hunger for excess.\nChatsumon peels the silk all the way down, lifts Rinthira’s leg where a derringer is strapped mid-calf. Facing inward, to least interrupt the gown’s silhouette. The colonel laughs and bends to kiss one scarred knee. What will the guard think, Rinthira wonders, though does not dwell. It will not be that soldier’s first time accompanying her colonel for a trip like this. Chatsumon doesn’t keep innocents close.\nThey lack implements and the bed is soft, but pain often amplifies. Rinthira climaxes with most of Chatsumon’s hand buried deep inside her.\n(Orgasm is the moment of confession, she used to say but no longer believes. She comes all over Chatsumon’s hand and it isn’t a baring of the soul or even personality. What’s between them is not love but rather an artificial scarcity carefully maintained. A supply chain of negative space as long as their years wound together.)\nShe rests on her side, loose-limbed and back to Chatsumon, her pulse on slow burn. Soon Chatsumon will push her down and she will satisfy the colonel, return the favor, conclude this night.\nBut Chatsumon doesn’t reach for her. “Do you know,” the colonel says, voice wondering, “I never believed in serendipity. In virtue or sin, in the karmic weight. Lately though, I’ve been changing my mind. Having my mind changed.”\n“Let me finish you.”\nChatsumon breathes out, audibly trying to measure out her rhythms. “Phiksunee is coming to see you.”\nRinthira jerks upright. All at once the afterglow dissolves, replaced by the fight/flight roar in her ears. “No.”\n“It’s necessary. The Americans are coming for you.”\nThe first languages Phiksunee learned were Angrit, Thai, and Jeenglang. They were picked for cultural and numerical factors, chosen by cold reason. Russian, Hindi, and Spanish followed. Only so many lexicon modules could be frontloaded without affecting fluidity, though Phiksunee could translate any word into any other language the way dumb machines or dictionaries could. One of the first things she said to Rinthira was in Angrit: “I’m a she.”\nIt was not a sentence that could’ve been said in Thai without torturing the syntax to death. Angrit furiously signifies pronouns, she and ey and they and he each with distinct meaning. In Thai, Phiksunee repeated, “I’m female.”\nRinthira wasn’t sure what to make of it. Covert specialist or not she was still a soldier, not an engineer, a coder, a scientist. Out of everyone in the room, only she and Chatsumon didn’t hold a PhD or three apiece. There was no round of applause: this was not Phiksunee’s first showing and she was not the first of her kind. Rinthira would not learn, until much later, why she was there.\n“Karmic weight is for the next life,” Rinthira says to the approaching dawn. She is nude—there are no neighbors to worry about—and in this light every imperfection is illuminated, stretch marks and scars and cellulite. “Not this one.”\n“Maybe if there’s no next life, it catches up sooner to compensate.”\nThe curtains shift and rub her ankles like a restless pet. She’s considered getting a large dog with exquisite teeth and gunmetal pelt, but never gotten around to the business of acquiring and preparing for the company of another living thing. “Why now?”\nChatsumon has gotten up, naked from the waist down; seems to think better of that and casts off the loose nightshirt. “Phiksunee went looking, after an assassination attempt on Yulya. She found something—something dangerous. You were closer to her than I ever was.”\nRinthira watches the colonel in the window a little longer, a gray phantom of female ideal. Broad and muscular, tight abdomen and corded arms, thick thighs that lead to powerful calves. An anatomy of supreme efficiency and strength. Chatsumon keeps in shape with the dedication of an athlete gunning for world class. “I used to be close to her,” Rinthira says. Grimacing she shakes that off—Phiksunee insisted on polyglot conversation and it never felt natural. “Sittipong.” The AI’s creator who made Phiksunee’s imprints, then freed her like a bird flung up to the sky, or a tiger let loose. “Where is he?”\n“Dead. Part of a negotiation retinue to Israel; American missiles brought the flight down.”\nHer throat catches. “What about the rest of the team?” It was multinational collaboration, a coder from Saint Petersburg, an engineer from Peking, several analysts from elsewhere. Sittipong was the only Thai, their pride.\n“Yulya and Tengfei are fine. They’re difficult to access. But some of the analysts aren’t so fine.” Chatsumon begins to pace, slow, hands behind her, officer-correct. “Some countries are better at protecting their intellectual assets than others. One was captured by the Americans, killed during interrogation. Another was assassinated.”\n“I’m the only accessible one left. How did they even know I’m part of—” Rinthira shakes her head. “Never mind.” A crucial point always leaks: no true secret exists.\n“Phiksunee sent me the Americans’ routes and locations, with promises that they will be much impeded.” A smile, faint. “She worries for you; she always does, and she’s never been quite the same after you left. Lack of optimization, she says.”\nRinthira shuts her eyes. When she opens them again she is centered, readier. “I better get ready then.” Bulletproof gear. Guns. Scramblers, against sniper sighting.\n“She advised you stay put; I don’t disagree. The Americans have stopped trying for Yulya and Tenfgei because they’re securely kept, but we have . . . not made a show of force.”\n“A show of force would have the opposite effect. We don’t want America to think of us as a threat.”\n“The time for that is past.” Chatsumon’s voice is mild. She slips an arm around Rinthira’s waist, slowly stroking her stomach. “America speaks a language of brute might, would understand no other. We’ve been a threat ever since Phiksunee went online and wrecked their infrastructure.”\nFrom which they have never recovered: Phiksunee is more thorough than any human, shattering databases and corrupting communication protocols. She continues, even now, to disrupt it at a speed American engineers can’t equal. Anything that connects is hers and her siblings’ to scorch. There will be an effective countermeasure, one day—this is an arms race—but not now, not yet.\nMorning sees Chatsumon and her bodyguard seeding an aegis around Rinthira’s house. The closest neighbors are several blocks away; targeted defense suits her home well. Rinthira, seized by a contrarian impulse, heads for the town center. They have time.\nWhat was once Ayutthaya is now a handful of households, a municipal office, some essentials: hospital, market. Most of the ruins are uninhabitable, and the remaining power-water grid can service only a tiny population: two thousand in cityscape meant for fifty times that. It is testament to the war that a place this close to Krungthep has been so reduced, burned and drowned and burned again. But safe, for now, under Phiksunee’s protection.\nSo much depends on that construct of code and modified flesh, that child of scintillant minds and burning ambition.\nThe rehabilitation project has brought transplanted trees, grafted to flower and fruit impossibly: a branch extends rose apples over the roof of a clinic, another pours ratchaphruek in yellow cascades over a wrecked school. Color everywhere, to infuse life into the peeling facades and cracked streets. Overgrowth presses close, barely under control, water striders and green ponds and crooning frogs. Stumps draped in moss and spotted fern, orange patches and red stripes and golden freckles.\n(If she falls in love it would be with the land, this land, this ruin. She has lost, somewhere along the way, the capacity for romance with another person.)\nLanterns have gone up at the market for Loykrathong, bright paper and silver curlicues, tassels streaming in the cold. Stalls offer candles, matchbooks, krathong braided in orchids and banana leaves, weighed down with cowrie coins. Rinthira doesn’t bother—there is no flowing body of water, only pools. In the back of her mind she is counting her ammunition supply, the stashes of armament she’s kept throughout the city’s dilapidated arteries. She never expected backup, thought of danger as a prospect she would face in solitude. Now she’d have to work with others again.\nAt the convenience store she buys lemon tea powder, coffee sachets, sugar. At the grocer’s she buys chicken stock and kale, flat noodles and eggs. Vectors of attack, ETA, unit composition. All that information she and Chatsumon have. Phiksunee—and her siblings—have allowed American military certain long-range communications, enough for an illusion of functionality. The tactic has obvious pitfalls, but so far between Phiksunee here and her kin in Shenzhen and Kolkata, it appears to work.\n“This is a very mundane shopping list, for a former spy.”\nConditioned instinct kicks. A gun in her hand, the shopping basket on the floor: where she worked, speed of draw was everything. She is pointing it, safety off, before her cognition catches up. When it does, she sucks in a breath and lowers the weapon, then holsters it entirely. Exhaling she says, “Phiksunee.”\nNo one would have picked out the marionette for what it is. The exterior bears up to scrutiny, even this close. An unremarkable face, large pores, flat nose. Average build, soft around the middle. At the moment she is smiling, dimples parenthetical around her mouth. “It does your daughter a world of good to see you in perfect health.”\n“My house isn’t anechoic.” The AI can check in on her any time, view her medical records and vital signs at will. Monitor her sleep, if it so desires.\n“Your daughter would never invade your privacy or so casually disobey you.” Phiksunee bobs into a quick wai. Switches to Russian: “The colonel is with you, Mother?”\nRinthira twitches—not many in Ayutthaya, she supposes, speak Russian. But they are not alone in here. “You know she is.”\nThe AI’s smile brightens. Or rather she makes the marionette smile wider—it is an interface, a seeming. “May I join you? I’ll clean.”\nShe is noncommittal. Phiksunee drives her home. Going past tableaus of Ayutthaya-that-was, the AI says, “I’ve missed you deeply. A child severed from her parent is a child in terrible need. Navigating my decision trees has become—suboptimal. It is as though I’m missing crucial protocols, as though some possibilities disappear into my periphery, a cognitive attrition. This is difficult to bear, Mother.”\n“How are your siblings?” Rinthira says, not expecting an answer.\n“Xiaoqing and Alkonost wish you a good new year as we speak. Bilbul’s as taciturn as ever, though the soul of duty.” Phiksunee does not touch the steering panel but she doesn’t need to. Under her guidance the car describes impossible arcs and sine waves. It is not a new vehicle, but nevertheless it glides as though the roads are silk and its wheels a needle. “As far as the Americans are concerned, you are ensconced in Pelangkaraya.”\n“Not that far away.”\n“It must be plausible. You wouldn’t be in Moscow. Alkonost respects you but ey can hardly bend policy. We’re very powerful in many ways and powerless entirely in others. And I want,” Phiksunee goes on, “you to be happy. Moscow wouldn’t be happy; neither would Peking or anywhere else but Muangthai.”\nAs pestering as a real child, Rinthira will grant. “I’m happy.”\n“Humans are social, Mother. It is sewn into your neural weft and rides on your every synaptic pulse.”\nShe doesn’t argue. Arguing with machines is a futile pursuit, any of them. It’s not that the AIs believe themselves infallible, but they tend to fixate on a single track in the way that adolescents do. Eternal adolescents.\nPhiksunee greets the colonel with the effusive courtesy of a schoolchild before a strict teacher. On her part Chatsumon accepts this with mock solemnity before showing it the defense systems. “I’ll integrate you into Moscow’s uplink, get us some air support,” Phiksunee says, “just in case. The Americans have limited satellite access, but they still have drones—”\nContrails in the sky, Rinthira thinks again, the background radiation of her childhood. Days going up in smoke as ground-to-air interceptors met drones. At eight she was caught outside on a school day, her safety routines calmly murmuring in her ears to take cover and directing her to the nearest, but it was too late and so she stood: gaze transfixed above as debris sleeted down and her larynx knotted with the stench of shrapnel. She’d survived with no more than lacerations. After that, her career choice was as good as destiny.\nIn the kitchen she prepares vegetables before realizing with irritation that she’s tailored her shopping to Chatsumon’s favorite dish. Too domestic, too intimate.\nPhiksunee joins her, sitting down with chin in hands and watching her stir-fry the noodles. “Will Mother not ask why I defied her wish and came back?”\n“Can you eat now?” Rinthira doesn’t look up. “So I can adjust the portions.”\n“I’ve got olfactory sensors. The rad-na smells lovely—but no, it’d be wasted on me. Let me introduce you to someone.” Phiksunee snaps her fingers and the nearest screen brightens. On it, a young person. They are slim, with improbably high breasts and a face mannequin-smooth. Green eyes, red bobbed hair sleek as patent leather. Clothing just as unlikely: black body-sheath trimmed in muted silver.\n“Who’s this?”\n“A fetus I found raiding one of the American databases. I deleted all copies and iterations, save this one. They aren’t aware that I have it.”\nRinthira stares for a good long moment before comprehension snaps. “An AI. The Americans are making one like you and the others. Have you told Chatsumon?”\nThe AI shakes the marionette’s head. “The colonel would simply have me kill her.”\nKill rather than destroy. “I’d suggest no different.”\n“Of you two, Mother possesses by far the braver and mightier heart. This AI isn’t like us, exactly, made on a different architecture and platform. But I believe it can be imprinted. Getting rid of this copy serves no purpose when more might exist; suborning them is the only viable answer, an answer that could give us absolute victory. It would be like tasting the sun, like transcendence, while in defeat their spirit crumples up like withered amaranths.” Phiksunee’s face dimples. “Besides, I’ve always wanted to give Mother a grandchild.”\nThe first person Phiksunee imprinted on was Sittipong. The second, after six months of evaluation and acclimation, was Rinthira.\nIt wasn’t that they were afraid of sentient AIs running amok, as such. But it was helpful toward making them orient, teach them human interfacing, give the imprint-holder subtle control. Other teams rotate their imprints, but Sittipong decided Phiksunee would have two permanently. Like a family, and he was a man traditional to a fault. The imprinting obliges the AIs to duty, separate from the hardcoded commands that could be accessed only through a complex check-balance: no country may command its AI without the cooperation of at least two others.\nWhen the imprinting went active, Rinthira asked how Phiksunee felt about this overriding of free will, such as a composite of matrices and heuristics had. To that the AI said, with a radiant smile (different face then, desi phenotype), “Love is not voluntary. It is chemistry; it is free fall. Human children are conditioned to love their caretakers, whether or not they’re well treated. Human adults experience attraction without rational thought, by sight and smell and pheromones. My imprint was made with thought and conscious choice—this is more than humans get, Mother.”\nTo that Rinthira made no argument, did not press. She did not want to be the one to incite AI insurrection, if such a thing was even possible. And then Sittipong forfeited his imprint, deleting it from Phiksunee’s core, insisting that it would liberate her to more flexible tactics. Perhaps it did; she turned more aggressive in wreaking havoc on enemy systems. Too bold, Rinthira said, but did not forbid. Until Phiksunee attacked a hospital, disabled medical supports, and killed six-fifty. A third of them were civilians, patients and staff. Rinthira was overseeing the AI at the time. After, she told Phiksunee she did not want to see it ever again.\nRinthira looks, now, at the enameled egg that holds the American AI. This needs to be discussed with Chatsumon, she told Phiksunee as much. The AI tilted her head and congratulated her on communicating with the colonel more.\nClipping the egg to a spiralcrypt around her neck, Rinthira toggles on a monitoring channel. The aegis is comprehensive; short of a full-scale air strike penetrating the solar tripwires, wasp drones, and precision toxin will be difficult. An air strike would be intercepted long before it reaches inhabited areas. Her house is as secure as it can get outside a military base, though this isn’t sustainable.\nHer head needs clearing. She heads to the third floor where she’s installed an immersive frame, a room six by six, spacious for its type and expensive. But she’s found it more than worthwhile. Inside, she loads a shooting range and clinches an interface patch around her head, pulls a prop gun out of the wall. The scenario doesn’t compare to the real ranges provided at bases, but trading fancy military equipment for a life of privacy has been one of the best bargains she’s ever made.\nThe scenario mottles the bare pastel walls. Her perspective creases, pulls, then expands taut: she stands in a tundra, the ground white-green with arctic moss and rime, broken up by dots of bearberry, saxifrage, lichen. Patches of radiance undulate cosine overhead.\nA countdown begins in her ear. When it reaches zero, the lights coalesce into cubes, spheres, prisms. Beautiful in this preset, all the shades of the borealis. They spread, revolving slow and adjusting to her previous scores. Outdated ones—it’s been months.\nConfigured to her favorite gun, the prop clicks and responds nearly without recoil. The first round produces a subpar score; the second is better and the targets speed up. Soon she has a rhythm, the motions repetitious and the process fluid. Sight down the target, pull the trigger. Vector and impact, metal grip solid and right in her hands. It demands no thought, no emotion, pure cause and effect.\nWhen the scenario ends and the frame disengages, she detaches from the interface to the sound of applause. Chatsumon stops clapping. “Phiksunee let me peek. Not bad at all—your accuracy’s down some, but you’d still pass marksmanship exams for your pay grade. That’s where we first met, wasn’t it, at a range?”\n“Maybe it was. I don’t remember.” Rinthira remembers it down to the minute, that first sight of Chatsumon in uniform, tall and sharp-featured and most of all certain of herself. Confident in who and what she was, absolute in her place in the world. “Chatsumon, we can just sleep together.”\n“We have been doing just that.” The colonel inclines her head. “I love taking you in bed, but I miss the other things. The rad-na was gorgeous, you crisp the noodles just right. We could go shopping together.”\n“You need a wife.” She reaches for the enameled egg. “There’s something we need to discuss—”\nIt is the hair, that harsh crimson too brilliant to be natural. It is the eyes, that bottle green too strident to be human. Had the body been more ordinary, Rinthira might have stayed in that state of fugue, not even thinking to react. Her mind would have slotted an Asian face into reality as normal. But it is this body so keenly foreign, this face so inhuman in its serenity, and that jolts her out of complacency.\nSpeed of draw is everything.\nThe body falls without a cry—no pain sensors, no audio output?—and Rinthira shoves Chatsumon behind her, ordering the frame shut. Activating security routines, calling for Phiksunee. The AI answers—\n“Rinthira, you’re bleeding.” Chatsumon draws upright. Her own gun is out, safety off.\nFrom the speakers: “Mother, I don’t see anything. I’m alerting the colonel’s guard and pilot.”\nRinthira feels not the pain but the heat of the bullet in her shoulder, like a flame behind lantern glass. “The American AI.” She’d shot it in the flank and knowing the specs of Phiksunee’s marionettes, that ought to stop it. Or not, if this one’s signal hub is elsewhere: the knee, the calf, the wrist. There is no requirement for AI marionettes to bear vital parts in spots analogous to human.\nPhiksunee says, “The colonel’s pilot is down. There’s at least another marionette but I can’t see it. That AI has scrambled my senses. It’s done this expertly.” A pained pause. “If the specs I’ve got are up to date, the signal receptors are in the right forearm. Mother, load the iteration I brought now.”\n“The what,” Chatsumon starts and stops.\nRinthira is breathing fast. She should be calm: it is a combat situation and she’s been trained for that, has long been accustomed. It’s been years. “What if it compromises you?”\n“I’ve created a sandbox in one of your house’s partitions, to which I won’t connect. We don’t have time, Mother. My nearest bodies are too far and no human reinforcement will be in time. Not to criticize, Colonel, but perhaps you ought to have brought more personnel.”\nThere is a decisive thud outside; Rinthira wishes she’d had the house done over with industrial-grade reinforcement. She turns on every security channel but they show nothing, the invader as invisible to them as to Phiksunee’s eyes. She pictures the perimeter thick with red-headed, green-eyed dolls, blank of expression and lethal. With her good hand she unchains the enameled egg, peels off the shell to expose the port, and plugs it into the frame.\nThe wall brightens and fills with the AI’s pale, pointed face. Their eyes open slowly—an affectation—to reveal those broken-glass irises. A moment’s pause as the imprinting asserts, incorporating Rinthira’s signature and unique identifiers: she holds eye contact, though that is nothing more than cosmetic, an instinct on her part. Phiksunee is not infallible. No telling this could even work, would be compatible.\nThe banging grows louder. Chatsumon has her gun leveled at the entry, her second pistol already loaded at her side.\n“You are registered as superuser,” the AI says in stilted Thai. “I am Natasha.”\nRinthira inhales, ragged. Her shoulder throbs. Natasha. Alkonost will be irritated, she thinks, death row humor. “Show me your read-write accesses and administrative privileges.”\nThey display on the adjacent wall. A list of identities strung out like beads; Rinthira transcribes then deletes them all except her own. Nothing for it once that’s done—she puts Natasha online.\nNatasha’s eyes glaze over, then turn clear with a long hard blink. “Six other active instances of Natasha detected within proximity. Instructions?” The adjacent screen changes to a layout of the house, foregrounded by six vectors. The nearest is immediately outside; another is closing in.\nAt that moment the door gives. Chatsumon squeezes off two consecutive shots, precisely catching the Natasha marionette in the right forearm. It teeters, computer animus leaving, and falls.\nRinthira works quickly: a query to terminate the other instances is denied—it requires back-entry authentication she doesn’t have—and other attempts to alter the five invaders prove fruitless. Until Phiksunee steps in, lightning-logic and brute-force algorithms, a universe of parallel processes denser and faster than any human brain.\nThe vectors go out, one by one.\nIt is not calm, after, and they are not safe. But for the moment Rinthira is in her bed and her wound is dressed; she is hazy from painkillers, though lucid. The scrambling underlay she wears next to her skin threw the enemy Natasha’s aim off-course or it would have been her head, not just a few tendons and a fractured bone.\n“Piercing ammo.” Chatsumon grimaces and puts down the crusted bulletproof mesh. “This was close.”\n“You lost a soldier and a pilot.”\n“Good ones both. But I could have lost you.”\nIt is said simply, thickly, full of the heat that comes before tears. Rinthira turns her face away. “If you requisition better armor for me, I’m not going to say no.” Through the window she watches Chatsumon’s personnel load the bodies. Human ones go into sterile bags, to be honored and then given to families and friends for funerals, smoke and incense and saffron-robed monks. The other ones, the Natashas, have been disassembled and stacked up in boxes for transport to forensic engineers. They are mannequins, components no more sophisticated than Phiksunee’s marionettes a few generations back. Generic and hollow on purpose—the Americans made sure there would be nothing to mine or reverse-engineer, though they don’t appear to have planned on having an iteration fall into enemy hands.\nFor Phiksunee, an iteration of Natasha is as good as having the American AI’s code entire to dissect and compare. “It’s a sibling,” she reported. “Some of the base code is . . . familiar, Mother, it’s why the imprinting took so well. That means a lot of things. Some bad. Some very good. I’ll need to consult the rest of the family.”\nRinthira has kept the body she shot down. One of its arms is laid across her lap. Heavier than she expected, steel skeleton roped with grapheme tendons. When she runs her fingers over the arm it gives, the synthetic dermis a spongy sheath that would never have passed for meat. Thin coolant has congealed around the joints, a nacreous film. If Natasha has any opinion as to its bodies or their termination, it hasn’t voiced any before being put into anechoic hibernation.\nChatsumon pours a cup of water, lukewarm, and presses it in Rinthira’s hand. “I’ll get you all the armor you want and a squad’s worth of artillery. Except none of that is going to make Ayutthaya safer. There’s no perimeter here to speak of. At a base, human personnel would’ve noticed the intrusion right away.”\nNext to the window, a live broadcast plays. It is being recorded through Xiaoqing’s eyes—out of all the AI family, the Jeen eldest is the most powerful, able to manifest and operate nearly everywhere at once. No war correspondent is better. She is relaying an air strike against a small Portuguese town. The Americans, on their own channel, will declare that it is done nobly. That they are liberating the town from Turkish control, restoring it to its rightful citizenry.\nRinthira watches the smoke and the fumes. Listens to the noises, selected and modulated by Xiaoqing: architecture crumpling, ballistic impact, and underneath all that—precisely captured and brought to the fore—a wailing infant. Charred homes and burning schools and slag; what can be freer than blackened ruin no one wants. Corpses too are free, she grants, from worldly concerns and nationality and war: the ultimate liberty.\nShe drinks deeply; Chatsumon remembers her preference for liquid slightly above room temperature. “The last time I operated, I let Phiksunee target a hospital. Sittipong held her back; he knew that and he let me take the reins. So here we are, one atrocity richer. The next time she might well massacre as many as that air strike.”\n“Yes,” Chatsumon says, “I know. I was the one who put you there. All of them need their humans. Phiksunee needs you to be complete, and she was conceptualized from the beginning as a weapon.”\nRinthira pushes at the Natasha arm again. These bodies have been mass-produced. Shock troops, assassins, nothing like the careful works of art that are the marionettes used by Phiksunee and her siblings. If sufficient Natashas are made, the shape of main force will have changed irrevocably. Sitting still is not an option. The war will not pass her by. “You want me back.”\n“Someone like you is exactly what we need.”\nThe feed is ending, fading out to Jeen politicians discussing the strike and its implications. A Turkish general on call, distraught. Angry.\n“Natasha has a lot of information,” Rinthira says after a moment. “There are American manufacture yards we don’t know about, links in their supply chains. It could be decisive, altogether. I want you to promise me, Chatsumon, that if I go back you’ll help end this war.”\nThe colonel nods, curt. But it is a vow, an oath, bound by that twisting thing between them.\n“All right.” Rinthira salutes. Sharp and crisp, cadet-proper. “Reporting for duty, Colonel Chatsumon.”\nHer commander smiles and returns the salute. “Welcome back, Lieutenant Rinthira.”\nBenjanun Sriduangkaew writes love letters to strange cities, beautiful bugs, and the future. Her work has appeared in Tor.com, Beneath Ceaseless Skies, Phantasm Japan, The Dark, and year's bests. She has been shortlisted for the Campbell Award for Best New Writer and her debut novella Scale-Bright has been nominated for the British SF Association Award.", "source": "https://clarkesworldmagazine.com/sriduangkaew_02_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: That Which Stands Tends Toward Free Fall by Benjanun Sriduangkaew"}