{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "xIllADvJtcLct31cQNbSWo0AMAQ=", "id": null, "license": null, "comments": "", "raw_text": "Interview  To See Beyond the Points of View: A Conversation with Karin Lowachee  Canadian novelist Karin Lowachee's experiences have spanned the Western hemisphere. She was born in South America and raised in Canada. Her time spent working in the Arctic greatly influenced her most recent The Gaslight Dogs, as did her love of the Wild West, Victoriana, and Inuit culture.  In 2001, Lowachee won the Warner First Novel Contet, which led to the publication of the science fiction novel Warchild. Subsequent novels, Burndrive and Cagebird, expanded the Warchild universe and further revealed Lowachee as a writer concerned with exploration and discovery — of worlds, of the self and of the traditions that form and confine us.  \"Storytelling has ever been a pathway to discovering truths, of taking ourselves out of our own limits, our own prisons, whether they be in location or in mind,\" writes Karin Lowachee in \"I Know Why the Caged Bird Sings\" on the Orbit Books webpage. She is speaking here of her work recording inmates' stories in a penitentiary, but she might as well be talking about situations and characters in Cagebird or in The Gaslight Dogs or about her own creative process.  Truth and Limitations and the Self are not easy topics, not new ideas. They've been challenging humans across time. Lowachee accesses these universal concerns while invoking a brilliantly conceived new world, a world of nomadic tribes and militant empires, of daughters and sons, of men and women, of cultures learning from and refusing to learn from each other.  Fear not, The Gaslight Dogs is no simple pitting of the Noble Savage against the Greedy Imperialist or Humans against Nature. This is a novel about people — people so real that, at times, you will feel trapped in the characters' skins with them.  The points of view in The Gaslight Dogs alternate between Sjennonirk, an ankago (spiritwalker) of the Aniw, and Jarrett Fawle, a captain in the Ciracusan military. Lowachee gives us two intimate windows on a larger world. The result is a novel that contrasts vast lands with personal confinement, cultural rigidity with the need for adaptation.  As Lowachee says below, \"You have two protagonists that are both literally and emotionally in prison.\" It takes more than 300 pages to understand the nature of the many different prisons the protagonists find themselves in. And if we are lucky there will be many more pages in the future.  Lowachee's novel has a way of sinking into your bones. Not like the teeth of a dog, but like the prolonged arctic cold, like hot tea cutting a brutal chill. Reading The Gaslight Dogs is a challenge, but the best sort of literary challenge. There is an undeniable depth to the characters, an urgency to the situations, and a constant sense of hope against the most challenging of perils.  Below, Lowachee and I talk about writing, the creative process, and other discomforts.   Can you describe The Gaslight Dogs in 200 words or less?  This is a hard question to answer so I cheated and went back to the proposal pitch I'd given my publisher and used that as inspiration. And even then I think it's inadequate, but here is my attempt: The Gaslight Dogs tells the story of a young female spiritwalker from the Arctic and an army captain from the South who are forced to discover each other's worlds, both spiritual and temporal, in a world neither of them fully understand. The book draws on the histories of clashing cultures, when modern and ancient thought collide, and examines the consequences that befall individuals caught in a society's need for exploration, knowledge, and conquest.  In what ways does the frontier, especially the arctic frontier, spark your creativity?  It is such a harsh environment, it astounds me that people thrive there at all. But it's also extremely beautiful. In a way it's a lot like space — one wrong step and you're facing death, and yet you can't deny the beauty. The Arctic is very much like a desert too. Any extreme environment can be a perfect breeding ground for storytelling because you throw people in the midst of it and see how they build. Why are writers so fascinated by the idea/environment of a frontier? A frontier pares you right down to the bare essentials — when you strip away humanity's decadence and niceties, you're left with raw confrontation. You can't hide and you have to rely on others for survival.  What comes first — the story, a character, setting, plot, voice? Something else?  It's hard to say sometimes because they tend to come all at once. I had the idea that I wanted to tell a story about a character from the Arctic who would travel south and collide with a culture s/he had never seen before. Is that the story, character, setting or plot first of all? In that list the voice comes last, because the voice comes when I actually put words to the page. I have to say, though, that without the right character(s), I have no interest in a book. A cool idea or untangling a clever plot won't propel me to write for 400 pages. I have to be intensely interested in the people and their lives.  The Gaslight Dogs opens with the arrival of an army and guns. Why start here? Were there any false starts?  There were a couple false starts, but that had more to do with me trying to find Sjenn's voice than anything else. If I can't nail the character, I can't continue to write because I'm a linear writer and a psychological one, so there's little point in me beginning at the end, so to speak. I need to live through the story with the character to see emotionally where s/he ends up. Beginning with the army landing on the shore with the guns, and the priest being complicit in that (even against his will), seemed like the best place to start the story because that's when her world really begins to change and open up. That introduces everything wrong about her world, and introduces her world at the same time. And from there everything begins to fall apart. It also got the idea across, hopefully quickly, that this is the beginning of an actual invasion. There's nothing benign about boxes of guns.  Do you craft, build, or grow a novel? And can you describe the process by which The Gaslight Dogs came to be in comparison to your previous novels?  All three. I'm an organic writer, in that I like stories to grow naturally once I water them with attention, but it doesn't stay organic. At some point you have to be conscious, militant, and surgical in your creation. It begins broad and then narrows in examination as you go along — down to selecting every letter specifically and pouring over it when you're making up a word in a different language.  It's a little different to compare this book with the science fiction series because I lived with the science fiction world for a couple years before I actually wrote Warchild. I knew that world before Jos [Joslyn Musey] and company began to people it on a page. It became more specific and \"perfect\" through writing the novels but I didn't begin the character and the world at the same time with Warchild like I did for this book. But this book did rumble around for awhile since working in the Arctic. The inclination grew over time and once I was given a blank slate by my editor to come up with a fantasy world, it all coalesced. I had opportunity now to explore in specifics. I wanted to write a book that brought the Arctic world and culture (with some fantasy liberties) into the forefront since living up there; I have a longstanding love of the Wild West; I find the Victorian era to be fascinating and, luckily for me, a hot topic right now. Combining all three seemed natural. They fit the kernels of my idea, the shaping of the world.  What did the alternating limited third person points of view allow you to do that, say, single third or single first person wouldn't have?  I can't remember when I decided that Jarrett would have his own point of view, but I can't imagine his point of view not being there now. It's essential because it's literally one-half of the story I want to tell. His experience is important to understand Sjenn's, and vice versa, and if people get to read the subsequent books in the trilogy this would become all the more apparent. I felt early on that saying things purely from Sjenn's point of view would be too alienating and too limiting — there would be too much she didn't understand once she landed in Ciracusa and that would frustrate me as a writer and likely the readers too. Jarrett's polar opposite world view, plus his understanding of his world (which comes with its own biases and prejudices) is a good contrast to Sjenn's.  Some people tend to think because it's in third person, too, that there is more authorial intervention, an authorial opinion. But as you said it's a limited third person; it's basically first person — I treated it as such — but with the natural distance of a third person voice which I chose more for voice than anything else. Because of that, the world begins from a narrow point of view and you're judging everything through these two points of view and the contrast you can see between them. But they're not complete points of view. Putting the two together doesn't make the world whole — you're still stuck with their biases and prejudices. To try and see beyond that, the reader has to work.  I don't appeal to lazy readers in my novels and never have, where everything is spelled out both in plot and character. Not everything is explained upfront (because the universe doesn't work that way and I'm of the mind that people should accept unknowns or at least be patient with them), but what I do explain is very conscious and exactly what I want you to know if you're paying attention. This first book is rather claustrophobic and I did that on purpose. Some people have said that it feels limited. That's the point. You have two protagonists that are both literally and emotionally in prison. If I wrote this book from an omniscient point of view or washed it all in authorial niceties in order to make the reader comfortable that would be cheating the idea, the tone, and the voices of the characters.  Can you outline the process by which you built the Dog ancestry culture in particular and the world of The Gaslight Dogs in particular?  I had the idea of the little spirit years ago, when I worked up North. I've always been fascinated by cultures that believe in animal spirits, but I didn't want to just settle on the common knowledge of that, with those expectations. I didn't want Sjenn to have a wolf companion as such, or to make her shapechange like you see in so much fantasy. Because the book/idea deals with spiritual issues, I made it much more elemental, in a way. This little spirit actually resides in their bodies. Then I had to ask the questions of why and how? It all just fell into place. It made sense that these aren't, in fact, animal spirits. Like Sjenn says in the book, that is just the form that they take. They belong to something more than our terrestrial understanding, something much older, and as such, would be incredibly difficult to control or understand. And yet we have a relationship with them.  To me that's the beauty of the spiritual (and I'm talking a little about theme right now, which bears on how I view the Dog ancestry). We can have a relationship with the spiritual without fully understanding it (but we do that with other people too, if you think about it, and nobody questions that; that's \"love\" and that's what \"everyone\" wants.) That takes faith and a sense of wonder. That's stripping our love of the speculative right down to its essentials — what is more speculative than the question of where we come from and what exists beyond our physical reality? The spirituality in Sjenn's world has an order and a reason, and a definite importance, the characters just don't fully understand them, but they'll be revealed over time.  Jarrett's problem (one of them) is his arrogance and his unwillingness to believe in things that are larger than himself, that are outside of his limited experience. He doesn't become \"the white savior\" because he can't be arsed to believe in it and because he can't even save himself. I think that's more realistic than someone sweeping in, all enlightened. When he does finally accept it at the end it doesn't come with angels singing, in fact it's a hard pill to swallow, and it doesn't even necessarily make him a better person. It just makes him more aware and anyone can tell you that knowledge is a double-edged sword, because then you can no longer rely on ignorance. Logically his 29 years of life isn't enough to fully explain the universe, but you meet people all the time that claim that their short time on this Earth, what they've seen and what they've read and heard, is sufficient to explain everything. It's arrogance. That idea bears very heavily in the world of this novel and how Jarrett is connected to the Dog.  For all of General Fawle's bad deeds, he's one of the few Kabliw who opened his mind to other possibilities, other explanations. Another was Father Bari. Both of them are from pretty stringent subcultures — a military and a religion. Yet they accepted another culture's beliefs. And in the wrong hands, that acceptance can do damage, just as much as it can enlighten. I'm sure people can find real-world correlation with that idea too. The Ciracusan world is a sharp contrast to the Aniw one, but there is commonality in both and that's what the book explores and will explore (hopefully). Because despite the diversity, cultures are made up of people, and there is commonality in people. There's \"good\" and \"bad\" in all cultures too, which you'll see more of, hopefully, and which I was conscious of creating. To me it's not that the Aniw or the Nation tribes are perfect and the Ciracusans are lost bastards. There's a lot that's dicey in all of them because they all have an incomplete understanding of the world. I read one blogger say something like obviously the tribes are \"better\" and the Ciracusans are \"wrong.\" Clearly they didn't read well enough because I just need to point to Qoyotariz or Sjenn's father/little spirit. There is nothing clear-cut about their characters at all. Or any of them. When I talk about the world of this book, the scaffolding is one thing, the psychology is another. Both are essential.  The overall world of the book came in parts as ideas rolled into one another. You ask yourself questions and the world builds. What do the Ciracusans believe? Where did they come from? How many gods? How much of the world is settled, what does the frontier look like? What tribes are they in contact with? Who are these tribes? What differentiates them? Who are the Aniw? What do they believe? It's endless. Every time I had a question, I had to seek the answer, and from that answer, more often than not, came a plot point.  Your story of Sjenn and Captain Jarrett suggests that there is great value in disorientation. Likewise, adaptation seems crucial to the story. How much disorientation and adaptation do you experience and/or embrace in the creative process?  Disorientation and adaptation is crucial in life because when you're too comfortable you get lazy — with what you believe and what you're willing to believe, as well as many other things. It's not life's responsibility to adhere to your comfort level and your biases; that kind of entitlement is a road to nowhere. Answers and self-discovery aren't found in comfortable places, and if there's any one thread in all of my writing, it's that specific thing.  Your question is perfect because disorientation and adaptation seems to be a very accurate way of describing the creative process, especially in novel writing, and I've never read anyone phrase it like that. We start off wondering what the hell? And then figure out our answers. Which create more what the hell? questions — \"What the hell does this mean?\" — whilst flailing around looking for explanation. That's it. It's fun, though. Much more fun for me than for the characters.  Figuring out the puzzle of the book is exciting because when you get those moments where the inspiration is flowing and the pieces are fitting, you feel like you're doing exactly what you are meant to be doing with your time. You feel like you might actually have something to say that might be worth something to other people and to yourself. And that's pretty important.  What's next for you?  Only the gods know. That's not me being coy either. I'm working on some things but whether they'll be put on the shelves is another matter altogether.  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nTo See Beyond the Points of View: A Conversation with Karin Lowachee\nCanadian novelist Karin Lowachee's experiences have spanned the Western hemisphere. She was born in South America and raised in Canada. Her time spent working in the Arctic greatly influenced her most recent The Gaslight Dogs, as did her love of the Wild West, Victoriana, and Inuit culture.\nIn 2001, Lowachee won the Warner First Novel Contet, which led to the publication of the science fiction novel Warchild. Subsequent novels, Burndrive and Cagebird, expanded the Warchild universe and further revealed Lowachee as a writer concerned with exploration and discovery — of worlds, of the self and of the traditions that form and confine us.\n\"Storytelling has ever been a pathway to discovering truths, of taking ourselves out of our own limits, our own prisons, whether they be in location or in mind,\" writes Karin Lowachee in \"I Know Why the Caged Bird Sings\" on the Orbit Books webpage. She is speaking here of her work recording inmates' stories in a penitentiary, but she might as well be talking about situations and characters in Cagebird or in The Gaslight Dogs or about her own creative process.\nTruth and Limitations and the Self are not easy topics, not new ideas. They've been challenging humans across time. Lowachee accesses these universal concerns while invoking a brilliantly conceived new world, a world of nomadic tribes and militant empires, of daughters and sons, of men and women, of cultures learning from and refusing to learn from each other.\nFear not, The Gaslight Dogs is no simple pitting of the Noble Savage against the Greedy Imperialist or Humans against Nature. This is a novel about people — people so real that, at times, you will feel trapped in the characters' skins with them.\nThe points of view in The Gaslight Dogs alternate between Sjennonirk, an ankago (spiritwalker) of the Aniw, and Jarrett Fawle, a captain in the Ciracusan military. Lowachee gives us two intimate windows on a larger world. The result is a novel that contrasts vast lands with personal confinement, cultural rigidity with the need for adaptation.\nAs Lowachee says below, \"You have two protagonists that are both literally and emotionally in prison.\" It takes more than 300 pages to understand the nature of the many different prisons the protagonists find themselves in. And if we are lucky there will be many more pages in the future.\nLowachee's novel has a way of sinking into your bones. Not like the teeth of a dog, but like the prolonged arctic cold, like hot tea cutting a brutal chill. Reading The Gaslight Dogs is a challenge, but the best sort of literary challenge. There is an undeniable depth to the characters, an urgency to the situations, and a constant sense of hope against the most challenging of perils.\nBelow, Lowachee and I talk about writing, the creative process, and other discomforts.\nCan you describe The Gaslight Dogs in 200 words or less?\nThis is a hard question to answer so I cheated and went back to the proposal pitch I'd given my publisher and used that as inspiration. And even then I think it's inadequate, but here is my attempt: The Gaslight Dogs tells the story of a young female spiritwalker from the Arctic and an army captain from the South who are forced to discover each other's worlds, both spiritual and temporal, in a world neither of them fully understand. The book draws on the histories of clashing cultures, when modern and ancient thought collide, and examines the consequences that befall individuals caught in a society's need for exploration, knowledge, and conquest.\nIn what ways does the frontier, especially the arctic frontier, spark your creativity?\nIt is such a harsh environment, it astounds me that people thrive there at all. But it's also extremely beautiful. In a way it's a lot like space — one wrong step and you're facing death, and yet you can't deny the beauty. The Arctic is very much like a desert too. Any extreme environment can be a perfect breeding ground for storytelling because you throw people in the midst of it and see how they build. Why are writers so fascinated by the idea/environment of a frontier? A frontier pares you right down to the bare essentials — when you strip away humanity's decadence and niceties, you're left with raw confrontation. You can't hide and you have to rely on others for survival.\nWhat comes first — the story, a character, setting, plot, voice? Something else?\nIt's hard to say sometimes because they tend to come all at once. I had the idea that I wanted to tell a story about a character from the Arctic who would travel south and collide with a culture s/he had never seen before. Is that the story, character, setting or plot first of all? In that list the voice comes last, because the voice comes when I actually put words to the page. I have to say, though, that without the right character(s), I have no interest in a book. A cool idea or untangling a clever plot won't propel me to write for 400 pages. I have to be intensely interested in the people and their lives.\nThe Gaslight Dogs opens with the arrival of an army and guns. Why start here? Were there any false starts?\nThere were a couple false starts, but that had more to do with me trying to find Sjenn's voice than anything else. If I can't nail the character, I can't continue to write because I'm a linear writer and a psychological one, so there's little point in me beginning at the end, so to speak. I need to live through the story with the character to see emotionally where s/he ends up. Beginning with the army landing on the shore with the guns, and the priest being complicit in that (even against his will), seemed like the best place to start the story because that's when her world really begins to change and open up. That introduces everything wrong about her world, and introduces her world at the same time. And from there everything begins to fall apart. It also got the idea across, hopefully quickly, that this is the beginning of an actual invasion. There's nothing benign about boxes of guns.\nDo you craft, build, or grow a novel? And can you describe the process by which The Gaslight Dogs came to be in comparison to your previous novels?\nAll three. I'm an organic writer, in that I like stories to grow naturally once I water them with attention, but it doesn't stay organic. At some point you have to be conscious, militant, and surgical in your creation. It begins broad and then narrows in examination as you go along — down to selecting every letter specifically and pouring over it when you're making up a word in a different language.\nIt's a little different to compare this book with the science fiction series because I lived with the science fiction world for a couple years before I actually wrote Warchild. I knew that world before Jos [Joslyn Musey] and company began to people it on a page. It became more specific and \"perfect\" through writing the novels but I didn't begin the character and the world at the same time with Warchild like I did for this book. But this book did rumble around for awhile since working in the Arctic. The inclination grew over time and once I was given a blank slate by my editor to come up with a fantasy world, it all coalesced. I had opportunity now to explore in specifics. I wanted to write a book that brought the Arctic world and culture (with some fantasy liberties) into the forefront since living up there; I have a longstanding love of the Wild West; I find the Victorian era to be fascinating and, luckily for me, a hot topic right now. Combining all three seemed natural. They fit the kernels of my idea, the shaping of the world.\nWhat did the alternating limited third person points of view allow you to do that, say, single third or single first person wouldn't have?\nI can't remember when I decided that Jarrett would have his own point of view, but I can't imagine his point of view not being there now. It's essential because it's literally one-half of the story I want to tell. His experience is important to understand Sjenn's, and vice versa, and if people get to read the subsequent books in the trilogy this would become all the more apparent. I felt early on that saying things purely from Sjenn's point of view would be too alienating and too limiting — there would be too much she didn't understand once she landed in Ciracusa and that would frustrate me as a writer and likely the readers too. Jarrett's polar opposite world view, plus his understanding of his world (which comes with its own biases and prejudices) is a good contrast to Sjenn's.\nSome people tend to think because it's in third person, too, that there is more authorial intervention, an authorial opinion. But as you said it's a limited third person; it's basically first person — I treated it as such — but with the natural distance of a third person voice which I chose more for voice than anything else. Because of that, the world begins from a narrow point of view and you're judging everything through these two points of view and the contrast you can see between them. But they're not complete points of view. Putting the two together doesn't make the world whole — you're still stuck with their biases and prejudices. To try and see beyond that, the reader has to work.\nI don't appeal to lazy readers in my novels and never have, where everything is spelled out both in plot and character. Not everything is explained upfront (because the universe doesn't work that way and I'm of the mind that people should accept unknowns or at least be patient with them), but what I do explain is very conscious and exactly what I want you to know if you're paying attention. This first book is rather claustrophobic and I did that on purpose. Some people have said that it feels limited. That's the point. You have two protagonists that are both literally and emotionally in prison. If I wrote this book from an omniscient point of view or washed it all in authorial niceties in order to make the reader comfortable that would be cheating the idea, the tone, and the voices of the characters.\nCan you outline the process by which you built the Dog ancestry culture in particular and the world of The Gaslight Dogs in particular?\nI had the idea of the little spirit years ago, when I worked up North. I've always been fascinated by cultures that believe in animal spirits, but I didn't want to just settle on the common knowledge of that, with those expectations. I didn't want Sjenn to have a wolf companion as such, or to make her shapechange like you see in so much fantasy. Because the book/idea deals with spiritual issues, I made it much more elemental, in a way. This little spirit actually resides in their bodies. Then I had to ask the questions of why and how? It all just fell into place. It made sense that these aren't, in fact, animal spirits. Like Sjenn says in the book, that is just the form that they take. They belong to something more than our terrestrial understanding, something much older, and as such, would be incredibly difficult to control or understand. And yet we have a relationship with them.\nTo me that's the beauty of the spiritual (and I'm talking a little about theme right now, which bears on how I view the Dog ancestry). We can have a relationship with the spiritual without fully understanding it (but we do that with other people too, if you think about it, and nobody questions that; that's \"love\" and that's what \"everyone\" wants.) That takes faith and a sense of wonder. That's stripping our love of the speculative right down to its essentials — what is more speculative than the question of where we come from and what exists beyond our physical reality? The spirituality in Sjenn's world has an order and a reason, and a definite importance, the characters just don't fully understand them, but they'll be revealed over time.\nJarrett's problem (one of them) is his arrogance and his unwillingness to believe in things that are larger than himself, that are outside of his limited experience. He doesn't become \"the white savior\" because he can't be arsed to believe in it and because he can't even save himself. I think that's more realistic than someone sweeping in, all enlightened. When he does finally accept it at the end it doesn't come with angels singing, in fact it's a hard pill to swallow, and it doesn't even necessarily make him a better person. It just makes him more aware and anyone can tell you that knowledge is a double-edged sword, because then you can no longer rely on ignorance. Logically his 29 years of life isn't enough to fully explain the universe, but you meet people all the time that claim that their short time on this Earth, what they've seen and what they've read and heard, is sufficient to explain everything. It's arrogance. That idea bears very heavily in the world of this novel and how Jarrett is connected to the Dog.\nFor all of General Fawle's bad deeds, he's one of the few Kabliw who opened his mind to other possibilities, other explanations. Another was Father Bari. Both of them are from pretty stringent subcultures — a military and a religion. Yet they accepted another culture's beliefs. And in the wrong hands, that acceptance can do damage, just as much as it can enlighten. I'm sure people can find real-world correlation with that idea too. The Ciracusan world is a sharp contrast to the Aniw one, but there is commonality in both and that's what the book explores and will explore (hopefully). Because despite the diversity, cultures are made up of people, and there is commonality in people. There's \"good\" and \"bad\" in all cultures too, which you'll see more of, hopefully, and which I was conscious of creating. To me it's not that the Aniw or the Nation tribes are perfect and the Ciracusans are lost bastards. There's a lot that's dicey in all of them because they all have an incomplete understanding of the world. I read one blogger say something like obviously the tribes are \"better\" and the Ciracusans are \"wrong.\" Clearly they didn't read well enough because I just need to point to Qoyotariz or Sjenn's father/little spirit. There is nothing clear-cut about their characters at all. Or any of them. When I talk about the world of this book, the scaffolding is one thing, the psychology is another. Both are essential.\nThe overall world of the book came in parts as ideas rolled into one another. You ask yourself questions and the world builds. What do the Ciracusans believe? Where did they come from? How many gods? How much of the world is settled, what does the frontier look like? What tribes are they in contact with? Who are these tribes? What differentiates them? Who are the Aniw? What do they believe? It's endless. Every time I had a question, I had to seek the answer, and from that answer, more often than not, came a plot point.\nYour story of Sjenn and Captain Jarrett suggests that there is great value in disorientation. Likewise, adaptation seems crucial to the story. How much disorientation and adaptation do you experience and/or embrace in the creative process?\nDisorientation and adaptation is crucial in life because when you're too comfortable you get lazy — with what you believe and what you're willing to believe, as well as many other things. It's not life's responsibility to adhere to your comfort level and your biases; that kind of entitlement is a road to nowhere. Answers and self-discovery aren't found in comfortable places, and if there's any one thread in all of my writing, it's that specific thing.\nYour question is perfect because disorientation and adaptation seems to be a very accurate way of describing the creative process, especially in novel writing, and I've never read anyone phrase it like that. We start off wondering what the hell? And then figure out our answers. Which create more what the hell? questions — \"What the hell does this mean?\" — whilst flailing around looking for explanation. That's it. It's fun, though. Much more fun for me than for the characters.\nFiguring out the puzzle of the book is exciting because when you get those moments where the inspiration is flowing and the pieces are fitting, you feel like you're doing exactly what you are meant to be doing with your time. You feel like you might actually have something to say that might be worth something to other people and to yourself. And that's pretty important.\nWhat's next for you?\nOnly the gods know. That's not me being coy either. I'm working on some things but whether they'll be put on the shelves is another matter altogether.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/lowachee_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: To See Beyond the Points of View: A Conversation with Karin Lowachee Interview by Jeremy L. C. Jones"}