{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Genevieve Valentine", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "5aKwkCfKUnGq5Pq/QI95X8zaZNY=", "id": null, "license": null, "comments": "", "raw_text": "3780 words, short story  Advection  The first day of fifth year a boy came in with the new eyeshields, a glossy expanse of black with no iris or pupil, and looking at him was like looking into an eclipse.  All the other girls said it made them uncomfortable; they teased him to take them out, to put on some normal sunglasses like everyone else. They said they’d never forgive him for hiding eyes in such a handsome face.  “Fortuni, it’s a little much,” said someone.  That was how I learned his name.  We were all Level Two intelligence, but before the first week was over the news was out that some had managed to find the money for a sixth year. Janik Duranti, who spent the history lectures drawing stick figures screwing on his computer screen, was getting a sixth year. I’d be cleaning his office someday. Answering his phones. Updating the registration on his blue ID cuff.  Carol Clarke opened the top button on her shirt as soon as the shades went down; obvious, but it was worth it to be married to a guy who had a sixth year.  The first time Fortuni opened his mouth was two weeks after start-of-year in geohistory, when Mr. Xi was talking about the five oceans.  “After the emergency desalinization,” Mr. Xi said, “we held the first HydroSummit to determine the best use of resources.”  “I think it’s awful about the dolphins that died,” said Kay, whose water ration was unlimited because her father was a diplomat, and that was how I first noticed her.  Mr. Xi opened the rain cycle diagram on our screens; the blue advection loop from a hundred years ago had been overlaid by a three-point process from the Atmo water collectors to the thirsty ground, and the green web of the surface sweat system that preserved the little underground things that managed to survive.  My grandfather sent my mom a postcard from Niagara Cliffs when there was still a river at the bottom (RAIN! All my love, Dad), and as Mr. Xi talked about desalinization I traced the advection circle, thought about the sky filling with wet clouds, about water sliding over everything.  I looked up, and Fortuni was watching me, his lashes casting shadows over his flat black eyes.  “I’m going to engineer some rain,” he told me, and after a moment I laughed.  That was how I met him.  It was nearly the end of year when I walked past the upper-class apartments and saw the plant in the garbage.  My heart leapt into my throat, and I checked to see if a cop was recording me, because nobody just left a clipping on the street. But besides the tram down the street full of commuters, there was nobody.  I knelt and stared at the glossy tops, the browned underside where it was drying out, the pale hairs on the stem. Even from this distance the smell was overwhelming, wet and clean, and without caring if the cops were watching I scooped it up and dropped it into the back of my hood where it would be safest from the sun.  The tram home was endless; I felt the stem pressing against my neck and shivered.  Half a day’s water ration went into a glass bowl, and I looked up what plant it was (jade) and how much water it would need (hardly any. It was a survivor).  I sat up all night watching the pattern of leaves on the walls. I expected it to die; I cried like I’d already lost it, ended up dehydrated from tears and lack of water.  When Fortuni walked with me after school the next day I didn’t ask why. I was making up my mind to show him the plant. My heart raced. He could turn me in. I didn’t really know him. It was too dangerous. I couldn’t.  “Come with me,” I said, and he got in the tram without asking why.  Even before I opened the door I hadn’t wondered why he walked me home, and when he smiled at the plant and said, “Beautiful,” I knew.  He wasn’t a Level Two. Everybody else was a fool.  He lifted his hand to the glass, closed his eyes over the black shields. He smiled like he knew he looked silly, or like the plant told him a joke.  “The water is cool,” he said.  “I keep it under my bed at night.”  He opened one eye, grinned at me. “Hiding it from your parents or trying for condensation?”  After a moment he took his hand off the glass and went home without another word.  The next day he messaged: How is it? Dream about it?  Stronger, I messaged back, didn’t tell him what I dreamed.  At school we didn’t talk about it—we didn’t talk at all, because I had to work to pass exams, and he had to work to avoid tripping over girls who couldn’t get enough of his bone-white skin and his blue cuff.  Kay ignored him. She sat one row in front of him in classes, and when he asked her a question she turned just enough to give him her profile, answered him curtly, turned back.  “This winter I’m going to my uncle’s farm,” she told Carol. “He’s scheduled an Atmo so we can get rain.”  “Oh, wow,” breathed Carol.  My pen snapped, and I had to wait until end of class to get another one.  Mr. Xi talked about the Reclaimers and the class got into a screaming match about whether they were terrorists or guerillas. They yelled about the cave communities who harbored the sleeper cells; about whether wild rain was even a good idea anymore.  “It’s a waste of water,” said Janik, and I wanted to kick him.  When I looked over at Fortuni, he was gazing unblinking ahead of him, his eyes fixed on the knot of hair at the nape of Kay’s neck, on her pale hand writing.  I didn’t hear the rest of the class.  Fortuni messaged: What do you think of Kay?  I don’t.  Try.  The plant was outgrowing the bowl, and I adjusted the stem, didn’t get around to answering him.  The next day in geohistory Mr. Xi talked about Free Water, about the cave-towns authorized to collect condensation without reporting. The class got into it again about Reclaimers seeking asylum there.  I looked at the cliffs and thought how they were underwater once, about vegetation breathing into the sky, about water so big you couldn’t see the end of it, about the wet slide of rain across skin.  “It’s weird when you miss rain you’ve never felt,” Fortuni said, like I’d spoken, and my fingers went cold.  “I know,” I said.  He looked back at Kay, who had turned a little towards him as if by accident, resting a white hand on her throat.  When I got home he’d messaged me. Clip it.  I didn’t think about Fortuni when the side-by-side clippings grew so fast; all I knew was my dreams filled with the creaky, quiet sound of growing.  Summer. The last day of fifth year Fortuni wasn’t there. I didn’t really think about it (he was Level Zero) except that Kay looked nervous, and it worried me that if something was wrong with Fortuni, Kay knew more than I did.  I stopped her as she was walking back to her seat with her certificate, said, “Have you seen—”  She pulled away from me like she was poisoned.  Carol laughed, and I hoped she had to marry Janick Duranti.  On the tram on the way home someone came up behind me, said in my ear, “Figured out rain yet?”  It was Fortuni’s voice, and I was so relieved that I must have really been worried before.  I turned, but he was wearing a black UV hood and I couldn’t see his face. It had a white bird outline on the side, and as I tried to find his profile behind the hood the silhouette took flight, wings beating.  My hood was from the bargain market, standard SPF 150 striped brown and purple, and I’d never wanted to be rich so much in my life.  “You weren’t in class,” I said. “Tapped for Level Zero?”  He looked at me like he couldn’t help it, and for the first time I thought that maybe I’d managed to surprise him. “You think I’m special?”  I didn’t answer that, and he grinned, shrugged. “Yeah, I wish. Just got held up with something.”  For the rest of the tram ride he looked out the window, and I watched the bird flying on the taut black fabric between two of the ribs; when he put his hood back, the bird would disappear into the folds. It seemed really sad. I don’t know why.  At my stop, I got off without asking him to follow me, and he took one step and changed his mind, gave me a half-wave as the tram pulled away from the stop and back onto the street.  At home I slid it out from under my bed so it could breathe for an hour. It was big enough to be illegal; I was a criminal.  I messaged him. You should see it.  The words sat on my screen, and he didn’t answer.  Autumn. One of the big government offices was hiring, and I got my credentials and made coffee and shuttled lunches and watched sixth-years plan trajectories and irrigation patterns and wildlife preservation.  I made sure my plant had enough water.  Winter. The dreams about Niagara Cliffs and the water cycle never stopped, and I applied for a sixth year without telling anyone.  Spring. I went into one of the banks in my nice suit and folded back the expensive UV hood I borrowed from a nice sixth-year at the office, and arranged to go into a decade of debt for a year of Meteohydronics and a chance at a seat on an Atmo. My parents were surprised.  Summer. It was too big for the bowl, and I had to leave clippings on the sill with the shade cracked, five minutes at a time until the sun shriveled them and they were dry enough to burn.  A message came back from Fortuni.  Want to go to a concert?  It had been a year.  As I waited outside the back entrance of Roseland I couldn’t think of anything but Fortuni’s UV hood, black with a white bird silhouette that flew in place as you watched. I pressed against the grimy brick to avoid the swells of tourists sweating in their “NYC” rental hoods, and my breath fluttered in my chest as I looked for Fortuni in a sea of strangers. My hands were clammy.  When I saw him, bouncing along next to that little white bird was Kay’s pale blue hood with her coat of arms on each side—two greyhounds and a pile of helmets and swords. Kay must have just finished her sixth year, because as the crowd parted for her (crowds always did) I could see she carried nothing except a smug expression.  I sucked in a sigh, and felt dust coating the inside of my mouth.  “Sarah, hi!” Kay stepped under the marquee and pushed back the hood, shook out her long blonde hair. She’d gotten a grey wash in between exams—the latest thing to make you look paler.  I made fists in my pockets.  When Fortuni pushed his hood back, the white bird spread its wings into the folds. “Did we keep you waiting?” he asked.  “Of course not,” said Kay. “She doesn’t have to worry about studying anymore.” She grinned. “You must be so relieved that’s all over.”  “We should go inside,” said Fortuni, and opened the back door. For a moment Kay looked disgusted by the shabby welcome, but she went. It was Fortuni, after all.  Music was already throbbing as we approached the bar, and Kay gave Fortuni a look of delight. Her hood was too big for her; folded down against her back it made her look like a crested lizard.  She brought him a glass. He passed it to me, and she had to go back for another one and look like it didn’t bother her.  “This band is totally derivative,” she told Fortuni, who had hung back with me.  He shrugged. “It’s the opening act. I didn’t pay much attention to the bill.”  It was just like Fortuni to go to a concert without even knowing what band it was, and so I didn’t think much of it. He just liked to stand in the crowd, eyes closed, feeling the breath of two hundred people.  I’ve never felt lonelier than when I was standing next to Fortuni in a crowd.  “Well, I figured you had better taste than that. I hear Hammond is amazing.” Kay swung back and forth between baiting and appeasing Fortuni so quickly I thought she’d get whiplash.  “If you can hear anything around that stupid hood,” I said under my breath.  Fortuni smiled into his glass, and his laugh, if he laughed, was drowned out by screams and applause.  Kay flirted with the bartender through two more free drinks, glancing backs at Fortuni to make sure it was all right.  “You’ve applied for a sixth year,” he said.  He knew it the way he knew everything, and I didn’t bother to answer him. I’d requested a year in Meteohydronics.  The study of rain.  “So,” I said, “are you and Kay dating?”  He smiled, still not looking at me. “Nah. We just talk.”  I thought about green leaves spilling over the edge of the bowl. “What about?”  “She has ambition,” he said. “It’s not something you run across often.”  The ambition was her as the pretty shadow of some boy, and I saw that ambition all the time.  “I don’t really feel like a concert.” I pressed my drink into his hand. “I need to study. See you.”  “No,” he said, stepped forward. “Please, stay. Please.”  He had his hand on my arm, the first time he’d ever touched me. I looked up and could see past the eyeshields into green, frightened eyes. He’d never asked me for anything, not one thing that whole silent year.  “Okay,” I said.  He smiled as if he’d never doubted, and I wondered if I’d just imagined that I could see through him.  Kay materialized at his side, smiling, but her hand was wrapped around her glass so hard that the skin under her nails was red.  “Sorry,” she said. “Am I interrupting? Hammond was announced, but if you want to be alone . . . ”  Fortuni dropped his hand. My arm was cold where he’d touched it.  The band was loud, and when Fortuni leaned over and spoke he had to repeat himself, louder, before I heard him.  “Come with me,” he said.  My heart constricted. “What?”  “You and Kay,” he said. “Come with me.”  “Where are you going?”  He half-smiled. “To engineer some rain.”  I thought, Reclaimers, but didn’t dare say it.  I thought about his fingers on the glass bowl as he listened to the plant growing, thought maybe he didn’t even need the Reclaimers to make rain.  My lungs pounded against my ribs. “Me?”  “I want you with me for the first wild rain.”  I don’t know why he could still surprise me, but he could; he was a wondrous thing, and back then I was easy to surprise.  “And Kay?” I asked, because I was afraid, and it sounded like a spurned child asking.  He said, “Come with me.”  I had signed up for a sixth year. I wanted to work with the Atmos.  I had a plant that would die without me.  In Fortuni’s black eyes the reflection of the crowd was like wet clouds gathering, like the dream of rain.  The music washed over us, and I was half-dreaming about walking beside Fortuni, walking into some other unknown life that was full of water, and without Kay’s white bracelet lighting up a warning we wouldn’t have known the police were coming.  Kay moved first (she must have been used to getting out of something right before the cops got in), and shoved us towards the stairs, shouting something that was drowned out by the drums and the bass. As much as I distrusted her I ran, and beside me Fortuni ran, too.  When we took the turn on the landing I caught a glimpse of her in the crowd, swaying to the music like she didn’t know us at all.  At the top of the stairs I saw the EXIT sign and ducked into the utility hall pulling Fortuni behind me; he crouched and slid along the wall, and I followed his lead.  “They’re not after your plant,” he said, which was the first time I thought they might have been.  “What were you doing all year?” I imagined him in a cave, drinking condensation, blowing up reservoirs, blowing up Atmos with people like me in them. My voice shook.  He turned and grinned. “Engineering some rain,” he said, and as we heard footsteps echoing in the stairwell he held out a hand, said, “Come with me.”  We couldn’t make it to the fire exit before the cops got there, and he was holding out his hand, and I didn’t understand what he was saying, what he was.  I hesitated, shook my head.  He turned and ducked into the door on his right; I saw a cluster of rooms before the door swung shut behind him.  As I moved to follow, the cops swarmed me.  They weren’t all cops, some of them were kids drinking over-ration who got spooked and bolted, but it felt like a sea of uniforms and I covered my head to protect myself from the kicks, and I let myself be yanked up and handcuffed, listened for Fortuni to make his big escape.  He didn’t. They stormed the dressing room (I bit my lips until they bled), someone shouted, the bang of a gunshot.  They had to drag me out by the cuffs because I was trying to run into the room, to see what had happened, to see them carry out his body.  I heard, “—nothing left!” just before the door swung shut and they yanked me down the stairs.  I thought of the little white bird, of the folds in his hood, how something could be so neatly tucked away. I stumbled. My eyes burned.  Kay was outside, talking to the cop with the most brass on. As I walked past them, Kay laughed.  “Her? Oh please. No way she’s over ration. Can’t afford anything.”  And Kay stared at me like I knew something she didn’t know.  I knew he had gone into the dressing room, and there was one shot—but maybe he was out by then, maybe he ran, he looked like a sprinter—and he would have run with me, taken me with him, but there was the shot, but even when his hood was folded back, and even when you couldn’t see it the little white bird was flying away and away and away.  He would have taken me with him.  Kay looked sick and turned away, and I wondered if he had leaned in over the music and asked her to come with him, too.  They still play music there, not that anybody can get tickets unless they’re willing to sit under the stage, and when my big brother did that for Goblin Dust he almost failed his service physical six weeks later because he couldn’t hear.  The top of the balcony stairs is dark and quiet—everyone goes for the view over the railing, no one even sees the hall behind the utility door. Baby-blue walls, like Kay’s hood, and two dressing rooms—one an inch deep in grime, makeup mirrors with all but two lights burned out, a pinball table rusted stiff.  The second door opens to a honeycomb of little rooms, cloth tacked to the walls, carpet crunching underfoot.  If there was ever an escape it’s not there now, and I ram the walls until my shoulder wrenches in the socket, tear down the fabric and check for hidden doors, and I fall to my knees and drag my fingers along the floor looking for a crack that will open the way.  You have to apply at the Embassy to see anyone privately, even if you can recognize Ambassador Arnaun’s crest in a sea of hoods, even if his daughter called the cops off you.  It’s a paper form, and if it’s not the Ambassador you want to see, then you write the person’s name in a little box underneath, and in the box below that you fill out the reason for your visit.  I write, Accepted into sixth year. Advice?  A guard directs me to the proper line, and I stand between Visas and Water Permits, and some woman stamps my paper and tells me to look for a response in my email.  It takes six weeks, and then the image of my form is sent back so I can see that under ENTERED it has been stamped DECLINED.  I end up looking up the social calendar for her kind of people, and a week later I find her outside a club, smoking, bare-armed in the cold to show off the big white smoking permit on her wrist.  When she sees me she licks her lips, turns her profile to me like she used to do with Fortuni.  “Declined,” she says when I’m close enough, “have they not gotten to long words in sixth year yet?”  I say, “Do you know where he is?” which I mean to say, and “I miss him,” which I don’t.  She says, “Well, I don’t know, do I?” which I expect, and bursts into tears, which I don’t.  I go home and look up her life until then, little mentions on the society sites and on the galleries of the most fashionable people, and I feel like I’m checking up on someone I used to babysit.  I get another message from the Embassy, which I expect, and accept the invitation, which I don’t.  At night I pull the bowl out from under my bed and press my hands to the glass, feel with my palms for the voices of living things. When I sit back, the beads are already condensing, two handprints full of water.  “I’m going to engineer some rain,” he told me, and I dream of him standing on the dry seabed, closing his eyes over black shields, spreading his arms, opening the sky. Genevieve Valentine is a novelist (her most recent is near-future political thriller Icon) and comic book writer, including Catwoman for DC Comics. Her short fiction has appeared in over a dozen Year's Best collections, including The Best American Science Fiction & Fantasy. Her nonfiction has appeared at the AV Club, NPR.org, The Atlantic, and the New York Times.", "text": "3780 words, short story\nAdvection\nThe first day of fifth year a boy came in with the new eyeshields, a glossy expanse of black with no iris or pupil, and looking at him was like looking into an eclipse.\nAll the other girls said it made them uncomfortable; they teased him to take them out, to put on some normal sunglasses like everyone else. They said they’d never forgive him for hiding eyes in such a handsome face.\n“Fortuni, it’s a little much,” said someone.\nThat was how I learned his name.\nWe were all Level Two intelligence, but before the first week was over the news was out that some had managed to find the money for a sixth year. Janik Duranti, who spent the history lectures drawing stick figures screwing on his computer screen, was getting a sixth year. I’d be cleaning his office someday. Answering his phones. Updating the registration on his blue ID cuff.\nCarol Clarke opened the top button on her shirt as soon as the shades went down; obvious, but it was worth it to be married to a guy who had a sixth year.\nThe first time Fortuni opened his mouth was two weeks after start-of-year in geohistory, when Mr. Xi was talking about the five oceans.\n“After the emergency desalinization,” Mr. Xi said, “we held the first HydroSummit to determine the best use of resources.”\n“I think it’s awful about the dolphins that died,” said Kay, whose water ration was unlimited because her father was a diplomat, and that was how I first noticed her.\nMr. Xi opened the rain cycle diagram on our screens; the blue advection loop from a hundred years ago had been overlaid by a three-point process from the Atmo water collectors to the thirsty ground, and the green web of the surface sweat system that preserved the little underground things that managed to survive.\nMy grandfather sent my mom a postcard from Niagara Cliffs when there was still a river at the bottom (RAIN! All my love, Dad), and as Mr. Xi talked about desalinization I traced the advection circle, thought about the sky filling with wet clouds, about water sliding over everything.\nI looked up, and Fortuni was watching me, his lashes casting shadows over his flat black eyes.\n“I’m going to engineer some rain,” he told me, and after a moment I laughed.\nThat was how I met him.\nIt was nearly the end of year when I walked past the upper-class apartments and saw the plant in the garbage.\nMy heart leapt into my throat, and I checked to see if a cop was recording me, because nobody just left a clipping on the street. But besides the tram down the street full of commuters, there was nobody.\nI knelt and stared at the glossy tops, the browned underside where it was drying out, the pale hairs on the stem. Even from this distance the smell was overwhelming, wet and clean, and without caring if the cops were watching I scooped it up and dropped it into the back of my hood where it would be safest from the sun.\nThe tram home was endless; I felt the stem pressing against my neck and shivered.\nHalf a day’s water ration went into a glass bowl, and I looked up what plant it was (jade) and how much water it would need (hardly any. It was a survivor).\nI sat up all night watching the pattern of leaves on the walls. I expected it to die; I cried like I’d already lost it, ended up dehydrated from tears and lack of water.\nWhen Fortuni walked with me after school the next day I didn’t ask why. I was making up my mind to show him the plant. My heart raced. He could turn me in. I didn’t really know him. It was too dangerous. I couldn’t.\n“Come with me,” I said, and he got in the tram without asking why.\nEven before I opened the door I hadn’t wondered why he walked me home, and when he smiled at the plant and said, “Beautiful,” I knew.\nHe wasn’t a Level Two. Everybody else was a fool.\nHe lifted his hand to the glass, closed his eyes over the black shields. He smiled like he knew he looked silly, or like the plant told him a joke.\n“The water is cool,” he said.\n“I keep it under my bed at night.”\nHe opened one eye, grinned at me. “Hiding it from your parents or trying for condensation?”\nAfter a moment he took his hand off the glass and went home without another word.\nThe next day he messaged: How is it? Dream about it?\nStronger, I messaged back, didn’t tell him what I dreamed.\nAt school we didn’t talk about it—we didn’t talk at all, because I had to work to pass exams, and he had to work to avoid tripping over girls who couldn’t get enough of his bone-white skin and his blue cuff.\nKay ignored him. She sat one row in front of him in classes, and when he asked her a question she turned just enough to give him her profile, answered him curtly, turned back.\n“This winter I’m going to my uncle’s farm,” she told Carol. “He’s scheduled an Atmo so we can get rain.”\n“Oh, wow,” breathed Carol.\nMy pen snapped, and I had to wait until end of class to get another one.\nMr. Xi talked about the Reclaimers and the class got into a screaming match about whether they were terrorists or guerillas. They yelled about the cave communities who harbored the sleeper cells; about whether wild rain was even a good idea anymore.\n“It’s a waste of water,” said Janik, and I wanted to kick him.\nWhen I looked over at Fortuni, he was gazing unblinking ahead of him, his eyes fixed on the knot of hair at the nape of Kay’s neck, on her pale hand writing.\nI didn’t hear the rest of the class.\nFortuni messaged: What do you think of Kay?\nI don’t.\nTry.\nThe plant was outgrowing the bowl, and I adjusted the stem, didn’t get around to answering him.\nThe next day in geohistory Mr. Xi talked about Free Water, about the cave-towns authorized to collect condensation without reporting. The class got into it again about Reclaimers seeking asylum there.\nI looked at the cliffs and thought how they were underwater once, about vegetation breathing into the sky, about water so big you couldn’t see the end of it, about the wet slide of rain across skin.\n“It’s weird when you miss rain you’ve never felt,” Fortuni said, like I’d spoken, and my fingers went cold.\n“I know,” I said.\nHe looked back at Kay, who had turned a little towards him as if by accident, resting a white hand on her throat.\nWhen I got home he’d messaged me. Clip it.\nI didn’t think about Fortuni when the side-by-side clippings grew so fast; all I knew was my dreams filled with the creaky, quiet sound of growing.\nSummer. The last day of fifth year Fortuni wasn’t there. I didn’t really think about it (he was Level Zero) except that Kay looked nervous, and it worried me that if something was wrong with Fortuni, Kay knew more than I did.\nI stopped her as she was walking back to her seat with her certificate, said, “Have you seen—”\nShe pulled away from me like she was poisoned.\nCarol laughed, and I hoped she had to marry Janick Duranti.\nOn the tram on the way home someone came up behind me, said in my ear, “Figured out rain yet?”\nIt was Fortuni’s voice, and I was so relieved that I must have really been worried before.\nI turned, but he was wearing a black UV hood and I couldn’t see his face. It had a white bird outline on the side, and as I tried to find his profile behind the hood the silhouette took flight, wings beating.\nMy hood was from the bargain market, standard SPF 150 striped brown and purple, and I’d never wanted to be rich so much in my life.\n“You weren’t in class,” I said. “Tapped for Level Zero?”\nHe looked at me like he couldn’t help it, and for the first time I thought that maybe I’d managed to surprise him. “You think I’m special?”\nI didn’t answer that, and he grinned, shrugged. “Yeah, I wish. Just got held up with something.”\nFor the rest of the tram ride he looked out the window, and I watched the bird flying on the taut black fabric between two of the ribs; when he put his hood back, the bird would disappear into the folds. It seemed really sad. I don’t know why.\nAt my stop, I got off without asking him to follow me, and he took one step and changed his mind, gave me a half-wave as the tram pulled away from the stop and back onto the street.\nAt home I slid it out from under my bed so it could breathe for an hour. It was big enough to be illegal; I was a criminal.\nI messaged him. You should see it.\nThe words sat on my screen, and he didn’t answer.\nAutumn. One of the big government offices was hiring, and I got my credentials and made coffee and shuttled lunches and watched sixth-years plan trajectories and irrigation patterns and wildlife preservation.\nI made sure my plant had enough water.\nWinter. The dreams about Niagara Cliffs and the water cycle never stopped, and I applied for a sixth year without telling anyone.\nSpring. I went into one of the banks in my nice suit and folded back the expensive UV hood I borrowed from a nice sixth-year at the office, and arranged to go into a decade of debt for a year of Meteohydronics and a chance at a seat on an Atmo. My parents were surprised.\nSummer. It was too big for the bowl, and I had to leave clippings on the sill with the shade cracked, five minutes at a time until the sun shriveled them and they were dry enough to burn.\nA message came back from Fortuni.\nWant to go to a concert?\nIt had been a year.\nAs I waited outside the back entrance of Roseland I couldn’t think of anything but Fortuni’s UV hood, black with a white bird silhouette that flew in place as you watched. I pressed against the grimy brick to avoid the swells of tourists sweating in their “NYC” rental hoods, and my breath fluttered in my chest as I looked for Fortuni in a sea of strangers. My hands were clammy.\nWhen I saw him, bouncing along next to that little white bird was Kay’s pale blue hood with her coat of arms on each side—two greyhounds and a pile of helmets and swords. Kay must have just finished her sixth year, because as the crowd parted for her (crowds always did) I could see she carried nothing except a smug expression.\nI sucked in a sigh, and felt dust coating the inside of my mouth.\n“Sarah, hi!” Kay stepped under the marquee and pushed back the hood, shook out her long blonde hair. She’d gotten a grey wash in between exams—the latest thing to make you look paler.\nI made fists in my pockets.\nWhen Fortuni pushed his hood back, the white bird spread its wings into the folds. “Did we keep you waiting?” he asked.\n“Of course not,” said Kay. “She doesn’t have to worry about studying anymore.” She grinned. “You must be so relieved that’s all over.”\n“We should go inside,” said Fortuni, and opened the back door. For a moment Kay looked disgusted by the shabby welcome, but she went. It was Fortuni, after all.\nMusic was already throbbing as we approached the bar, and Kay gave Fortuni a look of delight. Her hood was too big for her; folded down against her back it made her look like a crested lizard.\nShe brought him a glass. He passed it to me, and she had to go back for another one and look like it didn’t bother her.\n“This band is totally derivative,” she told Fortuni, who had hung back with me.\nHe shrugged. “It’s the opening act. I didn’t pay much attention to the bill.”\nIt was just like Fortuni to go to a concert without even knowing what band it was, and so I didn’t think much of it. He just liked to stand in the crowd, eyes closed, feeling the breath of two hundred people.\nI’ve never felt lonelier than when I was standing next to Fortuni in a crowd.\n“Well, I figured you had better taste than that. I hear Hammond is amazing.” Kay swung back and forth between baiting and appeasing Fortuni so quickly I thought she’d get whiplash.\n“If you can hear anything around that stupid hood,” I said under my breath.\nFortuni smiled into his glass, and his laugh, if he laughed, was drowned out by screams and applause.\nKay flirted with the bartender through two more free drinks, glancing backs at Fortuni to make sure it was all right.\n“You’ve applied for a sixth year,” he said.\nHe knew it the way he knew everything, and I didn’t bother to answer him. I’d requested a year in Meteohydronics.\nThe study of rain.\n“So,” I said, “are you and Kay dating?”\nHe smiled, still not looking at me. “Nah. We just talk.”\nI thought about green leaves spilling over the edge of the bowl. “What about?”\n“She has ambition,” he said. “It’s not something you run across often.”\nThe ambition was her as the pretty shadow of some boy, and I saw that ambition all the time.\n“I don’t really feel like a concert.” I pressed my drink into his hand. “I need to study. See you.”\n“No,” he said, stepped forward. “Please, stay. Please.”\nHe had his hand on my arm, the first time he’d ever touched me. I looked up and could see past the eyeshields into green, frightened eyes. He’d never asked me for anything, not one thing that whole silent year.\n“Okay,” I said.\nHe smiled as if he’d never doubted, and I wondered if I’d just imagined that I could see through him.\nKay materialized at his side, smiling, but her hand was wrapped around her glass so hard that the skin under her nails was red.\n“Sorry,” she said. “Am I interrupting? Hammond was announced, but if you want to be alone . . . ”\nFortuni dropped his hand. My arm was cold where he’d touched it.\nThe band was loud, and when Fortuni leaned over and spoke he had to repeat himself, louder, before I heard him.\n“Come with me,” he said.\nMy heart constricted. “What?”\n“You and Kay,” he said. “Come with me.”\n“Where are you going?”\nHe half-smiled. “To engineer some rain.”\nI thought, Reclaimers, but didn’t dare say it.\nI thought about his fingers on the glass bowl as he listened to the plant growing, thought maybe he didn’t even need the Reclaimers to make rain.\nMy lungs pounded against my ribs. “Me?”\n“I want you with me for the first wild rain.”\nI don’t know why he could still surprise me, but he could; he was a wondrous thing, and back then I was easy to surprise.\n“And Kay?” I asked, because I was afraid, and it sounded like a spurned child asking.\nHe said, “Come with me.”\nI had signed up for a sixth year. I wanted to work with the Atmos.\nI had a plant that would die without me.\nIn Fortuni’s black eyes the reflection of the crowd was like wet clouds gathering, like the dream of rain.\nThe music washed over us, and I was half-dreaming about walking beside Fortuni, walking into some other unknown life that was full of water, and without Kay’s white bracelet lighting up a warning we wouldn’t have known the police were coming.\nKay moved first (she must have been used to getting out of something right before the cops got in), and shoved us towards the stairs, shouting something that was drowned out by the drums and the bass. As much as I distrusted her I ran, and beside me Fortuni ran, too.\nWhen we took the turn on the landing I caught a glimpse of her in the crowd, swaying to the music like she didn’t know us at all.\nAt the top of the stairs I saw the EXIT sign and ducked into the utility hall pulling Fortuni behind me; he crouched and slid along the wall, and I followed his lead.\n“They’re not after your plant,” he said, which was the first time I thought they might have been.\n“What were you doing all year?” I imagined him in a cave, drinking condensation, blowing up reservoirs, blowing up Atmos with people like me in them. My voice shook.\nHe turned and grinned. “Engineering some rain,” he said, and as we heard footsteps echoing in the stairwell he held out a hand, said, “Come with me.”\nWe couldn’t make it to the fire exit before the cops got there, and he was holding out his hand, and I didn’t understand what he was saying, what he was.\nI hesitated, shook my head.\nHe turned and ducked into the door on his right; I saw a cluster of rooms before the door swung shut behind him.\nAs I moved to follow, the cops swarmed me.\nThey weren’t all cops, some of them were kids drinking over-ration who got spooked and bolted, but it felt like a sea of uniforms and I covered my head to protect myself from the kicks, and I let myself be yanked up and handcuffed, listened for Fortuni to make his big escape.\nHe didn’t. They stormed the dressing room (I bit my lips until they bled), someone shouted, the bang of a gunshot.\nThey had to drag me out by the cuffs because I was trying to run into the room, to see what had happened, to see them carry out his body.\nI heard, “—nothing left!” just before the door swung shut and they yanked me down the stairs.\nI thought of the little white bird, of the folds in his hood, how something could be so neatly tucked away. I stumbled. My eyes burned.\nKay was outside, talking to the cop with the most brass on. As I walked past them, Kay laughed.\n“Her? Oh please. No way she’s over ration. Can’t afford anything.”\nAnd Kay stared at me like I knew something she didn’t know.\nI knew he had gone into the dressing room, and there was one shot—but maybe he was out by then, maybe he ran, he looked like a sprinter—and he would have run with me, taken me with him, but there was the shot, but even when his hood was folded back, and even when you couldn’t see it the little white bird was flying away and away and away.\nHe would have taken me with him.\nKay looked sick and turned away, and I wondered if he had leaned in over the music and asked her to come with him, too.\nThey still play music there, not that anybody can get tickets unless they’re willing to sit under the stage, and when my big brother did that for Goblin Dust he almost failed his service physical six weeks later because he couldn’t hear.\nThe top of the balcony stairs is dark and quiet—everyone goes for the view over the railing, no one even sees the hall behind the utility door. Baby-blue walls, like Kay’s hood, and two dressing rooms—one an inch deep in grime, makeup mirrors with all but two lights burned out, a pinball table rusted stiff.\nThe second door opens to a honeycomb of little rooms, cloth tacked to the walls, carpet crunching underfoot.\nIf there was ever an escape it’s not there now, and I ram the walls until my shoulder wrenches in the socket, tear down the fabric and check for hidden doors, and I fall to my knees and drag my fingers along the floor looking for a crack that will open the way.\nYou have to apply at the Embassy to see anyone privately, even if you can recognize Ambassador Arnaun’s crest in a sea of hoods, even if his daughter called the cops off you.\nIt’s a paper form, and if it’s not the Ambassador you want to see, then you write the person’s name in a little box underneath, and in the box below that you fill out the reason for your visit.\nI write, Accepted into sixth year. Advice?\nA guard directs me to the proper line, and I stand between Visas and Water Permits, and some woman stamps my paper and tells me to look for a response in my email.\nIt takes six weeks, and then the image of my form is sent back so I can see that under ENTERED it has been stamped DECLINED.\nI end up looking up the social calendar for her kind of people, and a week later I find her outside a club, smoking, bare-armed in the cold to show off the big white smoking permit on her wrist.\nWhen she sees me she licks her lips, turns her profile to me like she used to do with Fortuni.\n“Declined,” she says when I’m close enough, “have they not gotten to long words in sixth year yet?”\nI say, “Do you know where he is?” which I mean to say, and “I miss him,” which I don’t.\nShe says, “Well, I don’t know, do I?” which I expect, and bursts into tears, which I don’t.\nI go home and look up her life until then, little mentions on the society sites and on the galleries of the most fashionable people, and I feel like I’m checking up on someone I used to babysit.\nI get another message from the Embassy, which I expect, and accept the invitation, which I don’t.\nAt night I pull the bowl out from under my bed and press my hands to the glass, feel with my palms for the voices of living things. When I sit back, the beads are already condensing, two handprints full of water.\n“I’m going to engineer some rain,” he told me, and I dream of him standing on the dry seabed, closing his eyes over black shields, spreading his arms, opening the sky.\nGenevieve Valentine is a novelist (her most recent is near-future political thriller Icon) and comic book writer, including Catwoman for DC Comics. Her short fiction has appeared in over a dozen Year's Best collections, including The Best American Science Fiction & Fantasy. Her nonfiction has appeared at the AV Club, NPR.org, The Atlantic, and the New York Times.", "source": "https://clarkesworldmagazine.com/valentine_08_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Advection by Genevieve Valentine"}