{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Leigh Kennedy", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "k60NNWuBkTSGDYIx6Jr75aL8tn0=", "id": null, "license": null, "comments": "", "raw_text": "5880 words, short story, REPRINT  Her Furry Face  Douglas was embarrassed when he saw Annie and Vernon mating.  He’d seen hours of sex between orangutans, but this time was different. He’d never seen Annie doing it. He stood in the shade of the pecan tree for a moment, iced tea glasses sweating in his hand, shocked, then he backed around the comer of the brick building. He was confused. The cicadas seemed louder than usual, the sun hotter, and the squeals of pleasure from the apes strange.  He walked back to the front porch and sat down. His mind still saw the two giant mounds of red-orange fur moving together like one being.  When the two orangs came back around, Douglas thought he saw smugness in Vernon’s face. Why not, he thought? I guess I would be smug, too.  Annie flopped down on the grassy front yard and crossed one leg over the other, her abdomen bulging high; she gazed upward into the heavy white sky.  Vernon bounded toward Douglas. He was young and red-chocolate-colored. His face was still slim, without the older orangutan jowls yet.  “Be polite,” Douglas warned him.  “Drink tea, please?” Vernon signed rapidly, the fringe on his elbows waving. “Dry as bone.”  Douglas handed Vernon one of the glasses of tea, though he’d brought it out for Annie. The handsome nine-year-old downed it in a gulp. “Thank you,” he signed. He touched the edge of the porch and withdrew his long fingers. “Could fry egg,” he signed, and instead of sitting, swung out hand-over-hand on the ropes between the roof of the schoolhouse and the trees. It was a sparse and dry substitute for the orang’s native rain forest.  He’s too young and crude for Annie, Douglas thought.  “Annie,” Douglas called. “Your tea.”  Annie rolled onto one side and lay propped on an elbow, staring at him. She was lovely. Fifteen-years-old, her fur was glossy and coppery, her small yellow eyes in the fleshy face expressive and intelligent. She started to rise up toward him, but turned toward the road.  The mail jeep was coming down the highway.  In a blurred movement, she set off at a four-point gallop down the half-mile drive toward the mailbox. Vernon swung down from his tree and followed, giving a small groan.  Reluctant to go out in the sun, Douglas put down the tea anyway and followed the apes along the drive. By the time he got near them, Annie was sitting with mail sorted between her toes, holding an opened letter in her hands. She looked up with an expression on her face that he’d never seen—it could have been fear, but it wasn’t.  She handed the letter to Vernon, who pestered her for it. “Douglas,” she signed, “they want to buy my story.”  Therese lay in the bathwater, her knees sticking up high, her hair floating beside her face. Douglas sat on the edge of the tub; as he talked to her he was conscious that he spoke a double language—the one with his lips and the other with his hands.  “As soon as I called Ms. Young, the magazine editor, and told her who Annie was, she got really excited. She asked me why we hadn’t sent a letter explaining it with the story, so I told her that Annie didn’t want anyone to know first.”  “Did Annie decide that?” Therese sounded skeptical, as she always seemed to when Douglas talked about Annie.  “We talked about it and she wanted it that way.” Douglas felt the resistance from Therese. Why she never understood, he didn’t know, unless she did it to provoke him. She acted as though she thought an ape was still just an ape, no matter what he or she could do. “Anyway,” he said, “she talked about doing a whole publicity thing to the hilt—talk shows, autograph parties. You know. But Dr. Morris thinks it would be better to keep things quiet.”  “Why?” Therese sat up; her legs went underwater and she soaped her arms.  “Because she’d be too nervous. Annie, I mean. It might disrupt her education to become a celebrity. Too bad. Even Dr. Morris knows that it would be great for fundraising. But I guess we’ll let the press in some.”  Therese began to shampoo her hair. “I brought home that essay that Sandy wrote yesterday. The one I told you about. Now if she were an orangutan instead of just a deaf kid, she could probably get it published in Fortune.” Therese smiled.  Douglas stood. He didn’t like the way Therese headed for the old argument—no matter what one of Therese’s deaf students did, if Annie could do it one one-hundredth as well, it was more spectacular. Douglas knew it was true, but why Therese was so bitter about it, he didn’t understand.  “That’s great,” he said, trying to sound enthusiastic.  “Will you wash my back?” she asked.  He crouched and absent-mindedly washed her. “I’ll never forget Annie’s face when she read that letter.”  “Thank you,” Therese said. She rinsed. “Do you have any plans for this evening?”  “I’ve got work to do,” he said, leaving the bathroom. “Would you like me to work in the bedroom so you can watch television?”  After a long pause, she said “No, I’ll read.”  He hesitated in the doorway. “Why don’t you go to sleep early? You look tired.”  She shrugged. “Maybe I am.”  In the playroom at the school, Douglas watched Annie closely. It was still morning, though late. In the recliner across the room from him, she seemed a little sleepy. Staring out the window, blinking, she marked her place in Pinkwater’s Fat Men From Space with a long brown finger.  He had been thinking about Therese, who’d been silent and morose that morning. Annie was never morose, though often quiet. He wondered if Annie was quiet today because she sensed that Douglas was not happy. When he’d come to work, she’d given him an extra hug.  He wondered if Annie could have a crush on him, like many schoolgirls have on their teachers. Remembering her mating with Vernon days before, he idly wandered into a fantasy of touching those petals of her genitals and gently, gently moving inside her.  The physical reaction to his fantasy embarrassed him. God, what am I thinking? He shook himself out of the reverie, averting his gaze for a few moments, until he’d gotten control of himself again.  “Douglas,” Annie signed. She walked erect, towering, to him and sat down on the floor at his feet. Her flesh folded into her lap like dough.  “What?” he asked, wondering suddenly if orangutans were telepathic.  “Why you say my story children’s?”  He looked blankly at her.  “Why not send Harper’s?” she asked, having to spell out the name of the magazine.  He repressed a laugh, knowing it would upset her. “It’s . . . it’s the kind of story children would like.”  “Why?”  He sighed. “The level of writing is . . . young. Like you, sweetie.” He stroked her head, looking into the small, intense eyes. “You’ll get more sophisticated as you grow.”  “I smart as you,” she signed. “You understand me always because I talk smart. You not always talk smart.”  Douglas was dumbfounded by her logic.  She tilted her head and waited. When Douglas shrugged, she seemed to assume victory and returned to her recliner.  Dr. Morris came in. “Here we go,” she said, handing him the paper and leaving again.  Douglas skimmed the page until he came to an article about the “ape author.” He scanned it. It contained one of her flashpoints; this and the fact that she was irritable from being in estrus made him consider hiding it. But that wouldn’t be right.  “Annie,” he said softly.  She looked up.  “There’s an article about you.”  “Me read,” she signed, putting her book on the floor. She came and crawled up on the sofa next to him. He watched her eyes as they jerked across every word. He grew edgy. She read on.  Suddenly she took off as if from a diving board. He ran after her as she bolted out the door. The stuffed dog which had always been a favorite toy was being shredded in those powerful hands even before he knew she had it. Annie screamed as she pulled the toy apart, running into the yard.  Terrified by her own aggression, she ran up the tree with stuffing falling like snow behind her.  Douglas watched as the shade filled with foam rubber and fake fur. The tree branches trembled. After a long while, she stopped pummeling the tree and sat quietly.  She spoke to herself with her long ape hand. “Not animal,” she said, “not animal.”  Douglas suddenly realized that Therese was afraid of the apes.  She watched warily as the four of them strolled along the edge of the school acreage. Douglas knew that Therese didn’t appreciate the grace of Annie’s muscular gait as he did; the sign language that passed between them was as similar to the Ameslan that Therese used for her deaf children as British to Jamaican. Therese couldn’t appreciate Annie in creative conversation.  It wasn’t good to be afraid of the apes, no matter how educated they were.  He had invited her out, hoping it would please her to be included in his world here. She had only visited briefly twice before.  Vernon lagged behind them, snapping pictures now and then with his expensive but hardy camera modified for his hands. Vernon took several pictures of Annie and one of Douglas, but only when Therese had separated from him to peer in between the rushes at the edge of the creek.  “Annie,” Douglas called, pointing ahead. “A cardinal. The red bird.”  Annie lumbered forward. She glanced back to see where Douglas pointed, then stood still, squatting. Douglas walked beside her and they watched the bird.  It flew.  “Gone,” Annie signed.  “Wasn’t it pretty, though?” Douglas asked.  They ambled on. Annie stopped often to investigate shiny bits of trash or large bugs. They rarely came this far from the school. Vernon whizzed past them, a dark auburn streak of youthful energy.  Remembering Therese, Douglas turned. She sat on a stump far behind. He was annoyed. He’d told her to wear her jeans and a straw hat because there would be grass burrs and hot sun. But there she sat, bare-headed, wearing shorts, miserably rubbing at her ankles.  He grunted impatiently. Annie looked up at him. “Not you,” he said, stroking her fur. She patted his butt.  “Go on,” Douglas said, turning his back. When he came to Therese, he said, “What’s the problem?”  “No problem.” She started forward without looking at him. “I was just resting.”  Annie had paused to poke at something on the ground with a stick. Douglas quickened his step. Even though his students were smart, they had orangutan appetites. He always worried that they would eat something that would sicken them. “What is it?” he called.  “Dead cat,” Vernon signed back. He took a picture as Annie flipped the carcass with her stick.  Therese hurried forward. “Oh, poor kitty,” she said, kneeling.  Annie had seemed too absorbed in poking the cat to notice Therese approach. Only a quick eye could follow her leap. Douglas was stunned.  Both screamed. It was over.  Annie clung to Douglas’s legs, whimpering.  “Shit!” Therese said. She lay on the ground, rolling from side to side, holding her left arm. Blood dripped from between her fingers.  Douglas pushed Annie back. “That was bad, very bad,” he said. “Do you hear me?”  Annie sank down on her rump and covered her head. She hadn’t gotten a child-scolding for a long time. Vernon stood beside her, shaking his head, signing, “Not wise, baboon-face.”  “Stand up,” Douglas said to Therese. “I can’t help you right now.”  Therese was pale, but dry-eyed. Clumsily, she stood and grew even paler. A hunk of flesh hung loosely from above her elbow, meaty and bleeding. “Look.”  “Go on. Walk back to the house. We’ll come right behind you.” He tried to keep his voice calm, holding a warning hand on Annie’s shoulder.  Therese moaned, catching her breath. “It hurts,” she said, but stumbled on.  “We’re coming,” Douglas said sternly. “Just walk and—Annie, don’t you dare step out of line.”  They walked silently, Therese ahead, leaving drops of blood in the dirt. The drops got larger and closer together. Once, Annie dipped her finger into a bloody spot and sniffed her fingertip.  Why can’t things just be easy and peaceful, he wondered? Something always happens. Always. He should have known better than to bring Therese around Annie. Apes didn’t understand that vulnerable quality that Therese was made of. He himself didn’t understand it, though at one time he’d probably been attracted to it. No—maybe he had never really seen it until it was too late. He’d only thought of Therese as “sweet” until their lives were too tangled up to keep clear of it.  Why couldn’t she be as tough as Annie? Why did she always take everything so seriously?  They reached the building. Douglas sent Annie and Vernon to their rooms and guided Therese to the infirmary. He watched as Jim, their all-purpose nurse and veterinary assistant examined her arm. “I think you should probably have stitches.”  He left the room to make arrangements.  Therese looked at Douglas, holding the gauze over her still-bleeding arm. “Why did she bite me?” she asked.  Douglas didn’t answer. He couldn’t think of how to express it.  “Do you have any idea?” she asked.  “You asked for it, all your wimping around.”  “I . . . ”  Douglas saw the anger rising in her. He didn’t want to argue now. He wished he’d never brought her. He’d done it all for her, and she had ruined it.  “Don’t start,” he said simply, giving her a warning look.  “But, Douglas, I didn’t do anything.”  “Don’t start,” he repeated.  “I see now,” she said coldly. “Somehow it’s my fault again.”  Jim returned with his supplies.  “Do you want me to stay?” Douglas asked. He suddenly felt a pang of guilt, realizing that she was actually hurt enough for all this attention.  “No,” she said softly.  And her eyes looked far, far from him as he left her.  On the same day that the largest donation ever came to the school, a television news team came out to tape.  Douglas could tell that everyone was excited. Even the chimps that lived on the north half of the school hung on the fence and watched the TV van being unloaded. The reporter decided upon the playroom as the best location for the taping, though she didn’t seem to relish sitting on the floor with the giant apes. People went over scripts, strung cords and microphones, set up hot lights, and discussed angles and sound while pointing at the high ceiling’s jungle-gym design. All this to talk to a few people and an orangutan.  They brought Annie’s desk into the playroom, contrary to Annie’s wishes. Douglas explained that it was temporary, that these people would go away after they talked a little. Douglas and Annie stayed outside as long as possible and played Tarzan around the big tree. He tickled her. She grabbed him as he swung from a limb. “Kagoda?” she signed, squeezing him with one arm.  “Kagoda!” he shouted, laughing.  They relaxed on the grass. Douglas was hot. He felt flushed all over. “Douglas,” Annie signed, “they read story?”  “Not yet. It isn’t published yet.”  “Why talk me?”  “Because you wrote it and sold it and people like to interview famous authors.” He groomed her shoulder. “Time to go in,” he said, seeing a wave from inside.  Annie picked him up in a big hug and carried him in.  “Here it is!” Douglas called to Therese, and turned on the video-recorder.  First, a long shot of the school from the dusty drive, looking only functional and square, without personality. The reporter’s voice said, “Here, just south-east of town, is a special school with unusual young students. The students here have little prospect for employment when they graduate, but millions of dollars each year fund this institution.”  A shot of Annie at her typewriter, picking at the keyboard with her long fingers; a sheet of paper is slowly covered with large block letters.  “This is Annie, a fifteen-year-old orangutan, who has been a student with the school for five years. She graduated with honors from another “ape school” in Georgia before coming here. And now Annie has become a writer. Recently, she sold a story to a children’s magazine. The editor who bought the story didn’t know that Annie was an orangutan until after she had selected the story for publication.”  Annie looked at the camera uncertainly.  “Annie can read and write and understand spoken English, but she cannot speak. She uses a sign language similar to the one hearing-impaired use.” Change in tone from narrative to interrogative. “Annie, how did you start writing?”  Douglas watched himself on the small screen watching Annie sign, “Teacher told me write.” He saw himself grin, eyes shift slightly toward the camera, but generally watching Annie. His name and “Orangutan Teacher” appeared on the screen. The scene made him uneasy.  “What made you send in Annie’s story for publication?” the reporter asked.  Douglas signed to Annie, she came to him for a hug, and turned a winsome face to the camera. “Our administrator, Dr. Morris, and I both thought it was as good as any kids’ story, so Dr. Morris said, ‘Send it in.’ The editor liked it.” Annie nervously made “pee” sign to Douglas.  Then, a shot of Dr. Morris in her office, a chimp on her lap, clapping her brown hands.  “Dr. Morris, your school was established five years ago by grants and government funding. What is your purpose here?”  “Well, in the last few decades, apes—mostly chimpanzees like Rose here—have been taught sign language experimentally. Mainly to prove that apes could indeed use language.” Rosie put the tip of her finger through the gold hoop in Dr. Morris’s ear. Dr. Morris took her hand away gently. “We were established with the idea of educating apes, a comparable education to the primary grades.” She looked at the chimp. “Or however far they will advance.”  “Your school has two orangutans and six chimpanzees. Are there differences in their learning?” the reporter asked.  Dr. Morris nodded emphatically. “Chimpanzees are very clever, but the orang has a different brain structure which allows for more abstract reasoning. Chimps learn many things quickly, orangs are slower. But the orangutan has the ability to learn in greater depth.”  Shot of Vernon swinging on the ropes in front of the school.  Assuming that Vernon is Annie, the reporter said, “Her teacher felt from the start that Annie was an especially promising student. The basic sentences that she types out on her typewriter are simple but original entertainment.”  Another shot of Annie at the typewriter.  “If you think this is just monkey business, you’d better think again. Tolstoy, watch out!”  Depressed by the lightness, brevity, and the stupid “monkey business” remark, Douglas turned off the television.  He sat for a long time. Whenever Therese had gone to bed, she had left him silently. After half an hour of staring at the blank screen, he rewound his video-recorder and ran it soundlessly until Annie’s face appeared.  And then froze it. He could almost feel again the softness of her halo of red hair against his chin.  He couldn’t sleep.  Therese had rumpled her way out of the sheet and lay on her side, her back to him. He looked at the shape of her shoulder and back, downward to the dip of the waist, up the curve of her hip. Her buttocks were round ovals, one atop the other. Her skin was sleek and shiny in the filtered street light coming through the window. She smelled slightly of shampoo and even more slightly of female.  What he felt for her, when he thought of her generally, anyone could call love. And yet, he found himself helplessly angry with her most of the time. When he thought he could amuse her, it would end with her feelings being hurt for some obscure reason. He heard cruel words come barging out of an otherwise gentle mouth. She took everything seriously; mishaps and misunderstandings occurred beyond his control, beyond his repair.  Under this satiny skin, she was troubled and tense. A lot of sensitivity and fear. He had stopped trying to gain access to what had been the happier parts of her person, not understanding where they had gone. He had stopped wanting to love her, but he didn’t not want to love her, either. It just did not seem to matter.  Sometimes, he thought, it would be easier to have someone like Annie for a wife.  Annie.  He loved her furry face. He loved the unconditional joy in her face when she saw him. She was bright and warm and unafraid. She didn’t read things into what he said, but listened and talked with him. They were so natural together. Annie was so filled with vitality.  Douglas withdrew his hand from Therese, whose skin seemed a bare blister of dissatisfaction.  He lay on the floor of the apes’ playroom with the fan blowing across his chest. He held Annie’s report on Lawrence’s Sons and Lovers by diagonal corners to keep it from flapping.  Annie lazily swung from bars crisscrossing the ceiling.  “Paul wasn’t happy at work because the boss looked over his shoulder at his handwriting,” she had written. “But he was happy again later. His brother died and his mother was sad. Paul got sick. He was better and visited his friends again. His mother died and his friends didn’t tickle him any more.”  Douglas looked over the top of the paper at Annie. True, it was the first time she’d read an “adult” novel, but he had expected something better than this. He considered asking her if Vernon had written the report for her, but thought better of it.  “Annie,” he said, sitting up. “What do you think this book is really about?”  She swung down and landed on the sofa. “About man,” she said.  Douglas waited. There was no more. “But what about it? Why this man instead of another? What was special about him?”  Annie rubbed her hands together, answerless.  “What about his mother?”  “She help him,” Annie answered in a flurry of dark fingers. “Especially when he paint.”  Douglas frowned. He looked at the page again, disappointed.  “What I do?” Annie asked, worried.  He tried to brighten up. “You did just fine. It was a hard book.”  “Annie smart,” the orang signed. “Annie smart.”  Douglas nodded. “I know.”  Annie rose, then stood on her legs, looking like a two-story fuzzy building, teetering from side to side. “Annie smart. Writer. Smart,” she signed. “Write book. Bestseller.”  Douglas made a mistake. He laughed. Not as simple as a human laughing at another, this was an act of aggression. His bared teeth and uncontrolled guff-guff struck out at Annie. He tried to stop.  She made a gulping sound and galloped out of the room.  “Wait, Annie!” He chased after her.  By the time he got outside she was far ahead. He stopped running when his chest hurt and trotted slowly through the weeds toward her. She sat forlornly far away and watched him come.  When he was near, she signed “hug” three times.  Douglas collapsed, panting, his throat raw. “Annie, I’m sorry,” he said. “I didn’t mean it.” He put his arms around her.  She held onto him.  “I love you, Annie. I love you so much I don’t want ever to hurt you. Ever, ever, ever. I want to be with you all the time. Yes, you’re smart and talented and good.” He kissed her tough face.  Whether forgotten or forgiven, the hurt of his laughter was gone from her eyes. She held him tighter, making a soft sound in her throat, a sound for him.  They lay together in the crackling yellow weeds, clinging. Douglas felt his love physically growing for her. More passionately than ever before in his life, he wanted to make love to her. He touched her. He felt that she understood what he wanted, that her breath on his neck was anticipation. A consummation as he’d never imagined, the joining of their species in language and body. Not dumb animal-banging but mutual love . . . He climbed over her and hugged her back.  Annie went rigid when he entered her.  Slowly, she rolled away from him, but he held onto her. “No.” A horrible grimace came across her face that raised the hairs on the back of Douglas’s neck. “Not you,” she said.  She’s going to kill me, he thought.  His passion declined; Annie disentangled herself and walked away.  He sat for a moment, stunned at what he’d done, at what had happened, wondering what he would do for the rest of his life with the memory of it. Then he zipped up his pants.  Staring at his dinner plate, he thought, it’s just the same as if I had been rejected by a woman.  His hands could still remember the matted feel of her fur; tucked in his groin was the memory of being in an alien place. It had made him throw up out in the field that afternoon, and afterwards he’d come straight home. He hadn’t even said good night to the orangs.  “What’s the matter?” Therese asked.  He shrugged.  She half-rose out of her chair to kiss him on the temple. “You don’t have a fever, do you?”  “No.”  “Can I do something to make you feel better?” Her hand slid along his thigh.  He stood up. “Stop it.”  She sat still. “Are you in love with another woman?”  Why can’t she just leave me alone. “No. I have a lot on my mind.”  “It never was like this, even when you were working on your thesis.”  “Therese,” he said, with what he felt was undeserved patience, “just leave me alone. It doesn’t help with you at me all the time.”  “But I”m scared. I don’t know what to do. You act like you don’t want me around.”  “All you do is criticize me.” He stood and took his dishes to the sink.  Slowly, she trailed after him, carrying her plate. “I”m just trying to understand. It’s my life, too.”  He said nothing and she walked away as if someone had told her not to leave footsteps.  In the bathroom, he stripped and stood under the shower for a long time. He imagined that Annie’s smell clung to him. He felt that Therese could smell it on him.  What have I done, what have I done . . . ?  And when he came out of the shower, Therese was gone.  He had considered calling in sick, but he knew that it would be just as miserable to stay around the house and think about Annie, think about Therese, and worse, to think about himself.  He dressed for work, but couldn’t eat breakfast. Realizing that his pain showed, he straightened his shoulders, but found them drooping again as he got out of the car at work.  With some fear, he came through the office. The secretary greeted him with rolling eyes. “Someone’s given out our number again,” she said as the phone buzzed. Another line was on hold. “This morning there was a man standing at the window watching me until Gramps kicked him off the property.”  Douglas shook his head in sympathy with her and approached the orang’s door. He felt nauseated again.  Vernon sat at his typewriter, composing captions for his photo album. He didn’t get up to greet Douglas, but gave him an evaluative stare.  Douglas patted his shoulder. “Working?” he asked.  “Like dog,” Vernon said and returned to typing.  Annie sat outside on the back porch. Douglas opened the door and stood beside her. She looked up at him, but—like Vernon—made no move toward the customary hug. The morning was still cool, the shadow of the building still long in front of them. Douglas sat down.  “Annie,” he said softly. “I”m sorry. I’ll never do it again. You see, I felt . . . ” He stopped. It wasn’t any easier than it had been to talk to Oona, or Wendy, or Shelley, or Therese . . . He realized then that he didn’t understand her any more than he’d understood them. Why had she rejected him? What was she thinking? What would happen from now on? Would they be friends again?  “Oh, hell,” he said. He stood. “It won’t happen again.”  Annie gazed away into the trees.  He felt strained all over, especially in his throat. He stood by her a long time.  “I don’t want write stories,” she signed.  Douglas stared at her. “Why?”  “Don’t want.” She seemed to shrug.  Douglas wondered what had happened to the confident ape who’d planned to write a bestseller the day before. “Is that because of me?”  She didn’t answer.  “I don’t understand,” he said. “Do you want to write it down for me? Could you explain it that way?”  “No,” she signed, “can’t explain. Don’t want.”  He continued. “What do you want?”  “Sit tree. Eat bananas, chocolate. Drink brandy.” She looked at him seriously. “Sit tree. Day, day, day, week, month, year.”  Christ almighty, he thought, she’s having a goddamned existential crisis. All the years of education. All the accomplishments. The hopes of an entire field of primatology. All shot to hell because of a moody ape. It can’t just be me. This would have happened sooner or later, maybe . . . He thought of all the effort he would have to make to repair their relationship. It made him tired.  “Annie, why don’t we just ease up a little on your work. You can rest today. You can go sit in the trees all of today and I’ll bring you a glass of wine.”  She shrugged again.  Oh, I’ve botched it, he thought. What an idiot. He felt a pain coming back, a pain like poison, with a focal point but shooting through his heart and hands, making him dizzy and short of breath.  At least she doesn’t hate me, he thought, squatting to touch her hand.  She bared her teeth.  Douglas froze. She slid away from him and headed for the trees.  He sat alone at home and watched the newscast. In a small midwestern town they burned the issues of the magazine with Annie’s story in it.  A heavy woman in a windbreaker was interviewed with the bonfire in the background. “I don’t want my children reading things that weren’t even written by humans. I have human children and this godless ape is not going to tell its stories to them.”  A quick interview with Dr. Morris, who looked even more tired and introverted than usual. “The story is a very innocent tale, told by an innocent personality. I really don’t think she has any ability or intention to corrupt . . . ”  He turned the television off. He picked up the phone and dialed one of Therese’s friends. “Jan, have you heard from Therese yet?”  “No, sure haven’t.”  “Well, let me know, okay?”  “Sure.”  He thought vaguely about trying to catch her at work, but he left earlier in the morning and came home later in the evening than she did.  Looking at her pictures on the wall, he thought of when they had first met, first lived together. There had been a time when he had loved her so much, he’d been bursting with it. Now he felt empty. He didn’t want her to hate him, but he still didn’t know if he could talk to her about what had happened. The idea that she would sit and listen to him didn’t seem realistic.  Even Annie wouldn’t listen to him any more.  He was alone. He’d done a big, dumb, terrible thing. It would have been different if Annie had reciprocated, if somehow they could have become lovers. Then it would have been them against the world, a new kind of relationship.  But Annie didn’t seem any different to Therese when it really came down to it. She didn’t have any more interest in him than Dr. Morris would have in Vemon. He’d imagined it.  He was alone. And without Annie’s consent, he was just a jerk who’d fucked an ape.  “I made a mistake,” he said aloud to Therese’s picture. “So let’s forget it.”  But he couldn’t forget.  “Dr. Morris wants to see you,” the secretary said as he came in.  “Okay.” He changed course for the administrative office. He whistled. In the past few days, Annie had been cool, but he felt that everything would settle down eventually. He felt better. Wondering what horrors or marvels Dr. Morris had to share with him, he knocked at her door and peered through the glass window. Probably another magazine burning, he thought.  She signaled him to come in. “Hello, Douglas.”  Annie, he thought, something’s happened.  He stood until she motioned him to sit down. She looked at his face for several seconds. “This is difficult for me,” she said.  She’s found out, he thought. But he put that aside, figuring it was a paranoia that made him worry. There’s no way. No way. I have to calm down or I’ll show it.  She held up a photograph.  There it was—a dispassionate and cold document of that one moment in his life. She held it up to him like an accusation. It shocked him as if it hadn’t been himself,  Defiance forced him to stare at the picture instead of looking for compassion in Dr. Morris’s eyes. He knew exactly where the picture had come from.  Vernon and his new telephoto lens.  He visualized the image of his act rising up in a tray of chemicals. Slowly, he looked away from it. Dr. Morris could not know how he had changed since that moment. He could make no protest or denial.  “I have no choice,” Dr. Morris said flatly. “I’d always thought that even if you weren’t good with people, at least you worked well with the apes. Thank God Henry, who does Vernon’s darkroom work, has promised not to say anything.”  Douglas was rising from his chair. He wanted to tear the picture out of her hands. He didn’t want her to see it. He wanted her to ask him if he had changed, let him reassure her that it would never happen again, that he understood he’d been wrong.  But her eyes were flat and shuttered against him. “We’ll send your things,” she said.  He paused at his car and saw two big red shapes—one coppery orange, one chocolate-red—sitting in the trees. Vernon bellowed out a groan that ended with an alien burbling. It was a wild sound full of the jungle and steaming rain.  Douglas watched Annie scratch herself and look toward some chimps walking the land beyond their boundary fence. As she started to turn her gaze in his direction, he ducked into his car.  I guess an ape wouldn’t understand me any more than a human, he thought, angrily trying to drive his shame away.    Originally published in Isaac Asimov’s Science Fiction Magazine, Mid-December, 1983.  Leigh Kennedy grew up in Denver and began writing in the nurturing atmosphere of the Northern Colorado Writer's Workshop. \"Her Furry Face\" was written during the five years she lived in Austin, Texas, before heading to England, where she's now lived for nearly thirty years. Her novels include The Journal of Nicholas the American and Saint Hiroshima, and a short-story collection, Faces. Her most recent book is a new collection, Wind Angles. She has two grown children, plays the viola socially, and writes very slowly.", "text": "5880 words, short story, REPRINT\nHer Furry Face\nDouglas was embarrassed when he saw Annie and Vernon mating.\nHe’d seen hours of sex between orangutans, but this time was different. He’d never seen Annie doing it. He stood in the shade of the pecan tree for a moment, iced tea glasses sweating in his hand, shocked, then he backed around the comer of the brick building. He was confused. The cicadas seemed louder than usual, the sun hotter, and the squeals of pleasure from the apes strange.\nHe walked back to the front porch and sat down. His mind still saw the two giant mounds of red-orange fur moving together like one being.\nWhen the two orangs came back around, Douglas thought he saw smugness in Vernon’s face. Why not, he thought? I guess I would be smug, too.\nAnnie flopped down on the grassy front yard and crossed one leg over the other, her abdomen bulging high; she gazed upward into the heavy white sky.\nVernon bounded toward Douglas. He was young and red-chocolate-colored. His face was still slim, without the older orangutan jowls yet.\n“Be polite,” Douglas warned him.\n“Drink tea, please?” Vernon signed rapidly, the fringe on his elbows waving. “Dry as bone.”\nDouglas handed Vernon one of the glasses of tea, though he’d brought it out for Annie. The handsome nine-year-old downed it in a gulp. “Thank you,” he signed. He touched the edge of the porch and withdrew his long fingers. “Could fry egg,” he signed, and instead of sitting, swung out hand-over-hand on the ropes between the roof of the schoolhouse and the trees. It was a sparse and dry substitute for the orang’s native rain forest.\nHe’s too young and crude for Annie, Douglas thought.\n“Annie,” Douglas called. “Your tea.”\nAnnie rolled onto one side and lay propped on an elbow, staring at him. She was lovely. Fifteen-years-old, her fur was glossy and coppery, her small yellow eyes in the fleshy face expressive and intelligent. She started to rise up toward him, but turned toward the road.\nThe mail jeep was coming down the highway.\nIn a blurred movement, she set off at a four-point gallop down the half-mile drive toward the mailbox. Vernon swung down from his tree and followed, giving a small groan.\nReluctant to go out in the sun, Douglas put down the tea anyway and followed the apes along the drive. By the time he got near them, Annie was sitting with mail sorted between her toes, holding an opened letter in her hands. She looked up with an expression on her face that he’d never seen—it could have been fear, but it wasn’t.\nShe handed the letter to Vernon, who pestered her for it. “Douglas,” she signed, “they want to buy my story.”\nTherese lay in the bathwater, her knees sticking up high, her hair floating beside her face. Douglas sat on the edge of the tub; as he talked to her he was conscious that he spoke a double language—the one with his lips and the other with his hands.\n“As soon as I called Ms. Young, the magazine editor, and told her who Annie was, she got really excited. She asked me why we hadn’t sent a letter explaining it with the story, so I told her that Annie didn’t want anyone to know first.”\n“Did Annie decide that?” Therese sounded skeptical, as she always seemed to when Douglas talked about Annie.\n“We talked about it and she wanted it that way.” Douglas felt the resistance from Therese. Why she never understood, he didn’t know, unless she did it to provoke him. She acted as though she thought an ape was still just an ape, no matter what he or she could do. “Anyway,” he said, “she talked about doing a whole publicity thing to the hilt—talk shows, autograph parties. You know. But Dr. Morris thinks it would be better to keep things quiet.”\n“Why?” Therese sat up; her legs went underwater and she soaped her arms.\n“Because she’d be too nervous. Annie, I mean. It might disrupt her education to become a celebrity. Too bad. Even Dr. Morris knows that it would be great for fundraising. But I guess we’ll let the press in some.”\nTherese began to shampoo her hair. “I brought home that essay that Sandy wrote yesterday. The one I told you about. Now if she were an orangutan instead of just a deaf kid, she could probably get it published in Fortune.” Therese smiled.\nDouglas stood. He didn’t like the way Therese headed for the old argument—no matter what one of Therese’s deaf students did, if Annie could do it one one-hundredth as well, it was more spectacular. Douglas knew it was true, but why Therese was so bitter about it, he didn’t understand.\n“That’s great,” he said, trying to sound enthusiastic.\n“Will you wash my back?” she asked.\nHe crouched and absent-mindedly washed her. “I’ll never forget Annie’s face when she read that letter.”\n“Thank you,” Therese said. She rinsed. “Do you have any plans for this evening?”\n“I’ve got work to do,” he said, leaving the bathroom. “Would you like me to work in the bedroom so you can watch television?”\nAfter a long pause, she said “No, I’ll read.”\nHe hesitated in the doorway. “Why don’t you go to sleep early? You look tired.”\nShe shrugged. “Maybe I am.”\nIn the playroom at the school, Douglas watched Annie closely. It was still morning, though late. In the recliner across the room from him, she seemed a little sleepy. Staring out the window, blinking, she marked her place in Pinkwater’s Fat Men From Space with a long brown finger.\nHe had been thinking about Therese, who’d been silent and morose that morning. Annie was never morose, though often quiet. He wondered if Annie was quiet today because she sensed that Douglas was not happy. When he’d come to work, she’d given him an extra hug.\nHe wondered if Annie could have a crush on him, like many schoolgirls have on their teachers. Remembering her mating with Vernon days before, he idly wandered into a fantasy of touching those petals of her genitals and gently, gently moving inside her.\nThe physical reaction to his fantasy embarrassed him. God, what am I thinking? He shook himself out of the reverie, averting his gaze for a few moments, until he’d gotten control of himself again.\n“Douglas,” Annie signed. She walked erect, towering, to him and sat down on the floor at his feet. Her flesh folded into her lap like dough.\n“What?” he asked, wondering suddenly if orangutans were telepathic.\n“Why you say my story children’s?”\nHe looked blankly at her.\n“Why not send Harper’s?” she asked, having to spell out the name of the magazine.\nHe repressed a laugh, knowing it would upset her. “It’s . . . it’s the kind of story children would like.”\n“Why?”\nHe sighed. “The level of writing is . . . young. Like you, sweetie.” He stroked her head, looking into the small, intense eyes. “You’ll get more sophisticated as you grow.”\n“I smart as you,” she signed. “You understand me always because I talk smart. You not always talk smart.”\nDouglas was dumbfounded by her logic.\nShe tilted her head and waited. When Douglas shrugged, she seemed to assume victory and returned to her recliner.\nDr. Morris came in. “Here we go,” she said, handing him the paper and leaving again.\nDouglas skimmed the page until he came to an article about the “ape author.” He scanned it. It contained one of her flashpoints; this and the fact that she was irritable from being in estrus made him consider hiding it. But that wouldn’t be right.\n“Annie,” he said softly.\nShe looked up.\n“There’s an article about you.”\n“Me read,” she signed, putting her book on the floor. She came and crawled up on the sofa next to him. He watched her eyes as they jerked across every word. He grew edgy. She read on.\nSuddenly she took off as if from a diving board. He ran after her as she bolted out the door. The stuffed dog which had always been a favorite toy was being shredded in those powerful hands even before he knew she had it. Annie screamed as she pulled the toy apart, running into the yard.\nTerrified by her own aggression, she ran up the tree with stuffing falling like snow behind her.\nDouglas watched as the shade filled with foam rubber and fake fur. The tree branches trembled. After a long while, she stopped pummeling the tree and sat quietly.\nShe spoke to herself with her long ape hand. “Not animal,” she said, “not animal.”\nDouglas suddenly realized that Therese was afraid of the apes.\nShe watched warily as the four of them strolled along the edge of the school acreage. Douglas knew that Therese didn’t appreciate the grace of Annie’s muscular gait as he did; the sign language that passed between them was as similar to the Ameslan that Therese used for her deaf children as British to Jamaican. Therese couldn’t appreciate Annie in creative conversation.\nIt wasn’t good to be afraid of the apes, no matter how educated they were.\nHe had invited her out, hoping it would please her to be included in his world here. She had only visited briefly twice before.\nVernon lagged behind them, snapping pictures now and then with his expensive but hardy camera modified for his hands. Vernon took several pictures of Annie and one of Douglas, but only when Therese had separated from him to peer in between the rushes at the edge of the creek.\n“Annie,” Douglas called, pointing ahead. “A cardinal. The red bird.”\nAnnie lumbered forward. She glanced back to see where Douglas pointed, then stood still, squatting. Douglas walked beside her and they watched the bird.\nIt flew.\n“Gone,” Annie signed.\n“Wasn’t it pretty, though?” Douglas asked.\nThey ambled on. Annie stopped often to investigate shiny bits of trash or large bugs. They rarely came this far from the school. Vernon whizzed past them, a dark auburn streak of youthful energy.\nRemembering Therese, Douglas turned. She sat on a stump far behind. He was annoyed. He’d told her to wear her jeans and a straw hat because there would be grass burrs and hot sun. But there she sat, bare-headed, wearing shorts, miserably rubbing at her ankles.\nHe grunted impatiently. Annie looked up at him. “Not you,” he said, stroking her fur. She patted his butt.\n“Go on,” Douglas said, turning his back. When he came to Therese, he said, “What’s the problem?”\n“No problem.” She started forward without looking at him. “I was just resting.”\nAnnie had paused to poke at something on the ground with a stick. Douglas quickened his step. Even though his students were smart, they had orangutan appetites. He always worried that they would eat something that would sicken them. “What is it?” he called.\n“Dead cat,” Vernon signed back. He took a picture as Annie flipped the carcass with her stick.\nTherese hurried forward. “Oh, poor kitty,” she said, kneeling.\nAnnie had seemed too absorbed in poking the cat to notice Therese approach. Only a quick eye could follow her leap. Douglas was stunned.\nBoth screamed. It was over.\nAnnie clung to Douglas’s legs, whimpering.\n“Shit!” Therese said. She lay on the ground, rolling from side to side, holding her left arm. Blood dripped from between her fingers.\nDouglas pushed Annie back. “That was bad, very bad,” he said. “Do you hear me?”\nAnnie sank down on her rump and covered her head. She hadn’t gotten a child-scolding for a long time. Vernon stood beside her, shaking his head, signing, “Not wise, baboon-face.”\n“Stand up,” Douglas said to Therese. “I can’t help you right now.”\nTherese was pale, but dry-eyed. Clumsily, she stood and grew even paler. A hunk of flesh hung loosely from above her elbow, meaty and bleeding. “Look.”\n“Go on. Walk back to the house. We’ll come right behind you.” He tried to keep his voice calm, holding a warning hand on Annie’s shoulder.\nTherese moaned, catching her breath. “It hurts,” she said, but stumbled on.\n“We’re coming,” Douglas said sternly. “Just walk and—Annie, don’t you dare step out of line.”\nThey walked silently, Therese ahead, leaving drops of blood in the dirt. The drops got larger and closer together. Once, Annie dipped her finger into a bloody spot and sniffed her fingertip.\nWhy can’t things just be easy and peaceful, he wondered? Something always happens. Always. He should have known better than to bring Therese around Annie. Apes didn’t understand that vulnerable quality that Therese was made of. He himself didn’t understand it, though at one time he’d probably been attracted to it. No—maybe he had never really seen it until it was too late. He’d only thought of Therese as “sweet” until their lives were too tangled up to keep clear of it.\nWhy couldn’t she be as tough as Annie? Why did she always take everything so seriously?\nThey reached the building. Douglas sent Annie and Vernon to their rooms and guided Therese to the infirmary. He watched as Jim, their all-purpose nurse and veterinary assistant examined her arm. “I think you should probably have stitches.”\nHe left the room to make arrangements.\nTherese looked at Douglas, holding the gauze over her still-bleeding arm. “Why did she bite me?” she asked.\nDouglas didn’t answer. He couldn’t think of how to express it.\n“Do you have any idea?” she asked.\n“You asked for it, all your wimping around.”\n“I . . . ”\nDouglas saw the anger rising in her. He didn’t want to argue now. He wished he’d never brought her. He’d done it all for her, and she had ruined it.\n“Don’t start,” he said simply, giving her a warning look.\n“But, Douglas, I didn’t do anything.”\n“Don’t start,” he repeated.\n“I see now,” she said coldly. “Somehow it’s my fault again.”\nJim returned with his supplies.\n“Do you want me to stay?” Douglas asked. He suddenly felt a pang of guilt, realizing that she was actually hurt enough for all this attention.\n“No,” she said softly.\nAnd her eyes looked far, far from him as he left her.\nOn the same day that the largest donation ever came to the school, a television news team came out to tape.\nDouglas could tell that everyone was excited. Even the chimps that lived on the north half of the school hung on the fence and watched the TV van being unloaded. The reporter decided upon the playroom as the best location for the taping, though she didn’t seem to relish sitting on the floor with the giant apes. People went over scripts, strung cords and microphones, set up hot lights, and discussed angles and sound while pointing at the high ceiling’s jungle-gym design. All this to talk to a few people and an orangutan.\nThey brought Annie’s desk into the playroom, contrary to Annie’s wishes. Douglas explained that it was temporary, that these people would go away after they talked a little. Douglas and Annie stayed outside as long as possible and played Tarzan around the big tree. He tickled her. She grabbed him as he swung from a limb. “Kagoda?” she signed, squeezing him with one arm.\n“Kagoda!” he shouted, laughing.\nThey relaxed on the grass. Douglas was hot. He felt flushed all over. “Douglas,” Annie signed, “they read story?”\n“Not yet. It isn’t published yet.”\n“Why talk me?”\n“Because you wrote it and sold it and people like to interview famous authors.” He groomed her shoulder. “Time to go in,” he said, seeing a wave from inside.\nAnnie picked him up in a big hug and carried him in.\n“Here it is!” Douglas called to Therese, and turned on the video-recorder.\nFirst, a long shot of the school from the dusty drive, looking only functional and square, without personality. The reporter’s voice said, “Here, just south-east of town, is a special school with unusual young students. The students here have little prospect for employment when they graduate, but millions of dollars each year fund this institution.”\nA shot of Annie at her typewriter, picking at the keyboard with her long fingers; a sheet of paper is slowly covered with large block letters.\n“This is Annie, a fifteen-year-old orangutan, who has been a student with the school for five years. She graduated with honors from another “ape school” in Georgia before coming here. And now Annie has become a writer. Recently, she sold a story to a children’s magazine. The editor who bought the story didn’t know that Annie was an orangutan until after she had selected the story for publication.”\nAnnie looked at the camera uncertainly.\n“Annie can read and write and understand spoken English, but she cannot speak. She uses a sign language similar to the one hearing-impaired use.” Change in tone from narrative to interrogative. “Annie, how did you start writing?”\nDouglas watched himself on the small screen watching Annie sign, “Teacher told me write.” He saw himself grin, eyes shift slightly toward the camera, but generally watching Annie. His name and “Orangutan Teacher” appeared on the screen. The scene made him uneasy.\n“What made you send in Annie’s story for publication?” the reporter asked.\nDouglas signed to Annie, she came to him for a hug, and turned a winsome face to the camera. “Our administrator, Dr. Morris, and I both thought it was as good as any kids’ story, so Dr. Morris said, ‘Send it in.’ The editor liked it.” Annie nervously made “pee” sign to Douglas.\nThen, a shot of Dr. Morris in her office, a chimp on her lap, clapping her brown hands.\n“Dr. Morris, your school was established five years ago by grants and government funding. What is your purpose here?”\n“Well, in the last few decades, apes—mostly chimpanzees like Rose here—have been taught sign language experimentally. Mainly to prove that apes could indeed use language.” Rosie put the tip of her finger through the gold hoop in Dr. Morris’s ear. Dr. Morris took her hand away gently. “We were established with the idea of educating apes, a comparable education to the primary grades.” She looked at the chimp. “Or however far they will advance.”\n“Your school has two orangutans and six chimpanzees. Are there differences in their learning?” the reporter asked.\nDr. Morris nodded emphatically. “Chimpanzees are very clever, but the orang has a different brain structure which allows for more abstract reasoning. Chimps learn many things quickly, orangs are slower. But the orangutan has the ability to learn in greater depth.”\nShot of Vernon swinging on the ropes in front of the school.\nAssuming that Vernon is Annie, the reporter said, “Her teacher felt from the start that Annie was an especially promising student. The basic sentences that she types out on her typewriter are simple but original entertainment.”\nAnother shot of Annie at the typewriter.\n“If you think this is just monkey business, you’d better think again. Tolstoy, watch out!”\nDepressed by the lightness, brevity, and the stupid “monkey business” remark, Douglas turned off the television.\nHe sat for a long time. Whenever Therese had gone to bed, she had left him silently. After half an hour of staring at the blank screen, he rewound his video-recorder and ran it soundlessly until Annie’s face appeared.\nAnd then froze it. He could almost feel again the softness of her halo of red hair against his chin.\nHe couldn’t sleep.\nTherese had rumpled her way out of the sheet and lay on her side, her back to him. He looked at the shape of her shoulder and back, downward to the dip of the waist, up the curve of her hip. Her buttocks were round ovals, one atop the other. Her skin was sleek and shiny in the filtered street light coming through the window. She smelled slightly of shampoo and even more slightly of female.\nWhat he felt for her, when he thought of her generally, anyone could call love. And yet, he found himself helplessly angry with her most of the time. When he thought he could amuse her, it would end with her feelings being hurt for some obscure reason. He heard cruel words come barging out of an otherwise gentle mouth. She took everything seriously; mishaps and misunderstandings occurred beyond his control, beyond his repair.\nUnder this satiny skin, she was troubled and tense. A lot of sensitivity and fear. He had stopped trying to gain access to what had been the happier parts of her person, not understanding where they had gone. He had stopped wanting to love her, but he didn’t not want to love her, either. It just did not seem to matter.\nSometimes, he thought, it would be easier to have someone like Annie for a wife.\nAnnie.\nHe loved her furry face. He loved the unconditional joy in her face when she saw him. She was bright and warm and unafraid. She didn’t read things into what he said, but listened and talked with him. They were so natural together. Annie was so filled with vitality.\nDouglas withdrew his hand from Therese, whose skin seemed a bare blister of dissatisfaction.\nHe lay on the floor of the apes’ playroom with the fan blowing across his chest. He held Annie’s report on Lawrence’s Sons and Lovers by diagonal corners to keep it from flapping.\nAnnie lazily swung from bars crisscrossing the ceiling.\n“Paul wasn’t happy at work because the boss looked over his shoulder at his handwriting,” she had written. “But he was happy again later. His brother died and his mother was sad. Paul got sick. He was better and visited his friends again. His mother died and his friends didn’t tickle him any more.”\nDouglas looked over the top of the paper at Annie. True, it was the first time she’d read an “adult” novel, but he had expected something better than this. He considered asking her if Vernon had written the report for her, but thought better of it.\n“Annie,” he said, sitting up. “What do you think this book is really about?”\nShe swung down and landed on the sofa. “About man,” she said.\nDouglas waited. There was no more. “But what about it? Why this man instead of another? What was special about him?”\nAnnie rubbed her hands together, answerless.\n“What about his mother?”\n“She help him,” Annie answered in a flurry of dark fingers. “Especially when he paint.”\nDouglas frowned. He looked at the page again, disappointed.\n“What I do?” Annie asked, worried.\nHe tried to brighten up. “You did just fine. It was a hard book.”\n“Annie smart,” the orang signed. “Annie smart.”\nDouglas nodded. “I know.”\nAnnie rose, then stood on her legs, looking like a two-story fuzzy building, teetering from side to side. “Annie smart. Writer. Smart,” she signed. “Write book. Bestseller.”\nDouglas made a mistake. He laughed. Not as simple as a human laughing at another, this was an act of aggression. His bared teeth and uncontrolled guff-guff struck out at Annie. He tried to stop.\nShe made a gulping sound and galloped out of the room.\n“Wait, Annie!” He chased after her.\nBy the time he got outside she was far ahead. He stopped running when his chest hurt and trotted slowly through the weeds toward her. She sat forlornly far away and watched him come.\nWhen he was near, she signed “hug” three times.\nDouglas collapsed, panting, his throat raw. “Annie, I’m sorry,” he said. “I didn’t mean it.” He put his arms around her.\nShe held onto him.\n“I love you, Annie. I love you so much I don’t want ever to hurt you. Ever, ever, ever. I want to be with you all the time. Yes, you’re smart and talented and good.” He kissed her tough face.\nWhether forgotten or forgiven, the hurt of his laughter was gone from her eyes. She held him tighter, making a soft sound in her throat, a sound for him.\nThey lay together in the crackling yellow weeds, clinging. Douglas felt his love physically growing for her. More passionately than ever before in his life, he wanted to make love to her. He touched her. He felt that she understood what he wanted, that her breath on his neck was anticipation. A consummation as he’d never imagined, the joining of their species in language and body. Not dumb animal-banging but mutual love . . . He climbed over her and hugged her back.\nAnnie went rigid when he entered her.\nSlowly, she rolled away from him, but he held onto her. “No.” A horrible grimace came across her face that raised the hairs on the back of Douglas’s neck. “Not you,” she said.\nShe’s going to kill me, he thought.\nHis passion declined; Annie disentangled herself and walked away.\nHe sat for a moment, stunned at what he’d done, at what had happened, wondering what he would do for the rest of his life with the memory of it. Then he zipped up his pants.\nStaring at his dinner plate, he thought, it’s just the same as if I had been rejected by a woman.\nHis hands could still remember the matted feel of her fur; tucked in his groin was the memory of being in an alien place. It had made him throw up out in the field that afternoon, and afterwards he’d come straight home. He hadn’t even said good night to the orangs.\n“What’s the matter?” Therese asked.\nHe shrugged.\nShe half-rose out of her chair to kiss him on the temple. “You don’t have a fever, do you?”\n“No.”\n“Can I do something to make you feel better?” Her hand slid along his thigh.\nHe stood up. “Stop it.”\nShe sat still. “Are you in love with another woman?”\nWhy can’t she just leave me alone. “No. I have a lot on my mind.”\n“It never was like this, even when you were working on your thesis.”\n“Therese,” he said, with what he felt was undeserved patience, “just leave me alone. It doesn’t help with you at me all the time.”\n“But I”m scared. I don’t know what to do. You act like you don’t want me around.”\n“All you do is criticize me.” He stood and took his dishes to the sink.\nSlowly, she trailed after him, carrying her plate. “I”m just trying to understand. It’s my life, too.”\nHe said nothing and she walked away as if someone had told her not to leave footsteps.\nIn the bathroom, he stripped and stood under the shower for a long time. He imagined that Annie’s smell clung to him. He felt that Therese could smell it on him.\nWhat have I done, what have I done . . . ?\nAnd when he came out of the shower, Therese was gone.\nHe had considered calling in sick, but he knew that it would be just as miserable to stay around the house and think about Annie, think about Therese, and worse, to think about himself.\nHe dressed for work, but couldn’t eat breakfast. Realizing that his pain showed, he straightened his shoulders, but found them drooping again as he got out of the car at work.\nWith some fear, he came through the office. The secretary greeted him with rolling eyes. “Someone’s given out our number again,” she said as the phone buzzed. Another line was on hold. “This morning there was a man standing at the window watching me until Gramps kicked him off the property.”\nDouglas shook his head in sympathy with her and approached the orang’s door. He felt nauseated again.\nVernon sat at his typewriter, composing captions for his photo album. He didn’t get up to greet Douglas, but gave him an evaluative stare.\nDouglas patted his shoulder. “Working?” he asked.\n“Like dog,” Vernon said and returned to typing.\nAnnie sat outside on the back porch. Douglas opened the door and stood beside her. She looked up at him, but—like Vernon—made no move toward the customary hug. The morning was still cool, the shadow of the building still long in front of them. Douglas sat down.\n“Annie,” he said softly. “I”m sorry. I’ll never do it again. You see, I felt . . . ” He stopped. It wasn’t any easier than it had been to talk to Oona, or Wendy, or Shelley, or Therese . . . He realized then that he didn’t understand her any more than he’d understood them. Why had she rejected him? What was she thinking? What would happen from now on? Would they be friends again?\n“Oh, hell,” he said. He stood. “It won’t happen again.”\nAnnie gazed away into the trees.\nHe felt strained all over, especially in his throat. He stood by her a long time.\n“I don’t want write stories,” she signed.\nDouglas stared at her. “Why?”\n“Don’t want.” She seemed to shrug.\nDouglas wondered what had happened to the confident ape who’d planned to write a bestseller the day before. “Is that because of me?”\nShe didn’t answer.\n“I don’t understand,” he said. “Do you want to write it down for me? Could you explain it that way?”\n“No,” she signed, “can’t explain. Don’t want.”\nHe continued. “What do you want?”\n“Sit tree. Eat bananas, chocolate. Drink brandy.” She looked at him seriously. “Sit tree. Day, day, day, week, month, year.”\nChrist almighty, he thought, she’s having a goddamned existential crisis. All the years of education. All the accomplishments. The hopes of an entire field of primatology. All shot to hell because of a moody ape. It can’t just be me. This would have happened sooner or later, maybe . . . He thought of all the effort he would have to make to repair their relationship. It made him tired.\n“Annie, why don’t we just ease up a little on your work. You can rest today. You can go sit in the trees all of today and I’ll bring you a glass of wine.”\nShe shrugged again.\nOh, I’ve botched it, he thought. What an idiot. He felt a pain coming back, a pain like poison, with a focal point but shooting through his heart and hands, making him dizzy and short of breath.\nAt least she doesn’t hate me, he thought, squatting to touch her hand.\nShe bared her teeth.\nDouglas froze. She slid away from him and headed for the trees.\nHe sat alone at home and watched the newscast. In a small midwestern town they burned the issues of the magazine with Annie’s story in it.\nA heavy woman in a windbreaker was interviewed with the bonfire in the background. “I don’t want my children reading things that weren’t even written by humans. I have human children and this godless ape is not going to tell its stories to them.”\nA quick interview with Dr. Morris, who looked even more tired and introverted than usual. “The story is a very innocent tale, told by an innocent personality. I really don’t think she has any ability or intention to corrupt . . . ”\nHe turned the television off. He picked up the phone and dialed one of Therese’s friends. “Jan, have you heard from Therese yet?”\n“No, sure haven’t.”\n“Well, let me know, okay?”\n“Sure.”\nHe thought vaguely about trying to catch her at work, but he left earlier in the morning and came home later in the evening than she did.\nLooking at her pictures on the wall, he thought of when they had first met, first lived together. There had been a time when he had loved her so much, he’d been bursting with it. Now he felt empty. He didn’t want her to hate him, but he still didn’t know if he could talk to her about what had happened. The idea that she would sit and listen to him didn’t seem realistic.\nEven Annie wouldn’t listen to him any more.\nHe was alone. He’d done a big, dumb, terrible thing. It would have been different if Annie had reciprocated, if somehow they could have become lovers. Then it would have been them against the world, a new kind of relationship.\nBut Annie didn’t seem any different to Therese when it really came down to it. She didn’t have any more interest in him than Dr. Morris would have in Vemon. He’d imagined it.\nHe was alone. And without Annie’s consent, he was just a jerk who’d fucked an ape.\n“I made a mistake,” he said aloud to Therese’s picture. “So let’s forget it.”\nBut he couldn’t forget.\n“Dr. Morris wants to see you,” the secretary said as he came in.\n“Okay.” He changed course for the administrative office. He whistled. In the past few days, Annie had been cool, but he felt that everything would settle down eventually. He felt better. Wondering what horrors or marvels Dr. Morris had to share with him, he knocked at her door and peered through the glass window. Probably another magazine burning, he thought.\nShe signaled him to come in. “Hello, Douglas.”\nAnnie, he thought, something’s happened.\nHe stood until she motioned him to sit down. She looked at his face for several seconds. “This is difficult for me,” she said.\nShe’s found out, he thought. But he put that aside, figuring it was a paranoia that made him worry. There’s no way. No way. I have to calm down or I’ll show it.\nShe held up a photograph.\nThere it was—a dispassionate and cold document of that one moment in his life. She held it up to him like an accusation. It shocked him as if it hadn’t been himself,\nDefiance forced him to stare at the picture instead of looking for compassion in Dr. Morris’s eyes. He knew exactly where the picture had come from.\nVernon and his new telephoto lens.\nHe visualized the image of his act rising up in a tray of chemicals. Slowly, he looked away from it. Dr. Morris could not know how he had changed since that moment. He could make no protest or denial.\n“I have no choice,” Dr. Morris said flatly. “I’d always thought that even if you weren’t good with people, at least you worked well with the apes. Thank God Henry, who does Vernon’s darkroom work, has promised not to say anything.”\nDouglas was rising from his chair. He wanted to tear the picture out of her hands. He didn’t want her to see it. He wanted her to ask him if he had changed, let him reassure her that it would never happen again, that he understood he’d been wrong.\nBut her eyes were flat and shuttered against him. “We’ll send your things,” she said.\nHe paused at his car and saw two big red shapes—one coppery orange, one chocolate-red—sitting in the trees. Vernon bellowed out a groan that ended with an alien burbling. It was a wild sound full of the jungle and steaming rain.\nDouglas watched Annie scratch herself and look toward some chimps walking the land beyond their boundary fence. As she started to turn her gaze in his direction, he ducked into his car.\nI guess an ape wouldn’t understand me any more than a human, he thought, angrily trying to drive his shame away.\nOriginally published in Isaac Asimov’s Science Fiction Magazine, Mid-December, 1983.\nLeigh Kennedy grew up in Denver and began writing in the nurturing atmosphere of the Northern Colorado Writer's Workshop. \"Her Furry Face\" was written during the five years she lived in Austin, Texas, before heading to England, where she's now lived for nearly thirty years. Her novels include The Journal of Nicholas the American and Saint Hiroshima, and a short-story collection, Faces. Her most recent book is a new collection, Wind Angles. She has two grown children, plays the viola socially, and writes very slowly.", "source": "https://clarkesworldmagazine.com/kennedy_09_14_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Her Furry Face by Leigh Kennedy"}