{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jason Heller", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "awHy2gRJvHI39kt0NlUf/Ho1qCc=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Silver Machine: Hawkwind's Space Rock Journey throughout Science Fiction and Fantasy  From Jeff Wayne’s Musical Version of the War of the Worlds to Blind Guardian’s Nightfall in Middle-Earth, a handful of music albums have adapted entire works of science fiction/fantasy. This month, the long-running British space-rock band Hawkwind will do the same with the release of The Machine Stops—an album that musically interprets E. M. Forster’s dystopian novelette of the same name, published in 1909.  Although Forster was better known for his realistic, contemporaneous novels, most famously A Passage to India, the Nobel-nominated author imbued “The Machine Stops” with a prescience that rivals the most forward-thinking science fiction classics. In it, the post-apocalyptic civilization of the future has been driven underground; people interact virtually through electronic devices and rely on the omnipotent Machine for all their needs.  Not only does Forster’s screed against technocracy bear chilling parallels to the most pessimistic views of the Internet today, it’s perfect material for Hawkwind. Since forming in the London neighborhood of Ladbroke Grove in 1969—sparked in part by Pink Floyd’s spacey songs of the ’60s like “Astronomy Domine,” “Interstellar Overdrive,” and “Set the Controls for the Heart of the Sun”—the cult outfit has been one of rock music’s foremost champions of SFF.  Their best-known song, 1972’s British Top-Ten single “Silver Machine,” turned hypnotic, brutally psychedelic riffs into a vessel for extraterrestrial exploration, one that “flies sideways through time”—part of a “shamanistic space ritual,” as Rob Young calls it in Electric Eden: Unearthing Britain’s Visionary Music, a description that echoes the title of Hawkwind’s epochal 1973 album Space Ritual Live Alive in Liverpool and London.  As willfully primitive as Hawkwind sounded, they incorporated cutting-edge synthesizers, playing them with rudimentary gusto rather than trying to make them sound neoclassical like so many of their progressive rock peers, such as Yes and Emerson, Lake & Palmer. As Dave Brock—co-founder of Hawkwind and the band’s only consistent member throughout its existence—said in 1990, “I prefer to be a barbarian with the machines as it were, and just muck around.”  That mucking around with emerging technology produced some of the most visceral yet cerebral rock ‘n’ roll ever made—a volatile alchemy that influenced electronic music as well as punk and heavy metal. That the band’s bassist and occasional lead vocalist in the early ’70s was Ian “Lemmy” Kilmister—who would go on to front the legendary metal trio Motörhead before passing away in December of 2015—certainly didn’t hurt in that regard.  Hawkwind isn’t the first band to have paid musical tribute to Forster’s The Machine Stops: The British jazz-pop group Level 42 released a song in 1983 titled “The Machine Stops” whose lyrics are based on the story. And Hawkwind’s The Machine Stops isn’t the first time Brock and crew have devoted an entire record to the work of a single science fiction/fantasy author. The Chronicle of the Black Sword, released in 1985, draws from the Eternal Champion stories of Michael Moorcock, specifically the characters Elric of Melniboné and Jerry Cornelius, with Moorcock receiving a songwriting credit for his lyrics on the track “Sleep of a Thousand Tears.” Ten years prior, Hawkwind plumbed the same source for much of their 1975 album Warrior on the Edge of Time; Moorcock’s concepts and poetry are incorporated into four of the record’s songs, including the eerie spoken-word track “The Wizard Blew His Horn.”  It only made sense that Moorcock’s words and ideas wound up on Hawkwind records. The author was not only a fan of Hawkwind—first seeing them perform in the early ’70s with one of his New Worlds cohorts, the young M. John Harrison, in tow—he wound up playing with Hawkwind. Moorcock also lived in Ladbroke Grove, then a melting pot of rock’s underground subculture, and befriended Brock, Nik Turner, Robert Calvert, and the rest of Hawkwind. Before long, Moorcock was collaborating with the band, not only bringing lyrics to the band but joining them from time to time onstage.  The track “The Black Corridor” from Space Ritual—an eerie, spoken-word piece laden with echoes and cosmic doom—was adapted from Moorcock’s 1969 SF novel of the same name (a collaboration with his then-wife Hilary Bailey); on the same album, “Sonic Attack,” was an original set of Moorcock lyrics recited by Calvert through oscillating, disorienting effects. “Try to get as far away from the sonic source as possible,” Calvert warns, and he doesn’t sound like he’s joking.  Moorcock also formed his own group called Michael Moorcock & the Deep Fix, aided by various Hawkwind personnel (including Simon House, who would go on to play with rock’s most successful exponent of SFF music, David Bowie, not to mention contributing the memorable violin part to one of best SF-themed songs of the ’80s, Thomas Dolby’s “She Blinded Me with Science”). As Moorcock remembers in London Peculiar and Other Nonfiction, “I think it was Dave Brock who encouraged me to do a demo of two songs I’d written, ‘Dodgem Dude’ and ‘Starcruiser’”—which led directly to The Deep Fix getting a recording contract of their own.  The Deep Fix’s resulting album, 1975’s New Worlds Fair, was named after New Worlds, the revolutionary SFF magazine Moorcock edited; that year he played banjo on Calvert’s second solo album, Lucky Leif and the Longships. Moorcock went on to play guitar on Calvert’s next solo album, 1981’s Hype. Also in ’81, he wrote lyrics for four songs on Hawkwind’s album Sonic Attack, one of them a revamp of the Sonic Ritual track.  Calvert, Moorcock’s closest friend in Hawkwind, left the band in 1979, suffering from bipolar disorder, which impaired his ability to make music collectively. Moorcock’s association with Hawkwind effectively ended three years later with his lyrics for Choose Your Masques. The 1982 album also featured Calvert’s last set of lyrics for the group, leftover from 1978 and titled “Fahrenheit 451” (based on the canonical Ray Bradbury novel). Moorcock’s association with the band continued, including a memorable concert at London’s Hammersmith Odeon in 1985—a lavish stage reenactment of the Elric storyline from The Chronicle of the Black Sword—during which Moorcock himself appeared onstage. In Ian Abrahams’ Hawkwind: Sonic Assassins, Moorcock recounts, “I distributed a bunch of Elric books, throwing them into the audience, and was shocked when people tore them to bits trying to get to them!”  Hawkwind wasn’t the only rock band Moorcock wrote for. His lyrics for Blue Öyster Cult aren’t as numerous as his output for Hawkwind—but they do boast the BÖC song “Veteran of a Thousand Psychic Wars,” which appear in the animated SFF film Heavy Metal. That said, the song reuses a Moorcock line from one of Hawkwind’s earlier, Eternal Champion-themed tracks, “Standing at the Edge.”  As if returning the favor, the campy SF novel Time of the Hawklords—billed as co-written by Moorcock and Michael Butterworth—starred thinly veiled members of Hawkwind. Lemmy, for instance, appeared as Count Motorhead, while Nik Turner became The Thunder Rider. Moorcock even pops up as the tongue-in-cheek surrogate Moorlock the Acid Sorcerer.  Moorcock, however, disowned the book and denied having anything to do with its authorship, although it’s based on many of Moorcock’s concepts. (Two sequels, the prose novel Queens of Deliria and the graphic novel Ledge of Darkness, dispensed entirely with the notion of Moorcock’s involvement.) Still, Time of the Hawklords—not to mention Hawkwind’s cameo in the Jerry Cornelius novel A Cure for Cancer—completed a profound circuit: Inspired by Moorcock’s sprawling mythology, Hawkwind became characters in that mythology.  Moorcock isn’t the only SFF legend Hawkwind has relied on for inspiration. Roger Zelazny, among the handful of American authors who wrote for Moorcock’s New Worlds, became another of the band’s literary muses. Three of their songs—1972’s “Lord of Light,” 1977’s “Damnation Alley,” and 1979’s “Jack of Shadows,” all either written or co-written by Calvert—were based on Zelazny novels of the same names, reiterating such themes as post-apocalyptic horror, magic meets computers, and how posthumanity dovetails with theology.  “Time We Left This World Today” from 1972 references the brain police from George Orwell’s Ninety Eighty-Four; “D-Rider” from 1974 mentions dragons and recalls Anne McCaffrey’s Dragonriders of Pern; 1979’s “High Rise” adapts J. G. Ballard’s horrific urban dystopia of the same name; “The War I Survived” from 1988 contains a nod to Kurt Vonnegut’s Slaughterhouse-Five; “3 or 4 Erections in the Course of a Night” from 1993 takes its title from a line in the SF movie Dreamscape; and “Alien (I Am)” from 1995 boasts a sample of dialogue from the Star Trek: The Next Generation episode “The Mind’s Eye.” Another song from the same album (Alien 4) is more blatantly named “Beam Me Up.”  Hawkwind’s love for Star Trek is reciprocal. William Shatner covered “Silver Machine” on his 2011 album Seeking Major Tom, lending his authoritative bombast to the astro-psychedelic masterpiece; two years later, former Hawkwind member Nik Turner made a guest appearance on Shatner’s tribute to progressive rock, Ponder the Mystery. In an interview in 2013, Brock enthused about Shatner’s vocals on a new version of “Sonic Attack,” which was supposed to appear on Hawkwind’s 2013 album Spacehawks. The remake of the song that wound up on Spacehawks, however, did not feature Shatner, and his version of “Sonic Attack” has yet to be released. One can only hope.  Not that Hawkwind draws only on other creators’ work for their SFF music—they’ve always had a healthy speculative imagination of their own. The ominous countdown of 1973’s apocalyptic “Ten Seconds Forever” has, according to Abrahams in Sonic Assassins, “the unlikely accolade of being the science fiction ‘Twelve Days of Christmas.’” The 1979 song “Uncle Sam’s on Mars” indulges two of Hawkwind’s other passions—radical politics and dark humor.  The unsettlingly mechanical “Automaton,” released in 1978 under the pseudonym The Hawklords, is answered by Hawkwind’s 1979 song “Robot,” which cites Isaac Asimov’s Three Laws of Robotics. The elaborate scenario of “The Age of the Micro Man,” also from ’79, involves a nightmare future where millions of workers are enslaved to an industrial elite who believe that the aliens who guide them are angels. Instead of being inspired by a science fiction story, the 1988 song “Heads”—about a group of disembodied heads preserved “in glass booths” and wired together to generate enormous powers—actually predates Greg Bear’s similarly themed novella Heads by three years.  One of Hawkwind’s most ambitious original concepts played out on their 1976 album Astounding Sounds, Amazing Music. The title and cover art pay homage to the magazines of the Golden Age of Science Fiction, specifically John W. Campbell’s Astounding Science Fiction and Hugo Gernsback’s Amazing Stories; each track was intended to stand as its own short story, like an anthology in song.  On the eve of the new millennium, Hawkwind brought their career in SFF full circle with In Your Area’s live version of “Aerospace Age Inferno” a song that originally appeared on Calvert’s 1974 solo debut, Captain Lockheed and the Starfighters. A fever dream of intergalactic travel, it calls back to “Silver Machine” with the line “The silver machine is worth more than you’re worth.” It also winks at one of Hawkwind’s early inspirations, Pink Floyd’s “Set the Controls for the Heart of the Sun,” with the gleefully sinister rejoinder “Set the controls for the heart of the Earth.”  For all of Hawkwind’s heady cosmic mysticism—their “decades-long interstellar mission to explore the occult mysteries of the cosmos,” says Peter Bebergal in Season of the Witch: How the Occult Saved Rock and Roll—they remain rooted in the SFF community. They’ve played at SFF cons—most notably Seacon ’84 in Brighton, England, at which the band’s beloved Roger Zelazny served as a guest of honor, and Worldcon 45 in 1987 at the same location. Said drummer Richard Chadwick in 1989, a year after he’d joined the group, “Every gig we did was like a science fiction convention.” Weathering numerous lineup changes, schisms, deaths, and even an internal lawsuit over ownership of the name, Hawkwind long ago solidified its position as one of the most reliable—yet thankfully unpredictable—practitioners of SFF music.  The band itself hasn’t always seen it that way. Soon after the release of Astounding Sounds, Amazing Music in 1976, Turner told the New Musical Express, “You can’t say there is a stereotype of what Hawkwind music should be, that it should be space rock or it should be all about science fiction or magic and sorcery.” Only seven years into its existence, the group was already feeling the squeeze of being pigeonholed. Calvert even went so far as to say in a 1978 interview with the same magazine, “I don’t like SF that much. Nobody in this band is particularly an SF fanatic,” adding, “Most SF is trash, actually.”  Bearing in mind Calvert’s mental issues at the time—later that year, his clinical depression resulted in the cancellation of a Hawkwind tour and his subsequent exit from the group—he may have simply been bucking against the space-rock stereotype that he’d wholeheartedly helped cultivate. Just one year earlier, he proudly told the fanzine Sniffin’ Flowers that he considered Hawkwind to be “a science fiction band […] in actual fact we are the only band that is doing that sort of thing”—an exaggerated claim, but the point stands; the same year he boasted in another fanzine, Album Tracking, “We even get letters from University people, in the States in particular, who have found parallels between science fiction and the literature of the past and who can fit Hawkwind into that scheme. I still think we’re closely aligned with that.”  Calvert died in 1988 of a heart attack, just shy of Hawkwind’s twentieth anniversary. This year the band turns forty-seven, and The Machine Stops is their thirtieth studio album, not counting scores of live albums, archival collections, EPs, singles, bootlegs, and releases by their many offshoot groups and solo projects—almost all of them with a finger in SFF. And with The Machine Stops, Hawkwind shows no signs of letting that association lapse—instead, they’re doubling down on it, releasing one of the most extravagantly faithful SFF albums in their long, storied career. Or as Moorcock so speculatively put it in Sonic Assassins, Hawkwind is “like the mad crew of a long-distance spaceship who had forgotten their mission, which had turned to art during the passage of time.” Jason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "text": "Non-Fiction\nSilver Machine: Hawkwind's Space Rock Journey throughout Science Fiction and Fantasy\nFrom Jeff Wayne’s Musical Version of the War of the Worlds to Blind Guardian’s Nightfall in Middle-Earth, a handful of music albums have adapted entire works of science fiction/fantasy. This month, the long-running British space-rock band Hawkwind will do the same with the release of The Machine Stops—an album that musically interprets E. M. Forster’s dystopian novelette of the same name, published in 1909.\nAlthough Forster was better known for his realistic, contemporaneous novels, most famously A Passage to India, the Nobel-nominated author imbued “The Machine Stops” with a prescience that rivals the most forward-thinking science fiction classics. In it, the post-apocalyptic civilization of the future has been driven underground; people interact virtually through electronic devices and rely on the omnipotent Machine for all their needs.\nNot only does Forster’s screed against technocracy bear chilling parallels to the most pessimistic views of the Internet today, it’s perfect material for Hawkwind. Since forming in the London neighborhood of Ladbroke Grove in 1969—sparked in part by Pink Floyd’s spacey songs of the ’60s like “Astronomy Domine,” “Interstellar Overdrive,” and “Set the Controls for the Heart of the Sun”—the cult outfit has been one of rock music’s foremost champions of SFF.\nTheir best-known song, 1972’s British Top-Ten single “Silver Machine,” turned hypnotic, brutally psychedelic riffs into a vessel for extraterrestrial exploration, one that “flies sideways through time”—part of a “shamanistic space ritual,” as Rob Young calls it in Electric Eden: Unearthing Britain’s Visionary Music, a description that echoes the title of Hawkwind’s epochal 1973 album Space Ritual Live Alive in Liverpool and London.\nAs willfully primitive as Hawkwind sounded, they incorporated cutting-edge synthesizers, playing them with rudimentary gusto rather than trying to make them sound neoclassical like so many of their progressive rock peers, such as Yes and Emerson, Lake & Palmer. As Dave Brock—co-founder of Hawkwind and the band’s only consistent member throughout its existence—said in 1990, “I prefer to be a barbarian with the machines as it were, and just muck around.”\nThat mucking around with emerging technology produced some of the most visceral yet cerebral rock ‘n’ roll ever made—a volatile alchemy that influenced electronic music as well as punk and heavy metal. That the band’s bassist and occasional lead vocalist in the early ’70s was Ian “Lemmy” Kilmister—who would go on to front the legendary metal trio Motörhead before passing away in December of 2015—certainly didn’t hurt in that regard.\nHawkwind isn’t the first band to have paid musical tribute to Forster’s The Machine Stops: The British jazz-pop group Level 42 released a song in 1983 titled “The Machine Stops” whose lyrics are based on the story. And Hawkwind’s The Machine Stops isn’t the first time Brock and crew have devoted an entire record to the work of a single science fiction/fantasy author. The Chronicle of the Black Sword, released in 1985, draws from the Eternal Champion stories of Michael Moorcock, specifically the characters Elric of Melniboné and Jerry Cornelius, with Moorcock receiving a songwriting credit for his lyrics on the track “Sleep of a Thousand Tears.” Ten years prior, Hawkwind plumbed the same source for much of their 1975 album Warrior on the Edge of Time; Moorcock’s concepts and poetry are incorporated into four of the record’s songs, including the eerie spoken-word track “The Wizard Blew His Horn.”\nIt only made sense that Moorcock’s words and ideas wound up on Hawkwind records. The author was not only a fan of Hawkwind—first seeing them perform in the early ’70s with one of his New Worlds cohorts, the young M. John Harrison, in tow—he wound up playing with Hawkwind. Moorcock also lived in Ladbroke Grove, then a melting pot of rock’s underground subculture, and befriended Brock, Nik Turner, Robert Calvert, and the rest of Hawkwind. Before long, Moorcock was collaborating with the band, not only bringing lyrics to the band but joining them from time to time onstage.\nThe track “The Black Corridor” from Space Ritual—an eerie, spoken-word piece laden with echoes and cosmic doom—was adapted from Moorcock’s 1969 SF novel of the same name (a collaboration with his then-wife Hilary Bailey); on the same album, “Sonic Attack,” was an original set of Moorcock lyrics recited by Calvert through oscillating, disorienting effects. “Try to get as far away from the sonic source as possible,” Calvert warns, and he doesn’t sound like he’s joking.\nMoorcock also formed his own group called Michael Moorcock & the Deep Fix, aided by various Hawkwind personnel (including Simon House, who would go on to play with rock’s most successful exponent of SFF music, David Bowie, not to mention contributing the memorable violin part to one of best SF-themed songs of the ’80s, Thomas Dolby’s “She Blinded Me with Science”). As Moorcock remembers in London Peculiar and Other Nonfiction, “I think it was Dave Brock who encouraged me to do a demo of two songs I’d written, ‘Dodgem Dude’ and ‘Starcruiser’”—which led directly to The Deep Fix getting a recording contract of their own.\nThe Deep Fix’s resulting album, 1975’s New Worlds Fair, was named after New Worlds, the revolutionary SFF magazine Moorcock edited; that year he played banjo on Calvert’s second solo album, Lucky Leif and the Longships. Moorcock went on to play guitar on Calvert’s next solo album, 1981’s Hype. Also in ’81, he wrote lyrics for four songs on Hawkwind’s album Sonic Attack, one of them a revamp of the Sonic Ritual track.\nCalvert, Moorcock’s closest friend in Hawkwind, left the band in 1979, suffering from bipolar disorder, which impaired his ability to make music collectively. Moorcock’s association with Hawkwind effectively ended three years later with his lyrics for Choose Your Masques. The 1982 album also featured Calvert’s last set of lyrics for the group, leftover from 1978 and titled “Fahrenheit 451” (based on the canonical Ray Bradbury novel). Moorcock’s association with the band continued, including a memorable concert at London’s Hammersmith Odeon in 1985—a lavish stage reenactment of the Elric storyline from The Chronicle of the Black Sword—during which Moorcock himself appeared onstage. In Ian Abrahams’ Hawkwind: Sonic Assassins, Moorcock recounts, “I distributed a bunch of Elric books, throwing them into the audience, and was shocked when people tore them to bits trying to get to them!”\nHawkwind wasn’t the only rock band Moorcock wrote for. His lyrics for Blue Öyster Cult aren’t as numerous as his output for Hawkwind—but they do boast the BÖC song “Veteran of a Thousand Psychic Wars,” which appear in the animated SFF film Heavy Metal. That said, the song reuses a Moorcock line from one of Hawkwind’s earlier, Eternal Champion-themed tracks, “Standing at the Edge.”\nAs if returning the favor, the campy SF novel Time of the Hawklords—billed as co-written by Moorcock and Michael Butterworth—starred thinly veiled members of Hawkwind. Lemmy, for instance, appeared as Count Motorhead, while Nik Turner became The Thunder Rider. Moorcock even pops up as the tongue-in-cheek surrogate Moorlock the Acid Sorcerer.\nMoorcock, however, disowned the book and denied having anything to do with its authorship, although it’s based on many of Moorcock’s concepts. (Two sequels, the prose novel Queens of Deliria and the graphic novel Ledge of Darkness, dispensed entirely with the notion of Moorcock’s involvement.) Still, Time of the Hawklords—not to mention Hawkwind’s cameo in the Jerry Cornelius novel A Cure for Cancer—completed a profound circuit: Inspired by Moorcock’s sprawling mythology, Hawkwind became characters in that mythology.\nMoorcock isn’t the only SFF legend Hawkwind has relied on for inspiration. Roger Zelazny, among the handful of American authors who wrote for Moorcock’s New Worlds, became another of the band’s literary muses. Three of their songs—1972’s “Lord of Light,” 1977’s “Damnation Alley,” and 1979’s “Jack of Shadows,” all either written or co-written by Calvert—were based on Zelazny novels of the same names, reiterating such themes as post-apocalyptic horror, magic meets computers, and how posthumanity dovetails with theology.\n“Time We Left This World Today” from 1972 references the brain police from George Orwell’s Ninety Eighty-Four; “D-Rider” from 1974 mentions dragons and recalls Anne McCaffrey’s Dragonriders of Pern; 1979’s “High Rise” adapts J. G. Ballard’s horrific urban dystopia of the same name; “The War I Survived” from 1988 contains a nod to Kurt Vonnegut’s Slaughterhouse-Five; “3 or 4 Erections in the Course of a Night” from 1993 takes its title from a line in the SF movie Dreamscape; and “Alien (I Am)” from 1995 boasts a sample of dialogue from the Star Trek: The Next Generation episode “The Mind’s Eye.” Another song from the same album (Alien 4) is more blatantly named “Beam Me Up.”\nHawkwind’s love for Star Trek is reciprocal. William Shatner covered “Silver Machine” on his 2011 album Seeking Major Tom, lending his authoritative bombast to the astro-psychedelic masterpiece; two years later, former Hawkwind member Nik Turner made a guest appearance on Shatner’s tribute to progressive rock, Ponder the Mystery. In an interview in 2013, Brock enthused about Shatner’s vocals on a new version of “Sonic Attack,” which was supposed to appear on Hawkwind’s 2013 album Spacehawks. The remake of the song that wound up on Spacehawks, however, did not feature Shatner, and his version of “Sonic Attack” has yet to be released. One can only hope.\nNot that Hawkwind draws only on other creators’ work for their SFF music—they’ve always had a healthy speculative imagination of their own. The ominous countdown of 1973’s apocalyptic “Ten Seconds Forever” has, according to Abrahams in Sonic Assassins, “the unlikely accolade of being the science fiction ‘Twelve Days of Christmas.’” The 1979 song “Uncle Sam’s on Mars” indulges two of Hawkwind’s other passions—radical politics and dark humor.\nThe unsettlingly mechanical “Automaton,” released in 1978 under the pseudonym The Hawklords, is answered by Hawkwind’s 1979 song “Robot,” which cites Isaac Asimov’s Three Laws of Robotics. The elaborate scenario of “The Age of the Micro Man,” also from ’79, involves a nightmare future where millions of workers are enslaved to an industrial elite who believe that the aliens who guide them are angels. Instead of being inspired by a science fiction story, the 1988 song “Heads”—about a group of disembodied heads preserved “in glass booths” and wired together to generate enormous powers—actually predates Greg Bear’s similarly themed novella Heads by three years.\nOne of Hawkwind’s most ambitious original concepts played out on their 1976 album Astounding Sounds, Amazing Music. The title and cover art pay homage to the magazines of the Golden Age of Science Fiction, specifically John W. Campbell’s Astounding Science Fiction and Hugo Gernsback’s Amazing Stories; each track was intended to stand as its own short story, like an anthology in song.\nOn the eve of the new millennium, Hawkwind brought their career in SFF full circle with In Your Area’s live version of “Aerospace Age Inferno” a song that originally appeared on Calvert’s 1974 solo debut, Captain Lockheed and the Starfighters. A fever dream of intergalactic travel, it calls back to “Silver Machine” with the line “The silver machine is worth more than you’re worth.” It also winks at one of Hawkwind’s early inspirations, Pink Floyd’s “Set the Controls for the Heart of the Sun,” with the gleefully sinister rejoinder “Set the controls for the heart of the Earth.”\nFor all of Hawkwind’s heady cosmic mysticism—their “decades-long interstellar mission to explore the occult mysteries of the cosmos,” says Peter Bebergal in Season of the Witch: How the Occult Saved Rock and Roll—they remain rooted in the SFF community. They’ve played at SFF cons—most notably Seacon ’84 in Brighton, England, at which the band’s beloved Roger Zelazny served as a guest of honor, and Worldcon 45 in 1987 at the same location. Said drummer Richard Chadwick in 1989, a year after he’d joined the group, “Every gig we did was like a science fiction convention.” Weathering numerous lineup changes, schisms, deaths, and even an internal lawsuit over ownership of the name, Hawkwind long ago solidified its position as one of the most reliable—yet thankfully unpredictable—practitioners of SFF music.\nThe band itself hasn’t always seen it that way. Soon after the release of Astounding Sounds, Amazing Music in 1976, Turner told the New Musical Express, “You can’t say there is a stereotype of what Hawkwind music should be, that it should be space rock or it should be all about science fiction or magic and sorcery.” Only seven years into its existence, the group was already feeling the squeeze of being pigeonholed. Calvert even went so far as to say in a 1978 interview with the same magazine, “I don’t like SF that much. Nobody in this band is particularly an SF fanatic,” adding, “Most SF is trash, actually.”\nBearing in mind Calvert’s mental issues at the time—later that year, his clinical depression resulted in the cancellation of a Hawkwind tour and his subsequent exit from the group—he may have simply been bucking against the space-rock stereotype that he’d wholeheartedly helped cultivate. Just one year earlier, he proudly told the fanzine Sniffin’ Flowers that he considered Hawkwind to be “a science fiction band […] in actual fact we are the only band that is doing that sort of thing”—an exaggerated claim, but the point stands; the same year he boasted in another fanzine, Album Tracking, “We even get letters from University people, in the States in particular, who have found parallels between science fiction and the literature of the past and who can fit Hawkwind into that scheme. I still think we’re closely aligned with that.”\nCalvert died in 1988 of a heart attack, just shy of Hawkwind’s twentieth anniversary. This year the band turns forty-seven, and The Machine Stops is their thirtieth studio album, not counting scores of live albums, archival collections, EPs, singles, bootlegs, and releases by their many offshoot groups and solo projects—almost all of them with a finger in SFF. And with The Machine Stops, Hawkwind shows no signs of letting that association lapse—instead, they’re doubling down on it, releasing one of the most extravagantly faithful SFF albums in their long, storied career. Or as Moorcock so speculatively put it in Sonic Assassins, Hawkwind is “like the mad crew of a long-distance spaceship who had forgotten their mission, which had turned to art during the passage of time.”\nJason Heller is the author of the nonfiction book Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded (Melville House). He's also a former nonfiction editor of Clarkesworld; as part of the magazine's 2012 editorial team, he received a Hugo Award. He wrote the alt-history novel Taft 2012 (Quirk Books), and his fiction has appeared in Apex Magazine, Farrago's Wainscot, Swords v. Cthulhu, and others; his nonfiction has appeared in The New Yorker, The Atlantic, Rolling Stone, Pitchfork, Entertainment Weekly, Weird Tales, Tor.com, and Ann and Jeff VanderMeer's The Time Traveler's Almanac. He regularly reviews science fiction and fantasy novels for NPR.org, and he's the co-editor of the fiction anthologies Cyber World (with Josh Viola) and Mechanical Animals (with Selena Chambers), both for Hex Publishers. Jason lives in Denver with his wife Angie and plays in the post-punk band Weathered Statues, and he can be found on Twitter: @jason_m_heller.", "source": "https://clarkesworldmagazine.com/heller_04_16/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Silver Machine: Hawkwind's Space Rock Journey throughout Science Fiction and Fantasy by Jason Heller"}