{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Eric Fomley; Rich Larson", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "vm7GwoFSCWuQZQDjCchWXX8GPT8=", "id": null, "license": null, "comments": "", "raw_text": "6140 words, short story  Through  Pilo’s long quiet is interrupted by a bell, the two-tone electronic chime that signals an inspection. He feels his cube start to move in the dark. He grips both sides of his bed, the square slab that is the cell’s only furnishing. He observes his emaciated reflection in the dark glass wall across from him, scabbed lips and eyes plunged deep into their sockets.  Pilo used to try to make himself more presentable when he heard the bell, tried to comb the skin flakes from his matted hair or pick the grime out from under his nails. Now he is beyond caring what the guards see.  The cube lurches up, sideways, down. There is a magnetic clack and then his wall is pressed up to another. He watches the glass turn clear, black silicate trickling away. He can make out two figures. This is vaguely interesting—normally only one guard performs the inspection.  The glass turns fully transparent and Pilo frowns. The guard is there, clad head-to-toe in aggressive textile, shifting patterns that ache Pilo’s head if he looks too closely. An enormous biomechanical insect clings to their back with spiny legs. Its lamprey tube hovers over the guard’s shoulder, to punch holes or tranquilizers into uncooperative flesh.  This is normal. What’s abnormal is the second figure, clad in the same uniform but too small for it. The aggressive textile hangs off them like baggy pajamas. They are unarmed.  “Prisoner 8403, approach the glass.” It’s difficult to tell if the filter-buzz words come from the guard’s mouth or from the lamprey tube. “You have a visitor.”  The word stabs adrenaline straight through his rib cage. Pilo is frozen for a moment. Then he crawls off the bed, falls, levers himself upright. His legs feel hollow. His head feels light. Some of it is hunger. The nozzle by the bed provides only a pale gritty paste, so sporadically that Pilo sometimes suspects a slow, calculated starvation.  Most of it is shock. He has never had a visitor here in the dark.  The visitor tugs at the hood concealing their face. “I really have to wear this fucking thing?”  Pilo flinches at the profanity, which is not permitted in the cube. The visitor must have special permissions. He is not sure if the question is for him or for the guard, but his mouth and throat are not ready to speak, so he lets the guard answer.  “That’s protocol.” Their voice buzzes like an agitated bee swarm. “You want to talk to this butcher, you follow protocol.”  The visitor puffs a laugh; it flutters the fabric of their hood. The aggressive textile stabs at Pilo’s eyes. He squints, still massaging his jaw, moving his tongue in a practice circuit around his mouth.  “So this is where you ended up, huh, Pi?” The visitor’s voice is less distorted than the guard’s. Fem-leaning, almost familiar. They look past him, to the bed, to the nozzle, to the conical water hole that serves as his sink and toilet both. “Very chic. Minimalist. You always did have an eye for interiors.”  Pilo is ready. He snorkels the last of the phlegm from his throat and speaks. “Who are you?”  The visitor doesn’t respond; for a moment he thinks his shredded whisper was not loud enough to pass through the glass. He is opening his mouth to try again when the visitor shakes their head, hacks out another half of a laugh.  “I’m not doing this,” they say. “I’m not playing this game. You know who I am.”  Pilo chews his cheek, thinking hard. “Someone whose life I wrecked,” he suggests. That is, after all, his role in most things. He is a destroyer.  The visitor cocks their head to one side. “Maybe you really don’t remember,” they mutter. “Maybe you been in here that long.”  “He’s just getting started,” says the guard. “Two centuries to go.”  “Fuck this,” the visitor says, and yanks their hood down.  The guard gives a buzzing shriek, something about necessary protocol, and the black silicate begins to swirl. Pilo throws himself against the wall, forehead mashed to glass. Just before it goes fully opaque, before the dark cocoons him, he sees someone he knows.  After the chaos of the derailed visitation, it should be a relief to return to routine. Instead, the encounter gnaws at him. He replays it ad nauseum, sifts it over, focusing on the visitor’s voice and mannerisms and the brief slice of a face he is certain he recognized. He begins to pace the dimensions of his cell, caloric energy he cannot spare.  There has never been a visitor before. There might never be a visitor again. He might be left with only the memory, and eventually his attempts to maintain his grip on it will grind it out to nothing between his palms. Then it will be him and the dark again.  Which is as it should be, of course. Him and the dark, away from everyone and everything that he might otherwise destroy.  Pilo wants to destroy something now. He clenches his fists until his knuckles ache, and pounds them against the glass. The cell hums a deep vibrato. Pilo pounds and screams until his lungs can only heave up a labored rasp.  He slumps onto the bed. He lies there for an hour or a day.  The two-tone bell chimes, the cell jolts, and Pilo nearly falls from the bed. He grips the concrete edges as the cell shifts up, down, and right. The magnets connect. Glass clacks to glass, and the shroud clears like swirling ink.  There’s only one guard standing there for another inspection. No visitor. This is normal. The guard doesn’t move or speak. This is not normal. The usual rigidity of their posture is gone. Their shoulders slouch and the lamprey tube sags with it, a dozing predator.  “Who was my visitor?” Pilo asks, even though the guards never answer questions.  The guard starts to twitch. Their fingers flutter like they’re dancing on a datapad; their arms jolt sporadically forward and then back to their sides. They take two jerky steps toward the cell but stop at the glass wall instead of coming inside to search for nonexistent contraband.  “Is she still here?” Pilo asks. “In this place?”  He squints at the guard’s hidden face, through one eye and then the other, for as long as he can stand the seething fabric. He waits to be told to shut up, to stand back, to take the position.  Instead the guard lifts their right hand to the lamprey tube—clumsy, hesitant. Then farther up, feeling behind their skull. A jagged wire protrudes from the biomechanical insect on their back. Pilo watches as the guard slowly, deliberately, twists their gloved thumb down onto it.  The blood is the brightest and most beautiful thing Pilo has ever seen through the glass. It wells out and out, a flower blooming in perpetuum. The guard puts their bloody thumb to the wall of the cell and begins to write.  Pilo’s heart hammers as the letters appear one by one, ship script. His mind whirls through narrowing possibilities as IT becomes IT’S NOT becomes IT’S NOT YOUR—  The guard pulls their red thumb back, grunts. They grapple at their head for a moment, as if to pry something out of it, then their posture stiffens. The lamprey tube flexes. Snaps.  “You vermin,” the guard says. “You waste.”  They slide their hand through the unfinished message, smearing a red jag across the glass. They turn and walk away, the inspection postponed, perhaps forgotten. Pilo stares at the streak, recites the words, and from those words he feels the shape of the one missing.  The cell shrouds again, glass clouding to black.  “Fault,” he whispers.  Pilo thought he had lost all track of time in this place, but now he is certain that the regular occurrence of the inspection bell has been delayed. He hears its phantom, a tinnitus in his ears, but the cube doesn’t move. Or maybe he is anticipating, a brainstate he’d almost forgotten, and it’s the anticipation that has slowed time to a shambling crawl.  In another life Pilo practiced meditation, but when he tries it now his body revolts. His lungs seize. His hands jump.  When his cube finally shifts, he can’t be sure if he is hallucinating or not. It glides through the dark. Stops. The glass clears. The guard appears, and this time there is no slumping, no twitching, no puppet hands dancing at their sides.  “Position,” they say, voice crunchy with distortion.  Pilo rolls his way off the bed. He assumes his position against the adjacent wall, arms and legs spread, as if there is even a single element of the cell he is capable of dismantling and repurposing into a weapon, as if his emaciated limbs are weapons themselves.  He watches in his peripheral as the glass opens and the guard enters, masked head on a wary swivel. The shifting pattern of their suit doesn’t claw so badly at his eyeballs today. The aggressive textile is more of a soft undulation. Maybe it’s glitching.  It lets him look more closely at the guard as they circumambulate the cell, checking the food nozzle and the toilet and the featureless black slab of a bed. For a moment, his stimulation-starved brain imagines his captor as a geometric skeleton wrapped in mesh musculature.  “What are you looking at?” the guard buzzes. “Eyes on the wall!”  Pilo is too slow to comply, distracted by his hallucination. The lamprey snaps forward like a jack-in-the-box and smashes his face into the wall he is meant to be watching. A small white supernova goes off behind his eyelids. He sinks, clutching at a nose that might be broken again, feeling hot copper blood seep through his fingers.  “Position,” the guard grates. “Up! Arms out! Legs out!”  Even as they say it, they drive a booted foot into his lower back. He slams into the wall again, tries to buffer the impact with his hands. They leave vermeil smears on the black glass. A malformed message darts through his mind’s eye:  IT’S NOT YOUR FAULT.  “You fecal stain,” the guard says. “You bacterial graveyard. You careless butcher.”  The words feel like a catechism. The boot swings again; this time it sucks all the air from his lungs. He doubles over, curling into himself on the cold floor.  “Up,” the guard orders. “Up, and into position.”  Pilo turns, instead, and stares directly at his captor. Ignoring the shifting patterns, ignoring the menacing lamprey. He focuses on the shape of the guard’s shoulders, which are beginning to slump, and the tilt of the guard’s head, and the dangle of the guard’s hands. He remembers the way they fluttered and jerked before they scrawled the bloody letters.  It was the same guard; he is almost sure of that now. They are all the same guard.  “What are you doing?” the guard snaps, and behind the electronic buzz, Pilo hears trepidation. He realizes that his captor has wrapped their arms around their body, mocking his fetal posture.  But when he raises one hand to wipe the blood from his bristly chin, the guard raises a hand of their own in perfect synchronization. Not mocking him. Something else.  “Stop it,” the guard buzzes, then, to someone else: “We have a situation in cell 8403, we have—”  Pilo clenches his jaw shut as hard as he can, and the guard’s insectoid voice chokes off. His pulse rushes to fill the silence. His heart pounds fragile ribs. Pilo knows he must be dreaming this. He must be tossing and turning on the bed, waiting for the two-tone bell to chime.  He lifts his right hand high into the air. The guard mimics like a marionette, makes an angry gurgle deep in their throat. The lamprey thrashes, but it can’t attack without the guard’s permission, and the guard, some way, somehow, can’t give permission without Pilo’s.  Slowly, slowly, he puts both hands to his own neck, where the seal of a mask would be if he were wearing one. His fingers find an intangible pressure hook. The guard’s fingers find a real one.  The guard’s mask peels away, and Pilo sees the same face he sees in the black glass. Scabbed lips, sunken eyes. He stares at himself. The guard-self stares back.  “What did I do?” he asks. “I can’t remember anymore.”  The guard-self twitches, hocks. A glob of saliva smacks the floor between them. “You vermin,” the guard-self murmurs. “You stain.”  The catechism is back, but Pilo thinks he is losing the faith. He turns to the clear glass, peers into a dark and empty corridor.  IT’S NOT YOUR FAULT.  “Position,” he tells the guard-self. “Sorry.”  Pilo traverses the corridor as quickly as he can in the guard’s heavy boots. He has not walked much, and already his shins are aching, his knees are clicking. A stitch burns under his bottom rib. He left the guard’s weaponry on the floor of the cell, afraid to touch the writhing insectile thing, but he took the mask. It turns his panting into an anguished electric whine.  The corridor is all corners, a maze of black glass folded in on itself, and even though Pilo has no memory of being brought to his cell, he remembers this labyrinth in intimate detail. He can envision the other cells shuffling somewhere above him in the dark, an elaborate dance.  But when he reaches the junction, left and right open to him, he has not even a shred of intuition for which way leads to an exit. He halts there, gasping for breath.  “Left.”  He startles. It’s the visitor’s voice, as crisp inside the mask as a whisper in his ear. She’s the one who started all this, who set off this reaction chain, and he knows, gut-deep, that she is making a mistake. If she knew what he did, she would not be trying to help him.  “Who are you?” Pilo asks, again.  “I’m the person who says left and then you go left,” the voice answers.  Pilo lingers a moment longer. “What happened in the cell? With that guard?”  Unasked: why did he have my face?  “Fuck if I know,” the voice says. “You’re the one with the blueprint, Pi. I’m working with fragments of fragments here. One of which says . . . ”  Pilo nods, even though she is not there to see it. He goes left.  Up ahead, a cell is docked to the corridor for inspection. Pilo slows his stride on the visitor’s suggestion, trying to make his spine straight, his head high. If he moves like a guard, maybe they won’t question the bare space on his back where the bug should be.  “Just walk straight past,” the visitor says. “Don’t even look in.”  But when he comes to the stretch of transparent glass, he can’t help turning his head. The cell is identical to his, the same featureless slab of a bed, the same nozzle for food, the same hole for shit. The guard is inspecting. The prisoner is in position on the wall.  Pilo sees his own gaunt face in profile. His veins frost shut.  All the guards are him. All the prisoners are him, too. Either he’s hallucinating, losing his mind in the dark of his cube, or—  “Keep moving,” the visitor hisses, and he realizes he’s stopped.  But it’s too late. He’s already drawn attention: his prisoner-self stares balefully at him and his guard-self follows suit, head tilting, evaluating. Pilo feels the guard’s eyes trace the space where a lamprey tube should be. Feels surprise transmute to suspicion.  “Malfunction,” Pilo says, by way of explanation.  The glass walls start to wail, an alarm that shivers through the air and into his bones. Red lights strobe the corridor, and Pilo runs.  The buzzing shouts of the guards echo through the maze; he can’t tell if they’re coming from ahead or behind as he turns left, right, right, left again, following the visitor’s clipped commands. His feet ache and his muscles are eating themselves. He’s tired, so tired that the bed in his cell would feel like heaven instead of hell.  “Stop at the corner,” the voice orders. “Get low.”  He throws himself down and watches as two guards barrel past him, lamprey tubes bobbing. One of them gives an electric bark: prisoner 8403 unaccounted for, the destroyer is loose. Pilo’s heart thumps hard. His tongue flicks at the dried blood above his lip. He wonders what the beatings will be like if they catch him.  “Almost there,” the visitor says. “Left again.”  Pilo takes two tries to get up off the floor, then staggers onward. He is certain the guards have turned around, certain he can hear their footfalls converging on him. The corridor narrows, branches a final time, and ends. The visitor has betrayed him. He’s been led to a corner and left for dead.  Then he sees the stump of a maintenance ladder hanging down from the shadows. He limps to the base, leans against the rungs to catch his breath. When he looks up, he sees nothing but blackness.  “They’re coming, Pi,” says the voice. “You have to start climbing.”  Pilo pushes his forehead against the ladder. Gasps in. Out.  “Go up, Pi. You have to go up.”  He takes another ragged breath. He pictures all the cells moving through the dark, all the prisoners and guards wearing his face. The prison is well made, but he knows what it is, now. The thought has been building and building in the back of his skull.  “This is all a sim,” he says hoarsely. “A deepsim.”  For a moment there’s no reply, and he thinks maybe the channel is one-way only. Then he hears a snort of static.  “Yeah,” the visitor says. “Big twist. But those guards are still going to tune the shit out of you, and it’s going to feel very real.”  One dread mixes with another in Pilo’s simulated stomach. Maybe he shouldn’t be escaping at all. Maybe he was put in that cell for a good reason. He is, after all, the destroyer.  “Come on, Pi.”  The voice is harsh and pleading at the same time, and he finally recognizes it, one realization unlocked by another. Her name sails to him across a void. He falters for a moment, frightened he might be wrong. His jaw works.  “Kess?” he asks.  Her voice thickens. “Yeah. Yes. Now climb, for fuck’s sake.”  He steps onto the first metal rung.  Pilo is a carcass. His limbs tremble; his head lolls with exhaustion. His hands gave out a dozen rungs ago, grip strength sapped to nothing, so he has to use his elbows, hooking them around each bar. It’s slow. Agonizing. The sound of the guards is gone for now, but he has Kess in his ear, urging him along.  The higher he climbs, the more he remembers about her. It begins with her face, the one he saw so briefly during the visitation, bright black eyes and high forehead. He sees it now from a variety of angles. Shifting haircuts, creeping tattoos, a hundred different expressions but most often a wide grin he knows was the precursor to a wild warbling laugh. Her voice has no trace of a smile in it now.  He pauses on the ladder to catch his breath but ends up wasting more of it on a question. “We’ve known each other a long time,” he says. “Are we friends?”  “We were friends.”  Pilo remembers a tangle of twisting corridors, walls and ceilings swathed in moss, hydroponic gardens above and rusty maintenance tunnels below. A party with no gravity, chasing trembly globes of grain alcohol through the air. Bubble-shaped habs with soft warm beds. Viewports to a starry void.  “Colony ship,” he says. “The Germinal.”  “The Big Germ. Yeah.”  But he knows that’s not Kess’ nickname for it. Someone else calls the ship that, someone who is only a blur in his peripherals. Nearly every memory he has of him and Kess has a third person in it, too. Faceless, ghostly, hard to look at. Like the guards and their aggressive textile.  “Why was I put in here?” he asks, because he doesn’t want to ask about the third person.  Her voice tightens, and now he can picture her face doing the same. “You know that better than I do.”  “I’m a criminal,” Pilo says, with a numb familiarity. “A bad one. The guards, you know, when they think I’m not listening—they call me the destroyer.”  “Very dramatic,” Kess says. “We’re all destroyers, Pi. We’re all damaging each other at all times.”  “No. What I did—”  “We’re all each other’s entropy.” Kess’ voice is flat. Heavy. “What you did wasn’t special, Pi. It was fucked up, but it wasn’t special.”  Pilo feels a dart of dread and excitement mingled. “You know what I did?”  “So do you,” Kess says. “You just buried it in this fucked-up place.”  Pilo senses it then, a memory-as-predator, a dark gray shape circling below him. “They also call me a fecal stain,” he says. “The guards. That one maybe suits better.”  He gathers his strength and starts climbing again, moving away from the labyrinth but also from the predator.  Kess puffs a small laugh, just a ghost of the one he remembers. “No,” she says. “You’re not getting me like that. Kess is all love today.”  Pilo’s next reach feels wrong. Suddenly he is clinging to the rungs to stop from plummeting, headfirst, toward the hatch that used to be above him. His gut floats outside his pericardium. Fluids circle in his inner ear, chasing each other like snapping dogs.  Nograv. It’s been a long time since he was in nograv.  “You hit the edge of the Newt field,” Kess says. “Nice and light from here to outside.”  Pilo feels a shiver through his sternum, feels his heartbeat accelerate. He always knew, vaguely, that this was a prison ship. But going outside means going onto the hull. And if there is one place he should not go, should never go, it is the hull.  Pilo hears electric bellows echo up from below.  “Guards found the ladder,” Kess says. “Hurry up.”  Pilo’s mouth opens and shuts. He tries to think of a way to explain to Kess, whose birthday is exactly one month before his, whose dark eyes peer out from a cloud of freckles, why he should not go to the hull. Why even the idea of it fills his empty belly with chunks of ice.  But he doesn’t know, so he resumes his climb, hand over hand, weightless as a spider.  There is an antechamber at the end of the ladder, a small red-lit bulb where he sheds the guard’s aggressive textile and dons a bright orange hullsuit instead. There is something horribly familiar about it. When the fabric shell slithers and tightens, adjusting to his dimensions, he feels a brief spike of panic.  But if he doesn’t go to the hull, he’ll end up dragged back to the cell. Back to the four black glass walls, back to eating gritty paste from a nozzle, back to the beatings and inspections. He puts on the helmet; it seals with a smell like burning plastic.  For a moment he’s blind. Then the filtration system hums to life and whisks the fog of his breath away. The hud shows him his oxygen full, his suit intact.  “I’m waiting outside, Pi.” Kess’ voice echoes in his helmet. “Go time.”  Pilo’s feet are frozen. Kess is not the only thing waiting for him on the other side of the airlock. He can feel the memory-predator lurking out there, too, filing its teeth. If he goes onto the hull, something very bad is going to happen.  “Why?” he asks, through a tightening throat. “If this is a deepsim, and you’re in the code, why can’t you just turn it off?”  “Because some clever prick loaded it with fail-safes,” Kess says. “The only way out is through.”  Pilo can hear thumping and shouting through the vestibule door. The guards have reached the top of the ladder, guards who all have his face.  “I programmed it, then,” he says, with a sick feeling of inevitability. “I put myself in here.”  A clang on the door. The guards have caught up.  “Now or never, now,” Kess says. “I did a lot of fucking work to rig this up, so respect my craft, will you?”  Pilo reaches for the airlock.  The pursuit is slow motion; it would be comical if Pilo were not exhausted and terrified. The hullsuit hud shows a swarm of moving red blots, and through his faceplate he sees them as guards coming from every direction, crawling not just from the airlock but from hidden crevices all across the hull of the prison ship. The biomechanical insects are detached from their hosts, skittering on their own skeletal legs.  They don’t want to let him go.  “Nearly there,” Kess mutters. “Nearly, nearly.”  He’s heading for the engines, all the way aft, where Kess said she is waiting for him. His breath is a ragged ghost, rattling through the helmet filter. He knows he should be breathing in slow even sips, knows he simmed a hullwalk or something like it in another life, but his lungs are singularities. His heart is a hummingbird.  He’s been in the cell too long. The deepsim has rules, and it’s harder to bend them now that he knows he wrote them. The rules say his body has wasted away, fed on itself. He can feel it with every trembling step, but he can’t stop because his jailers are converging now, making him adjust course over and over.  Pilo waves his arm in the void, focused on the nearest guard, but the guard only speeds up, snarling through his faceplate. The marionette trick won’t work again. Waste of a second, waste of a calorie. Pilo redoubles his efforts. Drives his aching knee upward, feels the clack of the magnetics releasing, pitches forward, sets his boot, feels the clack of the magnetics taking hold—  Blood thrums through his neck. Pulses behind his eyes, which he keeps pointed down, never up, both to be sure of his footing and to avoid looking into the endless black. The guards and the bugs aren’t the only things chasing him. He can feel the predatory memory out there, circling, circling.  “You’re there, Pi. You see me?”  Pilo feels the rumble of the prison ship’s engine under his feet. He blinks the stinging sheet of sweat from his eyes, searches for a shuttle suckered to the hull.  “No,” he says, with panic mounting his chest, crushing his ribs. “Where?”  “Look up,” Kess says.  Pilo does not want to look up, but he does it. When he cranes his head back, when he sees the thicket of ice and dust, lit an eerie yellow by the dregs of some distant supernova, his heart almost stops.  The predatory memory crashes through his skull.  “Beautiful, isn’t it,” says Rhetta.  The three of them are huddled around the viewport, looking down—or up, or sideways; they’re in nograv—at a massive helical shard of ice and dust. Pilo’s optic nerve is still throwing spots, from too much time in sim, but the tiny explosions of shimmering color only add to the ethereality.  Rhetta is right, as usual. The comet was worth seeing live.  “Fucking payload, is what it is,” says Kess, emphatic on the curse just so Rhetta will make a face. “Think of all that water.” She offers Pilo a fist. “And Pi’s going to harpoon us right onto it.”  Pilo knocks fists, smiles, but Rhetta somehow detects the churn in his belly.  “How’s the program coming?” she asks. “Still killing Kess’ bugs?”  During his brief snatches of sleep, Pilo has been having nightmares about enormous biomechanical insects. His subconscious could stand to be more subtle.  “It’ll be ready by contact,” he says. “I should get back in there.”  Pilo knows no colony ship is truly self-sustaining, no matter how precise its recycling of gas and matter. Entropy is always gnawing at the edges, poking its fingers through the gaps, and there are always unforeseen disasters: micrometeorites, reactor failures, blight in the hydroponic gardens.  Pilo knows that the Germinal has been limping for decades now, and that the comet is a gift they can’t afford to waste. The thought pounds at his temples as he works, as hours meet hours, as his fingers begin to twitch and cramp on the phantom data-pad.  Kess did the best she could with the corrupted base program, but it’s still teeming with error potential. He seals one gap and another opens. Even with the sim-to-real time exponential maxed out, with every minute outside an hour in here, they’ll barely make the launch window.  When he finally emerges from the simpod, Rhetta is waiting with the green tea he asked for. “Kill count?” she asks, holding out the cup.  “Eight-thousand, four-hundred and two,” Pilo says. “Which leaves one. The worst one.”  “The grapple trigger,” Rhetta guesses. “Kess said it was a real cuss, cuss, extra cuss.”  Pilo takes the tea. “It’s ancient. Won’t talk to anything else. We haven’t chunked a moving comet in about a century, and we saw this one so late—” He breaks off, blinks at Rhetta from across the steaming crater of his cup. “Simming it, the grapple works seventy-eight percent of the time. Not nearly high enough when we only get one attempt.” He inhales. “But there’s a physical trigger, too.”  Rhetta looks at him for a long moment, then the wrinkles slacken around her eyes. “I’ll do it. I’ll ride it down.”  Pilo gives a hoarse laugh. “The physical trigger’s fully exposed, you’d be in a hullsuit and tether—”  “Done hullwork since before you were born, Pilo.”  “This is different. I can’t ask you to do this.”  “So don’t. I’ll just cussing do it.”  Pilo watches through electric eyes as the harpoon makes its approach. The engineers put it together from scrap, bits of the Germinal slagged and reprinted as metal shell, drift-engine, spike-toothed grapple. There is a tiny bright orange spot against the pig-iron gray, a single exposed hand poking out from the hutch the engineers soldered at the last possible moment.  The ship took census; Rhetta’s request to babysit the trigger was approved, but not by everybody. Pilo can feel Kess beside him in the simpod. He can almost feel the stiff anger in her limbs, feel it radiating off her, heating the neuroconduction fluid.  The harpoon’s engine flares pale blue, a final burn to match velocity. This is not a sim. Pilo has to remind himself of that, over and over. This is not a rehearsal. This is the show.  This is the show, and the grapple’s not deploying. Pilo prays to an amoral universe. The grapple continues not deploying. They are in the twenty-two percent, and now Rhetta realizes that, realizes it’s her line. Pilo watches her crawl, slowly, cautiously, out from the hutch. The engineers placed as near the trigger as possible. She only has to move three meters. Pilo’s adrenaline sections them to millimeters.  One eternity goes by. Then another. Then he sees the minute motion, a gloved hand gripping and twisting, and the grapple deploys.  It burrows into the ice, hooking deep. Pilo feels a flood of triumph, of relief, of gratefulness, just before a jagged shard of frozen water comes loose, at an angle the sim never accounted for, and slices the arm of the bright orange hullsuit open.  Entropy finds the gap, and inside the simpod Pilo can’t stop screaming Rhetta’s name.  “You remember, now.”  Kess’ voice rocks him back to reality, or unreality. Back to the layer of consciousness cocooned in what was meant to be a therapy sim, before he twisted it beyond all recognition and locked the door behind him. Back to the punishment he devised for himself when nobody else would do it.  He is standing on the hull of the prison ship, boots magnetized to metal. The guards have circled up around him, penning him in. None of it is real. None of it matters. Only Rhetta matters: every time he blinks his eyes he sees her writhing, sees frost creeping across the inside of her faceplate.  His fault. His fault. His fault.  “It should’ve been me,” he rasps.  “Yeah. People always say that, Pi.”  Pilo feels his simulated lungs heaving, head spinning. “No,” he says. “It should have been me. I was simming it from almost the start. I knew the physical trigger was the better option, so I was simming the crawl, the placement, there was no time to rig something else—” He sinks to a crouch, the void crushing down at him from all angles. “I was so fucking scared. And I knew all I had to do was mention it, all I had to do was ask Rhetta to bring me tea—because that’s how she is. How she was.”  “I know, Pi.” Kess’ voice is brittle flint. “You told us this. We told you to do your fucking therapy. And instead, you sealed yourself in the simpod and turned it into some good old-fashioned self-flagellation. Took me three months to find my way in.”  “Why did you?” Pilo chokes. “What you wrote on the wall—you know that’s not true.”  “I didn’t want to, at first. I thought, you know, your choice.” She pauses. “And I was angry. I still am so fucking angry. But it’s not doing me any good.”  Pilo pictures his body in the simpod, maybe hauled all the way to triage to monitor his vitals, to hook an intravenous to his trembling arm. He remembers he was intending to die in here.  “I should go back,” he murmurs. “Back to the cell.”  “No.” Kess snaps the word. “Not a chance. Not after I did all this work.”  “You’re part of it,” Pilo says. “You must be. Part of the punishment. Getting me so close to escaping, then making me remember—”  “I didn’t make you remember shit. Your brain did.” Kess’ voice trembles. “We’re not friends right now, Pi. We won’t be for a long time. Maybe forever. We’re not going to hug and cry when you wake up. But I need you out here anyway. The ship needs you.”  Vibrations move through his boots as the guards creep closer. Pilo sees his own face in all directions, sneering, jaundiced by the helmets’ yellow faceplates. Their boots clack and shiver. He can see their lips moving and hear the words in his head: you careless butcher, you fecal stain, you coward, you destroyer.  “I don’t deserve that yet,” Pilo says. “I don’t deserve to be out there.”  “Nobody deserves anything,” Kess says. “Hiding here torturing yourself isn’t helping Rhetta’s family, or me, or anyone else on the Germ. Trust me.” Her voice cracks. “Just fucking trust me, Pi. For once.”  Pilo’s chest aches. “I trust you,” he says. “Tell me what to do.”  “Jump.”  “Into the comet?” Pilo asks in a sob, knowing what he will see there, knowing he will find Rhetta’s writhing body, her open mouth growing ice.  “Through the comet,” Kess says.  Impossible. He’ll be impaled on a frozen spar, crushed in the shifting floes. The deepsim has rules, all sims have rules—  “Just cussing do it.”  Pilo inhales. Exhales. He remembers a younger Rhetta slithering into her hullsuit, adjusting the baggy orange textile. Eyes bright, alert. Routine maintenance, but eager for it anyway, eager to get out of the Big Germ for a little while and see the stars.  He crouches down and demagnetizes his boots. Then, with his last shred of strength, he kicks off the hull. The guard-selves reach for him, wailing, suddenly panicked. The bugs gnash their lamprey teeth. He leaps through a dozen grasping hands, past a dozen metallic mouths, and floats free.  He glides toward the comet, and the comet pulls him in. Suddenly he’s accelerating, plunging downward, upward. He shuts his eyes tight, feels a cloud of frozen particulate wash across him, precursor to the drifting chunks that can tear him apart, and then—  Stillness.  Pilo has to squint, even through his auto-dimmed faceplate. He is drifting in empty space, no ice, no dust, no comet. He has an unimpeded view of the supernova. There’s a figure silhouetted against it, waiting in the middle of the ruined star.  Kess reaches out her hand.  Pilo’s long quiet is interrupted by the electric bleat of his heart monitor, by the gurgle of his simpod draining. He opens his eyes. Rich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "text": "6140 words, short story\nThrough\nPilo’s long quiet is interrupted by a bell, the two-tone electronic chime that signals an inspection. He feels his cube start to move in the dark. He grips both sides of his bed, the square slab that is the cell’s only furnishing. He observes his emaciated reflection in the dark glass wall across from him, scabbed lips and eyes plunged deep into their sockets.\nPilo used to try to make himself more presentable when he heard the bell, tried to comb the skin flakes from his matted hair or pick the grime out from under his nails. Now he is beyond caring what the guards see.\nThe cube lurches up, sideways, down. There is a magnetic clack and then his wall is pressed up to another. He watches the glass turn clear, black silicate trickling away. He can make out two figures. This is vaguely interesting—normally only one guard performs the inspection.\nThe glass turns fully transparent and Pilo frowns. The guard is there, clad head-to-toe in aggressive textile, shifting patterns that ache Pilo’s head if he looks too closely. An enormous biomechanical insect clings to their back with spiny legs. Its lamprey tube hovers over the guard’s shoulder, to punch holes or tranquilizers into uncooperative flesh.\nThis is normal. What’s abnormal is the second figure, clad in the same uniform but too small for it. The aggressive textile hangs off them like baggy pajamas. They are unarmed.\n“Prisoner 8403, approach the glass.” It’s difficult to tell if the filter-buzz words come from the guard’s mouth or from the lamprey tube. “You have a visitor.”\nThe word stabs adrenaline straight through his rib cage. Pilo is frozen for a moment. Then he crawls off the bed, falls, levers himself upright. His legs feel hollow. His head feels light. Some of it is hunger. The nozzle by the bed provides only a pale gritty paste, so sporadically that Pilo sometimes suspects a slow, calculated starvation.\nMost of it is shock. He has never had a visitor here in the dark.\nThe visitor tugs at the hood concealing their face. “I really have to wear this fucking thing?”\nPilo flinches at the profanity, which is not permitted in the cube. The visitor must have special permissions. He is not sure if the question is for him or for the guard, but his mouth and throat are not ready to speak, so he lets the guard answer.\n“That’s protocol.” Their voice buzzes like an agitated bee swarm. “You want to talk to this butcher, you follow protocol.”\nThe visitor puffs a laugh; it flutters the fabric of their hood. The aggressive textile stabs at Pilo’s eyes. He squints, still massaging his jaw, moving his tongue in a practice circuit around his mouth.\n“So this is where you ended up, huh, Pi?” The visitor’s voice is less distorted than the guard’s. Fem-leaning, almost familiar. They look past him, to the bed, to the nozzle, to the conical water hole that serves as his sink and toilet both. “Very chic. Minimalist. You always did have an eye for interiors.”\nPilo is ready. He snorkels the last of the phlegm from his throat and speaks. “Who are you?”\nThe visitor doesn’t respond; for a moment he thinks his shredded whisper was not loud enough to pass through the glass. He is opening his mouth to try again when the visitor shakes their head, hacks out another half of a laugh.\n“I’m not doing this,” they say. “I’m not playing this game. You know who I am.”\nPilo chews his cheek, thinking hard. “Someone whose life I wrecked,” he suggests. That is, after all, his role in most things. He is a destroyer.\nThe visitor cocks their head to one side. “Maybe you really don’t remember,” they mutter. “Maybe you been in here that long.”\n“He’s just getting started,” says the guard. “Two centuries to go.”\n“Fuck this,” the visitor says, and yanks their hood down.\nThe guard gives a buzzing shriek, something about necessary protocol, and the black silicate begins to swirl. Pilo throws himself against the wall, forehead mashed to glass. Just before it goes fully opaque, before the dark cocoons him, he sees someone he knows.\nAfter the chaos of the derailed visitation, it should be a relief to return to routine. Instead, the encounter gnaws at him. He replays it ad nauseum, sifts it over, focusing on the visitor’s voice and mannerisms and the brief slice of a face he is certain he recognized. He begins to pace the dimensions of his cell, caloric energy he cannot spare.\nThere has never been a visitor before. There might never be a visitor again. He might be left with only the memory, and eventually his attempts to maintain his grip on it will grind it out to nothing between his palms. Then it will be him and the dark again.\nWhich is as it should be, of course. Him and the dark, away from everyone and everything that he might otherwise destroy.\nPilo wants to destroy something now. He clenches his fists until his knuckles ache, and pounds them against the glass. The cell hums a deep vibrato. Pilo pounds and screams until his lungs can only heave up a labored rasp.\nHe slumps onto the bed. He lies there for an hour or a day.\nThe two-tone bell chimes, the cell jolts, and Pilo nearly falls from the bed. He grips the concrete edges as the cell shifts up, down, and right. The magnets connect. Glass clacks to glass, and the shroud clears like swirling ink.\nThere’s only one guard standing there for another inspection. No visitor. This is normal. The guard doesn’t move or speak. This is not normal. The usual rigidity of their posture is gone. Their shoulders slouch and the lamprey tube sags with it, a dozing predator.\n“Who was my visitor?” Pilo asks, even though the guards never answer questions.\nThe guard starts to twitch. Their fingers flutter like they’re dancing on a datapad; their arms jolt sporadically forward and then back to their sides. They take two jerky steps toward the cell but stop at the glass wall instead of coming inside to search for nonexistent contraband.\n“Is she still here?” Pilo asks. “In this place?”\nHe squints at the guard’s hidden face, through one eye and then the other, for as long as he can stand the seething fabric. He waits to be told to shut up, to stand back, to take the position.\nInstead the guard lifts their right hand to the lamprey tube—clumsy, hesitant. Then farther up, feeling behind their skull. A jagged wire protrudes from the biomechanical insect on their back. Pilo watches as the guard slowly, deliberately, twists their gloved thumb down onto it.\nThe blood is the brightest and most beautiful thing Pilo has ever seen through the glass. It wells out and out, a flower blooming in perpetuum. The guard puts their bloody thumb to the wall of the cell and begins to write.\nPilo’s heart hammers as the letters appear one by one, ship script. His mind whirls through narrowing possibilities as IT becomes IT’S NOT becomes IT’S NOT YOUR—\nThe guard pulls their red thumb back, grunts. They grapple at their head for a moment, as if to pry something out of it, then their posture stiffens. The lamprey tube flexes. Snaps.\n“You vermin,” the guard says. “You waste.”\nThey slide their hand through the unfinished message, smearing a red jag across the glass. They turn and walk away, the inspection postponed, perhaps forgotten. Pilo stares at the streak, recites the words, and from those words he feels the shape of the one missing.\nThe cell shrouds again, glass clouding to black.\n“Fault,” he whispers.\nPilo thought he had lost all track of time in this place, but now he is certain that the regular occurrence of the inspection bell has been delayed. He hears its phantom, a tinnitus in his ears, but the cube doesn’t move. Or maybe he is anticipating, a brainstate he’d almost forgotten, and it’s the anticipation that has slowed time to a shambling crawl.\nIn another life Pilo practiced meditation, but when he tries it now his body revolts. His lungs seize. His hands jump.\nWhen his cube finally shifts, he can’t be sure if he is hallucinating or not. It glides through the dark. Stops. The glass clears. The guard appears, and this time there is no slumping, no twitching, no puppet hands dancing at their sides.\n“Position,” they say, voice crunchy with distortion.\nPilo rolls his way off the bed. He assumes his position against the adjacent wall, arms and legs spread, as if there is even a single element of the cell he is capable of dismantling and repurposing into a weapon, as if his emaciated limbs are weapons themselves.\nHe watches in his peripheral as the glass opens and the guard enters, masked head on a wary swivel. The shifting pattern of their suit doesn’t claw so badly at his eyeballs today. The aggressive textile is more of a soft undulation. Maybe it’s glitching.\nIt lets him look more closely at the guard as they circumambulate the cell, checking the food nozzle and the toilet and the featureless black slab of a bed. For a moment, his stimulation-starved brain imagines his captor as a geometric skeleton wrapped in mesh musculature.\n“What are you looking at?” the guard buzzes. “Eyes on the wall!”\nPilo is too slow to comply, distracted by his hallucination. The lamprey snaps forward like a jack-in-the-box and smashes his face into the wall he is meant to be watching. A small white supernova goes off behind his eyelids. He sinks, clutching at a nose that might be broken again, feeling hot copper blood seep through his fingers.\n“Position,” the guard grates. “Up! Arms out! Legs out!”\nEven as they say it, they drive a booted foot into his lower back. He slams into the wall again, tries to buffer the impact with his hands. They leave vermeil smears on the black glass. A malformed message darts through his mind’s eye:\nIT’S NOT YOUR FAULT.\n“You fecal stain,” the guard says. “You bacterial graveyard. You careless butcher.”\nThe words feel like a catechism. The boot swings again; this time it sucks all the air from his lungs. He doubles over, curling into himself on the cold floor.\n“Up,” the guard orders. “Up, and into position.”\nPilo turns, instead, and stares directly at his captor. Ignoring the shifting patterns, ignoring the menacing lamprey. He focuses on the shape of the guard’s shoulders, which are beginning to slump, and the tilt of the guard’s head, and the dangle of the guard’s hands. He remembers the way they fluttered and jerked before they scrawled the bloody letters.\nIt was the same guard; he is almost sure of that now. They are all the same guard.\n“What are you doing?” the guard snaps, and behind the electronic buzz, Pilo hears trepidation. He realizes that his captor has wrapped their arms around their body, mocking his fetal posture.\nBut when he raises one hand to wipe the blood from his bristly chin, the guard raises a hand of their own in perfect synchronization. Not mocking him. Something else.\n“Stop it,” the guard buzzes, then, to someone else: “We have a situation in cell 8403, we have—”\nPilo clenches his jaw shut as hard as he can, and the guard’s insectoid voice chokes off. His pulse rushes to fill the silence. His heart pounds fragile ribs. Pilo knows he must be dreaming this. He must be tossing and turning on the bed, waiting for the two-tone bell to chime.\nHe lifts his right hand high into the air. The guard mimics like a marionette, makes an angry gurgle deep in their throat. The lamprey thrashes, but it can’t attack without the guard’s permission, and the guard, some way, somehow, can’t give permission without Pilo’s.\nSlowly, slowly, he puts both hands to his own neck, where the seal of a mask would be if he were wearing one. His fingers find an intangible pressure hook. The guard’s fingers find a real one.\nThe guard’s mask peels away, and Pilo sees the same face he sees in the black glass. Scabbed lips, sunken eyes. He stares at himself. The guard-self stares back.\n“What did I do?” he asks. “I can’t remember anymore.”\nThe guard-self twitches, hocks. A glob of saliva smacks the floor between them. “You vermin,” the guard-self murmurs. “You stain.”\nThe catechism is back, but Pilo thinks he is losing the faith. He turns to the clear glass, peers into a dark and empty corridor.\nIT’S NOT YOUR FAULT.\n“Position,” he tells the guard-self. “Sorry.”\nPilo traverses the corridor as quickly as he can in the guard’s heavy boots. He has not walked much, and already his shins are aching, his knees are clicking. A stitch burns under his bottom rib. He left the guard’s weaponry on the floor of the cell, afraid to touch the writhing insectile thing, but he took the mask. It turns his panting into an anguished electric whine.\nThe corridor is all corners, a maze of black glass folded in on itself, and even though Pilo has no memory of being brought to his cell, he remembers this labyrinth in intimate detail. He can envision the other cells shuffling somewhere above him in the dark, an elaborate dance.\nBut when he reaches the junction, left and right open to him, he has not even a shred of intuition for which way leads to an exit. He halts there, gasping for breath.\n“Left.”\nHe startles. It’s the visitor’s voice, as crisp inside the mask as a whisper in his ear. She’s the one who started all this, who set off this reaction chain, and he knows, gut-deep, that she is making a mistake. If she knew what he did, she would not be trying to help him.\n“Who are you?” Pilo asks, again.\n“I’m the person who says left and then you go left,” the voice answers.\nPilo lingers a moment longer. “What happened in the cell? With that guard?”\nUnasked: why did he have my face?\n“Fuck if I know,” the voice says. “You’re the one with the blueprint, Pi. I’m working with fragments of fragments here. One of which says . . . ”\nPilo nods, even though she is not there to see it. He goes left.\nUp ahead, a cell is docked to the corridor for inspection. Pilo slows his stride on the visitor’s suggestion, trying to make his spine straight, his head high. If he moves like a guard, maybe they won’t question the bare space on his back where the bug should be.\n“Just walk straight past,” the visitor says. “Don’t even look in.”\nBut when he comes to the stretch of transparent glass, he can’t help turning his head. The cell is identical to his, the same featureless slab of a bed, the same nozzle for food, the same hole for shit. The guard is inspecting. The prisoner is in position on the wall.\nPilo sees his own gaunt face in profile. His veins frost shut.\nAll the guards are him. All the prisoners are him, too. Either he’s hallucinating, losing his mind in the dark of his cube, or—\n“Keep moving,” the visitor hisses, and he realizes he’s stopped.\nBut it’s too late. He’s already drawn attention: his prisoner-self stares balefully at him and his guard-self follows suit, head tilting, evaluating. Pilo feels the guard’s eyes trace the space where a lamprey tube should be. Feels surprise transmute to suspicion.\n“Malfunction,” Pilo says, by way of explanation.\nThe glass walls start to wail, an alarm that shivers through the air and into his bones. Red lights strobe the corridor, and Pilo runs.\nThe buzzing shouts of the guards echo through the maze; he can’t tell if they’re coming from ahead or behind as he turns left, right, right, left again, following the visitor’s clipped commands. His feet ache and his muscles are eating themselves. He’s tired, so tired that the bed in his cell would feel like heaven instead of hell.\n“Stop at the corner,” the voice orders. “Get low.”\nHe throws himself down and watches as two guards barrel past him, lamprey tubes bobbing. One of them gives an electric bark: prisoner 8403 unaccounted for, the destroyer is loose. Pilo’s heart thumps hard. His tongue flicks at the dried blood above his lip. He wonders what the beatings will be like if they catch him.\n“Almost there,” the visitor says. “Left again.”\nPilo takes two tries to get up off the floor, then staggers onward. He is certain the guards have turned around, certain he can hear their footfalls converging on him. The corridor narrows, branches a final time, and ends. The visitor has betrayed him. He’s been led to a corner and left for dead.\nThen he sees the stump of a maintenance ladder hanging down from the shadows. He limps to the base, leans against the rungs to catch his breath. When he looks up, he sees nothing but blackness.\n“They’re coming, Pi,” says the voice. “You have to start climbing.”\nPilo pushes his forehead against the ladder. Gasps in. Out.\n“Go up, Pi. You have to go up.”\nHe takes another ragged breath. He pictures all the cells moving through the dark, all the prisoners and guards wearing his face. The prison is well made, but he knows what it is, now. The thought has been building and building in the back of his skull.\n“This is all a sim,” he says hoarsely. “A deepsim.”\nFor a moment there’s no reply, and he thinks maybe the channel is one-way only. Then he hears a snort of static.\n“Yeah,” the visitor says. “Big twist. But those guards are still going to tune the shit out of you, and it’s going to feel very real.”\nOne dread mixes with another in Pilo’s simulated stomach. Maybe he shouldn’t be escaping at all. Maybe he was put in that cell for a good reason. He is, after all, the destroyer.\n“Come on, Pi.”\nThe voice is harsh and pleading at the same time, and he finally recognizes it, one realization unlocked by another. Her name sails to him across a void. He falters for a moment, frightened he might be wrong. His jaw works.\n“Kess?” he asks.\nHer voice thickens. “Yeah. Yes. Now climb, for fuck’s sake.”\nHe steps onto the first metal rung.\nPilo is a carcass. His limbs tremble; his head lolls with exhaustion. His hands gave out a dozen rungs ago, grip strength sapped to nothing, so he has to use his elbows, hooking them around each bar. It’s slow. Agonizing. The sound of the guards is gone for now, but he has Kess in his ear, urging him along.\nThe higher he climbs, the more he remembers about her. It begins with her face, the one he saw so briefly during the visitation, bright black eyes and high forehead. He sees it now from a variety of angles. Shifting haircuts, creeping tattoos, a hundred different expressions but most often a wide grin he knows was the precursor to a wild warbling laugh. Her voice has no trace of a smile in it now.\nHe pauses on the ladder to catch his breath but ends up wasting more of it on a question. “We’ve known each other a long time,” he says. “Are we friends?”\n“We were friends.”\nPilo remembers a tangle of twisting corridors, walls and ceilings swathed in moss, hydroponic gardens above and rusty maintenance tunnels below. A party with no gravity, chasing trembly globes of grain alcohol through the air. Bubble-shaped habs with soft warm beds. Viewports to a starry void.\n“Colony ship,” he says. “The Germinal.”\n“The Big Germ. Yeah.”\nBut he knows that’s not Kess’ nickname for it. Someone else calls the ship that, someone who is only a blur in his peripherals. Nearly every memory he has of him and Kess has a third person in it, too. Faceless, ghostly, hard to look at. Like the guards and their aggressive textile.\n“Why was I put in here?” he asks, because he doesn’t want to ask about the third person.\nHer voice tightens, and now he can picture her face doing the same. “You know that better than I do.”\n“I’m a criminal,” Pilo says, with a numb familiarity. “A bad one. The guards, you know, when they think I’m not listening—they call me the destroyer.”\n“Very dramatic,” Kess says. “We’re all destroyers, Pi. We’re all damaging each other at all times.”\n“No. What I did—”\n“We’re all each other’s entropy.” Kess’ voice is flat. Heavy. “What you did wasn’t special, Pi. It was fucked up, but it wasn’t special.”\nPilo feels a dart of dread and excitement mingled. “You know what I did?”\n“So do you,” Kess says. “You just buried it in this fucked-up place.”\nPilo senses it then, a memory-as-predator, a dark gray shape circling below him. “They also call me a fecal stain,” he says. “The guards. That one maybe suits better.”\nHe gathers his strength and starts climbing again, moving away from the labyrinth but also from the predator.\nKess puffs a small laugh, just a ghost of the one he remembers. “No,” she says. “You’re not getting me like that. Kess is all love today.”\nPilo’s next reach feels wrong. Suddenly he is clinging to the rungs to stop from plummeting, headfirst, toward the hatch that used to be above him. His gut floats outside his pericardium. Fluids circle in his inner ear, chasing each other like snapping dogs.\nNograv. It’s been a long time since he was in nograv.\n“You hit the edge of the Newt field,” Kess says. “Nice and light from here to outside.”\nPilo feels a shiver through his sternum, feels his heartbeat accelerate. He always knew, vaguely, that this was a prison ship. But going outside means going onto the hull. And if there is one place he should not go, should never go, it is the hull.\nPilo hears electric bellows echo up from below.\n“Guards found the ladder,” Kess says. “Hurry up.”\nPilo’s mouth opens and shuts. He tries to think of a way to explain to Kess, whose birthday is exactly one month before his, whose dark eyes peer out from a cloud of freckles, why he should not go to the hull. Why even the idea of it fills his empty belly with chunks of ice.\nBut he doesn’t know, so he resumes his climb, hand over hand, weightless as a spider.\nThere is an antechamber at the end of the ladder, a small red-lit bulb where he sheds the guard’s aggressive textile and dons a bright orange hullsuit instead. There is something horribly familiar about it. When the fabric shell slithers and tightens, adjusting to his dimensions, he feels a brief spike of panic.\nBut if he doesn’t go to the hull, he’ll end up dragged back to the cell. Back to the four black glass walls, back to eating gritty paste from a nozzle, back to the beatings and inspections. He puts on the helmet; it seals with a smell like burning plastic.\nFor a moment he’s blind. Then the filtration system hums to life and whisks the fog of his breath away. The hud shows him his oxygen full, his suit intact.\n“I’m waiting outside, Pi.” Kess’ voice echoes in his helmet. “Go time.”\nPilo’s feet are frozen. Kess is not the only thing waiting for him on the other side of the airlock. He can feel the memory-predator lurking out there, too, filing its teeth. If he goes onto the hull, something very bad is going to happen.\n“Why?” he asks, through a tightening throat. “If this is a deepsim, and you’re in the code, why can’t you just turn it off?”\n“Because some clever prick loaded it with fail-safes,” Kess says. “The only way out is through.”\nPilo can hear thumping and shouting through the vestibule door. The guards have reached the top of the ladder, guards who all have his face.\n“I programmed it, then,” he says, with a sick feeling of inevitability. “I put myself in here.”\nA clang on the door. The guards have caught up.\n“Now or never, now,” Kess says. “I did a lot of fucking work to rig this up, so respect my craft, will you?”\nPilo reaches for the airlock.\nThe pursuit is slow motion; it would be comical if Pilo were not exhausted and terrified. The hullsuit hud shows a swarm of moving red blots, and through his faceplate he sees them as guards coming from every direction, crawling not just from the airlock but from hidden crevices all across the hull of the prison ship. The biomechanical insects are detached from their hosts, skittering on their own skeletal legs.\nThey don’t want to let him go.\n“Nearly there,” Kess mutters. “Nearly, nearly.”\nHe’s heading for the engines, all the way aft, where Kess said she is waiting for him. His breath is a ragged ghost, rattling through the helmet filter. He knows he should be breathing in slow even sips, knows he simmed a hullwalk or something like it in another life, but his lungs are singularities. His heart is a hummingbird.\nHe’s been in the cell too long. The deepsim has rules, and it’s harder to bend them now that he knows he wrote them. The rules say his body has wasted away, fed on itself. He can feel it with every trembling step, but he can’t stop because his jailers are converging now, making him adjust course over and over.\nPilo waves his arm in the void, focused on the nearest guard, but the guard only speeds up, snarling through his faceplate. The marionette trick won’t work again. Waste of a second, waste of a calorie. Pilo redoubles his efforts. Drives his aching knee upward, feels the clack of the magnetics releasing, pitches forward, sets his boot, feels the clack of the magnetics taking hold—\nBlood thrums through his neck. Pulses behind his eyes, which he keeps pointed down, never up, both to be sure of his footing and to avoid looking into the endless black. The guards and the bugs aren’t the only things chasing him. He can feel the predatory memory out there, circling, circling.\n“You’re there, Pi. You see me?”\nPilo feels the rumble of the prison ship’s engine under his feet. He blinks the stinging sheet of sweat from his eyes, searches for a shuttle suckered to the hull.\n“No,” he says, with panic mounting his chest, crushing his ribs. “Where?”\n“Look up,” Kess says.\nPilo does not want to look up, but he does it. When he cranes his head back, when he sees the thicket of ice and dust, lit an eerie yellow by the dregs of some distant supernova, his heart almost stops.\nThe predatory memory crashes through his skull.\n“Beautiful, isn’t it,” says Rhetta.\nThe three of them are huddled around the viewport, looking down—or up, or sideways; they’re in nograv—at a massive helical shard of ice and dust. Pilo’s optic nerve is still throwing spots, from too much time in sim, but the tiny explosions of shimmering color only add to the ethereality.\nRhetta is right, as usual. The comet was worth seeing live.\n“Fucking payload, is what it is,” says Kess, emphatic on the curse just so Rhetta will make a face. “Think of all that water.” She offers Pilo a fist. “And Pi’s going to harpoon us right onto it.”\nPilo knocks fists, smiles, but Rhetta somehow detects the churn in his belly.\n“How’s the program coming?” she asks. “Still killing Kess’ bugs?”\nDuring his brief snatches of sleep, Pilo has been having nightmares about enormous biomechanical insects. His subconscious could stand to be more subtle.\n“It’ll be ready by contact,” he says. “I should get back in there.”\nPilo knows no colony ship is truly self-sustaining, no matter how precise its recycling of gas and matter. Entropy is always gnawing at the edges, poking its fingers through the gaps, and there are always unforeseen disasters: micrometeorites, reactor failures, blight in the hydroponic gardens.\nPilo knows that the Germinal has been limping for decades now, and that the comet is a gift they can’t afford to waste. The thought pounds at his temples as he works, as hours meet hours, as his fingers begin to twitch and cramp on the phantom data-pad.\nKess did the best she could with the corrupted base program, but it’s still teeming with error potential. He seals one gap and another opens. Even with the sim-to-real time exponential maxed out, with every minute outside an hour in here, they’ll barely make the launch window.\nWhen he finally emerges from the simpod, Rhetta is waiting with the green tea he asked for. “Kill count?” she asks, holding out the cup.\n“Eight-thousand, four-hundred and two,” Pilo says. “Which leaves one. The worst one.”\n“The grapple trigger,” Rhetta guesses. “Kess said it was a real cuss, cuss, extra cuss.”\nPilo takes the tea. “It’s ancient. Won’t talk to anything else. We haven’t chunked a moving comet in about a century, and we saw this one so late—” He breaks off, blinks at Rhetta from across the steaming crater of his cup. “Simming it, the grapple works seventy-eight percent of the time. Not nearly high enough when we only get one attempt.” He inhales. “But there’s a physical trigger, too.”\nRhetta looks at him for a long moment, then the wrinkles slacken around her eyes. “I’ll do it. I’ll ride it down.”\nPilo gives a hoarse laugh. “The physical trigger’s fully exposed, you’d be in a hullsuit and tether—”\n“Done hullwork since before you were born, Pilo.”\n“This is different. I can’t ask you to do this.”\n“So don’t. I’ll just cussing do it.”\nPilo watches through electric eyes as the harpoon makes its approach. The engineers put it together from scrap, bits of the Germinal slagged and reprinted as metal shell, drift-engine, spike-toothed grapple. There is a tiny bright orange spot against the pig-iron gray, a single exposed hand poking out from the hutch the engineers soldered at the last possible moment.\nThe ship took census; Rhetta’s request to babysit the trigger was approved, but not by everybody. Pilo can feel Kess beside him in the simpod. He can almost feel the stiff anger in her limbs, feel it radiating off her, heating the neuroconduction fluid.\nThe harpoon’s engine flares pale blue, a final burn to match velocity. This is not a sim. Pilo has to remind himself of that, over and over. This is not a rehearsal. This is the show.\nThis is the show, and the grapple’s not deploying. Pilo prays to an amoral universe. The grapple continues not deploying. They are in the twenty-two percent, and now Rhetta realizes that, realizes it’s her line. Pilo watches her crawl, slowly, cautiously, out from the hutch. The engineers placed as near the trigger as possible. She only has to move three meters. Pilo’s adrenaline sections them to millimeters.\nOne eternity goes by. Then another. Then he sees the minute motion, a gloved hand gripping and twisting, and the grapple deploys.\nIt burrows into the ice, hooking deep. Pilo feels a flood of triumph, of relief, of gratefulness, just before a jagged shard of frozen water comes loose, at an angle the sim never accounted for, and slices the arm of the bright orange hullsuit open.\nEntropy finds the gap, and inside the simpod Pilo can’t stop screaming Rhetta’s name.\n“You remember, now.”\nKess’ voice rocks him back to reality, or unreality. Back to the layer of consciousness cocooned in what was meant to be a therapy sim, before he twisted it beyond all recognition and locked the door behind him. Back to the punishment he devised for himself when nobody else would do it.\nHe is standing on the hull of the prison ship, boots magnetized to metal. The guards have circled up around him, penning him in. None of it is real. None of it matters. Only Rhetta matters: every time he blinks his eyes he sees her writhing, sees frost creeping across the inside of her faceplate.\nHis fault. His fault. His fault.\n“It should’ve been me,” he rasps.\n“Yeah. People always say that, Pi.”\nPilo feels his simulated lungs heaving, head spinning. “No,” he says. “It should have been me. I was simming it from almost the start. I knew the physical trigger was the better option, so I was simming the crawl, the placement, there was no time to rig something else—” He sinks to a crouch, the void crushing down at him from all angles. “I was so fucking scared. And I knew all I had to do was mention it, all I had to do was ask Rhetta to bring me tea—because that’s how she is. How she was.”\n“I know, Pi.” Kess’ voice is brittle flint. “You told us this. We told you to do your fucking therapy. And instead, you sealed yourself in the simpod and turned it into some good old-fashioned self-flagellation. Took me three months to find my way in.”\n“Why did you?” Pilo chokes. “What you wrote on the wall—you know that’s not true.”\n“I didn’t want to, at first. I thought, you know, your choice.” She pauses. “And I was angry. I still am so fucking angry. But it’s not doing me any good.”\nPilo pictures his body in the simpod, maybe hauled all the way to triage to monitor his vitals, to hook an intravenous to his trembling arm. He remembers he was intending to die in here.\n“I should go back,” he murmurs. “Back to the cell.”\n“No.” Kess snaps the word. “Not a chance. Not after I did all this work.”\n“You’re part of it,” Pilo says. “You must be. Part of the punishment. Getting me so close to escaping, then making me remember—”\n“I didn’t make you remember shit. Your brain did.” Kess’ voice trembles. “We’re not friends right now, Pi. We won’t be for a long time. Maybe forever. We’re not going to hug and cry when you wake up. But I need you out here anyway. The ship needs you.”\nVibrations move through his boots as the guards creep closer. Pilo sees his own face in all directions, sneering, jaundiced by the helmets’ yellow faceplates. Their boots clack and shiver. He can see their lips moving and hear the words in his head: you careless butcher, you fecal stain, you coward, you destroyer.\n“I don’t deserve that yet,” Pilo says. “I don’t deserve to be out there.”\n“Nobody deserves anything,” Kess says. “Hiding here torturing yourself isn’t helping Rhetta’s family, or me, or anyone else on the Germ. Trust me.” Her voice cracks. “Just fucking trust me, Pi. For once.”\nPilo’s chest aches. “I trust you,” he says. “Tell me what to do.”\n“Jump.”\n“Into the comet?” Pilo asks in a sob, knowing what he will see there, knowing he will find Rhetta’s writhing body, her open mouth growing ice.\n“Through the comet,” Kess says.\nImpossible. He’ll be impaled on a frozen spar, crushed in the shifting floes. The deepsim has rules, all sims have rules—\n“Just cussing do it.”\nPilo inhales. Exhales. He remembers a younger Rhetta slithering into her hullsuit, adjusting the baggy orange textile. Eyes bright, alert. Routine maintenance, but eager for it anyway, eager to get out of the Big Germ for a little while and see the stars.\nHe crouches down and demagnetizes his boots. Then, with his last shred of strength, he kicks off the hull. The guard-selves reach for him, wailing, suddenly panicked. The bugs gnash their lamprey teeth. He leaps through a dozen grasping hands, past a dozen metallic mouths, and floats free.\nHe glides toward the comet, and the comet pulls him in. Suddenly he’s accelerating, plunging downward, upward. He shuts his eyes tight, feels a cloud of frozen particulate wash across him, precursor to the drifting chunks that can tear him apart, and then—\nStillness.\nPilo has to squint, even through his auto-dimmed faceplate. He is drifting in empty space, no ice, no dust, no comet. He has an unimpeded view of the supernova. There’s a figure silhouetted against it, waiting in the middle of the ruined star.\nKess reaches out her hand.\nPilo’s long quiet is interrupted by the electric bleat of his heart monitor, by the gurgle of his simpod draining. He opens his eyes.\nRich Larson (Ymir, Tomorrow Factory) was born in Galmi, Niger, has lived in Spain and Czech Republic, and is currently based in Grande Prairie, Canada. His fiction has been translated into over a dozen languages, among them Polish, French, Romanian and Japanese, and his Clarkesworld story “Ice” was adapted into an Emmy-winning episode of LOVE DEATH + ROBOTS.", "source": "https://clarkesworldmagazine.com/fomley_larson_10_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Through by Eric Fomley and Rich Larson"}