{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Andy Duncan", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "qVO3nl5nWQoRsY1+9xlfZn5bGXc=", "id": null, "license": null, "comments": "", "raw_text": "5990 words, short story, REPRINT  Beluthahatchie  Everybody else got off the train at Hell, but I figured, it’s a free country. So I commenced to make myself a mite more comfortable. I put my feet up and leaned back against the window, laid my guitar across my chest and settled in with my hat tipped down over my eyes, almost. I didn’t know what the next stop was but I knew I’d like it better than Hell.  Whoo! I never saw such a mess. All that crowd of people jammed together on the Hell platform so tight you could faint standing up. One old battle-hammed woman hollering for Jesus, most everybody else just mumbling and crying and hugging their bags and leaning into each other and waiting to be told where to go. And hot? Man, I ain’t just beating my gums there. Not as hot as the Delta, but hot enough to keep old John on the train. No, sir, I told myself, no room out there for me.  Fat old conductor man pushed on down the aisle kinda slow, waiting on me to move. I decided I’d wait on that, too.  “Hey, nigger boy.” He slapped my foot with a rolled-up newspaper. Felt like the Atlanta paper. “This ain’t no sleeping car.”  “Git up off me, man. I ain’t done nothing.”  “Listen at you. Who you think you are, boy? Think you run the railroad? You don’t look nothing like Mr. George Pullman.” The conductor tried to put his foot up on the seat and lean on his knee, but he gave up with a grunt.  I ran one finger along my guitar strings, not hard enough to make a sound but just hard enough to feel them. “I ain’t got a ticket, neither,” I bit off, “but it was your railroad’s pleasure to bring me this far, and it’s my pleasure to ride on a little further, and I don’t see what cause you got to be so astorperious about it, Mr. Fat Ass.”  He started puffing and blowing. “What? What?” He was teakettle hot. You’d think I’d done something. “What did you call me, boy?” He whipped out a strap, and I saw how it was, and I was ready.  “Let him alone.”  Another conductor was standing outside the window across the aisle, stooping over to look in. He must have been right tall and right big too, filling up the window like that. Cut off most of the light. I couldn’t make out his face, but I got the notion that pieces of it was sliding around, like there wan’t quite a face ready to look at yet. “The Boss will pick him up at the next stop. Let him be.”  “The Boss?” Fat Ass was getting whiter all the time.  “The Boss said it would please him to greet this nigger personally.”  Fat Ass wan’t studying about me anymore. He slunk off, looking back big-eyed at the man outside the window. I let go my razor and let my hand creep up out of my sock, slow and easy, making like I was just shifting cause my leg was asleep.  The man outside hollered: “Board! All aboard! Next stop, Beluthahatchie!”  That old mama still a-going. “Jesus! Save us, Jesus!”  “All aboard for Beluthahatchie!”  “Jesus!”  We started rolling out.  “All aboard!”  “Sweet Je—” And her voice cut off just like that, like the squawk of a hen Meemaw would snatch for Sunday dinner. Wan’t my business. I looked out the window as the scenery picked up speed. Wan’t nothing to see, just fields and ditches and swaybacked mules and people stooping and picking, stooping and picking, and by and by a porch with old folks sitting on shuck-bottomed chairs looking out at all the years that ever was, and I thought I’d seen enough of all that to last me a while. Wan’t any of my business at all.  When I woke up I was lying on a porch bench at another station, and hanging on one chain was a blown-down sign that said Beluthahatchie. The sign wan’t swinging cause there wan’t no breath of air. Not a soul else in sight neither. The tracks ran off into the fields on both ends as far as I could see, but they was all weeded up like no train been through since the Surrender. The windows over my head was boarded up like the bank back home. The planks along the porch han’t been swept in years by nothing but the wind, and the dust was in whirly patterns all around.  Still lying down, I reached slowly beneath the bench, groping the air, till I heard, more than felt, my fingers pluck a note or two from the strings of my guitar. I grabbed it by the neck and sat up, pulling the guitar into my lap and hugging it, and I felt some better.  Pigeons in the eaves was a-fluttering and a-hooting all mournful-like, but I couldn’t see ’em. I reckon they was pigeons. Meemaw used to say that pigeons sometimes was the souls of dead folks let out of Hell. I didn’t think those folks back in Hell was flying noplace, but I did feel something was wrong, bad wrong, powerful wrong. I had the same crawly feeling as before I took that fatal swig—when Jar Head Sam, that harp-playing bastard, passed me a poisoned bottle at a Mississippi jook joint and I woke up on that one-way train.  Then a big old hound dog ambled around the corner of the station on my left, and another big old hound dog ambled around the comer of the station on my right. Each one was nearbouts as big as a calf and so fat it could hardly go, swanking along with its belly on the planks and its nose down. When the dogs snuffled up to the bench where I was sitting, their legs give out and they flopped down, yawned, grunted, and went fast to sleep like they’d been poleaxed. I could see the fleas hopping across their big butts. I started laughing.  “Lord, the hellhounds done caught up to me now! I surely must have led them a chase, I surely must. Look how wore out they are!” I hollered and cried, I was laughing so hard. One of them broke wind real long, and that set me off again. “Here come the brimstone! Here come the sulfur! Whoo! Done took my breath. Oh, Lordy.” I wiped my eyes.  Then I heard two way-off sounds, one maybe a youngun dragging a stick along a fence, and the other maybe a car motor.  “Well, shit,” I said.  Away off down the tracks, I saw a little spot of glare vibrating along in the sun. The flappity racket got louder and louder. Some fool was driving his car along on the tracks, a bumpety-bump, a bumpety-bump. It was a Hudson Terraplane, right sporty, exactly like what Peola June used to percolate around town in, and the chrome on the fender and hood was shining like a conk buster’s hair.  The hound dogs was sitting up now, watching the car. They was stiff and still on each side of my bench, like deacons sitting up with the dead.  When the car got nigh the platform it lurched up out of the cut, gravel spitting, gears grinding, and shut off in the yard at the end of the porch where I was sitting. Sheets of dust sailed away. The hot engine ticked. Then the driver’s door opened, and out slid the devil. I knew him well. Time I saw him slip down off the seat and hitch up his pants, I knew.  He was a sunburnt, bandy-legged, pussel-gutted li’l peckerwood. He wore braces and khaki pants and a dirty white undershirt and a big derby hat that had white hair flying out all around it like it was attached to the brim, like if he’d tip his hat to the ladies his hair would come off too.  He had a bright-red possum face, with beady, dumb black eyes and a long sharp nose, and no chin at all hardly and a big goozlum in his neck that jumped up and down like he couldn’t swallow his spit fast enough. He slammed the car door and scratched himself a little, up one arm and then the other, then up one leg till he got to where he liked it. He hunkered down and spit in the dust and looked all unconcerned like maybe he was waiting on a tornado to come along and blow some victuals his way, and he didn’t take any more notice of me than the hound dogs had.  I wan’t used to being treated such. “You keep driving on the tracks thataway, hoss,” I called, “and that Terraplane gone be butt-sprung for sure.”  He didn’t even look my way. After a long while, he stood up and leaned on a fender and lifted one leg and looked at the bottom of his muddy clodhopper, then put it down and lifted the other and looked at it too. Then he hitched his pants again and headed across the yard toward me. He favored his right leg a little and hardly picked up his feet at all when he walked. He left ruts in the yard like a plow. When he reached the steps, he didn’t so much climb ’em as stand his bantyweight self on each one and look proud, like each step was all his’n now, and then go on to claim the next one too. Once on the porch, he sat down with his shoulders against a post, took off his hat and fanned himself. His hair had a better hold on his head than I thought, what there was of it. Then he pulled out a stick and a pocketknife and commenced to whittle. But he did all these things so deliberate and thoughtful that it was almost the same as him talking, so I kept quiet and waited for the words to catch up.  “It will be a strange and disgraceful day unto this world,” he finally said, “when I ask a gut-bucket nigger guitar player for advice on autoMO-bile mechanics, or for anything else except a tune now and again.” He had eyes like he’d been shot twice in the face. “And furthermore, I am the Lord of Darkness and the Father of Lies, and if I want to drive my 1936 Hudson Terraplane, with its six-cylinder seventy-horsepower engine, out into the middle of some loblolly and shoot out its tires and rip up its seats and piss down its radiator hole, why, I will do it and do it again seven more times afore breakfast, and the voice that will stop me will not be yourn. You hearing me, John?”  “Ain’t my business,” I said. Like always, I was waiting to see how it was.  “That’s right, John, it ain’t your business,” the devil said. “Nothing I do is any of your business, John, but everything you do is mine. I was there the night you took that fatal drink, John. I saw you fold when your gut bent double on you, and I saw the shine of your blood coming up. I saw that whore you and Jar Head was squabbling over doing business at your funeral. It was a sorry-ass death of a sorry-ass man, John, and I had a big old time with it.”  The hound dogs had laid back down, so I stretched out and rested my feet on one of them. It rolled its eyes up at me like its feelings was hurt.  “I’d like to see old Jar Head one more time,” I said. “If he’ll be along directly, I’ll wait here and meet his train.”  “Jar Head’s plumb out of your reach now, John,” the devil said, still whittling. “I’d like to show you around your new home this afternoon. Come take a tour with me.”  “I had to drive fifteen miles to get to that jook joint in the first place,” I said, “and then come I don’t know how far on the train to Hell and past it. I’ve done enough traveling for one day.”  “Come with me, John.”  “I thank you, but I’ll just stay here.”  “It would please me no end if you made my rounds with me, John.” The stick he was whittling started moving in his hand. He had to grip it a little to hang on, but he just kept smiling. The stick started to bleed along the cuts, welling up black red as the blade skinned it. “I want to show off your new home place. You’d like that, wouldn’t you, John?” The blood curled down his arm like a snake.  I stood up and shook my head real slow and disgusted, like I was bored by his conjuring, but I made sure to hold my guitar between us as I walked past him. I walked to the porch steps with my back to the devil, and I was headed down them two at a time when he hollered out behind, “John! Where do you think you’re going?”  I said real loud, not looking back: “I done enough nothing for one day. I’m taking me a tour. If your ass has slipped between the planks and got stuck, I’ll fetch a couple of mules to pull you free.”  I heard him cuss and come scrambling after me with that leg a-dragging, sounding just like a scarecrow out on a stroll. I was holding my guitar closer to me all the time.  I wan’t real surprised that he let those two hound dogs ride up on the front seat of the Terraplane like they was Mrs. Roosevelt, while I had to walk in the road alongside, practically in the ditch. The devil drove real slow, talking to me out the window the whole time.  “Whyn’t you make me get off the train at Hell, with the rest of those sorry people?”  “Hell’s about full,” he said. “When I first opened for business out here, John, Hell wan’t no more’n a wide spot in the road. It took a long time to get any size on it. When you stole that dime from your poor old Meemaw to buy a French post card and she caught you and flailed you across the yard, even way back then, Hell wan’t no bigger’n Baltimore. But it’s about near more’n I can handle now, I tell you. Now I’m filling up towns all over these parts. Ginny Gall. Diddy-Wah-Diddy. West Hell—I’d run out of ideas when I named West Hell, John.”  A horsefly had got into my face and just hung there. The sun was fierce, and my clothes was sticking to me. My razor slid hot along my ankle. I kept favoring my guitar, trying to keep it out of the dust as best I could.  “Beluthahatchie, well, I’ll be frank with you, John, Beluthahatchie ain’t much of a place. I won’t say it don’t have possibilities, but right now it’s mostly just that railroad station, and a crossroads, and fields. One long, hot, dirty field after another.” He waved out the window at the scenery and grinned. He had yellow needly teeth. “You know your way around a field, I reckon, don’t you, John?”  “I know enough to stay out of ’em.”  His laugh was like a man cutting tin. “I swear you are a caution, John. It’s a wonder you died so young.”  We passed a right lot of folks, all of them working in the sun. Pulling tobacco. Picking cotton. Hoeing beans. Old folks scratching in gardens. Even younguns carrying buckets of water with two hands, slopping nearly all of it on the ground afore they’d gone three steps. All the people looked like they had just enough to eat to fill out the sad expression on their faces, and they all watched the devil as he drove slowly past. All those folks stared at me hard, too, and at the guitar like it was a third arm waving at ’em. I turned once to swat that blessed horsefly and saw a group of field hands standing in a knot, looking my way and pointing.  “Where all the white folks at?” I asked.  “They all up in heaven,” the devil said. “You think they let niggers into heaven?” We looked at each other a long time. Then the devil laughed again. “You ain’t buying that one for a minute, are you, John?”  I was thinking about Meemaw. I knew she was in heaven, if anyone was. When I was a youngun I figured she musta practically built the place, and had been paying off on it all along. But I didn’t say nothing.  “No, John, it ain’t that simple,” the devil said. “Beluthahatchie’s different for everybody, just like Hell. But you’ll be seeing plenty of white folks. Overseers. Train conductors. Sheriff’s deputies. If you get uppity, why, you’ll see whole crowds of white folks. Just like home, John. Everything’s the same. Why should it be any different?”  “’Cause you’re the devil,” I said. “You could make things a heap worse.”  “Now, could I really, John? Could I really?”  In the next field, a big man with hands like gallon jugs and a pink splash across his face was struggling all alone with a spindly mule and a plow made out of slats. “Get on, sir,” he was telling the mule. “Get on with you.” He didn’t even look around when the devil come chugging up alongside’  The devil gummed two fingers and whistled. “Ezekiel. Ezekiel! Come on over here, boy.”  Ezekiel let go the plow and stumbled over the furrows, stepping high and clumsy in the thick dusty earth, trying to catch up to the Terraplane and not mess up the rows too bad. The devil han’t slowed down any—in fact, I believe he had speeded up some. Left to his own doin’s, the mule headed across the rows, the plow jerking along sideways behind him.  “Yessir?” Ezekiel looked at me sorta curious like, and nodded his head so slight I wondered if he’d done it at all. “What you need with me, boss?”  “I wanted you to meet your new neighbor. This here’s John, and you ain’t gone believe this, but he used to be a big man in the jook joints in the Delta. Writing songs and playing that dimestore git fiddle.”  Ezekiel looked at me and said, “Yessir, I know John’s songs.” And I could tell he meant more than hearing them.  “Yes, John mighta been famous and saved enough whore money to buy him a decent instrument if he hadn’t up and got hisself killed. Yes, John used to be one high-rolling nigger, but you ain’t so high now, are you John?”  I stared at the li’l peckerwood and spit out: “High enough to see where I’m going, Ole Massa.”  I heard Ezekiel suck in his breath. The devil looked away from me real casual and back to Ezekiel, like we was chatting on a veranda someplace.  “Well, Ezekiel, this has been a nice long break for you, but I reckon you ought to get on back to work now. Looks like your mule’s done got loose.” He cackled and speeded up the car. Ezekiel and I both walked a few more steps and stopped. We watched the back of the Terraplane getting smaller, and then I turned to watch his face from the side. I han’t seen that look on any of my people since Mississippi.  I said, “Man, why do you all take this shit?”  He wiped his forehead with his wrist and adjusted his hat. “Why do you?” he asked. “Why do you, John?” He was looking at me strange, and when he said my name it was like a one-word sentence all its own.  I shrugged. “I’m just seeing how things are. It’s my first day.”  “Your first day will be the same as all the others, then. That sure is the story with me. How come you called him Ole Massa just now?”  “Don’t know. Just to get a rise out of him, I reckon.”  Away off down the road, the Terraplane had stopped, engine still running, and the little cracker was yelling. “John! You best catch up, John. You wouldn’t want me to leave you wandering in the dark, now would you?”  I started walking, not in any gracious hurry though, and Ezekiel paced me. “I asked ’cause it put me in mind of the old stories. You remember those stories, don’t you? About Ole Massa and his slave by name of John? And how they played tricks on each other all the time?”  “Meemaw used to tell such when I was a youngun. What about it?”  He was trotting to keep up with me now, but I wan’t even looking his way. “And there’s older stories than that, even. Stories about High John the Conqueror. The one who could-”  “Get on back to your mule,” I said. “I think the sun has done touched you.”  “—the one who could set his people free,” Ezekiel said, grabbing my shoulder and swinging me around. He stared into my face like a man looking for something he’s dropped and has got to find.  “John!” the devil cried.  We stood there in the sun, me and Ezekiel, and then something went out of his eyes, and he let go and walked back across the ditch and trudged after the mule without a word.  I caught up to the Terraplane just in time for it to roll off again. I saw how it was, all right.  A ways up the road, a couple of younguns was fishing off the right side of a plank bridge, and the devil announced he would stop to see had they caught anything, and if they had, to take it for his supper. He slid out of the Terraplane, with it still running, and the dogs fell out after him, a-hoping for a snack, I reckon. When the devil got hunkered down good over there with the younguns, facing the swift-running branch, I sidled up the driver’s side of the car, eased my guitar into the back seat, eased myself into the front seat, yanked the thing into gear and drove off. As I went past I saw three round O’s—a youngun and the devil and a youngun again.  It was a pure pleasure to sit down, and the breeze coming through the windows felt good too. I commenced to get even more of a breeze going, on that long, straightaway road. I just could hear the devil holler back behind:  “John! Get your handkerchief-headed, free-school Negro ass back here with my auto-MO-bile! Johhhhnnn!”  “Here I come, old hoss,” I said, and I jerked the wheel and slewed that car around and barreled off back toward the bridge. The younguns and the dogs was ahead of the devil in figuring things out. The younguns scrambled up a tree as quick as squirrels, and the dogs went loping into a ditch, but the devil was all preoccupied, doing a salty jump and cussing me for a dadblasted blagstagging liver-lipped stormbuzzard, jigging around right there in the middle of the bridge, and he was still cussing when I drove full tilt onto that bridge and he did not cuss any less when he jumped clean out from under his hat and he may even have stepped it up some when he went over the side. I heard a ker-plunk like a big rock chunked into a pond just as I swerved to bust the hat with a front tire and then I was off the bridge and racing back the way we’d come, and that hat mashed in the road behind me like a possum.  I knew something simply awful was going to happen, but man! I slapped the dashboard and kissed my hand and slicked it back across my hair and said aloud, “Lightly, slightly, and politely.” And I meant that thing. But my next move was to whip that razor out of my sock, flip it open and lay it on the seat beside me, just in case.  I came up the road fast, and from way off I saw Ezekiel and the mule planted in the middle of his field like rocks. As they got bigger I saw both their heads had been turned my way the whole time, like they’d started looking before I even came over the hill. When I got level with them I stopped, engine running, and leaned on the horn until Ezekiel roused himself and walked over. The mule followed behind, like a yard dog, without being cussed or hauled or whipped. I must have been a sight. Ezekiel shook his head the whole way. “Oh, John,” he said. “Oh, my goodness. Oh, John.”  “Jump in, brother,” I said. “Let Ole Massa plow this field his own damn self.”  Ezekiel rubbed his hands along the chrome on the side of the car, swiping up and down and up and down. I was scared he’d burn himself. “Oh, John.” He kept shaking his head. “John tricks Ole Massa again. High John the Conqueror rides the Terraplane to glory.”  “Quit that, now. You worry me.”  “John, those songs you wrote been keeping us going down here. Did you know that?”  “I ’preciate it.”  “But lemme ask you, John. Lemme ask you something before you ride off. How come you wrote all those songs about hellhounds and the devil and such? How come you was so sure you’d be coming down here when you died?”  I fidgeted and looked in the mirror at the road behind. “Man, I don’t know. Couldn’t imagine nothing else. Not for me, anyway.”  Ezekiel laughed once, loud, boom, like a shotgun going off.  “Don’t be doing that, man. I about jumped out of my britches. Come on and let’s go.”  He shook his head again. “Maybe you knew you was needed down here, John. Maybe you knew we was singing, and telling stories, and waiting.” He stepped back into the dirt. “This is your ride, John. But I’ll make sure everybody knows what you done. I’ll tell ’em that things has changed in Beluthahatchie.”  He looked off down the road. “You’d best get on. Shoot—maybe you can find some jook joint and have some fun afore he catches up to you.”  “Maybe so, brother, maybe so.”  I han’t gone two miles afore I got that bad old crawly feeling. I looked over to the passengers’ side of the car and saw it was all spattered with blood, the leather and the carpet and the chrome on the door, and both those mangy hound dogs was sprawled across the front seat wallowing in it, both licking my razor like it was something good, and that’s where the blood was coming from, welling up from the blade with each pass of their tongues. Time I caught sight of the dogs, they both lifted their heads and went to howling. It wan’t no howl like any dog should howl. It was more like a couple of panthers in the night.  “Hush up, you dogs!” I yelled. “Hush up, I say!”  One of the dogs kept on howling, but the other looked me in the eyes and gulped air, his jowls flapping, like he was fixing to bark, but instead of barking said:  “Hush yourself, nigger.”  When I looked back at the road, there wan’t no road, just a big thicket of bushes and trees a-coming at me. Then came a whole lot of screeching and scraping and banging, with me holding onto the wheel just to keep from flying out of the seat, and then the car went sideways and I heard an awful bang and a crack and then I didn’t know anything else. I just opened my eyes later, I don’t know how much later, and found me and my guitar lying on the shore of the Lake of the Dead.  I had heard tell of that dreadful place, but I never had expected to see it for myself. Preacher Dodds whispered to us younguns once or twice about it, and said you have to work awful hard and be awful mean to get there, and once you get there, there ain’t no coming back. “Don’t seek it, my children, don’t seek it,” he’d say.  As far as I could see, all along the edges of the water, was bones and carcasses and lumps that used to be animals—mules and horses and cows and coons and even little dried-up birds scattered like hickory chips, and some things lying away off that might have been animals and might not have been, oh Lord, I didn’t go to look. A couple of buzzards was strolling the edge of the water, not acting hungry nor vicious but just on a tour, I reckon. The sun was setting, but the water didn’t cast no shine at all. It had a dim and scummy look, so flat and still that you’d be tempted to try to walk across it, if any human could bear seeing what lay on the other side. “Don’t seek it, my children, don’t seek it.” I han’t sought it, but now the devil had sent me there, and all I knew to do was hold my guitar close to me and watch those buzzards a-picking and a-pecking and wait for it to get dark. And Lord, what would this place be like in the dark?  But the guitar did feel good up against me thataway, like it had stored up all the songs I ever wrote or sung to comfort me in a hard time. I thought about those field hands a-pointing my way, and about Ezekiel sweating along behind his mule, and the way he grabbed aholt of my shoulder and swung me around. And I remembered the new song I had been fooling with all day in my head while I was following that li’l peckerwood in the Terraplane.  “Well, boys,” I told the buzzards, “if the devil’s got some powers I reckon I got some, too. I didn’t expect to be playing no blues after I was dead. But I guess that’s all there is to play now. ’Sides, I’ve played worse places.”  I started humming and strumming, and then just to warm up I played “Rambling on My Mind” cause it was, and “Sweet Home Chicago” cause I figured I wouldn’t see that town no more, and “Terraplane Blues” on account of that damn car. Then I sang the song I had just made up that day.  I’m down in Beluthahatchie, baby, Way out where the trains don’t run Yes, I’m down in Beluthahatchie, baby, Way out where the trains don’t run Who’s gonna take you strolling now Since your man he is dead and gone My body’s all laid out mama But my soul can’t get no rest My body’s all laid out mama But my soul can’t get no rest Cause you’ll be sportin with another man Lookin for some old Mr. Second Best Plain folks got to walk the line But the Devil he can up and ride Folks like us we walk the line But the Devil he can up and ride And I won’t never have blues enough Ooh, to keep that Devil satisfied. When I was done it was black dark and the crickets was zinging and everything was changed.  “You can sure get around this country,” I said, “Just a-sitting on your ass.”  I was in a cane-back chair on the porch of a little wooden house, with bugs smacking into an oil lamp over my head. Just an old cropper place, sitting in the middle of a cotton field, but it had been spruced up some. Somebody had swept the yard clean, from what I could see of it, and on a post above the dipper was a couple of yellow flowers in a nailed-up Chase & Sanborn can.  When I looked back down at the yard, though, it wan’t clean anymore. There was words written in the dirt, big and scrawly like from someone dragging his foot.  DON’T GET A BIG HEAD JOHN I’LL BE BACK Sitting on my name was those two fat old hound dogs. “Get on with your damn stinking talking serves,” I yelled, and I shied a rock at them. It didn’t go near as far as I expected, just sorta plopped down into the dirt, but the hounds yawned and got up, snuffling each other, and waddled off into the dark.  I stood up and stretched and mumbled. But something was still shifting in the yard, just past where the light was. Didn’t sound like no dogs, though.  “Who that? Who that who got business with a wore out dead man?”  Then they come up toward the porch a little closer where I could see. It was a whole mess of colored folks, men in overalls and women in aprons, granny women in bonnets pecking the ground with walking sticks, younguns with their bellies pookin out and no pants on, an old man with Coke-bottle glasses and his eyes swimming in your face nearly, and every last one of them grinning like they was touched. Why, Preacher Dodds woulda passed the plate and called it a revival. They massed up against the edge of the porch, crowding closer in and bumping up against each other, and reaching their arms out and taking hold of me, my lapels, my shoulders, my hands, my guitar, my face, the little ones aholt of my pants legs—not hauling on me or messing with me, just touching me feather light here and there like Meemaw used to touch her favorite quilt after she’d already folded it to put away. They was talking, too, mumbling and whispering and saying, “Here he is. We heard he was coming and here he is. God bless you friend, God bless you brother, God bless you son.” Some of the womenfolks was crying, and there was Ezekiel, blowing his nose on a rag.  “Y’all got the wrong man,” I said, directly, but they was already heading back across the yard, which was all churned up now, no words to read and no pattern neither. They was looking back at me and smiling and touching, holding hands and leaning into each other, till they was all gone and it was just me and the crickets and the cotton.  Wan’t nowhere else to go, so I opened the screen door and went on in the house. There was a bed all turned down with a feather pillow, and in the middle of the checkered oilcloth on the table was a crock of molasses, a jar of buttermilk, and a plate covered with a rag. The buttermilk was cool like it had been chilling in the well, with water beaded up on the sides of the jar. Under the rag was three hoecakes and a slab of bacon.  When I was done with my supper, I latched the front door, lay down on the bed and was just about dead to the world when I heard something else out in the yard—swish, swish, swish. Out the window I saw, in the edge of the porch light, one old granny woman with a shuck broom, smoothing out the yard where the folks had been. She was sweeping it as clean as for company on a Sunday. She looked up from under her bonnet and showed me what teeth she had and waved from the wrist like a youngun, and then she backed on out of the light, swish swish swish, rubbing out her tracks as she went.    Originally published in Asimov’s Science Fiction Magazine, March 1997. Andy Duncan made his first sale in 1997. By the beginning of the new century, he was widely recognized as one of the most individual, quirky, and flavorful new voices on the scene today. His story \"The Executioner's Guild\" was on both the Final Nebula Ballot and the final ballot for the World Fantasy Award in 2000, and in 2001 he won two World Fantasy Awards, for his story \"The Pottawatomie Giant,\" and for his landmark first collection, Beluthahatchie and Other Stories. He also won the Theodore Sturgeon Memorial Award in 2002 for his novella \"The Chief Designer.\" His other books include an anthology co-edited with F. Brett Cox, Crossroads: Tales of the Southern Literary Fantastic, and a non-fiction guidebook, Alabama Curiosities. His most recent books include a chapbook novella, The Night Cache, and a new collection, The Pottawatomie Giant and Other Stories. A graduate of the Clarion West writers' workshop in Seattle, he was born in Batesberg, South Carolina, now lives in Frostburg, Maryland with his wife Sydney, and is an Assistant Professor in the Department of English at Frostburo State University.", "text": "5990 words, short story, REPRINT\nBeluthahatchie\nEverybody else got off the train at Hell, but I figured, it’s a free country. So I commenced to make myself a mite more comfortable. I put my feet up and leaned back against the window, laid my guitar across my chest and settled in with my hat tipped down over my eyes, almost. I didn’t know what the next stop was but I knew I’d like it better than Hell.\nWhoo! I never saw such a mess. All that crowd of people jammed together on the Hell platform so tight you could faint standing up. One old battle-hammed woman hollering for Jesus, most everybody else just mumbling and crying and hugging their bags and leaning into each other and waiting to be told where to go. And hot? Man, I ain’t just beating my gums there. Not as hot as the Delta, but hot enough to keep old John on the train. No, sir, I told myself, no room out there for me.\nFat old conductor man pushed on down the aisle kinda slow, waiting on me to move. I decided I’d wait on that, too.\n“Hey, nigger boy.” He slapped my foot with a rolled-up newspaper. Felt like the Atlanta paper. “This ain’t no sleeping car.”\n“Git up off me, man. I ain’t done nothing.”\n“Listen at you. Who you think you are, boy? Think you run the railroad? You don’t look nothing like Mr. George Pullman.” The conductor tried to put his foot up on the seat and lean on his knee, but he gave up with a grunt.\nI ran one finger along my guitar strings, not hard enough to make a sound but just hard enough to feel them. “I ain’t got a ticket, neither,” I bit off, “but it was your railroad’s pleasure to bring me this far, and it’s my pleasure to ride on a little further, and I don’t see what cause you got to be so astorperious about it, Mr. Fat Ass.”\nHe started puffing and blowing. “What? What?” He was teakettle hot. You’d think I’d done something. “What did you call me, boy?” He whipped out a strap, and I saw how it was, and I was ready.\n“Let him alone.”\nAnother conductor was standing outside the window across the aisle, stooping over to look in. He must have been right tall and right big too, filling up the window like that. Cut off most of the light. I couldn’t make out his face, but I got the notion that pieces of it was sliding around, like there wan’t quite a face ready to look at yet. “The Boss will pick him up at the next stop. Let him be.”\n“The Boss?” Fat Ass was getting whiter all the time.\n“The Boss said it would please him to greet this nigger personally.”\nFat Ass wan’t studying about me anymore. He slunk off, looking back big-eyed at the man outside the window. I let go my razor and let my hand creep up out of my sock, slow and easy, making like I was just shifting cause my leg was asleep.\nThe man outside hollered: “Board! All aboard! Next stop, Beluthahatchie!”\nThat old mama still a-going. “Jesus! Save us, Jesus!”\n“All aboard for Beluthahatchie!”\n“Jesus!”\nWe started rolling out.\n“All aboard!”\n“Sweet Je—” And her voice cut off just like that, like the squawk of a hen Meemaw would snatch for Sunday dinner. Wan’t my business. I looked out the window as the scenery picked up speed. Wan’t nothing to see, just fields and ditches and swaybacked mules and people stooping and picking, stooping and picking, and by and by a porch with old folks sitting on shuck-bottomed chairs looking out at all the years that ever was, and I thought I’d seen enough of all that to last me a while. Wan’t any of my business at all.\nWhen I woke up I was lying on a porch bench at another station, and hanging on one chain was a blown-down sign that said Beluthahatchie. The sign wan’t swinging cause there wan’t no breath of air. Not a soul else in sight neither. The tracks ran off into the fields on both ends as far as I could see, but they was all weeded up like no train been through since the Surrender. The windows over my head was boarded up like the bank back home. The planks along the porch han’t been swept in years by nothing but the wind, and the dust was in whirly patterns all around.\nStill lying down, I reached slowly beneath the bench, groping the air, till I heard, more than felt, my fingers pluck a note or two from the strings of my guitar. I grabbed it by the neck and sat up, pulling the guitar into my lap and hugging it, and I felt some better.\nPigeons in the eaves was a-fluttering and a-hooting all mournful-like, but I couldn’t see ’em. I reckon they was pigeons. Meemaw used to say that pigeons sometimes was the souls of dead folks let out of Hell. I didn’t think those folks back in Hell was flying noplace, but I did feel something was wrong, bad wrong, powerful wrong. I had the same crawly feeling as before I took that fatal swig—when Jar Head Sam, that harp-playing bastard, passed me a poisoned bottle at a Mississippi jook joint and I woke up on that one-way train.\nThen a big old hound dog ambled around the corner of the station on my left, and another big old hound dog ambled around the comer of the station on my right. Each one was nearbouts as big as a calf and so fat it could hardly go, swanking along with its belly on the planks and its nose down. When the dogs snuffled up to the bench where I was sitting, their legs give out and they flopped down, yawned, grunted, and went fast to sleep like they’d been poleaxed. I could see the fleas hopping across their big butts. I started laughing.\n“Lord, the hellhounds done caught up to me now! I surely must have led them a chase, I surely must. Look how wore out they are!” I hollered and cried, I was laughing so hard. One of them broke wind real long, and that set me off again. “Here come the brimstone! Here come the sulfur! Whoo! Done took my breath. Oh, Lordy.” I wiped my eyes.\nThen I heard two way-off sounds, one maybe a youngun dragging a stick along a fence, and the other maybe a car motor.\n“Well, shit,” I said.\nAway off down the tracks, I saw a little spot of glare vibrating along in the sun. The flappity racket got louder and louder. Some fool was driving his car along on the tracks, a bumpety-bump, a bumpety-bump. It was a Hudson Terraplane, right sporty, exactly like what Peola June used to percolate around town in, and the chrome on the fender and hood was shining like a conk buster’s hair.\nThe hound dogs was sitting up now, watching the car. They was stiff and still on each side of my bench, like deacons sitting up with the dead.\nWhen the car got nigh the platform it lurched up out of the cut, gravel spitting, gears grinding, and shut off in the yard at the end of the porch where I was sitting. Sheets of dust sailed away. The hot engine ticked. Then the driver’s door opened, and out slid the devil. I knew him well. Time I saw him slip down off the seat and hitch up his pants, I knew.\nHe was a sunburnt, bandy-legged, pussel-gutted li’l peckerwood. He wore braces and khaki pants and a dirty white undershirt and a big derby hat that had white hair flying out all around it like it was attached to the brim, like if he’d tip his hat to the ladies his hair would come off too.\nHe had a bright-red possum face, with beady, dumb black eyes and a long sharp nose, and no chin at all hardly and a big goozlum in his neck that jumped up and down like he couldn’t swallow his spit fast enough. He slammed the car door and scratched himself a little, up one arm and then the other, then up one leg till he got to where he liked it. He hunkered down and spit in the dust and looked all unconcerned like maybe he was waiting on a tornado to come along and blow some victuals his way, and he didn’t take any more notice of me than the hound dogs had.\nI wan’t used to being treated such. “You keep driving on the tracks thataway, hoss,” I called, “and that Terraplane gone be butt-sprung for sure.”\nHe didn’t even look my way. After a long while, he stood up and leaned on a fender and lifted one leg and looked at the bottom of his muddy clodhopper, then put it down and lifted the other and looked at it too. Then he hitched his pants again and headed across the yard toward me. He favored his right leg a little and hardly picked up his feet at all when he walked. He left ruts in the yard like a plow. When he reached the steps, he didn’t so much climb ’em as stand his bantyweight self on each one and look proud, like each step was all his’n now, and then go on to claim the next one too. Once on the porch, he sat down with his shoulders against a post, took off his hat and fanned himself. His hair had a better hold on his head than I thought, what there was of it. Then he pulled out a stick and a pocketknife and commenced to whittle. But he did all these things so deliberate and thoughtful that it was almost the same as him talking, so I kept quiet and waited for the words to catch up.\n“It will be a strange and disgraceful day unto this world,” he finally said, “when I ask a gut-bucket nigger guitar player for advice on autoMO-bile mechanics, or for anything else except a tune now and again.” He had eyes like he’d been shot twice in the face. “And furthermore, I am the Lord of Darkness and the Father of Lies, and if I want to drive my 1936 Hudson Terraplane, with its six-cylinder seventy-horsepower engine, out into the middle of some loblolly and shoot out its tires and rip up its seats and piss down its radiator hole, why, I will do it and do it again seven more times afore breakfast, and the voice that will stop me will not be yourn. You hearing me, John?”\n“Ain’t my business,” I said. Like always, I was waiting to see how it was.\n“That’s right, John, it ain’t your business,” the devil said. “Nothing I do is any of your business, John, but everything you do is mine. I was there the night you took that fatal drink, John. I saw you fold when your gut bent double on you, and I saw the shine of your blood coming up. I saw that whore you and Jar Head was squabbling over doing business at your funeral. It was a sorry-ass death of a sorry-ass man, John, and I had a big old time with it.”\nThe hound dogs had laid back down, so I stretched out and rested my feet on one of them. It rolled its eyes up at me like its feelings was hurt.\n“I’d like to see old Jar Head one more time,” I said. “If he’ll be along directly, I’ll wait here and meet his train.”\n“Jar Head’s plumb out of your reach now, John,” the devil said, still whittling. “I’d like to show you around your new home this afternoon. Come take a tour with me.”\n“I had to drive fifteen miles to get to that jook joint in the first place,” I said, “and then come I don’t know how far on the train to Hell and past it. I’ve done enough traveling for one day.”\n“Come with me, John.”\n“I thank you, but I’ll just stay here.”\n“It would please me no end if you made my rounds with me, John.” The stick he was whittling started moving in his hand. He had to grip it a little to hang on, but he just kept smiling. The stick started to bleed along the cuts, welling up black red as the blade skinned it. “I want to show off your new home place. You’d like that, wouldn’t you, John?” The blood curled down his arm like a snake.\nI stood up and shook my head real slow and disgusted, like I was bored by his conjuring, but I made sure to hold my guitar between us as I walked past him. I walked to the porch steps with my back to the devil, and I was headed down them two at a time when he hollered out behind, “John! Where do you think you’re going?”\nI said real loud, not looking back: “I done enough nothing for one day. I’m taking me a tour. If your ass has slipped between the planks and got stuck, I’ll fetch a couple of mules to pull you free.”\nI heard him cuss and come scrambling after me with that leg a-dragging, sounding just like a scarecrow out on a stroll. I was holding my guitar closer to me all the time.\nI wan’t real surprised that he let those two hound dogs ride up on the front seat of the Terraplane like they was Mrs. Roosevelt, while I had to walk in the road alongside, practically in the ditch. The devil drove real slow, talking to me out the window the whole time.\n“Whyn’t you make me get off the train at Hell, with the rest of those sorry people?”\n“Hell’s about full,” he said. “When I first opened for business out here, John, Hell wan’t no more’n a wide spot in the road. It took a long time to get any size on it. When you stole that dime from your poor old Meemaw to buy a French post card and she caught you and flailed you across the yard, even way back then, Hell wan’t no bigger’n Baltimore. But it’s about near more’n I can handle now, I tell you. Now I’m filling up towns all over these parts. Ginny Gall. Diddy-Wah-Diddy. West Hell—I’d run out of ideas when I named West Hell, John.”\nA horsefly had got into my face and just hung there. The sun was fierce, and my clothes was sticking to me. My razor slid hot along my ankle. I kept favoring my guitar, trying to keep it out of the dust as best I could.\n“Beluthahatchie, well, I’ll be frank with you, John, Beluthahatchie ain’t much of a place. I won’t say it don’t have possibilities, but right now it’s mostly just that railroad station, and a crossroads, and fields. One long, hot, dirty field after another.” He waved out the window at the scenery and grinned. He had yellow needly teeth. “You know your way around a field, I reckon, don’t you, John?”\n“I know enough to stay out of ’em.”\nHis laugh was like a man cutting tin. “I swear you are a caution, John. It’s a wonder you died so young.”\nWe passed a right lot of folks, all of them working in the sun. Pulling tobacco. Picking cotton. Hoeing beans. Old folks scratching in gardens. Even younguns carrying buckets of water with two hands, slopping nearly all of it on the ground afore they’d gone three steps. All the people looked like they had just enough to eat to fill out the sad expression on their faces, and they all watched the devil as he drove slowly past. All those folks stared at me hard, too, and at the guitar like it was a third arm waving at ’em. I turned once to swat that blessed horsefly and saw a group of field hands standing in a knot, looking my way and pointing.\n“Where all the white folks at?” I asked.\n“They all up in heaven,” the devil said. “You think they let niggers into heaven?” We looked at each other a long time. Then the devil laughed again. “You ain’t buying that one for a minute, are you, John?”\nI was thinking about Meemaw. I knew she was in heaven, if anyone was. When I was a youngun I figured she musta practically built the place, and had been paying off on it all along. But I didn’t say nothing.\n“No, John, it ain’t that simple,” the devil said. “Beluthahatchie’s different for everybody, just like Hell. But you’ll be seeing plenty of white folks. Overseers. Train conductors. Sheriff’s deputies. If you get uppity, why, you’ll see whole crowds of white folks. Just like home, John. Everything’s the same. Why should it be any different?”\n“’Cause you’re the devil,” I said. “You could make things a heap worse.”\n“Now, could I really, John? Could I really?”\nIn the next field, a big man with hands like gallon jugs and a pink splash across his face was struggling all alone with a spindly mule and a plow made out of slats. “Get on, sir,” he was telling the mule. “Get on with you.” He didn’t even look around when the devil come chugging up alongside’\nThe devil gummed two fingers and whistled. “Ezekiel. Ezekiel! Come on over here, boy.”\nEzekiel let go the plow and stumbled over the furrows, stepping high and clumsy in the thick dusty earth, trying to catch up to the Terraplane and not mess up the rows too bad. The devil han’t slowed down any—in fact, I believe he had speeded up some. Left to his own doin’s, the mule headed across the rows, the plow jerking along sideways behind him.\n“Yessir?” Ezekiel looked at me sorta curious like, and nodded his head so slight I wondered if he’d done it at all. “What you need with me, boss?”\n“I wanted you to meet your new neighbor. This here’s John, and you ain’t gone believe this, but he used to be a big man in the jook joints in the Delta. Writing songs and playing that dimestore git fiddle.”\nEzekiel looked at me and said, “Yessir, I know John’s songs.” And I could tell he meant more than hearing them.\n“Yes, John mighta been famous and saved enough whore money to buy him a decent instrument if he hadn’t up and got hisself killed. Yes, John used to be one high-rolling nigger, but you ain’t so high now, are you John?”\nI stared at the li’l peckerwood and spit out: “High enough to see where I’m going, Ole Massa.”\nI heard Ezekiel suck in his breath. The devil looked away from me real casual and back to Ezekiel, like we was chatting on a veranda someplace.\n“Well, Ezekiel, this has been a nice long break for you, but I reckon you ought to get on back to work now. Looks like your mule’s done got loose.” He cackled and speeded up the car. Ezekiel and I both walked a few more steps and stopped. We watched the back of the Terraplane getting smaller, and then I turned to watch his face from the side. I han’t seen that look on any of my people since Mississippi.\nI said, “Man, why do you all take this shit?”\nHe wiped his forehead with his wrist and adjusted his hat. “Why do you?” he asked. “Why do you, John?” He was looking at me strange, and when he said my name it was like a one-word sentence all its own.\nI shrugged. “I’m just seeing how things are. It’s my first day.”\n“Your first day will be the same as all the others, then. That sure is the story with me. How come you called him Ole Massa just now?”\n“Don’t know. Just to get a rise out of him, I reckon.”\nAway off down the road, the Terraplane had stopped, engine still running, and the little cracker was yelling. “John! You best catch up, John. You wouldn’t want me to leave you wandering in the dark, now would you?”\nI started walking, not in any gracious hurry though, and Ezekiel paced me. “I asked ’cause it put me in mind of the old stories. You remember those stories, don’t you? About Ole Massa and his slave by name of John? And how they played tricks on each other all the time?”\n“Meemaw used to tell such when I was a youngun. What about it?”\nHe was trotting to keep up with me now, but I wan’t even looking his way. “And there’s older stories than that, even. Stories about High John the Conqueror. The one who could-”\n“Get on back to your mule,” I said. “I think the sun has done touched you.”\n“—the one who could set his people free,” Ezekiel said, grabbing my shoulder and swinging me around. He stared into my face like a man looking for something he’s dropped and has got to find.\n“John!” the devil cried.\nWe stood there in the sun, me and Ezekiel, and then something went out of his eyes, and he let go and walked back across the ditch and trudged after the mule without a word.\nI caught up to the Terraplane just in time for it to roll off again. I saw how it was, all right.\nA ways up the road, a couple of younguns was fishing off the right side of a plank bridge, and the devil announced he would stop to see had they caught anything, and if they had, to take it for his supper. He slid out of the Terraplane, with it still running, and the dogs fell out after him, a-hoping for a snack, I reckon. When the devil got hunkered down good over there with the younguns, facing the swift-running branch, I sidled up the driver’s side of the car, eased my guitar into the back seat, eased myself into the front seat, yanked the thing into gear and drove off. As I went past I saw three round O’s—a youngun and the devil and a youngun again.\nIt was a pure pleasure to sit down, and the breeze coming through the windows felt good too. I commenced to get even more of a breeze going, on that long, straightaway road. I just could hear the devil holler back behind:\n“John! Get your handkerchief-headed, free-school Negro ass back here with my auto-MO-bile! Johhhhnnn!”\n“Here I come, old hoss,” I said, and I jerked the wheel and slewed that car around and barreled off back toward the bridge. The younguns and the dogs was ahead of the devil in figuring things out. The younguns scrambled up a tree as quick as squirrels, and the dogs went loping into a ditch, but the devil was all preoccupied, doing a salty jump and cussing me for a dadblasted blagstagging liver-lipped stormbuzzard, jigging around right there in the middle of the bridge, and he was still cussing when I drove full tilt onto that bridge and he did not cuss any less when he jumped clean out from under his hat and he may even have stepped it up some when he went over the side. I heard a ker-plunk like a big rock chunked into a pond just as I swerved to bust the hat with a front tire and then I was off the bridge and racing back the way we’d come, and that hat mashed in the road behind me like a possum.\nI knew something simply awful was going to happen, but man! I slapped the dashboard and kissed my hand and slicked it back across my hair and said aloud, “Lightly, slightly, and politely.” And I meant that thing. But my next move was to whip that razor out of my sock, flip it open and lay it on the seat beside me, just in case.\nI came up the road fast, and from way off I saw Ezekiel and the mule planted in the middle of his field like rocks. As they got bigger I saw both their heads had been turned my way the whole time, like they’d started looking before I even came over the hill. When I got level with them I stopped, engine running, and leaned on the horn until Ezekiel roused himself and walked over. The mule followed behind, like a yard dog, without being cussed or hauled or whipped. I must have been a sight. Ezekiel shook his head the whole way. “Oh, John,” he said. “Oh, my goodness. Oh, John.”\n“Jump in, brother,” I said. “Let Ole Massa plow this field his own damn self.”\nEzekiel rubbed his hands along the chrome on the side of the car, swiping up and down and up and down. I was scared he’d burn himself. “Oh, John.” He kept shaking his head. “John tricks Ole Massa again. High John the Conqueror rides the Terraplane to glory.”\n“Quit that, now. You worry me.”\n“John, those songs you wrote been keeping us going down here. Did you know that?”\n“I ’preciate it.”\n“But lemme ask you, John. Lemme ask you something before you ride off. How come you wrote all those songs about hellhounds and the devil and such? How come you was so sure you’d be coming down here when you died?”\nI fidgeted and looked in the mirror at the road behind. “Man, I don’t know. Couldn’t imagine nothing else. Not for me, anyway.”\nEzekiel laughed once, loud, boom, like a shotgun going off.\n“Don’t be doing that, man. I about jumped out of my britches. Come on and let’s go.”\nHe shook his head again. “Maybe you knew you was needed down here, John. Maybe you knew we was singing, and telling stories, and waiting.” He stepped back into the dirt. “This is your ride, John. But I’ll make sure everybody knows what you done. I’ll tell ’em that things has changed in Beluthahatchie.”\nHe looked off down the road. “You’d best get on. Shoot—maybe you can find some jook joint and have some fun afore he catches up to you.”\n“Maybe so, brother, maybe so.”\nI han’t gone two miles afore I got that bad old crawly feeling. I looked over to the passengers’ side of the car and saw it was all spattered with blood, the leather and the carpet and the chrome on the door, and both those mangy hound dogs was sprawled across the front seat wallowing in it, both licking my razor like it was something good, and that’s where the blood was coming from, welling up from the blade with each pass of their tongues. Time I caught sight of the dogs, they both lifted their heads and went to howling. It wan’t no howl like any dog should howl. It was more like a couple of panthers in the night.\n“Hush up, you dogs!” I yelled. “Hush up, I say!”\nOne of the dogs kept on howling, but the other looked me in the eyes and gulped air, his jowls flapping, like he was fixing to bark, but instead of barking said:\n“Hush yourself, nigger.”\nWhen I looked back at the road, there wan’t no road, just a big thicket of bushes and trees a-coming at me. Then came a whole lot of screeching and scraping and banging, with me holding onto the wheel just to keep from flying out of the seat, and then the car went sideways and I heard an awful bang and a crack and then I didn’t know anything else. I just opened my eyes later, I don’t know how much later, and found me and my guitar lying on the shore of the Lake of the Dead.\nI had heard tell of that dreadful place, but I never had expected to see it for myself. Preacher Dodds whispered to us younguns once or twice about it, and said you have to work awful hard and be awful mean to get there, and once you get there, there ain’t no coming back. “Don’t seek it, my children, don’t seek it,” he’d say.\nAs far as I could see, all along the edges of the water, was bones and carcasses and lumps that used to be animals—mules and horses and cows and coons and even little dried-up birds scattered like hickory chips, and some things lying away off that might have been animals and might not have been, oh Lord, I didn’t go to look. A couple of buzzards was strolling the edge of the water, not acting hungry nor vicious but just on a tour, I reckon. The sun was setting, but the water didn’t cast no shine at all. It had a dim and scummy look, so flat and still that you’d be tempted to try to walk across it, if any human could bear seeing what lay on the other side. “Don’t seek it, my children, don’t seek it.” I han’t sought it, but now the devil had sent me there, and all I knew to do was hold my guitar close to me and watch those buzzards a-picking and a-pecking and wait for it to get dark. And Lord, what would this place be like in the dark?\nBut the guitar did feel good up against me thataway, like it had stored up all the songs I ever wrote or sung to comfort me in a hard time. I thought about those field hands a-pointing my way, and about Ezekiel sweating along behind his mule, and the way he grabbed aholt of my shoulder and swung me around. And I remembered the new song I had been fooling with all day in my head while I was following that li’l peckerwood in the Terraplane.\n“Well, boys,” I told the buzzards, “if the devil’s got some powers I reckon I got some, too. I didn’t expect to be playing no blues after I was dead. But I guess that’s all there is to play now. ’Sides, I’ve played worse places.”\nI started humming and strumming, and then just to warm up I played “Rambling on My Mind” cause it was, and “Sweet Home Chicago” cause I figured I wouldn’t see that town no more, and “Terraplane Blues” on account of that damn car. Then I sang the song I had just made up that day.\nI’m down in Beluthahatchie, baby,\nWay out where the trains don’t run\nYes, I’m down in Beluthahatchie, baby,\nWay out where the trains don’t run\nWho’s gonna take you strolling now\nSince your man he is dead and gone\nMy body’s all laid out mama\nBut my soul can’t get no rest\nMy body’s all laid out mama\nBut my soul can’t get no rest\nCause you’ll be sportin with another man\nLookin for some old Mr. Second Best\nPlain folks got to walk the line\nBut the Devil he can up and ride\nFolks like us we walk the line\nBut the Devil he can up and ride\nAnd I won’t never have blues enough\nOoh, to keep that Devil satisfied.\nWhen I was done it was black dark and the crickets was zinging and everything was changed.\n“You can sure get around this country,” I said, “Just a-sitting on your ass.”\nI was in a cane-back chair on the porch of a little wooden house, with bugs smacking into an oil lamp over my head. Just an old cropper place, sitting in the middle of a cotton field, but it had been spruced up some. Somebody had swept the yard clean, from what I could see of it, and on a post above the dipper was a couple of yellow flowers in a nailed-up Chase & Sanborn can.\nWhen I looked back down at the yard, though, it wan’t clean anymore. There was words written in the dirt, big and scrawly like from someone dragging his foot.\nDON’T GET A BIG HEAD JOHN\nI’LL BE BACK\nSitting on my name was those two fat old hound dogs. “Get on with your damn stinking talking serves,” I yelled, and I shied a rock at them. It didn’t go near as far as I expected, just sorta plopped down into the dirt, but the hounds yawned and got up, snuffling each other, and waddled off into the dark.\nI stood up and stretched and mumbled. But something was still shifting in the yard, just past where the light was. Didn’t sound like no dogs, though.\n“Who that? Who that who got business with a wore out dead man?”\nThen they come up toward the porch a little closer where I could see. It was a whole mess of colored folks, men in overalls and women in aprons, granny women in bonnets pecking the ground with walking sticks, younguns with their bellies pookin out and no pants on, an old man with Coke-bottle glasses and his eyes swimming in your face nearly, and every last one of them grinning like they was touched. Why, Preacher Dodds woulda passed the plate and called it a revival. They massed up against the edge of the porch, crowding closer in and bumping up against each other, and reaching their arms out and taking hold of me, my lapels, my shoulders, my hands, my guitar, my face, the little ones aholt of my pants legs—not hauling on me or messing with me, just touching me feather light here and there like Meemaw used to touch her favorite quilt after she’d already folded it to put away. They was talking, too, mumbling and whispering and saying, “Here he is. We heard he was coming and here he is. God bless you friend, God bless you brother, God bless you son.” Some of the womenfolks was crying, and there was Ezekiel, blowing his nose on a rag.\n“Y’all got the wrong man,” I said, directly, but they was already heading back across the yard, which was all churned up now, no words to read and no pattern neither. They was looking back at me and smiling and touching, holding hands and leaning into each other, till they was all gone and it was just me and the crickets and the cotton.\nWan’t nowhere else to go, so I opened the screen door and went on in the house. There was a bed all turned down with a feather pillow, and in the middle of the checkered oilcloth on the table was a crock of molasses, a jar of buttermilk, and a plate covered with a rag. The buttermilk was cool like it had been chilling in the well, with water beaded up on the sides of the jar. Under the rag was three hoecakes and a slab of bacon.\nWhen I was done with my supper, I latched the front door, lay down on the bed and was just about dead to the world when I heard something else out in the yard—swish, swish, swish. Out the window I saw, in the edge of the porch light, one old granny woman with a shuck broom, smoothing out the yard where the folks had been. She was sweeping it as clean as for company on a Sunday. She looked up from under her bonnet and showed me what teeth she had and waved from the wrist like a youngun, and then she backed on out of the light, swish swish swish, rubbing out her tracks as she went.\nOriginally published in Asimov’s Science Fiction Magazine, March 1997.\nAndy Duncan made his first sale in 1997. By the beginning of the new century, he was widely recognized as one of the most individual, quirky, and flavorful new voices on the scene today. His story \"The Executioner's Guild\" was on both the Final Nebula Ballot and the final ballot for the World Fantasy Award in 2000, and in 2001 he won two World Fantasy Awards, for his story \"The Pottawatomie Giant,\" and for his landmark\nfirst collection, Beluthahatchie and Other Stories. He also won the Theodore Sturgeon Memorial Award in 2002 for his novella \"The Chief Designer.\" His other books include an anthology co-edited with F. Brett Cox, Crossroads: Tales of the Southern Literary Fantastic, and a non-fiction guidebook, Alabama Curiosities. His most recent books include a chapbook novella, The Night Cache, and a new collection, The Pottawatomie Giant and Other Stories. A graduate of the Clarion West writers' workshop in Seattle, he was born in Batesberg, South Carolina, now lives in Frostburg, Maryland with his wife Sydney, and is an Assistant Professor in the Department of English at Frostburo State University.", "source": "https://clarkesworldmagazine.com/duncan_05_14_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Beluthahatchie by Andy Duncan"}