{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ted Kosmatka; Michael Poore", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "GN4tHiXb/5ysILZAU4OmUWlf1eg=", "id": null, "license": null, "comments": "", "raw_text": "11720 words, novelette, REPRINT  Blood Dauber  The animals hate you.  You get used to that, working at a zoo. Over time, it becomes a thing you can respect.  Bell trudged up the path, pushing the wheelbarrow before him, already sweating under his brown khaki uniform. He squinted in the bright sunlight, eyeing the exhibits as he ascended the hill: the goats and their pandering; the silly, horny monkeys; the slothful binturongs—all moving to the front of their enclosures as he approached.  Most zoo animals eventually came to an understanding with those who brought the food. An uneasy truce.  But Bell knew better than to trust it.  He’d seen the scars.  Mary had scars on her arms. Garland was missing the tip of one finger, and John, the assistant super, had a large divot in the calf of his right leg.  “Zebra” was all he’d say.  Bell was the newest zookeep. No scars yet. But a wariness.  Walking up the hill that morning, Bell noticed Seana up ahead of him on the asphalt path. As he walked, he noticed she wore two different-colored socks—one red, the other white. He wondered if she were absent-minded, or just quirky. He hadn’t been at the zoo long, didn’t know her well.  As he closed the distance, he saw that she was crying. And he realized why she wore one red sock. Her calf was gashed open, bleeding streams.  He followed her into the staff room, and she explained that the juvenile baboon had attacked her.  She was outraged. Betrayed.  “Why did you go in there?” he asked.  “I always go in there,” she said. “I was here when it was born. I raised it.”  “Animals are unpredictable.”  She shook her head. “It’s never done that before.”  Never done that before.  Bell thought about that on the way home. Surprises puzzled him.  On one hand, it seemed there should never be any surprises. The world tended toward order, didn’t it? It circled the sun at the same speed all the time. Water boiled predictably, froze predictably. People weighed the same in Dallas as they did in Quebec. The speed of sound, in dry air, was 767 miles an hour.  So why, Bell wondered, can’t he and his wife keep track of money, plan ahead, and stop living in a trailer? In an orderly world, this shouldn’t be impossible. In an orderly world, you shouldn’t have to choose between buying food and keeping your car insurance.  Bell knew things were always more complicated than they looked. Water froze predictably, but strangely. It expanded. Crystals crashed and splintered. Sound moved faster underwater.  “And you can’t keep from buying shit,” he thought aloud, driving home.  He popped over the curb into the Lil’ Red Barn parking lot.  They weren’t going to spend anything this week, Bell and Lin had agreed. They didn’t need to. Food in the fridge, gas in both cars. This week they wouldn’t spend.  That morning, they’d run out of toilet paper.  “It’s not an insurmountable problem,” he’d told Lin. “We have paper towels.”  “You’re not,” said Lin, “supposed to put anything besides toilet paper in the toilet.”  “But you can,” argued Bell, “if you need to.”  Bell thought it was a spending problem. They knew how much money was coming in. If they controlled what went out, their money would be orderly, would increase. Lin disagreed.  “It’s a matter of supply,” she had pointed out. “Your job needs to supply more money.”  “So does yours.” Lin worked in the mall.  She glared ice. Splinters and crystals.  In Lin’s world, it was okay for her to criticize Bell. It was not okay for Bell to criticize Lin. Not if things were to be orderly. In every mating pair, Bell knew, one animal always bit harder than the other.  Lin was the biter.  And in their two-mammal world where daily life was defined by constant, grinding poverty, it seemed she bit constantly.  It was important, they had once agreed, to do what they loved. To love their work.  “I love my work,” Bell had told Lin a thousand times. Last month, in bed, he had told her how he loved his work, and they’d argued, and she’d scratched him with her fingernails. Drew blood. Made him want to hit her, and he almost did.  But he didn’t. There were light years between wanting to hit a woman and actually doing it. Bell wasn’t that kind of man. Wasn’t that kind of animal. What kind of animal was he?  He wondered if she knew. Wondered if she’d seen it in his eyes, the almost-hitting. The wanting to.  He quit saying how much he loved his job.  Most zookeepers, he knew, were women whose husbands made better money. They could afford the love.  Lin knew this, too.  “Shelly Capriatti’s husband sells guitars,” she had told him, just the night before. Shelly Capriatti was someone she worked with or worked out with, he couldn’t recall. “High end stuff, like for professionals. Like if Eric Clapton needed a new guitar. There’s no reason you couldn’t do something like that. He makes a ton of money.”  And he was on the edge, as he often was, of admitting to himself that he wished he hadn’t gotten married, when she stretched herself across his lap in front of their eleven-year-old TV and was nice for a while. Long enough for him to sweep some hard truth under the rug. Again. It was easier that way.  He focused on that—the niceness—while he paid the cashier at the Lil’ Red Barn.  She could be nice. Things in general, sometimes, were nice.  Sometimes she was predictable, which was easier, but you had to be ready for both. Driving into the trailer park, he thought about that.  The baboon had never attacked anyone. Then, today, it did.  There’s a first time for everything.  “You’re cute the way a dog is cute,” Lin had told him, in front of the TV.  You run out of toilet paper.  Things fall apart.  Not having money was a theme in Bell’s life. Even the zoo was a poor zoo, poorly funded.  Sometimes people complained. Once, a woman had come in, and when she’d seen the conditions in which the lions were housed, she’d been angry. People loved the lions.  “It’s a cage,” she said.  Bell had agreed with her.  “Zoos are supposed to be . . . natural,” she continued. “They’re supposed to be habitats, and the animals aren’t even supposed to realize they’re confined.”  Bell understood. He sympathized. He’d been to zoos like that, too, in towns that weren’t dying.  “Do you think they don’t know?” he asked.  She only stared at him.  “Do you think, in these other zoos, that the animals don’t know they’re locked in?”  “A disgrace,” she said, walking away.  Low funding required management to get creative when provisioning the animals. In addition to supplies bought on the open market, there were arrangements with local grocery stores, and butchers, and meat processors. A truck was taken around each day to be filled with heaps of food—loaves of bread that had passed their freshness dates, meat that had begun to turn, gallons of milk that had expired. Occasionally there was carrion brought in—deer which had been struck on the highway and then picked up by the county. All of it fed into the bottomless maw of the zoo.  The trucks would drive around back and unload their cargo into the kitchen.  It was called the kitchen, but it was not a kitchen. It was a room with several huge stainless steel tables on which food was piled and sorted and divided.  Bell was on his way to the castle when a voice on his walky-talky stopped him. “Bell, there’s something you need to see.”  Lucy, one of the kitchen workers, out of breath.  He got there fast. Came in through the back door.  “It’s a bug,” said Lucy, hands at her collar.  “What kind?” he asked.  She shrugged. “The ugly kind.” She pointed at a bowl turned upside-down on the counter.  Bell lifted the bowl. Put it down again.  He stood perfectly still.  He lifted the bowl and stole another quick glance.  “Hmm,” he said and lowered the bowl.  The kitchen workers stared. “What is it?”  “I’m working on it,” he said. He looked into the distance. “I think it’s a grub of some sort.”  “I didn’t think grubs got that big,” Lucy said.  “No,” Bell said. “Neither did I.”  Bell looked again. The grub was large, fleshy and blood red. Five inches long.  “Where did it come from?” he asked.  She shrugged again. “The table.”  Bell looked at the table. There were watermelons, and apples, and bread, and the partially disarticulated hock of a deer. Several bunches of blackened bananas made a mountain in the center, along with a smaller mound of more exotic fruit shipped in from Lord-knew-where.  “It could have come in with anything,” she said. “I found it crawling along the edge of the table there.” She shuddered. “It was moving pretty fast.”  Bell retrieved a glass jar from the cabinet, opened the lid, then dragged the bowl across the edge of the table so the strange grub dropped into the jar. He stepped outside and plucked some grass, put the grass inside, and closed the lid. Poked holes.  He took the jar across the zoo to the castle and placed it on a shelf in the back room.  “The castle” was the name used for the entomology building. Bell could only imagine what the structure’s original use had been, with its block construction and odd turrets; but whatever that long ago intent, it now housed all manner of creepy crawlers—hissing cockroaches, and ant farms, and snakes, and lizards and frogs. Anything that required darkness or careful temperature control.  The building was a box within a box. There was an open, central area ringed on three sides by walls and exhibits—and just behind these walls was a space called the back room, closed to the public, which was actually a single narrow hall that conformed to the outside perimeter of the building, a gap space where you could access the back side of the cages. At the far end of this hall, in a dead-end spot furthest from the entry door was a table and chairs, a TV, a desk, and several terrariums. These extra terrariums were where the sick were boarded, those unfit for public examination.  Bell did the rest of his chores for the day. In the evening he checked on the grub. It was still there, happily curling up the sides of the glass jar. Bell had studied entomology in college, and he’d never seen anything like it; the insect’s sheer bulk seemed to push the cubed-square law to its limit. Perhaps beyond its limit. He hadn’t thought insects could be that big. When he opened the lid, the grub reared up at him, strange mouth-parts writhing.  Bell was in charge of the castle, the petting zoo, and the convicts. This had not always been the case. He was in charge of the castle because he was the only zookeeper who’d taken college-level entomology. The petting zoo was meant as an insult. And the convicts were punishment.  The convicts came in most weekdays. You could point them out in the parking lot—men and women who were there too early, hours before the gates opened. Bell would feed the insects, drink a cup of coffee, and then walk to open the front gates.  “Here for community service?” he’d ask.  “Yeah,” they’d say.  Sometimes there were two or three. Sometimes none. They handed Bell their paperwork, and Bell passed it to the zoo superintendent at the end of the day.  The number of hours worked was the all-important statistic. Because they all had a number they were working down from. 150 hours, 200 hours, 100 hours.  Sometimes they talked about their crimes, and sometimes they didn’t.  Bell never asked. Not his business.  Bell often talked to himself in the bathroom mirror.  “In this world,” he said, “you are not an apex predator. Humans are, as a species, but you, yourself, are not.”  You do not always win. Problems are not always solved.  There are defeats and surrenderings. Small but important.  Last winter, they gave up heating the bedroom. They sealed off the back of the trailer and slept on the sofa. They learned the science of climbing into the bathtub. The bathtub was metal and descended a few inches through the floor, arctic air right beneath. No matter how hot the water got, your butt and legs would start to freeze if you sat still too long. You had to lift yourself up now and then, let the hot water get under there. Lower yourself. Wait. Repeat.  “It’s like not even being part of the food chain,” Bell said aloud one cold night, eating burritos in the kitchen.  They hadn’t spoken to one another that morning. His remark about the food chain was one of two things they said to each other all day long.  Sometimes he opened up the bedroom door and exhaled just to see his breath cloud the room.  He wanted her to ask about his food chain remark. Wanted to explain it. Wanted her to understand.  “The food chain—” he began.  “I get it,” she said.  That was the second thing that got said. Her breath made a cloud even though they were in the kitchen.  Bell didn’t dare tell Lin how much he loved his job, not anymore. He told the mirror, instead.  “I love my job,” he said. His reflection said it, too, it seemed.  Like the zoo, their life at home had been built on various pretendings. Pretending there might be gas money. Pretending they could afford to eat better, but chose not to. Pretending that Lin still thought it was important to have a job you liked. Loved. Whatever.  She had quit pretending. Somewhere behind her mask was the Lin who thought “If you loved me you’d do what it took for me to live a better life,” and that Lin had surfaced. Unmasked. Through fucking around.  Classified ads appeared, taped to the fridge.  Sales. Landscaping. Power-washing trucks. All kinds of things you could do with a degree in biology.  “It’s easy,” Bell told her, “to lose track of what’s really important.”  She didn’t have to say that having heat and electricity were important, too. Instead, never breaking eye contact, she grabbed her coat and her vibrator and locked herself in the bathroom.  Library clerk. Barista. All things that paid more than working at a zoo. Mexican cook. Skycap for a Mexican airline. Didn’t matter if you weren’t Mexican.  It was amazing, thought Bell, how much pretending went on in a zoo.  The public pretended the cages were jungles, savannah, desert, or snow.  The animals pretended that they were not interested in the public. The public and the zookeepers worked together at pretending that the zoo was not, when you got right down to it, just carefully-engineered cruelty.  Sometimes the animals forgot to pretend. Like when babies were born and wouldn’t eat. Because they knew captivity when they saw it. Felt it. Forgot to pretend life was worth living.  Like when the llama attacked Bria Vagades.  Bell was there when it happened.  It wasn’t like an animal attack in the movies, all snarling and snorting, blood and fur. It looked almost comical. One second Bria was lifting the rock-shaped hatch which concealed the garden hose, and suddenly here came Nunez the llama, ridiculous and splendid with his two-tone black-and-gray coat, rearing on his hind legs, waving his front hooves like a boxer. He was on her before she saw him, and she screamed.  “Ow!” she screamed, and “Fuck you, Nunez!” before she got a grip on herself. The zoo was closed, but there were strict rules about losing your cool where the public might see, might panic.  Nunez lost his balance, came down on all fours, still advancing, sniffing the air. Reared up again, hooves waving as Bria covered her head, backing away, feeling behind her for the door.  “He didn’t want her in the enclosure,” Bell told John Lorraine, another zookeeper, later on in the cafeteria. “It was obvious.”  “It’s never obvious. It’s sloppy, is what it is, assigning human motives to animal behavior.”  “Territoriality is an animal behavior,” Bell answered, chewing peanut butter crackers. “It’s an animal motive.”  “What’s sloppy,” John said, “is pretending to understand why all the time. Why they do anything they do.”  “Because it’s mating season,” said Bell. “That’s why.”  John Lorraine’s eyes narrowed. “And she went in the enclosure by herself? That’s sloppy, too. These animals aren’t pets.”  But Bell knew some of the animals were like pets. Bad pets. Pets you couldn’t trust. “You should write a fucking memo,” he said.  “You should shut up.”  Bell agreed. He said “Yep.”  The grub wasn’t like a pet. The day after Bell placed it in one of the large terrariums, it began to construct a papery cocoon.  During his evening break, Bell sat in the back room and watched the grub work. He checked the zoo’s entomology books but couldn’t find a match. None of the pictures looked anything like the strange insect in the terrarium. The cocoon only deepened the mystery. Whatever this thing was, it was a juvenile.  There were four main groups of insects that had a larval stage of development: Coleoptera, Lepidoptera, Hymenoptera, and Diptera.  The thing in the terrarium was no caterpillar, so Bell could rule out Lepidoptera. The grub’s size seemed to rule out Diptera. Which left Hymenoptera and Coleoptera. Wasps and beetles. But it didn’t look like any wasp or beetle grub he’d ever seen.  Most grubs didn’t have eyes. Most grubs didn’t have mouthparts like that.  At the end of its third day in the terrarium, Bell arrived to find it had sealed itself into its papery chrysalis, and just like that, the grub subtracted itself from the world.  The next day, there was an addition to Bell’s army of community service workers. A late arrival.  Bell was on one knee, mixing food for the lemurs when a shadow fell over the bucket. Bell shaded his eyes and looked up.  “They told me to find Bell. ‘Report to Bell,’ they said. Said Bell was young. You look like you might be him.”  The shadow had a voice like raw sand.  Bell stood and shook hands.  Shaking hands, the first thing he noticed was scar tissue. Burn scars splashed across hand and wrist. Both hands, Bell observed. Both wrists.  Leather-skinned. Scrambled white hair. Eyes blue like a cutting torch. If a bomb could explode and come back as a person, it would be this guy. Just looking at him, sunburned and fire-burned, made Bell thirsty. They sat down over Cokes at the Savannah Café, where Bell learned that the bomb’s name was Cole. Learned that, at sixty, Cole was by far the oldest community service con to grace the zoo.  Then he put him to work hosing down empty cells in the elephant house, beginning with the Cape Buffalo.  “Bullshit,” rasped Cole, when he saw the cell.  Bell must have looked startled.  “Literally,” Cole explained, waving the hose at the floor. He smiled, revealing teeth like rubble. Smiled and winked.  It was like being winked at by war.  Just as the lions were star attractions for the tourists, Cole became a star attraction for the staff.  He was scary, like the lions. Like the lions, he seemed to keep most of his energy bottled up in some soft, invisible engine. It was an uneasy feeling, locking eyes with a lion. Same with Cole.  You couldn’t talk to a lion, though. Couldn’t ask him how he came to be at the zoo. But you could ask Cole, if you were nosy enough.  Bell didn’t ask.  Bell stood in the dark tunnel with Cole. “The baboons are smart,” he said. “You have to be careful.”  Cole nodded.  “They can throw their poop at you. They can bite. You have to lock both sets of doors. There is a procedure you have to follow, and you should never be in the enclosure with them.”  Cole nodded again.  “It’s very important. Do you understand?”  Cole nodded again, but Bell wasn’t so sure. Several years earlier there’d been an incident in the cat house. The exhibit had been in the midst of repairs, and the lion had been allowed access to its run overnight. This normally wouldn’t have been an issue except that the adjacent run had been under construction. The door separating the bobcat run from the lion run was made of thick plywood—a temporary measure which was fine to keep the bobcats in. But insufficient, apparently, to keep the lion out.  The next day, they found the plywood partition shredded, and the lion sleeping in the bobcat cage, blood coating its muzzle. All the bobcats were dead.  Zoos are dangerous places.  Dangerous for the animals. Dangerous for the zookeeps.  Cole had a thousand hours of community service. Bell had never seen a number that high. It would take him a year to finish it.  When Cole had been at the zoo for a week, the zoo superintendent pulled Bell aside. The superintendent didn’t like Bell much. She wore a serious expression. “The older guy, Cole, is he a good worker?”  “He’s fine.”  “He’s going to be here for a while.”  “Yeah,” Bell said, “I know.” He could see the gears moving behind the superintendent’s eyes. A free long-term worker. A worker that didn’t need paid.  “Perhaps we could give him more responsibilities,” she said.  For weeks, Bell checked on the cocoon, waiting to see what would emerge.  It happened on a Monday. There was a buzz in the room when Bell entered. A buzz like one second before an electric light went bad; only this light kept going bad, second after second—an electrical hum that did not fade. Bell looked in the terrarium and saw it.  Huge.  Winged.  Bright red, but the mouthparts were black.  “Hymenoptera,” he whispered. “Of some kind.”  The summer stretched on. Bell trained Cole how to be a zookeeper. On their breaks they sat in the back room.  When the insect first hatched, the question became what to feed it. Bell tried a little of everything: sliced bananas, and apples and small chunks of meat. Some of the fruit on the table came from exotic locales, and it was easy to imagine the grub stowed within the corpus of some melon from Central America—and it was easy to imagine how such a melon might go quickly bad, and soft, and end up on the zoo’s table as discarded produce.  Weeks passed, and the insect thrived.  Even Cole took an interest. “Pet wasp?” he said as he helped Bell clean out the nearby lizard cage.  “I’m not convinced it’s a wasp.”  Several days later Bell found Cole looking through the glass. Cole was the one who noticed it first.  “What’s that?” he asked.  Bell looked. “I’ll be damned.” The wasp-thing sat perched on a small branch in the terrarium, oddly-jointed legs flexed, wings slung like swords over its narrow back. Hanging beneath the insect, dangling from a fibrous string, was a small pod of what looked like dried brown foam.  “What is it?” Cole said.  “I think it’s an egg case.”  Cole surveyed the terrarium again.  “So there’s two of them things?”  Bell shook his head. “There’s just the one.”  “Maybe she was already fertilized.”  This particular convict was smarter than he pretended to be. Bell caught his reflection in the glass, blowtorch eyes darting back and forth.  “It’s not likely,” he said. “She is female, but the reproductive stage usually begins after metamorphosis, not before. And this thing has been alone since it hatched.”  “Santa Maria of the bugs,” said Cole, cracking a shipwreck smile.  Bell laughed. “It’s less than a miracle in the insect world,” he explained. “It’s called Parthanogenesis. Some kinds of Hymenoptera can—”  “Hymen-who?”  “It’s an insect clade. Ants, bees, and wasps. Certain species can reproduce without males. Worms can do it, too, and some lizards. But Hymenoptera are the champs.”  Cole straightened.  “Let’s hope that doesn’t catch on.”  Bell thought it over. Reproduction and marriage and wives and such.  “Might not be so bad,” he muttered.  “What’s that supposed to mean?”  “Nothing.”  Bell contacted the university. He wrote a letter to the biology department describing the insect and the circumstances of its arrival. A week later he received a reply. The note was short and polite: “It’s probably a mud dauber.”  Bell wadded the letter and threw it in the trash. “I know what a mud dauber looks like.”  One evening a few weeks later, he found the insect dead. Even in death it looked formidable, with a head the size of a dime, and a body like a smooth, slick walnut.  For the first time, he dared to touch it. With its legs spread out, it was nearly the size of his hand. He jabbed a pin through its abdomen and stuck it to a small cork. The legs sagged under their own weight. He looked inside the terrarium at the egg case, wondering if anything would hatch from it.  Months passed, the egg case forgotten. Bell and Seana took turns training the old man. Seana didn’t like Cole, and didn’t pretend she did.  In the spring, the eggs hatched. There were a million tiny grubs, just like the original, only smaller. Bell watched them wriggling through the sawdust he’d put in the terrarium.  “These more of your wasps?” Cole asked.  “They will be.”  They watched them writhing for several minutes.  “What do they eat?” Cole asked.  Bell thought about this for a moment. The adult form of an insect often ate a completely different diet than the juvenile.  “I have no idea,” he said.  Feedings could be tricky.  When Bell was first hired by the zoo, he’d been put in charge of feeding the raptors. Raptors weren’t dinosaurs though, like you’d think, with a name like that. It turned out, they were big damn birds. One of them was a golden eagle.  All went well for the first few days. The golden eagle ate about five rats a week, but it was fed every day. Which would have been fine except that the uneaten rats had to be removed from the enclosure.  This idea didn’t bother Bell until the moment he first went to do it. He stood at the cage door and looked at the big damn eagle, and it occurred to him that he was about to go inside a big damn eagle’s enclosure and take out its food. It occurred to him what might happen if the big damn eagle felt suddenly partial to that food.  He stared at the eagle. He stared at its talons—two-inch daggers strong enough to pierce bone.  Bell walked down to the zoo superintendent’s office.  She was unmoved by his concerns.  “I’m not sure I’m comfortable with it,” Bell said.  She waved that off. “You’ve got nothing to worry about.” Then she went back to her paperwork.  “But how do you know the eagle won’t attack?”  “It’ll be fine,” she said, not bothering to look up. “Nothing like that has ever happened before.”  A preamble to every scar story he’d heard at the zoo.  “I’m not going to do it,” he said.  She looked up from her papers. She sighed. She weighed her options. “All right,” she said.  The next week he was put in charge of the petting zoo. This was meant as an insult.  When he complained, pointing out that his particular skill set could surely be put to better utility, she only nodded sympathetically.  Then she put him in charge of the convicts, too.  Bell divided the newly hatched grubs into three groups, in three terrariums. In one terrarium, he dropped only fruit. In another, he dropped chunks of bread. In the third terrarium he dropped meat.  Insects tended to specialize in their diets, so he thought there was a good chance that two of the terrariums would starve. But then at least he’d know what they ate.  The grubs, however, surprised him. All three aquariums thrived—though the grubs given meat grew fastest.  Two months later, the grubs all began to spin cocoons. As if by agreement, they all started their nests on the same day.  That night, as if to celebrate the milestone, Bell committed a budget crime. He stopped at McDonalds for a bite on his way home, knowing that tuna salad was all they had in the fridge.  He was trapped and doomed, once he’d spent the money.  “Spend whatever you need to,” Lin said. “Just make sure you tell me about it.”  Lin was the official banker of their marriage.  “Just tell me about it” was the trap, because if he spent money and told her, she got mad. She might get loud, she might stay quiet. Either way, when Lin got mad, she fed on her own energy like a hurricane, getting louder and madder. The hurricane usually blew until she charged out the door and drove away, still screaming. Hours later, she’d return. Maybe still mad, maybe not.  One of these days when she came back, Bell would be gone.  This thought came from an increasingly vocal part of his brain. The part where he’d swept so much crap under the carpet.  A week after his crime, she dropped a bank statement in his lap while he sat reading.  They were both reading a lot, these days. The cable company had run out of patience.  “What?” he asked.  “It’s highlighted.”  Shit. He’d forgotten.  MCD Store #1635.  “You didn’t give me a receipt for that.”  “Thought I had. Sorry.”  He was sorry. What else could he do? Here, he thought, was where a rational person would let it go. But not Lin.  She yelled, storm winds building. How, she wanted to know, was she supposed to know how much to spend on the rent and the car and the power company and the phone company and the fucking grocery store when she didn’t know how much he’d spent on whatever big important things he needed to spend money on. Like a Big Mac, apparently. She didn’t remember him asking if she’d like a Big Mac, too, because he was too busy being a selfish, irresponsible asshole and then hiding the receipt.  He could tune out the yelling, until she made accusations like that.  “I forgot,” he reminded her. Now he was pissed. This was going to be bad.  The louder she got, the louder he got. Eventually, she was shrieking at him. A responsible voice inside him grew worried. She was really, really wound up this time. The tiny voice said that he couldn’t let her drive off like this. She’d hurt herself. Hurt someone.  It was a zookeeper voice. The voice that knew you couldn’t let the animals run wild, no matter what.  She took a bathroom break, still yelling, and Bell took advantage of the opportunity to hide her car keys. Deep inside a box of stale Triscuits.  Sure enough, when she emerged, she hunted for her keys.  Lin was notoriously bad about where she laid her keys. They could be anywhere.  She hunted.  For ten, fifteen minutes, she looked everywhere. Everywhere she might rationally have put her keys. She stopped yelling about Bell and started quieting down.  The quiet, Bell knew, was deceptive. It did not signal calm. Just quiet. Like a fire that gets into the walls, hidden, until someone opens a door.  Bell realized he had made a mistake. She would keep looking forever, that was the problem. Sooner or later, he was going to have to tell her he’d hidden her keys. And she’d get worse. Get louder. The storm of the century.  In some ways, he felt sorry for her. She was kind of crazy, really. More than kind of. Poor girl. But what a bitch. He almost said it aloud.  In the end, she retreated to the bathroom again, and Bell put the keys in the silverware drawer. Silently, like a cat burglar.  She came back out, and the silverware drawer was the third place she looked. She had already looked there. Several times. And she knew it. Bell knew she knew it.  “You fucker,” she whispered, almost choking. Near tears.  Remorse! He was no match for tears. He melted, moved toward her. He’d been protecting her.  She whipped the keys at him, catching his left ear as he ducked.  It was loud again for a while. Bell picked up the keys and opened the trailer door.  Lin had grabbed her purse.  “Give them here!” she screamed.  Bell ignored her.  He drove off, this time.  He used up ten dollars of gasoline just driving in circles. He enjoyed the waste. Enjoyed the drive. Talked to himself.  When he circled back, at last, he found her shivering on the steps.  She’d been locked out.  It was a cold fall evening.  Remorse, again.  This was not fucking working.  Mating is complicated  Mammals click.  Personalities come together, and they click, sometimes. Other times they don’t.  The day after he and Lin un-clicked so badly—the day after he locked her out of the trailer—Bell and Cole sort of clicked.  Bell couldn’t have said what did it, exactly. He was on the roof of the walrus tank, watching the pinnipeds heave their awkward bulk across wet concrete.  Cole climbed the ladder and joined him. In the enclosure below, two males bellowed at each other, bumped chests.  The smaller male backed off, retreating to the tank, but the larger walrus followed. It slipped its hulking form into the water and was suddenly graceful. Like a different animal entirely.  They stared together in silence until Cole said, simply “Well, Goddamn,” and they both cracked smiles.  “Reminds me of my dad growing up,” Cole said. “Big and mean. Harder to get away from than you’d think.”  Bell cocked an eyebrow.  “Oh, a real tough-guy,” Cole continued. “Beat my ass until I got bigger than him.” Cole smiled war again.  Bell was unsurprised when Cole showed him a silver flask and asked if he’d like a sip.  And Bell had a sip. Just one.  But it was enough to set the stage for a detour, after closing, to a nearby grill with a liquor license. Bell didn’t feel like going home to Lin; and Cole didn’t feel like going back to the halfway house. He wasn’t due for an hour, yet.  At the bar, Bell lit a cigarette and found himself talking about Lin. He told Cole all about the money problem, and the fight.  Cole’s cutting-torch eyes burned as he listened. He looked terrifyingly wise, all of a sudden.  After two beers, Bell found himself saying out loud the thing he could barely admit to himself, “I wish I’d stayed single, man. I really, really, do.”  Just then, a woman wearing fifty pounds of makeup came in, clunked across the floor in square heels. Cole winked at her.  She said something to the bartender and walked back out.  Bell watched her go. The setting sun blazed straight in through the door as it wheezed shut. Bell winced and—too late—shaded his eyes. Momentarily blind, blinking, Bell groped for his beer.  Into this momentary darkness, Cole said “I crashed a helicopter, in case you wondered.”  Bell blinked. Cole’s eyes became visible, twin coals.  “Huh?”  “I noticed you didn’t ask about my hands. Or why I was in jail. You never ask nobody. It’s actually pretty conspicuous, the way you don’t ever ask how anyone came to community service. You just give ‘em some shit to do and mark down their hours.”  Bell must have looked troubled. Purple circles rotated in the dark, in his brain.  “No, it’s cool. It’s cool you do people like that. Makes ‘em feel normal. But not asking the way you do, it’s kinda obvious how bad you want to know, so I’m telling you. I wrecked a helicopter.”  Cole was right. Bell wanted to know. Wanted to know quite badly. Hadn’t realized until this moment.  “Alright,” he said, by way of encouragement.  It took fifteen minutes for Cole to tell about Brazil.  He was a helicopter pilot, to begin with.  First in the army, then for the president of a frozen chicken company, then for United Airlines, on contract with Canadian Railways, shuttling engineers from checkpoint to checkpoint. It was the kind of solitary work he enjoyed. The engineers were usually stone tired. Quiet.  Then he’d crashed his United Airlines helicopter.  The kind of thing that could happen to anyone; his tail rotor crapped out and he had to autorotate down from eight hundred feet, spinning and yawing with three cursing, pants-pissing passengers. Rolling sideways at the last second, landing sideways, splintering the rotor, rupturing the fuel tank.  No deaths. The only serious injury was Cole, who remained behind until all three passengers were out and running, safe. Sustained burns over twenty-five percent of his body, including the splashy scar tissue on his left hand and wrist.  Bell began to ask a question, but Cole anticipated him.  “The other hand was something else,” he said. “Something later.”  United Airlines hadn’t been cool about his benefits, and the hospital bankrupted him. Could barely afford the surgery that let him use his hands, let alone reconstruction or cosmetics.  Which was why he started siphoning aircraft fuel. You could make a lot of money on the black market, selling aircraft fuel at half-price.  A dangerous business, though. No honor among thieves and so on; someone turned him in, and a federal warrant came looking for him.  The Feds called him while he was in the air. In Virginia, near the coast. On his way to Richmond for a pickup.  “Put down at Richmond International,” the FBI told him.  And Cole had flown out to sea, instead. How stupid did those bastards think a guy was?  Stupid enough, he supposed, to get caught fencing felony amounts of helicopter fuel.  Cole flew out to sea. Flew into the sea. If the feds wanted him, they were going to have to work for it.  Bell must have looked at Cole’s right hand.  “The fuel tank ruptured when I hit the waves,” said Cole, draining his beer. “Set the water on fire. I could either surface and tread water in the burning fuel, or stay under and grow gills. Happened when I was twenty-seven. They gave me nine years.”  Bell did the age math, but before he could ask, Cole said, “Oh, I was in and out after that. Assault, mostly. The last one for a bar fight. Guy got his eye socket broken, and the judge gave me extra—those women judges, they’re the worst. She said my anger gonna burn me up some day.” Cole smiled war again. “But that already happened, ain’t it? Besides, not all that burns is consumed.”  He took a last swallow of his drink. “I gotta scoot. If they lock my ass out, I’m fucked.”  Very quickly, Cole was up and out the door. Bell turned and watched him go, and the sun hadn’t quite set yet, and Bell’s eyes got nailed a second time.  Blind as a bat, Bell thought.  Good zookeeper that he was, Bell knew bats weren’t really blind, and he said so.  “What?” called the bartender. Also, Bell thought, a zookeeper of sorts.  “Bats aren’t really blind,” Bell repeated.  Never get drunk with the convicts, Bell lectured himself.  It was a bad idea in so many ways. It was unprofessional. Besides, if you got to be drinking buddies with one of them, even going so far as to sip whiskey with him on top of the walrus tank—a firing violation by zoo rules—then what do you do afterward if the convict does something you should report him for? Something else.  A week after the bar, Bell arrived at work and found Garland, the maintenance chief, waiting at the gate.  “There’s an issue,” said Garland.  “An issue?”  “With your friend. He’s drunk.”  “Where?”  “I have him shoveling the camel enclosure. Figured that would keep him out the way until he sobered up a bit.” Garland paused. “Only I think he’s a lot worse off than I thought.”  A headache came rumbling up on heavy treads. Bell sighed.  Garland looked uneasy, too. It was bad news, Cole being drunk. Especially if Garland had noticed it and let him work anyway. It was like Watergate. A lot of people could wind up in trouble before this was over.  “I thought I’d wait and see what you wanted to do,” said Garland as they walked uphill through the zoo. “I didn’t want to make out a report if it was just . . . well.”  Bell understood. The old man was scary.  Bell nodded. “I’ll handle it.”  At the camel enclosure, Bell called out Cole’s name and the old man approached, shovel in hand. He smelled like rum.  “Yeah?” The question had an edge to it. Like Cole knew he was in trouble. For a moment, looking through the bars, Bell saw something aggressive in his eyes. Something leonine.  Bell explained how it would go.  Cole would drop the shovel.  He would avoid speaking to anyone.  He would leave by the back entrance. Now.  “So I’m fucked,” Cole said.  Bell shook his head. “You called in sick today is all. This never happened.”  He should be firing this guy, Bell knew. Why didn’t he?  He could see it now. He’d tell Cole to get the hell out and not come back, and Cole would go to Koverman and say “Did you know I drank whiskey with Bell during work hours on top of the walrus tank?”  “I’m fucked,” Cole repeated. He swayed.  Bell frowned. There was something that started out to be a long silence. Then Cole whispered, “I’m not going back to jail. I won’t do it.”  Bell led him out. “Come back tomorrow,” he said. “Sober.”  It took exactly four weeks for the cocoons to hatch. There was a sound like electric lights going bad, and Bell stepped in the back room. He stared for a long time. The terrariums teamed with strange new life. Each glass box seemed to house a different creature entirely. Strange wasp-things, and things . . . not like wasps. Things without names. Some larger, some smaller. Some with wings, some without. All were red and black.  “Impossible,” he muttered. They couldn’t all be the same species.  His first instinct was to call the university. Then he remembered their note about mud daubers. Screw the university.  Besides, instincts were for animals. He’d solve this on his own.  He could figure it out, Bell was certain. He knew a lot about insects.  He knew insects had been among the first living things to walk dry land; they’d seen the rise and fall of dinosaurs, the birth of flowering plants. Humans weren’t the first species to farm, or to domesticate animals, or to war. Those milestones belonged to insects. When humanity first began its clumsy, ongoing experiment in agriculture, the Attine ants of South America had already long since perfected it—cultivating vast fungus beds in underground chambers in their nests, seeding carefully tended gardens with the clones of a fungus that linked back more than thirty million years.  Another species of ant, Lasius flaws, managed large flocks of domesticated aphids. The aphids were kept in subterranean corrals where they grew mature and succulent, grazing the roots of plants. And were then milked for their nutrient-rich honeydew.  Some termite mounds sprawled more than thirty feet in diameter, housing tens of millions of individuals, all bound up in a single sophisticated caste system. Soldiers of Macrotermes bellicosus developed jaws so huge that they could no longer be used in feeding; instead they relied on teams of lower-caste workers to lift sustenance to their mouths.  Insects build cities, and farms and superhighways. Slant your eyes and look hard enough, and you’ll see a level of social sophistication that can only be described as civilization.  Bell had often thought that humans had achieved their conspicuous position in the world not because of how perfectly adapted they were, but because of how weak, how clumsy, how fragile they were. How unsuited to existence.  One species of dairying ant secreted an enzyme from their heads that was carefully rubbed onto each aphid during the milking process. The enzyme disrupted wing development, preventing their aphids from ever flying away.  Where humans came up with external solutions—like building fences—insects often found a more elegant solution. A biological solution.  They’d had the time to do it.  Determined and cautious, Bell fed the grubs every day and wrote down his observations.  But still, Cole was the one who noticed it.  When Bell finally understood, his mouth dropped open. “Holy shit,” he said.  He looked at his notes.  He’d fed the insects one of three different diets. The insects which, as grubs, had eaten bread did not now have wings, but stunted twists of chitin. Their color was dull red, like rust. More beetle-like, less wasp. Now, as adults, they still preferred bread. The fruit-eaters still ate fruit. They were large-bodied and short limbed, with stumpy wings that buzzed loudly as they made awkward flights inside the terrarium. Bell could imagine them making those same flights between distant stands of fruit.  The meat eater was the most strange. Blood red, with wings like blades—mouth parts huge and angular.  “They adapted,” Bell said. “They adapted to the food sources they ate as grubs.” Bell shook his head in disbelief.  “Fast learners,” Cole said. Then he moved as if to stick an experimental finger in the meat-eater cage, but Bell said “Don’t.”  Seana, when he showed her the hatchlings, said “Can that happen?”  “There it is,” he said. But in his heart of hearts, he knew she was right to doubt. Like a million years of evolution in a single generation. No species adapts that quickly. It was a bad movie. Junk science. Not possible.  “But there it is,” he repeated.  The insects lived for more than a month. They buzzed, or crawled, or flitted around their cages. Over the course of a single week the following month, they took turns dying.  The meat eater lived longest. After each die-off, Bell found egg-cases. He cleaned the terrariums, and put the egg cases back inside. Then he waited to see what would hatch.  Late one evening, Seana climbed up the ladder while he was in the barn loft at the petting zoo, checking the hay for rot. Climbed up and stood behind him until he turned around, then stood on her toes and kissed him.  If the zoo hadn’t been closed and nearly deserted, if Bell hadn’t known for sure that no one was likely to venture into the petting zoo, let alone climb into the loft, then maybe it would have happened differently. Maybe Bell would have kissed her back, because kissing would have been all that could happen.  But the zoo was closed. Bell did know. And it did happen the way it happened.  “I can’t,” he said.  She pulled away.  “I want to,” he said.  She looked at him, waiting.  Beneath them, the horses shuffled. Made noises. Kicked their stall doors and talked to each other in soft equine language.  He thought of Lin, home in their trailer. “I can’t,” he said again.  A black mood seized Bell on the way home. He drove the darkening highway, following his headlights into space. He pushed the old beater faster, watching the speedometer climb to seventy, then eighty. He took the curves without easing off the accelerator. The tires squealed, but held the road.  His mind was a movie of loves and hates. He loved and hated his job. Loved the animals, but hated the conditions. Hated that he couldn’t afford to live on what he was paid. When you’re young, he thought, they tell you that if you get a degree, everything else will fall into place. But it’s not that simple, is it?  Nothing—not one thing—had worked out like it was supposed to.  He thought of life at home, a second maze of contradiction. He was tired of being alone and together at the same time. He wanted to be free, but there was no freedom. No way out. He felt like an animal with a trapped limb. He understood why animals chew their own legs off. He had a recurring fantasy of being robbed, and putting up a struggle. If he were held up at gunpoint, he had decided, he would not cooperate.  He didn’t know what to think of Seana, yet. So he didn’t, at all.  Red like rupture. Blood squirm, a coagulation of grubs across brown terrarium stones. The egg cases pulsed like clotted hearts, spilling strange new life. Bell stared through the glass. Each cage told the same story.  The grubs were a centimeter long. Even as small as they were, Bell could see the mouth parts working. Each grub identical. As far as he could see, the differences which had been so apparent from cage to cage in the adult form were now absent from the next generation. The grubs were all the same, as if a reset button had been pushed. It was only the adult form that seemed vulnerable to change. Bell opened his sack lunch. He took out his apple and sliced it into a dozen pieces. He dropped a slice into the first cage. The grubs responded immediately, moving toward the fruit. They swarmed it.  Bell fed the grubs first thing in the morning.  He decided to turn it into an experiment. He stole a sheet of sticky-labels from the staff room and stuck a label to the side of six different terrariums. On each label, he wrote a different word.  The grubs labeled fruit were fed fruit; the grubs labeled meat were fed sliced-meat. The grubs labeled control were fed a mixture of foods.  The grubs with the cool sticker on the side of their terrarium were fed the control diet—but were also placed in a refrigerator for an hour a day while Bell did his chores. An hour wasn’t long enough to kill them, but it was long enough to impact their physiology. They grew slower than the grubs in the other cages.  If these insects could really adapt to their environments, Bell was going to see how far he could push it.  He’d see if diet was the only pressure they responded to.  The grubs labeled heat were in a small glass aquarium placed on the floor near a space heater. Bell put his hands against the glass. It was hot to the touch. These grubs, too, seemed stressed by the temperature. But they still grew, doubling in size every week.  The grubs labeled carrion were fed the occasional discarded rat from the golden eagle enclosure. These were the grubs Bell found most interesting. They borrowed into the dead rat and ate it from the inside out.  Charles Darwin had believed in God until he studied the parasitic wasp Ibalia.  Darwin wrote in a journal: “There seems to me too much misery in the world. I cannot persuade myself that a beneficent and omnipotent God would have designedly created wasps with the express intention of their feeding within the living bodies of caterpillars.” Darwin found particularly gruesome that the Ibalia grub only gradually consumed the living tissues of its host—taking a full three years to complete its meal, saving the vital organs until last as if to extend the host’s suffering. Darwin couldn’t imagine a God who would create something like that.  Bell could imagine it.  He thought of the reset mechanism. He imagined a single insect species with multiple phenotypes already encoded in its genome—a catalog of different possible adult forms. And all it took was a trigger to set the creature down its path.  “Maybe it’s like blind cave fish,” he told Seana one evening.  He watched Seana’s face as she peered through the glass.  “Cave fish have most of the genes for eyes still carried in their DNA,” he said. “All the genes required for lenses, and retinas and eyelids, all the genes except for the one crucial ingredient that starts eye development in the first place. If you cross-breed two different populations of blind fish, sometimes you get fish with eyes.”  “That doesn’t make sense,” Seana said.  “It does if the blindness is recessive, and the two populations are blind for different reasons.”  “But you said these things aren’t breeding.”  Bell ignored her, lost in thought. “Or they’re like stem cells,” he continued, “each carrying the genes for multiple tissue types, multiple potentials, but they specialize as they mature, choosing a path.”  He leaned forward, tapping his finger on the glass.  “Where do you think they come from?” Seana asked.  “The fruit maybe. The bananas. Central America. I’m not sure.”  “Why can’t you find it in books?”  “There are millions of insect species still un-described by science. Besides, maybe it has been described. Some version of it. I mean, how would you really know?”  Later, searching for reasons to avoid going home, Bell ran down his closing checklist twice.  On his second round, he found the outer door to the lemur tunnel wide open.  He had locked it himself. Checked it himself.  His inner alarm went off.  Zookeepers developed inner alarms, or they developed scars.  He stepped through the door, and let his eyes adjust to the dark, to the long, mildewy tunnel which ran under the moat, to the lemur island.  At the end of the tunnel, bright light, because the door at the island end was open, too.  In the middle, a silhouette. Who . . . ?  “Hey!” Bell shouted.  Several silhouettes. Sharp, jabbering shadows. Five or six lemurs hopped and shrieked.  The shadow in the middle wound up like a pitcher and threw something.  A yelp. The lemurs howled and ran.  “Cole?” called Bell, starting down the tunnel.  One lemur didn’t run. It whirled in confusion, chattering.  Bell’s eyes had adjusted. The shadow grew details. Cole.  Cole, with a handful of smooth, white landscaping stones, eyes wide with rage.  “What the fuck are you doing?” Bell shouted.  “They threw shit at me. They threw their fucking shit.”  “Jesus Christ—!” Bell yelled, lurching forward.  Cole turned, arm pistoning in the dark.  The stone whistled past Bell’s ear and struck hard against the outer door. The tunnel echoed.  Bell froze.  Cole stepped toward him. “You watch how you talk to me,” he said, and for a moment they stared at each other, waiting to see what would happen. Then Cole’s eyes changed—the rage blown out of them like a gust of wind. Cole brushed past him and was gone.  The lemur groped its way back into the light, back to the island.  Bell unfroze, closed up, and said nothing. He’d have to say something, wouldn’t he? Something would have to be done. Right?  He made a mental note. In the future, he wouldn’t let crazy people into his life. He meant it.  Metamorphosis is magic. Darwin had known this, too.  Sometimes it is a dark magic.  The metamorphosis of a tadpole into a frog. A grub into a wasp. A friend into an enemy.  Bell watched the grubs feed. By now they’d grown huge. Some approached five inches in length, blood red, large beyond all reason. Soon they would spin their papery cocoons. Turn into whatever they would turn into.  Bell pondered the advantage of such an adaptive mechanism. Perhaps it was a way to guard against overspecialization, a reservoir of adaptive capacity. Evolution is a slow process, and when new challenges arise, populations take time to react. There is a lag in the modifying response; species that don’t change fast enough die out.  Bell knew of several kinds of island lizard that reproduced parthenogenetically. Such species, when found, were always marginal, isolated, at risk of extinction; they were aberrations outside the main thrust of evolution. Most were doomed over the long run, because sexual reproduction is a much better way to create the next generation. In sexual reproduction, genes mix and match, new phenotypes arise, gene frequencies shift like tides. Sexual reproduction drops new cards in the deck from one generation to the next.  Parthenogenetic species, on the other hand, are locked-in, frozen in time, playing the same card over and over.  But not the insects in the back room.  The insects in the back room seemed to have a whole deck from which to deal, parthenogenetic or not. Such insects could adapt quickly, shifting morphotypes in a single generation. And then shift back the next. It was the next logical step—not just evolution, but the evolution of evolution. But how was it possible?  Bell thought of Cole, of what made men like him. That old argument, nature vs. nurture. In another time, in another place, Cole would have fit in. In another time, maybe Cole would have been a different person entirely.  The descendants of Vikings and Mongols today wore suits and ran multinational corporations. Were veterinarians, or plumbers, or holy men. Perhaps tomorrow, or a thousand years from now, they’ll need to be Vikings and Mongols again.  Populations change. Needs change. Optimums change. And it all changes faster than selection can track.  From a biological perspective, it would be easy to produce the same kind of people again and again. Stable people. Good people. Again and again, generation after generation—a one to one correlation between gene-set and expression.  But that’s not what you find when you look at humans.  Instead there is a plasticity in human nature. A carefully calibrated susceptibility to trauma.  What looks like a weak point in our species is in fact design.  Because the truth is that certain childhoods are supposed to fuck you up.  It is an adaptive response. Wired into us.  The ones who couldn’t adapt died out. Those gene sets which always produced the same kind of people—stable people, good people—no matter the environment, no matter the violence, or the aggression they faced—those gene sets which always played the same card, again and again—  —died out.  Leaving behind the ones who could metamorphose.  We were not so different from these bugs.  Bell unloaded all this on Seana one day during lunch. They sat across from each other, sipping soft drinks. “The evolution of evolution?”  “Yeah,” he said.  “Why would this happen in insects?” she asked.  “Because they’ve been here longest,” he said. But it was more than that. He thought of the ants and their aphids. The enzyme that clipped their wings. He thought of the different ways that insects solved their problems. “Because insects always choose the biological solution.”  Bell avoided Cole for days.  He told himself he was waiting for a good time to see the director, to tell her what had happened in the lemur tunnel. Told himself he wasn’t afraid that Cole would retaliate by telling about drinking together on zoo time, zoo property. Both were lies, but what he had the toughest time with was pure simple fear of Cole.  “Ridiculous,” he told himself. “You’re a grown man and a professional.”  On the other hand, Cole obviously was dangerous.  Maybe he could get Cole to leave, to resign his service contract without anyone having to tell the director anything.  This seemed, on reflection, to be the best bet for an outcome where he, Bell, kept his job and got rid of the problem.  The reflection took place at home, on the sofa, in front of the TV, in his underwear.  When Lin crossed the room, he saw himself through her eyes. He looked like a bum.  She was thinking, he knew, what an asshole he was for buying beer.  He didn’t care.  Neither did she, it seemed.  She sat down on the couch beside him.  What was he? When had he turned into a person who said nothing, did nothing? What had he let himself turn into?  The next day, Bell followed Cole down to the supply shed and said “We’re going to have a talk.”  Cole took a set of eight-foot pruning shears down from the wall rack, and turned to face Bell.  “Yeah,” he said.  Bell fumbled for a beginning, forgetting what he’d rehearsed.  Cole leaned on the pruning shears as if they were a wizard’s staff.  “I have to turn you in,” Bell said.  “For what?”  “Throwing rocks at the animals.”  Cole stared at him. His grip on the shears tightened. “I lose my temper sometimes. I have a temper, I admit.”  “That’s why you can’t be here.”  “Listen, I’ll work on it. I’ll be better.”  Cole shook his head. “I’m just letting you know as a courtesy. I have to report it.”  “You don’t have to do anything.”  “The other choice is that you leave today and don’t come back.”  “That’s not any choice at all.”  “There are other places you can do your service.”  “I like it here.”  “Here doesn’t like you anymore.”  “You know what I don’t like? I don’t think I like you trying to push me around.”  “Today is your last day here, one way or the other,” Bell said. “You can leave on your own, or you can be ushered out.”  “You really don’t want to do that.”  “You’re right, I don’t,” Bell said.  Cole’s face changed. “I’m warning you.”  Bell raised his walky-talky, never taking his eyes off Cole. “Garland,” he spoke into the handset. There was a squelch, then a voice, “Yeah.”  “You better come to the supply shed.”  “What’s wrong?”  “Now, Garland.”  Cole shoved Bell into the wall. Shoved him hard, so his teeth clacked.  And the rage was there again in the cutting torch eyes. Rage like nothing else mattered. Scarred hands curled into Bell’s shirt.  “This is your last chance,” Cole said.  Bell only smiled, feeling something shift inside him. He found suddenly that he was through being scared. “Fuck you,” he said.  Bell ducked the first blow, but the second caught him upside the head, splitting his brow open. Bell spun away, throwing an elbow that missed, and then they were both off balance, taking wild swings, and Cole grabbed at him, and they were falling. They hit the ground and rolled, wrestling for on the filthy floor. Cole came up on top, sitting on Bell’s legs. “I fucking warned you,” he hissed, and then he rained down punches until Garland tackled him.  After that, it was two on one, and Bell didn’t feel the least bit guilty about that.  The zoo super interviewed Bell for her report. They sat in her office. Behind her, against the wall, her fish swam their little circles. The superintendent leaned forward and laced her hands together on her desk.  She didn’t dig very deep. Seemed to think Cole's behavior was its own explanation. “I think you need stitches,” she said.  Bell nodded. He touched his brow. His first zoo scar.  “He’ll be barred from the zoo, of course,” she said. “And I’ll insist that his community service hours be revoked.”  “What’s going to happen to him now?”  “Charges probably.”  “I don’t want to press charges.”  “Animal cruelty. The lemurs. He’s going back to jail.” She paused, then added, “When they find him.”  Bell looked at the fish, swimming in the aquarium. “He said he’s never going back.”  That evening, as he was closing up, Bell found Cole’s parting gift. Found it revealed, at first, in the presence of a door ajar.  The back room of the castle.  Bell stared at what had been done.  After the fight, Cole had climbed to his feet, wiped the blood from his face—and then walked off. Heading toward the gates. Even two on one, the fight had been about even, and when Cole had finally stepped back and walked away, Bell and Gavin let him go. A draw. They’d assumed Cole left zoo property. But he hadn’t left.  He’d circled back around to the castle.  And he’d poured lye into each and every terrarium.  Several grubs were on the cement floor, ground into pulp with a boot.  Others were desiccated husks. Only a few still moved, writhing in the white powder. Bell stepped further into the room, surveying the carnage. He should have known. He should have known this was coming.  Bell’s inner alarm started bothering him on his way home that night.  Once a zookeeper developed an inner alarm, it worked everywhere.  In this case, it was less an alarm than a sense of something out of place. It got stronger as he closed in on the trailer park. At first he thought the alarm had something to do with Cole, but when he got home, he understood. The universe had an interesting sense of timing.  Lin was gone.  Not like gone to the store. Gone, left. Leaving him.  She left a note about it. The note explained. Blamed him.  Distantly, he heard himself curse.  All Bell could think, at first, was that she didn’t seem to have taken anything. Like there was nothing about their life worth bothering with. She had written the whole thing off, it seemed. Him. Their life. A total loss.  He made some growling noises.  She might be back. She might change her mind.  The stereo, after all, was really hers. She’d had it before they moved in together, and they’d never been able to afford a new one.  Somberly, he unplugged the stereo. In something like a trance, he planted it in the sink and turned on the water. Like a zombie, he let the water run and started searching the trailer for enough change to buy beer.  The next month passed in a haze.  Word filtered down, as word always did, and it turned out Cole had skipped town. The cops were still looking.  Not many of the grubs had survived Cole’s attack. The ones that did were scarred. Cole had been very thorough, even pouring lye in the terrarium on the floor. In all, only a handful of the grubs finished their cocoons. A few from the control cage. A few from the terrarium marked “heat” next to the space heater. But they were twisted things, these cocoons. Damaged things. His experiment was ruined. His hope was that he’d be able to get at least a few reproducing adults, start over. If the cocoons hatched at all.  And word had filtered down, too, that it would be bad for Cole when he was caught, because the list of charges had grown, and the warrant had sprouted teeth. Cole was facing time, real time, for what had happened. Bell knew Cole would need someone to blame.  He would blame Bell, and he would blame the zoo.  Several weeks later, Bell pulled into the parking lot and found there were fire trucks already in the lot. Hoses ran upward along the hill. Black smoke curled into the sky. Bell ran. He knew what he’d see before he saw it. The castle was engulfed in flame. The firefighters fought the blaze, but Bell knew it was too late. He imagined the animals inside baking. He imagined the sizzle and pop of burst skin, the soundless cries of dying snakes and lizards and frogs and bugs. He imagined his insects burning alive.  He looked around, searching for Cole, wondering if he’d stayed long enough to watch it burn.  When the fire was out, Bell walked through the ruins. The devastation was complete. Dead frogs and snakes and lizards. In the back room, he found the terrariums blackened and cracked. The insects inside charred and unrecognizable.  Except for one. The terrarium on the floor.  The terrarium with the heat sticker, now curled and blackened.  The cocoon was charred, split wide by the heat of the fire.  There was no grub inside.  They found Cole’s body later that day in the weeds behind the parking lot. Bell watched them load the body into the ambulance. Dark and swollen. It had been a bad death.  There were burns, minor, across his hands, like he’d come too close to his creation.  Burns and something else.  Something like stings.  Eyes swollen shut, anaphylactic shock.  Not everything burned in the fire.  Not all that burns is consumed. Cole had said that once.  Bell stood there for a long time, listening. Listening for a buzz like an electric light, but there was no sound. Only the sound of wind in the trees.  It was long gone, whatever it was. He just wished he could have seen what the grub had turned into. Next year it would be different.  Next year it would be a fruit eater, or a wasp, or a beetle. It would be what it needed to be.  It would be what the world made it.  Approaching home, Bell felt his inner alarm stir again.  The cable had been turned off.  Those cocksuckers didn’t know who they were dealing with. Bell had gotten drunk two nights in a row now, and he was feeling mean, feeling predatory.  He stalked outside, nine trailers down to the cable box, opened it up with a hex wrench, and hooked his cable back up.  Went home and surfed channels for anything resembling porn.  After two hours of this, his thumb hurt and the battery on the remote died.  He heard the screen door open.  Lin?  In the moment before the inner door opened, it occurred to him that her stereo was still soaking in the kitchen sink. He had a momentary, fearful impulse; his leg jerked. Then the beer kicked back in. He slouched back. He sneered like a sleepy lion.  A shape in a doorway.  Seana.  His sneer disappeared.  She stepped inside and said nothing. Looked at him a moment, as if reading him. Slouched down beside him with a sack of takeout chicken.  His hand, heavy and lazy, rested on her leg.  She tugged his hand higher.  They didn’t talk. Even the TV flashed in silence.  Outside the thin walls, the world licked itself and made hunting noises.    Originally published in Asimov’s Science Fiction, October-November 2009. Ted Kosmatka set his sights early on being a writer. This mostly involved having all his writing rejected, pursuing a biology degree, dropping out before graduation, and becoming a steelworker like his father and grandfather. Then the mill went bankrupt. At one point, he worked in a zoo. Now he works in video games, and his latest novel, The Flicker Men, came out last summer.  Michael Poore's work has appeared in numerous magazines, including Glimmer Train, AGNI, and Asimov's Science Fiction. His novel, Up Jumps the Devil, hailed by the New York Review of Books as \"an elegiac masterpiece,\" is available from HarperCollins. His story \"The Street of the House of the Sun,\" originally published in The Pinch, was reprinted in The Best American Nonrequired Reading 2012.", "text": "11720 words, novelette, REPRINT\nBlood Dauber\nThe animals hate you.\nYou get used to that, working at a zoo. Over time, it becomes a thing you can respect.\nBell trudged up the path, pushing the wheelbarrow before him, already sweating under his brown khaki uniform. He squinted in the bright sunlight, eyeing the exhibits as he ascended the hill: the goats and their pandering; the silly, horny monkeys; the slothful binturongs—all moving to the front of their enclosures as he approached.\nMost zoo animals eventually came to an understanding with those who brought the food. An uneasy truce.\nBut Bell knew better than to trust it.\nHe’d seen the scars.\nMary had scars on her arms. Garland was missing the tip of one finger, and John, the assistant super, had a large divot in the calf of his right leg.\n“Zebra” was all he’d say.\nBell was the newest zookeep. No scars yet. But a wariness.\nWalking up the hill that morning, Bell noticed Seana up ahead of him on the asphalt path. As he walked, he noticed she wore two different-colored socks—one red, the other white. He wondered if she were absent-minded, or just quirky. He hadn’t been at the zoo long, didn’t know her well.\nAs he closed the distance, he saw that she was crying. And he realized why she wore one red sock. Her calf was gashed open, bleeding streams.\nHe followed her into the staff room, and she explained that the juvenile baboon had attacked her.\nShe was outraged. Betrayed.\n“Why did you go in there?” he asked.\n“I always go in there,” she said. “I was here when it was born. I raised it.”\n“Animals are unpredictable.”\nShe shook her head. “It’s never done that before.”\nNever done that before.\nBell thought about that on the way home. Surprises puzzled him.\nOn one hand, it seemed there should never be any surprises. The world tended toward order, didn’t it? It circled the sun at the same speed all the time. Water boiled predictably, froze predictably. People weighed the same in Dallas as they did in Quebec. The speed of sound, in dry air, was 767 miles an hour.\nSo why, Bell wondered, can’t he and his wife keep track of money, plan ahead, and stop living in a trailer? In an orderly world, this shouldn’t be impossible. In an orderly world, you shouldn’t have to choose between buying food and keeping your car insurance.\nBell knew things were always more complicated than they looked. Water froze predictably, but strangely. It expanded. Crystals crashed and splintered. Sound moved faster underwater.\n“And you can’t keep from buying shit,” he thought aloud, driving home.\nHe popped over the curb into the Lil’ Red Barn parking lot.\nThey weren’t going to spend anything this week, Bell and Lin had agreed. They didn’t need to. Food in the fridge, gas in both cars. This week they wouldn’t spend.\nThat morning, they’d run out of toilet paper.\n“It’s not an insurmountable problem,” he’d told Lin. “We have paper towels.”\n“You’re not,” said Lin, “supposed to put anything besides toilet paper in the toilet.”\n“But you can,” argued Bell, “if you need to.”\nBell thought it was a spending problem. They knew how much money was coming in. If they controlled what went out, their money would be orderly, would increase. Lin disagreed.\n“It’s a matter of supply,” she had pointed out. “Your job needs to supply more money.”\n“So does yours.” Lin worked in the mall.\nShe glared ice. Splinters and crystals.\nIn Lin’s world, it was okay for her to criticize Bell. It was not okay for Bell to criticize Lin. Not if things were to be orderly. In every mating pair, Bell knew, one animal always bit harder than the other.\nLin was the biter.\nAnd in their two-mammal world where daily life was defined by constant, grinding poverty, it seemed she bit constantly.\nIt was important, they had once agreed, to do what they loved. To love their work.\n“I love my work,” Bell had told Lin a thousand times. Last month, in bed, he had told her how he loved his work, and they’d argued, and she’d scratched him with her fingernails. Drew blood. Made him want to hit her, and he almost did.\nBut he didn’t. There were light years between wanting to hit a woman and actually doing it. Bell wasn’t that kind of man. Wasn’t that kind of animal. What kind of animal was he?\nHe wondered if she knew. Wondered if she’d seen it in his eyes, the almost-hitting. The wanting to.\nHe quit saying how much he loved his job.\nMost zookeepers, he knew, were women whose husbands made better money. They could afford the love.\nLin knew this, too.\n“Shelly Capriatti’s husband sells guitars,” she had told him, just the night before. Shelly Capriatti was someone she worked with or worked out with, he couldn’t recall. “High end stuff, like for professionals. Like if Eric Clapton needed a new guitar. There’s no reason you couldn’t do something like that. He makes a ton of money.”\nAnd he was on the edge, as he often was, of admitting to himself that he wished he hadn’t gotten married, when she stretched herself across his lap in front of their eleven-year-old TV and was nice for a while. Long enough for him to sweep some hard truth under the rug. Again. It was easier that way.\nHe focused on that—the niceness—while he paid the cashier at the Lil’ Red Barn.\nShe could be nice. Things in general, sometimes, were nice.\nSometimes she was predictable, which was easier, but you had to be ready for both. Driving into the trailer park, he thought about that.\nThe baboon had never attacked anyone. Then, today, it did.\nThere’s a first time for everything.\n“You’re cute the way a dog is cute,” Lin had told him, in front of the TV.\nYou run out of toilet paper.\nThings fall apart.\nNot having money was a theme in Bell’s life. Even the zoo was a poor zoo, poorly funded.\nSometimes people complained. Once, a woman had come in, and when she’d seen the conditions in which the lions were housed, she’d been angry. People loved the lions.\n“It’s a cage,” she said.\nBell had agreed with her.\n“Zoos are supposed to be . . . natural,” she continued. “They’re supposed to be habitats, and the animals aren’t even supposed to realize they’re confined.”\nBell understood. He sympathized. He’d been to zoos like that, too, in towns that weren’t dying.\n“Do you think they don’t know?” he asked.\nShe only stared at him.\n“Do you think, in these other zoos, that the animals don’t know they’re locked in?”\n“A disgrace,” she said, walking away.\nLow funding required management to get creative when provisioning the animals. In addition to supplies bought on the open market, there were arrangements with local grocery stores, and butchers, and meat processors. A truck was taken around each day to be filled with heaps of food—loaves of bread that had passed their freshness dates, meat that had begun to turn, gallons of milk that had expired. Occasionally there was carrion brought in—deer which had been struck on the highway and then picked up by the county. All of it fed into the bottomless maw of the zoo.\nThe trucks would drive around back and unload their cargo into the kitchen.\nIt was called the kitchen, but it was not a kitchen. It was a room with several huge stainless steel tables on which food was piled and sorted and divided.\nBell was on his way to the castle when a voice on his walky-talky stopped him. “Bell, there’s something you need to see.”\nLucy, one of the kitchen workers, out of breath.\nHe got there fast. Came in through the back door.\n“It’s a bug,” said Lucy, hands at her collar.\n“What kind?” he asked.\nShe shrugged. “The ugly kind.” She pointed at a bowl turned upside-down on the counter.\nBell lifted the bowl. Put it down again.\nHe stood perfectly still.\nHe lifted the bowl and stole another quick glance.\n“Hmm,” he said and lowered the bowl.\nThe kitchen workers stared. “What is it?”\n“I’m working on it,” he said. He looked into the distance. “I think it’s a grub of some sort.”\n“I didn’t think grubs got that big,” Lucy said.\n“No,” Bell said. “Neither did I.”\nBell looked again. The grub was large, fleshy and blood red. Five inches long.\n“Where did it come from?” he asked.\nShe shrugged again. “The table.”\nBell looked at the table. There were watermelons, and apples, and bread, and the partially disarticulated hock of a deer. Several bunches of blackened bananas made a mountain in the center, along with a smaller mound of more exotic fruit shipped in from Lord-knew-where.\n“It could have come in with anything,” she said. “I found it crawling along the edge of the table there.” She shuddered. “It was moving pretty fast.”\nBell retrieved a glass jar from the cabinet, opened the lid, then dragged the bowl across the edge of the table so the strange grub dropped into the jar. He stepped outside and plucked some grass, put the grass inside, and closed the lid. Poked holes.\nHe took the jar across the zoo to the castle and placed it on a shelf in the back room.\n“The castle” was the name used for the entomology building. Bell could only imagine what the structure’s original use had been, with its block construction and odd turrets; but whatever that long ago intent, it now housed all manner of creepy crawlers—hissing cockroaches, and ant farms, and snakes, and lizards and frogs. Anything that required darkness or careful temperature control.\nThe building was a box within a box. There was an open, central area ringed on three sides by walls and exhibits—and just behind these walls was a space called the back room, closed to the public, which was actually a single narrow hall that conformed to the outside perimeter of the building, a gap space where you could access the back side of the cages. At the far end of this hall, in a dead-end spot furthest from the entry door was a table and chairs, a TV, a desk, and several terrariums. These extra terrariums were where the sick were boarded, those unfit for public examination.\nBell did the rest of his chores for the day. In the evening he checked on the grub. It was still there, happily curling up the sides of the glass jar. Bell had studied entomology in college, and he’d never seen anything like it; the insect’s sheer bulk seemed to push the cubed-square law to its limit. Perhaps beyond its limit. He hadn’t thought insects could be that big. When he opened the lid, the grub reared up at him, strange mouth-parts writhing.\nBell was in charge of the castle, the petting zoo, and the convicts. This had not always been the case. He was in charge of the castle because he was the only zookeeper who’d taken college-level entomology. The petting zoo was meant as an insult. And the convicts were punishment.\nThe convicts came in most weekdays. You could point them out in the parking lot—men and women who were there too early, hours before the gates opened. Bell would feed the insects, drink a cup of coffee, and then walk to open the front gates.\n“Here for community service?” he’d ask.\n“Yeah,” they’d say.\nSometimes there were two or three. Sometimes none. They handed Bell their paperwork, and Bell passed it to the zoo superintendent at the end of the day.\nThe number of hours worked was the all-important statistic. Because they all had a number they were working down from. 150 hours, 200 hours, 100 hours.\nSometimes they talked about their crimes, and sometimes they didn’t.\nBell never asked. Not his business.\nBell often talked to himself in the bathroom mirror.\n“In this world,” he said, “you are not an apex predator. Humans are, as a species, but you, yourself, are not.”\nYou do not always win. Problems are not always solved.\nThere are defeats and surrenderings. Small but important.\nLast winter, they gave up heating the bedroom. They sealed off the back of the trailer and slept on the sofa. They learned the science of climbing into the bathtub. The bathtub was metal and descended a few inches through the floor, arctic air right beneath. No matter how hot the water got, your butt and legs would start to freeze if you sat still too long. You had to lift yourself up now and then, let the hot water get under there. Lower yourself. Wait. Repeat.\n“It’s like not even being part of the food chain,” Bell said aloud one cold night, eating burritos in the kitchen.\nThey hadn’t spoken to one another that morning. His remark about the food chain was one of two things they said to each other all day long.\nSometimes he opened up the bedroom door and exhaled just to see his breath cloud the room.\nHe wanted her to ask about his food chain remark. Wanted to explain it. Wanted her to understand.\n“The food chain—” he began.\n“I get it,” she said.\nThat was the second thing that got said. Her breath made a cloud even though they were in the kitchen.\nBell didn’t dare tell Lin how much he loved his job, not anymore. He told the mirror, instead.\n“I love my job,” he said. His reflection said it, too, it seemed.\nLike the zoo, their life at home had been built on various pretendings. Pretending there might be gas money. Pretending they could afford to eat better, but chose not to. Pretending that Lin still thought it was important to have a job you liked. Loved. Whatever.\nShe had quit pretending. Somewhere behind her mask was the Lin who thought “If you loved me you’d do what it took for me to live a better life,” and that Lin had surfaced. Unmasked. Through fucking around.\nClassified ads appeared, taped to the fridge.\nSales. Landscaping. Power-washing trucks. All kinds of things you could do with a degree in biology.\n“It’s easy,” Bell told her, “to lose track of what’s really important.”\nShe didn’t have to say that having heat and electricity were important, too. Instead, never breaking eye contact, she grabbed her coat and her vibrator and locked herself in the bathroom.\nLibrary clerk. Barista. All things that paid more than working at a zoo. Mexican cook. Skycap for a Mexican airline. Didn’t matter if you weren’t Mexican.\nIt was amazing, thought Bell, how much pretending went on in a zoo.\nThe public pretended the cages were jungles, savannah, desert, or snow.\nThe animals pretended that they were not interested in the public. The public and the zookeepers worked together at pretending that the zoo was not, when you got right down to it, just carefully-engineered cruelty.\nSometimes the animals forgot to pretend. Like when babies were born and wouldn’t eat. Because they knew captivity when they saw it. Felt it. Forgot to pretend life was worth living.\nLike when the llama attacked Bria Vagades.\nBell was there when it happened.\nIt wasn’t like an animal attack in the movies, all snarling and snorting, blood and fur. It looked almost comical. One second Bria was lifting the rock-shaped hatch which concealed the garden hose, and suddenly here came Nunez the llama, ridiculous and splendid with his two-tone black-and-gray coat, rearing on his hind legs, waving his front hooves like a boxer. He was on her before she saw him, and she screamed.\n“Ow!” she screamed, and “Fuck you, Nunez!” before she got a grip on herself. The zoo was closed, but there were strict rules about losing your cool where the public might see, might panic.\nNunez lost his balance, came down on all fours, still advancing, sniffing the air. Reared up again, hooves waving as Bria covered her head, backing away, feeling behind her for the door.\n“He didn’t want her in the enclosure,” Bell told John Lorraine, another zookeeper, later on in the cafeteria. “It was obvious.”\n“It’s never obvious. It’s sloppy, is what it is, assigning human motives to animal behavior.”\n“Territoriality is an animal behavior,” Bell answered, chewing peanut butter crackers. “It’s an animal motive.”\n“What’s sloppy,” John said, “is pretending to understand why all the time. Why they do anything they do.”\n“Because it’s mating season,” said Bell. “That’s why.”\nJohn Lorraine’s eyes narrowed. “And she went in the enclosure by herself? That’s sloppy, too. These animals aren’t pets.”\nBut Bell knew some of the animals were like pets. Bad pets. Pets you couldn’t trust. “You should write a fucking memo,” he said.\n“You should shut up.”\nBell agreed. He said “Yep.”\nThe grub wasn’t like a pet. The day after Bell placed it in one of the large terrariums, it began to construct a papery cocoon.\nDuring his evening break, Bell sat in the back room and watched the grub work. He checked the zoo’s entomology books but couldn’t find a match. None of the pictures looked anything like the strange insect in the terrarium. The cocoon only deepened the mystery. Whatever this thing was, it was a juvenile.\nThere were four main groups of insects that had a larval stage of development: Coleoptera, Lepidoptera, Hymenoptera, and Diptera.\nThe thing in the terrarium was no caterpillar, so Bell could rule out Lepidoptera. The grub’s size seemed to rule out Diptera. Which left Hymenoptera and Coleoptera. Wasps and beetles. But it didn’t look like any wasp or beetle grub he’d ever seen.\nMost grubs didn’t have eyes. Most grubs didn’t have mouthparts like that.\nAt the end of its third day in the terrarium, Bell arrived to find it had sealed itself into its papery chrysalis, and just like that, the grub subtracted itself from the world.\nThe next day, there was an addition to Bell’s army of community service workers. A late arrival.\nBell was on one knee, mixing food for the lemurs when a shadow fell over the bucket. Bell shaded his eyes and looked up.\n“They told me to find Bell. ‘Report to Bell,’ they said. Said Bell was young. You look like you might be him.”\nThe shadow had a voice like raw sand.\nBell stood and shook hands.\nShaking hands, the first thing he noticed was scar tissue. Burn scars splashed across hand and wrist. Both hands, Bell observed. Both wrists.\nLeather-skinned. Scrambled white hair. Eyes blue like a cutting torch. If a bomb could explode and come back as a person, it would be this guy. Just looking at him, sunburned and fire-burned, made Bell thirsty. They sat down over Cokes at the Savannah Café, where Bell learned that the bomb’s name was Cole. Learned that, at sixty, Cole was by far the oldest community service con to grace the zoo.\nThen he put him to work hosing down empty cells in the elephant house, beginning with the Cape Buffalo.\n“Bullshit,” rasped Cole, when he saw the cell.\nBell must have looked startled.\n“Literally,” Cole explained, waving the hose at the floor. He smiled, revealing teeth like rubble. Smiled and winked.\nIt was like being winked at by war.\nJust as the lions were star attractions for the tourists, Cole became a star attraction for the staff.\nHe was scary, like the lions. Like the lions, he seemed to keep most of his energy bottled up in some soft, invisible engine. It was an uneasy feeling, locking eyes with a lion. Same with Cole.\nYou couldn’t talk to a lion, though. Couldn’t ask him how he came to be at the zoo. But you could ask Cole, if you were nosy enough.\nBell didn’t ask.\nBell stood in the dark tunnel with Cole. “The baboons are smart,” he said. “You have to be careful.”\nCole nodded.\n“They can throw their poop at you. They can bite. You have to lock both sets of doors. There is a procedure you have to follow, and you should never be in the enclosure with them.”\nCole nodded again.\n“It’s very important. Do you understand?”\nCole nodded again, but Bell wasn’t so sure. Several years earlier there’d been an incident in the cat house. The exhibit had been in the midst of repairs, and the lion had been allowed access to its run overnight. This normally wouldn’t have been an issue except that the adjacent run had been under construction. The door separating the bobcat run from the lion run was made of thick plywood—a temporary measure which was fine to keep the bobcats in. But insufficient, apparently, to keep the lion out.\nThe next day, they found the plywood partition shredded, and the lion sleeping in the bobcat cage, blood coating its muzzle. All the bobcats were dead.\nZoos are dangerous places.\nDangerous for the animals. Dangerous for the zookeeps.\nCole had a thousand hours of community service. Bell had never seen a number that high. It would take him a year to finish it.\nWhen Cole had been at the zoo for a week, the zoo superintendent pulled Bell aside. The superintendent didn’t like Bell much. She wore a serious expression. “The older guy, Cole, is he a good worker?”\n“He’s fine.”\n“He’s going to be here for a while.”\n“Yeah,” Bell said, “I know.” He could see the gears moving behind the superintendent’s eyes. A free long-term worker. A worker that didn’t need paid.\n“Perhaps we could give him more responsibilities,” she said.\nFor weeks, Bell checked on the cocoon, waiting to see what would emerge.\nIt happened on a Monday. There was a buzz in the room when Bell entered. A buzz like one second before an electric light went bad; only this light kept going bad, second after second—an electrical hum that did not fade. Bell looked in the terrarium and saw it.\nHuge.\nWinged.\nBright red, but the mouthparts were black.\n“Hymenoptera,” he whispered. “Of some kind.”\nThe summer stretched on. Bell trained Cole how to be a zookeeper. On their breaks they sat in the back room.\nWhen the insect first hatched, the question became what to feed it. Bell tried a little of everything: sliced bananas, and apples and small chunks of meat. Some of the fruit on the table came from exotic locales, and it was easy to imagine the grub stowed within the corpus of some melon from Central America—and it was easy to imagine how such a melon might go quickly bad, and soft, and end up on the zoo’s table as discarded produce.\nWeeks passed, and the insect thrived.\nEven Cole took an interest. “Pet wasp?” he said as he helped Bell clean out the nearby lizard cage.\n“I’m not convinced it’s a wasp.”\nSeveral days later Bell found Cole looking through the glass. Cole was the one who noticed it first.\n“What’s that?” he asked.\nBell looked. “I’ll be damned.” The wasp-thing sat perched on a small branch in the terrarium, oddly-jointed legs flexed, wings slung like swords over its narrow back. Hanging beneath the insect, dangling from a fibrous string, was a small pod of what looked like dried brown foam.\n“What is it?” Cole said.\n“I think it’s an egg case.”\nCole surveyed the terrarium again.\n“So there’s two of them things?”\nBell shook his head. “There’s just the one.”\n“Maybe she was already fertilized.”\nThis particular convict was smarter than he pretended to be. Bell caught his reflection in the glass, blowtorch eyes darting back and forth.\n“It’s not likely,” he said. “She is female, but the reproductive stage usually begins after metamorphosis, not before. And this thing has been alone since it hatched.”\n“Santa Maria of the bugs,” said Cole, cracking a shipwreck smile.\nBell laughed. “It’s less than a miracle in the insect world,” he explained. “It’s called Parthanogenesis. Some kinds of Hymenoptera can—”\n“Hymen-who?”\n“It’s an insect clade. Ants, bees, and wasps. Certain species can reproduce without males. Worms can do it, too, and some lizards. But Hymenoptera are the champs.”\nCole straightened.\n“Let’s hope that doesn’t catch on.”\nBell thought it over. Reproduction and marriage and wives and such.\n“Might not be so bad,” he muttered.\n“What’s that supposed to mean?”\n“Nothing.”\nBell contacted the university. He wrote a letter to the biology department describing the insect and the circumstances of its arrival. A week later he received a reply. The note was short and polite: “It’s probably a mud dauber.”\nBell wadded the letter and threw it in the trash. “I know what a mud dauber looks like.”\nOne evening a few weeks later, he found the insect dead. Even in death it looked formidable, with a head the size of a dime, and a body like a smooth, slick walnut.\nFor the first time, he dared to touch it. With its legs spread out, it was nearly the size of his hand. He jabbed a pin through its abdomen and stuck it to a small cork. The legs sagged under their own weight. He looked inside the terrarium at the egg case, wondering if anything would hatch from it.\nMonths passed, the egg case forgotten. Bell and Seana took turns training the old man. Seana didn’t like Cole, and didn’t pretend she did.\nIn the spring, the eggs hatched. There were a million tiny grubs, just like the original, only smaller. Bell watched them wriggling through the sawdust he’d put in the terrarium.\n“These more of your wasps?” Cole asked.\n“They will be.”\nThey watched them writhing for several minutes.\n“What do they eat?” Cole asked.\nBell thought about this for a moment. The adult form of an insect often ate a completely different diet than the juvenile.\n“I have no idea,” he said.\nFeedings could be tricky.\nWhen Bell was first hired by the zoo, he’d been put in charge of feeding the raptors. Raptors weren’t dinosaurs though, like you’d think, with a name like that. It turned out, they were big damn birds. One of them was a golden eagle.\nAll went well for the first few days. The golden eagle ate about five rats a week, but it was fed every day. Which would have been fine except that the uneaten rats had to be removed from the enclosure.\nThis idea didn’t bother Bell until the moment he first went to do it. He stood at the cage door and looked at the big damn eagle, and it occurred to him that he was about to go inside a big damn eagle’s enclosure and take out its food. It occurred to him what might happen if the big damn eagle felt suddenly partial to that food.\nHe stared at the eagle. He stared at its talons—two-inch daggers strong enough to pierce bone.\nBell walked down to the zoo superintendent’s office.\nShe was unmoved by his concerns.\n“I’m not sure I’m comfortable with it,” Bell said.\nShe waved that off. “You’ve got nothing to worry about.” Then she went back to her paperwork.\n“But how do you know the eagle won’t attack?”\n“It’ll be fine,” she said, not bothering to look up. “Nothing like that has ever happened before.”\nA preamble to every scar story he’d heard at the zoo.\n“I’m not going to do it,” he said.\nShe looked up from her papers. She sighed. She weighed her options. “All right,” she said.\nThe next week he was put in charge of the petting zoo. This was meant as an insult.\nWhen he complained, pointing out that his particular skill set could surely be put to better utility, she only nodded sympathetically.\nThen she put him in charge of the convicts, too.\nBell divided the newly hatched grubs into three groups, in three terrariums. In one terrarium, he dropped only fruit. In another, he dropped chunks of bread. In the third terrarium he dropped meat.\nInsects tended to specialize in their diets, so he thought there was a good chance that two of the terrariums would starve. But then at least he’d know what they ate.\nThe grubs, however, surprised him. All three aquariums thrived—though the grubs given meat grew fastest.\nTwo months later, the grubs all began to spin cocoons. As if by agreement, they all started their nests on the same day.\nThat night, as if to celebrate the milestone, Bell committed a budget crime. He stopped at McDonalds for a bite on his way home, knowing that tuna salad was all they had in the fridge.\nHe was trapped and doomed, once he’d spent the money.\n“Spend whatever you need to,” Lin said. “Just make sure you tell me about it.”\nLin was the official banker of their marriage.\n“Just tell me about it” was the trap, because if he spent money and told her, she got mad. She might get loud, she might stay quiet. Either way, when Lin got mad, she fed on her own energy like a hurricane, getting louder and madder. The hurricane usually blew until she charged out the door and drove away, still screaming. Hours later, she’d return. Maybe still mad, maybe not.\nOne of these days when she came back, Bell would be gone.\nThis thought came from an increasingly vocal part of his brain. The part where he’d swept so much crap under the carpet.\nA week after his crime, she dropped a bank statement in his lap while he sat reading.\nThey were both reading a lot, these days. The cable company had run out of patience.\n“What?” he asked.\n“It’s highlighted.”\nShit. He’d forgotten.\nMCD Store #1635.\n“You didn’t give me a receipt for that.”\n“Thought I had. Sorry.”\nHe was sorry. What else could he do? Here, he thought, was where a rational person would let it go. But not Lin.\nShe yelled, storm winds building. How, she wanted to know, was she supposed to know how much to spend on the rent and the car and the power company and the phone company and the fucking grocery store when she didn’t know how much he’d spent on whatever big important things he needed to spend money on. Like a Big Mac, apparently. She didn’t remember him asking if she’d like a Big Mac, too, because he was too busy being a selfish, irresponsible asshole and then hiding the receipt.\nHe could tune out the yelling, until she made accusations like that.\n“I forgot,” he reminded her. Now he was pissed. This was going to be bad.\nThe louder she got, the louder he got. Eventually, she was shrieking at him. A responsible voice inside him grew worried. She was really, really wound up this time. The tiny voice said that he couldn’t let her drive off like this. She’d hurt herself. Hurt someone.\nIt was a zookeeper voice. The voice that knew you couldn’t let the animals run wild, no matter what.\nShe took a bathroom break, still yelling, and Bell took advantage of the opportunity to hide her car keys. Deep inside a box of stale Triscuits.\nSure enough, when she emerged, she hunted for her keys.\nLin was notoriously bad about where she laid her keys. They could be anywhere.\nShe hunted.\nFor ten, fifteen minutes, she looked everywhere. Everywhere she might rationally have put her keys. She stopped yelling about Bell and started quieting down.\nThe quiet, Bell knew, was deceptive. It did not signal calm. Just quiet. Like a fire that gets into the walls, hidden, until someone opens a door.\nBell realized he had made a mistake. She would keep looking forever, that was the problem. Sooner or later, he was going to have to tell her he’d hidden her keys. And she’d get worse. Get louder. The storm of the century.\nIn some ways, he felt sorry for her. She was kind of crazy, really. More than kind of. Poor girl. But what a bitch. He almost said it aloud.\nIn the end, she retreated to the bathroom again, and Bell put the keys in the silverware drawer. Silently, like a cat burglar.\nShe came back out, and the silverware drawer was the third place she looked. She had already looked there. Several times. And she knew it. Bell knew she knew it.\n“You fucker,” she whispered, almost choking. Near tears.\nRemorse! He was no match for tears. He melted, moved toward her. He’d been protecting her.\nShe whipped the keys at him, catching his left ear as he ducked.\nIt was loud again for a while. Bell picked up the keys and opened the trailer door.\nLin had grabbed her purse.\n“Give them here!” she screamed.\nBell ignored her.\nHe drove off, this time.\nHe used up ten dollars of gasoline just driving in circles. He enjoyed the waste. Enjoyed the drive. Talked to himself.\nWhen he circled back, at last, he found her shivering on the steps.\nShe’d been locked out.\nIt was a cold fall evening.\nRemorse, again.\nThis was not fucking working.\nMating is complicated\nMammals click.\nPersonalities come together, and they click, sometimes. Other times they don’t.\nThe day after he and Lin un-clicked so badly—the day after he locked her out of the trailer—Bell and Cole sort of clicked.\nBell couldn’t have said what did it, exactly. He was on the roof of the walrus tank, watching the pinnipeds heave their awkward bulk across wet concrete.\nCole climbed the ladder and joined him. In the enclosure below, two males bellowed at each other, bumped chests.\nThe smaller male backed off, retreating to the tank, but the larger walrus followed. It slipped its hulking form into the water and was suddenly graceful. Like a different animal entirely.\nThey stared together in silence until Cole said, simply “Well, Goddamn,” and they both cracked smiles.\n“Reminds me of my dad growing up,” Cole said. “Big and mean. Harder to get away from than you’d think.”\nBell cocked an eyebrow.\n“Oh, a real tough-guy,” Cole continued. “Beat my ass until I got bigger than him.” Cole smiled war again.\nBell was unsurprised when Cole showed him a silver flask and asked if he’d like a sip.\nAnd Bell had a sip. Just one.\nBut it was enough to set the stage for a detour, after closing, to a nearby grill with a liquor license. Bell didn’t feel like going home to Lin; and Cole didn’t feel like going back to the halfway house. He wasn’t due for an hour, yet.\nAt the bar, Bell lit a cigarette and found himself talking about Lin. He told Cole all about the money problem, and the fight.\nCole’s cutting-torch eyes burned as he listened. He looked terrifyingly wise, all of a sudden.\nAfter two beers, Bell found himself saying out loud the thing he could barely admit to himself, “I wish I’d stayed single, man. I really, really, do.”\nJust then, a woman wearing fifty pounds of makeup came in, clunked across the floor in square heels. Cole winked at her.\nShe said something to the bartender and walked back out.\nBell watched her go. The setting sun blazed straight in through the door as it wheezed shut. Bell winced and—too late—shaded his eyes. Momentarily blind, blinking, Bell groped for his beer.\nInto this momentary darkness, Cole said “I crashed a helicopter, in case you wondered.”\nBell blinked. Cole’s eyes became visible, twin coals.\n“Huh?”\n“I noticed you didn’t ask about my hands. Or why I was in jail. You never ask nobody. It’s actually pretty conspicuous, the way you don’t ever ask how anyone came to community service. You just give ‘em some shit to do and mark down their hours.”\nBell must have looked troubled. Purple circles rotated in the dark, in his brain.\n“No, it’s cool. It’s cool you do people like that. Makes ‘em feel normal. But not asking the way you do, it’s kinda obvious how bad you want to know, so I’m telling you. I wrecked a helicopter.”\nCole was right. Bell wanted to know. Wanted to know quite badly. Hadn’t realized until this moment.\n“Alright,” he said, by way of encouragement.\nIt took fifteen minutes for Cole to tell about Brazil.\nHe was a helicopter pilot, to begin with.\nFirst in the army, then for the president of a frozen chicken company, then for United Airlines, on contract with Canadian Railways, shuttling engineers from checkpoint to checkpoint. It was the kind of solitary work he enjoyed. The engineers were usually stone tired. Quiet.\nThen he’d crashed his United Airlines helicopter.\nThe kind of thing that could happen to anyone; his tail rotor crapped out and he had to autorotate down from eight hundred feet, spinning and yawing with three cursing, pants-pissing passengers. Rolling sideways at the last second, landing sideways, splintering the rotor, rupturing the fuel tank.\nNo deaths. The only serious injury was Cole, who remained behind until all three passengers were out and running, safe. Sustained burns over twenty-five percent of his body, including the splashy scar tissue on his left hand and wrist.\nBell began to ask a question, but Cole anticipated him.\n“The other hand was something else,” he said. “Something later.”\nUnited Airlines hadn’t been cool about his benefits, and the hospital bankrupted him. Could barely afford the surgery that let him use his hands, let alone reconstruction or cosmetics.\nWhich was why he started siphoning aircraft fuel. You could make a lot of money on the black market, selling aircraft fuel at half-price.\nA dangerous business, though. No honor among thieves and so on; someone turned him in, and a federal warrant came looking for him.\nThe Feds called him while he was in the air. In Virginia, near the coast. On his way to Richmond for a pickup.\n“Put down at Richmond International,” the FBI told him.\nAnd Cole had flown out to sea, instead. How stupid did those bastards think a guy was?\nStupid enough, he supposed, to get caught fencing felony amounts of helicopter fuel.\nCole flew out to sea. Flew into the sea. If the feds wanted him, they were going to have to work for it.\nBell must have looked at Cole’s right hand.\n“The fuel tank ruptured when I hit the waves,” said Cole, draining his beer. “Set the water on fire. I could either surface and tread water in the burning fuel, or stay under and grow gills. Happened when I was twenty-seven. They gave me nine years.”\nBell did the age math, but before he could ask, Cole said, “Oh, I was in and out after that. Assault, mostly. The last one for a bar fight. Guy got his eye socket broken, and the judge gave me extra—those women judges, they’re the worst. She said my anger gonna burn me up some day.” Cole smiled war again. “But that already happened, ain’t it? Besides, not all that burns is consumed.”\nHe took a last swallow of his drink. “I gotta scoot. If they lock my ass out, I’m fucked.”\nVery quickly, Cole was up and out the door. Bell turned and watched him go, and the sun hadn’t quite set yet, and Bell’s eyes got nailed a second time.\nBlind as a bat, Bell thought.\nGood zookeeper that he was, Bell knew bats weren’t really blind, and he said so.\n“What?” called the bartender. Also, Bell thought, a zookeeper of sorts.\n“Bats aren’t really blind,” Bell repeated.\nNever get drunk with the convicts, Bell lectured himself.\nIt was a bad idea in so many ways. It was unprofessional. Besides, if you got to be drinking buddies with one of them, even going so far as to sip whiskey with him on top of the walrus tank—a firing violation by zoo rules—then what do you do afterward if the convict does something you should report him for? Something else.\nA week after the bar, Bell arrived at work and found Garland, the maintenance chief, waiting at the gate.\n“There’s an issue,” said Garland.\n“An issue?”\n“With your friend. He’s drunk.”\n“Where?”\n“I have him shoveling the camel enclosure. Figured that would keep him out the way until he sobered up a bit.” Garland paused. “Only I think he’s a lot worse off than I thought.”\nA headache came rumbling up on heavy treads. Bell sighed.\nGarland looked uneasy, too. It was bad news, Cole being drunk. Especially if Garland had noticed it and let him work anyway. It was like Watergate. A lot of people could wind up in trouble before this was over.\n“I thought I’d wait and see what you wanted to do,” said Garland as they walked uphill through the zoo. “I didn’t want to make out a report if it was just . . . well.”\nBell understood. The old man was scary.\nBell nodded. “I’ll handle it.”\nAt the camel enclosure, Bell called out Cole’s name and the old man approached, shovel in hand. He smelled like rum.\n“Yeah?” The question had an edge to it. Like Cole knew he was in trouble. For a moment, looking through the bars, Bell saw something aggressive in his eyes. Something leonine.\nBell explained how it would go.\nCole would drop the shovel.\nHe would avoid speaking to anyone.\nHe would leave by the back entrance. Now.\n“So I’m fucked,” Cole said.\nBell shook his head. “You called in sick today is all. This never happened.”\nHe should be firing this guy, Bell knew. Why didn’t he?\nHe could see it now. He’d tell Cole to get the hell out and not come back, and Cole would go to Koverman and say “Did you know I drank whiskey with Bell during work hours on top of the walrus tank?”\n“I’m fucked,” Cole repeated. He swayed.\nBell frowned. There was something that started out to be a long silence. Then Cole whispered, “I’m not going back to jail. I won’t do it.”\nBell led him out. “Come back tomorrow,” he said. “Sober.”\nIt took exactly four weeks for the cocoons to hatch. There was a sound like electric lights going bad, and Bell stepped in the back room. He stared for a long time. The terrariums teamed with strange new life. Each glass box seemed to house a different creature entirely. Strange wasp-things, and things . . . not like wasps. Things without names. Some larger, some smaller. Some with wings, some without. All were red and black.\n“Impossible,” he muttered. They couldn’t all be the same species.\nHis first instinct was to call the university. Then he remembered their note about mud daubers. Screw the university.\nBesides, instincts were for animals. He’d solve this on his own.\nHe could figure it out, Bell was certain. He knew a lot about insects.\nHe knew insects had been among the first living things to walk dry land; they’d seen the rise and fall of dinosaurs, the birth of flowering plants. Humans weren’t the first species to farm, or to domesticate animals, or to war. Those milestones belonged to insects. When humanity first began its clumsy, ongoing experiment in agriculture, the Attine ants of South America had already long since perfected it—cultivating vast fungus beds in underground chambers in their nests, seeding carefully tended gardens with the clones of a fungus that linked back more than thirty million years.\nAnother species of ant, Lasius flaws, managed large flocks of domesticated aphids. The aphids were kept in subterranean corrals where they grew mature and succulent, grazing the roots of plants. And were then milked for their nutrient-rich honeydew.\nSome termite mounds sprawled more than thirty feet in diameter, housing tens of millions of individuals, all bound up in a single sophisticated caste system. Soldiers of Macrotermes bellicosus developed jaws so huge that they could no longer be used in feeding; instead they relied on teams of lower-caste workers to lift sustenance to their mouths.\nInsects build cities, and farms and superhighways. Slant your eyes and look hard enough, and you’ll see a level of social sophistication that can only be described as civilization.\nBell had often thought that humans had achieved their conspicuous position in the world not because of how perfectly adapted they were, but because of how weak, how clumsy, how fragile they were. How unsuited to existence.\nOne species of dairying ant secreted an enzyme from their heads that was carefully rubbed onto each aphid during the milking process. The enzyme disrupted wing development, preventing their aphids from ever flying away.\nWhere humans came up with external solutions—like building fences—insects often found a more elegant solution. A biological solution.\nThey’d had the time to do it.\nDetermined and cautious, Bell fed the grubs every day and wrote down his observations.\nBut still, Cole was the one who noticed it.\nWhen Bell finally understood, his mouth dropped open. “Holy shit,” he said.\nHe looked at his notes.\nHe’d fed the insects one of three different diets. The insects which, as grubs, had eaten bread did not now have wings, but stunted twists of chitin. Their color was dull red, like rust. More beetle-like, less wasp. Now, as adults, they still preferred bread. The fruit-eaters still ate fruit. They were large-bodied and short limbed, with stumpy wings that buzzed loudly as they made awkward flights inside the terrarium. Bell could imagine them making those same flights between distant stands of fruit.\nThe meat eater was the most strange. Blood red, with wings like blades—mouth parts huge and angular.\n“They adapted,” Bell said. “They adapted to the food sources they ate as grubs.” Bell shook his head in disbelief.\n“Fast learners,” Cole said. Then he moved as if to stick an experimental finger in the meat-eater cage, but Bell said “Don’t.”\nSeana, when he showed her the hatchlings, said “Can that happen?”\n“There it is,” he said. But in his heart of hearts, he knew she was right to doubt. Like a million years of evolution in a single generation. No species adapts that quickly. It was a bad movie. Junk science. Not possible.\n“But there it is,” he repeated.\nThe insects lived for more than a month. They buzzed, or crawled, or flitted around their cages. Over the course of a single week the following month, they took turns dying.\nThe meat eater lived longest. After each die-off, Bell found egg-cases. He cleaned the terrariums, and put the egg cases back inside. Then he waited to see what would hatch.\nLate one evening, Seana climbed up the ladder while he was in the barn loft at the petting zoo, checking the hay for rot. Climbed up and stood behind him until he turned around, then stood on her toes and kissed him.\nIf the zoo hadn’t been closed and nearly deserted, if Bell hadn’t known for sure that no one was likely to venture into the petting zoo, let alone climb into the loft, then maybe it would have happened differently. Maybe Bell would have kissed her back, because kissing would have been all that could happen.\nBut the zoo was closed. Bell did know. And it did happen the way it happened.\n“I can’t,” he said.\nShe pulled away.\n“I want to,” he said.\nShe looked at him, waiting.\nBeneath them, the horses shuffled. Made noises. Kicked their stall doors and talked to each other in soft equine language.\nHe thought of Lin, home in their trailer. “I can’t,” he said again.\nA black mood seized Bell on the way home. He drove the darkening highway, following his headlights into space. He pushed the old beater faster, watching the speedometer climb to seventy, then eighty. He took the curves without easing off the accelerator. The tires squealed, but held the road.\nHis mind was a movie of loves and hates. He loved and hated his job. Loved the animals, but hated the conditions. Hated that he couldn’t afford to live on what he was paid. When you’re young, he thought, they tell you that if you get a degree, everything else will fall into place. But it’s not that simple, is it?\nNothing—not one thing—had worked out like it was supposed to.\nHe thought of life at home, a second maze of contradiction. He was tired of being alone and together at the same time. He wanted to be free, but there was no freedom. No way out. He felt like an animal with a trapped limb. He understood why animals chew their own legs off. He had a recurring fantasy of being robbed, and putting up a struggle. If he were held up at gunpoint, he had decided, he would not cooperate.\nHe didn’t know what to think of Seana, yet. So he didn’t, at all.\nRed like rupture. Blood squirm, a coagulation of grubs across brown terrarium stones. The egg cases pulsed like clotted hearts, spilling strange new life. Bell stared through the glass. Each cage told the same story.\nThe grubs were a centimeter long. Even as small as they were, Bell could see the mouth parts working. Each grub identical. As far as he could see, the differences which had been so apparent from cage to cage in the adult form were now absent from the next generation. The grubs were all the same, as if a reset button had been pushed. It was only the adult form that seemed vulnerable to change. Bell opened his sack lunch. He took out his apple and sliced it into a dozen pieces. He dropped a slice into the first cage. The grubs responded immediately, moving toward the fruit. They swarmed it.\nBell fed the grubs first thing in the morning.\nHe decided to turn it into an experiment. He stole a sheet of sticky-labels from the staff room and stuck a label to the side of six different terrariums. On each label, he wrote a different word.\nThe grubs labeled fruit were fed fruit; the grubs labeled meat were fed sliced-meat. The grubs labeled control were fed a mixture of foods.\nThe grubs with the cool sticker on the side of their terrarium were fed the control diet—but were also placed in a refrigerator for an hour a day while Bell did his chores. An hour wasn’t long enough to kill them, but it was long enough to impact their physiology. They grew slower than the grubs in the other cages.\nIf these insects could really adapt to their environments, Bell was going to see how far he could push it.\nHe’d see if diet was the only pressure they responded to.\nThe grubs labeled heat were in a small glass aquarium placed on the floor near a space heater. Bell put his hands against the glass. It was hot to the touch. These grubs, too, seemed stressed by the temperature. But they still grew, doubling in size every week.\nThe grubs labeled carrion were fed the occasional discarded rat from the golden eagle enclosure. These were the grubs Bell found most interesting. They borrowed into the dead rat and ate it from the inside out.\nCharles Darwin had believed in God until he studied the parasitic wasp Ibalia.\nDarwin wrote in a journal: “There seems to me too much misery in the world. I cannot persuade myself that a beneficent and omnipotent God would have designedly created wasps with the express intention of their feeding within the living bodies of caterpillars.” Darwin found particularly gruesome that the Ibalia grub only gradually consumed the living tissues of its host—taking a full three years to complete its meal, saving the vital organs until last as if to extend the host’s suffering. Darwin couldn’t imagine a God who would create something like that.\nBell could imagine it.\nHe thought of the reset mechanism. He imagined a single insect species with multiple phenotypes already encoded in its genome—a catalog of different possible adult forms. And all it took was a trigger to set the creature down its path.\n“Maybe it’s like blind cave fish,” he told Seana one evening.\nHe watched Seana’s face as she peered through the glass.\n“Cave fish have most of the genes for eyes still carried in their DNA,” he said. “All the genes required for lenses, and retinas and eyelids, all the genes except for the one crucial ingredient that starts eye development in the first place. If you cross-breed two different populations of blind fish, sometimes you get fish with eyes.”\n“That doesn’t make sense,” Seana said.\n“It does if the blindness is recessive, and the two populations are blind for different reasons.”\n“But you said these things aren’t breeding.”\nBell ignored her, lost in thought. “Or they’re like stem cells,” he continued, “each carrying the genes for multiple tissue types, multiple potentials, but they specialize as they mature, choosing a path.”\nHe leaned forward, tapping his finger on the glass.\n“Where do you think they come from?” Seana asked.\n“The fruit maybe. The bananas. Central America. I’m not sure.”\n“Why can’t you find it in books?”\n“There are millions of insect species still un-described by science. Besides, maybe it has been described. Some version of it. I mean, how would you really know?”\nLater, searching for reasons to avoid going home, Bell ran down his closing checklist twice.\nOn his second round, he found the outer door to the lemur tunnel wide open.\nHe had locked it himself. Checked it himself.\nHis inner alarm went off.\nZookeepers developed inner alarms, or they developed scars.\nHe stepped through the door, and let his eyes adjust to the dark, to the long, mildewy tunnel which ran under the moat, to the lemur island.\nAt the end of the tunnel, bright light, because the door at the island end was open, too.\nIn the middle, a silhouette. Who . . . ?\n“Hey!” Bell shouted.\nSeveral silhouettes. Sharp, jabbering shadows. Five or six lemurs hopped and shrieked.\nThe shadow in the middle wound up like a pitcher and threw something.\nA yelp. The lemurs howled and ran.\n“Cole?” called Bell, starting down the tunnel.\nOne lemur didn’t run. It whirled in confusion, chattering.\nBell’s eyes had adjusted. The shadow grew details. Cole.\nCole, with a handful of smooth, white landscaping stones, eyes wide with rage.\n“What the fuck are you doing?” Bell shouted.\n“They threw shit at me. They threw their fucking shit.”\n“Jesus Christ—!” Bell yelled, lurching forward.\nCole turned, arm pistoning in the dark.\nThe stone whistled past Bell’s ear and struck hard against the outer door. The tunnel echoed.\nBell froze.\nCole stepped toward him. “You watch how you talk to me,” he said, and for a moment they stared at each other, waiting to see what would happen. Then Cole’s eyes changed—the rage blown out of them like a gust of wind. Cole brushed past him and was gone.\nThe lemur groped its way back into the light, back to the island.\nBell unfroze, closed up, and said nothing. He’d have to say something, wouldn’t he? Something would have to be done. Right?\nHe made a mental note. In the future, he wouldn’t let crazy people into his life. He meant it.\nMetamorphosis is magic. Darwin had known this, too.\nSometimes it is a dark magic.\nThe metamorphosis of a tadpole into a frog. A grub into a wasp. A friend into an enemy.\nBell watched the grubs feed. By now they’d grown huge. Some approached five inches in length, blood red, large beyond all reason. Soon they would spin their papery cocoons. Turn into whatever they would turn into.\nBell pondered the advantage of such an adaptive mechanism. Perhaps it was a way to guard against overspecialization, a reservoir of adaptive capacity. Evolution is a slow process, and when new challenges arise, populations take time to react. There is a lag in the modifying response; species that don’t change fast enough die out.\nBell knew of several kinds of island lizard that reproduced parthenogenetically. Such species, when found, were always marginal, isolated, at risk of extinction; they were aberrations outside the main thrust of evolution. Most were doomed over the long run, because sexual reproduction is a much better way to create the next generation. In sexual reproduction, genes mix and match, new phenotypes arise, gene frequencies shift like tides. Sexual reproduction drops new cards in the deck from one generation to the next.\nParthenogenetic species, on the other hand, are locked-in, frozen in time, playing the same card over and over.\nBut not the insects in the back room.\nThe insects in the back room seemed to have a whole deck from which to deal, parthenogenetic or not. Such insects could adapt quickly, shifting morphotypes in a single generation. And then shift back the next. It was the next logical step—not just evolution, but the evolution of evolution. But how was it possible?\nBell thought of Cole, of what made men like him. That old argument, nature vs. nurture. In another time, in another place, Cole would have fit in. In another time, maybe Cole would have been a different person entirely.\nThe descendants of Vikings and Mongols today wore suits and ran multinational corporations. Were veterinarians, or plumbers, or holy men. Perhaps tomorrow, or a thousand years from now, they’ll need to be Vikings and Mongols again.\nPopulations change. Needs change. Optimums change. And it all changes faster than selection can track.\nFrom a biological perspective, it would be easy to produce the same kind of people again and again. Stable people. Good people. Again and again, generation after generation—a one to one correlation between gene-set and expression.\nBut that’s not what you find when you look at humans.\nInstead there is a plasticity in human nature. A carefully calibrated susceptibility to trauma.\nWhat looks like a weak point in our species is in fact design.\nBecause the truth is that certain childhoods are supposed to fuck you up.\nIt is an adaptive response. Wired into us.\nThe ones who couldn’t adapt died out. Those gene sets which always produced the same kind of people—stable people, good people—no matter the environment, no matter the violence, or the aggression they faced—those gene sets which always played the same card, again and again—\n—died out.\nLeaving behind the ones who could metamorphose.\nWe were not so different from these bugs.\nBell unloaded all this on Seana one day during lunch. They sat across from each other, sipping soft drinks. “The evolution of evolution?”\n“Yeah,” he said.\n“Why would this happen in insects?” she asked.\n“Because they’ve been here longest,” he said. But it was more than that. He thought of the ants and their aphids. The enzyme that clipped their wings. He thought of the different ways that insects solved their problems. “Because insects always choose the biological solution.”\nBell avoided Cole for days.\nHe told himself he was waiting for a good time to see the director, to tell her what had happened in the lemur tunnel. Told himself he wasn’t afraid that Cole would retaliate by telling about drinking together on zoo time, zoo property. Both were lies, but what he had the toughest time with was pure simple fear of Cole.\n“Ridiculous,” he told himself. “You’re a grown man and a professional.”\nOn the other hand, Cole obviously was dangerous.\nMaybe he could get Cole to leave, to resign his service contract without anyone having to tell the director anything.\nThis seemed, on reflection, to be the best bet for an outcome where he, Bell, kept his job and got rid of the problem.\nThe reflection took place at home, on the sofa, in front of the TV, in his underwear.\nWhen Lin crossed the room, he saw himself through her eyes. He looked like a bum.\nShe was thinking, he knew, what an asshole he was for buying beer.\nHe didn’t care.\nNeither did she, it seemed.\nShe sat down on the couch beside him.\nWhat was he? When had he turned into a person who said nothing, did nothing? What had he let himself turn into?\nThe next day, Bell followed Cole down to the supply shed and said “We’re going to have a talk.”\nCole took a set of eight-foot pruning shears down from the wall rack, and turned to face Bell.\n“Yeah,” he said.\nBell fumbled for a beginning, forgetting what he’d rehearsed.\nCole leaned on the pruning shears as if they were a wizard’s staff.\n“I have to turn you in,” Bell said.\n“For what?”\n“Throwing rocks at the animals.”\nCole stared at him. His grip on the shears tightened. “I lose my temper sometimes. I have a temper, I admit.”\n“That’s why you can’t be here.”\n“Listen, I’ll work on it. I’ll be better.”\nCole shook his head. “I’m just letting you know as a courtesy. I have to report it.”\n“You don’t have to do anything.”\n“The other choice is that you leave today and don’t come back.”\n“That’s not any choice at all.”\n“There are other places you can do your service.”\n“I like it here.”\n“Here doesn’t like you anymore.”\n“You know what I don’t like? I don’t think I like you trying to push me around.”\n“Today is your last day here, one way or the other,” Bell said. “You can leave on your own, or you can be ushered out.”\n“You really don’t want to do that.”\n“You’re right, I don’t,” Bell said.\nCole’s face changed. “I’m warning you.”\nBell raised his walky-talky, never taking his eyes off Cole. “Garland,” he spoke into the handset. There was a squelch, then a voice, “Yeah.”\n“You better come to the supply shed.”\n“What’s wrong?”\n“Now, Garland.”\nCole shoved Bell into the wall. Shoved him hard, so his teeth clacked.\nAnd the rage was there again in the cutting torch eyes. Rage like nothing else mattered. Scarred hands curled into Bell’s shirt.\n“This is your last chance,” Cole said.\nBell only smiled, feeling something shift inside him. He found suddenly that he was through being scared. “Fuck you,” he said.\nBell ducked the first blow, but the second caught him upside the head, splitting his brow open. Bell spun away, throwing an elbow that missed, and then they were both off balance, taking wild swings, and Cole grabbed at him, and they were falling. They hit the ground and rolled, wrestling for on the filthy floor. Cole came up on top, sitting on Bell’s legs. “I fucking warned you,” he hissed, and then he rained down punches until Garland tackled him.\nAfter that, it was two on one, and Bell didn’t feel the least bit guilty about that.\nThe zoo super interviewed Bell for her report. They sat in her office. Behind her, against the wall, her fish swam their little circles. The superintendent leaned forward and laced her hands together on her desk.\nShe didn’t dig very deep. Seemed to think Cole's behavior was its own explanation. “I think you need stitches,” she said.\nBell nodded. He touched his brow. His first zoo scar.\n“He’ll be barred from the zoo, of course,” she said. “And I’ll insist that his community service hours be revoked.”\n“What’s going to happen to him now?”\n“Charges probably.”\n“I don’t want to press charges.”\n“Animal cruelty. The lemurs. He’s going back to jail.” She paused, then added, “When they find him.”\nBell looked at the fish, swimming in the aquarium. “He said he’s never going back.”\nThat evening, as he was closing up, Bell found Cole’s parting gift. Found it revealed, at first, in the presence of a door ajar.\nThe back room of the castle.\nBell stared at what had been done.\nAfter the fight, Cole had climbed to his feet, wiped the blood from his face—and then walked off. Heading toward the gates. Even two on one, the fight had been about even, and when Cole had finally stepped back and walked away, Bell and Gavin let him go. A draw. They’d assumed Cole left zoo property. But he hadn’t left.\nHe’d circled back around to the castle.\nAnd he’d poured lye into each and every terrarium.\nSeveral grubs were on the cement floor, ground into pulp with a boot.\nOthers were desiccated husks. Only a few still moved, writhing in the white powder. Bell stepped further into the room, surveying the carnage. He should have known. He should have known this was coming.\nBell’s inner alarm started bothering him on his way home that night.\nOnce a zookeeper developed an inner alarm, it worked everywhere.\nIn this case, it was less an alarm than a sense of something out of place. It got stronger as he closed in on the trailer park. At first he thought the alarm had something to do with Cole, but when he got home, he understood. The universe had an interesting sense of timing.\nLin was gone.\nNot like gone to the store. Gone, left. Leaving him.\nShe left a note about it. The note explained. Blamed him.\nDistantly, he heard himself curse.\nAll Bell could think, at first, was that she didn’t seem to have taken anything. Like there was nothing about their life worth bothering with. She had written the whole thing off, it seemed. Him. Their life. A total loss.\nHe made some growling noises.\nShe might be back. She might change her mind.\nThe stereo, after all, was really hers. She’d had it before they moved in together, and they’d never been able to afford a new one.\nSomberly, he unplugged the stereo. In something like a trance, he planted it in the sink and turned on the water. Like a zombie, he let the water run and started searching the trailer for enough change to buy beer.\nThe next month passed in a haze.\nWord filtered down, as word always did, and it turned out Cole had skipped town. The cops were still looking.\nNot many of the grubs had survived Cole’s attack. The ones that did were scarred. Cole had been very thorough, even pouring lye in the terrarium on the floor. In all, only a handful of the grubs finished their cocoons. A few from the control cage. A few from the terrarium marked “heat” next to the space heater. But they were twisted things, these cocoons. Damaged things. His experiment was ruined. His hope was that he’d be able to get at least a few reproducing adults, start over. If the cocoons hatched at all.\nAnd word had filtered down, too, that it would be bad for Cole when he was caught, because the list of charges had grown, and the warrant had sprouted teeth. Cole was facing time, real time, for what had happened. Bell knew Cole would need someone to blame.\nHe would blame Bell, and he would blame the zoo.\nSeveral weeks later, Bell pulled into the parking lot and found there were fire trucks already in the lot. Hoses ran upward along the hill. Black smoke curled into the sky. Bell ran. He knew what he’d see before he saw it. The castle was engulfed in flame. The firefighters fought the blaze, but Bell knew it was too late. He imagined the animals inside baking. He imagined the sizzle and pop of burst skin, the soundless cries of dying snakes and lizards and frogs and bugs. He imagined his insects burning alive.\nHe looked around, searching for Cole, wondering if he’d stayed long enough to watch it burn.\nWhen the fire was out, Bell walked through the ruins. The devastation was complete. Dead frogs and snakes and lizards. In the back room, he found the terrariums blackened and cracked. The insects inside charred and unrecognizable.\nExcept for one. The terrarium on the floor.\nThe terrarium with the heat sticker, now curled and blackened.\nThe cocoon was charred, split wide by the heat of the fire.\nThere was no grub inside.\nThey found Cole’s body later that day in the weeds behind the parking lot. Bell watched them load the body into the ambulance. Dark and swollen. It had been a bad death.\nThere were burns, minor, across his hands, like he’d come too close to his creation.\nBurns and something else.\nSomething like stings.\nEyes swollen shut, anaphylactic shock.\nNot everything burned in the fire.\nNot all that burns is consumed. Cole had said that once.\nBell stood there for a long time, listening. Listening for a buzz like an electric light, but there was no sound. Only the sound of wind in the trees.\nIt was long gone, whatever it was. He just wished he could have seen what the grub had turned into. Next year it would be different.\nNext year it would be a fruit eater, or a wasp, or a beetle. It would be what it needed to be.\nIt would be what the world made it.\nApproaching home, Bell felt his inner alarm stir again.\nThe cable had been turned off.\nThose cocksuckers didn’t know who they were dealing with. Bell had gotten drunk two nights in a row now, and he was feeling mean, feeling predatory.\nHe stalked outside, nine trailers down to the cable box, opened it up with a hex wrench, and hooked his cable back up.\nWent home and surfed channels for anything resembling porn.\nAfter two hours of this, his thumb hurt and the battery on the remote died.\nHe heard the screen door open.\nLin?\nIn the moment before the inner door opened, it occurred to him that her stereo was still soaking in the kitchen sink. He had a momentary, fearful impulse; his leg jerked. Then the beer kicked back in. He slouched back. He sneered like a sleepy lion.\nA shape in a doorway.\nSeana.\nHis sneer disappeared.\nShe stepped inside and said nothing. Looked at him a moment, as if reading him. Slouched down beside him with a sack of takeout chicken.\nHis hand, heavy and lazy, rested on her leg.\nShe tugged his hand higher.\nThey didn’t talk. Even the TV flashed in silence.\nOutside the thin walls, the world licked itself and made hunting noises.\nOriginally published in Asimov’s Science Fiction, October-November 2009.\nTed Kosmatka set his sights early on being a writer. This mostly involved having all his writing rejected, pursuing a biology degree, dropping out before graduation, and becoming a steelworker like his father and grandfather. Then the mill went bankrupt. At one point, he worked in a zoo. Now he works in video games, and his latest novel, The Flicker Men, came out last summer.\nMichael Poore's work has appeared in numerous magazines, including Glimmer Train, AGNI, and Asimov's Science Fiction. His novel, Up Jumps the Devil, hailed by the New York Review of Books as \"an elegiac masterpiece,\" is available from HarperCollins. His story \"The Street of the House of the Sun,\" originally published in The Pinch, was reprinted in The Best American Nonrequired Reading 2012.", "source": "https://clarkesworldmagazine.com/kosmatka_poore_02_16_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Blood Dauber by Ted Kosmatka and Michael Poore"}