{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Ken Liu", "hostname": "clarkesworldmagazine.com", "date": "2010-08-05", "categories": "", "tags": "", "fingerprint": "P4xA5Hydc1bqXThglRbTeIXWZEc=", "id": null, "license": null, "comments": "", "raw_text": "5540 words, short story  Tying Knots   (In ancient times, there was no writing. When people needed to make a contract or pact, they tied a big knot on a string for a big matter, a small knot for a small matter. The number of knots depended on the quantity under contract. That was sufficient to provide a record.)  — (Jiujiayi, a Chinese philosophy text on the study of the I Ching, probably composed during the Eastern Han Dynasty, 25-220 AD)  Sky Village:  The spirits like to play jokes on us. I have seen more in my lifetime than any Nan in recorded history, and yet I am also the most shortsighted, practically blind.  Five years ago, when two Burmese traders climbed up the mountain for their annual trading trip, their hair dripping with water from the hard hike up through the clouds, they brought a stranger with them.  The stranger was unlike anyone I had ever met, and there was no record of anyone like him in our archive of ropes. He was tall, taller than my nephew Kai by two feet, and Kai was the tallest man in the village. His face was pale, florid and ruddy, like a statue of an arhat with a painted face. He also had blue eyes and golden hair, and a nose so sharp and stuck so far out of his face that it was like a bird’s beak.  Pha, one of the traders, told us that the stranger’s name was To-mu. “He’s from far away.”  “As far away as Rangoon?” I asked.  “Much, much farther. He is from America. Headman Soe-bo, that is so far away that you cannot imagine. Not even a hawk flying nonstop for twenty days can reach it.”  That was probably an exaggeration, as Pha liked to tell tall tales. But To-mu spoke to Pha in a harsh, staccato language that held a kind of music I had never heard, so he was certainly from no place I knew of.  “What is he doing here?”  “Who knows? I don’t understand anything he does. Westerners are all strange, and I have met many. But he is even odder than most. He walked into Man-sam two days ago, carrying that pack on his back, which seems to hold everything he owns. He asked me and Aung to bring him to places no Westerner had been to. He offered us a lot of money. So we said we’d take him to Sky Village. Maybe he’s running and hiding from an opium lord.”  Pha would do anything for money, even incurring the wrath of a general with opium fields. Sometimes we sell the rice for money too, to save up for a lean year when we might not have enough rice to trade. But we don’t pine after it the way Pha does.  If To-mu was trying to hide from an opium lord, then we wanted nothing to do with him. I had to watch him carefully, and make sure he left with the traders.  But To-mu did not act like a man on the run. He was loud and rude, and smiled at everyone and everything. He was always asking one villager or another to stand still while he held up a small metal box to his eyes and made clicking noises with it. He walked around and examined our huts, the narrow terrace fields, the wildflowers and weeds, and even the children shitting in the bushes. Pha translated for him as he asked the stupidest questions: What did we call this animal? What was the name of that flower? What foods did we eat? What crops and vegetables did we grow? To-mu was like a child, and did not know the most basic facts. He acted like he had never seen people.  He sought out Luk, the medicine man, and waved a stack of money at him.  “He wants you to tell him about sicknesses and how you treat them,” Pha said.  The traders sometimes asked Luk for tips like this too, so this was not such a strange request as To-mu’s other questions. Luk shrugged away the money, and patiently walked around with To-mu, pointing at herbs and insects and explaining their uses. To-mu held up his metal box and clicked at everything, and wrote in a notebook, as he collected the herbs and insects and stored them away in small clear bags he took out of his backpack.  We Nan have lived on this mountain for thousands of years. The oldest books passed down in the village—copied and reknotted with fresh hemp rope every few generations—tell the origin of our people. Long ago, our ancestors lived many days to the north, in a small Chinese kingdom. A war came, and invaders on horses tore through the rice fields, burning down our houses. The brave Elder San-pu led the survivors on a desperate run until we could no longer hear the horses’ hoofbeats, and we kept on walking for another moon. We climbed onto this mountain, and made our home above the clouds. We do not bother the world, and the world, for the most part, leaves us alone.  I say “for the most part” because every year, a few traders make their way up the mountain and bring us medicine, iron tools, silk and cotton cloth, and spices from far away. In exchange, they want one thing: our rice. The large, smooth grains, unlike anything the Burmese villages at the foot of the mountain grow, are hawked by the traders as “sky rice” in the markets.  They tell their customers that sky rice is fed with the pure essence of clouds and grows in air. When I heard this, I explained to the traders that the rice comes from the terrace fields on the mountainside, and we water it by irrigation ditches, no different from how our ancestors used to do and no different from the villages below. But the traders laugh. The buyers like our story better. They are willing to pay more because of our idea. You can never trust traders to tell the truth.  The rice harvest had not been good for a few years. It did not rain as much as it used to, and the springs that flowed down from the peak of the mountain slowed down to a trickle in the summer. Young men with keen eyes said that they thought the snowy peaks far to the west were losing their white hair, like old men going bald. Families were now eating a lot more wild vegetables and the children helped by hunting birds and treeshrews. But even these sources of food seemed to be in decline.  I had consulted the records of rainfall and harvest for past centuries, and a drought such as this had never been recorded. Could something in the world below the mountain be causing all of this?  I asked the traders for their thoughts.  They shrugged. “We hear the weather has turned strange everywhere, drought up north in China and cyclones down south in the Irrawaddy. Who knows why? It is just the way it is.”  I offered to have To-mu and the traders stay with me for the night, before their long climb down the mountain the next day. Pha and Aung always had good stories to share of the world below, and To-mu seemed a man full of interesting tales too.  I served them the last of my rice with sweet bamboo shoots and pickled ginger. To-mu smacked his lips and praised my cooking. I laughed, embarrassed. After the meal, we sat around the fire drinking rice wine and chatting.  I asked To-mu what he did. He sat quietly for a bit, scratched his head, laughed, and then said a long string of words to Pha. Pha seemed puzzled. He shrugged, and said to me, “He says he studies sicknesses and invents proteins—I guess that’s a kind of medicine—to treat them. It’s very confusing though. He says he doesn’t see any sick people or make medicine. He just comes up with ideas.”  So he was a healer, of sorts. That was certainly an honorable calling, and I had respect for anyone who wanted to heal others, no matter how strange he was.  I asked To-mu if he wanted to hear some of the old medicine books of the Nan. Even Luk, skilled as he was, couldn’t hold all knowledge in his head. He often consulted the old medicine books when he encountered a disease he hadn’t seen. There is much wisdom passed onto us from our ancestors, some of it bought with the lives of brave men who ventured past the line between medicine and poison.  To-mu nodded after Pha translated my offer. I got up, and retrieved the knotted clumps of the medical books. Stretching out the rope, I ran my finger down the line, and read out the symptoms and cure recipes.  But instead of listening to Pha’s translation, To-mu was staring at the knotted books, his eyes wider than teacups. He interrupted Pha and jabbered at him. I could tell he was extremely excited.  “He’s never seen knot-writing before,” Pha said. “He wants to understand how you do what you do.”  The traders have seen the Nan knotting for years, and grown used to it. I have also seen them record their purchases and inventory with markings on paper—Tibetan, Chinese, Burmese, Naga—different traders use different scripts. As different as they look though, the ink markings always seem to me dead, flat, ugly. The Nan do not write. We knot.  Knots have allowed us to keep alive the wisdom and voices of our ancestors. A long hemp rope, supple and elastic, is stretched and twisted to give it the right amount of tension and coil. Thirty-one different kinds of knots can be made on the rope, corresponding to the shapes of the lips and the tongue in making different syllables. Strung together like Buddhist prayer beads, the knots form words, sentences, stories. Speech is given substance and form. Run the hand down the string, and you can feel the knotters’ thoughts in your fingers and hear their voices through your bones.  The knotted string does not stay straight. The knots put tension on the rope. It coils in on itself, twisting, bending, yearning towards a shape. A book of knots is not a straight line, but more like a compact statue. Different knots give you different shapes in the coiled-up rope, and at a glance you can see the flow and contour of the argument, the tangible rise and fall of rhythm and rhyme.  I was born with bad eyesight. I can only see clearly a few feet away, and my head aches if I strain my eyes for too long. But my fingers have always been nimble, and even as a child my father said I was a quick learner of the properties of different ropes and knots. I had a talent for seeing in my mind the way the knots would change the tension on the rope, the way the little forces pulled and pushed it into its final form. Every Nan can knot, but only I have the eye for seeing the final shape of the rope before even a single knot has been made.  I began as a copyist, taking the oldest knotted books that were fraying and falling apart, feeling and memorizing the sequence of knots, and then recreating them with fresh hemp rope so that every knot, every twist would be faithfully reproduced, until the rope coiled in on itself, an exact replica of the original, so that the village’s children and their children would also be able to feel and learn from the voices of the past.  And later, after I became Headman and the record keeper after my father’s death, I knotted my own ropes. I knotted practical things, like the prices charged by the traders from year to year so that we wouldn’t be cheated, the new uses for old herbs discovered by the medicine men, the weather patterns and planting times. I also knotted other things, just because I liked the way the knotted ropes looked after I was done. I knotted the songs of the young men singing to the girls they liked, the feel of fresh spring sunlight on my face after the dark winter, the flickering shadows of the Nan dancing by the bonfire at the Spring Festival.  Route 128, Greater Boston:  It took a year of begging, expensive lawyers, bribes—excuse me, extraordinary processing fees—and even getting back in touch with acquaintances I hadn’t spoken to since college who now work at the State Department to get Soe-bo the right travel documents.  He doesn’t have a birth certificate? No last name? Does he grow opium for the warlords up there? Do you know anything about this guy? I gotta tell you, Tom, I’m pulling in a lot of favors for your native witch doctor. This better be worth it.  It is amazing how a few pieces of paper can generate so many headaches. Made me wish that it was still Victorian times, and I could just bring a “native” from the jungle back home without dealing with a thousand bureaucrats in two governments who didn’t much like each other.  “That is a very long journey,” Soe-bo had said, when I tried to convince him to come back with me on my second trip to Sky Village. “Too far for me.”  The Nan had no interest in money. I knew that it would be useless to promise him rich rewards.  “If you come with me, you can help heal many people.”  “I’m no healer.”  “I know that. But that knot-writing thing you do . . . You can help a lot of people. I can’t explain it. You have to trust me.”  He was moved, but still uncertain. Then I played my trump card, something I knew was on his mind, the only thing he might want.  “Your rice crops are dying because of the drought,” I said. “I can help you get new rice that will thrive with less water. But you have to come with me, and then I’ll give you new seeds.”  Soe-bo was not as terrified of the airplane as I had expected. He was such a small man to begin with, but huddled in his seat, his movements cautious and slow, he seemed even more like a child. He was calm though. I think the bus to Yangon shocked him a lot more. After sitting in one metal box that moved on its own to get you from one place to another, I guess a box that flew wasn’t much stranger.  As soon as I settled him into the studio suite at the hotel next to the GACT Labs campus, he fell asleep. He didn’t use the bed; instead, he curled up on the tile floor in the kitchen. Closer to the hearth, I suppose, an instinctual urge that I had read about in old anthropology books.  “Can you knot the rope so that it ends up in this shape?” I pointed to a small model sculpted out of clay. It looked vaguely like the head of a dragon. The Burmese college kid we were using as a translator shook his head—this whole set up must have seemed crazy to him; heck, it seemed crazy to me—but he translated my question.  Soe-bo picked up the model, turning it this way and that. “It doesn’t say anything. The knots will be nonsense.”  “It doesn’t matter. I just want you to make it so that the rope folds up naturally into this shape.”  He nodded, and began to twist and knot the rope. As the rope coiled in on itself, he compared the result to the model, pulled the rope straight and let it coil back again. He shook his head, and untied some knots and retied new ones.  In the lab, five different cameras were recording his progress, and on the other side of the one-way mirror, a dozen scientists leaned in to watch the tiny man and the zoomed-in image of his nimble fingers.  “How do you do it?” I asked.  “My father taught me, as his father had taught him. Knot-writing is passed down to us from our ancestors. I’ve pulled apart and retied a thousand books. I feel in my bones how the rope wants to tie itself.”  Proteins are long chains of amino acids strung together, their sequence dictated by genes in living cells. The amino acids, knotty with their hydrophobic and hydrophilic side chains and differing charges, pull and push at each other, forming local secondary structures like alpha helices and beta sheets through hydrogen bonds. The long chain of the protein is an unstable, writhing, jiggling mass agitated by millions of minuscule force vectors until it “folds,” coils in on itself to minimize the total energy in the entire chain, and thus settles into its tertiary structure. That final, stable, native state gives a protein its characteristic shape, a tiny three-dimensional clump, a modernist sculpture.  A protein’s shape is what gives it its function. The “proper folding” of a protein depends on many things: temperature, solvent, chaperone molecules to help things along. When proteins fail to fold into their characteristic shapes, you get diseases like mad-cow prions, Alzheimer’s, cystic fibrosis. But with the right-shaped proteins, you get drugs that can stop the uncontrollable division of cancer cells, block the cellular pathways needed for HIV to replicate, and cure all kinds of difficult diseases.  But predicting the native state of a sequence of amino acids (or, the converse, designing a sequence of amino acids that will fold into the desired protein shape) is harder than particle physics. A brute-force simulation of all the forces acting on the atoms in even a short chain of amino acids and a search through the free energy landscape will bring the most powerful computer to its knees. And proteins are composed of hundreds of amino acids, sometimes thousands.  If we can find an accurate, fast algorithm to predict and fold a sequence of amino acids into its native state, medicine will have taken the largest stride since the discovery of antibiotics. It will save countless lives—and be very profitable.  Once in a while, when Soe-bo seemed tired from the work, I would take him on an excursion into Boston. I looked forward to these excursions myself. My globe-trotting had made me into something of an amateur anthropologist, and I liked to observe the reactions of those outside of our world to the things we took for granted. It was fascinating to see the world through Soe-bo’s eyes, and to discover what shocked him or didn’t.  He accepted the skyscrapers as attributes of the landscape, but he was frightened by escalators. He took the cars and highways and crowds of people of all colors towering over him in stride, but he could not get over his amazement with ice cream. He was lactose intolerant, but he would endure the stomach aches for the pleasure of two scoops. He avoided dogs, even when they were on leashes, but he enjoyed feeding the ducks and pigeons in the Common.  Next, we moved to simulations on computers. Soe-bo could not learn to use a mouse effectively, and the screen tired his eyes. So we had to rig up a 3-D simulation system, complete with gloves, goggles, and adequate tactile feedback.  Now he was no longer working with his familiar knots. We had to see if his ability to predict the final shape of the chain was just the result of rote memorization of rigid folk traditions, or if the techniques could be generalized and mapped into a new domain.  Through a video feed from his goggles, we observed him manipulating the models of amino acids floating in air, learning their properties when placed next to each other. He jiggled the chains, pulled some strands apart, pushed some strands together, tucked in the side chains. To him, it was just playing a strange game.  But he did not have much success. The amino acids were too different from his knots, and he could not solve even the simplest puzzles.  The Board grew impatient and skeptical. “You really think this illiterate Asian peasant is going to provide a breakthrough? If this fails and it gets out in the papers, investors wouldn’t touch us with a ten-foot pole.”  I had to bring up, yet again, my track record of mining pre-industrial peoples for medical knowledge. Within the mess of old wives’ tales and superstitions, there often lay hidden kernels of real expertise that could be discovered and exploited for real gains. Hadn’t our bestselling drug been first extracted from those orchids used by the Taeoc Indians in Brazil? They ought to have a little faith in my instincts.  But I was worried.  For our next excursion, I took him to the Sackler Museum at Harvard, where they had a collection of ancient Asian art. I understood vaguely that the Nan had migrated to where they were from somewhere up north in China during the Bronze Age. I thought he might be interested in seeing the old earthenware and bronze ritual vessels from people connected to his ancestors.  The museum had few visitors, and we wandered through it quietly. A large, three-legged, roundish bronze pot in a glass case caught Soe-bo’s attention, and he shuffled closer. I followed.  The vessel, called a ding, was etched with Chinese characters and decorative patterns composed of animal motifs, but there was something else, an even finer pattern of thin lines that covered the smoother parts. I read the little placard at the bottom of the case:  “The Chinese wrapped bronze vessels in silk and other fine cloth for storage. Over the centuries, the pattern of warp and weft in the wrapping would be left in the patina, long after the cloth has rotted away. Our knowledge of ancient Chinese weaving comes almost entirely from such traces.”  I asked the translator to read this to Soe-bo. Soe-bo nodded and pressed his face up against the glass to get a closer look. A museum guard walked towards us, but I waved him away. “It’s all right. He has bad eyes.”  “Thank you,” Soe-bo said afterwards. “They did not write with their threads, so the patterns were not intelligible. But I followed them closely, and I could hear their voices, though but faintly. A chance to hear such ancient wisdom, even if I could not understand it, is a great gift.”  During our next session, Soe-bo managed to fold a reasonably complex chain. It was as if he had gained some extra insight, and suddenly things clicked for him. We repeated the experiment with a few more complex chains, and he solved them even faster.  I think he was even happier than I was.  “What changed?”  “I don’t know how to explain it,” he said. “In my knot-writing, knots very far from each other do not influence each other, but that is not true in your game. Hearing the voices left on the Chinese bronze helped me. The weaving pattern is made by one thread knotting back on itself over and over. But once woven into a net, a knot’s tension can be felt in all directions, even by far away knots. That made me see how I had to think about this game, and change what I knew about knot-writing to make the patterns fit. The ancient voices did have much to teach me, but I had to know how to listen.”  I was fine with mystical mumbo-jumbo, as long as it worked.  We played back his sessions on the computer, abstracting out his movements, inferring his decisions, systemizing his trials, compiling it all into an algorithm. This was not trivial, and it required a great deal of creativity and hard work to refine Soe-bo’s instincts into explicit instructions. But having Soe-bo’s movements as guide lights through the dark sea of infinite possibilities made the effort possible.  I resisted the urge to say to the Board “I told you so.”  Soe-bo reminded me that I had yet to fulfill my promise. We had been working together for months, and I was so absorbed in the progress we were making that I had forgotten. I was embarrassed.  I called up Chris, who had been at grad school with me, working in the same lab. He was now at Enadyne Agro, which had a reputation for good varieties of genetically modified rice.  I explained what I wanted: drought- and altitude-tolerant, does well in acidic soils, high yield, and preferably resistant to common Southeast Asian pests.  “I have a few varieties that might work,” Chris said. “But they are expensive. And we don’t usually like to sell seeds to a place like Myanmar. Besides the political risk, there’s no respect for intellectual property in much of Asia. I don’t want to see the whole country growing our rice without paying. You know the police and courts are useless, and hiring thugs to enforce patents against peasants doesn’t play well on the evening news.”  I asked Chris for this favor, and promised to help with the lessons on intellectual property.  “We might have to implement a technical solution for the problem of unauthorized seeds,” he added.  The Nan need the rice, I thought. The world is changing around them, and they need help.  I accompanied Soe-bo on his trip home and helped him carry the bags of rice seeds up the mountain. It must have been an amusing sight: the little Asian explorer coming home ahead on the trail, and me lumbering after under my load, a strange sort of Sherpa.  Sky Village:  It took me a long time to knot down the records of my trip to America, and the amazing sights I saw there. They now fill a whole shelf, and children come to me every night for more stories.  A trip like that makes you see how much a man does not understand. I thought I knew much before I left, because I had read more of the rope-books in this room than anyone in the village, but now I know better.  The rice seeds given to us by To-mu in exchange for my going to America grew like magic. The first year’s harvest was bigger than anyone remembered. The rice didn’t taste as good as the old rice, but we had so much more of it. We celebrated with a great festival, and everyone, even the children, got drunk. It felt good to have done this, to have brought in new seeds, new hope from outside that would fill everyone’s bellies again.  Before the next planting season, To-mu came again with Pha and Aung, carrying his heavy backpack as always. Even though we had not known each other that long, I thought of him as an old friend, familiar since childhood, because I had learned so much since I first met him.  But he seemed uncomfortable, agitated. “I came,” he said, “to sell you more seeds.”  “Oh, we do not need more seeds.” I’d learned to accept that To-mu could be very knowledgeable about some things, but had little common sense. “We saved plenty of seeds from last year’s harvest.”  To-mu looked away from me. “The seeds you saved will not work. They are sterile.”  Pha did not know how to translate this word, and To-mu had to try again. “The seeds will not grow. They are dead. You have to buy new ones.”  I had never heard of such a thing. How could seeds grow into rice stalks that will not yield more seeds?  To-mu explained that there are small bits of twisted-up string in every living thing, including the seeds and including us, called genes, which determine how that thing grows and how it will look. The genes are strung together from little clumps that form a language that can be read.  “Like the Nan knots,” I said. He nodded.  When someone invents a new gene, a string of new words, and puts it in a seed, that seed may have qualities that people like. The words make the seeds valuable. But the words are owned by the inventor, and other people have to pay him if they want to grow the seed. To make sure that people pay, To-mu explained, the inventor sometimes has to put in more words in that will prevent the seed from growing new seeds. So people have to pay every year.  “If you tried to grow seeds with that gene without the inventor’s permission, you would be stealing from him,” To-mu said. “It’s just like if you walked into the inventor’s house and took a bowl of rice away from him. The sterile genes are added to help people stay honest.”  This made no sense. If I take someone’s bowl of rice, that’s stealing because that person doesn’t have the bowl of rice any more. But if someone teaches me a new word with power, I haven’t taken that word away from him. He still has it.  I tried to understand this better. “We have to pay to use these words that you say are knotted up inside the rice seeds.” He nodded.  To-mu had told me that watching me tying knots in his game helped him. “So if you learn the words from our books, the wisdom from our knot-writing, do you have to pay us every year too?”  To-mu laughed and scratched his head. I thought he seemed nervous. “No, I don’t think so. The things I learn from you are . . . old. Not protected, not by copyright or patent.” More words that Pha could not translate, and I didn’t want him to bother asking To-mu to explain. If I learned more words from To-mu, I might have to pay for them too. I understood enough to know that To-mu thought what the Nan could teach him was of no value.  I had been a fool. I thought I was doing something to help the village, but To-mu’s part of the bargain came with strings tied to it. All I did was to put us into debt with a remote lord, a lord to whom we must pay an annual tribute. I had brought Sky Village as low as the peasants bonded to the opium lords.  There was nothing to be done. So we sold more rice to the traders to get money, which we used to buy the seeds from To-mu.  “The price will go up a bit next year, and the next,” he said. “I had to beg my friend to give you a discount for the first few years. You might want to think about how to expand the village’s economy so you’ll be able to afford the seeds and buy better things. Like medicine and ice cream.”  Pha said that some of To-mu’s words made sense. The world was changing, and the Nan should change too. Some of the young men could go down the mountain to work, and Pha knew of opportunities for pretty young girls in the cities, especially if they were willing to go as far as Thailand.  I knotted a book about my conversation with To-mu. Maybe it will serve as a warning for the future, so that others will not be as shortsighted and stupid as I was.  We tried to grow some of our old rice alongside the new rice the next few years, but the old rice withered since it needed lots of water, and we had to save most of the little water we had for the new rice. People gave up. I think about the little genes twisted up inside those old seeds, the words passed down to us from our ancestors, now forgotten and gathering dust in storage sacks. Will those seeds even grow in the future, if the rain ever comes back?  To-mu has not been back since that second year. A different man now comes before each planting season to sell us seeds.  Route 128, Greater Boston:  The algorithm based on Soe-bo’s techniques performed well, far better than anything in the published literature. The paper describing my research is out for peer review, now that the lawyers are done with the patent applications.  If things work out right, this may be every bit the breakthrough I was hoping for. My algorithm will speed up drug discovery by orders of magnitude and save many lives.  I haven’t had time to focus on the revenue impact this will have on us, but the CFO’s presentation to the Board was very well received. The ten-year profit projections from direct discovery and licensing looked like an exponential curve.  Maybe it’s time for another discovery trip. I’m thinking Bhutan.  Author’s Note: the idea of tapping human pattern-recognition and spatial reasoning skills to aid the search for effective algorithms for protein-folding is described by Seth Cooper et al. in “Predicting protein structures with a multiplayer online game,” Nature 466, 756-760 (5 August 2010).  Some features of the knot-writing system of the Nan are modeled on the Hangul script as well as Incan quipus and Chinese folk art knotting. Ken Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.  Prior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.  Liu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.  He lives with his family near Boston, Massachusetts.", "text": "5540 words, short story\nTying Knots\n(In ancient times, there was no writing. When people needed to make a contract or pact, they tied a big knot on a string for a big matter, a small knot for a small matter. The number of knots depended on the quantity under contract. That was sufficient to provide a record.)\n— (Jiujiayi, a Chinese philosophy text on the study of the I Ching, probably composed during the Eastern Han Dynasty, 25-220 AD)\nSky Village:\nThe spirits like to play jokes on us. I have seen more in my lifetime than any Nan in recorded history, and yet I am also the most shortsighted, practically blind.\nFive years ago, when two Burmese traders climbed up the mountain for their annual trading trip, their hair dripping with water from the hard hike up through the clouds, they brought a stranger with them.\nThe stranger was unlike anyone I had ever met, and there was no record of anyone like him in our archive of ropes. He was tall, taller than my nephew Kai by two feet, and Kai was the tallest man in the village. His face was pale, florid and ruddy, like a statue of an arhat with a painted face. He also had blue eyes and golden hair, and a nose so sharp and stuck so far out of his face that it was like a bird’s beak.\nPha, one of the traders, told us that the stranger’s name was To-mu. “He’s from far away.”\n“As far away as Rangoon?” I asked.\n“Much, much farther. He is from America. Headman Soe-bo, that is so far away that you cannot imagine. Not even a hawk flying nonstop for twenty days can reach it.”\nThat was probably an exaggeration, as Pha liked to tell tall tales. But To-mu spoke to Pha in a harsh, staccato language that held a kind of music I had never heard, so he was certainly from no place I knew of.\n“What is he doing here?”\n“Who knows? I don’t understand anything he does. Westerners are all strange, and I have met many. But he is even odder than most. He walked into Man-sam two days ago, carrying that pack on his back, which seems to hold everything he owns. He asked me and Aung to bring him to places no Westerner had been to. He offered us a lot of money. So we said we’d take him to Sky Village. Maybe he’s running and hiding from an opium lord.”\nPha would do anything for money, even incurring the wrath of a general with opium fields. Sometimes we sell the rice for money too, to save up for a lean year when we might not have enough rice to trade. But we don’t pine after it the way Pha does.\nIf To-mu was trying to hide from an opium lord, then we wanted nothing to do with him. I had to watch him carefully, and make sure he left with the traders.\nBut To-mu did not act like a man on the run. He was loud and rude, and smiled at everyone and everything. He was always asking one villager or another to stand still while he held up a small metal box to his eyes and made clicking noises with it. He walked around and examined our huts, the narrow terrace fields, the wildflowers and weeds, and even the children shitting in the bushes. Pha translated for him as he asked the stupidest questions: What did we call this animal? What was the name of that flower? What foods did we eat? What crops and vegetables did we grow? To-mu was like a child, and did not know the most basic facts. He acted like he had never seen people.\nHe sought out Luk, the medicine man, and waved a stack of money at him.\n“He wants you to tell him about sicknesses and how you treat them,” Pha said.\nThe traders sometimes asked Luk for tips like this too, so this was not such a strange request as To-mu’s other questions. Luk shrugged away the money, and patiently walked around with To-mu, pointing at herbs and insects and explaining their uses. To-mu held up his metal box and clicked at everything, and wrote in a notebook, as he collected the herbs and insects and stored them away in small clear bags he took out of his backpack.\nWe Nan have lived on this mountain for thousands of years. The oldest books passed down in the village—copied and reknotted with fresh hemp rope every few generations—tell the origin of our people. Long ago, our ancestors lived many days to the north, in a small Chinese kingdom. A war came, and invaders on horses tore through the rice fields, burning down our houses. The brave Elder San-pu led the survivors on a desperate run until we could no longer hear the horses’ hoofbeats, and we kept on walking for another moon. We climbed onto this mountain, and made our home above the clouds. We do not bother the world, and the world, for the most part, leaves us alone.\nI say “for the most part” because every year, a few traders make their way up the mountain and bring us medicine, iron tools, silk and cotton cloth, and spices from far away. In exchange, they want one thing: our rice. The large, smooth grains, unlike anything the Burmese villages at the foot of the mountain grow, are hawked by the traders as “sky rice” in the markets.\nThey tell their customers that sky rice is fed with the pure essence of clouds and grows in air. When I heard this, I explained to the traders that the rice comes from the terrace fields on the mountainside, and we water it by irrigation ditches, no different from how our ancestors used to do and no different from the villages below. But the traders laugh. The buyers like our story better. They are willing to pay more because of our idea. You can never trust traders to tell the truth.\nThe rice harvest had not been good for a few years. It did not rain as much as it used to, and the springs that flowed down from the peak of the mountain slowed down to a trickle in the summer. Young men with keen eyes said that they thought the snowy peaks far to the west were losing their white hair, like old men going bald. Families were now eating a lot more wild vegetables and the children helped by hunting birds and treeshrews. But even these sources of food seemed to be in decline.\nI had consulted the records of rainfall and harvest for past centuries, and a drought such as this had never been recorded. Could something in the world below the mountain be causing all of this?\nI asked the traders for their thoughts.\nThey shrugged. “We hear the weather has turned strange everywhere, drought up north in China and cyclones down south in the Irrawaddy. Who knows why? It is just the way it is.”\nI offered to have To-mu and the traders stay with me for the night, before their long climb down the mountain the next day. Pha and Aung always had good stories to share of the world below, and To-mu seemed a man full of interesting tales too.\nI served them the last of my rice with sweet bamboo shoots and pickled ginger. To-mu smacked his lips and praised my cooking. I laughed, embarrassed. After the meal, we sat around the fire drinking rice wine and chatting.\nI asked To-mu what he did. He sat quietly for a bit, scratched his head, laughed, and then said a long string of words to Pha. Pha seemed puzzled. He shrugged, and said to me, “He says he studies sicknesses and invents proteins—I guess that’s a kind of medicine—to treat them. It’s very confusing though. He says he doesn’t see any sick people or make medicine. He just comes up with ideas.”\nSo he was a healer, of sorts. That was certainly an honorable calling, and I had respect for anyone who wanted to heal others, no matter how strange he was.\nI asked To-mu if he wanted to hear some of the old medicine books of the Nan. Even Luk, skilled as he was, couldn’t hold all knowledge in his head. He often consulted the old medicine books when he encountered a disease he hadn’t seen. There is much wisdom passed onto us from our ancestors, some of it bought with the lives of brave men who ventured past the line between medicine and poison.\nTo-mu nodded after Pha translated my offer. I got up, and retrieved the knotted clumps of the medical books. Stretching out the rope, I ran my finger down the line, and read out the symptoms and cure recipes.\nBut instead of listening to Pha’s translation, To-mu was staring at the knotted books, his eyes wider than teacups. He interrupted Pha and jabbered at him. I could tell he was extremely excited.\n“He’s never seen knot-writing before,” Pha said. “He wants to understand how you do what you do.”\nThe traders have seen the Nan knotting for years, and grown used to it. I have also seen them record their purchases and inventory with markings on paper—Tibetan, Chinese, Burmese, Naga—different traders use different scripts. As different as they look though, the ink markings always seem to me dead, flat, ugly. The Nan do not write. We knot.\nKnots have allowed us to keep alive the wisdom and voices of our ancestors. A long hemp rope, supple and elastic, is stretched and twisted to give it the right amount of tension and coil. Thirty-one different kinds of knots can be made on the rope, corresponding to the shapes of the lips and the tongue in making different syllables. Strung together like Buddhist prayer beads, the knots form words, sentences, stories. Speech is given substance and form. Run the hand down the string, and you can feel the knotters’ thoughts in your fingers and hear their voices through your bones.\nThe knotted string does not stay straight. The knots put tension on the rope. It coils in on itself, twisting, bending, yearning towards a shape. A book of knots is not a straight line, but more like a compact statue. Different knots give you different shapes in the coiled-up rope, and at a glance you can see the flow and contour of the argument, the tangible rise and fall of rhythm and rhyme.\nI was born with bad eyesight. I can only see clearly a few feet away, and my head aches if I strain my eyes for too long. But my fingers have always been nimble, and even as a child my father said I was a quick learner of the properties of different ropes and knots. I had a talent for seeing in my mind the way the knots would change the tension on the rope, the way the little forces pulled and pushed it into its final form. Every Nan can knot, but only I have the eye for seeing the final shape of the rope before even a single knot has been made.\nI began as a copyist, taking the oldest knotted books that were fraying and falling apart, feeling and memorizing the sequence of knots, and then recreating them with fresh hemp rope so that every knot, every twist would be faithfully reproduced, until the rope coiled in on itself, an exact replica of the original, so that the village’s children and their children would also be able to feel and learn from the voices of the past.\nAnd later, after I became Headman and the record keeper after my father’s death, I knotted my own ropes. I knotted practical things, like the prices charged by the traders from year to year so that we wouldn’t be cheated, the new uses for old herbs discovered by the medicine men, the weather patterns and planting times. I also knotted other things, just because I liked the way the knotted ropes looked after I was done. I knotted the songs of the young men singing to the girls they liked, the feel of fresh spring sunlight on my face after the dark winter, the flickering shadows of the Nan dancing by the bonfire at the Spring Festival.\nRoute 128, Greater Boston:\nIt took a year of begging, expensive lawyers, bribes—excuse me, extraordinary processing fees—and even getting back in touch with acquaintances I hadn’t spoken to since college who now work at the State Department to get Soe-bo the right travel documents.\nHe doesn’t have a birth certificate? No last name? Does he grow opium for the warlords up there? Do you know anything about this guy? I gotta tell you, Tom, I’m pulling in a lot of favors for your native witch doctor. This better be worth it.\nIt is amazing how a few pieces of paper can generate so many headaches. Made me wish that it was still Victorian times, and I could just bring a “native” from the jungle back home without dealing with a thousand bureaucrats in two governments who didn’t much like each other.\n“That is a very long journey,” Soe-bo had said, when I tried to convince him to come back with me on my second trip to Sky Village. “Too far for me.”\nThe Nan had no interest in money. I knew that it would be useless to promise him rich rewards.\n“If you come with me, you can help heal many people.”\n“I’m no healer.”\n“I know that. But that knot-writing thing you do . . . You can help a lot of people. I can’t explain it. You have to trust me.”\nHe was moved, but still uncertain. Then I played my trump card, something I knew was on his mind, the only thing he might want.\n“Your rice crops are dying because of the drought,” I said. “I can help you get new rice that will thrive with less water. But you have to come with me, and then I’ll give you new seeds.”\nSoe-bo was not as terrified of the airplane as I had expected. He was such a small man to begin with, but huddled in his seat, his movements cautious and slow, he seemed even more like a child. He was calm though. I think the bus to Yangon shocked him a lot more. After sitting in one metal box that moved on its own to get you from one place to another, I guess a box that flew wasn’t much stranger.\nAs soon as I settled him into the studio suite at the hotel next to the GACT Labs campus, he fell asleep. He didn’t use the bed; instead, he curled up on the tile floor in the kitchen. Closer to the hearth, I suppose, an instinctual urge that I had read about in old anthropology books.\n“Can you knot the rope so that it ends up in this shape?” I pointed to a small model sculpted out of clay. It looked vaguely like the head of a dragon. The Burmese college kid we were using as a translator shook his head—this whole set up must have seemed crazy to him; heck, it seemed crazy to me—but he translated my question.\nSoe-bo picked up the model, turning it this way and that. “It doesn’t say anything. The knots will be nonsense.”\n“It doesn’t matter. I just want you to make it so that the rope folds up naturally into this shape.”\nHe nodded, and began to twist and knot the rope. As the rope coiled in on itself, he compared the result to the model, pulled the rope straight and let it coil back again. He shook his head, and untied some knots and retied new ones.\nIn the lab, five different cameras were recording his progress, and on the other side of the one-way mirror, a dozen scientists leaned in to watch the tiny man and the zoomed-in image of his nimble fingers.\n“How do you do it?” I asked.\n“My father taught me, as his father had taught him. Knot-writing is passed down to us from our ancestors. I’ve pulled apart and retied a thousand books. I feel in my bones how the rope wants to tie itself.”\nProteins are long chains of amino acids strung together, their sequence dictated by genes in living cells. The amino acids, knotty with their hydrophobic and hydrophilic side chains and differing charges, pull and push at each other, forming local secondary structures like alpha helices and beta sheets through hydrogen bonds. The long chain of the protein is an unstable, writhing, jiggling mass agitated by millions of minuscule force vectors until it “folds,” coils in on itself to minimize the total energy in the entire chain, and thus settles into its tertiary structure. That final, stable, native state gives a protein its characteristic shape, a tiny three-dimensional clump, a modernist sculpture.\nA protein’s shape is what gives it its function. The “proper folding” of a protein depends on many things: temperature, solvent, chaperone molecules to help things along. When proteins fail to fold into their characteristic shapes, you get diseases like mad-cow prions, Alzheimer’s, cystic fibrosis. But with the right-shaped proteins, you get drugs that can stop the uncontrollable division of cancer cells, block the cellular pathways needed for HIV to replicate, and cure all kinds of difficult diseases.\nBut predicting the native state of a sequence of amino acids (or, the converse, designing a sequence of amino acids that will fold into the desired protein shape) is harder than particle physics. A brute-force simulation of all the forces acting on the atoms in even a short chain of amino acids and a search through the free energy landscape will bring the most powerful computer to its knees. And proteins are composed of hundreds of amino acids, sometimes thousands.\nIf we can find an accurate, fast algorithm to predict and fold a sequence of amino acids into its native state, medicine will have taken the largest stride since the discovery of antibiotics. It will save countless lives—and be very profitable.\nOnce in a while, when Soe-bo seemed tired from the work, I would take him on an excursion into Boston. I looked forward to these excursions myself. My globe-trotting had made me into something of an amateur anthropologist, and I liked to observe the reactions of those outside of our world to the things we took for granted. It was fascinating to see the world through Soe-bo’s eyes, and to discover what shocked him or didn’t.\nHe accepted the skyscrapers as attributes of the landscape, but he was frightened by escalators. He took the cars and highways and crowds of people of all colors towering over him in stride, but he could not get over his amazement with ice cream. He was lactose intolerant, but he would endure the stomach aches for the pleasure of two scoops. He avoided dogs, even when they were on leashes, but he enjoyed feeding the ducks and pigeons in the Common.\nNext, we moved to simulations on computers. Soe-bo could not learn to use a mouse effectively, and the screen tired his eyes. So we had to rig up a 3-D simulation system, complete with gloves, goggles, and adequate tactile feedback.\nNow he was no longer working with his familiar knots. We had to see if his ability to predict the final shape of the chain was just the result of rote memorization of rigid folk traditions, or if the techniques could be generalized and mapped into a new domain.\nThrough a video feed from his goggles, we observed him manipulating the models of amino acids floating in air, learning their properties when placed next to each other. He jiggled the chains, pulled some strands apart, pushed some strands together, tucked in the side chains. To him, it was just playing a strange game.\nBut he did not have much success. The amino acids were too different from his knots, and he could not solve even the simplest puzzles.\nThe Board grew impatient and skeptical. “You really think this illiterate Asian peasant is going to provide a breakthrough? If this fails and it gets out in the papers, investors wouldn’t touch us with a ten-foot pole.”\nI had to bring up, yet again, my track record of mining pre-industrial peoples for medical knowledge. Within the mess of old wives’ tales and superstitions, there often lay hidden kernels of real expertise that could be discovered and exploited for real gains. Hadn’t our bestselling drug been first extracted from those orchids used by the Taeoc Indians in Brazil? They ought to have a little faith in my instincts.\nBut I was worried.\nFor our next excursion, I took him to the Sackler Museum at Harvard, where they had a collection of ancient Asian art. I understood vaguely that the Nan had migrated to where they were from somewhere up north in China during the Bronze Age. I thought he might be interested in seeing the old earthenware and bronze ritual vessels from people connected to his ancestors.\nThe museum had few visitors, and we wandered through it quietly. A large, three-legged, roundish bronze pot in a glass case caught Soe-bo’s attention, and he shuffled closer. I followed.\nThe vessel, called a ding, was etched with Chinese characters and decorative patterns composed of animal motifs, but there was something else, an even finer pattern of thin lines that covered the smoother parts. I read the little placard at the bottom of the case:\n“The Chinese wrapped bronze vessels in silk and other fine cloth for storage. Over the centuries, the pattern of warp and weft in the wrapping would be left in the patina, long after the cloth has rotted away. Our knowledge of ancient Chinese weaving comes almost entirely from such traces.”\nI asked the translator to read this to Soe-bo. Soe-bo nodded and pressed his face up against the glass to get a closer look. A museum guard walked towards us, but I waved him away. “It’s all right. He has bad eyes.”\n“Thank you,” Soe-bo said afterwards. “They did not write with their threads, so the patterns were not intelligible. But I followed them closely, and I could hear their voices, though but faintly. A chance to hear such ancient wisdom, even if I could not understand it, is a great gift.”\nDuring our next session, Soe-bo managed to fold a reasonably complex chain. It was as if he had gained some extra insight, and suddenly things clicked for him. We repeated the experiment with a few more complex chains, and he solved them even faster.\nI think he was even happier than I was.\n“What changed?”\n“I don’t know how to explain it,” he said. “In my knot-writing, knots very far from each other do not influence each other, but that is not true in your game. Hearing the voices left on the Chinese bronze helped me. The weaving pattern is made by one thread knotting back on itself over and over. But once woven into a net, a knot’s tension can be felt in all directions, even by far away knots. That made me see how I had to think about this game, and change what I knew about knot-writing to make the patterns fit. The ancient voices did have much to teach me, but I had to know how to listen.”\nI was fine with mystical mumbo-jumbo, as long as it worked.\nWe played back his sessions on the computer, abstracting out his movements, inferring his decisions, systemizing his trials, compiling it all into an algorithm. This was not trivial, and it required a great deal of creativity and hard work to refine Soe-bo’s instincts into explicit instructions. But having Soe-bo’s movements as guide lights through the dark sea of infinite possibilities made the effort possible.\nI resisted the urge to say to the Board “I told you so.”\nSoe-bo reminded me that I had yet to fulfill my promise. We had been working together for months, and I was so absorbed in the progress we were making that I had forgotten. I was embarrassed.\nI called up Chris, who had been at grad school with me, working in the same lab. He was now at Enadyne Agro, which had a reputation for good varieties of genetically modified rice.\nI explained what I wanted: drought- and altitude-tolerant, does well in acidic soils, high yield, and preferably resistant to common Southeast Asian pests.\n“I have a few varieties that might work,” Chris said. “But they are expensive. And we don’t usually like to sell seeds to a place like Myanmar. Besides the political risk, there’s no respect for intellectual property in much of Asia. I don’t want to see the whole country growing our rice without paying. You know the police and courts are useless, and hiring thugs to enforce patents against peasants doesn’t play well on the evening news.”\nI asked Chris for this favor, and promised to help with the lessons on intellectual property.\n“We might have to implement a technical solution for the problem of unauthorized seeds,” he added.\nThe Nan need the rice, I thought. The world is changing around them, and they need help.\nI accompanied Soe-bo on his trip home and helped him carry the bags of rice seeds up the mountain. It must have been an amusing sight: the little Asian explorer coming home ahead on the trail, and me lumbering after under my load, a strange sort of Sherpa.\nSky Village:\nIt took me a long time to knot down the records of my trip to America, and the amazing sights I saw there. They now fill a whole shelf, and children come to me every night for more stories.\nA trip like that makes you see how much a man does not understand. I thought I knew much before I left, because I had read more of the rope-books in this room than anyone in the village, but now I know better.\nThe rice seeds given to us by To-mu in exchange for my going to America grew like magic. The first year’s harvest was bigger than anyone remembered. The rice didn’t taste as good as the old rice, but we had so much more of it. We celebrated with a great festival, and everyone, even the children, got drunk. It felt good to have done this, to have brought in new seeds, new hope from outside that would fill everyone’s bellies again.\nBefore the next planting season, To-mu came again with Pha and Aung, carrying his heavy backpack as always. Even though we had not known each other that long, I thought of him as an old friend, familiar since childhood, because I had learned so much since I first met him.\nBut he seemed uncomfortable, agitated. “I came,” he said, “to sell you more seeds.”\n“Oh, we do not need more seeds.” I’d learned to accept that To-mu could be very knowledgeable about some things, but had little common sense. “We saved plenty of seeds from last year’s harvest.”\nTo-mu looked away from me. “The seeds you saved will not work. They are sterile.”\nPha did not know how to translate this word, and To-mu had to try again. “The seeds will not grow. They are dead. You have to buy new ones.”\nI had never heard of such a thing. How could seeds grow into rice stalks that will not yield more seeds?\nTo-mu explained that there are small bits of twisted-up string in every living thing, including the seeds and including us, called genes, which determine how that thing grows and how it will look. The genes are strung together from little clumps that form a language that can be read.\n“Like the Nan knots,” I said. He nodded.\nWhen someone invents a new gene, a string of new words, and puts it in a seed, that seed may have qualities that people like. The words make the seeds valuable. But the words are owned by the inventor, and other people have to pay him if they want to grow the seed. To make sure that people pay, To-mu explained, the inventor sometimes has to put in more words in that will prevent the seed from growing new seeds. So people have to pay every year.\n“If you tried to grow seeds with that gene without the inventor’s permission, you would be stealing from him,” To-mu said. “It’s just like if you walked into the inventor’s house and took a bowl of rice away from him. The sterile genes are added to help people stay honest.”\nThis made no sense. If I take someone’s bowl of rice, that’s stealing because that person doesn’t have the bowl of rice any more. But if someone teaches me a new word with power, I haven’t taken that word away from him. He still has it.\nI tried to understand this better. “We have to pay to use these words that you say are knotted up inside the rice seeds.” He nodded.\nTo-mu had told me that watching me tying knots in his game helped him. “So if you learn the words from our books, the wisdom from our knot-writing, do you have to pay us every year too?”\nTo-mu laughed and scratched his head. I thought he seemed nervous. “No, I don’t think so. The things I learn from you are . . . old. Not protected, not by copyright or patent.” More words that Pha could not translate, and I didn’t want him to bother asking To-mu to explain. If I learned more words from To-mu, I might have to pay for them too. I understood enough to know that To-mu thought what the Nan could teach him was of no value.\nI had been a fool. I thought I was doing something to help the village, but To-mu’s part of the bargain came with strings tied to it. All I did was to put us into debt with a remote lord, a lord to whom we must pay an annual tribute. I had brought Sky Village as low as the peasants bonded to the opium lords.\nThere was nothing to be done. So we sold more rice to the traders to get money, which we used to buy the seeds from To-mu.\n“The price will go up a bit next year, and the next,” he said. “I had to beg my friend to give you a discount for the first few years. You might want to think about how to expand the village’s economy so you’ll be able to afford the seeds and buy better things. Like medicine and ice cream.”\nPha said that some of To-mu’s words made sense. The world was changing, and the Nan should change too. Some of the young men could go down the mountain to work, and Pha knew of opportunities for pretty young girls in the cities, especially if they were willing to go as far as Thailand.\nI knotted a book about my conversation with To-mu. Maybe it will serve as a warning for the future, so that others will not be as shortsighted and stupid as I was.\nWe tried to grow some of our old rice alongside the new rice the next few years, but the old rice withered since it needed lots of water, and we had to save most of the little water we had for the new rice. People gave up. I think about the little genes twisted up inside those old seeds, the words passed down to us from our ancestors, now forgotten and gathering dust in storage sacks. Will those seeds even grow in the future, if the rain ever comes back?\nTo-mu has not been back since that second year. A different man now comes before each planting season to sell us seeds.\nRoute 128, Greater Boston:\nThe algorithm based on Soe-bo’s techniques performed well, far better than anything in the published literature. The paper describing my research is out for peer review, now that the lawyers are done with the patent applications.\nIf things work out right, this may be every bit the breakthrough I was hoping for. My algorithm will speed up drug discovery by orders of magnitude and save many lives.\nI haven’t had time to focus on the revenue impact this will have on us, but the CFO’s presentation to the Board was very well received. The ten-year profit projections from direct discovery and licensing looked like an exponential curve.\nMaybe it’s time for another discovery trip. I’m thinking Bhutan.\nAuthor’s Note: the idea of tapping human pattern-recognition and spatial reasoning skills to aid the search for effective algorithms for protein-folding is described by Seth Cooper et al. in “Predicting protein structures with a multiplayer online game,” Nature 466, 756-760 (5 August 2010).\nSome features of the knot-writing system of the Nan are modeled on the Hangul script as well as Incan quipus and Chinese folk art knotting.\nKen Liu is an American author of speculative fiction. A winner of the Nebula, Hugo, and World Fantasy awards, he wrote the Dandelion Dynasty, a silkpunk epic fantasy series (starting with The Grace of Kings), as well as short story collections The Paper Menagerie and Other Stories and The Hidden Girl and Other Stories. He also authored the Star Wars novel The Legends of Luke Skywalker.\nPrior to becoming a full-time writer, Liu worked as a software engineer, corporate lawyer, and litigation consultant. Liu frequently speaks at conferences and universities on a variety of topics, including futurism, cryptocurrency, history of technology, bookmaking, narrative futures, and the mathematics of origami.\nLiu is also the translator for Liu Cixin’s The Three-Body Problem, Hao Jingfang’s “Folding Beijing” and Vagabonds, Chen Qiufan’s Waste Tide, as well as the editor of Invisible Planets and Broken Stars, anthologies of contemporary Chinese science fiction.\nHe lives with his family near Boston, Massachusetts.", "source": "https://clarkesworldmagazine.com/liu_01_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Tying Knots by Ken Liu"}