{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "l6C7zUK1e/PQo6qY/XS89rwQrOM=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: What Do You Want?  “What do you want?”  That was the question asked by the representative of the Shadows in Babylon 5. The Shadows were an ancient race that followed the first principles of chaos through warfare, evolution through bloodshed, and perfection through victory. For a younger race to reach their full potential they must endure the chaos of pain, struggle, conflict, and war. The weak would perish. Only the strong may survive. In the show, those that answered this question were typically rewarded with what they desired, but would discover consequences worse than the gifts.  “What do you want?”  This is a question that editors are often asked by authors. As an editor, it sometimes feels like we’re perceived as the Shadows, particularly among those who practically spit when they call us gatekeepers. Writers send their babies to different magazines, anthologies, or publishers to open calls, which must seem a lot like the Shadow’s chaos of pain, struggle, conflict, and war. After all, there are only so many stories they can buy and only the editor’s perception of the strongest get accepted.  It isn’t really the same though. None of the editors I know believe in the broken wisdom that “an artist must suffer for their art.” Most would agree that it’s more of a “practice makes perfect” scenario. Keep learning, keep improving, and keep trying. Try not to be horrified when I tell you this . . . The first time I publish an author, I look back at all the stories they’ve previously submitted to us. This is more of a test for me. Did I miss something earlier? So far, no, but what I’ve noticed over time is that they all have something in common: they never stopped improving their craft.  That said, rejection is never pleasant and maintaining patience over that often long haul can be a challenge. It’s easy to fall into the trap of believing that the system is rigged against you and honestly, it’s completely possible that what you are currently writing isn’t the sort of story that appeals to an editor at one house or another. That’s why pushing outside your comfort zone can be extremely beneficial, even if only as an exercise. And yes, it’s sometimes viable to just shortcut the process by self-publishing. It comes with its own can of worms, but it’s a completely viable path for some.  There’s no one path to success.  On a related topic, we’re often asked about feedback. Our rejection letters are a short assortment of form letters. At best they tell you you were close--the two or three percent of all submissions that make up our near miss category--but they never tell you why you were rejected. Why? Quite simply, I don’t believe that a few minutes of my time will make or break the success of a story or have an impact on an author’s ability as a writer. Assume for a second that it would take five minutes to provide meaningful feedback. (In my experience, this is a ridiculously low estimate.) We receive an average of eleven hundred submissions each month and if you do the math, that comes out to over ninety-one hours of extra work per month. That’s a significant increase in workload for something I don’t believe will be particularly helpful. I would much rather make sure I leave room in my calendar to do it right. This includes accepting invitations to be a guest instructor at writing workshops, being on panels, judging writing competitions, and answering the many questions that come my way. In this way, I’m valuing quality over quantity.  If that’s not enough of a reason, another downside to personalized rejections would be a significant delay in our response time, which is not something we’re willing to sacrifice. Each story is a potential paycheck. The longer we take, the longer an author may wait to be paid. We aim to respond to submissions in a day or two. Between the pandemic and my ongoing medical issues, that’s been more of a challenge lately, but it’s still the goal. Most people appreciate the fast response, but a few complain. For them, I’ll simply point out that the difference between a three month response and a one day response is how long it was sitting in the slush pile before an editor read it. Eyeball time is pretty much the same no matter what.  But I’ve wandered.  “What do you want?”  As in Babylon 5, that’s a question that comes with some baggage when answered. Even if I was sitting here thinking “I’d like to see some more _______ stories” I wouldn’t say it out loud or write it down. Why? Because it would be a very short-lived phenomenon and I’d spend the next several months seeing take after take on that theme until I never wanted to see another one again. I don’t recommend trying to guess my answer to that question either. Trust me when I say that I don’t want the story you think I want. I get bored easily and my interests are a moving target. Even if you guessed correctly, it’s likely I’ve moved on by the time you did.  “What do you want?”  Ok. What I really want is the story you’re passionate about writing. Surprise me. Take me somewhere I wasn’t expecting. You know that feeling you have when you read something amazing and unexpected in a magazine or anthology? That’s the way it is for editors too. We just read A LOT more and sometimes that new concept you had isn’t quite as new as you thought. That’s one of the reasons I often encourage authors to consider volunteering as slush readers (not just here, anywhere).  In the end, the question should be “What do you want to write?”  The answer? Go do it. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: What Do You Want?\n“What do you want?”\nThat was the question asked by the representative of the Shadows in Babylon 5. The Shadows were an ancient race that followed the first principles of chaos through warfare, evolution through bloodshed, and perfection through victory. For a younger race to reach their full potential they must endure the chaos of pain, struggle, conflict, and war. The weak would perish. Only the strong may survive. In the show, those that answered this question were typically rewarded with what they desired, but would discover consequences worse than the gifts.\n“What do you want?”\nThis is a question that editors are often asked by authors. As an editor, it sometimes feels like we’re perceived as the Shadows, particularly among those who practically spit when they call us gatekeepers. Writers send their babies to different magazines, anthologies, or publishers to open calls, which must seem a lot like the Shadow’s chaos of pain, struggle, conflict, and war. After all, there are only so many stories they can buy and only the editor’s perception of the strongest get accepted.\nIt isn’t really the same though. None of the editors I know believe in the broken wisdom that “an artist must suffer for their art.” Most would agree that it’s more of a “practice makes perfect” scenario. Keep learning, keep improving, and keep trying. Try not to be horrified when I tell you this . . . The first time I publish an author, I look back at all the stories they’ve previously submitted to us. This is more of a test for me. Did I miss something earlier? So far, no, but what I’ve noticed over time is that they all have something in common: they never stopped improving their craft.\nThat said, rejection is never pleasant and maintaining patience over that often long haul can be a challenge. It’s easy to fall into the trap of believing that the system is rigged against you and honestly, it’s completely possible that what you are currently writing isn’t the sort of story that appeals to an editor at one house or another. That’s why pushing outside your comfort zone can be extremely beneficial, even if only as an exercise. And yes, it’s sometimes viable to just shortcut the process by self-publishing. It comes with its own can of worms, but it’s a completely viable path for some.\nThere’s no one path to success.\nOn a related topic, we’re often asked about feedback. Our rejection letters are a short assortment of form letters. At best they tell you you were close--the two or three percent of all submissions that make up our near miss category--but they never tell you why you were rejected. Why? Quite simply, I don’t believe that a few minutes of my time will make or break the success of a story or have an impact on an author’s ability as a writer. Assume for a second that it would take five minutes to provide meaningful feedback. (In my experience, this is a ridiculously low estimate.) We receive an average of eleven hundred submissions each month and if you do the math, that comes out to over ninety-one hours of extra work per month. That’s a significant increase in workload for something I don’t believe will be particularly helpful. I would much rather make sure I leave room in my calendar to do it right. This includes accepting invitations to be a guest instructor at writing workshops, being on panels, judging writing competitions, and answering the many questions that come my way. In this way, I’m valuing quality over quantity.\nIf that’s not enough of a reason, another downside to personalized rejections would be a significant delay in our response time, which is not something we’re willing to sacrifice. Each story is a potential paycheck. The longer we take, the longer an author may wait to be paid. We aim to respond to submissions in a day or two. Between the pandemic and my ongoing medical issues, that’s been more of a challenge lately, but it’s still the goal. Most people appreciate the fast response, but a few complain. For them, I’ll simply point out that the difference between a three month response and a one day response is how long it was sitting in the slush pile before an editor read it. Eyeball time is pretty much the same no matter what.\nBut I’ve wandered.\n“What do you want?”\nAs in Babylon 5, that’s a question that comes with some baggage when answered. Even if I was sitting here thinking “I’d like to see some more _______ stories” I wouldn’t say it out loud or write it down. Why? Because it would be a very short-lived phenomenon and I’d spend the next several months seeing take after take on that theme until I never wanted to see another one again. I don’t recommend trying to guess my answer to that question either. Trust me when I say that I don’t want the story you think I want. I get bored easily and my interests are a moving target. Even if you guessed correctly, it’s likely I’ve moved on by the time you did.\n“What do you want?”\nOk. What I really want is the story you’re passionate about writing. Surprise me. Take me somewhere I wasn’t expecting. You know that feeling you have when you read something amazing and unexpected in a magazine or anthology? That’s the way it is for editors too. We just read A LOT more and sometimes that new concept you had isn’t quite as new as you thought. That’s one of the reasons I often encourage authors to consider volunteering as slush readers (not just here, anywhere).\nIn the end, the question should be “What do you want to write?”\nThe answer? Go do it.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_06_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: What Do You Want? by Neil Clarke"}