{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "F0y4LeYpgka7i7JqqvQIluwDsD0=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Don't Let Go of the Future  It’s tempting to write a year-in-review editorial, but honestly, I don’t feel up to writing about life-threatening surgery, pandemics, deaths, or the host of other stressful elements that make up this past year’s highlights. It’s pervasive and exhausting. We’ve all been through enough and I understand now why previous pandemics have been more-or-less removed from our cultural memory.  The big thing is that we’re still here. You’re still reading. Authors are still writing and submitting stories. Our team is still working. It’s been a lot, but we’ve survived what’s been thrown at us and maybe learned a few things in the process. I know I have.  In last month’s editorial, I started talking about the future again for the first time in a while. In my previous careers, I noticed my discomfort with a job peaked if it shifted to maintenance mode, the state of just keeping things running. In trying to minimize stress, I thought a temporary maintenance mode would help. It didn’t. Trying new things is a source of joy for me and I need to be working towards them now more than ever.  The Spanish-language project I spoke of is just one element of many. The reaction that announcement received was primarily positive and energetic. Sure, there are a few people who see anything that widens the arms of the submissions pool as a threat, but I’ve never rejected a story because I don’t have room in inventory and that won’t be starting now. Keep in mind that the pool already includes work from a wide variety of authors from around the world.   It also occurs to me that it is important to focus on increasing subscriptions and re-evaluating our pricing scheme right now. Authors, artists, and staff deserve to be paid real rates and I haven’t been doing them (or myself) any favors by taking any changes off the table this year. I’ve seen a steady increase in new writers or artists submitting work (and others looking for jobs here) that state in their cover letters that they’ve been let go from their day jobs. If we can change our pay scales even a little, it’s meaningful.  I’ve also been working on a ground-up redesign of the website. Something a bit more modern and flexible for where the new road leads us. I have to say that getting back into programming, even at the web scripting level, has been a pleasant distraction lately. Some of our Patreon and ClarkesworldCitizen supporters have seen early previews of the new design and offered a few suggestions. I’m hoping to share a bit more in public in the near future. If there’s ever anything you wish we had on our website, this would be a good time to speak up.  It’s good to be back to this part of the job and that is a great way to end a no good, very bad year. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Don't Let Go of the Future\nIt’s tempting to write a year-in-review editorial, but honestly, I don’t feel up to writing about life-threatening surgery, pandemics, deaths, or the host of other stressful elements that make up this past year’s highlights. It’s pervasive and exhausting. We’ve all been through enough and I understand now why previous pandemics have been more-or-less removed from our cultural memory.\nThe big thing is that we’re still here. You’re still reading. Authors are still writing and submitting stories. Our team is still working. It’s been a lot, but we’ve survived what’s been thrown at us and maybe learned a few things in the process. I know I have.\nIn last month’s editorial, I started talking about the future again for the first time in a while. In my previous careers, I noticed my discomfort with a job peaked if it shifted to maintenance mode, the state of just keeping things running. In trying to minimize stress, I thought a temporary maintenance mode would help. It didn’t. Trying new things is a source of joy for me and I need to be working towards them now more than ever.\nThe Spanish-language project I spoke of is just one element of many. The reaction that announcement received was primarily positive and energetic. Sure, there are a few people who see anything that widens the arms of the submissions pool as a threat, but I’ve never rejected a story because I don’t have room in inventory and that won’t be starting now. Keep in mind that the pool already includes work from a wide variety of authors from around the world.\nIt also occurs to me that it is important to focus on increasing subscriptions and re-evaluating our pricing scheme right now. Authors, artists, and staff deserve to be paid real rates and I haven’t been doing them (or myself) any favors by taking any changes off the table this year. I’ve seen a steady increase in new writers or artists submitting work (and others looking for jobs here) that state in their cover letters that they’ve been let go from their day jobs. If we can change our pay scales even a little, it’s meaningful.\nI’ve also been working on a ground-up redesign of the website. Something a bit more modern and flexible for where the new road leads us. I have to say that getting back into programming, even at the web scripting level, has been a pleasant distraction lately. Some of our Patreon and ClarkesworldCitizen supporters have seen early previews of the new design and offered a few suggestions. I’m hoping to share a bit more in public in the near future. If there’s ever anything you wish we had on our website, this would be a good time to speak up.\nIt’s good to be back to this part of the job and that is a great way to end a no good, very bad year.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_12_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Don't Let Go of the Future by Neil Clarke"}