{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Cassandra Khaw", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "g/A+klV0cJewM6K03HeirVTg05M=", "id": null, "license": null, "comments": "", "raw_text": "3070 words, short story  When We Die on Mars  “You’re all going to die on Mars.” This is the first thing he tells us, voice plain, tone sterile. Commander Chien, we eventually learn, is a man not predisposed towards sentimentality.  We stand twelve abreast, six rows deep, bones easy, bodies whetted on a checklist of training regimes. Our answer, military-crisp, converges into a single noise: “Yessir!”  “If at any point before launch, you feel that you cannot commit to this mission: leave,” Commander Chien stalks our perimeter, gait impossibly supple even with the prosthetic left leg. He bears its presence like a medal, gilled and gleaming with wires, undisguised by fabric. “If at any point you feel like you might jeopardize your comrades: leave.”  Commander Chien enumerates clauses and conditions without variance in cadence, his face cold and impersonal as the flat of a bayonet. He goes on for minutes, for hours, for seconds, reciting a lexicon of possibilities, an astronautical doomsayer.  At the end of it, there is only silence, viscous, thick as want. No one walks out. We know why we are there, each and every last one of us: to make Mars habitable, hospitable, an asylum for our children so they won’t have to die choking on the poison of their inheritance.  Faith, however, is never easy.  It is amoebic, seasonal, vulnerable to circumstance. Faith sways, faith cracks. There are a thousand ways for it to die, to metamorphosize from yes to no, no, I could never.  Gerald and Godfrey go first, both blondes, family men with everything to lose and even more to gain. Gerald leaves after a call with his wife, a poltergeist in the night, clattering with stillborn ambition; Godfrey after witnessing the birth of his daughter third-hand.  We make him name her ‘Chance’ as a gentle joke, a nod to her significance. Because of her, he’ll grow old breathing love instead of red dust. She is his second chance, we laugh, and Godfrey smiles through the salt in his gaze.  “When we die on Mars,” I say, as I nestle my hand in the continent of his palm, my heart breaking. “Tell her a fairy tale of our lives. Tell her about how twelve people fought a planet so that billions could live.”  His lips twitch. “I will.”  He leaves in the morning before any of us wake, his bunk so immaculately made that you would have doubted he was ever there at all.  Five months pass. Ten. Fifteen.  Our lives are ascetic, governed by schedules unerring as the sun’s rotation. When we are not honing our trade, we are adopting new ones, exchanging knowledge like cosmic relics under a sky of black metal. Halogen-lit, our existence in the bunker is not unpleasant, only cold, both in fact and in metaphor. Nothing will ever inoculate us against Mars’ climate, but we can be taught to endure.  Similarly, chemicals can only do so much to quiet the heart, to beguile it into believing that this is okay, this will be okay. The years on Mars will erode our passion for galaxies, will flense us of wonder, sparing only the longing for affection. When that happens, we must be prepared, must keep strong as loneliness tautens like a noose around the throat.  The understanding of that eventuality weighs hard.  A pair of Thai women, sisters in bearing and intellect if not in blood, depart in the second year. They’re followed by an Englishman, rose-cheeked and inexplicably rotund despite fastidious exercise; a willowy boy with deep, memory-bruised eyes; a girl whose real name we never learn, but who sings us to dreaming each night; a mother, a father, a child, a person.  One by one, our group thins, until all that remains is twelve; the last, the best, the most desperate Earth has to give.  “Your turn, Anna. Would you rather give a blowjob to a syphilis-riddled dead billionaire, or eat a kilogram of maggot-infested testicles?”  “Jesus, man!” Hannah, a pretty Latina with double PhDs in astrophysics and aeronautical engineering, shrieks her glee. “What is wrong with that head of yours?”  “Nothing!” Randy counters, oil slick smooth. “The medical degree’s the problem! Look at enough dead bodies, and everything stops being taboo. I—”  I interrupt, a coy smile slotted in place. “Maggot-infested testicles. Easy.”  Both Hannah and Randy guffaw.  “You know syphilis got a cure, right? Why’d you gotta—”  “They’re not so bad when you deep-fry them with maple syrup and crushed nuts. Pinch of paprika, dash of star anise. Mmm.” It is a fabrication, stitched together from memories of a smoldering New Penang, but I won’t tell them that. They deserve this happiness, this harmless grotesquerie, small as it might be.  Hannah jabs a finger in her open mouth, makes a retching noise so absurd that Randy dissolves into laughter. This time, I join in, letting the joy sink down, sink deep, catch its teeth on all the hurt snagged between my ribs and drag it all back out. The sound feels good in my lungs, feels clean.  A door dilates. Pressurized air hisses out, and Hotaru’s silhouette pours in. Of the twelve of us, she’s the oldest, a Japanese woman bordering on frail, skin latticed by wrinkles and wartime scars, nose broken so many times that it’s just flesh now, shapeless, portentous. When she speaks, everyone listens.  “Everything alright in here?” Her accent rolls, musical and mostly upper-class English save for the way it latches on the ‘r’s and pulls them stiff.  “Yeah.” Randy, long and elegant as his battered old violin, glides out of his seat and stretches. “We’re just waiting for Hannah here to check the back-up flight system. Ground control said they found some discrepancies and—”  “You suddenly the medic and the engineer, Randy?” Hannah cranes both eyebrows upwards, mouth pinching with mock displeasure. “You want to fly the ship? I’ll go sit in the infirmary, if you like. Check out your supply of druuuuuugs.”  Randy doesn’t quite rise to the bait, only snorts, a grin plucking at the seams of his mouth. He throttles his amusement in an exaggerated cough, and I look away, smiling into the glow of my screen.  Hotaru seems less taken with the exchange, small hands locking behind her back. She waits until we’ve lapsed into a natural quiet before she speaks again, every word enunciated with a schoolmaster’s care.  “If everything is in order, I’ll tell Commander Chien that we are prepared to leave.” Hotaru’s eyes patrol the room, find our gazes one by one. After three years together, it takes no effort at all to read the question buried between each syllable.  “Sounds good,” Hannah says, even though the affirmation husks her voice. Her fingers climb to an old-fashioned locket atop her breastbone.  Randy drapes a hand over her shoulder. “Same here.”  “Here too,” I reply, and try not to linger too long on the ache that tendrils through my chest, a cancer blooming in the dark of artery and tendon. Familial guilt is sometimes heavier than the weight of a rotting world.  Hotaru nods. Like the commander, she will not waste breath on niceties, an efficiency of character I’m learning too well. When your lifespan can be valued in handfuls, every expenditure of time becomes cause for careful evaluation, every act of companionship a hair’s width from squander.  “I’ll send word then. I imagine we’ll have about forty-eight hours to make final preparations,” Hotaru pads to the door. She turns at the last instant, skims a look over the precipice of a shoulder and for a moment, I see the woman beneath the skin of legend, stooped from memory and so very tired, a mirror of a mother I’d not seen for decades. “Don’t waste them.”  “Anna, you awake?”  I yawn into a palm and roll on my side, blink into the phosphor-edged penumbra. “I don’t know. Is Malik snoring?”  Hannah whispers a gauzy, sympathetic laugh. She props herself on an elbow, face barely visible, a landscape of thoughtful lines.  “What’s up?”  A flash of teeth. She doesn’t answer immediately. Instead, she loops a curl about a finger, winds it tight. I wait. There’s no rushing Hannah. Under the street-sharpened exterior, she’s nervy as an alley cat, quick to flee, to hide behind laughter and slight-of-speech.  “Do you think the radio signal is any good in Mars?”  I shrug. “Not sure if it matters. With the communication delay, we’re—”  “—talking about response times of between four to twenty-four minutes. I know, tia. I know,” Hannah’s voice ebbs. She winds upright, legs crossed, eyes fixed on a place nothing but regret can reach.  An almost-silence; Malik’s snoring moving into labored diminuendo.  “Not sure if I ever told ya, but I got a daughter somewhere.” Hannah breathes out, every word shrapnel. “Was sixteen when I had her. Way too young. The babydaddy skipped out in the first trimester. He left so fast, you could see dust trails.”  A whine of strained laughter, dangerously close to grief, before she hacks it short, swallowing it like a gobbet of bad news.  “My parents wanted me to abort. Said it was for the best. ‘Hannah,’ they told me. ‘This world don’t have no God to judge you for choosing reason over guilt.’ I refused. I don’t even remember why. It’s been that long. All I remember was that I wanted to give her a chance out there.”  “Did your parents object?” I slink from my bed, cross the ten feet between us to close an arm about her shoulders, press a kiss into the hollow of her cheek. An old sadness reassembles inside me, a thought embedded in biology, not rationality. It’s been years since I’ve spoken to my family. Isn’t it time, asks a voice that is almost mine, for you to forgive them?  Hannah nestles into me and my body bends in reply, curling until we’re fitted jigsaw-snug, twins in the womb. “Nah. They weren’t that sort. Once I made it clear that it was what I wanted, they went in hundred-and-fifty percent.”  I stroke her hair, a storm of dark coils smelling of eucalyptus and mint, a scent that won’t keep on Mars.  “They put me into home-schooling, rubbed my feet. Did everything they could to make it easier for me. Nine months later, I had a beautiful little girl. She was perfect, Anna. Ten tiny little toes, cat-gold eyes, hair so soft it was like cotton candy.”  “No fingers?”  Hannah pounds knuckles against my sternum. “Very funny.”  I trail my fingers over the back of her hand and she lets her fist open, palm warm as we lock grips. “Then what happened?”  “We put her up for adoption.”  “And?”  “That was it.”  The lie throbs in the air, waiting absolution, release.  “I wish…” Hannah begins, careful, almost too soft to hear, her pulse narrowing. “I wish, sometimes, that I didn’t. I mean, kids were never part of my grand plan. But now that we’re going? I wonder.”  “You could try to call her?”  “How? My parents are dead. I don’t know even where to start. It’s fine, though,” Hannah extracts herself from my arms, pulls her knees close to her chest. There’s a new fierceness in her voice, edged both ways, daring me to pry, daring herself to open up. “They told me she went to a good home, a great home. That was all I wanted to know then. That’s all I need to know now. But.”  “Yeah,” I don’t touch her. Not all places are intended for company. Some agonies you chart alone, walking the length of them until you’ve domesticated every contour and twinge.  Hannah nods, a jerky little motion, the only one she allows herself. We say nothing, finding instead a noiselessness to share. It is many long minutes before she tips herself backwards and pillows her head on my lap, an arm looping about my hips.  “Stay with me, tia?” Hannah asks and briefly, vividly, I glimpse the sister I’d long excised from daily thought.  “Only if I get a backrub in the morning,” I reply, distractedly, drawing circles across her shoulder blades. In my head, a line from a Todd Kern song palpitates on repeat: you can always go home. It could be so easy, so simple. Forgive. Forget.  A tremor undulates through the column of her spine. Laughter or sobs, I can’t tell which. “Deal.”  “You did what now?” Randy’s voice quivers an octave above normalcy, one bad joke away from earnest hysterics.  “I mooned my sister’s ex-husband.”  “Why?”  The shrug in Tuma’s rich tenor is almost palpable, like muscles striving under skin. It is also anomalous, out-of-place in a young biologist better remembered for his ponderance than his sense of irreverence. “Why not?”  As expected, Randy cracks up, his laughter melodious, a thing I wish I could scoop into a Petri dish and let grow. I can imagine him in another life, a bluesman with a thimble of whiskey and a room full of worshippers, his eyes alive with their love.  I shake my head, return my attention to the spreadsheets of numbers imprinted in green on my terminal, calculations congregating thick as nebulas. In the corner, a notification pulsates. I ignore it.  “Hi.”  We look up as one, fingers retracting from keyboards, faces from screens, to see Stefan’s hound-dog frame limned in the doorway, a duffel balanced on one slim shoulder.  “Productive trip?” Tuma asks, swinging around in his chair.  Stefan nods, dislodging his luggage into a pile atop the floor before he drops into an open seat, his face unburdened of ghosts. Not all of them, but enough. “Yeah.”  “Your brother finally see the light?” Randy quips, a remark that earns him a fusillade of dirty looks.  “Not exactly. He still thinks we’re going against God’s will.” His eyes shine, illuminated by something sweet. “But he wishes us well. He’s happy for me.”  “Despite going against God’s will?”  Stefan heaves a shrug, mouth curved with secrets, all of them good. “Despite going against God’s will.”  No one presses for data. Three years teaches you a lot about what a person will allow. From time to time, however, someone makes an excuse to rise, to graze past Stefan and brush fingertips against shoulder or arm, as though contact is enough to transmit a monk’s benedictions from brothers to stranger.  On my screen, the icon continues to flash, demanding acknowledgment. Footsteps, like rainfall on metallic tiling. The weight of Randy’s arm settles about my shoulders, a barrier against the past.  “You not going to answer that?”  “No.” I exhale, hard.  “Why not?”  Because love doesn’t grant the right to forgiveness. “Same reason as I said last time.”  “You could do like Tuma.”  “I’d rather not.”  “And why’s that?”  “Because screen-capture technology exists,” I shoot, hoping that my voice doesn’t shake too much, hoping that humor might deflect his curiosity.  And it does. His laugh ricochets through the chamber again, warm, warm, warm. People tilt sly glances over their shoulders. Hannah punches Tuma in the arm, who only chuckles in return, his eyes lidded with delight. When he, with uncharacteristic brazenness, begins expounding on the virtues of his posterior, Randy’s laughter becomes epidemic, bouncing from throat to throat. If the sound is a little raw, a little ragged, no one comments. In twelve hours, we give up this planet entirely.  I push from my seat as the sound climbs into a frenzy, and use the diversion to slip out.  In the distance, Hannah’s voice, low and thick with aching, echoes, riding that knife-edge between rapture and hurt.  “Henrietta? That’s what they’re calling you?”  “After my maternal grandmother.” A tinny voice, distorted by poor equipment, accent Mid-Western. “Well. You know what I mean.”  “Grade school must have been an arena then, chica.”  “You have no idea.”  I walk into the sleeping hall to see Hannah backlit by a Macbook, its display holding the face of a younger woman, not much older than her teens. Henrietta is paler than her mother, her hair artificially lightened, but she shares the same structural elegance, the same bones.  “I’m really, really glad I got to talk to you,” Henrietta declares, after their laughter dims into smiles.  “I’m just happy you don’t hate me.”  “My biological mother’s a literal superhero traveling the universe to save mankind. What’s there to hate? ” A beat. Henrietta’s eyes flick up, over Hannah’s shoulder. “Uhm. I think you have company.”  The older woman turns slightly, just a glance, before she reverts her attention to the screen. “Yeah. I—”  “It’s okay. You can go. I—Galactic penpals?”  “Galactic penpals.”  “Sweet.” Henrietta quirks her mouth, an expression that has always been indelibly Hannah in my eyes. “And I mean this in the most non-ironic sense of the word ever. I—good luck, mom.”  The line cuts and Hannah breathes out, long and slow.  “Is this your fault?” she asks, not turning.  “Mine and Hotaru, really. Hotaru’s the one with the necessary clearance—”  “Ass.”  “You’re welcome.”  One hour.  The ship hums like something alive, its vibrations filling our bones, our thoughts. The chatter from mission control is a near-incomprehensible slurry, earmarked by Hotaru’s replies, concise and even.  “Final chance for phone calls and other near-instant forms of communication, people!” Hannah roars, flipping switches and levers, a cacophony of motion.  “Everyone I care about in this vessel,” remarks Ji-Hyun, stiff, a history of abuse delineated in the margins of her voice.  Everyone I care about in this vessel. The statement tears me open and I breathe the implications deep.  “Anna?” Hannah again.  “I’m going with what Ji-Hyun said. Everyone I care about is already here.” And it is not a lie. Not exactly. An almost truth, at worst, that stings to say, but there is no act of healing without hurt.  “Randy.” Hotaru’s voice cuts through our exchange, before Hannah can press me further.  “Yes, chief?”  “Sing us to Mars, will you?”  The unexpectedness of the request robs Randy of his usual verbosity, but he does not seem to care. Instead, he lifts his gorgeous voice, begins singing a soldier’s dirge about going home. Hannah holds my stare for a minute, then lets her expression gentle, looks away. Three years is enough to teach you what people need.  When we die on Mars, it will be a world away from everything we knew, but it won’t be alone. We will have each other, and we will have hope.  Cassandra Khaw writes horror, video games, tweets for money, articles about video games, and tabletop RPGs. These are not necessarily unrelated items. Her work can be found in professional short story magazines such as Clarkesworld, Fireside Fiction, Uncanny, and Shimmer. Cassandra's first paranormal rom-com Bearly a Lady released this year. Her recent Lovecraftian Southern Gothic, A Song for Quiet, is a considerably different animal.", "text": "3070 words, short story\nWhen We Die on Mars\n“You’re all going to die on Mars.” This is the first thing he tells us, voice plain, tone sterile. Commander Chien, we eventually learn, is a man not predisposed towards sentimentality.\nWe stand twelve abreast, six rows deep, bones easy, bodies whetted on a checklist of training regimes. Our answer, military-crisp, converges into a single noise: “Yessir!”\n“If at any point before launch, you feel that you cannot commit to this mission: leave,” Commander Chien stalks our perimeter, gait impossibly supple even with the prosthetic left leg. He bears its presence like a medal, gilled and gleaming with wires, undisguised by fabric. “If at any point you feel like you might jeopardize your comrades: leave.”\nCommander Chien enumerates clauses and conditions without variance in cadence, his face cold and impersonal as the flat of a bayonet. He goes on for minutes, for hours, for seconds, reciting a lexicon of possibilities, an astronautical doomsayer.\nAt the end of it, there is only silence, viscous, thick as want. No one walks out. We know why we are there, each and every last one of us: to make Mars habitable, hospitable, an asylum for our children so they won’t have to die choking on the poison of their inheritance.\nFaith, however, is never easy.\nIt is amoebic, seasonal, vulnerable to circumstance. Faith sways, faith cracks. There are a thousand ways for it to die, to metamorphosize from yes to no, no, I could never.\nGerald and Godfrey go first, both blondes, family men with everything to lose and even more to gain. Gerald leaves after a call with his wife, a poltergeist in the night, clattering with stillborn ambition; Godfrey after witnessing the birth of his daughter third-hand.\nWe make him name her ‘Chance’ as a gentle joke, a nod to her significance. Because of her, he’ll grow old breathing love instead of red dust. She is his second chance, we laugh, and Godfrey smiles through the salt in his gaze.\n“When we die on Mars,” I say, as I nestle my hand in the continent of his palm, my heart breaking. “Tell her a fairy tale of our lives. Tell her about how twelve people fought a planet so that billions could live.”\nHis lips twitch. “I will.”\nHe leaves in the morning before any of us wake, his bunk so immaculately made that you would have doubted he was ever there at all.\nFive months pass. Ten. Fifteen.\nOur lives are ascetic, governed by schedules unerring as the sun’s rotation. When we are not honing our trade, we are adopting new ones, exchanging knowledge like cosmic relics under a sky of black metal. Halogen-lit, our existence in the bunker is not unpleasant, only cold, both in fact and in metaphor. Nothing will ever inoculate us against Mars’ climate, but we can be taught to endure.\nSimilarly, chemicals can only do so much to quiet the heart, to beguile it into believing that this is okay, this will be okay. The years on Mars will erode our passion for galaxies, will flense us of wonder, sparing only the longing for affection. When that happens, we must be prepared, must keep strong as loneliness tautens like a noose around the throat.\nThe understanding of that eventuality weighs hard.\nA pair of Thai women, sisters in bearing and intellect if not in blood, depart in the second year. They’re followed by an Englishman, rose-cheeked and inexplicably rotund despite fastidious exercise; a willowy boy with deep, memory-bruised eyes; a girl whose real name we never learn, but who sings us to dreaming each night; a mother, a father, a child, a person.\nOne by one, our group thins, until all that remains is twelve; the last, the best, the most desperate Earth has to give.\n“Your turn, Anna. Would you rather give a blowjob to a syphilis-riddled dead billionaire, or eat a kilogram of maggot-infested testicles?”\n“Jesus, man!” Hannah, a pretty Latina with double PhDs in astrophysics and aeronautical engineering, shrieks her glee. “What is wrong with that head of yours?”\n“Nothing!” Randy counters, oil slick smooth. “The medical degree’s the problem! Look at enough dead bodies, and everything stops being taboo. I—”\nI interrupt, a coy smile slotted in place. “Maggot-infested testicles. Easy.”\nBoth Hannah and Randy guffaw.\n“You know syphilis got a cure, right? Why’d you gotta—”\n“They’re not so bad when you deep-fry them with maple syrup and crushed nuts. Pinch of paprika, dash of star anise. Mmm.” It is a fabrication, stitched together from memories of a smoldering New Penang, but I won’t tell them that. They deserve this happiness, this harmless grotesquerie, small as it might be.\nHannah jabs a finger in her open mouth, makes a retching noise so absurd that Randy dissolves into laughter. This time, I join in, letting the joy sink down, sink deep, catch its teeth on all the hurt snagged between my ribs and drag it all back out. The sound feels good in my lungs, feels clean.\nA door dilates. Pressurized air hisses out, and Hotaru’s silhouette pours in. Of the twelve of us, she’s the oldest, a Japanese woman bordering on frail, skin latticed by wrinkles and wartime scars, nose broken so many times that it’s just flesh now, shapeless, portentous. When she speaks, everyone listens.\n“Everything alright in here?” Her accent rolls, musical and mostly upper-class English save for the way it latches on the ‘r’s and pulls them stiff.\n“Yeah.” Randy, long and elegant as his battered old violin, glides out of his seat and stretches. “We’re just waiting for Hannah here to check the back-up flight system. Ground control said they found some discrepancies and—”\n“You suddenly the medic and the engineer, Randy?” Hannah cranes both eyebrows upwards, mouth pinching with mock displeasure. “You want to fly the ship? I’ll go sit in the infirmary, if you like. Check out your supply of druuuuuugs.”\nRandy doesn’t quite rise to the bait, only snorts, a grin plucking at the seams of his mouth. He throttles his amusement in an exaggerated cough, and I look away, smiling into the glow of my screen.\nHotaru seems less taken with the exchange, small hands locking behind her back. She waits until we’ve lapsed into a natural quiet before she speaks again, every word enunciated with a schoolmaster’s care.\n“If everything is in order, I’ll tell Commander Chien that we are prepared to leave.” Hotaru’s eyes patrol the room, find our gazes one by one. After three years together, it takes no effort at all to read the question buried between each syllable.\n“Sounds good,” Hannah says, even though the affirmation husks her voice. Her fingers climb to an old-fashioned locket atop her breastbone.\nRandy drapes a hand over her shoulder. “Same here.”\n“Here too,” I reply, and try not to linger too long on the ache that tendrils through my chest, a cancer blooming in the dark of artery and tendon. Familial guilt is sometimes heavier than the weight of a rotting world.\nHotaru nods. Like the commander, she will not waste breath on niceties, an efficiency of character I’m learning too well. When your lifespan can be valued in handfuls, every expenditure of time becomes cause for careful evaluation, every act of companionship a hair’s width from squander.\n“I’ll send word then. I imagine we’ll have about forty-eight hours to make final preparations,” Hotaru pads to the door. She turns at the last instant, skims a look over the precipice of a shoulder and for a moment, I see the woman beneath the skin of legend, stooped from memory and so very tired, a mirror of a mother I’d not seen for decades. “Don’t waste them.”\n“Anna, you awake?”\nI yawn into a palm and roll on my side, blink into the phosphor-edged penumbra. “I don’t know. Is Malik snoring?”\nHannah whispers a gauzy, sympathetic laugh. She props herself on an elbow, face barely visible, a landscape of thoughtful lines.\n“What’s up?”\nA flash of teeth. She doesn’t answer immediately. Instead, she loops a curl about a finger, winds it tight. I wait. There’s no rushing Hannah. Under the street-sharpened exterior, she’s nervy as an alley cat, quick to flee, to hide behind laughter and slight-of-speech.\n“Do you think the radio signal is any good in Mars?”\nI shrug. “Not sure if it matters. With the communication delay, we’re—”\n“—talking about response times of between four to twenty-four minutes. I know, tia. I know,” Hannah’s voice ebbs. She winds upright, legs crossed, eyes fixed on a place nothing but regret can reach.\nAn almost-silence; Malik’s snoring moving into labored diminuendo.\n“Not sure if I ever told ya, but I got a daughter somewhere.” Hannah breathes out, every word shrapnel. “Was sixteen when I had her. Way too young. The babydaddy skipped out in the first trimester. He left so fast, you could see dust trails.”\nA whine of strained laughter, dangerously close to grief, before she hacks it short, swallowing it like a gobbet of bad news.\n“My parents wanted me to abort. Said it was for the best. ‘Hannah,’ they told me. ‘This world don’t have no God to judge you for choosing reason over guilt.’ I refused. I don’t even remember why. It’s been that long. All I remember was that I wanted to give her a chance out there.”\n“Did your parents object?” I slink from my bed, cross the ten feet between us to close an arm about her shoulders, press a kiss into the hollow of her cheek. An old sadness reassembles inside me, a thought embedded in biology, not rationality. It’s been years since I’ve spoken to my family. Isn’t it time, asks a voice that is almost mine, for you to forgive them?\nHannah nestles into me and my body bends in reply, curling until we’re fitted jigsaw-snug, twins in the womb. “Nah. They weren’t that sort. Once I made it clear that it was what I wanted, they went in hundred-and-fifty percent.”\nI stroke her hair, a storm of dark coils smelling of eucalyptus and mint, a scent that won’t keep on Mars.\n“They put me into home-schooling, rubbed my feet. Did everything they could to make it easier for me. Nine months later, I had a beautiful little girl. She was perfect, Anna. Ten tiny little toes, cat-gold eyes, hair so soft it was like cotton candy.”\n“No fingers?”\nHannah pounds knuckles against my sternum. “Very funny.”\nI trail my fingers over the back of her hand and she lets her fist open, palm warm as we lock grips. “Then what happened?”\n“We put her up for adoption.”\n“And?”\n“That was it.”\nThe lie throbs in the air, waiting absolution, release.\n“I wish…” Hannah begins, careful, almost too soft to hear, her pulse narrowing. “I wish, sometimes, that I didn’t. I mean, kids were never part of my grand plan. But now that we’re going? I wonder.”\n“You could try to call her?”\n“How? My parents are dead. I don’t know even where to start. It’s fine, though,” Hannah extracts herself from my arms, pulls her knees close to her chest. There’s a new fierceness in her voice, edged both ways, daring me to pry, daring herself to open up. “They told me she went to a good home, a great home. That was all I wanted to know then. That’s all I need to know now. But.”\n“Yeah,” I don’t touch her. Not all places are intended for company. Some agonies you chart alone, walking the length of them until you’ve domesticated every contour and twinge.\nHannah nods, a jerky little motion, the only one she allows herself. We say nothing, finding instead a noiselessness to share. It is many long minutes before she tips herself backwards and pillows her head on my lap, an arm looping about my hips.\n“Stay with me, tia?” Hannah asks and briefly, vividly, I glimpse the sister I’d long excised from daily thought.\n“Only if I get a backrub in the morning,” I reply, distractedly, drawing circles across her shoulder blades. In my head, a line from a Todd Kern song palpitates on repeat: you can always go home. It could be so easy, so simple. Forgive. Forget.\nA tremor undulates through the column of her spine. Laughter or sobs, I can’t tell which. “Deal.”\n“You did what now?” Randy’s voice quivers an octave above normalcy, one bad joke away from earnest hysterics.\n“I mooned my sister’s ex-husband.”\n“Why?”\nThe shrug in Tuma’s rich tenor is almost palpable, like muscles striving under skin. It is also anomalous, out-of-place in a young biologist better remembered for his ponderance than his sense of irreverence. “Why not?”\nAs expected, Randy cracks up, his laughter melodious, a thing I wish I could scoop into a Petri dish and let grow. I can imagine him in another life, a bluesman with a thimble of whiskey and a room full of worshippers, his eyes alive with their love.\nI shake my head, return my attention to the spreadsheets of numbers imprinted in green on my terminal, calculations congregating thick as nebulas. In the corner, a notification pulsates. I ignore it.\n“Hi.”\nWe look up as one, fingers retracting from keyboards, faces from screens, to see Stefan’s hound-dog frame limned in the doorway, a duffel balanced on one slim shoulder.\n“Productive trip?” Tuma asks, swinging around in his chair.\nStefan nods, dislodging his luggage into a pile atop the floor before he drops into an open seat, his face unburdened of ghosts. Not all of them, but enough. “Yeah.”\n“Your brother finally see the light?” Randy quips, a remark that earns him a fusillade of dirty looks.\n“Not exactly. He still thinks we’re going against God’s will.” His eyes shine, illuminated by something sweet. “But he wishes us well. He’s happy for me.”\n“Despite going against God’s will?”\nStefan heaves a shrug, mouth curved with secrets, all of them good. “Despite going against God’s will.”\nNo one presses for data. Three years teaches you a lot about what a person will allow. From time to time, however, someone makes an excuse to rise, to graze past Stefan and brush fingertips against shoulder or arm, as though contact is enough to transmit a monk’s benedictions from brothers to stranger.\nOn my screen, the icon continues to flash, demanding acknowledgment. Footsteps, like rainfall on metallic tiling. The weight of Randy’s arm settles about my shoulders, a barrier against the past.\n“You not going to answer that?”\n“No.” I exhale, hard.\n“Why not?”\nBecause love doesn’t grant the right to forgiveness. “Same reason as I said last time.”\n“You could do like Tuma.”\n“I’d rather not.”\n“And why’s that?”\n“Because screen-capture technology exists,” I shoot, hoping that my voice doesn’t shake too much, hoping that humor might deflect his curiosity.\nAnd it does. His laugh ricochets through the chamber again, warm, warm, warm. People tilt sly glances over their shoulders. Hannah punches Tuma in the arm, who only chuckles in return, his eyes lidded with delight. When he, with uncharacteristic brazenness, begins expounding on the virtues of his posterior, Randy’s laughter becomes epidemic, bouncing from throat to throat. If the sound is a little raw, a little ragged, no one comments. In twelve hours, we give up this planet entirely.\nI push from my seat as the sound climbs into a frenzy, and use the diversion to slip out.\nIn the distance, Hannah’s voice, low and thick with aching, echoes, riding that knife-edge between rapture and hurt.\n“Henrietta? That’s what they’re calling you?”\n“After my maternal grandmother.” A tinny voice, distorted by poor equipment, accent Mid-Western. “Well. You know what I mean.”\n“Grade school must have been an arena then, chica.”\n“You have no idea.”\nI walk into the sleeping hall to see Hannah backlit by a Macbook, its display holding the face of a younger woman, not much older than her teens. Henrietta is paler than her mother, her hair artificially lightened, but she shares the same structural elegance, the same bones.\n“I’m really, really glad I got to talk to you,” Henrietta declares, after their laughter dims into smiles.\n“I’m just happy you don’t hate me.”\n“My biological mother’s a literal superhero traveling the universe to save mankind. What’s there to hate? ” A beat. Henrietta’s eyes flick up, over Hannah’s shoulder. “Uhm. I think you have company.”\nThe older woman turns slightly, just a glance, before she reverts her attention to the screen. “Yeah. I—”\n“It’s okay. You can go. I—Galactic penpals?”\n“Galactic penpals.”\n“Sweet.” Henrietta quirks her mouth, an expression that has always been indelibly Hannah in my eyes. “And I mean this in the most non-ironic sense of the word ever. I—good luck, mom.”\nThe line cuts and Hannah breathes out, long and slow.\n“Is this your fault?” she asks, not turning.\n“Mine and Hotaru, really. Hotaru’s the one with the necessary clearance—”\n“Ass.”\n“You’re welcome.”\nOne hour.\nThe ship hums like something alive, its vibrations filling our bones, our thoughts. The chatter from mission control is a near-incomprehensible slurry, earmarked by Hotaru’s replies, concise and even.\n“Final chance for phone calls and other near-instant forms of communication, people!” Hannah roars, flipping switches and levers, a cacophony of motion.\n“Everyone I care about in this vessel,” remarks Ji-Hyun, stiff, a history of abuse delineated in the margins of her voice.\nEveryone I care about in this vessel. The statement tears me open and I breathe the implications deep.\n“Anna?” Hannah again.\n“I’m going with what Ji-Hyun said. Everyone I care about is already here.” And it is not a lie. Not exactly. An almost truth, at worst, that stings to say, but there is no act of healing without hurt.\n“Randy.” Hotaru’s voice cuts through our exchange, before Hannah can press me further.\n“Yes, chief?”\n“Sing us to Mars, will you?”\nThe unexpectedness of the request robs Randy of his usual verbosity, but he does not seem to care. Instead, he lifts his gorgeous voice, begins singing a soldier’s dirge about going home. Hannah holds my stare for a minute, then lets her expression gentle, looks away. Three years is enough to teach you what people need.\nWhen we die on Mars, it will be a world away from everything we knew, but it won’t be alone. We will have each other, and we will have hope.\nCassandra Khaw writes horror, video games, tweets for money, articles about video games, and tabletop RPGs. These are not necessarily unrelated items. Her work can be found in professional short story magazines such as Clarkesworld, Fireside Fiction, Uncanny, and Shimmer. Cassandra's first paranormal rom-com Bearly a Lady released this year. Her recent Lovecraftian Southern Gothic, A Song for Quiet, is a considerably different animal.", "source": "https://clarkesworldmagazine.com/khaw_12_15/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: When We Die on Mars by Cassandra Khaw"}