{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Derek Künsken", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "bTAALbFZ9k+WA1nLWzY3d/bI37E=", "id": null, "license": null, "comments": "", "raw_text": "7840 words, novelette  The Ghosts of Ganymede  The cracked, blasted surface of Ganymede came into focus outside the portholes, assuming three-dimensional texture and relief. Jupiter’s yellow-orange planet-shine gave way to the white glare of the lander’s spotlights and the scatter of light within cold jets blowing dust and pebbles and chunks of ice away. Even in the low gravity, the landing jarred, bouncing once, before they came to rest.  Home. Kedija said the word experimentally in her head, but none of the feelings she associated with home responded to the word.  Then, everyone was unclipping straps, listening to the ongoing verbal report of the piloting systems, double-checking suit seals, talking to each other with a hint of the hysteria she felt. Over eight months, they’d crossed seven hundred million kilometers to reach Ganymede.  “We’re here,” Petros said inanely.  He was standing, but had gone still, listening, peeking out the porthole. The lander shook as doors opened to the vacuum outside. He offered her a gloved hand. Having gravity again felt strange, but Ganymede’s pull was similar to Luna’s, so she still felt weightless, less than solid.  Kedija stepped down the ladder cautiously. Beneath her, some of her fellow refugees were stretching and waving their arms in the sudden freedom. Others stepped gingerly farther and farther across the pebbled ice, taking in their world. She set down her booted foot, insulated to survive the meager hundred kelvins. There was no magic feeling. No sense of destiny. Only an ongoing sense of dread.  They’d landed beside Adapa Crater. Edge to edge it was almost sixty kilometers across, and on its heights, they would built conductor towers to generate electricity as Ganymede traveled through Jupiter’s immense magnetic field. They were under the king of the planets, but looked south to see it, as they were two thirds of the way to Ganymede’s pole.  The lander spotlights turned the unlit landscape much darker, and the chips in her head carrying her AI worked to compensate for contrast. Full sunlight at Ganymede would only ever be three percent what she’d seen on Earth. And when the sun was behind Ganymede, Jupiter would shine down with a similar orangey dimness. Rows of hills and plains stretched into the distance, mostly the milky white of concrete-hard water ice, but veined with gray and black where meteorite activity had dropped minerals and metals onto the ice. Their new home was somber.  Six more landers carrying Eritrean colonists had landed in a curving row beside her lander. Beyond them, following the line of the crater, were six more landers carrying Ethiopian colonists. This was a new Plymouth Rock, five hundred years after the first. Anxieties ebbed as they all began to work. They had a whole colony to build.  They had lots of robots, built in the aluminum fields of Luna, and they’d been tested in the cold of the moon’s two-week night, so they should have worked here. They all creaked more than they should have though, working almost reluctantly, cutting blocks of rock-hard ice out of the ground. They needed to build their ice houses over these new hollows, and heat and pressurize them to livable temperatures. The thick ice would protect them from the worst of Jupiter’s radiation and eventually, they would grow gardens, make schools, build factories, homes, families.  Kedija finished another reboot and the robot finally showed only green telltales, before it rolled slowly across the surface on wire wheels, towing aluminum framing up the rise, where other colonists and robots were flattening the top of the crater lip to raise the first of the conducting towers.  Blotches of bright purple stained her vision and she tried to blink the spots away. They weren’t really in her eyes though. Splotchy purples and blues materialized in her vision whenever Jupiter was in sight, like the king of the planets was reminding them to pay attention. Their suits were heavy with layers of lead shielding, but the faceplates could take only so much lead before they couldn’t see through them. At the wrong angles, the radiation got through and played with the electronic and mechanical implants in their bodies. They needed them to survive, but the radiation did funny things to the implants in their brains, and only so much noise could be filtered out.  “Hey boss,” Petros said on the open channel. “I think you’d better come see this.”  “What is it?” she said.  “You really have to come here,” he said.  Petros was leading a surveying team about two kilometers into the hills west of the lip of Adapa Crater. Her AI showed his position and mapped the easiest way to get there. A lot more robots were glitching and she wanted to get them moving, but she felt like she’d been coaxing robotic movement for days.  “Okay,” she said.  A red light appeared in her ocular implant. Personal message. She took a breath. Then accepted the call.  “Hello, Negasi,” she said.  “I thought we said that we’d share information, Kedija,” he said. His breath was raspy, tired. He’d been lifting something. But his tone was always hard.  “I don’t know what Petros wants, but I need a break,” she said.  “Finding metals and not telling us?” he said.  “Come if you want,” she said, hoping he didn’t. “Petros is two klicks out. It’s going to be a hike.”  “I’ll meet you at west point two in ten,” he said. Then his messaging status turned transparent.  Kedija headed to WP2. Petros better not have found metal and thought to keep it a secret.  Negasi brought along three members of his contingent. She hadn’t brought anyone. She didn’t exactly feel in danger because of this. She hadn’t felt safe since the start of the war. She hadn’t felt safe in the camps. She hadn’t felt safe training on Luna or on the way out to Jupiter. They didn’t speak on the walk out to Petros. Maybe they were talking to each other on another channel her AI didn’t know. A cold itch hovered over her spine.  The geology of Ganymede was stark, sterile, unwelcoming, but carried a hard, strange beauty. Many hills were thrown up in radial rings from Adapa Crater, but age had blunted their sharp edges with some of the western faces showing signs of erosion and melting. Against the black sky studded with cold stars, the effect was not unlovely. No other colony in the solar system would have these features. Mars, the moon, the asteroids all had different geologies. And none of them looked like home. Blotchy blue patches appeared in her vision. She turned away from the insistent glare of Jupiter. This was something they would all have to get used to.  The icy ground was uneven and covered with pebbles, sometimes deeply, which kept slowing them. This part of Ganymede didn’t have real regolith, a deep mixture of particles and loose stone, but a layer of dust a few centimeters deep seems to have lain here for all time, only marked by the low gravity skip-hopping footsteps of Petros’ party.  They rounded the last hill before coming into sight of Petros’ group. A flat plain of dusted ice lay between them and the next row of hills. Petros’ team was clustered into two groups with their hard white lights reflecting off the white of the ice of the hill they were examining.  As she and Negasi crossed the plain, Petros’ hills occluded more of the stars, catching Jupiter’s shine on its flatness. But the closer they got, the less like a hill it looked. The glaring headlamps shining showed a pitted rising surface far flatter and smoother than the other hills. Petros’ team had gathered some measurements and their suit AIs shared with Kedija and Negasi. The flatness was very close to a plane, rising off the ground at sixty degrees. Impacts marked the hill as much as the rest of the surface of Ganymede. The AI analyzed the overlapping impacts, estimating an age above a million years. The AIs guessed that it was made of nearly pure water, with none of the ammonia, nitrates, sulfurs, and other organics and minerals that were part of the ground. Without the impurities, this ice would be far harder at this temperature.  “A pyramid?” Negasi said.  Petros turned, seeming surprised that the Ethiopian leader was here. Then he saw Kedija and approached.  “There’s a whole row of them,” Petros said. “We haven’t looked farther out, but . . . ”  His voice trailed off and they followed his sight line. Jupiter’s shine at this angle was just enough to see that this ring was not hills at all. A curving line of flat-topped ice pyramids stood in a trough between two rows of impact hills. The pyramid faces turned relative to one another, always facing Adapa Crater. The distance softened the impact marks on their faces, and the flattened tops almost seemed natural.  “We never saw them from orbit,” Kedija said.  “Same size as the hills here,” Petros said.  “Even the pyramids at Giza can’t be seen from orbit without binoculars,” Negasi said dismissively. “Who made them?”  One of Petros’ team radioed from farther along the base of this pyramid. They headed that way. In some places, snow and dust had formed drifts and they stepped through, making expanding clouds. At eighty meters, about halfway across the base, two members of Petros’ team stood at the edge of an opening, six meters tall and about the same wide. Dirty dust and snow lay in the opening, untouched for who knew how long.  “Holy . . . ” Kedija said, her voice trailing off.  “Something, some aliens, lived here?” Negasi said. “They left tombs.”  “But the AIs think they’re millions of years old,” Petros said.  The opening yawned around them. Kedija’s AI autofocused her headlamp. The ceiling began at six meters and as they moved inward, it followed the outer slope, out of the reach of light. The walls reflected the light brightly, even where sublimation hollows pitted them and where patches of white hoarfrost furred them. The floor was smooth and took their footprints in the snow and dust as the way yawned open to a silent darkness. The pyramid was hollow.  Although their lamps couldn’t do more than suggest the ceiling with scintillating reflections, the nearby walls showed curving pilasters reaching high into the darkness like white ribs. Kedija neared one. All along the wall, closely-spaced shelves of ice projected about fifty centimeters into the pyramid interior, with only a few centimeters separating one from the next layer. There was nothing on them. Just more snow and dust.  “They’re set up like radiator vanes,” Kedija said, “but there’s no heat to radiate.”  “Would that wick away any heat?” Petros said. “Keep the pyramid colder and more solid?”  “When we tell Earth or Mars about this we’ll be rich,” Negasi said, shining is light up the wall, his grin visible even behind his faceplate.  “If they find out there’s an alien tomb here, they’ll take Ganymede from us,” Kedija said. “Then where will we go?”  “I’d like to see them try to live here,” he said, but she noticed he didn’t dispute her point.  “Where are the crypts?” Kedija said.  She swept her light onto the floor. Then she stilled and screamed. Lights swiveled to hers, flashing to scan the dark. The figure was gone.  “What is it?” Petros said.  “A thing was there,” she said. “Just there. Like a centipede. Big.”  Negasi panned his light further, finding nothing but flat floor and the occasional low mound of snow. One of Negasi’s companions knelt at the spot where Kedija had been shining her light. They looked close and in their local web her AI picked up their readings. No thermal. No sonic. No anything. Petros slid a gloved finger along the dust, leaving a trail of of exposed ice.  “This dust hasn’t been disturbed for . . . ” Petros said, pausing, looking for something they could understand.  “He means there was nothing here, Kedija,” Negasi said. “Go back to base.”  She took a deep breath. The oval of her lamplight found nothing else. Just emptiness and flat floor.  “Ahya!” Negasi swore, stumbling backwards.  Kedija braced his shoulders before he fell. Her AI swiveled her lamp at the ground. For an instant, she saw a black carapace, a wormlike figure on many legs. She couldn’t tell if it was facing toward or away from them. At each end, the shiny shell bloated like a head, and there was another bulge over its midsection. And in the instant before it vanished, she realized it was transparent. The fine striations in the dust had been visible through it. Negasi marched forward angrily, kicking the dust where it had been. Then, at the extreme edge of their lamplights, more outlines showed in the shadows. More of the creatures.  “Let’s get help,” Kedija said, pulling Petros back. Negasi and his people didn’t argue.  Kedija and Negasi agreed that neither would report what they’d found to Earth or Mars. It took them a day to organize themselves to go back with enough equipment and lighting to make a real examination of the first pyramid. Most of the colonists were so busy setting up the robots that it was difficult to find help to load the equipment onto the rovers, one of which needed to be assembled. After hefting a generator onto the flatbed of one of the rovers instead of waiting for a lift to be available, Kedija was winded, and took a moment to rest.  Jupiter hung above them, smooth as a marble, hazy with layers of browned orange and beige jet streams of ammonium hydrosulfide, shot with milky highlights of ammonia. And where the ammonium layers thinned, patches of blue from lower cloud decks peeked through.  They would know those clouds in a few months, when they managed to get the industrial dirigibles into Jupiter’s atmosphere to harvest helium-3. A century of mining the Earth’s moon was beginning to leave the fusion reactors of Earth hungering. Their new home had been financed on the condition that the refugees mine Jupiter’s helium-3. It wasn’t a deal with the devil. It was work. But it meant the only place they could belong was out here.  Blotchy purple impinged on her vision again, radiation that her implants and suit couldn’t screen out. The king of the gods didn’t suffer mortals to watch him for long. She blinked and looked away. The patches of nonsensical color remained, ghosts of damage she was taking. She was taking eight rems every day, but her DNA repair genes were engineered to hyperactivity so that she could endure. They would all endure.  They finally entered the same pyramid as yesterday, Hamid and Petros driving the rovers right in, lights blazing. The empty majesty of the pyramid rose above them. In the faint gravity only light curving ribs were needed to support the weight of big ice blocks. The pyramids were smooth and seamed and obviously constructed. The odd, closely-spaced shelves she’d noticed yesterday on the walls went all the way to the peak, making them impractical as shelves and much more likely to be vents.  “The rems are way down in here,” Petros said.  Kedija’s AI offered the radiation count. Depending on whether she was looking at the doorway or not, the radiation was down to millirems, still hundreds of times Earth normal at sea level, but safe enough to live a long time. When they were finished building them, their habitats would be as safe.  “None of our visitors are here,” Kedija said.  “Too soon,” Negasi said, but when she followed his pointed hand, there was nothing there.  “I’m setting up the cameras,” Petros said.  In her peripheral vision, a dark shape, long and shiny, appeared and then vanished as soon as her eye darted to it. Hamid turned quickly, in the other direction, but there was nothing there.  “Ghosts,” Hamid said.  No one answered him. Kedija thought she was hearing his heavy breathing in her headphones, but her own faceplate began fogging and she forced herself to be calm.  “Filming,” Petros said. He’d set up some standard rover cameras on stands, four of them, covering a complete circle.  One of the big centipede things appeared about five meters away. It didn’t vanish as soon as she looked at it. Its many legs were still, and the light from Petros’ lamps glinted off what looked like a hard black carapace that fit in overlapping segments.  “Are you getting this, Petros?” she said. The thing vanished.  “Oh yeah,” he said, but he wasn’t looking her way. One of the black creatures was before him, only a few meters away. “It’s casting no shadow,” he whispered. And it was mostly true. There was no shadow behind it, but from her angle, Kedija saw a faint blueing of the light onto the icy white floor. Then, it too vanished.  Petros turned to his cameras, connecting them to his AI. Another centipede, a good meter and a half long appeared right behind him.  “Look out, Petros!” she said.  He spun and miscalculated the force needed and his momentum flung him off the floor, falling over the centipede. His foot passed immaterially through it before it vanished too. Kedija helped him up and checked his suit for damage.  “I’m okay.”  “They’re projections,” Kedija said.  “Where are the projectors?” Negasi asked.  It was a good question. So far they’d found nothing that looked like wiring, found no magnetic fields that might be a sign that current was flowing anywhere. And what power source would still be good after a million years?  “Look,” she said, pointing. Nearer to the corner. Two of the meter-long centipedes were still in an area less covered by spotlights. But enough light reached them to see that there was something strange. One was standing before the other and the proportions seemed odd, the little light reflecting back strangely, distorted. No. One wasn’t standing in front of the other. One was standing within the other, like two ghosts. And where they overlapped, a pattern of light and dark wove itself over them, like seeing them through waves in water.  “What’s happening to them?” Kedija said.  The centipedes vanished. No more of the centipedes appeared.  “Ghosts,” Hamid said again.  Ghosts. Her mind drifted, like she couldn’t process properly. Ganymede was almost all ice, but so hard that to them it felt rocklike. But on geological scales, parts of the ice were softer. Some of the highest crater walls of the biggest craters eventually just collapsed. They were called ghost craters. But if these pyramids had been here millions of years, why haven’t their ghosts vanished too?  The hut was pretty cold. Huge blocks of ice had been lasered and sawed out of the ice, leaving a hole ten meters deep. The blocks had been cut into thick sections and water-welded together in a kind of square igloo structure. Then, they’d inflated a habitat within the hollow and brought in their equipment and stores before installing the airlock. It would take days for the heaters to get it to comfortable temperatures, but it was almost up to zero Celsius. It felt good to get her helmet off.  Fatimah was helping Petros with the display settings and analysis of his camera readings. Fatimah’s hair was short, freshly-shaved, like Kedija’s, the easiest way to have hair when wearing a space suit every day. The external plates holding Fatimah’s AI could do with a polish and her dark eyes shone with the internal light of an ocular display. Kedija rubbed her eyes. In here, they were blessedly protected from most of Jupiter’s radiation and neither Jovian psychedelic blotches nor oversized centipede projections intruded. She blew on her fingers.  “Negasi doesn’t want to come over here to help with this?” Petros said.  “I don’t want him here,” Kedija said. “They have their habitats and we’ll have ours.”  She looked over Fatimah’s shoulder at the screen. Fatimah was trying to clean up the still images of the two centipedes overlapping.  “There’s no such thing as ghosts,” Kedija said. “Those are interference patterns.”  The odd watery lighting between them was a classic interference pattern. But holograms or 3-D projections wouldn’t interfere like that, not in a way they could see macroscopically. Hamid suddenly cried out and pointed at the wall behind her. They all turned and she glimpsed a large shape on the wall before it vanished.  “Same?” Kedija asked.  “This place is haunted!” Hamid insisted.  Petros examined the wall with a UV lamp.  “Maybe they’re quantum possibilities,” Kedija said.  Petros looked back at her, the UV fluorescing on the wall behind his head giving him a halo.  “No,” he said. “When conscious beings observe quantum probabilities, they collapse into something normal, before we’d ever really see them.”  Blue fluorescing light from the wall reflected off the edges of the plates on his forehead. His AI, like hers, was more than just an external processor. They shared thoughts with the AI and the AI shared thoughts and observations back. As their radiation resistance made them not exactly human anymore, so too did the AIs change the way they thought. They could do so much more with AIs, could think faster, but it made them lean on the helpers too. Kedija sometimes felt like she was managing her brain rather than inhabiting it, in a way that perhaps wasn’t exactly human either.  “What if . . . ” she said.  Petros shut off his UV lamp and looked at her like he was hoping she had a real explanation.  “What if we’re not as conscious as we thought? This is new,” she said haltingly, tapping the plate on her own forehead. “A robot observing a quantum event doesn’t necessarily collapse its wave function the way humans do.”  He frowned. “No one has observed something like that with AI augments, boss.”  The lights of the habitat blinked out. All the equipment stopped. Even the fans. Only the pale orange glow of the heating elements cast any light. Then wrist displays and AI plates shone light.  “Get the emergency power on!” Kedija said.  The lights and everything else came on. The fans sounded loud after their brief absence.  “Something not connected right?” Kedija said.  Petros frowned, looking at his wrist display, but his eyes glowed as his AI fed him a series of face displays on the inside of his eye. “The AIs think all the hardware is good,” he said. “It looks like a random software failure. The signal to main power just stopped. The software took it as a sign to shut down.”  That shouldn’t have happened. Their software was well-tested and had redundancies. The spot on the wall where the centipede thing had appeared was still empty. What had it been doing all the way over here? They’d just built the habitat in the last twenty-four hours. There were no projectors in it. And there were no ghosts. She moved close to Petros, whose expression was starting to look a bit alarmed as he probably chewed through the implications.  “If these are quantum effects,” she whispered, “could they be interfering with our systems?”  His expression took on the wild-eyed intensity she’d seen in so many faces, and in the mirror, after Asmera had been nuked, when they thought they’d lost everything. They hadn’t lost everything. They’d had so much more to lose in the coming months and years.  “How do we stop them from interfering with our systems?” he whispered. “We came seven hundred million kilometers to find a home. We can’t go back!”  Petros was on the edge of tears. Kedija hugged him.  “This is our new home,” she said in his ear, not understanding what those words meant anymore. They had no substance. “This is our home.”  Kedija’s first dreams in the new habitat were of cold, shivering, bone-numbing cold. But a thicket of other dream images threaded into that cold, like shoots of grass forcing their way through pavement cracks. The dream became brighter and brighter, until she was shielding her face with her arm. The flash passed and the shock wave followed, knocking down all the buildings in the outskirts of Asmera. She hadn’t felt the heat. The wave of superheated air had passed over the brick wall laying over her.  But she was on Ganymede now, sitting in her sleeping bag, hugging herself and wiping sweat as her heart thumped hard in her chest, still feeling the weight of the building trapping her. The habitat had only warmed to one degree and the chill nipped at her sweat. Around her, people shifted in sleep. No images of huge alien centipedes showed themselves. They weren’t ghosts.  Kedija knew about ghosts. She was already haunted.  She rubbed her eyes, trying to banish images of a nuclear strike but succeeded only in replacing them with something almost worse. They were crushed up against fences, hundreds of them, maybe thousands. She hadn’t made it to the fence, but she could see through the heads and shoulders to the UN soldiers on the other side in hazmat suits and gas masks. The soldiers watching them through the glass of their faceplates, not raising their rifles, mute to the desperation of the survivors.  Ethiopia and Eritrea were uninhabitable because some colonel with the launch codes got twitchy. Once the nuclear exchange began, it ran down with deadly inevitability. Half of the warheads were of such poor quality that they achieved only partial detonation, which was almost worse, spreading raw unexploded plutonium over burned ground, irradiating both countries with fallout that made Fukushima, Chernobyl, and Tehran look like practice drills. The survivors gathered in the few low-radiation areas, but couldn’t get out. No country would let them in. And the UN helped hold them where they were.  Movement flickered on the wall beside her, at the edge of her vision. One of the transparent centipede ghosts clung to the wall.  The blue-brassarded soldiers wouldn’t let the survivors beyond the fences to somewhere safe, but the international community was willing to pay to genetically-engineer them for radiation-resistance. None of them were human anymore; wrong number of chromosomes. But the survivors could walk across more of their blasted lands after that, like they were haunting it.  Only when Fusion Power Corp came was there any chance to leave. Fusion Power Corp needed helium-3 and their genetic modifications made them the only people on Earth who could survive the radiation on Ganymede. Countries didn’t like paying to help the same refugees for years on end, so FPC’s offer of employment was celebrated as the private sector exercising social responsibility. FPC got the Nansen Medal. The survivors, Eritreans and Ethiopians alike, were exorcised from humanity in excruciatingly slow Hohmann transfer orbits.  On her wrist, Negasi’s name appeared on her incoming calls. The ghost beside her vanished.  “You cut our damn power?” Negasi said.  “What?” she answered.  “I put up with you fucking Eritreans on the way to Jupiter, but I don’t have to put up with you now,” he said.  Kedija rose, shivering. Grumbling started in sleeping bags around her.  “We didn’t cut your power, Negasi,” she said more quietly. “Have ghosts come to your habitat? I just had one here.”  “Ghosts don’t interrupt life support power,” he said.  Her stomach sank. Life support problems? That was bad. They could survive radiation, but not minus one seventy, or a hard vacuum. She was missing something.  “A quantum ghost could mess up the probabilities in your control systems,” she offered.  It sounded strange in her ears as she said it.  “What?” he said.  She started putting on her survival suit.  “Let’s go to the pyramids,” she said.  “Now?”  “If they’re bugging up your life support, they won’t be far from ours,” she said. “We have to figure this out.”  Kedija and Petros scrunched out onto the ice to the entrance of the first pyramid. Jupiter the insouciant king hung still, timeless and stately above them. Ganymede showed only one face to Jupiter, which meant Jupiter never set and never moved. It made her feel like time had stopped.  Negasi was waiting for them with a big man. She squawked in the radio band, the sound they used to replace a physical gesture of the head or face to greet someone. Instead of responding in kind, Negasi tapped his waist. A holster hung there.  “You brought a gun to Ganymede?” she said.  “I won’t forget Adigrat,” he said.  Adigrat. That was his ghost. Her ghost, Asmera in Eritrea was the start of the war. Adigrat in Ethiopia was the last city on either side to die. Many had thought it safe. It had no military value and survivors had been streaming in for days. Kedija hadn’t made the war. She’d suffered it, like all of them. She wanted to leave it behind, but ghosts appear like time hasn’t passed.  “This is no trick, Negasi,” she said, but in her ears, her words sounded exhausted, the exhaustion that could only start in the marrow.  She lead them into the pyramid. They’d left some lights on to record, to try to understand where the projectors were, if there were projections. She didn’t think they’d find any. Dozens of the transparent centipede ghosts stood, occasionally twitching or turning. Those that were close to one another occasionally appeared indistinct and watery, like an image seen through the surface of a burbling stream. Some of the ghosts began to disappear.  “These might be quantum images,” she said to Negasi. “They interfere with one another. They sometimes vanish when we observe them. They could be interacting with our microlevel systems.”  There was just enough light to see Negasi’s dubious expression behind the faceplate.  “We have a quantum pest control problem?” he said.  “Not a pest,” she said, considering the vanishing centipedes. Others appeared elsewhere. She’d set her AI to think about them, but making recordings was difficult, and her AI hadn’t come to a conclusion as to whether they were all the same or different creatures.  “Something built these tombs,” she said. “They left something of themselves behind. Not writing. Interacting probabilities.”  “These are alien hieroglyphs?” he said. “I don’t care about a memorial for an extinct species! We were almost extinct. We have to live. This is our turn!”  This is our turn. The words pulled in her chest.  Negasi was pointing at Petros, who looked uncomfortable. “You! You were one of her students, weren’t you? How do you get rid of quantum . . . pests?”  Petros could only try to shrug, an awkward gesture under kilos and kilos of a lead-lined survival suit.  Kedija crouched, approaching one of the centipede things. It wasn’t vanishing yet.  “When a conscious mind observes a quantum event,” Kedija said, “the probability wave collapses. What had been possibilities before becomes a concrete decision. These don’t disappear very fast. If these are manifestations of quantum probabilities, they’re so complex that it might be that our consciousness isn’t large enough to collapse the wave function.”  “I don’t care what they are,” Negasi said. “They’re endangering us. Get rid of them! If you won’t, we will.”  “You’re not in Ethiopia anymore, Negasi,” she said. “You don’t get to tell anyone what to do. We’re all just people now.”  The ghost centipede before her finally vanished.  “The past doesn’t vanish when you look at it, Kedija.”  “No,” Hamid said into his wrist communicator, to the teams checking the outage. “It’s down again. It’s down again. No. It’s down again. Reboot it?”  It was the second time today that primary power systems were glitching. Hamid thought it was heating-cooling problems with the couplings. A lot of their environmental tech had been designed for Mars, whose temperature swings were larger, but more gradual. In their race to put up their shelters, they’d maybe run their power systems too hot. Or maybe not.  “More and more quantum ghosts are appearing,” Kedija whispered to Petros, the white vapor of her words vanishing in the cold. Their helmets were off, but their suits were still on. The temperature in the habitat had plunged to forty below. Hamid led the efforts to get primary power back.  “They’re interacting with us,” she said. “We’re becoming part of their probabilities.”  The display screen in front of Kedija and Petros had nothing to do with the power systems. It showed the characteristic pattern of electromagnetic wave interference, over a recording of two of the centipede ghosts.  “The morphology of this one is different from that one,” she said, pointing. The differences between the two ghosts were subtle. On one of them, the features she called “head,” despite the fact that there were ridges on both ends of the body, were larger. And on the smaller-headed one, there was the suggestion of a third “head” in the middle of the body. Each of these head-features was the source of the waves that were creating the interference patterns.  “If there are several kinds of ghosts,” she said, “they might be descended from different quantum probabilities. And when two different kinds interact, it messes with our systems.”  “It’s one thing for a single electron to interact with itself as it goes through both slits of an experiment,” Petros said. “This is macroscopic.”  “Macroscopic-level quantum behavior has been observed in special cases,” she said. “It’s weird, not impossible.”  “Does Negasi buy it?”  “I sent him these recordings with my analysis an hour ago,” she said. “I should call him.”  The lights and fans came on, blowing cold air. The heating coils began to glow. A wan cheer rose from the people around them.  Kedija stepped away, calling Negasi.  “What is it?” Negasi asked as he answered.  “I don’t think the ghosts are individuals in the way we are,” she said in a low voice lost in the bustle. “Ganymede is cold enough that their brains could probably quantum process if they were built of the right materials.”  “That doesn’t help our life support.”  “If the aliens thought with quantum logic, maybe they were even entangled to each other,” she said. “If so, they’re they’re still entangled and interacting.”  “I was already tired of being entangled with you,” Negasi said. “Now we’re entangled with them? If they like the cold, let’s cook their pyramids. I have my engineers drawing up some plans for it.”  “They’re thinking,” she said. “I think.”  “Ghosts don’t think.”  He hung up. Petros came close. “He didn’t go for it?” he said.  “I don’t know what it is,” she said. “We’re in the dark and he’s thinking crazy.”  “It doesn’t matter,” he said. “We don’t have the nuclear power to melt millions of tons of ice.”  Kedija barked a short laugh.  Fatimah came near with a small pad. “We’ve finished looking at the dust from the shelves,” she said, handing the pad to Kedija.  Kedija rotated the pad, looking for some point of reference. It looked like an image of an electron micrograph, grainy with odd lumps of dust around a central ball with complex ropey growths webbing it.  “The dust in the pyramids has a lot of structure,” Fatimah said. “Like spores.”  “Dangerous?” Kedija asked.  “Not to us,” Fatimah said. “At a hundred and seventy below outside, they’re solid. They melt completely at room temperature. Around minus a hundred though, they’re like jelly, and we think they can sprout.”  “What do they grow into?” Kedija said.  Fatimah shrugged awkwardly in her survival suit. Petros took the pad and looked at her results. Fatimah swiped to other images and expanded them, showing him her work. Only Kedija noticed the centipede ghost that had appeared near her feet. While Fatimah was still swiping, Hamid’s look followed Kedija’s and then became wide-eyed. When Fatimah finally looked, the ghost vanished.  “Did it take three of us to make that one vanish?” she said.  A cramped little room with double-walled insulating plastic was set aside as a lab. Long after two in the morning. Kedija was slumped in her chair, chin in hands, elbows on the table. Petros sat beside her, leaning against the wall. Under a strong light, in a sealed chamber like a terrarium, little spores were warming. Cameras in the chamber magnified the spores and projected them on the wall, beside temperature and pressure readings.  “I heard Negasi somehow brought weapons in their ships,” Petros said.  “We’re not just observers of some events from a million years ago,” Kedija said. “We have a kind of choice.”  The tiny balls of ice, within woven nets of fine hair-thin tendrils of ice, trembled, their reflectivity changing from powdered matte white to shiny pearl.  “Of course I told Fatimah to shut the hell up,” Petros said. “Can you imagine if people started talking about weapons?”  He made a tsking sound, but didn’t move. His passion was exhausted. Frozen.  “Our lamps can heat the surface,” Kedija said.  The readings on the projector showed the terrarium temperature at -104°C and the pressure of just 1.2 µPa, low enough to be doubtful there even was an atmosphere. These were the conditions of the surface, except that the spores here were bathed in warm light.  “Our conscious minds, by observing the ghosts, should put them to rest,” Kedija said.  “It’s just talk,” Petros said. “They couldn’t have brought weapons.”  “Maybe ghosts just want to be remembered,” Kedija said.  One of the spores was more advanced in its melt than the others. Its shiny opaque surface was blebbing outward between bands of icy, hair-thin vasculature. Whatever its surface, it was still unbroken. But the sprout was reaching, across a million years.  “But what if Negasi paid off someone at the UN?” Petros said.  “If we revive the spores wholesale, we don’t know if it’s good for us or not,” Kedija said.  There was a beautiful futility in reaching, a trusting ignorance of the world so profound that it could not but be admired. And it was so distant and alien a feeling that she turned it over in her mind, incredulously.  “I didn’t tell Fatimah any of that,” he said. “That’s dangerous talk.”  “We could kill them all,” she said, “send them back to the ice, where they would die in the cold. If these plants are any danger, we could do that.”  The spore casing was straining, but hadn’t burst yet. She felt like reaching in and just giving it a hand, just to see what strangeness might emerge. Certainly like nothing they knew. These spores were the stranger, in the deepest human sense.  “Even before that, if we don’t turn on the light,” she said, “if we don’t warm them, then they stay frozen forever.”  “But if it’s true,” Petros said, “then we die all over.”  Kedija didn’t sleep. She suited up and cycled out the airlock, onto the icy regolith field that was their new home. The first crude habitats were blocky and inelegant, a race against time to make something to shelter them from the radiation. Their machines and supplies were stacked unevenly, adding weird colors and human invention onto an environment entirely alien.  She walked across a sterile garden of icy pellets and frost-haired shards made not from rain, but smashed out of the hard ice of the ground by micro-meteor impacts over millions of years. They’d blasted their world too. Asmera triggered falling dominoes that scoured the highlands and valleys with fire and plutonium waste. They’d made two nations of ghosts.  Jupiter hung in inscrutable judgment to the south. On the foot-stamped ground ahead of her, at the edge of her helmet light, was a ghostly, transparent centipede, as motionless as the king of the gods. Were they judging too?  Her whole life had been in Asmera. Why had she picked that one day to go hiking, with Petros of all people? She’d barely known him. What observer had made that possibility real, instead of all the other places in the capital she might have been? There was no reason for her to have survived. She was just a freak observation at the extreme edge of probability.  She walked closer. Her helmet light revealed more of the ghosts, all waiting in stillness, just the waving of antennae in the vacuum giving signs of life. But only a sign of life. Not real life. She could see through them.  Kedija might have been in Asmera, and in nightmares and waking, walking dreams, she had been. Did a ghostly version of herself, the path not taken, walk still among fallout fields with the ghosts of families, friends, and all the people she never knew?  Stepping forward, her helmet light revealed more of the centipede ghosts, a whole field of them. What if she wasn’t real at all? What if this was the afterlife, cold and dark, a shade reaching for contact with anyone, anything, unable to understand what she was anymore. She’d had a life in the fenced camps, with her refugee card, her temporary shelter, her food aid. But that didn’t make her any more real than the ghosts.  She’d walked so far forward that nothing man-made was in her vision anymore. Just a field of ghosts beneath her helmet lamp and the orange light of Jupiter.  So many ghosts walked the remains of their homes that no one could remember them all. Only a few thousand of them had survived. Persisted. Millions and millions had burned in radiation stronger than Jupiter’s. There was no more us or them. They’d killed themselves. They’d killed all the Ethiopians. They’d killed all the Eritreans. They were indistinguishable now, just hollow-eyed, shock-hearted bodies trying to live, trying to find something to live for, cut off from humanity, on a hard, cold world.  Negasi’s first Ethiopian habitat wasn’t much better than her Eritrean one. They’d inflated their Martian quick-habitat within a big igloo of ice blocks they’d stacked together. The boxes were still half-packed, the walls hung with wires.  Negasi wasn’t happy she’d come, and now, cycled in, she faced him and a half dozen frowning, resentful faces. Was this what she looked like? Is this what they saw in her, a kind of shocked pitilessness?  “We can’t survive if we don’t work together,” she said.  Negasi was wearing the gun on his hip. “It’s a big moon. We won’t need to work together soon. You go your way. We go ours.”  “We’re going to stay haunted until we work together, or until the haunting kills us,” she said.  His expression turned dubious. She took a reinforcing breath.  “When Asmera was nuked, I lost my mother,” she said. “My brothers. My aunts. Everyone.”  They might not have been expecting this. One of them, a younger man, looked as if she’d hit him.  “I was angry,” she said. “At you all. My mother never did anything to you. I wanted to kill you. Not you Negasi, but all of you. I guess you wanted to kill us, to finish the job. I’m still angry, but I’ve already lost everything. I don’t have anything to lose anymore except maybe the possibility of a future.”  Negasi’s expression shuttered, no longer hard, but not softened either. Neither opened nor closed. Waiting. Judging.  “Revenge won’t bring me or this moon to life,” she said, “but I want to live. But for me to live, you have to live too. It has to be both of us or neither.”  One of them, a woman, shuffled her feet, looking away. The younger man’s expression became confused, as if Kedija had said something alien.  “If the price of you getting to live is that I might laugh one day, is that too much for you to pay, Negasi?” she asked, touching a hand to the chest of her survival suit, seeking a heart lost in the layers.  “The past can keep haunting us, or we can see the ghosts for real and exorcise them,” she said.  “If million-year-old ghosts can reach across time to us, why can’t we reach across a line someone drew between two countries centuries ago, one that is seven hundred million kilometers behind us?”  Negasi had the gun on his hip. And his heart covered. And the hardness in his eyes. But the hardness had a peculiar quality. Shiny. Cold. But in a way that could not be explained, only trusted and felt, the hardness was softening. Melting. As if some other feeling ached to sprout from within him.  Dozens and dozens of them were in the main pyramid, refugees all, Eritrean and Ethiopian, cautious with one another, mixing uneasily, holding hands with their eyes closed. Concentric rings of refugees, under the hard lights. Only Kedija and Negasi’s eyes were open, watching the centipedes, quantum ghosts from a million years ago, collecting. She and Negasi waited.  They’d lost something when they’d been genetically engineered to survive the radiation of their home. Kedija had thought maybe they’d become less human. They had the wrong number of chromosomes now. Their brains were augmented with chips to help them survive, making their perceptions partly electronic. And with the ghosts not disappearing quickly, those quantum echoes of some decision point long in the past, she’d thought that maybe she’d become not only less human, but less conscious.  More and more ghosts appeared.  Human consciousness collapsed possibilities into something real. Human consciousness forced the quantum world to make choices. Why did these images take so long to collapse when observed? She’d been right about the problem, but wrong about the solution.  The ghosts were all around them now. Near feet. Behind the rings of people. Before the rings of people. “Open,” she said into her helmet mic. Dozens of sets of human eyes opened all around her.  Kedija was still human. She just hadn’t felt human, not since the war. But that wasn’t what made the ghosts persist.  These quantum waves had been interacting with one another for a million years in the icy cold of a dead moon. Those interactions had grown huge with age. To force these quantum ghosts to choose a possibility would take a bigger consciousness. More than one person. More than two or three people. They needed to work together, all of them. Agree on what they saw. The refugees stood in their circles, holding hands.  All the ghosts were gone.  Observed.  Disappeared.  Whatever the refugees had seen today, whatever quantum indecision had held these ghosts in their indeterminacy for so long, it was gone now, communicated back across the years by whatever process of spooky entanglement connected events.  The pyramid builders had died, but the refugees were not standing in tombs. These were spore chambers. The spores were like the new human colonists, refugees warehoused into camps. The spores had been waiting millions of years to be welcomed somewhere. Only the warmth of conscious life would tell these spores it was safe to germinate. The spores had needed to know that some community was waiting to receive them as they fled an uninhabitable past. The humans would. And in a way, whatever plants would grow here would be welcoming the refugees too. After leaving molecular biology, Derek Künsken worked with street kids in Central America before finding himself in the Canadian foreign service. He now writes science fiction in Gatineau, Quebec. His space opera heist novels The Quantum Magician and The Quantum Garden were published by Solaris Books. The first was a finalist for the Aurora, the Locus and the Chinese Nebula Awards. Solaris will also be releasing his \"Godfather in the clouds of Venus\" novel The House of Styx in August, 2020. He also writes a fun girl-jetpack-Flash Gordon adventure comic called Briarworld at Webtoons.com.", "text": "7840 words, novelette\nThe Ghosts of Ganymede\nThe cracked, blasted surface of Ganymede came into focus outside the portholes, assuming three-dimensional texture and relief. Jupiter’s yellow-orange planet-shine gave way to the white glare of the lander’s spotlights and the scatter of light within cold jets blowing dust and pebbles and chunks of ice away. Even in the low gravity, the landing jarred, bouncing once, before they came to rest.\nHome. Kedija said the word experimentally in her head, but none of the feelings she associated with home responded to the word.\nThen, everyone was unclipping straps, listening to the ongoing verbal report of the piloting systems, double-checking suit seals, talking to each other with a hint of the hysteria she felt. Over eight months, they’d crossed seven hundred million kilometers to reach Ganymede.\n“We’re here,” Petros said inanely.\nHe was standing, but had gone still, listening, peeking out the porthole. The lander shook as doors opened to the vacuum outside. He offered her a gloved hand. Having gravity again felt strange, but Ganymede’s pull was similar to Luna’s, so she still felt weightless, less than solid.\nKedija stepped down the ladder cautiously. Beneath her, some of her fellow refugees were stretching and waving their arms in the sudden freedom. Others stepped gingerly farther and farther across the pebbled ice, taking in their world. She set down her booted foot, insulated to survive the meager hundred kelvins. There was no magic feeling. No sense of destiny. Only an ongoing sense of dread.\nThey’d landed beside Adapa Crater. Edge to edge it was almost sixty kilometers across, and on its heights, they would built conductor towers to generate electricity as Ganymede traveled through Jupiter’s immense magnetic field. They were under the king of the planets, but looked south to see it, as they were two thirds of the way to Ganymede’s pole.\nThe lander spotlights turned the unlit landscape much darker, and the chips in her head carrying her AI worked to compensate for contrast. Full sunlight at Ganymede would only ever be three percent what she’d seen on Earth. And when the sun was behind Ganymede, Jupiter would shine down with a similar orangey dimness. Rows of hills and plains stretched into the distance, mostly the milky white of concrete-hard water ice, but veined with gray and black where meteorite activity had dropped minerals and metals onto the ice. Their new home was somber.\nSix more landers carrying Eritrean colonists had landed in a curving row beside her lander. Beyond them, following the line of the crater, were six more landers carrying Ethiopian colonists. This was a new Plymouth Rock, five hundred years after the first. Anxieties ebbed as they all began to work. They had a whole colony to build.\nThey had lots of robots, built in the aluminum fields of Luna, and they’d been tested in the cold of the moon’s two-week night, so they should have worked here. They all creaked more than they should have though, working almost reluctantly, cutting blocks of rock-hard ice out of the ground. They needed to build their ice houses over these new hollows, and heat and pressurize them to livable temperatures. The thick ice would protect them from the worst of Jupiter’s radiation and eventually, they would grow gardens, make schools, build factories, homes, families.\nKedija finished another reboot and the robot finally showed only green telltales, before it rolled slowly across the surface on wire wheels, towing aluminum framing up the rise, where other colonists and robots were flattening the top of the crater lip to raise the first of the conducting towers.\nBlotches of bright purple stained her vision and she tried to blink the spots away. They weren’t really in her eyes though. Splotchy purples and blues materialized in her vision whenever Jupiter was in sight, like the king of the planets was reminding them to pay attention. Their suits were heavy with layers of lead shielding, but the faceplates could take only so much lead before they couldn’t see through them. At the wrong angles, the radiation got through and played with the electronic and mechanical implants in their bodies. They needed them to survive, but the radiation did funny things to the implants in their brains, and only so much noise could be filtered out.\n“Hey boss,” Petros said on the open channel. “I think you’d better come see this.”\n“What is it?” she said.\n“You really have to come here,” he said.\nPetros was leading a surveying team about two kilometers into the hills west of the lip of Adapa Crater. Her AI showed his position and mapped the easiest way to get there. A lot more robots were glitching and she wanted to get them moving, but she felt like she’d been coaxing robotic movement for days.\n“Okay,” she said.\nA red light appeared in her ocular implant. Personal message. She took a breath. Then accepted the call.\n“Hello, Negasi,” she said.\n“I thought we said that we’d share information, Kedija,” he said. His breath was raspy, tired. He’d been lifting something. But his tone was always hard.\n“I don’t know what Petros wants, but I need a break,” she said.\n“Finding metals and not telling us?” he said.\n“Come if you want,” she said, hoping he didn’t. “Petros is two klicks out. It’s going to be a hike.”\n“I’ll meet you at west point two in ten,” he said. Then his messaging status turned transparent.\nKedija headed to WP2. Petros better not have found metal and thought to keep it a secret.\nNegasi brought along three members of his contingent. She hadn’t brought anyone. She didn’t exactly feel in danger because of this. She hadn’t felt safe since the start of the war. She hadn’t felt safe in the camps. She hadn’t felt safe training on Luna or on the way out to Jupiter. They didn’t speak on the walk out to Petros. Maybe they were talking to each other on another channel her AI didn’t know. A cold itch hovered over her spine.\nThe geology of Ganymede was stark, sterile, unwelcoming, but carried a hard, strange beauty. Many hills were thrown up in radial rings from Adapa Crater, but age had blunted their sharp edges with some of the western faces showing signs of erosion and melting. Against the black sky studded with cold stars, the effect was not unlovely. No other colony in the solar system would have these features. Mars, the moon, the asteroids all had different geologies. And none of them looked like home. Blotchy blue patches appeared in her vision. She turned away from the insistent glare of Jupiter. This was something they would all have to get used to.\nThe icy ground was uneven and covered with pebbles, sometimes deeply, which kept slowing them. This part of Ganymede didn’t have real regolith, a deep mixture of particles and loose stone, but a layer of dust a few centimeters deep seems to have lain here for all time, only marked by the low gravity skip-hopping footsteps of Petros’ party.\nThey rounded the last hill before coming into sight of Petros’ group. A flat plain of dusted ice lay between them and the next row of hills. Petros’ team was clustered into two groups with their hard white lights reflecting off the white of the ice of the hill they were examining.\nAs she and Negasi crossed the plain, Petros’ hills occluded more of the stars, catching Jupiter’s shine on its flatness. But the closer they got, the less like a hill it looked. The glaring headlamps shining showed a pitted rising surface far flatter and smoother than the other hills. Petros’ team had gathered some measurements and their suit AIs shared with Kedija and Negasi. The flatness was very close to a plane, rising off the ground at sixty degrees. Impacts marked the hill as much as the rest of the surface of Ganymede. The AI analyzed the overlapping impacts, estimating an age above a million years. The AIs guessed that it was made of nearly pure water, with none of the ammonia, nitrates, sulfurs, and other organics and minerals that were part of the ground. Without the impurities, this ice would be far harder at this temperature.\n“A pyramid?” Negasi said.\nPetros turned, seeming surprised that the Ethiopian leader was here. Then he saw Kedija and approached.\n“There’s a whole row of them,” Petros said. “We haven’t looked farther out, but . . . ”\nHis voice trailed off and they followed his sight line. Jupiter’s shine at this angle was just enough to see that this ring was not hills at all. A curving line of flat-topped ice pyramids stood in a trough between two rows of impact hills. The pyramid faces turned relative to one another, always facing Adapa Crater. The distance softened the impact marks on their faces, and the flattened tops almost seemed natural.\n“We never saw them from orbit,” Kedija said.\n“Same size as the hills here,” Petros said.\n“Even the pyramids at Giza can’t be seen from orbit without binoculars,” Negasi said dismissively. “Who made them?”\nOne of Petros’ team radioed from farther along the base of this pyramid. They headed that way. In some places, snow and dust had formed drifts and they stepped through, making expanding clouds. At eighty meters, about halfway across the base, two members of Petros’ team stood at the edge of an opening, six meters tall and about the same wide. Dirty dust and snow lay in the opening, untouched for who knew how long.\n“Holy . . . ” Kedija said, her voice trailing off.\n“Something, some aliens, lived here?” Negasi said. “They left tombs.”\n“But the AIs think they’re millions of years old,” Petros said.\nThe opening yawned around them. Kedija’s AI autofocused her headlamp. The ceiling began at six meters and as they moved inward, it followed the outer slope, out of the reach of light. The walls reflected the light brightly, even where sublimation hollows pitted them and where patches of white hoarfrost furred them. The floor was smooth and took their footprints in the snow and dust as the way yawned open to a silent darkness. The pyramid was hollow.\nAlthough their lamps couldn’t do more than suggest the ceiling with scintillating reflections, the nearby walls showed curving pilasters reaching high into the darkness like white ribs. Kedija neared one. All along the wall, closely-spaced shelves of ice projected about fifty centimeters into the pyramid interior, with only a few centimeters separating one from the next layer. There was nothing on them. Just more snow and dust.\n“They’re set up like radiator vanes,” Kedija said, “but there’s no heat to radiate.”\n“Would that wick away any heat?” Petros said. “Keep the pyramid colder and more solid?”\n“When we tell Earth or Mars about this we’ll be rich,” Negasi said, shining is light up the wall, his grin visible even behind his faceplate.\n“If they find out there’s an alien tomb here, they’ll take Ganymede from us,” Kedija said. “Then where will we go?”\n“I’d like to see them try to live here,” he said, but she noticed he didn’t dispute her point.\n“Where are the crypts?” Kedija said.\nShe swept her light onto the floor. Then she stilled and screamed. Lights swiveled to hers, flashing to scan the dark. The figure was gone.\n“What is it?” Petros said.\n“A thing was there,” she said. “Just there. Like a centipede. Big.”\nNegasi panned his light further, finding nothing but flat floor and the occasional low mound of snow. One of Negasi’s companions knelt at the spot where Kedija had been shining her light. They looked close and in their local web her AI picked up their readings. No thermal. No sonic. No anything. Petros slid a gloved finger along the dust, leaving a trail of of exposed ice.\n“This dust hasn’t been disturbed for . . . ” Petros said, pausing, looking for something they could understand.\n“He means there was nothing here, Kedija,” Negasi said. “Go back to base.”\nShe took a deep breath. The oval of her lamplight found nothing else. Just emptiness and flat floor.\n“Ahya!” Negasi swore, stumbling backwards.\nKedija braced his shoulders before he fell. Her AI swiveled her lamp at the ground. For an instant, she saw a black carapace, a wormlike figure on many legs. She couldn’t tell if it was facing toward or away from them. At each end, the shiny shell bloated like a head, and there was another bulge over its midsection. And in the instant before it vanished, she realized it was transparent. The fine striations in the dust had been visible through it. Negasi marched forward angrily, kicking the dust where it had been. Then, at the extreme edge of their lamplights, more outlines showed in the shadows. More of the creatures.\n“Let’s get help,” Kedija said, pulling Petros back. Negasi and his people didn’t argue.\nKedija and Negasi agreed that neither would report what they’d found to Earth or Mars. It took them a day to organize themselves to go back with enough equipment and lighting to make a real examination of the first pyramid. Most of the colonists were so busy setting up the robots that it was difficult to find help to load the equipment onto the rovers, one of which needed to be assembled. After hefting a generator onto the flatbed of one of the rovers instead of waiting for a lift to be available, Kedija was winded, and took a moment to rest.\nJupiter hung above them, smooth as a marble, hazy with layers of browned orange and beige jet streams of ammonium hydrosulfide, shot with milky highlights of ammonia. And where the ammonium layers thinned, patches of blue from lower cloud decks peeked through.\nThey would know those clouds in a few months, when they managed to get the industrial dirigibles into Jupiter’s atmosphere to harvest helium-3. A century of mining the Earth’s moon was beginning to leave the fusion reactors of Earth hungering. Their new home had been financed on the condition that the refugees mine Jupiter’s helium-3. It wasn’t a deal with the devil. It was work. But it meant the only place they could belong was out here.\nBlotchy purple impinged on her vision again, radiation that her implants and suit couldn’t screen out. The king of the gods didn’t suffer mortals to watch him for long. She blinked and looked away. The patches of nonsensical color remained, ghosts of damage she was taking. She was taking eight rems every day, but her DNA repair genes were engineered to hyperactivity so that she could endure. They would all endure.\nThey finally entered the same pyramid as yesterday, Hamid and Petros driving the rovers right in, lights blazing. The empty majesty of the pyramid rose above them. In the faint gravity only light curving ribs were needed to support the weight of big ice blocks. The pyramids were smooth and seamed and obviously constructed. The odd, closely-spaced shelves she’d noticed yesterday on the walls went all the way to the peak, making them impractical as shelves and much more likely to be vents.\n“The rems are way down in here,” Petros said.\nKedija’s AI offered the radiation count. Depending on whether she was looking at the doorway or not, the radiation was down to millirems, still hundreds of times Earth normal at sea level, but safe enough to live a long time. When they were finished building them, their habitats would be as safe.\n“None of our visitors are here,” Kedija said.\n“Too soon,” Negasi said, but when she followed his pointed hand, there was nothing there.\n“I’m setting up the cameras,” Petros said.\nIn her peripheral vision, a dark shape, long and shiny, appeared and then vanished as soon as her eye darted to it. Hamid turned quickly, in the other direction, but there was nothing there.\n“Ghosts,” Hamid said.\nNo one answered him. Kedija thought she was hearing his heavy breathing in her headphones, but her own faceplate began fogging and she forced herself to be calm.\n“Filming,” Petros said. He’d set up some standard rover cameras on stands, four of them, covering a complete circle.\nOne of the big centipede things appeared about five meters away. It didn’t vanish as soon as she looked at it. Its many legs were still, and the light from Petros’ lamps glinted off what looked like a hard black carapace that fit in overlapping segments.\n“Are you getting this, Petros?” she said. The thing vanished.\n“Oh yeah,” he said, but he wasn’t looking her way. One of the black creatures was before him, only a few meters away. “It’s casting no shadow,” he whispered. And it was mostly true. There was no shadow behind it, but from her angle, Kedija saw a faint blueing of the light onto the icy white floor. Then, it too vanished.\nPetros turned to his cameras, connecting them to his AI. Another centipede, a good meter and a half long appeared right behind him.\n“Look out, Petros!” she said.\nHe spun and miscalculated the force needed and his momentum flung him off the floor, falling over the centipede. His foot passed immaterially through it before it vanished too. Kedija helped him up and checked his suit for damage.\n“I’m okay.”\n“They’re projections,” Kedija said.\n“Where are the projectors?” Negasi asked.\nIt was a good question. So far they’d found nothing that looked like wiring, found no magnetic fields that might be a sign that current was flowing anywhere. And what power source would still be good after a million years?\n“Look,” she said, pointing. Nearer to the corner. Two of the meter-long centipedes were still in an area less covered by spotlights. But enough light reached them to see that there was something strange. One was standing before the other and the proportions seemed odd, the little light reflecting back strangely, distorted. No. One wasn’t standing in front of the other. One was standing within the other, like two ghosts. And where they overlapped, a pattern of light and dark wove itself over them, like seeing them through waves in water.\n“What’s happening to them?” Kedija said.\nThe centipedes vanished. No more of the centipedes appeared.\n“Ghosts,” Hamid said again.\nGhosts. Her mind drifted, like she couldn’t process properly. Ganymede was almost all ice, but so hard that to them it felt rocklike. But on geological scales, parts of the ice were softer. Some of the highest crater walls of the biggest craters eventually just collapsed. They were called ghost craters. But if these pyramids had been here millions of years, why haven’t their ghosts vanished too?\nThe hut was pretty cold. Huge blocks of ice had been lasered and sawed out of the ice, leaving a hole ten meters deep. The blocks had been cut into thick sections and water-welded together in a kind of square igloo structure. Then, they’d inflated a habitat within the hollow and brought in their equipment and stores before installing the airlock. It would take days for the heaters to get it to comfortable temperatures, but it was almost up to zero Celsius. It felt good to get her helmet off.\nFatimah was helping Petros with the display settings and analysis of his camera readings. Fatimah’s hair was short, freshly-shaved, like Kedija’s, the easiest way to have hair when wearing a space suit every day. The external plates holding Fatimah’s AI could do with a polish and her dark eyes shone with the internal light of an ocular display. Kedija rubbed her eyes. In here, they were blessedly protected from most of Jupiter’s radiation and neither Jovian psychedelic blotches nor oversized centipede projections intruded. She blew on her fingers.\n“Negasi doesn’t want to come over here to help with this?” Petros said.\n“I don’t want him here,” Kedija said. “They have their habitats and we’ll have ours.”\nShe looked over Fatimah’s shoulder at the screen. Fatimah was trying to clean up the still images of the two centipedes overlapping.\n“There’s no such thing as ghosts,” Kedija said. “Those are interference patterns.”\nThe odd watery lighting between them was a classic interference pattern. But holograms or 3-D projections wouldn’t interfere like that, not in a way they could see macroscopically. Hamid suddenly cried out and pointed at the wall behind her. They all turned and she glimpsed a large shape on the wall before it vanished.\n“Same?” Kedija asked.\n“This place is haunted!” Hamid insisted.\nPetros examined the wall with a UV lamp.\n“Maybe they’re quantum possibilities,” Kedija said.\nPetros looked back at her, the UV fluorescing on the wall behind his head giving him a halo.\n“No,” he said. “When conscious beings observe quantum probabilities, they collapse into something normal, before we’d ever really see them.”\nBlue fluorescing light from the wall reflected off the edges of the plates on his forehead. His AI, like hers, was more than just an external processor. They shared thoughts with the AI and the AI shared thoughts and observations back. As their radiation resistance made them not exactly human anymore, so too did the AIs change the way they thought. They could do so much more with AIs, could think faster, but it made them lean on the helpers too. Kedija sometimes felt like she was managing her brain rather than inhabiting it, in a way that perhaps wasn’t exactly human either.\n“What if . . . ” she said.\nPetros shut off his UV lamp and looked at her like he was hoping she had a real explanation.\n“What if we’re not as conscious as we thought? This is new,” she said haltingly, tapping the plate on her own forehead. “A robot observing a quantum event doesn’t necessarily collapse its wave function the way humans do.”\nHe frowned. “No one has observed something like that with AI augments, boss.”\nThe lights of the habitat blinked out. All the equipment stopped. Even the fans. Only the pale orange glow of the heating elements cast any light. Then wrist displays and AI plates shone light.\n“Get the emergency power on!” Kedija said.\nThe lights and everything else came on. The fans sounded loud after their brief absence.\n“Something not connected right?” Kedija said.\nPetros frowned, looking at his wrist display, but his eyes glowed as his AI fed him a series of face displays on the inside of his eye. “The AIs think all the hardware is good,” he said. “It looks like a random software failure. The signal to main power just stopped. The software took it as a sign to shut down.”\nThat shouldn’t have happened. Their software was well-tested and had redundancies. The spot on the wall where the centipede thing had appeared was still empty. What had it been doing all the way over here? They’d just built the habitat in the last twenty-four hours. There were no projectors in it. And there were no ghosts. She moved close to Petros, whose expression was starting to look a bit alarmed as he probably chewed through the implications.\n“If these are quantum effects,” she whispered, “could they be interfering with our systems?”\nHis expression took on the wild-eyed intensity she’d seen in so many faces, and in the mirror, after Asmera had been nuked, when they thought they’d lost everything. They hadn’t lost everything. They’d had so much more to lose in the coming months and years.\n“How do we stop them from interfering with our systems?” he whispered. “We came seven hundred million kilometers to find a home. We can’t go back!”\nPetros was on the edge of tears. Kedija hugged him.\n“This is our new home,” she said in his ear, not understanding what those words meant anymore. They had no substance. “This is our home.”\nKedija’s first dreams in the new habitat were of cold, shivering, bone-numbing cold. But a thicket of other dream images threaded into that cold, like shoots of grass forcing their way through pavement cracks. The dream became brighter and brighter, until she was shielding her face with her arm. The flash passed and the shock wave followed, knocking down all the buildings in the outskirts of Asmera. She hadn’t felt the heat. The wave of superheated air had passed over the brick wall laying over her.\nBut she was on Ganymede now, sitting in her sleeping bag, hugging herself and wiping sweat as her heart thumped hard in her chest, still feeling the weight of the building trapping her. The habitat had only warmed to one degree and the chill nipped at her sweat. Around her, people shifted in sleep. No images of huge alien centipedes showed themselves. They weren’t ghosts.\nKedija knew about ghosts. She was already haunted.\nShe rubbed her eyes, trying to banish images of a nuclear strike but succeeded only in replacing them with something almost worse. They were crushed up against fences, hundreds of them, maybe thousands. She hadn’t made it to the fence, but she could see through the heads and shoulders to the UN soldiers on the other side in hazmat suits and gas masks. The soldiers watching them through the glass of their faceplates, not raising their rifles, mute to the desperation of the survivors.\nEthiopia and Eritrea were uninhabitable because some colonel with the launch codes got twitchy. Once the nuclear exchange began, it ran down with deadly inevitability. Half of the warheads were of such poor quality that they achieved only partial detonation, which was almost worse, spreading raw unexploded plutonium over burned ground, irradiating both countries with fallout that made Fukushima, Chernobyl, and Tehran look like practice drills. The survivors gathered in the few low-radiation areas, but couldn’t get out. No country would let them in. And the UN helped hold them where they were.\nMovement flickered on the wall beside her, at the edge of her vision. One of the transparent centipede ghosts clung to the wall.\nThe blue-brassarded soldiers wouldn’t let the survivors beyond the fences to somewhere safe, but the international community was willing to pay to genetically-engineer them for radiation-resistance. None of them were human anymore; wrong number of chromosomes. But the survivors could walk across more of their blasted lands after that, like they were haunting it.\nOnly when Fusion Power Corp came was there any chance to leave. Fusion Power Corp needed helium-3 and their genetic modifications made them the only people on Earth who could survive the radiation on Ganymede. Countries didn’t like paying to help the same refugees for years on end, so FPC’s offer of employment was celebrated as the private sector exercising social responsibility. FPC got the Nansen Medal. The survivors, Eritreans and Ethiopians alike, were exorcised from humanity in excruciatingly slow Hohmann transfer orbits.\nOn her wrist, Negasi’s name appeared on her incoming calls. The ghost beside her vanished.\n“You cut our damn power?” Negasi said.\n“What?” she answered.\n“I put up with you fucking Eritreans on the way to Jupiter, but I don’t have to put up with you now,” he said.\nKedija rose, shivering. Grumbling started in sleeping bags around her.\n“We didn’t cut your power, Negasi,” she said more quietly. “Have ghosts come to your habitat? I just had one here.”\n“Ghosts don’t interrupt life support power,” he said.\nHer stomach sank. Life support problems? That was bad. They could survive radiation, but not minus one seventy, or a hard vacuum. She was missing something.\n“A quantum ghost could mess up the probabilities in your control systems,” she offered.\nIt sounded strange in her ears as she said it.\n“What?” he said.\nShe started putting on her survival suit.\n“Let’s go to the pyramids,” she said.\n“Now?”\n“If they’re bugging up your life support, they won’t be far from ours,” she said. “We have to figure this out.”\nKedija and Petros scrunched out onto the ice to the entrance of the first pyramid. Jupiter the insouciant king hung still, timeless and stately above them. Ganymede showed only one face to Jupiter, which meant Jupiter never set and never moved. It made her feel like time had stopped.\nNegasi was waiting for them with a big man. She squawked in the radio band, the sound they used to replace a physical gesture of the head or face to greet someone. Instead of responding in kind, Negasi tapped his waist. A holster hung there.\n“You brought a gun to Ganymede?” she said.\n“I won’t forget Adigrat,” he said.\nAdigrat. That was his ghost. Her ghost, Asmera in Eritrea was the start of the war. Adigrat in Ethiopia was the last city on either side to die. Many had thought it safe. It had no military value and survivors had been streaming in for days. Kedija hadn’t made the war. She’d suffered it, like all of them. She wanted to leave it behind, but ghosts appear like time hasn’t passed.\n“This is no trick, Negasi,” she said, but in her ears, her words sounded exhausted, the exhaustion that could only start in the marrow.\nShe lead them into the pyramid. They’d left some lights on to record, to try to understand where the projectors were, if there were projections. She didn’t think they’d find any. Dozens of the transparent centipede ghosts stood, occasionally twitching or turning. Those that were close to one another occasionally appeared indistinct and watery, like an image seen through the surface of a burbling stream. Some of the ghosts began to disappear.\n“These might be quantum images,” she said to Negasi. “They interfere with one another. They sometimes vanish when we observe them. They could be interacting with our microlevel systems.”\nThere was just enough light to see Negasi’s dubious expression behind the faceplate.\n“We have a quantum pest control problem?” he said.\n“Not a pest,” she said, considering the vanishing centipedes. Others appeared elsewhere. She’d set her AI to think about them, but making recordings was difficult, and her AI hadn’t come to a conclusion as to whether they were all the same or different creatures.\n“Something built these tombs,” she said. “They left something of themselves behind. Not writing. Interacting probabilities.”\n“These are alien hieroglyphs?” he said. “I don’t care about a memorial for an extinct species! We were almost extinct. We have to live. This is our turn!”\nThis is our turn. The words pulled in her chest.\nNegasi was pointing at Petros, who looked uncomfortable. “You! You were one of her students, weren’t you? How do you get rid of quantum . . . pests?”\nPetros could only try to shrug, an awkward gesture under kilos and kilos of a lead-lined survival suit.\nKedija crouched, approaching one of the centipede things. It wasn’t vanishing yet.\n“When a conscious mind observes a quantum event,” Kedija said, “the probability wave collapses. What had been possibilities before becomes a concrete decision. These don’t disappear very fast. If these are manifestations of quantum probabilities, they’re so complex that it might be that our consciousness isn’t large enough to collapse the wave function.”\n“I don’t care what they are,” Negasi said. “They’re endangering us. Get rid of them! If you won’t, we will.”\n“You’re not in Ethiopia anymore, Negasi,” she said. “You don’t get to tell anyone what to do. We’re all just people now.”\nThe ghost centipede before her finally vanished.\n“The past doesn’t vanish when you look at it, Kedija.”\n“No,” Hamid said into his wrist communicator, to the teams checking the outage. “It’s down again. It’s down again. No. It’s down again. Reboot it?”\nIt was the second time today that primary power systems were glitching. Hamid thought it was heating-cooling problems with the couplings. A lot of their environmental tech had been designed for Mars, whose temperature swings were larger, but more gradual. In their race to put up their shelters, they’d maybe run their power systems too hot. Or maybe not.\n“More and more quantum ghosts are appearing,” Kedija whispered to Petros, the white vapor of her words vanishing in the cold. Their helmets were off, but their suits were still on. The temperature in the habitat had plunged to forty below. Hamid led the efforts to get primary power back.\n“They’re interacting with us,” she said. “We’re becoming part of their probabilities.”\nThe display screen in front of Kedija and Petros had nothing to do with the power systems. It showed the characteristic pattern of electromagnetic wave interference, over a recording of two of the centipede ghosts.\n“The morphology of this one is different from that one,” she said, pointing. The differences between the two ghosts were subtle. On one of them, the features she called “head,” despite the fact that there were ridges on both ends of the body, were larger. And on the smaller-headed one, there was the suggestion of a third “head” in the middle of the body. Each of these head-features was the source of the waves that were creating the interference patterns.\n“If there are several kinds of ghosts,” she said, “they might be descended from different quantum probabilities. And when two different kinds interact, it messes with our systems.”\n“It’s one thing for a single electron to interact with itself as it goes through both slits of an experiment,” Petros said. “This is macroscopic.”\n“Macroscopic-level quantum behavior has been observed in special cases,” she said. “It’s weird, not impossible.”\n“Does Negasi buy it?”\n“I sent him these recordings with my analysis an hour ago,” she said. “I should call him.”\nThe lights and fans came on, blowing cold air. The heating coils began to glow. A wan cheer rose from the people around them.\nKedija stepped away, calling Negasi.\n“What is it?” Negasi asked as he answered.\n“I don’t think the ghosts are individuals in the way we are,” she said in a low voice lost in the bustle. “Ganymede is cold enough that their brains could probably quantum process if they were built of the right materials.”\n“That doesn’t help our life support.”\n“If the aliens thought with quantum logic, maybe they were even entangled to each other,” she said. “If so, they’re they’re still entangled and interacting.”\n“I was already tired of being entangled with you,” Negasi said. “Now we’re entangled with them? If they like the cold, let’s cook their pyramids. I have my engineers drawing up some plans for it.”\n“They’re thinking,” she said. “I think.”\n“Ghosts don’t think.”\nHe hung up. Petros came close. “He didn’t go for it?” he said.\n“I don’t know what it is,” she said. “We’re in the dark and he’s thinking crazy.”\n“It doesn’t matter,” he said. “We don’t have the nuclear power to melt millions of tons of ice.”\nKedija barked a short laugh.\nFatimah came near with a small pad. “We’ve finished looking at the dust from the shelves,” she said, handing the pad to Kedija.\nKedija rotated the pad, looking for some point of reference. It looked like an image of an electron micrograph, grainy with odd lumps of dust around a central ball with complex ropey growths webbing it.\n“The dust in the pyramids has a lot of structure,” Fatimah said. “Like spores.”\n“Dangerous?” Kedija asked.\n“Not to us,” Fatimah said. “At a hundred and seventy below outside, they’re solid. They melt completely at room temperature. Around minus a hundred though, they’re like jelly, and we think they can sprout.”\n“What do they grow into?” Kedija said.\nFatimah shrugged awkwardly in her survival suit. Petros took the pad and looked at her results. Fatimah swiped to other images and expanded them, showing him her work. Only Kedija noticed the centipede ghost that had appeared near her feet. While Fatimah was still swiping, Hamid’s look followed Kedija’s and then became wide-eyed. When Fatimah finally looked, the ghost vanished.\n“Did it take three of us to make that one vanish?” she said.\nA cramped little room with double-walled insulating plastic was set aside as a lab. Long after two in the morning. Kedija was slumped in her chair, chin in hands, elbows on the table. Petros sat beside her, leaning against the wall. Under a strong light, in a sealed chamber like a terrarium, little spores were warming. Cameras in the chamber magnified the spores and projected them on the wall, beside temperature and pressure readings.\n“I heard Negasi somehow brought weapons in their ships,” Petros said.\n“We’re not just observers of some events from a million years ago,” Kedija said. “We have a kind of choice.”\nThe tiny balls of ice, within woven nets of fine hair-thin tendrils of ice, trembled, their reflectivity changing from powdered matte white to shiny pearl.\n“Of course I told Fatimah to shut the hell up,” Petros said. “Can you imagine if people started talking about weapons?”\nHe made a tsking sound, but didn’t move. His passion was exhausted. Frozen.\n“Our lamps can heat the surface,” Kedija said.\nThe readings on the projector showed the terrarium temperature at -104°C and the pressure of just 1.2 µPa, low enough to be doubtful there even was an atmosphere. These were the conditions of the surface, except that the spores here were bathed in warm light.\n“Our conscious minds, by observing the ghosts, should put them to rest,” Kedija said.\n“It’s just talk,” Petros said. “They couldn’t have brought weapons.”\n“Maybe ghosts just want to be remembered,” Kedija said.\nOne of the spores was more advanced in its melt than the others. Its shiny opaque surface was blebbing outward between bands of icy, hair-thin vasculature. Whatever its surface, it was still unbroken. But the sprout was reaching, across a million years.\n“But what if Negasi paid off someone at the UN?” Petros said.\n“If we revive the spores wholesale, we don’t know if it’s good for us or not,” Kedija said.\nThere was a beautiful futility in reaching, a trusting ignorance of the world so profound that it could not but be admired. And it was so distant and alien a feeling that she turned it over in her mind, incredulously.\n“I didn’t tell Fatimah any of that,” he said. “That’s dangerous talk.”\n“We could kill them all,” she said, “send them back to the ice, where they would die in the cold. If these plants are any danger, we could do that.”\nThe spore casing was straining, but hadn’t burst yet. She felt like reaching in and just giving it a hand, just to see what strangeness might emerge. Certainly like nothing they knew. These spores were the stranger, in the deepest human sense.\n“Even before that, if we don’t turn on the light,” she said, “if we don’t warm them, then they stay frozen forever.”\n“But if it’s true,” Petros said, “then we die all over.”\nKedija didn’t sleep. She suited up and cycled out the airlock, onto the icy regolith field that was their new home. The first crude habitats were blocky and inelegant, a race against time to make something to shelter them from the radiation. Their machines and supplies were stacked unevenly, adding weird colors and human invention onto an environment entirely alien.\nShe walked across a sterile garden of icy pellets and frost-haired shards made not from rain, but smashed out of the hard ice of the ground by micro-meteor impacts over millions of years. They’d blasted their world too. Asmera triggered falling dominoes that scoured the highlands and valleys with fire and plutonium waste. They’d made two nations of ghosts.\nJupiter hung in inscrutable judgment to the south. On the foot-stamped ground ahead of her, at the edge of her helmet light, was a ghostly, transparent centipede, as motionless as the king of the gods. Were they judging too?\nHer whole life had been in Asmera. Why had she picked that one day to go hiking, with Petros of all people? She’d barely known him. What observer had made that possibility real, instead of all the other places in the capital she might have been? There was no reason for her to have survived. She was just a freak observation at the extreme edge of probability.\nShe walked closer. Her helmet light revealed more of the ghosts, all waiting in stillness, just the waving of antennae in the vacuum giving signs of life. But only a sign of life. Not real life. She could see through them.\nKedija might have been in Asmera, and in nightmares and waking, walking dreams, she had been. Did a ghostly version of herself, the path not taken, walk still among fallout fields with the ghosts of families, friends, and all the people she never knew?\nStepping forward, her helmet light revealed more of the centipede ghosts, a whole field of them. What if she wasn’t real at all? What if this was the afterlife, cold and dark, a shade reaching for contact with anyone, anything, unable to understand what she was anymore. She’d had a life in the fenced camps, with her refugee card, her temporary shelter, her food aid. But that didn’t make her any more real than the ghosts.\nShe’d walked so far forward that nothing man-made was in her vision anymore. Just a field of ghosts beneath her helmet lamp and the orange light of Jupiter.\nSo many ghosts walked the remains of their homes that no one could remember them all. Only a few thousand of them had survived. Persisted. Millions and millions had burned in radiation stronger than Jupiter’s. There was no more us or them. They’d killed themselves. They’d killed all the Ethiopians. They’d killed all the Eritreans. They were indistinguishable now, just hollow-eyed, shock-hearted bodies trying to live, trying to find something to live for, cut off from humanity, on a hard, cold world.\nNegasi’s first Ethiopian habitat wasn’t much better than her Eritrean one. They’d inflated their Martian quick-habitat within a big igloo of ice blocks they’d stacked together. The boxes were still half-packed, the walls hung with wires.\nNegasi wasn’t happy she’d come, and now, cycled in, she faced him and a half dozen frowning, resentful faces. Was this what she looked like? Is this what they saw in her, a kind of shocked pitilessness?\n“We can’t survive if we don’t work together,” she said.\nNegasi was wearing the gun on his hip. “It’s a big moon. We won’t need to work together soon. You go your way. We go ours.”\n“We’re going to stay haunted until we work together, or until the haunting kills us,” she said.\nHis expression turned dubious. She took a reinforcing breath.\n“When Asmera was nuked, I lost my mother,” she said. “My brothers. My aunts. Everyone.”\nThey might not have been expecting this. One of them, a younger man, looked as if she’d hit him.\n“I was angry,” she said. “At you all. My mother never did anything to you. I wanted to kill you. Not you Negasi, but all of you. I guess you wanted to kill us, to finish the job. I’m still angry, but I’ve already lost everything. I don’t have anything to lose anymore except maybe the possibility of a future.”\nNegasi’s expression shuttered, no longer hard, but not softened either. Neither opened nor closed. Waiting. Judging.\n“Revenge won’t bring me or this moon to life,” she said, “but I want to live. But for me to live, you have to live too. It has to be both of us or neither.”\nOne of them, a woman, shuffled her feet, looking away. The younger man’s expression became confused, as if Kedija had said something alien.\n“If the price of you getting to live is that I might laugh one day, is that too much for you to pay, Negasi?” she asked, touching a hand to the chest of her survival suit, seeking a heart lost in the layers.\n“The past can keep haunting us, or we can see the ghosts for real and exorcise them,” she said.\n“If million-year-old ghosts can reach across time to us, why can’t we reach across a line someone drew between two countries centuries ago, one that is seven hundred million kilometers behind us?”\nNegasi had the gun on his hip. And his heart covered. And the hardness in his eyes. But the hardness had a peculiar quality. Shiny. Cold. But in a way that could not be explained, only trusted and felt, the hardness was softening. Melting. As if some other feeling ached to sprout from within him.\nDozens and dozens of them were in the main pyramid, refugees all, Eritrean and Ethiopian, cautious with one another, mixing uneasily, holding hands with their eyes closed. Concentric rings of refugees, under the hard lights. Only Kedija and Negasi’s eyes were open, watching the centipedes, quantum ghosts from a million years ago, collecting. She and Negasi waited.\nThey’d lost something when they’d been genetically engineered to survive the radiation of their home. Kedija had thought maybe they’d become less human. They had the wrong number of chromosomes now. Their brains were augmented with chips to help them survive, making their perceptions partly electronic. And with the ghosts not disappearing quickly, those quantum echoes of some decision point long in the past, she’d thought that maybe she’d become not only less human, but less conscious.\nMore and more ghosts appeared.\nHuman consciousness collapsed possibilities into something real. Human consciousness forced the quantum world to make choices. Why did these images take so long to collapse when observed? She’d been right about the problem, but wrong about the solution.\nThe ghosts were all around them now. Near feet. Behind the rings of people. Before the rings of people. “Open,” she said into her helmet mic. Dozens of sets of human eyes opened all around her.\nKedija was still human. She just hadn’t felt human, not since the war. But that wasn’t what made the ghosts persist.\nThese quantum waves had been interacting with one another for a million years in the icy cold of a dead moon. Those interactions had grown huge with age. To force these quantum ghosts to choose a possibility would take a bigger consciousness. More than one person. More than two or three people. They needed to work together, all of them. Agree on what they saw. The refugees stood in their circles, holding hands.\nAll the ghosts were gone.\nObserved.\nDisappeared.\nWhatever the refugees had seen today, whatever quantum indecision had held these ghosts in their indeterminacy for so long, it was gone now, communicated back across the years by whatever process of spooky entanglement connected events.\nThe pyramid builders had died, but the refugees were not standing in tombs. These were spore chambers. The spores were like the new human colonists, refugees warehoused into camps. The spores had been waiting millions of years to be welcomed somewhere. Only the warmth of conscious life would tell these spores it was safe to germinate. The spores had needed to know that some community was waiting to receive them as they fled an uninhabitable past. The humans would. And in a way, whatever plants would grow here would be welcoming the refugees too.\nAfter leaving molecular biology, Derek Künsken worked with street kids in Central America before finding himself in the Canadian foreign service. He now writes science fiction in Gatineau, Quebec. His space opera heist novels The Quantum Magician and The Quantum Garden were published by Solaris Books. The first was a finalist for the Aurora, the Locus and the Chinese Nebula Awards. Solaris will also be releasing his \"Godfather in the clouds of Venus\" novel The House of Styx in August, 2020. He also writes a fun girl-jetpack-Flash Gordon adventure comic called Briarworld at Webtoons.com.", "source": "https://clarkesworldmagazine.com/kunsken_01_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Ghosts of Ganymede by Derek Künsken"}