{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Dennard Dayle", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "JdLfa/L/ktViMHQlpUWDsvI0LFw=", "id": null, "license": null, "comments": "", "raw_text": "3630 words, short story  Own Goal  January 2 Today’s Album: Crash the Colony, by Desert Tsunami I spent the first half of the day comparing caskets. I’d never organized a funeral before, but I knew the body had to go somewhere.  The front-runner offered a protective layer of hand-engraved silica tiles. A good casket needed to look like it could survive reentry. Odds were it never got the chance and simply joined the rest of the space junk floating around between colonies. But a sturdy casket gives attendees peace of mind. They imagine everyone in Mom’s generation ends up back on Earth eventually.  I thought that way when she was sick. Now that she’s gone, I’m not sure it matters where I send what’s left. Nonetheless, I didn’t have anything better to do at work, so I scrolled through a catalog online. The eye implant’s good for getting away with that kind of thing.  My art partner caught me at noon.  “Any ideas on the brief?” he asked. Agile Hands pats itself on the back for having individual employee offices, but people feel excess comfort walking into mine. My hands had drifted into my pockets, my feet had drifted onto my desk, and my monitor had drifted to sleep. Not the best look before an industry lifer like Zane.  “A few.”  “Like what?”  Zane’s a big guy, which I suspect led to his current habit of invading personal space. Less muscular people had that habit kicked out of them in high school. The last time I got a drink in him, he said he considered bodybuilding “an extension of art direction.” He’d simply taken creative control of his body.  “I’m thinking about it.” Holding eye contact’s tough while using the implant, but I’m a decent multitasker. I pulled up the brief in my left eye and watched Zane with my right. He planted one arm against the wall, channeling a disappointed babysitter. This made keeping a straight face harder, but I maintained.    Creative Brief  Project Code: 081947 The Product Harvester, a tungsten-rod launcher with category-leading range and accuracy. Creative Objective Distinguish Harvester in a crowded APW (anti-planetary weapon) market. Target Audience Either faction in the arms race between Demes and Unity. Category Insight Both factions need weapons capable of RPE (rapid population elimination) at minimum cost. Brand Insight Harvester trivializes current orbital defense systems, allowing near instant and consistent elimination of HPTs (high population targets). Brand Weaknesses Advances in propulsion render Harvester ineffective against gunships and other (relatively) mobile military targets. Thus, usefulness is contained to planets and colonies. Brand Personality Powerful. Confident. The social contract saved me: after two years working with me, Zane knew I hadn’t touched the brief yet. But advertising partnerships are based on results, not shared principles. Chastising me only became worthwhile if I couldn’t come up with something usable.  “Try to finish thinking soon,” said Zane. “The red flag meeting’s tomorrow. We need something worth showing Anthony. You know, proof we didn’t spent the holidays thinking.”  “Got it. Work on a composite of a woman at ease. Older, and artsy. Defense pitches are saturated with images of jarheads saluting flags, so we’ll stand out.”  “Fine, but what’s the headline?”  “I’m thinking about it.”  That got him out of my office, albeit tenser than he’d arrived. I counted to fifteen in case he cycled back with a new problem or admonition. When he failed to materialize, I returned to the catalogs. Restful Hills had a black silica tile series that looked promising.  January 3 Today’s Album: None of Your Showbusiness, by Re:Volution I took the journaling idea from Mom. And the word “journaling.”  While I like the feel of a pen, I’m thinking of ditching the physical book. Most paper’s a Union import, and socially conscious types like to glare at me on the shuttle. I can get away with a fancy watch on my wrist or computer in my head, but paper crosses some invisible line.  As I write this, there’s a man with a fauxhawk staring daggers into my forehead. I get that people are on edge. We all know people on Union or Demes colonies and prefer them alive. It’s no excuse for posturing at strangers like a child. That’s how you get your head cracked at a show. Not that I’d know, I haven’t been to a decent concert in a year. Too many late meetings.  Take today’s pitch review. In the wonderful world of theory, it ended at five Colonial Time. In practice, less than half the creative teams had finished presenting. I’d have snuck in some journaling, but Zane would’ve smacked any obvious distractions out of my hands. Another argument against print. I could have written an erotic novel on the eye implant without anyone knowing or caring.  Agency pitches are like billion-dollar nesting dolls. First, creative teams pitch ideas to each other. Then creative teams pitch their best (results vary) idea to creative directors, who pitch the best surviving ideas to the resident alcoholic agency director. The agency director brings their best (typically mediocre) account people to a client meeting, where they pitch the remains of an idea strained through three layers of human opinion to prospective customers. Clients then accept or reject our work based on the quality of their breakfast.  Mercifully, I only have to deal with the first layer of this process. Zane aspires to more. He’s welcome to it.  Around six, Zane killed a pleasant daydream by tapping my shoulder. I wanted to break the finger. Violence has been on my mind this week. Hopefully it’ll pass with the funeral. Copywriting pays, but lawyers and therapists charge more.  “We’re up,” he said. We marched to the front of the conference room and stood together before the firing squad. Ten writers, ten artists, and one creative director. Anthony Marsico sat at the head of the table in the reclined, semi-awake stance I wished I was in. I guess you have to work your way there.  Anthony softly rapped his pencil against the table, eraser first. He drummed his way through most meetings in three-quarter time. I’d already given up on interpreting it as a positive or negative sign. It’s just something he does. There are worse quirks for creative directors.  “Have anything?” Anthony asked.  “Of course. We’ve been thinking a lot about it.”  Zane’s shoe (expensive) gently stepped on my shoe (less expensive). I canned the rest of the joke. Then he tapped the wall, bringing up our slide. Somehow, he’d turned my last-minute direction and copy into something cohesive.  We chafe, but Zane does beautiful work. Our slide looked like he’d made it in weeks instead of hours. The protagonist (a composite of five stock models) stood beside a half-finished marble bust. The bust’s face mirrored hers, down to the braided ponytail, nose ring, and wry smile. I’d argued against the nose ring—a little too old-fashioned, even at her age—but Zane had the final call on aesthetics. The results were hard to dispute. Both faces had the easy, natural confidence created through extended, artificial effort.  I marred the image with a slim line of copy. Chisel: Creative Destruction.  “As you can see, I’ve changed the name,” I began. “Stay calm.”  Lukewarm laughter followed. No stomp from Zane, so we were in business.  “Demes is a liberal republic, and Union is a theocracy. Both systems rely on a self-image as the good guy. The name Harvester chafes with that somewhat.”  “The new name, Chisel, speaks to that impulse. It implies a deft hand and creative mind, a self-image the best and worst generals share. More importantly, it implies precision. The feature that distinguishes a tungsten-rod launcher from its competitors.  “Biological weapons like DuraVirus, Loki’s Curse, and Bubblegum Fever are blunt instruments. They don’t just take out the colony you target; they take out everyone the target’s traded with for the last decade. Which, all too often, includes you. Food prices spark more wars than ideology, the current conflict notwithstanding.”  “Chisel is a thoughtful deletion. It contains damage to the target city, moon, or colony. Leaving a more aesthetically pleasing galaxy behind.”  I imagined cheers. I imagined getting fired. All Anthony did was nod and check something off in his notebook.  “Solid. I’ll make it slide four,” said Anthony. It was the first eye contact he’d made with me all meeting.  I thanked him for his time and sat down. There were no signs of success, failure, or skirting by. Either way, I was done thinking about kinetic bombardment.  January 4 Today’s Album: Cerebral Riot, by Cerebral Riot It’s done.  When I carried that casket, my brain went AWOL. It was like being twelve again. I got caught up wondering if fat people’s caskets were harder to carry, or if funeral homes gently nudged their next of kin toward lighter caskets. Any puerile line of thought felt easier than confronting the present.  I assume people cried. I must have as well, unless today’s the start of my career as a serial killer. Not that those guys get far these days.  We loaded her casket onto the Nebula III, along with thirty-three of December’s other casualties. The name drives me crazy. Memorial airlines love that Raygun Gothic stuff, but it does nothing for the bereaved. If I had that contract, I’d class up the rocket names a little. Or at least get rid of the numbers.  The chaplain gave my brother and I a port number and date for the launch. Martin thanked him, but I felt less diplomatic. Watching Astral Trails LLC shoot my only parent into space isn’t on my short list. I hope no one’s there to watch me liftoff. In fact, I might get cremated instead.  Martin and company shuffled me to a second location. Some kind of bingo hall or rec center willing to host thirty depressed Jamaicans. The caterers had real beef, which was nice. It helped me soak up the rum.  A trio of aunts (all aunts are one person in my head) tried to corner me for a stroll down memory lane, so I took a cigarette break. I quit smoking three years ago, and I’ve managed to stay off it (half suggestion therapy, half willpower), but I generally keep that tidbit to myself. Cigarette breaks are the perfect excuse to get out of any room.  The rat that invented the post-funeral event deserved whatever happened to them. As if burying someone isn’t depressing enough without meeting everyone else left behind.  I resolved to spend the rest of the year away from next of kin. For real emotional support, you need someone that doesn’t give a shit. Other mourners are like other drowners. You just pull each other down.  Martin picked this moment to reappear.  “How’s the job?”  His usual opening. Today it stumped me. Was there anything I hadn’t said a dozen times before? Any answer that wouldn’t make me feel like an idiot? I pawed at my phone to play for time.  “Sorry,” said Martin. “I wanted to be casual. I know you don’t like to talk about the big stuff.”  The big stuff. “No problem.”  “That, and I noticed none of your coworkers were here.”  “Why would they be?”  “I mean, you’ve been there for four years. I have one or two people from work here.”  “That’s rude.”  “Emotional support’s rude?”  Touché. I’d forgotten that Martin actually understood people. Colony people tend to double down on the old habit of treating coworkers like friends and friends like family. A natural side effect of the first colonists leaving everything else behind.  “Guess not. But your work-life balance is warped.”  “I work half as much as you do.”  “Like I said. Warped. You could quit or get fired tomorrow, and never see those people again.”  Martin went back inside, presumably to comfort the rest of the bereaved. I wished for a real pack of cigarettes to warm me up. The colony still didn’t have real seasons. Just days that were too hot and nights that were too cold.  January 5 Today’s Album: Strap In, by The Dirt Sisters Union declared war on Demes. Which is fair, since Demes hit two Union colonies with Bubblegum Fever. If we’re lucky, no contaminated ships or cargo make it here. If we’re not, this is one of my last entries.  I’m going drinking.  January 6 Today’s Album: Graveyard Earth, by Sunny and the Optimists We’re not dead, so I took today off. My job all but ceases to exist between pitches anyway.  It gave me some time to thumb through what I’ve written so far. Mostly good, but I tore out the page about my last date. Posterity doesn’t need my half-assed sex life, and I think the rest is more engaging.  That said, the dialogue’s a bit skewed. Everything’s tweaked to be funnier, or more concise, or long enough to fill the last line on a page. My comebacks get faster, and everyone else gets a little duller. It’s less of a record of my life and more of a prime-time adaptation.  That might say something about journalists. As in reporters, not people who journal. When Demes’ cleric sovereign reportedly told the Union premiere to “Consider your next move carefully,” he may have said something closer to “Kiss my ass, degenerate.” That strikes me as less of a bad movie line and more like something that leads to dumping Bubblegum Fever on a civilian colony.  I’m biased, but I’d rather be rodded. Contact, explosion, done. Bubblegum Fever takes time. Nothing vital melts first, only a few hours in. Points to whoever came up with the name. That’s a professional. I’m sure he and Zane would get along.  Good ad writing’s closest to poetry. Stand-up’s equally apt, but that crowd wouldn’t writhe as much under the comparison. Decent taglines emerge from rewriting the same sentence until a perfect, airless version emerges. Unless you half-ass it. Like in poetry, there’s significant incentive to punch out early, get drunk, and watch awards roll in anyway.  Navel-gazing aside, I’m done reading the news. If the guys upstairs are smart, they’ll keep us neutral. If they’re not, I’d rather not think about it.  January 7 Today’s Album: Omnicidal Tendencies, by Temujin I got an award today. Just an in-agency one, but it’s still a decent boost.  They mailed it straight to my apartment, sparing me the waking nightmare of carrying a package on the shuttle. Everyone’s already on edge since open war broke out, and I didn’t need someone snapping on me for taking up too much space in the sardine can. People have gotten stabbed for less.  Like everything from Agile Hands, it came in a light blue box. Our brand colors are blue and silver, a combo Zane says should have led to a designer losing his hands. I think it looks decent, but I don’t have a horse in that race.  The box held a bottle of wine, a handwritten note on silver card stock, and a palm-sized, cube-shaped trophy. I don’t get the cube thing either. Maybe the design team went through an abstract phase.  I still have a little home training, so I started with the note.  Dear Leon,  This is for going the extra mile during the pitch. We’re the first—and only—agency on the Harvester account. Or should I say Chisel?  To be honest, I wasn’t sure you’d be up for this. Anyone can see that you’re going through something, even if you’re not much for sharing. I imagine it’s a girl. I’ve been around long enough to know what relationship drama can do to a young talent.  You pushed through whatever is going on, and I can’t thank you enough for that. Chisel opens doors for us. Anti-Planetary Weapons contractors pull from a small list of branding agencies, and this contract puts us on that list. I’ll remember your part in making it happen.  Drink this with someone in a cocktail dress. You’re a hot item now.  Best,  Anthony  The last line took me out of it. Did people I know wear cocktail dresses? Did anyone? I’d never seen one outside of a movie.  I flipped the card and found a hand-drawn smiley face with dollar signs for eyes. “Big Money Leon” was scribbled underneath in cursive. Some of Anthony’s old illustration instincts were leaking through. The boss likely had a book of similar sketches that would never see the light of day.  After trashing the note and box, I poured half the wine into a novelty water bottle. My gym had printed oversized “Ahead of the Pack” bottles for last year’s spring marathon, an event I survived three miles of. Then I hauled the wine to the living room, opened a web browser on the east wall, and searched for pictures of women in cocktail dresses.  It seemed to mostly be a white girl thing. There were a few token pictures of black women at a Panthers 4 Peace fundraiser, but most cocktail dress owners looked like variations of my ex. I picked one in a blue cocktail dress with a face that was two degrees removed from Angeline’s instead of one.  “Cheers,” I said before killing the bottle. I’d planned on savoring the drink, but that felt off-tone.  January 8 Today’s Album: Soothing Whale Songs, by Automated Butcher I cracked and checked the news. We’ve been allied with Demes for two days.  I also missed a call from Martin. I’ll hit him back later.  January 23 Today’s Album: N/A I always assumed they’d save the rich first, or at least the politicians. The evacuation wasn’t nearly organized enough for that. Luck got me much further than social climbing.  Mom’s launch was the only reason I made it to a ship. I was already idling around the docks, recovering from my stomach’s failure to adjust to the lack of artificial gravity. I threw up a few more times this morning than I’m comfortable admitting. The only people accustomed to zero-g are astronauts, soldiers, and liars.  I’m generally good at ignoring the guilty voice in my head, but Mom’s launch was the limit. I had to see her off in person. All the death in the news made it impossible not to think about hers, and I wouldn’t have a second chance. Surprisingly, there was no sign of Martin. I guess we both changed our mind at the last moment.  I kept to the back for most of the ceremony. The priest (a navy chaplain—they like order at the docks) was the spitting image of Zane’s composite model. She read a bible passage about rebirth, which I found disappointing. Mom was more about the songs. Scripture was something she sat through to get to the music. The Nebula III’s countdown started without a note of music, so I hummed “Will the Circle be Unbroken.” No one stopped me, even when I started singing it. As a sober atheist belting an antebellum spiritual, I felt as strange as I looked.  Still, it was better than the funeral. I didn’t have to deal with anyone else that knew her. It was just me and her memory. Until the sirens.  I’d never heard the tone or pattern; the raid alarm must have changed since I left high school. Nonetheless, when a high-pitched alarm drowns out every noise in a wartime colony, people move. Human traffic pushed me toward the ships before I even resolved to find one. Sometimes you can trust the wisdom of crowds.  I searched the processing lines for Martin, or a friend, or even Zane. No luck, but they might have made it. There were too many faces to pick out anyone, and they kept better track of the news than I did.  Keep. I mean keep. I need to think present tense to stay sane.  Eventually, I wound up on a navy carrier called Ark 36. Humans were the only fauna on board, and there were significantly more than two of us. I barely had room to scratch my thigh, let alone lift my arm. I can only write this now that they’ve opened the engine rooms and gun bays to the general population.  The observation monitors provided our one source of information and hope. The colony design, which I didn’t think about 364 out of 365 days of the year, looked beautiful. Humanity had built a perfect metallic ring in space, kept it intact, and moved inside. I could understand why Mom had moved. The colony’s existence alone represented new possibilities.  Ships fled by the dozen, but we needed hundreds. Thinking of the people stuck on the ring gave me a headache. Realizing how many of them I knew made it worse.  Chisel worked quickly and quietly, as advertised. First there wasn’t a hole in the colony, and then there was. The rods didn’t make for much of a show, flitting through and past my home in half a second.  The explosion provided more conventional drama. A ball of white fire enveloped everything that meant anything to me. The other survivors screeched in at least six different languages, begging and accusing their respective gods. I assume I screeched too. I may have even found religion. Memory has a way of protecting us from itself.  Then my left eye went dark. The navy grunts said the electromagnetic pulse from the colony reactor fried most evacuees’ implants. Fair trade for survival. I tapped my eye twice, under the vain hope that turning it off and on again would make a difference. Nothing. I’m half blind for the foreseeable future.  Soon we passed a memorial ship. A different model than Mom’s, but around the same size and company. At the rate we fled, we’d catch up to her ship in hours. We were racing the dead. Dennard Dayle is a fiction writer and comedian. His writing has appeared in McSweeney's Internet Tendency, Matchbook, The Hard Times, POSTblank, and various other journals and anthologies. His personal site See More Evil hosts satirical projects covered by The New York Post, AM New York, and other news sources. He has an MFA in Fiction from Columbia University and Bachelors in English from Princeton University.", "text": "3630 words, short story\nOwn Goal\nJanuary 2\nToday’s Album: Crash the Colony, by Desert Tsunami\nI spent the first half of the day comparing caskets. I’d never organized a funeral before, but I knew the body had to go somewhere.\nThe front-runner offered a protective layer of hand-engraved silica tiles. A good casket needed to look like it could survive reentry. Odds were it never got the chance and simply joined the rest of the space junk floating around between colonies. But a sturdy casket gives attendees peace of mind. They imagine everyone in Mom’s generation ends up back on Earth eventually.\nI thought that way when she was sick. Now that she’s gone, I’m not sure it matters where I send what’s left. Nonetheless, I didn’t have anything better to do at work, so I scrolled through a catalog online. The eye implant’s good for getting away with that kind of thing.\nMy art partner caught me at noon.\n“Any ideas on the brief?” he asked. Agile Hands pats itself on the back for having individual employee offices, but people feel excess comfort walking into mine. My hands had drifted into my pockets, my feet had drifted onto my desk, and my monitor had drifted to sleep. Not the best look before an industry lifer like Zane.\n“A few.”\n“Like what?”\nZane’s a big guy, which I suspect led to his current habit of invading personal space. Less muscular people had that habit kicked out of them in high school. The last time I got a drink in him, he said he considered bodybuilding “an extension of art direction.” He’d simply taken creative control of his body.\n“I’m thinking about it.” Holding eye contact’s tough while using the implant, but I’m a decent multitasker. I pulled up the brief in my left eye and watched Zane with my right. He planted one arm against the wall, channeling a disappointed babysitter. This made keeping a straight face harder, but I maintained.\nCreative Brief\nProject Code: 081947\nThe Product\nHarvester, a tungsten-rod launcher with category-leading range and accuracy.\nCreative Objective\nDistinguish Harvester in a crowded APW (anti-planetary weapon) market.\nTarget Audience\nEither faction in the arms race between Demes and Unity.\nCategory Insight\nBoth factions need weapons capable of RPE (rapid population elimination) at minimum cost.\nBrand Insight\nHarvester trivializes current orbital defense systems, allowing near instant and consistent elimination of HPTs (high population targets).\nBrand Weaknesses\nAdvances in propulsion render Harvester ineffective against gunships and other (relatively) mobile military targets. Thus, usefulness is contained to planets and colonies.\nBrand Personality\nPowerful. Confident.\nThe social contract saved me: after two years working with me, Zane knew I hadn’t touched the brief yet. But advertising partnerships are based on results, not shared principles. Chastising me only became worthwhile if I couldn’t come up with something usable.\n“Try to finish thinking soon,” said Zane. “The red flag meeting’s tomorrow. We need something worth showing Anthony. You know, proof we didn’t spent the holidays thinking.”\n“Got it. Work on a composite of a woman at ease. Older, and artsy. Defense pitches are saturated with images of jarheads saluting flags, so we’ll stand out.”\n“Fine, but what’s the headline?”\n“I’m thinking about it.”\nThat got him out of my office, albeit tenser than he’d arrived. I counted to fifteen in case he cycled back with a new problem or admonition. When he failed to materialize, I returned to the catalogs. Restful Hills had a black silica tile series that looked promising.\nJanuary 3\nToday’s Album: None of Your Showbusiness, by Re:Volution\nI took the journaling idea from Mom. And the word “journaling.”\nWhile I like the feel of a pen, I’m thinking of ditching the physical book. Most paper’s a Union import, and socially conscious types like to glare at me on the shuttle. I can get away with a fancy watch on my wrist or computer in my head, but paper crosses some invisible line.\nAs I write this, there’s a man with a fauxhawk staring daggers into my forehead. I get that people are on edge. We all know people on Union or Demes colonies and prefer them alive. It’s no excuse for posturing at strangers like a child. That’s how you get your head cracked at a show. Not that I’d know, I haven’t been to a decent concert in a year. Too many late meetings.\nTake today’s pitch review. In the wonderful world of theory, it ended at five Colonial Time. In practice, less than half the creative teams had finished presenting. I’d have snuck in some journaling, but Zane would’ve smacked any obvious distractions out of my hands. Another argument against print. I could have written an erotic novel on the eye implant without anyone knowing or caring.\nAgency pitches are like billion-dollar nesting dolls. First, creative teams pitch ideas to each other. Then creative teams pitch their best (results vary) idea to creative directors, who pitch the best surviving ideas to the resident alcoholic agency director. The agency director brings their best (typically mediocre) account people to a client meeting, where they pitch the remains of an idea strained through three layers of human opinion to prospective customers. Clients then accept or reject our work based on the quality of their breakfast.\nMercifully, I only have to deal with the first layer of this process. Zane aspires to more. He’s welcome to it.\nAround six, Zane killed a pleasant daydream by tapping my shoulder. I wanted to break the finger. Violence has been on my mind this week. Hopefully it’ll pass with the funeral. Copywriting pays, but lawyers and therapists charge more.\n“We’re up,” he said. We marched to the front of the conference room and stood together before the firing squad. Ten writers, ten artists, and one creative director. Anthony Marsico sat at the head of the table in the reclined, semi-awake stance I wished I was in. I guess you have to work your way there.\nAnthony softly rapped his pencil against the table, eraser first. He drummed his way through most meetings in three-quarter time. I’d already given up on interpreting it as a positive or negative sign. It’s just something he does. There are worse quirks for creative directors.\n“Have anything?” Anthony asked.\n“Of course. We’ve been thinking a lot about it.”\nZane’s shoe (expensive) gently stepped on my shoe (less expensive). I canned the rest of the joke. Then he tapped the wall, bringing up our slide. Somehow, he’d turned my last-minute direction and copy into something cohesive.\nWe chafe, but Zane does beautiful work. Our slide looked like he’d made it in weeks instead of hours. The protagonist (a composite of five stock models) stood beside a half-finished marble bust. The bust’s face mirrored hers, down to the braided ponytail, nose ring, and wry smile. I’d argued against the nose ring—a little too old-fashioned, even at her age—but Zane had the final call on aesthetics. The results were hard to dispute. Both faces had the easy, natural confidence created through extended, artificial effort.\nI marred the image with a slim line of copy. Chisel: Creative Destruction.\n“As you can see, I’ve changed the name,” I began. “Stay calm.”\nLukewarm laughter followed. No stomp from Zane, so we were in business.\n“Demes is a liberal republic, and Union is a theocracy. Both systems rely on a self-image as the good guy. The name Harvester chafes with that somewhat.”\n“The new name, Chisel, speaks to that impulse. It implies a deft hand and creative mind, a self-image the best and worst generals share. More importantly, it implies precision. The feature that distinguishes a tungsten-rod launcher from its competitors.\n“Biological weapons like DuraVirus, Loki’s Curse, and Bubblegum Fever are blunt instruments. They don’t just take out the colony you target; they take out everyone the target’s traded with for the last decade. Which, all too often, includes you. Food prices spark more wars than ideology, the current conflict notwithstanding.”\n“Chisel is a thoughtful deletion. It contains damage to the target city, moon, or colony. Leaving a more aesthetically pleasing galaxy behind.”\nI imagined cheers. I imagined getting fired. All Anthony did was nod and check something off in his notebook.\n“Solid. I’ll make it slide four,” said Anthony. It was the first eye contact he’d made with me all meeting.\nI thanked him for his time and sat down. There were no signs of success, failure, or skirting by. Either way, I was done thinking about kinetic bombardment.\nJanuary 4\nToday’s Album: Cerebral Riot, by Cerebral Riot\nIt’s done.\nWhen I carried that casket, my brain went AWOL. It was like being twelve again. I got caught up wondering if fat people’s caskets were harder to carry, or if funeral homes gently nudged their next of kin toward lighter caskets. Any puerile line of thought felt easier than confronting the present.\nI assume people cried. I must have as well, unless today’s the start of my career as a serial killer. Not that those guys get far these days.\nWe loaded her casket onto the Nebula III, along with thirty-three of December’s other casualties. The name drives me crazy. Memorial airlines love that Raygun Gothic stuff, but it does nothing for the bereaved. If I had that contract, I’d class up the rocket names a little. Or at least get rid of the numbers.\nThe chaplain gave my brother and I a port number and date for the launch. Martin thanked him, but I felt less diplomatic. Watching Astral Trails LLC shoot my only parent into space isn’t on my short list. I hope no one’s there to watch me liftoff. In fact, I might get cremated instead.\nMartin and company shuffled me to a second location. Some kind of bingo hall or rec center willing to host thirty depressed Jamaicans. The caterers had real beef, which was nice. It helped me soak up the rum.\nA trio of aunts (all aunts are one person in my head) tried to corner me for a stroll down memory lane, so I took a cigarette break. I quit smoking three years ago, and I’ve managed to stay off it (half suggestion therapy, half willpower), but I generally keep that tidbit to myself. Cigarette breaks are the perfect excuse to get out of any room.\nThe rat that invented the post-funeral event deserved whatever happened to them. As if burying someone isn’t depressing enough without meeting everyone else left behind.\nI resolved to spend the rest of the year away from next of kin. For real emotional support, you need someone that doesn’t give a shit. Other mourners are like other drowners. You just pull each other down.\nMartin picked this moment to reappear.\n“How’s the job?”\nHis usual opening. Today it stumped me. Was there anything I hadn’t said a dozen times before? Any answer that wouldn’t make me feel like an idiot? I pawed at my phone to play for time.\n“Sorry,” said Martin. “I wanted to be casual. I know you don’t like to talk about the big stuff.”\nThe big stuff. “No problem.”\n“That, and I noticed none of your coworkers were here.”\n“Why would they be?”\n“I mean, you’ve been there for four years. I have one or two people from work here.”\n“That’s rude.”\n“Emotional support’s rude?”\nTouché. I’d forgotten that Martin actually understood people. Colony people tend to double down on the old habit of treating coworkers like friends and friends like family. A natural side effect of the first colonists leaving everything else behind.\n“Guess not. But your work-life balance is warped.”\n“I work half as much as you do.”\n“Like I said. Warped. You could quit or get fired tomorrow, and never see those people again.”\nMartin went back inside, presumably to comfort the rest of the bereaved. I wished for a real pack of cigarettes to warm me up. The colony still didn’t have real seasons. Just days that were too hot and nights that were too cold.\nJanuary 5\nToday’s Album: Strap In, by The Dirt Sisters\nUnion declared war on Demes. Which is fair, since Demes hit two Union colonies with Bubblegum Fever. If we’re lucky, no contaminated ships or cargo make it here. If we’re not, this is one of my last entries.\nI’m going drinking.\nJanuary 6\nToday’s Album: Graveyard Earth, by Sunny and the Optimists\nWe’re not dead, so I took today off. My job all but ceases to exist between pitches anyway.\nIt gave me some time to thumb through what I’ve written so far. Mostly good, but I tore out the page about my last date. Posterity doesn’t need my half-assed sex life, and I think the rest is more engaging.\nThat said, the dialogue’s a bit skewed. Everything’s tweaked to be funnier, or more concise, or long enough to fill the last line on a page. My comebacks get faster, and everyone else gets a little duller. It’s less of a record of my life and more of a prime-time adaptation.\nThat might say something about journalists. As in reporters, not people who journal. When Demes’ cleric sovereign reportedly told the Union premiere to “Consider your next move carefully,” he may have said something closer to “Kiss my ass, degenerate.” That strikes me as less of a bad movie line and more like something that leads to dumping Bubblegum Fever on a civilian colony.\nI’m biased, but I’d rather be rodded. Contact, explosion, done. Bubblegum Fever takes time. Nothing vital melts first, only a few hours in. Points to whoever came up with the name. That’s a professional. I’m sure he and Zane would get along.\nGood ad writing’s closest to poetry. Stand-up’s equally apt, but that crowd wouldn’t writhe as much under the comparison. Decent taglines emerge from rewriting the same sentence until a perfect, airless version emerges. Unless you half-ass it. Like in poetry, there’s significant incentive to punch out early, get drunk, and watch awards roll in anyway.\nNavel-gazing aside, I’m done reading the news. If the guys upstairs are smart, they’ll keep us neutral. If they’re not, I’d rather not think about it.\nJanuary 7\nToday’s Album: Omnicidal Tendencies, by Temujin\nI got an award today. Just an in-agency one, but it’s still a decent boost.\nThey mailed it straight to my apartment, sparing me the waking nightmare of carrying a package on the shuttle. Everyone’s already on edge since open war broke out, and I didn’t need someone snapping on me for taking up too much space in the sardine can. People have gotten stabbed for less.\nLike everything from Agile Hands, it came in a light blue box. Our brand colors are blue and silver, a combo Zane says should have led to a designer losing his hands. I think it looks decent, but I don’t have a horse in that race.\nThe box held a bottle of wine, a handwritten note on silver card stock, and a palm-sized, cube-shaped trophy. I don’t get the cube thing either. Maybe the design team went through an abstract phase.\nI still have a little home training, so I started with the note.\nDear Leon,\nThis is for going the extra mile during the pitch. We’re the first—and only—agency on the Harvester account. Or should I say Chisel?\nTo be honest, I wasn’t sure you’d be up for this. Anyone can see that you’re going through something, even if you’re not much for sharing. I imagine it’s a girl. I’ve been around long enough to know what relationship drama can do to a young talent.\nYou pushed through whatever is going on, and I can’t thank you enough for that. Chisel opens doors for us. Anti-Planetary Weapons contractors pull from a small list of branding agencies, and this contract puts us on that list. I’ll remember your part in making it happen.\nDrink this with someone in a cocktail dress. You’re a hot item now.\nBest,\nAnthony\nThe last line took me out of it. Did people I know wear cocktail dresses? Did anyone? I’d never seen one outside of a movie.\nI flipped the card and found a hand-drawn smiley face with dollar signs for eyes. “Big Money Leon” was scribbled underneath in cursive. Some of Anthony’s old illustration instincts were leaking through. The boss likely had a book of similar sketches that would never see the light of day.\nAfter trashing the note and box, I poured half the wine into a novelty water bottle. My gym had printed oversized “Ahead of the Pack” bottles for last year’s spring marathon, an event I survived three miles of. Then I hauled the wine to the living room, opened a web browser on the east wall, and searched for pictures of women in cocktail dresses.\nIt seemed to mostly be a white girl thing. There were a few token pictures of black women at a Panthers 4 Peace fundraiser, but most cocktail dress owners looked like variations of my ex. I picked one in a blue cocktail dress with a face that was two degrees removed from Angeline’s instead of one.\n“Cheers,” I said before killing the bottle. I’d planned on savoring the drink, but that felt off-tone.\nJanuary 8\nToday’s Album: Soothing Whale Songs, by Automated Butcher\nI cracked and checked the news. We’ve been allied with Demes for two days.\nI also missed a call from Martin. I’ll hit him back later.\nJanuary 23\nToday’s Album: N/A\nI always assumed they’d save the rich first, or at least the politicians. The evacuation wasn’t nearly organized enough for that. Luck got me much further than social climbing.\nMom’s launch was the only reason I made it to a ship. I was already idling around the docks, recovering from my stomach’s failure to adjust to the lack of artificial gravity. I threw up a few more times this morning than I’m comfortable admitting. The only people accustomed to zero-g are astronauts, soldiers, and liars.\nI’m generally good at ignoring the guilty voice in my head, but Mom’s launch was the limit. I had to see her off in person. All the death in the news made it impossible not to think about hers, and I wouldn’t have a second chance. Surprisingly, there was no sign of Martin. I guess we both changed our mind at the last moment.\nI kept to the back for most of the ceremony. The priest (a navy chaplain—they like order at the docks) was the spitting image of Zane’s composite model. She read a bible passage about rebirth, which I found disappointing. Mom was more about the songs. Scripture was something she sat through to get to the music. The Nebula III’s countdown started without a note of music, so I hummed “Will the Circle be Unbroken.” No one stopped me, even when I started singing it. As a sober atheist belting an antebellum spiritual, I felt as strange as I looked.\nStill, it was better than the funeral. I didn’t have to deal with anyone else that knew her. It was just me and her memory. Until the sirens.\nI’d never heard the tone or pattern; the raid alarm must have changed since I left high school. Nonetheless, when a high-pitched alarm drowns out every noise in a wartime colony, people move. Human traffic pushed me toward the ships before I even resolved to find one. Sometimes you can trust the wisdom of crowds.\nI searched the processing lines for Martin, or a friend, or even Zane. No luck, but they might have made it. There were too many faces to pick out anyone, and they kept better track of the news than I did.\nKeep. I mean keep. I need to think present tense to stay sane.\nEventually, I wound up on a navy carrier called Ark 36. Humans were the only fauna on board, and there were significantly more than two of us. I barely had room to scratch my thigh, let alone lift my arm. I can only write this now that they’ve opened the engine rooms and gun bays to the general population.\nThe observation monitors provided our one source of information and hope. The colony design, which I didn’t think about 364 out of 365 days of the year, looked beautiful. Humanity had built a perfect metallic ring in space, kept it intact, and moved inside. I could understand why Mom had moved. The colony’s existence alone represented new possibilities.\nShips fled by the dozen, but we needed hundreds. Thinking of the people stuck on the ring gave me a headache. Realizing how many of them I knew made it worse.\nChisel worked quickly and quietly, as advertised. First there wasn’t a hole in the colony, and then there was. The rods didn’t make for much of a show, flitting through and past my home in half a second.\nThe explosion provided more conventional drama. A ball of white fire enveloped everything that meant anything to me. The other survivors screeched in at least six different languages, begging and accusing their respective gods. I assume I screeched too. I may have even found religion. Memory has a way of protecting us from itself.\nThen my left eye went dark. The navy grunts said the electromagnetic pulse from the colony reactor fried most evacuees’ implants. Fair trade for survival. I tapped my eye twice, under the vain hope that turning it off and on again would make a difference. Nothing. I’m half blind for the foreseeable future.\nSoon we passed a memorial ship. A different model than Mom’s, but around the same size and company. At the rate we fled, we’d catch up to her ship in hours. We were racing the dead.\nDennard Dayle is a fiction writer and comedian. His writing has appeared in McSweeney's Internet Tendency, Matchbook, The Hard Times, POSTblank, and various other journals and anthologies. His personal site See More Evil hosts satirical projects covered by The New York Post, AM New York, and other news sources. He has an MFA in Fiction from Columbia University and Bachelors in English from Princeton University.", "source": "https://clarkesworldmagazine.com/dayle_06_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Own Goal by Dennard Dayle"}