{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Youha Nam; Elisa Sinn; Justin Howe", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Of4va/FFc3P/A910JXJsAjh07Eg=", "id": null, "license": null, "comments": "", "raw_text": "4720 words, short story  National Center for the Preservation of Human Dignity  At four in the morning the doorbell rang. Outside stood two young men dressed in gray uniforms, uncreased. They appeared almost to be identical to each other, save that the one with a narrower chin was wearing glasses. Taking up my worn-out bag, I followed them down the stairs and outside. The night’s rain had washed away the last lingering traces of the autumn, leaving the steel staircase outside the building slick. Clasping the cold handrails, and taking each step with great caution, though the ridiculousness of it nearly made me laugh—here I was, struggling with all my might to survive even now. The night previous, after returning home from my trash-collecting rounds, I’d discovered the yellow notice posted on my door, identical to the one that had been stuck to my neighbor’s door several days earlier: a final notice demanding payment of the delinquent survival tax.  I guess this is it, I’d thought to myself.  Resistance would only have led to me being taken away by force, and dying without taking advantage of the benefits offered by the Center, which was what had happened to my neighbor, Mr. Kim. And so last night, after standing there for a long time just staring at the yellow slip of paper, I finally decided to take the dignified option; I called the number on the paper and entered my personal information as instructed by the representative on the line.  “We’ll send our people out to you at 4:00 AM tomorrow,” the representative had told me. “Please refer to the information printed on the notice for further details.”  Yet, despite my own decision, here in the cold morning air, I found that I could scarcely relax enough to take each step.  A luxurious black sedan idled at the curb. Along its side, in red lettering, were emblazoned the words National Center for the Preservation of Human Dignity. Glasses took the driver’s seat, while Bare-eyes opened a rear door for me. I found the seat within soft and comfortable, though the aroma of new leather upset my empty stomach so much that it required nearly all my concentration to prevent myself from vomiting. Bare-eyes glanced over at me.  “Feel free to relax, ma’am,” he said. Then Glasses seemed to notice my discomfort, and he responded by switching on the radio. From the speakers, Handel’s “Sarabande” began to play, which helped ease the tension in my belly. I sat back and inhaled deeply.  Last night, after I’d finished making the call, I’d simply sat there. Numb. Death lay right around the corner, but it still seemed unreal to me. I’d had thirty hours left to live, and my first instinct had been to flip through my old photo albums—but then I’d asked myself if there was any point in getting emotional and wasting my remaining time crying. I chose instead to watch some TV . . . but found that it was all just so much meaningless noise. Ultimately, I retired to bed. All night long, my crumbling foam mattress squeaked each time I rolled over.  “We’re here.”  The voice that had woken me was unfamiliar. I must have dozed off, since I’d slept poorly the night before. It was a moment before I realized where I was. A fifteen-story silver building stood there, surrounded by carefully tended gardens. It looked as out of place as a still life in the middle of an abstract painting. Beside the car’s open door, Bare-eyes stood waiting. I took up my bag and exited the car to find a woman in a white uniform approaching from the silvery structure.  “Hello,” she said to me. “I’m in charge of giving new arrivals a tour of the Center’s facilities.”  She politely bowed to me before snapping a bracelet timer around my wrist. The time immediately started counting down:  24:00:00. 23:59:59. 23:59:58 . . .  I followed the young woman back into the building.  “Your room number is 704,” she informed me, handing over a keycard. “Inside, you’ll find a change of clothes laid out for you, and an information pamphlet all about the Center. At 7:00 AM an orientation meeting will be held. Please arrive ten minutes early. All the facilities in our Center are available twenty-four hours a day. I do hope you’ll enjoy your remaining time with us.”  Through the lobby, into an elevator, and all the way up to the seventh floor, the monotone of this woman’s speech had carried us forward. Now, at my door, she bowed once again before leaving me.  When she’d said “your remaining time” my eyes had immediately slipped down to look at the timer. Only two minutes had passed since my arrival.  In terms of both size and layout, the room was the sort of thing you’d find at a business hotel: small round table, mirror, bookcase, bed, tiny refrigerator, and a TV. Next to the bed stood a nightstand with a table lamp on it. The bathroom was so tiny I couldn’t even stretch out both my arms inside it, yet somehow it contained a mini tub, a sink, and a toilet. I tossed my bag aside and changed into the orange uniform provided. The pants had an elastic waistband, and like a night robe, the V-necked top cinched around my waist. The uniform was clean enough, although its color had faded from multiple washings. The number of my room was embroidered into the left breast of the top in navy blue thread—the number by which, instead of my name, I would be identified during my remaining time here.  I sat on the bed.  After my early start that morning, part of me longed to do nothing but lie back and relax. However, I’d be sleeping more than enough after tomorrow, wouldn’t I? Why not enjoy myself a little while I could? I found the pamphlet on the night table and read it: on the first floor could be found the information desk, assembly hall, and staff offices; on the second, a restaurant, a café, and a bar. On the third floor was a fitness center tailored to the elderly . . .  I set the pamphlet back down on the table, having decided that the café would be my first stop.  It looked spacious and grand, like a hotel lounge, though I detected a faint moldy smell within. After ordering a Caffè Americano, I took a seat by a window and took in the lovely view outside. The trees in the garden stood in such a tidy arrangement that they brought to mind a carefully set dinner table, and they were trimmed into such unnatural shapes that they appeared almost to be artificial. In the early winter sunlight, their leaves shone, bright and verdant.  The server arrived with my Americano and a slice of cake that I hadn’t ordered. “This carrot cake’s fresh from the oven. I brought a piece for you to try.”  With a slight smile, I thanked him, thinking, Why not enjoy myself? After all, everything in this place was free. I took a sip of my coffee from the fancy china cup. How long it had been since I’d tasted decent coffee—my eyes welled up, and I wondered if perhaps this cup might rejuvenate my taste buds, after the long corruption inflicted by years of instant coffee.  The carrot cake, however, remained untouched. I couldn’t just spend the next twenty-four hours eating, after all . . . and besides, I hadn’t fully recovered my appetite. The coffee was sufficient for now.  “Number 704, Number 1302, and Number 1408,” the ceiling speaker announced. “Please report immediately to the auditorium. The orientation is about to begin.”  Only then did I recall what the woman had told me about the orientation. No time for coffee now, I thought a little regretfully as I hurried out of the café.  About fifteen people sat in the orientation hall, waiting, and every single one of them cast a reproachful look my way as I came in. One scowling old woman pointed at the timer on her wrist. The white-uniformed staff showed me and the other two latecomers to our spots. Once everyone was seated, the lights dimmed out and at the front of the room a wall screen brightened. A map of the center’s layout appeared with a logo beside it, and soon some voice actor was explaining to us about how we were about to face the most dignified deaths possible for citizens at such a low-income level. Then the background music changed, turning from serious to upbeat.  The heater beside my chair rattled. It had been set to full blast, and the dry heat dulled my mind. Soon my eyes closed and I began to nod off. It was only when my head rolled backward that I woke, blinking. Near one corner of the room stood a staff member, glaring at me. I returned my attention to the front of the room. Onscreen, the president was devouring a bowl of beef soup at the Center’s restaurant, a big grin plastered across his self-important face. He made the thumbs-up gesture at the camera, and all the people around him onscreen clapped as if in worship of his thumb.  The video finished and the lights switched back on. By the time my eyes adjusted to the sudden brightness, a man in a blue lab coat was standing on a platform before the screen. Beside him, a mannequin lay in a hospital bed. A female staff member rose to her feet and began speaking through a microphone.  “Now, let’s walk through the procedure,” she cheerfully began. “Your timer will sound when there’s exactly one minute remaining. At zero, there will be a knock on your door. Make sure that you are present and ready in your room before the alarm goes off. When the second knock on the door follows, your door will open automatically. At that time, please remain calm and follow our staff’s instructions. If you feel ill, just inform them of it, and they will take care of you. When you enter the Room of Peaceful Resting, which is located in the basement, there will be a bed exactly like the one you see here. Once you are secured in position, one of our staff will administer the Fluid of Peaceful Resting into your veins.”  She gestured to the man in the lab coat. He displayed a syringe filled with a yellowy-green liquid and mimicked injecting it into the mannequin’s arm. My attention, however, remained focused instead on the leather restraints fastened around the mannequin’s neck and torso.  “I don’t know if you’ve ever been put under general anesthesia,” the woman went on, “but all you need to do is simply count down from ten, and before you know it, you’ll be at eternal rest. That’s all. Thank you for your attention. I hope you enjoy your remaining time with us.”  She and the man in the lab coat bowed at the platform’s edge like a pair of stage actors.  Your remaining time . . .  It had to be something they’d been trained to say, but the phrase gave me a chill.  My knees ached from sitting for so long. As I limped out of the auditorium, my belly growled. A croissant and a bowl of onion soup at the French restaurant might just hit the spot—that was something I hadn’t had for years. The only trouble was that my stomach didn’t respond well to flour these days. I could always go to the Korean restaurant, I supposed: the beef soup hadn’t looked that bad, after all, and the president had seemed to like it. Actually, it’d be the perfect thing to have in this cold weather.  “Hello, ma’am! I saw you at the auditorium.”  It was an old man who approached me and said this, while my mouth was full of beef soup. His bald spot was slick with sweat, and the number 1408 was stitched onto his shirt.  “You don’t seem like the type to end up here,” he said with a laugh, exposing several gaps where teeth were missing.  Eyes as tiny as buttonholes, a nose slanted to the left, wrinkled old lips—I didn’t want to be mean, but he was ugly, and besides, his breath reeked like day-old fish. This was the last day of my life, and I had no time to waste on ugliness, so I leaned away from him. However, he failed to notice my annoyance, and took the seat across from me.  “What do you mean, ‘the type’? Anybody can find themselves here,” I said.  “You’re right, I never imagined myself ending up here, either.”  I rose to my feet, not even bothering to remove the spoon from the bowl. To be honest, my conscience was more troubled by the fact that I was leaving food unfinished than by my rudeness. This, I saw as my right: I could order every single dish in the restaurant, take just one bite from each, and no one had the right to say anything about it.  An old fellow with a beret on his head made eye contact with me and followed me to the door. Number 909. He pulled the door open for me, and I nodded my head a little.  “It’s a sunny day,” he observed with a smile. “Would you like to take a walk?”  This man had thick eyebrows and an attractively prominent nose. Likely he’d been a playboy in his younger days, but what could that matter now? We stepped outside into the cold together. A breeze shook the trees, their leaves almost fragrant of plastic.  “It’s too bad.” Number 909 said.  “What do you mean?” I gave him a questioning look.  “It’s too bad for a pretty lady like you . . . ”  Despite my age, the word pretty made me blush, and I quickly covered my cheeks with my hands.  “How much time do you have left? I have about three hours,” he said.  My heart sank. What comfort was there to be gotten from this? Suddenly, a commotion broke out over near the main entrance, as a woman struggled with two attendants.  “I don’t want to die!” she shouted. Her shirt had come undone, exposing her sagging breasts. “I have money! I said I could pay whatever tax—survival tax, death tax, whatever! My son, he lives in the United States. Call him! He’ll give you money!”  “We’re sorry, ma’am, but we already contacted him. He refused to pay on your behalf.”  Those last words left a bitter taste in my mouth. Often I’d been chided for not having children, but now, after hearing that, I was relieved: I couldn’t have handled that kind of heartbreak. As we watched, the men finally managed to drag the struggling woman back inside the Center.  Number 909 shook his head and sighed. “Damned survival tax. Low birthrates and aging were already serious problems when I was young, but I had no idea we’d end up living in a world where being poor was punishable by death.”  “But why live on? Why struggle? At least this way we get a quick and painless end, instead of slow starvation.”  “What if it’s not just a quick injection?” asked Number 909, lowering his voice.  “What do you mean?”  “I’ve heard stories.” He glanced around to see if anyone was nearby. “I’ve heard the Center actually harvests our organs and sells them overseas for a profit.”  “That’s absurd. Why sell our worn-out old organs? Besides, if it were true, someone would’ve discovered it by now.”  Number 909 laughed and shook his head. “Who? It’s not like the dead can report their own painful deaths, and the government certainly wouldn’t tell on itself, would it?”  This was a man with three hours left to live. His mind must be bristling with anxiety, his fear practically at a boiling point. I had to be careful not to let such fears take hold of me. What had I been thinking? Expecting a nice date, in this place?  “Please excuse me,” I said. “I should go get some rest.”  “Wait, I’m sorry if I made you uncomfortable.” He took hold of my wrist. His palm was as rough as tree bark, but warm with life’s pulse. My first instinct was to pull myself free, but I found I couldn’t. I resolved to keep the dying man company a little longer, on condition that I would not let his words trouble me, and I nodded to him. He took my hand. I was startled by this, but didn’t resist.  Despite the cold wind, we walked hand in hand halfway around the garden.  At the end of our walk, he said, “Would you like to come up to my room?”  I was speechless—not at the boldness of his proposal, but because deep down, I’d been expecting precisely this. However, I didn’t want to seem cheap, desperate for a man’s touch.  “You’ve misunderstood me,” I said. “I’m not that kind of woman.”  “What do you mean, that kind?” Number 909 looked at me with a faint smile. He must’ve heard what I’d said at the restaurant. “Besides, what could we possibly do at our age? I’m just happy we met before dying. It would be nice to talk without having to worry about someone else overhearing us.”  He was right. At this point, we both were really too old to hook up. Still, I feigned hesitation for a moment, before assenting.  In his room, Number 909 took a bottle of tomato juice out of the fridge and offered it to me. We were both shabby and elderly, but it was still awkward being alone together like that. We should’ve just stayed in the garden, walking hand in hand, I thought. Number 909, who had chatted in such an easy and affable manner out in the garden, now seemed unable to stop staring at his timer. His face grew taut and serious.  “Why don’t we go and get something to eat?” I suggested.  “There’s no time,” he said, his tone desperate.  “No time? But you have at least two more hours.”  Beep, beep, beep. His alarm sounded.  “What’s going on?” I said.  Number 909 dropped his chin to his chest. “I’m sorry, I lied to you.”  Then the beeping stopped. The number on his wrist blinked a couple of times at 00:01:00 before changing to 00:00:59. Only when the two knocks came at the door did I completely understand what had happened. The door swung open and the uniformed attendants who entered barely noticed me as they took Number 909 away.  It all happened in a flash. I hurried to the doorway and watched how he was almost being dragged to the elevator. Number 909 looked back at me.  “My name is Hyung Joon Jeon!” he yelled. “Please, remember my name!”  When the elevator doors slid open, the attendants hauled Number 909—no, Hyung Joon Jeon—inside. Then the doors slid closed again, and Hyung Joon Jeon disappeared.  I clasped my hands together and doubled over, as if in apology. Tears trickled down my face. After a while, I managed to raise myself back up and return to my room.  Once inside, the first thing I did was draw a bath. My hands were shaking so badly that it took me a couple of tries before I managed to open the faucet. Hunched over in the warm water, I found Hyung Joon Jeon’s name repeating over and over in my mind. How pathetic. This was the last day of my life, and we’d spent not even an hour together, yet that time felt more precious to me than nearly all my other memories. I got out of the tub and wrapped myself with a towel. The steam had filled the mirror with fog, so that I had to wipe it away in order to see myself.  “Haven’t seen you in a long while,” I told my reflection. It really had been quite some time since last I had looked at myself under such bright lights. The woman in the reflection smiled, and I watched as the muscles of her face wrinkled her skin.  This is the last day of your life.  I dried myself and got back into my clothes. The wall clock read 11:00 PM The timer on my wrist was still counting down, and had just passed 17:55:24. Eighteen hours left. I lay down on the bed. The sheets were clean, the cleanest I’d touched in years. My eyes slowly closed. If each second were one centimeter, how long a line would eighteen hours make? I fell asleep, trying to work out the answer.  A knock at my door woke me. At the second knock, the door automatically opened, and two uniformed attendants entered. They were, perhaps, the same two that had dragged away Hyung Joon Jeon the day before. I remained calm and followed their directions. When we arrived at the basement, a solemn man greeted me. At the sight of him, my throat suddenly became parched, as if I were being choked with dry leaves. I was too nervous to ask for some water. The man asked me to climb up onto a metal bed resembling an operating table.  “Don’t be nervous,” the man said as the attendants buckled the restraints at my neck, wrists, waist, and ankles. He placed one hand on my shoulder, maybe to reassure me, but where I expected to see a syringe in his other hand, there was only a gleaming scalpel. “Since you’re so pretty for an old lady, I’ll have to be extra careful when I cut you up.” He grinned wide, revealing a set of teeth that were perfectly straight and even.  My eyes flickered open. My whole body was clammy with sweat. Even the sheet beneath me was wet. When I blinked, the image of my scarlet blood spraying out across the light blue staff uniforms flashed behind my eyelids. It had seemed so real; I could even remember the icy touch of the scalpel against my skin.  Fucking Hyung Joon Jeon.  The nightmare obviously stemmed from all the crap he’d said to me. There was no way that the government could be killing people so horrifically . . . and even if it was true, what could I do about it now? A familiar sense of defeat and frustration washed over me. I wanted to scream, but instead I just chewed on my lower lip until eventually I tasted my own blood and noticed that I’d been gripping the bedsheet so hard that I’d torn through it.  If I stayed in this room another instant, I’d lose my mind.  The restaurants were out of the question, since I had no appetite. In the end, I settled on a trip to the fitness center, up on the third floor. The treadmills were identical to the ones in the gym of the apartment complex that I’d lived in thirty years earlier. The Center had likely bought them back at that time and then done nothing with them since.  Did they really think we’d come here and exercise on the day before we were scheduled to die? Was that what I was about to do? Live up to their idiotic expectations?  I climbed up on the treadmill and pressed the button that said 3 km/h. With a feeble sound, the machine came to life. After only a few steps, though, I became short of breath and my armpits were sweaty. My heart was pounding. Still, as I walked I gradually began to feel like the woman I’d been, back when I was forty-two. I saw it all vividly: the running shoes I’d worn—the latest brand—as I swung my arms back and forth with each step. I even saw the droplets of sweat that had run down the sides of my face, and my ponytail bobbing, keeping pace with my steps.  Tears began to stream down my cheeks, and suddenly feeling dizzy, I stepped down off the treadmill. I sank to the floor, weeping.  After I calmed down, I thought maybe I should go enjoy some music instead. But when I reached the performance hall, the doors were closed. A sign read, “Concert Hall–No performance today.” The paper was yellowed with age. I made my way over to the small exhibition hall, which was crammed with replicas of famous paintings: Van Gogh’s “Starry Night” and “Sunflowers,” Klimt’s “The Kiss,” Monet’s “Water Lilies,” and the like. None of them reassured me that I’d experience a so-called “dignified death.”  The pamphlet, with its nice photos and all, had given the impression that the Center was a decent place, but the performance hall hosted no performances, and the exhibition hall held only the sort of calendar pictures you’d see hanging in some drab café.  I glanced at my timer: 15:05:35. A whole fifteen hours left.  An empty laugh escaped my lips. This was all I could do with my time remaining, check my timer and wait for death? If so, what was the point in waiting?  I went down to the first floor information desk. Two women sat behind it with their hair neatly styled in the manner of flight attendants. I stepped toward the one with the wider, gentler-looking face, but then I paused.  Was this the correct decision? How could I know? My life hadn’t gone as planned, and I’d never known what the “right” choice had been when making so many major life decisions. While I stood there hesitating, the woman noticed and came over to me.  “Is anything wrong, Ms. 704?”  “No. It’s nothing.” I stammered. “It’s just . . . ”  “Please don’t hesitate to let us know if you need anything.”  I managed to mumble my thanks to her and began to turn away.  “And I hope you enjoy your remaining time with us,” she said to the back of my head.  That’s when it hit me. There was no way I could enjoy my remaining time. I turned back around and walked right up to her.  “Actually,” I said. “There is something. I want to move this up.” I pointed to my timer.  The woman smiled like a crescent moon and led me over to the desk. “You mean you want us to reset it, right?” she said, searching around for a pamphlet. Finding it, she passed it to me. It was identical to the one that was in my room. “This should tell you everything,” she said.  “Do I have to do it myself?” I said. It was one thing to want my timer advanced, but quite another to have to do it myself. The woman noticed the troubled expression on my face.  “Of course, we can do it for you,” she said with a sympathetic tone. “Do you know how much time you want, or would you like to think about it some more?”  “Five minutes,” I said. “That should give me enough time to get back upstairs.”  “Five minutes from now will be 14:29.” She looked at me. “Is that what you’d like?”  “Yes,” I said.  “Alright,” she said, and she began pressing buttons on my timer. “If you change your mind in the next five minutes, please come to us or press zero on your phone and just tell the operator you want the reset cancelled. You have the right to spend the remainder of your time with us freely in any way you like.”  I nearly laughed at that word, “freely,” but chose instead to nod my head and walk away. My stride was dignified, like a queen’s. All my life I had drifted along passively. Now, at least, in my final moments, I’d taken the initiative and made a decision for myself. Better late than never.  Back upstairs in my room, I drank some water and set about tidying my hair. I would remember Hyung Joon Jeon’s name, but I refused to share his fears. They’d give me a simple injection, and I’d feel no pain. I’d die in peace, retaining my dignity until the end.  My timer beeped while I was still in front of the mirror. Someone was knocking at my door. I sat down upon my bed, back straight and dignified, prepared to receive them.    Originally published in Korean in 여성작가 SF단편모음집.  Published with the support of Literature Translation Institute of Korea (LTI Korea). Youha Nam is a writer of diverse genres including SF, horror, romance, and children's literature. In 2018, she won an award in the 5th Genre Fiction Short Stories in Science Contest with her story \"The Woman of the Future.\" That same year, she won the 5th Han Nakwon Science Fiction Award with \"Blue Hair,\" a story about the friendship between an alien boy and a girl from Earth.  Justin Howe was born and raised in Massachusetts. His work has appeared in Strange Horizons, Spacesuits & Sixguns, and The Internet Review of Science Fiction. His story \"Skillet and Saber\" will appear in the anthology Fast Ships, Black Sails available from Night Shade Books in October 2008. He is a graduate of the Odyssey Writers workshop, works for an architectural preservation company in New York City, and belongs to the Homeless Moon.", "text": "4720 words, short story\nNational Center for the Preservation of Human Dignity\nAt four in the morning the doorbell rang. Outside stood two young men dressed in gray uniforms, uncreased. They appeared almost to be identical to each other, save that the one with a narrower chin was wearing glasses. Taking up my worn-out bag, I followed them down the stairs and outside. The night’s rain had washed away the last lingering traces of the autumn, leaving the steel staircase outside the building slick. Clasping the cold handrails, and taking each step with great caution, though the ridiculousness of it nearly made me laugh—here I was, struggling with all my might to survive even now. The night previous, after returning home from my trash-collecting rounds, I’d discovered the yellow notice posted on my door, identical to the one that had been stuck to my neighbor’s door several days earlier: a final notice demanding payment of the delinquent survival tax.\nI guess this is it, I’d thought to myself.\nResistance would only have led to me being taken away by force, and dying without taking advantage of the benefits offered by the Center, which was what had happened to my neighbor, Mr. Kim. And so last night, after standing there for a long time just staring at the yellow slip of paper, I finally decided to take the dignified option; I called the number on the paper and entered my personal information as instructed by the representative on the line.\n“We’ll send our people out to you at 4:00 AM tomorrow,” the representative had told me. “Please refer to the information printed on the notice for further details.”\nYet, despite my own decision, here in the cold morning air, I found that I could scarcely relax enough to take each step.\nA luxurious black sedan idled at the curb. Along its side, in red lettering, were emblazoned the words National Center for the Preservation of Human Dignity. Glasses took the driver’s seat, while Bare-eyes opened a rear door for me. I found the seat within soft and comfortable, though the aroma of new leather upset my empty stomach so much that it required nearly all my concentration to prevent myself from vomiting. Bare-eyes glanced over at me.\n“Feel free to relax, ma’am,” he said. Then Glasses seemed to notice my discomfort, and he responded by switching on the radio. From the speakers, Handel’s “Sarabande” began to play, which helped ease the tension in my belly. I sat back and inhaled deeply.\nLast night, after I’d finished making the call, I’d simply sat there. Numb. Death lay right around the corner, but it still seemed unreal to me. I’d had thirty hours left to live, and my first instinct had been to flip through my old photo albums—but then I’d asked myself if there was any point in getting emotional and wasting my remaining time crying. I chose instead to watch some TV . . . but found that it was all just so much meaningless noise. Ultimately, I retired to bed. All night long, my crumbling foam mattress squeaked each time I rolled over.\n“We’re here.”\nThe voice that had woken me was unfamiliar. I must have dozed off, since I’d slept poorly the night before. It was a moment before I realized where I was. A fifteen-story silver building stood there, surrounded by carefully tended gardens. It looked as out of place as a still life in the middle of an abstract painting. Beside the car’s open door, Bare-eyes stood waiting. I took up my bag and exited the car to find a woman in a white uniform approaching from the silvery structure.\n“Hello,” she said to me. “I’m in charge of giving new arrivals a tour of the Center’s facilities.”\nShe politely bowed to me before snapping a bracelet timer around my wrist. The time immediately started counting down:\n24:00:00. 23:59:59. 23:59:58 . . .\nI followed the young woman back into the building.\n“Your room number is 704,” she informed me, handing over a keycard. “Inside, you’ll find a change of clothes laid out for you, and an information pamphlet all about the Center. At 7:00 AM an orientation meeting will be held. Please arrive ten minutes early. All the facilities in our Center are available twenty-four hours a day. I do hope you’ll enjoy your remaining time with us.”\nThrough the lobby, into an elevator, and all the way up to the seventh floor, the monotone of this woman’s speech had carried us forward. Now, at my door, she bowed once again before leaving me.\nWhen she’d said “your remaining time” my eyes had immediately slipped down to look at the timer. Only two minutes had passed since my arrival.\nIn terms of both size and layout, the room was the sort of thing you’d find at a business hotel: small round table, mirror, bookcase, bed, tiny refrigerator, and a TV. Next to the bed stood a nightstand with a table lamp on it. The bathroom was so tiny I couldn’t even stretch out both my arms inside it, yet somehow it contained a mini tub, a sink, and a toilet. I tossed my bag aside and changed into the orange uniform provided. The pants had an elastic waistband, and like a night robe, the V-necked top cinched around my waist. The uniform was clean enough, although its color had faded from multiple washings. The number of my room was embroidered into the left breast of the top in navy blue thread—the number by which, instead of my name, I would be identified during my remaining time here.\nI sat on the bed.\nAfter my early start that morning, part of me longed to do nothing but lie back and relax. However, I’d be sleeping more than enough after tomorrow, wouldn’t I? Why not enjoy myself a little while I could? I found the pamphlet on the night table and read it: on the first floor could be found the information desk, assembly hall, and staff offices; on the second, a restaurant, a café, and a bar. On the third floor was a fitness center tailored to the elderly . . .\nI set the pamphlet back down on the table, having decided that the café would be my first stop.\nIt looked spacious and grand, like a hotel lounge, though I detected a faint moldy smell within. After ordering a Caffè Americano, I took a seat by a window and took in the lovely view outside. The trees in the garden stood in such a tidy arrangement that they brought to mind a carefully set dinner table, and they were trimmed into such unnatural shapes that they appeared almost to be artificial. In the early winter sunlight, their leaves shone, bright and verdant.\nThe server arrived with my Americano and a slice of cake that I hadn’t ordered. “This carrot cake’s fresh from the oven. I brought a piece for you to try.”\nWith a slight smile, I thanked him, thinking, Why not enjoy myself? After all, everything in this place was free. I took a sip of my coffee from the fancy china cup. How long it had been since I’d tasted decent coffee—my eyes welled up, and I wondered if perhaps this cup might rejuvenate my taste buds, after the long corruption inflicted by years of instant coffee.\nThe carrot cake, however, remained untouched. I couldn’t just spend the next twenty-four hours eating, after all . . . and besides, I hadn’t fully recovered my appetite. The coffee was sufficient for now.\n“Number 704, Number 1302, and Number 1408,” the ceiling speaker announced. “Please report immediately to the auditorium. The orientation is about to begin.”\nOnly then did I recall what the woman had told me about the orientation. No time for coffee now, I thought a little regretfully as I hurried out of the café.\nAbout fifteen people sat in the orientation hall, waiting, and every single one of them cast a reproachful look my way as I came in. One scowling old woman pointed at the timer on her wrist. The white-uniformed staff showed me and the other two latecomers to our spots. Once everyone was seated, the lights dimmed out and at the front of the room a wall screen brightened. A map of the center’s layout appeared with a logo beside it, and soon some voice actor was explaining to us about how we were about to face the most dignified deaths possible for citizens at such a low-income level. Then the background music changed, turning from serious to upbeat.\nThe heater beside my chair rattled. It had been set to full blast, and the dry heat dulled my mind. Soon my eyes closed and I began to nod off. It was only when my head rolled backward that I woke, blinking. Near one corner of the room stood a staff member, glaring at me. I returned my attention to the front of the room. Onscreen, the president was devouring a bowl of beef soup at the Center’s restaurant, a big grin plastered across his self-important face. He made the thumbs-up gesture at the camera, and all the people around him onscreen clapped as if in worship of his thumb.\nThe video finished and the lights switched back on. By the time my eyes adjusted to the sudden brightness, a man in a blue lab coat was standing on a platform before the screen. Beside him, a mannequin lay in a hospital bed. A female staff member rose to her feet and began speaking through a microphone.\n“Now, let’s walk through the procedure,” she cheerfully began. “Your timer will sound when there’s exactly one minute remaining. At zero, there will be a knock on your door. Make sure that you are present and ready in your room before the alarm goes off. When the second knock on the door follows, your door will open automatically. At that time, please remain calm and follow our staff’s instructions. If you feel ill, just inform them of it, and they will take care of you. When you enter the Room of Peaceful Resting, which is located in the basement, there will be a bed exactly like the one you see here. Once you are secured in position, one of our staff will administer the Fluid of Peaceful Resting into your veins.”\nShe gestured to the man in the lab coat. He displayed a syringe filled with a yellowy-green liquid and mimicked injecting it into the mannequin’s arm. My attention, however, remained focused instead on the leather restraints fastened around the mannequin’s neck and torso.\n“I don’t know if you’ve ever been put under general anesthesia,” the woman went on, “but all you need to do is simply count down from ten, and before you know it, you’ll be at eternal rest. That’s all. Thank you for your attention. I hope you enjoy your remaining time with us.”\nShe and the man in the lab coat bowed at the platform’s edge like a pair of stage actors.\nYour remaining time . . .\nIt had to be something they’d been trained to say, but the phrase gave me a chill.\nMy knees ached from sitting for so long. As I limped out of the auditorium, my belly growled. A croissant and a bowl of onion soup at the French restaurant might just hit the spot—that was something I hadn’t had for years. The only trouble was that my stomach didn’t respond well to flour these days. I could always go to the Korean restaurant, I supposed: the beef soup hadn’t looked that bad, after all, and the president had seemed to like it. Actually, it’d be the perfect thing to have in this cold weather.\n“Hello, ma’am! I saw you at the auditorium.”\nIt was an old man who approached me and said this, while my mouth was full of beef soup. His bald spot was slick with sweat, and the number 1408 was stitched onto his shirt.\n“You don’t seem like the type to end up here,” he said with a laugh, exposing several gaps where teeth were missing.\nEyes as tiny as buttonholes, a nose slanted to the left, wrinkled old lips—I didn’t want to be mean, but he was ugly, and besides, his breath reeked like day-old fish. This was the last day of my life, and I had no time to waste on ugliness, so I leaned away from him. However, he failed to notice my annoyance, and took the seat across from me.\n“What do you mean, ‘the type’? Anybody can find themselves here,” I said.\n“You’re right, I never imagined myself ending up here, either.”\nI rose to my feet, not even bothering to remove the spoon from the bowl. To be honest, my conscience was more troubled by the fact that I was leaving food unfinished than by my rudeness. This, I saw as my right: I could order every single dish in the restaurant, take just one bite from each, and no one had the right to say anything about it.\nAn old fellow with a beret on his head made eye contact with me and followed me to the door. Number 909. He pulled the door open for me, and I nodded my head a little.\n“It’s a sunny day,” he observed with a smile. “Would you like to take a walk?”\nThis man had thick eyebrows and an attractively prominent nose. Likely he’d been a playboy in his younger days, but what could that matter now? We stepped outside into the cold together. A breeze shook the trees, their leaves almost fragrant of plastic.\n“It’s too bad.” Number 909 said.\n“What do you mean?” I gave him a questioning look.\n“It’s too bad for a pretty lady like you . . . ”\nDespite my age, the word pretty made me blush, and I quickly covered my cheeks with my hands.\n“How much time do you have left? I have about three hours,” he said.\nMy heart sank. What comfort was there to be gotten from this? Suddenly, a commotion broke out over near the main entrance, as a woman struggled with two attendants.\n“I don’t want to die!” she shouted. Her shirt had come undone, exposing her sagging breasts. “I have money! I said I could pay whatever tax—survival tax, death tax, whatever! My son, he lives in the United States. Call him! He’ll give you money!”\n“We’re sorry, ma’am, but we already contacted him. He refused to pay on your behalf.”\nThose last words left a bitter taste in my mouth. Often I’d been chided for not having children, but now, after hearing that, I was relieved: I couldn’t have handled that kind of heartbreak. As we watched, the men finally managed to drag the struggling woman back inside the Center.\nNumber 909 shook his head and sighed. “Damned survival tax. Low birthrates and aging were already serious problems when I was young, but I had no idea we’d end up living in a world where being poor was punishable by death.”\n“But why live on? Why struggle? At least this way we get a quick and painless end, instead of slow starvation.”\n“What if it’s not just a quick injection?” asked Number 909, lowering his voice.\n“What do you mean?”\n“I’ve heard stories.” He glanced around to see if anyone was nearby. “I’ve heard the Center actually harvests our organs and sells them overseas for a profit.”\n“That’s absurd. Why sell our worn-out old organs? Besides, if it were true, someone would’ve discovered it by now.”\nNumber 909 laughed and shook his head. “Who? It’s not like the dead can report their own painful deaths, and the government certainly wouldn’t tell on itself, would it?”\nThis was a man with three hours left to live. His mind must be bristling with anxiety, his fear practically at a boiling point. I had to be careful not to let such fears take hold of me. What had I been thinking? Expecting a nice date, in this place?\n“Please excuse me,” I said. “I should go get some rest.”\n“Wait, I’m sorry if I made you uncomfortable.” He took hold of my wrist. His palm was as rough as tree bark, but warm with life’s pulse. My first instinct was to pull myself free, but I found I couldn’t. I resolved to keep the dying man company a little longer, on condition that I would not let his words trouble me, and I nodded to him. He took my hand. I was startled by this, but didn’t resist.\nDespite the cold wind, we walked hand in hand halfway around the garden.\nAt the end of our walk, he said, “Would you like to come up to my room?”\nI was speechless—not at the boldness of his proposal, but because deep down, I’d been expecting precisely this. However, I didn’t want to seem cheap, desperate for a man’s touch.\n“You’ve misunderstood me,” I said. “I’m not that kind of woman.”\n“What do you mean, that kind?” Number 909 looked at me with a faint smile. He must’ve heard what I’d said at the restaurant. “Besides, what could we possibly do at our age? I’m just happy we met before dying. It would be nice to talk without having to worry about someone else overhearing us.”\nHe was right. At this point, we both were really too old to hook up. Still, I feigned hesitation for a moment, before assenting.\nIn his room, Number 909 took a bottle of tomato juice out of the fridge and offered it to me. We were both shabby and elderly, but it was still awkward being alone together like that. We should’ve just stayed in the garden, walking hand in hand, I thought. Number 909, who had chatted in such an easy and affable manner out in the garden, now seemed unable to stop staring at his timer. His face grew taut and serious.\n“Why don’t we go and get something to eat?” I suggested.\n“There’s no time,” he said, his tone desperate.\n“No time? But you have at least two more hours.”\nBeep, beep, beep. His alarm sounded.\n“What’s going on?” I said.\nNumber 909 dropped his chin to his chest. “I’m sorry, I lied to you.”\nThen the beeping stopped. The number on his wrist blinked a couple of times at 00:01:00 before changing to 00:00:59. Only when the two knocks came at the door did I completely understand what had happened. The door swung open and the uniformed attendants who entered barely noticed me as they took Number 909 away.\nIt all happened in a flash. I hurried to the doorway and watched how he was almost being dragged to the elevator. Number 909 looked back at me.\n“My name is Hyung Joon Jeon!” he yelled. “Please, remember my name!”\nWhen the elevator doors slid open, the attendants hauled Number 909—no, Hyung Joon Jeon—inside. Then the doors slid closed again, and Hyung Joon Jeon disappeared.\nI clasped my hands together and doubled over, as if in apology. Tears trickled down my face. After a while, I managed to raise myself back up and return to my room.\nOnce inside, the first thing I did was draw a bath. My hands were shaking so badly that it took me a couple of tries before I managed to open the faucet. Hunched over in the warm water, I found Hyung Joon Jeon’s name repeating over and over in my mind. How pathetic. This was the last day of my life, and we’d spent not even an hour together, yet that time felt more precious to me than nearly all my other memories. I got out of the tub and wrapped myself with a towel. The steam had filled the mirror with fog, so that I had to wipe it away in order to see myself.\n“Haven’t seen you in a long while,” I told my reflection. It really had been quite some time since last I had looked at myself under such bright lights. The woman in the reflection smiled, and I watched as the muscles of her face wrinkled her skin.\nThis is the last day of your life.\nI dried myself and got back into my clothes. The wall clock read 11:00 PM The timer on my wrist was still counting down, and had just passed 17:55:24. Eighteen hours left. I lay down on the bed. The sheets were clean, the cleanest I’d touched in years. My eyes slowly closed. If each second were one centimeter, how long a line would eighteen hours make? I fell asleep, trying to work out the answer.\nA knock at my door woke me. At the second knock, the door automatically opened, and two uniformed attendants entered. They were, perhaps, the same two that had dragged away Hyung Joon Jeon the day before. I remained calm and followed their directions. When we arrived at the basement, a solemn man greeted me. At the sight of him, my throat suddenly became parched, as if I were being choked with dry leaves. I was too nervous to ask for some water. The man asked me to climb up onto a metal bed resembling an operating table.\n“Don’t be nervous,” the man said as the attendants buckled the restraints at my neck, wrists, waist, and ankles. He placed one hand on my shoulder, maybe to reassure me, but where I expected to see a syringe in his other hand, there was only a gleaming scalpel. “Since you’re so pretty for an old lady, I’ll have to be extra careful when I cut you up.” He grinned wide, revealing a set of teeth that were perfectly straight and even.\nMy eyes flickered open. My whole body was clammy with sweat. Even the sheet beneath me was wet. When I blinked, the image of my scarlet blood spraying out across the light blue staff uniforms flashed behind my eyelids. It had seemed so real; I could even remember the icy touch of the scalpel against my skin.\nFucking Hyung Joon Jeon.\nThe nightmare obviously stemmed from all the crap he’d said to me. There was no way that the government could be killing people so horrifically . . . and even if it was true, what could I do about it now? A familiar sense of defeat and frustration washed over me. I wanted to scream, but instead I just chewed on my lower lip until eventually I tasted my own blood and noticed that I’d been gripping the bedsheet so hard that I’d torn through it.\nIf I stayed in this room another instant, I’d lose my mind.\nThe restaurants were out of the question, since I had no appetite. In the end, I settled on a trip to the fitness center, up on the third floor. The treadmills were identical to the ones in the gym of the apartment complex that I’d lived in thirty years earlier. The Center had likely bought them back at that time and then done nothing with them since.\nDid they really think we’d come here and exercise on the day before we were scheduled to die? Was that what I was about to do? Live up to their idiotic expectations?\nI climbed up on the treadmill and pressed the button that said 3 km/h. With a feeble sound, the machine came to life. After only a few steps, though, I became short of breath and my armpits were sweaty. My heart was pounding. Still, as I walked I gradually began to feel like the woman I’d been, back when I was forty-two. I saw it all vividly: the running shoes I’d worn—the latest brand—as I swung my arms back and forth with each step. I even saw the droplets of sweat that had run down the sides of my face, and my ponytail bobbing, keeping pace with my steps.\nTears began to stream down my cheeks, and suddenly feeling dizzy, I stepped down off the treadmill. I sank to the floor, weeping.\nAfter I calmed down, I thought maybe I should go enjoy some music instead. But when I reached the performance hall, the doors were closed. A sign read, “Concert Hall–No performance today.” The paper was yellowed with age. I made my way over to the small exhibition hall, which was crammed with replicas of famous paintings: Van Gogh’s “Starry Night” and “Sunflowers,” Klimt’s “The Kiss,” Monet’s “Water Lilies,” and the like. None of them reassured me that I’d experience a so-called “dignified death.”\nThe pamphlet, with its nice photos and all, had given the impression that the Center was a decent place, but the performance hall hosted no performances, and the exhibition hall held only the sort of calendar pictures you’d see hanging in some drab café.\nI glanced at my timer: 15:05:35. A whole fifteen hours left.\nAn empty laugh escaped my lips. This was all I could do with my time remaining, check my timer and wait for death? If so, what was the point in waiting?\nI went down to the first floor information desk. Two women sat behind it with their hair neatly styled in the manner of flight attendants. I stepped toward the one with the wider, gentler-looking face, but then I paused.\nWas this the correct decision? How could I know? My life hadn’t gone as planned, and I’d never known what the “right” choice had been when making so many major life decisions. While I stood there hesitating, the woman noticed and came over to me.\n“Is anything wrong, Ms. 704?”\n“No. It’s nothing.” I stammered. “It’s just . . . ”\n“Please don’t hesitate to let us know if you need anything.”\nI managed to mumble my thanks to her and began to turn away.\n“And I hope you enjoy your remaining time with us,” she said to the back of my head.\nThat’s when it hit me. There was no way I could enjoy my remaining time. I turned back around and walked right up to her.\n“Actually,” I said. “There is something. I want to move this up.” I pointed to my timer.\nThe woman smiled like a crescent moon and led me over to the desk. “You mean you want us to reset it, right?” she said, searching around for a pamphlet. Finding it, she passed it to me. It was identical to the one that was in my room. “This should tell you everything,” she said.\n“Do I have to do it myself?” I said. It was one thing to want my timer advanced, but quite another to have to do it myself. The woman noticed the troubled expression on my face.\n“Of course, we can do it for you,” she said with a sympathetic tone. “Do you know how much time you want, or would you like to think about it some more?”\n“Five minutes,” I said. “That should give me enough time to get back upstairs.”\n“Five minutes from now will be 14:29.” She looked at me. “Is that what you’d like?”\n“Yes,” I said.\n“Alright,” she said, and she began pressing buttons on my timer. “If you change your mind in the next five minutes, please come to us or press zero on your phone and just tell the operator you want the reset cancelled. You have the right to spend the remainder of your time with us freely in any way you like.”\nI nearly laughed at that word, “freely,” but chose instead to nod my head and walk away. My stride was dignified, like a queen’s. All my life I had drifted along passively. Now, at least, in my final moments, I’d taken the initiative and made a decision for myself. Better late than never.\nBack upstairs in my room, I drank some water and set about tidying my hair. I would remember Hyung Joon Jeon’s name, but I refused to share his fears. They’d give me a simple injection, and I’d feel no pain. I’d die in peace, retaining my dignity until the end.\nMy timer beeped while I was still in front of the mirror. Someone was knocking at my door. I sat down upon my bed, back straight and dignified, prepared to receive them.\nOriginally published in Korean in 여성작가 SF단편모음집.\nPublished with the support of Literature Translation Institute of Korea (LTI Korea).\nYouha Nam is a writer of diverse genres including SF, horror, romance, and children's literature. In 2018, she won an award in the 5th Genre Fiction Short Stories in Science Contest with her story \"The Woman of the Future.\" That same year, she won the 5th Han Nakwon Science Fiction Award with \"Blue Hair,\" a story about the friendship between an alien boy and a girl from Earth.\nJustin Howe was born and raised in Massachusetts. His work has appeared in Strange Horizons, Spacesuits & Sixguns, and The Internet Review of Science Fiction. His story \"Skillet and Saber\" will appear in the anthology Fast Ships, Black Sails available from Night Shade Books in October 2008. He is a graduate of the Odyssey Writers workshop, works for an architectural preservation company in New York City, and belongs to the Homeless Moon.", "source": "https://clarkesworldmagazine.com/youha_10_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: National Center for the Preservation of Human Dignity by Youha Nam, translated by Elisa Sinn and Justin Howe"}