{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Jeremy L C Jones", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "/GSvuToo1TH2t5CH3c58mGxYLNw=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Suitably Strange: A Round-Table Discussion of World-Building  Imaginary worlds offer readers a time and place that is different from the world they live in. Imaginary worlds offer a fresh perspective, a new POV—a slanted angle of vision. These settings, these places— secondary worlds or \"the realm of fairy-story,\" as J. R. R. Tolkien called them—come with their own rules, their own customs, and their own logic.  \"The realm of fairy-story,\" Tolkien writes in \"On Fairy-Stories,\" \"is wide and deep and high and filled with many things: all manner of beasts and birds are found there; shoreless seas and stars uncounted; beauty that is an enchantment, and an ever-present peril; both joy and sorrow as sharp as swords. In that realm a man may, perhaps, count himself fortunate to have wandered, but its very richness and strangeness tie the tongue of a traveller who would report them. And while he is there it is dangerous for him to ask too many questions, lest the gates should be shut and the keys be lost.\"  At their best, imaginary worlds offer an immersive experience. We enter, we are filled with wonder, and we are changed by the experience.  Imaginary worlds don't just happen. They must be built—whether prior to or during the telling of the story. Builders of worlds seek coherence, consistency, feasibility, and that ever-important \"cool factor.\" World-builders are both creator and first explorers of their worlds, inspired by personal experiences, real world history, the mysteries of human evolution, or grandly conceived \"what ifs.\" They draw on African, Celtic, Greek, Native American, and Norse mythologies and landscapes, among others.  Below, Tim Akers, Mark Chadbourn, K. V. Johansen, Kay Kenyon, M. D. Lachlan, Justina Robson, and Joel Shepherd discuss their imaginary worlds and how they created them. These seven authors, all of whom publish with Pyr, write a wide variety of speculative fiction, from historical fantasy to science fiction to \"steampunk and sorcery.\" They've \"thought-formed\" worlds, \"liquid-life-engines\", starfish-shaped universes, and worlds very similar to our own, except for a few crucial deviations.  Some of these authors started building their worlds by \"reading and thinking and studying. \" Some planned ahead, while others allowed the world to grow with the writing. Some started with an \"odd thought,\" others with compelling characters—characters like a princess turned warrior, an archaeologist in the Otherworld, a caravan-guard fleeing madness, a star pilot grieving the loss of his family, or a synthetic human pursuing answers while fleeing for her life.  Whatever the method or starting point, the goal seems to be the same: a place suitably strange, yet somehow recognizable.  What's something really cool about your secondary world that doesn't show up in any of your novels or short stories?  Tim Akers: For the book I'm working on right now, there's about four or five hundred years of history that I've sketched out, from migration patterns to wars to the establishment of three different religions, two of which are dead by the time the actual books start. I keep finding myself wanting to write those stories instead, or in addition to. I can really see how authors can fall into the temptation of interrupting a series to go write a prequel or something.  Mark Chadbourn: In my interlinked sequences that began with Age of Misrule, the secondary world is the mystical Otherworld of Celtic mythology, the home of gods, Fabulous Beasts, magic and mayhem. Every time a character crosses over from our own world, he or she sees different aspects of it, or it appears subtly altered. What is never stated is that it's a thought-form world, completely fluid in nature, which is created and shaped by the mind and preconceptions of the people who visit it.  M. D. Lachlan/Mark Barrowcliffe: I write historical fantasy, so it's our world but with the mythology taken literally. So, as I'm writing at the beginning of the Viking age, the gods do interfere in human destinies. Witches exist. Magic is taken directly from that described in ancient Norse poetry. The coolest thing is how strange history is—how differently people think and act to modern people. For instance, the size of the settlements. In Wolfsangel, Vali looks on the town of Haithabu as unimaginably large. It contains one hundred houses.  K.V. Johansen: Some of the history of the Old Great Gods and the devils is quite cool, I think. I know a lot more about the cold hells and the \"heavens beyond the stars\" in which the human storytellers place the Great Gods and devils than appears in the published stories. But I'm not going to talk about that yet! (Although people can probably figure a part of it out. In \"The Storyteller\" there's a bit more about that than in Blackdog.) In general, though, because of the way I work, the world grows as I write. I don't usually see much of what lies over the horizon until not too long before the story gets there. That's true of both the physical landscape and the social/historical/cosmological landscape, the cultures and the systems of magic.  Kay Kenyon: My secondary world, called the Entire, is both a world and a universe. It is a landlocked universe that is shaped like a starfish, in that it has five geographic arms, or \"primacies,\" radiating outward from a central sea of impossible, vaguely oceanic matter. Things are so cosmically far apart that the only efficient way to travel is on the Nigh, a five-armed river fed from the central sea over which is suspended the Ascendancy where advanced beings dwell when they're not up to no good.  Justina Robson: I guess you mean this secondary world I'm making right now. Animal-people, I'd have to say. I haven't done those before. They're biomorphs: life-liquid-engines. Haven't entirely finished working on their true nature. It's been very hard going. My imagination wants them to be one way and my scientific brain is telling me it's all never going to work so... obviously imagination has to win eventually and I'm struggling towards that.  Where did you start building your secondary world?  Mark Chadbourn: I looked first at the old stories of Celtic mythology, and then at other mythologies—Norse, Greek, Native American, Chinese, African and more—searching for commonalities. The conceit is that this world is the source of all our stories, our myths, legends and folklore, our dreams, so it needed to be very much an ur-world that could speak to all cultures.  K.V. Johansen: I started with the landscape of the Turkmenistan desert and the idea of small, local gods. In Blackdog, the mountains, a combination of the Himalayas and the mountains of central Asia, came into it almost right away, with the Siberian taiga lurking in the northeast. In a way, the seed of the world is a book and a TV series, Realms of the Russian Bear, on the natural history of the former Soviet Union; both the BBC producer and the Russian host were biologists, so it's a cut above the usual sort of nature documentary and the book is very detailed. I had a fascination with the landscape and natural history described in that for some time, and when the story began, with the idea of the character who became Holla-Sayan being possessed by the Blackdog, it just always seemed to have existed in that landscape.  Kay Kenyon: I started with the odd thought, what if you didn't need space travel to get across the universe, but could instead sort of hoof it? What if you could walk to Alpha Centauri or the equivalent? And if you can walk, obviously there are no stars or space. So what is this place? It's a tunnel. It burrows through our own universe. At this point you have to write the story to find out what the hell is going on.  Joel Shepherd: For me it always starts with the cultures, politics, belief systems, and languages of various parts of the world. And that is always driven by the dramatic requirements of the story. In A Trial of Blood and Steel, I wanted to tell a story largely driven by the conflicts between the different values that arise from different kinds of civilizations. My main character was a young woman, a former princess who renounced her heritage to become a warrior in the somewhat exotic style of distant Saalshen. I loved the dramatic conflicts that sprung from a main character, one who chooses to give up that status and privilege for something that suits her better as a person. But I needed to have a land where that would be possible, because in a lot of lands it wouldn't be. And so I came up with Lenayin, a land of individualist warriors where the royal family has only very precarious power, and inherited title means little, because everyone worships achievements and skill more than family. Much of that creation of Lenayin was driven by my need to make my main character's situation believable.  Once I had Lenayin, the other lands and peoples evolved at least in part as foils for Lenayin. For example, the main enemies or bad guys of the series turn out to be people who live in the more traditional European feudal system, which Lenays mainly detest because of the serfdom it forces most of the population into. And that clash of values is reflected in the beliefs of my characters, which then becomes the kind of personal, dramatic tension that makes stories work.  Tim Akers: Because of my particular background, religion and cosmology inform pretty much everything I do. So I always start with the gods, the religions, the hidden powers that work beneath the world. That informs culture, which informs history, which in turn informs plot and character. I tend to start big and work my way down into the specific. Of course, that reveals a lot of my weaknesses as a writer, too. I'm good at the grand patterns, but I'm still learning how to craft the perfect character.  In what manner did you develop the secondary world from the original seed?  Justina Robson: By reading and thinking and studying a lot of social-science material, anthropology, and daydreaming. This was all very distracting from the real development of the story, but I wanted a credible base layer, even if I never actually write about it directly. It has to make a kind of sense to me in terms I am content with. So I've been trying to figure out realistic and necessary conditions for everything that the story has. Unfortunately this has sometimes made me attempt to \"answer\" the mysteries of human cultures, their evolution and possible biological origins, trying to separate necessary things from chance and memetic accretions... a totally impossible Gordian knot. So now I'm down to choosing where I cut the knot and what statements about the present I'm really trying to make. But I'm often distracted and also dismayed that many of my observations are so damning. I'm trying to dig my way out of Western, Christianized, secular, liberal, and capitalist culture and... ugh... it's nearly impossibly hard and manic, like some kind of Whack-A-Credo. You get one, and four more pop up from your unconsciou But it's worth a stab at something a little bit more than just a reactionary OMYGODWUT.  Kay Kenyon: Once I had the tunnel idea and knew that an advanced civilization created the Entire, I started asking questions like, who would live there? How like or unlike humans will they be? What technologies do they have? If this universe is a tunnel, what mechanism creates day and night, if such exists? Each of these answers constrains and/or influences the answer to the next question, and so forth, until you begin to find a coherent world, suitably strange, but with anchors to human experience. At times this process is exhilarating and sometimes you expect it to collapse like a house of cards. Not the least of the challenges is how to make such an improbable place coherent yet mysterious, strange but somehow recognizable.  Tim Akers: For my second book, The Horns of Ruin, I developed a story about three gods who were brothers, and who ended up betraying each other until only one of them was still alive. Then I imagined the church that would be built on that kind of history, and then what a society based on that church would look like. The tone of that kind of theocracy is going to flavor everything, from your architecture to the way the three churches interact, to why people would choose to serve a god who was dead, or a god who murdered his brother. Again, I built from the large (gods killing each other!) to the small, and then built a plot around that.  M. D. Lachlan/Mark Barrowcliffe: I started with research into the Viking age. This meant I read a general historical text on the Vikings, some of the sagas and also the Eddas. The Eddas are the 14th-century poems written by an Icelandic historian, Snorri Sturluson. He collected oral poems and wrote them down. These form the main plank of our knowledge about Viking myth. At that point I started writing. It's always better to start writing sooner rather than later. If you find out, or decide, that the deck on your longship isn't as extensive as you first wrote, you can always change it later. I then research as I go along—reading books on Viking ships or arms and armor, for instance and getting information from the many great web resources. If I were in a completely invented world I wouldn't have to bother with all this and would just start writing immediately after I had the idea for the story.  K.V. Johansen: The local gods, which are such a vital part of the Blackdog secondary world, grew out of the existence of the Blackdog. There he was; I had to find out why. The incarnate goddess who needed a guardian was the why, and the rules of the world grew out of developing a theology in which this limited, lake-bound goddess could exist. As the world developed, with its local gods and goddesses, the demons of the wild places, the Old Great Gods and the banished devils, the Blackdog didn't seem to be quite any of them. I had that question in the back of my mind for most of the book: What, really, was the Blackdog? Wondering about that led to a lot of ancient history developing as an underpinning for his existence, which now seems such a foundation for the world that it's a bit disconcerting to remember that none of that was there when I started.  Once I had the idea of local gods who were very limited in their powers, it seemed to make sense that there wouldn't be very many large kingdoms or empires; the limited gods would lead to limited tribal regions. Geography shapes culture, so there are larger groupings of peoples linked by common culture and language, but a person's emotional attachment is to a much smaller idea of place, and the political units are also usually centred on individual gods or goddesses. There are certainly kingdoms containing more than one god, but they're usually not great monolithic nations, which prevent their kings being absolute monarchs. Only a few empires have ever existed.  Setting the story along a caravan route meant that I could explore the different cultures linked by that road. It's the sort of world where you could get a lot of isolationist, mistrustful cultures, but instead it turned out to be one where this river of trade and travel means there is a constant flow of cultural influence and language. As Holla-Sayan travelled, I had to keep developing new gods and places, which meant looking at new interpretations of the basic idea of a god limited in territory and influence.  Mark Chadbourn: The danger of creating an ur-world was that it would be too familiar, filled with too many tropes that we'd all seen played out in books, films, and TV over the years. Once I'd identified the elements that spoke to many disparate cultures, I needed to twist them, turning archetypes into elements that were three-dimensional, rich and unique. Part of the process included re-naming some concepts—for instance, dragons—to prevent readers bringing a bagful of preconceptions to the story. By the time the reader had figured out what the things are, I'd had space to imprint my reading upon it.  Do you ever get bogged down in the world-building process?  Justina Robson: Endlessly. I use it as an excuse not to write the story or to stop writing when I feel very anxious and... well... as an excuse for everything really. I keep coming up against my inner demon which tells me I have to be right or I can't go on. I have to solve it. I have to solve everything, or I'm unjustified in making whatever flaky claim my story is trying to make in the face of a relentlessly nitpicky universe. I escape by reading romances and novels by people who are smart enough never to care about this stuff. I realize it's starting to sound like I think world-building is pointless. I don't. But for me, story is first. If the world is going to get in the way because of some notion that I am writing SF and therefore it has to make a literal sense, it doesn't want to make because it is really all metaphors then metaphors must win. Every time. All the time. I never give two hoots for anyone else's cruddy world-building if their story blows my mind. I might potshot at it later, and god help them if the story blows. But if it's good, I don't care at all. I am in it for the trip, not the brochure.  K.V. Johansen: Possibly—if by bogged down you mean distracted, so that the world-building takes over and the adventure gets sidetracked. \"This is getting interested, let's keep going and see what that's like. Oh, wait, that has nothing to do with this particular story.\" There's a southern continent across an ocean channel which has trade with the Five Cities. The Five Cities aren't in Blackdog either, but they're there, Nabbani colonies east and south of Marakand. And the early history of Marakand, the city where the eastern and western caravan roads meet, is really fascinating and can distract me from the more immediate history that is the story in hand. But name a place Marakand, which is fairly obviously derived from Asmarakand, which became Samarkand, and it's crying out for a mysterious, romantic past, isn't it? And I can start hunting for books from which to develop some small detail and end up with a stack of six histories, reading for background on something that's going to be a tiny presence in the story itself. I guess I like things to have roots. (Also, it's an excuse to add to my library, of course.) It's really important for the world not to end at the edges of the map and for there to be a past before the story begins, a foundation for everything, but sometimes I can end up knowing more about the past of something than its present, and have to step out of it a bit and refocus on the story's here and now. I don't work out things like that in advance, though. They unfold, or I go chasing after them, as I get to them, and then I can end up with pages I have to cut out and stash in another file because it's not part of the story; it's just stuff that I have to know so the story can go on.  Tim Akers: I can spend too much time on world-building, because it's the part that makes me tick. I started as a designer of roleplaying games, and I still have a great deal of affection for the tabletop dice. In fact, if it were possible to just make a living creating and deploying hyper-deep worlds for people to explore, that's probably what I would be doing. I suppose I could make a go of it in the computer game industry, but I'm focused on honing my craft as a writer. Plus I love words, I love language, and I love story. I'm not sure you can practice all of that in that industry.  Joel Shepherd: [I don't get bogged down] really, but there are times when I feel the story becomes bogged down if I haven't sufficiently developed the world. The characters, and therefore the story, must interact with their environment in a way that enriches the story. If the world isn't sufficiently developed, sometimes I've felt there just isn't any energy happening between the characters and their world, much the same as a relationship between characters that lacks energy or excitement. So I have to go away and think for a bit about what's missing from the world, and what would liven up the experience.  M. D. Lachlan/Mark Barrowcliffe: If I were writing a traditional fantasy, I wouldn't bother about very detailed world-building at all before I started writing. I'd just have a character in an interesting dilemma and start making it up from there. It's a complete distraction for a writer to take thousands of notes on his or her invented world before sitting down to write. Stories are about people—from The Lord of the Rings through Earthsea and Moorcock to modern day fantasy. The world is essentially a setting for people to do things in. No one comes to a book to read about the exact appearance of a Black Rider. They come to the book to share Frodo's terror, to marvel at his bravery and ingenuity in escaping the dark forces. So my advice would be to make it up as you go along. When I wrote the character of Loki in Wolfsangel I didn't map him out beforehand. He appeared in the story and I heard him start to speak. I didn't realize my witches were using a magic system based on bodily denial and self-inflicted torture before they actually appeared. I started writing the character of the witch queen in a scene where she had had a premonition of disaster. The way she went about her magic just appeared on the page.  Kay Kenyon: I favor complicated worlds. There are days when I think I'm going too far, but can't seem to help myself. The distortions of the mundane world may be too much fun; they can threaten, by their very detail, to sink the premise. The only way out of this snarl is to start writing. Plot and character are a great discipline to me; they force me to focus and sometimes simplify.  Have there been any cataclysmic events in your secondary world? If so, how did it change the world?  Justina Robson: The shapeshifters developed weapons of mass destruction, and now there's an arms race. But really, that's a side issue. The cataclysm is a very slow one: the shapeshifters evolving faster, smarter, and encroaching on the \"human\" ground.  K.V. Johansen: In the Blackdog world, the first war involving the devils happened so long ago that it's not really remembered well in human stories, and is described as a war of wizards by some characters. The gods of the empire of Tiypur (and the empire itself as a political entity) were destroyed, so the region of Tiypur is now a land without gods. What that means for the world, that lack of any divinity there, is something that will come up later as the story, I hope, goes on. People from that part of the world, like Thekla in Blackdog, worship a memory of gods they know are dead, pray to gods they know can't hear them. That's an interesting state of mind. If the gods of your world are real and other people of other folks (or tribes or lands) can interact with their gods, and you and your people can't, because you know your gods are dead, where do you find your focus, the core of your identity as a folk? What might end up filling that emotional vacuum for people? One battle of that war also had a physical effect further east, in the blighted landscape of the eastern shore of the Kinsai'av in Blackdog; there's a region all along the river that's still a wasteland because of it.  In The Shadow Road, the fourth book of my Warlocks of Talverdin series about the Nightwalkers, a lot of the action takes place in a world suffering a supervolcano-induced ice age, not unlike that nuclear winter that we all thought might be coming when I was a teenager once WWIII came along. The supervolcano was triggered by misuse of a particular and not fully understood magic as much as by natural processes. The population of the planet has been pretty much wiped out, many in the initial disaster but most of the rest in a slow decline as the climate changes; it's reached the point when the story happens that glaciers cover much of the world and civilization, in the true meaning of the word, has ended. One of the heroes is living in what she thinks is probably the last settlement of people alive in the entire world.  Kay Kenyon: My world has had short geologic ages during which it was formed and then populated by degree, in a process of copying life forms from \"our\" universe, the Rose. But this creation period is in back story, not brought on stage. Aside from that, the story contains a cataclysmic event in one of the \"minorals\" or offshoots of a \"primacy.\" It's an event that demonstrates the ruling class ruthlessness and contributes to an uprising.  What goes into the development of a magic system?  K.V. Johansen: Some research and lots of (desperate) inspiration! In world of Blackdog, each region has its own forms and rituals of magic. Coming up with these and having them evolve as the story moves from region to region is challenging, sometimes. They all have to have some common ground, too, as the magic underneath is all the same. Sometimes it's just something that leaps out as a neat idea while I'm writing, like the Grasslander cat's-cradles, and sometimes it involves a lot of thinking about similar cultures in the primary world and what they believed had power.  Tim Akers: Again, a lot of my experience with this comes from my time in RPGs. Personally, I need to figure out power sources, the strict rules of the powers, the costs and benefits and dangers of them. But on top of that you have to figure out how these things fit into the culture. Especially when religion gets involved, you can really end up with some complicated societal effects to magic. What roles do belief and faith play in world where there's manifest arcane and divine power all around? In what ways have dogma impacted the culture's understanding of magic and its application? Those kinds of questions really drive my construction of the magical systems in my worlds. What fun is making up dogma if you can't make up heresy?  M. D. Lachlan/Mark Barrowcliffe: Like all writing, the development of magic comes from what you already know and a desire to do something new—and in my case an irritation with the tropes of traditional horror and fantasy.  Reviewers have commented that they haven't seen a magic system like mine in fantasy before. I found this surprising, because it's the magic that people practice in the real world. My magic is based on starvation, pain, denial of sleep, drowning, and freezing. It's a magic of ordeal, and you can see it used in everything from Inca death rituals to Yoga, the desert retreats of Christian mystics, the sweat lodges of the Native Americans, the consumption of hallucinogenic mushrooms, the dances of the Dervishes. I have a good grounding in myth and real world magic—although I don't believe in its literal truth—because I've been interested in magic and witchcraft since I was a child. I've done a lot of reading, so I have a lot to draw on.  I came to the specifics of my magic system through two ideas. The first is an extract from the Edda, in which Odin gives his eye for knowledge of the runes. The second was when I read that Norse mystics would seat themselves on a high chair to perform their prophecies. It occurred to me that this might be to deny themselves sleep. From there I needed an idea of the runes and I just envisaged them as living things that root in the mind of the sorcerer, sustained by her rituals and starvation. I took that, I think, from a misreading of the Poetic Edda. There's this beautiful verse which describes Odin's sufferings for magic:  I know that I hung on a windy tree nine long nights, wounded with a spear, dedicated to Odin, myself to myself, on that tree of which no man knows from where its roots run. No bread did they give me nor a drink from a horn, downwards I peered; I took up the runes, shrieking I took them, then I fell back from there This verse is the key to everything that happens in the Wolfsangel books. The misreading was of the \"shrieking\" (screaming in some translations). I originally read it that the runes were shrieking, not Odin. This gave me the idea that they were living things. Magic is solely a female preserve in my world. Men regard it as effeminate and beneath them, something you'd only resort to if you were too weak to fight. Again, this comes directly out of the Norse myth. The gods practice magic, but Norse gods are quite a gender-bending bunch.  My werewolf came from the idea of getting rid of the normal werewolf tropes that Hollywood invented. There's no changing with the full moon, no silver bullets, no separation of the wolf and human identities. It always annoyed me that a 150-pound man could turn into a two-ton wolf within an hour. I know we're dealing with magic, so anything is possible. But that always struck me as contrary to the laws of physics. Matter is coming from nowhere. My werewolf changes slowly, over a period of about a year. He puts on weight by eating people. My werewolf's transformation is one-way—no changing back—and the wolf is consuming his personality from the inside. The idea of linking it to the myth of the Fenris wolf arrived about half way into the writing of the book. Again, I didn't plan on or let it worry me that I hadn't got every last detail worked out. The feel of the story was right and that was all that mattered.  If I were designing a magic system for a pure fantasy novel I'd avoid fireballs or \"six-gun magic\"—that is, magical effects that could just be a replacement for a gun or a laser pistol. It's important in any writing to avoid cliché. The only thing you need to do is come up with something new, that is, if you want to write something really memorable. If you just want to churn out another genre standard, then you can embrace its clichés. That said, you should always strive to do something new in some way. Otherwise why not just read the stuff that's already out there, and save yourself the bother of writing? You might write a bestseller by adhering to the genre's clichés, but that's not what writing's about. If you're in it to make money, become a banker. Writing—and fantasy writing in particular—is about striving for something unique and resonant.  Justina Robson: Far-future technologies in my case. Or, as it is also known, \"pseudoscientific jargon.\" Magic is either incomprehensibly useful technology that allows you to write a story in a certain way or it is a straight metaphor for creativity and charisma. In either case it has to hold water convincingly and logically. Someone has to pay somehow. Nothing is free.  Mark Chadbourn: My stories are split between our own world and the Otherworld, and I needed a magic system that would not jar too much with our contemporary existence. I went back and researched the occult systems of magicians—from John Dee to Aleister Crowley to modern chaos magicians—and identified what would fit in my cosmology.  When it comes to world-building, what are you good at and not as good at? How have you taken advantage of the strengths and compensated for the weaknesses?  Tim Akers: I touched on this before, but I think it's important for writers to not just compensate for their weaknesses. We need to meet them head on. It's easy to use our strengths as a crutch to cover up our weaknesses, but we'd be better off as artists and craftsman to actively engage our weaknesses and improve them. When I first started writing I was terrible at dialogue. That's just a matter of craft, so I really studied language, the way people talk, the way they communicate, and now dialogue is one of the things that I'm good at. When it comes to world-building, my strengths lie in religion, in magic, and in backstory. The larger the scale, the better I do. My weakness is character. So I push myself to make characters that make me uncomfortable, that stretch my admittedly simple boundaries. There's no way for me to get better if I don't. And while I'm not good enough to produce truly revolutionary character tropes, I resist the urge to fall back on the comfortable, simple character tropes that permeate so much of fantasy.  Kay Kenyon: I think my strength is sense of wonder and depth. When I take on a particularly bizarre world, one of the things I work hard at is believability—that is, creating verisimilitude despite unlikely claims. Part of the job is not to rely over much on explaining, but using point of view and character to soften/authenticate strangeness. One aspect of world building that I admire in others and don't accomplish to my satisfaction is alien language—that is, creating an intriguing a lexicon. I minimize the use of foreign words.  Joel Shepherd: I'm good at cultures and civilizations on the broad scale. I enjoy the complexities—not because I'm addicted to needless complexity, but because complexity exists everywhere in the real world, and I've always found it fascinating. I'm also good at politics and political science broadly (I'm currently writing an international relations PhD), and those kinds of struggles form a lot of the motivations of my characters.  Not so good at? Making it simple. Some people like simple. My work's probably not for them. I like reading stuff myself where I have to work a little bit, because that's the experience of the real world. If you ever travel to some foreign nation, getting accustomed to the language and customs and so forth always takes some work. That's the fun of it. If I don't get that from a story, it doesn't feel real to me. I can only imagine the readers who don't like to work are people who don't like to travel much either. I've had to work at keeping my story structure as simple as feasible, to explain the world in ways that are dramatically interesting, so don't feel at all like reading an encyclopedia. That's always the danger.  Character or world? If you had to give up one or the other, which would it be?  Tim Akers: Sadly, character. I'm a world-builder first. Again, it's a personal weakness, one that I'm trying to overcome. Writers need to learn to clearly identify their weaknesses and go after them, rather than trying to prop them up with their strengths. But I don't know that I could write a book that was just a character study. I'm not to that point in my development as a craftsman just yet.  Joel Shepherd: Easy: Character is everything. Worlds are only interesting to the extent that there are interesting characters to populate them. It's very much like the line about \"If a tree falls in a forest, and no one is there to see, did it really fall?\" What is a world without characters to experience it, vicariously, on the behalf of the reader?  M. D. Lachlan/Mark Barrowcliffe: Characters exist only in their world. You can't have one without another. A ninth-century Viking is a very different person than a 21st-century teenager. The world shapes the character, and the world only comes to life through the character's eyes. The mines of Moria would look very different if you were describing them from the point of view of an Orc. That said, I'm not very interested in traditional fantasy world-building, at least as a writer. It's very hard, this far into fantasy's evolution as a genre, to come up with anything new or interesting.  I believe this is why people like George R. R. Martin and Joe Abercrombie have steered clear of worlds packed with monsters and magic and alien races. In fact, I'd argue that the weakest part of Martin's work is the traditional monsters. I found the Others pretty dull and I love A Game of Thrones. Martin's strength is in his brilliantly realized characters.  To me, another race of elves, another beast man, or another bird woman is much less interesting than the interplay of characters. I'm not interested in how your dwarves smelt their gold. I regard that as a decoration to the story. I'm more interested in how your dwarf thinks, and how that affects his or her interaction with your main characters. This is why I chose historical fantasy. The world-building's done for you, though, of course, you still have to come up with your interpretation of both the history and the myth. Then uou can get on with telling the story.  Justina Robson: [Character and world] are inseparable. Actions are meaningless without context. Character creates their world and vice versa in an eternal round.  Mark Chadbourn: All stories are about characters. [A world without characters] would be like have a theater stage with no actors on it. I know some people get whipped up with enthusiasm in their world-building, but the world should really be devised to underpin the themes the author wants to discuss. The themes come out of the characters.  K.V. Johansen: The characters are shaped by their world and can't exist without it. If I put Holla-Sayan and Moth into another world, they wouldn't be Holla-Sayan and Moth anymore; they'd have to be different people shaped by that world, whatever it was.  Kay Kenyon: In a forced choice, I would give up world-building. I would be terribly disappointed, but after all, stories are about people. Flat characters can't (for me) provide enough horsepower for a great read.  Do you have any parting words of advice, encouragement, or mischief for fellow world-builders out there?  Tim Akers: Think big; write small. You can have the most awesome, mind-breaking idea for a world that anyone has ever seen, but if it isn't populated by interesting characters that engage the reader—doing things that are interesting in locales that are interesting—you're going to lose your audience. It doesn't matter how cool your idea is. You have to execute on every stage of the writing process to pull it off.  Joel Shepherd: Travel.  M. D. Lachlan/Mark Barrowcliffe: Don't build worlds. Write. The world that emerges as you do so will be far more complex and interesting than anything you dryly invent separately to your characters and the story. Mapping out the city of the Night People is just an excuse for not writing. The Lord of the Rings is \"a tale that grew in the telling.\" Over-planning can kill writing. This isn't to say that the enchantment of a well-thought-out world is unimportant. It's just secondary to the characters. Get them right, and everything else falls into place. And use a light touch with the details of your world. One well-chosen sentence or metaphor is preferable to ten pages of detailed description. No one cares that your tree folk use hammocks made of vines. They care that your hero finds them uncomfortable to sleep in.  Justina Robson: Have fun!  Mark Chadbourn: Choose the overarching story you want to tell first, then decide what kind of characters you need to play it out. Only then start putting together the kind of world that will best illustrate all the elements of your story. Otherwise you face the danger of a wonderfully lavish world populated by characters with nothing to say.  K.V. Johansen: Read lots of nonfiction. You never know what apparently random seed is going to take root and grow into something interesting.  Kay Kenyon: Anchor your world to some familiar things so that you don't ask too much of the reader. I think SF/F readers will do half the work of imagining, but you can't ask them to share an opium dream. Also, don't explain everything. It can undermine your world rather than justify it. As encouragement: Only science fiction and fantasy will allow you to have so much fun being the god of a world. Enjoy the act of creation!  Mischief: Never kill a dog. I did that in one book, and it sold the worst of all of mine.  M. D. Lachlan/Mark Barrowcliffe: You don't need a wodge of notes about your world. You're a writer—write, and make it up as you go along.  Mark Chadbourn's trilogies (www.markchadbourn.net) include The Age of Misrule, The Dark Age, Kingdom of the Serpent, and Swords of Albion.  K. V. Johansen (www.kvj.ca/blackdog) is the author of Blackdog, as well as such series as Torrie Quests, The Cassandra Virus, and The Warlocks of Talverdin.  Kay Kenyon's (www.kaykenyon.com) The Entire and the Rose series began with Bright of the Sky and has continued to the fourth installment, Prince of Storms.  M. D. Lachlan/Mark Barrowcliffe is the author of Wolfsangel and Fenrir, as well as Girlfriend 44 and The Elfish Gene under his real name, Mark Barrowcliffe.  Justina Robson (justinarobson.blogspot.com) is the author of Mappa Mundi, Silver Screen, and the Quantum Gravity series.  Joel Shepherd is the author of a science fiction series about Cassandra Kresnov and the fantasy series A Trial of Blood and Steel.  Jeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "text": "Interview\nSuitably Strange: A Round-Table Discussion of World-Building\nImaginary worlds offer readers a time and place that is different from the world they live in. Imaginary worlds offer a fresh perspective, a new POV—a slanted angle of vision. These settings, these places— secondary worlds or \"the realm of fairy-story,\" as J. R. R. Tolkien called them—come with their own rules, their own customs, and their own logic.\n\"The realm of fairy-story,\" Tolkien writes in \"On Fairy-Stories,\" \"is wide and deep and high and filled with many things: all manner of beasts and birds are found there; shoreless seas and stars uncounted; beauty that is an enchantment, and an ever-present peril; both joy and sorrow as sharp as swords. In that realm a man may, perhaps, count himself fortunate to have wandered, but its very richness and strangeness tie the tongue of a traveller who would report them. And while he is there it is dangerous for him to ask too many questions, lest the gates should be shut and the keys be lost.\"\nAt their best, imaginary worlds offer an immersive experience. We enter, we are filled with wonder, and we are changed by the experience.\nImaginary worlds don't just happen. They must be built—whether prior to or during the telling of the story. Builders of worlds seek coherence, consistency, feasibility, and that ever-important \"cool factor.\" World-builders are both creator and first explorers of their worlds, inspired by personal experiences, real world history, the mysteries of human evolution, or grandly conceived \"what ifs.\" They draw on African, Celtic, Greek, Native American, and Norse mythologies and landscapes, among others.\nBelow, Tim Akers, Mark Chadbourn, K. V. Johansen, Kay Kenyon, M. D. Lachlan, Justina Robson, and Joel Shepherd discuss their imaginary worlds and how they created them. These seven authors, all of whom publish with Pyr, write a wide variety of speculative fiction, from historical fantasy to science fiction to \"steampunk and sorcery.\" They've \"thought-formed\" worlds, \"liquid-life-engines\", starfish-shaped universes, and worlds very similar to our own, except for a few crucial deviations.\nSome of these authors started building their worlds by \"reading and thinking and studying. \" Some planned ahead, while others allowed the world to grow with the writing. Some started with an \"odd thought,\" others with compelling characters—characters like a princess turned warrior, an archaeologist in the Otherworld, a caravan-guard fleeing madness, a star pilot grieving the loss of his family, or a synthetic human pursuing answers while fleeing for her life.\nWhatever the method or starting point, the goal seems to be the same: a place suitably strange, yet somehow recognizable.\nWhat's something really cool about your secondary world that doesn't show up in any of your novels or short stories?\nTim Akers: For the book I'm working on right now, there's about four or five hundred years of history that I've sketched out, from migration patterns to wars to the establishment of three different religions, two of which are dead by the time the actual books start. I keep finding myself wanting to write those stories instead, or in addition to. I can really see how authors can fall into the temptation of interrupting a series to go write a prequel or something.\nMark Chadbourn: In my interlinked sequences that began with Age of Misrule, the secondary world is the mystical Otherworld of Celtic mythology, the home of gods, Fabulous Beasts, magic and mayhem. Every time a character crosses over from our own world, he or she sees different aspects of it, or it appears subtly altered. What is never stated is that it's a thought-form world, completely fluid in nature, which is created and shaped by the mind and preconceptions of the people who visit it.\nM. D. Lachlan/Mark Barrowcliffe: I write historical fantasy, so it's our world but with the mythology taken literally. So, as I'm writing at the beginning of the Viking age, the gods do interfere in human destinies. Witches exist. Magic is taken directly from that described in ancient Norse poetry. The coolest thing is how strange history is—how differently people think and act to modern people. For instance, the size of the settlements. In Wolfsangel, Vali looks on the town of Haithabu as unimaginably large. It contains one hundred houses.\nK.V. Johansen: Some of the history of the Old Great Gods and the devils is quite cool, I think. I know a lot more about the cold hells and the \"heavens beyond the stars\" in which the human storytellers place the Great Gods and devils than appears in the published stories. But I'm not going to talk about that yet! (Although people can probably figure a part of it out. In \"The Storyteller\" there's a bit more about that than in Blackdog.) In general, though, because of the way I work, the world grows as I write. I don't usually see much of what lies over the horizon until not too long before the story gets there. That's true of both the physical landscape and the social/historical/cosmological landscape, the cultures and the systems of magic.\nKay Kenyon: My secondary world, called the Entire, is both a world and a universe. It is a landlocked universe that is shaped like a starfish, in that it has five geographic arms, or \"primacies,\" radiating outward from a central sea of impossible, vaguely oceanic matter. Things are so cosmically far apart that the only efficient way to travel is on the Nigh, a five-armed river fed from the central sea over which is suspended the Ascendancy where advanced beings dwell when they're not up to no good.\nJustina Robson: I guess you mean this secondary world I'm making right now. Animal-people, I'd have to say. I haven't done those before. They're biomorphs: life-liquid-engines. Haven't entirely finished working on their true nature. It's been very hard going. My imagination wants them to be one way and my scientific brain is telling me it's all never going to work so... obviously imagination has to win eventually and I'm struggling towards that.\nWhere did you start building your secondary world?\nMark Chadbourn: I looked first at the old stories of Celtic mythology, and then at other mythologies—Norse, Greek, Native American, Chinese, African and more—searching for commonalities. The conceit is that this world is the source of all our stories, our myths, legends and folklore, our dreams, so it needed to be very much an ur-world that could speak to all cultures.\nK.V. Johansen: I started with the landscape of the Turkmenistan desert and the idea of small, local gods. In Blackdog, the mountains, a combination of the Himalayas and the mountains of central Asia, came into it almost right away, with the Siberian taiga lurking in the northeast. In a way, the seed of the world is a book and a TV series, Realms of the Russian Bear, on the natural history of the former Soviet Union; both the BBC producer and the Russian host were biologists, so it's a cut above the usual sort of nature documentary and the book is very detailed. I had a fascination with the landscape and natural history described in that for some time, and when the story began, with the idea of the character who became Holla-Sayan being possessed by the Blackdog, it just always seemed to have existed in that landscape.\nKay Kenyon: I started with the odd thought, what if you didn't need space travel to get across the universe, but could instead sort of hoof it? What if you could walk to Alpha Centauri or the equivalent? And if you can walk, obviously there are no stars or space. So what is this place? It's a tunnel. It burrows through our own universe. At this point you have to write the story to find out what the hell is going on.\nJoel Shepherd: For me it always starts with the cultures, politics, belief systems, and languages of various parts of the world. And that is always driven by the dramatic requirements of the story. In A Trial of Blood and Steel, I wanted to tell a story largely driven by the conflicts between the different values that arise from different kinds of civilizations. My main character was a young woman, a former princess who renounced her heritage to become a warrior in the somewhat exotic style of distant Saalshen. I loved the dramatic conflicts that sprung from a main character, one who chooses to give up that status and privilege for something that suits her better as a person. But I needed to have a land where that would be possible, because in a lot of lands it wouldn't be. And so I came up with Lenayin, a land of individualist warriors where the royal family has only very precarious power, and inherited title means little, because everyone worships achievements and skill more than family. Much of that creation of Lenayin was driven by my need to make my main character's situation believable.\nOnce I had Lenayin, the other lands and peoples evolved at least in part as foils for Lenayin. For example, the main enemies or bad guys of the series turn out to be people who live in the more traditional European feudal system, which Lenays mainly detest because of the serfdom it forces most of the population into. And that clash of values is reflected in the beliefs of my characters, which then becomes the kind of personal, dramatic tension that makes stories work.\nTim Akers: Because of my particular background, religion and cosmology inform pretty much everything I do. So I always start with the gods, the religions, the hidden powers that work beneath the world. That informs culture, which informs history, which in turn informs plot and character. I tend to start big and work my way down into the specific. Of course, that reveals a lot of my weaknesses as a writer, too. I'm good at the grand patterns, but I'm still learning how to craft the perfect character.\nIn what manner did you develop the secondary world from the original seed?\nJustina Robson: By reading and thinking and studying a lot of social-science material, anthropology, and daydreaming. This was all very distracting from the real development of the story, but I wanted a credible base layer, even if I never actually write about it directly. It has to make a kind of sense to me in terms I am content with. So I've been trying to figure out realistic and necessary conditions for everything that the story has. Unfortunately this has sometimes made me attempt to \"answer\" the mysteries of human cultures, their evolution and possible biological origins, trying to separate necessary things from chance and memetic accretions... a totally impossible Gordian knot. So now I'm down to choosing where I cut the knot and what statements about the present I'm really trying to make. But I'm often distracted and also dismayed that many of my observations are so damning. I'm trying to dig my way out of Western, Christianized, secular, liberal, and capitalist culture and... ugh... it's nearly impossibly hard and manic, like some kind of Whack-A-Credo. You get one, and four more pop up from your unconsciou But it's worth a stab at something a little bit more than just a reactionary OMYGODWUT.\nKay Kenyon: Once I had the tunnel idea and knew that an advanced civilization created the Entire, I started asking questions like, who would live there? How like or unlike humans will they be? What technologies do they have? If this universe is a tunnel, what mechanism creates day and night, if such exists? Each of these answers constrains and/or influences the answer to the next question, and so forth, until you begin to find a coherent world, suitably strange, but with anchors to human experience. At times this process is exhilarating and sometimes you expect it to collapse like a house of cards. Not the least of the challenges is how to make such an improbable place coherent yet mysterious, strange but somehow recognizable.\nTim Akers: For my second book, The Horns of Ruin, I developed a story about three gods who were brothers, and who ended up betraying each other until only one of them was still alive. Then I imagined the church that would be built on that kind of history, and then what a society based on that church would look like. The tone of that kind of theocracy is going to flavor everything, from your architecture to the way the three churches interact, to why people would choose to serve a god who was dead, or a god who murdered his brother. Again, I built from the large (gods killing each other!) to the small, and then built a plot around that.\nM. D. Lachlan/Mark Barrowcliffe: I started with research into the Viking age. This meant I read a general historical text on the Vikings, some of the sagas and also the Eddas. The Eddas are the 14th-century poems written by an Icelandic historian, Snorri Sturluson. He collected oral poems and wrote them down. These form the main plank of our knowledge about Viking myth. At that point I started writing. It's always better to start writing sooner rather than later. If you find out, or decide, that the deck on your longship isn't as extensive as you first wrote, you can always change it later. I then research as I go along—reading books on Viking ships or arms and armor, for instance and getting information from the many great web resources. If I were in a completely invented world I wouldn't have to bother with all this and would just start writing immediately after I had the idea for the story.\nK.V. Johansen: The local gods, which are such a vital part of the Blackdog secondary world, grew out of the existence of the Blackdog. There he was; I had to find out why. The incarnate goddess who needed a guardian was the why, and the rules of the world grew out of developing a theology in which this limited, lake-bound goddess could exist. As the world developed, with its local gods and goddesses, the demons of the wild places, the Old Great Gods and the banished devils, the Blackdog didn't seem to be quite any of them. I had that question in the back of my mind for most of the book: What, really, was the Blackdog? Wondering about that led to a lot of ancient history developing as an underpinning for his existence, which now seems such a foundation for the world that it's a bit disconcerting to remember that none of that was there when I started.\nOnce I had the idea of local gods who were very limited in their powers, it seemed to make sense that there wouldn't be very many large kingdoms or empires; the limited gods would lead to limited tribal regions. Geography shapes culture, so there are larger groupings of peoples linked by common culture and language, but a person's emotional attachment is to a much smaller idea of place, and the political units are also usually centred on individual gods or goddesses. There are certainly kingdoms containing more than one god, but they're usually not great monolithic nations, which prevent their kings being absolute monarchs. Only a few empires have ever existed.\nSetting the story along a caravan route meant that I could explore the different cultures linked by that road. It's the sort of world where you could get a lot of isolationist, mistrustful cultures, but instead it turned out to be one where this river of trade and travel means there is a constant flow of cultural influence and language. As Holla-Sayan travelled, I had to keep developing new gods and places, which meant looking at new interpretations of the basic idea of a god limited in territory and influence.\nMark Chadbourn: The danger of creating an ur-world was that it would be too familiar, filled with too many tropes that we'd all seen played out in books, films, and TV over the years. Once I'd identified the elements that spoke to many disparate cultures, I needed to twist them, turning archetypes into elements that were three-dimensional, rich and unique. Part of the process included re-naming some concepts—for instance, dragons—to prevent readers bringing a bagful of preconceptions to the story. By the time the reader had figured out what the things are, I'd had space to imprint my reading upon it.\nDo you ever get bogged down in the world-building process?\nJustina Robson: Endlessly. I use it as an excuse not to write the story or to stop writing when I feel very anxious and... well... as an excuse for everything really. I keep coming up against my inner demon which tells me I have to be right or I can't go on. I have to solve it. I have to solve everything, or I'm unjustified in making whatever flaky claim my story is trying to make in the face of a relentlessly nitpicky universe. I escape by reading romances and novels by people who are smart enough never to care about this stuff. I realize it's starting to sound like I think world-building is pointless. I don't. But for me, story is first. If the world is going to get in the way because of some notion that I am writing SF and therefore it has to make a literal sense, it doesn't want to make because it is really all metaphors then metaphors must win. Every time. All the time. I never give two hoots for anyone else's cruddy world-building if their story blows my mind. I might potshot at it later, and god help them if the story blows. But if it's good, I don't care at all. I am in it for the trip, not the brochure.\nK.V. Johansen: Possibly—if by bogged down you mean distracted, so that the world-building takes over and the adventure gets sidetracked. \"This is getting interested, let's keep going and see what that's like. Oh, wait, that has nothing to do with this particular story.\" There's a southern continent across an ocean channel which has trade with the Five Cities. The Five Cities aren't in Blackdog either, but they're there, Nabbani colonies east and south of Marakand. And the early history of Marakand, the city where the eastern and western caravan roads meet, is really fascinating and can distract me from the more immediate history that is the story in hand. But name a place Marakand, which is fairly obviously derived from Asmarakand, which became Samarkand, and it's crying out for a mysterious, romantic past, isn't it? And I can start hunting for books from which to develop some small detail and end up with a stack of six histories, reading for background on something that's going to be a tiny presence in the story itself. I guess I like things to have roots. (Also, it's an excuse to add to my library, of course.) It's really important for the world not to end at the edges of the map and for there to be a past before the story begins, a foundation for everything, but sometimes I can end up knowing more about the past of something than its present, and have to step out of it a bit and refocus on the story's here and now. I don't work out things like that in advance, though. They unfold, or I go chasing after them, as I get to them, and then I can end up with pages I have to cut out and stash in another file because it's not part of the story; it's just stuff that I have to know so the story can go on.\nTim Akers: I can spend too much time on world-building, because it's the part that makes me tick. I started as a designer of roleplaying games, and I still have a great deal of affection for the tabletop dice. In fact, if it were possible to just make a living creating and deploying hyper-deep worlds for people to explore, that's probably what I would be doing. I suppose I could make a go of it in the computer game industry, but I'm focused on honing my craft as a writer. Plus I love words, I love language, and I love story. I'm not sure you can practice all of that in that industry.\nJoel Shepherd: [I don't get bogged down] really, but there are times when I feel the story becomes bogged down if I haven't sufficiently developed the world. The characters, and therefore the story, must interact with their environment in a way that enriches the story. If the world isn't sufficiently developed, sometimes I've felt there just isn't any energy happening between the characters and their world, much the same as a relationship between characters that lacks energy or excitement. So I have to go away and think for a bit about what's missing from the world, and what would liven up the experience.\nM. D. Lachlan/Mark Barrowcliffe: If I were writing a traditional fantasy, I wouldn't bother about very detailed world-building at all before I started writing. I'd just have a character in an interesting dilemma and start making it up from there. It's a complete distraction for a writer to take thousands of notes on his or her invented world before sitting down to write. Stories are about people—from The Lord of the Rings through Earthsea and Moorcock to modern day fantasy. The world is essentially a setting for people to do things in. No one comes to a book to read about the exact appearance of a Black Rider. They come to the book to share Frodo's terror, to marvel at his bravery and ingenuity in escaping the dark forces. So my advice would be to make it up as you go along. When I wrote the character of Loki in Wolfsangel I didn't map him out beforehand. He appeared in the story and I heard him start to speak. I didn't realize my witches were using a magic system based on bodily denial and self-inflicted torture before they actually appeared. I started writing the character of the witch queen in a scene where she had had a premonition of disaster. The way she went about her magic just appeared on the page.\nKay Kenyon: I favor complicated worlds. There are days when I think I'm going too far, but can't seem to help myself. The distortions of the mundane world may be too much fun; they can threaten, by their very detail, to sink the premise. The only way out of this snarl is to start writing. Plot and character are a great discipline to me; they force me to focus and sometimes simplify.\nHave there been any cataclysmic events in your secondary world? If so, how did it change the world?\nJustina Robson: The shapeshifters developed weapons of mass destruction, and now there's an arms race. But really, that's a side issue. The cataclysm is a very slow one: the shapeshifters evolving faster, smarter, and encroaching on the \"human\" ground.\nK.V. Johansen: In the Blackdog world, the first war involving the devils happened so long ago that it's not really remembered well in human stories, and is described as a war of wizards by some characters. The gods of the empire of Tiypur (and the empire itself as a political entity) were destroyed, so the region of Tiypur is now a land without gods. What that means for the world, that lack of any divinity there, is something that will come up later as the story, I hope, goes on. People from that part of the world, like Thekla in Blackdog, worship a memory of gods they know are dead, pray to gods they know can't hear them. That's an interesting state of mind. If the gods of your world are real and other people of other folks (or tribes or lands) can interact with their gods, and you and your people can't, because you know your gods are dead, where do you find your focus, the core of your identity as a folk? What might end up filling that emotional vacuum for people? One battle of that war also had a physical effect further east, in the blighted landscape of the eastern shore of the Kinsai'av in Blackdog; there's a region all along the river that's still a wasteland because of it.\nIn The Shadow Road, the fourth book of my Warlocks of Talverdin series about the Nightwalkers, a lot of the action takes place in a world suffering a supervolcano-induced ice age, not unlike that nuclear winter that we all thought might be coming when I was a teenager once WWIII came along. The supervolcano was triggered by misuse of a particular and not fully understood magic as much as by natural processes. The population of the planet has been pretty much wiped out, many in the initial disaster but most of the rest in a slow decline as the climate changes; it's reached the point when the story happens that glaciers cover much of the world and civilization, in the true meaning of the word, has ended. One of the heroes is living in what she thinks is probably the last settlement of people alive in the entire world.\nKay Kenyon: My world has had short geologic ages during which it was formed and then populated by degree, in a process of copying life forms from \"our\" universe, the Rose. But this creation period is in back story, not brought on stage. Aside from that, the story contains a cataclysmic event in one of the \"minorals\" or offshoots of a \"primacy.\" It's an event that demonstrates the ruling class ruthlessness and contributes to an uprising.\nWhat goes into the development of a magic system?\nK.V. Johansen: Some research and lots of (desperate) inspiration! In world of Blackdog, each region has its own forms and rituals of magic. Coming up with these and having them evolve as the story moves from region to region is challenging, sometimes. They all have to have some common ground, too, as the magic underneath is all the same. Sometimes it's just something that leaps out as a neat idea while I'm writing, like the Grasslander cat's-cradles, and sometimes it involves a lot of thinking about similar cultures in the primary world and what they believed had power.\nTim Akers: Again, a lot of my experience with this comes from my time in RPGs. Personally, I need to figure out power sources, the strict rules of the powers, the costs and benefits and dangers of them. But on top of that you have to figure out how these things fit into the culture. Especially when religion gets involved, you can really end up with some complicated societal effects to magic. What roles do belief and faith play in world where there's manifest arcane and divine power all around? In what ways have dogma impacted the culture's understanding of magic and its application? Those kinds of questions really drive my construction of the magical systems in my worlds. What fun is making up dogma if you can't make up heresy?\nM. D. Lachlan/Mark Barrowcliffe: Like all writing, the development of magic comes from what you already know and a desire to do something new—and in my case an irritation with the tropes of traditional horror and fantasy.\nReviewers have commented that they haven't seen a magic system like mine in fantasy before. I found this surprising, because it's the magic that people practice in the real world. My magic is based on starvation, pain, denial of sleep, drowning, and freezing. It's a magic of ordeal, and you can see it used in everything from Inca death rituals to Yoga, the desert retreats of Christian mystics, the sweat lodges of the Native Americans, the consumption of hallucinogenic mushrooms, the dances of the Dervishes. I have a good grounding in myth and real world magic—although I don't believe in its literal truth—because I've been interested in magic and witchcraft since I was a child. I've done a lot of reading, so I have a lot to draw on.\nI came to the specifics of my magic system through two ideas. The first is an extract from the Edda, in which Odin gives his eye for knowledge of the runes. The second was when I read that Norse mystics would seat themselves on a high chair to perform their prophecies. It occurred to me that this might be to deny themselves sleep. From there I needed an idea of the runes and I just envisaged them as living things that root in the mind of the sorcerer, sustained by her rituals and starvation. I took that, I think, from a misreading of the Poetic Edda. There's this beautiful verse which describes Odin's sufferings for magic:\nI know that I hung on a windy tree\nnine long nights,\nwounded with a spear, dedicated to Odin,\nmyself to myself,\non that tree of which no man knows\nfrom where its roots run.\nNo bread did they give me nor a drink from a horn,\ndownwards I peered;\nI took up the runes, shrieking I took them,\nthen I fell back from there\nThis verse is the key to everything that happens in the Wolfsangel books. The misreading was of the \"shrieking\" (screaming in some translations). I originally read it that the runes were shrieking, not Odin. This gave me the idea that they were living things. Magic is solely a female preserve in my world. Men regard it as effeminate and beneath them, something you'd only resort to if you were too weak to fight. Again, this comes directly out of the Norse myth. The gods practice magic, but Norse gods are quite a gender-bending bunch.\nMy werewolf came from the idea of getting rid of the normal werewolf tropes that Hollywood invented. There's no changing with the full moon, no silver bullets, no separation of the wolf and human identities. It always annoyed me that a 150-pound man could turn into a two-ton wolf within an hour. I know we're dealing with magic, so anything is possible. But that always struck me as contrary to the laws of physics. Matter is coming from nowhere. My werewolf changes slowly, over a period of about a year. He puts on weight by eating people. My werewolf's transformation is one-way—no changing back—and the wolf is consuming his personality from the inside. The idea of linking it to the myth of the Fenris wolf arrived about half way into the writing of the book. Again, I didn't plan on or let it worry me that I hadn't got every last detail worked out. The feel of the story was right and that was all that mattered.\nIf I were designing a magic system for a pure fantasy novel I'd avoid fireballs or \"six-gun magic\"—that is, magical effects that could just be a replacement for a gun or a laser pistol. It's important in any writing to avoid cliché. The only thing you need to do is come up with something new, that is, if you want to write something really memorable. If you just want to churn out another genre standard, then you can embrace its clichés. That said, you should always strive to do something new in some way. Otherwise why not just read the stuff that's already out there, and save yourself the bother of writing? You might write a bestseller by adhering to the genre's clichés, but that's not what writing's about. If you're in it to make money, become a banker. Writing—and fantasy writing in particular—is about striving for something unique and resonant.\nJustina Robson: Far-future technologies in my case. Or, as it is also known, \"pseudoscientific jargon.\" Magic is either incomprehensibly useful technology that allows you to write a story in a certain way or it is a straight metaphor for creativity and charisma. In either case it has to hold water convincingly and logically. Someone has to pay somehow. Nothing is free.\nMark Chadbourn: My stories are split between our own world and the Otherworld, and I needed a magic system that would not jar too much with our contemporary existence. I went back and researched the occult systems of magicians—from John Dee to Aleister Crowley to modern chaos magicians—and identified what would fit in my cosmology.\nWhen it comes to world-building, what are you good at and not as good at? How have you taken advantage of the strengths and compensated for the weaknesses?\nTim Akers: I touched on this before, but I think it's important for writers to not just compensate for their weaknesses. We need to meet them head on. It's easy to use our strengths as a crutch to cover up our weaknesses, but we'd be better off as artists and craftsman to actively engage our weaknesses and improve them. When I first started writing I was terrible at dialogue. That's just a matter of craft, so I really studied language, the way people talk, the way they communicate, and now dialogue is one of the things that I'm good at. When it comes to world-building, my strengths lie in religion, in magic, and in backstory. The larger the scale, the better I do. My weakness is character. So I push myself to make characters that make me uncomfortable, that stretch my admittedly simple boundaries. There's no way for me to get better if I don't. And while I'm not good enough to produce truly revolutionary character tropes, I resist the urge to fall back on the comfortable, simple character tropes that permeate so much of fantasy.\nKay Kenyon: I think my strength is sense of wonder and depth. When I take on a particularly bizarre world, one of the things I work hard at is believability—that is, creating verisimilitude despite unlikely claims. Part of the job is not to rely over much on explaining, but using point of view and character to soften/authenticate strangeness. One aspect of world building that I admire in others and don't accomplish to my satisfaction is alien language—that is, creating an intriguing a lexicon. I minimize the use of foreign words.\nJoel Shepherd: I'm good at cultures and civilizations on the broad scale. I enjoy the complexities—not because I'm addicted to needless complexity, but because complexity exists everywhere in the real world, and I've always found it fascinating. I'm also good at politics and political science broadly (I'm currently writing an international relations PhD), and those kinds of struggles form a lot of the motivations of my characters.\nNot so good at? Making it simple. Some people like simple. My work's probably not for them. I like reading stuff myself where I have to work a little bit, because that's the experience of the real world. If you ever travel to some foreign nation, getting accustomed to the language and customs and so forth always takes some work. That's the fun of it. If I don't get that from a story, it doesn't feel real to me. I can only imagine the readers who don't like to work are people who don't like to travel much either. I've had to work at keeping my story structure as simple as feasible, to explain the world in ways that are dramatically interesting, so don't feel at all like reading an encyclopedia. That's always the danger.\nCharacter or world? If you had to give up one or the other, which would it be?\nTim Akers: Sadly, character. I'm a world-builder first. Again, it's a personal weakness, one that I'm trying to overcome. Writers need to learn to clearly identify their weaknesses and go after them, rather than trying to prop them up with their strengths. But I don't know that I could write a book that was just a character study. I'm not to that point in my development as a craftsman just yet.\nJoel Shepherd: Easy: Character is everything. Worlds are only interesting to the extent that there are interesting characters to populate them. It's very much like the line about \"If a tree falls in a forest, and no one is there to see, did it really fall?\" What is a world without characters to experience it, vicariously, on the behalf of the reader?\nM. D. Lachlan/Mark Barrowcliffe: Characters exist only in their world. You can't have one without another. A ninth-century Viking is a very different person than a 21st-century teenager. The world shapes the character, and the world only comes to life through the character's eyes. The mines of Moria would look very different if you were describing them from the point of view of an Orc. That said, I'm not very interested in traditional fantasy world-building, at least as a writer. It's very hard, this far into fantasy's evolution as a genre, to come up with anything new or interesting.\nI believe this is why people like George R. R. Martin and Joe Abercrombie have steered clear of worlds packed with monsters and magic and alien races. In fact, I'd argue that the weakest part of Martin's work is the traditional monsters. I found the Others pretty dull and I love A Game of Thrones. Martin's strength is in his brilliantly realized characters.\nTo me, another race of elves, another beast man, or another bird woman is much less interesting than the interplay of characters. I'm not interested in how your dwarves smelt their gold. I regard that as a decoration to the story. I'm more interested in how your dwarf thinks, and how that affects his or her interaction with your main characters. This is why I chose historical fantasy. The world-building's done for you, though, of course, you still have to come up with your interpretation of both the history and the myth. Then uou can get on with telling the story.\nJustina Robson: [Character and world] are inseparable. Actions are meaningless without context. Character creates their world and vice versa in an eternal round.\nMark Chadbourn: All stories are about characters. [A world without characters] would be like have a theater stage with no actors on it. I know some people get whipped up with enthusiasm in their world-building, but the world should really be devised to underpin the themes the author wants to discuss. The themes come out of the characters.\nK.V. Johansen: The characters are shaped by their world and can't exist without it. If I put Holla-Sayan and Moth into another world, they wouldn't be Holla-Sayan and Moth anymore; they'd have to be different people shaped by that world, whatever it was.\nKay Kenyon: In a forced choice, I would give up world-building. I would be terribly disappointed, but after all, stories are about people. Flat characters can't (for me) provide enough horsepower for a great read.\nDo you have any parting words of advice, encouragement, or mischief for fellow world-builders out there?\nTim Akers: Think big; write small. You can have the most awesome, mind-breaking idea for a world that anyone has ever seen, but if it isn't populated by interesting characters that engage the reader—doing things that are interesting in locales that are interesting—you're going to lose your audience. It doesn't matter how cool your idea is. You have to execute on every stage of the writing process to pull it off.\nJoel Shepherd: Travel.\nM. D. Lachlan/Mark Barrowcliffe: Don't build worlds. Write. The world that emerges as you do so will be far more complex and interesting than anything you dryly invent separately to your characters and the story. Mapping out the city of the Night People is just an excuse for not writing. The Lord of the Rings is \"a tale that grew in the telling.\" Over-planning can kill writing. This isn't to say that the enchantment of a well-thought-out world is unimportant. It's just secondary to the characters. Get them right, and everything else falls into place. And use a light touch with the details of your world. One well-chosen sentence or metaphor is preferable to ten pages of detailed description. No one cares that your tree folk use hammocks made of vines. They care that your hero finds them uncomfortable to sleep in.\nJustina Robson: Have fun!\nMark Chadbourn: Choose the overarching story you want to tell first, then decide what kind of characters you need to play it out. Only then start putting together the kind of world that will best illustrate all the elements of your story. Otherwise you face the danger of a wonderfully lavish world populated by characters with nothing to say.\nK.V. Johansen: Read lots of nonfiction. You never know what apparently random seed is going to take root and grow into something interesting.\nKay Kenyon: Anchor your world to some familiar things so that you don't ask too much of the reader. I think SF/F readers will do half the work of imagining, but you can't ask them to share an opium dream. Also, don't explain everything. It can undermine your world rather than justify it. As encouragement: Only science fiction and fantasy will allow you to have so much fun being the god of a world. Enjoy the act of creation!\nMischief: Never kill a dog. I did that in one book, and it sold the worst of all of mine.\nM. D. Lachlan/Mark Barrowcliffe: You don't need a wodge of notes about your world. You're a writer—write, and make it up as you go along.\nMark Chadbourn's trilogies (www.markchadbourn.net) include The Age of Misrule, The Dark Age, Kingdom of the Serpent, and Swords of Albion.\nK. V. Johansen (www.kvj.ca/blackdog) is the author of Blackdog, as well as such series as Torrie Quests, The Cassandra Virus, and The Warlocks of Talverdin.\nKay Kenyon's (www.kaykenyon.com) The Entire and the Rose series began with Bright of the Sky and has continued to the fourth installment, Prince of Storms.\nM. D. Lachlan/Mark Barrowcliffe is the author of Wolfsangel and Fenrir, as well as Girlfriend 44 and The Elfish Gene under his real name, Mark Barrowcliffe.\nJustina Robson (justinarobson.blogspot.com) is the author of Mappa Mundi, Silver Screen, and the Quantum Gravity series.\nJoel Shepherd is the author of a science fiction series about Cassandra Kresnov and the fantasy series A Trial of Blood and Steel.\nJeremy L. C. Jones is a freelance writer, editor, and teacher. He is the Staff Interviewer for Clarkesworld Magazine and a frequent contributor to Kobold Quarterly and Booklifenow.com. He teaches at Wofford College and Montessori Academy in Spartanburg, SC. He is also the director of Shared Worlds, a creative writing and world-building camp for teenagers that he and Jeff VanderMeer designed in 2006. Jones lives in Upstate South Carolina with his wife, daughter, and flying poodle.", "source": "https://clarkesworldmagazine.com/world_building_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Suitably Strange: A Round-Table Discussion of World-Building by Jeremy L. C. Jones"}