{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "Q0gZHcnlleOyolHkskrIquO7BKg=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: Oh, the Horror of it All!  Points from last month’s editorial and a couple of conversations at Readercon inspired me to go on another data mining expedition. I started digging into the genre data—which the authors provide on submissions—to take a look at possible trends. The data isn’t specific to themes within a genre, but that wasn’t what I was after this time around. I was looking for data to indicate whether or not a specific life event—my 2012 heart attack—had caused a concrete and permanent change in my taste in fiction, and if so, should the submissions guidelines be changed.  My heart attack happened in July 2012, which places it at issue 70, very close to the halfway mark in Clarkesworld’s history. However, in terms of stories published, that’s somewhat misleading. Up through issue 60, we only published two original stories per issue. Issues 61-70 had three stories in each and starting at 95, there were four stories in every other issue. From 100 on, we’ve typically featured five. To further complicate things, we’ve more recently switched from a story count to a word count model. This change has allowed us to be a bit more flexible in publishing longer works, but has made the total number of stories per issue more variable.  As a starting point, I tossed together a quick graph to visualize my selections since 2012:   As you can see, approximately 77% of the stories we’ve published since then are categorized as science fiction by their authors and a bit more than half of what remained are science fiction/fantasy hybrids. Fantasy came in next and was followed by horror blendings with science fiction and fantasy—combined to roughly the same amount as fantasy. The tiny sliver of “other” leans much more SF than anything else (by my opinion, the authors call them a variety of subgenres). What’s missing? Horror.  There’s none.  And now we get to the point of my digging through the data. Since my heart attack, I’ve felt like there’s been a disconnect with my ability to engage with that specific genre. I’ve had my own personal horror, and it appears to have put me off the fictional ones. I don’t like to go there anymore. Yes, there are still some dark SF and dark fantasy pieces—and a lot of heavier themes—still making their way into the magazine, but it looks like I have drawn a line in the sand.  Prior to June 2012, Clarkesworld published some horror, but the data set is so much smaller that a single story has a much more significant impact on the percentages. I could go on about the margin of error and other things, but it would still be visually misleading—and as I’ve found in the past, subject to people reading their own biases into the results. There’s enough armchair statisticians using bad math to score points and fuel causes. Why would I want to contribute to that?  The more I thought about it, the more I came to the realization that the “why” question I was asking myself was completely irrelevant. The history in this context doesn’t matter. What matters is what I am doing now and what I intend to do in the future. There’s nothing wrong with admitting that I’ve lost interest in the horror genre. There’s no shame in feeling that way and there’s nothing stopping me from changing my mind again at some later date.  It’s more important that I be honest with myself, our readers, and the authors submitting their work to Clarkesworld. Effective today, we’re changing our submissions guidelines to remove horror from the list of genres we accept. Given the last six years, that shouldn’t come as a surprise to anyone, but it’s time to make it official. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: Oh, the Horror of it All!\nPoints from last month’s editorial and a couple of conversations at Readercon inspired me to go on another data mining expedition. I started digging into the genre data—which the authors provide on submissions—to take a look at possible trends. The data isn’t specific to themes within a genre, but that wasn’t what I was after this time around. I was looking for data to indicate whether or not a specific life event—my 2012 heart attack—had caused a concrete and permanent change in my taste in fiction, and if so, should the submissions guidelines be changed.\nMy heart attack happened in July 2012, which places it at issue 70, very close to the halfway mark in Clarkesworld’s history. However, in terms of stories published, that’s somewhat misleading. Up through issue 60, we only published two original stories per issue. Issues 61-70 had three stories in each and starting at 95, there were four stories in every other issue. From 100 on, we’ve typically featured five. To further complicate things, we’ve more recently switched from a story count to a word count model. This change has allowed us to be a bit more flexible in publishing longer works, but has made the total number of stories per issue more variable.\nAs a starting point, I tossed together a quick graph to visualize my selections since 2012:\nAs you can see, approximately 77% of the stories we’ve published since then are categorized as science fiction by their authors and a bit more than half of what remained are science fiction/fantasy hybrids. Fantasy came in next and was followed by horror blendings with science fiction and fantasy—combined to roughly the same amount as fantasy. The tiny sliver of “other” leans much more SF than anything else (by my opinion, the authors call them a variety of subgenres). What’s missing? Horror.\nThere’s none.\nAnd now we get to the point of my digging through the data. Since my heart attack, I’ve felt like there’s been a disconnect with my ability to engage with that specific genre. I’ve had my own personal horror, and it appears to have put me off the fictional ones. I don’t like to go there anymore. Yes, there are still some dark SF and dark fantasy pieces—and a lot of heavier themes—still making their way into the magazine, but it looks like I have drawn a line in the sand.\nPrior to June 2012, Clarkesworld published some horror, but the data set is so much smaller that a single story has a much more significant impact on the percentages. I could go on about the margin of error and other things, but it would still be visually misleading—and as I’ve found in the past, subject to people reading their own biases into the results. There’s enough armchair statisticians using bad math to score points and fuel causes. Why would I want to contribute to that?\nThe more I thought about it, the more I came to the realization that the “why” question I was asking myself was completely irrelevant. The history in this context doesn’t matter. What matters is what I am doing now and what I intend to do in the future. There’s nothing wrong with admitting that I’ve lost interest in the horror genre. There’s no shame in feeling that way and there’s nothing stopping me from changing my mind again at some later date.\nIt’s more important that I be honest with myself, our readers, and the authors submitting their work to Clarkesworld. Effective today, we’re changing our submissions guidelines to remove horror from the list of genres we accept. Given the last six years, that shouldn’t come as a surprise to anyone, but it’s time to make it official.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_08_18/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: Oh, the Horror of it All! by Neil Clarke"}