{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "u7Wc0cWV7w19AO1PAO3bTofTUu8=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: SF/F Fiction Magazines, Pandemic Edition  When I was mining social media for ideas for editorials last month, several people asked if I could write something on how magazines have been impacted by the pandemic. While I had already been in contact with several editors, I didn’t feel like I had enough information or time to pursue it for the May issue. Throughout the month, I reached out to colleagues and tried to get a broader view of things. It’s by no means comprehensive, but it’s enough of the picture to be meaningful.  I did collect some hard data independently, but my approach with editors and publishers was informal. I didn’t use any surveys or widespread public calls, which I acknowledge is quite unlike me, but the preliminary conversations I had with my peers made it clear that I’d learn more through casual conversation. As it turned out, things often drifted into “don’t mention me by name” territory, so I’m going to refrain from identifying sources. There’s an undercurrent of anxiety across the field and I have no interest in adding to it. In fact, it’s my hope that putting this information out there will foster discussions that could help all of us. [Before going any further, a note:] I’ve written several articles and editorials about the state of the field either here, on my blog, or in the introductions to The Best Science Fiction of the Year volumes. There’s an unfortunate truth that must be restated here to help place things in context: a very significant portion of the people working at the short fiction magazines are significantly underpaid or not paid at all. Breaking even is defined by several publications as being able to pay the authors, maybe an artist, and occasionally a narrator—only one of which has any sort of standardized pay rate, so the others are often much lower than you’d expect. It’s only in more recent years that editor and staff pay has entered into that discussion and very little progress has been made in that time. This is not for lack of readers. It’s just that the overwhelming majority—often over 90%—don’t support those publications financially. The majority of editors and staff at these publications are dependent on day jobs for their income and healthcare coverage. In some cases, those same jobs provide supplemental funding for their publishing work. On the positive side, none of the magazines I spoke to felt as though they would have to suspend production or lay off employees in the near future. The situation becomes considerably more murky should there be a second or sustained wave of the virus, but everyone is thinking about their own contingency plans. The more immediate impact has been on their marketing and fundraising efforts. Several editors echoed a sentiment that promoting subscriptions, Patreon pages, and Kickstarter campaigns has the appearance of being tone-def or insensitive when so many have been furloughed or lost their jobs. This presents a challenge when trying to offset the losses from canceled subscriptions that have happened for that same reason.  There was no overall consensus on how income has been impacted since this began and the ripple effect will likely continue for months. In some cases, hard numbers can be misleading on the surface. A rise in Patreon supporters at one publication may sound great, but when you look deeper you might discover that the per-pledge rate has dropped, leading to an overall loss. In other cases, Amazon subscriptions were up, but other sources of income were down. Many reported the fluctuations as a wash or minor loss. Only two indicated that they had increases and only one of those was above the previous year’s increase.  One place where there has been a more observable impact is with the nationally distributed print edition of some magazines. The sale of these editions have been restricted to subscriptions due to the (temporary) closures of so many bookstores. Unlike some publications, fiction magazines don't tend to find their way into the big box stores, which creates a vacuum for single issue sales. (I have heard that a handful of indie genre booksellers are still ordering and receiving copies in hopes of being able to sell them when they reopen, but this represents a tiny fraction of single issue sales.) Fortunately, the lion's share of their income comes from print and digital subscriptions, both of which appear to be operating normally from the outside. In some ways, the switch from monthly to bimonthly issues that happened in the 2000s has made this period a bit easier for them to navigate around production and delivery issues.  It’s still too soon, however, to tell whether or not the lack of availability in print newsstands will encourage those reasons to switch to a print and/or digital subscriptions, but as it stands, those publications are losing thousands of single-issue sales every other month. (Locus reported that the 2019 monthly newsstand sales for these magazines was between 2000 and 3000 copies per issue.) Like physical books, issues available in newsstands represent a form of passive marketing, providing additional visibility for those magazines.  The pandemic has also influenced readership and listenership, but once again, inconsistently across the market and varying by month. Like audiobooks, which have seen decreases due to the drop in people commuting to work, many podcasts reported noticeable dips, particularly in the first few months. A few markets reported that the most interesting changes were in listenership patterns, noting an increase in downloads from Spotify. Our own data for May indicated a significant increase in traffic—after two well-below average months—that surpassed pre-pandemic numbers. Temporary spikes and valleys in reading/listening data have been increasingly common lately and make it very difficult to get a clear picture of what is happening or why. Online readership trends seem to reflect similar behavior, but suggest some overall growth.  Very few markets reported normal levels or increases in submissions during February and March, but April and May seem to have been stronger or even above-average months for most. Pandemic stories have been the most common theme and editors expressed very mixed feelings about publishing those in the near future. Some, like myself, have one or two in inventory, but overall, it feels as though this is becoming a temporary “hard sell” for many editors. On the positive side, there’s been a sharp increase in the number of authors submitting stories for the first time. This is a well-received side effect, but the cover letters often indicate darker reasons for making the leap. We wish you all the best.  For many editors, working from home or employing a paperless process was already the norm, allowing us to maintain existing workflows. That didn’t make the magazines immune to problems. For example, equipment failures in a digital environment can be extremely disruptive. With repair shops and service centers closed, it’s become much more difficult to get these issues dealt with in a timely manner.  Inventory and delivery issues have likewise complicated getting replacement parts or equipment. Even then, you might have been able to produce the issue and still had difficulty communicating with readers who might not use technology. The temporary disruption in business reply mail from the USPS, for example, disrupted the flow of subscription renewals. Many foreign post offices were also closed, preventing the delivery of print issues in those locations. Print-on-demand editions like our own, which are normally quite simple, have taken weeks longer to print and deliver. Support services, such as companies that were formatting some digital publications for digital subscriptions, had to temporarily close. All these things and more were weathered and worked around by the editors I spoke to.  I think that one of the things you can note about my colleagues is that they have a certain resilience about them. Above all, the concern about staff pay was most common. The pressures of the pandemic illustrate now more than ever the need for adequate compensation for the editors and staff. It’s the blade hanging over so many of our heads. Yet, in spite of this, everyone continues to soldier on. As one editor put it, this is essential work. Science fiction and fantasy provide an escape and that has value, perhaps more now than before. The notes many of us have received from readers and listeners seem to bear this out.  As always, and especially now, stay safe and support the magazines you read, if you can. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: SF/F Fiction Magazines, Pandemic Edition\nWhen I was mining social media for ideas for editorials last month, several people asked if I could write something on how magazines have been impacted by the pandemic. While I had already been in contact with several editors, I didn’t feel like I had enough information or time to pursue it for the May issue. Throughout the month, I reached out to colleagues and tried to get a broader view of things. It’s by no means comprehensive, but it’s enough of the picture to be meaningful.\nI did collect some hard data independently, but my approach with editors and publishers was informal. I didn’t use any surveys or widespread public calls, which I acknowledge is quite unlike me, but the preliminary conversations I had with my peers made it clear that I’d learn more through casual conversation. As it turned out, things often drifted into “don’t mention me by name” territory, so I’m going to refrain from identifying sources. There’s an undercurrent of anxiety across the field and I have no interest in adding to it. In fact, it’s my hope that putting this information out there will foster discussions that could help all of us.[Before going any further, a note:] I’ve written several articles and editorials about the state of the field either here, on my blog, or in the introductions to The Best Science Fiction of the Year volumes. There’s an unfortunate truth that must be restated here to help place things in context: a very significant portion of the people working at the short fiction magazines are significantly underpaid or not paid at all. Breaking even is defined by several publications as being able to pay the authors, maybe an artist, and occasionally a narrator—only one of which has any sort of standardized pay rate, so the others are often much lower than you’d expect. It’s only in more recent years that editor and staff pay has entered into that discussion and very little progress has been made in that time. This is not for lack of readers. It’s just that the overwhelming majority—often over 90%—don’t support those publications financially. The majority of editors and staff at these publications are dependent on day jobs for their income and healthcare coverage. In some cases, those same jobs provide supplemental funding for their publishing work.\nOn the positive side, none of the magazines I spoke to felt as though they would have to suspend production or lay off employees in the near future. The situation becomes considerably more murky should there be a second or sustained wave of the virus, but everyone is thinking about their own contingency plans. The more immediate impact has been on their marketing and fundraising efforts. Several editors echoed a sentiment that promoting subscriptions, Patreon pages, and Kickstarter campaigns has the appearance of being tone-def or insensitive when so many have been furloughed or lost their jobs. This presents a challenge when trying to offset the losses from canceled subscriptions that have happened for that same reason.\nThere was no overall consensus on how income has been impacted since this began and the ripple effect will likely continue for months. In some cases, hard numbers can be misleading on the surface. A rise in Patreon supporters at one publication may sound great, but when you look deeper you might discover that the per-pledge rate has dropped, leading to an overall loss. In other cases, Amazon subscriptions were up, but other sources of income were down. Many reported the fluctuations as a wash or minor loss. Only two indicated that they had increases and only one of those was above the previous year’s increase.\nOne place where there has been a more observable impact is with the nationally distributed print edition of some magazines. The sale of these editions have been restricted to subscriptions due to the (temporary) closures of so many bookstores. Unlike some publications, fiction magazines don't tend to find their way into the big box stores, which creates a vacuum for single issue sales. (I have heard that a handful of indie genre booksellers are still ordering and receiving copies in hopes of being able to sell them when they reopen, but this represents a tiny fraction of single issue sales.) Fortunately, the lion's share of their income comes from print and digital subscriptions, both of which appear to be operating normally from the outside. In some ways, the switch from monthly to bimonthly issues that happened in the 2000s has made this period a bit easier for them to navigate around production and delivery issues.\nIt’s still too soon, however, to tell whether or not the lack of availability in print newsstands will encourage those reasons to switch to a print and/or digital subscriptions, but as it stands, those publications are losing thousands of single-issue sales every other month. (Locus reported that the 2019 monthly newsstand sales for these magazines was between 2000 and 3000 copies per issue.) Like physical books, issues available in newsstands represent a form of passive marketing, providing additional visibility for those magazines.\nThe pandemic has also influenced readership and listenership, but once again, inconsistently across the market and varying by month. Like audiobooks, which have seen decreases due to the drop in people commuting to work, many podcasts reported noticeable dips, particularly in the first few months. A few markets reported that the most interesting changes were in listenership patterns, noting an increase in downloads from Spotify. Our own data for May indicated a significant increase in traffic—after two well-below average months—that surpassed pre-pandemic numbers. Temporary spikes and valleys in reading/listening data have been increasingly common lately and make it very difficult to get a clear picture of what is happening or why. Online readership trends seem to reflect similar behavior, but suggest some overall growth.\nVery few markets reported normal levels or increases in submissions during February and March, but April and May seem to have been stronger or even above-average months for most. Pandemic stories have been the most common theme and editors expressed very mixed feelings about publishing those in the near future. Some, like myself, have one or two in inventory, but overall, it feels as though this is becoming a temporary “hard sell” for many editors. On the positive side, there’s been a sharp increase in the number of authors submitting stories for the first time. This is a well-received side effect, but the cover letters often indicate darker reasons for making the leap. We wish you all the best.\nFor many editors, working from home or employing a paperless process was already the norm, allowing us to maintain existing workflows. That didn’t make the magazines immune to problems. For example, equipment failures in a digital environment can be extremely disruptive. With repair shops and service centers closed, it’s become much more difficult to get these issues dealt with in a timely manner.\nInventory and delivery issues have likewise complicated getting replacement parts or equipment. Even then, you might have been able to produce the issue and still had difficulty communicating with readers who might not use technology. The temporary disruption in business reply mail from the USPS, for example, disrupted the flow of subscription renewals. Many foreign post offices were also closed, preventing the delivery of print issues in those locations. Print-on-demand editions like our own, which are normally quite simple, have taken weeks longer to print and deliver. Support services, such as companies that were formatting some digital publications for digital subscriptions, had to temporarily close. All these things and more were weathered and worked around by the editors I spoke to.\nI think that one of the things you can note about my colleagues is that they have a certain resilience about them. Above all, the concern about staff pay was most common. The pressures of the pandemic illustrate now more than ever the need for adequate compensation for the editors and staff. It’s the blade hanging over so many of our heads. Yet, in spite of this, everyone continues to soldier on. As one editor put it, this is essential work. Science fiction and fantasy provide an escape and that has value, perhaps more now than before. The notes many of us have received from readers and listeners seem to bear this out.\nAs always, and especially now, stay safe and support the magazines you read, if you can.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_06_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: SF/F Fiction Magazines, Pandemic Edition by Neil Clarke"}