{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tomasz Maronski", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "XuRyC0UCncebo0ArjD62rE6NHJc=", "id": null, "license": null, "comments": "", "raw_text": "Cover Art  Aeropolis    \"My name is Tomasz Maronski. I'm 29. I paint on the canvas for almost 10 years, and during this time I always improve my work expression and techniques, searching for the right, unique ways of expressing either my personality or ideas, fantasy visions hidden inside of my heart. My lasting adventure with computer graphics has started as soon as I possessed the oil painting skills, but unfortunately I didn't have time for that, so I decided to work with computer instead of Pictor.  My paintings concern merely the fantasy themes getting inspirations from world surrounded me every single day. Particularly I focus on the landscapes subject. One of five works ide becoming very spontaneous but usually after the pre-painting or drawing I determine the aim. At the beginning, I always determine and describe the color pallet which I’d like to use in my work. I like using one dominating color which makes the painting more attractive accentuating the main subject. My works consist the subject of some history I invented. During these all years I've possessed a lot of ideas and conceptions. Those ideas which I haven't used yet will be a great part of my masterpieces in near future. At the moment, the inspiration is everywhere. Therefore I can make painting with reference to every subject, but my attitude is various, so my painting world I live in, would be changed definitely providing me more constructive ideas.\"", "text": "Cover Art\nAeropolis\n\"My name is Tomasz Maronski. I'm 29. I paint on the canvas for almost 10 years, and during this time I always improve my work expression and techniques, searching for the right, unique ways of expressing either my personality or ideas, fantasy visions hidden inside of my heart. My lasting adventure with computer graphics has started as soon as I possessed the oil painting skills, but unfortunately I didn't have time for that, so I decided to work with computer instead of Pictor.\nMy paintings concern merely the fantasy themes getting inspirations from world surrounded me every single day. Particularly I focus on the landscapes subject. One of five works ide becoming very spontaneous but usually after the pre-painting or drawing I determine the aim. At the beginning, I always determine and describe the color pallet which I’d like to use in my work. I like using one dominating color which makes the painting more attractive accentuating the main subject. My works consist the subject of some history I invented. During these all years I've possessed a lot of ideas and conceptions. Those ideas which I haven't used yet will be a great part of my masterpieces in near future. At the moment, the inspiration is everywhere. Therefore I can make painting with reference to every subject, but my attitude is various, so my painting world I live in, would be changed definitely providing me more constructive ideas.\"", "source": "https://clarkesworldmagazine.com/artbio_05/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Aeropolis by Tomasz Maronski"}