{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nicoletta Vallorani; Rachel S Cordasco", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "AePuxD9a13omuRsPBzOHysxOPD0=", "id": null, "license": null, "comments": "", "raw_text": "2720 words, short story  The Catalog of Virgins  Sharks.  Shadows of teeth in this darkness.  I should have left immediately, because this delay could prove fatal.  I watched.  Forceps, mallets, an assortment of rusty knives, pairs of sickles in various sizes, a mallet in the shape of a crowbar with a strange pink hilt. At the bottom of it all, even, a wide-open Iron Maiden whose cavernous belly bristles with nails. Men have tools of sorrow and joy that reveal the stuff they’re made of.  I hear a massive rodent rustling at my back, and this seems to be a happy thought in such a place. The mercy of the mouse. Whoever has been locked in here has to need it.  It’s large and clumsy. Perhaps it won’t notice me. Flattened against the wall, black in the darkness, barely breathing. The guard watches the room, smoothing down his uniform. He’s proud of himself. It doesn’t see me. It turns. It’s about to escape.  The ramp’s nearby, a moment too soon to pass unnoticed. He senses the giant, that there’s someone, but he doesn’t come to grab me. Too big to be agile, and perhaps quite accustomed to this obscurity.  Nigredo in the dark, though, is lost.  So I’m out, across the porch, down to the back. But the narrow stairs are deceptive. And I am old. I don’t understand that I’ve fallen until I’m in mid-air. I don’t understand that I’ve hurt myself until I feel the blow to my jaw and the dry snap of my ankle.  And nobody follows me.  Nobody.  I think.  I slip into the alleys, out from under Bluebeard.  I am Leyla.  I was born in the northern quadrant of the Albin Islands. I am a daughter of a glacial oil well. I was recruited at thirteen, by a head-hunter. I trained in the Walled City, along with the other girls destined for Business. I remember a lot of dust, small rooms without light, and little food. I remember some other girl, but not much. I remember, too, some of the instructors who followed our progress. I don’t remember their faces, but the other parts of their bodies.  The instructors concerned themselves with the preliminary training, and when it was necessary, the Rite. I have never been raped.  A virgin. This they wanted.  I was good, smart, even very beautiful. I passed through the wall on December 28. I was a precious gift for the new year, a package of life for a very important person.  My time was 300 hours.  A city of bricks and walls. Chased down alleys with bated breath. Where is my track of dried breadcrumbs? Where did I lose the map of this place? Then again, was there really ever a map?  Where to go. Find Yuri. Tell him about my escapade in the dungeon.  I walk on ice, along the wall. The taste of blood dissolves in my mouth. I drag one leg, slipping on the compact slab covering the ground in the alleyway.  The slashed veins of the city, to each closed metro station, become visible, appearing to have been cut quickly into the walls. Porto di Mare had been transformed into a camp. In the square, shacks lean against one another, as if revealing indecision. If we nudged one, I think with amusement, they’d all fall, like an unstoppable row of dominoes.  I keep walking, skimming the wall, restless at the thought of ghosts that are following me. Infiltrating my thoughts, trying to make sense of what happened.  The Prophet. The monosyllabic interview, in the language of politics. The inability to extract information about the girls who were found dead, in piles, all alike. The impassive courtesy of the new guru, with a flourishing business in town, as he dismissed me. The crazy idea of pursuing an assassin.  I arrive at Palazzo dei Leoni, in an area I know well for trying several times, in my youth, to bombard with bombs: cordoned off for years, the square is no one’s property. Then, the rest. The effort to enter. The dungeon. The horror. The escape. What did I discover? What did I really find out? I have to go to Yuri, and I must hurry. He will tend to me and welcome me.  Thirst tears at my throat. It’s out of the question that, in this part of town, I can find something to drink. I peek over a torn curtain. A seated man, just beyond, looks at me as if with recognition, or like I never existed. Misery makes you indifferent. Beyond the pain, there is a limbo that frees you from any emotion.  A chubby little boy bursts out of another shack. Just after, I realize that I can use a crutch. He’s missing a leg, but that poses no problems while he flees with something in his hand, a sticky substance to be chewed. Running away in the chaos. There are many people who live like this.  Sighing, I try to support my foot. The pain explodes from the ankle up to the groin. Sweating, breathing warmly in the frost. Still a little way and I’ll be there. Taking it from the far side, as Yuri says. The fact is that I don’t want to lead whoever’s following me to him.  I slip between the shacks, moving away from the wall.  And in the miserable passageway, I lose my hounds.  My name is Teodora, which means “gift of God.”  I have pale skin and dark eyes, and am singular because I know that I come from the territories of Fire, where no one is pale like me. I don’t remember anything, I don’t think I have any real parents, I don’t think I have a real family, either. They brought me to the Walled City when I was very small. They did not let me grow up before the collective rape. They call it the Rite, but I don’t know why. I never knew. It’s very ugly, the Rite, but they teach us that it’s necessary. Afterwards, we are ready for Business. I have been lucky, I have only had three masters. And my heart was weak. And my body was easy to hurt to death. I didn’t last long, although I remember every minute. I imagined the Ash Factory so many times before they really took me.  There it was Paradise.  My life time, thus, was twenty-five hours.  Inside and I understand that nothing will ever be the same.  The laboratory has only preserved its livid light. The rest is a mass of rubble watched over by a pile of rags and blood.  I bend down, catching my breath, laying a hand on his naked and wounded chest.  There is a small break in Yuri’s voice.  I check his ear, dirty with his blood. His whisper breaks, and then resumes, stable but furtive, fleeing like his life.  “I didn’t see them coming,” he says. “But you, you will do this for me . . . ”  My gaze and that of another, a different me observing my own body, would like to weep at the murder of a friend, but cannot. Thus I stay, Nigredo the stoic, to watch, to try to understand what my friend is expecting to die for.  The laboratory is the ravaged kennel of a wicked master. I almost smile, pulling my lips away from my teeth, thinking that maybe this really is how he would have liked to leave: in his space, where he lived, where he was corrupted, where he lost the purity of his name, where he tried to keep up with time and bandits, where he spent his desire for vengeance, where he was interrogated, tortured, violated, abandoned. Where he saw me for the first time. Where he met me all the other times. Where we built what we are, in time, weaving together an unrelenting give-and-take between his scientific analysis and my desire for revolt.  And now, in his voice, there is a small break, an urgency I cannot stop.  “I did . . . do remember what you wanted . . . ”  I don’t remember having wanted anything. Not this, at least. Again, my gaze comes off the scene I’m living and sees myself, kneeling. The map drawn on the linoleum floor, a track of blood that I steered around, a knee-jerk reaction that no pain will erase.  Our friendship, Yuri, is made of maps. And what we will not forget is still on the skin of an assassin that I loved and then released.  “The map . . . Remember . . . the map of the dungeons.” Breathing still, with studied slowness, trying to fix his glasses. Smudged.  “Remember, I didn’t say anything. Nigredo. Now you have to . . . there’s always them. Listen. Remember the map. You must . . . ”  In the breath that follows, I seem to read a will and a legacy.  “Now you have to do it.” One breath, inexorable fatigue to say all together. A task and a testament.  I feel like it’s becoming lighter.  In the silence that follows, I would cry, I believe.  But perhaps I won’t do it.  My name’s Ginevra, but I don’t know if that’s my real name. They chose it for me when I arrived at the Walled City, and to me, in the end, it doesn’t matter.  Another girl told me a story in which Ginevra was the unfaithful wife of a king, who betrayed him with a knight, up in the Great North. It was a romantic story, though I didn’t like it very much. I think they chose this name because I have always had very pale skin and blond hair and this thin, elf-like body. And I think too that the story of the woman with two lovers has produced for me a name and a destiny. In the Rite, they say I was lucky, because I only had two rapists. But I know it’s not the number that counts. Another girl, during the Rite, for example, managed to hide under other bodies and was able to get away. Against two, one doesn’t run away. I didn’t run away. They sold me almost immediately afterwards. They say I became crazy after the first eight hours.  And yet, my life time was fifty-nine hours. A respectable time.  Now, reason, Nigredo. Think.  Now remember.  Now put things in order and waken the old man.  We had drawn a map, at the time of our last inquiry. We had it on paper, as it used to be, using an old map of Milan that Yuri had kept. Big as an A4 format, rare like a beautiful dream. We wanted to keep track of the murders that would remain unpunished, and we did it on an tourist map from the past, with the certainty that no one would ever be able to discover our secret. A map document: no one would have tried it. Precious things are kept in chips. Instead, there’s no trace of that old trick we did together.  It exists only on the paper. Perishable paper. Hackable paper. Tearable paper. Paper of my dreams and wishes. Like the body of the woman on whom the original path of torture was tattooed.  I look around.  Think.  Reason.  Paper, memory.  Paper, memory, wall.  There.  The outdated anatomical table has always been considered a joke by Yuri. He didn’t use it, it would’ve been idiotic, but he wanted to leave it there, hanging on the wall, a remnant of long ago.  Here: remember.  For fun, and for exorcism, after finishing it, we had hidden our own mapping of homicides, superimposing the places onto the military track of a never-ending war, and to which the body and the soul of the assassin belonged. I search between the plexiglass cover and the frame. And, finally, I find it.  Now, there are two folded sheets of paper.  Two instead of one.  I am Andrea, and they cut my hair short right away because they said that, in certain markets, androgyny pays. “Androgyny”: it’s a difficult word, I shouldn’t use it. They are happier if I don’t speak, but I should never talk, I don’t seem educated in any way. The fact is that where I come from, everyone is educated. Educated and poor. And since I was beautiful, no wonder they sold me. My father had a debt that he couldn’t pay. So he kissed me and gave me away. I remember my story well, and my clients like it so much when I tell it, I can’t tell why. Fucking a cultured person is a bit more enjoyable, I don’t know. So I tell it and tell it and tell it, gaining life with each word I speak. I always did it, since I arrived at the Walled City, though they don’t like the things that I’m saying. That’s why they reserved special treatment for me during the Rite.  I didn’t speak there, or I don’t remember. I didn’t want them to cut off my hair. I didn’t want to look androgynous. I didn’t want it.  And though I didn’t want it, my life time, filled with stories, was one hundred and seventy hours. A triumph.  Separation from Yuri, an abrupt and incomplete action, has exhausted me. The return was long and difficult. It is dark, by now, when I arrive at Prison, which is home. The open and abandoned cells are my entire world and possessions.  The candle struggles to burn, yellowing the sheet. An A4 with jagged edges, dominated by a sketch of a woman. I recognized the symbols that Yuri used for each type of inquiry: cutting weapons, burns, ropes, metallic mallets . . . a rosary of violation that I struggle to break without feeling the nausea rising in my throat.  Around the woman’s profile, names. Stories.  Leyla, Teodora, Ginevra, Andrea . . .  Women.  Five stories.  A single story.  Pandora is the name they gave me when I accepted the contract. They said that from my body they would create my sisters. They’re all the same as me, but also different.  Pandora is the name with which they led me to the Walled City, promised me a life that I had never had, taking advantage of my naïve craving for pleasure, my craving to be loved. Poverty is a bad master for those who have their own body as their only investment capital.  I got the idea that I might be able to use it, this body.  They told me: “You are the mother clone. Our treasure.”  I had never been anyone’s treasure. I was convinced.  They made my sisters, invented a story for each of them, and then, after the Rite, they sent me over the wall. Into the world I had dreamed of. The world of the rich, of enchanted gardens, of castles where I would be queen.  My master was no better or worse than the others. He was careful not to ruin me immediately. I’m not grateful.  When they brought me to the Ash Factory for the last time, I remember thinking of only one thing: how many of my sisters had Bluebeard? How many had been punished for their imaginary disobedience?  My life time lasted five hundred hours, with seven different reconstructions: nearly a record, as far as I know.  I hope that my ashes will disperse in the wind.  Forever and forever and forever.  I extinguish the candle. I’m in the dark, to commemorate my dead.  Think.  Bluebeard killed every one of his wives, and kept the corpses in the bowels of his castle. He would keep them that way forever, avoiding the danger of boredom and the pain of old age, and preserving them intact instead, in the magic of fairy tales, in one sealed room.  Of the women he married, all young and beautiful, all very similar to each other, he acquired body and fidelity, bringing each one of them to his castle to make her a bride and violate her on the wedding night. To each of his wives, Bluebeard gave up full ownership of his castle.  All, my love, everything except for the forbidden room. You will have the key, but you will not need to use it.  Only the last wife used it. She found in the room her twin sisters, with cloned wounds on their bodies. And in their faces, the usual pain.    Originally published in Italian in Wired (Italy), July/August, 2014. Nicoletta Vallorani (b. 1959) is Professor of Contemporary English Literature and Cultural Studies at the University of Milan and a translator (from English). Her first novel, Il cuore finto di DR (Mondadori, 1993, published in French by Rivages) was awarded the Premio Urania 1993, and she is still the only woman who ever won it. Her dystopian novel Eva was published by Einaudi in 2002, and her noir novel Le madri cattive (Salani, 2012) was awarded the Premio Maria Teresa Di Lascia in 2012. She has published novels and short stories, often blending science fiction and crime fiction. She is published in France by Gallimard.  Rachel Cordasco has a PhD in literary studies and currently works as a developmental editor. She also writes reviews for publications like World Literature Today and Strange Horizons and translates Italian speculative fiction. For all things related to speculative fiction in translation, visit her website.", "text": "2720 words, short story\nThe Catalog of Virgins\nSharks.\nShadows of teeth in this darkness.\nI should have left immediately, because this delay could prove fatal.\nI watched.\nForceps, mallets, an assortment of rusty knives, pairs of sickles in various sizes, a mallet in the shape of a crowbar with a strange pink hilt. At the bottom of it all, even, a wide-open Iron Maiden whose cavernous belly bristles with nails. Men have tools of sorrow and joy that reveal the stuff they’re made of.\nI hear a massive rodent rustling at my back, and this seems to be a happy thought in such a place. The mercy of the mouse. Whoever has been locked in here has to need it.\nIt’s large and clumsy. Perhaps it won’t notice me. Flattened against the wall, black in the darkness, barely breathing. The guard watches the room, smoothing down his uniform. He’s proud of himself. It doesn’t see me. It turns. It’s about to escape.\nThe ramp’s nearby, a moment too soon to pass unnoticed. He senses the giant, that there’s someone, but he doesn’t come to grab me. Too big to be agile, and perhaps quite accustomed to this obscurity.\nNigredo in the dark, though, is lost.\nSo I’m out, across the porch, down to the back. But the narrow stairs are deceptive. And I am old. I don’t understand that I’ve fallen until I’m in mid-air. I don’t understand that I’ve hurt myself until I feel the blow to my jaw and the dry snap of my ankle.\nAnd nobody follows me.\nNobody.\nI think.\nI slip into the alleys, out from under Bluebeard.\nI am Leyla.\nI was born in the northern quadrant of the Albin Islands. I am a daughter of a glacial oil well. I was recruited at thirteen, by a head-hunter. I trained in the Walled City, along with the other girls destined for Business. I remember a lot of dust, small rooms without light, and little food. I remember some other girl, but not much. I remember, too, some of the instructors who followed our progress. I don’t remember their faces, but the other parts of their bodies.\nThe instructors concerned themselves with the preliminary training, and when it was necessary, the Rite. I have never been raped.\nA virgin. This they wanted.\nI was good, smart, even very beautiful. I passed through the wall on December 28. I was a precious gift for the new year, a package of life for a very important person.\nMy time was 300 hours.\nA city of bricks and walls. Chased down alleys with bated breath. Where is my track of dried breadcrumbs? Where did I lose the map of this place? Then again, was there really ever a map?\nWhere to go. Find Yuri. Tell him about my escapade in the dungeon.\nI walk on ice, along the wall. The taste of blood dissolves in my mouth. I drag one leg, slipping on the compact slab covering the ground in the alleyway.\nThe slashed veins of the city, to each closed metro station, become visible, appearing to have been cut quickly into the walls. Porto di Mare had been transformed into a camp. In the square, shacks lean against one another, as if revealing indecision. If we nudged one, I think with amusement, they’d all fall, like an unstoppable row of dominoes.\nI keep walking, skimming the wall, restless at the thought of ghosts that are following me. Infiltrating my thoughts, trying to make sense of what happened.\nThe Prophet. The monosyllabic interview, in the language of politics. The inability to extract information about the girls who were found dead, in piles, all alike. The impassive courtesy of the new guru, with a flourishing business in town, as he dismissed me. The crazy idea of pursuing an assassin.\nI arrive at Palazzo dei Leoni, in an area I know well for trying several times, in my youth, to bombard with bombs: cordoned off for years, the square is no one’s property. Then, the rest. The effort to enter. The dungeon. The horror. The escape. What did I discover? What did I really find out? I have to go to Yuri, and I must hurry. He will tend to me and welcome me.\nThirst tears at my throat. It’s out of the question that, in this part of town, I can find something to drink. I peek over a torn curtain. A seated man, just beyond, looks at me as if with recognition, or like I never existed. Misery makes you indifferent. Beyond the pain, there is a limbo that frees you from any emotion.\nA chubby little boy bursts out of another shack. Just after, I realize that I can use a crutch. He’s missing a leg, but that poses no problems while he flees with something in his hand, a sticky substance to be chewed. Running away in the chaos. There are many people who live like this.\nSighing, I try to support my foot. The pain explodes from the ankle up to the groin. Sweating, breathing warmly in the frost. Still a little way and I’ll be there. Taking it from the far side, as Yuri says. The fact is that I don’t want to lead whoever’s following me to him.\nI slip between the shacks, moving away from the wall.\nAnd in the miserable passageway, I lose my hounds.\nMy name is Teodora, which means “gift of God.”\nI have pale skin and dark eyes, and am singular because I know that I come from the territories of Fire, where no one is pale like me. I don’t remember anything, I don’t think I have any real parents, I don’t think I have a real family, either. They brought me to the Walled City when I was very small. They did not let me grow up before the collective rape. They call it the Rite, but I don’t know why. I never knew. It’s very ugly, the Rite, but they teach us that it’s necessary. Afterwards, we are ready for Business. I have been lucky, I have only had three masters. And my heart was weak. And my body was easy to hurt to death. I didn’t last long, although I remember every minute. I imagined the Ash Factory so many times before they really took me.\nThere it was Paradise.\nMy life time, thus, was twenty-five hours.\nInside and I understand that nothing will ever be the same.\nThe laboratory has only preserved its livid light. The rest is a mass of rubble watched over by a pile of rags and blood.\nI bend down, catching my breath, laying a hand on his naked and wounded chest.\nThere is a small break in Yuri’s voice.\nI check his ear, dirty with his blood. His whisper breaks, and then resumes, stable but furtive, fleeing like his life.\n“I didn’t see them coming,” he says. “But you, you will do this for me . . . ”\nMy gaze and that of another, a different me observing my own body, would like to weep at the murder of a friend, but cannot. Thus I stay, Nigredo the stoic, to watch, to try to understand what my friend is expecting to die for.\nThe laboratory is the ravaged kennel of a wicked master. I almost smile, pulling my lips away from my teeth, thinking that maybe this really is how he would have liked to leave: in his space, where he lived, where he was corrupted, where he lost the purity of his name, where he tried to keep up with time and bandits, where he spent his desire for vengeance, where he was interrogated, tortured, violated, abandoned. Where he saw me for the first time. Where he met me all the other times. Where we built what we are, in time, weaving together an unrelenting give-and-take between his scientific analysis and my desire for revolt.\nAnd now, in his voice, there is a small break, an urgency I cannot stop.\n“I did . . . do remember what you wanted . . . ”\nI don’t remember having wanted anything. Not this, at least. Again, my gaze comes off the scene I’m living and sees myself, kneeling. The map drawn on the linoleum floor, a track of blood that I steered around, a knee-jerk reaction that no pain will erase.\nOur friendship, Yuri, is made of maps. And what we will not forget is still on the skin of an assassin that I loved and then released.\n“The map . . . Remember . . . the map of the dungeons.” Breathing still, with studied slowness, trying to fix his glasses. Smudged.\n“Remember, I didn’t say anything. Nigredo. Now you have to . . . there’s always them. Listen. Remember the map. You must . . . ”\nIn the breath that follows, I seem to read a will and a legacy.\n“Now you have to do it.” One breath, inexorable fatigue to say all together. A task and a testament.\nI feel like it’s becoming lighter.\nIn the silence that follows, I would cry, I believe.\nBut perhaps I won’t do it.\nMy name’s Ginevra, but I don’t know if that’s my real name. They chose it for me when I arrived at the Walled City, and to me, in the end, it doesn’t matter.\nAnother girl told me a story in which Ginevra was the unfaithful wife of a king, who betrayed him with a knight, up in the Great North. It was a romantic story, though I didn’t like it very much. I think they chose this name because I have always had very pale skin and blond hair and this thin, elf-like body. And I think too that the story of the woman with two lovers has produced for me a name and a destiny. In the Rite, they say I was lucky, because I only had two rapists. But I know it’s not the number that counts. Another girl, during the Rite, for example, managed to hide under other bodies and was able to get away. Against two, one doesn’t run away. I didn’t run away. They sold me almost immediately afterwards. They say I became crazy after the first eight hours.\nAnd yet, my life time was fifty-nine hours. A respectable time.\nNow, reason, Nigredo. Think.\nNow remember.\nNow put things in order and waken the old man.\nWe had drawn a map, at the time of our last inquiry. We had it on paper, as it used to be, using an old map of Milan that Yuri had kept. Big as an A4 format, rare like a beautiful dream. We wanted to keep track of the murders that would remain unpunished, and we did it on an tourist map from the past, with the certainty that no one would ever be able to discover our secret. A map document: no one would have tried it. Precious things are kept in chips. Instead, there’s no trace of that old trick we did together.\nIt exists only on the paper. Perishable paper. Hackable paper. Tearable paper. Paper of my dreams and wishes. Like the body of the woman on whom the original path of torture was tattooed.\nI look around.\nThink.\nReason.\nPaper, memory.\nPaper, memory, wall.\nThere.\nThe outdated anatomical table has always been considered a joke by Yuri. He didn’t use it, it would’ve been idiotic, but he wanted to leave it there, hanging on the wall, a remnant of long ago.\nHere: remember.\nFor fun, and for exorcism, after finishing it, we had hidden our own mapping of homicides, superimposing the places onto the military track of a never-ending war, and to which the body and the soul of the assassin belonged. I search between the plexiglass cover and the frame. And, finally, I find it.\nNow, there are two folded sheets of paper.\nTwo instead of one.\nI am Andrea, and they cut my hair short right away because they said that, in certain markets, androgyny pays. “Androgyny”: it’s a difficult word, I shouldn’t use it. They are happier if I don’t speak, but I should never talk, I don’t seem educated in any way. The fact is that where I come from, everyone is educated. Educated and poor. And since I was beautiful, no wonder they sold me. My father had a debt that he couldn’t pay. So he kissed me and gave me away. I remember my story well, and my clients like it so much when I tell it, I can’t tell why. Fucking a cultured person is a bit more enjoyable, I don’t know. So I tell it and tell it and tell it, gaining life with each word I speak. I always did it, since I arrived at the Walled City, though they don’t like the things that I’m saying. That’s why they reserved special treatment for me during the Rite.\nI didn’t speak there, or I don’t remember. I didn’t want them to cut off my hair. I didn’t want to look androgynous. I didn’t want it.\nAnd though I didn’t want it, my life time, filled with stories, was one hundred and seventy hours. A triumph.\nSeparation from Yuri, an abrupt and incomplete action, has exhausted me. The return was long and difficult. It is dark, by now, when I arrive at Prison, which is home. The open and abandoned cells are my entire world and possessions.\nThe candle struggles to burn, yellowing the sheet. An A4 with jagged edges, dominated by a sketch of a woman. I recognized the symbols that Yuri used for each type of inquiry: cutting weapons, burns, ropes, metallic mallets . . . a rosary of violation that I struggle to break without feeling the nausea rising in my throat.\nAround the woman’s profile, names. Stories.\nLeyla, Teodora, Ginevra, Andrea . . .\nWomen.\nFive stories.\nA single story.\nPandora is the name they gave me when I accepted the contract. They said that from my body they would create my sisters. They’re all the same as me, but also different.\nPandora is the name with which they led me to the Walled City, promised me a life that I had never had, taking advantage of my naïve craving for pleasure, my craving to be loved. Poverty is a bad master for those who have their own body as their only investment capital.\nI got the idea that I might be able to use it, this body.\nThey told me: “You are the mother clone. Our treasure.”\nI had never been anyone’s treasure. I was convinced.\nThey made my sisters, invented a story for each of them, and then, after the Rite, they sent me over the wall. Into the world I had dreamed of. The world of the rich, of enchanted gardens, of castles where I would be queen.\nMy master was no better or worse than the others. He was careful not to ruin me immediately. I’m not grateful.\nWhen they brought me to the Ash Factory for the last time, I remember thinking of only one thing: how many of my sisters had Bluebeard? How many had been punished for their imaginary disobedience?\nMy life time lasted five hundred hours, with seven different reconstructions: nearly a record, as far as I know.\nI hope that my ashes will disperse in the wind.\nForever and forever and forever.\nI extinguish the candle. I’m in the dark, to commemorate my dead.\nThink.\nBluebeard killed every one of his wives, and kept the corpses in the bowels of his castle. He would keep them that way forever, avoiding the danger of boredom and the pain of old age, and preserving them intact instead, in the magic of fairy tales, in one sealed room.\nOf the women he married, all young and beautiful, all very similar to each other, he acquired body and fidelity, bringing each one of them to his castle to make her a bride and violate her on the wedding night. To each of his wives, Bluebeard gave up full ownership of his castle.\nAll, my love, everything except for the forbidden room. You will have the key, but you will not need to use it.\nOnly the last wife used it. She found in the room her twin sisters, with cloned wounds on their bodies. And in their faces, the usual pain.\nOriginally published in Italian in Wired (Italy), July/August, 2014.\nNicoletta Vallorani (b. 1959) is Professor of Contemporary English Literature and Cultural Studies at the University of Milan and a translator (from English). Her first novel, Il cuore finto di DR (Mondadori, 1993, published in French by Rivages) was awarded the Premio Urania 1993, and she is still the only woman who ever won it. Her dystopian novel Eva was published by Einaudi in 2002, and her noir novel Le madri cattive (Salani, 2012) was awarded the Premio Maria Teresa Di Lascia in 2012. She has published novels and short stories, often blending science fiction and crime fiction. She is published in France by Gallimard.\nRachel Cordasco has a PhD in literary studies and currently works as a developmental editor. She also writes reviews for publications like World Literature Today and Strange Horizons and translates Italian speculative fiction. For all things related to speculative fiction in translation, visit her website.", "source": "https://clarkesworldmagazine.com/vallorani_11_17/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Catalog of Virgins by Nicoletta Vallorani, translated by Rachel S. Cordasco"}