{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "D A Xiaolin Spires", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "j8erEkpnWWTI1xMprIg9OS0A43s=", "id": null, "license": null, "comments": "", "raw_text": "3180 words, short story  Mamaborg's Milk and the Brilliance of Gems  Luqiong jumps past the fence and she ducks under one of the ferrying carts of the communications warehouse. She taps on the pylo plating of the cart, making sure it’s thick enough. Her database analyzes the sound of the tap and accepts that it is. She sighs a relief. The drones following her can’t track her through the thick pylo plating of the cart. Newer carts, made cheaper, are more penetrative to their gaze, but she laughs to herself—this is one of the old ones.  Outside the cart, the maze of machines before her move cases of the stock, exocoke, the thirst-quenching fizz that supposedly enhances exoskeleton performance. Just her luck that today is soda day. She throws down the blocker blanket over the package in her arms. Her heart races as she reaches out to grab a case. She hears the click-click of the signal of the robot arm assessing an anomaly in the protocol. She swipes the case and pats her chest, which unleashes the UV jamming signals emanating from her arms. The robot arm stops clicking and resumes its transport of the cases.  She opens up a bottle and wishes they were baby formula instead. She takes a gulp, grimaces at the bitter taste, and chugs it down. She tucks the bottle and the pack into the reinforced shelf on her exoskel, which then recedes to pull it close and self-seal. The bumps rattle her, and she pulls down the blocker blanket to check on her loveliest prize yet: the bundle wrapped in her arms. She looks down into the strange violet eyes and the small tuft of black hair. Her babe. She could never get over that. Her babe. 愛瑾. Aijin. “Love” and “the brilliance of gems”—her eyes, so amethyst-like. But it was a coincidence that her babe developed such a gemlike gaze, suited to her name. Luqiong was too weak after pregnancy to think of a name and just used her sister’s name. It was, after all, a bit like her own, 璐琼, lu qiong, a composition of characters that signify forms of beautiful jade. Both her and her babe with names of strength and allure. Strong as rocks and glistening with exceptional luster.  For a week after birth, her babe wouldn’t open her eyes, so Luqiong couldn’t tell if her babe really had brilliant eyes or not to match her given Aijin name. She couldn’t worry, there was no point. Survival: get her into shape and then see what’s next. But when Aijin did finally peel her eyes open, after Luqiong managed to nourish the child and get her to a healthy weight, she felt that love, so overwhelming, so catching her off guard, so devastating, so . . . embedded in her babe’s name. Aijin. She holds her close now, smelling her baby smell, as her teeth rattle, as her whole body trembles, as the machines direct the cart through uneven pavement. Luqiong jumps off, shields her child, throws out a jamming signal from her wrist for good measure, glides past familiar surroundings, behind broken pieces of furniture, past postindustrial waste, through a few dilapidated houses, and climbs with dexterous fingers up a fence and beyond.  Her ears detect no buzz of drones as she waits until it darkens. Aijin sits quietly with her, her eyes closed, her body warm against her waist. As soon as the moon peeps out in the sky, she makes her way through the scrap jungle to her home.  The moon’s light grows piercing, almost too quickly. It illuminates her way, and she makes herself as small as she can, changing her exoskel to a dark camo. The spectral light casts dark shadows that would make the abandoned warehouse she’s approaching look menacing to anyone but Luqiong. To Luqiong, it’s home, or more like a strong house. Home, whatever that means, is protection, not comfort—yet she can’t help but admit a feeling of relief as she skips across shards on the ground and deploys her nimble fingers across an entry pad to deactivate the jerry-rigged alarm system.  She’s careful not to trip over the sinews of this alarm system she put together years ago and pushes against the trigger to drop the locks of the hidden door. She slides in and shuts the door behind her. Her exoskel shifts back to its typical metallic splendor to save energy. Luqiong lowers Aijin into a makeshift changing table made of a stolen warehouse cart, some medical blankets, and padding she had hijacked from a hospital delivery truck. Aijin is as quiet as a spycopter, not making even a peep. She has always been so good like that. Maybe she senses the danger or is used to the lack of conversation. But now that they’re back in the strong house, Luqiong tickles her feet, hoping to get a small squeal out of her. Aijin’s feet are plump and smooth. Luqiong feels a surge of pride for that—plump with tiny wrinkles on their backsides, like a normal little babe. But she knows inside, that it’s not enough. Aijin’s not getting enough of what she needs. She knows it from the somatic readings she’s hustled for, and from her own motherly instincts. And neither is Luqiong.  Aijin looks unfazed at the touch, her violet eyes wide, and Luqiong insists, needing just a small smile, anything to brighten up the bleakness of the landscape that surrounds her. When Luqiong reaches the little knobby mound of Aijin’s knee, drawing out claws and using the tips of her exoskel nails instead, Aijin gives in with a playful curling up of a lip and what could be mistaken as a coo. That’s good enough for Luqiong. She retracts her exoskel nails, changes her, notes the shortage of diapers, and curses to herself. She rocks Aijin until she hears that heavy breathing that signifies her entry into dreamland and drops her into the foam-reinforced crate that serves as her crib. Her arms feel empty without Aijin in them, but she also wastes no time in getting all she needs to get done. With deft fingers, she pulls out the jade hairpin device that lets down a cascade of black hair over her exoskel torso and goes to pump. A mom’s job is never over.  It’s never fun to pump, she thinks, as she settles into a memory-kev seat that molds into her exoskel. She lifts her back out for a moment and thinks a command that opens up the latch unveiling the compartment inside. With the hand not holding the hairpin, she pulls out the pack of exocokes, shimmies back into place, and slams the exoskel compartment closed, leaning back. She places the pack of exocokes beside her.  She breathes out a few relaxing breaths that puff up from her abdomen and sits back up, listening carefully. It’s nice and dark and Aijin is not making a sound. Good, she’s still asleep. Aijin doesn’t cry and scream typically, but sometimes she will coo softly to herself.  Luqiong flicks on a few diodes and a small stream of light shines on her pin. Its jade facade shimmers, cobbled together with some alloys, glass, and a small vial. Luqiong braces herself for impact, grimaces, and punctures. For Luqiong pumping means more than putting a suction cup on the chest. It means getting through the tough exoskel with a needle, rupturing the inner layer, and letting the legs pull out from the pin, pinch her sunken breasts, and draw what little there is to draw. She enhances her natural formula with some synthesizers, which expands the volume, upgrades the nutritional value, and augments the innate sweetness. She knows it will taste not just of mother’s milk but have a tinge of acidic, almost like citrus. She knows this because she’s tasted it. From there, she adds powders for easier suckling.  She lets the pump do its thing, wincing every so often as it does a slow draw. She sees the pull as the vial fills up with one tiny drop at a time. Leaning back again, eyes closed, she feels for the exocoke. The bottle is made of supe-glass, cold in her hands, but gives a bit so it doesn’t shatter when dropped. She squeezes it tight as the little legs of her jade hairpin push against where she’s most sensitive, and a shiver runs down her spine as she feels the liquid being extracted.  She pops the top of the exocoke and takes a swig. She needs to ration them, but she’s already onto her next swig before she sets it aside. The exocoke does as it advertises, eases the ache of the exoskel attached to her and sends in a bit of a numbing coolness so that the prickly grip of the hairpin no longer feels so intense.  She opens her eyes and flicks at her hairpin. The jade ornamental curls release a soft ring. She holds it up to see that the bit of extract is consistent. The meager amount of liquid sloshes about. The elixir of life, she breathes, shaking her head. A small line of blood, hair-thin and no more than a fingernail long, trails in the otherwise cream-colored solution. Fine, not unusual with the pinprick and all. She listens again for Aijin and closes her eyes again, her thoughts wandering to practical matters: food, diapers, and her way out of this bedraggled life.  Before she knows it, she’s slumped back, her chest throbbing, head rolled to the side, and falling into a sleep, with the jade hairpin still attached, making a slight whirring sound at each drop collected.  One day, she thinks, she’ll feed her baby better. No hairpins, no synthetic additives, no puckering powders.  She dreams of the smell of synthesizers giving way to incense, and exoskel grease giving way to jasmine blossoms. In her dream, her mom is short and petite, more petite than she ever was.  She’s scrounging about the dorm she shares with her mother and the two other families, all female members. It’s a one inch bead her mom is looking for that Luqiong was playing with, rolling it about, pretending it’s a self-driving motorcycle. But now it’s missing, and her mom can’t finish the necklace she was making.  “If you’re not going to be helpful, then at least don’t cause me trouble,” her mom says, eyebrows scrunched in gentle fury. Her mom shakes her head and Luqiong can smell the scent of the jasmine detangler spray her mom uses wafting toward her.  She doesn’t want to disappoint her mother, but everything disappoints. Ever since she got a sister, little Aijin, the one Luqiong named her baby after, everything disappoints. The fingers on her mom’s hand giving out from arthritis when she’s crafting makeshift jewelry to sell disappoints. Luqiong’s daily surreptitious collection of odds and ends from the machinery room to use as materials for the jewelry disappoints. They’re not shiny enough or they’re not sanded down enough. There’s never enough, not enough food, not enough formula. Her mom sacrifices herself to buy formula, since her milk has been inconsistent in the detention center. It’s the stress, she says. It’s the stress to keep you alive, to keep baby Aijin alive. Never enough formula, never enough milk.  In the dream, Luqiong suffers hunger pains. She eats her rations, but it’s not enough. She can’t find the bead, but she finds the hairpin, the jade one engraved with jasmine flowers her mom treasures. It’s put into the bin for the auto-grinder, to be trashed. She grabs it, but her sleeve gets stuck close enough to the grinding machine. It starts now, and her heart jumps. Her stomach turns as she’s pulled closer to the chomping maw. In her dream, she’s on the conveyor belt, screaming, but no one hears her, no one sees the shine of jade grasped in her fingers.  When she wakes, her fists are clenched. The diodes’ light is weak and starting to flicker. She turns them off. There’s a repeated dull noise, and she realizes it’s her jade hairpin device beeping, telling her that the vial is full. She pulls out the pin and moans. She forgot to release the legs of the hairpin from her chest. They pinch and grab, like the legs of little recorder spiderbots. She hits the release, but fumbles with her exonails half-retracted and ejects the contents of the vial onto her exoskel. She curses, trying to guide the stream of milk back into the vial.  She salvages as much as she can, then puts the vial, still attached to the pin, aside. It gleams against the sliver of moonlight coming in from an exposed bit of window. It has always reminded her of another jade pin, the one her mother had in her hair. The only relic from her father that her mother hid to keep away from the collectors at the detention center. The one that her mother traded years ago for some extra formula for her dying little baby sister, Aijin.  It was all in vain. Aijin, so small and vulnerable. Aijin so frail and thin. Aijin passed away. Even the money from the jewelry her mother cobbled together from machinery odds and ends dried up as her mother started losing hope and her arthritic hands bested her. She made all kinds of jewelry, but never hairpins. And then she stopped making them altogether.  That was when Luqiong decided to leave on her own. She couldn’t get it together for her mom, she couldn’t convince her mom to leave. So she left. Escaped on one of the intake days, an undertaking that she planned for years. There was no Aijin to be a part of this plan either.  And when it became Luqiong’s turn for her own surprising birth that was never meant to be, she named her Aijin and had asked for no wedding ring, no gifts. Just a straight up hairpin breast pump for her exoskel. They were hard to get, expensive and rare. And it was all hush-hush. Signalers can’t get pregnant, the effects of the UV and their exoskel attachments render them what they call “inert.” But Luqiong found herself being the impossible, doing the impossible, cutting through her torso exoskel to relieve her expanding belly, giving an excruciating birth, running from her job, from being a signaler and electrical engineer, running away again, not from the detention center of the old days gone, but from the combat commissioners that had trained her, with nothing but a state-of-the-art cutting edge hairpin breast pump made from only the most exquisite of jades and alloys and a week’s worth of portafood.  She hustled, begged, cajoled, worked street-smart, got fake IDs, did everything she could to make herself useful in all sorts of underground and black-market ways. But now, she wanted that life over. She wanted a new life, one where she could really feel, physically hold her lifeblood close, and give her baby and her a fresh start.  She gets up and handles the set of test tubes, all sterilized thanks to the bathing sterilizer unit. Everything she owns she owes to her instincts, distracted others, trained skills, and the agility and speed of her pylo exoskel. She starts the distillation, and the tubes wash with a blue liquid. She opens the hairpin vial and pours the contents in, mixing powders and other liquids. As it bubbles, thickening now in the addition process for enhancing the milk, she hears a small coo.  Luqiong walks to the baby crate, checks on her little pride, the package that was never meant to be. She holds Aijin close saying, “Soon, honey, soon. Soon, I will hold you to my skin and I will stare at you as you drink from me.”  It might be a stupid wish, a small wish, but that’s all Luqiong wants. For her own Aijin to be healthy. To not pass away. To not have to drink the substandard concoction she makes from the little she produces and thickens up for the meal. She wants to remove the exoskel in total, rebuild her own body, hold Aijin close to her, and have that skin contact as she nurses her child.  She curses.  She just wants to flippin’ nurse her child, like any other mom.  She picks up the hairpin and raises it in the air. She pulls her elbow back like she’s about to hurl it. She can envision it hitting the wall and shattering, beeping and shrieking as it malfunctions. Her arm trembles. She puts it down. No, she can’t make it shatter, she can’t just destroy this nipple-pricking pump. This extravagant top-of-the-line persecuting device. She needs it. They need it.  For now.  Only for a while longer, she tells herself. We’re leaving. We’re finding the skelcutter. She’s got hints, road maps she’s drawn from stories and hidden away, and some help.  Her hand trembles as she swirls her hair in a bun and affixes it with her jade hairpin. It’s cold to the touch.  Aijin, you and me, she whispers. Tomorrow, we will set off.  And one day, you will feel my skin, under the shell. I will feel you and you will feel me. And you will drink from me like I’m a wishing fountain, making you strong, healthy with all your aspirations coming true.  Luqiong picks up her daughter, holds her to her abdomen, to the exposed part she cut out of her exoskel that has left her scarred and damaged. It’s infected, that part of the exoskel, a virus running up its frayed, tenacious pylo fibers. Aijin coos, her eyes so brilliant and gemlike. She must feel the exposed skin of her mom’s abdomen because she tries to suck on the exoskel that encases her chest. Luqiong locks her elbows holding Aijin’s pursed lips away.  Luqiong blinks her eyes, casts her face toward the rising sun, and straightens her lips. The hairpin pokes into her scalp, itching her. She covers her baby with the shielding blanket and shoots out a UV message, practicing the delivery of that message for when she meets the smuggler when they will cross east to the place where underground skelcutters and other fugitive traders are purported to exist. Where they must exist.  She makes herself strong, to not cry, as she grabs a premade bottle of her concocted milk. She tips it toward her babe, thinking of Aijin the first, her still body, the smell of jasmine, and the cold touch of jade flowers on a fancy hairpin of long ago. And the smooth feel of her mother’s skin long before that when they hugged, or when she consoled her mom, stroking her arm. The sound of the nutritive elements percolating into the solution fills the room. Aijin sucks and swallows, sucks and swallows, her little cheeks puffing in and out. And even though Luqiong’s just holding up a bottle, for a moment she feels a pang in her chest. And she doesn’t know if it’s her heart or her breast, aching under the stiff, unforgiving armor. D.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation.", "text": "3180 words, short story\nMamaborg's Milk and the Brilliance of Gems\nLuqiong jumps past the fence and she ducks under one of the ferrying carts of the communications warehouse. She taps on the pylo plating of the cart, making sure it’s thick enough. Her database analyzes the sound of the tap and accepts that it is. She sighs a relief. The drones following her can’t track her through the thick pylo plating of the cart. Newer carts, made cheaper, are more penetrative to their gaze, but she laughs to herself—this is one of the old ones.\nOutside the cart, the maze of machines before her move cases of the stock, exocoke, the thirst-quenching fizz that supposedly enhances exoskeleton performance. Just her luck that today is soda day. She throws down the blocker blanket over the package in her arms. Her heart races as she reaches out to grab a case. She hears the click-click of the signal of the robot arm assessing an anomaly in the protocol. She swipes the case and pats her chest, which unleashes the UV jamming signals emanating from her arms. The robot arm stops clicking and resumes its transport of the cases.\nShe opens up a bottle and wishes they were baby formula instead. She takes a gulp, grimaces at the bitter taste, and chugs it down. She tucks the bottle and the pack into the reinforced shelf on her exoskel, which then recedes to pull it close and self-seal. The bumps rattle her, and she pulls down the blocker blanket to check on her loveliest prize yet: the bundle wrapped in her arms. She looks down into the strange violet eyes and the small tuft of black hair. Her babe. She could never get over that. Her babe. 愛瑾. Aijin. “Love” and “the brilliance of gems”—her eyes, so amethyst-like. But it was a coincidence that her babe developed such a gemlike gaze, suited to her name. Luqiong was too weak after pregnancy to think of a name and just used her sister’s name. It was, after all, a bit like her own, 璐琼, lu qiong, a composition of characters that signify forms of beautiful jade. Both her and her babe with names of strength and allure. Strong as rocks and glistening with exceptional luster.\nFor a week after birth, her babe wouldn’t open her eyes, so Luqiong couldn’t tell if her babe really had brilliant eyes or not to match her given Aijin name. She couldn’t worry, there was no point. Survival: get her into shape and then see what’s next. But when Aijin did finally peel her eyes open, after Luqiong managed to nourish the child and get her to a healthy weight, she felt that love, so overwhelming, so catching her off guard, so devastating, so . . . embedded in her babe’s name. Aijin. She holds her close now, smelling her baby smell, as her teeth rattle, as her whole body trembles, as the machines direct the cart through uneven pavement. Luqiong jumps off, shields her child, throws out a jamming signal from her wrist for good measure, glides past familiar surroundings, behind broken pieces of furniture, past postindustrial waste, through a few dilapidated houses, and climbs with dexterous fingers up a fence and beyond.\nHer ears detect no buzz of drones as she waits until it darkens. Aijin sits quietly with her, her eyes closed, her body warm against her waist. As soon as the moon peeps out in the sky, she makes her way through the scrap jungle to her home.\nThe moon’s light grows piercing, almost too quickly. It illuminates her way, and she makes herself as small as she can, changing her exoskel to a dark camo. The spectral light casts dark shadows that would make the abandoned warehouse she’s approaching look menacing to anyone but Luqiong. To Luqiong, it’s home, or more like a strong house. Home, whatever that means, is protection, not comfort—yet she can’t help but admit a feeling of relief as she skips across shards on the ground and deploys her nimble fingers across an entry pad to deactivate the jerry-rigged alarm system.\nShe’s careful not to trip over the sinews of this alarm system she put together years ago and pushes against the trigger to drop the locks of the hidden door. She slides in and shuts the door behind her. Her exoskel shifts back to its typical metallic splendor to save energy. Luqiong lowers Aijin into a makeshift changing table made of a stolen warehouse cart, some medical blankets, and padding she had hijacked from a hospital delivery truck. Aijin is as quiet as a spycopter, not making even a peep. She has always been so good like that. Maybe she senses the danger or is used to the lack of conversation. But now that they’re back in the strong house, Luqiong tickles her feet, hoping to get a small squeal out of her. Aijin’s feet are plump and smooth. Luqiong feels a surge of pride for that—plump with tiny wrinkles on their backsides, like a normal little babe. But she knows inside, that it’s not enough. Aijin’s not getting enough of what she needs. She knows it from the somatic readings she’s hustled for, and from her own motherly instincts. And neither is Luqiong.\nAijin looks unfazed at the touch, her violet eyes wide, and Luqiong insists, needing just a small smile, anything to brighten up the bleakness of the landscape that surrounds her. When Luqiong reaches the little knobby mound of Aijin’s knee, drawing out claws and using the tips of her exoskel nails instead, Aijin gives in with a playful curling up of a lip and what could be mistaken as a coo. That’s good enough for Luqiong. She retracts her exoskel nails, changes her, notes the shortage of diapers, and curses to herself. She rocks Aijin until she hears that heavy breathing that signifies her entry into dreamland and drops her into the foam-reinforced crate that serves as her crib. Her arms feel empty without Aijin in them, but she also wastes no time in getting all she needs to get done. With deft fingers, she pulls out the jade hairpin device that lets down a cascade of black hair over her exoskel torso and goes to pump. A mom’s job is never over.\nIt’s never fun to pump, she thinks, as she settles into a memory-kev seat that molds into her exoskel. She lifts her back out for a moment and thinks a command that opens up the latch unveiling the compartment inside. With the hand not holding the hairpin, she pulls out the pack of exocokes, shimmies back into place, and slams the exoskel compartment closed, leaning back. She places the pack of exocokes beside her.\nShe breathes out a few relaxing breaths that puff up from her abdomen and sits back up, listening carefully. It’s nice and dark and Aijin is not making a sound. Good, she’s still asleep. Aijin doesn’t cry and scream typically, but sometimes she will coo softly to herself.\nLuqiong flicks on a few diodes and a small stream of light shines on her pin. Its jade facade shimmers, cobbled together with some alloys, glass, and a small vial. Luqiong braces herself for impact, grimaces, and punctures. For Luqiong pumping means more than putting a suction cup on the chest. It means getting through the tough exoskel with a needle, rupturing the inner layer, and letting the legs pull out from the pin, pinch her sunken breasts, and draw what little there is to draw. She enhances her natural formula with some synthesizers, which expands the volume, upgrades the nutritional value, and augments the innate sweetness. She knows it will taste not just of mother’s milk but have a tinge of acidic, almost like citrus. She knows this because she’s tasted it. From there, she adds powders for easier suckling.\nShe lets the pump do its thing, wincing every so often as it does a slow draw. She sees the pull as the vial fills up with one tiny drop at a time. Leaning back again, eyes closed, she feels for the exocoke. The bottle is made of supe-glass, cold in her hands, but gives a bit so it doesn’t shatter when dropped. She squeezes it tight as the little legs of her jade hairpin push against where she’s most sensitive, and a shiver runs down her spine as she feels the liquid being extracted.\nShe pops the top of the exocoke and takes a swig. She needs to ration them, but she’s already onto her next swig before she sets it aside. The exocoke does as it advertises, eases the ache of the exoskel attached to her and sends in a bit of a numbing coolness so that the prickly grip of the hairpin no longer feels so intense.\nShe opens her eyes and flicks at her hairpin. The jade ornamental curls release a soft ring. She holds it up to see that the bit of extract is consistent. The meager amount of liquid sloshes about. The elixir of life, she breathes, shaking her head. A small line of blood, hair-thin and no more than a fingernail long, trails in the otherwise cream-colored solution. Fine, not unusual with the pinprick and all. She listens again for Aijin and closes her eyes again, her thoughts wandering to practical matters: food, diapers, and her way out of this bedraggled life.\nBefore she knows it, she’s slumped back, her chest throbbing, head rolled to the side, and falling into a sleep, with the jade hairpin still attached, making a slight whirring sound at each drop collected.\nOne day, she thinks, she’ll feed her baby better. No hairpins, no synthetic additives, no puckering powders.\nShe dreams of the smell of synthesizers giving way to incense, and exoskel grease giving way to jasmine blossoms. In her dream, her mom is short and petite, more petite than she ever was.\nShe’s scrounging about the dorm she shares with her mother and the two other families, all female members. It’s a one inch bead her mom is looking for that Luqiong was playing with, rolling it about, pretending it’s a self-driving motorcycle. But now it’s missing, and her mom can’t finish the necklace she was making.\n“If you’re not going to be helpful, then at least don’t cause me trouble,” her mom says, eyebrows scrunched in gentle fury. Her mom shakes her head and Luqiong can smell the scent of the jasmine detangler spray her mom uses wafting toward her.\nShe doesn’t want to disappoint her mother, but everything disappoints. Ever since she got a sister, little Aijin, the one Luqiong named her baby after, everything disappoints. The fingers on her mom’s hand giving out from arthritis when she’s crafting makeshift jewelry to sell disappoints. Luqiong’s daily surreptitious collection of odds and ends from the machinery room to use as materials for the jewelry disappoints. They’re not shiny enough or they’re not sanded down enough. There’s never enough, not enough food, not enough formula. Her mom sacrifices herself to buy formula, since her milk has been inconsistent in the detention center. It’s the stress, she says. It’s the stress to keep you alive, to keep baby Aijin alive. Never enough formula, never enough milk.\nIn the dream, Luqiong suffers hunger pains. She eats her rations, but it’s not enough. She can’t find the bead, but she finds the hairpin, the jade one engraved with jasmine flowers her mom treasures. It’s put into the bin for the auto-grinder, to be trashed. She grabs it, but her sleeve gets stuck close enough to the grinding machine. It starts now, and her heart jumps. Her stomach turns as she’s pulled closer to the chomping maw. In her dream, she’s on the conveyor belt, screaming, but no one hears her, no one sees the shine of jade grasped in her fingers.\nWhen she wakes, her fists are clenched. The diodes’ light is weak and starting to flicker. She turns them off. There’s a repeated dull noise, and she realizes it’s her jade hairpin device beeping, telling her that the vial is full. She pulls out the pin and moans. She forgot to release the legs of the hairpin from her chest. They pinch and grab, like the legs of little recorder spiderbots. She hits the release, but fumbles with her exonails half-retracted and ejects the contents of the vial onto her exoskel. She curses, trying to guide the stream of milk back into the vial.\nShe salvages as much as she can, then puts the vial, still attached to the pin, aside. It gleams against the sliver of moonlight coming in from an exposed bit of window. It has always reminded her of another jade pin, the one her mother had in her hair. The only relic from her father that her mother hid to keep away from the collectors at the detention center. The one that her mother traded years ago for some extra formula for her dying little baby sister, Aijin.\nIt was all in vain. Aijin, so small and vulnerable. Aijin so frail and thin. Aijin passed away. Even the money from the jewelry her mother cobbled together from machinery odds and ends dried up as her mother started losing hope and her arthritic hands bested her. She made all kinds of jewelry, but never hairpins. And then she stopped making them altogether.\nThat was when Luqiong decided to leave on her own. She couldn’t get it together for her mom, she couldn’t convince her mom to leave. So she left. Escaped on one of the intake days, an undertaking that she planned for years. There was no Aijin to be a part of this plan either.\nAnd when it became Luqiong’s turn for her own surprising birth that was never meant to be, she named her Aijin and had asked for no wedding ring, no gifts. Just a straight up hairpin breast pump for her exoskel. They were hard to get, expensive and rare. And it was all hush-hush. Signalers can’t get pregnant, the effects of the UV and their exoskel attachments render them what they call “inert.” But Luqiong found herself being the impossible, doing the impossible, cutting through her torso exoskel to relieve her expanding belly, giving an excruciating birth, running from her job, from being a signaler and electrical engineer, running away again, not from the detention center of the old days gone, but from the combat commissioners that had trained her, with nothing but a state-of-the-art cutting edge hairpin breast pump made from only the most exquisite of jades and alloys and a week’s worth of portafood.\nShe hustled, begged, cajoled, worked street-smart, got fake IDs, did everything she could to make herself useful in all sorts of underground and black-market ways. But now, she wanted that life over. She wanted a new life, one where she could really feel, physically hold her lifeblood close, and give her baby and her a fresh start.\nShe gets up and handles the set of test tubes, all sterilized thanks to the bathing sterilizer unit. Everything she owns she owes to her instincts, distracted others, trained skills, and the agility and speed of her pylo exoskel. She starts the distillation, and the tubes wash with a blue liquid. She opens the hairpin vial and pours the contents in, mixing powders and other liquids. As it bubbles, thickening now in the addition process for enhancing the milk, she hears a small coo.\nLuqiong walks to the baby crate, checks on her little pride, the package that was never meant to be. She holds Aijin close saying, “Soon, honey, soon. Soon, I will hold you to my skin and I will stare at you as you drink from me.”\nIt might be a stupid wish, a small wish, but that’s all Luqiong wants. For her own Aijin to be healthy. To not pass away. To not have to drink the substandard concoction she makes from the little she produces and thickens up for the meal. She wants to remove the exoskel in total, rebuild her own body, hold Aijin close to her, and have that skin contact as she nurses her child.\nShe curses.\nShe just wants to flippin’ nurse her child, like any other mom.\nShe picks up the hairpin and raises it in the air. She pulls her elbow back like she’s about to hurl it. She can envision it hitting the wall and shattering, beeping and shrieking as it malfunctions. Her arm trembles. She puts it down. No, she can’t make it shatter, she can’t just destroy this nipple-pricking pump. This extravagant top-of-the-line persecuting device. She needs it. They need it.\nFor now.\nOnly for a while longer, she tells herself. We’re leaving. We’re finding the skelcutter. She’s got hints, road maps she’s drawn from stories and hidden away, and some help.\nHer hand trembles as she swirls her hair in a bun and affixes it with her jade hairpin. It’s cold to the touch.\nAijin, you and me, she whispers. Tomorrow, we will set off.\nAnd one day, you will feel my skin, under the shell. I will feel you and you will feel me. And you will drink from me like I’m a wishing fountain, making you strong, healthy with all your aspirations coming true.\nLuqiong picks up her daughter, holds her to her abdomen, to the exposed part she cut out of her exoskel that has left her scarred and damaged. It’s infected, that part of the exoskel, a virus running up its frayed, tenacious pylo fibers. Aijin coos, her eyes so brilliant and gemlike. She must feel the exposed skin of her mom’s abdomen because she tries to suck on the exoskel that encases her chest. Luqiong locks her elbows holding Aijin’s pursed lips away.\nLuqiong blinks her eyes, casts her face toward the rising sun, and straightens her lips. The hairpin pokes into her scalp, itching her. She covers her baby with the shielding blanket and shoots out a UV message, practicing the delivery of that message for when she meets the smuggler when they will cross east to the place where underground skelcutters and other fugitive traders are purported to exist. Where they must exist.\nShe makes herself strong, to not cry, as she grabs a premade bottle of her concocted milk. She tips it toward her babe, thinking of Aijin the first, her still body, the smell of jasmine, and the cold touch of jade flowers on a fancy hairpin of long ago. And the smooth feel of her mother’s skin long before that when they hugged, or when she consoled her mom, stroking her arm. The sound of the nutritive elements percolating into the solution fills the room. Aijin sucks and swallows, sucks and swallows, her little cheeks puffing in and out. And even though Luqiong’s just holding up a bottle, for a moment she feels a pang in her chest. And she doesn’t know if it’s her heart or her breast, aching under the stiff, unforgiving armor.\nD.A. Xiaolin Spires steps into portals and reappears in sites such as Hawai’i, NY, various parts of Asia and elsewhere, with her keyboard appendage attached. Her work appears in publications such as Clarkesworld, Analog, Nature, Terraform, Fireside, Star*Line, Liquid Imagination, and anthologies such as Make Shift, Ride the Star Wind, Sharp and Sugar Tooth, Deep Signal, and Battling in All Her Finery. Select stories can be read in German, Spanish, Vietnamese, Estonian, French and Japanese translation.", "source": "https://clarkesworldmagazine.com/spires_03_21/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Mamaborg's Milk and the Brilliance of Gems by D.A. Xiaolin Spires"}