{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Tobias S Buckell", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "CSAQJxSA0ryCqAYV0vsnO3lc7e4=", "id": null, "license": null, "comments": "", "raw_text": "Interview  An Interview with Daniel Abraham  Daniel Abraham is a New Mexico-based writer. His short fiction started appearing in the late 90s in places like Asimov’s, Realms of Fantasy, and The Magazine of Fantasy and Science Fiction. Abraham’s story Flat Diane was nominated for the Nebula Award in 2005 and won the 2005 International Horror Guild award, proving his strength in telling the short tale.  But Abraham excels in the long form as well. In 2006 his first novel A Shadow in Summer told the eerie tale of a disturbed poet falling into the increasingly complex machinations of a magical creature the poet has trapped. A tale of economics, war, and complex relationships, it received high marks from many for bringing a fresh breath of air to the idea of magic and its costs.    For Fantasy novels, a new way of looking at magic is often an important core part of the worldbuilding. I’m fascinated by the idea of personified spells, or concepts, like that of the character Seedless in your book. Where did you come up with that idea?  Actually, I was studying cabala for a different project, and I ran into the concept of angels being abstract structures that are also alive.  Ideas that can think back. That, along with Douglas Hofstadter’s book about the issues that come into play when you’re translating literature kind of mushed together. I thought about taking abstract things and translating them into a form that included will, personality, volition.  Usually in this genre magic is something a character summons, like a handheld weapon or shield, but in these books your magic, because they become personified, are major characters that really impact the events and future of your society, as well as everyone else’s lives. How did you approach writing these characters differently than your human characters?  The biggest difference I had to deal with was their relationship to death. The way I pictured them, the captured spirits want to return to their natural state. You pick up a rock, and it wants to fall, get back to its lowest energy state. Pulling these things into the world takes a lot of energy and effort. Just like picking up a rock requires energy.  But if they want to go back to being simply abstract ideas and not people, then these are things that are constantly longing for their own death, which is pretty much exactly what all my normal human characters don’t want. The reversal was hard to deal with, partly because these weren’t depressed, suicidal beings. They were slaves who wanted to be free, it was just that the freedom they wanted was freedom from consciousness, will, and existence. It makes them creepy and unsettling by nature.  Your characters pay for their attempting to control magic, the poets are often quite tragic figures who suffer for their success. What is this commentary on, life in general? Or just art?  Power more than art. These guys—and they’re pretty much only men who are doing this—are dedicating their lives to something that will give them godlike powers, and all it costs is peace, contentment, and the hope of normal human relationships. Compare that with being a Senator. Not that I think politicians deserve a lot of sympathy as a class, but the people who really value a pleasant day to day life over toil, struggle, compromise, and the absolute awareness of their own impotence in the face of suffering don’t seem to run for office more than, say, once or twice.  There is also this sense that the poets stand on the shoulders of giants, but it gets harder and harder to stand. Once a poet has used a clever phrase to capture this magic and utilize it, that can’t be used again. Trying to control a resource becomes harder and harder the more you use it. Is there a commentary here on using natural resources (in this case magic) and how it gets harder and harder for each generation to extract resources that previous generations have gotten to?  Yeah, there’s a peak oil comparison there that’s not too far from the surface. There’s also the sense of magic being by nature elitist and technology being egalitarian. One of the big differences between technology and magic—at least in fantasy novels—is that only special people can work magic. It’s a privileged relationship with the universe. Technology isn’t like that. It spreads out because its available to everyone. That’s Ted Chiang’s argument originally, but he convinced me.  One of the things I was thinking about was how the society I was making would view innovations. They’d hate them. Seedless only drove that economy until someone invented a cotton gin. And so I imagine the first guy to make a cotton gin wound up face down in a river. You don’t mess with the King’s monopoly. There may be some applications of that in the real world too. So there’s also a critique of any philosophy or power that clings to the past and doesn’t make room for figuring new things out.  Recently in your blog you pointed out that Robert Jordan’s recent passing away should be a \"wake-up call\" for reigning in long series. Obviously your approach, with a defined quartet and books that more stand alone, differs from the traditional multi-volume fantasies out there, do you feel you might ever hit book 5, and if not, what is it you are working on next?  Nope, no book five. I designed this story to end, and it ends. I’ve already written and turned in the last book, and I feel I’ve smoked this world down to the filter. There isn’t a story set here that wouldn’t be recapitulating things I’ve already said and done.  The next project is an interesting question. I thought of the Long Price books as kind of my journeyman work. I wanted to learn how to write a novel. I don’t think I’m done with that education, but I’ve gotten a lot better and clearer. The next project is more focused.What is fantasy? How do you play to its strengths? How do you make it accessible without making it trite? I’m working out my ideas about that now.  I am convinced that if you do your homework, it shows. I always trot out Babylon 5 and The X Files when I talk about this. Babylon 5 wasn’t a great show on a lot of levels. The dialog was often wooden, some of the acting—not all, but some—ranks among the worst I’ve ever seen. The worst episodes were physically painful to watch, and there wasn’t a great work of science fiction or fantasy that the show didn’t beat with a club and go through its pockets. Thing is, it worked. When I go back and watch the first few episodes, I know that JMS knew exactly where he was headed, and the things he set up in the first season paid off by the end. I got to the fourth season, and little revelations would come that I knew we’d been moving toward from the start, and so I trusted him, and the man came through.  X Files, on the other hand, had everything going for it. Sharp scripts, a fascinating and original premise, and the kind of chemistry between actors that most mortals only dream of. And it failed. They were making it up as they went along, and it didn’t all fit together. It was a shaggy dog story, and they were stringing me out as long as they could with teases. So I stopped caring. And then I stopped watching. And now I’m bitter.  I’m planning the next project. I’m spending a fair part of the next year working on the outline and proposal, the worldbuilding, the characters, their plot arcs, and how to put the ending of the story into the beginning, so that when you read the last line, it completes what I wrote in the first one. It’s a tall order, and I’ll fall short because everyone always does. But I’m gonna aim for the back fence and see what happens.  I’ve also got some other things I’m doing aside from the epic fantasy gig. I’m writing the scripts for a comic book set in George’s Wild Cards universe. I sold a contemporary supernatural thriller series to Pocket books under a pseudonym, and there’s a mystery or two I’d like to write if time allows. It’s tricky, though. I’ve started feeling the impulse to skip steps and just start writing the first few chapters of the new book . . .  You live in New Mexico, near a group of working authors like Walter Jon Williams and George R. R. Martin. How important has this contact and location been for you as an author?  Huge. I’m in a monthly critique group with people who have been doing this professionally since I was in high school. We have four people who’ve been on the New York Times bestsellers list in one capacity or another, and everyone in the group is dedicated to improving the careers of the other. And we’ll get together outside the group if someone has a particularly thorny problem and hammer out the plots and structures for one another. I’ve learned a lot from the folks I work with. And the biggest thing I’ve learned is that I’m a better writer when I have someone to bounce ideas off.  You also have a livejournal online, and interact with your readers and other writers frequently. What do you think of the trend of blogging authors and how it has changed the reader/author dynamic, if any?  I have mixed feelings about blogging. On the one hand, it’s a great way for me to keep up with my friends and for folks to keep up with me. On the other hand, I wouldn’t put a lot of stock in it as a prop for my career. I don’t think my blog posts are likely to draw in new readers, and I can’t imagine that it would convince someone who didn’t like the first book to buy the second.  I think the best career advice I’ve had is to go write another book, only better this time. Having a website up is great, but I’m a novelist who blogs socially more than a blogger who writes novels.  I think the more powerful influence on authors by readers actually comes from other people’s review blogs and message boards. Writers can go lurk in discussion groups that are about them. It’s like eavesdropping on just the conversations where people mention you. It can be incredibly gratifying, or depressing, or distracting. But I’ll swear blind it has an effect.  And yet you’ve been posting essays on your blog about a symposium with some of the other New Mexico writers. There must be a reason for doing that?  Yeah, that’s kind of an opportunity to think out loud about epic fantasy. The symposium was something I put together after I turned in the last Long Price book. I’ve got four or five hours of folks talking about what fantasy is and does, what it’s strengths are. I’ve been trying to put that into a form that makes sense, and I’m making progress slowly. I also had a really interesting conversation at World Fantasy with Steven Erikson and Hal Duncan that’s going to find its way into that, even though they weren’t at the original meeting. And the comments that folks have left on the reports I’ve made so far have also changed and refined what I’m thinking about.  There are some really interesting things about fantasy. There’s a sense of nostalgia that I think is close to the bones of the genre, but it’s not a nostalgia for a real historical time. There’s a tension between what the sense of novelty that comes from traveling mentally to a different world and the sense of comfort that comes from reading genre fiction, and both of those halves of the equation are important.  It’s a complex system. I’m having a lot of fun looking at it. I’m hoping to figure a few more things out about it as I go.  Is there anything else you’d like to add?  How about \"To do a common thing uncommonly well brings success.\" I got that off a bottle of ketchup. Called \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.  His Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"  He currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs.", "text": "Interview\nAn Interview with Daniel Abraham\nDaniel Abraham is a New Mexico-based writer. His short fiction started appearing in the late 90s in places like Asimov’s, Realms of Fantasy, and The Magazine of Fantasy and Science Fiction. Abraham’s story Flat Diane was nominated for the Nebula Award in 2005 and won the 2005 International Horror Guild award, proving his strength in telling the short tale.\nBut Abraham excels in the long form as well. In 2006 his first novel A Shadow in Summer told the eerie tale of a disturbed poet falling into the increasingly complex machinations of a magical creature the poet has trapped. A tale of economics, war, and complex relationships, it received high marks from many for bringing a fresh breath of air to the idea of magic and its costs.\nFor Fantasy novels, a new way of looking at magic is often an important core part of the worldbuilding. I’m fascinated by the idea of personified spells, or concepts, like that of the character Seedless in your book. Where did you come up with that idea?\nActually, I was studying cabala for a different project, and I ran into the concept of angels being abstract structures that are also alive.\nIdeas that can think back. That, along with Douglas Hofstadter’s book about the issues that come into play when you’re translating literature kind of mushed together. I thought about taking abstract things and translating them into a form that included will, personality, volition.\nUsually in this genre magic is something a character summons, like a handheld weapon or shield, but in these books your magic, because they become personified, are major characters that really impact the events and future of your society, as well as everyone else’s lives. How did you approach writing these characters differently than your human characters?\nThe biggest difference I had to deal with was their relationship to death. The way I pictured them, the captured spirits want to return to their natural state. You pick up a rock, and it wants to fall, get back to its lowest energy state. Pulling these things into the world takes a lot of energy and effort. Just like picking up a rock requires energy.\nBut if they want to go back to being simply abstract ideas and not people, then these are things that are constantly longing for their own death, which is pretty much exactly what all my normal human characters don’t want. The reversal was hard to deal with, partly because these weren’t depressed, suicidal beings. They were slaves who wanted to be free, it was just that the freedom they wanted was freedom from consciousness, will, and existence. It makes them creepy and unsettling by nature.\nYour characters pay for their attempting to control magic, the poets are often quite tragic figures who suffer for their success. What is this commentary on, life in general? Or just art?\nPower more than art. These guys—and they’re pretty much only men who are doing this—are dedicating their lives to something that will give them godlike powers, and all it costs is peace, contentment, and the hope of normal human relationships. Compare that with being a Senator. Not that I think politicians deserve a lot of sympathy as a class, but the people who really value a pleasant day to day life over toil, struggle, compromise, and the absolute awareness of their own impotence in the face of suffering don’t seem to run for office more than, say, once or twice.\nThere is also this sense that the poets stand on the shoulders of giants, but it gets harder and harder to stand. Once a poet has used a clever phrase to capture this magic and utilize it, that can’t be used again. Trying to control a resource becomes harder and harder the more you use it. Is there a commentary here on using natural resources (in this case magic) and how it gets harder and harder for each generation to extract resources that previous generations have gotten to?\nYeah, there’s a peak oil comparison there that’s not too far from the surface. There’s also the sense of magic being by nature elitist and technology being egalitarian. One of the big differences between technology and magic—at least in fantasy novels—is that only special people can work magic. It’s a privileged relationship with the universe. Technology isn’t like that. It spreads out because its available to everyone. That’s Ted Chiang’s argument originally, but he convinced me.\nOne of the things I was thinking about was how the society I was making would view innovations. They’d hate them. Seedless only drove that economy until someone invented a cotton gin. And so I imagine the first guy to make a cotton gin wound up face down in a river. You don’t mess with the King’s monopoly. There may be some applications of that in the real world too. So there’s also a critique of any philosophy or power that clings to the past and doesn’t make room for figuring new things out.\nRecently in your blog you pointed out that Robert Jordan’s recent passing away should be a \"wake-up call\" for reigning in long series. Obviously your approach, with a defined quartet and books that more stand alone, differs from the traditional multi-volume fantasies out there, do you feel you might ever hit book 5, and if not, what is it you are working on next?\nNope, no book five. I designed this story to end, and it ends. I’ve already written and turned in the last book, and I feel I’ve smoked this world down to the filter. There isn’t a story set here that wouldn’t be recapitulating things I’ve already said and done.\nThe next project is an interesting question. I thought of the Long Price books as kind of my journeyman work. I wanted to learn how to write a novel. I don’t think I’m done with that education, but I’ve gotten a lot better and clearer. The next project is more focused.What is fantasy? How do you play to its strengths? How do you make it accessible without making it trite? I’m working out my ideas about that now.\nI am convinced that if you do your homework, it shows. I always trot out Babylon 5 and The X Files when I talk about this. Babylon 5 wasn’t a great show on a lot of levels. The dialog was often wooden, some of the acting—not all, but some—ranks among the worst I’ve ever seen. The worst episodes were physically painful to watch, and there wasn’t a great work of science fiction or fantasy that the show didn’t beat with a club and go through its pockets. Thing is, it worked. When I go back and watch the first few episodes, I know that JMS knew exactly where he was headed, and the things he set up in the first season paid off by the end. I got to the fourth season, and little revelations would come that I knew we’d been moving toward from the start, and so I trusted him, and the man came through.\nX Files, on the other hand, had everything going for it. Sharp scripts, a fascinating and original premise, and the kind of chemistry between actors that most mortals only dream of. And it failed. They were making it up as they went along, and it didn’t all fit together. It was a shaggy dog story, and they were stringing me out as long as they could with teases. So I stopped caring. And then I stopped watching. And now I’m bitter.\nI’m planning the next project. I’m spending a fair part of the next year working on the outline and proposal, the worldbuilding, the characters, their plot arcs, and how to put the ending of the story into the beginning, so that when you read the last line, it completes what I wrote in the first one. It’s a tall order, and I’ll fall short because everyone always does. But I’m gonna aim for the back fence and see what happens.\nI’ve also got some other things I’m doing aside from the epic fantasy gig. I’m writing the scripts for a comic book set in George’s Wild Cards universe. I sold a contemporary supernatural thriller series to Pocket books under a pseudonym, and there’s a mystery or two I’d like to write if time allows. It’s tricky, though. I’ve started feeling the impulse to skip steps and just start writing the first few chapters of the new book . . .\nYou live in New Mexico, near a group of working authors like Walter Jon Williams and George R. R. Martin. How important has this contact and location been for you as an author?\nHuge. I’m in a monthly critique group with people who have been doing this professionally since I was in high school. We have four people who’ve been on the New York Times bestsellers list in one capacity or another, and everyone in the group is dedicated to improving the careers of the other. And we’ll get together outside the group if someone has a particularly thorny problem and hammer out the plots and structures for one another. I’ve learned a lot from the folks I work with. And the biggest thing I’ve learned is that I’m a better writer when I have someone to bounce ideas off.\nYou also have a livejournal online, and interact with your readers and other writers frequently. What do you think of the trend of blogging authors and how it has changed the reader/author dynamic, if any?\nI have mixed feelings about blogging. On the one hand, it’s a great way for me to keep up with my friends and for folks to keep up with me. On the other hand, I wouldn’t put a lot of stock in it as a prop for my career. I don’t think my blog posts are likely to draw in new readers, and I can’t imagine that it would convince someone who didn’t like the first book to buy the second.\nI think the best career advice I’ve had is to go write another book, only better this time. Having a website up is great, but I’m a novelist who blogs socially more than a blogger who writes novels.\nI think the more powerful influence on authors by readers actually comes from other people’s review blogs and message boards. Writers can go lurk in discussion groups that are about them. It’s like eavesdropping on just the conversations where people mention you. It can be incredibly gratifying, or depressing, or distracting. But I’ll swear blind it has an effect.\nAnd yet you’ve been posting essays on your blog about a symposium with some of the other New Mexico writers. There must be a reason for doing that?\nYeah, that’s kind of an opportunity to think out loud about epic fantasy. The symposium was something I put together after I turned in the last Long Price book. I’ve got four or five hours of folks talking about what fantasy is and does, what it’s strengths are. I’ve been trying to put that into a form that makes sense, and I’m making progress slowly. I also had a really interesting conversation at World Fantasy with Steven Erikson and Hal Duncan that’s going to find its way into that, even though they weren’t at the original meeting. And the comments that folks have left on the reports I’ve made so far have also changed and refined what I’m thinking about.\nThere are some really interesting things about fantasy. There’s a sense of nostalgia that I think is close to the bones of the genre, but it’s not a nostalgia for a real historical time. There’s a tension between what the sense of novelty that comes from traveling mentally to a different world and the sense of comfort that comes from reading genre fiction, and both of those halves of the equation are important.\nIt’s a complex system. I’m having a lot of fun looking at it. I’m hoping to figure a few more things out about it as I go.\nIs there anything else you’d like to add?\nHow about \"To do a common thing uncommonly well brings success.\" I got that off a bottle of ketchup.\nCalled \"Violent, poetic and compulsively readable\" by Maclean's, science fiction author Tobias S. Buckell is a New York Times Bestselling writer born in the Caribbean. He grew up in Grenada and spent time in the British and US Virgin Islands, and the islands he lived on influence much of his work.\nHis Xenowealth series begins with Crystal Rain. Along with other stand-alone novels and his over fifty stories, his works have been translated into eighteen different languages. He has been nominated for awards like the Hugo, Nebula, Prometheus, and the John W. Campbell Award for Best New Science Fiction Author. His latest novel is Hurricane Fever, a follow up to the successful Arctic Rising that NPR says will \"give you the shivers.\"\nHe currently lives in Bluffton, Ohio with his wife, twin daughters, and a pair of dogs.", "source": "https://clarkesworldmagazine.com/abraham_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Interview with Daniel Abraham by Tobias S. Buckell"}