{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Joe Haldeman", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "p9Rlzw5UyYONfmOutV7d+dNp2tk=", "id": null, "license": null, "comments": "", "raw_text": "6380 words, short story, REPRINT  Manifest Destiny  This is the story of John Leroy Harris, but I doubt that name means much to you unless you’re pretty old, especially an old lawman. He’s dead anyhow, thirty years now, and nobody left around that could get hurt with this story. The fact is, I would’ve told it a long time ago, but when I was younger it would have bothered me, worrying about what people would think. Now I just don’t care. The hell with it.  I’ve been on the move ever since I was a lad. At thirteen I put a knife in another boy and didn’t wait around to see if he lived, just went down to the river and worked my way to St. Louis, got in some trouble there and wound up in New Orleans a few years later. That’s where I came to meet John Harris.  Now you wouldn’t tell from his name (he’d changed it a few times) but John was pure Spanish blood, as his folks had come from Spain before the Purchase. John was born in Natchitoches in 1815, the year of the Battle of New Orleans. That put him thirteen years older than me, so I guess he was about thirty when we met.  I was working as a greeter, what we called a “bouncer,” in Mrs. Carranza’s whorehouse down by the docks. Mostly I just sat around and looked big, which I was then and not fat, but sometimes I did have to calm down a customer or maybe throw him out, and I kept under my weskit a Starr pepperbox derringer in case of real trouble. It was by using this weapon that I made the acquaintance of John Harris.  Harris had been in the bar a few times, often enough for me to notice him, but to my knowledge he never put the boots to any of the women. Didn’t have to pay for it, I guess; he was a handsome cuss, more than six feet tall, slender, with this kind of tragic look that women seem to like. Anyhow it was a raw rainy night in November, cold the way no place else quite gets cold, and this customer comes downstairs complaining that the girl didn’t do what he had asked her to, and he wasn’t going to pay the extra. The kate came down right behind him and told me what it was, and that she had too done it, and he hadn’t said nothing about it when they started, and you can take my word for it that it was something nasty.  Well, we had some words about that and he tried to walk out without paying, so I sort of brought him back in and emptied out his pockets. He didn’t even have the price of a drink on him (he’d given Mrs. Carranza the two dollars but that didn’t get you anything fancy). He did have a nice overcoat, though, so I took that from him and escorted him out into the rain head first.  What happened was about ten or fifteen minutes later he barges back in, looking like a drowned dog but with a Navy Colt in each hand. He got off two shots before I blew his brains out (pepperbox isn’t much of a pistol, but he wasn’t four yards away) and a split second later another bullet takes him in the lungs. I turned around and everybody was on the floor or behind the bar but John Harris, who was still perched on a stool looking sort of interested and putting some kind of foreign revolver back into his pocket.  The cops came soon enough but there was no trouble, not with forty witnesses, except for what to do with the dead meat. He didn’t have any papers and Mrs. Carranza didn’t want to pay the city for the burial. I was for just taking it out back and dropping it in the water, but they said that was against the law and unsanitary. John Harris said he had a wagon and come morning he’d take care of the matter. He signed a paper and that satisfied them.  First light, Harris showed up in a fancy landau. Me and the driver, an old black, we wrestled the wrapped-up corpse into the back of the carriage. Harris asked me to come along and I did.  We just went east a little ways and rolled the damned thing into a bayou, let the gators take it. Then the driver smoked a pipe while Harris and me talked for a while.  Now he did have the damnedest way of talking. His English was like nothing you ever heard—Spanish was his mother tongue and then he learned most of his English in Australia—but that’s not what I really mean. I mean that if he wanted you to do something and you didn’t want to do it, you had best put your fingers in your ears and start walking away. That son of a gun could sell water to a drowning man.  He started out asking me questions about myself, and eventually we got to talking about politics. Turns out we both felt about the same way towards the U.S. government, which is to say the hell with it. Harris wasn’t even really a citizen, and I myself didn’t exist. For good reasons there was a death certificate on me in St. Louis, and I had a couple of different sets of papers a fellow on Bourbon Street printed up for me.  Harris had noticed that I spoke some Spanish—Mrs. Carranza was Mexican and so were most of her kates—and he got around to asking whether I’d like to take a little trip to Mexico. I told him that sounded like a really bad idea.  This was late 1844, and that damned Polk had just been elected promising to annex Texas. The Mexicans had been skirmishing with Texas for years, and they said it would be war if they got statehood. The man in charge was that one-legged crazy greaser Santa Anna, who’d been such a gentleman at the Alamo some years before. I didn’t fancy being a gringo stuck in that country when the shooting started.  Well, Harris said I hadn’t thought it through. It was true there was going to be a war, he said, but the trick was to get in there early enough to profit from it. He asked whether I’d be interested in getting ten percent of ten thousand dollars. I told him I could feel my courage returning.  Turns out Harris had joined the army a couple of years before and got himself into the quartermaster business, the ones who shuffle supplies back and forth. He had managed to slide five hundred rifles and a big batch of ammunition into a warehouse in New Orleans. The army thought they were stored in Kentucky and the man who rented out the warehouse thought they were farming tools. Harris got himself discharged from the army and eventually got in touch with one General Parrodi, in Tampico. Parrodi agreed to buy the weapons and pay for them in gold.  The catch was that Parrodi also wanted the services of three Americans, not to fight but to serve as “interpreters”—that is to say, spies—for as long as the war lasted. We would be given Mexican citizenship if we wanted it, and a land grant, but for our own protection we’d be treated as prisoners while the war was going on. (Part of the deal was that we would eavesdrop on other prisoners.) Harris showed me a contract that spelled all of this out, but I couldn’t read Spanish back then. Anyhow I was no more inclined to trust Mexicans in such matters than I was Americans, but as I say Harris could sell booze to a Baptist.  The third American was none other than the old buck who was driving, a runaway slave from Florida name of Washington. He had grown up with Spanish masters, and not as a field hand but as some kind of a butler. He had more learning than I did and could speak Spanish like a grandee. In Mexico, of course, there wasn’t any slavery, and he reckoned a nigger with gold and land was just as good as anybody else with gold and land.  Looking back I can see why Washington was willing to take the risk, but I was a damned fool to do it. I was no rough neck but I’d seen some violence in my seventeen years; that citizen we’d dumped in the bayou wasn’t the first man I had to kill. You’d think I’d know better than to put myself in the middle of a war. Guess I was too young to take dying seriously—and a thousand dollars was real money back then.  We went back into town and Harris took me to the warehouse. What he had was fifty long blue boxes stenciled with the name of a hardware outfit, and each one had ten Hall rifles, brand new in a mixture of grease and sawdust.  (This is why the Mexicans were right enthusiastic. The Hall was a flintlock, at least these were, but it was also a breech-loader. The old muzzle-loaders that most soldiers used, Mexican and American, took thirteen separate steps to reload. Miss one step and it can take your face off. Also, the Hall used interchangeable parts, which meant you didn’t have to find a smith when it needed repairing.)  Back at the house I told Mrs. Carranza I had to quit and would get a new boy for her. Then Harris and me had a steak and put ourselves outside of a bottle of sherry, while he filled me in on the details of the operation. He’d put considerable money into buying discretion from a dockmaster and a Brit packet captain. This packet was about the only boat that put into Tampico from New Orleans on anything like a regular basis, and Harris had the idea that smuggling guns wasn’t too much of a novelty to the captain. The next Friday night we were going to load the stuff onto the packet, bound south the next morning.  The loading went smooth as cream, and the next day we boarded the boat as paying passengers, Washington supposedly belonging to Harris and coming along as his manservant. At first it was right pleasant, slipping through a hundred or so miles of bayou country. But the Gulf of Mexico ain’t the Mississippi, and after a couple of hours of that I was sick from my teeth to my toenails, and stayed that way for days. Captain gave me a mixture of brandy and seawater, which like to killed me. Harris thought that was funny, but the humor wore off some when we put into Tampico and him and Washington had to off-load the cargo without much help from me.  We went on up to Parrodi’s villa and found we might be out of a job. While we were on that boat there had been a revolution. Santa Anna got kicked out, having pretty much emptied the treasury, and now the moderado Herrera was in charge. Parrodi and Harris argued for a long time. The Mexican was willing to pay for the rifles, but he figured that half the money was for our service as spies.  They finally settled on eight thousand, but only if we would stay in Tampico for the next eighteen months, in case a war did start. Washington and I would get fifty dollars a month for walking-around money.  The next year was the most boring year of my life. After New Orleans, there’s just not much you could say about Tampico. It’s an old city but also brand new. Pirates burnt it to the ground a couple of hundred years ago. Santa Anna had it rebuilt in the twenties, and it was still not much more than a garrison town when we were there. Most of the houses were wood, imported in pieces from the States and nailed together. Couple of whorehouses and cantinas downtown, and you can bet I spent a lot of time and fifty bucks a month down there.  Elsewhere, things started to happen in the spring. The U.S. Congress went along with Polk and voted to annex Texas, and Mexico broke off diplomatic relations and declared war, but Washington didn’t seem to take notice. Herrera must have had his hands full with the Carmelite Revolution, though things were quiet in Tampico for the rest of the year.  I got to know Harris pretty well. He spent a lot of time teaching me to read and write Spanish—though I never could talk it without sounding like a gringo—and I can tell you he was hellfire as a teacher. The schoolmaster used to whip me when I was a kid, but that was easier to take than Harris’s tongue. He could make you feel about six inches tall. Then a few minutes later you get a verb right and you’re a hero.  We’d also go into the woods outside of town and practice with the pistol and rifle. He could do some awesome things with a Colt. He taught me how to throw a knife and I taught him how to use a lasso.  We got into a kind of routine. I had a room with the Galvez family downtown. I’d get up pretty late mornings and peg away at my Spanish books. About midday Harris would come down (he was staying up at the General’s place) and give me my daily dose of sarcasm. Then we’d go down to a cantina and have lunch, usually with Washington. Afternoons, when most of the town napped, we might go riding or shooting in the woods south of town. We kept the Galvez family in meat that way, getting a boar or a deer every now and then. Since I was once a farm boy I knew how to dress out animals and how to smoke or salt meat to keep it. Señora Galvez always deducted the value of the meat from my rent.  Harris spent most evenings up at the villa with the officers, but sometimes he’d come down to the cantinas with me and drink pulque with the off-duty soldiers, or sometimes just sit around the kitchen table with the Galvez family. They took a shine to him.  He was really taken with old Doña Dolores, who claimed to be over a hundred years old and from Spain. She wasn’t a relative but had been a friend of Señora Galvez’s grandmother. Anyhow she also claimed to be a witch, a white witch who could heal and predict things and so forth.  If Harris had a weakness it was superstition. He always wore a lucky gold piece on a thong around his neck and carried an Indian finger bone in his pocket. And though he could swear the bark off a tree he never used the names of God or Jesus, and when somebody else did he always crossed the fingers of his left hand. Even though he laughed at religion and I never saw him go in a church. So he was always asking Dolores about this or that, and always ready to listen to her stories. She only had a couple dozen but they kept changing.  Now I never thought that Dolores wasn’t straight. If she wasn’t a witch she sure as hell thought she was. And she did heal, with her hands and with herbs she picked in the woods. She healed me of the grippe and a rash I picked up from one of the girls. But I didn’t believe in spells or fortune-telling, not then. When anybody’s eighteen he’s a smart Alec and knows just how the world works. I’m not so sure anymore, especially with what happened to Harris.  Every week or so we got a newspaper from Monterrey. By January I could read it pretty well, and looking back I guess you could say it was that month the war really started, though it would be spring before any shots were fired. What happened was that Polk sent some four thousand troops into what he claimed was part of Texas. The general was Zach Taylor, who was going to be such a crackerjack president a few years later. Herrera seemed about to make a deal with the States, so he got booted out and they put Paredes in office. The Mexicans started building up an army in Monterrey, and it looked like we were going to earn our money after all.  I was starting to get a little nervous. You didn’t have to look too hard at the map to see that Tampico was going to get trouble. If the U.S. wanted to take Mexico City they had the choice of marching over a couple thousand miles of mountains and desert, or taking a Gulf port and only marching a couple hundred miles. Tampico and Vera Cruz were about the same distance from Mexico City, but Vera Cruz had a fort protecting it. All we had was us.  Since the Civil War, nobody remembers much about the Mexican one. Well, the Mexicans were in such bad shape even Taylor could beat them. The country was flat broke. Their regular army had more officers than men. They drafted illiterate Indians and mestizos and herded them by the thousands into certain death from American artillery and cavalry—some of them had never even fired a shot before they got into battle. That was Santa Anna economizing. He could’ve lost that war even if Mexico had all the armies of Europe combined.  Now we thought we’d heard the last of that one-legged son of a bitch. When we got to Tampico he’d just barely got out of Mexico with his skin, exiled to Cuba. But he got back, and he damn near killed me and Harris with his stupidity. And he did kill Washington, just as sure as if he pulled the trigger.  In May of that year Taylor had a show-down up by Matamoros, and Polk got around to declaring war. We started seeing American boats all the time, going back and forth out of cannon range, blockading the port. It was nervous-making. The soldiers were fit to be tied—but old Dolores said there was nothing to worry about. Said she’d be able to “see” if there was going to be fighting, and she didn’t see anything. This gave Harris considerable more comfort than it gave me.  What we didn’t find out until after the war was that Santa Anna got in touch with the United States and said he could get Mexico to end the war, give up Texas and California and for all I know the moon. Polk, who must have been one fine judge of character, gave Santa Anna safe passage through the American blockade.  Well, in the meantime the people in Mexico City had gotten a belly full of Paredes, who had a way of getting people he disagreed with shot, and they kicked him out. Santa Anna limped in and they made him president. He double crossed Polk, got together another twenty thousand soldiers, and got ready to head north and kick the stuffing out of the gringos.  Now you figure this one out. The Mexicans intercepted a message to the American naval commander, telling him to take Tampico. What did Santa Anna do? He ordered Parrodi to desert the place.  I was all for the idea myself, and so were a lot of the soldiers, but the General was considerable upset. It was bad enough that he couldn’t stand and fight, but on top of that he didn’t have near enough mules and horses to move out all the supplies they had stockpiled there.  Well, we sure as hell were going to take care of our supplies. Harris had a buckboard and we’d put a false bottom under the seat. Put our money in there and the papers that identified us as loyal Americans. In another place we put our Mexican citizenship papers and the deeds to our land grant, up in the Mesilla Valley. Then we drew weapons from the armory and got ready to go up to San Luis Potosi with a detachment that was leaving in the morning.  I was glad we wouldn’t be in Tampico when the American fleet rolled in, but then San Luis Potosi didn’t sound like any picnic either. Santa Anna was going to be getting his army together there, and it was only a few hundred miles from Taylor’s army. One or the other of them would probably want to do something with all those soldiers.  Harris was jumpy. He kept putting his hand in his pocket to rub that Indian bone. That night, before he went up to the villa, he came to the hacienda with me, and told Dolores he’d had a bad premonition about going to San Luis Potosi. He asked her to tell his fortune and tell him flat out if he was going to die. She said she couldn’t tell a man when he was going to die, even when she saw it. If she did her powers would go away. But she would tell his fortune.  She studied his hands for a long time, without saying anything. Then she took out a shabby old deck of cards and dealt some out in front of him, face up. (They weren’t regular cards. They had faded pictures of devils and skeletons and so forth.)  Finally she told him not to worry. He was not going to die in San Luis. In fact, he would not die in Mexico at all. That was plain.  Now I wish I had Harris’s talent for shucking off worries. He laughed and gave her a gold real, and then he dragged me down to the cantina, where we proceeded to get more than half corned on that damned pulque, on his money. We carried out four big jars of the stuff, which was a good thing. I had to drink half one in the morning before I could see through the agony. That stuff is not good for white men. Ten cents a jug, though.  The trek from Tampico to San Luis took more than a week, with Washington riding in the back of the buckboard and Harris and me taking turns riding and walking. There was about two hundred soldiers in our group, no more used to walking than us, and sometimes they eyed that buckboard. It was hilly country and mostly dry. General Parrodi went on ahead, and we never saw him again. Later on we learned that Santa Anna court-martialed him for desertion, for letting the gringos take Tampico. Fits.  San Luis Potosi looked like a nice little town, but we didn’t see too damned much of it. We went to the big camp outside of town. Couldn’t find Parrodi, so Harris sniffed around and got us attached to General Pacheco’s division. General looked at the contract and more or less told us to pitch a tent and stay out of the way.  You never seen so many greasers in your life. Four thousand who Taylor’d kicked out of Monterrey, and about twenty thousand more who might or might not have known which end the bullet comes out of.  We got a good taste of what they call santanismo now. Santa Anna had all these raw boys, and what did he do to get them in shape for a fight? He had them dress up and do parades, while he rode back and forth on his God damned horse. Week after week. A lot of the boys ran away, and I can’t say I blame them. They didn’t have a thousand dollars and a ranch to hang around for.  We weren’t the only Americans there. A whole bunch of Taylor’s men, more than two hundred, had absquatulated before he took Monterrey. The Mexicans gave them land grants too. They were called the “San Pats,” the San Patricio battalion. We were told not to go near them, so that none of them would know we weren’t actually prisoners.  After a couple of months of this, we found out what the deal was going to be. Taylor’d had most of his men taken away from him, sent down to Tampico to join up with another bunch that was headed for Mexico City. What Santa Anna said we were going to do was go north and wipe out Taylor, then come back and defend the city. The first part did look possible, since we had four or five men for every one of Taylor’s. Me and Harris and Washington decided we’d wait and see how the first battle went. We might want to keep going north.  It took three days to get all those men on the road. Not just men, either; a lot of them had their wives and children along, carrying food and water and firewood. It was going to be three hundred miles, most of it barren. We saw Santa Anna go by, in a carriage drawn by eight white mules, followed by a couple carriages of whores. If I’d had the second sight Dolores claimed to have, I might’ve spent a pill on that son of a bitch. I still wonder why nobody ever did.  It wasn’t easy going even for us, with plenty of water and food. Then the twelfth day a norther came in, the temperature dropped way below freezing and a God damned blizzard came up. We started passing dead people by the side of the road. Then Washington lost his voice, coughed blood for a while, and died. We carried him till night and then buried him. Had to get a pick from the engineers to get through the frozen ground. I never cried over a nigger before or since. Nor a white man, now I think of it. Could be it was the wind. Harris and me split his share of the gold and burnt his papers.  It warmed up just enough for the snow to turn to cold drizzle, and it rained for two days straight. Then it stopped and the desert sucked up the water, and we marched the rest of the way through dust and heat. Probably a fourth of Santa Anna’s men died or deserted before we got to where Zach Taylor was waiting, outside of Saltillo in a gulch called Buena Vista. Still, we had them so outnumbered we should’ve run them into the ground. Instead, Santa Anna spent the first whole day fiddling, shuffling troops around. He didn’t even do that right. Any shavetail would’ve outflanked and surrounded Taylor’s men. He left all their right flank open, as well as the road to Saltillo. I heard a little shooting, but nothing much happened.  It turned cold and windy that night. Seemed like I just got to sleep when drums woke me up—American drums, sounding reveille; that’s how close we were. Then a God damned band, playing “Hail Columbia.” Both Taylor and Santa Anna belonged on a God damned parade ground.  A private came around with chains and leg irons, said he was supposed to lock us to the buckboard. For twenty dollars he accidentally dropped the key. I wonder if he ever lived to spend it. It was going to be a bad bloody day for the Mexicans.  We settled in behind the buckboard and watched about a thousand cavalrymen charge by, lances and machetes and blood in their eye, going around behind the hills to our right. Then the shooting started, and it didn’t let up for a long time.  To our left, they ordered General Blanco’s division to march into the gulch column-style, where the Americans were set up with field artillery. Canister and grapeshot cut them to bloody rags. Then Santa Anna rode over and ordered Pacheco’s division to go for the gulch. I was just as glad to be chained to a buckboard. They walked right into it, balls but no brains, and I guess maybe half of them eventually made it back. Said they’d killed a lot of gringos, but I didn’t notice it getting any quieter.  I watched all this from well behind the buckboard. Every now and then a stray bullet would spray up dirt or plow into the wood. Harris just stood out in the open, as far from cover as the chain would let him, standing there with his hands in his pockets. A bullet or a piece of grape knocked off his hat. He dusted it off and wiggled his finger at me through the hole, put it back on his head, and put his hands back in his pockets. I reminded him that if he got killed I’d take all the gold. He just smiled. He was absolutely not going to die in Mexico. I told him even if I believed in that bunkman I’d want to give it a little help. A God damned cannonball whooshed by and he didn’t blink, just kept smiling. It exploded some ways behind us and I got a little piece in the part that goes over the fence last, which isn’t as funny as it might sound, since it was going to be a month before I could sit proper.  Harris did leave off being a target long enough to do some doctoring on me. While he was doing that a whole bunch of troops went by behind us, following the way the cavalry went earlier, and they had some nice comments for me. I even got to show my bare butt to Santa Anna, which I guess not too many people do and live.  We heard a lot of noise from their direction but couldn’t see anything because of the hills. We also stopped getting shot at, which was all right by me, though Harris seemed bored.  Since then I’ve read everything I could get my hands on about that battle. The Mexicans had 1,500 to 2,000 men killed and wounded at Buena Vista, thanks to Santa Anna’s generaling. The Americans were unprepared and outnumbered, and some of them actually broke and ran—where even the American accounts admit that the greasers were all-fired brave. If we’d had a real general, a real battle plan, we would’ve walked right over the gringos.  And you can’t help but wonder what would’ve happened. What if Zach Taylor’d been killed, or even just lost the battle? Who would the Whigs have run for president; who would have been elected? Maybe somebody who didn’t want a war between the states.  Anyhow the noise died down and the soldiers straggled back. It’s a funny thing about soldiering. After all that bloody fighting, once it was clear who had won the Americans came out on the battlefield and shared their food and water with us, and gave some medical help. But that night was terrible with the sounds of the dying, and the retreat was pure hell. I was for heading north, forget the land grant, but of course Harris knew that he was going to make it through no matter what.  Well, we were lucky. When we got to San Luis an aide to Pacheco decided we weren’t being too useful as spies, so we got assigned to a hospital detail, and stayed there while others went on south with Santa Anna to get blown apart at Cerro Gordo and Chapultepec. A few months later the war was over and Santa Anna was back in exile—which was temporary, as usual. That son of a bitch was president eleven times.  Now this is where the story gets strange, and if somebody else was telling it I might call him a liar. You’re welcome to that opinion, but anyhow it’s true.  We had more than a thousand acres up in Mesilla, too much to farm by ourselves, so we passed out some handbills and got a couple dozen ex-soldiers to come along with their families, to be sort of tenant farmers. It was to be a fifty-fifty split, which looked pretty good on the surface, because although it wasn’t exactly Kansas the soil was supposedly good enough for maize and agave, the plant that pulque was made from. What they didn’t tell us about was the Apaches. But that comes later.  Now the Mesilla Valley looked really good on the map. It had a good river and it was close to the new American border. I still had my American citizenship papers and sort of liked the idea of being only a couple of days away in case trouble started. Anyhow we got outfitted in San Luis and headed our little wagon train north by northwest. More than a thousand miles, through Durango and Chihuahua. It was rough going, just as dry as hell, but we knew that ahead of time and at least there was nobody shooting at us. All we lost was a few mules and one wagon, no people.  Our grants were outside of the little town of Tubac, near the silver mines at Cerro Colorado. There was some irrigation but not nearly enough, so we planted a small crop and worked like beavers digging ditches so the next crop could be big enough for profit.  Or I should say the greasers and me worked like beavers. Harris turned out not to have too much appetite for that kind of thing. Well, if I had eight thousand in gold I’d probably take a couple years’ vacation myself. He didn’t even stay on the grant, though. Rented a little house in town and proceeded to make himself a reputation.  Of course Harris had always been handy with a pistol and a knife, but he also used to have a healthy respect for what they could do to you. Now he took to picking fights—or actually, getting people so riled that they picked fights with him. With his tongue that was easy.  And it did look like he was charmed. I don’t know how many people he shot and stabbed, without himself getting a scratch. I don’t know because I stopped keeping regular company with him after I got myself a nasty stab wound in the thigh, because of his big mouth. We didn’t seek each other out after that, but it wasn’t such a big town and I did see him every now and then. And I was with him the night he died.  There was this cantina in the south part of town where I liked to go, because a couple of Americans, engineers at the mine, did their drinking there. I walked down to it one night and almost went right back out when I heard Harris’s voice. He was talking at the bar, fairly quiet but in that sarcastic way of his, in English. Suddenly the big engineer next to him stands up and kicks his stool halfway across the room, and at the top of his voice calls Harris something I wouldn’t say to the devil himself. By this time anybody with horse sense was grabbing a piece of the floor, and I got behind the doorjamb myself, but I did see everything that happened.  The big guy reaches into his coat and suddenly Harris has his Navy Colt in his hand. He has that little smile I saw too often. I hear the Colt’s hammer snap down and this little “puff” sound. Harris’s jaw drops because he knows as well as I do what’s happened: bad round, and now there’s a bullet jammed in the barrel. He couldn’t shoot again even if he had time.  Then the big guy laughs, almost good natured, and takes careful aim with this little ladies’ gun, a .32 I think. He shoots Harris in the arm, evidently to teach him a lesson. Just a graze, doesn’t even break a bone. But Harris takes one look at it and his face goes blank and he drops to the floor. Even if you’d never seen a man die, you’d know he was dead by the way he fell.  Now I’ve told this story to men who were in the Civil War, beside which the Mexican War looks like a Sunday outing, and some of them say that’s not hard to believe. You see enough men die and you see everything. One fellow’ll get both legs blown off and sit and joke while they sew him up; the next’ll get a little scratch and die of the shock. But that one just doesn’t sound like Harris, not before or after Doña Dolores’s prediction made him reckless. What signifies to me is the date that Harris died: December 30th, 1853.  Earlier that year, Santa Anna had managed to get back into office, for the last time. He did his usual trick of spending all the money he could find. Railroad fellow named James Gadsden showed up and offered to buy a little chunk of northern Mexico, to get the right-of-way for a transcontinental railroad. It was the Mesilla Valley, and Santa Anna signed it over on the thirtieth of December. We didn’t know it for a couple of weeks, and the haggling went on till June—but when Harris picked a fight that night, he wasn’t on Mexican soil. And you can make of that what you want.  As for me, I only kept farming for a few more years. Around about ’57 the Apaches started to get rambunctious, Cochise’s gang of murderers. Even if I’d wanted to stay I couldn’t’ve kept any help. Went to California but didn’t pan out. Been on the move since, and it suits me. Reckon I’ll go almost anyplace except Mexico.  Because old Dolores liked me and she told my fortune many times. I never paid too much attention, but I know if she’d seen the sign that said I wasn’t going to die in Mexico, she would’ve told me, and I would’ve remembered. Maybe it’s all silliness. But I ain’t going to be the one to test it.    Originally published in Magazine of Fantasy and Science Fiction, October 1983. Born in Oklahoma City, Oklahoma, Joe Haldeman took a B.S. degree in physics and astronomy from the University of Maryland, and did postgraduate work in mathematics and computer science. But his plans for a career in science were cut short by the U.S. Army, which sent him to Vietnam in 1968 as a combat engineer. Seriously wounded in action, Haldeman returned home in 1969 and began to write. By 1976, he had garnered both the Nebula Award and the Hugo Award for his famous novel The Forever War, one of the landmark books of the '70s. He has since won four more Hugo Awards, another four Nebula Awards, the James Tiptree, Jr. Award for his novel Camouflage, the SFWA Grandmaster Award, and has been inducted into the Science Fiction Hall of Fame. His other books include a mainstream novel, War Year, the SF novels Mindbridge, All My Sins Remembered, Worlds, Worlds Apart, Worlds Enough and Time, Buying Time, The Hemingway Hoax, Tools of the Trade, The Coming, 1969, Old Twentieth, The Accidental Time-Machine, Marsbound, and Starbound. His short work has been gathered in the collections Infinite Dreams, Dealing in Futures, Vietnam and Other Alien Worlds, None So Blind, A Separate War and Other Stories, and an omnibus of fiction and non-fiction, War Stories. His most recent books are a new science fiction novel, Earthbound, and a big retrospective collection, The Best of Joe Haldeman. Haldeman lives part of the year in Boston, where he teaches writing at the Massachusetts Institute of Technology, and the rest of the year in Florida, where he and his wife, Gay, make their home.", "text": "6380 words, short story, REPRINT\nManifest Destiny\nThis is the story of John Leroy Harris, but I doubt that name means much to you unless you’re pretty old, especially an old lawman. He’s dead anyhow, thirty years now, and nobody left around that could get hurt with this story. The fact is, I would’ve told it a long time ago, but when I was younger it would have bothered me, worrying about what people would think. Now I just don’t care. The hell with it.\nI’ve been on the move ever since I was a lad. At thirteen I put a knife in another boy and didn’t wait around to see if he lived, just went down to the river and worked my way to St. Louis, got in some trouble there and wound up in New Orleans a few years later. That’s where I came to meet John Harris.\nNow you wouldn’t tell from his name (he’d changed it a few times) but John was pure Spanish blood, as his folks had come from Spain before the Purchase. John was born in Natchitoches in 1815, the year of the Battle of New Orleans. That put him thirteen years older than me, so I guess he was about thirty when we met.\nI was working as a greeter, what we called a “bouncer,” in Mrs. Carranza’s whorehouse down by the docks. Mostly I just sat around and looked big, which I was then and not fat, but sometimes I did have to calm down a customer or maybe throw him out, and I kept under my weskit a Starr pepperbox derringer in case of real trouble. It was by using this weapon that I made the acquaintance of John Harris.\nHarris had been in the bar a few times, often enough for me to notice him, but to my knowledge he never put the boots to any of the women. Didn’t have to pay for it, I guess; he was a handsome cuss, more than six feet tall, slender, with this kind of tragic look that women seem to like. Anyhow it was a raw rainy night in November, cold the way no place else quite gets cold, and this customer comes downstairs complaining that the girl didn’t do what he had asked her to, and he wasn’t going to pay the extra. The kate came down right behind him and told me what it was, and that she had too done it, and he hadn’t said nothing about it when they started, and you can take my word for it that it was something nasty.\nWell, we had some words about that and he tried to walk out without paying, so I sort of brought him back in and emptied out his pockets. He didn’t even have the price of a drink on him (he’d given Mrs. Carranza the two dollars but that didn’t get you anything fancy). He did have a nice overcoat, though, so I took that from him and escorted him out into the rain head first.\nWhat happened was about ten or fifteen minutes later he barges back in, looking like a drowned dog but with a Navy Colt in each hand. He got off two shots before I blew his brains out (pepperbox isn’t much of a pistol, but he wasn’t four yards away) and a split second later another bullet takes him in the lungs. I turned around and everybody was on the floor or behind the bar but John Harris, who was still perched on a stool looking sort of interested and putting some kind of foreign revolver back into his pocket.\nThe cops came soon enough but there was no trouble, not with forty witnesses, except for what to do with the dead meat. He didn’t have any papers and Mrs. Carranza didn’t want to pay the city for the burial. I was for just taking it out back and dropping it in the water, but they said that was against the law and unsanitary. John Harris said he had a wagon and come morning he’d take care of the matter. He signed a paper and that satisfied them.\nFirst light, Harris showed up in a fancy landau. Me and the driver, an old black, we wrestled the wrapped-up corpse into the back of the carriage. Harris asked me to come along and I did.\nWe just went east a little ways and rolled the damned thing into a bayou, let the gators take it. Then the driver smoked a pipe while Harris and me talked for a while.\nNow he did have the damnedest way of talking. His English was like nothing you ever heard—Spanish was his mother tongue and then he learned most of his English in Australia—but that’s not what I really mean. I mean that if he wanted you to do something and you didn’t want to do it, you had best put your fingers in your ears and start walking away. That son of a gun could sell water to a drowning man.\nHe started out asking me questions about myself, and eventually we got to talking about politics. Turns out we both felt about the same way towards the U.S. government, which is to say the hell with it. Harris wasn’t even really a citizen, and I myself didn’t exist. For good reasons there was a death certificate on me in St. Louis, and I had a couple of different sets of papers a fellow on Bourbon Street printed up for me.\nHarris had noticed that I spoke some Spanish—Mrs. Carranza was Mexican and so were most of her kates—and he got around to asking whether I’d like to take a little trip to Mexico. I told him that sounded like a really bad idea.\nThis was late 1844, and that damned Polk had just been elected promising to annex Texas. The Mexicans had been skirmishing with Texas for years, and they said it would be war if they got statehood. The man in charge was that one-legged crazy greaser Santa Anna, who’d been such a gentleman at the Alamo some years before. I didn’t fancy being a gringo stuck in that country when the shooting started.\nWell, Harris said I hadn’t thought it through. It was true there was going to be a war, he said, but the trick was to get in there early enough to profit from it. He asked whether I’d be interested in getting ten percent of ten thousand dollars. I told him I could feel my courage returning.\nTurns out Harris had joined the army a couple of years before and got himself into the quartermaster business, the ones who shuffle supplies back and forth. He had managed to slide five hundred rifles and a big batch of ammunition into a warehouse in New Orleans. The army thought they were stored in Kentucky and the man who rented out the warehouse thought they were farming tools. Harris got himself discharged from the army and eventually got in touch with one General Parrodi, in Tampico. Parrodi agreed to buy the weapons and pay for them in gold.\nThe catch was that Parrodi also wanted the services of three Americans, not to fight but to serve as “interpreters”—that is to say, spies—for as long as the war lasted. We would be given Mexican citizenship if we wanted it, and a land grant, but for our own protection we’d be treated as prisoners while the war was going on. (Part of the deal was that we would eavesdrop on other prisoners.) Harris showed me a contract that spelled all of this out, but I couldn’t read Spanish back then. Anyhow I was no more inclined to trust Mexicans in such matters than I was Americans, but as I say Harris could sell booze to a Baptist.\nThe third American was none other than the old buck who was driving, a runaway slave from Florida name of Washington. He had grown up with Spanish masters, and not as a field hand but as some kind of a butler. He had more learning than I did and could speak Spanish like a grandee. In Mexico, of course, there wasn’t any slavery, and he reckoned a nigger with gold and land was just as good as anybody else with gold and land.\nLooking back I can see why Washington was willing to take the risk, but I was a damned fool to do it. I was no rough neck but I’d seen some violence in my seventeen years; that citizen we’d dumped in the bayou wasn’t the first man I had to kill. You’d think I’d know better than to put myself in the middle of a war. Guess I was too young to take dying seriously—and a thousand dollars was real money back then.\nWe went back into town and Harris took me to the warehouse. What he had was fifty long blue boxes stenciled with the name of a hardware outfit, and each one had ten Hall rifles, brand new in a mixture of grease and sawdust.\n(This is why the Mexicans were right enthusiastic. The Hall was a flintlock, at least these were, but it was also a breech-loader. The old muzzle-loaders that most soldiers used, Mexican and American, took thirteen separate steps to reload. Miss one step and it can take your face off. Also, the Hall used interchangeable parts, which meant you didn’t have to find a smith when it needed repairing.)\nBack at the house I told Mrs. Carranza I had to quit and would get a new boy for her. Then Harris and me had a steak and put ourselves outside of a bottle of sherry, while he filled me in on the details of the operation. He’d put considerable money into buying discretion from a dockmaster and a Brit packet captain. This packet was about the only boat that put into Tampico from New Orleans on anything like a regular basis, and Harris had the idea that smuggling guns wasn’t too much of a novelty to the captain. The next Friday night we were going to load the stuff onto the packet, bound south the next morning.\nThe loading went smooth as cream, and the next day we boarded the boat as paying passengers, Washington supposedly belonging to Harris and coming along as his manservant. At first it was right pleasant, slipping through a hundred or so miles of bayou country. But the Gulf of Mexico ain’t the Mississippi, and after a couple of hours of that I was sick from my teeth to my toenails, and stayed that way for days. Captain gave me a mixture of brandy and seawater, which like to killed me. Harris thought that was funny, but the humor wore off some when we put into Tampico and him and Washington had to off-load the cargo without much help from me.\nWe went on up to Parrodi’s villa and found we might be out of a job. While we were on that boat there had been a revolution. Santa Anna got kicked out, having pretty much emptied the treasury, and now the moderado Herrera was in charge. Parrodi and Harris argued for a long time. The Mexican was willing to pay for the rifles, but he figured that half the money was for our service as spies.\nThey finally settled on eight thousand, but only if we would stay in Tampico for the next eighteen months, in case a war did start. Washington and I would get fifty dollars a month for walking-around money.\nThe next year was the most boring year of my life. After New Orleans, there’s just not much you could say about Tampico. It’s an old city but also brand new. Pirates burnt it to the ground a couple of hundred years ago. Santa Anna had it rebuilt in the twenties, and it was still not much more than a garrison town when we were there. Most of the houses were wood, imported in pieces from the States and nailed together. Couple of whorehouses and cantinas downtown, and you can bet I spent a lot of time and fifty bucks a month down there.\nElsewhere, things started to happen in the spring. The U.S. Congress went along with Polk and voted to annex Texas, and Mexico broke off diplomatic relations and declared war, but Washington didn’t seem to take notice. Herrera must have had his hands full with the Carmelite Revolution, though things were quiet in Tampico for the rest of the year.\nI got to know Harris pretty well. He spent a lot of time teaching me to read and write Spanish—though I never could talk it without sounding like a gringo—and I can tell you he was hellfire as a teacher. The schoolmaster used to whip me when I was a kid, but that was easier to take than Harris’s tongue. He could make you feel about six inches tall. Then a few minutes later you get a verb right and you’re a hero.\nWe’d also go into the woods outside of town and practice with the pistol and rifle. He could do some awesome things with a Colt. He taught me how to throw a knife and I taught him how to use a lasso.\nWe got into a kind of routine. I had a room with the Galvez family downtown. I’d get up pretty late mornings and peg away at my Spanish books. About midday Harris would come down (he was staying up at the General’s place) and give me my daily dose of sarcasm. Then we’d go down to a cantina and have lunch, usually with Washington. Afternoons, when most of the town napped, we might go riding or shooting in the woods south of town. We kept the Galvez family in meat that way, getting a boar or a deer every now and then. Since I was once a farm boy I knew how to dress out animals and how to smoke or salt meat to keep it. Señora Galvez always deducted the value of the meat from my rent.\nHarris spent most evenings up at the villa with the officers, but sometimes he’d come down to the cantinas with me and drink pulque with the off-duty soldiers, or sometimes just sit around the kitchen table with the Galvez family. They took a shine to him.\nHe was really taken with old Doña Dolores, who claimed to be over a hundred years old and from Spain. She wasn’t a relative but had been a friend of Señora Galvez’s grandmother. Anyhow she also claimed to be a witch, a white witch who could heal and predict things and so forth.\nIf Harris had a weakness it was superstition. He always wore a lucky gold piece on a thong around his neck and carried an Indian finger bone in his pocket. And though he could swear the bark off a tree he never used the names of God or Jesus, and when somebody else did he always crossed the fingers of his left hand. Even though he laughed at religion and I never saw him go in a church. So he was always asking Dolores about this or that, and always ready to listen to her stories. She only had a couple dozen but they kept changing.\nNow I never thought that Dolores wasn’t straight. If she wasn’t a witch she sure as hell thought she was. And she did heal, with her hands and with herbs she picked in the woods. She healed me of the grippe and a rash I picked up from one of the girls. But I didn’t believe in spells or fortune-telling, not then. When anybody’s eighteen he’s a smart Alec and knows just how the world works. I’m not so sure anymore, especially with what happened to Harris.\nEvery week or so we got a newspaper from Monterrey. By January I could read it pretty well, and looking back I guess you could say it was that month the war really started, though it would be spring before any shots were fired. What happened was that Polk sent some four thousand troops into what he claimed was part of Texas. The general was Zach Taylor, who was going to be such a crackerjack president a few years later. Herrera seemed about to make a deal with the States, so he got booted out and they put Paredes in office. The Mexicans started building up an army in Monterrey, and it looked like we were going to earn our money after all.\nI was starting to get a little nervous. You didn’t have to look too hard at the map to see that Tampico was going to get trouble. If the U.S. wanted to take Mexico City they had the choice of marching over a couple thousand miles of mountains and desert, or taking a Gulf port and only marching a couple hundred miles. Tampico and Vera Cruz were about the same distance from Mexico City, but Vera Cruz had a fort protecting it. All we had was us.\nSince the Civil War, nobody remembers much about the Mexican one. Well, the Mexicans were in such bad shape even Taylor could beat them. The country was flat broke. Their regular army had more officers than men. They drafted illiterate Indians and mestizos and herded them by the thousands into certain death from American artillery and cavalry—some of them had never even fired a shot before they got into battle. That was Santa Anna economizing. He could’ve lost that war even if Mexico had all the armies of Europe combined.\nNow we thought we’d heard the last of that one-legged son of a bitch. When we got to Tampico he’d just barely got out of Mexico with his skin, exiled to Cuba. But he got back, and he damn near killed me and Harris with his stupidity. And he did kill Washington, just as sure as if he pulled the trigger.\nIn May of that year Taylor had a show-down up by Matamoros, and Polk got around to declaring war. We started seeing American boats all the time, going back and forth out of cannon range, blockading the port. It was nervous-making. The soldiers were fit to be tied—but old Dolores said there was nothing to worry about. Said she’d be able to “see” if there was going to be fighting, and she didn’t see anything. This gave Harris considerable more comfort than it gave me.\nWhat we didn’t find out until after the war was that Santa Anna got in touch with the United States and said he could get Mexico to end the war, give up Texas and California and for all I know the moon. Polk, who must have been one fine judge of character, gave Santa Anna safe passage through the American blockade.\nWell, in the meantime the people in Mexico City had gotten a belly full of Paredes, who had a way of getting people he disagreed with shot, and they kicked him out. Santa Anna limped in and they made him president. He double crossed Polk, got together another twenty thousand soldiers, and got ready to head north and kick the stuffing out of the gringos.\nNow you figure this one out. The Mexicans intercepted a message to the American naval commander, telling him to take Tampico. What did Santa Anna do? He ordered Parrodi to desert the place.\nI was all for the idea myself, and so were a lot of the soldiers, but the General was considerable upset. It was bad enough that he couldn’t stand and fight, but on top of that he didn’t have near enough mules and horses to move out all the supplies they had stockpiled there.\nWell, we sure as hell were going to take care of our supplies. Harris had a buckboard and we’d put a false bottom under the seat. Put our money in there and the papers that identified us as loyal Americans. In another place we put our Mexican citizenship papers and the deeds to our land grant, up in the Mesilla Valley. Then we drew weapons from the armory and got ready to go up to San Luis Potosi with a detachment that was leaving in the morning.\nI was glad we wouldn’t be in Tampico when the American fleet rolled in, but then San Luis Potosi didn’t sound like any picnic either. Santa Anna was going to be getting his army together there, and it was only a few hundred miles from Taylor’s army. One or the other of them would probably want to do something with all those soldiers.\nHarris was jumpy. He kept putting his hand in his pocket to rub that Indian bone. That night, before he went up to the villa, he came to the hacienda with me, and told Dolores he’d had a bad premonition about going to San Luis Potosi. He asked her to tell his fortune and tell him flat out if he was going to die. She said she couldn’t tell a man when he was going to die, even when she saw it. If she did her powers would go away. But she would tell his fortune.\nShe studied his hands for a long time, without saying anything. Then she took out a shabby old deck of cards and dealt some out in front of him, face up. (They weren’t regular cards. They had faded pictures of devils and skeletons and so forth.)\nFinally she told him not to worry. He was not going to die in San Luis. In fact, he would not die in Mexico at all. That was plain.\nNow I wish I had Harris’s talent for shucking off worries. He laughed and gave her a gold real, and then he dragged me down to the cantina, where we proceeded to get more than half corned on that damned pulque, on his money. We carried out four big jars of the stuff, which was a good thing. I had to drink half one in the morning before I could see through the agony. That stuff is not good for white men. Ten cents a jug, though.\nThe trek from Tampico to San Luis took more than a week, with Washington riding in the back of the buckboard and Harris and me taking turns riding and walking. There was about two hundred soldiers in our group, no more used to walking than us, and sometimes they eyed that buckboard. It was hilly country and mostly dry. General Parrodi went on ahead, and we never saw him again. Later on we learned that Santa Anna court-martialed him for desertion, for letting the gringos take Tampico. Fits.\nSan Luis Potosi looked like a nice little town, but we didn’t see too damned much of it. We went to the big camp outside of town. Couldn’t find Parrodi, so Harris sniffed around and got us attached to General Pacheco’s division. General looked at the contract and more or less told us to pitch a tent and stay out of the way.\nYou never seen so many greasers in your life. Four thousand who Taylor’d kicked out of Monterrey, and about twenty thousand more who might or might not have known which end the bullet comes out of.\nWe got a good taste of what they call santanismo now. Santa Anna had all these raw boys, and what did he do to get them in shape for a fight? He had them dress up and do parades, while he rode back and forth on his God damned horse. Week after week. A lot of the boys ran away, and I can’t say I blame them. They didn’t have a thousand dollars and a ranch to hang around for.\nWe weren’t the only Americans there. A whole bunch of Taylor’s men, more than two hundred, had absquatulated before he took Monterrey. The Mexicans gave them land grants too. They were called the “San Pats,” the San Patricio battalion. We were told not to go near them, so that none of them would know we weren’t actually prisoners.\nAfter a couple of months of this, we found out what the deal was going to be. Taylor’d had most of his men taken away from him, sent down to Tampico to join up with another bunch that was headed for Mexico City. What Santa Anna said we were going to do was go north and wipe out Taylor, then come back and defend the city. The first part did look possible, since we had four or five men for every one of Taylor’s. Me and Harris and Washington decided we’d wait and see how the first battle went. We might want to keep going north.\nIt took three days to get all those men on the road. Not just men, either; a lot of them had their wives and children along, carrying food and water and firewood. It was going to be three hundred miles, most of it barren. We saw Santa Anna go by, in a carriage drawn by eight white mules, followed by a couple carriages of whores. If I’d had the second sight Dolores claimed to have, I might’ve spent a pill on that son of a bitch. I still wonder why nobody ever did.\nIt wasn’t easy going even for us, with plenty of water and food. Then the twelfth day a norther came in, the temperature dropped way below freezing and a God damned blizzard came up. We started passing dead people by the side of the road. Then Washington lost his voice, coughed blood for a while, and died. We carried him till night and then buried him. Had to get a pick from the engineers to get through the frozen ground. I never cried over a nigger before or since. Nor a white man, now I think of it. Could be it was the wind. Harris and me split his share of the gold and burnt his papers.\nIt warmed up just enough for the snow to turn to cold drizzle, and it rained for two days straight. Then it stopped and the desert sucked up the water, and we marched the rest of the way through dust and heat. Probably a fourth of Santa Anna’s men died or deserted before we got to where Zach Taylor was waiting, outside of Saltillo in a gulch called Buena Vista. Still, we had them so outnumbered we should’ve run them into the ground. Instead, Santa Anna spent the first whole day fiddling, shuffling troops around. He didn’t even do that right. Any shavetail would’ve outflanked and surrounded Taylor’s men. He left all their right flank open, as well as the road to Saltillo. I heard a little shooting, but nothing much happened.\nIt turned cold and windy that night. Seemed like I just got to sleep when drums woke me up—American drums, sounding reveille; that’s how close we were. Then a God damned band, playing “Hail Columbia.” Both Taylor and Santa Anna belonged on a God damned parade ground.\nA private came around with chains and leg irons, said he was supposed to lock us to the buckboard. For twenty dollars he accidentally dropped the key. I wonder if he ever lived to spend it. It was going to be a bad bloody day for the Mexicans.\nWe settled in behind the buckboard and watched about a thousand cavalrymen charge by, lances and machetes and blood in their eye, going around behind the hills to our right. Then the shooting started, and it didn’t let up for a long time.\nTo our left, they ordered General Blanco’s division to march into the gulch column-style, where the Americans were set up with field artillery. Canister and grapeshot cut them to bloody rags. Then Santa Anna rode over and ordered Pacheco’s division to go for the gulch. I was just as glad to be chained to a buckboard. They walked right into it, balls but no brains, and I guess maybe half of them eventually made it back. Said they’d killed a lot of gringos, but I didn’t notice it getting any quieter.\nI watched all this from well behind the buckboard. Every now and then a stray bullet would spray up dirt or plow into the wood. Harris just stood out in the open, as far from cover as the chain would let him, standing there with his hands in his pockets. A bullet or a piece of grape knocked off his hat. He dusted it off and wiggled his finger at me through the hole, put it back on his head, and put his hands back in his pockets. I reminded him that if he got killed I’d take all the gold. He just smiled. He was absolutely not going to die in Mexico. I told him even if I believed in that bunkman I’d want to give it a little help. A God damned cannonball whooshed by and he didn’t blink, just kept smiling. It exploded some ways behind us and I got a little piece in the part that goes over the fence last, which isn’t as funny as it might sound, since it was going to be a month before I could sit proper.\nHarris did leave off being a target long enough to do some doctoring on me. While he was doing that a whole bunch of troops went by behind us, following the way the cavalry went earlier, and they had some nice comments for me. I even got to show my bare butt to Santa Anna, which I guess not too many people do and live.\nWe heard a lot of noise from their direction but couldn’t see anything because of the hills. We also stopped getting shot at, which was all right by me, though Harris seemed bored.\nSince then I’ve read everything I could get my hands on about that battle. The Mexicans had 1,500 to 2,000 men killed and wounded at Buena Vista, thanks to Santa Anna’s generaling. The Americans were unprepared and outnumbered, and some of them actually broke and ran—where even the American accounts admit that the greasers were all-fired brave. If we’d had a real general, a real battle plan, we would’ve walked right over the gringos.\nAnd you can’t help but wonder what would’ve happened. What if Zach Taylor’d been killed, or even just lost the battle? Who would the Whigs have run for president; who would have been elected? Maybe somebody who didn’t want a war between the states.\nAnyhow the noise died down and the soldiers straggled back. It’s a funny thing about soldiering. After all that bloody fighting, once it was clear who had won the Americans came out on the battlefield and shared their food and water with us, and gave some medical help. But that night was terrible with the sounds of the dying, and the retreat was pure hell. I was for heading north, forget the land grant, but of course Harris knew that he was going to make it through no matter what.\nWell, we were lucky. When we got to San Luis an aide to Pacheco decided we weren’t being too useful as spies, so we got assigned to a hospital detail, and stayed there while others went on south with Santa Anna to get blown apart at Cerro Gordo and Chapultepec. A few months later the war was over and Santa Anna was back in exile—which was temporary, as usual. That son of a bitch was president eleven times.\nNow this is where the story gets strange, and if somebody else was telling it I might call him a liar. You’re welcome to that opinion, but anyhow it’s true.\nWe had more than a thousand acres up in Mesilla, too much to farm by ourselves, so we passed out some handbills and got a couple dozen ex-soldiers to come along with their families, to be sort of tenant farmers. It was to be a fifty-fifty split, which looked pretty good on the surface, because although it wasn’t exactly Kansas the soil was supposedly good enough for maize and agave, the plant that pulque was made from. What they didn’t tell us about was the Apaches. But that comes later.\nNow the Mesilla Valley looked really good on the map. It had a good river and it was close to the new American border. I still had my American citizenship papers and sort of liked the idea of being only a couple of days away in case trouble started. Anyhow we got outfitted in San Luis and headed our little wagon train north by northwest. More than a thousand miles, through Durango and Chihuahua. It was rough going, just as dry as hell, but we knew that ahead of time and at least there was nobody shooting at us. All we lost was a few mules and one wagon, no people.\nOur grants were outside of the little town of Tubac, near the silver mines at Cerro Colorado. There was some irrigation but not nearly enough, so we planted a small crop and worked like beavers digging ditches so the next crop could be big enough for profit.\nOr I should say the greasers and me worked like beavers. Harris turned out not to have too much appetite for that kind of thing. Well, if I had eight thousand in gold I’d probably take a couple years’ vacation myself. He didn’t even stay on the grant, though. Rented a little house in town and proceeded to make himself a reputation.\nOf course Harris had always been handy with a pistol and a knife, but he also used to have a healthy respect for what they could do to you. Now he took to picking fights—or actually, getting people so riled that they picked fights with him. With his tongue that was easy.\nAnd it did look like he was charmed. I don’t know how many people he shot and stabbed, without himself getting a scratch. I don’t know because I stopped keeping regular company with him after I got myself a nasty stab wound in the thigh, because of his big mouth. We didn’t seek each other out after that, but it wasn’t such a big town and I did see him every now and then. And I was with him the night he died.\nThere was this cantina in the south part of town where I liked to go, because a couple of Americans, engineers at the mine, did their drinking there. I walked down to it one night and almost went right back out when I heard Harris’s voice. He was talking at the bar, fairly quiet but in that sarcastic way of his, in English. Suddenly the big engineer next to him stands up and kicks his stool halfway across the room, and at the top of his voice calls Harris something I wouldn’t say to the devil himself. By this time anybody with horse sense was grabbing a piece of the floor, and I got behind the doorjamb myself, but I did see everything that happened.\nThe big guy reaches into his coat and suddenly Harris has his Navy Colt in his hand. He has that little smile I saw too often. I hear the Colt’s hammer snap down and this little “puff” sound. Harris’s jaw drops because he knows as well as I do what’s happened: bad round, and now there’s a bullet jammed in the barrel. He couldn’t shoot again even if he had time.\nThen the big guy laughs, almost good natured, and takes careful aim with this little ladies’ gun, a .32 I think. He shoots Harris in the arm, evidently to teach him a lesson. Just a graze, doesn’t even break a bone. But Harris takes one look at it and his face goes blank and he drops to the floor. Even if you’d never seen a man die, you’d know he was dead by the way he fell.\nNow I’ve told this story to men who were in the Civil War, beside which the Mexican War looks like a Sunday outing, and some of them say that’s not hard to believe. You see enough men die and you see everything. One fellow’ll get both legs blown off and sit and joke while they sew him up; the next’ll get a little scratch and die of the shock. But that one just doesn’t sound like Harris, not before or after Doña Dolores’s prediction made him reckless. What signifies to me is the date that Harris died: December 30th, 1853.\nEarlier that year, Santa Anna had managed to get back into office, for the last time. He did his usual trick of spending all the money he could find. Railroad fellow named James Gadsden showed up and offered to buy a little chunk of northern Mexico, to get the right-of-way for a transcontinental railroad. It was the Mesilla Valley, and Santa Anna signed it over on the thirtieth of December. We didn’t know it for a couple of weeks, and the haggling went on till June—but when Harris picked a fight that night, he wasn’t on Mexican soil. And you can make of that what you want.\nAs for me, I only kept farming for a few more years. Around about ’57 the Apaches started to get rambunctious, Cochise’s gang of murderers. Even if I’d wanted to stay I couldn’t’ve kept any help. Went to California but didn’t pan out. Been on the move since, and it suits me. Reckon I’ll go almost anyplace except Mexico.\nBecause old Dolores liked me and she told my fortune many times. I never paid too much attention, but I know if she’d seen the sign that said I wasn’t going to die in Mexico, she would’ve told me, and I would’ve remembered. Maybe it’s all silliness. But I ain’t going to be the one to test it.\nOriginally published in Magazine of Fantasy and Science Fiction, October 1983.\nBorn in Oklahoma City, Oklahoma, Joe Haldeman took a B.S. degree in physics and astronomy from the University of Maryland, and did postgraduate work in mathematics and computer science. But his plans for a career in science were cut short by the U.S. Army, which sent him to Vietnam in 1968 as a combat engineer. Seriously wounded in action, Haldeman returned home in 1969 and began to write. By 1976, he had garnered both the Nebula Award and the Hugo Award for his famous novel The Forever War, one of the landmark books of the '70s. He has since won four more Hugo Awards, another four Nebula Awards, the James Tiptree, Jr. Award for his novel Camouflage, the SFWA Grandmaster Award, and has been inducted into the Science Fiction Hall of Fame. His other books include a mainstream novel, War Year, the SF novels Mindbridge, All My Sins Remembered, Worlds, Worlds Apart, Worlds Enough and Time, Buying Time, The Hemingway Hoax, Tools of the Trade, The Coming, 1969, Old Twentieth, The Accidental Time-Machine, Marsbound, and Starbound. His short work has been gathered in the collections Infinite Dreams, Dealing in Futures, Vietnam and Other Alien Worlds, None So Blind, A Separate War and Other Stories, and an omnibus of fiction and non-fiction, War Stories. His most recent books are a new science fiction novel, Earthbound, and a big retrospective collection, The Best of Joe Haldeman. Haldeman lives part of the year in Boston, where he teaches writing at the Massachusetts Institute of Technology, and the rest of the year in Florida, where he and his wife, Gay, make their home.", "source": "https://clarkesworldmagazine.com/haldeman_11_13_reprint/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Manifest Destiny by Joe Haldeman"}