{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nnedi Okorafor", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "kZF6Q7Wwjgzf6JPQtHsTdKnLw40=", "id": null, "license": null, "comments": "", "raw_text": "7640 words, novelette  The Book of Phoenix (Excerpted from The Great Book)  There is no book about me. Well, not yet. No matter. I shall create it myself; it’s better that way. To tell my tale, I will use the old African tools of story: Spoken words. They’re more trustworthy and they’ll last longer. And during shadowy times, spoken words carry farther than words typed or written. My beginnings were in the dark. We all dwelled in the darkness, mad scientist and specimen, alike. This was when the goddess Ani’s still slept, when her back was still turned. Before she grew angry at what she saw and pulled in the blazing sun. My story is called The Book of Phoenix. And it is short because it was . . . accelerated.  I’d never known any other place. The 13th floor of Tower 7 was my home. Yesterday I realized it was a prison, too. Granted, maybe I should have suspected something. The two-hundred-year-old marble skyscraper had many dark sides and I knew most of them. There were 39 floors, and on almost every one was an abomination. I was an abomination. I had read many books and this was clear to me. However, this place was still my home. Home: a. One’s place of residence. Yes, it was my home.  They gave me all the 3D movies I could watch, but it was books that did it for me. A year ago, they gave me an e-reader packed with 700,000 books of all kinds. When it came to information, I had access to everything I wanted. That was part of their research.  Research. This was what happened in Tower 7. There were similar towers around the world but Tower 7 was my home, so this one was the one I studied. I had several classified books on Tower 7. One discussed each floor and some of the types of abominations found on them. I’d listened to audios of the spiritual tellings of long dead African and Native American shamans, sorcerers and wizards. I’d read the Torah, the Bible, and the Koran. I studied The Buddha and meditated until I saw Krishna. And I read countless books on the sciences of the world. Carrying all this in my head, I understood abomination. I understood the purpose of Tower 7. Until yesterday.  In Tower 7, there was “transformative” genetic engineering, the in-vitro fertilization of organic robots, “rejuvenation” surgery on the ancient near-dead, the creation of weaponized weeds, the insertion and attaching of both mechanical and cybernetic parts to human bodies. There were people created in Tower 7, some were deformed, some were mentally ill, some were just plain dangerous, and none were flawless. Yes, some of us were dangerous. I was dangerous.  Then there was the tower’s lobby on the ground floor that projected a different picture. I’d never been down there but my books described it as an earthly wonderland, full of creeping vines covering the walls and small trees growing from artistically crafted holes in the floor. In the center was the main attraction. Here grew the thing that brought people from all over the world to see the Tower 7 Lobby (only the lobby; there were no tours of the rest of the building).  A hundred years ago, one of the landscapers planted a tree in the lobby’s center. On a lark, some scientists from the 9th floor emptied an experimental solution into the tree’s pot of soil. The substance was for enhancing and speeding up arboreal growth. The tree grew and grew. In a place where people thought like normal human beings, they would have uprooted the amazing tree and placed it outdoors. However, this was Tower 7 where boundaries were both contained and pushed. When the tree began touching the lobby’s high ceiling in a matter of weeks, they constructed a large hole so that it could grow through the second floor. They did the same for the third, fourth, fifth. The great tree has since earned the name of “The Backbone” because it grew through all 39 of Tower 7’s floors.  My name is Phoenix. I was mixed and grown in a lab on the 13th floor. One of my doctors thinks my name came from the birthplace of my egg’s donor. I’ve looked it up. Phoenix, Arizona is the full name of the place. However, from what I’ve read about my floor, even the scientists who forced my existence don’t know the names of donors. So, I doubt this. I think they named me Phoenix because of what I was, an “accelerated organism.” I was born two years ago but I looked, behaved and felt like a forty-year-old woman. My doctors said the acceleration would stop now that I was “matured”. To them, I was like a plant they grew for the sake of harvesting information.  Who do I mean by “them”, you must wonder? All of THEM, the “Big Eye”—the Tower 7 scientists, lab assistants, lab technicians, doctors, administrative workers, guards and police. We of the tower called them “Big Eye” because they watched us. All the time, they watched us, though not closely enough to prevent the inevitable.  I could read a 500-page book in two minutes. My brain absorbed the information and stories like a sponge. Up until two weeks ago, aside from mealtimes, looking out the window, running on my treadmill, and meetings with doctors, I spent my days with my e-reader. I’d sit in my room for hours consuming words upon words that became images upon images, ideas upon ideas. Now they gave me paper-made books, removing the books when I finished them. I liked the e-reader more. It took up less space and I could reread things when I wanted.  I stared out the window watching the cars and trucks below and the other skyscrapers across from me as I touched a leaf of my hoya plant. They’d given the plant to me five days ago and already it was growing so wildly that it was creeping across my windowsill and had wrapped around the chair I’d put there. It had grown two feet overnight. I didn’t think they’d noticed. No one ever said anything about it. I realize now that they had noticed. The plant was not a gesture of kindness; it was just part of the research. They didn’t really care about me. But Saeed cared about me.  Saeed is dead, Saeed is dead, Saeed is dead, I thought over and over, as I caressed one of my plant’s leaves. I yanked, breaking the leaf off. Saeed, my only friend. I crumpled the leaf in my restless hand; its green, earthy smell might as well have been blood.  Yesterday Saeed had seen something terrible. Not long afterwards, he’d sat across from me during dinner-hour with eyes wide like boiled eggs, unable to eat. He couldn’t give me any details. He said no words could describe it.  “What does your heart tell you about this place?” he’d earnestly asked.  I’d only shrugged, frustrated with him for not telling me what he’d seen that was so awful.  He leaned forward, lowering his voice. “You read all those books . . . why don’t you feel rebellion? Don’t you ever dream of getting out of here? Away from all the Big Eye?”  “Rebellion against whom?” I whispered, confused.  He laughed bitterly, sat back and shook his head. He took my hand, squeezed it and let it go. “Eat your jallof rice, Phoenix.”  I tried to get him to eat his crushed glass. This was his favorite meal and it bothered me to see him push his plate away. But he wouldn’t touch it. Before we returned to our separate quarters, he asked for my apple. I assumed he wanted to paint it. He always liked to paint when he was depressed. I’d given it to him without a thought and he’d slipped it into his pocket. The Big Eye allowed it, though they frowned upon taking food from the dining room, even if you didn’t plan to eat it.  His words didn’t touch me until nighttime when I lay in my bed. Yes, somewhere deep, deep in my psyche I did wish to get out of the tower and see the world, be away from the Big Eye. I wanted to see those things that I saw in all the books I read. “Rebellion,” I whispered to myself.  They told me the news in the morning during breakfast-hour. I’d been sitting alone looking around for Saeed. The others, the woman with the twisted spine who could turn her head around like an owl, the man who never spoke with his mouth but always had people speaking to him, the three women who all looked and sounded alike, the bushy-bearded man who looked like a wizard from a novel, the baboon who spoke in sign language, the woman whose sweater did not hide her four large breasts, the two men joined at the hip who were always randomly laughing, the woman with the lion claws and teeth, these people spoke to each other and never to me. Only Saeed spoke to me.  One of my doctors sat facing me. The African-looking one who wore the shiny black wig made of synthetic hair, Bumi. They always had her deal with me when there was upsetting news. My entire body tightened. She touched my hand and I pulled it away. She smiled sympathetically and told me a terrible thing. Saeed hadn’t drawn the apple. He’d eaten it. And it killed him. My mind went to one of my books. The Bible. I was Eve and he was Adam.  I could not eat. I could not drink. I would not cry. Not in the dining hall.  Hours later, I was in my room lying on my bed, eyes wet, mind reeling. Saeed was dead. I had skipped lunch and dinner, but I still wasn’t hungry. I was hot. The scanner on my wall would start to beep soon. Then they would come get me soon. For tests. I shut my eyes, squeezing out tears. They evaporated as they rolled down my hot cheeks. “Oh God,” I moaned. The pain of losing him burned in my chest. “Saeed. What did you see?”  Saeed was human. More human than me. I met him the first day they allowed me into the dining hall with the others. I was one year old; I must have looked twenty. He was sitting alone about to do something insane. There were many others in the room who caught my eye. The two conjoined men were laughing hard at the sight of me. The baboon was jumping up and down while rapidly signing to the woman with lion claws and teeth. However, Saeed had a spoon in his hand and a bowl full of broken glass before him. I stood there staring at him as others stared at me. He dug the spoon into the chunks of glass and put it in his mouth. I could hear him crunching from where I stood. He smiled to himself, obviously enjoying it.  Driven by sheer curiosity, I walked over and sat across from him with my plate of spicy doro wat. He eyed me with suspicion but he didn’t seem angry or mean, at least not to the best of my limited social knowledge. I leaned forward and asked what was on my mind, “What’s it like to eat that?”  He blinked, surprised. Then he grinned. His teeth were perfect—white, shiny, and shaped like the teeth in drawings and doctored pictures in magazines. Had they removed his original teeth and replaced them with ones made of a more . . . durable stuff? “The taste is as soft and delicate as the texture is crunchy. I’m not in pain, only pleasure,” he said in a voice accented in a way that I’d never heard. But then again, the only accents I’d ever heard were from the Big Eye doctors and guards.  “Tell me more,” I said.  After that, Saeed and I became friends. I loved words and he needed to spill them. He could not read, so I would tell him about what I read, at least in the hours of breakfast, lunch and dinner. He was from Egypt where he had been an orphan who never went hungry because he could always find something to eat. Rotten rice, date pits, even the wooden skewer sticks of kebabs, he had a stomach like a goat. They brought him to the tower when he was ten, nine years ago. He never told me exactly how or why they made him the way he was. It didn’t matter. What mattered was that we were who we were and we were there.  Saeed told me of places I had never seen with my own eyes. He used the words of a poet who used his tongue to see. Saeed was an artist with his hands, too. He had the skill of the great painters I read about in my books. He most loved to draw those foods he could no longer eat. Human food. Portraits of loaves of bread. Bowls of thick egusi soup and balls of fufu. Bouquets of lamb and beef kebabs. Fried eggs with white cheese. Plates of chickpeas. Pitchers of orange juice. Piles of roasted corn. They allowed him to bring the paintings to mealtime for everyone to view. I guess even we deserved the pleasures of art.  Saeed could survive on glass, metal shavings, crumbles of rust, sand, dirt, those things that would be left behind if human beings finally blew themselves up. However, eating a piece of bread would kill him as eating a big bowl of sharp pieces of glass would kill the average human being.  He took my apple and that night, he ate it. Then his stomach and intestines hemorrhaged and he was dead before morning. I never got to tell him what was happening to me. It might have given him hope; it would have reminded him that things would change. I wiped a tear. I loved Saeed.  As grief overwhelmed me for the first time in my life, I pressed a hand against the thick glass of my window. I’d never been outside. I wanted to go outside. Saeed had escaped by dying. I wanted to escape, too. If he wasn’t happy here, then neither was I.  I wiped hot sweat from my brow. My room’s scanner began to beep as my body’s temperature soared. The doctors would be here soon.  When it first started to happen two weeks ago, only I noticed it. My hair started to fall out. I am an African by genetics, my hair was very coily and my skin was very, very dark. They kept my hair shaven low because neither they nor I knew what to do with it when it grew out. I could never find anything in my books to help. They didn’t care for style in Tower 7, anyway . . . although the woman down the hall had very long silky white hair and Big Eye lab assistants came by every two days to help her brush and braid it . . . despite the fact that the woman had the teeth and claws of a lion.  I was sitting on my bed, looking out the window when I suddenly grew very hot. For the last few days, my skin had been dry and ashy no matter how much hydrated water they gave me to drink. Doctor Bumi brought me a large jar of shea butter and applying it soothed my skin to no end. However, this day, hot and feverish, my skin seemed to dry as if I were in a desert.  I felt beads of sweat on my head and when I rubbed my short, short hair, it wiped right off, hair and sweat alike. I ran to my bathroom, quickly showered, washing my head thoroughly, toweled off and stood before the large mirror. I’d lost my eyebrows, too. But this wasn’t the worst of it. I rubbed the shea butter into my skin to give myself something to do. If I stopped moving, I’d start crying with panic.  I don’t know why they gave me such a large mirror in my bathroom. Large and round, it stretched from wall to wall. Therefore, I saw myself in full glory. As I slathered the thick yellow nutty-smelling cream onto my drying skin, it was as if I was harboring a sun deep within my body and that sun wanted to come out. Under the dark brown of my skin, I was glowing. I was light.  I pulsed, feeling a wave of heat and slight vibration within my flesh. “What is this?” I whispered, scurrying back to my bed where my e-reader lay. I wanted to look up the phenomena. In all my reading, I had never read a thing about a human being, accelerated or normal, heating up and glowing like a firefly’s behind. The moment I picked the e-reader up, it made a soft pinging sound. Then the screen went black and began to smoke. I threw it on the floor and the screen cracked as it gently burned. My room’s smoke alarm went off.  Psss! The hissing sound was soft and accompanied by a pain in my left thumbnail. It felt as if someone stuck a pin into it. “Ah!” I cried, instinctively pressing on my thumb. As I held my hand up to my eyes, I felt myself pulse again.  There was a splotch of black in the center of my thumbnail like old blood but blacker. Burned flesh. All specimen, creature, creation in the building had a diagnostics chip implanted beneath his, her or its fingernail, claw, talon or horn. I’d just gone off the grid.  Not thirty seconds passed before they came bursting into my room with guns and syringes at ready, all aimed at me as if I were a wild rabid beast destroying all that they had built.  “Get down! DOWN!” they shouted. One man grabbed me, probably with the intent of throwing me on the bed so he could cuff me. He screamed, staring at his burned, still smoking hand. Someone shot me in the leg. It felt like someone had kicked my leg with a metal foot. I sunk to the floor, pain washing over me like a second layer of more intense heat. I would have been done for if someone else had not shouted for the others to hold their fire.  Thankfully, I healed fast and the bullet had gone straight through my leg. If it hadn’t, I don’t know what would have happened due to my extreme body temperature. One minute I was staring with shock at the blood oozing from my leg. Then next, I blacked out. I woke in a bed, my body cool, my leg bandaged. When they returned me to my room, the scanner was in place to monitor me since I could not hold an implant. They replaced my bed sheets with a heavy heat-resistant sheet similar in material to my new clothes. The carpet was gone, too. For the first time, I saw that the floor beneath the carpet was solid whitish marble.  When I grew hot and luminous like this, electronics died or exploded in my hands. This was why they started giving me paper books. They were difficult to read, as I couldn’t turn the pages as quickly as I could with the e-reader. And the paper books they had were limited and old. And they could monitor what I was reading. Although now I realize with the e-reader they were probably monitoring my choices, too.  I didn’t tell Saeed about the heating and glowing because at the time I didn’t want to worry him. I enjoyed our talks so much. I wish I had told him.  The door slid open and my doctors came in, Debbie and Bumi. I took a deep breath to calm myself. When I was calm, though the heat did not go away, it decreased, as did the glow.  “How do you feel?” Bumi asked, as she took my wrist to check my pulse. She hissed, dropping it.  “Hot,” I said.  She glared at me and I shrugged thinking something I had not thought until Saeed was dead— You should have asked first.  “Open,” Debbie said, placing the heavy-duty thermometer into my mouth.  I saw these two women every day. I knew their names, nothing more.  “She’s not glowing that brightly,” Bumi said, typing something onto her handheld. I resisted the urge to grab it and hold it in my hands until it exploded. Saeed was dead because of these people. I steadied myself, thinking of the cool places sometimes described in the novels I read. I once read a brief story about a man who froze to death in a forest. I thought about that.  “It might just be menopause approaching,” Bumi said. “I believe the two factors are correlated.”  I tuned out their talk and focused on my own thoughts. Escape. How? What would they do to me? What did Saeed see? He said it was something on this floor. My internal temperature was 130 degrees, but the temperature of my skin was 220. They couldn’t take my blood pressure because the equipment would melt.  “We need to take her to the lab,” Debbie said.  Bumi nodded. “As soon as the scanner says she’s reached 300 degrees. We don’t want her any higher or things around her will start to ignite.”  They left. I paced the room. Restless. Angry. Distraught. They would be back soon.  How am I going to get out of here, I wondered. As if to answer my question, Mmuo walked into my room. He came through the wall across from my bed. My heart nearly jumped from my chest.  “Did you hear?” he asked, sitting on my bed.  I blinked, feeling the rush of sadness all over again. He was Saeed’s friend, too. “Yes,” I said.  “I’m sorry, Phoenix.”  My face was wet and drying with sweat. “I’m getting out of here,” I declared.  Mmuo grinned but it quickly turned to a frown. “What is wrong with you? I can feel you from here,” he asked.  “I think it has something to do with how they made me. It’s been happening for two weeks and it’s getting worse.”  We looked at each other, silent. I knew we were thinking the same thing but neither he nor I wanted to speak it. If we spoke of my name, I didn’t think I’d be able to move, let alone run.  “Yes, that would make sense,” he said.  His full name was Uzochukwu D’nnmma but he called himself Mmuo, which meant spirit in a Nigerian language. He was a hero to all those who were created or altered in Tower 7. Like Saeed, Mmuo had been taken from Africa. He said he was from “the jungles of Nigeria.“ I did not believe he was from any jungle. He spoke like a man who had known skyscrapers, office buildings and digital television. He knew how to disable the security doors on several of the floors and was known for causing trouble throughout the building. Not that he really needed to do so to get around the tower. Mmuo could walk through walls. The only walls he could not pass through were the walls that would get him out of Tower 7. Mmuo could not escape; obviously his abilities were created by Tower 7 scientists.  Mmuo was a tall thin man with skin the color of and as shiny as crude oil. He never wore clothes, for clothes could not pass through the walls with him. He stole what food he needed from the kitchens. He was the only person/creature who’d successfully escaped the Big Eye’s clutches.  Why Tower 7’s Big Eye tolerated him, I do not know. My theory is that they simply could not catch him. And since he was contained, they accepted the trouble he occasionally stirred up. Most of those in the tower were too isolated and damaged to be much trouble if freed, anyway.  “It looks like your skin is nothing but a veil over something greater,” he said, after an appraising look. It was something Saeed would have said and the thought made my heart ache again.  “Can you open the door?” I finally said. “I . . . I want to see what is down the hall, near Saeed’s room.”  Mmuo met my gaze and held it.  I frowned. “What did Saeed see?” I asked.  He only looked away.  “Show me,” I said, suddenly wanting to sob. “Then help me escape.”  He moved close to me and I was sure he was going to hug me.  “Don’t touch me,” I said. “You’ll . . . ”  He raised a hand up and made to slap me across the face. “Don’t move,” he said. His hand passed right through my head. I felt only the slightest moment of pressure and there was a sucking sound.  “Wha . . . ”  “Can you hear me?” I heard him loudly say through what sounded like a microphone. I looked around.  “Shhh! They’ll hear you!” I hissed. I frowned. His lips hadn’t moved.  “No,” he said. He held his finger to his lips for me to quiet down and grinned, his yellow-white teeth shining, his black skin shining, too. “They won’t. You are hearing this in your head.  “Not even the Big Eye know I can do this,” he said aloud, but lowering his voice. “Whatever they did to make me able to pass through walls, I can pass it into people and they can hear me, until the tiny nanomites are sweated from their skin.”  “I did this to a little boy on the fifth floor. He had a contagious cancer, so they kept him in isolation for tests. Hearing me talk to him from wherever I was kept him sane. At least, until he died.”  His disease could have killed you, though, I thought.  He started to descend through the floor. “Fifteen minutes,” he said in my head, then he was gone.  I whipped off my pants and t-shirt and threw on a white dress they’d recently given me that was made of heat-resistant thin plastic. The dress was long but light and allowed me to move very freely. I didn’t bother with shoes. Too heavy.  For a moment, I had a brief flash in my mind of actually stepping outside. Into the naked sunlight. I could do it. Mmuo would help me. He and I would both escape. I felt a rush of hope, then a rush of heat. The scanner on my wall beeped. I had reached over 300 degrees.  Just before the door slid open, I had the sense to spread some shea butter on my skin. I ran out of my room.  “If you want to see, turn right and then go straight. Do it quickly.”  I jogged, my feet slapping the cool marble floor. The hallway was quiet and empty, and soon I was in a part of my floor that I had never graced. The side where they kept Saeed. His prison, I thought.  I crossed a doorway and the floor here was carpeted, plush and red. I paused, looking down. I had never seen red carpet. Before they took it out, the carpet in my quarters had been black and flat. I wanted to kneel down and run my hands over it. I knew it would feel so soft and fluffy.  “See what you must but you have to make it to the elevator in two minutes,” Mmuo’s voice suddenly said into my head. “Go down the hall and turn left. You will see it. Hurry.”  “Ok,” I said aloud. But he could not hear me. One-way communication. I ran down the red hallway. Through glass windows and doors, I could see lab assistants and scientists in labs. Each large room was partitioned by a thick wall. There was bulky equipment in most of the rooms. If I were careful, no one would notice me. After sneaking past three labs, I saw the one that Saeed saw. It had to be. I stopped, staring and moaning deep in my throat. This lab was much bigger than the others and ten black cameras hung from its high white ceiling.  There were two wall-sized sleek grey machines on both sides of the room. I could hear them humming. Powerful. Between them, the world fell away to . . . another world where it was daytime and all that was happening was perfectly bluntly brutally visible. There were old vehicles, trucks from long long ago, boxy, ineffective and weak. But strong enough to carry huge loads of cargo to dump into a deep pit. And that cargo consisted of human bodies. Hundreds of them. Dead. Not Africans. These dead people had pinkish pale skin and thin straight-ish hair like most of the Big Eye. When was this? Where was this? Why were the Big Eye scientists just standing there watching with their clipboards and ever-observing eyes?  It was not like watching a 3D movie. Even the best ones could never look this . . . true. Bodies. And I could smell them. The whole hallway reeked with their rot and feces and bile and the smoke of the trucks. My brain went to my books and recalled where I had seen this before. “Holocaust,” I whispered, fighting the urge to turn to the side and vomit. I shut my watering eyes for a moment. I took a deep breath and nearly gagged on the stench. I opened my eyes.  This genocide happened during one of the early world wars. The Germans killed many of these people because they felt they were inferior or a threat or both. The book I read spoke as if wiping them out was the right thing to do. It certainly looked wrong to me. Were these Big Eye looking through time? Is this all they could do? Look? And why this time? For a moment, the portal disappeared and there was lots of scrambling, adjusting machines, pushing buttons, cursing. And then the portal reappeared showing the same activities, in the same time period in the same place. Happening.  I could feel the surge of heat in my body. Like a deep heart beat of crimson flames. I shuddered and felt it ripple over every surface of my skin. But I couldn’t move. Saeed had probably stood here just like this, too. Acrid smoke stung my eyes. My feet were burning the red carpet. A fire alarm sounded. I ran.  The elevator was open. It was empty. I ran in and it quickly closed behind me. I wished Mmuo would say something. If it went up, I was caught. If it went nowhere, I was caught. If it went down, I might be caught, but I might escape, too. I shut my eyes and whispered, “Go down, go down, please, go down. Have to get out!” Sweat beaded and evaporated all over my confused body and the elevator quickly began to feel humid.  If I hadn’t rubbed all that shea butter on my skin at the last minute, I’d have been in horrible pain, my skin drying and probably cracking. I was hot like the sun, there was a ringing in my ears, as if my own body had an alarm and it was going off, too. I looked at my hands. They were glowing a soft yellow. My entire body was glowing through my dress.  The elevator jerked upward. I grabbed the railing, pure terror shooting through me. At least, I would make it outside. I hoped I could take two breaths before they caught me. I sunk to the floor. Saeed was dead and I was still trapped. Tears dribbled from the corners of my eyes and hissed as they evaporated down my cheeks.  The elevator jerked again. “Sorry about that,” I heard Mmuo say in my head. He sounded distant. The elevator started moving down. I jumped up, grinning. I still had a chance. A louder alarm started to go off. They’d realized I was missing. “I can get you to nine,” he said. His voice was fading and I had to strain to hear it. “Two stairways in there. Run to the emergency one on the other side of the greenhouse, straight ahead when the doors open. You’ll be on the side of the greenhouse, just go straight ahead! Do NOT go near the center! There’s . . . ” His voice faded away.  Had my heat burned away his nanomites? Probably. As the elevator flew down to the ninth floor, my feet burned the elevator floor. It came to a sudden stop and the doors opened. The blare of the Tower 7 alarm assaulted my ears but the most beautiful site I’d ever seen caressed my eyes. An expansive room full of trees, bushes, flowers, vines. In pots, on shelves, tangled within each other. I could see the city through the windows on my left. The sky was the deep rose of evening. I started quickly walking down the narrow path before me. Moss grew on the sides of trees. The air smelled green, fragrant, soily, I had never smelled anything like it.  I heard a rush of footsteps from amongst the plants to my right. Between the foliage, I could see them. Big Eye guards. In armor with shields, with guns.  “Hey!” one of them yelled, spotting me. All their guns went up. “Put your hands up. We will not hurt you.” The one speaking was a woman. I could see her clearly. She was short with long brown straight hair. She had pale skin and a hard voice.  Behind me I could hear the elevator rumbling. I still didn’t move. Saeed was dead. There was nothing for me here. I was two years old and I was forty years old. The marble beneath my feet absorbed my heat.  “Please, put your hands up,” the woman pleaded. “You know what you are. We can stabilize you.” She paused, obviously considering how much to tell me. I knew enough, though. Saeed was dead and it was all clear to me now.  “You’re a weapon,” the woman admitted. “If you wanted to know, now you know. I’m only here to help. You have to trust me. This wasn’t supposed to happen, you being like this. Please, let us help you.”  I heard the elevator doors opening just as I felt the light burst from me. There was warmth that started at my feet. It rolled up to my chest and pulsed out with a wave of heat. My shoulders jerked back and I stumbled to the side, getting a glimpse behind me. If I had blinked I still wouldn’t have missed it. My skin prickled as my glow became a light green shine. The light steadily radiated from me, bathing every plant in the room. The guards behind me in the elevator and on the far right side of the room all ducked down and for a moment it was quiet enough where you could hear it. All the plants began to grow. Snapping, pulling, unfurling, creeping. Thick vines and even tree roots quickly crept, stretched and blocked the elevator door. Leaves, branches and stems grew so thick around the guards to my right that they were blocked from view. They didn’t know I could do this.  The entire greenhouse swelled and flooded with foliage. Except a few steps ahead to my right. There was what I could only call a tunnel through the plants. It diagonally passed the cowering Big Eye. I ran into it just as the guards behind and to my right began to shoot toward where I’d initially been. Were they shooting through the plants or shooting at me, I do not know. And in many ways these two things were one of the same.  Mmuo had said to go forward to find the doorway. But I lost all sense of direction. So when I ended up standing before the giant glass dome I had no clue which way to run. My first thought was of the same book that spoke of the treacherous apple of knowledge. The Bible. Except that the man with enormous wings was not held up by any wooden cross. He was suspended in mid-air with his arms out and his legs tied together. His eyes were closed. His brown-feathered wings were stretched wide.  He was naked, his bronze-skinned body, muscled and very, very tall, at least compared to my six feet. He had Arab facial features like Saeed and a crown of wooly hair like mine. He was magnificent. Behind the glass dome was a rough wooden wall. The Backbone.  Behind me, I could hear them coming. Hacking and shooting through the plants and calling my name. I wasn’t going to get out. I walked up to the glass and placed a hot hand on it. The glass was thick and very cool. Was there even air in there? Was that how they held him? Was it like being in outer space? What was space like for a creature made to fly?  His eyes opened. I gasped and jumped back. They were brown and soft kind eyes.  “Oh my God, Phoenix! Step BACK!” one of the guards screamed, shoving aside a bush. I noticed the guard did not point his gun. Nor did the others who emerged beside him. I looked back at the man with wings. He was looking right at me, no expression on his face. I was surrounded by guards, all begging me to step away, pleading that this creature was unique and dangerous. However, none of them came to capture me. I didn’t move.  Seeing the Big Eye cower, seeing their fear and sheer horror had a strange effect on me. I felt powerful. I felt lethal. I felt hopeful, though all was hopeless. I turned to the caged man and my hope evolved into rage. Even he was a prisoner here. I vowed that if I didn’t get out, at least he would.  For the first time I did it voluntarily. I was already so hot and I grew hotter when I reached into myself, into all that I was, all that I had been and all that I would be, I reached in and drew from my source. Then I turned to a nearby tree and let loose a pulse of light. I sighed as it left me, feeling relief. Immediately the tree’s roots began to buckle and creep toward the glass cage.  CRASH! They easily forced their way through and the rest of the dome began to crack in several places. The Big Eye turned and ran for their lives. I didn’t bother running. There was no better way to die. He burst through, knocking me aside with the intensity of his wake. Into the now dense foliage of the greenhouse. I saw none of it, but I heard and smelled it. Wet tearing sounds, screams, ripping, snapping, choking, not one gun fired. The air smelled like torn leaves and blood. It was still happening when I spotted the stairway between the plants and ran into it. I ran down and down flights and came to a heavy open door and entered the lobby.  For a moment, even after all that I had seen, I forgot what I was doing. The sight took my breath away. Tower 7’s lobby was more spectacular than I’d ever imagined. No words could make up for actually seeing this place. This space. I had never been in such a space. The ceiling was so high and the marble walls were draped with gorgeous flowering vines, the small trees and plants growing through the soil-filled holes in the floor. I fought not to fall to my knees. There was the base of The Backbone. Its trunk had to be over thirty feet in diameter.  I was dizzy. I was burning up. I was amazed. I was exhausted. There was a freed angel beast massacring its captors nine floors above. I could hear more Big Eye guards coming down the stairwell. The alarm was blaring and the lobby was empty . . . except for a lone figure standing near the exit doors. He was grinning. He’d been trying to get to this very spot for nine years and my escape gave him the chance.  “Hurry,” Mmuo cried. “Phoenix, MOVE!” I heard them burst through the stairway. I was running. I dodged small trees, scrambled around benches and leapt over plants. The door was yards away. I was going to make it. Outside, people walking by stopped to look.  Then I saw the guards come running onto the tower’s wide plaza. They seemed to come from all directions. They shoved gaping people aside. They pulled up people who were sitting on benches enjoying the lovely evening. Then they formed a line blocking the exit and stood there, guns to their chests. I ran to Mmuo and would have given him a hug, if it weren’t for my heat. We’d both almost made it.  “Go,” I told him.  “I’m sorry,” he said.  “For what?” I was having trouble thinking straight and I could smell the floor burning beneath me. I didn’t know marble could burn. “Saeed would have been proud. I am proud. I set an angel free.”  His eyebrows went up. “You . . . ”  “Go!” I said, looking at the approaching Big Eye coming from the stairwell. They were flooding from doorways and were coming down an escalator on the other side of the lobby. “Don’t ever let them catch you!”  He sunk through the floor and was gone.  I stood tall. There were over a hundred of them. Men and women armed with the guns I had seen them carrying all my life. No Big Eye guard went anywhere in the tower without them. I knew how they sounded, too. Nearly silent. I had been hearing shots fired all my life, too. For a multitude of reasons, but always with the same result. Something or someone was dead or severely injured. “Protect the scientist from the subject.” “Observe and learn.” “We will be better for it.” “For the Research.” I was taking all the pieces I had read and finally putting them together. The Big Eye crowded around me, twitchy with anticipation as if I were evil. After all I had done, to them, I guess I was evil. Or crazy.  I held up my hands, feeling myself utterly shining. The light bloomed from my body. The release felt glorious and I moaned with relief. Then more sighing than speaking, I said, “I give . . . ”  They opened fire and it was as if I were punched with steel fists in every part of my body—chest, neck, legs, arms, abdomen, face. I was blown back and my vision went red yellow. I lay on my back. Everything was wet, the smell of smoke in the one nostril I had left. Smoke and . . . the perfume of The Backbone. I was looking at it, gazing at how it reached, up, up, up, through the high marble ceiling, through the 39 floors above. Into the sky. Reaching for the sky.  I felt the radiance burst from me, warm, yellow, light, plucked from the sun and placed inside me like a seed until it was ready to bloom. It bloomed now and the entire lobby was washed. The Big Eye covered their faces and dropped their guns. A few ran to the stairwell, others to the far side of the lobby. Most of them ran past my mangled body and out of the building. Those ones must have known what would happen next.  I knew. I was burning as the light pulsated and pulsated from me there on the floor. My body convulsed with it as my clothes burned and then my flesh. There was no pain. My nerves were burning.  My light shined on the plants and tiny trees of the lobby and they began to grow wildly, stirred and amazed with life. Vines stretched, lengthened, thickened. Flowers twisted open. Pollen puffed the air sweet. Leaves unfolded and widened. The stone floors were covered with green yellow white brown black, the strongest roots cracking its foundation.  My light shined on the great tree that was The Backbone. Its roots groaned as they shifted, coiled, expanded, and caused the entire portion of the floor around its roots to buckle and fall apart. The tree’s colossal trunk twisted this way and that, shrugging off the building that was its shackle. Chunks of the floors above began to crash down around me. I was ashes being scattered by vines and roots when Tower 7 fell.  Several of the buildings beside the tower fell, too. The Backbone stood tall, stretching its branches and opening its enormous leaves over buildings and streets. At its base, a small lush jungle sprung from the rubble of Tower 7. All this in the middle of the city. Helicopters hovered, news crews streamed footage live, people gaped from afar. When the debris settled, there was a moment, where my brilliant light shined into the darkness, for it was now nighttime. The news cameras recorded the winged man flying out of the rubble but not much else lived, except the man who could walk through walls. Mmuo walked out of The Backbone’s trunk and stood before it. “This is what you all deserve!” he shouted, shaking his fist at the eyes of the hovering cameras. Then he sunk into the ground and was never seen again.  No one in the city would approach the ruins of Tower 7. They sat for seven days, a pile of those things Saeed used to eat: rubble, glass, metal and . . . ash. And then I realized the meaning of my name. Nnedi's novels include Lagoon (finalist for Best Novel in the British Science Fiction Association Award), Who Fears Death (winner of the World Fantasy Award for Best Novel and Le Prix Imaginales for Best Translated Novel), Akata Witch (an Amazon.com Best Book of the Year), Zahrah the Windseeker (winner of the Wole Soyinka Prize for African Literature), and The Shadow Speaker (winner of the CBS Parallax Award).  Her short story collection Kabu Kabu was a Publisher's Weekly Best Book for Fall 2013. Her adult novel The Book of Phoenix (a prequel to Who Fears Death) was released in May and received rave reviews from The New York Times, The Chicago Tribune and more. Nnedi's novella, Binti her first story set in outer space recently won both the 2016 Nebula Award and the 2016 Hugo Award for Best novella. Lastly, her much anticipated young adult novel Akata Witch 2: Breaking Kola will be released in 2016.", "text": "7640 words, novelette\nThe Book of Phoenix (Excerpted from The Great Book)\nThere is no book about me. Well, not yet. No matter. I shall create it myself; it’s better that way. To tell my tale, I will use the old African tools of story: Spoken words. They’re more trustworthy and they’ll last longer. And during shadowy times, spoken words carry farther than words typed or written. My beginnings were in the dark. We all dwelled in the darkness, mad scientist and specimen, alike. This was when the goddess Ani’s still slept, when her back was still turned. Before she grew angry at what she saw and pulled in the blazing sun. My story is called The Book of Phoenix. And it is short because it was . . . accelerated.\nI’d never known any other place. The 13th floor of Tower 7 was my home. Yesterday I realized it was a prison, too. Granted, maybe I should have suspected something. The two-hundred-year-old marble skyscraper had many dark sides and I knew most of them. There were 39 floors, and on almost every one was an abomination. I was an abomination. I had read many books and this was clear to me. However, this place was still my home. Home: a. One’s place of residence. Yes, it was my home.\nThey gave me all the 3D movies I could watch, but it was books that did it for me. A year ago, they gave me an e-reader packed with 700,000 books of all kinds. When it came to information, I had access to everything I wanted. That was part of their research.\nResearch. This was what happened in Tower 7. There were similar towers around the world but Tower 7 was my home, so this one was the one I studied. I had several classified books on Tower 7. One discussed each floor and some of the types of abominations found on them. I’d listened to audios of the spiritual tellings of long dead African and Native American shamans, sorcerers and wizards. I’d read the Torah, the Bible, and the Koran. I studied The Buddha and meditated until I saw Krishna. And I read countless books on the sciences of the world. Carrying all this in my head, I understood abomination. I understood the purpose of Tower 7. Until yesterday.\nIn Tower 7, there was “transformative” genetic engineering, the in-vitro fertilization of organic robots, “rejuvenation” surgery on the ancient near-dead, the creation of weaponized weeds, the insertion and attaching of both mechanical and cybernetic parts to human bodies. There were people created in Tower 7, some were deformed, some were mentally ill, some were just plain dangerous, and none were flawless. Yes, some of us were dangerous. I was dangerous.\nThen there was the tower’s lobby on the ground floor that projected a different picture. I’d never been down there but my books described it as an earthly wonderland, full of creeping vines covering the walls and small trees growing from artistically crafted holes in the floor. In the center was the main attraction. Here grew the thing that brought people from all over the world to see the Tower 7 Lobby (only the lobby; there were no tours of the rest of the building).\nA hundred years ago, one of the landscapers planted a tree in the lobby’s center. On a lark, some scientists from the 9th floor emptied an experimental solution into the tree’s pot of soil. The substance was for enhancing and speeding up arboreal growth. The tree grew and grew. In a place where people thought like normal human beings, they would have uprooted the amazing tree and placed it outdoors. However, this was Tower 7 where boundaries were both contained and pushed. When the tree began touching the lobby’s high ceiling in a matter of weeks, they constructed a large hole so that it could grow through the second floor. They did the same for the third, fourth, fifth. The great tree has since earned the name of “The Backbone” because it grew through all 39 of Tower 7’s floors.\nMy name is Phoenix. I was mixed and grown in a lab on the 13th floor. One of my doctors thinks my name came from the birthplace of my egg’s donor. I’ve looked it up. Phoenix, Arizona is the full name of the place. However, from what I’ve read about my floor, even the scientists who forced my existence don’t know the names of donors. So, I doubt this. I think they named me Phoenix because of what I was, an “accelerated organism.” I was born two years ago but I looked, behaved and felt like a forty-year-old woman. My doctors said the acceleration would stop now that I was “matured”. To them, I was like a plant they grew for the sake of harvesting information.\nWho do I mean by “them”, you must wonder? All of THEM, the “Big Eye”—the Tower 7 scientists, lab assistants, lab technicians, doctors, administrative workers, guards and police. We of the tower called them “Big Eye” because they watched us. All the time, they watched us, though not closely enough to prevent the inevitable.\nI could read a 500-page book in two minutes. My brain absorbed the information and stories like a sponge. Up until two weeks ago, aside from mealtimes, looking out the window, running on my treadmill, and meetings with doctors, I spent my days with my e-reader. I’d sit in my room for hours consuming words upon words that became images upon images, ideas upon ideas. Now they gave me paper-made books, removing the books when I finished them. I liked the e-reader more. It took up less space and I could reread things when I wanted.\nI stared out the window watching the cars and trucks below and the other skyscrapers across from me as I touched a leaf of my hoya plant. They’d given the plant to me five days ago and already it was growing so wildly that it was creeping across my windowsill and had wrapped around the chair I’d put there. It had grown two feet overnight. I didn’t think they’d noticed. No one ever said anything about it. I realize now that they had noticed. The plant was not a gesture of kindness; it was just part of the research. They didn’t really care about me. But Saeed cared about me.\nSaeed is dead, Saeed is dead, Saeed is dead, I thought over and over, as I caressed one of my plant’s leaves. I yanked, breaking the leaf off. Saeed, my only friend. I crumpled the leaf in my restless hand; its green, earthy smell might as well have been blood.\nYesterday Saeed had seen something terrible. Not long afterwards, he’d sat across from me during dinner-hour with eyes wide like boiled eggs, unable to eat. He couldn’t give me any details. He said no words could describe it.\n“What does your heart tell you about this place?” he’d earnestly asked.\nI’d only shrugged, frustrated with him for not telling me what he’d seen that was so awful.\nHe leaned forward, lowering his voice. “You read all those books . . . why don’t you feel rebellion? Don’t you ever dream of getting out of here? Away from all the Big Eye?”\n“Rebellion against whom?” I whispered, confused.\nHe laughed bitterly, sat back and shook his head. He took my hand, squeezed it and let it go. “Eat your jallof rice, Phoenix.”\nI tried to get him to eat his crushed glass. This was his favorite meal and it bothered me to see him push his plate away. But he wouldn’t touch it. Before we returned to our separate quarters, he asked for my apple. I assumed he wanted to paint it. He always liked to paint when he was depressed. I’d given it to him without a thought and he’d slipped it into his pocket. The Big Eye allowed it, though they frowned upon taking food from the dining room, even if you didn’t plan to eat it.\nHis words didn’t touch me until nighttime when I lay in my bed. Yes, somewhere deep, deep in my psyche I did wish to get out of the tower and see the world, be away from the Big Eye. I wanted to see those things that I saw in all the books I read. “Rebellion,” I whispered to myself.\nThey told me the news in the morning during breakfast-hour. I’d been sitting alone looking around for Saeed. The others, the woman with the twisted spine who could turn her head around like an owl, the man who never spoke with his mouth but always had people speaking to him, the three women who all looked and sounded alike, the bushy-bearded man who looked like a wizard from a novel, the baboon who spoke in sign language, the woman whose sweater did not hide her four large breasts, the two men joined at the hip who were always randomly laughing, the woman with the lion claws and teeth, these people spoke to each other and never to me. Only Saeed spoke to me.\nOne of my doctors sat facing me. The African-looking one who wore the shiny black wig made of synthetic hair, Bumi. They always had her deal with me when there was upsetting news. My entire body tightened. She touched my hand and I pulled it away. She smiled sympathetically and told me a terrible thing. Saeed hadn’t drawn the apple. He’d eaten it. And it killed him. My mind went to one of my books. The Bible. I was Eve and he was Adam.\nI could not eat. I could not drink. I would not cry. Not in the dining hall.\nHours later, I was in my room lying on my bed, eyes wet, mind reeling. Saeed was dead. I had skipped lunch and dinner, but I still wasn’t hungry. I was hot. The scanner on my wall would start to beep soon. Then they would come get me soon. For tests. I shut my eyes, squeezing out tears. They evaporated as they rolled down my hot cheeks. “Oh God,” I moaned. The pain of losing him burned in my chest. “Saeed. What did you see?”\nSaeed was human. More human than me. I met him the first day they allowed me into the dining hall with the others. I was one year old; I must have looked twenty. He was sitting alone about to do something insane. There were many others in the room who caught my eye. The two conjoined men were laughing hard at the sight of me. The baboon was jumping up and down while rapidly signing to the woman with lion claws and teeth. However, Saeed had a spoon in his hand and a bowl full of broken glass before him. I stood there staring at him as others stared at me. He dug the spoon into the chunks of glass and put it in his mouth. I could hear him crunching from where I stood. He smiled to himself, obviously enjoying it.\nDriven by sheer curiosity, I walked over and sat across from him with my plate of spicy doro wat. He eyed me with suspicion but he didn’t seem angry or mean, at least not to the best of my limited social knowledge. I leaned forward and asked what was on my mind, “What’s it like to eat that?”\nHe blinked, surprised. Then he grinned. His teeth were perfect—white, shiny, and shaped like the teeth in drawings and doctored pictures in magazines. Had they removed his original teeth and replaced them with ones made of a more . . . durable stuff? “The taste is as soft and delicate as the texture is crunchy. I’m not in pain, only pleasure,” he said in a voice accented in a way that I’d never heard. But then again, the only accents I’d ever heard were from the Big Eye doctors and guards.\n“Tell me more,” I said.\nAfter that, Saeed and I became friends. I loved words and he needed to spill them. He could not read, so I would tell him about what I read, at least in the hours of breakfast, lunch and dinner. He was from Egypt where he had been an orphan who never went hungry because he could always find something to eat. Rotten rice, date pits, even the wooden skewer sticks of kebabs, he had a stomach like a goat. They brought him to the tower when he was ten, nine years ago. He never told me exactly how or why they made him the way he was. It didn’t matter. What mattered was that we were who we were and we were there.\nSaeed told me of places I had never seen with my own eyes. He used the words of a poet who used his tongue to see. Saeed was an artist with his hands, too. He had the skill of the great painters I read about in my books. He most loved to draw those foods he could no longer eat. Human food. Portraits of loaves of bread. Bowls of thick egusi soup and balls of fufu. Bouquets of lamb and beef kebabs. Fried eggs with white cheese. Plates of chickpeas. Pitchers of orange juice. Piles of roasted corn. They allowed him to bring the paintings to mealtime for everyone to view. I guess even we deserved the pleasures of art.\nSaeed could survive on glass, metal shavings, crumbles of rust, sand, dirt, those things that would be left behind if human beings finally blew themselves up. However, eating a piece of bread would kill him as eating a big bowl of sharp pieces of glass would kill the average human being.\nHe took my apple and that night, he ate it. Then his stomach and intestines hemorrhaged and he was dead before morning. I never got to tell him what was happening to me. It might have given him hope; it would have reminded him that things would change. I wiped a tear. I loved Saeed.\nAs grief overwhelmed me for the first time in my life, I pressed a hand against the thick glass of my window. I’d never been outside. I wanted to go outside. Saeed had escaped by dying. I wanted to escape, too. If he wasn’t happy here, then neither was I.\nI wiped hot sweat from my brow. My room’s scanner began to beep as my body’s temperature soared. The doctors would be here soon.\nWhen it first started to happen two weeks ago, only I noticed it. My hair started to fall out. I am an African by genetics, my hair was very coily and my skin was very, very dark. They kept my hair shaven low because neither they nor I knew what to do with it when it grew out. I could never find anything in my books to help. They didn’t care for style in Tower 7, anyway . . . although the woman down the hall had very long silky white hair and Big Eye lab assistants came by every two days to help her brush and braid it . . . despite the fact that the woman had the teeth and claws of a lion.\nI was sitting on my bed, looking out the window when I suddenly grew very hot. For the last few days, my skin had been dry and ashy no matter how much hydrated water they gave me to drink. Doctor Bumi brought me a large jar of shea butter and applying it soothed my skin to no end. However, this day, hot and feverish, my skin seemed to dry as if I were in a desert.\nI felt beads of sweat on my head and when I rubbed my short, short hair, it wiped right off, hair and sweat alike. I ran to my bathroom, quickly showered, washing my head thoroughly, toweled off and stood before the large mirror. I’d lost my eyebrows, too. But this wasn’t the worst of it. I rubbed the shea butter into my skin to give myself something to do. If I stopped moving, I’d start crying with panic.\nI don’t know why they gave me such a large mirror in my bathroom. Large and round, it stretched from wall to wall. Therefore, I saw myself in full glory. As I slathered the thick yellow nutty-smelling cream onto my drying skin, it was as if I was harboring a sun deep within my body and that sun wanted to come out. Under the dark brown of my skin, I was glowing. I was light.\nI pulsed, feeling a wave of heat and slight vibration within my flesh. “What is this?” I whispered, scurrying back to my bed where my e-reader lay. I wanted to look up the phenomena. In all my reading, I had never read a thing about a human being, accelerated or normal, heating up and glowing like a firefly’s behind. The moment I picked the e-reader up, it made a soft pinging sound. Then the screen went black and began to smoke. I threw it on the floor and the screen cracked as it gently burned. My room’s smoke alarm went off.\nPsss! The hissing sound was soft and accompanied by a pain in my left thumbnail. It felt as if someone stuck a pin into it. “Ah!” I cried, instinctively pressing on my thumb. As I held my hand up to my eyes, I felt myself pulse again.\nThere was a splotch of black in the center of my thumbnail like old blood but blacker. Burned flesh. All specimen, creature, creation in the building had a diagnostics chip implanted beneath his, her or its fingernail, claw, talon or horn. I’d just gone off the grid.\nNot thirty seconds passed before they came bursting into my room with guns and syringes at ready, all aimed at me as if I were a wild rabid beast destroying all that they had built.\n“Get down! DOWN!” they shouted. One man grabbed me, probably with the intent of throwing me on the bed so he could cuff me. He screamed, staring at his burned, still smoking hand. Someone shot me in the leg. It felt like someone had kicked my leg with a metal foot. I sunk to the floor, pain washing over me like a second layer of more intense heat. I would have been done for if someone else had not shouted for the others to hold their fire.\nThankfully, I healed fast and the bullet had gone straight through my leg. If it hadn’t, I don’t know what would have happened due to my extreme body temperature. One minute I was staring with shock at the blood oozing from my leg. Then next, I blacked out. I woke in a bed, my body cool, my leg bandaged. When they returned me to my room, the scanner was in place to monitor me since I could not hold an implant. They replaced my bed sheets with a heavy heat-resistant sheet similar in material to my new clothes. The carpet was gone, too. For the first time, I saw that the floor beneath the carpet was solid whitish marble.\nWhen I grew hot and luminous like this, electronics died or exploded in my hands. This was why they started giving me paper books. They were difficult to read, as I couldn’t turn the pages as quickly as I could with the e-reader. And the paper books they had were limited and old. And they could monitor what I was reading. Although now I realize with the e-reader they were probably monitoring my choices, too.\nI didn’t tell Saeed about the heating and glowing because at the time I didn’t want to worry him. I enjoyed our talks so much. I wish I had told him.\nThe door slid open and my doctors came in, Debbie and Bumi. I took a deep breath to calm myself. When I was calm, though the heat did not go away, it decreased, as did the glow.\n“How do you feel?” Bumi asked, as she took my wrist to check my pulse. She hissed, dropping it.\n“Hot,” I said.\nShe glared at me and I shrugged thinking something I had not thought until Saeed was dead— You should have asked first.\n“Open,” Debbie said, placing the heavy-duty thermometer into my mouth.\nI saw these two women every day. I knew their names, nothing more.\n“She’s not glowing that brightly,” Bumi said, typing something onto her handheld. I resisted the urge to grab it and hold it in my hands until it exploded. Saeed was dead because of these people. I steadied myself, thinking of the cool places sometimes described in the novels I read. I once read a brief story about a man who froze to death in a forest. I thought about that.\n“It might just be menopause approaching,” Bumi said. “I believe the two factors are correlated.”\nI tuned out their talk and focused on my own thoughts. Escape. How? What would they do to me? What did Saeed see? He said it was something on this floor. My internal temperature was 130 degrees, but the temperature of my skin was 220. They couldn’t take my blood pressure because the equipment would melt.\n“We need to take her to the lab,” Debbie said.\nBumi nodded. “As soon as the scanner says she’s reached 300 degrees. We don’t want her any higher or things around her will start to ignite.”\nThey left. I paced the room. Restless. Angry. Distraught. They would be back soon.\nHow am I going to get out of here, I wondered. As if to answer my question, Mmuo walked into my room. He came through the wall across from my bed. My heart nearly jumped from my chest.\n“Did you hear?” he asked, sitting on my bed.\nI blinked, feeling the rush of sadness all over again. He was Saeed’s friend, too. “Yes,” I said.\n“I’m sorry, Phoenix.”\nMy face was wet and drying with sweat. “I’m getting out of here,” I declared.\nMmuo grinned but it quickly turned to a frown. “What is wrong with you? I can feel you from here,” he asked.\n“I think it has something to do with how they made me. It’s been happening for two weeks and it’s getting worse.”\nWe looked at each other, silent. I knew we were thinking the same thing but neither he nor I wanted to speak it. If we spoke of my name, I didn’t think I’d be able to move, let alone run.\n“Yes, that would make sense,” he said.\nHis full name was Uzochukwu D’nnmma but he called himself Mmuo, which meant spirit in a Nigerian language. He was a hero to all those who were created or altered in Tower 7. Like Saeed, Mmuo had been taken from Africa. He said he was from “the jungles of Nigeria.“ I did not believe he was from any jungle. He spoke like a man who had known skyscrapers, office buildings and digital television. He knew how to disable the security doors on several of the floors and was known for causing trouble throughout the building. Not that he really needed to do so to get around the tower. Mmuo could walk through walls. The only walls he could not pass through were the walls that would get him out of Tower 7. Mmuo could not escape; obviously his abilities were created by Tower 7 scientists.\nMmuo was a tall thin man with skin the color of and as shiny as crude oil. He never wore clothes, for clothes could not pass through the walls with him. He stole what food he needed from the kitchens. He was the only person/creature who’d successfully escaped the Big Eye’s clutches.\nWhy Tower 7’s Big Eye tolerated him, I do not know. My theory is that they simply could not catch him. And since he was contained, they accepted the trouble he occasionally stirred up. Most of those in the tower were too isolated and damaged to be much trouble if freed, anyway.\n“It looks like your skin is nothing but a veil over something greater,” he said, after an appraising look. It was something Saeed would have said and the thought made my heart ache again.\n“Can you open the door?” I finally said. “I . . . I want to see what is down the hall, near Saeed’s room.”\nMmuo met my gaze and held it.\nI frowned. “What did Saeed see?” I asked.\nHe only looked away.\n“Show me,” I said, suddenly wanting to sob. “Then help me escape.”\nHe moved close to me and I was sure he was going to hug me.\n“Don’t touch me,” I said. “You’ll . . . ”\nHe raised a hand up and made to slap me across the face. “Don’t move,” he said. His hand passed right through my head. I felt only the slightest moment of pressure and there was a sucking sound.\n“Wha . . . ”\n“Can you hear me?” I heard him loudly say through what sounded like a microphone. I looked around.\n“Shhh! They’ll hear you!” I hissed. I frowned. His lips hadn’t moved.\n“No,” he said. He held his finger to his lips for me to quiet down and grinned, his yellow-white teeth shining, his black skin shining, too. “They won’t. You are hearing this in your head.\n“Not even the Big Eye know I can do this,” he said aloud, but lowering his voice. “Whatever they did to make me able to pass through walls, I can pass it into people and they can hear me, until the tiny nanomites are sweated from their skin.”\n“I did this to a little boy on the fifth floor. He had a contagious cancer, so they kept him in isolation for tests. Hearing me talk to him from wherever I was kept him sane. At least, until he died.”\nHis disease could have killed you, though, I thought.\nHe started to descend through the floor. “Fifteen minutes,” he said in my head, then he was gone.\nI whipped off my pants and t-shirt and threw on a white dress they’d recently given me that was made of heat-resistant thin plastic. The dress was long but light and allowed me to move very freely. I didn’t bother with shoes. Too heavy.\nFor a moment, I had a brief flash in my mind of actually stepping outside. Into the naked sunlight. I could do it. Mmuo would help me. He and I would both escape. I felt a rush of hope, then a rush of heat. The scanner on my wall beeped. I had reached over 300 degrees.\nJust before the door slid open, I had the sense to spread some shea butter on my skin. I ran out of my room.\n“If you want to see, turn right and then go straight. Do it quickly.”\nI jogged, my feet slapping the cool marble floor. The hallway was quiet and empty, and soon I was in a part of my floor that I had never graced. The side where they kept Saeed. His prison, I thought.\nI crossed a doorway and the floor here was carpeted, plush and red. I paused, looking down. I had never seen red carpet. Before they took it out, the carpet in my quarters had been black and flat. I wanted to kneel down and run my hands over it. I knew it would feel so soft and fluffy.\n“See what you must but you have to make it to the elevator in two minutes,” Mmuo’s voice suddenly said into my head. “Go down the hall and turn left. You will see it. Hurry.”\n“Ok,” I said aloud. But he could not hear me. One-way communication. I ran down the red hallway. Through glass windows and doors, I could see lab assistants and scientists in labs. Each large room was partitioned by a thick wall. There was bulky equipment in most of the rooms. If I were careful, no one would notice me. After sneaking past three labs, I saw the one that Saeed saw. It had to be. I stopped, staring and moaning deep in my throat. This lab was much bigger than the others and ten black cameras hung from its high white ceiling.\nThere were two wall-sized sleek grey machines on both sides of the room. I could hear them humming. Powerful. Between them, the world fell away to . . . another world where it was daytime and all that was happening was perfectly bluntly brutally visible. There were old vehicles, trucks from long long ago, boxy, ineffective and weak. But strong enough to carry huge loads of cargo to dump into a deep pit. And that cargo consisted of human bodies. Hundreds of them. Dead. Not Africans. These dead people had pinkish pale skin and thin straight-ish hair like most of the Big Eye. When was this? Where was this? Why were the Big Eye scientists just standing there watching with their clipboards and ever-observing eyes?\nIt was not like watching a 3D movie. Even the best ones could never look this . . . true. Bodies. And I could smell them. The whole hallway reeked with their rot and feces and bile and the smoke of the trucks. My brain went to my books and recalled where I had seen this before. “Holocaust,” I whispered, fighting the urge to turn to the side and vomit. I shut my watering eyes for a moment. I took a deep breath and nearly gagged on the stench. I opened my eyes.\nThis genocide happened during one of the early world wars. The Germans killed many of these people because they felt they were inferior or a threat or both. The book I read spoke as if wiping them out was the right thing to do. It certainly looked wrong to me. Were these Big Eye looking through time? Is this all they could do? Look? And why this time? For a moment, the portal disappeared and there was lots of scrambling, adjusting machines, pushing buttons, cursing. And then the portal reappeared showing the same activities, in the same time period in the same place. Happening.\nI could feel the surge of heat in my body. Like a deep heart beat of crimson flames. I shuddered and felt it ripple over every surface of my skin. But I couldn’t move. Saeed had probably stood here just like this, too. Acrid smoke stung my eyes. My feet were burning the red carpet. A fire alarm sounded. I ran.\nThe elevator was open. It was empty. I ran in and it quickly closed behind me. I wished Mmuo would say something. If it went up, I was caught. If it went nowhere, I was caught. If it went down, I might be caught, but I might escape, too. I shut my eyes and whispered, “Go down, go down, please, go down. Have to get out!” Sweat beaded and evaporated all over my confused body and the elevator quickly began to feel humid.\nIf I hadn’t rubbed all that shea butter on my skin at the last minute, I’d have been in horrible pain, my skin drying and probably cracking. I was hot like the sun, there was a ringing in my ears, as if my own body had an alarm and it was going off, too. I looked at my hands. They were glowing a soft yellow. My entire body was glowing through my dress.\nThe elevator jerked upward. I grabbed the railing, pure terror shooting through me. At least, I would make it outside. I hoped I could take two breaths before they caught me. I sunk to the floor. Saeed was dead and I was still trapped. Tears dribbled from the corners of my eyes and hissed as they evaporated down my cheeks.\nThe elevator jerked again. “Sorry about that,” I heard Mmuo say in my head. He sounded distant. The elevator started moving down. I jumped up, grinning. I still had a chance. A louder alarm started to go off. They’d realized I was missing. “I can get you to nine,” he said. His voice was fading and I had to strain to hear it. “Two stairways in there. Run to the emergency one on the other side of the greenhouse, straight ahead when the doors open. You’ll be on the side of the greenhouse, just go straight ahead! Do NOT go near the center! There’s . . . ” His voice faded away.\nHad my heat burned away his nanomites? Probably. As the elevator flew down to the ninth floor, my feet burned the elevator floor. It came to a sudden stop and the doors opened. The blare of the Tower 7 alarm assaulted my ears but the most beautiful site I’d ever seen caressed my eyes. An expansive room full of trees, bushes, flowers, vines. In pots, on shelves, tangled within each other. I could see the city through the windows on my left. The sky was the deep rose of evening. I started quickly walking down the narrow path before me. Moss grew on the sides of trees. The air smelled green, fragrant, soily, I had never smelled anything like it.\nI heard a rush of footsteps from amongst the plants to my right. Between the foliage, I could see them. Big Eye guards. In armor with shields, with guns.\n“Hey!” one of them yelled, spotting me. All their guns went up. “Put your hands up. We will not hurt you.” The one speaking was a woman. I could see her clearly. She was short with long brown straight hair. She had pale skin and a hard voice.\nBehind me I could hear the elevator rumbling. I still didn’t move. Saeed was dead. There was nothing for me here. I was two years old and I was forty years old. The marble beneath my feet absorbed my heat.\n“Please, put your hands up,” the woman pleaded. “You know what you are. We can stabilize you.” She paused, obviously considering how much to tell me. I knew enough, though. Saeed was dead and it was all clear to me now.\n“You’re a weapon,” the woman admitted. “If you wanted to know, now you know. I’m only here to help. You have to trust me. This wasn’t supposed to happen, you being like this. Please, let us help you.”\nI heard the elevator doors opening just as I felt the light burst from me. There was warmth that started at my feet. It rolled up to my chest and pulsed out with a wave of heat. My shoulders jerked back and I stumbled to the side, getting a glimpse behind me. If I had blinked I still wouldn’t have missed it. My skin prickled as my glow became a light green shine. The light steadily radiated from me, bathing every plant in the room. The guards behind me in the elevator and on the far right side of the room all ducked down and for a moment it was quiet enough where you could hear it. All the plants began to grow. Snapping, pulling, unfurling, creeping. Thick vines and even tree roots quickly crept, stretched and blocked the elevator door. Leaves, branches and stems grew so thick around the guards to my right that they were blocked from view. They didn’t know I could do this.\nThe entire greenhouse swelled and flooded with foliage. Except a few steps ahead to my right. There was what I could only call a tunnel through the plants. It diagonally passed the cowering Big Eye. I ran into it just as the guards behind and to my right began to shoot toward where I’d initially been. Were they shooting through the plants or shooting at me, I do not know. And in many ways these two things were one of the same.\nMmuo had said to go forward to find the doorway. But I lost all sense of direction. So when I ended up standing before the giant glass dome I had no clue which way to run. My first thought was of the same book that spoke of the treacherous apple of knowledge. The Bible. Except that the man with enormous wings was not held up by any wooden cross. He was suspended in mid-air with his arms out and his legs tied together. His eyes were closed. His brown-feathered wings were stretched wide.\nHe was naked, his bronze-skinned body, muscled and very, very tall, at least compared to my six feet. He had Arab facial features like Saeed and a crown of wooly hair like mine. He was magnificent. Behind the glass dome was a rough wooden wall. The Backbone.\nBehind me, I could hear them coming. Hacking and shooting through the plants and calling my name. I wasn’t going to get out. I walked up to the glass and placed a hot hand on it. The glass was thick and very cool. Was there even air in there? Was that how they held him? Was it like being in outer space? What was space like for a creature made to fly?\nHis eyes opened. I gasped and jumped back. They were brown and soft kind eyes.\n“Oh my God, Phoenix! Step BACK!” one of the guards screamed, shoving aside a bush. I noticed the guard did not point his gun. Nor did the others who emerged beside him. I looked back at the man with wings. He was looking right at me, no expression on his face. I was surrounded by guards, all begging me to step away, pleading that this creature was unique and dangerous. However, none of them came to capture me. I didn’t move.\nSeeing the Big Eye cower, seeing their fear and sheer horror had a strange effect on me. I felt powerful. I felt lethal. I felt hopeful, though all was hopeless. I turned to the caged man and my hope evolved into rage. Even he was a prisoner here. I vowed that if I didn’t get out, at least he would.\nFor the first time I did it voluntarily. I was already so hot and I grew hotter when I reached into myself, into all that I was, all that I had been and all that I would be, I reached in and drew from my source. Then I turned to a nearby tree and let loose a pulse of light. I sighed as it left me, feeling relief. Immediately the tree’s roots began to buckle and creep toward the glass cage.\nCRASH! They easily forced their way through and the rest of the dome began to crack in several places. The Big Eye turned and ran for their lives. I didn’t bother running. There was no better way to die. He burst through, knocking me aside with the intensity of his wake. Into the now dense foliage of the greenhouse. I saw none of it, but I heard and smelled it. Wet tearing sounds, screams, ripping, snapping, choking, not one gun fired. The air smelled like torn leaves and blood. It was still happening when I spotted the stairway between the plants and ran into it. I ran down and down flights and came to a heavy open door and entered the lobby.\nFor a moment, even after all that I had seen, I forgot what I was doing. The sight took my breath away. Tower 7’s lobby was more spectacular than I’d ever imagined. No words could make up for actually seeing this place. This space. I had never been in such a space. The ceiling was so high and the marble walls were draped with gorgeous flowering vines, the small trees and plants growing through the soil-filled holes in the floor. I fought not to fall to my knees. There was the base of The Backbone. Its trunk had to be over thirty feet in diameter.\nI was dizzy. I was burning up. I was amazed. I was exhausted. There was a freed angel beast massacring its captors nine floors above. I could hear more Big Eye guards coming down the stairwell. The alarm was blaring and the lobby was empty . . . except for a lone figure standing near the exit doors. He was grinning. He’d been trying to get to this very spot for nine years and my escape gave him the chance.\n“Hurry,” Mmuo cried. “Phoenix, MOVE!” I heard them burst through the stairway. I was running. I dodged small trees, scrambled around benches and leapt over plants. The door was yards away. I was going to make it. Outside, people walking by stopped to look.\nThen I saw the guards come running onto the tower’s wide plaza. They seemed to come from all directions. They shoved gaping people aside. They pulled up people who were sitting on benches enjoying the lovely evening. Then they formed a line blocking the exit and stood there, guns to their chests. I ran to Mmuo and would have given him a hug, if it weren’t for my heat. We’d both almost made it.\n“Go,” I told him.\n“I’m sorry,” he said.\n“For what?” I was having trouble thinking straight and I could smell the floor burning beneath me. I didn’t know marble could burn. “Saeed would have been proud. I am proud. I set an angel free.”\nHis eyebrows went up. “You . . . ”\n“Go!” I said, looking at the approaching Big Eye coming from the stairwell. They were flooding from doorways and were coming down an escalator on the other side of the lobby. “Don’t ever let them catch you!”\nHe sunk through the floor and was gone.\nI stood tall. There were over a hundred of them. Men and women armed with the guns I had seen them carrying all my life. No Big Eye guard went anywhere in the tower without them. I knew how they sounded, too. Nearly silent. I had been hearing shots fired all my life, too. For a multitude of reasons, but always with the same result. Something or someone was dead or severely injured. “Protect the scientist from the subject.” “Observe and learn.” “We will be better for it.” “For the Research.” I was taking all the pieces I had read and finally putting them together. The Big Eye crowded around me, twitchy with anticipation as if I were evil. After all I had done, to them, I guess I was evil. Or crazy.\nI held up my hands, feeling myself utterly shining. The light bloomed from my body. The release felt glorious and I moaned with relief. Then more sighing than speaking, I said, “I give . . . ”\nThey opened fire and it was as if I were punched with steel fists in every part of my body—chest, neck, legs, arms, abdomen, face. I was blown back and my vision went red yellow. I lay on my back. Everything was wet, the smell of smoke in the one nostril I had left. Smoke and . . . the perfume of The Backbone. I was looking at it, gazing at how it reached, up, up, up, through the high marble ceiling, through the 39 floors above. Into the sky. Reaching for the sky.\nI felt the radiance burst from me, warm, yellow, light, plucked from the sun and placed inside me like a seed until it was ready to bloom. It bloomed now and the entire lobby was washed. The Big Eye covered their faces and dropped their guns. A few ran to the stairwell, others to the far side of the lobby. Most of them ran past my mangled body and out of the building. Those ones must have known what would happen next.\nI knew. I was burning as the light pulsated and pulsated from me there on the floor. My body convulsed with it as my clothes burned and then my flesh. There was no pain. My nerves were burning.\nMy light shined on the plants and tiny trees of the lobby and they began to grow wildly, stirred and amazed with life. Vines stretched, lengthened, thickened. Flowers twisted open. Pollen puffed the air sweet. Leaves unfolded and widened. The stone floors were covered with green yellow white brown black, the strongest roots cracking its foundation.\nMy light shined on the great tree that was The Backbone. Its roots groaned as they shifted, coiled, expanded, and caused the entire portion of the floor around its roots to buckle and fall apart. The tree’s colossal trunk twisted this way and that, shrugging off the building that was its shackle. Chunks of the floors above began to crash down around me. I was ashes being scattered by vines and roots when Tower 7 fell.\nSeveral of the buildings beside the tower fell, too. The Backbone stood tall, stretching its branches and opening its enormous leaves over buildings and streets. At its base, a small lush jungle sprung from the rubble of Tower 7. All this in the middle of the city. Helicopters hovered, news crews streamed footage live, people gaped from afar. When the debris settled, there was a moment, where my brilliant light shined into the darkness, for it was now nighttime. The news cameras recorded the winged man flying out of the rubble but not much else lived, except the man who could walk through walls. Mmuo walked out of The Backbone’s trunk and stood before it. “This is what you all deserve!” he shouted, shaking his fist at the eyes of the hovering cameras. Then he sunk into the ground and was never seen again.\nNo one in the city would approach the ruins of Tower 7. They sat for seven days, a pile of those things Saeed used to eat: rubble, glass, metal and . . . ash. And then I realized the meaning of my name.\nNnedi's novels include Lagoon (finalist for Best Novel in the British Science Fiction Association Award), Who Fears Death (winner of the World Fantasy Award for Best Novel and Le Prix Imaginales for Best Translated Novel), Akata Witch (an Amazon.com Best Book of the Year), Zahrah the Windseeker (winner of the Wole Soyinka Prize for African Literature), and The Shadow Speaker (winner of the CBS Parallax Award).\nHer short story collection Kabu Kabu was a Publisher's Weekly Best Book for Fall 2013. Her adult novel The Book of Phoenix (a prequel to Who Fears Death) was released in May and received rave reviews from The New York Times, The Chicago Tribune and more. Nnedi's novella, Binti her first story set in outer space recently won both the 2016 Nebula Award and the 2016 Hugo Award for Best novella. Lastly, her much anticipated young adult novel Akata Witch 2: Breaking Kola will be released in 2016.", "source": "https://clarkesworldmagazine.com/okorafor_03_11/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Book of Phoenix (Excerpted from The Great Book) by Nnedi Okorafor"}