{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "5vnJefHQBqfFtxdEYIH0SlbwPL4=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: The Best from 2019  Over the last two months, our readers have been helping us select the best story and cover art that we published in 2019. While the first round went very smoothly, there were several easily-spotted attempts to stuff the ballot in round two. With that obvious exception, we’d like to thank everyone who participated this year. It was a very exciting race to the finish!  Best Cover of 2019  The result for best cover art was extremely close between the top three from beginning to end and the others were never that far behind. Only one point separated 2nd from 3rd place.  And our winner is:   Best Story of 2019  After a tight race to make the final ballot, I wasn’t sure what to expect in this category. For the first few days, it looked like we’d have more of the same, but gradually, five separated from the pack and exchanged the top spot on an almost daily basis.  And our winner is:  Congratulations to our winners and all the finalists!  Additional congratulations are due to this year’s story winner, A. T. Greenblatt. “Give the Family My Love” has also been announced as a finalist for the Nebula Award for Best Short Story!  Our cover art winner, Matt Dixon, will also be launching a Kickstarter campaign for his sixth book of robot art on March 10th. If you liked his cover, you’ll probably want to check it out.  I’m also happy to report that I’ve been given the all-clear by my doctors to resume normal activities again. Thank you all for your support and patience over the last couple of months. It’s been rough and I look forward to having some semblance of normalcy return to my life in the weeks ahead. Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: The Best from 2019\nOver the last two months, our readers have been helping us select the best story and cover art that we published in 2019. While the first round went very smoothly, there were several easily-spotted attempts to stuff the ballot in round two. With that obvious exception, we’d like to thank everyone who participated this year. It was a very exciting race to the finish!\nBest Cover of 2019\nThe result for best cover art was extremely close between the top three from beginning to end and the others were never that far behind. Only one point separated 2nd from 3rd place.\nAnd our winner is:\nBest Story of 2019\nAfter a tight race to make the final ballot, I wasn’t sure what to expect in this category. For the first few days, it looked like we’d have more of the same, but gradually, five separated from the pack and exchanged the top spot on an almost daily basis.\nAnd our winner is:\nCongratulations to our winners and all the finalists!\nAdditional congratulations are due to this year’s story winner, A. T. Greenblatt. “Give the Family My Love” has also been announced as a finalist for the Nebula Award for Best Short Story!\nOur cover art winner, Matt Dixon, will also be launching a Kickstarter campaign for his sixth book of robot art on March 10th. If you liked his cover, you’ll probably want to check it out.\nI’m also happy to report that I’ve been given the all-clear by my doctors to resume normal activities again. Thank you all for your support and patience over the last couple of months. It’s been rough and I look forward to having some semblance of normalcy return to my life in the weeks ahead.\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_03_20/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: The Best from 2019 by Neil Clarke"}