{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "James Patrick Kelly", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "6TyCUbVA/R8v3LsBCX43oF5f/RI=", "id": null, "license": null, "comments": "", "raw_text": "9870 words, novelette  The Rose Witch  Most in that country called Tzigana a witch, though never to her face. Now that she was dead, you would expect that the girls who had lived in her tumbledown house might say whatever they wished. But none dared speak against the old woman. All but one continued to bless her memory, constructing imagined kindnesses out of blankets as thin as soldiers’ socks, candle stubs dipped from scrap wax, and joints of stringy goat for the turnip soup. They even pretended to mourn. Julianja was disgusted by their cold tears, but she kept quiet and watched for what would happen next. She respected and feared Tzigana, even now. If the old woman rose from the dead to snatch a girl for company in the tomb, Julianja wouldn’t have been surprised.  What was to become of them? Dorottya, the elder of the twins, had taken charge, but she had neither the experience nor the sense to run a household. They were seven girls, ranging in age from eleven to twenty, all little better than servants. Tzigana had taken them on as apprentices, yet she had shared little of her arcane knowledge. Frici could spark fire from the tips of her forefingers and Zsuzsanna could draw the ache from strained muscles and Julianja could make roses breathe, but these skills wouldn’t pay for the meat or salt or shoes they needed.  Dorottya declared they must seek work away from the house and sent the girls to trade with the houses of men. They offered to sew and bake, tend vegetable patches and put up preserves, chop wood and sweep floors. Julianja knew this plan would never succeed. The women who lived with men would not welcome needy girls. For her part, Julianja refused to leave the old witch’s garden, since it was the only light in her dim life. No argument or censure would move her.  You may be right to despise Tzigana. In life, she neglected most of what we hold dear. She let magic consume her and paid as little heed to the house as she did to history or the troubles of her country. Certainly she loved her roses more than the girls who were her charges. But she had used her wits to impose her austere order on the world. While hers was rarely a joyous place, no one there went hungry. No one took sick, thanks to the witch’s charms. The girls might complain, but they stayed until they were sent away. Each was treated equally so they might become their truest selves, away from the plans and strictures and desires of men. And of course Tzigana’s garden drew noble visitors. She left the world more beautiful than she found it. How many of us can say the same?  The girls seemed to be managing without their mistress, although Julianja wasn’t fooled. The house was but two days’ walk from the town of Szeged and a few of the girls found work nearby, especially pretty Erzebet. But then boys started following them back to the house. Dorottya knew enough not to let the rascals in, but they would climb the chicken coop and call through the windows. They soon learned better than to try to cut through Julianja’s roses; she was merciless with her birch switch.  By the time the roses bloomed, the garden was hers alone. The other girls were either too busy or too lazy to help Julianja tend it. Where once she had hung back while the witch had greeted the seekers who came to her garden, now she waited by herself at the gate to receive them. With Tzigana gone, however, only a few came.  The frail bishop arrived swaddled in furs and bundled in a horsehair blanket and still he looked cold and blue, even in the heat of early summer. He staggered to a Damask rose, which presented in delicate sprays of semi-double flowers. Tzigana claimed that it came from stock which the Crusader King András himself had brought back from the Holy Land; it was red as blood of infidels. The bishop wheezed as he breathed in its scent, then pressed his usual denar into Julianja’s hand and left without another word. The boar prince spoke only German but indicated his preference for the pink cabbage rose by snuffling at it with his blunt snout. Afterwards he scrabbled back into his golden palanquin and was borne away by his four squires without leaving so much as a copper.  In the past, there had been almost as many women as men visiting, but that year only the dowager Baroness came in her dusty carriage. She peered at Julianja over her glasses, the left lens of which was cracked down the middle.  “Is she sick?”  Julianja met her watery gaze boldly. “Dead.”  “No.” The woman gasped and cupped hands to the sides of her head, as if she could not hear through her wimple. “Dead?”  “It was Palm Sunday. We were at Mass.”  “Did she say anything?”  “She told Dorottya that her legs were cold. As she rose to receive the Sacrament, she collapsed.”  “I mean about me.”  Julianja shook her head.  “She should have forseen this. Now who will take care of the roses?”  “I will.” Julianja ground her bark sandal against the path, staking out her claim. “As you see.”  The dowager gave an unhappy laugh. “You can try.” She gestured with her walking stick. “Take me there.” Her special mountain rose was a particular favorite of the bees. It was a climber, the flush of creamy blossoms carried high. Julianja went up on tiptoes and brushed the bees away with the back of her hand, then bent one of the stems toward her. The thorns of this rose were mere prickles and she had to worry at one until she had stabbed her forefinger deep enough to draw blood. She watched the bead grow before pointing at the closest bloom and blowing a spray of blood at the crown of yellow stamens.  “Be quick about it,” commanded the dowager.  Still holding the stem, Julianja twisted away to make room. She braced for a lash across the legs that did not come. Instead, the dowager brushed past her and buried her face in the charmed flower Her snuffling reminded Julianja of the boar. When her head lolled away, Julianja released the stem and it sprang into place.  Tzigana had first used Julianja to create the rose charm three summers ago, after she had sent Vica away. Year after year the girl had watched as the highborn had been transported by the mingling of her blood and the perfume of the blossoms, and yet never understood how it happened or what they felt. She’d always wanted to know, but Tzigana had laughed whenever she asked. Or cursed her. But Tzigana was in her tomb.  “What is it?” said Julianja. “Tell me.”  The dowager shivered as if awakening from a dream and then thrust her face close to Julianja’s. The crack in her glasses made her left eye seem to be doubled. “How old are you?”  Julianja’s mother had sold her to Tzigana when she was but a child, and if the witch knew the day of her birth, she had never said. Julianja had started bleeding last summer, and Zsuzsanna said that meant she was sixteen, but Frici said no, she might be fourteen or even seventeen. Every girl had a different time. “Old enough,” she said.  “Maybe you are.” The dowager pinched Julianja’s breast. “Have you been with a boy yet?”  She slapped at the woman’s hand twice before she let go. Julianja would have slapped her face, but the woman thrust the knob of her walking stick at the girl to ward the blow off.  “No matter. If the old woman is truly gone, then her garden must die.” She fumbled with the drawstrings of her purse and dropped a handful of denars into a patch of speedwell. “These roses don’t want you, peasant.”  Julianja had been trying not to see this. While the rest of the garden bloomed as usual, the roses were failing. She’d been fighting brown canker since the canes had first come into bud, and she’d spent the last week stripping away leaves infected with the powdery mildew. The sulfur dust that Tzigana had left was nearly gone and there was no money to buy more. Only the humble dog rose, scrambling up the cherry tree, had been spared. Dorottya talked about pulling up the sick plants and giving the space over to paprika peppers. The girls could dry the chilies, grind them and sell the spice that fall at market. The idea made Julianja furious.  As June gave way to July, she worked harder to save the roses. One hot day she was at the fence, pruning dead wood from a pink rambler that had once covered the rails in every direction. She wore only her shift against the heat; damp coils of hair matted against her forehead.  “Hello bogárkám.” Nandor, the carpenter’s son, had big feet and a silly grin, which always got sillier whenever he saw Julianja.  “I am not your little bug. Go away. None of the girls are home today.”  “Except you.” He leaned across the fence.  “That’s saxifrage you’re crushing, blockhead.”  He clasped both hands to his chest. “And it’s my heart you’re crushing, dear girl.” His face was pale and as big as the moon.  When she reached for her birch switch, Nandor danced backwards, laughing. “I will submit to your lash gladly,” he said, hands held high in the air, “if only you’ll submit to mine.”  They both heard the creaking before they saw the cart. And they spotted the mule before they glimpsed the knotted man.  “Be on your guard, Juli,” said Nandor in a low voice. “These beggars are everywhere. First they ask for what is not theirs, then they steal it.”  The knotted man wore a homespun tunic over an undershirt; his dun breeches came to the knee and his lower legs were wrapped in linen. But what you would have noticed first about this traveler were the knots, some for show, some necessary. His tunic was held closed by strips of tied leather and was fringed with knotted wool. He wore a finely braided rope for a belt, and a silk scarf secured around his neck against the dust of the road. He had a boy’s face with only a scraggle of beard but his long black hair was tied in a topknot in the soldier’s style. They say that this makes the warlike seem fiercer, or at least taller. But the knotted man carried no weapons. For her part, Julianja was struck by the set of his jaw and the muscles of his cheeks, which seemed bunched in concentration, or perhaps pain. She did not think him a beggar, but neither did he appear to be a man of substance. The lone plodding mule and the cart with its solid wheels and its dusty wickerwork sides spoke of hard nights under the sky.  As he climbed down to them, foolish Nandor challenged him without asking her permission. “Hold, stranger, and state your business here.” He squared his skinny shoulders. “These girls are under my protection.” He glanced back to gauge Julianja’s reaction.  While he was thus distracted, the knotted man cuffed the boy. It was just a glancing blow, but Nandor collapsed as if his bones had turned to noodles. “My business is none of yours,” said the knotted man, “and my affairs are mine alone.”  Nandor did not reply. His mouth was slack, eyes empty.  “Go.” He hauled the boy upright and aimed him down the road. “This girl has no need of protection from me.” The boy weaved away as if he had been drinking his father’s pálinka.  The knotted man stepped to the garden gate. “She is dead then,” he said. “Did many come to her garden after?”  “Some. Fewer than before.”  “Where is she buried?”  “In a cave.”  “Sealed?”  “With a boulder.”  “How big?”  Julianja raised a hand over her head then spread her arms.  The knotted man grunted. “I was told there was a dark-haired girl who made the roses breathe.”  “Vica. She grew up and was sent away.”  “And you are?”  While Tzigana had shared precious little of her arts with her girls, she had impressed on them the charmed power of their true names. She was not about to give a stranger influence over her. “The rose girl,” she said.  He seemed annoyed by her answer, but let it pass. “Already they are dying?” He reached out to snap one of the blackened twigs entwined in the fence. “Are there any left?”  Julianja was tired of his questions. She had some of her own. “My affairs are mine alone.”  “Just so.” His smile of acknowledgment was tight. “If you are the rose girl, then you can perform the charm. I’ve come from the castle of Kisvárda and crossed the Great Alföld to learn my future.”  Julianja managed to conceal her excitement. No visitor had ever revealed his purpose before, at least, not to her. “I’ve never heard of this castle of yours, sir. Tzigana taught that entry here is a privilege.” She bowed as if to dismiss him. “A shame to have travelled this far in vain.”  He gripped the top of the gate so tight that it complained on its hinges. “What is it you want, rose girl?”  She paused to consider, for she couldn’t remember anyone ever asking her such a question. “Answers.”  The knots on his knuckles relaxed. “If I have them, they’re yours.”  She took his measure as she led him to the back of the garden. He was surely more than a boy but less than a man in full. He made a motley impression. His stride had resolve and confidence, and hard use had yet to stoop his shoulders. While his clothes were common, they were unusually clean for a traveler; there were no smears of mud on his leggings. He had the sweet scent of wood smoke about him, but not the stink of ancient sweat. Had he bathed and washed his clothes before arriving at the witch’s garden? And what to make of the rough cart and the bony mule? He may well have come from a castle, although not one that prospered. She sensed an odd tension to him, like a rope that has been twisted too tight, or a sapling bent for a twitch snare.  They stopped by the cherry tree. “Only the dog rose is still blooming,” she said.  “Good.” He gazed up at the wild climber with its profusion of simple pink-tinged blossoms. “This is the one.”  “You have been here before?”  “No. My father visited the year I was born. He’s dead now, like your witch.”  “So the castle is yours now?”  “I sleep beneath its walls.” He laughed bitterly. “So do our goats. Castle Kisvárda has been a ruin since the reign of Mátyás the Just.” Seeing her indignation at being misled, he held up a hand to beg patience. “It’s mine, but my sad birthright includes a curse. My father said I might consult the roses to find out if I am the one to lift it.”  Julianja couldn’t decide if she should send him away or not. She’d never worked the charm on the dog rose because nobody had ever chosen it. Perhaps it waited for some eminence from even farther away than this pitiable traveler, someone who was even now on his way to her. “A curse?” she said.  “He was a man who was never easy in the wide world with its getting and spending. He was honorable, for all that, and came here to discover if it was his fate to lift our curse. He never said what he learned, but he came home a disappointed man.”  “And now here you are. What do you expect to find out?”  “He called me to his deathbed, and told me that I should gather the family treasure and seek the fearsome witch Tzigana, as he had done in his time. He told me that I must convince her to let me pass into her garden, where a dark-haired girl would lead me to its humblest rose. There I must breathe its charmed breath. He told me what to expect after, although had he not been my own good father, I would have thought him mad. He claimed that in the instant he smelled this rose, all of his long life happened. He could see the inside of his mother’s womb, the coffin he would lie in and everything in between. Each day of his past he lived again as well as all the days of his future, only outside of time. All and all. Perfect memory, perfect foresight. And so, he claimed, it would be for me. But I ask you, how can you remember something that hasn’t yet happened? The Doctors of the Church teach that we have free will. How is that possible if our futures are already ordained?”  Fascinated as she was by this story, Julianja could not resist interrupting the knotted man. “You bring not only a curse, sir, but also a treasure?”  He shook his head. “A treasure in the same way that Kisvárda is a castle. It is of value only to my family.” He waved towards the gate. “In my cart. I will show it to you after, if you like.”  She tried to square this tale with the reactions of other visitors she had observed. The dowager and the bishop and the boar had come many times to the garden, and had never once seemed awed by their experience. Had they become jaded by the roses? “Aren’t you afraid to know the future?”  “I am.” The knotted man hooked the rope cinched around his waist and rolled it between thumb and forefinger. “But my father assured me that when time started for him again, the vision passed. Tzigana told him that no man’s mind can hold his entire life at once, so he must ask himself one question while under the charm. The answer would be all that he clearly remembered. And so I will ask what I must do with the treasure.”  “I thought you wanted to lift the curse.”  “The treasure and the curse are one and the same.” He noticed himself teasing the rope and let it fall. “So, I have given you the few answers I have, rose girl. Will you help me?”  You have very little understanding of the life of a girl at that time and in that place. You do not wake at the first hint of dawn or take to your bed at dusk because it is too dark to do anything else. You have never tried to eke a day’s nourishment from an onion and some rotting parsnips or squatted over a cesspit. Julianja’s life with Tzigana had presented her with precious few choices and all of those were predictable and circumscribed. She’d not even had the power to decide which chore to do first, whether to spend a dreary day sweeping dirt floors or scavenging firewood. Never had she had power over another—and a man, at that. His helplessness intoxicated her in a way she did not fully understand. Of course, she might have dismissed his plea. But then he would go and she would still be where she had always been and no longer wanted to be.  She reached for a stem and pinched it, impaling her forefinger. She blew her own red blood onto a blossom and nodded for him to approach.  The muscles of his jaw worked as he emptied his lungs, then he closed his eyes and pushed himself forward. He inhaled. Instantly his shoulders stiffened and his hands curled into fists and, with a shout, he was thrown backwards, arms windmilling. He sprawled at her feet, gibbering, and she dropped to her knees beside him. His eyes had rolled up. She grasped his tunic and rocked him from side to side, because he was too big for her to lift.  “Look at me, you. Look here.”  He blinked. Groaned.  “Did you see your future?”  He stared at her.  “Do you remember any of it?”  He shivered.  “Did you ask the question?”  His mouth fell open and he tapped two fingers to his lower lip. Drink.  She fetched the bucket from the well. Soon he was sitting up. Although he could not speak, he would nod or shake his head in response to questions. She thought he might have been struck dumb, although she had never witnessed such a severe reaction to the charm. Did this mean that he was unworthy to smell the rose? Had she violated some magical law by giving him access to the charm? Perhaps the witch would rise from the tomb to exact a revenge. At that moment, all she wanted was to get him out of the garden and back on the road. For want of anything better, she brought him a cup of cold porridge to help him regain his strength.  She offered the ladle and he swallowed the gluey mess. His tongue flicked. “It’s you.”  “What is?”  “My future. The curse. The treasure. You.”  Although she was certain he was wrong, the thought of escaping her life intrigued her. She wanted to know more, so when he was able to stand, she led him to his cart.  The mule grazed in the burdock at the side of the road. There was a mound of something in the cart, covered by hemp canvas treated with rosin against the weather. With eyes fixed on her, he pulled it aside. She caught her breath but did not otherwise react. Bones, so many bones, some the color of mushrooms, others gray as ash. Long femurs and delicate finger bones. Curved ribs, the bowl of a pelvis. A scatter of vertebrae and jaws with ragged arrays of teeth. She did not have to see the skulls to know that these were human remains. She counted two. Was that a third at the bottom of the pile?  “These are my ancestors,” said the knotted man. “Wizards, if the tales we’ve been told are to be believed. Dead so long before my father’s father’s time that their names are lost. We call them the uncles. Their bones were entrusted to our care at the castle, but they do not rest. We believe they want peace, and until they get it, our lives are not our own.”  “Cover them.” The other girls might return at any time. “I’ve seen enough of your treasure.”  He tugged the canvas into place. “The charm worked as my father said, although he never warned of the shock when it released me. I asked myself what the uncles wanted and I saw myself standing in the ruins of a church on a hill in the Badacsony overlooking Lake Balaton. With you.”  “And I was doing what?”  “Nothing,” he said. “Watching.”  This was not the answer she wanted. “How do you know it’s a true vision?”  “It’s your charm, rose girl. I don’t know how I know anything. I’ve never been to that place or to Lake Balaton. How did I know it was a ruined church? Where did I get the name Badacsony?” He rubbed his temples and grimaced. “But I saw you there.”  “You could be lying.”  He held out his hands, palms up, in surrender to her doubts. “Because I have seen what I have seen, I ask you now to come with me. But because there is no reason that you should, I’ll take myself down the road and find a field to spend the night.” He backed his mule between the shafts of the cart and tied ropes to its leather harness. “You may join me or not as you see fit.” He spoke in a low voice, almost as if talking to himself. “Why should I try to convince you? If the vision was true, you’ll be there. Perhaps you’ll decide to make the journey by yourself.”  He hauled himself onto the cart with a pained grunt. “I wanted none of this,” he said, “but the uncles are restless and my life is not my own.” He tapped his switch to the mule’s withers and it gave a brief, scraping bray of protest. “In the morning I will be on my way.”  One by one the girls returned to the witch’s house that night. They dined merrily and well. Frici came home with a loaf of black bread that was only a day old, which she broke into eight chunks. Gyuri, the baker’s son, was courting her with gifts of food, and now that Tzigana wasn’t around to scare him off, he had become quite bold. Even better, Erzebet presented them with a cut of fatty pork the size of a fist, although she would not reveal how she had secured this prize. They boiled the pork with cabbage and Erzebet was declared the cleverest of them all. All Julianja had to contribute to the meal were the last radishes from the garden. She did not speak of Nandor or the knotted man as the other girls chattered about how Pisti’s goat had got loose and wandered into the church or the boil on Father Vidor’s nose or what mischief this boy and that boy and the other had gotten into. As usual, Julianja did not take part in their gossiping.  You know already how little experience she had making decisions. Propped on her straw pallet with a good round log for a bolster, she stared into the night long after everyone had fallen silent. She, who had unwittingly shown the future to so many others, had never imagined her own. Tzigana had been her future, her past and her present. But the witch was dead and her roses were dying, even as the dowager had predicted. What hold did this place have on her? You might say the companionship of the girls, but the truth was that they resented her for earning Tzigana’s favor and she had little patience for them. Erzebet and Frici were already trysting with boys in the forest and would soon find their ways to beds in the village. Let the other girls spend the rest of their nights listening to Nandor and his lot snore. The witch’s last charm linked her future to that of the knotted man. She should go with him. Must go. Afterwards, if there was no place for her in the wide world, she could always make him return her to Tzigana’s house.  It took eight days for Julianja and the knotted man to reach the western shore of Lake Balaton. At first the roads were impossible, little more than dirt tracks that meandered through the forest, sometimes to emerge into a sunny field where stone-faced peasants watched them pass. Then they reached a town with a castle built on an old Roman road and began to make fifteen or twenty miles a day. This ancient thoroughfare had stood the test of time and traffic, except in the hamlets where pavers had been looted for buildings. Along the way they crossed innumerable rivers and streams, mostly at fords, sometimes on ferries and occasionally on a bridge.  The knotted man was a taciturn travelling companion. This suited Julianja, who was chary of his intent. They had yet to trust one another with their true names. At first he insisted that she ride on the cart while he walked beside, but soon she realized that they would make better progress if the mule were not pulling her weight. So she walked—usually on the opposite side of the cart from him—all the long day. When it rained, they got wet. When it didn’t, they were hot. She wasn’t sure which made her more uncomfortable. At dusk they would stop, gather wood for a fire, eat a simple dinner and then sleep under the cart.  The knotted man carried a purse that was fat with the king’s own denars. Although he claimed this was all the money he had in the world, he spent freely on provisions along the way: bread and cheese and pottage if they were near a village, salt pork and pickled herring and dried fruit for when they stopped in the forest. Julianja had never eaten so well at Tzigana’s. They drank no water, only small beer when it was available, or ale if it was not. She preferred the beer. Ale made her dizzy and then sleepy. The knotted man said she must never drink water while on the road, for the water of the country folk hated strangers and would loosen the bowels or light a fever in the unwary. Beer and ale were the traveler’s true friends. A man could live a week on small beer alone. Casting sidelong glances at him as they walked, she decided that he must speak from knowledge of the road. She found herself wishing he would speak to her more often.  But one thing puzzled her. He didn’t seem to be afraid, not of the beasts of the forest nor the brigands who lurked at every turning, if the stories were to be believed. He showed his purse as if it held only coppers. More than once she had noticed the hooded eyes of those who saw the glint of silver within its depths. The first time she asked about safeguards, he just shook his head. When she asked the second, he told her not to worry. It was not until she insisted that he told her that he and his family were protected by the uncles. Neither man nor beast nor force of nature could do them harm. This too was part of the treasure, he said, although not one that could be spent. “My father used to say that we should fear nothing, and expect nothing, which is why our treasure is also our curse. Once my family built a castle, but after decades tending the uncles, all that’s left is a ruin. As long as they rule us, we may have no ambitions of our own. They keep us safe, but the price is that we can never grow and prosper.”  She decided that the uncle’s protection charm must be the reason that he gave himself over to regular acts of lunacy. She had witnessed one when they had forded a river on the second day but it was nothing like the time that he jumped off the ferry into the Duna.  And swam. She had heard tales of swimming, but had thought them absurd.  The knotted man would strip off all his clothes. She did not scruple to stare at his body, which was as muscular and knotted as she had imagined. And yes, she made note of his penis. She had seen the members of toddling boys in her village, but never before that of a man. It seemed at once so delicate and misshapen that she wondered at the stories the other girls had told of its power to enthrall. But her glimpse of his penis was over as soon as he hurled himself head first into the murderous water. On the ferry, the captain cried out in alarm and let go of the tiller. The oarsmen all rushed to the side to proffer oars, tilting the deck. The mule whickered. And still he did not emerge from the depths. When he did, sputtering, he’d laughed at their concern. It had been the only time she had seen him merry. To demonstrate his prowess, he kicked his legs, his arms stroked rhythmically, his head dipped in and out of the river, all perfectly coordinated. It struck Julianja as a kind of gliding, watery dance, horizontal instead of vertical.  “I thought you said to avoid water?” she called.  “I’m not drinking it,” came his response. “I’m playing.”  At that moment she stopped questioning her decision to accompany the knotted man. Imagine that you believe, as the learned alchemists and philosophers did, that everything consists of four elements: earth, air, fire and water. Common folk negotiate their passage across the earth as a matter of course. However, only angels frolic in the sky, while devils alone reside in fire. To Julianja, the knotted man’s mastery of water as magical as any of the witch’s charms.  On the eighth day, the Roman road veered south so they left it behind. Late that afternoon they reached the western shore of the lake. Inquiring at a farmhouse where they bought fresh eggs, root cellar carrots and dried catfish, the ale-wife told them the ruined church of the knotted man’s vision was likely the kolostor of Mária Magdolna, near the village of Salföld on the eastern shore. A day’s journey, perhaps longer with the cart.  She’d known that the knotted man had been growing more agitated as they traveled, but now Julianja realized how overwrought he was. At times the next day he would leave Julianja with the cart to forge ahead, as if he thought to show the mule how to pick up its pace. Eventually he would wait for them to catch up and glare, first at the plodding animal, then at her, as if they had betrayed his trust. He balked at stopping for a midday meal. Even so, as evening’s shadows crept across the road, they could see that the hill on which the ruins stood was yet miles away. Reluctantly he diverted from the road to the shore of the lake to spend the night.  She built a fire and cooked the eggs while he paced the shore. There had been no small beer at the farmhouse and so they drank ale that was still fermenting with their meal. It was yeasty and sour and it settled in her belly like a stump. Afterwards she sat on a rock, mesmerized by the fire and the weight of the alcohol. The knotted man ceased his prowling and stripped.  “In the dark?” she said. “What should I do if something happens?”  “Fetch my corpse back to shore.”  He marched into the glitter cast by the gibbous moon. The sweltering night air carried the sound of his splashing as he chased a wary mother duck and her brood. After a moment she rose and pulled off her shift. Threading through the grass along the shore, she put her toes into the water and gasped. The knotted man glanced back at her. Did he wave an encouragement? Hard to tell, since he was just a shadow in the moonlight. Then he dove and was lost to sight. She found the water cool but not unpleasant, especially since her cheeks were burning. She waded, mud squishing between her toes, until the water was just above her knees, then sat all at once. She gasped at the lusciousness of the sensation, then ran hands over her slippery legs, slicked the tight skin of her belly, rubbed the gooseflesh of her arms. She cupped water to her face, splashed her hair until it clung to her neck. The world felt cool and new, dark with promise. Then he was coming ashore so she leapt up. She had slithered into her tunic by the time he reached the grass.  He dressed, then noticed that she was shivering. “Now will you get sick on me?” He retrieved a small jug from the cart. “Drink this.”  “What is it?”  “Tanglefoot.” He offered it to her. “Spirits, distilled at the castle. Take a big swallow.”  A gulp led to a fit of coughing. She might as well have breathed fire.  “Again,” he said.  He swigged from the jug himself as Julianja slumped onto her stone. Her body felt numb, but her mind was racing. “I don’t know your name,” she said.  He squatted beside her and gazed into the flames. “Miklos.”  She repeated it, savored the taste of it on her tongue, decided she liked it. “Miklos.” When she reached out toward him, he pretended not to notice. “How long does it take to dry, Miklos?” She touched the tight bundle of hair atop his head.  He started. “What did you say?”  “Your hair.”  He studied her. She was sure that he hadn’t paid this close attention since the day they had met.  “You should let it down,” she said. “It’ll dry faster.” As if to illustrate she shook her head back and forth and giggled as wet strands slapped at her face. “See?”  The expression on his face—was he puzzled? Alarmed? She laughed to get a response after so many miles of silence. With hands on either side of her head she sifted her wet locks between her fingers and held her hair out in two wings. “Like this.”  He considered and then, like a man caught in a dream, reached to the top knot and removed a silver pin, which he took between his teeth. He had divided a long ponytail into two halves and coiled them, one around the other. Eyes raised as if he could see the crown of his head, he now unwound each half. He dipped his head and they fell over his face, reunited into one long braid of hair splayed by gravity. She saw that it was held in place at the scalp by a ribbon of the same silk as the scarf he had worn that first day. She hadn’t seen the scarf since they crossed Duna. What did that mean? She didn’t know what anything meant anymore as he untied the ribbon and his dark, heavy hair came loose. His hands fell to his sides and he let the ribbon slip to the ground. She leaned close, parted the hair from in front of his eyes and sifted it between her fingers. She spread it into wet wings. Neither of them laughed.  “It is good this way,” she said. “I think so.”  He took the pin from his mouth and set it beside the ribbon. “What is your name, rose girl?” he said.  “Julianja,” she whispered.  The mad tremolo of a loon made them aware of how close they were. Embarrassed, they pulled back from the moment and one another. Miklos threw some sticks on the fire. She watched as if this were a skill she must learn.  “You say you have a family, Miklos?”  “My widowed mother. A younger brother.”  “No wife?”  “I am not permitted.” His eyes glittered in the firelight. “Perhaps after tomorrow.”  “And what will happen tomorrow?”  Miklos thought for a moment, then gave a bitter chuckle. “Only tomorrow knows.” He rose and walked away from the fire without bidding her good night.  If you do not understand Julianja, know that she did not understand herself either. And who can blame her? She was a girl who had never been farther from home than a day’s walk, who had never drunk tanglefoot or seen a man naked. She was a girl who had set her life aside to follow a cursed stranger on a quest that he could not—or would not—explain. What gave her the right to do this? She didn’t know exactly, but she believed that she had that right. It had something to do with the witch choosing her to work the charm in the garden. Dorottya had wanted to care for the roses, and she was the eldest. Erzebet had begged to be chosen and she was the prettiest. And yet it had been Julianja who had greeted Miklos when he’d come to the gate. Why? Maybe because when the other girls worked one of Tzigana’s charms, they said a witch’s prayer or rubbed a talisman. The charm was not in them the way it was in her. In Julianja’s blood. Julianja was the charm. Julianja was magic. Tanglefooted thoughts began to trip one another into drowsy darkness. Just before sleep came, she realized something important, although she would not remember it in the morning.  The reason Miklos did not stink like every other man she had ever met was that he liked to swim.  It took several hours to coax the mule up the steep track to the ruined kolostor. Lush summer growth of silkybent and ragweed and goose grass brushed against the bottom of the cart. From time to time, Miklos got behind to push. They found the ruins in a wood where saplings encroached on snaggle-toothed foundations. Deadwood leaned against the forlorn stone and mortar walls of buildings that had long since lost roofs. Miklos tethered the mule to graze and they split up to explore. Most of the valuables the monks had hoarded were gone, even some of the stone carvings had been carried off. Julianja kicked at a midden of shattered glass and pots in what she guessed was the refectory. All around her the buzz and chirp and hum of the natural world mocked the fleeting works of men. Just beyond the ruined wall a musk rose had returned to the wild, its unsupported canes bent to the ground. Most of the stems had gone to rose hips but there was one last spray of pink tinged blossoms. When Julianja lifted the flowers to her nose to smell, she pricked her finger. She stared at the bead of blood in surprise. She could feel her future closing in around her.  “Julianja!”  The western wall of the church had collapsed. The row of eight empty lancet windows on the eastern wall hinted at the lost wealth of the monastery. Much of the plaster on this wall had peeled away, revealing the rough stone beneath. But Julianja could make out a few murals, paint faded by weather. The sorrowful eyes of Christ watched as she made her way down the nave and the draped arm of a woman, perhaps the Magdalen reached out to her.  Miklos waited in the chancel, face flushed, eyes wild. “Here,” He stood on the altar, a broken slab of marble overthrown from a limestone pedestal. “In my vision I saw the bones here.”  They stripped away the hemp canvas that covered the bones and spread it beside the cart. They carried the treasure to the church in three trips. Miklos had no way to tell which bones belonged to which uncle, but, as a gesture of respect, he set just one skull and two halves of a pelvis in each of the bone piles they arranged before the altar. Then he fetched the skin of water he had filled at the lake that morning, poured it into a wooden bucket and produced the missing silk scarf. He explained that now he must wash the bones.  “Then what?”  “Then we will see if my father spoke truly.” He knelt, retrieved a heavy leg bone, dipped the scarf into the water, braced himself, and daubed gingerly at the knob end, as he was expecting it to twist from his grip or burst into flame. When nothing happened, he washed the bone and then placed it next to the pile from which he had retrieved it. He leaned back, waiting for some reaction. None came. He found another bone, dipped the scarf and washed. This bone he set atop the first. Nothing happened.  “May I help?” Julianja touched his shoulder.  He shook her off without looking up. He sorted through the pile, found the skull and held it, gazing for a moment at the empty eye sockets. Then he scrubbed as if it were a dirty cook pot. Finally satisfied, he tried to balance it on the two bones in the new pile. As soon as he withdrew his hand, it toppled onto its side, staring up at them in mute reproach.  “Must be all in all,” Miklos muttered.  “Let me help.” She hovered over him.  “No.” He pointed the jagged end of a broken femur at her and she backed away. “When I saw this in your garden, you were here but you only watched.”  He continued his task with flagging enthusiasm. He finished the first pile and scooted across the dirty floor of the chancel on his knees to the second. He worked faster now, carelessly. She saw him gather a knot of finger bones, give them a single swipe and toss them onto the second pile. He seemed resigned, like a man forced to play out his part in some humiliating practical joke.  As he washed, Julianja counted the bones to herself. Keeping a tally of his progress seemed like a kind of support, the only kind he would permit.  “A kurva életbe!” Finally he hurled the filthy scarf at the pile, picked up an armful of unwashed bones, stood and let them drop, one by one, to bounce and scatter.  “Miklos!”  “The bones do not dance.” He spun away from her, eyes red, cheeks wet. “My father promised they would dance. I’ve done everything I’m supposed to do, everything I can do.” He shoulders sagged. “For nothing.”  Seeing him so reduced filled Julianja with terror and pity and, yes, anger. She’d believed they would arrive safely at this place because he claimed to know the ways of the wide world. She’d trusted what he’d told her of his future. After all, hadn’t she herself shown it to him? But he’d deceived her—and probably himself. She realized he’d never told her that he had actually witnessed the lifting of the curse, only that she would be there when he tried. Seeing him now, defeated and unmanned, brought all her doubts back. And yet she wanted to help, if only because it was in her power. Julianja was powerful, in the same way the Tzigana had been. She was as certain of this as she was of the breath that swelled her lungs, the blood that pounded in her chest. When she bent to retrieve the scarf, it was like falling, at once inevitable and frightening. She picked a skull that poor Miklos had already washed and dipped the scarf into the bucket. As her hand touched water, she felt the finger she had pricked on the musk rose start to throb. A pink stain swirled in the clear water.  “But you just watched,” cried Miklos. “Watched only.”  The cold bone seemed to suck the warmth from the palm of her hand. Perhaps Miklos had experienced a true vision, but he had not seen all. When she swiped its brow, the skull blinked and gazed at her with milky, ghost eyes. She wanted to scream, but her throat closed with fear. Instead she turned his uncle’s terrible gaze on Miklos, who fell away as if she were showing him his death.  “Look,” she whispered.  All it took was a touch of the damp silk. Julianja might have called what the bones did a dance, although it was more like the rolling and tumbling of maggots. They would find their proper alignment and knit together. Watching them gather themselves made her feel unsure of her footing. It was as if the earth itself was twitching. First, one, then another, then all three uncles stood before them. But the uncles were no longer ghastly skeletons. A sinuous, indistinct glow suffused the bones, first as the flesh of transfigured, luminous bodies, then as the finery you might have seen at the Mátyás Palace in Buda. The shimmer of these magical creatures reminded Julianja of the way her legs had looked beneath the ripples of Lake Balaton.  One was dressed in an antique red cap with a feather, black velvet breeches and a red leather doublet with golden buttons. The second wore a green tunic embroidered with gold thread under a surcoat of silk so fine that it might have been spun from emeralds. The last wore a robe of midnight blue trimmed with ermine. Around his neck hung a heavy gold chain from which depended a brooch in the shape of a scroll inlaid with letters of lapis lazuli. All three uncles bore a resemblance to Miklos, although each was distinct. The red uncle was a jaunty rake who gave Julianja a sly look that made her flush. The green was older, more kindly, a man of substance whom she felt she might trust. She imagined that the solemn blue uncle, the eldest, had judged her at a glance and found her wanting.  “You have served our family well, Miklos Kemény.” The green uncle stretched, as if waking from a nap and not from the dead.  The blue was as impassive as an owl. “Much better than your father Miklos or his father Benci or his father Benedek, or his father Ambrus, who was the son of Lajos Kemény, our own dear brother.”  The red winked at Julianja. “No one of your line ever thought to bring us a beautiful witch.”  “I am not a witch,” said Julianja. But the words seemed to twist on her tongue. After all, hadn’t her blood just brought the three uncles back to the world of the living? Hadn’t she felt the stirring of her powers last night at the lake?  “Yet you are clearly the one we have been waiting for,” said the green. “What is your name, child?”  Julianja stiffened. She felt the uncles seeking to sway her. But why? They were Miklos’s ancestors. This was his quest.  The blue uncle scowled at her. “Say it!”  “Julianja,” said Miklos. “Her name is Julianja. What does it matter, her name, if the curse is lifted?”  “Come close, Julianja.” The red uncle crooked his finger and it was as if he had tugged at a tether around her waist. “You have done our family a great service, but there is something yet we must ask of you.”  The green gave her his gentle smile. “Know that, in life, we three brothers cast a charm so that we would not pass completely from this world when our bodies failed. The nature of that charm was such that we could exist between life and death in a place of our devising.”  “We realize now that was a trap,” said the blue, “and we have chosen you to help us escape it. We bind you by your name to choose a spouse this day. Whomever you chose will return to full life. The others will pass on.” He glared at his brothers as if daring them to differ. “We are so agreed.”  “What is this?” Miklos pushed past to confront the uncles. “What of the curse, of me and my family?”  The red uncle looked bored. “You have done well, Miklos son of Miklos.”  “Yes, I have,” he cried. “I have done all . . . ”  The blue held out his hand, palm facing Miklos, who immediately fell silent, although the muscles of his jaw worked as he struggled to speak. The uncle rotated his hand, palm upward, and flicked it twice toward the sky. Miklos lifted off the ground a few inches, dangling like laundry from a branch. He twisted frantically against invisible knots until the blue uncle closed his fist and he sagged into unconsciousness.  Sensing Julianja’s outrage at this ill treatment, the green uncle apologized. “We understand why he is angry, but there is still much to explain and little time. Don’t be afraid, we won’t harm him. He is of us, a Kemény.”  “I’m not afraid,” said Julianja, and was pleased to discover that this was true. “But neither am I impressed by the way you treat those who help you.”  “You may be right. Perhaps we have been too long away from the world.” The green spoke to her, but she guessed that he was also chiding his blue brother.  “Only choose,” said the blue, “and we will be done with curses.”  “Choose,” agreed the red.  “Yes, choose.” The green opened his arms wide, as if to embrace her.  She straightened, threw back her shoulders and found the inner strength to defy them, for all their magical power. “And what if I do not? Will you compel me?”  “You mistake us, Julianja.” The blue seemed offended. “We would not compel such a decision.”  Red laughed. “We would rather entice you.”  “For such a woman as you,” said the green, “the bride price would be very high indeed.”  You will understand why this would give Julianja pause, as a penniless orphan who was many days journey away from a household that might not welcome her return. She tried not to show her interest. “I would hear more,” she said.  The red spoke first. “Choose me so that I may fill your senses to overflowing. In this world that men have made, there is precious little room for a woman’s pleasure. You will blush at the thought, but I will lead you to a new world, where desire never wanes and cries of ecstasy fill the long night. You will never grow weary of love, nor bored of our marriage bed, for I will be a student of your body, so that I may learn all that you secretly crave but know not how to ask for. I will be all men to you and any man you fancy. This is within my power to offer you, Julianja, for all the days of your life.”  As she listened her cheeks burned and she imagined bare legs entwined, strong arms enfolding her, her blood shouting so that it drowned out all thought. She remembered then what Erzebet had whispered to her about the power of love, and understood for the first time.  The green bowed to her then. “My brother speaks truly. But the world he offers is a small world indeed. You have five senses, yes, but we are more than our senses. Choose me and together we will make a place in the world beyond the bedroom door. I will comfort and support you, and keep you forever safe from evil. Our friends will love us and strangers will admire us. You will be proud of all we accomplish together. Oh, and our beautiful children! I will be the father to them that every mother hopes for. I will cherish and nurture them so that they will prosper and bring joy to us. We will get kings and philosophers! This is within my power to offer you, Julianja, for all the days of your life.”  This future she knew, was no trick of imagination. She looked into the green’s smiling eyes and saw a great house, a long table laden with joints of meat and exotic fruit. Silver plate, crystal goblets and raven-haired children laughing, as she would laugh and laugh as she told them of her impoverished years with Tzigana. Julianja thought then of Dorottya, struggling to hold the dead witch’s household together.  The blue regarded her sternly. “My brothers speak the truth. Do not doubt their promises, but consider what I alone offer you. You have a talent that must be expressed, or you will surely live a life of regret. You deny that you are a witch. But witch is a word that men call women who have powers they do not understand. Powers they fear. I will help you understand who you are, discover what your unique abilities might be and what they can accomplish. Pleasure and the regard of others will only distract you from the task of knowing yourself, which is our true life’s work. I can show you the greatness which seethes within you. Don’t throw away this chance, Julianja, or you will rue what you’ve lost all the days of your life.”  This speech frightened her, for she knew already that she was powerful. She could only guess what she might be capable of. The blue expected more from her than she expected from herself. She wasn’t sure that she wanted this greatness he spoke of, even if it did dwell within her. Had Tzigana made a similar choice to perfect her abilities? If so, Julianja had witnessed its cost. She had been powerful, but never happy.  And yet, as tempting as each of these offers was in its own way, the manner in which they were being offered annoyed her. The uncles were so confident that what they proposed was what she must want. “Why must I chose any of you?” She stamped her foot. “What if I want all of what you offer? Or none of it? And if I do chose, why should it be one of you? Why shouldn’t I choose him?” She turned to gesture at the slumbering Miklos. At least he was a man of honest flesh and blood, not a construct of bones and dark magic.  The red uncle sneered in disbelief. The blue uncle shook his head sadly. Only the green uncle pleaded with her. “Would you really choose an ordinary life, when we can make dreams real? He may be a good man, but what he can give you is just the smallest part of what we offer.”  “Nevertheless . . . ” she said, but when she turned back to them she found that she had chosen, as so many of us do, without meaning to. Was it because she refused to embrace their choices and had argued with them? Or because she truly wanted Miklos? No matter. In the flicker of indecision, the moment passed. The uncles were gone and in their places were three sorry mounds of dust.  Miklos groaned and slumped to the floor of the chancel.  You may ask, what happened next? That evening and the next morning and ever after? You may wonder, as Julianja did, whether she was bound by the charm of the uncles. Since she had thwarted them, she believed she was not. She considered the unconscious Miklos, whom she had freed from his family curse. Should she now accompany him to the castle of Kisvárda? And if she did, would she ever understand why?  Recall what Tzigana told Miklos, father of Miklos, back when that brave and disappointed man ventured into her garden. No one’s mind can hold an entire life at once. But believe this: Julianja would think about that summer afternoon for years to come. Not every day, but on occasion. Because, like all of us, there would be times when she was frustrated with her life, when she could not help but imagine what might have been.  And yet there is one last thing for you to know. Before she went to awaken Miklos from his trance, before she decided what she would do with him, Julianja overturned his leaky bucket. The pink-tinged water she had used to wake the bones spilled down the broken altar stone and darkened the thirsty earth. She carried the bucket to the piles of dust, knelt and scooped three handfuls from each into it. As she did this, she vowed to the witch Tzigana, Mária Magdolna and the Blessed Virgin that someday she would scatter the treasure of the Kemény onto the roses in a charmed garden that would be hers, and hers alone.  James Patrick Kelly has won the Hugo, Nebula and Locus awards; his fiction has been translated into twenty-one languages. His most recent story collections were this year's The Promise of Space from Prime Books and Masters of Science Fiction: James Patrick Kelly published by Centipede Press in 2016. His most recent novel, Mother Go, was published in 2017 as an Audible original audiobook on Audible.com. He writes a column on the internet for Asimov's Science Fiction Magazine and is on the faculty of the Stonecoast Creative Writing MFA Program at the University of Southern Maine.", "text": "9870 words, novelette\nThe Rose Witch\nMost in that country called Tzigana a witch, though never to her face. Now that she was dead, you would expect that the girls who had lived in her tumbledown house might say whatever they wished. But none dared speak against the old woman. All but one continued to bless her memory, constructing imagined kindnesses out of blankets as thin as soldiers’ socks, candle stubs dipped from scrap wax, and joints of stringy goat for the turnip soup. They even pretended to mourn. Julianja was disgusted by their cold tears, but she kept quiet and watched for what would happen next. She respected and feared Tzigana, even now. If the old woman rose from the dead to snatch a girl for company in the tomb, Julianja wouldn’t have been surprised.\nWhat was to become of them? Dorottya, the elder of the twins, had taken charge, but she had neither the experience nor the sense to run a household. They were seven girls, ranging in age from eleven to twenty, all little better than servants. Tzigana had taken them on as apprentices, yet she had shared little of her arcane knowledge. Frici could spark fire from the tips of her forefingers and Zsuzsanna could draw the ache from strained muscles and Julianja could make roses breathe, but these skills wouldn’t pay for the meat or salt or shoes they needed.\nDorottya declared they must seek work away from the house and sent the girls to trade with the houses of men. They offered to sew and bake, tend vegetable patches and put up preserves, chop wood and sweep floors. Julianja knew this plan would never succeed. The women who lived with men would not welcome needy girls. For her part, Julianja refused to leave the old witch’s garden, since it was the only light in her dim life. No argument or censure would move her.\nYou may be right to despise Tzigana. In life, she neglected most of what we hold dear. She let magic consume her and paid as little heed to the house as she did to history or the troubles of her country. Certainly she loved her roses more than the girls who were her charges. But she had used her wits to impose her austere order on the world. While hers was rarely a joyous place, no one there went hungry. No one took sick, thanks to the witch’s charms. The girls might complain, but they stayed until they were sent away. Each was treated equally so they might become their truest selves, away from the plans and strictures and desires of men. And of course Tzigana’s garden drew noble visitors. She left the world more beautiful than she found it. How many of us can say the same?\nThe girls seemed to be managing without their mistress, although Julianja wasn’t fooled. The house was but two days’ walk from the town of Szeged and a few of the girls found work nearby, especially pretty Erzebet. But then boys started following them back to the house. Dorottya knew enough not to let the rascals in, but they would climb the chicken coop and call through the windows. They soon learned better than to try to cut through Julianja’s roses; she was merciless with her birch switch.\nBy the time the roses bloomed, the garden was hers alone. The other girls were either too busy or too lazy to help Julianja tend it. Where once she had hung back while the witch had greeted the seekers who came to her garden, now she waited by herself at the gate to receive them. With Tzigana gone, however, only a few came.\nThe frail bishop arrived swaddled in furs and bundled in a horsehair blanket and still he looked cold and blue, even in the heat of early summer. He staggered to a Damask rose, which presented in delicate sprays of semi-double flowers. Tzigana claimed that it came from stock which the Crusader King András himself had brought back from the Holy Land; it was red as blood of infidels. The bishop wheezed as he breathed in its scent, then pressed his usual denar into Julianja’s hand and left without another word. The boar prince spoke only German but indicated his preference for the pink cabbage rose by snuffling at it with his blunt snout. Afterwards he scrabbled back into his golden palanquin and was borne away by his four squires without leaving so much as a copper.\nIn the past, there had been almost as many women as men visiting, but that year only the dowager Baroness came in her dusty carriage. She peered at Julianja over her glasses, the left lens of which was cracked down the middle.\n“Is she sick?”\nJulianja met her watery gaze boldly. “Dead.”\n“No.” The woman gasped and cupped hands to the sides of her head, as if she could not hear through her wimple. “Dead?”\n“It was Palm Sunday. We were at Mass.”\n“Did she say anything?”\n“She told Dorottya that her legs were cold. As she rose to receive the Sacrament, she collapsed.”\n“I mean about me.”\nJulianja shook her head.\n“She should have forseen this. Now who will take care of the roses?”\n“I will.” Julianja ground her bark sandal against the path, staking out her claim. “As you see.”\nThe dowager gave an unhappy laugh. “You can try.” She gestured with her walking stick. “Take me there.” Her special mountain rose was a particular favorite of the bees. It was a climber, the flush of creamy blossoms carried high. Julianja went up on tiptoes and brushed the bees away with the back of her hand, then bent one of the stems toward her. The thorns of this rose were mere prickles and she had to worry at one until she had stabbed her forefinger deep enough to draw blood. She watched the bead grow before pointing at the closest bloom and blowing a spray of blood at the crown of yellow stamens.\n“Be quick about it,” commanded the dowager.\nStill holding the stem, Julianja twisted away to make room. She braced for a lash across the legs that did not come. Instead, the dowager brushed past her and buried her face in the charmed flower Her snuffling reminded Julianja of the boar. When her head lolled away, Julianja released the stem and it sprang into place.\nTzigana had first used Julianja to create the rose charm three summers ago, after she had sent Vica away. Year after year the girl had watched as the highborn had been transported by the mingling of her blood and the perfume of the blossoms, and yet never understood how it happened or what they felt. She’d always wanted to know, but Tzigana had laughed whenever she asked. Or cursed her. But Tzigana was in her tomb.\n“What is it?” said Julianja. “Tell me.”\nThe dowager shivered as if awakening from a dream and then thrust her face close to Julianja’s. The crack in her glasses made her left eye seem to be doubled. “How old are you?”\nJulianja’s mother had sold her to Tzigana when she was but a child, and if the witch knew the day of her birth, she had never said. Julianja had started bleeding last summer, and Zsuzsanna said that meant she was sixteen, but Frici said no, she might be fourteen or even seventeen. Every girl had a different time. “Old enough,” she said.\n“Maybe you are.” The dowager pinched Julianja’s breast. “Have you been with a boy yet?”\nShe slapped at the woman’s hand twice before she let go. Julianja would have slapped her face, but the woman thrust the knob of her walking stick at the girl to ward the blow off.\n“No matter. If the old woman is truly gone, then her garden must die.” She fumbled with the drawstrings of her purse and dropped a handful of denars into a patch of speedwell. “These roses don’t want you, peasant.”\nJulianja had been trying not to see this. While the rest of the garden bloomed as usual, the roses were failing. She’d been fighting brown canker since the canes had first come into bud, and she’d spent the last week stripping away leaves infected with the powdery mildew. The sulfur dust that Tzigana had left was nearly gone and there was no money to buy more. Only the humble dog rose, scrambling up the cherry tree, had been spared. Dorottya talked about pulling up the sick plants and giving the space over to paprika peppers. The girls could dry the chilies, grind them and sell the spice that fall at market. The idea made Julianja furious.\nAs June gave way to July, she worked harder to save the roses. One hot day she was at the fence, pruning dead wood from a pink rambler that had once covered the rails in every direction. She wore only her shift against the heat; damp coils of hair matted against her forehead.\n“Hello bogárkám.” Nandor, the carpenter’s son, had big feet and a silly grin, which always got sillier whenever he saw Julianja.\n“I am not your little bug. Go away. None of the girls are home today.”\n“Except you.” He leaned across the fence.\n“That’s saxifrage you’re crushing, blockhead.”\nHe clasped both hands to his chest. “And it’s my heart you’re crushing, dear girl.” His face was pale and as big as the moon.\nWhen she reached for her birch switch, Nandor danced backwards, laughing. “I will submit to your lash gladly,” he said, hands held high in the air, “if only you’ll submit to mine.”\nThey both heard the creaking before they saw the cart. And they spotted the mule before they glimpsed the knotted man.\n“Be on your guard, Juli,” said Nandor in a low voice. “These beggars are everywhere. First they ask for what is not theirs, then they steal it.”\nThe knotted man wore a homespun tunic over an undershirt; his dun breeches came to the knee and his lower legs were wrapped in linen. But what you would have noticed first about this traveler were the knots, some for show, some necessary. His tunic was held closed by strips of tied leather and was fringed with knotted wool. He wore a finely braided rope for a belt, and a silk scarf secured around his neck against the dust of the road. He had a boy’s face with only a scraggle of beard but his long black hair was tied in a topknot in the soldier’s style. They say that this makes the warlike seem fiercer, or at least taller. But the knotted man carried no weapons. For her part, Julianja was struck by the set of his jaw and the muscles of his cheeks, which seemed bunched in concentration, or perhaps pain. She did not think him a beggar, but neither did he appear to be a man of substance. The lone plodding mule and the cart with its solid wheels and its dusty wickerwork sides spoke of hard nights under the sky.\nAs he climbed down to them, foolish Nandor challenged him without asking her permission. “Hold, stranger, and state your business here.” He squared his skinny shoulders. “These girls are under my protection.” He glanced back to gauge Julianja’s reaction.\nWhile he was thus distracted, the knotted man cuffed the boy. It was just a glancing blow, but Nandor collapsed as if his bones had turned to noodles. “My business is none of yours,” said the knotted man, “and my affairs are mine alone.”\nNandor did not reply. His mouth was slack, eyes empty.\n“Go.” He hauled the boy upright and aimed him down the road. “This girl has no need of protection from me.” The boy weaved away as if he had been drinking his father’s pálinka.\nThe knotted man stepped to the garden gate. “She is dead then,” he said. “Did many come to her garden after?”\n“Some. Fewer than before.”\n“Where is she buried?”\n“In a cave.”\n“Sealed?”\n“With a boulder.”\n“How big?”\nJulianja raised a hand over her head then spread her arms.\nThe knotted man grunted. “I was told there was a dark-haired girl who made the roses breathe.”\n“Vica. She grew up and was sent away.”\n“And you are?”\nWhile Tzigana had shared precious little of her arts with her girls, she had impressed on them the charmed power of their true names. She was not about to give a stranger influence over her. “The rose girl,” she said.\nHe seemed annoyed by her answer, but let it pass. “Already they are dying?” He reached out to snap one of the blackened twigs entwined in the fence. “Are there any left?”\nJulianja was tired of his questions. She had some of her own. “My affairs are mine alone.”\n“Just so.” His smile of acknowledgment was tight. “If you are the rose girl, then you can perform the charm. I’ve come from the castle of Kisvárda and crossed the Great Alföld to learn my future.”\nJulianja managed to conceal her excitement. No visitor had ever revealed his purpose before, at least, not to her. “I’ve never heard of this castle of yours, sir. Tzigana taught that entry here is a privilege.” She bowed as if to dismiss him. “A shame to have travelled this far in vain.”\nHe gripped the top of the gate so tight that it complained on its hinges. “What is it you want, rose girl?”\nShe paused to consider, for she couldn’t remember anyone ever asking her such a question. “Answers.”\nThe knots on his knuckles relaxed. “If I have them, they’re yours.”\nShe took his measure as she led him to the back of the garden. He was surely more than a boy but less than a man in full. He made a motley impression. His stride had resolve and confidence, and hard use had yet to stoop his shoulders. While his clothes were common, they were unusually clean for a traveler; there were no smears of mud on his leggings. He had the sweet scent of wood smoke about him, but not the stink of ancient sweat. Had he bathed and washed his clothes before arriving at the witch’s garden? And what to make of the rough cart and the bony mule? He may well have come from a castle, although not one that prospered. She sensed an odd tension to him, like a rope that has been twisted too tight, or a sapling bent for a twitch snare.\nThey stopped by the cherry tree. “Only the dog rose is still blooming,” she said.\n“Good.” He gazed up at the wild climber with its profusion of simple pink-tinged blossoms. “This is the one.”\n“You have been here before?”\n“No. My father visited the year I was born. He’s dead now, like your witch.”\n“So the castle is yours now?”\n“I sleep beneath its walls.” He laughed bitterly. “So do our goats. Castle Kisvárda has been a ruin since the reign of Mátyás the Just.” Seeing her indignation at being misled, he held up a hand to beg patience. “It’s mine, but my sad birthright includes a curse. My father said I might consult the roses to find out if I am the one to lift it.”\nJulianja couldn’t decide if she should send him away or not. She’d never worked the charm on the dog rose because nobody had ever chosen it. Perhaps it waited for some eminence from even farther away than this pitiable traveler, someone who was even now on his way to her. “A curse?” she said.\n“He was a man who was never easy in the wide world with its getting and spending. He was honorable, for all that, and came here to discover if it was his fate to lift our curse. He never said what he learned, but he came home a disappointed man.”\n“And now here you are. What do you expect to find out?”\n“He called me to his deathbed, and told me that I should gather the family treasure and seek the fearsome witch Tzigana, as he had done in his time. He told me that I must convince her to let me pass into her garden, where a dark-haired girl would lead me to its humblest rose. There I must breathe its charmed breath. He told me what to expect after, although had he not been my own good father, I would have thought him mad. He claimed that in the instant he smelled this rose, all of his long life happened. He could see the inside of his mother’s womb, the coffin he would lie in and everything in between. Each day of his past he lived again as well as all the days of his future, only outside of time. All and all. Perfect memory, perfect foresight. And so, he claimed, it would be for me. But I ask you, how can you remember something that hasn’t yet happened? The Doctors of the Church teach that we have free will. How is that possible if our futures are already ordained?”\nFascinated as she was by this story, Julianja could not resist interrupting the knotted man. “You bring not only a curse, sir, but also a treasure?”\nHe shook his head. “A treasure in the same way that Kisvárda is a castle. It is of value only to my family.” He waved towards the gate. “In my cart. I will show it to you after, if you like.”\nShe tried to square this tale with the reactions of other visitors she had observed. The dowager and the bishop and the boar had come many times to the garden, and had never once seemed awed by their experience. Had they become jaded by the roses? “Aren’t you afraid to know the future?”\n“I am.” The knotted man hooked the rope cinched around his waist and rolled it between thumb and forefinger. “But my father assured me that when time started for him again, the vision passed. Tzigana told him that no man’s mind can hold his entire life at once, so he must ask himself one question while under the charm. The answer would be all that he clearly remembered. And so I will ask what I must do with the treasure.”\n“I thought you wanted to lift the curse.”\n“The treasure and the curse are one and the same.” He noticed himself teasing the rope and let it fall. “So, I have given you the few answers I have, rose girl. Will you help me?”\nYou have very little understanding of the life of a girl at that time and in that place. You do not wake at the first hint of dawn or take to your bed at dusk because it is too dark to do anything else. You have never tried to eke a day’s nourishment from an onion and some rotting parsnips or squatted over a cesspit. Julianja’s life with Tzigana had presented her with precious few choices and all of those were predictable and circumscribed. She’d not even had the power to decide which chore to do first, whether to spend a dreary day sweeping dirt floors or scavenging firewood. Never had she had power over another—and a man, at that. His helplessness intoxicated her in a way she did not fully understand. Of course, she might have dismissed his plea. But then he would go and she would still be where she had always been and no longer wanted to be.\nShe reached for a stem and pinched it, impaling her forefinger. She blew her own red blood onto a blossom and nodded for him to approach.\nThe muscles of his jaw worked as he emptied his lungs, then he closed his eyes and pushed himself forward. He inhaled. Instantly his shoulders stiffened and his hands curled into fists and, with a shout, he was thrown backwards, arms windmilling. He sprawled at her feet, gibbering, and she dropped to her knees beside him. His eyes had rolled up. She grasped his tunic and rocked him from side to side, because he was too big for her to lift.\n“Look at me, you. Look here.”\nHe blinked. Groaned.\n“Did you see your future?”\nHe stared at her.\n“Do you remember any of it?”\nHe shivered.\n“Did you ask the question?”\nHis mouth fell open and he tapped two fingers to his lower lip. Drink.\nShe fetched the bucket from the well. Soon he was sitting up. Although he could not speak, he would nod or shake his head in response to questions. She thought he might have been struck dumb, although she had never witnessed such a severe reaction to the charm. Did this mean that he was unworthy to smell the rose? Had she violated some magical law by giving him access to the charm? Perhaps the witch would rise from the tomb to exact a revenge. At that moment, all she wanted was to get him out of the garden and back on the road. For want of anything better, she brought him a cup of cold porridge to help him regain his strength.\nShe offered the ladle and he swallowed the gluey mess. His tongue flicked. “It’s you.”\n“What is?”\n“My future. The curse. The treasure. You.”\nAlthough she was certain he was wrong, the thought of escaping her life intrigued her. She wanted to know more, so when he was able to stand, she led him to his cart.\nThe mule grazed in the burdock at the side of the road. There was a mound of something in the cart, covered by hemp canvas treated with rosin against the weather. With eyes fixed on her, he pulled it aside. She caught her breath but did not otherwise react. Bones, so many bones, some the color of mushrooms, others gray as ash. Long femurs and delicate finger bones. Curved ribs, the bowl of a pelvis. A scatter of vertebrae and jaws with ragged arrays of teeth. She did not have to see the skulls to know that these were human remains. She counted two. Was that a third at the bottom of the pile?\n“These are my ancestors,” said the knotted man. “Wizards, if the tales we’ve been told are to be believed. Dead so long before my father’s father’s time that their names are lost. We call them the uncles. Their bones were entrusted to our care at the castle, but they do not rest. We believe they want peace, and until they get it, our lives are not our own.”\n“Cover them.” The other girls might return at any time. “I’ve seen enough of your treasure.”\nHe tugged the canvas into place. “The charm worked as my father said, although he never warned of the shock when it released me. I asked myself what the uncles wanted and I saw myself standing in the ruins of a church on a hill in the Badacsony overlooking Lake Balaton. With you.”\n“And I was doing what?”\n“Nothing,” he said. “Watching.”\nThis was not the answer she wanted. “How do you know it’s a true vision?”\n“It’s your charm, rose girl. I don’t know how I know anything. I’ve never been to that place or to Lake Balaton. How did I know it was a ruined church? Where did I get the name Badacsony?” He rubbed his temples and grimaced. “But I saw you there.”\n“You could be lying.”\nHe held out his hands, palms up, in surrender to her doubts. “Because I have seen what I have seen, I ask you now to come with me. But because there is no reason that you should, I’ll take myself down the road and find a field to spend the night.” He backed his mule between the shafts of the cart and tied ropes to its leather harness. “You may join me or not as you see fit.” He spoke in a low voice, almost as if talking to himself. “Why should I try to convince you? If the vision was true, you’ll be there. Perhaps you’ll decide to make the journey by yourself.”\nHe hauled himself onto the cart with a pained grunt. “I wanted none of this,” he said, “but the uncles are restless and my life is not my own.” He tapped his switch to the mule’s withers and it gave a brief, scraping bray of protest. “In the morning I will be on my way.”\nOne by one the girls returned to the witch’s house that night. They dined merrily and well. Frici came home with a loaf of black bread that was only a day old, which she broke into eight chunks. Gyuri, the baker’s son, was courting her with gifts of food, and now that Tzigana wasn’t around to scare him off, he had become quite bold. Even better, Erzebet presented them with a cut of fatty pork the size of a fist, although she would not reveal how she had secured this prize. They boiled the pork with cabbage and Erzebet was declared the cleverest of them all. All Julianja had to contribute to the meal were the last radishes from the garden. She did not speak of Nandor or the knotted man as the other girls chattered about how Pisti’s goat had got loose and wandered into the church or the boil on Father Vidor’s nose or what mischief this boy and that boy and the other had gotten into. As usual, Julianja did not take part in their gossiping.\nYou know already how little experience she had making decisions. Propped on her straw pallet with a good round log for a bolster, she stared into the night long after everyone had fallen silent. She, who had unwittingly shown the future to so many others, had never imagined her own. Tzigana had been her future, her past and her present. But the witch was dead and her roses were dying, even as the dowager had predicted. What hold did this place have on her? You might say the companionship of the girls, but the truth was that they resented her for earning Tzigana’s favor and she had little patience for them. Erzebet and Frici were already trysting with boys in the forest and would soon find their ways to beds in the village. Let the other girls spend the rest of their nights listening to Nandor and his lot snore. The witch’s last charm linked her future to that of the knotted man. She should go with him. Must go. Afterwards, if there was no place for her in the wide world, she could always make him return her to Tzigana’s house.\nIt took eight days for Julianja and the knotted man to reach the western shore of Lake Balaton. At first the roads were impossible, little more than dirt tracks that meandered through the forest, sometimes to emerge into a sunny field where stone-faced peasants watched them pass. Then they reached a town with a castle built on an old Roman road and began to make fifteen or twenty miles a day. This ancient thoroughfare had stood the test of time and traffic, except in the hamlets where pavers had been looted for buildings. Along the way they crossed innumerable rivers and streams, mostly at fords, sometimes on ferries and occasionally on a bridge.\nThe knotted man was a taciturn travelling companion. This suited Julianja, who was chary of his intent. They had yet to trust one another with their true names. At first he insisted that she ride on the cart while he walked beside, but soon she realized that they would make better progress if the mule were not pulling her weight. So she walked—usually on the opposite side of the cart from him—all the long day. When it rained, they got wet. When it didn’t, they were hot. She wasn’t sure which made her more uncomfortable. At dusk they would stop, gather wood for a fire, eat a simple dinner and then sleep under the cart.\nThe knotted man carried a purse that was fat with the king’s own denars. Although he claimed this was all the money he had in the world, he spent freely on provisions along the way: bread and cheese and pottage if they were near a village, salt pork and pickled herring and dried fruit for when they stopped in the forest. Julianja had never eaten so well at Tzigana’s. They drank no water, only small beer when it was available, or ale if it was not. She preferred the beer. Ale made her dizzy and then sleepy. The knotted man said she must never drink water while on the road, for the water of the country folk hated strangers and would loosen the bowels or light a fever in the unwary. Beer and ale were the traveler’s true friends. A man could live a week on small beer alone. Casting sidelong glances at him as they walked, she decided that he must speak from knowledge of the road. She found herself wishing he would speak to her more often.\nBut one thing puzzled her. He didn’t seem to be afraid, not of the beasts of the forest nor the brigands who lurked at every turning, if the stories were to be believed. He showed his purse as if it held only coppers. More than once she had noticed the hooded eyes of those who saw the glint of silver within its depths. The first time she asked about safeguards, he just shook his head. When she asked the second, he told her not to worry. It was not until she insisted that he told her that he and his family were protected by the uncles. Neither man nor beast nor force of nature could do them harm. This too was part of the treasure, he said, although not one that could be spent. “My father used to say that we should fear nothing, and expect nothing, which is why our treasure is also our curse. Once my family built a castle, but after decades tending the uncles, all that’s left is a ruin. As long as they rule us, we may have no ambitions of our own. They keep us safe, but the price is that we can never grow and prosper.”\nShe decided that the uncle’s protection charm must be the reason that he gave himself over to regular acts of lunacy. She had witnessed one when they had forded a river on the second day but it was nothing like the time that he jumped off the ferry into the Duna.\nAnd swam. She had heard tales of swimming, but had thought them absurd.\nThe knotted man would strip off all his clothes. She did not scruple to stare at his body, which was as muscular and knotted as she had imagined. And yes, she made note of his penis. She had seen the members of toddling boys in her village, but never before that of a man. It seemed at once so delicate and misshapen that she wondered at the stories the other girls had told of its power to enthrall. But her glimpse of his penis was over as soon as he hurled himself head first into the murderous water. On the ferry, the captain cried out in alarm and let go of the tiller. The oarsmen all rushed to the side to proffer oars, tilting the deck. The mule whickered. And still he did not emerge from the depths. When he did, sputtering, he’d laughed at their concern. It had been the only time she had seen him merry. To demonstrate his prowess, he kicked his legs, his arms stroked rhythmically, his head dipped in and out of the river, all perfectly coordinated. It struck Julianja as a kind of gliding, watery dance, horizontal instead of vertical.\n“I thought you said to avoid water?” she called.\n“I’m not drinking it,” came his response. “I’m playing.”\nAt that moment she stopped questioning her decision to accompany the knotted man. Imagine that you believe, as the learned alchemists and philosophers did, that everything consists of four elements: earth, air, fire and water. Common folk negotiate their passage across the earth as a matter of course. However, only angels frolic in the sky, while devils alone reside in fire. To Julianja, the knotted man’s mastery of water as magical as any of the witch’s charms.\nOn the eighth day, the Roman road veered south so they left it behind. Late that afternoon they reached the western shore of the lake. Inquiring at a farmhouse where they bought fresh eggs, root cellar carrots and dried catfish, the ale-wife told them the ruined church of the knotted man’s vision was likely the kolostor of Mária Magdolna, near the village of Salföld on the eastern shore. A day’s journey, perhaps longer with the cart.\nShe’d known that the knotted man had been growing more agitated as they traveled, but now Julianja realized how overwrought he was. At times the next day he would leave Julianja with the cart to forge ahead, as if he thought to show the mule how to pick up its pace. Eventually he would wait for them to catch up and glare, first at the plodding animal, then at her, as if they had betrayed his trust. He balked at stopping for a midday meal. Even so, as evening’s shadows crept across the road, they could see that the hill on which the ruins stood was yet miles away. Reluctantly he diverted from the road to the shore of the lake to spend the night.\nShe built a fire and cooked the eggs while he paced the shore. There had been no small beer at the farmhouse and so they drank ale that was still fermenting with their meal. It was yeasty and sour and it settled in her belly like a stump. Afterwards she sat on a rock, mesmerized by the fire and the weight of the alcohol. The knotted man ceased his prowling and stripped.\n“In the dark?” she said. “What should I do if something happens?”\n“Fetch my corpse back to shore.”\nHe marched into the glitter cast by the gibbous moon. The sweltering night air carried the sound of his splashing as he chased a wary mother duck and her brood. After a moment she rose and pulled off her shift. Threading through the grass along the shore, she put her toes into the water and gasped. The knotted man glanced back at her. Did he wave an encouragement? Hard to tell, since he was just a shadow in the moonlight. Then he dove and was lost to sight. She found the water cool but not unpleasant, especially since her cheeks were burning. She waded, mud squishing between her toes, until the water was just above her knees, then sat all at once. She gasped at the lusciousness of the sensation, then ran hands over her slippery legs, slicked the tight skin of her belly, rubbed the gooseflesh of her arms. She cupped water to her face, splashed her hair until it clung to her neck. The world felt cool and new, dark with promise. Then he was coming ashore so she leapt up. She had slithered into her tunic by the time he reached the grass.\nHe dressed, then noticed that she was shivering. “Now will you get sick on me?” He retrieved a small jug from the cart. “Drink this.”\n“What is it?”\n“Tanglefoot.” He offered it to her. “Spirits, distilled at the castle. Take a big swallow.”\nA gulp led to a fit of coughing. She might as well have breathed fire.\n“Again,” he said.\nHe swigged from the jug himself as Julianja slumped onto her stone. Her body felt numb, but her mind was racing. “I don’t know your name,” she said.\nHe squatted beside her and gazed into the flames. “Miklos.”\nShe repeated it, savored the taste of it on her tongue, decided she liked it. “Miklos.” When she reached out toward him, he pretended not to notice. “How long does it take to dry, Miklos?” She touched the tight bundle of hair atop his head.\nHe started. “What did you say?”\n“Your hair.”\nHe studied her. She was sure that he hadn’t paid this close attention since the day they had met.\n“You should let it down,” she said. “It’ll dry faster.” As if to illustrate she shook her head back and forth and giggled as wet strands slapped at her face. “See?”\nThe expression on his face—was he puzzled? Alarmed? She laughed to get a response after so many miles of silence. With hands on either side of her head she sifted her wet locks between her fingers and held her hair out in two wings. “Like this.”\nHe considered and then, like a man caught in a dream, reached to the top knot and removed a silver pin, which he took between his teeth. He had divided a long ponytail into two halves and coiled them, one around the other. Eyes raised as if he could see the crown of his head, he now unwound each half. He dipped his head and they fell over his face, reunited into one long braid of hair splayed by gravity. She saw that it was held in place at the scalp by a ribbon of the same silk as the scarf he had worn that first day. She hadn’t seen the scarf since they crossed Duna. What did that mean? She didn’t know what anything meant anymore as he untied the ribbon and his dark, heavy hair came loose. His hands fell to his sides and he let the ribbon slip to the ground. She leaned close, parted the hair from in front of his eyes and sifted it between her fingers. She spread it into wet wings. Neither of them laughed.\n“It is good this way,” she said. “I think so.”\nHe took the pin from his mouth and set it beside the ribbon. “What is your name, rose girl?” he said.\n“Julianja,” she whispered.\nThe mad tremolo of a loon made them aware of how close they were. Embarrassed, they pulled back from the moment and one another. Miklos threw some sticks on the fire. She watched as if this were a skill she must learn.\n“You say you have a family, Miklos?”\n“My widowed mother. A younger brother.”\n“No wife?”\n“I am not permitted.” His eyes glittered in the firelight. “Perhaps after tomorrow.”\n“And what will happen tomorrow?”\nMiklos thought for a moment, then gave a bitter chuckle. “Only tomorrow knows.” He rose and walked away from the fire without bidding her good night.\nIf you do not understand Julianja, know that she did not understand herself either. And who can blame her? She was a girl who had never been farther from home than a day’s walk, who had never drunk tanglefoot or seen a man naked. She was a girl who had set her life aside to follow a cursed stranger on a quest that he could not—or would not—explain. What gave her the right to do this? She didn’t know exactly, but she believed that she had that right. It had something to do with the witch choosing her to work the charm in the garden. Dorottya had wanted to care for the roses, and she was the eldest. Erzebet had begged to be chosen and she was the prettiest. And yet it had been Julianja who had greeted Miklos when he’d come to the gate. Why? Maybe because when the other girls worked one of Tzigana’s charms, they said a witch’s prayer or rubbed a talisman. The charm was not in them the way it was in her. In Julianja’s blood. Julianja was the charm. Julianja was magic. Tanglefooted thoughts began to trip one another into drowsy darkness. Just before sleep came, she realized something important, although she would not remember it in the morning.\nThe reason Miklos did not stink like every other man she had ever met was that he liked to swim.\nIt took several hours to coax the mule up the steep track to the ruined kolostor. Lush summer growth of silkybent and ragweed and goose grass brushed against the bottom of the cart. From time to time, Miklos got behind to push. They found the ruins in a wood where saplings encroached on snaggle-toothed foundations. Deadwood leaned against the forlorn stone and mortar walls of buildings that had long since lost roofs. Miklos tethered the mule to graze and they split up to explore. Most of the valuables the monks had hoarded were gone, even some of the stone carvings had been carried off. Julianja kicked at a midden of shattered glass and pots in what she guessed was the refectory. All around her the buzz and chirp and hum of the natural world mocked the fleeting works of men. Just beyond the ruined wall a musk rose had returned to the wild, its unsupported canes bent to the ground. Most of the stems had gone to rose hips but there was one last spray of pink tinged blossoms. When Julianja lifted the flowers to her nose to smell, she pricked her finger. She stared at the bead of blood in surprise. She could feel her future closing in around her.\n“Julianja!”\nThe western wall of the church had collapsed. The row of eight empty lancet windows on the eastern wall hinted at the lost wealth of the monastery. Much of the plaster on this wall had peeled away, revealing the rough stone beneath. But Julianja could make out a few murals, paint faded by weather. The sorrowful eyes of Christ watched as she made her way down the nave and the draped arm of a woman, perhaps the Magdalen reached out to her.\nMiklos waited in the chancel, face flushed, eyes wild. “Here,” He stood on the altar, a broken slab of marble overthrown from a limestone pedestal. “In my vision I saw the bones here.”\nThey stripped away the hemp canvas that covered the bones and spread it beside the cart. They carried the treasure to the church in three trips. Miklos had no way to tell which bones belonged to which uncle, but, as a gesture of respect, he set just one skull and two halves of a pelvis in each of the bone piles they arranged before the altar. Then he fetched the skin of water he had filled at the lake that morning, poured it into a wooden bucket and produced the missing silk scarf. He explained that now he must wash the bones.\n“Then what?”\n“Then we will see if my father spoke truly.” He knelt, retrieved a heavy leg bone, dipped the scarf into the water, braced himself, and daubed gingerly at the knob end, as he was expecting it to twist from his grip or burst into flame. When nothing happened, he washed the bone and then placed it next to the pile from which he had retrieved it. He leaned back, waiting for some reaction. None came. He found another bone, dipped the scarf and washed. This bone he set atop the first. Nothing happened.\n“May I help?” Julianja touched his shoulder.\nHe shook her off without looking up. He sorted through the pile, found the skull and held it, gazing for a moment at the empty eye sockets. Then he scrubbed as if it were a dirty cook pot. Finally satisfied, he tried to balance it on the two bones in the new pile. As soon as he withdrew his hand, it toppled onto its side, staring up at them in mute reproach.\n“Must be all in all,” Miklos muttered.\n“Let me help.” She hovered over him.\n“No.” He pointed the jagged end of a broken femur at her and she backed away. “When I saw this in your garden, you were here but you only watched.”\nHe continued his task with flagging enthusiasm. He finished the first pile and scooted across the dirty floor of the chancel on his knees to the second. He worked faster now, carelessly. She saw him gather a knot of finger bones, give them a single swipe and toss them onto the second pile. He seemed resigned, like a man forced to play out his part in some humiliating practical joke.\nAs he washed, Julianja counted the bones to herself. Keeping a tally of his progress seemed like a kind of support, the only kind he would permit.\n“A kurva életbe!” Finally he hurled the filthy scarf at the pile, picked up an armful of unwashed bones, stood and let them drop, one by one, to bounce and scatter.\n“Miklos!”\n“The bones do not dance.” He spun away from her, eyes red, cheeks wet. “My father promised they would dance. I’ve done everything I’m supposed to do, everything I can do.” He shoulders sagged. “For nothing.”\nSeeing him so reduced filled Julianja with terror and pity and, yes, anger. She’d believed they would arrive safely at this place because he claimed to know the ways of the wide world. She’d trusted what he’d told her of his future. After all, hadn’t she herself shown it to him? But he’d deceived her—and probably himself. She realized he’d never told her that he had actually witnessed the lifting of the curse, only that she would be there when he tried. Seeing him now, defeated and unmanned, brought all her doubts back. And yet she wanted to help, if only because it was in her power. Julianja was powerful, in the same way the Tzigana had been. She was as certain of this as she was of the breath that swelled her lungs, the blood that pounded in her chest. When she bent to retrieve the scarf, it was like falling, at once inevitable and frightening. She picked a skull that poor Miklos had already washed and dipped the scarf into the bucket. As her hand touched water, she felt the finger she had pricked on the musk rose start to throb. A pink stain swirled in the clear water.\n“But you just watched,” cried Miklos. “Watched only.”\nThe cold bone seemed to suck the warmth from the palm of her hand. Perhaps Miklos had experienced a true vision, but he had not seen all. When she swiped its brow, the skull blinked and gazed at her with milky, ghost eyes. She wanted to scream, but her throat closed with fear. Instead she turned his uncle’s terrible gaze on Miklos, who fell away as if she were showing him his death.\n“Look,” she whispered.\nAll it took was a touch of the damp silk. Julianja might have called what the bones did a dance, although it was more like the rolling and tumbling of maggots. They would find their proper alignment and knit together. Watching them gather themselves made her feel unsure of her footing. It was as if the earth itself was twitching. First, one, then another, then all three uncles stood before them. But the uncles were no longer ghastly skeletons. A sinuous, indistinct glow suffused the bones, first as the flesh of transfigured, luminous bodies, then as the finery you might have seen at the Mátyás Palace in Buda. The shimmer of these magical creatures reminded Julianja of the way her legs had looked beneath the ripples of Lake Balaton.\nOne was dressed in an antique red cap with a feather, black velvet breeches and a red leather doublet with golden buttons. The second wore a green tunic embroidered with gold thread under a surcoat of silk so fine that it might have been spun from emeralds. The last wore a robe of midnight blue trimmed with ermine. Around his neck hung a heavy gold chain from which depended a brooch in the shape of a scroll inlaid with letters of lapis lazuli. All three uncles bore a resemblance to Miklos, although each was distinct. The red uncle was a jaunty rake who gave Julianja a sly look that made her flush. The green was older, more kindly, a man of substance whom she felt she might trust. She imagined that the solemn blue uncle, the eldest, had judged her at a glance and found her wanting.\n“You have served our family well, Miklos Kemény.” The green uncle stretched, as if waking from a nap and not from the dead.\nThe blue was as impassive as an owl. “Much better than your father Miklos or his father Benci or his father Benedek, or his father Ambrus, who was the son of Lajos Kemény, our own dear brother.”\nThe red winked at Julianja. “No one of your line ever thought to bring us a beautiful witch.”\n“I am not a witch,” said Julianja. But the words seemed to twist on her tongue. After all, hadn’t her blood just brought the three uncles back to the world of the living? Hadn’t she felt the stirring of her powers last night at the lake?\n“Yet you are clearly the one we have been waiting for,” said the green. “What is your name, child?”\nJulianja stiffened. She felt the uncles seeking to sway her. But why? They were Miklos’s ancestors. This was his quest.\nThe blue uncle scowled at her. “Say it!”\n“Julianja,” said Miklos. “Her name is Julianja. What does it matter, her name, if the curse is lifted?”\n“Come close, Julianja.” The red uncle crooked his finger and it was as if he had tugged at a tether around her waist. “You have done our family a great service, but there is something yet we must ask of you.”\nThe green gave her his gentle smile. “Know that, in life, we three brothers cast a charm so that we would not pass completely from this world when our bodies failed. The nature of that charm was such that we could exist between life and death in a place of our devising.”\n“We realize now that was a trap,” said the blue, “and we have chosen you to help us escape it. We bind you by your name to choose a spouse this day. Whomever you chose will return to full life. The others will pass on.” He glared at his brothers as if daring them to differ. “We are so agreed.”\n“What is this?” Miklos pushed past to confront the uncles. “What of the curse, of me and my family?”\nThe red uncle looked bored. “You have done well, Miklos son of Miklos.”\n“Yes, I have,” he cried. “I have done all . . . ”\nThe blue held out his hand, palm facing Miklos, who immediately fell silent, although the muscles of his jaw worked as he struggled to speak. The uncle rotated his hand, palm upward, and flicked it twice toward the sky. Miklos lifted off the ground a few inches, dangling like laundry from a branch. He twisted frantically against invisible knots until the blue uncle closed his fist and he sagged into unconsciousness.\nSensing Julianja’s outrage at this ill treatment, the green uncle apologized. “We understand why he is angry, but there is still much to explain and little time. Don’t be afraid, we won’t harm him. He is of us, a Kemény.”\n“I’m not afraid,” said Julianja, and was pleased to discover that this was true. “But neither am I impressed by the way you treat those who help you.”\n“You may be right. Perhaps we have been too long away from the world.” The green spoke to her, but she guessed that he was also chiding his blue brother.\n“Only choose,” said the blue, “and we will be done with curses.”\n“Choose,” agreed the red.\n“Yes, choose.” The green opened his arms wide, as if to embrace her.\nShe straightened, threw back her shoulders and found the inner strength to defy them, for all their magical power. “And what if I do not? Will you compel me?”\n“You mistake us, Julianja.” The blue seemed offended. “We would not compel such a decision.”\nRed laughed. “We would rather entice you.”\n“For such a woman as you,” said the green, “the bride price would be very high indeed.”\nYou will understand why this would give Julianja pause, as a penniless orphan who was many days journey away from a household that might not welcome her return. She tried not to show her interest. “I would hear more,” she said.\nThe red spoke first. “Choose me so that I may fill your senses to overflowing. In this world that men have made, there is precious little room for a woman’s pleasure. You will blush at the thought, but I will lead you to a new world, where desire never wanes and cries of ecstasy fill the long night. You will never grow weary of love, nor bored of our marriage bed, for I will be a student of your body, so that I may learn all that you secretly crave but know not how to ask for. I will be all men to you and any man you fancy. This is within my power to offer you, Julianja, for all the days of your life.”\nAs she listened her cheeks burned and she imagined bare legs entwined, strong arms enfolding her, her blood shouting so that it drowned out all thought. She remembered then what Erzebet had whispered to her about the power of love, and understood for the first time.\nThe green bowed to her then. “My brother speaks truly. But the world he offers is a small world indeed. You have five senses, yes, but we are more than our senses. Choose me and together we will make a place in the world beyond the bedroom door. I will comfort and support you, and keep you forever safe from evil. Our friends will love us and strangers will admire us. You will be proud of all we accomplish together. Oh, and our beautiful children! I will be the father to them that every mother hopes for. I will cherish and nurture them so that they will prosper and bring joy to us. We will get kings and philosophers! This is within my power to offer you, Julianja, for all the days of your life.”\nThis future she knew, was no trick of imagination. She looked into the green’s smiling eyes and saw a great house, a long table laden with joints of meat and exotic fruit. Silver plate, crystal goblets and raven-haired children laughing, as she would laugh and laugh as she told them of her impoverished years with Tzigana. Julianja thought then of Dorottya, struggling to hold the dead witch’s household together.\nThe blue regarded her sternly. “My brothers speak the truth. Do not doubt their promises, but consider what I alone offer you. You have a talent that must be expressed, or you will surely live a life of regret. You deny that you are a witch. But witch is a word that men call women who have powers they do not understand. Powers they fear. I will help you understand who you are, discover what your unique abilities might be and what they can accomplish. Pleasure and the regard of others will only distract you from the task of knowing yourself, which is our true life’s work. I can show you the greatness which seethes within you. Don’t throw away this chance, Julianja, or you will rue what you’ve lost all the days of your life.”\nThis speech frightened her, for she knew already that she was powerful. She could only guess what she might be capable of. The blue expected more from her than she expected from herself. She wasn’t sure that she wanted this greatness he spoke of, even if it did dwell within her. Had Tzigana made a similar choice to perfect her abilities? If so, Julianja had witnessed its cost. She had been powerful, but never happy.\nAnd yet, as tempting as each of these offers was in its own way, the manner in which they were being offered annoyed her. The uncles were so confident that what they proposed was what she must want. “Why must I chose any of you?” She stamped her foot. “What if I want all of what you offer? Or none of it? And if I do chose, why should it be one of you? Why shouldn’t I choose him?” She turned to gesture at the slumbering Miklos. At least he was a man of honest flesh and blood, not a construct of bones and dark magic.\nThe red uncle sneered in disbelief. The blue uncle shook his head sadly. Only the green uncle pleaded with her. “Would you really choose an ordinary life, when we can make dreams real? He may be a good man, but what he can give you is just the smallest part of what we offer.”\n“Nevertheless . . . ” she said, but when she turned back to them she found that she had chosen, as so many of us do, without meaning to. Was it because she refused to embrace their choices and had argued with them? Or because she truly wanted Miklos? No matter. In the flicker of indecision, the moment passed. The uncles were gone and in their places were three sorry mounds of dust.\nMiklos groaned and slumped to the floor of the chancel.\nYou may ask, what happened next? That evening and the next morning and ever after? You may wonder, as Julianja did, whether she was bound by the charm of the uncles. Since she had thwarted them, she believed she was not. She considered the unconscious Miklos, whom she had freed from his family curse. Should she now accompany him to the castle of Kisvárda? And if she did, would she ever understand why?\nRecall what Tzigana told Miklos, father of Miklos, back when that brave and disappointed man ventured into her garden. No one’s mind can hold an entire life at once. But believe this: Julianja would think about that summer afternoon for years to come. Not every day, but on occasion. Because, like all of us, there would be times when she was frustrated with her life, when she could not help but imagine what might have been.\nAnd yet there is one last thing for you to know. Before she went to awaken Miklos from his trance, before she decided what she would do with him, Julianja overturned his leaky bucket. The pink-tinged water she had used to wake the bones spilled down the broken altar stone and darkened the thirsty earth. She carried the bucket to the piles of dust, knelt and scooped three handfuls from each into it. As she did this, she vowed to the witch Tzigana, Mária Magdolna and the Blessed Virgin that someday she would scatter the treasure of the Kemény onto the roses in a charmed garden that would be hers, and hers alone.\nJames Patrick Kelly has won the Hugo, Nebula and Locus awards; his fiction has been translated into twenty-one languages. His most recent story collections were this year's The Promise of Space from Prime Books and Masters of Science Fiction: James Patrick Kelly published by Centipede Press in 2016. His most recent novel, Mother Go, was published in 2017 as an Audible original audiobook on Audible.com. He writes a column on the internet for Asimov's Science Fiction Magazine and is on the faculty of the Stonecoast Creative Writing MFA Program at the University of Southern Maine.", "source": "https://clarkesworldmagazine.com/kelly_08_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Rose Witch by James Patrick Kelly"}