{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Nancy Fulda", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "IAcNLHNXZ1+mZYXLM4lLo9iMFFQ=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Nothing This Fun Could be Good For You: A History of Evil Entertainment  Imagine, if you will, a fictional society three generations hence. Fossil fuels have expired, Martian colonies are in their infancy, and instead of going to the opera, well-to-do citizens enjoy high culture by . . . playing networked video games?  This scenario is not as ludicrous as it seems. From Shakespeare to television, from the Viennese Waltz to Rock ’n Roll, new forms of recreation are frequently viewed with suspicion and often labeled scandalous. Yet society has a curious propensity to revere entertainment styles that were scorned just a few generations before.  Consider the Viennese Waltz: When this dance first gained popularity in Europe, critics condemned its whirling tempo and unprecedented body contact. Salomo Wolf decried it as “a main source of the weakness of the body and mind of our generation”1, and the society pages of The Times of London called it an “obscene display” more fitting for prostitutes than for the “respectable classes of society”2.  Yet less than a hundred years later, by the middle of the 19th Century, the Waltz was firmly established across Europe.  An unlikely reversal? Hardly. William Shakespeare wrote his masterpieces at a time when theater was considered unsavory. 16th-Century precursors to the modern novel (such as Miguel de Cervantes’ Don Quixote) were labeled trite and childish, unworthy of serious study. And Leo Tolstoy described the ballet as a “lewd performance” in which “half-naked women make voluptuous movements”3.  TO HELL IN A HANDBASKET?  This mysterious transformation from Evil Influence to Respected Pastime is underway in our own century. When cinematic films became prevalent in the early 1900s, the Chicago Tribune declared them to be “schools of crime where murders, robberies and holdups are illustrated.”4  Or consider comic books, which in the 1940’s were widely blamed for poor grades, juvenile delinquency, and drug use. Book reviewer Sterling North described comic books as “Badly drawn, badly written, and badly printed—a strain on the young eyes and young nervous systems—the effects of these pulp-paper nightmares is that of a violent stimulant . . . Unless we want a coming generation even more ferocious than the present one, parents and teachers throughout America must band together to break the ’comic’ magazine.”5  Yet barely half a century later, in the early 90’s, Superman and other comic book heroes had become cultural icons, courses in Comics Studies were offered by a number of universities, and Art Spiegelman’s graphic novel Maus had won a Pulitzer Prize.  Faced with such dramatic turnabouts, it is tempting to assume that society is trending towards increasingly violent and promiscuous pastimes. Yet history refutes this.  Compare the fears expressed about cinema and comic books in the early twentieth century to Philip Stubbes’ condemnation of theater in 1583: “If you will learn to rebel against Princes, to commit treasons, to consume treasures, to practice idleness, to sing and talk of bawdy love and venery . . . If you will learn to play the whore-master, the glutton, the Drunkard, or incestuous person . . . you need go to no other school.”6  The wording may be different, but the issues under discussion have not changed. Society may even be less depraved now than it was five hundred years ago. Beheadings, hangings, and disembowelings were a popular public spectacle in the eighteenth century, and dismembered body parts were prominently displayed near Shakespeare’s home at Cripplegate.7 The original text of Grimm’s Fairy Tales attests that children’s fascination with death and gore is not a recent development.  ACCEPTING THE UNTHINKABLE  If societal ills are not becoming quantifiable worse, then why such outrage at each new form of recreation? What is it about the new—the different, the intoxicatingly entertaining—that inspires such immediate and heated opposition?  The answer is that anything innovative—be it a fashion trend, a party game, or a political movement—will attract both critics and admirers; the more influential the phenomenon, the more shrill the dispute between opposing camps will become.  Criticism, then, becomes a tacit acknowledgment of a recreation’s potential for greatness. Not every pastime which elicits public outcry will later become a bastion of culture, but few entertainment forms have gained widespread acceptance without first being considered base, offensive, or obscene.  The path to respectability hinges upon a separation of the pastime’s legitimate appeal from its more concerning aspects. For example, although the close body contact of the Viennese Waltz could not be eliminated—the speed and rotation of the dance cannot be maintained without it—it has become structured rather than sensual. The gentleman’s hand now rests on his partner’s scapula rather than at her waist, and both partners maintain a formal posture.  Similarly, the bawdy audiences, peddlers, and pickpockets that accompanied early theater have been replaced by closed performance halls, a seated audience, and silent observation. Voluntary ratings systems for cinema, comic books, and video games limit the intensity of dramatic depictions.  Yet the fundamental concern of antitheatricalists remains unaddressed. Philip Stubbe and The Chicago Tribune feared that scenes depicted by actors would inspire viewers to unsavory acts, yet conflict, violence, and sexual innuendo are not only part of modern entertainment, but also part of classic performances like Don Giovanni and Romeo and Juliet. Why weren’t these unwholesome depictions removed from dramatic entertainment as it gained respectability?  Quite simply, because it couldn’t be done. Imagine a theatrical performance without a villain; without conflict; without crime, wrongdoing, or anything which might inspire the audience to do evil, and you will have imagined a performance so dull that it can no longer be called entertainment. Just as the Waltz cannot be enjoyed without close body contact, so dramatic performance is meaningless without a modicum of evil.  This left society with a critical decision. Was theater unilaterally corrupting viewers as the antitheatricalists claimed? Or were the murders, crimes, and battles performed on stage serving a worthy purpose?  Society’s answer is clear. We have embraced theater, along with opera and ballet, as a treasured cultural influence. This does not, in the author’s opinion, reflect a lowering of society’s standards. Rather, it is the acknowledgment that something which appeared evil could, in the proper context, be wholesome. The process is akin to feeling horrified at the story of a man who sliced his wife’s abdomen open with a razor . . . until we learn he was a doctor performing a Cesarean section.  This gradual acceptance of features which once inspired concern is perhaps best illustrated by the history of theatrical ballet. In the early 1700’s, Marie de Camargo shortened her skirts to a length that scandalously revealed her ankles. Marie’s objective was not sensual, however, but aesthetic: she wanted the audience to see her exquisitely performed entrechats, a challenging jump in which the feet pass each other several times in the air.8  Although de Camargo’s costume seemed brazen, the possibilities it opened for both the performance and the appreciation of ballet were so powerful that her innovation was quickly expanded upon. By 1844 knee-length tutus like those depicted in Edgar Degas’ paintings were the standard dance attire at the Paris Opera.  A NEW BATTLEGROUND  What does any of this have to do with video games? Quite possibly, everything.  Like ballet and the Viennese Waltz, many popular video games are considered inappropriate. And like comic books and cinema, video games stand accused of causing poor grades, delinquency, and violence.  One widely-repeated concern about video games stems from Dave Grossman’s 1995 book On Killing: the Psychological Cost of Learning to Kill in War and Society. Grossman contends that violent media—particularly video games—mimic the stimulus-response training used by the military to turn conscientious human beings into killers. In Grossman’s words: “We are reaching that stage of desensitization at which the inflicting of pain and suffering has become a source of entertainment: vicarious pleasure rather than revulsion. We are learning to kill, and we are learning to like it.”9  Terrifying words, but by this point, the tune is beginning to sound familiar. It is the sound of a society that stands, not at the brink of destruction, but at the brink of extraordinary change.  When we consider the current flurry of attention surrounding video games, we must remember that they are extremely young in the entertainment timeline. Proto-games emerged in the 1950’s, but gaming did not become common until Atari was founded in 1972. Video games are the new boy in town: Mysterious, unpredictable, and potentially dangerous. We don’t understand them, and quite frankly, they scare us.  These fears are not unfounded. Grossman based his theories on research showing a correlation between violent games and aggression. But although experts agree that violent media use is linked to aggressive behavior, they disagree dramatically on what this connection actually means.10 It may mean, as Grossman asserts, that violent play leads to aggressive actions. It may also be that aggressive children are more likely to seek out violent entertainment. Or perhaps some third factor, such as stress at home or in school, is affecting both aggression and media use. We simply don’t have enough information to be sure.  Certainly the FBI’s yearly crime reports seem to contradict a causative relationship. Violent crime has dropped over the past twenty years, while video game use has increased. Harvard Medical School researchers Lawrence Kutner and Cheryl K. Olsen vigorously oppose the premise that video games cause criminal behavior. Their book, Grand Theft Childhood: The Surprising Truth About Violent Video Games, argues that gaming is a far more socially constructive pastime than previously assumed.10  Over the next few decades we should expect to see video games complete the refinement process that began in the early nineties. Society is—through a noisy and often controversial discourse—discovering which aspects of gaming it is willing to accept, which it will not tolerate, and how to distinguish between the two.  EMBRACING THE FUTURE  Ironically, the aspects of video games that modern parents object to—the violence, the gore, the way children sit glued to the game console for hours—may actually be integral to their appeal. Just as the experience of theater requires villainy and the experience of ballet requires revealing attire, it may be that video games require a certain amount of conflict—even violence—to reach their full artistic potential.  One clue as to why video games are so incredibly—some might even say addictively—compelling comes from an unexpected direction: research focused on understanding and treating autism.  Matthew Belmonte, a visiting professor at the National Brain Research Centre in India, has spent the past four years at Cornell University developing a suite of video games geared towards autistic children and their families. Video games may seem an unlikely medium for scientific research, but in Belmonte’s case they were ideal.  “The difficulty that we were facing,” says Belmonte, “is that the moment you experimentalize something, you lose what we call ecological validity. In other words, what you’re doing in the lab is not going to reflect what you’re doing every day in your life, and how you’re applying the cognitive and perceptual abilities that you have in real world situations. So we wanted to get closer to that real world and video games were the vehicle.”11  Video games, Belmonte explains, are far more motivating and engaging than typical psychological experiments, an effect that holds true for individuals both on and off the autistic spectrum. In fact, Belmonte believes that people with autism spectrum conditions can in many senses be described as “human, but more so.”  “We all are confronted with this problem of organizing the perceptual world around us. All human beings are surrounded by a welter of sensory stimuli, and we need somehow to represent those stimuli in the context of a narrative that connects them and allows us to make sense of them.  “Video games can scaffold one’s interaction with the external world and deliver that external world to one in a more predictable, more algorithmic manner. They fit in the middle between the unpredictability of real social interaction and the highly predictable nature of ritualistic and repetitive behaviors.”  Predictable, yet engaging. This juxtaposition, which may appear frightening if you’re a parent watching your child spend his third straight hour slashing zombies, may be a key to why video games have become so incredibly popular among adults and children alike.  There’s no way to tell whether video games will eclipse theater as the preferred recreation of the elite, but they do seem to be gaining grudging respect. Already, some universities include video games alongside traditional texts in English courses, and academic disputes are underway as to whether video games should be considered art. Unlikely as it sounds, games like Halo or Max Payne may one day be honored as early predecessors of a glorious aesthetic form.  So the next time you pick up a controller, remember: you are not just experiencing a game. You are taking part in history.  FOOTNOTES  1. Salomo Jakob Wolf, Beweis dass das Walzen eine Hauptquelle der Schwäche des Körpers und des Geistes unserer Generation sey (‘Proof that Waltzing is a Main Source of the Weakness of the Body and Mind of our Generation’), Halle: Hendel, 1797.  3. Leo Tolstoy, What is Art?, 1896. (Translated by Almyer Maude. New York: MacMillan Publishing Company, 1960.)  4. Lee Grieveson, Policing Cinema: Movies and Censorship in Early-Twentieth-Century America, University of California Press, 2004.  5. David Hajdu, The Ten-Cent Plague: The Great Comic-Book Scare and How It Changed America, Farrar, Straus and Giroux, 2008.  7. Sarah N. Redmont, Staging Executions: The Theater of Punishment in Early Modern England, Masters Thesis, Florida State University, 2007.  9. Dave Grossman, On Killing: The Psychological Cost of Learning to Kill in War and Society, Back Bay Books, revised edition, 2009 .  10. Lawrence Kutner and Cheryl K. Olsen, Grand Theft Childhood: The Surprising Truth About Violent Video Games and What Parents Can Do, Simon & Schuster, 2008.  11. Matthew Belmonte, interview recorded on August 28, 2010. (More information about Belmonte’s work on video games can be found at http://www.autismcollaborative.org/index.html.) Nancy Fulda is a Phobos Award Winner and a recipient of the Vera Hinckley Mayhew Award. Her fiction has appeared in publications such as Apex Digest, Asimov's Science Fiction Magazine, and Jim Baen's Universe. She administrates the online reprint repository at AnthologyBuilder.com, is a member of the Codex writers' group, and lives in northern Germany. She attributes any success in her field to her incredibly supportive husband and the cuteness of their three children.", "text": "Non-Fiction\nNothing This Fun Could be Good For You: A History of Evil Entertainment\nImagine, if you will, a fictional society three generations hence. Fossil fuels have expired, Martian colonies are in their infancy, and instead of going to the opera, well-to-do citizens enjoy high culture by . . . playing networked video games?\nThis scenario is not as ludicrous as it seems. From Shakespeare to television, from the Viennese Waltz to Rock ’n Roll, new forms of recreation are frequently viewed with suspicion and often labeled scandalous. Yet society has a curious propensity to revere entertainment styles that were scorned just a few generations before.\nConsider the Viennese Waltz: When this dance first gained popularity in Europe, critics condemned its whirling tempo and unprecedented body contact. Salomo Wolf decried it as “a main source of the weakness of the body and mind of our generation”1, and the society pages of The Times of London called it an “obscene display” more fitting for prostitutes than for the “respectable classes of society”2.\nYet less than a hundred years later, by the middle of the 19th Century, the Waltz was firmly established across Europe.\nAn unlikely reversal? Hardly. William Shakespeare wrote his masterpieces at a time when theater was considered unsavory. 16th-Century precursors to the modern novel (such as Miguel de Cervantes’ Don Quixote) were labeled trite and childish, unworthy of serious study. And Leo Tolstoy described the ballet as a “lewd performance” in which “half-naked women make voluptuous movements”3.\nTO HELL IN A HANDBASKET?\nThis mysterious transformation from Evil Influence to Respected Pastime is underway in our own century. When cinematic films became prevalent in the early 1900s, the Chicago Tribune declared them to be “schools of crime where murders, robberies and holdups are illustrated.”4\nOr consider comic books, which in the 1940’s were widely blamed for poor grades, juvenile delinquency, and drug use. Book reviewer Sterling North described comic books as “Badly drawn, badly written, and badly printed—a strain on the young eyes and young nervous systems—the effects of these pulp-paper nightmares is that of a violent stimulant . . . Unless we want a coming generation even more ferocious than the present one, parents and teachers throughout America must band together to break the ’comic’ magazine.”5\nYet barely half a century later, in the early 90’s, Superman and other comic book heroes had become cultural icons, courses in Comics Studies were offered by a number of universities, and Art Spiegelman’s graphic novel Maus had won a Pulitzer Prize.\nFaced with such dramatic turnabouts, it is tempting to assume that society is trending towards increasingly violent and promiscuous pastimes. Yet history refutes this.\nCompare the fears expressed about cinema and comic books in the early twentieth century to Philip Stubbes’ condemnation of theater in 1583: “If you will learn to rebel against Princes, to commit treasons, to consume treasures, to practice idleness, to sing and talk of bawdy love and venery . . . If you will learn to play the whore-master, the glutton, the Drunkard, or incestuous person . . . you need go to no other school.”6\nThe wording may be different, but the issues under discussion have not changed. Society may even be less depraved now than it was five hundred years ago. Beheadings, hangings, and disembowelings were a popular public spectacle in the eighteenth century, and dismembered body parts were prominently displayed near Shakespeare’s home at Cripplegate.7 The original text of Grimm’s Fairy Tales attests that children’s fascination with death and gore is not a recent development.\nACCEPTING THE UNTHINKABLE\nIf societal ills are not becoming quantifiable worse, then why such outrage at each new form of recreation? What is it about the new—the different, the intoxicatingly entertaining—that inspires such immediate and heated opposition?\nThe answer is that anything innovative—be it a fashion trend, a party game, or a political movement—will attract both critics and admirers; the more influential the phenomenon, the more shrill the dispute between opposing camps will become.\nCriticism, then, becomes a tacit acknowledgment of a recreation’s potential for greatness. Not every pastime which elicits public outcry will later become a bastion of culture, but few entertainment forms have gained widespread acceptance without first being considered base, offensive, or obscene.\nThe path to respectability hinges upon a separation of the pastime’s legitimate appeal from its more concerning aspects. For example, although the close body contact of the Viennese Waltz could not be eliminated—the speed and rotation of the dance cannot be maintained without it—it has become structured rather than sensual. The gentleman’s hand now rests on his partner’s scapula rather than at her waist, and both partners maintain a formal posture.\nSimilarly, the bawdy audiences, peddlers, and pickpockets that accompanied early theater have been replaced by closed performance halls, a seated audience, and silent observation. Voluntary ratings systems for cinema, comic books, and video games limit the intensity of dramatic depictions.\nYet the fundamental concern of antitheatricalists remains unaddressed. Philip Stubbe and The Chicago Tribune feared that scenes depicted by actors would inspire viewers to unsavory acts, yet conflict, violence, and sexual innuendo are not only part of modern entertainment, but also part of classic performances like Don Giovanni and Romeo and Juliet. Why weren’t these unwholesome depictions removed from dramatic entertainment as it gained respectability?\nQuite simply, because it couldn’t be done. Imagine a theatrical performance without a villain; without conflict; without crime, wrongdoing, or anything which might inspire the audience to do evil, and you will have imagined a performance so dull that it can no longer be called entertainment. Just as the Waltz cannot be enjoyed without close body contact, so dramatic performance is meaningless without a modicum of evil.\nThis left society with a critical decision. Was theater unilaterally corrupting viewers as the antitheatricalists claimed? Or were the murders, crimes, and battles performed on stage serving a worthy purpose?\nSociety’s answer is clear. We have embraced theater, along with opera and ballet, as a treasured cultural influence. This does not, in the author’s opinion, reflect a lowering of society’s standards. Rather, it is the acknowledgment that something which appeared evil could, in the proper context, be wholesome. The process is akin to feeling horrified at the story of a man who sliced his wife’s abdomen open with a razor . . . until we learn he was a doctor performing a Cesarean section.\nThis gradual acceptance of features which once inspired concern is perhaps best illustrated by the history of theatrical ballet. In the early 1700’s, Marie de Camargo shortened her skirts to a length that scandalously revealed her ankles. Marie’s objective was not sensual, however, but aesthetic: she wanted the audience to see her exquisitely performed entrechats, a challenging jump in which the feet pass each other several times in the air.8\nAlthough de Camargo’s costume seemed brazen, the possibilities it opened for both the performance and the appreciation of ballet were so powerful that her innovation was quickly expanded upon. By 1844 knee-length tutus like those depicted in Edgar Degas’ paintings were the standard dance attire at the Paris Opera.\nA NEW BATTLEGROUND\nWhat does any of this have to do with video games? Quite possibly, everything.\nLike ballet and the Viennese Waltz, many popular video games are considered inappropriate. And like comic books and cinema, video games stand accused of causing poor grades, delinquency, and violence.\nOne widely-repeated concern about video games stems from Dave Grossman’s 1995 book On Killing: the Psychological Cost of Learning to Kill in War and Society. Grossman contends that violent media—particularly video games—mimic the stimulus-response training used by the military to turn conscientious human beings into killers. In Grossman’s words: “We are reaching that stage of desensitization at which the inflicting of pain and suffering has become a source of entertainment: vicarious pleasure rather than revulsion. We are learning to kill, and we are learning to like it.”9\nTerrifying words, but by this point, the tune is beginning to sound familiar. It is the sound of a society that stands, not at the brink of destruction, but at the brink of extraordinary change.\nWhen we consider the current flurry of attention surrounding video games, we must remember that they are extremely young in the entertainment timeline. Proto-games emerged in the 1950’s, but gaming did not become common until Atari was founded in 1972. Video games are the new boy in town: Mysterious, unpredictable, and potentially dangerous. We don’t understand them, and quite frankly, they scare us.\nThese fears are not unfounded. Grossman based his theories on research showing a correlation between violent games and aggression. But although experts agree that violent media use is linked to aggressive behavior, they disagree dramatically on what this connection actually means.10 It may mean, as Grossman asserts, that violent play leads to aggressive actions. It may also be that aggressive children are more likely to seek out violent entertainment. Or perhaps some third factor, such as stress at home or in school, is affecting both aggression and media use. We simply don’t have enough information to be sure.\nCertainly the FBI’s yearly crime reports seem to contradict a causative relationship. Violent crime has dropped over the past twenty years, while video game use has increased. Harvard Medical School researchers Lawrence Kutner and Cheryl K. Olsen vigorously oppose the premise that video games cause criminal behavior. Their book, Grand Theft Childhood: The Surprising Truth About Violent Video Games, argues that gaming is a far more socially constructive pastime than previously assumed.10\nOver the next few decades we should expect to see video games complete the refinement process that began in the early nineties. Society is—through a noisy and often controversial discourse—discovering which aspects of gaming it is willing to accept, which it will not tolerate, and how to distinguish between the two.\nEMBRACING THE FUTURE\nIronically, the aspects of video games that modern parents object to—the violence, the gore, the way children sit glued to the game console for hours—may actually be integral to their appeal. Just as the experience of theater requires villainy and the experience of ballet requires revealing attire, it may be that video games require a certain amount of conflict—even violence—to reach their full artistic potential.\nOne clue as to why video games are so incredibly—some might even say addictively—compelling comes from an unexpected direction: research focused on understanding and treating autism.\nMatthew Belmonte, a visiting professor at the National Brain Research Centre in India, has spent the past four years at Cornell University developing a suite of video games geared towards autistic children and their families. Video games may seem an unlikely medium for scientific research, but in Belmonte’s case they were ideal.\n“The difficulty that we were facing,” says Belmonte, “is that the moment you experimentalize something, you lose what we call ecological validity. In other words, what you’re doing in the lab is not going to reflect what you’re doing every day in your life, and how you’re applying the cognitive and perceptual abilities that you have in real world situations. So we wanted to get closer to that real world and video games were the vehicle.”11\nVideo games, Belmonte explains, are far more motivating and engaging than typical psychological experiments, an effect that holds true for individuals both on and off the autistic spectrum. In fact, Belmonte believes that people with autism spectrum conditions can in many senses be described as “human, but more so.”\n“We all are confronted with this problem of organizing the perceptual world around us. All human beings are surrounded by a welter of sensory stimuli, and we need somehow to represent those stimuli in the context of a narrative that connects them and allows us to make sense of them.\n“Video games can scaffold one’s interaction with the external world and deliver that external world to one in a more predictable, more algorithmic manner. They fit in the middle between the unpredictability of real social interaction and the highly predictable nature of ritualistic and repetitive behaviors.”\nPredictable, yet engaging. This juxtaposition, which may appear frightening if you’re a parent watching your child spend his third straight hour slashing zombies, may be a key to why video games have become so incredibly popular among adults and children alike.\nThere’s no way to tell whether video games will eclipse theater as the preferred recreation of the elite, but they do seem to be gaining grudging respect. Already, some universities include video games alongside traditional texts in English courses, and academic disputes are underway as to whether video games should be considered art. Unlikely as it sounds, games like Halo or Max Payne may one day be honored as early predecessors of a glorious aesthetic form.\nSo the next time you pick up a controller, remember: you are not just experiencing a game. You are taking part in history.\nFOOTNOTES\n1. Salomo Jakob Wolf, Beweis dass das Walzen eine Hauptquelle der Schwäche des Körpers und des Geistes unserer Generation sey (‘Proof that Waltzing is a Main Source of the Weakness of the Body and Mind of our Generation’), Halle: Hendel, 1797.\n3. Leo Tolstoy, What is Art?, 1896. (Translated by Almyer Maude. New York: MacMillan Publishing Company, 1960.)\n4. Lee Grieveson, Policing Cinema: Movies and Censorship in Early-Twentieth-Century America, University of California Press, 2004.\n5. David Hajdu, The Ten-Cent Plague: The Great Comic-Book Scare and How It Changed America, Farrar, Straus and Giroux, 2008.\n7. Sarah N. Redmont, Staging Executions: The Theater of Punishment in Early Modern England, Masters Thesis, Florida State University, 2007.\n9. Dave Grossman, On Killing: The Psychological Cost of Learning to Kill in War and Society, Back Bay Books, revised edition, 2009 .\n10. Lawrence Kutner and Cheryl K. Olsen, Grand Theft Childhood: The Surprising Truth About Violent Video Games and What Parents Can Do, Simon & Schuster, 2008.\n11. Matthew Belmonte, interview recorded on August 28, 2010. (More information about Belmonte’s work on video games can be found at http://www.autismcollaborative.org/index.html.)\nNancy Fulda is a Phobos Award Winner and a recipient of the Vera Hinckley Mayhew Award. Her fiction has appeared in publications such as Apex Digest, Asimov's Science Fiction Magazine, and Jim Baen's Universe. She administrates the online reprint repository at AnthologyBuilder.com, is a member of the Codex writers' group, and lives in northern Germany. She attributes any success in her field to her incredibly supportive husband and the cuteness of their three children.", "source": "https://clarkesworldmagazine.com/fulda_12_10/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Nothing This Fun Could be Good For You: A History of Evil Entertainment by Nancy Fulda"}