{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Arley Sorg", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "BMJ+s4U5L62pb3jnszYYZ5tOL/Q=", "id": null, "license": null, "comments": "", "raw_text": "Interview  Raising Science Fictional Children: A Conversation with Kelly Robson  Before Kelly Robson was a celebrated science fiction writer, she competed in rodeos, and was even a rodeo princess. “I like to say that being a rodeo princess is like having all the glamour and none of the responsibility. Also to be clear, this isn’t a beauty contest—it’s a riding contest.” Robson was born in Edmonton, Alberta and grew up in Hinton, Alberta, just east of the Canadian Rockies.  Even as a kid Robson had the writing bug: She wrote a horse book called Born Wild in fifth grade, and in sixth grade she wrote a one-act play based on C. S. Lewis’ The Last Battle. At sixteen, she decided she wanted to be a writer after reading Connie Willis’ “Blued Moon” in Isaac Asimov’s Science Fiction Magazine (January 1984). Robson earned a degree in English from the University of Alberta, and from 2008–2012, wrote the wine and spirits column for Canada’s biggest women’s magazine, Chatelaine.  Robson’s first fiction publication was in the February 2015 issue of Clarkesworld, “The Three Resurrections of Jessica Churchill.” That same year “Waters of Versailles” was published by Tor.com, “Two-Year Man” was published by Asimov’s, and “The Gladiator Lie” came out in anthology Licence Expired: The Unauthorized James Bond. The response from the genre community was immediate: “The Three Resurrections of Jessica Churchill” was a Sturgeon Award finalist, “Two-Year Man” was a Sunburst Award finalist, and “Waters of Versailles” was a finalist for the World Fantasy and SFWA Nebula awards and won an Aurora Award.  Since then, among many other accolades, including being a finalist for the Hugo, Nebula, World Fantasy, Sturgeon, Locus, Sunburst, and Astounding awards, her 2017 novelette A Human Stain (Tor.com) won a Nebula Award and her 2018 novella, Gods, Monsters, and the Lucky Peach (Tor.com) won an Aurora Award.  Kelly Robson lived in Vancouver, Canada for twenty-two years before moving to Toronto with her wife, author A.M. Dellamonica. Robson’s debut collection, Alias Space and Other Stories, is just out from Subterranean Press.   You hit the scene running in 2015: Not only did you have work in pro venues like Clarkesworld and Tor.com right out of the gate, but some of your work landed major awards nominations, and “Waters of Versailles” won an Aurora award. What was breaking in for you, how did it happen?  Like most overnight successes, it took decades. I had a long apprenticeship as a passionate SFFH short story reader from teenagerhood on. As a younger adult, I flirted with writing from time to time, but eventually made the commitment in 2005 to give it an honest hard try. I got my first publication nine years after deciding to buckle down, which seems like a reasonable length of time to learn to do a difficult thing at a professional level.  Aside from learning to wrestle with craft, most of the struggles were psychological—giving myself the permission to write, learning to ignore all the back-of-the-head voices that said I couldn’t. What’s neat is that I had no expectations, absolutely no idea that my work would be embraced by the most prestigious venues or win a lifetime-dream award.  I’ve actually wondered if someday I’ll wake up and find that I’ve been in a coma all this time. I’m only just beginning to get over that now.  Did the awards and acclaim have an impact on your writing or process?  I didn’t feel any pressure. I continue to be just so happy to have finally learned to write good stories. Award nominations are exciting, and winning an award is a fabulous surprise, but the biggest and best accomplishment is just writing a story that works.  Unfortunately, awards don’t make stories happen any quicker or easier. If they did, all bets would be off! Also, I’ve been on the edges of the SFFH writing world for long enough to know that plenty of superb writers never get nominations. With no false modesty: Luck has played a big part in my writing career so far. Hard work and skill too, but lots of luck.  Has anything changed about your writing—craft, approach, or anything else—since those days before landing your first sales?  I still have my full-time day job. Drafting hasn’t gotten any faster—three months for a story is typical—and wonky work still gets trunked.  One big change is now I get invitations to travel as a writer. The Future Affairs Administration (a Chinese short fiction organization) has brought me to China twice—amazing trips that blew my mind in so many ways. One of my Spanish publishers would like me to visit them when international travel is possible. I also got to visit the Banff Centre for Arts for some futurist consulting.  A very good change is that I have found some rubrics to help me solve storytelling problems. For me, when a story isn’t working, it’s usually a character problem. I wrote about this for Clarkesworld—“Luke Versus Han: An Approach to Characterization.”  Your work ranges from light and fun to violent and dark, even going into horror. Are there specific things that a dark/grim/violent narrative does for you (or for readers in general) that appeals to you as a writer?  For me, horror is the most difficult genre to write, first because of the emotional and sensory precision, and second, because I think horror should be applied with great sensitivity. I use horror when I try to address something that makes me really angry. I don’t get any joy from writing terrible things, so I have to have a really good reason to reach for a terror weapon—something besides just trying to make a good story.  You take on different topics, dig into different moods, write different kinds of stories, and use your fantastic imagination to wonderful effect. Are there aspects of storytelling/writing that you feel are more challenging for you, things you struggle with? And how do you deal with those elements?  That’s a huge compliment. I’m passionately interested in a wide range of things, and short stories give me the freedom to do whatever I want, without worrying if readers will follow me from book to book.  Writing novel-length is definitely a challenge. I like to hold the shape of a story in my mind, and past forty thousand words, that’s very difficult. It’s not necessarily a writing problem, it’s a thinking problem. I get to about forty thousand words and I’m no longer sure what I’m doing and why. I lose the shape and start flailing. I’ll keep working at it and get there eventually.  Your debut collection, Alias Space, offers readers fourteen pieces of fiction, spanning your career to date. If readers looked at three stories in this book, what would you want them to be, and why?  I’d like people to read “Alias Space,” “A Study in Oils,” and “We Who Live in The Heart”: near-future, mid-future, and far-future stories, because SF has always been and will always be the place where my heart rests.  Publishers Weekly gave Alias Space a glowing review, saying, among other things, “Robson’s work also frequently touches on feminism, gender, and queerness . . . ” Is feminism an important aspect of your work—is it deliberate, is it inevitable? Is it an accurate descriptor? Or is it an interpretation that doesn’t always fit?  Sure, all my stories are intersectional feminist, even when it’s not overt. It’s the air I breathe and it’s inevitable, yes, because I don’t even think about it. All art is political.  Gary K. Wolfe, in his Locus review of Alias Space, said, “ . . . as eclectic as her settings and narrative modes might be, Robson consistently writes about characters who, within their limitations, simply want to do better.” What is the key to writing great characters?  I have a trick to this, which I wrote about in “Luke Versus Han: An Approach to Characterization.” The TL;DR is that a character should know either who they are or what they’re doing. Not both. Not neither. I also tend to write characters that are workaholics. I think it’s because it makes them feel driven, and I have to temper that in the rewrite.  Also, I like to write about people who, in addition to emotions, have concepts and misconceptions, obsessions, judgments, prejudices, analyses flawed or accurate, suspicions, et cetera, et cetera. Everyone has a system for ordering and understanding the world. We don’t just feel, we analyze. All the time.  Looking at your career so far, and in particular, at the stories in this collection, are there themes and ideas in your fiction that you often come back to, that stand out as more important to you, or about which you feel passionate?  I’m constantly writing about people who choose (or are chosen by) parenthood. This is something I can’t seem to get away from; it pops up all the time. Part of the reason is because I’m interested in how systems work, and child-rearing is so rarely acknowledged as an underpinning of all human economic endeavor. If the world doesn’t have a semi-indentured class who are bound by religion and/or tradition to bear and raise children, how is the world getting peopled? Let’s not pretend that humanity wouldn’t die out if child-rearing wasn’t something most people were coerced into. But there’s also, of course, a huge emotional aspect to it, and I like that tension between the practical and the emotional. Parenthood: is it a job or a calling?  This is an especially weird obsession because I don’t have kids and never wanted them. But then, I think lots of queer people obsess over parenthood because it’s just never something we can take for granted.  Are there stories in this collection that were harder to write than others, or pieces that were far more personal than others?  Writing “La Vitesse,” I finally figured out how to use my own past as material. It’s funny to claim an action story about dragon killing as an illustration of my soul and the soil it grew in, but there we have it. I’m addicted to writing stories set in my hometown now. It’s so fun to populate that lonely landscape with stories. The stories live there now. They’re as real as the dirt.  What else are you working on now, and what do you have coming up that you can tell us about?  In summer 2022, I have a thirty-six thousand-word novella coming from Tor.com Publishing called High Times in the Low Parliament. It’s a neo-medieval lesbian stoner comedy with fairies, and is certified both hilarious and adorable by all who’ve read it. Right now, I’m working on the sequel, Down and Out in the High Parliament, which I hope will be even funnier than the original. I’m having a hoot writing light during these darker times. Arley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "text": "Interview\nRaising Science Fictional Children: A Conversation with Kelly Robson\nBefore Kelly Robson was a celebrated science fiction writer, she competed in rodeos, and was even a rodeo princess. “I like to say that being a rodeo princess is like having all the glamour and none of the responsibility. Also to be clear, this isn’t a beauty contest—it’s a riding contest.” Robson was born in Edmonton, Alberta and grew up in Hinton, Alberta, just east of the Canadian Rockies.\nEven as a kid Robson had the writing bug: She wrote a horse book called Born Wild in fifth grade, and in sixth grade she wrote a one-act play based on C. S. Lewis’ The Last Battle. At sixteen, she decided she wanted to be a writer after reading Connie Willis’ “Blued Moon” in Isaac Asimov’s Science Fiction Magazine (January 1984). Robson earned a degree in English from the University of Alberta, and from 2008–2012, wrote the wine and spirits column for Canada’s biggest women’s magazine, Chatelaine.\nRobson’s first fiction publication was in the February 2015 issue of Clarkesworld, “The Three Resurrections of Jessica Churchill.” That same year “Waters of Versailles” was published by Tor.com, “Two-Year Man” was published by Asimov’s, and “The Gladiator Lie” came out in anthology Licence Expired: The Unauthorized James Bond. The response from the genre community was immediate: “The Three Resurrections of Jessica Churchill” was a Sturgeon Award finalist, “Two-Year Man” was a Sunburst Award finalist, and “Waters of Versailles” was a finalist for the World Fantasy and SFWA Nebula awards and won an Aurora Award.\nSince then, among many other accolades, including being a finalist for the Hugo, Nebula, World Fantasy, Sturgeon, Locus, Sunburst, and Astounding awards, her 2017 novelette A Human Stain (Tor.com) won a Nebula Award and her 2018 novella, Gods, Monsters, and the Lucky Peach (Tor.com) won an Aurora Award.\nKelly Robson lived in Vancouver, Canada for twenty-two years before moving to Toronto with her wife, author A.M. Dellamonica. Robson’s debut collection, Alias Space and Other Stories, is just out from Subterranean Press.\nYou hit the scene running in 2015: Not only did you have work in pro venues like Clarkesworld and Tor.com right out of the gate, but some of your work landed major awards nominations, and “Waters of Versailles” won an Aurora award. What was breaking in for you, how did it happen?\nLike most overnight successes, it took decades. I had a long apprenticeship as a passionate SFFH short story reader from teenagerhood on. As a younger adult, I flirted with writing from time to time, but eventually made the commitment in 2005 to give it an honest hard try. I got my first publication nine years after deciding to buckle down, which seems like a reasonable length of time to learn to do a difficult thing at a professional level.\nAside from learning to wrestle with craft, most of the struggles were psychological—giving myself the permission to write, learning to ignore all the back-of-the-head voices that said I couldn’t. What’s neat is that I had no expectations, absolutely no idea that my work would be embraced by the most prestigious venues or win a lifetime-dream award.\nI’ve actually wondered if someday I’ll wake up and find that I’ve been in a coma all this time. I’m only just beginning to get over that now.\nDid the awards and acclaim have an impact on your writing or process?\nI didn’t feel any pressure. I continue to be just so happy to have finally learned to write good stories. Award nominations are exciting, and winning an award is a fabulous surprise, but the biggest and best accomplishment is just writing a story that works.\nUnfortunately, awards don’t make stories happen any quicker or easier. If they did, all bets would be off! Also, I’ve been on the edges of the SFFH writing world for long enough to know that plenty of superb writers never get nominations. With no false modesty: Luck has played a big part in my writing career so far. Hard work and skill too, but lots of luck.\nHas anything changed about your writing—craft, approach, or anything else—since those days before landing your first sales?\nI still have my full-time day job. Drafting hasn’t gotten any faster—three months for a story is typical—and wonky work still gets trunked.\nOne big change is now I get invitations to travel as a writer. The Future Affairs Administration (a Chinese short fiction organization) has brought me to China twice—amazing trips that blew my mind in so many ways. One of my Spanish publishers would like me to visit them when international travel is possible. I also got to visit the Banff Centre for Arts for some futurist consulting.\nA very good change is that I have found some rubrics to help me solve storytelling problems. For me, when a story isn’t working, it’s usually a character problem. I wrote about this for Clarkesworld—“Luke Versus Han: An Approach to Characterization.”\nYour work ranges from light and fun to violent and dark, even going into horror. Are there specific things that a dark/grim/violent narrative does for you (or for readers in general) that appeals to you as a writer?\nFor me, horror is the most difficult genre to write, first because of the emotional and sensory precision, and second, because I think horror should be applied with great sensitivity. I use horror when I try to address something that makes me really angry. I don’t get any joy from writing terrible things, so I have to have a really good reason to reach for a terror weapon—something besides just trying to make a good story.\nYou take on different topics, dig into different moods, write different kinds of stories, and use your fantastic imagination to wonderful effect. Are there aspects of storytelling/writing that you feel are more challenging for you, things you struggle with? And how do you deal with those elements?\nThat’s a huge compliment. I’m passionately interested in a wide range of things, and short stories give me the freedom to do whatever I want, without worrying if readers will follow me from book to book.\nWriting novel-length is definitely a challenge. I like to hold the shape of a story in my mind, and past forty thousand words, that’s very difficult. It’s not necessarily a writing problem, it’s a thinking problem. I get to about forty thousand words and I’m no longer sure what I’m doing and why. I lose the shape and start flailing. I’ll keep working at it and get there eventually.\nYour debut collection, Alias Space, offers readers fourteen pieces of fiction, spanning your career to date. If readers looked at three stories in this book, what would you want them to be, and why?\nI’d like people to read “Alias Space,” “A Study in Oils,” and “We Who Live in The Heart”: near-future, mid-future, and far-future stories, because SF has always been and will always be the place where my heart rests.\nPublishers Weekly gave Alias Space a glowing review, saying, among other things, “Robson’s work also frequently touches on feminism, gender, and queerness . . . ” Is feminism an important aspect of your work—is it deliberate, is it inevitable? Is it an accurate descriptor? Or is it an interpretation that doesn’t always fit?\nSure, all my stories are intersectional feminist, even when it’s not overt. It’s the air I breathe and it’s inevitable, yes, because I don’t even think about it. All art is political.\nGary K. Wolfe, in his Locus review of Alias Space, said, “ . . . as eclectic as her settings and narrative modes might be, Robson consistently writes about characters who, within their limitations, simply want to do better.” What is the key to writing great characters?\nI have a trick to this, which I wrote about in “Luke Versus Han: An Approach to Characterization.” The TL;DR is that a character should know either who they are or what they’re doing. Not both. Not neither. I also tend to write characters that are workaholics. I think it’s because it makes them feel driven, and I have to temper that in the rewrite.\nAlso, I like to write about people who, in addition to emotions, have concepts and misconceptions, obsessions, judgments, prejudices, analyses flawed or accurate, suspicions, et cetera, et cetera. Everyone has a system for ordering and understanding the world. We don’t just feel, we analyze. All the time.\nLooking at your career so far, and in particular, at the stories in this collection, are there themes and ideas in your fiction that you often come back to, that stand out as more important to you, or about which you feel passionate?\nI’m constantly writing about people who choose (or are chosen by) parenthood. This is something I can’t seem to get away from; it pops up all the time. Part of the reason is because I’m interested in how systems work, and child-rearing is so rarely acknowledged as an underpinning of all human economic endeavor. If the world doesn’t have a semi-indentured class who are bound by religion and/or tradition to bear and raise children, how is the world getting peopled? Let’s not pretend that humanity wouldn’t die out if child-rearing wasn’t something most people were coerced into. But there’s also, of course, a huge emotional aspect to it, and I like that tension between the practical and the emotional. Parenthood: is it a job or a calling?\nThis is an especially weird obsession because I don’t have kids and never wanted them. But then, I think lots of queer people obsess over parenthood because it’s just never something we can take for granted.\nAre there stories in this collection that were harder to write than others, or pieces that were far more personal than others?\nWriting “La Vitesse,” I finally figured out how to use my own past as material. It’s funny to claim an action story about dragon killing as an illustration of my soul and the soil it grew in, but there we have it. I’m addicted to writing stories set in my hometown now. It’s so fun to populate that lonely landscape with stories. The stories live there now. They’re as real as the dirt.\nWhat else are you working on now, and what do you have coming up that you can tell us about?\nIn summer 2022, I have a thirty-six thousand-word novella coming from Tor.com Publishing called High Times in the Low Parliament. It’s a neo-medieval lesbian stoner comedy with fairies, and is certified both hilarious and adorable by all who’ve read it. Right now, I’m working on the sequel, Down and Out in the High Parliament, which I hope will be even funnier than the original. I’m having a hoot writing light during these darker times.\nArley Sorg is co-Editor-in-Chief at Fantasy Magazine and a 2021 World Fantasy Award Finalist. He is also a finalist for two 2022 Ignyte Awards, for his work as a critic as well as for his creative nonfiction. Arley is senior editor at Locus Magazine, associate editor at both Lightspeed & Nightmare, and a columnist for The Magazine of Fantasy and Science Fiction. He takes on multiple roles, including slush reader, movie reviewer, and book reviewer, and conducts interviews for multiple venues, including Clarkesworld Magazine and his own site: arleysorg.com. He has taught classes and run workshops for Clarion West, Augur Magazine, and more, and has been a guest speaker at a range of events. Arley grew up in England, Hawaii, and Colorado, and studied Asian Religions at Pitzer College. He lives in the SF Bay Area and writes in local coffee shops when he can. Arley is a 2014 Odyssey Writing Workshop graduate.", "source": "https://clarkesworldmagazine.com/robson_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Raising Science Fictional Children: A Conversation with Kelly Robson by Arley Sorg"}