{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Chris Urie", "hostname": "clarkesworldmagazine.com", "date": "2019-10-09", "categories": "", "tags": "", "fingerprint": "e9v6wP83/kMSt38ELY5CHbTYz+o=", "id": null, "license": null, "comments": "", "raw_text": "Interview  High Seas, Multiple Selves, and Unspoken Songs: A Conversation with Sarah Pinsker  A single-author collection of short stories allows for a unique peek into the mind of the writer. You get to explore worlds that have developed through different mind-sets and times. Whereas a novel is a singular coherent work of storytelling, it can only reflect one small piece of the many universes swirling around within an author’s brain. Exploring the depth and breadth of what an author can do is the sole domain of a short fiction collection.  For over seven years, Sarah Pinsker has been wowing readers with tales of music, technology, and history. Her first collection of short stories, Sooner or Later Everything Falls Into the Sea contains tales of generation ships flying through space, the windy high seas, and the occasional murder house. These thirteen fantastical stories feature the very best of her previously published work as well as a story wholly unique to the collection.  Sarah’s fiction has been published in Asimov’s, Strange Horizons, Fantasy & Science Fiction, Lightspeed, Daily Science Fiction, Fireside, and Uncanny and in anthologies including Long Hidden, Fierce Family, Accessing the Future, and numerous year’s bests. Sarah has also won the Nebula and Theodore Sturgeon awards. Sooner or Later Everything Falls Into the Sea will be available from Small Beer Press on March 19th.   How does it feel having your stories collected into one volume?  Amazing! I adore Small Beer Press, and I’ve always adored single-author collections in general. This is just the hugest honor.  How did you choose which stories to feature?  It was really difficult choosing the stories. A few were obvious to me, but deciding between others was really difficult. It involved a color-coded spreadsheet and recipe cards and a lot of deep analysis. I tried to spread out the magazine choices and choose stories with different feels that would still work well together. I wanted to pick the stories people had responded to most strongly, but also to make sure there were pieces that would be new to most readers. My hope is that even if someone has read a lot of the stories, reading them in this order and this context may bring something new to the experience.  Has living in Baltimore influenced your writing? How?  I love this city. There are so many wonderful things about Baltimore, including an amazing arts scene and a whole lot of people who put their hearts and souls into the things they love to do, whether that’s fiction or jazz or punk or community water ballet. There’s a great SFF writer community here, with a critique group and a reading series and a whole lot of dedicated, talented authors. Living here, there are also questions about race and class and systemic inequality and transportation and housing, none of which have easy answers. I think all of those things find their way into my fiction.  You’ve noted that you got into science fiction partially because your father subscribed to a number of magazines. Which ones caught your eye as a kid?  The subscription that followed us everywhere we moved was The Magazine of Fantasy & Science Fiction, but we also had stacks of Asimov’s and Analog. I remember individual issues of OMNI, Science Fiction Age, and a few others. And all of the year’s bests—Dozois, Datlow & Windling, etc.  Instead of songs, did you ever write fiction while touring for your albums?  No. I wrote fiction from middle school through college, then basically quit completely during the time I was focused on making music. I didn’t notice I had stopped until I started again a few years later.  When researching the original story in this collection, what is one fascinating fact you want to share?  I researched every roadside attraction on Route 70. Some I remembered, but there are a few I wasn’t aware of. The Kaskaskia Dragon, in Vandalia, Illinois, is a 35-foot metal dragon that breathes propane fire. It’s coin-operated, and you buy the coins from the liquor store across the street. A few miles down the road, in Genoa, Colorado, is the World’s Wonder Tower, which in the 1930s was the highest point between New York and Denver, and claimed you could see six states from the top. The original owner would reportedly stand at the top with a megaphone and call drivers in off the highway. It closed a few years ago when the owner died, but it spent ninety years as a tourist attraction. It’s still standing, and there’s a preservation group trying to restore it.  How does writing fiction and song lyrics differ? How have they influenced each other in your work?  They’re both storytelling, just different modes. There’s a different challenge in boiling a story down to its essence in that way—you can tell the same stories, but the focus changes. You have less space in a song, obviously. You can be a little more on the nose.  I think the skills I learned songwriting transfer over to fiction as well. Word choices, the internal cadences of sentences. After you’ve tried to tell a story in three verses, a thousand words is a lot of space.  What does your writing process look like?  My writing process is in flux right now. I’m still trying to figure out what it means to be a novelist as well as a short fiction writer. That said, I do my best work without an empty page looming. I spend a lot of my non-writing time thinking out the things that would stop me if I was sitting in front of a blank screen. I work out the knotty stuff while I’m walking the dog or running or driving, so that by the time I get to sit down with the piece I’m excited and ready to move forward. Some days I don’t write much or anything, and some (rare) days I can write eight or ten thousand words in a sitting. Beyond that, different stories have different paths, depending on what I need to research, what I need to think about.  What project are you working on next?  I have four stories waiting patiently to be written, and I’m gearing up for the release of my first novel in September (A Song for a New Day, Berkley, 9/10/19). A Song for a New Day is related to my Nebula-winning novelette “Our Lady of the Open Road,” and explores the lives of two characters in a near-future where people have been scared into staying home—one who remembers the time before, and one who has never known anything else.  Right now, I’m drafting my second novel, which is another near future story that explores a technology and its repercussions, positive and negative.  Songs and stories have long been inspired by the sea. What inspired you to write “Sooner or Later Everything Falls into the Sea”?  The germ of the story came from sitting around with Scott Andrews from Beneath Ceaseless Skies at the Dogfish Head Brewpub. I don’t remember what preceded it, but I said “the rock star washed ashore,” and he said something like, “you need to write that story, and unfortunately it won’t be a BCS story.” I think I spent five minutes trying to write it as a story about a bard so it could go to him, but it was clearly meant to be contemporary/near future. The next image that came to my mind was a bunch of seas converging at impossible angles, which I took and used in a story for Asimov’s, “Clearance.” Once I had Bay’s voice, it all solidified; she was tremendously fun to write. I like soft apocalypses, where people retain their humanity in the face of hardship.  Why will we never speak of the song “Hellbound Train?” Sounds like the title for a good story!  Ha! You have done a deep dive into my biography. At the time (middle school) I thought bands who had a song with the same name as the band were the height of cool. I was wrong. I’m not sure we were really in a position to pull off either a song or a band of that name. The lyrics started with “We’ve set the world on fire/with our music and our songs” which may have been a little, um, presumptuous.  Where do you hide the multitude of Sarah Pinskers when they’re not appearing in one of your stories?  As far as I know, they all go back to their own realities. Chris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "text": "Interview\nHigh Seas, Multiple Selves, and Unspoken Songs: A Conversation with Sarah Pinsker\nA single-author collection of short stories allows for a unique peek into the mind of the writer. You get to explore worlds that have developed through different mind-sets and times. Whereas a novel is a singular coherent work of storytelling, it can only reflect one small piece of the many universes swirling around within an author’s brain. Exploring the depth and breadth of what an author can do is the sole domain of a short fiction collection.\nFor over seven years, Sarah Pinsker has been wowing readers with tales of music, technology, and history. Her first collection of short stories, Sooner or Later Everything Falls Into the Sea contains tales of generation ships flying through space, the windy high seas, and the occasional murder house. These thirteen fantastical stories feature the very best of her previously published work as well as a story wholly unique to the collection.\nSarah’s fiction has been published in Asimov’s, Strange Horizons, Fantasy & Science Fiction, Lightspeed, Daily Science Fiction, Fireside, and Uncanny and in anthologies including Long Hidden, Fierce Family, Accessing the Future, and numerous year’s bests. Sarah has also won the Nebula and Theodore Sturgeon awards. Sooner or Later Everything Falls Into the Sea will be available from Small Beer Press on March 19th.\nHow does it feel having your stories collected into one volume?\nAmazing! I adore Small Beer Press, and I’ve always adored single-author collections in general. This is just the hugest honor.\nHow did you choose which stories to feature?\nIt was really difficult choosing the stories. A few were obvious to me, but deciding between others was really difficult. It involved a color-coded spreadsheet and recipe cards and a lot of deep analysis. I tried to spread out the magazine choices and choose stories with different feels that would still work well together. I wanted to pick the stories people had responded to most strongly, but also to make sure there were pieces that would be new to most readers. My hope is that even if someone has read a lot of the stories, reading them in this order and this context may bring something new to the experience.\nHas living in Baltimore influenced your writing? How?\nI love this city. There are so many wonderful things about Baltimore, including an amazing arts scene and a whole lot of people who put their hearts and souls into the things they love to do, whether that’s fiction or jazz or punk or community water ballet. There’s a great SFF writer community here, with a critique group and a reading series and a whole lot of dedicated, talented authors. Living here, there are also questions about race and class and systemic inequality and transportation and housing, none of which have easy answers. I think all of those things find their way into my fiction.\nYou’ve noted that you got into science fiction partially because your father subscribed to a number of magazines. Which ones caught your eye as a kid?\nThe subscription that followed us everywhere we moved was The Magazine of Fantasy & Science Fiction, but we also had stacks of Asimov’s and Analog. I remember individual issues of OMNI, Science Fiction Age, and a few others. And all of the year’s bests—Dozois, Datlow & Windling, etc.\nInstead of songs, did you ever write fiction while touring for your albums?\nNo. I wrote fiction from middle school through college, then basically quit completely during the time I was focused on making music. I didn’t notice I had stopped until I started again a few years later.\nWhen researching the original story in this collection, what is one fascinating fact you want to share?\nI researched every roadside attraction on Route 70. Some I remembered, but there are a few I wasn’t aware of. The Kaskaskia Dragon, in Vandalia, Illinois, is a 35-foot metal dragon that breathes propane fire. It’s coin-operated, and you buy the coins from the liquor store across the street. A few miles down the road, in Genoa, Colorado, is the World’s Wonder Tower, which in the 1930s was the highest point between New York and Denver, and claimed you could see six states from the top. The original owner would reportedly stand at the top with a megaphone and call drivers in off the highway. It closed a few years ago when the owner died, but it spent ninety years as a tourist attraction. It’s still standing, and there’s a preservation group trying to restore it.\nHow does writing fiction and song lyrics differ? How have they influenced each other in your work?\nThey’re both storytelling, just different modes. There’s a different challenge in boiling a story down to its essence in that way—you can tell the same stories, but the focus changes. You have less space in a song, obviously. You can be a little more on the nose.\nI think the skills I learned songwriting transfer over to fiction as well. Word choices, the internal cadences of sentences. After you’ve tried to tell a story in three verses, a thousand words is a lot of space.\nWhat does your writing process look like?\nMy writing process is in flux right now. I’m still trying to figure out what it means to be a novelist as well as a short fiction writer. That said, I do my best work without an empty page looming. I spend a lot of my non-writing time thinking out the things that would stop me if I was sitting in front of a blank screen. I work out the knotty stuff while I’m walking the dog or running or driving, so that by the time I get to sit down with the piece I’m excited and ready to move forward. Some days I don’t write much or anything, and some (rare) days I can write eight or ten thousand words in a sitting. Beyond that, different stories have different paths, depending on what I need to research, what I need to think about.\nWhat project are you working on next?\nI have four stories waiting patiently to be written, and I’m gearing up for the release of my first novel in September (A Song for a New Day, Berkley, 9/10/19). A Song for a New Day is related to my Nebula-winning novelette “Our Lady of the Open Road,” and explores the lives of two characters in a near-future where people have been scared into staying home—one who remembers the time before, and one who has never known anything else.\nRight now, I’m drafting my second novel, which is another near future story that explores a technology and its repercussions, positive and negative.\nSongs and stories have long been inspired by the sea. What inspired you to write “Sooner or Later Everything Falls into the Sea”?\nThe germ of the story came from sitting around with Scott Andrews from Beneath Ceaseless Skies at the Dogfish Head Brewpub. I don’t remember what preceded it, but I said “the rock star washed ashore,” and he said something like, “you need to write that story, and unfortunately it won’t be a BCS story.” I think I spent five minutes trying to write it as a story about a bard so it could go to him, but it was clearly meant to be contemporary/near future. The next image that came to my mind was a bunch of seas converging at impossible angles, which I took and used in a story for Asimov’s, “Clearance.” Once I had Bay’s voice, it all solidified; she was tremendously fun to write. I like soft apocalypses, where people retain their humanity in the face of hardship.\nWhy will we never speak of the song “Hellbound Train?” Sounds like the title for a good story!\nHa! You have done a deep dive into my biography. At the time (middle school) I thought bands who had a song with the same name as the band were the height of cool. I was wrong. I’m not sure we were really in a position to pull off either a song or a band of that name. The lyrics started with “We’ve set the world on fire/with our music and our songs” which may have been a little, um, presumptuous.\nWhere do you hide the multitude of Sarah Pinskers when they’re not appearing in one of your stories?\nAs far as I know, they all go back to their own realities.\nChris Urie is a writer and editor from Ocean City, NJ. He has written and published everything from city food guide articles to critical essays on video game level design. He currently lives in Philadelphia with an ever expanding collection of books and a small black rabbit that has an attitude problem.", "source": "https://clarkesworldmagazine.com/pinsker_interview/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: High Seas, Multiple Selves, and Unspoken Songs: A Conversation with Sarah Pinsker by Chris Urie"}