{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Gregory Feeley", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "JGQgJxtxUQ2e6RgH1hNcsjsJQpU=", "id": null, "license": null, "comments": "", "raw_text": "9840 words, novelette  Cloud-Born  Nessus assaulted a warrior’s wife and was slain with a poisoned arrow; Euryptus disrupted a wedding and provoked a slaughter; Pholus was caught between his human friends and his kin; Chiron taught humans but could not pass his wisdom to the young of his own kind. Intemperate, imprudent, and invariably the losers, they were more beasts than men. Even the one who was rewarded with metamorphosis into a constellation gained immortality at the expense of his heritage—forever to be remembered as “The Archer” instead of what he was.  “Such sadness,” Asia would exclaim, looking over Justin’s shoulder as he read. “How awful it would be if such things actually happened.”  Light flickered on the slopes above, too distant to hear. Air currents brought a whiff of ozone, although none of the children recognized it.  “Did they have to leave their home?” asked little Yukiko, who evidently understood some of their meaning.  “Indeed,” said Justin wisely. “They scattered in many directions, for Herakles seemed ready to kill them all. Some fled to Mount Pelion, where they sought refuge with Pholus, but Herakles pursued them there, and accidentally slew even his old friend.”  Asia shook her head. “All because Herakles wouldn’t share the wine in their communal jar, nor heed Chiron’s warning not to open it. And after the great hero had killed several and set off after the rest, Chiron plucked an arrow from one of the corpses, wondering how so small a thing could kill such great creatures, and it slipped from his fingers and pierced his foot, poisoning him instantly.”  More flickering, and a low boom rolled across the hills.  “Long ago,” Yukiko mused. No one had anything to add to this, and Justin closed the book.  “It’s only sort of true,” he assured her as they made their way down the escarpment. Bits of rock spurted from beneath their boots and clattered down ahead of them like startled animals. Last week they had fallen more slowly, and rubble shifting underfoot had been less alarming.  “Four legs can climb better, too,” Yukiko remarked as she picked her way across a bed of spilled gravel. As she slid and recovered, Asia bent and picked up a fragment.  “Look at this,” she said. “It’s flat on one side.”  They peered at her discovery. “Sliced with a cutting tool,” Justin declared.  Asia lifted the stone to her eye and sighted along the plane. “I don’t think so,” she said. She pulled out her reckoner and played its thin beam slowly over the flat surface. “It’s slightly concave,” she reported after studying the display. “Although the curve it describes is quite large.”  “It’s part of the sky,” said Yukiko suddenly. “It fell.”  The three children looked upward. “There were cracks,” said Asia at last. “A chip came loose.”  Justin had taken the fragment and was absently running his finger across its smooth surface. “Ow!” he cried, dropping it. “It jabbed me!”  The two girls looked at the tiny bead of blood on Justin’s fingertip. “You scratched it on a rough part,” Yukiko said.  “No.” Scowling, Justin looked at the ground, but the fragment had disappeared among the rubble.  Gripping each others’ arms to keep balance, they slowly descended the slope, sometimes sliding with a shriek down several steps. Asia glanced up at the lowering sky, as though waiting for a fat drop to strike her head (it had rained briefly last night), but the clouds that gathered beneath the dome of the heavens were moving on, driven by blowers or the odd dynamics of this tiny weather cell. Welders’ lights flashed again, producing a diffuse glow in the cloud cover. When the path came into view they turned back, but this close to deck level one could no longer see the bent figures moving upon the earthworks, silhouetted in the arclight as they worked at remaking the world.  The planet was a ball of wind, which was strange because it was named after a god of the sea. Neither seemed appropriate, as the world should be stone and soil—certainly their world, for all that grown-ups told them it wasn’t a world at all but merely a seed, possessed of slopes to climb, grassy hills to run howling down, declivities that held shallow pools one could wade in. Seas covered most of the Earth to kilometers’ depth, and the new world was wind almost all the way down, thickening by increments to an icy core of unimaginable pressure.  They were circling the World at last, though the journey in the Pods (which had impressed the children more than anything else) had delivered them finally back to their familiar home. Asia had imagined a passage in landing boats, the crowded vessels pummeled as they braved the shallows (this had certainly happened), then disembarkation onto . . . Not strange shores; they had been returned rather to their emptied hull, battered after its rougher deceleration but now being rebuilt. Small wonder the children were confused by this landfall the grown-ups found so momentous.  The grown-ups made much of that blue orb flecked with white now visible at every window, though its image had been searchable, indeed urged upon them, for their entire lives. But now, they were told, it was different, for here it was; unmediated by imaging technologies. Justin had ready the answer to that: If this were an unmediated image, seen through an actual window (not a screen), then the window would be set in the floor, and they would gaze down to see a whirling starscape, with the World sailing past every minute or so.  This nettled the grown-ups, who explained that yes, but this image was not a magnified one, as the others had all been, but showed what one would actually see if the ship were not still spinning. “Big deal!” replied Justin cheerfully, or so he later told the others.  “A ‘window’ is just a screen set in the wall,” Asia explained to Yukiko, who wasn’t following all of this. “An actual window, the kind they have on Earth, shows what’s right on the other side, and you could climb through it if you wanted.”  “Like the window in Journey,” cried Yukiko, suddenly enlightened.  Justin frowned, but Asia exclaimed, “That’s right, you clever thing.” Turning to Justin, she explained: “There was a children’s version of Journey to the West played in the park last spring.”  “The robbers came in the window,” Yukiko recalled.  Asia imagined clearing away rocks and topsoil—not in the park, but down at the lowermost level—and discovering a true window, like a buried paving stone, that opened onto a wheeling depthless immensity. What would this feel like? Certainly the ground one stood upon was still, so it must seem the stars that were moving. The flat surface would not encourage a sense of depth, so one could easily perceive the drifting field as convex. Miners, gaping in wonder, would think they beheld the flying souls of Hades.  Could the center spin faster than the rocky surface? Asia couldn’t see how, but that’s what happens in the World, whose whirligig core drags its atmosphere behind it like a whisk beating eggs. To believe that of the ground you walked upon was to accept that one’s homeland was but the skin of a soup, a crust stretched between heaven and inchoate depths. Shepherds, monsters, and mortal nymphs knew a divinely inhabited Olympos above and a ghost-filled underworld below; but did they truly accept that their olive-groved, freshet-cut world was but an ephemeral screen between twin eternities, their tumbling cliffs and wooded plains as fleeting as their own frail flesh?  The night before her examination Asia dreamed of satyrs lurking in the underbrush, pairs of alert eyes peering out from deep shade. They weren’t, she knew, the meditative kind who piped upon rocks; these were the ones with horns in their curly hair and roguish goatees, leaping out at wispy-gowned maidens who fled squealing. She also knew that they weren’t looking at her; her role in this dream was spectator, not participant.  No rustics lolled nearby, and Asia suddenly realized that the stillness was no pastoral interlude but the held charge of lying in wait. Were the satyrs’ quarry dryads soon to step forth unsuspecting from their trees? She imagined a water nymph rising from a brook, only to disperse in a shower at the first hint of danger.  Some dreams unfold as narrative, though rarely to a satisfactory ending; others evanesce into states of mood, like a pantomime hardening to frieze. Asia awoke with an inconclusive sense of something missing, as though the dream had been interrupted. But her last minutes before waking were familiar shoals, too shallow for the keels of true dreams.  The examiner was friendly and attentive, his face as familiar as everyone’s on ship was familiar. He left her with paper before stepping out, explaining as he did that subjects were encouraged to doodle, for the mental state it produced was helpful to the scanning instruments. Asia drew images of battle, members of the bride’s family fighting off the drunken assailants, furniture hurled and arrows loosed. She amused herself by drawing it along the top of the page, which the examiner remarked upon when he returned.  “It’s from the battle with the Lapiths,” she explained, sketching a series of vertical lines to suggest the Doric columns below.  “Is that what they are?” he asked, peering at the half-human forms as he detached the patches from her scalp. Asia smiled. “You can tell that they are imaginary creatures, can’t you?” he added. “The six limbs are a problem, but look especially at that angle to the spine, ninety degrees. Not really possible in a mammal.”  “Let me see your screen,” Asia said. She didn’t ask how the examiner knew after a second what the creatures were. A screen materialized above the table’s surface, and she gestured for a second in the adjoining air. An image of a llama appeared. “I used to think so, too,” she said, “but look at this beast—it’s quite real.”  “I see your point,” the examiner said with a laugh. “Earth is full of strange creatures, isn’t it?”  Asia said she couldn’t be sure; when everything was available to you only as an image, it was difficult to distinguish between real creatures, creatures that had once lived, and those that were purely fabulous.  “True enough,” the examiner admitted. “That’s a problem when perceptions are restricted to electronic sounds and images; it is difficult to distinguish between reality and fabrication.”  Asia sensed a segue into the matters at hand. She blanked the paper and composed herself to listen.  “You have been traveling all your life,” the examiner began, “and now you have finally arrived.”  Asia, who loved stories, closed her eyes.  “You have reached the land to which your parents set out, the world you have grown up approaching. But we cannot yet disembark; we ride at anchor, still in our ships. Now much work is being done, while we gaze upon the shore, knowing that someday our homes will be there.”  “Years?” asked Asia.  “Yes,” the examiner said smoothly, “one cannot build a city in weeks or even months. And we are building more than simply a settlement, or even a nation. We are building a world.”  “But not like Earth.”  “No world will be wholly like Earth. Not even Venus after the Reduction, nor Mars with its new atmosphere.”  “But they will be more like Earth than we shall ever be.”  “That is true, if you are thinking of an open sky and warmth from the Sun. But those worlds are dangerously close to each other, and closer still to Earth, which is itself dangerous.”  What about the habitats in the Greater Jovian? she almost asked, but she knew the answer she would get, and her impulse to ask questions was taking her farther from her story.  “An entire new world,” she murmured encouragingly.  “And it will take years to build. And just as the great cities of Earth were never ‘complete’ but continued to develop throughout their history, so the world we will build around Neptune will always be growing. Our world will advance as we create new skills and technologies.”  “What he means,” said Justin later, “is that we should expect to spend our lives carrying out a plan that was drawn up before we were born. There is nothing else that we can do.”  “Well, we do need to build a permanent settlement,” said Li Wei. “We can’t just remain on board here.”  “Why not? That’s something they tell us, but is it true?”  “We will need more space if our population is to grow.”  “Why should it?”  “This ‘they’ you speak of are people on Earth, not our elders,” Fatima pointed out.  “Probably, but so what? They have planned our lives for us. We have no choice. We are to spend our lives setting up camp.”  “Better than just going somewhere,” Li Wei observed, “which is what our parents spent their adult lives doing.”  “They had a choice.”  “Did they?”  Everyone was silent for a moment.  “It doesn’t matter,” Asia said at last. “Here we are.”  “An admirable attitude. Was your examiner pleased with your unquestioning adjustment?”  “Not entirely. I asked him why our ship was named after a mythical creature.”  Justin laughed. “What did he say?”  “He told me to look it up.”  “Quite rightly, too.” Justin turned to Yukiko. “It’s because the ship’s main body used to be an asteroid while the Pods where we live are artificial habitats.”  “We live in the Pods because the Hull can’t provide gravity,” said Yukiko wisely.  “Oh, its spin gives it the effect of gravity. Just not enough, so the Pods are held farther out, like a dancer twirling with arms extended. You’re feeling gravity now, aren’t you?”  The older children, who were sitting with their legs dangling, looked down over the edge. This close to the spin axis, gravity was indeed very light, and the structures that reached up from ground level were shaped like ziggurats, wide at the bottom and then narrowing as they crowded toward the center. They sat upon a ledge halfway up a tier of unevenly stacked modules that had been piled high to save space on the ground. The central mass of the ship had been honeycombed with compartments, but now stood hollow, a great spinning shell whose interior would soon be rebuilt. The children liked this region, a mountainous heap of disused parts where they could clamber without being reproached by the adults, who were busier than they had ever seen them. The Hull, which had never rotated quickly enough to provide Earth-level gravity, had lost much of its spin in the savage deceleration it had undergone in aerobraking through Neptune’s upper atmosphere, and now offered a realm of dreamlike buoyancy, more striking the higher one climbed.  Rise high enough, however, and you could feel your feet moving slightly faster than your head, a sensation the children found unsettling. They had paused at successive levels and were now uncertain whether to continue, dazzling though the view was of the overhead landscape, like looking up to behold the interior of a hollow Earth. They had grown up in the full gravity of the Pods and their every sinew warned against falling farther than their own height.  “There’s more to it than that,” said Justin.  Asia cast him an irritated look. She had grown tired of his knowing comments on matters she knew little about, which he often declared himself unable to substantiate because they were confidential.  “Well, tell us,” she said.  Justin shrugged. “Everyone wants gravity. Our cells crave it; we don’t thrive in low-G environments, and no treatment has remedied that. And employing inertial force in spinning habitats has its own problems, which really can’t be solved. That’s why people still want to live upon Venus; its gravity is real.”  “What’s wrong with our gravity?” asked Yukiko.  “It’s a matter of engineering,” Asia answered before Justin could say anything. She was irritated by his desire to appear wise before the younger kids by sayings things that were common knowledge. “Both Pods swing on long arms, right? Those arms are under continuous strain. What would happen if one of them weakened and broke?”  Yukiko frowned as she tried to imagine this. Justin, helpful as always, made a gesture of both hands flying apart.  “Could this happen to us?” she asked in a small voice.  “It hasn’t ever happened,” Asia assured her, throwing Justin a nasty look. “Not in our entire lives; not in the eighteen years of our voyage. And not for the next eighteen, or a hundred. Justin is talking about people who worry about the next thousand years.”  “Or fifty thousand,” said Justin helpfully. “People have been living on Earth for hundreds of thousands of years, and the planet has never suffered a catastrophic failure that killed everyone. Solid objects with gravitational fields produce that kind of stability, and that’s what the rest of us want.”  Yukiko was looking a bit confused by this. “We are not going to live on Neptune,” she said after a moment.  “Of course not,” said Asia reassuringly, then glanced at Justin. “Neptune is our countryside, our farmland and our forests. After sailing all our lives through emptiness, we have reached the land that will sustain us. We will harvest its resources, and our ship will grow in size and splendor,   A magnificent home, imperishable, glittering with stars,  Greatest in the heavens . . . ” And we will create our own gravity, by present means or some other.”  “There is still more about it than that,” Justin said pleasantly. “Would you like me to show you?” He leaned over toward Asia, as though to whisper in her ear, and pushed her suddenly off the edge.  With a shriek she sailed into open space, the force of his shove propelling her outward faster than gravity pulled her down. The children were shouting, but she didn’t hear them. A tremendous void yawned beneath her, and the vagrant breezes that wafted through the Hull seemed to buffet her face more quickly.  She seemed to be falling straight down, though part of her mind knew this to be wrong. The ground below was coming up faster, and she realized—the terror that flooded her consciousness was not entirely unreasoning—that a fall at this distance, even in reduced gravity, would accelerate her to deadly velocity. Instinctively she threw out her arms—  The glancing blow knocked her sideways, sending her into a slow roll that sent her surroundings whirling past. She had struck the side of a stack, a bruising blow to the shoulders that—  And she struck again, this time banging her back and butt. She was bouncing off the side of a tier, because—of course—its lower levels were rotating into her path. Her fall was not the straight plunge that a dropped cup seemed to follow, but a vector cutting through the sweep of—  This time she caromed off a tarp-covered expanse, which yielded slightly before sending her back into space. A few seconds later she struck again, and slid for a second along its smooth surface before a sharp corner beneath it sent her spinning.  After that the cliffside rose up repeatedly to smack her. She was not Hephaistos, flung from the heights, but a satyr tumbling down a rocky slope. The realization that she was not going to die had just taken form when she slammed into something hard. The impact drove every puff of air from her lungs, and it was several disoriented seconds before she realized that she had come to rest upon the “ground.”  Asia lay still, less out of pain (although there was that) than from a reeling vertigo that sent the world swirling about her. There were shouts somewhere overhead, but she could not tell whose. A second later a rush of self-consciousness flooded through her, and she rose unsteadily on her palms to look about.  Fatima, Li Wei, and Yukiko were dropping to the ground, concern on their faces. There was no sign of Justin. Of course, she thought wearily: he would not bother scrambling down to see if she were all right; he had known that the plummet would merely leave her dazed, humiliated, and angry.  She had expected repercussions for this—you didn’t have to be the miscreant to end up in trouble—but nobody mentioned it, or asked where they had been. This was a departure from the way things had been her entire life, but since the Reversals everything was different, and knowing that things are different offered no preparation for the next surprise.  None of her parents were showing much interest in where the children were spending their time. She told them about the stone chip that had fallen from the firmament, though even as she said it she realized this could not be true. An aunty explained that it must have come loose during orbital insertion when the Hull had whipped around Neptune and been, in the odd words of Granigran, “wrung like an old shoe.”  Meals were short and the adults would depart quickly, leaving the children bemused and sometimes hurt. Everyone was busy (“everyone” apparently did not include the children), and their docents were not giving extra assignments to make up for lost family time. The Pod was crowded (Castor was no doubt just as bad) with people whose living quarters had been in the Hull, and kids would slip through the narrowed corridors, hoping their docents would not track them as they headed for less crowded regions, such as the once-spacious Celestial Gardens or the Moon Pool. The fact that nobody had objected to their riding the elevator shafts down to the Hull and mingling with the workers showed how preoccupied everyone was. They wandered away, into areas where neither adult nor mech could be seen, realms of uncertain boundaries, products of an interim that had begun unannounced and would certainly not last.  What were the adults doing? It was not necessary to know, the children were told, because Things Were Different Now and once the settlement was established (they were assured), the children would be embarked upon entirely new projects, a lifetime of audacious endeavors.  “I can tell you what they are doing,” said Justin, who had come up behind them. Li Wei jumped, but Asia, who had expected something like this, did not move. The other children turned to look at her. Conversation, which had circled all afternoon around the grown-ups’ behavior, died instantly.  “Everyone has theories,” said Asia after a moment, as though responding to the previous speaker. “But without evidence, they are all of equal worth.”  Justin must have gestured to the others, because they all rose silently and moved away. Asia remained still, refusing to acknowledge him. After a moment he sat next to her, serene in his usual maddening presumption but free to be ignored.  “Do you know why I pushed you off the ledge?”  Asia glared at him, which he apparently took as permission to continue.  “It was a test, and it yielded two results. It confirmed that we are not being watched. Would I be here if any adult had seen that? The surveillance that we have spent our lives with does not extend to the Wilds, however many motes may be operating in the active construction zones.”  Asia had not thought of that. “And what is the second?” she asked.  “That you can be trusted. You didn’t turn me in.”  She glared again, but Justin’s expression was so disarming that curiosity began to adulterate her anger. “Trusted for what?”  “Trusted to be shown something I could never show unless I knew that no one was watching.”  Asia looked carefully around them. The other kids were gone, and she could not hear the faint buzz of tympani drifting through the air. “This is about the need for genuine gravity, right?”  “Not really. I mean that’s interesting, too, but I’ll tell you later.” He didn’t bother to glance around. “What do you think all the adults are doing these days?”  “Are you serious? They are all busy with the Arrival.”  Justin rolled his eyes, perhaps his most irritating habit. “Preparations for the Arrival are being made by the System.” He routinely affected a knowing tone when referring to those elements of the ship’s administration that were not people. “Do you think our parents are calculating trajectories or making resettlement plans? Have you seen any adults out in the work zones? None of that is being done by people. The adults are all engaged in something very different.”  Asia merely looked at him.  “Okay, I will tell you. They are training their brains to make them the kind of people who will spend their lives doing what the times ahead require.”  “You’re saying they are spending more time in the Dream.”  “It’s more than that. The Dream is nothing—you have been in the Dream, although they limit our time there. This is much more powerful.”  “And how do you know?”  “Well . . . ” And at this Justin’s voice dropped slightly. “I know someone in Implementation. We’re . . . friendly, you know?” Asia stared. “He tells me stuff.”  “Stuff he shouldn’t be telling you.”  “Well, yes.” Justin’s voice sounded defensive. “So I certainly shouldn’t be telling you, but I am. Because I know you won’t tell, and I know that no one is watching.”  “Watching?”  “Would you believe me if I didn’t have something to show you as well?”  Asia thought about that. She didn’t like Justin’s logical puzzle boxes, which you had to tap carefully on every side before proceeding to open, but she was used to them. “So you have it with you now,” she said.  Justin reached behind him and pulled something from his pocket. “Each unit is supposed to hold enough charge, or whatever is in it, for only one experience, and then it gets discarded. But there is always a bit left over, enough for a child. And I can tell you that it works.”  He held up a small object. It was black, flat, and rounded, and it rested easily in his hand.  “How would you like to be a centaur?”  The world was full of things the children did not know about, which they were told didn’t matter because a new world lay ahead of them. The world they grew up in was not the world their parents had left, so they knew little of that one as well.  No children were aboard when the ship departed from Earth orbit, though many were born the following year. The divide between children and grown-ups was stark; there were no youthful adults. Certainly someone had worried about this, to what end no child knew.  Perhaps it was because the children knew no stories of their homeland, or tales (aside from that of their parents’ embarkation) of their people, that the stories of Earth they had studied seemed equally vivid whether historical or imaginary. Asia knew that there had never been a winged horse, though she had never seen a real one, either. No soldiers had sprung up from dragon’s teeth, although self-replicating machines had done something like that, which was the reason (one of them) why there weren’t more people on Earth these days.  The children knew about history’s great revolutions, the invasion of continents and subjugation of millions, and they also knew that the verse epics about the Drowning of Bengal were based on real events but that the characters were mostly fictitious, and that the games that Justin had been thrilled to play, of battling one’s way through the chaos of the inundated cities to distant highlands, were (even he knew) lurid inventions. Asia had once imagined being a dryad but she had never thought them real, and when she figured out why they were always being pursued by satyrs or gods (and how often they ended up being transformed into animals or plants), she decided that she liked nereids. Later she developed a fascination with Arion, the immortal and swift-running horse, and then with other horses, especially those that flew through space, such as Lampus and Phaethon.  But people, even girls, are crafters and technites, so hands were necessary, as were (she soon decided) properly human features. She knew from a thousand images the Attic physiognomy, and imagined its windswept lineaments—resolute countenance, splendid hair streaming—upon a nobly galloping creature, horse and rider as one. Great was her shock when she learned that such mythical beasts already filled the tales she was exploring, and that the word for them was the name of their ship and home, a trochee so familiar that she had never imagined a separate meaning.  And their stories were unvaryingly sad. Asia was older now, and her life—everyone’s lives—shook with disruptions. She was still reading her way through Greek and Roman literature, mostly in English (on the perhaps dubious grounds that it was closer than Mandarin to the original languages), and now wondered how she had ever thought that mythology celebrated virtue rewarded and evil struck down. Why, then, was she still drawn to its jagged contours? It certainly did not offer veracity. Nothing in actual history was like it, and certainly nothing in the long unfraught voyage that that had filled her and her playmates’ lives.  But no one compelled her to justify her love, which remained unknown to the grown-ups unless her docents had told them. No child knew what their immaterial instructors reported to their parents, but what Asia’s knew of her reading and viewing—and they obviously knew everything—had proved no cause for concern. She pursued her studies every day, watched new shows from Earth when they became available, played in the Dream with her classmates when permitted, and read about gods and goddesses, monsters and heroes, creatures that could change shape or find theirs cruelly changed.  The shaggy and incontinent kentauroi were unlikely creatures to engage even her uncertain sympathies, but whom was she supposed to enjoy imagining in their agones and their destinies—Arachne, Niobe, Cassandra?  “It doesn’t alter your mind,” said Justin, who was doing something to the back of her head. Asia was slightly alarmed that Justin would even offer that assurance, so great was her society’s horror of incursions into the physical integrity of the brain. “It allows you to focus.”  “I can focus already,” Asia replied. “So can the grown-ups.”  “Not like this.” She felt something sticky adhere to her scalp and resisted the impulse to pull away. “And I’m not just repeating what I heard; I have experienced it.”  “So why is this important now? People have carried out tasks requiring intense concentration throughout history, and most of the planning that lies ahead of us is being made by cognitive systems.”  “Good question. I was hoping you would help me answer it.”  Asia turned to look him in the eye. “So that’s why you are offering me this?”  “I also think you will find it interesting. And whom else would I choose to share this with?”  Perhaps Justin was feeling uneasy about the subject, for he added, “So tell me more about centaurs. Where did they come from?”  This was something no one ever asked her about. “Accounts vary, but all agree that they are descended from an encounter between a human and a cloud creature, a pseudos created in the image of Hera as a trap for someone who sought to seduce her. Because the child of this union mated with horses, the resulting centaurs were called ‘nubigena,’ or cloud-born.”  Justin laughed. “So the centaurs came from a matrix of clouds, while our Centaur is bound for another. That’s called an irony, something I am said to cultivate to excess. The English word for irony is actually Greek, eironeia, did you know that?”  Asia was too nervous to attend to his chatter, which she anyway knew was intended to distract her. The device was resting snugly against her skull, and he reached around to attach something to each temple. “How is this supposed to work?” she asked.  “You imagine what you want and make it as vivid as possible. If you envision something sexual or violent, those parts of your brain will light up and the device will shut down.” Justin laughed. “So don’t do that!”  Asia imagined the hills of Thessaly, where centaurs had roamed freely in their early years. They both fought and rutted when they encountered humans, but Asia had no interest in that. Why make yourself into a fabulous creature and then meet up with people? It was an escape from the human, the deeply familiar, that she sought.  “Okay, that’s good . . . ” Justin must have been reading a display. “Now,” and he came around to face her, holding two wires that trailed back behind her. “You need to put these—”  “You’re not going to put those in my nose?” she cried.  “No, of course not. I place them underneath—” he positioned just below each nostril—“and when you are ready, you inhale deeply. They are hollow tubes, which release a substance that will help you relax.”  Asia knew she was not relaxed. “All right,” she said. She closed her eyes, paused for a long second, and then drew a slow breath. Within seconds she was unconscious.  As in a dream, there is no beginning: she has always been here. Sunlight beats upon the skin, and the warm breeze is rich with six or eight scents, some (she knows) from far away while others are so near they sting. If she stands still for a second—steadying herself so that her legs are not shifting on the uneven ground requires a moment—she can hear birdsong, branches rustle, the faint whistle of wind blowing over a crest. A long, deep breath fills her rib cage, fresher than any she has drawn.  Standing still is not possible; she is trotting ahead before she decides to. The afternoon sun falls upon a crumbling limestone escarpment tufted with scraggly trees contorted by mountain winds, while the landscape to the west descends in bluffs and patches of scrub to a broad plain. A crescent of reflected sunlight glistens from a river below, and she turns toward it.  Every child has scrambled on all fours and imagined herself a courser, but to possess six limbs—to pick your way briskly downslope while stripping leaves from a bough you find in your hands—is to feel your mind racing in ways never felt by humans, nor mayhap even by gods. She leaps effortlessly over a small stream, and the tetragonismos of the act, the parabolic beauty achieved by the slight lift of the shoulders at the right instant, sings like the blast of a horn. With a cry she throws up her arms and breaks into a gallop.  How could they think us mere beasts? Her fine mind can reach for an answer, but the question is torn loose by the winds of her passage and disappears somewhere behind her. Their loins are stallions’ but their psyches are human, and their unrecalled grandam was something greater than either. Hubris to declare ourselves greater than the twofoots; but centaurs lack the vanity of satyrs or women, and never shall we boast to gods or men. What we are we don’t vaunt; we be.  She follows the stream downhill, three times leaping over tributaries as they merge, but finally splashing through its now broader expanse for the mere joy of it. We take up more room in the world. The land is nearly level, greener and less stony. Her senses are no greater than any human’s; if there is a goat-man lurking behind the trees, she cannot smell him, nor hear the whispers of any daphnaie growing along the banks. She looks alertly about and reverses her olive bough so that she is gripping its narrow end.  Crossing a clearing, she sees a kite hovering high overhead, its wings almost motionless. Hopeful that such vigilance would keep smaller birds at bay, she searches for fig trees but finds only unripe fruit. A grapevine’s yield proves small and sour, and her thoughts turn naturally to meat.  Her people are adept with a bow, and even the twofoots acknowledge their skill with stones (although they tend to portray the six-limbed folk as hurling boulders down upon helpless humans). But she has neither bow nor arrows, nor skinning knife nor flint to start a fire. The palm-sized piece of dolomite she tossed idly up and down finds its target the second time she flings it—dropping the bough from her left hand as she drew back her right and letting fly before it struck the ground—but the hare she now holds limp will have to be borne to a spit, and she can neither secure it round her waist nor run a cord through its ears to sling over her shoulder. She drapes the carcass across her back and carefully stoops—one of the few actions her people cannot execute gracefully—to pick up more stones. An hour later she has two more hares, enough to hold in her hand without feeling foolish.  She hears them before they hear her, for their pounding hooves are many and hers are single and still. Yet this advantage is cancelled by some other factor—perhaps they scented her before she them, though they are, if anything, more pungent. A stronger sense of smell would accord with their broad nostrils and (as events prove) bestial natures.  They’re a hundred paces away, galloping through an open meadow, when they turn and make for her, although she stood swathed in heavy-branched shadows. All five are looking straight at her, so she steps forward, into afternoon sunlight, and stands as they come to a halt, spread in an arc before her. Their expressions are unreadable.  She nods, civil, and when they make no response, she holds up the brace of hares. “I need fire.”  The one in front merely laughs, a raucous sound that bears no trace of chioumor. The one to his left—a lieutenant?—speaks up. “Ask Prometheus.”  It is a more learned response than she had expected. Unsure what to make of it, she says equably, “I will share my meal with them who will skin and cook it.”  This time the laugh is distinctly unpleasant. “Give it to Forvasia,” the leader says.  They all trot to one side, mincingly, and she sees one in the back she has not noticed before. For a second she simply stares.  The one who stands before her is slighter than the others, though with the same insolent grinning expression. The tangled hair is only slightly worse than the others’ and the features only slightly less brutal, but the woman’s dugs are unmistakable. Asia stares. It is a female!  She has been holding her bough with one end planted in the ground, a neutral gesture, but now she lifts it to step carefully forward. Three steps, and she holds out the conies for the female. The creature makes no move to take them, and Asia pauses. To toss them to her feet would be an affront, but Asia balks at trotting up to someone who refuses to advance halfway.  Besides (she abruptly notices), the males have now shifted ground, spreading out as though preparing to surround her. She drops the conies and shifts the bough to the right hand. At this, several of them growl.  Without thinking, she slides her grip from the middle of the shaft to its narrow end and swings it in a fast arc before her. It cuts through the air with the whoosh of expelled breath. She means it as a warning, but the males howl with rage. A second later they charge her.  Even humans think fast in such circumstances. The centaurs will converge as they approach, so she rushes them instantly. The ugly one in the middle comes at her and she swings the bough, regretting that it is not a club. His kind cannot dodge as readily as twofoots, and it strikes an arm as he reaches for her. The roar of pain and outrage is lost as she gallops past, through the meadow behind them and toward the hills.  Her pursuers will lose seconds in turning about, which she knows not to let them recover. Through the meadow and into the glade beyond, between trees that the pack must jostle to get through. She tosses the bough aside and makes for higher ground.  If she cannot match the speed of a stallion, neither can the others. She scrambles over loose stones (hoping to send them tumbling downhill) and cuts back and forth nimbly up the bluff. At a rocky outcrop she turns to face the rabble, which is following her path at the cost of having to proceed in single file. She laughs aloud, causing them to look up from their efforts, their expressions contorted with fury.  Just above her, a sheet of rock has broken away from the cliff face and begun to angle toward the valley. Sure-footed, she reaches the spot where a chest-high column of cracked limestone stands like stacked plates. Bracing herself against the uphill slope, she places both hands against it and with more-than-human strength shoves hard. The pile tips and bursts, crashing down toward her tormentors with the sound of rolling thunder. It would be satisfying to pause and watch, but she turns and scrambles for the crest, at times using all six limbs to pull herself upward.  It is only when she reaches the top that she glimpses flickers of light on the horizon. Dark clouds are massing to the south, whence a brisk wind now blows. Was this a sign from the gods? Impossible to foresee what might catch their attention, or how their sympathies (or anger) might be roused. No time in any event to muse upon what vagaries might provoke Notos to bring up a southern storm.  The lightning flash is brighter than she expects, for she has not noticed how swiftly the clouds have overtaken her. It is only then that she sees two pairs of hands reach over the brink and grasp the rocky ledge. Up rise twin sets of eyes, burning with fury. And as the creatures haul themselves far enough for their forelegs to come clear, a third pair of hands appears.  She whirls and flees, hooves clattering on the moss-free stones. The ridge runs north for miles, its outlines lost in the sudden gloom. She can see enough, however, to confirm that there is no stand of trees where she can lose herself, no scatter of boulders behind which she can disappear and descend unseen. It is a landscape fit only for heedless flight.  A rumble comes from directly overhead, heavy with meaning though not clarity. Was she being urged onward, or was this an expression of displeasure? Grim are the prospects of those who misread signs; yet those who heed them often fare no better.  The howls behind her have grown too wild for her to distinguish, but she fears there are now more than three. She does not know how one centaur can overtake another—would he seize her streaming tail?—but the image of two of them pulling alongside fills her with such alarm that she decides—  The blow strikes her shoulder so hard that she staggers. Through the pain she realizes what has happened: someone has flung a stone. The implications are immediately clear: the distance one loses in stopping to pick up a stone is more than made up by a good throw. The gambit’s success will of course be swiftly imitated, and a few seconds later a wild cast shies off to the left, followed by the heavy thud, somewhere behind her, where a too-heavy missile lands.  The next stone hits her flank and she leaps as though jabbed. She can make out rough ground ahead, though she hesitates to slow down. A lightning flash suddenly illuminates the landscape: a steep defile, perhaps thirty feet deep, which she will have to descend and regain in order to continue north. The dilemma is immediately clear: She must pick her way carefully, while exposing herself to an assault of heavy rocks flung downward at her.  Her only option is a bad one, but she takes it at once. The western slope is the gentler descent, and she is bounding down it as fast as she dares. Within seconds she can hear howls of exultation from above, and her shoulders tighten involuntarily. The first rock crashes loudly a half dozen steps to her left. She knows that they cannot throw while coming down, so if she manages to make it out of range—  The blow sends her crashing into rubble she had been preparing to dodge. No pain, simply a thunderclap that obliterates all thought, then a headlong tumble and the sensation of legs breaking. Eyes wide, she lies still, feeling the world spinning about her as the scree where she sprawls cracks loudly with further impacts. A hammer blow to her ribs stuns her into awareness.  No final seconds wasted in wondering whether they will now leave her, perhaps to stumble somehow to her feet: she can hear them descending. So the last thing she sees will be their leering faces, with one perhaps hoisting a huge rock to smash in her head?  The pain is suddenly of a different order, pulling at her, twisting. She can feel herself seeping into the ground below, as though her dripping blood had nerves. Is this how one descends to the Underworld? Yet her chest is rising, not with a final breath but farther, reaching into the air.  The metamorphosis is well underway before she fully understands what is happening. Is this salvation? Out of pity, a sense of justice, or simply the inscrutable polytropos of divine caprice? The deliverance visited upon Daphne, Lotis, Arethusa is hers, but is she being transformed into a plant or a spring?  She feels herself pressing into the soil, assuming density, growing into something still and rooted. Has she become one of the gnarled pines, to stir in the winds that scour the ridge but never to move further?  The creatures, shrieking with glee, are approaching. Their heedless prancing kicks loose pebbles and stones, which come clattering down upon her.  And at once she is moving, slowly at first but unstoppably. No lotus tree or laurel, she slides off the cliff face like a turtle off a river stone, she is herself a wall of stone: no spring, but able to flow, and quickly flow faster.  Like a cascade she races down the slope, leaving a crumbling chasm into which the victors fall screaming, sweeping up material as she descends and making it part of herself. When she crashes at last into the valley floor, it is with a roar of triumph, a series of concussions as though in answer to the thunder, and the greater part of her substance flings itself to rest on the quivering earth even as her evaneros unfolds, rising as a vast cloud into the air.  “Are you feeling all right?” The question was posed so calmly, in a voice so trustful of reason in matters of inquiry, that Asia relaxed even as she ascended into consciousness. It was only after reflecting for several serene seconds that realization pricked her and she opened her eyes.  She was lying on a couch in a small office. A woman, one of the older ones, sat studying her. Her expression did not seem stern.  Asia sat up, in the full gravity of Pod level. There was a stinging sensation high in her nostrils, and with a thrill of distaste she realized that Justin must have slid those wires, and perhaps more of them, up into her sinuses. Of course: the device had been transmitting impulses directly to her frontal lobes.  “No headache or nausea?” the woman asked. “It wouldn’t surprise me, considering what you were doing.”  “No, I’m fine,” Asia replied. Then, “Oh, yes—Justin said that the device would register if the story turned violent. And it did, so I guess the System became aware of it.”  “I am sure that the System was aware of what was happening from the beginning,” the woman said.  “Oh.” And after a pause, “I suppose that Justin is going to get in trouble?”  The woman shrugged. “Perhaps, in some manner. But really, how? Where would we send him?”  Asia moved to sit up, but the couch seemed suddenly to tilt sideways. The woman put out a restraining arm. “Your sense of balance may be impaired for a few minutes. Just sit, and we can talk for a bit.”  Asia didn’t know whether she liked that.  “My name is Liang,” the woman said. “I have a first name and a job title, but I am the only person aboard the Centaur with that name, so I enjoy being called that.” She smiled at Asia. “I am glad that your jaunt did not distress you.”  Asia appreciated that Liang did not pretend she had not checked her vital signs for evidence of anxiety.  “The Turntale is designed to facilitate certain cognitive operations, but if it is used as your friend encouraged you to, it creates a narrative—or rather, you do. These little adventures are called ‘jaunts,’ and they are not for children.” She smiled. “I am sure you do not think of yourself as a child, but to those who embarked on this voyage, those born after departure will always be its children.”  Asia had been taught to respect her elders, but Liang must have seen something in her expression that she had not intended to show. “Remember, you will inherit this world,” the woman told her.  Asia had heard this before. “We didn’t ask to be sent here. You made a decision to leave, which we will never be able to do.”  Immediately, she apologized. Liang waved it away. “You are quite right, of course. But all generations are bound by what their parents could—or couldn’t—do. Virtually all of humanity is living in very nasty conditions, and not even those living offworld can truly expect their children’s to improve. We have delivered you from that—we are too far from Earth to be asked to bleed our resources to succor some fraction of their suffering population, and we sail above a frontier rich with resources. Earth and its habitats are attractive to you because you only know them from afar.”  This carried a ring of truth so awful that Asia began to cry. The misery welled up like the rising seas inundating a house—she had seen many dramas showing this—and spilled incontinently from her eyes.  Liang stood and took her hand. “Come with me,” she said in an adult’s authoritarian voice. Asia allowed herself to be led from the room and down a corridor leading onto a public concourse, and then, as Liang suddenly steered them toward a featureless expanse of wall, through a door that slid open at their approach and into darkness. Lights came up to disclose a narrow passageway. They were, Asia realized, behind the walls of their world, in one of the service spaces where the children were never allowed to go.  Without a word Liang strode ahead, beneath overhead lights that swung slowly to the left and out of sight, following the curvature of the Pod. Abruptly, she stopped before a small hatch set in the wall to their right. It required both her touch and some spoken words before it swung open, and she had to step up to enter the space beyond. She disappeared without a glance at Asia, who hesitated before realizing that she was expected to follow. Nimbly (she had grown up in full gravity), she hopped up and climbed into darkness.  There was a light somewhere ahead but none around them, and it was by touch rather than sight that she realized that the rough walls were of rock. She was in a tunnel, but walking in its near darkness Asia imagined she was venturing through a cave. The thought was not pleasant: Pholus and Creusa, Philoctetes and Odysseus’ crewmen had variously come to grief in such spaces.  Liang strode forward confidently, compelling Asia to hasten after her, only slightly reassured by the flat ground beneath their feet. The light before them grew until it resolved into the outline of a narrow door. Asia hung back as Liang stood framed by the glowing edges, waiting for whatever command she had given to be followed.  After several seconds the door slid open. Stars burst in upon them.  Liang stepped forward, not upon a walkway but into seemingly empty space. The stars about her were moving, wheeling in slow formation like the earthly firmament. There was nothing for Asia to do but follow, though she quailed at stepping onto nothingness. After two cautious steps, however, she could see a glimmer of refraction about them, reassurance that they were not standing naked to the void but inside a transparent walkway.  Something moved beneath her feet, and she guessed it an instant before it rose before her: Neptune, enormous in its looming proximity, a vast sphere of white-streaked blue. Almost filling the sky, it ascended, passed before them, and then rose above her head and was lost from sight, replaced by the panoply of stars.  “The Crystal Bridge, as they call it, swings all the way round to Castor, a great half circle arching over the heavens. So great a span you can scarcely sense its curvature in traversing its length. Soon it will be opened to foot traffic, that our people may venture beyond the confines of the Centaur, to gaze upon the world we have traveled so far to reach.  “Don’t be frightened. We are within Neptune’s magnetosphere, so can venture beyond the shielding of our ship. The habitats surrounding the Earth, Mars, and the Moon enjoy no such protection, which is why their population must undergo lifelong treatments and eventual health problems. It’s that, or live beneath the lunar surface, or—” and here she laughed—“on Earth.”  “Why are you showing me this?” Asia whispered.  “It’s beautiful, isn’t it? That’s a reason right there. And somewhere down there, or in the space around us, is where you will be living your life.  “But most important: This is real, not mediated. The cloud tops’ brilliant azure? No image: the light waves striking your eyes were produced by the Sun, hours ago, and have reflected off methane molecules that absorbed the other wavelengths.”  Liang smiled. “After your friend toyed with your perceptions—and, I am afraid, your emotions—you should be allowed to enjoy an unsimulated vista.  “We should go back—it’s getting cold, isn’t it? I can feel the air molecules slowing!”  And Asia could see a diffuse plume of vapor appear with Liang’s words. She stared at the tiny cloud, which swirled and vanished. Slowly—it grew warmer as they retraced their steps, so Liang did not hurry—they returned to the cave and through the space behind the walls to a small concourse, sparsely populated at this time of day. Nobody glanced at them as Liang turned to smile at Asia.  “Our journey out was one of the great voyages of human history, a tale you will relate to your children, and they theirs. But our ship was a pocket universe, isolated from the rest of humanity as it rose, like a soap bubble, through the air. And we inside the soap bubble could not really see beyond it, only its shimmering inner surface, distorted by its shape.  “And so we gazed at shimmering images, or turned our gaze upon ourselves. And those who grew up within this bubble know the worlds beyond our confines through a different episteme—I bet you know that word—than those who grew up otherwise. That way of knowing, of living, will soon change for you—” and here she smiled—“rather abruptly, and forever.”  It’s more complicated than that, said a voice in Asia’s head.  “I hope you don’t find this alarming. Much of it, after all, is not really news to you.” Liang reached out and tousled Asia’s hair. “Better get home,” she said. “Your family is waiting for you.” She raised her arm, still smiling, and a tendril swung down to grasp it and sweep her away.  For a long moment Asia simply stood there, oblivious to the passersby stepping around her. A query from home pinged on her wrist, and she absently responded with a touch. Her page offered to show her messages from friends, but she waved it away.  A god had spoken to her, was showing her favor, which could not be good. It was a thought too great to ponder, a shadow that, sweeping over everything, offered no hint to its form.  Instead she thought about the fields of Arcadia, where nymphs inhabited the rivers, springs, and trees, and satyrs cavorted, piping or perhaps lurking behind trees, any one of which might house (or somehow be) an oreiad or hamadryad. Through this land the centaurs had fled south, pitiable monsters whom the minor deities must have regarded with feelings beyond conjecture. A nymph could be molested by a human or a god, and sometimes only escape into sylvan form, but the brutish attentions of a centaur, assuming one managed to attract it, would trouble them no more than the attempted ruttings of a wild boar.  Slowly Asia began to cry. Their tiny world and home would be transformed, but its young would not live there; they would be expelled, driven forth to dwell in stony lands or forge, like Hephaistos, their own homes.   Show us the way to bitter exile,  Far from this mountain; To where ivy shaft nor dance nor drum reminds me . . . The Centaur, now in safe harbor, might in time become Elysium, but Asia and her friends would be cast upon the broken coast of Neptune, to build and populate its colonies. Granted techne in lieu of their birthright, they would mine its moons and skim its atmosphere, artificers of others’ designs.  Why was she crying? She knew this; she had always known it.  Treetops tossed their boughs as zephyrs blew sportively through them; footsteps hurried lightly through their shade, halting at the approach of heavier treads. Divinities and mortals alike knew such monsters as centaurs to be unnatural, yet withal they lived and died, unlike Talos and other mechanisms. But the Argo, an artifact, bore in its prow a timber from the forests of Dodona that could speak and give prophecy.  And so the vessel upon which Asia will in time sail forth shall bear some numen of the world it leaves behind. It is a cold comfort, but she tries to grasp it, having no other. Thus, she thinks (and something within her nods), shall the Centaur’s children be launched upon the seas of space, to become builders and citizens of floating cities, cloud-borne. Gregory Feeley writes science fiction and about science fiction. His first novel, The Oxygen Barons, was nominated for the Philip K. Dick Award and. His stories have been finalists for the Nebula Award and his essays and reviews have appeared in a variety of publications, including The Atlantic Monthly, the New York Times Magazine, the Washington Post Book World, and USA Today. Feeley's most recent novel is Kentauros and he recently completed a long novel, Hamlet the Magician. His previous Clarkesworld story, \"Cloud-Born\" will be reprinted in two \"year's best\" anthologies this year.", "text": "9840 words, novelette\nCloud-Born\nNessus assaulted a warrior’s wife and was slain with a poisoned arrow; Euryptus disrupted a wedding and provoked a slaughter; Pholus was caught between his human friends and his kin; Chiron taught humans but could not pass his wisdom to the young of his own kind. Intemperate, imprudent, and invariably the losers, they were more beasts than men. Even the one who was rewarded with metamorphosis into a constellation gained immortality at the expense of his heritage—forever to be remembered as “The Archer” instead of what he was.\n“Such sadness,” Asia would exclaim, looking over Justin’s shoulder as he read. “How awful it would be if such things actually happened.”\nLight flickered on the slopes above, too distant to hear. Air currents brought a whiff of ozone, although none of the children recognized it.\n“Did they have to leave their home?” asked little Yukiko, who evidently understood some of their meaning.\n“Indeed,” said Justin wisely. “They scattered in many directions, for Herakles seemed ready to kill them all. Some fled to Mount Pelion, where they sought refuge with Pholus, but Herakles pursued them there, and accidentally slew even his old friend.”\nAsia shook her head. “All because Herakles wouldn’t share the wine in their communal jar, nor heed Chiron’s warning not to open it. And after the great hero had killed several and set off after the rest, Chiron plucked an arrow from one of the corpses, wondering how so small a thing could kill such great creatures, and it slipped from his fingers and pierced his foot, poisoning him instantly.”\nMore flickering, and a low boom rolled across the hills.\n“Long ago,” Yukiko mused. No one had anything to add to this, and Justin closed the book.\n“It’s only sort of true,” he assured her as they made their way down the escarpment. Bits of rock spurted from beneath their boots and clattered down ahead of them like startled animals. Last week they had fallen more slowly, and rubble shifting underfoot had been less alarming.\n“Four legs can climb better, too,” Yukiko remarked as she picked her way across a bed of spilled gravel. As she slid and recovered, Asia bent and picked up a fragment.\n“Look at this,” she said. “It’s flat on one side.”\nThey peered at her discovery. “Sliced with a cutting tool,” Justin declared.\nAsia lifted the stone to her eye and sighted along the plane. “I don’t think so,” she said. She pulled out her reckoner and played its thin beam slowly over the flat surface. “It’s slightly concave,” she reported after studying the display. “Although the curve it describes is quite large.”\n“It’s part of the sky,” said Yukiko suddenly. “It fell.”\nThe three children looked upward. “There were cracks,” said Asia at last. “A chip came loose.”\nJustin had taken the fragment and was absently running his finger across its smooth surface. “Ow!” he cried, dropping it. “It jabbed me!”\nThe two girls looked at the tiny bead of blood on Justin’s fingertip. “You scratched it on a rough part,” Yukiko said.\n“No.” Scowling, Justin looked at the ground, but the fragment had disappeared among the rubble.\nGripping each others’ arms to keep balance, they slowly descended the slope, sometimes sliding with a shriek down several steps. Asia glanced up at the lowering sky, as though waiting for a fat drop to strike her head (it had rained briefly last night), but the clouds that gathered beneath the dome of the heavens were moving on, driven by blowers or the odd dynamics of this tiny weather cell. Welders’ lights flashed again, producing a diffuse glow in the cloud cover. When the path came into view they turned back, but this close to deck level one could no longer see the bent figures moving upon the earthworks, silhouetted in the arclight as they worked at remaking the world.\nThe planet was a ball of wind, which was strange because it was named after a god of the sea. Neither seemed appropriate, as the world should be stone and soil—certainly their world, for all that grown-ups told them it wasn’t a world at all but merely a seed, possessed of slopes to climb, grassy hills to run howling down, declivities that held shallow pools one could wade in. Seas covered most of the Earth to kilometers’ depth, and the new world was wind almost all the way down, thickening by increments to an icy core of unimaginable pressure.\nThey were circling the World at last, though the journey in the Pods (which had impressed the children more than anything else) had delivered them finally back to their familiar home. Asia had imagined a passage in landing boats, the crowded vessels pummeled as they braved the shallows (this had certainly happened), then disembarkation onto . . . Not strange shores; they had been returned rather to their emptied hull, battered after its rougher deceleration but now being rebuilt. Small wonder the children were confused by this landfall the grown-ups found so momentous.\nThe grown-ups made much of that blue orb flecked with white now visible at every window, though its image had been searchable, indeed urged upon them, for their entire lives. But now, they were told, it was different, for here it was; unmediated by imaging technologies. Justin had ready the answer to that: If this were an unmediated image, seen through an actual window (not a screen), then the window would be set in the floor, and they would gaze down to see a whirling starscape, with the World sailing past every minute or so.\nThis nettled the grown-ups, who explained that yes, but this image was not a magnified one, as the others had all been, but showed what one would actually see if the ship were not still spinning. “Big deal!” replied Justin cheerfully, or so he later told the others.\n“A ‘window’ is just a screen set in the wall,” Asia explained to Yukiko, who wasn’t following all of this. “An actual window, the kind they have on Earth, shows what’s right on the other side, and you could climb through it if you wanted.”\n“Like the window in Journey,” cried Yukiko, suddenly enlightened.\nJustin frowned, but Asia exclaimed, “That’s right, you clever thing.” Turning to Justin, she explained: “There was a children’s version of Journey to the West played in the park last spring.”\n“The robbers came in the window,” Yukiko recalled.\nAsia imagined clearing away rocks and topsoil—not in the park, but down at the lowermost level—and discovering a true window, like a buried paving stone, that opened onto a wheeling depthless immensity. What would this feel like? Certainly the ground one stood upon was still, so it must seem the stars that were moving. The flat surface would not encourage a sense of depth, so one could easily perceive the drifting field as convex. Miners, gaping in wonder, would think they beheld the flying souls of Hades.\nCould the center spin faster than the rocky surface? Asia couldn’t see how, but that’s what happens in the World, whose whirligig core drags its atmosphere behind it like a whisk beating eggs. To believe that of the ground you walked upon was to accept that one’s homeland was but the skin of a soup, a crust stretched between heaven and inchoate depths. Shepherds, monsters, and mortal nymphs knew a divinely inhabited Olympos above and a ghost-filled underworld below; but did they truly accept that their olive-groved, freshet-cut world was but an ephemeral screen between twin eternities, their tumbling cliffs and wooded plains as fleeting as their own frail flesh?\nThe night before her examination Asia dreamed of satyrs lurking in the underbrush, pairs of alert eyes peering out from deep shade. They weren’t, she knew, the meditative kind who piped upon rocks; these were the ones with horns in their curly hair and roguish goatees, leaping out at wispy-gowned maidens who fled squealing. She also knew that they weren’t looking at her; her role in this dream was spectator, not participant.\nNo rustics lolled nearby, and Asia suddenly realized that the stillness was no pastoral interlude but the held charge of lying in wait. Were the satyrs’ quarry dryads soon to step forth unsuspecting from their trees? She imagined a water nymph rising from a brook, only to disperse in a shower at the first hint of danger.\nSome dreams unfold as narrative, though rarely to a satisfactory ending; others evanesce into states of mood, like a pantomime hardening to frieze. Asia awoke with an inconclusive sense of something missing, as though the dream had been interrupted. But her last minutes before waking were familiar shoals, too shallow for the keels of true dreams.\nThe examiner was friendly and attentive, his face as familiar as everyone’s on ship was familiar. He left her with paper before stepping out, explaining as he did that subjects were encouraged to doodle, for the mental state it produced was helpful to the scanning instruments. Asia drew images of battle, members of the bride’s family fighting off the drunken assailants, furniture hurled and arrows loosed. She amused herself by drawing it along the top of the page, which the examiner remarked upon when he returned.\n“It’s from the battle with the Lapiths,” she explained, sketching a series of vertical lines to suggest the Doric columns below.\n“Is that what they are?” he asked, peering at the half-human forms as he detached the patches from her scalp. Asia smiled. “You can tell that they are imaginary creatures, can’t you?” he added. “The six limbs are a problem, but look especially at that angle to the spine, ninety degrees. Not really possible in a mammal.”\n“Let me see your screen,” Asia said. She didn’t ask how the examiner knew after a second what the creatures were. A screen materialized above the table’s surface, and she gestured for a second in the adjoining air. An image of a llama appeared. “I used to think so, too,” she said, “but look at this beast—it’s quite real.”\n“I see your point,” the examiner said with a laugh. “Earth is full of strange creatures, isn’t it?”\nAsia said she couldn’t be sure; when everything was available to you only as an image, it was difficult to distinguish between real creatures, creatures that had once lived, and those that were purely fabulous.\n“True enough,” the examiner admitted. “That’s a problem when perceptions are restricted to electronic sounds and images; it is difficult to distinguish between reality and fabrication.”\nAsia sensed a segue into the matters at hand. She blanked the paper and composed herself to listen.\n“You have been traveling all your life,” the examiner began, “and now you have finally arrived.”\nAsia, who loved stories, closed her eyes.\n“You have reached the land to which your parents set out, the world you have grown up approaching. But we cannot yet disembark; we ride at anchor, still in our ships. Now much work is being done, while we gaze upon the shore, knowing that someday our homes will be there.”\n“Years?” asked Asia.\n“Yes,” the examiner said smoothly, “one cannot build a city in weeks or even months. And we are building more than simply a settlement, or even a nation. We are building a world.”\n“But not like Earth.”\n“No world will be wholly like Earth. Not even Venus after the Reduction, nor Mars with its new atmosphere.”\n“But they will be more like Earth than we shall ever be.”\n“That is true, if you are thinking of an open sky and warmth from the Sun. But those worlds are dangerously close to each other, and closer still to Earth, which is itself dangerous.”\nWhat about the habitats in the Greater Jovian? she almost asked, but she knew the answer she would get, and her impulse to ask questions was taking her farther from her story.\n“An entire new world,” she murmured encouragingly.\n“And it will take years to build. And just as the great cities of Earth were never ‘complete’ but continued to develop throughout their history, so the world we will build around Neptune will always be growing. Our world will advance as we create new skills and technologies.”\n“What he means,” said Justin later, “is that we should expect to spend our lives carrying out a plan that was drawn up before we were born. There is nothing else that we can do.”\n“Well, we do need to build a permanent settlement,” said Li Wei. “We can’t just remain on board here.”\n“Why not? That’s something they tell us, but is it true?”\n“We will need more space if our population is to grow.”\n“Why should it?”\n“This ‘they’ you speak of are people on Earth, not our elders,” Fatima pointed out.\n“Probably, but so what? They have planned our lives for us. We have no choice. We are to spend our lives setting up camp.”\n“Better than just going somewhere,” Li Wei observed, “which is what our parents spent their adult lives doing.”\n“They had a choice.”\n“Did they?”\nEveryone was silent for a moment.\n“It doesn’t matter,” Asia said at last. “Here we are.”\n“An admirable attitude. Was your examiner pleased with your unquestioning adjustment?”\n“Not entirely. I asked him why our ship was named after a mythical creature.”\nJustin laughed. “What did he say?”\n“He told me to look it up.”\n“Quite rightly, too.” Justin turned to Yukiko. “It’s because the ship’s main body used to be an asteroid while the Pods where we live are artificial habitats.”\n“We live in the Pods because the Hull can’t provide gravity,” said Yukiko wisely.\n“Oh, its spin gives it the effect of gravity. Just not enough, so the Pods are held farther out, like a dancer twirling with arms extended. You’re feeling gravity now, aren’t you?”\nThe older children, who were sitting with their legs dangling, looked down over the edge. This close to the spin axis, gravity was indeed very light, and the structures that reached up from ground level were shaped like ziggurats, wide at the bottom and then narrowing as they crowded toward the center. They sat upon a ledge halfway up a tier of unevenly stacked modules that had been piled high to save space on the ground. The central mass of the ship had been honeycombed with compartments, but now stood hollow, a great spinning shell whose interior would soon be rebuilt. The children liked this region, a mountainous heap of disused parts where they could clamber without being reproached by the adults, who were busier than they had ever seen them. The Hull, which had never rotated quickly enough to provide Earth-level gravity, had lost much of its spin in the savage deceleration it had undergone in aerobraking through Neptune’s upper atmosphere, and now offered a realm of dreamlike buoyancy, more striking the higher one climbed.\nRise high enough, however, and you could feel your feet moving slightly faster than your head, a sensation the children found unsettling. They had paused at successive levels and were now uncertain whether to continue, dazzling though the view was of the overhead landscape, like looking up to behold the interior of a hollow Earth. They had grown up in the full gravity of the Pods and their every sinew warned against falling farther than their own height.\n“There’s more to it than that,” said Justin.\nAsia cast him an irritated look. She had grown tired of his knowing comments on matters she knew little about, which he often declared himself unable to substantiate because they were confidential.\n“Well, tell us,” she said.\nJustin shrugged. “Everyone wants gravity. Our cells crave it; we don’t thrive in low-G environments, and no treatment has remedied that. And employing inertial force in spinning habitats has its own problems, which really can’t be solved. That’s why people still want to live upon Venus; its gravity is real.”\n“What’s wrong with our gravity?” asked Yukiko.\n“It’s a matter of engineering,” Asia answered before Justin could say anything. She was irritated by his desire to appear wise before the younger kids by sayings things that were common knowledge. “Both Pods swing on long arms, right? Those arms are under continuous strain. What would happen if one of them weakened and broke?”\nYukiko frowned as she tried to imagine this. Justin, helpful as always, made a gesture of both hands flying apart.\n“Could this happen to us?” she asked in a small voice.\n“It hasn’t ever happened,” Asia assured her, throwing Justin a nasty look. “Not in our entire lives; not in the eighteen years of our voyage. And not for the next eighteen, or a hundred. Justin is talking about people who worry about the next thousand years.”\n“Or fifty thousand,” said Justin helpfully. “People have been living on Earth for hundreds of thousands of years, and the planet has never suffered a catastrophic failure that killed everyone. Solid objects with gravitational fields produce that kind of stability, and that’s what the rest of us want.”\nYukiko was looking a bit confused by this. “We are not going to live on Neptune,” she said after a moment.\n“Of course not,” said Asia reassuringly, then glanced at Justin. “Neptune is our countryside, our farmland and our forests. After sailing all our lives through emptiness, we have reached the land that will sustain us. We will harvest its resources, and our ship will grow in size and splendor,\nA magnificent home, imperishable, glittering with stars,\nGreatest in the heavens . . . ”\nAnd we will create our own gravity, by present means or some other.”\n“There is still more about it than that,” Justin said pleasantly. “Would you like me to show you?” He leaned over toward Asia, as though to whisper in her ear, and pushed her suddenly off the edge.\nWith a shriek she sailed into open space, the force of his shove propelling her outward faster than gravity pulled her down. The children were shouting, but she didn’t hear them. A tremendous void yawned beneath her, and the vagrant breezes that wafted through the Hull seemed to buffet her face more quickly.\nShe seemed to be falling straight down, though part of her mind knew this to be wrong. The ground below was coming up faster, and she realized—the terror that flooded her consciousness was not entirely unreasoning—that a fall at this distance, even in reduced gravity, would accelerate her to deadly velocity. Instinctively she threw out her arms—\nThe glancing blow knocked her sideways, sending her into a slow roll that sent her surroundings whirling past. She had struck the side of a stack, a bruising blow to the shoulders that—\nAnd she struck again, this time banging her back and butt. She was bouncing off the side of a tier, because—of course—its lower levels were rotating into her path. Her fall was not the straight plunge that a dropped cup seemed to follow, but a vector cutting through the sweep of—\nThis time she caromed off a tarp-covered expanse, which yielded slightly before sending her back into space. A few seconds later she struck again, and slid for a second along its smooth surface before a sharp corner beneath it sent her spinning.\nAfter that the cliffside rose up repeatedly to smack her. She was not Hephaistos, flung from the heights, but a satyr tumbling down a rocky slope. The realization that she was not going to die had just taken form when she slammed into something hard. The impact drove every puff of air from her lungs, and it was several disoriented seconds before she realized that she had come to rest upon the “ground.”\nAsia lay still, less out of pain (although there was that) than from a reeling vertigo that sent the world swirling about her. There were shouts somewhere overhead, but she could not tell whose. A second later a rush of self-consciousness flooded through her, and she rose unsteadily on her palms to look about.\nFatima, Li Wei, and Yukiko were dropping to the ground, concern on their faces. There was no sign of Justin. Of course, she thought wearily: he would not bother scrambling down to see if she were all right; he had known that the plummet would merely leave her dazed, humiliated, and angry.\nShe had expected repercussions for this—you didn’t have to be the miscreant to end up in trouble—but nobody mentioned it, or asked where they had been. This was a departure from the way things had been her entire life, but since the Reversals everything was different, and knowing that things are different offered no preparation for the next surprise.\nNone of her parents were showing much interest in where the children were spending their time. She told them about the stone chip that had fallen from the firmament, though even as she said it she realized this could not be true. An aunty explained that it must have come loose during orbital insertion when the Hull had whipped around Neptune and been, in the odd words of Granigran, “wrung like an old shoe.”\nMeals were short and the adults would depart quickly, leaving the children bemused and sometimes hurt. Everyone was busy (“everyone” apparently did not include the children), and their docents were not giving extra assignments to make up for lost family time. The Pod was crowded (Castor was no doubt just as bad) with people whose living quarters had been in the Hull, and kids would slip through the narrowed corridors, hoping their docents would not track them as they headed for less crowded regions, such as the once-spacious Celestial Gardens or the Moon Pool. The fact that nobody had objected to their riding the elevator shafts down to the Hull and mingling with the workers showed how preoccupied everyone was. They wandered away, into areas where neither adult nor mech could be seen, realms of uncertain boundaries, products of an interim that had begun unannounced and would certainly not last.\nWhat were the adults doing? It was not necessary to know, the children were told, because Things Were Different Now and once the settlement was established (they were assured), the children would be embarked upon entirely new projects, a lifetime of audacious endeavors.\n“I can tell you what they are doing,” said Justin, who had come up behind them. Li Wei jumped, but Asia, who had expected something like this, did not move. The other children turned to look at her. Conversation, which had circled all afternoon around the grown-ups’ behavior, died instantly.\n“Everyone has theories,” said Asia after a moment, as though responding to the previous speaker. “But without evidence, they are all of equal worth.”\nJustin must have gestured to the others, because they all rose silently and moved away. Asia remained still, refusing to acknowledge him. After a moment he sat next to her, serene in his usual maddening presumption but free to be ignored.\n“Do you know why I pushed you off the ledge?”\nAsia glared at him, which he apparently took as permission to continue.\n“It was a test, and it yielded two results. It confirmed that we are not being watched. Would I be here if any adult had seen that? The surveillance that we have spent our lives with does not extend to the Wilds, however many motes may be operating in the active construction zones.”\nAsia had not thought of that. “And what is the second?” she asked.\n“That you can be trusted. You didn’t turn me in.”\nShe glared again, but Justin’s expression was so disarming that curiosity began to adulterate her anger. “Trusted for what?”\n“Trusted to be shown something I could never show unless I knew that no one was watching.”\nAsia looked carefully around them. The other kids were gone, and she could not hear the faint buzz of tympani drifting through the air. “This is about the need for genuine gravity, right?”\n“Not really. I mean that’s interesting, too, but I’ll tell you later.” He didn’t bother to glance around. “What do you think all the adults are doing these days?”\n“Are you serious? They are all busy with the Arrival.”\nJustin rolled his eyes, perhaps his most irritating habit. “Preparations for the Arrival are being made by the System.” He routinely affected a knowing tone when referring to those elements of the ship’s administration that were not people. “Do you think our parents are calculating trajectories or making resettlement plans? Have you seen any adults out in the work zones? None of that is being done by people. The adults are all engaged in something very different.”\nAsia merely looked at him.\n“Okay, I will tell you. They are training their brains to make them the kind of people who will spend their lives doing what the times ahead require.”\n“You’re saying they are spending more time in the Dream.”\n“It’s more than that. The Dream is nothing—you have been in the Dream, although they limit our time there. This is much more powerful.”\n“And how do you know?”\n“Well . . . ” And at this Justin’s voice dropped slightly. “I know someone in Implementation. We’re . . . friendly, you know?” Asia stared. “He tells me stuff.”\n“Stuff he shouldn’t be telling you.”\n“Well, yes.” Justin’s voice sounded defensive. “So I certainly shouldn’t be telling you, but I am. Because I know you won’t tell, and I know that no one is watching.”\n“Watching?”\n“Would you believe me if I didn’t have something to show you as well?”\nAsia thought about that. She didn’t like Justin’s logical puzzle boxes, which you had to tap carefully on every side before proceeding to open, but she was used to them. “So you have it with you now,” she said.\nJustin reached behind him and pulled something from his pocket. “Each unit is supposed to hold enough charge, or whatever is in it, for only one experience, and then it gets discarded. But there is always a bit left over, enough for a child. And I can tell you that it works.”\nHe held up a small object. It was black, flat, and rounded, and it rested easily in his hand.\n“How would you like to be a centaur?”\nThe world was full of things the children did not know about, which they were told didn’t matter because a new world lay ahead of them. The world they grew up in was not the world their parents had left, so they knew little of that one as well.\nNo children were aboard when the ship departed from Earth orbit, though many were born the following year. The divide between children and grown-ups was stark; there were no youthful adults. Certainly someone had worried about this, to what end no child knew.\nPerhaps it was because the children knew no stories of their homeland, or tales (aside from that of their parents’ embarkation) of their people, that the stories of Earth they had studied seemed equally vivid whether historical or imaginary. Asia knew that there had never been a winged horse, though she had never seen a real one, either. No soldiers had sprung up from dragon’s teeth, although self-replicating machines had done something like that, which was the reason (one of them) why there weren’t more people on Earth these days.\nThe children knew about history’s great revolutions, the invasion of continents and subjugation of millions, and they also knew that the verse epics about the Drowning of Bengal were based on real events but that the characters were mostly fictitious, and that the games that Justin had been thrilled to play, of battling one’s way through the chaos of the inundated cities to distant highlands, were (even he knew) lurid inventions. Asia had once imagined being a dryad but she had never thought them real, and when she figured out why they were always being pursued by satyrs or gods (and how often they ended up being transformed into animals or plants), she decided that she liked nereids. Later she developed a fascination with Arion, the immortal and swift-running horse, and then with other horses, especially those that flew through space, such as Lampus and Phaethon.\nBut people, even girls, are crafters and technites, so hands were necessary, as were (she soon decided) properly human features. She knew from a thousand images the Attic physiognomy, and imagined its windswept lineaments—resolute countenance, splendid hair streaming—upon a nobly galloping creature, horse and rider as one. Great was her shock when she learned that such mythical beasts already filled the tales she was exploring, and that the word for them was the name of their ship and home, a trochee so familiar that she had never imagined a separate meaning.\nAnd their stories were unvaryingly sad. Asia was older now, and her life—everyone’s lives—shook with disruptions. She was still reading her way through Greek and Roman literature, mostly in English (on the perhaps dubious grounds that it was closer than Mandarin to the original languages), and now wondered how she had ever thought that mythology celebrated virtue rewarded and evil struck down. Why, then, was she still drawn to its jagged contours? It certainly did not offer veracity. Nothing in actual history was like it, and certainly nothing in the long unfraught voyage that that had filled her and her playmates’ lives.\nBut no one compelled her to justify her love, which remained unknown to the grown-ups unless her docents had told them. No child knew what their immaterial instructors reported to their parents, but what Asia’s knew of her reading and viewing—and they obviously knew everything—had proved no cause for concern. She pursued her studies every day, watched new shows from Earth when they became available, played in the Dream with her classmates when permitted, and read about gods and goddesses, monsters and heroes, creatures that could change shape or find theirs cruelly changed.\nThe shaggy and incontinent kentauroi were unlikely creatures to engage even her uncertain sympathies, but whom was she supposed to enjoy imagining in their agones and their destinies—Arachne, Niobe, Cassandra?\n“It doesn’t alter your mind,” said Justin, who was doing something to the back of her head. Asia was slightly alarmed that Justin would even offer that assurance, so great was her society’s horror of incursions into the physical integrity of the brain. “It allows you to focus.”\n“I can focus already,” Asia replied. “So can the grown-ups.”\n“Not like this.” She felt something sticky adhere to her scalp and resisted the impulse to pull away. “And I’m not just repeating what I heard; I have experienced it.”\n“So why is this important now? People have carried out tasks requiring intense concentration throughout history, and most of the planning that lies ahead of us is being made by cognitive systems.”\n“Good question. I was hoping you would help me answer it.”\nAsia turned to look him in the eye. “So that’s why you are offering me this?”\n“I also think you will find it interesting. And whom else would I choose to share this with?”\nPerhaps Justin was feeling uneasy about the subject, for he added, “So tell me more about centaurs. Where did they come from?”\nThis was something no one ever asked her about. “Accounts vary, but all agree that they are descended from an encounter between a human and a cloud creature, a pseudos created in the image of Hera as a trap for someone who sought to seduce her. Because the child of this union mated with horses, the resulting centaurs were called ‘nubigena,’ or cloud-born.”\nJustin laughed. “So the centaurs came from a matrix of clouds, while our Centaur is bound for another. That’s called an irony, something I am said to cultivate to excess. The English word for irony is actually Greek, eironeia, did you know that?”\nAsia was too nervous to attend to his chatter, which she anyway knew was intended to distract her. The device was resting snugly against her skull, and he reached around to attach something to each temple. “How is this supposed to work?” she asked.\n“You imagine what you want and make it as vivid as possible. If you envision something sexual or violent, those parts of your brain will light up and the device will shut down.” Justin laughed. “So don’t do that!”\nAsia imagined the hills of Thessaly, where centaurs had roamed freely in their early years. They both fought and rutted when they encountered humans, but Asia had no interest in that. Why make yourself into a fabulous creature and then meet up with people? It was an escape from the human, the deeply familiar, that she sought.\n“Okay, that’s good . . . ” Justin must have been reading a display. “Now,” and he came around to face her, holding two wires that trailed back behind her. “You need to put these—”\n“You’re not going to put those in my nose?” she cried.\n“No, of course not. I place them underneath—” he positioned just below each nostril—“and when you are ready, you inhale deeply. They are hollow tubes, which release a substance that will help you relax.”\nAsia knew she was not relaxed. “All right,” she said. She closed her eyes, paused for a long second, and then drew a slow breath. Within seconds she was unconscious.\nAs in a dream, there is no beginning: she has always been here. Sunlight beats upon the skin, and the warm breeze is rich with six or eight scents, some (she knows) from far away while others are so near they sting. If she stands still for a second—steadying herself so that her legs are not shifting on the uneven ground requires a moment—she can hear birdsong, branches rustle, the faint whistle of wind blowing over a crest. A long, deep breath fills her rib cage, fresher than any she has drawn.\nStanding still is not possible; she is trotting ahead before she decides to. The afternoon sun falls upon a crumbling limestone escarpment tufted with scraggly trees contorted by mountain winds, while the landscape to the west descends in bluffs and patches of scrub to a broad plain. A crescent of reflected sunlight glistens from a river below, and she turns toward it.\nEvery child has scrambled on all fours and imagined herself a courser, but to possess six limbs—to pick your way briskly downslope while stripping leaves from a bough you find in your hands—is to feel your mind racing in ways never felt by humans, nor mayhap even by gods. She leaps effortlessly over a small stream, and the tetragonismos of the act, the parabolic beauty achieved by the slight lift of the shoulders at the right instant, sings like the blast of a horn. With a cry she throws up her arms and breaks into a gallop.\nHow could they think us mere beasts? Her fine mind can reach for an answer, but the question is torn loose by the winds of her passage and disappears somewhere behind her. Their loins are stallions’ but their psyches are human, and their unrecalled grandam was something greater than either. Hubris to declare ourselves greater than the twofoots; but centaurs lack the vanity of satyrs or women, and never shall we boast to gods or men. What we are we don’t vaunt; we be.\nShe follows the stream downhill, three times leaping over tributaries as they merge, but finally splashing through its now broader expanse for the mere joy of it. We take up more room in the world. The land is nearly level, greener and less stony. Her senses are no greater than any human’s; if there is a goat-man lurking behind the trees, she cannot smell him, nor hear the whispers of any daphnaie growing along the banks. She looks alertly about and reverses her olive bough so that she is gripping its narrow end.\nCrossing a clearing, she sees a kite hovering high overhead, its wings almost motionless. Hopeful that such vigilance would keep smaller birds at bay, she searches for fig trees but finds only unripe fruit. A grapevine’s yield proves small and sour, and her thoughts turn naturally to meat.\nHer people are adept with a bow, and even the twofoots acknowledge their skill with stones (although they tend to portray the six-limbed folk as hurling boulders down upon helpless humans). But she has neither bow nor arrows, nor skinning knife nor flint to start a fire. The palm-sized piece of dolomite she tossed idly up and down finds its target the second time she flings it—dropping the bough from her left hand as she drew back her right and letting fly before it struck the ground—but the hare she now holds limp will have to be borne to a spit, and she can neither secure it round her waist nor run a cord through its ears to sling over her shoulder. She drapes the carcass across her back and carefully stoops—one of the few actions her people cannot execute gracefully—to pick up more stones. An hour later she has two more hares, enough to hold in her hand without feeling foolish.\nShe hears them before they hear her, for their pounding hooves are many and hers are single and still. Yet this advantage is cancelled by some other factor—perhaps they scented her before she them, though they are, if anything, more pungent. A stronger sense of smell would accord with their broad nostrils and (as events prove) bestial natures.\nThey’re a hundred paces away, galloping through an open meadow, when they turn and make for her, although she stood swathed in heavy-branched shadows. All five are looking straight at her, so she steps forward, into afternoon sunlight, and stands as they come to a halt, spread in an arc before her. Their expressions are unreadable.\nShe nods, civil, and when they make no response, she holds up the brace of hares. “I need fire.”\nThe one in front merely laughs, a raucous sound that bears no trace of chioumor. The one to his left—a lieutenant?—speaks up. “Ask Prometheus.”\nIt is a more learned response than she had expected. Unsure what to make of it, she says equably, “I will share my meal with them who will skin and cook it.”\nThis time the laugh is distinctly unpleasant. “Give it to Forvasia,” the leader says.\nThey all trot to one side, mincingly, and she sees one in the back she has not noticed before. For a second she simply stares.\nThe one who stands before her is slighter than the others, though with the same insolent grinning expression. The tangled hair is only slightly worse than the others’ and the features only slightly less brutal, but the woman’s dugs are unmistakable. Asia stares. It is a female!\nShe has been holding her bough with one end planted in the ground, a neutral gesture, but now she lifts it to step carefully forward. Three steps, and she holds out the conies for the female. The creature makes no move to take them, and Asia pauses. To toss them to her feet would be an affront, but Asia balks at trotting up to someone who refuses to advance halfway.\nBesides (she abruptly notices), the males have now shifted ground, spreading out as though preparing to surround her. She drops the conies and shifts the bough to the right hand. At this, several of them growl.\nWithout thinking, she slides her grip from the middle of the shaft to its narrow end and swings it in a fast arc before her. It cuts through the air with the whoosh of expelled breath. She means it as a warning, but the males howl with rage. A second later they charge her.\nEven humans think fast in such circumstances. The centaurs will converge as they approach, so she rushes them instantly. The ugly one in the middle comes at her and she swings the bough, regretting that it is not a club. His kind cannot dodge as readily as twofoots, and it strikes an arm as he reaches for her. The roar of pain and outrage is lost as she gallops past, through the meadow behind them and toward the hills.\nHer pursuers will lose seconds in turning about, which she knows not to let them recover. Through the meadow and into the glade beyond, between trees that the pack must jostle to get through. She tosses the bough aside and makes for higher ground.\nIf she cannot match the speed of a stallion, neither can the others. She scrambles over loose stones (hoping to send them tumbling downhill) and cuts back and forth nimbly up the bluff. At a rocky outcrop she turns to face the rabble, which is following her path at the cost of having to proceed in single file. She laughs aloud, causing them to look up from their efforts, their expressions contorted with fury.\nJust above her, a sheet of rock has broken away from the cliff face and begun to angle toward the valley. Sure-footed, she reaches the spot where a chest-high column of cracked limestone stands like stacked plates. Bracing herself against the uphill slope, she places both hands against it and with more-than-human strength shoves hard. The pile tips and bursts, crashing down toward her tormentors with the sound of rolling thunder. It would be satisfying to pause and watch, but she turns and scrambles for the crest, at times using all six limbs to pull herself upward.\nIt is only when she reaches the top that she glimpses flickers of light on the horizon. Dark clouds are massing to the south, whence a brisk wind now blows. Was this a sign from the gods? Impossible to foresee what might catch their attention, or how their sympathies (or anger) might be roused. No time in any event to muse upon what vagaries might provoke Notos to bring up a southern storm.\nThe lightning flash is brighter than she expects, for she has not noticed how swiftly the clouds have overtaken her. It is only then that she sees two pairs of hands reach over the brink and grasp the rocky ledge. Up rise twin sets of eyes, burning with fury. And as the creatures haul themselves far enough for their forelegs to come clear, a third pair of hands appears.\nShe whirls and flees, hooves clattering on the moss-free stones. The ridge runs north for miles, its outlines lost in the sudden gloom. She can see enough, however, to confirm that there is no stand of trees where she can lose herself, no scatter of boulders behind which she can disappear and descend unseen. It is a landscape fit only for heedless flight.\nA rumble comes from directly overhead, heavy with meaning though not clarity. Was she being urged onward, or was this an expression of displeasure? Grim are the prospects of those who misread signs; yet those who heed them often fare no better.\nThe howls behind her have grown too wild for her to distinguish, but she fears there are now more than three. She does not know how one centaur can overtake another—would he seize her streaming tail?—but the image of two of them pulling alongside fills her with such alarm that she decides—\nThe blow strikes her shoulder so hard that she staggers. Through the pain she realizes what has happened: someone has flung a stone. The implications are immediately clear: the distance one loses in stopping to pick up a stone is more than made up by a good throw. The gambit’s success will of course be swiftly imitated, and a few seconds later a wild cast shies off to the left, followed by the heavy thud, somewhere behind her, where a too-heavy missile lands.\nThe next stone hits her flank and she leaps as though jabbed. She can make out rough ground ahead, though she hesitates to slow down. A lightning flash suddenly illuminates the landscape: a steep defile, perhaps thirty feet deep, which she will have to descend and regain in order to continue north. The dilemma is immediately clear: She must pick her way carefully, while exposing herself to an assault of heavy rocks flung downward at her.\nHer only option is a bad one, but she takes it at once. The western slope is the gentler descent, and she is bounding down it as fast as she dares. Within seconds she can hear howls of exultation from above, and her shoulders tighten involuntarily. The first rock crashes loudly a half dozen steps to her left. She knows that they cannot throw while coming down, so if she manages to make it out of range—\nThe blow sends her crashing into rubble she had been preparing to dodge. No pain, simply a thunderclap that obliterates all thought, then a headlong tumble and the sensation of legs breaking. Eyes wide, she lies still, feeling the world spinning about her as the scree where she sprawls cracks loudly with further impacts. A hammer blow to her ribs stuns her into awareness.\nNo final seconds wasted in wondering whether they will now leave her, perhaps to stumble somehow to her feet: she can hear them descending. So the last thing she sees will be their leering faces, with one perhaps hoisting a huge rock to smash in her head?\nThe pain is suddenly of a different order, pulling at her, twisting. She can feel herself seeping into the ground below, as though her dripping blood had nerves. Is this how one descends to the Underworld? Yet her chest is rising, not with a final breath but farther, reaching into the air.\nThe metamorphosis is well underway before she fully understands what is happening. Is this salvation? Out of pity, a sense of justice, or simply the inscrutable polytropos of divine caprice? The deliverance visited upon Daphne, Lotis, Arethusa is hers, but is she being transformed into a plant or a spring?\nShe feels herself pressing into the soil, assuming density, growing into something still and rooted. Has she become one of the gnarled pines, to stir in the winds that scour the ridge but never to move further?\nThe creatures, shrieking with glee, are approaching. Their heedless prancing kicks loose pebbles and stones, which come clattering down upon her.\nAnd at once she is moving, slowly at first but unstoppably. No lotus tree or laurel, she slides off the cliff face like a turtle off a river stone, she is herself a wall of stone: no spring, but able to flow, and quickly flow faster.\nLike a cascade she races down the slope, leaving a crumbling chasm into which the victors fall screaming, sweeping up material as she descends and making it part of herself. When she crashes at last into the valley floor, it is with a roar of triumph, a series of concussions as though in answer to the thunder, and the greater part of her substance flings itself to rest on the quivering earth even as her evaneros unfolds, rising as a vast cloud into the air.\n“Are you feeling all right?” The question was posed so calmly, in a voice so trustful of reason in matters of inquiry, that Asia relaxed even as she ascended into consciousness. It was only after reflecting for several serene seconds that realization pricked her and she opened her eyes.\nShe was lying on a couch in a small office. A woman, one of the older ones, sat studying her. Her expression did not seem stern.\nAsia sat up, in the full gravity of Pod level. There was a stinging sensation high in her nostrils, and with a thrill of distaste she realized that Justin must have slid those wires, and perhaps more of them, up into her sinuses. Of course: the device had been transmitting impulses directly to her frontal lobes.\n“No headache or nausea?” the woman asked. “It wouldn’t surprise me, considering what you were doing.”\n“No, I’m fine,” Asia replied. Then, “Oh, yes—Justin said that the device would register if the story turned violent. And it did, so I guess the System became aware of it.”\n“I am sure that the System was aware of what was happening from the beginning,” the woman said.\n“Oh.” And after a pause, “I suppose that Justin is going to get in trouble?”\nThe woman shrugged. “Perhaps, in some manner. But really, how? Where would we send him?”\nAsia moved to sit up, but the couch seemed suddenly to tilt sideways. The woman put out a restraining arm. “Your sense of balance may be impaired for a few minutes. Just sit, and we can talk for a bit.”\nAsia didn’t know whether she liked that.\n“My name is Liang,” the woman said. “I have a first name and a job title, but I am the only person aboard the Centaur with that name, so I enjoy being called that.” She smiled at Asia. “I am glad that your jaunt did not distress you.”\nAsia appreciated that Liang did not pretend she had not checked her vital signs for evidence of anxiety.\n“The Turntale is designed to facilitate certain cognitive operations, but if it is used as your friend encouraged you to, it creates a narrative—or rather, you do. These little adventures are called ‘jaunts,’ and they are not for children.” She smiled. “I am sure you do not think of yourself as a child, but to those who embarked on this voyage, those born after departure will always be its children.”\nAsia had been taught to respect her elders, but Liang must have seen something in her expression that she had not intended to show. “Remember, you will inherit this world,” the woman told her.\nAsia had heard this before. “We didn’t ask to be sent here. You made a decision to leave, which we will never be able to do.”\nImmediately, she apologized. Liang waved it away. “You are quite right, of course. But all generations are bound by what their parents could—or couldn’t—do. Virtually all of humanity is living in very nasty conditions, and not even those living offworld can truly expect their children’s to improve. We have delivered you from that—we are too far from Earth to be asked to bleed our resources to succor some fraction of their suffering population, and we sail above a frontier rich with resources. Earth and its habitats are attractive to you because you only know them from afar.”\nThis carried a ring of truth so awful that Asia began to cry. The misery welled up like the rising seas inundating a house—she had seen many dramas showing this—and spilled incontinently from her eyes.\nLiang stood and took her hand. “Come with me,” she said in an adult’s authoritarian voice. Asia allowed herself to be led from the room and down a corridor leading onto a public concourse, and then, as Liang suddenly steered them toward a featureless expanse of wall, through a door that slid open at their approach and into darkness. Lights came up to disclose a narrow passageway. They were, Asia realized, behind the walls of their world, in one of the service spaces where the children were never allowed to go.\nWithout a word Liang strode ahead, beneath overhead lights that swung slowly to the left and out of sight, following the curvature of the Pod. Abruptly, she stopped before a small hatch set in the wall to their right. It required both her touch and some spoken words before it swung open, and she had to step up to enter the space beyond. She disappeared without a glance at Asia, who hesitated before realizing that she was expected to follow. Nimbly (she had grown up in full gravity), she hopped up and climbed into darkness.\nThere was a light somewhere ahead but none around them, and it was by touch rather than sight that she realized that the rough walls were of rock. She was in a tunnel, but walking in its near darkness Asia imagined she was venturing through a cave. The thought was not pleasant: Pholus and Creusa, Philoctetes and Odysseus’ crewmen had variously come to grief in such spaces.\nLiang strode forward confidently, compelling Asia to hasten after her, only slightly reassured by the flat ground beneath their feet. The light before them grew until it resolved into the outline of a narrow door. Asia hung back as Liang stood framed by the glowing edges, waiting for whatever command she had given to be followed.\nAfter several seconds the door slid open. Stars burst in upon them.\nLiang stepped forward, not upon a walkway but into seemingly empty space. The stars about her were moving, wheeling in slow formation like the earthly firmament. There was nothing for Asia to do but follow, though she quailed at stepping onto nothingness. After two cautious steps, however, she could see a glimmer of refraction about them, reassurance that they were not standing naked to the void but inside a transparent walkway.\nSomething moved beneath her feet, and she guessed it an instant before it rose before her: Neptune, enormous in its looming proximity, a vast sphere of white-streaked blue. Almost filling the sky, it ascended, passed before them, and then rose above her head and was lost from sight, replaced by the panoply of stars.\n“The Crystal Bridge, as they call it, swings all the way round to Castor, a great half circle arching over the heavens. So great a span you can scarcely sense its curvature in traversing its length. Soon it will be opened to foot traffic, that our people may venture beyond the confines of the Centaur, to gaze upon the world we have traveled so far to reach.\n“Don’t be frightened. We are within Neptune’s magnetosphere, so can venture beyond the shielding of our ship. The habitats surrounding the Earth, Mars, and the Moon enjoy no such protection, which is why their population must undergo lifelong treatments and eventual health problems. It’s that, or live beneath the lunar surface, or—” and here she laughed—“on Earth.”\n“Why are you showing me this?” Asia whispered.\n“It’s beautiful, isn’t it? That’s a reason right there. And somewhere down there, or in the space around us, is where you will be living your life.\n“But most important: This is real, not mediated. The cloud tops’ brilliant azure? No image: the light waves striking your eyes were produced by the Sun, hours ago, and have reflected off methane molecules that absorbed the other wavelengths.”\nLiang smiled. “After your friend toyed with your perceptions—and, I am afraid, your emotions—you should be allowed to enjoy an unsimulated vista.\n“We should go back—it’s getting cold, isn’t it? I can feel the air molecules slowing!”\nAnd Asia could see a diffuse plume of vapor appear with Liang’s words. She stared at the tiny cloud, which swirled and vanished. Slowly—it grew warmer as they retraced their steps, so Liang did not hurry—they returned to the cave and through the space behind the walls to a small concourse, sparsely populated at this time of day. Nobody glanced at them as Liang turned to smile at Asia.\n“Our journey out was one of the great voyages of human history, a tale you will relate to your children, and they theirs. But our ship was a pocket universe, isolated from the rest of humanity as it rose, like a soap bubble, through the air. And we inside the soap bubble could not really see beyond it, only its shimmering inner surface, distorted by its shape.\n“And so we gazed at shimmering images, or turned our gaze upon ourselves. And those who grew up within this bubble know the worlds beyond our confines through a different episteme—I bet you know that word—than those who grew up otherwise. That way of knowing, of living, will soon change for you—” and here she smiled—“rather abruptly, and forever.”\nIt’s more complicated than that, said a voice in Asia’s head.\n“I hope you don’t find this alarming. Much of it, after all, is not really news to you.” Liang reached out and tousled Asia’s hair. “Better get home,” she said. “Your family is waiting for you.” She raised her arm, still smiling, and a tendril swung down to grasp it and sweep her away.\nFor a long moment Asia simply stood there, oblivious to the passersby stepping around her. A query from home pinged on her wrist, and she absently responded with a touch. Her page offered to show her messages from friends, but she waved it away.\nA god had spoken to her, was showing her favor, which could not be good. It was a thought too great to ponder, a shadow that, sweeping over everything, offered no hint to its form.\nInstead she thought about the fields of Arcadia, where nymphs inhabited the rivers, springs, and trees, and satyrs cavorted, piping or perhaps lurking behind trees, any one of which might house (or somehow be) an oreiad or hamadryad. Through this land the centaurs had fled south, pitiable monsters whom the minor deities must have regarded with feelings beyond conjecture. A nymph could be molested by a human or a god, and sometimes only escape into sylvan form, but the brutish attentions of a centaur, assuming one managed to attract it, would trouble them no more than the attempted ruttings of a wild boar.\nSlowly Asia began to cry. Their tiny world and home would be transformed, but its young would not live there; they would be expelled, driven forth to dwell in stony lands or forge, like Hephaistos, their own homes.\nShow us the way to bitter exile,\nFar from this mountain;\nTo where ivy shaft nor dance nor drum reminds me . . .\nThe Centaur, now in safe harbor, might in time become Elysium, but Asia and her friends would be cast upon the broken coast of Neptune, to build and populate its colonies. Granted techne in lieu of their birthright, they would mine its moons and skim its atmosphere, artificers of others’ designs.\nWhy was she crying? She knew this; she had always known it.\nTreetops tossed their boughs as zephyrs blew sportively through them; footsteps hurried lightly through their shade, halting at the approach of heavier treads. Divinities and mortals alike knew such monsters as centaurs to be unnatural, yet withal they lived and died, unlike Talos and other mechanisms. But the Argo, an artifact, bore in its prow a timber from the forests of Dodona that could speak and give prophecy.\nAnd so the vessel upon which Asia will in time sail forth shall bear some numen of the world it leaves behind. It is a cold comfort, but she tries to grasp it, having no other. Thus, she thinks (and something within her nods), shall the Centaur’s children be launched upon the seas of space, to become builders and citizens of floating cities, cloud-borne.\nGregory Feeley writes science fiction and about science fiction. His first novel, The Oxygen Barons, was nominated for the Philip K. Dick Award and. His stories have been finalists for the Nebula Award and his essays and reviews have appeared in a variety of publications, including The Atlantic Monthly, the New York Times Magazine, the Washington Post Book World, and USA Today. Feeley's most recent novel is Kentauros and he recently completed a long novel, Hamlet the Magician. His previous Clarkesworld story, \"Cloud-Born\" will be reprinted in two \"year's best\" anthologies this year.", "source": "https://clarkesworldmagazine.com/feeley_11_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Cloud-Born by Gregory Feeley"}