{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Daniel Abraham", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "s8AoWMMZD5kWvtdb1HO2Wvv9s+4=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Another Word: Literatures of Despair  When I grew up, I knew what a fantasy novel was. I had my examples right there close to hand: Terry Brooks, David Eddings, Barbara Hambly, Louise Cooper, Lloyd Alexander. They were the stories deep within other worlds, where there were elves and dwarfs, or something like them. There was magic. There was a dark power rising, and the heroes stood against it and after several books, the safe money said they’d win. They were the legacy born of The Lord of the Rings and the Chronicles of Narnia.  I hadn’t heard of George Macdonald at that point, and Thomas Mallory was basically unreadable for me, so as far as I knew the Inklings had laid the path and everyone after that was just walking down it.  Now that I’m two (or three) decades older, the water’s a little muddier. Jo Walton’s, Tooth and Claw is a tale of dragons, romance and social etiquette where the great evils are the class system of dragons and a suitor who is entirely too forward. Guy Gavriel Kay’s fantasies owe immensely more to history than to Tolkien. Miéville’s Perdido Street Station takes place in a fantasy world with magic and fantastic beings without appearing to have a single literary chromosome in common with The Belgariad.  The genre I knew as a kid is broader now, with projects that are exploring the implications of epic fantasy’s toolbox in ways I hadn’t begun to imagine when I started reading the stuff.  And among these new, strange monsters, far and away the most commercially successful is known best by its epithet: Grimdark.  The term actually comes from Warhammer 40,000, a tabletop battle simulation game whose tagline is “In the grim darkness of the far future, there is only war.” It can be applied to books where the traditional fantasy arc is retold in a way that is darker, more violent, and less cathartic. For instance, consider culturally iconic fantasy series in which the noble hero is slaughtered at the end of the first season. Grimdark projects can also replace traditional genre pieces with stories that focus on unredeemed and unredeemable characters in similar traditional fantasy or science fiction settings.  Infusing fantasy with a sense of unredeemable despair isn’t exactly a new thing. Stephen R. Donaldson was on the bestseller lists with The Chronicles of Thomas Covenant back when I was in my David Eddings days. The most recent surge in popularity for these projects includes Joe Abercrombie, Richard Morgan, and the defining name in contemporary fantasy, George R.R. Martin.  The adjective “gritty” comes into it a lot too. These authors have fantasy worlds that include crude language, sexual violence, profound moral ambiguity, and in which there is very little chance—if any—that the hero is actually a good person, much less that they will overcome the forces of darkness as a champion of light. Sometimes it’s described and defended as being more realistic than the standard, the argument being that the real world is made up of moral ambiguities and justice is something we have to create, not a natural order that we can discover. I don’t really want to go into that here, apart from saying that:  \r\n  I disagree with that analysis.  Any serious-minded critic would disagree with that too because I am so clearly right. Right?  I do want to say that grimdark fantasy does speak to something the more joyful, uplifting, not-as-grim-as-a-hospice-nurse’s-bad-day, that regularly-defined fantasy doesn’t. And I think you can get a hint of what that difference is by looking at grimdark’s closest analog: noir.  I thought of noir as being a variety of hardboiled detective stories until about eight months ago when I read the fairly brilliant Otto Penzler’s foreword to The Best American Noir of the Century. He made the argument that hardboiled mystery and noir look similar because of the setting, but are engaged in very different projects. They share a world that is grimy, violent and corrupt. The difference comes in the relationship of the protagonist to that world. The hardboiled detective is, to borrow a phrase with certain religious connotations, in the world, but not of it. In The Maltese Falcon, Sam Spade appears to be as lacking in moral boundaries as any of the other characters until the end, but when the time comes to look away from the murder of his partner or turn the woman he loves in to the authorities, he takes an explicitly moral path. “The chances are you’ll get off with life. That means if you’re a good girl, you’ll be out in 20 years. I’ll be waiting for you. If they hang you, I’ll always remember you.”  Noir protagonists, on the other hand, are very much a piece of the fallen world they live in. The corrupt nature of the world is also the corrupt nature of the character. They are either unable to overcome their greed, lust, and violence, or are unwilling to even try. They usually end badly, but even when they appear to succeed—as in Highsmith’s The Talented Mr. Ripley—they end unredeemed. Redemption is, in fact, impossible. Noir is, as Penztler points out, essentially pessimistic. It assumes and asserts that human nature is mean, petty, cruel, and incapable of any meaningful transcendence.  Walter Jon Williams once gave me his breakdown of speculative fiction genres. It went something like this:  In fantasy, the world is essentially benign; in science fiction, the world is essentially amoral; in horror, the world is malefic. Put in terms of illness, fantasy evil is an illness from which the world must recover. In science fiction, evil is a social construct put on a universe that simply is the way it is. In horror, evil is the natural deformity of the world from which there is no way to recover. Noir—and I suspect grimdark fantasy—get its power from the same source as horror. They are expressions of pessimism about the nature of the world. Noir, I think, goes farther than horror. To misquote Walter Sobchak, say what you will about the morality that informs Freddy Krueger’s and Jason Voorhees’ selective slaughter of sexually active teenagers, at least it’s an ethos. “Forget it Jake. It’s Chinatown.” actively turns away from the hope of any moral compass.  So where does grimdark fall in that spectrum? Is it Tolkienesque horror? Is it existential despair with a cloak and a magic sword? Or is it something more its own?  It varies according to the individual project, of course, but at the risk of over-generalizing; I’ll put my flag on an opinion. I think grimdark is now and has—at least since the time of Thomas Covenant—been a rejection of heroism’s ability to save the world. The modern template of fantasy ends with the decent, gentle, bourgeois Frodo Baggins being saved in the end by an act of mercy he’d made when there was no reason to think it would do him any good. The book that—for me—embodies the purest grimdark response is Abercrombie’s thoroughly brilliant The Heroes, in which the final moments (and spoilers here, so turn away if you don’t want to know) affirm that the violence will not only continue, but that the heroic men and women who are dedicated to it will never escape it except through death.  Honestly, until I read The Heroes, I didn’t have much use for the grimdark projects, and now that I have, I feel like I’ve seen this expressed as clearly, powerfully, and beautifully as anyone ever will, and I don’t have to read another one pretty much ever. I can respect it, understand it, appreciate it, but I have a hard time enjoying it. Not long ago, Thea of Booksmugglers summed up the recent noir bestseller Gone Girl with this: “It is a brilliantly written book, but I hated reading it.” Like that.  Except.  There is a small voice in the back of my head. It doesn’t come from the happier places, and it doesn’t speak loud. And it points out that grimdark, like noir, is a literature of despair. And maybe the one thing worse than indulging in other people’s despair is despairing alone and in isolation.  So there is that. Daniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest.", "text": "Non-Fiction\nAnother Word: Literatures of Despair\nWhen I grew up, I knew what a fantasy novel was. I had my examples right there close to hand: Terry Brooks, David Eddings, Barbara Hambly, Louise Cooper, Lloyd Alexander. They were the stories deep within other worlds, where there were elves and dwarfs, or something like them. There was magic. There was a dark power rising, and the heroes stood against it and after several books, the safe money said they’d win. They were the legacy born of The Lord of the Rings and the Chronicles of Narnia.\nI hadn’t heard of George Macdonald at that point, and Thomas Mallory was basically unreadable for me, so as far as I knew the Inklings had laid the path and everyone after that was just walking down it.\nNow that I’m two (or three) decades older, the water’s a little muddier. Jo Walton’s, Tooth and Claw is a tale of dragons, romance and social etiquette where the great evils are the class system of dragons and a suitor who is entirely too forward. Guy Gavriel Kay’s fantasies owe immensely more to history than to Tolkien. Miéville’s Perdido Street Station takes place in a fantasy world with magic and fantastic beings without appearing to have a single literary chromosome in common with The Belgariad.\nThe genre I knew as a kid is broader now, with projects that are exploring the implications of epic fantasy’s toolbox in ways I hadn’t begun to imagine when I started reading the stuff.\nAnd among these new, strange monsters, far and away the most commercially successful is known best by its epithet: Grimdark.\nThe term actually comes from Warhammer 40,000, a tabletop battle simulation game whose tagline is “In the grim darkness of the far future, there is only war.” It can be applied to books where the traditional fantasy arc is retold in a way that is darker, more violent, and less cathartic. For instance, consider culturally iconic fantasy series in which the noble hero is slaughtered at the end of the first season. Grimdark projects can also replace traditional genre pieces with stories that focus on unredeemed and unredeemable characters in similar traditional fantasy or science fiction settings.\nInfusing fantasy with a sense of unredeemable despair isn’t exactly a new thing. Stephen R. Donaldson was on the bestseller lists with The Chronicles of Thomas Covenant back when I was in my David Eddings days. The most recent surge in popularity for these projects includes Joe Abercrombie, Richard Morgan, and the defining name in contemporary fantasy, George R.R. Martin.\nThe adjective “gritty” comes into it a lot too. These authors have fantasy worlds that include crude language, sexual violence, profound moral ambiguity, and in which there is very little chance—if any—that the hero is actually a good person, much less that they will overcome the forces of darkness as a champion of light. Sometimes it’s described and defended as being more realistic than the standard, the argument being that the real world is made up of moral ambiguities and justice is something we have to create, not a natural order that we can discover. I don’t really want to go into that here, apart from saying that:\n- I disagree with that analysis.\n- Any serious-minded critic would disagree with that too because I am so clearly right. Right?\nI do want to say that grimdark fantasy does speak to something the more joyful, uplifting, not-as-grim-as-a-hospice-nurse’s-bad-day, that regularly-defined fantasy doesn’t. And I think you can get a hint of what that difference is by looking at grimdark’s closest analog: noir.\nI thought of noir as being a variety of hardboiled detective stories until about eight months ago when I read the fairly brilliant Otto Penzler’s foreword to The Best American Noir of the Century. He made the argument that hardboiled mystery and noir look similar because of the setting, but are engaged in very different projects. They share a world that is grimy, violent and corrupt. The difference comes in the relationship of the protagonist to that world. The hardboiled detective is, to borrow a phrase with certain religious connotations, in the world, but not of it. In The Maltese Falcon, Sam Spade appears to be as lacking in moral boundaries as any of the other characters until the end, but when the time comes to look away from the murder of his partner or turn the woman he loves in to the authorities, he takes an explicitly moral path. “The chances are you’ll get off with life. That means if you’re a good girl, you’ll be out in 20 years. I’ll be waiting for you. If they hang you, I’ll always remember you.”\nNoir protagonists, on the other hand, are very much a piece of the fallen world they live in. The corrupt nature of the world is also the corrupt nature of the character. They are either unable to overcome their greed, lust, and violence, or are unwilling to even try. They usually end badly, but even when they appear to succeed—as in Highsmith’s The Talented Mr. Ripley—they end unredeemed. Redemption is, in fact, impossible. Noir is, as Penztler points out, essentially pessimistic. It assumes and asserts that human nature is mean, petty, cruel, and incapable of any meaningful transcendence.\nWalter Jon Williams once gave me his breakdown of speculative fiction genres. It went something like this:\nIn fantasy, the world is essentially benign; in science fiction, the world is essentially amoral; in horror, the world is malefic. Put in terms of illness, fantasy evil is an illness from which the world must recover. In science fiction, evil is a social construct put on a universe that simply is the way it is. In horror, evil is the natural deformity of the world from which there is no way to recover. Noir—and I suspect grimdark fantasy—get its power from the same source as horror. They are expressions of pessimism about the nature of the world. Noir, I think, goes farther than horror. To misquote Walter Sobchak, say what you will about the morality that informs Freddy Krueger’s and Jason Voorhees’ selective slaughter of sexually active teenagers, at least it’s an ethos. “Forget it Jake. It’s Chinatown.” actively turns away from the hope of any moral compass.\nSo where does grimdark fall in that spectrum? Is it Tolkienesque horror? Is it existential despair with a cloak and a magic sword? Or is it something more its own?\nIt varies according to the individual project, of course, but at the risk of over-generalizing; I’ll put my flag on an opinion. I think grimdark is now and has—at least since the time of Thomas Covenant—been a rejection of heroism’s ability to save the world. The modern template of fantasy ends with the decent, gentle, bourgeois Frodo Baggins being saved in the end by an act of mercy he’d made when there was no reason to think it would do him any good. The book that—for me—embodies the purest grimdark response is Abercrombie’s thoroughly brilliant The Heroes, in which the final moments (and spoilers here, so turn away if you don’t want to know) affirm that the violence will not only continue, but that the heroic men and women who are dedicated to it will never escape it except through death.\nHonestly, until I read The Heroes, I didn’t have much use for the grimdark projects, and now that I have, I feel like I’ve seen this expressed as clearly, powerfully, and beautifully as anyone ever will, and I don’t have to read another one pretty much ever. I can respect it, understand it, appreciate it, but I have a hard time enjoying it. Not long ago, Thea of Booksmugglers summed up the recent noir bestseller Gone Girl with this: “It is a brilliantly written book, but I hated reading it.” Like that.\nExcept.\nThere is a small voice in the back of my head. It doesn’t come from the happier places, and it doesn’t speak loud. And it points out that grimdark, like noir, is a literature of despair. And maybe the one thing worse than indulging in other people’s despair is despairing alone and in isolation.\nSo there is that.\nDaniel Abraham is a writer of genre fiction with a dozen books in print and over thirty published short stories. His work has been nominated for the Nebula, World Fantasy, and Hugo Awards and has been awarded the International Horror Guild Award. He also writes as MLN Hanover and (with Ty Franck) as James S. A. Corey. He lives in the American Southwest.", "source": "https://clarkesworldmagazine.com/another_word_04_13/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Another Word: Literatures of Despair by Daniel Abraham"}