{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Neil Clarke", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "KsBcApMeR5DuKytl6Qn2BybrU0Y=", "id": null, "license": null, "comments": "", "raw_text": "Editorial  Editor's Desk: 2018 Reader's Poll  It’s almost time to pick your favorite Clarkesworld story and cover art from 2018 in our annual reader’s poll! Last year, we switched to a two-stage voting system—more like a traditional two-round genre award—and we intend to use the same model again this year.  Phase 1: Nominations (mid-January)  Later this month, we’ll open for a forty-eight hour flash nomination period to identify the top five candidates in each category: story and art. The announcement for this phase will be sent out via:  \r\n   Twitter (twitter.com/clarkesworld)  Facebook (www.facebook.com/clarkesworld)  Patreon (www.patreon.com/clarkesworld)  My blog (neil-clarke.com)  The purpose of the brevity of this phase is to create a sense of urgency and reduce the opportunities for a coordinated ballot-stuffing campaign. Last year’s poll proved it to be effective at meeting these goals.  Phase 2: Final Voting (February)  The five finalists in each category will be announced in my February editorial. Final voting will open on the 1st and continue through the 15th. The winners will be announced in our March issue.  In advance of the nomination phase, here’s a list of all the eligible stories from 2018:  \r\n  “A World to Die For” by Tobias S. Buckell (January)  “Say it Low, then Loud” by Osahon Ize-Iyamu (January)  “Sour Milk Girls” by Erin Roberts (January)  “A Cigarette Burn In Your Memory” by Bo Balder (January)  “The Lighthouse Girl” by Baoshu (January)  “Deep Down in The Cloud” by Julie Novakova (February)  “Obliteration” by Robert Reed (February)  “Umbernight” by Carolyn Ives Gilman (February)  “The Power is Out” by A Que (February)  “Tool-Using Mimics” by Kij Johnson (March)  “The Persistence of Blood” by Juliette Wade (March)  “Unplaces: An Atlas of Non-existence” by Izzy Wasserstein (March)  “Farewell, Adam” by Xiu Xinyu (March)  “The No-One Girl and the Flower of the Farther Shore” by E. Lily Yu (March)  “Carouseling” by Rich Larson (April)  “Without Exile” by Eleanna Castroianni (April)  “Violets on the Tongue” by Nin Harris (April)  “Logistics” by A.J. Fitzwater (April)  “The Wings of Earth” by Jiang Bo (April)  “A Vastness” by Bo Balder (May)  “Not Now” by Chelsea Muzar (May)  “Fleeing Oslyge” by Sally Gwylan (May)  “Farewell, Doraemon” by A Que (May)  “A Space of One’s Own” by Steve Rasnic Tem (June)  “Vault” by D.A. Xiaolin Spires (June)  “The Cosmonaut’s Caretaker” by Dora Klindzic (June)  “Your Multicolored Life” by Xing He (June)  “Heron of Earth” by Vajra Chandrasekera (June)  “Gubbinal” by Lavie Tidhar (July)  “A Gaze of Faces” by Mike Buckley (July)  “The James Machine” by Kate Osias (July)  “For What are Delusions if Not Dreams?” by Osahon Ize-Iyamu (July)  “To Fly Like a Fallen Angel” by Qi Yue (July)  “The Veilonaut’s Dream” by Henry Szabranski (August)  “The Anchorite Wakes” by R.S.A. Garcia (August)  “Kingfisher” by Robert Reed (August)  “The Privilege of the Happy Ending” by Kij Johnson (August)  “The Loneliest Ward” by Hao Jingfang (August)  “A Study in Oils” by Kelly Robson (September)  “Waves of Influence” by D.A. Xiaolin Spires (September)  “Dandelion” by Elly Bangs (September)  “The Foodie Federation’s Dinosaur Farm” by Luo Longxiang (September)  “The Miracle Lambs of Minane” by Finbarr O’Reilly (October)  “Sparrow” by Yilin Wang (October)  “When We Were Starless” by Simone Heller (October)  “The Facecrafter” by Anna Wu (October)  “Thirty-Three Percent Joe” by Suzanne Palmer (October)  “Octo-Heist in Progress” by Rich Larson (November)  “What the South Wind Whispers” by H. Pueyo (November)  “Ghost Island” by E.E. King (November)  “The Gift of Angels: an introduction” by Nina Allan (November)  “The Love Letters” by Peng Simeng (November)  “Marshmallows” by D.A. Xiaolin Spires (December)  “Bringing Down the Sky” by Alan Bao (December)  “When We Find Our Voices” by Eleanna Castroianni (December)  “Master Zhao: The Tale of an Ordinary Time Traveler” by Zhang Ran (December)  Thank you and Happy New Year! Neil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "text": "Editorial\nEditor's Desk: 2018 Reader's Poll\nIt’s almost time to pick your favorite Clarkesworld story and cover art from 2018 in our annual reader’s poll! Last year, we switched to a two-stage voting system—more like a traditional two-round genre award—and we intend to use the same model again this year.\nPhase 1: Nominations (mid-January)\nLater this month, we’ll open for a forty-eight hour flash nomination period to identify the top five candidates in each category: story and art. The announcement for this phase will be sent out via:\n- Twitter (twitter.com/clarkesworld)\n- Facebook (www.facebook.com/clarkesworld)\n- Patreon (www.patreon.com/clarkesworld)\n- My blog (neil-clarke.com)\nThe purpose of the brevity of this phase is to create a sense of urgency and reduce the opportunities for a coordinated ballot-stuffing campaign. Last year’s poll proved it to be effective at meeting these goals.\nPhase 2: Final Voting (February)\nThe five finalists in each category will be announced in my February editorial. Final voting will open on the 1st and continue through the 15th. The winners will be announced in our March issue.\nIn advance of the nomination phase, here’s a list of all the eligible stories from 2018:\n- “A World to Die For” by Tobias S. Buckell (January)\n- “Say it Low, then Loud” by Osahon Ize-Iyamu (January)\n- “Sour Milk Girls” by Erin Roberts (January)\n- “A Cigarette Burn In Your Memory” by Bo Balder (January)\n- “The Lighthouse Girl” by Baoshu (January)\n- “Deep Down in The Cloud” by Julie Novakova (February)\n- “Obliteration” by Robert Reed (February)\n- “Umbernight” by Carolyn Ives Gilman (February)\n- “The Power is Out” by A Que (February)\n- “Tool-Using Mimics” by Kij Johnson (March)\n- “The Persistence of Blood” by Juliette Wade (March)\n- “Unplaces: An Atlas of Non-existence” by Izzy Wasserstein (March)\n- “Farewell, Adam” by Xiu Xinyu (March)\n- “The No-One Girl and the Flower of the Farther Shore” by E. Lily Yu (March)\n- “Carouseling” by Rich Larson (April)\n- “Without Exile” by Eleanna Castroianni (April)\n- “Violets on the Tongue” by Nin Harris (April)\n- “Logistics” by A.J. Fitzwater (April)\n- “The Wings of Earth” by Jiang Bo (April)\n- “A Vastness” by Bo Balder (May)\n- “Not Now” by Chelsea Muzar (May)\n- “Fleeing Oslyge” by Sally Gwylan (May)\n- “Farewell, Doraemon” by A Que (May)\n- “A Space of One’s Own” by Steve Rasnic Tem (June)\n- “Vault” by D.A. Xiaolin Spires (June)\n- “The Cosmonaut’s Caretaker” by Dora Klindzic (June)\n- “Your Multicolored Life” by Xing He (June)\n- “Heron of Earth” by Vajra Chandrasekera (June)\n- “Gubbinal” by Lavie Tidhar (July)\n- “A Gaze of Faces” by Mike Buckley (July)\n- “The James Machine” by Kate Osias (July)\n- “For What are Delusions if Not Dreams?” by Osahon Ize-Iyamu (July)\n- “To Fly Like a Fallen Angel” by Qi Yue (July)\n- “The Veilonaut’s Dream” by Henry Szabranski (August)\n- “The Anchorite Wakes” by R.S.A. Garcia (August)\n- “Kingfisher” by Robert Reed (August)\n- “The Privilege of the Happy Ending” by Kij Johnson (August)\n- “The Loneliest Ward” by Hao Jingfang (August)\n- “A Study in Oils” by Kelly Robson (September)\n- “Waves of Influence” by D.A. Xiaolin Spires (September)\n- “Dandelion” by Elly Bangs (September)\n- “The Foodie Federation’s Dinosaur Farm” by Luo Longxiang (September)\n- “The Miracle Lambs of Minane” by Finbarr O’Reilly (October)\n- “Sparrow” by Yilin Wang (October)\n- “When We Were Starless” by Simone Heller (October)\n- “The Facecrafter” by Anna Wu (October)\n- “Thirty-Three Percent Joe” by Suzanne Palmer (October)\n- “Octo-Heist in Progress” by Rich Larson (November)\n- “What the South Wind Whispers” by H. Pueyo (November)\n- “Ghost Island” by E.E. King (November)\n- “The Gift of Angels: an introduction” by Nina Allan (November)\n- “The Love Letters” by Peng Simeng (November)\n- “Marshmallows” by D.A. Xiaolin Spires (December)\n- “Bringing Down the Sky” by Alan Bao (December)\n- “When We Find Our Voices” by Eleanna Castroianni (December)\n- “Master Zhao: The Tale of an Ordinary Time Traveler” by Zhang Ran (December)\nThank you and Happy New Year!\nNeil Clarke is the editor of Clarkesworld Magazine and Forever Magazine; owner of Wyrm Publishing; and a ten-time Hugo Award Nominee for Best Editor (short form). His anthologies include Upgraded, Galactic Empires, More Human Than Human, Touchable Unreality, The Final Frontier, Not One of Us, The Eagle has Landed, and the Best Science Fiction of the Years series. His latest anthology, The Best Science Fiction of the Year: Volume 6, is now available from Night Shade Books. He currently lives in NJ with his wife and two sons.", "source": "https://clarkesworldmagazine.com/clarke_01_19/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Editor's Desk: 2018 Reader's Poll by Neil Clarke"}