{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Thoraiya Dyer", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "++M+2YuuVIycIfW6FiYV87BbjRA=", "id": null, "license": null, "comments": "", "raw_text": "6800 words, short story  Doc Luckless and the Stationmistress  A plague flag flutters from the houseboat’s prow as it half-motors, half-drifts toward the dark side of the lake.  Harald hastily pokes the last of his jellyfish breakfast into his mouth, chopsticks trembling.  Always trepidation, first, followed by a deep sense of failure if things don’t go to plan. If he can actually help the patient, he feels relief.  Never happiness or satisfaction.  Only relief.  It wasn’t always like this.  Harald watches the gap close between the houseboat and his trawler. Glassy reflections of gray sky with slivers of deep green soon turn to a rippled chessboard. It’s as if the two metal hulls race to exchange secret information in advance of any human meeting. On a higher tech planet, they might.  They call him Doc Luckless, but they still come to him, because he’s the only registered doctor on Lake Endless. Artificial medics were banned from Gaviota when the Angries took over, and the sabotaged red rattler at the Station, that portal to other worlds, has been a one-way trip for the past seventeen years.  No way in.  One way out.  Two, if you count dying.  Things are worse than they were, but not so bad that Harald’s been tempted to pay the fare for the Stationmistress to dispatch him via the rattler. Escape Option A. Lake Endless is his home. He would prefer to eventually depart via Escape Option B, in a few decades time, may the whales relish his bones.  A bit of blue jelly sticks in Harald’s teeth.  The houseboat reduces speed. The plague flag droops. Four covered guns are bolted to the railings, with four extra-large life jackets fixed beside them. Yet, when Harald ties a pumice buoy to the second line extending under the lake surface to his southernmost mooring and tosses it toward the sluggish arrival, it’s a skinny, stumbling woman with one lock of white hair who emerges from the cabin to hook the buoy and secure the boat. She does this with her right hand. A staring, bowlegged seven year old dangles from her left hand.  Not trauma, then.  No more than all of them are traumatized by life, anyway.  “You’re deficient,” Doc Luckless tells Guro, the mother, “in Vitamin D. You and Etty both. On Earth, fish are a suitable supplement, but here, neither Gaviotan whales, nor the lakeweed they graze on, can help with this.”  The three sit around his scarred turpentine table, sharing a meal provided by Harald.  Etty turns out to be twelve, not seven. Easy mistake to make, on the Lake.  Guro holds up the glistening strings of shredded blue jellyfish and frowns at them.  “But I thought—”  Etty interrupts with the rhyme.  “Jelly glows blue, good for you! Jelly glows green, petrol for machine!”  “Yes, Etty,” Harald says, “that’s still true. Blue jellies have all the nutrition a human body needs. But when we eat only jellies, we also need sunlight.”  Two dirty blonde heads turn to peer through the porthole at the sunlit side, the northern side, of Lake Endless, and Harald can’t help but mimic them. Even as they rest at anchor, the lapping flow of the lake water tugs the houseboat and the trawler on their rusted chains further south, deeper into the shadow of the sheer, gray spikes of the seven-pointed crown.  “Can I see your emergency flares?” Etty asks. Her face turns dreamy. “I won’t shoot them. They’re very colorful. Like angels come to life. Like if stars came to visit.”  In the distant sunlight, the surface glitters.  “Angries are over there,” Guro mutters, lowering her chopsticks.  Angries in their solar-powered speedboats, smashing tech that isn’t theirs, stealing children for their scripture-based schools. Harald gets a pass on the sunny side because he’s the doc. Even Angries need surgery sometimes. Plus, he’s got no children for them to steal.  “Did they kill Etty’s father?” Harald asks.  “Worse,” Guro says. “He’s one of them.”  When they’ve gone, Harald pulls on a buoyancy wet suit and floats beside his ship on Lake Endless, as passive as the trawler and its wind-powered mechanical catcher and sorter.  It strains the jellies from the lake, spinning the heavier green jellies directly into the fuel tank of the engine. The blue jellies go to the larder.  Through the water and the suit material, the sorter sounds like whales swallowing and excreting.  Calm and slow.  Not like gasping scorpion people dying of acidemia. Not like the howling of wind through bone-dry clay houses.  Harald sighs deeply, rising with the inflation of his lungs and then sinking like a melting iceberg with the exhalation.  To be a jelly would be to have no thought for past or future.  But also, to be helpless in the face of wind and flowing water.  After sunset, Harald falls asleep to the recorded sounds of Earth whale song. Unlike Gaviotan whales, who learned to sing human songs back to the new arrivals, Earth whales never gave a shit what songs their humans sang. They sang to one another, until the genetically engineered jellies that were supposed to save the planet from plastic pollution took over the oceans instead.  Earth whales are all dead.  But Harald’s lived on Lake Endless for long enough that the local whales have started to mimic the recordings. Three years ago, when the twin supernovas were visible in the night sky like a pair of pink eyes, was when he first heard the Gaviotan beasts joining in.  They serenade his sound player as if Harald was singing to them, himself, even as his eyelids slide closed.  Harald’s eyelids slide open.  Everything’s white and cloudy, until his third eyelid slides across, and a chitinous face with burnished bronze cheekplates and double-articulated mandibles flickers into clarity.  “Grandmother,” whispers the face.  Harald feels his own confusion, but also, somehow, disappointment cut by a quiet thrill, because he’s Palma, grandmother of Gupalma—which means descendent-of-Palma in Akranian—and although she seems to be awake again, which means she hasn’t died, Palma is going to die soon, and depart Akranes for heaven, which is exciting.  In heaven, water droplets float around in the air.  There’s nothing to lift, in heaven. No need for augmented scorpion claws designed for off-world hard labor.  Even Palma’s body will be weightless.  “Hello, Gupalma,” Palma says, her mandibles stiffened with dust, like the jamb of a sandstorm-scoured, centuries-old front door, so that every spoken word is painful. “Help me up. There’s work to do.”  For thirty years, Palma has maintained the town’s underground water supply. There, blue jellies are used to clean the water of organic pollutants, but not eaten, as they are incompatible with scorpion biology.  “The artificial doctor ordered you to rest, Grandmother,” Gupalma answers earnestly.  “That brain-in-a-box! What does it know?”  Heat and hurt, like lightning, lance through Palma’s spine and claws—internal and external skeleton—as she curls up to sitting, but she welcomes it. Every crack of pain is a drumbeat welcoming her to the next life.  “You’ll work yourself to death, Grandmother!” Gupalma cries.  Yes, dear, Harald/Palma thinks. That’s the whole idea.  Underground, the blue jellies fluoresce majestically in the stone cisterns. Palma stirs them with great paddles, churning oxygen into the subterranean sea.  When it’s time to go back up the black steps to the city, Palma’s legs seize. She stumbles into the stairwell, instead, her bent back against stone, wheezing the welcome, damp air.  I will just rest here for a moment.  Her third eyelid clouds the caverns, an eclipse that precedes the proper closing of her eyes.  Harald’s eyes shoot wide open.  He rolls out of his low bunk and curses thickly when his face hits the floor.  That great sail of a nose! his now-dead, small-nosed father who taught him how to sail the sulfuric acid sea on Haey had laughed.  Harald tends his bloody nose on autopilot as his mind tries to make sense of the dream.  I was on Akranes.  A planet he’s never actually visited, but easily able to recognize from the films.  His waking nightmares are bad enough. He doesn’t need to walk among scorpions in his sleep as well. But this was so oddly specific.  Did I ever treat a patient called Palma? With a granddaughter called Gupalma?  Shaking it off, he moves the trawler to a ripple of water against a horseshoe-shaped rock, on the sinuous line between light and dark, where message bottles thrown in on the sunny side of Lake Endless accumulate.  Haey is the place. Not Akranes. Haey is the planet where I failed them. Why not have nightmares about Haey?  A green bottle rests wetly against the rock. Precious glass. The Stationmistress doesn’t even need to write a message on a torn corner of a book page to summon Doc Luckless.  Only the Angries still have unbound paper, anyway.  Harald lifts the bottle by its slender neck out of his scoop net, letting the slightly salty water drip.  Letting it slide away, like the lubrication of tears against lids.  “Got something in my eye,” the Stationmistress says.  “When?”  “Few days ago, now. That really windy afternoon.”  Harald holds her eye open with a hairy-knuckled hand. His sun-ravaged skin is the color of corned beef from his decades on Haey. Meanwhile, the Stationmistress, Deen, delicate, her skin blue-black, wears a long white glove on her left arm that covers her from fingertips to heart. Her eye is inflamed, with conjunctivitis and aqueous flare.  But he’s distracted by the dream. He’s remembering his life on Haey, where computers were the best doctors, and every diagnosis he made was wrong or incomplete. But the scorpion people who labored at the Station preferred him, because he was kind.  Fake Doc can’t tell me to get well soon and mean it!  Then one day a traveler brought a virus, and when Harald recognized the symptoms, he felt that comforting glow of certainty. He could fix this.  He could fix it with an IV infusion that had as a side effect a temporary metabolic acidosis. In humans, compensatory respiratory alkalosis could have kept the patient’s blood pH in a range compatible with survival. Unfortunately, gas exchange in scorpion people was less efficient and the laborers all died of acidemia. He should have known.  An artificial computer would have known.  First, do no harm.  To escape the shame, Doc Luckless fled to Gaviota.  His birth body had been consumed by the heat of observation in the red rattler at Haey Ninth Colony Station. Roughly three years later, his particles, right down to his thought processes, had been reconstructed in the rattler kept by Gardenia Breeze in the heat-shielded heart of her floating Station on Lake Endless.  So long ago.  Harald arrived a full ten years before Deen sent her daughter, Nunuz, through to Eye Station, on Kvivik, the water world, to train as a Stationmistress herself.  Thirteen years before Angries sabotaged the Gaviotan rattler from the other side, so that Nunuz could never—can never—come back.  Doc Luckless can’t even be sure the rattler’s element tanks have enough in them to print a whole person anymore. Angries stopped short of pillaging the tanks and setting fire to the floating Station. Something in their scriptures about portals to heaven. About the Stationmistress being an intermediary, some sort of ethereal guide.  “Ow,” rebukes the ethereal guide as Harald tests her intraocular pressure.  Something outside the Station makes a faint tick-tick-tick sound.  “Can’t see a foreign body,” Doc Luckless says quietly. “But there’s trauma to the eye. Bathe it in lake water, Deen. Six times a day. Stay inside. Protect it from light.”  They’d slept together, once. Seventeen years ago. She’d done it to stop him from crying. Faced with a bawling, fully grown man, instead of fetching water and asking about feelings, as Harald had been trained to do, Deen had peeled off all her clothes except for the glove and gripped him like an ultrasound probe with her other, bare hand, wielding his intimate organ with compassionate but clumsy determination.  He hadn’t stopped crying, not for good, but he’d been grateful to her.  Would always be grateful.  He’d gifted her the only book he’d brought with him, a copy of Sindre’s Exile, and she’d added it to her tiny library on the silky oak shelf with such a glow around the eyes that, although he sneaks the yellowed poems out to read sometimes, when she’s too busy maintaining the rattler to notice, he won’t allow her to give the pages back to him.  The poisoned air/ I cannot sing/ the mouth a still/ vestigial thing. I mocked a Lord of blood and waste/ He fed me to his sharks/ My body wasted by this throw/ through myriad of darks.  It was never payment. It was just doing what he could, in darkness, to show another person something bright.  The Stationmistress pays him now, for the medical consultation, with a coil of strong lakeweed rope and a single teaspoon of sugar-filtering lake sponge. They live in a world of brine. Sweetness is a gift. He’ll keep the sponge safe until the solstice.  Tick-tick-tick.  “The hell is that sound?” Deen demands.  They spill out onto the deck of the Station, at the closest point to where Doc Luckless tethered his trawler. Something has floated south. Something facedown and skinny, with one lock of white hair among streams of dirty blonde.  The ticking sound is Guro’s dead body, trying to get stuck in the inlet of his boat’s jelly scoop.  Her throat is cut.  Angries are over there, Guro had said, staring at the sunlit side.  And Doc Luckless had insisted that she go there.  “Nobody should ever listen to me,” he tells Deen.  “No crying,” Deen warns, her fierce grip on his arm. “Or you’ll have to endure my inept banging.” She hesitates. “Help me put her into the separator. I finally pissed enough nitrates to fuel it.” The Stationmistress’ grip falters. Her voice shakes. “One day, Guro’s elements may be reassembled, and help somebody else to live.”  Somebody. She means Nunuz.  She thinks Nunuz will one day repair the rattler from the Kvivikian side, and return to Gaviota from heaven, shining like an angel.  Like if stars came to visit, the child, Etty, had said.  “I’ll help you,” Doc Luckless says.  Can I see your emergency flares?  After Guro’s body is secure in the separator, Harald searches Lake Endless ’til nightfall. He burns every last drop of liquefied green jelly.  But there’s no sign of the houseboat or of Etty.  Harald/Palma’s eyes slide closed/open.  Mammalian lashes and scorpion third eyelid.  This continuing, uneventful scorpion-woman dream is irritatingly chronological/ This human man lurks inside my head now whenever I’m awake and lucid, they think briefly, before Gupalma bustles into the room, fresh sheets in her claws, and even though she turns Palma ever so gently, there is pain.  Pain behind Palma’s left eye.  Pain, crackling from the original spot along her spine and stabbing her guts, where the brain-in-a-box informed her the cancer has spread to her liver as well as her brain.  Cancer? Palma had retorted, cracking her claws. The killer crab? I am the killer crab.  But artificial doctors don’t get jokes.  Estimated survival time, it had said, for the resistant alpha variant of malignant scorpion sclerocytoma, is sixty-three days, with a standard deviation of fourteen days.  In heaven, nobody talks about standard deviations.  “Let me tuck you in,” Gupalma begs, but Palma is still rolling.  Off the bed. Into the dressing room.  “I have to tend the cistern,” Palma growls when her granddaughter catches her.  “No,” Gupalma says.  Palma bites her.  Right on the claw.  Right through the shell, into the soft, white exocuticle.  “Ouch!” Gupalma exclaims. “That was childish, Grandmother!”  But Palma is laughing, a dusty wheeze, remembering how Gupalma, as a hatchling, had bitten her grandmother when denied a closer look at the mesmerizing jellies, and the precious water they swam in, which must not be contaminated by skin-surface microorganisms, not even to please a child.  The zoo, Palma had cooed, I will take you there, little Gupalma. You can ride the Gaviotan whales. You can touch them, talk to them, and let them sing to you. But you must not touch the jellies.  Scorpion diseases can infect the jellies.  They’re alike, the jellies and scorpions.  Both made to serve their human masters but exploding out of control.  Doc Luckless wakes, only a few hours after falling asleep.  Earth whale music still mournfully vibrates his cabin, joined by a chorus of slightly less musical, more drain-like Gaviotan whales.  A pod of them lingers under the trawler.  They like to float only thirty meters or so below the hull, singing. Never trying to get the jellies out of his scoop or sorter. Never surfacing to see what he looks like. If not for the illustrations in Deen’s Atlas of Gaviotan Life, or the whale corpses he sometimes finds, Harald couldn’t have begun to guess at their alien, pied cone-shapes with thin streamers of iridescent flesh, like gymnasts trailing ribbons through the lake.  He can’t get back to sleep.  Not even after running through his breathing exercises several times.  It’s not just because he failed to help Guro.  It’s because Palma isn’t awake.  The thought is horrifying, if true. The scorpion-woman in his head is dying. If she’s real, she can expect her waking hours to shrink and continue shrinking.  If she isn’t real, it means Harald is losing his mind.  I can get back to sleep.  Stubbornly, he lies in his bunk, unsleeping, eyes closed, until just before dawn.  That’s when he hears weapon’s fire and screams. Easing himself out of his bunk, he moves to the deck in his long underwear and knitted nightshirt, squinting at the fine line of white starting to pencil across the surface on the distant bright side.  Above the line, craft silhouettes clash. More shots sound and hulls grind.  Below the line, soft glowing bodies blob about. Widely spaced. Green and blue.  Later in the day, pieces of a wrecked houseboat float past him, including a tattered plague flag.  That’s it. He’s failed Etty, too.  Two for two.  Forty-eight hours of worsening insomnia later, Harald finds that the Stationmistress’ traumatized eye has deteriorated.  “You won’t go through?” he asks her, for the hundredth time. “There are antibiotics on Kvivik.”  “No,” the Stationmistress answers. “I’ll leave when I’m dead, same as you, Doc.”  Now her cornea’s ulcerated, too. Deen needs antibiotics or she’ll lose half her sight, but the Angries won’t allow any medicine dispatches from orbit. With the broken Station only transporting things one way, Doc Luckless has no choice but to take some of Deen’s blood for making autologous serum drops to apply to the affected eye.  He carefully carries the clotted sample across the gangplank to his trawler. Sighing, he sets it in place. Switches on the jelly engine and starts up the centrifuge.  While it’s spinning and the serum is separating out, he makes two tiny, steaming cups of mangrove worm tea and takes them back to the floating Station.  “Fifteen minutes,” he tells the Stationmistress, who sips the tea, nods, and returns to cutting her hair.  First with wide-toothed comb, then narrow, then wickedly sharp steel scissors she snaps apart to sharpen on a stone every several snips; she cuts from habit, without a mirror, mixes her cut hair with clay from a wooden bucket, and right-handedly re-insulates the cracked sections of the rattler room.  Harald watches her with an aching heart. The ache is mostly affection for the familiar. The Station is the Mistress, and the Mistress is the Station. She will never stop trying to keep it running. As stubborn as Palma, and her Akranian cistern. Do not think about Palma. There is no Palma. But part of the ache is fear, because if the conjunctivitis and subsequent ulceration spread to her other eye, her days of scanning for cracks to fill are numbered.  He creeps away to the library.  Pulling Sindre’s Exile from the shelf, he sits in Deen’s comfortable chair and allows the book to fall open in his lap. Doc Luckless reads the words, even though he knows them by heart.  Inside my head/ Haey’s mournful song/ A song of nothing/ lasting long. A song of embers growing dim/ of atoms worlds apart/ of stardust sent beyond the whim/ of tyrant’s mind and heart.  It’s been so long since he slept.  Harald’s eyes slide closed.  Palma pictures herself as a tadpole, swimming up toward the black, blue-jelly-speckled surface of consciousness.  “Grandmother. I’ll help you sit up.”  Gupalma’s claw curls around Palma’s shoulders.  The wound on it hasn’t healed.  Bite wound, Palma thinks blearily. I bit her.  The laceration gapes. Thick yellow discharge fills the carapace crack. Angry, red soft-tissue lies beneath.  She’ll still have my/your mandible-marks in her, days after I’m/you’re dead, Palma/Harald thinks.  A third voice, soft as a jelly’s pulse, fluted as whale song, whispers: We don’t want to kill you. We can’t help it. We don’t mean to.  Outside the window, the paired pink blooms of some distant supernovae seem like angel eyes, watching over Palma.  Then pain drives all thoughts away.  He wakes up screaming.  “Doc,” the Stationmistress says, holding his face tight between her palms. “You’re safe.”  “I’m dying,” he gasps, and Deen’s eyes go wide before he can correct himself. “I’m not dying. It just feels like I am.”  She tries to kiss him on the mouth. Softening the clumsy instinct to push her back is difficult for Harald, still fuzzy from the nightmare, his arms leaden, but he manages to keep her from making contact without hurting her.  “Why do you try to fix me that way, Deen?”  “It’s what my husband did,” she breathes. Then she cringes with shame. “Only, he was good at it.”  “He was good at it,” Harald says, their faces still inches apart, “because he knew you.”  “You won’t let me know you. I should know you. You should know me. We’re the only constants on Endless. The only ones the Angries won’t eat or kill.”  In his mind’s eye, dead scorpion people erupt from the top of Harald’s head like a volcano that could smother the world.  “If you knew me,” he murmurs, “you’d wish you didn’t know.”  “I know you help people.”  “No.” He shudders. We can’t help it. We don’t mean to. Guro’s dirty blonde hair, in the water, with one white lock. “I don’t. I’m being punished. The dreams.”  Deen takes her hands away from his face and straightens beside the chair where he sprawls with the open book of poetry. Her hair is half cut. One bulging, bluish, bloodshot eye and one pink-tinged one confront him.  “What dreams?” she demands.  Harald tells her about the dreams.  “So,” she says slowly, “you can’t fall asleep again right now, even though you’re bone-weary, because an old scorpion woman on another planet isn’t awake? Is there a three-year delay on these dreams, as there should be between Akranes and Gaviota, if they’re traveling at light speed?”  “Please don’t make fun of me,” Harald says, scowling, but she isn’t smiling. “Maybe when the old woman dies, I’ll never get to sleep again.”  “Maybe when she dies,” Deen replies, arms folded, “your self-flagellation will be complete. Your punishment over.”  They both hear the speedboat engine at the same time, startling with shoulders hunched like nesting birds.  “Angries,” the Stationmistress says, grimacing.  She spins out the little doorway and away.  Harald replaces the book on the shelf, bends to avoid cracking his head, and lumbers after her.  The Lake’s worst pilot crashes a solar speedboat into the Station. Throws a rope that misses. Deen shrieks furiously. Harald only hooks the line from the water, pulling it tight so that Deen can scramble across and cut the speedboat’s motor.  She pulls a spitting Etty from behind the wheel.  “I’ll spank your bare backside, child,” Deen promises.  “Spank away, only send me quickly to the other world!” Etty hollers.  Harald gapes at the ray of hope. The walking rainbow.  I didn’t kill her, after all.  “You’re too little to go alone,” the Stationmistress says.  “Not too little to stab my dad with a jelly hook, eh? Not too little to steal a speedboat, eh? It’s worth a lot. You can keep it. It’s my payment for going through. Only hurry up.” Etty’s bluster exhausts itself quickly. She huffs out the last two words dejectedly. “Please, hurry.”  Harald follows them back inside the floating Station. The hard deck feels soft. He can almost see the ripples. It’s a miracle. He’s walking on water.  “You know I can’t keep it, child. You know your folks will be here for it, soon. They’ll be wanting to punish you. If I send you to Kvivik, they’ll be punishing me. You know what that punishment will be?”  “Send her,” Doc Luckless blurts.  Deen’s diseased eyes and Etty’s enormous ones turn on him together.  “Send her, and I’ll take the speedboat with me, to the dark side of the lake. When they come, I’ll tell them Etty died.” There’s no sunlight on Kvivik, either, but there are plenty of fish. Plenty of calcium in every discarded cartilaginous backbone on the pier. “I’ll pay you back. It will take a long time, a lot of green jellies, I know it’s ten tons per ignition to run, but I’ll pay. Please, Deen.”  Best of all, she’ll be away from here. Away from me. Real doctors will be there, to tend her. Artificial doctors.  The Stationmistress nods.  “Go now, then, Harald,” she says. “No goodbyes.”  He doesn’t need to feel the heat of observation, permeating the clay, to know she’ll do what she says.  Harald vomits his shredded jellyfish, sick with exhaustion.  This can’t go on.  He stares at the pile of pale, frothy retch. Losing fluid with every heave. He’ll be dehydrated soon. Mist fills the mountain bowl of the seven-pointed crown, making the smothered lake silent.  I need sleep.  Lying down by the gunwale, he lets the trawler rock him, one arm dangling. His fingers feel the slow southern direction of the flow and the relative warmth that means he’s drifted into more easterly shallows. Without opening his eyes, without needing a sense of light or dark, he knows where he is on the lake.  A blind woman could survive on this trawler.  Not so the floating Station, with its dangerously overpowered engine, touchscreen-operated active jelly straining apparatus, and open-flame manual water distillery. Harald has to find Deen in this mist. He has to make sure the serum drops have worked, and that her eyesight is saved.  But it isn’t. She will be just another failure in a long line of failures. I told her to get off this planet.  The water used to cool the red rattler, which the Stationmistress fired up only a day ago to send Etty to Kvivik, will still be leaving a downstream dribble of warmth for Harald to follow. Before he can roll over, into the vomit, to try to find his feet, he hears a speedboat.  Took them long enough.  Doc Luckless’ world spins. His trawler is capsizing.  No, it’s the bony white hands of an Angry, lifting and turning him.  Angries don’t need to follow piss-trails in the lake by touch. They have infrared telescopes. The tech they take from everyone else functions perfectly well in their hands. Harald’s trawler has a distinct heat signature. On purpose, his refrigeration unit for harvested medicinal plant storage is made so the vent fins and condensation coils, external to the cabin, form the shape of a serpent and staff, that old Earth symbol of healing.  “Wake up, old man,” the Angry says, “what’s your problem?”—and Harald wants to laugh hysterically, because waking up is his problem.  In artless, rectangular, linen trousers, design improved by diagonal slashes, the man’s skinny legs are like spare masts in stowed sails. His white-knuckled right hand grips sand-colored suspenders as Harald rises from the deck.  “How can I help?” Harald asks thickly, already fumbling for needle and suture material.  The Angry has yellow hair and brown, bristling stubble. He sits on the offered stool, legs splayed.  “She cut me. My own bloody child cut me. Look!”  Harald looks at the deep wound in the quadriceps femoris, wet and red, but that’s not what the Angry wants him to look at. Instead, he holds out a book in his left hand.  A pitiful excuse for a book. Seven sanded squares of mangrove wood, bound with rings of whalebone, the engraved homilies to be perused in times of terror. Now with bonus bloody fingerprints.  “All I did,” the Angry says, “was try to give it to her. Her mother stole her mind, her thoughts away from me. I should have noticed it happening, right under my nose, from the start. My father gave this book to me. I just wanted to pass something down. For part of me to be part of her.”  “You’re in her genetic code,” Harald says gruffly, sewing with black spots in front of his eyes. “In every single cell.”  Gaviotan whale gut to close muscle and subcutaneous fat layers. Lakeweed fiber for the skin. When Harald finds a dead whale floating, he uses every part of it, up to and including its last meal. The whales used to graze entirely on lakeweed, but they’ve taken to the green jellies, now. The ones humans burn in their combustion engines.  Green to capture the oil spills, blue to capture the poo.  I’m not eating poo! Child-Harald had screeched, but his small-nosed father had squeezed Harald’s tiny biceps and said: I haven’t ever fed you anything else. So, according to you, these tough muscles are one hundred percent poo?  Crouched by their fire, Harald had scowled as the old man slapped a blue jellyfish on a tin plate. A pinch of powder from an old coffee tin made the rubbery, translucent flesh begin to melt.  Enzyme powder, Harald’s father had explained, from a kind of jellyfish that is the natural predator of this one. Human nutrition needs and jellyfish nutrition needs are different, you see? He had swished the rapidly liquefying goo around on the plate. These blue jellies eat poo-pellets, plankton, and copepods. They use the energy to grow themselves, yes, but they also store fats, carbohydrates, vitamins, and minerals not useful to themselves in little bags called vacuoles in the mesoglea. That’s the thick, flabby part, here. We add the protease enzymes, and the nutrients are released.  What if, Harald had asked, still outraged, we cooked it on the fire?  He knew boiling water made it safe, if there was fecal contamination.  No! Cooking would ruin the vitamins. Harald’s father happily dipped his bread into the gluey mess, sucking on it with satisfaction and passing the plate to Harald. The fire is only for warmth. For light. For telling stories. You know that, Hari.  But father. They eat our poo.  The old man had laughed.  It is no longer sewage at the point where it is eaten, he insisted. First, the Martian jellies concentrate and remove the heavy metals. Orange jellies, right? We never see them. They are valuable in manufacturing. Then the sludge is dehydrated. Pellets are formed. Before the pellets are released through the pipeline, they are coated in mesoglea from a species of jellyfish that is eaten by this one. It keeps the pellets from polluting our salty little sea. Only the blue jellies can digest them. Recycling at its finest.  Those were lies from back before the jellies took control of their own destiny.  Harald ties the knot in the final suture, not sure if it’s Etty’s father or his own that he’s stitching up.  “I’m in every cell? What cell?” the Angry demands. His face darkens. Reddens. “Like a prison cell?”  “No,” Harald says. “Don’t let the wound get wet for seven days. The sutures—”  Harald falls on his face.  Feels the blood, but he’s too tired to move.  That great sail of a nose!  Not the power of a billion burning green jellies could open his eyes when they slide closed.  “Gupalma,” Palma croaks.  All is darkness, but the pain is gone, at last.  “Yes, grandmother?” Gupalma replies, her voice floating over Palma’s chest somewhere. Above her heart. My heart outside my body; that’s what children are, what grandchildren are.  Mother? queries a tiny voice like whale song. It comes from Gupalma’s great claw. Are we dying?  No, answers a louder, weaker whale song voice from inside Palma’s skull. We are not dying. We will lose some of ourselves, for a time. We could not help but kill this host. There must be a way for us not to kill the next one. We reached out, to try to be heard by a sentience who can help us. We were lucky. He is listening. Even now. We must be brave.  “I can’t see them,” Palma says. “I hear them singing but I can’t see them.”  “Who can’t you see, Grandmother?”  “The angels.”  Palma’s breath flows away, and she makes no effort to draw another.  Doc Luckless opens his eyes.  The Angry, Etty’s father, and his pitiful wooden prayer book are gone.  Doc Luckless lies, faceup, on his deck, in the afternoon sunshine, on the bright side of the lake—getting Vitamin D!—flooded with relief and hope. He actually feels rested. The ordeal is over.  The old alien has died. This is it. I’ve escaped.  He has energy again. Makes the rounds of the trawler, checking the boat, the sails, and the panels, the sorter, and the scoop. When everything’s in order, he scans the horizon for the massive, rusting barge and exhaust tower of the floating Station.  There are enough green jellies in the tank to take him straight to her.  “Deen,” he calls when she doesn’t emerge to catch his rope.  Maybe she’s gone to bed early.  Harald nods to himself. He anchors. Shreds himself a jelly for the evening meal, watches the sun go behind the mountains, and slips into the water with the whales when they come at dusk.  Their song, through the water, direct to his submerged ears, sounds more glorious than it ever has before.  Harald has never felt more at peace.  At one with the lake, the whales, and the waving lakeweed on the bottom, he closes his eyes.  When he opens them, he’s emerging from a magnetic resonance imaging tube.  “Sorry,” he/she says. “I must have fallen asleep in there.”  Harald/Gupalma draws his/her knees to his/her chest, wriggles off the stretcher, and returns to the seat in front of the artificial doctor interface.  No, Harald thinks, his weakening awareness wriggling like a trapped eel. No, it’s supposed to be over, this can’t be happening to me!  Yes, the tiny whale song voice from Gupalma’s great claw begs him, you have to keep listening. You have to hear us. You have to save us. We didn’t mean to kill the other one!  Then there’s only Gupalma’s naked fear, smothering all voices.  It can’t be the same disease that killed Grandmother. She had a tumor. Tumors aren’t catching.  The artificial doctor doesn’t respond to her apology, because it’s a machine. It doesn’t care if she fell asleep, and it doesn’t care if she apologizes or not.  Grandmother did bite me. The bite is getting worse.  “Your results are as follows,” the artificial doctor announces gently. “Transmissible malignant scorpion sclerocytoma. This resistant alpha variant is genetically identical to your grandmother’s. Please do not make exoskeleton to exoskeleton contact with others. Please report any accidental contact.”  “You never said the tumor was transmissible, last time,” Gupalma shouts. She wants to break the medical machine.  “Database has been updated based on sequencing.” The eye graphics on the screen close momentarily, an indication that the thing is processing. They open again. The modulated voice doesn’t change. “Estimated survival time for the resistant alpha variant of malignant scorpion sclerocytoma, is sixty-three days, with a standard deviation of fourteen days. I am sorry.”  We are sorry!  I just wanted to pass something down. For part of me to be part of her.  You’re in her genetic code. In every single cell.  Gupalma slumps back against the chair, in shock.  She closes her eyes.  Whales nudge Harald’s body.  He opens his eyes.  “Yes,” he gurgles at the bulbous, black-and-white whale heads, flailing, coming upright in the water. He can’t be sure, for a moment, if the light-speckled darkness means stars above him or bioluminescent jellies below him.  It’s both.  He can’t be sure whether the whale song in his ears is what he hears, or whether it’s the voice of the confused, shamed, self-aware aberration of cells, distraught about Palma’s destruction.  Also both.  In darkness, Doc Luckless swims to his anchor chain. He hauls himself out of the water, panting but not shivering.  He’s sighted his next patient, and yet there’s no feeling of dread.  I can fix this. Better than a machine can. I am the only one in all the worlds who can fix this.  “Deen,” he calls to the sleeping lump of Lake Endless’ Stationmistress. “Deen, I need you to fire up the rattler for me. I won’t be dying here, after all. I’m going to Akranes.”  The shape under the blankets shifts and moans.  “What time is it, Harald?”  “I don’t know. It’s after dark.”  When her head pokes out from under the covers, even in the meager starlight from a porthole, Harald can see that one globe has burst. Her other eye, permanently scarred.  “It’s always dark for me, now, Harald.” She sits up so gingerly he’s afraid to touch her, to try to help her. “Why do you want to go to Akranes? To find your scorpion-woman? Put her out of her misery, and you out of yours? Isn’t she dying quick enough for you?”  I have to cut that sentient tumor out of Gupalma and put it in the blue jellies in the underground cistern. Nobody eats them. They live forever.  “She’s dead,” Harald says. “Just like you will be, if you don’t take my trawler. I can transfer your things. But after you send me through, you’ll have to let the Station go, Deen.”  “No,” she says sharply.  She might as well have said the name.  Nunuz.  “You sent her among the stars, Deen. Away from the Angries. That’s all you could do. No child of Gaviota could have asked for more. She wouldn’t want you to starve here on the Station. Don’t leave your skeleton here to guard a broken machine for millennia. Take the trawler. Please.”  It’s not blood money, for failing to save your sight. That’s on the Angries.  The Stationmistress rubs the gloved palm of her left hand with the bare fingers of her right.  “I used up most of my luck getting Etty through, I reckon,” she says uneasily. “You understand?”  Do I understand? Harald understands that his mind somehow connected, not only with a dying old woman’s, but with an alien mind-analog on another planet. Who could possibly understand that?  “I understand,” he says. “I’m feeling lucky.”  Once he’s taken Deen’s things to the trawler’s cabin and taken her through the layout by touch, he dresses in a nightshirt and long johns to prepare for transmission. In the form of pure energy, he’ll spend three years in transit, yet somehow arrive on Akranes before Gupalma’s sixty-three days are done.  He’s sure of it. He saw the supernovae three years ago. They only lasted a month. Palma saw them two days ago. You have to hear us, the tiny voice had pleaded, and Harald, across space and time, had heard.  Barefooted, he enters the clay-and-hair-insulated chamber where the train carriage rests. Superfluous metal wheels have carved grooves in the floor, just with mass over time. Tiny glass windowpanes should bear scorch marks from all the human bodies they’ve burned, but that isn’t how it works. The burning isn’t without purpose.  All those mounted lasers are for observation.  It’s the heat of observation that will turn his every observed carbon-based molecule into a gush of exhaust gas out the Station’s main chimney.  “All aboard?” the Stationmistress asks softly.  “I’m ready,” Harald says.  The glass panes shiver as she seals the door. Under his feet, old turbines turn. Lamps blaze, so that he sees his reflection in the glass, a hundred tiny, gray-haired, lantern-jawed men with ravaged skin the color of corned beef.  But for the first time in a long time, Doc Luckless doesn’t feel afraid. Thoraiya Dyer is an Aurealis and Ditmar Award-winning Australian writer and veterinarian. She is the author of over fifty published short science fiction and fantasy stories. They have appeared in venues including Clarkesworld, Analog, Fantasy Magazine, Apex, Podcastle, Cosmos, Nature, anthology Bridging Infinity, and boutique collection Asymmetry. Thoraiya’s big fat fantasy novels in the Titan’s Forest Trilogy are published by Tor books. A member of SFWA, she is an avid hiker and arbalist inspired by wild spaces and the unknown universe.", "text": "6800 words, short story\nDoc Luckless and the Stationmistress\nA plague flag flutters from the houseboat’s prow as it half-motors, half-drifts toward the dark side of the lake.\nHarald hastily pokes the last of his jellyfish breakfast into his mouth, chopsticks trembling.\nAlways trepidation, first, followed by a deep sense of failure if things don’t go to plan. If he can actually help the patient, he feels relief.\nNever happiness or satisfaction.\nOnly relief.\nIt wasn’t always like this.\nHarald watches the gap close between the houseboat and his trawler. Glassy reflections of gray sky with slivers of deep green soon turn to a rippled chessboard. It’s as if the two metal hulls race to exchange secret information in advance of any human meeting. On a higher tech planet, they might.\nThey call him Doc Luckless, but they still come to him, because he’s the only registered doctor on Lake Endless. Artificial medics were banned from Gaviota when the Angries took over, and the sabotaged red rattler at the Station, that portal to other worlds, has been a one-way trip for the past seventeen years.\nNo way in.\nOne way out.\nTwo, if you count dying.\nThings are worse than they were, but not so bad that Harald’s been tempted to pay the fare for the Stationmistress to dispatch him via the rattler. Escape Option A. Lake Endless is his home. He would prefer to eventually depart via Escape Option B, in a few decades time, may the whales relish his bones.\nA bit of blue jelly sticks in Harald’s teeth.\nThe houseboat reduces speed. The plague flag droops. Four covered guns are bolted to the railings, with four extra-large life jackets fixed beside them. Yet, when Harald ties a pumice buoy to the second line extending under the lake surface to his southernmost mooring and tosses it toward the sluggish arrival, it’s a skinny, stumbling woman with one lock of white hair who emerges from the cabin to hook the buoy and secure the boat. She does this with her right hand. A staring, bowlegged seven year old dangles from her left hand.\nNot trauma, then.\nNo more than all of them are traumatized by life, anyway.\n“You’re deficient,” Doc Luckless tells Guro, the mother, “in Vitamin D. You and Etty both. On Earth, fish are a suitable supplement, but here, neither Gaviotan whales, nor the lakeweed they graze on, can help with this.”\nThe three sit around his scarred turpentine table, sharing a meal provided by Harald.\nEtty turns out to be twelve, not seven. Easy mistake to make, on the Lake.\nGuro holds up the glistening strings of shredded blue jellyfish and frowns at them.\n“But I thought—”\nEtty interrupts with the rhyme.\n“Jelly glows blue, good for you! Jelly glows green, petrol for machine!”\n“Yes, Etty,” Harald says, “that’s still true. Blue jellies have all the nutrition a human body needs. But when we eat only jellies, we also need sunlight.”\nTwo dirty blonde heads turn to peer through the porthole at the sunlit side, the northern side, of Lake Endless, and Harald can’t help but mimic them. Even as they rest at anchor, the lapping flow of the lake water tugs the houseboat and the trawler on their rusted chains further south, deeper into the shadow of the sheer, gray spikes of the seven-pointed crown.\n“Can I see your emergency flares?” Etty asks. Her face turns dreamy. “I won’t shoot them. They’re very colorful. Like angels come to life. Like if stars came to visit.”\nIn the distant sunlight, the surface glitters.\n“Angries are over there,” Guro mutters, lowering her chopsticks.\nAngries in their solar-powered speedboats, smashing tech that isn’t theirs, stealing children for their scripture-based schools. Harald gets a pass on the sunny side because he’s the doc. Even Angries need surgery sometimes. Plus, he’s got no children for them to steal.\n“Did they kill Etty’s father?” Harald asks.\n“Worse,” Guro says. “He’s one of them.”\nWhen they’ve gone, Harald pulls on a buoyancy wet suit and floats beside his ship on Lake Endless, as passive as the trawler and its wind-powered mechanical catcher and sorter.\nIt strains the jellies from the lake, spinning the heavier green jellies directly into the fuel tank of the engine. The blue jellies go to the larder.\nThrough the water and the suit material, the sorter sounds like whales swallowing and excreting.\nCalm and slow.\nNot like gasping scorpion people dying of acidemia. Not like the howling of wind through bone-dry clay houses.\nHarald sighs deeply, rising with the inflation of his lungs and then sinking like a melting iceberg with the exhalation.\nTo be a jelly would be to have no thought for past or future.\nBut also, to be helpless in the face of wind and flowing water.\nAfter sunset, Harald falls asleep to the recorded sounds of Earth whale song. Unlike Gaviotan whales, who learned to sing human songs back to the new arrivals, Earth whales never gave a shit what songs their humans sang. They sang to one another, until the genetically engineered jellies that were supposed to save the planet from plastic pollution took over the oceans instead.\nEarth whales are all dead.\nBut Harald’s lived on Lake Endless for long enough that the local whales have started to mimic the recordings. Three years ago, when the twin supernovas were visible in the night sky like a pair of pink eyes, was when he first heard the Gaviotan beasts joining in.\nThey serenade his sound player as if Harald was singing to them, himself, even as his eyelids slide closed.\nHarald’s eyelids slide open.\nEverything’s white and cloudy, until his third eyelid slides across, and a chitinous face with burnished bronze cheekplates and double-articulated mandibles flickers into clarity.\n“Grandmother,” whispers the face.\nHarald feels his own confusion, but also, somehow, disappointment cut by a quiet thrill, because he’s Palma, grandmother of Gupalma—which means descendent-of-Palma in Akranian—and although she seems to be awake again, which means she hasn’t died, Palma is going to die soon, and depart Akranes for heaven, which is exciting.\nIn heaven, water droplets float around in the air.\nThere’s nothing to lift, in heaven. No need for augmented scorpion claws designed for off-world hard labor.\nEven Palma’s body will be weightless.\n“Hello, Gupalma,” Palma says, her mandibles stiffened with dust, like the jamb of a sandstorm-scoured, centuries-old front door, so that every spoken word is painful. “Help me up. There’s work to do.”\nFor thirty years, Palma has maintained the town’s underground water supply. There, blue jellies are used to clean the water of organic pollutants, but not eaten, as they are incompatible with scorpion biology.\n“The artificial doctor ordered you to rest, Grandmother,” Gupalma answers earnestly.\n“That brain-in-a-box! What does it know?”\nHeat and hurt, like lightning, lance through Palma’s spine and claws—internal and external skeleton—as she curls up to sitting, but she welcomes it. Every crack of pain is a drumbeat welcoming her to the next life.\n“You’ll work yourself to death, Grandmother!” Gupalma cries.\nYes, dear, Harald/Palma thinks. That’s the whole idea.\nUnderground, the blue jellies fluoresce majestically in the stone cisterns. Palma stirs them with great paddles, churning oxygen into the subterranean sea.\nWhen it’s time to go back up the black steps to the city, Palma’s legs seize. She stumbles into the stairwell, instead, her bent back against stone, wheezing the welcome, damp air.\nI will just rest here for a moment.\nHer third eyelid clouds the caverns, an eclipse that precedes the proper closing of her eyes.\nHarald’s eyes shoot wide open.\nHe rolls out of his low bunk and curses thickly when his face hits the floor.\nThat great sail of a nose! his now-dead, small-nosed father who taught him how to sail the sulfuric acid sea on Haey had laughed.\nHarald tends his bloody nose on autopilot as his mind tries to make sense of the dream.\nI was on Akranes.\nA planet he’s never actually visited, but easily able to recognize from the films.\nHis waking nightmares are bad enough. He doesn’t need to walk among scorpions in his sleep as well. But this was so oddly specific.\nDid I ever treat a patient called Palma? With a granddaughter called Gupalma?\nShaking it off, he moves the trawler to a ripple of water against a horseshoe-shaped rock, on the sinuous line between light and dark, where message bottles thrown in on the sunny side of Lake Endless accumulate.\nHaey is the place. Not Akranes. Haey is the planet where I failed them. Why not have nightmares about Haey?\nA green bottle rests wetly against the rock. Precious glass. The Stationmistress doesn’t even need to write a message on a torn corner of a book page to summon Doc Luckless.\nOnly the Angries still have unbound paper, anyway.\nHarald lifts the bottle by its slender neck out of his scoop net, letting the slightly salty water drip.\nLetting it slide away, like the lubrication of tears against lids.\n“Got something in my eye,” the Stationmistress says.\n“When?”\n“Few days ago, now. That really windy afternoon.”\nHarald holds her eye open with a hairy-knuckled hand. His sun-ravaged skin is the color of corned beef from his decades on Haey. Meanwhile, the Stationmistress, Deen, delicate, her skin blue-black, wears a long white glove on her left arm that covers her from fingertips to heart. Her eye is inflamed, with conjunctivitis and aqueous flare.\nBut he’s distracted by the dream. He’s remembering his life on Haey, where computers were the best doctors, and every diagnosis he made was wrong or incomplete. But the scorpion people who labored at the Station preferred him, because he was kind.\nFake Doc can’t tell me to get well soon and mean it!\nThen one day a traveler brought a virus, and when Harald recognized the symptoms, he felt that comforting glow of certainty. He could fix this.\nHe could fix it with an IV infusion that had as a side effect a temporary metabolic acidosis. In humans, compensatory respiratory alkalosis could have kept the patient’s blood pH in a range compatible with survival. Unfortunately, gas exchange in scorpion people was less efficient and the laborers all died of acidemia. He should have known.\nAn artificial computer would have known.\nFirst, do no harm.\nTo escape the shame, Doc Luckless fled to Gaviota.\nHis birth body had been consumed by the heat of observation in the red rattler at Haey Ninth Colony Station. Roughly three years later, his particles, right down to his thought processes, had been reconstructed in the rattler kept by Gardenia Breeze in the heat-shielded heart of her floating Station on Lake Endless.\nSo long ago.\nHarald arrived a full ten years before Deen sent her daughter, Nunuz, through to Eye Station, on Kvivik, the water world, to train as a Stationmistress herself.\nThirteen years before Angries sabotaged the Gaviotan rattler from the other side, so that Nunuz could never—can never—come back.\nDoc Luckless can’t even be sure the rattler’s element tanks have enough in them to print a whole person anymore. Angries stopped short of pillaging the tanks and setting fire to the floating Station. Something in their scriptures about portals to heaven. About the Stationmistress being an intermediary, some sort of ethereal guide.\n“Ow,” rebukes the ethereal guide as Harald tests her intraocular pressure.\nSomething outside the Station makes a faint tick-tick-tick sound.\n“Can’t see a foreign body,” Doc Luckless says quietly. “But there’s trauma to the eye. Bathe it in lake water, Deen. Six times a day. Stay inside. Protect it from light.”\nThey’d slept together, once. Seventeen years ago. She’d done it to stop him from crying. Faced with a bawling, fully grown man, instead of fetching water and asking about feelings, as Harald had been trained to do, Deen had peeled off all her clothes except for the glove and gripped him like an ultrasound probe with her other, bare hand, wielding his intimate organ with compassionate but clumsy determination.\nHe hadn’t stopped crying, not for good, but he’d been grateful to her.\nWould always be grateful.\nHe’d gifted her the only book he’d brought with him, a copy of Sindre’s Exile, and she’d added it to her tiny library on the silky oak shelf with such a glow around the eyes that, although he sneaks the yellowed poems out to read sometimes, when she’s too busy maintaining the rattler to notice, he won’t allow her to give the pages back to him.\nThe poisoned air/ I cannot sing/ the mouth a still/ vestigial thing. I mocked a Lord of blood and waste/ He fed me to his sharks/ My body wasted by this throw/ through myriad of darks.\nIt was never payment. It was just doing what he could, in darkness, to show another person something bright.\nThe Stationmistress pays him now, for the medical consultation, with a coil of strong lakeweed rope and a single teaspoon of sugar-filtering lake sponge. They live in a world of brine. Sweetness is a gift. He’ll keep the sponge safe until the solstice.\nTick-tick-tick.\n“The hell is that sound?” Deen demands.\nThey spill out onto the deck of the Station, at the closest point to where Doc Luckless tethered his trawler. Something has floated south. Something facedown and skinny, with one lock of white hair among streams of dirty blonde.\nThe ticking sound is Guro’s dead body, trying to get stuck in the inlet of his boat’s jelly scoop.\nHer throat is cut.\nAngries are over there, Guro had said, staring at the sunlit side.\nAnd Doc Luckless had insisted that she go there.\n“Nobody should ever listen to me,” he tells Deen.\n“No crying,” Deen warns, her fierce grip on his arm. “Or you’ll have to endure my inept banging.” She hesitates. “Help me put her into the separator. I finally pissed enough nitrates to fuel it.” The Stationmistress’ grip falters. Her voice shakes. “One day, Guro’s elements may be reassembled, and help somebody else to live.”\nSomebody. She means Nunuz.\nShe thinks Nunuz will one day repair the rattler from the Kvivikian side, and return to Gaviota from heaven, shining like an angel.\nLike if stars came to visit, the child, Etty, had said.\n“I’ll help you,” Doc Luckless says.\nCan I see your emergency flares?\nAfter Guro’s body is secure in the separator, Harald searches Lake Endless ’til nightfall. He burns every last drop of liquefied green jelly.\nBut there’s no sign of the houseboat or of Etty.\nHarald/Palma’s eyes slide closed/open.\nMammalian lashes and scorpion third eyelid.\nThis continuing, uneventful scorpion-woman dream is irritatingly chronological/ This human man lurks inside my head now whenever I’m awake and lucid, they think briefly, before Gupalma bustles into the room, fresh sheets in her claws, and even though she turns Palma ever so gently, there is pain.\nPain behind Palma’s left eye.\nPain, crackling from the original spot along her spine and stabbing her guts, where the brain-in-a-box informed her the cancer has spread to her liver as well as her brain.\nCancer? Palma had retorted, cracking her claws. The killer crab? I am the killer crab.\nBut artificial doctors don’t get jokes.\nEstimated survival time, it had said, for the resistant alpha variant of malignant scorpion sclerocytoma, is sixty-three days, with a standard deviation of fourteen days.\nIn heaven, nobody talks about standard deviations.\n“Let me tuck you in,” Gupalma begs, but Palma is still rolling.\nOff the bed. Into the dressing room.\n“I have to tend the cistern,” Palma growls when her granddaughter catches her.\n“No,” Gupalma says.\nPalma bites her.\nRight on the claw.\nRight through the shell, into the soft, white exocuticle.\n“Ouch!” Gupalma exclaims. “That was childish, Grandmother!”\nBut Palma is laughing, a dusty wheeze, remembering how Gupalma, as a hatchling, had bitten her grandmother when denied a closer look at the mesmerizing jellies, and the precious water they swam in, which must not be contaminated by skin-surface microorganisms, not even to please a child.\nThe zoo, Palma had cooed, I will take you there, little Gupalma. You can ride the Gaviotan whales. You can touch them, talk to them, and let them sing to you. But you must not touch the jellies.\nScorpion diseases can infect the jellies.\nThey’re alike, the jellies and scorpions.\nBoth made to serve their human masters but exploding out of control.\nDoc Luckless wakes, only a few hours after falling asleep.\nEarth whale music still mournfully vibrates his cabin, joined by a chorus of slightly less musical, more drain-like Gaviotan whales.\nA pod of them lingers under the trawler.\nThey like to float only thirty meters or so below the hull, singing. Never trying to get the jellies out of his scoop or sorter. Never surfacing to see what he looks like. If not for the illustrations in Deen’s Atlas of Gaviotan Life, or the whale corpses he sometimes finds, Harald couldn’t have begun to guess at their alien, pied cone-shapes with thin streamers of iridescent flesh, like gymnasts trailing ribbons through the lake.\nHe can’t get back to sleep.\nNot even after running through his breathing exercises several times.\nIt’s not just because he failed to help Guro.\nIt’s because Palma isn’t awake.\nThe thought is horrifying, if true. The scorpion-woman in his head is dying. If she’s real, she can expect her waking hours to shrink and continue shrinking.\nIf she isn’t real, it means Harald is losing his mind.\nI can get back to sleep.\nStubbornly, he lies in his bunk, unsleeping, eyes closed, until just before dawn.\nThat’s when he hears weapon’s fire and screams. Easing himself out of his bunk, he moves to the deck in his long underwear and knitted nightshirt, squinting at the fine line of white starting to pencil across the surface on the distant bright side.\nAbove the line, craft silhouettes clash. More shots sound and hulls grind.\nBelow the line, soft glowing bodies blob about. Widely spaced. Green and blue.\nLater in the day, pieces of a wrecked houseboat float past him, including a tattered plague flag.\nThat’s it. He’s failed Etty, too.\nTwo for two.\nForty-eight hours of worsening insomnia later, Harald finds that the Stationmistress’ traumatized eye has deteriorated.\n“You won’t go through?” he asks her, for the hundredth time. “There are antibiotics on Kvivik.”\n“No,” the Stationmistress answers. “I’ll leave when I’m dead, same as you, Doc.”\nNow her cornea’s ulcerated, too. Deen needs antibiotics or she’ll lose half her sight, but the Angries won’t allow any medicine dispatches from orbit. With the broken Station only transporting things one way, Doc Luckless has no choice but to take some of Deen’s blood for making autologous serum drops to apply to the affected eye.\nHe carefully carries the clotted sample across the gangplank to his trawler. Sighing, he sets it in place. Switches on the jelly engine and starts up the centrifuge.\nWhile it’s spinning and the serum is separating out, he makes two tiny, steaming cups of mangrove worm tea and takes them back to the floating Station.\n“Fifteen minutes,” he tells the Stationmistress, who sips the tea, nods, and returns to cutting her hair.\nFirst with wide-toothed comb, then narrow, then wickedly sharp steel scissors she snaps apart to sharpen on a stone every several snips; she cuts from habit, without a mirror, mixes her cut hair with clay from a wooden bucket, and right-handedly re-insulates the cracked sections of the rattler room.\nHarald watches her with an aching heart. The ache is mostly affection for the familiar. The Station is the Mistress, and the Mistress is the Station. She will never stop trying to keep it running. As stubborn as Palma, and her Akranian cistern. Do not think about Palma. There is no Palma. But part of the ache is fear, because if the conjunctivitis and subsequent ulceration spread to her other eye, her days of scanning for cracks to fill are numbered.\nHe creeps away to the library.\nPulling Sindre’s Exile from the shelf, he sits in Deen’s comfortable chair and allows the book to fall open in his lap. Doc Luckless reads the words, even though he knows them by heart.\nInside my head/ Haey’s mournful song/ A song of nothing/ lasting long. A song of embers growing dim/ of atoms worlds apart/ of stardust sent beyond the whim/ of tyrant’s mind and heart.\nIt’s been so long since he slept.\nHarald’s eyes slide closed.\nPalma pictures herself as a tadpole, swimming up toward the black, blue-jelly-speckled surface of consciousness.\n“Grandmother. I’ll help you sit up.”\nGupalma’s claw curls around Palma’s shoulders.\nThe wound on it hasn’t healed.\nBite wound, Palma thinks blearily. I bit her.\nThe laceration gapes. Thick yellow discharge fills the carapace crack. Angry, red soft-tissue lies beneath.\nShe’ll still have my/your mandible-marks in her, days after I’m/you’re dead, Palma/Harald thinks.\nA third voice, soft as a jelly’s pulse, fluted as whale song, whispers: We don’t want to kill you. We can’t help it. We don’t mean to.\nOutside the window, the paired pink blooms of some distant supernovae seem like angel eyes, watching over Palma.\nThen pain drives all thoughts away.\nHe wakes up screaming.\n“Doc,” the Stationmistress says, holding his face tight between her palms. “You’re safe.”\n“I’m dying,” he gasps, and Deen’s eyes go wide before he can correct himself. “I’m not dying. It just feels like I am.”\nShe tries to kiss him on the mouth. Softening the clumsy instinct to push her back is difficult for Harald, still fuzzy from the nightmare, his arms leaden, but he manages to keep her from making contact without hurting her.\n“Why do you try to fix me that way, Deen?”\n“It’s what my husband did,” she breathes. Then she cringes with shame. “Only, he was good at it.”\n“He was good at it,” Harald says, their faces still inches apart, “because he knew you.”\n“You won’t let me know you. I should know you. You should know me. We’re the only constants on Endless. The only ones the Angries won’t eat or kill.”\nIn his mind’s eye, dead scorpion people erupt from the top of Harald’s head like a volcano that could smother the world.\n“If you knew me,” he murmurs, “you’d wish you didn’t know.”\n“I know you help people.”\n“No.” He shudders. We can’t help it. We don’t mean to. Guro’s dirty blonde hair, in the water, with one white lock. “I don’t. I’m being punished. The dreams.”\nDeen takes her hands away from his face and straightens beside the chair where he sprawls with the open book of poetry. Her hair is half cut. One bulging, bluish, bloodshot eye and one pink-tinged one confront him.\n“What dreams?” she demands.\nHarald tells her about the dreams.\n“So,” she says slowly, “you can’t fall asleep again right now, even though you’re bone-weary, because an old scorpion woman on another planet isn’t awake? Is there a three-year delay on these dreams, as there should be between Akranes and Gaviota, if they’re traveling at light speed?”\n“Please don’t make fun of me,” Harald says, scowling, but she isn’t smiling. “Maybe when the old woman dies, I’ll never get to sleep again.”\n“Maybe when she dies,” Deen replies, arms folded, “your self-flagellation will be complete. Your punishment over.”\nThey both hear the speedboat engine at the same time, startling with shoulders hunched like nesting birds.\n“Angries,” the Stationmistress says, grimacing.\nShe spins out the little doorway and away.\nHarald replaces the book on the shelf, bends to avoid cracking his head, and lumbers after her.\nThe Lake’s worst pilot crashes a solar speedboat into the Station. Throws a rope that misses. Deen shrieks furiously. Harald only hooks the line from the water, pulling it tight so that Deen can scramble across and cut the speedboat’s motor.\nShe pulls a spitting Etty from behind the wheel.\n“I’ll spank your bare backside, child,” Deen promises.\n“Spank away, only send me quickly to the other world!” Etty hollers.\nHarald gapes at the ray of hope. The walking rainbow.\nI didn’t kill her, after all.\n“You’re too little to go alone,” the Stationmistress says.\n“Not too little to stab my dad with a jelly hook, eh? Not too little to steal a speedboat, eh? It’s worth a lot. You can keep it. It’s my payment for going through. Only hurry up.” Etty’s bluster exhausts itself quickly. She huffs out the last two words dejectedly. “Please, hurry.”\nHarald follows them back inside the floating Station. The hard deck feels soft. He can almost see the ripples. It’s a miracle. He’s walking on water.\n“You know I can’t keep it, child. You know your folks will be here for it, soon. They’ll be wanting to punish you. If I send you to Kvivik, they’ll be punishing me. You know what that punishment will be?”\n“Send her,” Doc Luckless blurts.\nDeen’s diseased eyes and Etty’s enormous ones turn on him together.\n“Send her, and I’ll take the speedboat with me, to the dark side of the lake. When they come, I’ll tell them Etty died.” There’s no sunlight on Kvivik, either, but there are plenty of fish. Plenty of calcium in every discarded cartilaginous backbone on the pier. “I’ll pay you back. It will take a long time, a lot of green jellies, I know it’s ten tons per ignition to run, but I’ll pay. Please, Deen.”\nBest of all, she’ll be away from here. Away from me. Real doctors will be there, to tend her. Artificial doctors.\nThe Stationmistress nods.\n“Go now, then, Harald,” she says. “No goodbyes.”\nHe doesn’t need to feel the heat of observation, permeating the clay, to know she’ll do what she says.\nHarald vomits his shredded jellyfish, sick with exhaustion.\nThis can’t go on.\nHe stares at the pile of pale, frothy retch. Losing fluid with every heave. He’ll be dehydrated soon. Mist fills the mountain bowl of the seven-pointed crown, making the smothered lake silent.\nI need sleep.\nLying down by the gunwale, he lets the trawler rock him, one arm dangling. His fingers feel the slow southern direction of the flow and the relative warmth that means he’s drifted into more easterly shallows. Without opening his eyes, without needing a sense of light or dark, he knows where he is on the lake.\nA blind woman could survive on this trawler.\nNot so the floating Station, with its dangerously overpowered engine, touchscreen-operated active jelly straining apparatus, and open-flame manual water distillery. Harald has to find Deen in this mist. He has to make sure the serum drops have worked, and that her eyesight is saved.\nBut it isn’t. She will be just another failure in a long line of failures. I told her to get off this planet.\nThe water used to cool the red rattler, which the Stationmistress fired up only a day ago to send Etty to Kvivik, will still be leaving a downstream dribble of warmth for Harald to follow. Before he can roll over, into the vomit, to try to find his feet, he hears a speedboat.\nTook them long enough.\nDoc Luckless’ world spins. His trawler is capsizing.\nNo, it’s the bony white hands of an Angry, lifting and turning him.\nAngries don’t need to follow piss-trails in the lake by touch. They have infrared telescopes. The tech they take from everyone else functions perfectly well in their hands. Harald’s trawler has a distinct heat signature. On purpose, his refrigeration unit for harvested medicinal plant storage is made so the vent fins and condensation coils, external to the cabin, form the shape of a serpent and staff, that old Earth symbol of healing.\n“Wake up, old man,” the Angry says, “what’s your problem?”—and Harald wants to laugh hysterically, because waking up is his problem.\nIn artless, rectangular, linen trousers, design improved by diagonal slashes, the man’s skinny legs are like spare masts in stowed sails. His white-knuckled right hand grips sand-colored suspenders as Harald rises from the deck.\n“How can I help?” Harald asks thickly, already fumbling for needle and suture material.\nThe Angry has yellow hair and brown, bristling stubble. He sits on the offered stool, legs splayed.\n“She cut me. My own bloody child cut me. Look!”\nHarald looks at the deep wound in the quadriceps femoris, wet and red, but that’s not what the Angry wants him to look at. Instead, he holds out a book in his left hand.\nA pitiful excuse for a book. Seven sanded squares of mangrove wood, bound with rings of whalebone, the engraved homilies to be perused in times of terror. Now with bonus bloody fingerprints.\n“All I did,” the Angry says, “was try to give it to her. Her mother stole her mind, her thoughts away from me. I should have noticed it happening, right under my nose, from the start. My father gave this book to me. I just wanted to pass something down. For part of me to be part of her.”\n“You’re in her genetic code,” Harald says gruffly, sewing with black spots in front of his eyes. “In every single cell.”\nGaviotan whale gut to close muscle and subcutaneous fat layers. Lakeweed fiber for the skin. When Harald finds a dead whale floating, he uses every part of it, up to and including its last meal. The whales used to graze entirely on lakeweed, but they’ve taken to the green jellies, now. The ones humans burn in their combustion engines.\nGreen to capture the oil spills, blue to capture the poo.\nI’m not eating poo! Child-Harald had screeched, but his small-nosed father had squeezed Harald’s tiny biceps and said: I haven’t ever fed you anything else. So, according to you, these tough muscles are one hundred percent poo?\nCrouched by their fire, Harald had scowled as the old man slapped a blue jellyfish on a tin plate. A pinch of powder from an old coffee tin made the rubbery, translucent flesh begin to melt.\nEnzyme powder, Harald’s father had explained, from a kind of jellyfish that is the natural predator of this one. Human nutrition needs and jellyfish nutrition needs are different, you see? He had swished the rapidly liquefying goo around on the plate. These blue jellies eat poo-pellets, plankton, and copepods. They use the energy to grow themselves, yes, but they also store fats, carbohydrates, vitamins, and minerals not useful to themselves in little bags called vacuoles in the mesoglea. That’s the thick, flabby part, here. We add the protease enzymes, and the nutrients are released.\nWhat if, Harald had asked, still outraged, we cooked it on the fire?\nHe knew boiling water made it safe, if there was fecal contamination.\nNo! Cooking would ruin the vitamins. Harald’s father happily dipped his bread into the gluey mess, sucking on it with satisfaction and passing the plate to Harald. The fire is only for warmth. For light. For telling stories. You know that, Hari.\nBut father. They eat our poo.\nThe old man had laughed.\nIt is no longer sewage at the point where it is eaten, he insisted. First, the Martian jellies concentrate and remove the heavy metals. Orange jellies, right? We never see them. They are valuable in manufacturing. Then the sludge is dehydrated. Pellets are formed. Before the pellets are released through the pipeline, they are coated in mesoglea from a species of jellyfish that is eaten by this one. It keeps the pellets from polluting our salty little sea. Only the blue jellies can digest them. Recycling at its finest.\nThose were lies from back before the jellies took control of their own destiny.\nHarald ties the knot in the final suture, not sure if it’s Etty’s father or his own that he’s stitching up.\n“I’m in every cell? What cell?” the Angry demands. His face darkens. Reddens. “Like a prison cell?”\n“No,” Harald says. “Don’t let the wound get wet for seven days. The sutures—”\nHarald falls on his face.\nFeels the blood, but he’s too tired to move.\nThat great sail of a nose!\nNot the power of a billion burning green jellies could open his eyes when they slide closed.\n“Gupalma,” Palma croaks.\nAll is darkness, but the pain is gone, at last.\n“Yes, grandmother?” Gupalma replies, her voice floating over Palma’s chest somewhere. Above her heart. My heart outside my body; that’s what children are, what grandchildren are.\nMother? queries a tiny voice like whale song. It comes from Gupalma’s great claw. Are we dying?\nNo, answers a louder, weaker whale song voice from inside Palma’s skull. We are not dying. We will lose some of ourselves, for a time. We could not help but kill this host. There must be a way for us not to kill the next one. We reached out, to try to be heard by a sentience who can help us. We were lucky. He is listening. Even now. We must be brave.\n“I can’t see them,” Palma says. “I hear them singing but I can’t see them.”\n“Who can’t you see, Grandmother?”\n“The angels.”\nPalma’s breath flows away, and she makes no effort to draw another.\nDoc Luckless opens his eyes.\nThe Angry, Etty’s father, and his pitiful wooden prayer book are gone.\nDoc Luckless lies, faceup, on his deck, in the afternoon sunshine, on the bright side of the lake—getting Vitamin D!—flooded with relief and hope. He actually feels rested. The ordeal is over.\nThe old alien has died. This is it. I’ve escaped.\nHe has energy again. Makes the rounds of the trawler, checking the boat, the sails, and the panels, the sorter, and the scoop. When everything’s in order, he scans the horizon for the massive, rusting barge and exhaust tower of the floating Station.\nThere are enough green jellies in the tank to take him straight to her.\n“Deen,” he calls when she doesn’t emerge to catch his rope.\nMaybe she’s gone to bed early.\nHarald nods to himself. He anchors. Shreds himself a jelly for the evening meal, watches the sun go behind the mountains, and slips into the water with the whales when they come at dusk.\nTheir song, through the water, direct to his submerged ears, sounds more glorious than it ever has before.\nHarald has never felt more at peace.\nAt one with the lake, the whales, and the waving lakeweed on the bottom, he closes his eyes.\nWhen he opens them, he’s emerging from a magnetic resonance imaging tube.\n“Sorry,” he/she says. “I must have fallen asleep in there.”\nHarald/Gupalma draws his/her knees to his/her chest, wriggles off the stretcher, and returns to the seat in front of the artificial doctor interface.\nNo, Harald thinks, his weakening awareness wriggling like a trapped eel. No, it’s supposed to be over, this can’t be happening to me!\nYes, the tiny whale song voice from Gupalma’s great claw begs him, you have to keep listening. You have to hear us. You have to save us. We didn’t mean to kill the other one!\nThen there’s only Gupalma’s naked fear, smothering all voices.\nIt can’t be the same disease that killed Grandmother. She had a tumor. Tumors aren’t catching.\nThe artificial doctor doesn’t respond to her apology, because it’s a machine. It doesn’t care if she fell asleep, and it doesn’t care if she apologizes or not.\nGrandmother did bite me. The bite is getting worse.\n“Your results are as follows,” the artificial doctor announces gently. “Transmissible malignant scorpion sclerocytoma. This resistant alpha variant is genetically identical to your grandmother’s. Please do not make exoskeleton to exoskeleton contact with others. Please report any accidental contact.”\n“You never said the tumor was transmissible, last time,” Gupalma shouts. She wants to break the medical machine.\n“Database has been updated based on sequencing.” The eye graphics on the screen close momentarily, an indication that the thing is processing. They open again. The modulated voice doesn’t change. “Estimated survival time for the resistant alpha variant of malignant scorpion sclerocytoma, is sixty-three days, with a standard deviation of fourteen days. I am sorry.”\nWe are sorry!\nI just wanted to pass something down. For part of me to be part of her.\nYou’re in her genetic code. In every single cell.\nGupalma slumps back against the chair, in shock.\nShe closes her eyes.\nWhales nudge Harald’s body.\nHe opens his eyes.\n“Yes,” he gurgles at the bulbous, black-and-white whale heads, flailing, coming upright in the water. He can’t be sure, for a moment, if the light-speckled darkness means stars above him or bioluminescent jellies below him.\nIt’s both.\nHe can’t be sure whether the whale song in his ears is what he hears, or whether it’s the voice of the confused, shamed, self-aware aberration of cells, distraught about Palma’s destruction.\nAlso both.\nIn darkness, Doc Luckless swims to his anchor chain. He hauls himself out of the water, panting but not shivering.\nHe’s sighted his next patient, and yet there’s no feeling of dread.\nI can fix this. Better than a machine can. I am the only one in all the worlds who can fix this.\n“Deen,” he calls to the sleeping lump of Lake Endless’ Stationmistress. “Deen, I need you to fire up the rattler for me. I won’t be dying here, after all. I’m going to Akranes.”\nThe shape under the blankets shifts and moans.\n“What time is it, Harald?”\n“I don’t know. It’s after dark.”\nWhen her head pokes out from under the covers, even in the meager starlight from a porthole, Harald can see that one globe has burst. Her other eye, permanently scarred.\n“It’s always dark for me, now, Harald.” She sits up so gingerly he’s afraid to touch her, to try to help her. “Why do you want to go to Akranes? To find your scorpion-woman? Put her out of her misery, and you out of yours? Isn’t she dying quick enough for you?”\nI have to cut that sentient tumor out of Gupalma and put it in the blue jellies in the underground cistern. Nobody eats them. They live forever.\n“She’s dead,” Harald says. “Just like you will be, if you don’t take my trawler. I can transfer your things. But after you send me through, you’ll have to let the Station go, Deen.”\n“No,” she says sharply.\nShe might as well have said the name.\nNunuz.\n“You sent her among the stars, Deen. Away from the Angries. That’s all you could do. No child of Gaviota could have asked for more. She wouldn’t want you to starve here on the Station. Don’t leave your skeleton here to guard a broken machine for millennia. Take the trawler. Please.”\nIt’s not blood money, for failing to save your sight. That’s on the Angries.\nThe Stationmistress rubs the gloved palm of her left hand with the bare fingers of her right.\n“I used up most of my luck getting Etty through, I reckon,” she says uneasily. “You understand?”\nDo I understand? Harald understands that his mind somehow connected, not only with a dying old woman’s, but with an alien mind-analog on another planet. Who could possibly understand that?\n“I understand,” he says. “I’m feeling lucky.”\nOnce he’s taken Deen’s things to the trawler’s cabin and taken her through the layout by touch, he dresses in a nightshirt and long johns to prepare for transmission. In the form of pure energy, he’ll spend three years in transit, yet somehow arrive on Akranes before Gupalma’s sixty-three days are done.\nHe’s sure of it. He saw the supernovae three years ago. They only lasted a month. Palma saw them two days ago. You have to hear us, the tiny voice had pleaded, and Harald, across space and time, had heard.\nBarefooted, he enters the clay-and-hair-insulated chamber where the train carriage rests. Superfluous metal wheels have carved grooves in the floor, just with mass over time. Tiny glass windowpanes should bear scorch marks from all the human bodies they’ve burned, but that isn’t how it works. The burning isn’t without purpose.\nAll those mounted lasers are for observation.\nIt’s the heat of observation that will turn his every observed carbon-based molecule into a gush of exhaust gas out the Station’s main chimney.\n“All aboard?” the Stationmistress asks softly.\n“I’m ready,” Harald says.\nThe glass panes shiver as she seals the door. Under his feet, old turbines turn. Lamps blaze, so that he sees his reflection in the glass, a hundred tiny, gray-haired, lantern-jawed men with ravaged skin the color of corned beef.\nBut for the first time in a long time, Doc Luckless doesn’t feel afraid.\nThoraiya Dyer is an Aurealis and Ditmar Award-winning Australian writer and veterinarian. She is the author of over fifty published short science fiction and fantasy stories. They have appeared in venues including Clarkesworld, Analog, Fantasy Magazine, Apex, Podcastle, Cosmos, Nature, anthology Bridging Infinity, and boutique collection Asymmetry. Thoraiya’s big fat fantasy novels in the Titan’s Forest Trilogy are published by Tor books. A member of SFWA, she is an avid hiker and arbalist inspired by wild spaces and the unknown universe.", "source": "https://clarkesworldmagazine.com/dyer_04_22/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Doc Luckless and the Stationmistress by Thoraiya Dyer"}