{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Roger Moraga", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "0PB3tgnvYLBAktcDXhIoXszFYsA=", "id": null, "license": null, "comments": "", "raw_text": "Non-Fiction  Modern Genetics in the World of Fiction   “Nowadays, many modern remakes of classic superheroes have gone for the latest superscience — Genetic Engineering. Be it a bite from a genetically engineered spider, or exposure to it in a freak accident, genetically engineered origins are the Phlebotinum for the 21st century.”  —TvTropes.org: “Genetic Engineering Is The New Nuke”  From man-eating dinosaurs to gene-enhanced super-soldiers, the wonders of modern genetics surround us in the world of fiction. This is hardly surprising: the mainstream media is constantly reporting breathlessly about the latest feats of genetic engineering performed by researchers. Looking at these developments through the eyes of a science fiction writer, one can’t help but gaze greedily at the countless possibilities.  Most of the time there is a certain amount of unrealistic superscience involved in the creation of speculative fiction, but as a geneticist I can’t help but wonder if it is really necessary to trample all over what we do know about genetics to make it happen. Ultimately it is up to the creator to decide how much, and how soon, to depart from “real” Science, but before long it may not be necessary to depart much at all. A more in-depth look at what genetic engineering is doing today may be enough to make one’s imagination run wild.  How our genes work  Modern genetics developed in the 20th century after the work of Gregor Mendel on inheritance in pea plants, and became a major field of study. A look at the list of Nobel Prize winners shows a number of works on genetics receiving this award, the latest being this year with Ramakrishnan, Steitz, and Yonah honored for their work on the structure and function of the ribosome, a key component of the gene expression machinery. What have we learned since then?  At the basic level, our genes work in a way not too dissimilar to that of a modern computer. Information is stored in our DNA (which stands for deoxyribonucleic acid), a macromolecule which is composed of four types of smaller molecules chained together, in the same way bits are stored together in the hard drive of a computer. A computer bit has two possible values, whereas a DNA base (the equivalent of a “bit”) has four possible values.  DNA contains our genes. Each gene is a discrete piece of self-contained DNA, a program in our hard drive, if you will. When a gene is needed, it is copied into a second molecule called RNA (ribonucleic acid, similar to DNA, just slightly different chemically), and the copy is used to create proteins.  Proteins are what carry out the lion’s share of chemical reactions in our bodies. When muscles flex, it is proteins doing the work. When we digest food, it is proteins breaking down the nutrients. The structures of our bodies, such as our ears or tendons, are made with proteins. Even bones have a matrix composed of proteins to support the inorganic crystalline parts of them.  Finally, all these elements interact with each other in an organized but very, very complex way. Genes regulate other genes, proteins modify RNA or even DNA, or other proteins, or a whole host of them. We are a gigantic network of very complex interactions between all our genes, their products, and the environment.  Given how much is encoded in our DNA, and how all life carries genetic information in a similar fashion, the possibilities that spring to mind after assuming one can decode said information, and subsequently modify it, are practically unlimited. How would the humans of the future look if genetics were allowed to run rampant?  Enter the Super-Soldier  One of the possible answers is the super-soldier. From Captain America to the Sardaukar of Dune, to cite some of the best known examples, no science fiction story of warfare is ever complete without these brave men and women who surpass some or all of our human limitations.  The first step in building a super-soldier is surely to remove genetic defects and select the best combination possible of human genes. That’s something that is already happening today. The list of genetic variations that predispose for this or that disease (which links directly to the function of the gene) is constantly growing, and gene therapy to correct those problems is advancing at a fantastic pace. The idea is simple: take a “correct” copy of that gene, swap it with the “incorrect” one, and watch the fireworks. Therapies for many diseases, from Cancer to Parkinson’s disease1, are in the field today.  The main limitation of this kind of genetic modification is that, in an adult, there are trillions of cells in our bodies. Modifying all of them is quite a task! Gene therapy usually utilizes viruses to deliver the genetic material to the desired cells or tissues. While creating viruses specific to certain cells is possible, and likely to be perfected in the near future, the need to do so is still a major impediment. The best way around it is to start from a single cell. Modifying a single cell’s DNA is so much easier, so any really big modifications have to start from there.  When working on a single cell there’s practically no limit to how much DNA we can modify. And when I say no limit, I mean no limit; Dan Gibson’s team at the J. Craig Venter Institute created the first full synthetic genome just last year2. That means every single gene and sequence in that bacteria was synthesized in the lab. A far cry from doing the same in humans, perhaps, but there is nothing fundamentally different between the two. It’s just a matter of decoding the complexity of our much bigger genome. Our future super-soldiers will not carry genetic defects because we will modify their genomes while they are still one-cell embryos.  If that future is too far ahead for one’s taste, there are faster alternatives. As I said, modifying a single cell is relatively easy, but we can do a lot with a single cell. Gene therapy for leukaemia has been successfully performed that way. And there is tissue engineering for the next step in scale. How does a whole heart from a single cell sound? Because that’s what the researchers at the University of Minnesota have achieved4\" name=\"_ftnref3. Or what about printing new skin?4\" title=\"\">3. Or what about printing new skin?4.  Tissue engineering is advancing unbelievably fast, and genetically modified tissue engineering is being extensively tested today. If The Six Million Dollar Man was to be re-made today, Steve Austin would conceivably be able to use genetically modified engineered organs and body parts instead of inorganic implants.  How does that bode for the future super-soldier? Besides being free of genetic defects, the soldier of the future could have genetic modifications to keep him at peak condition even under very unfavourable conditions. It is possible to insert response elements in the DNA to activate specific genes in response to a chemical, for example. Take a pill, and stimulate the same biological response as spending four hours lifting weights in the gym.  War with bugs and test tubes  The biological warfare of the future could be carried out using fully genetically engineered bacteria and viruses. The soldiers would have modified immune systems to combat them, following models like the gene therapy that is rapidly advancing to combat AIDS5. This is not a new concept; Heinlein’s classical novel Sixth Column (a.k.a. The Day After Tomorrow) used a form of intelligent radiation that only affected a particular ethnic group. Ironically, adapting that “ethnic weapon” theme to genetic engineering, especially if there has been widespread genetic modification of the general population, makes it more plausible, not less.  Bioweapons are not limited to human warfare: herbicides discovered in the Second World War started a whole programme of herbicidal warfare. Whether the danger is biological agents or chemicals, genetically modified crops resistant to them may not be just an option in the future; they may be the only way to grow food in some possible war-ridden reality.  Chemical warfare that relies on genetically altered humans, in the same way genetically modified crops used today resist herbicides and pesticides, is another possibility. Chemical warfare nowadays is limited by the fact that even the attacker’s own troops have to carry and wear protective gear. The super-soldier’s skin could resist the effects of the blistering chemical, or his liver quickly process and degrade the poison in question. Harmful chemicals, and the genes that confer resistance to them, would develop in parallel. And it’s not so far from reality; if creating super-soldiers from embryos is too far a stretch, tissue engineering can do all that, it’s a matter of having the genes to do it. Are we going to end up seeing human parts being put together to create beings like the replicants of Blade Runner in the future?  Beyond the army  Super-soldiers and their genetic modification are all fine and dandy, but it is not a theme that really suggests much widespread use of genetics. Highly advanced technology like that is not very plausible if it is used more widely than in a specific “elite” group of humans.  Or is it?  Perhaps that notion may not sound so illogical if one considers the cost of, for example, sequencing one’s own genome fully. When the first draft of the human genome project was published in the late 20th century it was hailed as an achievement equal to the Manhattan Project. Nowadays one can sequence a whole genome for the price of a car6. And the next step in sequencing technology is already knocking at the doors, barely four years after the so-called “Next Generation Sequencing” that is used so cheaply today was first introduced. They promise full sequencing from a single DNA molecule for a thousand dollars by 2013.  Full sequencing from barely any DNA? It may sound familiar because it is what Michael Crichton used in his Jurassic Park novels to recover dinosaur DNA. Or it may sound familiar because it is being used today to sequence the genome of the Neandertal7 from fossils. Sometimes the line between fiction and reality is much narrower than we think.  What happens when getting a whole genome from a sliver of DNA is so cheap? Look at Gattaca or 1984. Embryo screening is being done today. The next step—the removal of all genetic defects – is plausible. Yet that could lead to xenophobia, segregation, or an excessively homogeneous gene pool. Suddenly those scenarios seem a lot more technically achievable.  Or, on a less grim note, protocols involving current massive sequencing technology are being studied as possible tools for border biosecurity. That’s right, mass scans for “unknown biological agents” at the borders are actually going to become a reality soon.  Beyond human  We need not be limited by the information that our own genomes carry. If one wants to be faster, there’s nothing like being as fast as a cheetah. Human-animal hybrids are a dream that has been with mankind for many thousands of years, and some experiments in that vein have sparked much controversy today8. Other limited uses, like transgenic mice carrying a particular human gene, are commonplace. Unfortunately (or fortunately, depending on one’s point of view), creating hybrids is not so simple.  Hybrid animals like the mule have been around for a long time. The list of hybrid animals on Wikipedia is surprisingly long. But underneath a hybrid animal lies the concept of genetic compatibility.  To create a viable hybrid, it is important for the genetic material of both species to be largely compatible. This means having practically the same genes for the same functions (with whatever slight variations they carry), and having the genes arranged in the DNA in a very similar way. Even then, viable hybrids from closely related species are often infertile, and species further away will simply not develop correctly. Dr. Moreau would be very hard pressed to create those hybrids of his with just some vanilla genetic engineering; he’d likely have to modify a whole host of genes and display a mastery of molecular biology far removed from our present knowledge.  That doesn’t mean we have no access to the attractive elements of their genome, but acquiring “feline agility,” like Jessica Alba in Dark Angel, is not something that can simply be done with a few genes; it is part of the bone and muscle structure of a cat, and one cannot introduce that kind of flexibility without, for example, compromising the ability to walk and run on two feet.  However, traits that do depend on a specific gene or well-defined structure are much more plausible. Antifreeze proteins are being introduced into genetically modified food products simply because their mere presence is enough to prevent damage from frost. Eagles have such sharp eyes because they have two fovea and a specialized structure called the pecten, which solves one of the problems of the human eye (having the blood vessels blur the image by being in front of the retina). One could conceive creating a human with that limited structure in the eye.  If that doesn’t work, transplanting a bird eye of appropriate size and shape into a human could. You would need to modify the bird’s genetics in a way similar to the xenotransplantation techniques used to treat diabetes9. Genetically modified animals for xenotransplantation led to intelligent pigs in Margaret Atwood’s Oryx and Crake, and monkeys in Robin Cook’s Chromosome 6. Science fiction or not, the race between animal organ transplants and tissue engineering is sure to be an interesting one, and the meeting of both creates a staggering world of possibilities.  Limited, well defined animal traits and structures are very much conceivable, one way or another. Regenerating limbs like a salamander does seems plausible. Lego genetics of the type seen in ancient literature—animals with the head of an eagle, claws of a lion, and so on—not so much. And becoming a man-spider hybrid due to being bitten by a genetically modified spider, having massive changes happen overnight, is pretty much out no matter how far genetics go.  Free plot ideas  While at the end of the day the accuracy of the science described in a work of fiction may be inconsequential, it is interesting just how far we readers will go to maintain our willing suspension of disbelief with just a few things done right. As I have shown, modern geneticists are making progress at such a staggering speed that some of the classic science fiction scenarios are beginning to become plausible with current technology. If you are a writer considering genetic engineering for your next work, take a little time to invite a molecular biologist to a drink or two and pick his brain. We don’t bite, we love speculating about science fiction, and many of us even like free drinks.  Footnotes:  2 - Scientists Create First Synthetic Bacterial Genome—Largest Chemically Defined Structure Synthesized In The Lab.  Roger Moraga was born in Spain, but bounced around the world from a young age without really settling anywhere. He is a Molecular Biologist and Bioinformatician, and has done a bit of just about everything during his ten years on the field: genomics, proteomics, phylogenetics, programming... He's a part-time writer, favoring short stories and scientific writing. No novels... Yet! But he's always cooking something. His favorite author is Jules Verne.", "text": "Non-Fiction\nModern Genetics in the World of Fiction\n“Nowadays, many modern remakes of classic superheroes have gone for the latest superscience — Genetic Engineering. Be it a bite from a genetically engineered spider, or exposure to it in a freak accident, genetically engineered origins are the Phlebotinum for the 21st century.”\n—TvTropes.org: “Genetic Engineering Is The New Nuke”\nFrom man-eating dinosaurs to gene-enhanced super-soldiers, the wonders of modern genetics surround us in the world of fiction. This is hardly surprising: the mainstream media is constantly reporting breathlessly about the latest feats of genetic engineering performed by researchers. Looking at these developments through the eyes of a science fiction writer, one can’t help but gaze greedily at the countless possibilities.\nMost of the time there is a certain amount of unrealistic superscience involved in the creation of speculative fiction, but as a geneticist I can’t help but wonder if it is really necessary to trample all over what we do know about genetics to make it happen. Ultimately it is up to the creator to decide how much, and how soon, to depart from “real” Science, but before long it may not be necessary to depart much at all. A more in-depth look at what genetic engineering is doing today may be enough to make one’s imagination run wild.\nHow our genes work\nModern genetics developed in the 20th century after the work of Gregor Mendel on inheritance in pea plants, and became a major field of study. A look at the list of Nobel Prize winners shows a number of works on genetics receiving this award, the latest being this year with Ramakrishnan, Steitz, and Yonah honored for their work on the structure and function of the ribosome, a key component of the gene expression machinery. What have we learned since then?\nAt the basic level, our genes work in a way not too dissimilar to that of a modern computer. Information is stored in our DNA (which stands for deoxyribonucleic acid), a macromolecule which is composed of four types of smaller molecules chained together, in the same way bits are stored together in the hard drive of a computer. A computer bit has two possible values, whereas a DNA base (the equivalent of a “bit”) has four possible values.\nDNA contains our genes. Each gene is a discrete piece of self-contained DNA, a program in our hard drive, if you will. When a gene is needed, it is copied into a second molecule called RNA (ribonucleic acid, similar to DNA, just slightly different chemically), and the copy is used to create proteins.\nProteins are what carry out the lion’s share of chemical reactions in our bodies. When muscles flex, it is proteins doing the work. When we digest food, it is proteins breaking down the nutrients. The structures of our bodies, such as our ears or tendons, are made with proteins. Even bones have a matrix composed of proteins to support the inorganic crystalline parts of them.\nFinally, all these elements interact with each other in an organized but very, very complex way. Genes regulate other genes, proteins modify RNA or even DNA, or other proteins, or a whole host of them. We are a gigantic network of very complex interactions between all our genes, their products, and the environment.\nGiven how much is encoded in our DNA, and how all life carries genetic information in a similar fashion, the possibilities that spring to mind after assuming one can decode said information, and subsequently modify it, are practically unlimited. How would the humans of the future look if genetics were allowed to run rampant?\nEnter the Super-Soldier\nOne of the possible answers is the super-soldier. From Captain America to the Sardaukar of Dune, to cite some of the best known examples, no science fiction story of warfare is ever complete without these brave men and women who surpass some or all of our human limitations.\nThe first step in building a super-soldier is surely to remove genetic defects and select the best combination possible of human genes. That’s something that is already happening today. The list of genetic variations that predispose for this or that disease (which links directly to the function of the gene) is constantly growing, and gene therapy to correct those problems is advancing at a fantastic pace. The idea is simple: take a “correct” copy of that gene, swap it with the “incorrect” one, and watch the fireworks. Therapies for many diseases, from Cancer to Parkinson’s disease1, are in the field today.\nThe main limitation of this kind of genetic modification is that, in an adult, there are trillions of cells in our bodies. Modifying all of them is quite a task! Gene therapy usually utilizes viruses to deliver the genetic material to the desired cells or tissues. While creating viruses specific to certain cells is possible, and likely to be perfected in the near future, the need to do so is still a major impediment. The best way around it is to start from a single cell. Modifying a single cell’s DNA is so much easier, so any really big modifications have to start from there.\nWhen working on a single cell there’s practically no limit to how much DNA we can modify. And when I say no limit, I mean no limit; Dan Gibson’s team at the J. Craig Venter Institute created the first full synthetic genome just last year2. That means every single gene and sequence in that bacteria was synthesized in the lab. A far cry from doing the same in humans, perhaps, but there is nothing fundamentally different between the two. It’s just a matter of decoding the complexity of our much bigger genome. Our future super-soldiers will not carry genetic defects because we will modify their genomes while they are still one-cell embryos.\nIf that future is too far ahead for one’s taste, there are faster alternatives. As I said, modifying a single cell is relatively easy, but we can do a lot with a single cell. Gene therapy for leukaemia has been successfully performed that way. And there is tissue engineering for the next step in scale. How does a whole heart from a single cell sound? Because that’s what the researchers at the University of Minnesota have achieved4\" name=\"_ftnref3. Or what about printing new skin?4\" title=\"\">3. Or what about printing new skin?4.\nTissue engineering is advancing unbelievably fast, and genetically modified tissue engineering is being extensively tested today. If The Six Million Dollar Man was to be re-made today, Steve Austin would conceivably be able to use genetically modified engineered organs and body parts instead of inorganic implants.\nHow does that bode for the future super-soldier? Besides being free of genetic defects, the soldier of the future could have genetic modifications to keep him at peak condition even under very unfavourable conditions. It is possible to insert response elements in the DNA to activate specific genes in response to a chemical, for example. Take a pill, and stimulate the same biological response as spending four hours lifting weights in the gym.\nWar with bugs and test tubes\nThe biological warfare of the future could be carried out using fully genetically engineered bacteria and viruses. The soldiers would have modified immune systems to combat them, following models like the gene therapy that is rapidly advancing to combat AIDS5. This is not a new concept; Heinlein’s classical novel Sixth Column (a.k.a. The Day After Tomorrow) used a form of intelligent radiation that only affected a particular ethnic group. Ironically, adapting that “ethnic weapon” theme to genetic engineering, especially if there has been widespread genetic modification of the general population, makes it more plausible, not less.\nBioweapons are not limited to human warfare: herbicides discovered in the Second World War started a whole programme of herbicidal warfare. Whether the danger is biological agents or chemicals, genetically modified crops resistant to them may not be just an option in the future; they may be the only way to grow food in some possible war-ridden reality.\nChemical warfare that relies on genetically altered humans, in the same way genetically modified crops used today resist herbicides and pesticides, is another possibility. Chemical warfare nowadays is limited by the fact that even the attacker’s own troops have to carry and wear protective gear. The super-soldier’s skin could resist the effects of the blistering chemical, or his liver quickly process and degrade the poison in question. Harmful chemicals, and the genes that confer resistance to them, would develop in parallel. And it’s not so far from reality; if creating super-soldiers from embryos is too far a stretch, tissue engineering can do all that, it’s a matter of having the genes to do it. Are we going to end up seeing human parts being put together to create beings like the replicants of Blade Runner in the future?\nBeyond the army\nSuper-soldiers and their genetic modification are all fine and dandy, but it is not a theme that really suggests much widespread use of genetics. Highly advanced technology like that is not very plausible if it is used more widely than in a specific “elite” group of humans.\nOr is it?\nPerhaps that notion may not sound so illogical if one considers the cost of, for example, sequencing one’s own genome fully. When the first draft of the human genome project was published in the late 20th century it was hailed as an achievement equal to the Manhattan Project. Nowadays one can sequence a whole genome for the price of a car6. And the next step in sequencing technology is already knocking at the doors, barely four years after the so-called “Next Generation Sequencing” that is used so cheaply today was first introduced. They promise full sequencing from a single DNA molecule for a thousand dollars by 2013.\nFull sequencing from barely any DNA? It may sound familiar because it is what Michael Crichton used in his Jurassic Park novels to recover dinosaur DNA. Or it may sound familiar because it is being used today to sequence the genome of the Neandertal7 from fossils. Sometimes the line between fiction and reality is much narrower than we think.\nWhat happens when getting a whole genome from a sliver of DNA is so cheap? Look at Gattaca or 1984. Embryo screening is being done today. The next step—the removal of all genetic defects – is plausible. Yet that could lead to xenophobia, segregation, or an excessively homogeneous gene pool. Suddenly those scenarios seem a lot more technically achievable.\nOr, on a less grim note, protocols involving current massive sequencing technology are being studied as possible tools for border biosecurity. That’s right, mass scans for “unknown biological agents” at the borders are actually going to become a reality soon.\nBeyond human\nWe need not be limited by the information that our own genomes carry. If one wants to be faster, there’s nothing like being as fast as a cheetah. Human-animal hybrids are a dream that has been with mankind for many thousands of years, and some experiments in that vein have sparked much controversy today8. Other limited uses, like transgenic mice carrying a particular human gene, are commonplace. Unfortunately (or fortunately, depending on one’s point of view), creating hybrids is not so simple.\nHybrid animals like the mule have been around for a long time. The list of hybrid animals on Wikipedia is surprisingly long. But underneath a hybrid animal lies the concept of genetic compatibility.\nTo create a viable hybrid, it is important for the genetic material of both species to be largely compatible. This means having practically the same genes for the same functions (with whatever slight variations they carry), and having the genes arranged in the DNA in a very similar way. Even then, viable hybrids from closely related species are often infertile, and species further away will simply not develop correctly. Dr. Moreau would be very hard pressed to create those hybrids of his with just some vanilla genetic engineering; he’d likely have to modify a whole host of genes and display a mastery of molecular biology far removed from our present knowledge.\nThat doesn’t mean we have no access to the attractive elements of their genome, but acquiring “feline agility,” like Jessica Alba in Dark Angel, is not something that can simply be done with a few genes; it is part of the bone and muscle structure of a cat, and one cannot introduce that kind of flexibility without, for example, compromising the ability to walk and run on two feet.\nHowever, traits that do depend on a specific gene or well-defined structure are much more plausible. Antifreeze proteins are being introduced into genetically modified food products simply because their mere presence is enough to prevent damage from frost. Eagles have such sharp eyes because they have two fovea and a specialized structure called the pecten, which solves one of the problems of the human eye (having the blood vessels blur the image by being in front of the retina). One could conceive creating a human with that limited structure in the eye.\nIf that doesn’t work, transplanting a bird eye of appropriate size and shape into a human could. You would need to modify the bird’s genetics in a way similar to the xenotransplantation techniques used to treat diabetes9. Genetically modified animals for xenotransplantation led to intelligent pigs in Margaret Atwood’s Oryx and Crake, and monkeys in Robin Cook’s Chromosome 6. Science fiction or not, the race between animal organ transplants and tissue engineering is sure to be an interesting one, and the meeting of both creates a staggering world of possibilities.\nLimited, well defined animal traits and structures are very much conceivable, one way or another. Regenerating limbs like a salamander does seems plausible. Lego genetics of the type seen in ancient literature—animals with the head of an eagle, claws of a lion, and so on—not so much. And becoming a man-spider hybrid due to being bitten by a genetically modified spider, having massive changes happen overnight, is pretty much out no matter how far genetics go.\nFree plot ideas\nWhile at the end of the day the accuracy of the science described in a work of fiction may be inconsequential, it is interesting just how far we readers will go to maintain our willing suspension of disbelief with just a few things done right. As I have shown, modern geneticists are making progress at such a staggering speed that some of the classic science fiction scenarios are beginning to become plausible with current technology. If you are a writer considering genetic engineering for your next work, take a little time to invite a molecular biologist to a drink or two and pick his brain. We don’t bite, we love speculating about science fiction, and many of us even like free drinks.\nFootnotes:\n2 - Scientists Create First Synthetic Bacterial Genome—Largest Chemically Defined Structure Synthesized In The Lab.\nRoger Moraga was born in Spain, but bounced around the world from a young age without really settling anywhere. He is a Molecular Biologist and Bioinformatician, and has done a bit of just about everything during his ten years on the field: genomics, proteomics, phylogenetics, programming... He's a part-time writer, favoring short stories and scientific writing. No novels... Yet! But he's always cooking something. His favorite author is Jules Verne.", "source": "https://clarkesworldmagazine.com/moraga_11_09/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Modern Genetics in the World of Fiction by Roger Moraga"}