{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Yoon Ha Lee", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "3o4HWwzFGKW6lrLudpQsWrnGgIw=", "id": null, "license": null, "comments": "", "raw_text": "4730 words, short story  The Contemporary Foxwife  Kanseun Ong was procrastinating on her end-of-term assignment by puzzling over a letter from her older father when the doorbell chimed. At first she didn’t react, even though correspondence from home—specifically from Older Father—was the last thing she wanted to deal with. Older Father was only fluent in their ancestral language, Na-ahn, which Kanseun spoke shakily and hardly read at all, and was a calligrapher as well; he liked to show off by sending her paper letters. He wrote every four weeks, if the dates were to be believed, although due to the vagaries of ship traffic the letters arrived more irregularly. The letters piled up in a box, the early ones forever unopened, and Kanseun felt both guilty and resentful on a regular basis. Her entire childhood her fathers had told her how important it was for her to perfect her Kestran, the unofficial official language of the Sasreth Alliance, so why subject her to this now that she was a student at Veroth station? Especially since Older Father knew she was only ever going to write back in Kestran?  The doorbell chimed again, more loudly. She’d programmed it to do that precisely because it irritated her. “Who is it?” she asked crossly.  “No one is present at the door,” the apartment’s watcher said in a distinctly bored voice. Had her roommate been messing with its personae again? Osthen-of-White Falcon, who would also be her best friend if only they would ever tidy up after themselves.  “No, really,” Kanseun said. Hadn’t she already had the talk with Osthen about how she needed quiet time this week to work on the concerto she had due? Not that she was working on it right now, but that was a detail. She should have known that Osthen had agreed too quickly, even if she’d all but agreed to pay them to meet up with their many loud friends elsewhere.  “No one is present at the door,” the watcher repeated, still bored.  Kanseun cursed and put the letter down, tucking it under a paperweight in the shape of a disgruntled turtle. (Her younger father had a thing for turtles.) “Show me what’s in front of the door,” she said. A prank? She might not be an engineering candidate like Osthen, but she was good at jiggering security, and anyone messing with her was in for a nasty surprise.  The monitor displayed nothing but—was that a flicker? A curlicue of shadows?  She got up and opened the door just to check. If Osthen’s fucking with me on another stupid dare, she thought, I’m going to throttle them. “No one is present at the door” my ass.  “Hello! Very pleased to make your acquaintance,” said the no-one-is-present-at-the-door. It looked and sounded remarkably like a gawky teenage boy with tawny skin, black hair falling past his shoulders. Spectacles garnished with little amber-colored crystals framed large, long-lashed eyes. Who on earth needed spectacles anymore? Unless it was a fashion trend elsewhere in the station. His russet dress, or gown, or whatever it was, looked like it had led a former life as a sack, except the sleeves had hems. For all that, the boy smelled sweetly of clover and damp grass and disintegrating pine needles. Plants that were in short supply on the station, although Kanseun was planetborn and recognized the scents.  The bespectacled no-one-is-present-at-the-door, undeterred by what Kanseun had hoped was her most forbidding expression, was still speaking: “Are you in need of a foxwife? I cook, do dishes, scrub floors”—who did any of that except as a hobby?—“arrange flowers, disarm bombs, perform minor surgery, and provide comfort and companionship.” She?—they?—radiated hopefulness at Kanseun.  “You’re a what?” Kanseun said intelligently, using Kestran’s alt form of the second person pronoun, acceptable either for actual alts, like her roommate, or when you had no clue whatsoever.  “I’m a boy foxwife,” the foxwife said helpfully.  “Sorry,” Kanseun said, chastened. Even if nothing in her previous experiences had prepared her for any type of foxwife.  “It’s all right,” he said, and dimpled at her.  It registered that he had said “foxwife” not in Kestran, but in Na-ahn. Kanseun remembered the word only because she had loved the animal spirit stories Older Father had told her as a child, in the early days before she went to school and lost the ability to say anything but Pass the sauce, please and How’s the weather? “Foxwife” rendered straightforwardly as “fox” plus “wife.” In all other regards, the foxwife was speaking a very polite form of Kestran. Too polite; it wasn’t as though an unproven artisan candidate merited it.  Why did this matter? The boy was clearly cracked. “Listen,” she said, trying not to talk down to him, “if you need Transient Services, they’re not on the university level, they’re on Level 18. You can get directions at any of the info kiosks.”  The foxwife had peered around her into the room and was eyeing Osthen’s couch—more accurately, the food wrappers on the couch—with interest. Was he hungry? “I can also tidy things and file papers and dust under couches,” he said.  “Hey,” Kanseun said, “the messy half of the room is not mine.” Too late she realized she was encouraging him, and she steeled herself to be more firm.  To her surprise, the foxwife drooped and said. “All right. Thank you for your time. I hope you lead a long life with many blessings!”  What? “Hey, wait,” Kanseun said. She was going to regret this, but she was noticing the smudges under his eyes, imperfectly concealed by cosmetics. Asking how long he’d been a transient—if, indeed, that was what he was—would be rude. Instead, she said, “Look, I’m not supposed to randomly take in more roommates, but why don’t you come in and have some tea, and we’ll figure out what to do.” At least Osthen wouldn’t mind; they were friendly to a fault.  She was getting more creative at procrastination, no doubt about it.  “I brew tea, too,” the foxwife said, brightening.  “Oh no you don’t,” Kanseun said. She wasn’t that much of a grouch. “You’re my guest. I’m providing the tea.” Where did he come from that people brewed their own tea or did the dishes? Was he one of those weird people who believed that tea perfection could only be achieved that way?  For that matter, filing papers? Too bad she couldn’t have him answer her letters for her, but that would be tacky. Maybe tomorrow she’d procrastinate some more by scribbling the usual vague persiflage about how well she was getting on with her roommate (more or less true), complaining about the everyday sameness of station weather (always good for a few sentences), and how hard she was working at her music studies (true except when he sent her letters).  The apartment’s watcher had picked up on her offer of tea. Two fragrant cups awaited her on a tray in the kitchen. She wasn’t entirely sanguine about leaving the foxwife alone in the living room, but she didn’t think he was dangerous, just a little out of touch with reality.  Kanseun emerged with the tray only to find the foxwife on his hands and knees, diligently picking up Osthen’s collection of hand-painted tradeship figurines and organizing them on the nearest available table. She gaped, then said, “You don’t need to do that. That’s my roommate’s mess. It’s their problem.”  “Oh, but I want to be useful!” the foxwife said.  Kanseun suppressed a sigh as she set the tray down. “Were you going door to door offering your, er, services for a long time?”  “Yes,” he said without elaborating.  How had he escaped having really bad things happen to him, wandering around like this? To say nothing of this being the most inefficient job-seeking method ever. “How many people did you talk to?”  The foxwife frowned and brought up one hand, then the other. Kanseun realized he was counting on his fingers. When he got to ten he stopped and tilted his head. “Lots?” he said. “More than two paws, anyway.”  Paws. Right. She was in over her head, but she’d promised tea. “Paws” wasn’t that much stranger than some of the slang going around the university anyway. “Here,” she said. “Sit down.” She indicated her side of the room, which included a chair that wasn’t obscured by a pile of game controllers. “What do I call you? I’m Kanseun Ong.”  He sipped the tea delicately. “I’m a foxwife,” he said with disarming happiness.  “Are you Norannin?” she asked. “You seem to speak a little of my ancestral language.”  “I don’t know,” he said. “I speak a little of everything! I like languages.”  So much for that. “Where do you come from?” She was being terribly direct considering they’d just met, but as long as he didn’t mind—  The foxwife considered the question. “I walked a lot,” he said finally. “I think I took some wrong turns, though.”  Walked? To a space station? Granted, Veroth wasn’t without its shabby underworld, but she couldn’t believe that someone wouldn’t have scooped up the foxwife before long. Transient Services prided itself on its thoroughness. “How long have you been on the station?”  By now the foxwife’s cup was half-empty. One of the watcher’s puppets came out to fill it up again. “Thank you,” the foxwife said, still politely.  “You’re welcome,” the watcher’s voice said warmly.  Kanseun blinked.  The foxwife sipped. “I got here”—the fingers again—“four days ago.”  Kanseun didn’t memorize the roster of ships incoming and outbound, but it was impossible to escape hearing about them. Like many shipclanners, Osthen couldn’t imagine not knowing these things. Thanks to Osthen, Kanseun knew that the only ship that had made port four days ago was the battle cruiser Marrow. Despite Osthen’s jokes about warclanners, she doubted that they would be so lax as to have allowed the foxwife to stow away.  She decided that the mystery was going to be someone else’s problem, and drained her cup in one long gulp. The watcher had given her lukewarm tea, overly sweetened, her preference.  “Osthen is at the door,” the watcher said. It had returned to boredom.  “Wonderful,” Kanseun said just as the door swooshed open and Osthen slouched through it. Today their hair was done up in looped braids tinted purple at the ends. “Osthen—”  She looked around. Where had the foxwife gone?  “Hey there,” Osthen said. “You missed a great party, by the way. Anyone call for me?”  “No, but—”  Interesting. There was a new table in the corner, polished red-black, exquisite in its sleekness. Kanseun had never seen it before. She tried not to be alarmed.  “Hang on,” she said to Osthen, who looked bemused. “You can come out now,” she called to the foxwife. “My roommate’s a slob, but they won’t hurt you. Their name is Osthen-of-White Falcon.”  Before Osthen had time to ask why she was addressing a table, the foxwife was sitting cross-legged on the floor where the table had been. He bounced to his feet and said, “Hello! I’m Kanseun’s new foxwife.” This time he rendered the word in Kestran. He bobbed a bow to Osthen.  Osthen grinned at Kanseun. “I knew you’d get laid sooner or later.”  “Excuse me,” Kanseun said, queasy on the foxwife’s behalf. Among other things, she wasn’t convinced that he understood the connotations of “wife.” And had Osthen really not noticed the transformation? “Do I look like I’ve just gotten laid?” Osthen opened their mouth and she hurried on. “He’s, uh, visiting until I can help him get settled.”  “Hello, foxwife,” Osthen said, their grin softening into a more genuine smile. “Stay as long as you need to, that’s what the couch is for. And don’t mind Kanseun, she’s always got a stick up her—”  “Oh, shut up,” Kanseun said.  “Anyway,” Osthen said without breaking stride, “I need to catch up on sleep. Later.” They drifted past her and the foxwife in a haze of musky perfume and into their room. A moment later the door shut definitely.  If only she, too, had the ability to fuck around all the time and still get perfect scores on everything. “Could you explain what is going on here?” she said to the foxwife, remembering the watcher’s No one is present at the door with ice-splash clarity.  “I’m very good at furniture,” the foxwife said. “Did you like it? I do vases, too, but I didn’t think it would harmonize with your design sense. My sister, now—my sister would have come up with a vase that worked. But I—” He stopped.  “It was a very nice table,” Kanseun said, so that she didn’t feel like she was kicking a child. She wanted to ask about the sister, but she sensed it was too early in their acquaintance. “Does this always happen around you? Why did I notice but Osthen didn’t?”  The foxwife said, with the air of someone explaining the obvious, “I’m your foxwife.” He picked up a broom from where it had been leaning against the wall, except Kanseun knew for a fact that there had been no broom there earlier, let alone one made of straw, and started sweeping.  “You don’t have to do that,” she said. “The watcher puppets that stuff.”  “I like sweeping,” the foxwife said placidly.  “Fine,” Kanseun said. “I am officially not dealing with any more of this stuff tonight. I am going back to my nice, sane concerto and figuring out what the hell I have to do to balance my percussion line so I can cough up the rest of this movement. You do what makes you happy.”  The foxwife’s gaze became anxious. “Is it bothering you?”  “Yes. No. Oh, do what makes you happy. I guess it’s no worse than meditation.”  He resumed sweeping.  “Right,” Kanseun said. She sat at her desk and stared at her score, willing it to cooperate.  She never did respond to the day’s letter, nor the one after that, even though she could feel Older Father’s disappointment radiating through the envelopes at her.  Facts about Kanseun’s foxwife, if not all foxwives:  His favorite food was jam. It didn’t matter what kind. Kanseun had expected him to eat something logically vulpine, such as eggs. He liked eggs too (any kind with runny yolks, including raw), but there was no denying how happy he looked when he sat on a stool in the kitchen and ate jam out of a little dish with a spoon. The first time she caught him eating it straight out of the jar, but fortunately he was amenable to changing his habits.  When he said he spoke a little of everything, he wasn’t kidding. After Kanseun handed in her concerto—2.6 hours ahead of deadline, plenty of time to spare—she gave Osthen permission to bring their friends over again. It didn’t take long for Osthen to schedule more parties. Kanseun lectured the foxwife endlessly on appropriate behavior at parties, emphasizing that he was to say no to anything uncomfortable and to come get her if anyone got pushy. Osthen’s taste in friends wasn’t too unreasonable, but she worried.  Osthen’s friends, like Osthen, interacted genially enough with the foxwife when in his presence (and hers). However, they never seemed to remember him once they left the apartment, as Kanseun discovered when she ran into Osthen’s latest lover at one of the cafeterias. This applied even when Kanseun, in a fit of experimentation, brought the foxwife with her. The foxwife, for his part, was attentive to the points of etiquette that Kanseun had instructed him in, although she never got him to be less than effervescently polite.  Kanseun would have bought the foxwife some proper clothes. After the first day, however, he made this unnecessary by taking his fashion cues from Osthen. (Except for the spectacles. He always wore the spectacles.) She assumed that the lookalike designer clothes came from the same nowhere place as items like the broom. The one time she asked him about it, he attributed it to his superior organizational skills. How “organizational skills” accounted for the spontaneous generation of matter, she wasn’t sure, but as long as no one turned up looking for lost items she didn’t much care.  She came home once to find that he was beating wrinkles out of Osthen’s clothes, using wooden beaters and some kind of primitive board. It took days for her to explain the extent of the chores that he did not, in fact, have to do by hand. And afterward she would still catch him doing them, and have to drag him away until the next time.  The foxwife was very good at video games. He was especially fond of the ones with hyperrealistic gouts of blood, but she had to console him every time he failed a mission and one of the game allies died, even when she explained to him that the game was fictional and you could restore saved games and, occasionally, resurrect characters. He’d curl up against her shoulder and sob quietly, dabbing at his eyes with a red-and-white polka-dotted handkerchief, before trying again.  He also had a great disdain for tigers—he called them “amateurs”—but would not say why. It wasn’t as if the station housed anything as exotic or dangerous as tigers, and it only came up because Osthen mentioned the visiting dreadnought Tigertooth.  The one time Osthen managed to step on a stray nail in a bad way, the foxwife talked them into letting him remove the thing. Kanseun wasn’t sure how she resisted the temptation to find a bomb to see if the foxwife could disarm it. She hoped it never became relevant. Even so, she couldn’t escape the disquieting thought: where would he have acquired such a skill?  Another letter arrived. Kanseun immediately put it in the pile with the others before the foxwife could file it for her, and then wondered why she was so embarrassed at the thought of him catching her doing this. This one, too, went unread and unanswered.  The foxwife’s obsession with doing chores continued to bother Kanseun. She finally discussed the matter with Osthen.  “Do you think I should try to get him to talk to a counselor?” Kanseun said in a low voice. The foxwife was in the kitchen. She didn’t know how good his hearing was, so she’d turned up the entertainment system. It was currently playing some hot new null-gravity sport and she was trying not to watch. Sure, she’d undergone the necessary safety training upon moving here, but she was a stereotypical planetsider and she liked gravity.  “I don’t mind him living here,” Osthen said. They didn’t look up from the miniature they were painting. “I mean, it’s not like he takes up more space than my junk does. He fits nicely on the couch at night. And he seems happy, doesn’t he?”  There was a certain degree of unreality to any conversation about the foxwife, given Osthen’s on-off ability to remember his existence.  “But don’t you think he deserves better?” Kanseun said.  “Better according to who?” Osthen retorted. “If this is so important to you, why aren’t you discussing it with him? Find out what he wants for himself?”  She couldn’t think of any noncondescending way to say Because I don’t think he’s healthy enough to decide for himself.  “Is it because you think he’s mentally tilted?” they said. She’d forgotten that Osthen, for all their laziness, could be good at reading people when they wanted to. Even if that was why she was asking their advice in the first place. “Because it’s still his life and still his say. Unless you’re planning to break up with him over it.”  Kanseun gritted her teeth. “We’re not dating. It’s not my fault he goes around calling himself a foxwife.”  Osthen did look up then, and their eyes were sharp and not a little disappointed. “If he calls himself a foxwife, he is a foxwife.”  “Not literally he isn’t.” Inexplicable abilities, yes. But he couldn’t be a mythological figure. He was real.  They shrugged and dabbed their brush into the pot of steel-blue paint. “So? You’re still talking to the wrong person.”  “You’re no help,” Kanseun snapped, and regretted it immediately.  Osthen had gone into “there’s no reasoning with you” mode and had returned their attention to the miniature. She wasn’t going to get anything else out of them tonight, and it was all her damn fault.  She glanced toward the kitchen to see if the foxwife was still puttering around; froze. He was standing in the doorway, staring at her, red-and-white polka-dotted handkerchief scrunched up in his hand.  Kanseun opened her mouth.  The foxwife walked past her and out of the apartment.  She lunged after him; of course she did. But no sooner had she reached out to grab his shoulder than he wasn’t there. She almost fell over. What else had she expected from someone who could turn himself into a table?  “Did you see where he went?” Kanseun said to Osthen.  “He who?” Osthen said.  Her heart turned to needles. “I have to look for him,” she said reflexively, and all but ran out the door herself.  Kanseun spent the rest of the day and most of the night searching the station. She stopped by one of the ubiquitous kiosks, asking after someone of the foxwife’s description, although it came as no surprise that the kiosk said, patiently, that no such person had asked for help. There was no sign of him at any of the cheap cafes or restaurants she had taken him to before, or even some of the ones they’d never gone to together.  Reasoning (hoping, more likely) that he would stick to the university level, she returned there and began knocking on doors. Not everyone answered, but those who did were unfailingly polite in their demurrals, which she took as a side-effect of the foxwife’s unchanciness. No, they hadn’t seen the boy she was looking for. In fact, they’d never seen anyone like that at all. And who wore spectacles these days, anyway?  Wrung out, eyes stinging, she finally conceded defeat at four in the morning. She’d go out tomorrow and try again. Osthen had already gone to bed. She looked around at the jacket that Osthen had kicked into a corner and went to pick it up and fold it away, even though she never picked up after her roommate. Then she sat down on the couch. Her head started to pound, and it took a long time for sleep to come.  The next morning—more like very early afternoon, since she wasn’t used to having her sleep this messed up—Kanseun went to the kitchen to look at the teas directly because the watcher’s voice aggravated her lingering headache and she didn’t want it to enumerate all the options. She found the foxwife in the kitchen, eating ginger peach jam directly out of the jar.  Kanseun didn’t lecture him about it.  The foxwife didn’t say anything at all.  She pulled up a stool and sat next to him, watching him eat. The spoon wasn’t one of hers.  After a moment, he produced another one and offered it to her. Kanseun accepted it gravely. It was beautiful: made of some beaten bronzy metal, maybe even actual bronze. There was a little curled fox engraved on the handle.  The foxwife held out the jar. Kanseun dipped the spoon in and had a mouthful of jam. It tasted delicious, like honed sunlight.  They finished the jam together, in companionable silence.  Two weeks and one day after that, the latest letter arrived for Kanseun. More specifically, it arrived while she and the foxwife were out for a walk. When they returned, the watcher said, “You have correspondence from your older father.” Today its voice was bright, Osthen’s latest fancy. “I have left it on your desk.”  Kanseun had been in a good mood, which evaporated when she realized how long she had been avoiding the letters. “Great,” she said, and made no move toward her desk.  The foxwife’s organizational instincts had been triggered, however, and he went to pick it up. “Shall I open it for you?” he asked.  “Go ahead,” she said with a sigh. “I’m impressed Older Father even bothers when I’m such a lousy correspondent.”  The foxwife produced a letter opener, although he could have used the one she kept on her desk, and slit the envelope open. He held it up and looked intently at it. She thought he was admiring the calligraphy—Older Father did beautiful work, elegant rhythmic strokes, even if she struggled to decipher it—until he said, “It says there’s been a lot of rain in the city, and are you studying hard still, and—”  “You can read this?” Kanseun said. She didn’t know why she was so surprised, given the foxwife’s proven facility with languages. Maybe it was the fact that he was holding the letter sideways.  Nevertheless, he started reading: “‘On this 23rd of 11-month in the year 4297 of the Azalea Cycle’—”  “Wait, wait, wait,” she said. “I thought you didn’t do numbers.” She hadn’t meant it to come out like a put-down.  “4297 comes after 4296 and before 4298,” the foxwife said. Misinterpreting her confusion, he added, with a hint of dismay, “If you want me to do all the numbers in between 4296 and 4297, and 4297 and 4298, we’re going to be here a long time. As in infinitely long . . . ”  “Remember when we first met,” Kanseun said slowly, “and I asked how many people, and—?” She held out her hands the way he had. Thought of the foxwife holding up his fingers one by one.  “Yes,” he said, and looked away. “I stopped counting after ten thousand or so.”  Ten thousand. Kanseun swallowed. “How long have you been doing this?”  “A very long time,” the foxwife said. He took off his spectacles and tapped the frame, a nervous tic she had never seen before. His eyes had gone sad and dark. “I’m the last of my litter. There were more of us once. I wasn’t—I’m not a good foxwife. The sister who raised me was a very proper foxwife. According to the family stories, she seduced queens and investment bankers and fighter pilots, and she collected eggs made of gold wire and glass, and she insisted that I learn mathematics so I wouldn’t get cheated in the stock market.  “She told me once that being a foxwife is all about shapeshifting. I tried to do as she said, but we got separated when we started following our humans off the origin world. I’m only good at things like tables and vases and fountain pens, not the kinds of shapeshifting that matter.”  He lifted his chin and put the spectacles back on. “But there’s no help for it,” he said. This time his bright tone didn’t fool her. “I have to do what I can to be useful in the world as it exists, that’s all.”  Kanseun regarded him intently. “Listen,” she said. “How much of my language do you read?”  “All of it, I expect,” the foxwife said unboastfully. “My family believed in the value of a good education.”  “Do you write it too?”  He was smiling at her. “Yes,” he said. “Yes.”  “Teach me,” Kanseun said. “I won’t pretend I’m good at languages, but if I work at it and you’re patient with me, I might pick something up.” The next words came out in a rush: “Older Father used to tell me fox stories, shapechanger stories. I don’t know if they’re about your people, or about something else. But I could—I could ask him. Maybe he would know something.” Maybe even something that would help the foxwife find his sister. “Of course, if I wait until I know enough Na-ahn to formulate the question, it could be a while, so I should just ask in Kestran—”  She’d been avoiding Older Father’s letters for months now. What if he said something reproving, or worse, simply forgave her? What if he didn’t remember the fox stories at all? What if, what if, what if. But she looked at the foxwife and thought, Ten thousand doors. I can try, too.  “I’m sure he would be happy to hear from you either way,” the foxwife said. “But we can start the lessons whenever you want.”  “Today,” Kanseun said. “Let’s start today.” Yoon Ha Lee's works have appeared in Lightspeed, Tor.com, Beneath Ceaseless Skies, and The Magazine of Fantasy and Science Fiction. His collection Conservation of Shadows came out in 2013 from Prime Books. Currently he lives in Louisiana with his family and has not yet been eaten by gators.", "text": "4730 words, short story\nThe Contemporary Foxwife\nKanseun Ong was procrastinating on her end-of-term assignment by puzzling over a letter from her older father when the doorbell chimed. At first she didn’t react, even though correspondence from home—specifically from Older Father—was the last thing she wanted to deal with. Older Father was only fluent in their ancestral language, Na-ahn, which Kanseun spoke shakily and hardly read at all, and was a calligrapher as well; he liked to show off by sending her paper letters. He wrote every four weeks, if the dates were to be believed, although due to the vagaries of ship traffic the letters arrived more irregularly. The letters piled up in a box, the early ones forever unopened, and Kanseun felt both guilty and resentful on a regular basis. Her entire childhood her fathers had told her how important it was for her to perfect her Kestran, the unofficial official language of the Sasreth Alliance, so why subject her to this now that she was a student at Veroth station? Especially since Older Father knew she was only ever going to write back in Kestran?\nThe doorbell chimed again, more loudly. She’d programmed it to do that precisely because it irritated her. “Who is it?” she asked crossly.\n“No one is present at the door,” the apartment’s watcher said in a distinctly bored voice. Had her roommate been messing with its personae again? Osthen-of-White Falcon, who would also be her best friend if only they would ever tidy up after themselves.\n“No, really,” Kanseun said. Hadn’t she already had the talk with Osthen about how she needed quiet time this week to work on the concerto she had due? Not that she was working on it right now, but that was a detail. She should have known that Osthen had agreed too quickly, even if she’d all but agreed to pay them to meet up with their many loud friends elsewhere.\n“No one is present at the door,” the watcher repeated, still bored.\nKanseun cursed and put the letter down, tucking it under a paperweight in the shape of a disgruntled turtle. (Her younger father had a thing for turtles.) “Show me what’s in front of the door,” she said. A prank? She might not be an engineering candidate like Osthen, but she was good at jiggering security, and anyone messing with her was in for a nasty surprise.\nThe monitor displayed nothing but—was that a flicker? A curlicue of shadows?\nShe got up and opened the door just to check. If Osthen’s fucking with me on another stupid dare, she thought, I’m going to throttle them. “No one is present at the door” my ass.\n“Hello! Very pleased to make your acquaintance,” said the no-one-is-present-at-the-door. It looked and sounded remarkably like a gawky teenage boy with tawny skin, black hair falling past his shoulders. Spectacles garnished with little amber-colored crystals framed large, long-lashed eyes. Who on earth needed spectacles anymore? Unless it was a fashion trend elsewhere in the station. His russet dress, or gown, or whatever it was, looked like it had led a former life as a sack, except the sleeves had hems. For all that, the boy smelled sweetly of clover and damp grass and disintegrating pine needles. Plants that were in short supply on the station, although Kanseun was planetborn and recognized the scents.\nThe bespectacled no-one-is-present-at-the-door, undeterred by what Kanseun had hoped was her most forbidding expression, was still speaking: “Are you in need of a foxwife? I cook, do dishes, scrub floors”—who did any of that except as a hobby?—“arrange flowers, disarm bombs, perform minor surgery, and provide comfort and companionship.” She?—they?—radiated hopefulness at Kanseun.\n“You’re a what?” Kanseun said intelligently, using Kestran’s alt form of the second person pronoun, acceptable either for actual alts, like her roommate, or when you had no clue whatsoever.\n“I’m a boy foxwife,” the foxwife said helpfully.\n“Sorry,” Kanseun said, chastened. Even if nothing in her previous experiences had prepared her for any type of foxwife.\n“It’s all right,” he said, and dimpled at her.\nIt registered that he had said “foxwife” not in Kestran, but in Na-ahn. Kanseun remembered the word only because she had loved the animal spirit stories Older Father had told her as a child, in the early days before she went to school and lost the ability to say anything but Pass the sauce, please and How’s the weather? “Foxwife” rendered straightforwardly as “fox” plus “wife.” In all other regards, the foxwife was speaking a very polite form of Kestran. Too polite; it wasn’t as though an unproven artisan candidate merited it.\nWhy did this matter? The boy was clearly cracked. “Listen,” she said, trying not to talk down to him, “if you need Transient Services, they’re not on the university level, they’re on Level 18. You can get directions at any of the info kiosks.”\nThe foxwife had peered around her into the room and was eyeing Osthen’s couch—more accurately, the food wrappers on the couch—with interest. Was he hungry? “I can also tidy things and file papers and dust under couches,” he said.\n“Hey,” Kanseun said, “the messy half of the room is not mine.” Too late she realized she was encouraging him, and she steeled herself to be more firm.\nTo her surprise, the foxwife drooped and said. “All right. Thank you for your time. I hope you lead a long life with many blessings!”\nWhat? “Hey, wait,” Kanseun said. She was going to regret this, but she was noticing the smudges under his eyes, imperfectly concealed by cosmetics. Asking how long he’d been a transient—if, indeed, that was what he was—would be rude. Instead, she said, “Look, I’m not supposed to randomly take in more roommates, but why don’t you come in and have some tea, and we’ll figure out what to do.” At least Osthen wouldn’t mind; they were friendly to a fault.\nShe was getting more creative at procrastination, no doubt about it.\n“I brew tea, too,” the foxwife said, brightening.\n“Oh no you don’t,” Kanseun said. She wasn’t that much of a grouch. “You’re my guest. I’m providing the tea.” Where did he come from that people brewed their own tea or did the dishes? Was he one of those weird people who believed that tea perfection could only be achieved that way?\nFor that matter, filing papers? Too bad she couldn’t have him answer her letters for her, but that would be tacky. Maybe tomorrow she’d procrastinate some more by scribbling the usual vague persiflage about how well she was getting on with her roommate (more or less true), complaining about the everyday sameness of station weather (always good for a few sentences), and how hard she was working at her music studies (true except when he sent her letters).\nThe apartment’s watcher had picked up on her offer of tea. Two fragrant cups awaited her on a tray in the kitchen. She wasn’t entirely sanguine about leaving the foxwife alone in the living room, but she didn’t think he was dangerous, just a little out of touch with reality.\nKanseun emerged with the tray only to find the foxwife on his hands and knees, diligently picking up Osthen’s collection of hand-painted tradeship figurines and organizing them on the nearest available table. She gaped, then said, “You don’t need to do that. That’s my roommate’s mess. It’s their problem.”\n“Oh, but I want to be useful!” the foxwife said.\nKanseun suppressed a sigh as she set the tray down. “Were you going door to door offering your, er, services for a long time?”\n“Yes,” he said without elaborating.\nHow had he escaped having really bad things happen to him, wandering around like this? To say nothing of this being the most inefficient job-seeking method ever. “How many people did you talk to?”\nThe foxwife frowned and brought up one hand, then the other. Kanseun realized he was counting on his fingers. When he got to ten he stopped and tilted his head. “Lots?” he said. “More than two paws, anyway.”\nPaws. Right. She was in over her head, but she’d promised tea. “Paws” wasn’t that much stranger than some of the slang going around the university anyway. “Here,” she said. “Sit down.” She indicated her side of the room, which included a chair that wasn’t obscured by a pile of game controllers. “What do I call you? I’m Kanseun Ong.”\nHe sipped the tea delicately. “I’m a foxwife,” he said with disarming happiness.\n“Are you Norannin?” she asked. “You seem to speak a little of my ancestral language.”\n“I don’t know,” he said. “I speak a little of everything! I like languages.”\nSo much for that. “Where do you come from?” She was being terribly direct considering they’d just met, but as long as he didn’t mind—\nThe foxwife considered the question. “I walked a lot,” he said finally. “I think I took some wrong turns, though.”\nWalked? To a space station? Granted, Veroth wasn’t without its shabby underworld, but she couldn’t believe that someone wouldn’t have scooped up the foxwife before long. Transient Services prided itself on its thoroughness. “How long have you been on the station?”\nBy now the foxwife’s cup was half-empty. One of the watcher’s puppets came out to fill it up again. “Thank you,” the foxwife said, still politely.\n“You’re welcome,” the watcher’s voice said warmly.\nKanseun blinked.\nThe foxwife sipped. “I got here”—the fingers again—“four days ago.”\nKanseun didn’t memorize the roster of ships incoming and outbound, but it was impossible to escape hearing about them. Like many shipclanners, Osthen couldn’t imagine not knowing these things. Thanks to Osthen, Kanseun knew that the only ship that had made port four days ago was the battle cruiser Marrow. Despite Osthen’s jokes about warclanners, she doubted that they would be so lax as to have allowed the foxwife to stow away.\nShe decided that the mystery was going to be someone else’s problem, and drained her cup in one long gulp. The watcher had given her lukewarm tea, overly sweetened, her preference.\n“Osthen is at the door,” the watcher said. It had returned to boredom.\n“Wonderful,” Kanseun said just as the door swooshed open and Osthen slouched through it. Today their hair was done up in looped braids tinted purple at the ends. “Osthen—”\nShe looked around. Where had the foxwife gone?\n“Hey there,” Osthen said. “You missed a great party, by the way. Anyone call for me?”\n“No, but—”\nInteresting. There was a new table in the corner, polished red-black, exquisite in its sleekness. Kanseun had never seen it before. She tried not to be alarmed.\n“Hang on,” she said to Osthen, who looked bemused. “You can come out now,” she called to the foxwife. “My roommate’s a slob, but they won’t hurt you. Their name is Osthen-of-White Falcon.”\nBefore Osthen had time to ask why she was addressing a table, the foxwife was sitting cross-legged on the floor where the table had been. He bounced to his feet and said, “Hello! I’m Kanseun’s new foxwife.” This time he rendered the word in Kestran. He bobbed a bow to Osthen.\nOsthen grinned at Kanseun. “I knew you’d get laid sooner or later.”\n“Excuse me,” Kanseun said, queasy on the foxwife’s behalf. Among other things, she wasn’t convinced that he understood the connotations of “wife.” And had Osthen really not noticed the transformation? “Do I look like I’ve just gotten laid?” Osthen opened their mouth and she hurried on. “He’s, uh, visiting until I can help him get settled.”\n“Hello, foxwife,” Osthen said, their grin softening into a more genuine smile. “Stay as long as you need to, that’s what the couch is for. And don’t mind Kanseun, she’s always got a stick up her—”\n“Oh, shut up,” Kanseun said.\n“Anyway,” Osthen said without breaking stride, “I need to catch up on sleep. Later.” They drifted past her and the foxwife in a haze of musky perfume and into their room. A moment later the door shut definitely.\nIf only she, too, had the ability to fuck around all the time and still get perfect scores on everything. “Could you explain what is going on here?” she said to the foxwife, remembering the watcher’s No one is present at the door with ice-splash clarity.\n“I’m very good at furniture,” the foxwife said. “Did you like it? I do vases, too, but I didn’t think it would harmonize with your design sense. My sister, now—my sister would have come up with a vase that worked. But I—” He stopped.\n“It was a very nice table,” Kanseun said, so that she didn’t feel like she was kicking a child. She wanted to ask about the sister, but she sensed it was too early in their acquaintance. “Does this always happen around you? Why did I notice but Osthen didn’t?”\nThe foxwife said, with the air of someone explaining the obvious, “I’m your foxwife.” He picked up a broom from where it had been leaning against the wall, except Kanseun knew for a fact that there had been no broom there earlier, let alone one made of straw, and started sweeping.\n“You don’t have to do that,” she said. “The watcher puppets that stuff.”\n“I like sweeping,” the foxwife said placidly.\n“Fine,” Kanseun said. “I am officially not dealing with any more of this stuff tonight. I am going back to my nice, sane concerto and figuring out what the hell I have to do to balance my percussion line so I can cough up the rest of this movement. You do what makes you happy.”\nThe foxwife’s gaze became anxious. “Is it bothering you?”\n“Yes. No. Oh, do what makes you happy. I guess it’s no worse than meditation.”\nHe resumed sweeping.\n“Right,” Kanseun said. She sat at her desk and stared at her score, willing it to cooperate.\nShe never did respond to the day’s letter, nor the one after that, even though she could feel Older Father’s disappointment radiating through the envelopes at her.\nFacts about Kanseun’s foxwife, if not all foxwives:\nHis favorite food was jam. It didn’t matter what kind. Kanseun had expected him to eat something logically vulpine, such as eggs. He liked eggs too (any kind with runny yolks, including raw), but there was no denying how happy he looked when he sat on a stool in the kitchen and ate jam out of a little dish with a spoon. The first time she caught him eating it straight out of the jar, but fortunately he was amenable to changing his habits.\nWhen he said he spoke a little of everything, he wasn’t kidding. After Kanseun handed in her concerto—2.6 hours ahead of deadline, plenty of time to spare—she gave Osthen permission to bring their friends over again. It didn’t take long for Osthen to schedule more parties. Kanseun lectured the foxwife endlessly on appropriate behavior at parties, emphasizing that he was to say no to anything uncomfortable and to come get her if anyone got pushy. Osthen’s taste in friends wasn’t too unreasonable, but she worried.\nOsthen’s friends, like Osthen, interacted genially enough with the foxwife when in his presence (and hers). However, they never seemed to remember him once they left the apartment, as Kanseun discovered when she ran into Osthen’s latest lover at one of the cafeterias. This applied even when Kanseun, in a fit of experimentation, brought the foxwife with her. The foxwife, for his part, was attentive to the points of etiquette that Kanseun had instructed him in, although she never got him to be less than effervescently polite.\nKanseun would have bought the foxwife some proper clothes. After the first day, however, he made this unnecessary by taking his fashion cues from Osthen. (Except for the spectacles. He always wore the spectacles.) She assumed that the lookalike designer clothes came from the same nowhere place as items like the broom. The one time she asked him about it, he attributed it to his superior organizational skills. How “organizational skills” accounted for the spontaneous generation of matter, she wasn’t sure, but as long as no one turned up looking for lost items she didn’t much care.\nShe came home once to find that he was beating wrinkles out of Osthen’s clothes, using wooden beaters and some kind of primitive board. It took days for her to explain the extent of the chores that he did not, in fact, have to do by hand. And afterward she would still catch him doing them, and have to drag him away until the next time.\nThe foxwife was very good at video games. He was especially fond of the ones with hyperrealistic gouts of blood, but she had to console him every time he failed a mission and one of the game allies died, even when she explained to him that the game was fictional and you could restore saved games and, occasionally, resurrect characters. He’d curl up against her shoulder and sob quietly, dabbing at his eyes with a red-and-white polka-dotted handkerchief, before trying again.\nHe also had a great disdain for tigers—he called them “amateurs”—but would not say why. It wasn’t as if the station housed anything as exotic or dangerous as tigers, and it only came up because Osthen mentioned the visiting dreadnought Tigertooth.\nThe one time Osthen managed to step on a stray nail in a bad way, the foxwife talked them into letting him remove the thing. Kanseun wasn’t sure how she resisted the temptation to find a bomb to see if the foxwife could disarm it. She hoped it never became relevant. Even so, she couldn’t escape the disquieting thought: where would he have acquired such a skill?\nAnother letter arrived. Kanseun immediately put it in the pile with the others before the foxwife could file it for her, and then wondered why she was so embarrassed at the thought of him catching her doing this. This one, too, went unread and unanswered.\nThe foxwife’s obsession with doing chores continued to bother Kanseun. She finally discussed the matter with Osthen.\n“Do you think I should try to get him to talk to a counselor?” Kanseun said in a low voice. The foxwife was in the kitchen. She didn’t know how good his hearing was, so she’d turned up the entertainment system. It was currently playing some hot new null-gravity sport and she was trying not to watch. Sure, she’d undergone the necessary safety training upon moving here, but she was a stereotypical planetsider and she liked gravity.\n“I don’t mind him living here,” Osthen said. They didn’t look up from the miniature they were painting. “I mean, it’s not like he takes up more space than my junk does. He fits nicely on the couch at night. And he seems happy, doesn’t he?”\nThere was a certain degree of unreality to any conversation about the foxwife, given Osthen’s on-off ability to remember his existence.\n“But don’t you think he deserves better?” Kanseun said.\n“Better according to who?” Osthen retorted. “If this is so important to you, why aren’t you discussing it with him? Find out what he wants for himself?”\nShe couldn’t think of any noncondescending way to say Because I don’t think he’s healthy enough to decide for himself.\n“Is it because you think he’s mentally tilted?” they said. She’d forgotten that Osthen, for all their laziness, could be good at reading people when they wanted to. Even if that was why she was asking their advice in the first place. “Because it’s still his life and still his say. Unless you’re planning to break up with him over it.”\nKanseun gritted her teeth. “We’re not dating. It’s not my fault he goes around calling himself a foxwife.”\nOsthen did look up then, and their eyes were sharp and not a little disappointed. “If he calls himself a foxwife, he is a foxwife.”\n“Not literally he isn’t.” Inexplicable abilities, yes. But he couldn’t be a mythological figure. He was real.\nThey shrugged and dabbed their brush into the pot of steel-blue paint. “So? You’re still talking to the wrong person.”\n“You’re no help,” Kanseun snapped, and regretted it immediately.\nOsthen had gone into “there’s no reasoning with you” mode and had returned their attention to the miniature. She wasn’t going to get anything else out of them tonight, and it was all her damn fault.\nShe glanced toward the kitchen to see if the foxwife was still puttering around; froze. He was standing in the doorway, staring at her, red-and-white polka-dotted handkerchief scrunched up in his hand.\nKanseun opened her mouth.\nThe foxwife walked past her and out of the apartment.\nShe lunged after him; of course she did. But no sooner had she reached out to grab his shoulder than he wasn’t there. She almost fell over. What else had she expected from someone who could turn himself into a table?\n“Did you see where he went?” Kanseun said to Osthen.\n“He who?” Osthen said.\nHer heart turned to needles. “I have to look for him,” she said reflexively, and all but ran out the door herself.\nKanseun spent the rest of the day and most of the night searching the station. She stopped by one of the ubiquitous kiosks, asking after someone of the foxwife’s description, although it came as no surprise that the kiosk said, patiently, that no such person had asked for help. There was no sign of him at any of the cheap cafes or restaurants she had taken him to before, or even some of the ones they’d never gone to together.\nReasoning (hoping, more likely) that he would stick to the university level, she returned there and began knocking on doors. Not everyone answered, but those who did were unfailingly polite in their demurrals, which she took as a side-effect of the foxwife’s unchanciness. No, they hadn’t seen the boy she was looking for. In fact, they’d never seen anyone like that at all. And who wore spectacles these days, anyway?\nWrung out, eyes stinging, she finally conceded defeat at four in the morning. She’d go out tomorrow and try again. Osthen had already gone to bed. She looked around at the jacket that Osthen had kicked into a corner and went to pick it up and fold it away, even though she never picked up after her roommate. Then she sat down on the couch. Her head started to pound, and it took a long time for sleep to come.\nThe next morning—more like very early afternoon, since she wasn’t used to having her sleep this messed up—Kanseun went to the kitchen to look at the teas directly because the watcher’s voice aggravated her lingering headache and she didn’t want it to enumerate all the options. She found the foxwife in the kitchen, eating ginger peach jam directly out of the jar.\nKanseun didn’t lecture him about it.\nThe foxwife didn’t say anything at all.\nShe pulled up a stool and sat next to him, watching him eat. The spoon wasn’t one of hers.\nAfter a moment, he produced another one and offered it to her. Kanseun accepted it gravely. It was beautiful: made of some beaten bronzy metal, maybe even actual bronze. There was a little curled fox engraved on the handle.\nThe foxwife held out the jar. Kanseun dipped the spoon in and had a mouthful of jam. It tasted delicious, like honed sunlight.\nThey finished the jam together, in companionable silence.\nTwo weeks and one day after that, the latest letter arrived for Kanseun. More specifically, it arrived while she and the foxwife were out for a walk. When they returned, the watcher said, “You have correspondence from your older father.” Today its voice was bright, Osthen’s latest fancy. “I have left it on your desk.”\nKanseun had been in a good mood, which evaporated when she realized how long she had been avoiding the letters. “Great,” she said, and made no move toward her desk.\nThe foxwife’s organizational instincts had been triggered, however, and he went to pick it up. “Shall I open it for you?” he asked.\n“Go ahead,” she said with a sigh. “I’m impressed Older Father even bothers when I’m such a lousy correspondent.”\nThe foxwife produced a letter opener, although he could have used the one she kept on her desk, and slit the envelope open. He held it up and looked intently at it. She thought he was admiring the calligraphy—Older Father did beautiful work, elegant rhythmic strokes, even if she struggled to decipher it—until he said, “It says there’s been a lot of rain in the city, and are you studying hard still, and—”\n“You can read this?” Kanseun said. She didn’t know why she was so surprised, given the foxwife’s proven facility with languages. Maybe it was the fact that he was holding the letter sideways.\nNevertheless, he started reading: “‘On this 23rd of 11-month in the year 4297 of the Azalea Cycle’—”\n“Wait, wait, wait,” she said. “I thought you didn’t do numbers.” She hadn’t meant it to come out like a put-down.\n“4297 comes after 4296 and before 4298,” the foxwife said. Misinterpreting her confusion, he added, with a hint of dismay, “If you want me to do all the numbers in between 4296 and 4297, and 4297 and 4298, we’re going to be here a long time. As in infinitely long . . . ”\n“Remember when we first met,” Kanseun said slowly, “and I asked how many people, and—?” She held out her hands the way he had. Thought of the foxwife holding up his fingers one by one.\n“Yes,” he said, and looked away. “I stopped counting after ten thousand or so.”\nTen thousand. Kanseun swallowed. “How long have you been doing this?”\n“A very long time,” the foxwife said. He took off his spectacles and tapped the frame, a nervous tic she had never seen before. His eyes had gone sad and dark. “I’m the last of my litter. There were more of us once. I wasn’t—I’m not a good foxwife. The sister who raised me was a very proper foxwife. According to the family stories, she seduced queens and investment bankers and fighter pilots, and she collected eggs made of gold wire and glass, and she insisted that I learn mathematics so I wouldn’t get cheated in the stock market.\n“She told me once that being a foxwife is all about shapeshifting. I tried to do as she said, but we got separated when we started following our humans off the origin world. I’m only good at things like tables and vases and fountain pens, not the kinds of shapeshifting that matter.”\nHe lifted his chin and put the spectacles back on. “But there’s no help for it,” he said. This time his bright tone didn’t fool her. “I have to do what I can to be useful in the world as it exists, that’s all.”\nKanseun regarded him intently. “Listen,” she said. “How much of my language do you read?”\n“All of it, I expect,” the foxwife said unboastfully. “My family believed in the value of a good education.”\n“Do you write it too?”\nHe was smiling at her. “Yes,” he said. “Yes.”\n“Teach me,” Kanseun said. “I won’t pretend I’m good at languages, but if I work at it and you’re patient with me, I might pick something up.” The next words came out in a rush: “Older Father used to tell me fox stories, shapechanger stories. I don’t know if they’re about your people, or about something else. But I could—I could ask him. Maybe he would know something.” Maybe even something that would help the foxwife find his sister. “Of course, if I wait until I know enough Na-ahn to formulate the question, it could be a while, so I should just ask in Kestran—”\nShe’d been avoiding Older Father’s letters for months now. What if he said something reproving, or worse, simply forgave her? What if he didn’t remember the fox stories at all? What if, what if, what if. But she looked at the foxwife and thought, Ten thousand doors. I can try, too.\n“I’m sure he would be happy to hear from you either way,” the foxwife said. “But we can start the lessons whenever you want.”\n“Today,” Kanseun said. “Let’s start today.”\nYoon Ha Lee's works have appeared in Lightspeed, Tor.com, Beneath Ceaseless Skies, and The Magazine of Fantasy and Science Fiction. His collection Conservation of Shadows came out in 2013 from Prime Books. Currently he lives in Louisiana with his family and has not yet been eaten by gators.", "source": "https://clarkesworldmagazine.com/lee_07_14/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: The Contemporary Foxwife by Yoon Ha Lee"}