{"title": "Clarkesworld Magazine - Science Fiction & Fantasy", "author": "Theodora Goss", "hostname": "clarkesworldmagazine.com", "date": "2022-01-01", "categories": "", "tags": "", "fingerprint": "f9qfJs6xFJ26lxBkmsbM5hLDGRo=", "id": null, "license": null, "comments": "", "raw_text": "1280 words, short story, REPRINT  Her Mother's Ghosts  Her name is Ilona. The other children at school call her Smellona. She is not me, but I have been her. Here are the things I remember most clearly:  She lives in a townhouse in Washington D.C. with her mother and younger brother, whose bangs are always cut crooked. It is the seventies. She and her brother wear clothes they will later call hideous in photographs, but now, today, they are not hideous, because brown is still a respectable color. They are playing under the cherry trees. The blossoms are everywhere, lying on the asphalt in heaps like pink snow.  In the kitchen drawer are silver spoons, smuggled in socks, the sleeves of pajamas. They are heavy, dulled with use. They are older than her mother, her grandmother. One is much worse for having slipped into the garbage disposal. In the kitchen cabinet are margarine tubs, more than ten, perhaps more than twenty, washed clean, ready in case the world runs out of margarine tubs. Don’t laugh. It could happen.  Since Ilona turned seven, she has been haunted by her mother’s ghosts. Once, late at night, she saw a train conductor coming out of the bathroom.  “Do you have your visa?” he asked her.  She shook her head. She was in a pink nightgown, and her feet were bare. The floor was cold.  “Then you can’t cross the border,” he said, looking down at her sternly. “You’ll have to get out here, and speak to the station master.”  She nodded. She really needed to go to the bathroom, but she was afraid that if she tried to slip past him, he would grab her. Then she would scream, and her mother would wake up. She would have to explain that she had had a nightmare. She could never tell her mother that she had seen her ghosts.  Once, when she was sitting at the kitchen table doing her homework, a man in a green plaid suit said to her, “You can’t go to medical school. You’re not qualified.”  She stared at his tie, which had a pattern of wheat sheaves and small tractors. His neck turned red. Above his mustache, his cheeks and nose also turned red.  “Why haven’t you joined the Party?” he asked with barely suppressed rage. She had not known that a question could sound so angry. She was afraid he was going to slap her.  After he disappeared, she could not think about her homework. Instead, she went out to the back garden and sat on the bricks, staring at the ivy that grew up the sides of the house. Sometimes sparrows built nests there, among the leaves, and in the mornings, especially, the ivy cheeped and stirred. Last spring, one of the stray cats had brought a baby sparrow in to breakfast and laid it down on the linoleum, like a gift.  At first she thought the stray cats were ghosts. They came in the evenings and sat on the bricks in the back garden. She would take them up to her bedroom. After they had stayed in her bedroom for three days, living on milk and chicken left over from the paprikás, they were allowed to stay.  Sometimes they disappeared as mysteriously as they had come. These, she decided, where ghost cats from the streets of Budapest. But others stayed, and during her childhood there were more and more cats, sitting on the sofa, scratching the legs of the dining room table, curling beside her when she slept at night, one on her feet, one at her side, one with his chin on her shoulder, purring into her ear. In the middle of the night, he liked to pull her hair with his claws. She would wake up, and that was when, more often than not, she would see the ghosts.  At first, she thought the voice on the telephone was a ghost. “Traitor!” it said. “We’re coming to take your children. Why did you leave your parents? They miss you, your husband misses you. We’ll put you in prison, with rats, and sewer water seeping over the floor!”  Soon after, they moved to the country. Her brother began a series of collections: stones from the streambed, insects, a selection of rusted nails. He kept them in shoe boxes, in his closet. The insects crawled out. Spiders began to spin webs in the corners of his room. Sometimes they would eat dinner with fireflies crawling over the ceiling. The stray cats kept leaving half-eaten caterpillars on the stairs.  More than once, Ilona saw her grandmother, an old woman with short gray hair and delicate wrists. As a girl, she had studied art. Later, she had been forbidden to sell her paintings. They arrived at holidays wrapped around boxes of chocolates. Her mother hung them in every room of the house, even the bathroom. If you stood close, you could still see creases where her mother had ironed the folds.  She always appeared as a thin wash, like one of her watercolors of the light over Lake Balaton. Through her, Ilona could see the banister, the dining room table, the swing hanging from an oak tree in the garden.  Once, she thought she saw her father standing by the oak tree. He was wearing a uniform, like the train conductor but with a red star on his cap. She thought he looked handsome, but he vanished quickly.  There is something I have forgotten to tell you. When she was twelve and still living in Washington D.C., day after day for a period of three months she saw tanks driving down the streets. On her way to school, on her way to the dentist. During these months, she could not sleep. She threw up everything but a slice of birthday cake at a party for a girl from school. She lost weight and developed dark circles under her eyes. Her mother took her to the doctor. She began to believe she was turning into a ghost.  You are angry with me. You say, this is not a story. It is merely a series of scenes, and of manufactured scenes at that. Your name is not Ilona. You never saw your mother’s ghosts.  And of course you are right. When Ilona was seventeen, her mother died of breast cancer. After that, she never saw ghosts. Her brother grew up to be a famous entomologist. He is now a professor at Harvard. She grew up to be a writer, but not of stories. She writes about art, and sometimes architecture. She would never write this story, so I am writing it for her.  My mother did not die. Last year, she finished law school. My brother, a computer programmer, went to her graduation. They live by the ocean in California, where it is always sunny.  I rarely see them. I am haunted by ghosts, invisible, impalpable: the ghosts of silver spoons and margarine tubs, the smell of paprikás cooking on Sunday afternoons. The ghost of a country.  Sometimes, in my Boston apartment, I see her: the ghost of my mother, walking along the hallway, running her fingers over the piano. I see her from the back, wearing a dress with light blue and white checks. She made us both dresses out of that fabric, in Brussels. Once, a policeman stopped to ask me, with a wink, if I liked taking walks with my older sister.  When I see her, she is always walking away from me. And her back tells me, some things you can’t understand, even by writing about them.  Originally published in: The Rose in Twelve Petals and Other Stories , Small Beer Press, 2004 Theodora Goss's publications include the short story collection In the Forest of Forgetting (2006); Interfictions (2007), a short story anthology coedited with Delia Sherman; Voices from Fairyland (2008), a poetry anthology with critical essays and a selection of her own poems; and The Thorn and the Blossom (2012), a novella in a two-sided accordion format. She has been a finalist for the Nebula, Crawford, Locus, and Mythopoeic Awards, and on the Tiptree Award Honor List. She has won the World Fantasy and Rhysling Awards.", "text": "1280 words, short story, REPRINT\nHer Mother's Ghosts\nHer name is Ilona. The other children at school call her Smellona. She is not me, but I have been her. Here are the things I remember most clearly:\nShe lives in a townhouse in Washington D.C. with her mother and younger brother, whose bangs are always cut crooked. It is the seventies. She and her brother wear clothes they will later call hideous in photographs, but now, today, they are not hideous, because brown is still a respectable color. They are playing under the cherry trees. The blossoms are everywhere, lying on the asphalt in heaps like pink snow.\nIn the kitchen drawer are silver spoons, smuggled in socks, the sleeves of pajamas. They are heavy, dulled with use. They are older than her mother, her grandmother. One is much worse for having slipped into the garbage disposal. In the kitchen cabinet are margarine tubs, more than ten, perhaps more than twenty, washed clean, ready in case the world runs out of margarine tubs. Don’t laugh. It could happen.\nSince Ilona turned seven, she has been haunted by her mother’s ghosts. Once, late at night, she saw a train conductor coming out of the bathroom.\n“Do you have your visa?” he asked her.\nShe shook her head. She was in a pink nightgown, and her feet were bare. The floor was cold.\n“Then you can’t cross the border,” he said, looking down at her sternly. “You’ll have to get out here, and speak to the station master.”\nShe nodded. She really needed to go to the bathroom, but she was afraid that if she tried to slip past him, he would grab her. Then she would scream, and her mother would wake up. She would have to explain that she had had a nightmare. She could never tell her mother that she had seen her ghosts.\nOnce, when she was sitting at the kitchen table doing her homework, a man in a green plaid suit said to her, “You can’t go to medical school. You’re not qualified.”\nShe stared at his tie, which had a pattern of wheat sheaves and small tractors. His neck turned red. Above his mustache, his cheeks and nose also turned red.\n“Why haven’t you joined the Party?” he asked with barely suppressed rage. She had not known that a question could sound so angry. She was afraid he was going to slap her.\nAfter he disappeared, she could not think about her homework. Instead, she went out to the back garden and sat on the bricks, staring at the ivy that grew up the sides of the house. Sometimes sparrows built nests there, among the leaves, and in the mornings, especially, the ivy cheeped and stirred. Last spring, one of the stray cats had brought a baby sparrow in to breakfast and laid it down on the linoleum, like a gift.\nAt first she thought the stray cats were ghosts. They came in the evenings and sat on the bricks in the back garden. She would take them up to her bedroom. After they had stayed in her bedroom for three days, living on milk and chicken left over from the paprikás, they were allowed to stay.\nSometimes they disappeared as mysteriously as they had come. These, she decided, where ghost cats from the streets of Budapest. But others stayed, and during her childhood there were more and more cats, sitting on the sofa, scratching the legs of the dining room table, curling beside her when she slept at night, one on her feet, one at her side, one with his chin on her shoulder, purring into her ear. In the middle of the night, he liked to pull her hair with his claws. She would wake up, and that was when, more often than not, she would see the ghosts.\nAt first, she thought the voice on the telephone was a ghost. “Traitor!” it said. “We’re coming to take your children. Why did you leave your parents? They miss you, your husband misses you. We’ll put you in prison, with rats, and sewer water seeping over the floor!”\nSoon after, they moved to the country. Her brother began a series of collections: stones from the streambed, insects, a selection of rusted nails. He kept them in shoe boxes, in his closet. The insects crawled out. Spiders began to spin webs in the corners of his room. Sometimes they would eat dinner with fireflies crawling over the ceiling. The stray cats kept leaving half-eaten caterpillars on the stairs.\nMore than once, Ilona saw her grandmother, an old woman with short gray hair and delicate wrists. As a girl, she had studied art. Later, she had been forbidden to sell her paintings. They arrived at holidays wrapped around boxes of chocolates. Her mother hung them in every room of the house, even the bathroom. If you stood close, you could still see creases where her mother had ironed the folds.\nShe always appeared as a thin wash, like one of her watercolors of the light over Lake Balaton. Through her, Ilona could see the banister, the dining room table, the swing hanging from an oak tree in the garden.\nOnce, she thought she saw her father standing by the oak tree. He was wearing a uniform, like the train conductor but with a red star on his cap. She thought he looked handsome, but he vanished quickly.\nThere is something I have forgotten to tell you. When she was twelve and still living in Washington D.C., day after day for a period of three months she saw tanks driving down the streets. On her way to school, on her way to the dentist. During these months, she could not sleep. She threw up everything but a slice of birthday cake at a party for a girl from school. She lost weight and developed dark circles under her eyes. Her mother took her to the doctor. She began to believe she was turning into a ghost.\nYou are angry with me. You say, this is not a story. It is merely a series of scenes, and of manufactured scenes at that. Your name is not Ilona. You never saw your mother’s ghosts.\nAnd of course you are right. When Ilona was seventeen, her mother died of breast cancer. After that, she never saw ghosts. Her brother grew up to be a famous entomologist. He is now a professor at Harvard. She grew up to be a writer, but not of stories. She writes about art, and sometimes architecture. She would never write this story, so I am writing it for her.\nMy mother did not die. Last year, she finished law school. My brother, a computer programmer, went to her graduation. They live by the ocean in California, where it is always sunny.\nI rarely see them. I am haunted by ghosts, invisible, impalpable: the ghosts of silver spoons and margarine tubs, the smell of paprikás cooking on Sunday afternoons. The ghost of a country.\nSometimes, in my Boston apartment, I see her: the ghost of my mother, walking along the hallway, running her fingers over the piano. I see her from the back, wearing a dress with light blue and white checks. She made us both dresses out of that fabric, in Brussels. Once, a policeman stopped to ask me, with a wink, if I liked taking walks with my older sister.\nWhen I see her, she is always walking away from me. And her back tells me, some things you can’t understand, even by writing about them.\nOriginally published in: The Rose in Twelve Petals and Other Stories , Small Beer Press, 2004\nTheodora Goss's publications include the short story collection In the Forest of Forgetting (2006); Interfictions (2007), a short story anthology coedited with Delia Sherman; Voices from Fairyland (2008), a poetry anthology with critical essays and a selection of her own poems; and The Thorn and the Blossom (2012), a novella in a two-sided accordion format. She has been a finalist for the Nebula, Crawford, Locus, and Mythopoeic Awards, and on the Tiptree Award Honor List. She has won the World Fantasy and Rhysling Awards.", "source": "https://clarkesworldmagazine.com/goss_08_08/", "source-hostname": "Clarkesworld Magazine", "excerpt": "Clarkesworld Science Fiction and Fantasy Magazine and Podcast. This page: Her Mother's Ghosts by Theodora Goss"}